{
 "title": "Muddled Relaxation and Heightened Awareness",
 "author": "860",
 "citation": " 860. \"Muddled Relaxation and Heightened Awareness: experience with Cytisus scoparius (ID 4111)\". Erowid.org. Dec 26, 2001. erowid.org/exp/4111",
 "substance": "Cytisus scoparius",
 "bodyweight": "162 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Cytisus scoparius",
  "(extract)"
 ],
 "report": "<p>I recently procured 25 grams of Cytisus scoparius (Scotch Broom) tops.  These are supposed to produce feelings of relaxation when smoked, followed by increased alertness.  About a week ago I rolled a couple of cigarettes out of the stuff, about 3 grams per cigarette, then went outside and sat down to smoke them and enjoy the sunny weather. I am not a regular smoker and I found the smoke quite harsh; after one cigarette I wasn't feeling much so I decided to save my lungs and stop.  A couple of minutes after smoking the cigarette I thought I felt more relaxed, but the sensation was very slight.  I decided this plant wasn't worth the trouble and left the remaining 22g in my desk.</p><p>While in the store yesterday I saw a cheap hotplate and it occured to me to try an extraction on the broom tops.  I picked up the hotplate, then went back to my dorm to begin.  I mixed the broom tops with about a cup of hot water, shook the mixture, then let it sit for about 5 hours.  I then filtered out the plant matter and saved the liquid.  I repeated the procedure with another cup of hot water, letting the stuff soak overnight.  The next day I combined the liquids in a small frying pan and gently boiled them on the hotplate.  The boiling liquid gave off a fairly strong, pleasant  smell, similar to spiced tea.  After about 45 min of boiling the extracted substances started to come out of the water, and I was finished in an hour.  I was left with a brown powdery substance held together by clear crystals, and a nearly black tar.  I scraped both off the pan and rolled them into a sticky ball of about 1.5 grams. I left this to dry for 2 hours.</p><p>After constructing a makeshift pipe from an aluminum can, I broke off about a third of the ball and smoked it.  It didn't smoke very well, but the smoke was much less harsh.  It took me maybe 10 hits to get the stuff down to white ash, and I had to pull the lighter flame down onto it to get it to burn.  I held each hit for 20 seconds.  About half way through I was feeling pleasantly relaxed, and around the 7th hit I felt very mild euphoria.  On the negative side, my head hurt a little and it was difficult to concentrate.  The relaxation was strongest the hour after I smoked the extract, and gradually tapered off over the course of 4 hours, near the end of which I felt more tired then relaxed.  I took a short walk during this time, and when I got back my head hurt considerably worse for about 5 minutes. </p><p>I was attending a church service when the relaxation wore off, and while I didn't feel more lively or awake, I found that my thoughts were quite clear and visual details stood out a little more than normal, enabling me to comprehend what was going on in the service more effectively.  This heightened awareness  lasted approximately 45 minutes, and I now feel normal.</p><p>My experience with the extract was enjoyable overall, but in the future I will take some asprin beforehand to help with the headache, and I will smoke more in the hopes of increasing the euphoric effects.  The state of heightened awareness at the end was interesting and I would like to just skip to that part, but it might only be an illusion created by contrast with the slightly muddled relaxation that preceded it.  I would not recommend smoking unprepared broom tops unless you use a water pipe or your lungs are already leathery from tobacco or weed.  I also wouldn't recommend smoking it before you have to go out and do anything.</p>",
 "year": "2000",
 "id": "4111",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-26T08:00:00.000Z",
 "views": "24107",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cytisus scoparius",
   "form": "(extract)"
  }
 }
}
