{
 "id": 4112,
 "title": "Setting is Key",
 "date": {
  "submission": "2003-10-27T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Gnostikoi",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  }
 ],
 "report": [
  "I would be the first person to agree that 5-MeO-DMT is NOT a party drug, but last night alcohol and the excitement of making new friends got the better of my judgment.  I actually ended up at this party because it was going on in the apartment directly above me, and I went up to ask them to turn the music down; in other words, these were people that I had just met.  They seemed very cool, though, and one of them who I'll call J. expressed some interest in tripping, so I went downstairs and brought back my supply of 5-MeO-DMT.",
  "J. and I smoked several consecutive doses of about 5-10mg each.  What was really surprising about it was that it did not affect me the way that it usually does - generally with 5-MeO-DMT I'm layed out on the floor, lost in my own world, but the effect of setting was so strong in this case that I remained sitting in a chair, drinking a beer and talking, during the peaks.  This is something that I would have thought was impossible previously.  J.  actually smoked far more than I did, although always in 5-10mg doses - I would estimate that he smoked around 40mg over the period of an hour, and he never once became nonresponsive or even lost his cool, although he did state repeatedly 'I've never been so high in my life'.",
  "By comparison, the only other time I've used 5-MeO-DMT in a group setting, we prepared for it carefully.  We put on soothing music, lit candles, and we each meditated before we took our doses (which were 5mg, one dose each for the night).  On that occasion, everyone present had what they would describe as a mystical, spiritual experience.  Our experiences that night were more of the flat-on-your-back, staring-at-the-ceiling, gripping-your-ego-for-dear-life variety, in spite of the fact that the dosages were lower.",
  "I think this illustrates very clearly the effect of the infamous set and setting on 5-MeO-DMT...my theory as to why J. was able to smoke so much of the drug without becoming nonresponsive is that he had never heard of 5-MeO-DMT before, and I had described it only in the most general terms, so he did not have expectations about what it was going to do to him.  In the case of myself, it wasn't quite as much of a miracle because I didn't use as much as J. did, but the fact remains that I was able to 'maintain' in a way I never thought possible on this substance. ",
  "The downside to this was that 5-MeO-DMT has always been a rather sacred experience for me, and in treating the substance in this manner that was lost, at least for last night.  I'm hoping that when I use it again I will be able to recapture that sense of mystical wonder that generally accompanies my experiences on it.  It's one of my favorite substances, and I hope I haven't ruined it's magic for myself. ",
  "one other quick comment - although J. seemed to enjoy it very much, and asked repeatedly for more until I finally took it back downstairs because I was worried that he was going to have a seizure or something, when some time had passed and we had both come down, he told me 'That stuff is garbage.  You should throw it in the river.'   Apparently he came down pretty hard, but on the other hand he was also fairly drunk (or had been, earlier) and so it's likely that he was experiencing some depression from the comedown."
 ],
 "erowid": {
  "id": "27893",
  "citation": " Gnostikoi. \"Setting is Key: experience with 5-MeO-DMT (ID 27893)\". Erowid.org. Oct 27, 2003. erowid.org/exp/27893",
  "substance": "5-MeO-DMT",
  "views": "17809"
 }
}
