{
 "id": 4115,
 "title": "Help, My Husband is Trying to Kill Me",
 "date": {
  "submission": "2003-11-06T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "CJ",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(freebase)"
  }
 ],
 "report": [
  "I have been using cocaine off and on and off for over 20 years.  You would say I used it on a recrerational basis.  Then, in 1988 I scored some coke for a friend of mine.  When I laid out some lines, she said oh I don't whiff it, I smoke it.  I told her that I have never done that and didn't want too.  Time went on, until one time I finally smoked it.  And the time the mindset was weak, I was in a failing marriage, my job wasn't going well, and living with an verbally abusive husband.  I smoked it, it was a big mistake... I smoked it for the next 3 years, on a daily basis...",
  "I divorced and remarried.  My second husband also smoked cocaine but his drug was speed.  So we would mix both drugs on a daily basis.",
  "Drugs was destroying this relationship, and I was very depressed, confused and physically worn out. ",
  "The psychosis didn't come on all at once.  It was creeping in on me.  For about a week before 'I lost it' I was in full paranoia .. from thinking my husband was trying to kill me, to a large part of the people of the world was part of it, included the police that arrested me.  Don't ever call the police if you think your husband is trying to kill you.... They arrested me.  The first time I was arrested they took me to the Hospital - the mental ward a 72 hour hold.  The second time to Jail (I had a warrant).  For 3 days in jail, I was delusional, paranoid, heard voices for days straight, talked to the voices, I was totally out of reality.  I remember a lot, and at the time the 'things that I thought' seem very true to me..",
  "After 3 days in jail, I was released.  For the next week I felt shaky, scared, weak, and slightly paranoid.. I felt so scared that I had to get away (from my husband) so I checked my self in to a rehab.  For the next 7 days in rehab, I looked over my shoulder, out of fear that someone was going to hurt me. ",
  "The last time I used any drugs was a few days before going in to Jail. ",
  "I look back, and I am lucky...I was stuck in a paranoia, delisional state of mind for a solid 3 days.. then felt the after affects for weeks.",
  "I have been cleaned since that day I was arrested.  I have 2 1/2 years clean. ",
  "I will never forget my days of psychosis, they seem so real..Somedays I asks myself were they real or not?  But, I'm the lucky one I know that my mind thought that they were real... 2 1/2 years later, every now and then, I still look over my shoulder.",
  "I'm currently studying to be a drug and alochol counselor. ",
  "Learning about psychosis.",
  "Thank you",
  "CJ"
 ],
 "erowid": {
  "id": "27907",
  "citation": " CJ. \"Help, My Husband is Trying to Kill Me: experience with Crack (ID 27907)\". Erowid.org. Nov 6, 2003. erowid.org/exp/27907",
  "substance": "Crack",
  "views": "47607"
 }
}
