{
 "title": "Mischt es Nicht!",
 "author": "brainbug",
 "citation": " brainbug. \"Mischt es Nicht!: experience with 1,4-Butandiol & Amphetamines (ID 41191)\". Erowid.org. Jun 28, 2007. erowid.org/exp/41191",
 "substance": "1,4-Butandiol & Amphetamines",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   " ",
   "insufflated",
   "Amphetamines",
   "",
   "",
   "3 tsp",
   "oral",
   "1,4-Butanediol",
   "(liquid)",
   "",
   " ",
   "oral",
   "Pharms - Perazine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "41191",
   "Male",
   "",
   "Not Given",
   "Jun 28, 2007",
   "12868",
   " "
  ]
 ],
 "report": "<p>Ich mach es kurz, sonst krieg ichs nicht auf die reihe, einen lesbaren report zu verfassen.</p><p>Am 28. 5. 2004 hab ich bei einem freund eine nase speed gezogen und dazu ungefhr 3 teelffel butandiol geschluckt. Den ganzen abend ber war alles sehr lustig, speed und butandiol schienen sich gut zu ergnzen. Irgendwann bin ich dann bei einem anderen freund auf dem sofa eingeschlafen. Am nchsten morgen bin ich aufgewacht um dann festzustellen, das ich in der nacht gekotzt hatte und etwas davon in die atemwege gekriegt hab, was zu einer blen lungenentzndung gefhrt hat (wahrscheinlich kann ich froh sein, dass ich in der nacht nicht erstickt bin!). Die nchsten zwei nchte konnte ich berhaupt nicht schlafen und hab mich die ganze zeit lang extrem krank und verkatert gefhlt, konnte mich nicht konzentrieren und hab bei jeder noch so kleinen anstrengung einen schweissausbruch gekriegt. Als ich dann endlich mde wurde und dachte, jetzt einschlafen zu knnen, kam in mir ein gefhl hoch, als htte ich z.b. Pilze oder acid genommen und als wrde ich auf diesen auf einen schlechten trip kommen (so als text sieht das sehr harmlos aus, es war aber der absolute horror, von null auf hundert auf einen trip zu kommen und dabei physisch auch noch vllig fertig zu sein). </p><p>Das ging die ganze nacht so weiter, bis ich es nicht mehr ausgehalten hab und in die kinder-und-jugendpsychiatrie (ich war damals 19) unserer stadt gegangen bin. Dort gab man mir atosil (ein neuroleptikum), woraufhin ich endlich ca. 8 stunden geschlafen hab. Am nchsten tag wurde ich schon wieder entlasse, die rzte waren davon ausgegangen, ich sei nur noch nicht richtig vom speed runtergekommen, was sich als fehleinschtzung erwies. </p><p>Jetzt, mehr als ein halbes jahr danach, bin ich in neurologischer behandlung und nehme taxilan (ebenfalls ein neuroleptikum) gegen panikattacken und unruhezustnde, die ,ich seitdem des fteren plagen. Alles in allem wird es seitdem stetig besser, trotzdem ist es verdammt hart. Meine psychische belastbarkeit ist absolut am ende, nach ein paar stunden arbeit bin ich so fertig, als htte ich ein paar nchte durchgemacht. Auch kann ich seitdem nicht mehr kiffen, thc schickt mich mittlerweile auf einen krassen trip, ebenso koffein.</p><p>Meine bitte an euch: wenn ihr butandiol nehmt, mischt es mit keiner anderen droge, es kann tierisch schiefgehen. Zu allem bel hat die medizin auch noch keine ahnung, wie 1,4-bd in kombination mit anderen stoffen wirkt, so dass die medikation bei etwaigen unfllen ein absolutes glcksspiel ist. Machts gut & denkt drber nach,</p><p>Brainbug</p>"
}
