{
 "id": 4121,
 "title": "Relaxing, Strange Visual Effects!?",
 "date": {
  "submission": "2004-02-10T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Moso",
  "gender": "Male",
  "weight": "185 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 3:00",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 12:00",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Upon initial dose (300mg) no effect was noticed, however after the second dose (300mg approx 2 hrs later) there was a definite increase in social activity while making even the most uncomfortable position feel like sitting on my favorite chair.",
  "Third dose (300mg) was taken about 3 hrs later about 1.5 hours before sleepytime which resulted in about 8 hrs of sleeping 'like a rock' as my fiance would say.",
  "The next morning there was a bit of a zombie floaty feeling but not much other after-effect.  Just after waking up, the first dose of the day was 600mg which produced extremely hightened social activity as well as a bit of a visual 'trip' which came and went about every 15min or so and never lasted more than a half an hour.  These effects lasted most of the day (approx 8 to 10 hrs) and trickled off just about the time i was getting ready for bed.",
  "Next morning I felt great, well rested, didn't seem to have any after effects.",
  "*all doses taken with cola which seems to help expedite the absorbtion process."
 ],
 "erowid": {
  "id": "27921",
  "citation": " Moso. \"Relaxing, Strange Visual Effects!?: experience with Gabapentin (Neurontin) (ID 27921)\". Erowid.org. Feb 10, 2004. erowid.org/exp/27921",
  "substance": "Gabapentin (Neurontin)",
  "views": "38317"
 }
}
