{
 "id": 4124,
 "title": "Trying to Get Back Control",
 "date": {
  "submission": "2007-03-29T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Dc",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Alcohol"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Amphetamines"
  }
 ],
 "report": [
  "I'm writing this in hopes that it allows me to do what I'm suggesting that you do.  I'm using it as a tool to help me get back control in my life which I've recently lost.",
  "My first experience with mdma was 3 years ago.  I had never done any drug before except drinking if you would consider that a drug.  I had been so curious about mdma that I had researched it for more than six months before trying it.  I knew that the drug could be done safely and before I did it I said I would never do more than 250mg at once and would never do it more than once every six months.  I sent my pills to dancesafe so I knew exactly what was in them and how many mgs they were.  That first night was absolutely incredible; nothing short of life altering.  Afterwords I remember feeling extremely sorry for anyone who ever went through their life without feeling like that at least once.  Even after the events that have transpired I still feel this way.",
  "I continued doing mdma safely every six months for the next 2 years.  It was something I looked forward to more than anything else.  I had the exact day marked on my calendar and it was more important than Christmas.",
  "I'm still trying to figure out exactly where things started falling apart.  I started dating a girl that rolled a lot and I impressed upon her the idea that I did it in moderation, not every weekend.  Slowly I gave in... 3 months instead of 6, then 2, then 1.  We stopped dating, but my pattern had already been changed.",
  "At the beginning of this summer I made one of the biggest mistakes I could ever imagine.  I bought a large quantity of pills because it was cheaper that way, imagining that it would save me money and I wouldn't have to go looking for pills again for at least a year.  I was with people who loved to roll all the time.  I know the exact night that I crossed the point of no return.  I had five pills that night/morning, eating two at first then snorting 3 as the night/morning went on.  I remember being at my pool at noon by myself rolling my face off.  I've never rolled the same way since that night.  I woke up the day after thinking what the hell had I just done, fully regretting it, but that didn't stop me.",
  "As the summer was already halfway over I had no problem justifying it to myself that I was rolling all the time as kind of an end of summer blow out and that it would all stop at the end of summer.  At the end of summer I found new excuses to justify it to myself that I could roll whenever I wanted to.  There have been weeks that I've rolled 3 times, eating/snorting up to 3 pills, then going to work the next day.  It destroyed my imune system so much I got pnemonia.  Three days after stopping the antibiotics I rolled again.  After that I started to realize what I've done.  Rolling isn't even the same for me anymore.",
  "I take Adderall for ADD, so when I went to a rave I decided I would take Adderall instead to keep me awake, and just get drunk.  I immidiately noticed that if I got drunk and took around 40 mg of Adderall I could make myself feel like I was rolling.  This was a great thing, except at the end of the night when everyone was rolling it just made me want it more.  So now I'm drunk, on 40 mg of Adderall or more, and rolling.  This was not what I had intended, however especially when I'm drunk I don't have the willpower.",
  "Today is October 28th.  The last time I rolled was last friday, I was able to fight it off until I finally ate one at 4am.  In three days it's halloween, on a friday none the less.  I know I'll be at a place that's been called the number one club in the country with an incredible DJ spinning.  I know just about everyone I know will be rolling.  Any I don't know what I'll do.  I don't know if I'll be able to fight that little voice in my head that says 'It's halloween!  Just one more time!  After this night we'll stop...'  So this friday I'll battle my deamons and maybe I'll win.  Moderations is the key.",
  "The really, really bad thing about all this is my biggest regret isn't that I've seriously hurt myself or that I'll have depression when I'm older.  The thing I regret the most is that I might not ever be able to have a great roll again.  For me, Christmas may never come.  That's what scares me the most."
 ],
 "erowid": {
  "id": "27937",
  "citation": " Dc. \"Trying to Get Back Control: experience with MDMA, Amphetamines & Alcohol (ID 27937)\". Erowid.org. Mar 29, 2007. erowid.org/exp/27937",
  "substance": "MDMA, Amphetamines & Alcohol",
  "views": "5746"
 }
}
