{
 "title": "Meanwhile...",
 "author": "Sans God",
 "citation": " Sans God. \"Meanwhile...: experience with Ecstasy (ID 4126)\". Erowid.org. Dec 9, 2000. erowid.org/exp/4126",
 "substance": "Ecstasy",
 "bodyweight": "130 lb",
 "report": [
  "<p>Initially, the first two times that I tried Ecstacy, it was a flash of emotion and sensation, and then I remember being let down as I began to feel the fading of peak. ",
  "A friend and I went downtown one Friday evening, and stopped by an outdoors rave-type thing that was being held in a park.  We got out of the car, and walked up, and just looked at the people laying around on the ground, getting backrubs, having their hair brushed, things like that; very touchy-feely things.  My friend spotted a guy that she knew from a while back, and found out that he had some E for sale.  I bought two pills, one for her, and one for myself.   We took them, and within about an hour we could barely walk straight.  To this day, I think this was the 'best' roll I've ever had.  This was my third time doing E. ",
  "What made this the 'best' was my surroundings.  The people that I was around.. This was my first time doing E in an environment with many people.  My past two experiences were with my then-boyfriend.  This experience really helped me to understand how this drug can bring people together, and help people talk.  I remember loving how I felt; loving how I felt so accepted.  My surrounds were almost surreal; I was walking around in my bare feet, with the dewy grass below my feet.  There was a beautiful fountain in the embankment of this park, with lights under the rapidly running water.  This took place in mid March, so everything was still newly green.  The night was cool, and there were so many smiling faces around me.  I remember feeling the music pulsating through me, actually feeling like it was coursing through my veins.  I met a lot of new people that night, and I kept in touch with them by going to this event every Friday until I had to move.",
  "However, along with going to this event every Friday, it became frighteningly convenient to use E every weekend.  So I did.  Always only 1 pill, but twice during this three month period, I mixed with acid, which was phenomenal, giving me the edge and grit of LSD but the mellow, energetic feeling of Ecstacy.  All of these experiences were basically on the same sensation level; all pretty intense.   ",
  "I moved from Georgia to Florida in late May.  From late May until late July, I didn't use E, because I was living with my mother, without a job, so I had no funding to buy any even if I had wanted to.   In late July, I moved into my own apartment, with my own money, and so I started going out each weekend again.  I started using E every weekend again, occasionally doing 2 pills at a time.  This continued until late October. ",
  "I voluntarily curbed my E use.  I could begin to see that each time I used it, it was less and less exciting; not so novel.  Once, I brought a disposable camera to the club that I went to.  That night, I took two pills of E.   I took every picture in that roll of film, and had it developed the next day.  I was scared when I looked at the pictures, because I didn't remember taking over half of them.  When I remember that night, all I remember is a slideshow of what happened.  I remember being in one place one moment, and wondering how I got to the next memory.  This made me realize that I had been doing too much E, and wasn't even enjoying it anymore, at least not to the extent that I had been. ",
  "I've done E maybe twice since I had this realization, and both times were nice, of course, but could never compare to the first 1-5 times I did it.",
  "This may be irrelevant, but my emotions are twice as intense as they used to be now, especially sadness.  I don't get sad for no reason, but when I am down, I feel it more intensely.  When I'm happy, I'm just happy, but when I'm depressed/sad, I'm REALLY depressed/sad.   This didn't happen before I started using E, that I remember. ",
  "I also just want to say thank you for providing such an informative web site, because the only way to use drugs is in an informed manner.  Thanks again for advocating education!</p>"
 ],
 "year": "2000",
 "id": "4126",
 "gender": "Female",
 "views": "13549",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2000-12-09T08:00:00.000Z"
}
