{
 "title": "Productivity with Multiple Sclerosis",
 "author": "Pauli",
 "citation": " Pauli. \"Productivity with Multiple Sclerosis: experience with Modafinil (Provigil) (ID 41277)\". Erowid.org. May 1, 2006. erowid.org/exp/41277",
 "substance": "Modafinil (Provigil)",
 "bodyweight": "185 lb",
 "header": [
  "DOSE:",
  "100 mg",
  "oral",
  "Modafinil",
  "(pill / tablet)",
  "",
  " ",
  "oral",
  "Caffeine",
  "(daily)"
 ],
 "report": "<p>I was diagnosed with MS about 2 years ago. MS itself is a lot like a drug trip; my nervous system is in constant flux, I never know when I might see or hear weird things, feel strange bodily sensations, etc. I have previously done large doses of LSD (back in the early 90's I lived in Berkeley for college), ecstasy when I can get it. Tried a few stimulants (amphetamines and coke). I've always been more of a hallucinogen person.</p><p>Anyway, fatigue is a syptom of MS. It's not normal sleepiness, though...It's like being stoned, a little. I can't concentrate (don't really want to concentrate?) ..attention span is reduced to about 30 seconds in the worst case. I asked my Dr. for provigil (another side note: I kept asking myself why I had to get a disease with no good drugs! I'd kill for a re-fillable preseciption of diazepam!). Anyway.....I was in the process of finishing my PhD in statistics at that time, and was really bummed out by my lack of enthusiasm and concentration for what had once been a really cool thing for me. Provigil changed that right away.</p><p>I take half a 200mg pill first thing in the morning. I tried the whole pill but it felt to 'speedy' - neck ache and jitteriness. (I still drink coffee out of habit, too). I notice the effects with 1/2 hour.  I work ALL DAY (not an easy thing to do in my job - statistics and data anlysis are, in the end, kind of boring). But I feel motivated and good, focus is amazing. I do not notice any euphoria (wish I did, actually). If i take the pill anytime after about 10am, I have a hard time getting to sleep at night (usually try to turn in about 11). And thats 1/2 a pill (100mg). I do drink quite a bit, too (whiskey), and I notice that the provigil takes away a little of the drowsy aspect of whiskey, so the high is a little different, but not bad. I would not recommend it as a recreational drug.</p>",
 "year": "2005",
 "id": "41277",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-05-01T07:00:00.000Z",
 "views": "9335",
 "dose": {}
}
