{
 "title": "Headache and Failure",
 "author": "Jason",
 "citation": " Jason. \"Headache and Failure: experience with Melatonin (ID 41295)\". Erowid.org. May 31, 2006. erowid.org/exp/41295",
 "substance": "Melatonin",
 "bodyweight": "135 lb",
 "report": "<p>I stopped smoking marijuana about a month ago after a several years of chronic use and I thought the melatonin would be something to try to combat the sleep problems I've had ever since not smoking weed. I was skeptical about it anyway, it being my experience that any drug that isnt illegal or perscription- only isn't worth taking because it's either too weak to effect me or doesnt work at all.</p><p>I took 3mg the first night and withing 30 minutes I felt tired and sleepy but I didnt actually go to sleep untill about 4 hours after I had taken it. I didn't sleep well and woke up in the morning with a mild headache that felt exactly like the headache from a hangover. I usually never have headaches naturally but I didn't blame the melatonin at first. The first night I do remember having a series of bizzare dreams which happened during the periods when I was actually asleep (Not more than 30 minutes at a time) I was also extremely groggy for 2 or 3 hours after I got up, and it took a while for me to get my head straight, though wasn't an unpleasant kind of groggy, such as after being drunk would be.</p><p>I took it again the next night and I did sleep slightly better than before, though without dreaming anything that I can remember. When I woke up I wasn't as groggy as I had been the night before, but this time the headache was much worse and I think it is directly related to the melatonin.</p><p>I did not use any other drugs of any kind during either night, and had been entirely free of any other chemicals for about a week prior. I don't take any other types of vitamins or supplements or whatnot, so as far as I know only melatonin caused these effects.</p><p>I do plan to try it with other drug combinations in the future as it may have some potential. I felt less well- rested on both occasions than I would from sleeping normally, and the headaches and groggy lethargic feeling afterwards is not worth it to me.</p>",
 "year": "2005",
 "id": "41295",
 "gender": "Male",
 "timestamp": "2006-05-31T07:00:00.000Z",
 "views": "13484",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  }
 ]
}
