{
 "title": "Mildly Lame",
 "author": "Pevans",
 "citation": " Pevans. \"Mildly Lame: experience with Salvia divinorum (ID 41302)\". Erowid.org. Jul 14, 2008. erowid.org/exp/41302",
 "substance": "Salvia divinorum",
 "bodyweight": "140 lb",
 "report": "<p>My friends and I are marijuana smokers, we are all about 18-19.</p><p>As a legal alternative another friend of mine suggested Salvia Divinorum. I myself did alot of reading on the subject. I found many reports of people have intense and uncontrollable experiences and vivid hallucinations. My friend 'T' and I had thought about using psychoactives for awhile before this, mainly thinking about shrooms. Unfortunately where we live they are next to impossible to get for some reason, and we really didn't know that many dealers for anything besides marijuana. I suppose the reason is that the people we knew weren't really dealers but just grew their own stash, and were willing to smoke us up or sell us some at a discount, since it wasn't a business to them. Anyway off topic.</p><p>We ordered about 3 grams I believe of Salvia, of the Green Rating (the weakest variety). There were three of us in my room at home when we decided to smoke it. We had rented three trippin movies (Fear and Loathing, SLC Punk, and Friday) and settled down to watch them with the lights down low and smoke. My friend 'T' went first while I offered to sit for them first since it was my house and mty friends salvia. After his first hit he stood up, gave me a stupid grin and leaned against the wall, then sllowwly dropped to the floor. Wow, I said to myself. He was babbling and I couldn't understand him, but I just got him onto the couch sitting down. He would tell me later that he felt like he was melting into the floor for about 30 seconds.</p><p>My other friend smoked a bowl and calmly lied down on my bed which is just a mattress on the floor. I asked if he felt anything and he said no completely soberly. So much for that. I waited ten minutes and since nothing incredible was happening with my friends I decided it was my turn to smoke.</p><p>We were using a regular tabacco pipe half-stuffed with flavored tabacco, with the salvia sprinkled in a pinch on top. I lit the Salvia and kept the flame directly on it like it said to for maximum effect while breathing in. I couldn't hold it, the smoke felt like damp, wet smoke in my lungs and I had to cough even after just 3 seconds. I tried three times and couldn't hold it.</p><p>As far as effects from that I felt kind of weird. Mainly just a body high, things looked intense, and I was interested in simple things. But that just felt like weed without the feeling of happiness. This lasted for about 5 minutes. I was really disappointed. No visions, no journey. I was mildly pissed and I did something I probably shouldn't have: I stuffed a bowl full of Salvia and smoked the whole thing.</p><p>It still felt like week old watery tasting smoke in my lungs, not exactly pleasant, but I was immediately knocked of my feet. The next ten minutes I had no control over myself. I started dancing a little bit and slapping my friend on the head, I have no idea why. Not in a mean way just playing. But I still wasn't TRIPPING, just high. I've had more trippy experiences from marijuana.</p><p>After about ten minutes I started to get really introverted. Whereas before I had been outgoing and happy now I felt indrawn and a little pissy. 'T' and I were just sitting watching TV while my other friend played video games in the background. I could hear all the noise bombarding me and I got really pissy, I just wanted the noise to stop. It wasn't even loud but it was bothering me. I was pissed at my friends for making the noise but I didn't say anything. This was obviously the Salvia putting me in this mood which is odd because the reports I read said it made you feel happy and 'loved'. Eventually we fell asleep, and I didn't see any trippy visuals other than some distorting that I would have had with a good high. The salvia had no emotional effect on my other than making me pissed at all the noise.</p><p>To cap off, to me it wasn't really worth it. It was foul tasting and didn't do much for me. I have smoked alot more of it since and every time I have less desire to do it again. Mostly I do it by myself and it definately didn't make me feel good about myself, I just kind of spaced out for a long time and that was it. Although I have written some fine poetry under the influence of the green goddess. Other than that it seems pretty quick and harmless, at least from my experience.</p>",
 "year": "2005",
 "id": "41302",
 "gender": "Male",
 "timestamp": "2008-07-14T07:00:00.000Z",
 "views": "2842",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(plant material)"
  }
 ]
}
