{
 "title": "My Psychotic Episode",
 "author": "Oblivion",
 "citation": " Oblivion. \"My Psychotic Episode: experience with Olanzapine (ID 41305)\". Erowid.org. Mar 6, 2007. erowid.org/exp/41305",
 "substance": "Olanzapine",
 "bodyweight": "169 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "oral",
  "Pharms - Olanzapine",
  "(daily)"
 ],
 "report": "<p>I have been using 10mg Olanzapine a day following a psychotic episode brought on by a few bad acid and ecstasy trips that happened over a year ago now. Since then, I have been slowly working towards reintegrating myself back into normal life, and it has to be said that the Olanzapine has helped a lot.</p><p>It all started after a few bad acid trips, but, not wanting to be disparaged from something that a lot of other people seem to consider a great and mind opening thing, decided to persist with hallucinogenic drugs - something which, looking back, was probably not the wisest idea.</p><p>I started becoming very intense around everyone I met, not yet in an intolerable way, but in a 'you need to chill out man' sort of way. My ego was also getting a bit out of hand, but that was of little concern - what was of concern was that I was becoming increasingly incapable of handling relaxed situations.</p><p>After a while I could no longer handle taking ecstacy any more, without feeling that the entire club knew who I was. I could no longer function on weed, speed made me tired and I was starting to require alcohol every day just to keep the paranoia at bay. The only drugs that didn't give me a sense of nuclear paranoia were cocaine and valium, both of which I had a feeling it would be a bad idea to get into a habit of taking considering my mental state at the time.</p><p>But then it got worse. I decided to take mushrooms one night with a few friends, thinking the worst was over - oh no. When I got back to the flat I had this terrible feeling of dread, that no amount of alcohol would make go away, so I decided to go to bed instead. I suddenly heard a loud voice, which I knew was in my head, saying to me 'TONIGHT, YOU ARE GOING TO DIE'. Naturally, I was quite disappointed - I had always forseen living quite a bit past 20, but then it continued, '...AND YOU'RE GOING TO HELL'.</p><p>That was it, I had to leave the flat and seriously rethink my life. While I was having this heavy discussion with myself, one of my friends called to see what this was up to. Taking this as a sign, I decided to go round and visit them. When I got back to the flat, my crazy flatmates had kicked a hole in one of the doors in the flat and done something unspeakable in the kitchen - not something you wanna have to deal with with a head full of mushrooms.</p><p>The same thing happened again when I took mushrooms a couple of weeks later - a demon from hell was gonna come and kill me and take me to the dark side. This time it didn't concern me so much and I just went down stairs where people were drinking tea.</p><p>After that I (finally) decided trippy drugs were not for me and that stopping drinking for a few days would 'totally sort me out'. Unfortunately, this was not the case - I had to quit my job at a call centre because all the calls were freaking me out, we got evicted from the flat because we were refusing to pay rent because the place was such a mess, I was getting no work done at uni and I could not focus on anything.</p><p>We moved to a new flat, but by this time I could not walk down the street without the feeling my presence could be felt within a two mile radius. I did training for new bar that was opening up, but got fired on the opening night before the place had actually opened - the manager did not give me a reason. By this time I was convinced that my life was in serious danger - totally irrelevant experiences from my past kept flashing before my eyes and alcohol was becoming a total necessity rather than a luxury.</p><p>This continued until towards the end of 2003 when I was starting to believe that the world was going to end at new year 2004, that I was on a mission from God and that a demon was trying to suck out my soul to stop me - listening to myself, I decided that people who think like this generally require help. I figured that whatever psychiatrist I saw would be God in human form and that (s)he would tell me what to do.</p><p>Nothing happened at new year 2004, except that my level of paranoia had grown so great that the majority of my friends no longer wanted to talk to me. I spent new years day in my room scrawling on an old envelope and couldn't talk to my family. It was probably the worst day I will ever have in my life.</p><p>I saw the psychiatrist a few days later and he told me I was suffering from a 'drug induced psychosis' and prescribed me some risperidone. Almost immediately, I felt my thoughts actually starting to reconnect again, but risperidone causes horrible muscle tension so the psychiatrist changed my prescription to Olanzapine instead.</p><p>Olanzapine as a drug has no noticeable effects, apart from the fact that it makes me really hungry (I've gained about 15-20lbs since I started taking it, although I also no longer take ecstacy every week) and really tired, but not in a valium sort of way, more in a 'I can't keep my eyes open' sort of way. However, when I forget to take it, I notice myself drifting back to my alternative reality again, which just ain't fun.</p><p>15 months after starting the Olanzapine, I can interact with the real world to a much greater extent, I am doing an art course (one good thing about a psychotic episode is that it does brilliant things for my creativity), although I do still like to have the music playing a bit louder and faster than the rest of the room do, so to speak.</p><p>Overall, I gotta say that when it comes to 'mind opening' drugs, even though a lot of my friends still take them, the advice has to be 'stay away from the flipside'. I am finding refinding my sanity to be a far more satisfying and rewarding experience than any psychoactive.</p>",
 "year": "1998",
 "id": "41305",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-06T08:00:00.000Z",
 "views": "21187",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Olanzapine",
   "form": "(daily)"
  }
 }
}
