{
 "title": "The Jetsons, Delirium, and Memory Enhancement",
 "author": "Johnny Blaze",
 "citation": " Johnny Blaze. \"The Jetsons, Delirium, and Memory Enhancement: experience with Mushrooms - P. Cubensis & Cannabis (ID 41314)\". Erowid.org. Jul 22, 2007. erowid.org/exp/41314",
 "substance": "Mushrooms - P. Cubensis & Cannabis",
 "bodyweight": "185 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "Mushrooms - P. cubensis",
  "(fresh)",
  "",
  " repeated",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)",
  "",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>[Erowid Note: Though the dose of fresh mushrooms in this report is unclear, the addition of 10 grams of dried mushrooms makes this an extremely high dose, see Mushroom Dose Chart]</p><p>It all started one beautiful Friday night. The weather was great, as was my mood. I was going to sell a half ounce of shrooms to a couple of my friends, Betty and Juanita, then I was going to hang out with Betty's brother Chance, and we were going to an old friend of mine's house. Betty, Juanita and Chance all arrived at my house around 7 o' clock. They were trading in some fresh mushrooms I had sold them the night before but took care of them poorly and was worried of them getting old and unusable for some dry mushrooms that they could also weigh more accurately. I wasn't really sure how many fresh ones I had given them, as I didn't really feel like taking the time to weigh out fresh shrooms, so I just gave them a normal paper bag full of fresh shrooms.</p><p>Well, after that business was taken care of, we smoked a joint and began the evening. I was riding in the back of Juanita's truck and like I said before, it was a beautiful evening. I had the fresh shrooms with me as I prefer them to the dry ones and I didn't want to see them go to waste, as well as another ounce of dry shrooms to try to get rid of and make some money during the night. I started munching on the fresh ones in the back of the truck on the way to the spot. I also had to meet some people to get rid of another half at a local gas station.</p><p>T:00.30 When that was done, we shortly arrived at my old friend Brod's house. Brody is a crazy motherfucker. I've seen him get trashed and start fights with an entire party and only calmed down when the neighbor came over and put him back in his place. When we arrived he was, ironically, just coming down from a shroom trip but, didn't have the desire to do more. It had been about an hour since I ate my shrooms and I still wasn't feeling anything. Although, my friend Chance who had never tripped before, was already feeling his and he ate his after I ate mine.</p><p>Around this time we smoked a few bowls and I ate some more of the fresh shrooms, already done with half of the bag. Looking back on it, I'm sure there was at least a good 3/4 to whole ounce in that bag. Around this time, Betty and Juanita decided to head out as they has other plans to tend to and said they would meet up with us later. I went out to see them leave and smoke a cigarette because of my disappointment of not tripping.</p><p>T:01:30 Chance, Brody and one of Brody's friend's come out to smoke also and we decided to go to the roof of the house to check out the awesome view of the clear starry night. When we got there I was in amazement, I couldnt believe how great of a night it was. Still optimistic, I looked in the bag with the fresh shrooms and saw that the bottom of the bag had gone bad. So I grabbed a bag of the dry ones with 10 grams in it and figured, 'Hey, why not?' I grabbed a few of them and gobbled 'em up. Leaving some for later on tonight. Then, resumed enjoying the night.</p><p>T:02:00 Brody had said something about a baby being in a nearby tree, and continued to talk about the most abstract, strange things. Around this time, I began tripping VERY, VERY hard. It hit me like a ton of bricks. I even started to sweat a little bit, and it was kind of getting chilly. I wasn't scared but, more like startled slightly and nervous. I began to calm down. Talking myself down in my head. Suddenly, Brody's friend, fell off the roof! I was scared at first, but he only fell down to a lower section where he began to climb back up the steep slope. We all began laughing hysterically and soon after, decide to get off the roof and venture around Brody's property to wander and explore the fantastic tripping atmosphere we were in.</p><p>T:02:30 But, first, I had to get down from the roof with the big bag of shrooms I had, which had ripped when we were laughing. This, was a task in itself. I was slightly nervous since, the other side of the roof didn't have a lower section and was a 15 ft. dropoff at least. I crawled slowly down the slope, and soon got down the roof and in the house, which was being built at the time.</p><p>T:03:00 We began to head to a tree that Brody's friend had mistaken as orange during a mushroom trip one time to see what he had been talking about. On the way, we encountered an interestingly patterned cement walkway. It looked like splotches of cement had been dropped on to the walkway from high up and resulted in a webbed like structure that seemed to be growing in every direction. This was absolutely enthralling to me. I walked along the path with my head filling with wonderful thoughts and the usual tangents attached to them while tripping.</p><p>T:03:20 We eventually arrived at the tree, where I could see that it didn't look orange to me, nonetheless, it was a visually stunning sight. It split in two at the base and had a very beautiful bark pattern that seemed to shift amongst it self and warp into other sections of the bark. We exchanged thoughts there and smoked another cigarette. The we head to explore a new area.</p><p>The garage door of the house that was being built. It was composed of equal sized squares all along and smaller squares in them. The seemed to be streching farther and farther away from where I was. We then decide to smoke a joint on the porch. It was about 3-4 ft. tall and very large in size. The river-in-wood effect was taking hold. Brody began insisting that the porch, combined with the lighting had a TV commercial-like atmosphere. We all agree that this is true and relax there and start another conversation.</p><p>T:04:00 Around this time, Betty and Juanita drove up and greeted us. I was slightly taken back by their arrival because I insisted they didn't drive while tripping. Nonetheless, they were not on the seem level as me in the least, with their dosage being around 3 gm a piece. So, I quit badgering and begin to make small talk with the both of them, and shortly after, they join us on the porch, where they also get the commercial feeling, after it was mentioned. Brody and his friend have to go to work in the morning so they hit the sack and me and Chance head to his house, at around 1:30. His grandparents (that he lives with) were still up, and he went to their bedroom and had a word or two with them and headed back into the living room where he told me that we were going to roll a joint in the bathroom, and unfortunately I was the only one who could roll, yet I wanted to smoke.</p><p>T:04:40 It took me a good 10 minutes or so to roll it because I was tripping even harder now than I was earlier and I finished the rest of the 10 g's too. All the while being quiet while wanting to talk. We then went outside and began to smoke. I took a few good hits and started to feel nauseous, almost to the point of vomiting and I felt in no mood to do that so, I told him I didn't want anymore and we sat on the porch swing to smoke a cigarette before ending the night. We talked about the visuals and I asked him how his first trip was. He seemed to be enjoying it. We then went inside and he told me I could watch TV as long as I was quiet in the living room, and he went to his room and we parted ways for the night and it was probably for the best because unknownst to me, I was about to become delerious for a while.</p><p>T:05:00 I plopped down on a comfortable chair and turn on The Jetsons. This was where it got INTENSE. I was watching for about 5 minutes and the I suddenly realized that the show made no sense to me. I could hear what they were saying, yet all meaning attached to these words was gone. Yet, it seemed to be interacting with me and my feelings and spiritually guiding me somewhere. Have you ever seen that episode of the Simpson's where the talking wolf guides Homer to find his soulmate? Well, this was something like that, yet I still had visual contact with the world around me, although everything seemed alien and to have obscure purposes/uses.</p><p>T:05:20 Around this time I closed my eyes and relaxed. Then, I had a complete disconnection with reality for a few moments. I've read that at high doses that memory is enhanced and before this, I never really knew what that meant. It seemed as though EVERY memory I've ever had from birth to my life at that point was played back in my mind in crystal clarity. All in the span of about what seemed like 10 minutes but was probably closer to 20. I suppose it has something to do with serotonin and the way it affects the memory and how psilocybin affects the serotonin system. During this time, I felt my body twitch and shake randomly, yet it didn't frighten me. I also felt a big smile on my face the entire time.</p><p>T:05:50 And somewhere in this coma like state, The Jetsons voices in alien language were going through my head. After that was over, I began to return to reality somewhat and basked in the glorious experience I had just had. I then was very tired and worn out feeling. So, I went to sleep with the TV still on so I could entertain myself.</p><p>In the morning, I felt reborn and slightly disoriented for the first few hours I was awake. And had general upbeat feeling lasting the rest of the day and continuing into the next.</p>",
 "year": "2004",
 "id": "41314",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-22T07:00:00.000Z",
 "views": "3543",
 "dose": {}
}
