{
 "title": "Flying a Little Easier",
 "author": "MD daughter",
 "citation": " MD daughter. \"Flying a Little Easier: experience with Hydrocodone (ID 4132)\". Erowid.org. Mar 6, 2001. erowid.org/exp/4132",
 "substance": "Hydrocodone",
 "bodyweight": "125 lb",
 "report": "<p>I was doing a lot of traveling, and I absolutely hate flying.  It's not that I get scared or anything, I just hate being cramped into those little seats next to large people, breathing recycled air, and barely being able to move.  I knew a little about the effects of Vicodin, so I thought it might make me feel a little more relaxed.</p><p>I took one pill (7.5 mg) about an hour before I boarded the plane, and once I finally did board I was feeling _very_ loose.  As in, I couldn't keep my hands clasped (fingers interlaced) in front of me, my hands would just slide apart because my fingers were too loose.  It was nice, I was relaxed and happy and felt kind of like jelly. </p><p>One thing to note is that I had gotten about 3 hrs of sleep in the past three days combined, so my mental state was already a little messed up.  The vicodin did make me a little sleepier.  I took a second pill about an hour into the flight.  I was trying to read a magazine, and in the beginning I was ok.  Then later on I couldn't focus on teh words, and I know I kept slipping in and out of sleep though I couldn't tell when.  I think I slept most of the latter half of the flight.  When we arrived, after 2 hours, I still felt it.  Got my luggage, got my ride, and promptly conked out in the car, sleeping pretty deeply. </p><p>When I woke up I was pretty disoriented, this was partially lack of sleep and some the pills.  My skin felt a little rubbery and I felt all around a little strange.  Not that bad of an experience, good for flying, definitely.</p>",
 "year": "2000",
 "id": "4132",
 "gender": "Female",
 "timestamp": "2001-03-06T08:00:00.000Z",
 "views": "51786",
 "dose": [
  {
   "time": "0",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:00",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  }
 ]
}
