{
 "title": "Chained to the Fast Lane",
 "author": "beendown2long",
 "citation": " beendown2long. \"Chained to the Fast Lane: experience with Methamphetamine (ID 4134)\". Erowid.org. Dec 25, 2001. erowid.org/exp/4134",
 "substance": "Methamphetamine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Methamphetamine"
  ]
 ],
 "footer": [
  [
   "",
   "4134",
   "Female",
   "",
   "Not Given",
   "Dec 25, 2001",
   "6470",
   " "
  ]
 ],
 "report": "<p>\nI started using meth for energy and the feeling of sexual euphoria it initially gave me during sex.  That was about 9 yrs ago.  I would say that it was really mind expanding and sexually enhancing initially, but now it seems that 'the going up is not really worth the coming down' as the song says.  Speed giveth and then taketh away!  I can stay awake for 30-60 hrs. still, but now i feel totally exhausted, mentally drained, and really hate life for days after I stop 'tweaking'.  Also,  'crank' causes a lot more side affects than it did 5+ years ago--I guess it's made with more poison, or I'm just getting to old for this s--t! It can and often gives me formication, aural hallucinations, blurry vision, and of course stomach problems.  On the plus side, I have kept my weight the same for 10 years and even lost 5-10 lbs-but its not exactly a healthy diet aid.  </p><p>I doubt anything I say would stop a tweaker or someone contemplating usage, but I have to say this drug really is a 'trickster' and it has kept me coming back for more-for nine years.  I do not think I am below average in most ways: I am college educated, single, made over $25,000 last year, have never been arrested, and am not considered or viewed by strangers as a 'tweaker'.  But I Am!  I'm really screwed up and an addict and it's kind of ironic that society doesn't even notice.  If I was a sloppy drunk or homeless junkie it would be obvious, but I'm just a working class 42 yr. women who also happens to be a crank freak!  I look great everyone says--thin, pretty, all my teeth! What a joke-and it's on me..</p><p>So I'm sure there are millions of normal acting/looking crank freaks just like me all over America, bored, overworked, chained to the fast lane of our lives and drug.  We're Everywhere....This is epidemic, and society will hear us roar, perhaps too late.  For my part, I need a new drug...or not...</p>"
}
