{
 "title": "Withdrawal Trials",
 "author": "BJ and the Ninja",
 "citation": " BJ and the Ninja. \"Withdrawal Trials: experience with Kratom ('super' powdered leaf) (ID 41417)\". Erowid.org. Mar 18, 2005. erowid.org/exp/41417",
 "substance": "Kratom ('super' powdered leaf)",
 "bodyweight": "120 lb",
 "header": [
  "DOSE:",
  " drops",
  "oral",
  "Kratom",
  "(daily)"
 ],
 "report": "<p>from 6-9 ( six to nine) grams per day, for 10 days</p><p>I decided to post this to give my personal experience with kratom withdrawal. I have previously (a year ago) gone through w/d's from hydrocodone, and more recently, opium poppy tea. I'm going to make sort of a comparison between the poppy withdrawal and the kratom withdrawals. I'll refer to both forms of withdrawal as 'w/d'.</p><p>I bought a good amount of kratom super powdered leaf, and I made a feeble attempt to not abuse it, but I failed. I ended up using it 2 to 3 times a day, using 2 or 3 grams per dose. Or so. I measured with a teaspoon.</p><p>I would have to say the the kratom w/d caught me a little off guard. However, I should have seen it coming. They lasted longer than my hydrocodone w/d, but was not as intense. The kratom w/d lasted almost as long as the poppy w/d, but not quite. It is less extreme then the poppy w/d, but that of course, changes depending on dosage, and your individual body.</p><p>In my experience, the w/d from kratom is like a toned-down version of opium tea w/d. I get tired easily, my muscles are sore, I get depressed, and feel kind of (unpleasantly) detatched from other people. I get depressed, usually in the mornings, and then at night it gets worse. And it makes me poop a lot for awhile, after the constipation wears off. But with kratom, the withdrawal has not been as severe as the withdrawal from the opiates I mentioned.</p><p>If I have good judgement, and I use this plant occasionally (maybe once a week), I imagine that it would be much easier to 'kick'. I hope that this info helps someone out there.</p>",
 "year": "2005",
 "id": "41417",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-03-18T08:00:00.000Z",
 "views": "11797",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " drops",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(daily)"
  }
 }
}
