{
 "title": "Experience Learned",
 "author": "Rob",
 "citation": " Rob. \"Experience Learned: experience with LSD (ID 4150)\". Erowid.org. Mar 5, 2001. erowid.org/exp/4150",
 "substance": "LSD",
 "bodyweight": "130 lb",
 "header": [],
 "report": "<p>The last trip was a few months ago. Instead of going into the details of my trip, I would like to offer what I've learned about my experience.</p><p>The unconscious becomes awakened to the conscious self. All the person's hopes, dreams and life in general can come rocketing out of the sub-conscious. This leads to a sense of joy and euphoria. Later, this turned negative when I was confronted with the harsh realities that life doesn't always go as I would like or plan. This was due to my actions and responses to what my hidden fears are and what I know to be reality. I admit that this was disturbing to me at first. I felt as if I was falling (not literally, but in the general sense) and it became difficult for me to get on with the rest of my life. Recently I turned to meditations and Tai-Chi in order to 'get a grip' on the way that I am and to move forward. Luckily, I found some spiritual people and fellow acid heads to guide me through the mess that I thought I was creating for myself. (In truth I was creating a mess without really knowing it and what to do about it.)</p><p>Now, I am developing a greater understanding of 'who I am' and 'where I came from.' Each time I meditate and perform the steps that I know are necessary, a greater sense of myself deepens and grows.</p><p>There is some truth to the dangers of tripping. The proper context, setting and timing are very important. What happens to a person when they come down can be troublesome if you're not careful, as I discovered. It doesn't matter how well-adjusted you may think you are. People who are 'loopy' to begin with probably wouldn't even notice the difference.</p><p>I will recommend to anyone to at least try the drug. I myself used it 5-7 times in the last 12 years with only 1 trip that had mixed results. The others were a lot of fun. Tripping does nothing to a person that isn't already there. Those who are fearful or unhappy will discover why, as opposed to those who are always happy and joyful. Those who blame the drug for whatever it is that they became later, after they had a bad trip, never took the time to stop and think about who they are.</p><p>So, if you have a bad trip and you think you're a bit off base or off track, for god's sake don't panic. This only makes matters worse. Never try to rationalize away anything. I don't believe in 'talking yourself out of it.' You are only pushing the dirt under the carpet, so to speak. It will only creep up on you later. Take a deep breath once in awhile and try something new. You only live once. The most powerful drug in the world can never change the way that you are. If anything it can give you a chance to have a look at yourself and let you decide what you think and if you don't know, ask questions.</p><p>So what did I discover about myself? That I think and worry too much.... Oh well, live and learn. I can't say that I am proud to have this experience but at least I learned something.</p>",
 "year": "2000",
 "id": "4150",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-03-05T08:00:00.000Z",
 "views": "7909"
}
