{
 "id": 4156,
 "title": "Legal Pot?",
 "date": {
  "submission": "2007-01-10T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Ralius",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Amanitas",
   "form": "(dried)"
  }
 ],
 "report": [
  "Living in the Pacific Northwest has just been given one more good point. There is a powerful little shaman growing right in our own front yards!",
  "2 days ago, I was coming home from school, and came across a peculiar little guy growing in my neighbors yard, I quickly identified it as the 'fabled' Amanita Muscaria. I had heard about them, and searched for them often, usually looking in deciduous forests around my city, but surprisingly enough it was found right in my neighbors yard!",
  "I tried to dry it in my oven, and noticed that a liquid was falling off of the shroom and onto the tinfoil I placed below it. so, I placed a bowl beneath it instead. after a few hours, the mushroom was dry, and I had a nice red resin collected in the cereal bowl. I scraped out the red resin,thinking it could be used later, and capsulized it. I then peeled the skin off of the cap of the mushroom, it came off in strips about 4-5 sq. cm area total, I crumpled these up like little MJ buds, and stuck them in an old prescription bottle. There were about 50 of them total.",
  "I placed one of the little mushroom buds into my bong, and smoked it hard. The smell was akin to that of burning hair, not very pleasant, but also not very harsh on the lungs. When it was all gone, I sat back and put on some Tears for Fears. 15 minutes later the effects started to kick in. I felt somewhat happier, and my hands started to feel a little cold, then started to sweat. I wanted to get up and dance to Shout and Mad World, so I did. I also started speaking out loud to one of the Jack-O-Lanterns on my table. It didn't reply, but in my head I though, no I KNEW that it was speaking to me.",
  "It was much like being high on MJ, except that my mind was completely clear. It was as though my body was high, and my mind was free to discuss what was happening with myself. I could think 'Wow, usually that doesn't happen, that's quite peculiar' whereas on MJ I would've thought 'heh...man...thats freaky. What? Where am I again?'. So naturally, acting sober in front of my parents while high on the Fly Agaric was no problem at all. My motor coordination was nigh to perfect. It was like drinking 6 beers, while still being able to think clearly. I have not tried eating it yet in an amount of more than half of a gram, and the taste of it dried is very disturbing to me. It makes me retch. So I think I will continue to smoke it, maybe mix it with a little MJ for kicks."
 ],
 "erowid": {
  "id": "28096",
  "citation": " Ralius. \"Legal Pot?: experience with Amanitas (ID 28096)\". Erowid.org. Jan 10, 2007. erowid.org/exp/28096",
  "substance": "Amanitas",
  "views": "18957"
 }
}
