{
 "title": "Redwood Grove",
 "author": "Israel Bloom",
 "citation": " Israel Bloom. \"Redwood Grove: experience with Amanita muscaria (ID 4156)\". Erowid.org. Dec 25, 2001. erowid.org/exp/4156",
 "substance": "Amanita muscaria",
 "bodyweight": "185 lb",
 "header": [
  "DOSE:",
  "1 drop",
  "oral",
  "Amanitas - A. muscaria",
  "(dried)"
 ],
 "report": "<p>After reading parts of Wasson's SOMA, I was curious to try fly agaric for myself, to see what effects it might have.  I was a little apprehensive because I'd heard that some people have had less-than-pleasant experiences (nausea, profuse sweating, drowsiness, etc.).  But I thought the benefits might outweigh any drawbacks.</p><p>I picked a small mushroom, for two reasons:  first, they are said to be more active; second, I didn't want to overdo it, not knowing what might happen.  I let it dry for a week or so in my closet, which may seem like a strange place, but it had been raining, and I wanted it to dry properly.  It shrank considerably; I was able to roll it up into a kind of ball and, after letting it soften in my mouth, swallow it whole.  I didn't chew it because I thought I might avoid nausea that way.</p><p>I made sure to do it in a secluded spot, a very beautiful spot, called Redwood Grove.  I knew that I would be alone there to do anything I pleased:  write, sing, laugh, throw up, jump around and talk to trees.  However, the trip, if it can be called that, was very mild.  I never felt out of control.  There were some side effects:  I felt a fairly sharp pain in my groin and lower abdomen, but I was able to alleviate it with regular breathing.  Also, I noticed that I was sweating more than I would have normally and that my vision was not as acute.  Specifically, I couldn't focus on distant objects.  At one point, I was hiking out of the grove and saw the moon over the ridge to my right.  It appeared to me as a bright blur of light, and I couldn't make out any of its features (the craters and mountains we see as the Man in the Moon).  It was just a blob in the sky.  Distant lights in houses below were similarly blurry.  My vision later corrected itself.</p><p>Overall, it was milder and more uneventful than I expected.  It's hard for me to say just how it affected me:  I don't know that I was any more aware, or that I saw or heard things that I wouldn't have without the mushroom (heightened senses).  I think I may have become more contemplative, but that will happen to anyone who spends four hours among Redwood trees.  Still, I felt a kind of communion with the natural world, which should happen anytime we consume something that is of the earth but often doesn't.</p><p>",
 "year": "2000",
 "id": "4156",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-25T08:00:00.000Z",
 "views": "11352",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 drop",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  }
 }
}
