{
 "title": "Lasted Long",
 "author": "FlowGnome",
 "citation": " FlowGnome. \"Lasted Long: experience with Poppies - Opium (seed tea) (ID 41576)\". Erowid.org. Jul 7, 2005. erowid.org/exp/41576",
 "substance": "Poppies - Opium (seed tea)",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "55 g",
  "oral",
  "Poppies - Opium",
  "(tea)"
 ],
 "report": "<p>I had been reading a few days ago about codeine & morphine content of poppy seeds, and that they may be made into a tea using a simple lemon juice extraction.   I decided to try a test run, as very conflicting information regarding dosage was found online.   </p><p>Note that I have no opiate or any other tolerance.</p><p>55g of store bought poppy seeds were ground for about 60 seconds in three portions in a mortar & pestle.  These were placed in a glass jar and covered with 4oz of lemon juice concentrate and about 8oz of steaming hot water.   The mixture was allowed to steep with stirring for about 45 minutes, then filtered through a piece of clean cloth into a glass.   The liquid had turned a whitish color, with small beads of a refractive oil floating on top.   Ice, sugar, and water were added, and the mixture ended up tasting like lemonade with a hint of some type of flowery taste.   No horrible flavor like some had mentioned.</p><p>About half of this was drank over a 15 minute period.  </p><p>T+0:30h - A mild numbness of the skin is noted, along with a slight slowing of coordination.   Feels like 5mg or so of hydrocodone.</p><p>T+1:00h - Effects remain constant.   The other portion of the tea was consumed over another 15 minutes.  </p><p>T+1:30h - A little bit stronger, but not much.   Still at the level of a weak hydrocodone dose.  This continues at this level until I'm ready for some sleep, around T+7:00h.</p><p>T+7:30h - Sleep comes easy, but I awake often due to profuse sweating over the next couple of hours.   </p><p>T+14:00h - Awake to alarm.   Skin is still numb, and feeling a little queasy.    Decide this would be a good day to stay in. </p><p>Current.   My skin is still a little numb, feels like after-effects at this point though.    No negative side effects except the queasyness upon awakening.  </p><p>I feel that this might be more useful in a larger amount, but am also concerned with how long it lasted / is still lasting.   Almost 24 hours later I am at baseline but feel worn out, as though I hadn't really slept more than a couple of hours last night.    Still, I will probably repeat if I have a long weekend available.</p>",
 "year": "2005",
 "id": "41576",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-07T07:00:00.000Z",
 "views": "45018",
 "dose": {}
}
