{
 "title": "My Golden Evening",
 "author": "A Strange Glove",
 "citation": " A Strange Glove. \"My Golden Evening: experience with Oxycodone (Oxycontin) & Cannabis (ID 41587)\". Erowid.org. Aug 20, 2007. erowid.org/exp/41587",
 "substance": "Oxycodone (Oxycontin) & Cannabis",
 "bodyweight": "230 lb",
 "header": [
  "DOSE: T+ 0:00",
  "40 mg",
  "insufflated",
  "Pharms - Oxycodone",
  "(ground / crushed)",
  " T+ 0:04",
  "0.3333 joints/cigs",
  "smoked",
  "Tobacco - Cigarettes",
  "(plant material)",
  " T+ 0:26",
  "100 mg",
  "smoked",
  "Cannabis",
  "(plant material)",
  " T+ 0:32",
  "0.5 joints/cigs",
  "smoked",
  "Tobacco - Cigarettes",
  "(plant material)"
 ],
 "report": "<p>Let me preface these statements with some necessary information about me, the narrator. I am a light smoker - both tobacco and marijuana - and have experience with many drugs, but find myself able to give up all but the two above with ease. I drink on rare occasions, and seldom more than once or twice a months, and never enough to get 'the spins'. The only time thoughts of habituation enter my mind is when it comes to oxycontin: it is something to be respected, and used with the utmost of care.</p><p>I receive a ration of 80mg Oxycontin tablets, dark blue green in appearance, with the letters 'OC' on one side and the number '80' on the other. Like all things, the key to this drug is moderation, and to start with a small dose so one may gauge the effects. My first experience with Oxycontin in approximately four months took place four days before this experience. In those four days I insufflated between 40mg and 100mg throughout the day.</p><p>17:00 - Began sober, except for light consumption of marijuana. Insufflated 40mg, distributed evenly between both nostrils. Sinuses and nasal passages clear and dry. A spray of saline in either nostril adds necessary moisture.</p><p>17:04 - Finished remaining 1/3 of American Spirit Menthol Light cigarette. First signs of giddiness.</p><p>17:05 - Washed sunglasses and regular glasses.</p><p>17:09 - Returned to computer. Forgot water in bathroom. Slight loss of fine motor control and coordination. Feelings of euphoria have replaced the generalized giddiness.</p><p>17:12 - Returned to computer, this time with water. Left nostril 80% clogged, right nostril %30. No advancement of effects at this point compared to three minutes ago. Mouth parched, probably from marijuana consumption.</p><p>17:14 - Slight 'disconnected' feeling, typical of early stages of opiod intoxication. Swallowing is momentarily difficult, and the medicine drips down the back of my throat with a noticeable taste.</p><p>17:16 - Sensations of accelerated pulse. Heavy headed. Serenity fills every gap in my body. Definite sensations of peace and comfort.</p><p>17:18 - Both nostrils fully clogged. Vague fatigue creeps in. Blinking becomes a prolonged affair, as sleep becomes an easier and easier. I feel my mouth open, face slack, and my eyelids drooping, but experience tells me that these things are unnoticeable to any observer.</p><p>17:20 - Becoming harder to keep my eyes open, not from needing to sleep, but from feelings of harmonious relaxation. Sentences are hard to puzzle through.</p><p>17:21 - Very difficult to keep eyes open. Fingers seemingly not obeying my whims to type. A couple spots on my body begin to itch.</p><p>17:22 - Exceedingly difficult to type and keep eyes open. Slow descent into Nod.</p><p>17:24 - Early decision to nod off perhaps too hasty, because the overwhelming urge to sleep passes. My nose itches, as does my ears, other parts of my face, and random limbs.</p><p>17:25 - More itching ensues. I get the last hit from my pipe, trace amounts of ash clinging to my tongue.</p><p>17:26 - Itching comes in waves and cycles. I load another bowl in my one hitter, consisting of approximately 1/10th of a gram of marijuana, and smoke it in two hits, one long and one short.</p><p>17:29 - The long glass pipe rings like a bell when I tap the ash against my ashtray. Itching has moved from my face to below the belt. I head outside for another cigarette. My mouth is incredibly dry.</p><p>17:32 - Finish 1/2 of cigarette. I snort through my nose and clear out 90% of my right nostril, and 60% of my left nostril. No apparent effects from the cigarette, and no increase in other affects.</p><p>17:35 - I complete two necesary phone calls, totally unimpeded. The feelings of fatigue have risen a bit, but I surmise this is because typing (or any activity that causes me to focus a great deal of atttention on it) causes me to become tired when intoxicated.</p><p>17:37 - First instances of double-vision as I sit here and type. Blinking momentarily clears up the problem, but each blink seems to get longer until individually they take a few seconds.</p><p>17:39 - My eyes refuse to stay open, and the rest of my body is totally relaxed. On some level, it's like being in warm honey.</p><p>17:41 - I queu some appropriate music, and sit back to relax. My testicles seem to vibrate. After closing my eyes for several seconds, opening them is an incredible challenge. Unless I rapidly blink, my vision defaults to having offset duplicates of everything.</p><p>17:52 - I awaken from my Nod. I was listening to music, and letting the tide of hopes, dreams, plans, and ideas flow through me. I was breathing through my nose and mouth - long, heavy breaths - so now both are dry. The water is sublime ; the music crescendos. Everything is beautiful. Tommorow is my birthday, and this is an early celebration of life - my life, and all life.</p><p>17:54 - I feel like a perfect animal, every cell alive and humming with activity.</p><p>18:05 - Fatigue has dissipated, along with most of the itching. I'm left feeling wholesome and tidy, but also yearning to experience the radiance that was with me several minutes ago.</p>",
 "year": "2005",
 "id": "41587",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-20T07:00:00.000Z",
 "views": "11549",
 "dose": {}
}
