{
 "title": "Words of a Junky",
 "author": "Human 2b Monkey",
 "citation": " Human 2b Monkey. \"Words of a Junky: experience with DXM (ID 41657)\". Erowid.org. May 21, 2009. erowid.org/exp/41657",
 "substance": "DXM",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "DXM",
  "(liquid)"
 ],
 "report": "<p>I have done alot of DXM in the past year or so, I have drank roughly 40+ bottles of robotussin max strength. I 'tripped' all the time, about every two weeks for months. DXM has had deeply profound effects on my mind, body, and personality.</p><p>Before I touched this stuff I was operating sane and normal.. but after a few trips I began to notice 'quarks' that took me by surprize. The most troubing is I woke up one day and suddenly I felt stressed by how I walked, and was horrified to find out I truly was walking funny which blew my mind. Shortly after I started hearing wispery voices, in public I heard comments by people in the background that weren't even there. Slowly I became delusional as hell and got the idea somebody was trying to kill me, there was a camera in my room somewhere, and all these people were in on it, yeah. After talking to the wrong person in like no time flat I was in a mental hospitial for a few weeks and it was so embarissing and I was realy upset.</p><p>After I left the hospitial I got myself off the nasty meds they slapped me on after tell the doctors to screw themselves. I came back to reality quickly after the hosptial almost totaly but not competely, it seemed I had fried something somehow it wasn't ever going to truly wear off. For whatever reason picked up the robotussin again and used it for months with no noteable further degrading of my sanity.</p><p>I stopped doing DXM because I did it so much I totaly lost pleasure from it, and built up a realy high tolerance. It went from being addicitively magicial to feeling like I was posioned and dying leaving me shakey and freaked. I went from loving to being scared of it.</p><p>It has been a long time since I have done anything and the effects seem quite perment.  40+ bottles of robotussin later I can't walk totaly normal, I hear things, a range of delusional aniexities and possible heart / health problems, and my launuage / speach has been more than a little degraded comicaly into noises and stoner burn-out gibberous. To sum I screwed myself nicely. </p><p>DXM in my opion and expereince is has potential to be quite addictive. I would rate it is being kind of a harder rough nasty drug and not very good to the mind or body in the least.</p>",
 "year": "2005",
 "id": "41657",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-05-21T07:00:00.000Z",
 "views": "4408",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 }
}
