{
 "id": 4169,
 "title": "The Udakwa Cloud Walk",
 "date": {
  "submission": "2006-05-24T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Entheomation",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 ml",
   "administration": "oral",
   "substance": "Dioscorea spp.",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I have been told that this plant was rather popular in latin America primarily among truckers who would use related plants in their fresh state.",
  "28 grams of dried Dioscorea dregeana tubers were powdered and added to 500ml of spring water. The water was heated and boiled down to roughly 100ml of water. The water was filtered and collected. Approximatelly 10ml of the liquid was imbibed. An immediate gag reflex triggered. A burning rough sensation in the back of my throat occured. This is a very strong drink indeed. Just a shot is needed and I couldn't imagine ingesting more.",
  "5 minutes: I felt minor stomach discomfort and slight vertigo. ",
  "10 minutes: A spaced out dizzy, drowsy, and confused state of mind with difficulty focusing eyes.",
  "20 minutes: A floaty, throbby, cloudy, buzzy feeling. Relaxing and smooth but still with a force behind the push. Not at all a brute yet still inspiring enough to stir up dreamy thoughts and pleasent feelings.As I lay, I felt as though I was walking amongst clouds. I could visualize this in my mind and feel the sensations in my body",
  "45 minutes: A strong narcotic and drunken feeling began. Cloudiness of the mind. Eyes began to feal heavy. Stomach still a bit discomforted. Desire to sleep. It would be a very bad idea to drive under the influence of this plant. The feeling and pressures in the head resemble alcohol. It would be easy to fall asleep right now. Very intoxicating. Little body load.",
  "60 minutes: Very strong intoxication feeling but nearly clear state of mind. Difficult to focus and function. Capable of talking coherently but would rather not move.",
  "90 minutes: Over powering Effects began to subside. pleasent euphoric and relaxing effects linger. Still very strong but not too much to handle.",
  "120 minutes: Effects still present but fading significantly.",
  "I tried hard not to fall asleep so that I could properly evaluate the experience but By this time I am satisfied with the experiment. I appreciate the subtle effects more so than the strong intoxicating effect.",
  "This plant has proved to be very powerfull indeed 10ml of this decoction is a very strong dose.",
  "The next day I woke up from the best sleep I have had in ages. I felt refreshed and energized.",
  "The overall experience was Worth repeating. The only negative side effects I noticed was the stomach discomfort and dry feeling in my throat that was present throughout the entire experience. I assume that Udakwa would be interesting in a social setting. It seems as though addiction could be a possibility."
 ],
 "erowid": {
  "id": "28150",
  "citation": " Entheomation. \"The Udakwa Cloud Walk: experience with Dioscorea dregeana (Wild Yam) (ID 28150)\". Erowid.org. May 24, 2006. erowid.org/exp/28150",
  "substance": "Dioscorea dregeana (Wild Yam)",
  "views": "10036"
 }
}
