{
 "title": "SSRIs with Various Drugs",
 "author": "none",
 "citation": " none. \"SSRIs with Various Drugs: experience with SSRIs & Various (ID 41701)\". Erowid.org. Nov 23, 2005. erowid.org/exp/41701",
 "substance": "SSRIs & Various",
 "bodyweight": "185 lb",
 "report": "<p>I've taken SSRI's for about 3 years, (first 20mg paxil a day, then recently 10mg lexapro) and since those have been in my body, I've experienced many other drugs in combination with them. First off, I take these meds to relieve my anxiety (social or otherwise), so they often act strangely with other drugs.</p><p>Weed, for instance, has the abilty to make a lot of people paranoid, or anxious. I found this very true in my case. I don't like weed usually. It makes me self conscious, paranoid, and really anxious usually. Only in addition to strong uppers (coke, speed) do I enjoy the high it brings. But strong uppers are my downfall, they work best for me and have become my favorite. Coke and speed especially. These drugs work perfectly, eliminating my social awareness and anxiety, and making me feel really good.</p><p>Alcohol is something that I've used for about half my life (I'm 24 now) and that is what I used to combat anxiety, worry, and paranoia prior to SSRI's. And it still works great. SSRI's are known to lower you tolerance to alcohol, but I'm still able to drink a fifth of hard liquor in a sitting sometimes. Alcohol use is also discouraged while taking SSRI's but I am unable to discontinue drinking on a regular basis. I don't drink every day, but on nights when I 'go out' I can oftentimes drink until I black out. Uppers are one way that I control the intoxication (too drunk? take a line).</p><p>I started using coke a couple years ago and immediately fell in love. I could eliminate all the social akwardness that I felt without resorting to getting blind drunk. It's a psycho-stimulant, gets me up, and it makes me feel good. Since then I've snorted, freebased (foils), and smoked crack.</p><p>Then after spending a lot of cash on coke, a friend turned me on to speed. 'Cheaper, and it lasts longer.' Sounded good. It didn't quite have the immediate, crazy high, that foils or crack might, but it did last longer (2 pills for at least 48 hrs) and it was cheaper ($20 a pill). Needless to say, I'm a big fan of both. Especially since my prescribed meds seem to have no adverse effect on them.</p><p>E is a different story. I've only rolled once. It was for a short time, after 3 hits of 'really good stuff' and it was my first time trying it. Not exactly sure how these chemicals work together, but for me, E keeps me awake, and that's about it. No luck rolling since then. I've never dropped acid, but I've eated mushrooms a few times, and other than making me feel tingly and, again, keeping me awake for a bit, they did nothing. And I took high doses. I've taken at least 5 times what my friend has taken, and he's tripping balls, while I wonder why nothing fun is happening. As for aderoll, ritalin, and the like, for me, they get me less drunk, and that's about it. Then when they wear off, I'm wasted.</p><p>So that's pretty much my story about my SSRI vs drugs scenario.</p>",
 "year": "2005",
 "id": "41701",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-11-23T08:00:00.000Z",
 "views": "12480",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Escitalopram",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "Various",
   "form": ""
  }
 }
}
