{
 "title": "The Power of Sid",
 "author": "Sam",
 "citation": " Sam. \"The Power of Sid: experience with LSD (ID 41736)\". Erowid.org. Nov 12, 2008. erowid.org/exp/41736",
 "substance": "LSD",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2005",
   "41736",
   "Male",
   "",
   "Not Given",
   "Nov 12, 2008",
   "3885",
   " "
  ]
 ],
 "report": "<p>A few weekends ago it was my best friend's 20th birthday, and we intended to celebrate by going to a rave and dropping a lot of acid. 6 of us went to the rave. Half of us, including me, had 5 blotters, the other half, 2 or 3.</p><p>We couldn't find any dealers for a while, and to bide our time we tried a dose of liquid 2CB. Having done a few other similar chemicals such as 2CE and 2CI, I was interested in trying it. The come up was rapid, and I felt heavy for a while. The physical symptoms subsided to give way to a subtle but very pleasant dreamy euphoria. I remember thinking that this would be a good drug to a person inexperienced in psychedelics.</p><p>Around 3 AM we found an acid dealer almost out of acid. I bought 3 blotters. I took 2 and gave 1 to a friend-so 3 of us had 2 of these blotters each. The dealer was quite sure of the quality of his blotters, and later we found another dealer who was selling cheap 2-quid-a-hit blotters, so I thought I would have 3 of them as well. I was anxious to take them, as I was due back in the evening.</p><p>Everyone seemed to take a long time to come up off the acid-this may have been due to the 2CB already in our system, I'm not sure but usually I'm coming up fast in 25 minutes. I few tokes on a hash joint caused a flush of warmth trough me, and I felt very relaxed. Walking was actually a task, and for a while I could barely stand up. It was after this joint that I noticed the wall and ceiling were beginning to creep-visuals too strong for the 2CB, so I assumed the acid was kicking in. Nitrous was interesting as usual, but not as it could have been (needed to be coming u more on the acid, and they ran out early).</p><p>Around 5 we left the rave and got on a bus. Lights were very bright, and being around sober people wasn't fun. It was on the bus ride that the acid really started to take effect. The floor of the bus was moving strongly, like liquid, and I could both hear and feel my brain clicking with activity. Strong OEV's began to appear, and I informed the other guys that we had taken a BIG dose of acid, the strongest I've ever had by a long shot.</p><p>We then decided to walk to Hyde Park to see the sunrise. We didn't make it in the end, but had a good explore of London. Visuals were strong everywhere. There were powerful open eye visuals even in the daylight!</p><p>I was very intoxicated. I couldn't really construct sentences, and my memory was reduced to a loop of a few seconds. On the way back to my friends flat, someone had the bright idea of buying a MacDonalds while on a psychedelic dose of LSD. Stupidly I went with these guys into MacDonalds. They couldn't stop laughing, and I was trying to look elsewhere. The atmosphere grew VERY heavy and oppressive-talk about bad vibes. One of the guys actually wanted to sit down and have his meal around some very freaked out people. I was glad to be out of there.</p><p>Eventually we made it back to the flat. Inside the enclosed space the visuals were a lot stronger. We loaded up, a bukket bong (very good), gravity bong and a normal bong. Everyone had a good dose of weed, and we finally settled in my friends room.</p><p>The visuals were intense. Sound was highly distorted; it had a lot more depth, almost fluid. I actually felt something like blood tricking down my lower leg-this felt very realistic, but there was nothing there. It was just my imagination going a little haywire. Time was very odd. I'd never experienced time behave so oddly before, except perhaps on a few high dose 2CE trips. There was constantly looping, we would all repeat ourselves, and it sort of felt like we were being reborn or reawakening every second. Very weird.</p><p>While all chilling in my friend's room, one of the guy's, J, suddenly freaked and shouted 'Shit guys, I'm having a really bad trip!' Knowing that his memory was screwed in this condition, I held his attention (via eye contact) calmly assured him that we're cool, everything's fine. He took a few seconds to process this, and calmed down. This cycle repeated itself several times, and I assured him we had been fine up until now, so were going to be fine. Soon after this, my best friend A, who never freaks, also said he was having a bad time.</p><p>The time loops raged on, and we just rode it out. Although it was incredibly intense, I was ok. But hearing that 2 other guys were having a bad time wasn't cool. In the most intense parts of the trip, I felt like this was what one form of insanity could be like.</p><p>Two other guys left, who were on less acid, and my friend b was on less also and he was a positive influence to have around. People were reporting weird stuff. B's friend was so far gone the walls had vanished, J said at 1 point he felt like he was dead and was floating outside of his body-a classic description of ego loss, which we were all experiencing.</p><p>A reported telepathy. While on acid, I'm in a state of heightened suggestibility with increased sensitivity to environmental cues. I am so in tune to people's facial expressions and body language, that I could tell how one another was faring. A said he was getting a bad trip by reading J's thoughts, who was also having a bad trip. I had amazingly complex and detailed CEV's to the extent I went to actual vivid places, like in dreams. I could also see music. Even in a room with friends, the atmosphere was intense, and I put a jumper over my eyes to enjoy the visuals.</p><p>Due to the high dose and the weed, I wasn't at baseline for around 24 hours, which meant going on the tube and the train in this [much diminished] state. This was unpleasant, but had to be done. While the visuals were nearly diminished, the feeling of the acid high persisted. The next day I wasn't completely normal, but I think this was largely due to sleep deprivation.</p><p>I've sampled a lot of different chemicals, but in my opinion LSD is the most intense, and most powerful of the lot. The power of my brain in this state is mind blowing. Computers don't come close. I didn't give acid the respect I should have, and the lot of us were very lucky that the night had gone so well, if anything had gone wrong in our states, it could have gone very wrong indeed. </p><p>That night on a high dose of acid was without doubt the most intense, most mind blowing, and most weird event of my life so far. I was in shock for a while afterwards.</p><p>I will definitely be doing acid again in the future, but never this much. There were no after effects or hangover to speak of, incredible when it was such a strain on my brain. </p><p>If acid were a bad drug, I am almost certain I would be permanently rain bowed out after experiencing that trip.</p>"
}
