{
 "title": "Me, My Brain, Ketamine, and a Miracle",
 "author": "K-ally",
 "citation": " K-ally. \"Me, My Brain, Ketamine, and a Miracle: experience with Ketamine (withdrawal from Kratom/Opioids) (ID 41759)\". Erowid.org. Mar 30, 2005. erowid.org/exp/41759",
 "substance": "Ketamine (withdrawal from Kratom/Opioids)",
 "bodyweight": "165 lb",
 "report": "<p>Opiates had been a problem in my life for over a year, and I had used and abused them for many more years before. My poison of choice was oxycontin (heroin was too unreliable and fentanyl, my favorite, was never around). I would spend insane amounts of money on them, go broke, quit, go through horrible withdrawal and the cycle continued. I always broke promises to myself about my use.</p><p>Then, back in December after getting over a three week withdrawal from heavy oxycodone (100mg to get me high) and methadone (50mg to keep me nice and level), I discovered Kratom. I learned that it was no ordinary legal high, and this stuff was actually like an opiate. I start taking it 2-3 times a day and my tolerance skyrockets; at first I only required 3 grams of leaf, now I was using up to 10 grams here in March. Kratom was being used on top of occasional oxycodone, which my tolerance was quite high for, so there is without question cross-tolerance between Kratom and opioids.</p><p>I started having side effects from my use, like depression. I figured it was time to quit, for real, and I was really scared. Withdrawal has given me days of hell on earth, pure torture of the mind and soul. A week earlier I had stopped my use for almost two days, in a failed attempt to quit. The withdrawal set in in about 20 hours and was absolutely hell, so I eagerly ate more Kratom.</p><p>So, I go through the horrible process again, my final time, like I always said. This time I scattered my remaining Kratom through the garbage can. Pure anxiety hits me after a day, along with stomach problems, twitching, and horrible insomnia. On the second night, I decide to inject some pure ketamine I had. It was powdered, and I dont like snorting the stuff, so I decided to do my favorite old IM injection. I have a lot of experience with ketamine. Ive always shot for the out of body experiences, as I didnt much like its effects at the club drug level. So, I weigh out 110mg of K, put in about 1.3mL of saline into the spoon, heat, dissolve, run through cotton filter and inject into my leg.</p><p>My expectations were to leave this reality, perhaps to find some peace and wonder. I remember pondering the idea of trying to reprogram my brain on K to avoid withdrawal a few days earlier, but this wasnt my goal, as I truly didnt believe that to be possible. I had used ketamine IM injections during withdrawal before, only to find a very temporary, partial relief. My mood was dull but sort of hopeful. I had just got done watching What the bleep do we know? which seemed to expand my mind a little. I find that what I do or watch in the hours before doing a large K dose greatly effects the visions.</p><p>12:15am- I inject the solution. I keep a journal open on the computer to write about my experience.</p><p>12:20am- I feel fuzzy, staticy, and a little floaty. I also still feel withdrawal but I feel my conscious perception slowly shifting away. I put on Pink Floyd- Animals (my favorite K-hole CD) and lay back.</p><p>I remember a minute later the bed starts swaying up and down, back and forth, as if I was on a raft floating in a mildly rough ocean. I enjoy the ride, then start to slip out of my body, down a black hole that formed on my bed. Random concepts, mostly about my life are floating through my head. My perception of my consciousness is extremely altered but very real feeling. I think in an almost emotionless way, but I remember being amused and amazed by the new realities I was experiencing. What I see I cannot describe, as I dont remember most of the trip, but they werent very solid or bright visual forms, they were fuzzy and faint mostly.</p><p>Then comes the true magic. I appear surrounded by a gray mass, which is my brain I somehow know. Blue electricity flows through it. I see part of it suffering, and I know its all my fault. But I dont feel guilty I know this can be solved. The skeptical part of my brain was gone, and I knew I could change my brain, I just needed to tell it what to do. And I did. I dont know exactly what I told my brain to do, as I wasnt using words, but I communicated with it with complete 100% confidence, and I believe this was the key.</p><p>I woke up at 6am. I couldnt immediately remember what had happened in the K-hole the night before; it took a few minutes. My computer was still on and the last thing I wrote was before going down the K-hole. I did immediately notice something was wrong, but so right I wasnt experiencing any withdrawal. I then remembered parts of the K-hole, like what I did to my brain.</p><p>After accepting I just communicated successfully to my brain causing it to physically change to adapt back to normal, tears rolled down my face. It was a miracle. I almost expected to go back into withdrawal the next day, but I didnt.</p><p>Here I am on day 8 clean, and I feel normal. Ketamine saved me great suffering. But then I start to wonder, how much was this miracle the drug? I dont really know. But I know it helped me get to the place I needed to be. A place to open a communication within my brain, with no skepticism or doubt.</p><p>I still get tears in my eyes when I think about what happened, and what this really means is possible. I would have read something like this last week and not completely believed it. I would think logically like the ketamine must have binded partly to the mu-opiate receptors or maybe they are highly exaggerating the story.</p><p>I would not want to risk saying that ketamine is a cure for opiate-dependency. It takes something within the self for such great change. But believe me, it is possible.</p>",
 "year": "2005",
 "id": "41759",
 "gender": "Male",
 "timestamp": "2005-03-30T08:00:00.000Z",
 "views": "62017",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(leaves)"
  },
  {
   "time": "",
   "amount": "110 mg",
   "administration": "IM",
   "substance": "Ketamine",
   "form": "(liquid)"
  }
 ]
}
