{
 "title": "And Weed is Legal?",
 "author": "Paddos",
 "citation": " Paddos. \"And Weed is Legal?: experience with Nicotine (Dip & Cigarettes) (ID 41764)\". Erowid.org. Mar 27, 2009. erowid.org/exp/41764",
 "substance": "Nicotine (Dip & Cigarettes)",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " ",
  "buccal",
  "Tobacco",
  "",
  " ",
  "smoked",
  "Tobacco - Cigarettes"
 ],
 "report": "<p>If there's anything I don't like about marijuana, it's that smoking or dipping when you're high is so encourageable.  But it's all my fault - there is not an excuse.</p><p>I actually started off by dipping Grizzly, Kodiak, Skoal, and Copenhagen.  I guess I just like variety.  I went pretty crazy over that shit during the summer.  I don't regret trying it or even buying it ONCE IN A WHILE.  I actually might even recommend trying dipping tobacco - you'd be surprised.  Dip is quite diverse.</p><p>I ended up discovering the social aspect of smoking and somehow ended up switching to cigarettes.  Not to mention, cigarettes are at least acceptable in our culture, whereas dip is somehow looked at as the drug that will inevitably destroy your social reputation if someone sees you doing it.  I usually smoked American Spirits, but occasionally I could be seen with something like Bali-Shag or Top.  Amazingly, I got hooked on nicotine by cigarettes and not dip (one pinch equals 3 cigarettes in terms of nicotine...the buzz is pretty relaxing).</p><p>I now smoke about a pack a day.  I don't at all dislike to smoke, and my first cigarette of the day is quite righteous, I must admit.  But I hate being addicted to this shit.  I can't concentrate in class without having had my fucking fix prior.  Worst of all, I have to make sure I have my nicotine, which means it deters a lot of money from weed, food, etc.  Not to mention that I really don't even have the money to buy ANY drugs.  And yet I do.</p><p>It impedes my life so much when I have to take a break just because my heart starts racing and I'm just itching to have my smoke.  It's fucking insane.  Every hour or two I start contemplating to smoke.  I wake up coughing brown shit every goddamn morning.  My poor girlfriend puts up with so much.  Not to mention my fucking MANIC mood swings when I have no smokes or money.</p>",
 "year": "2005",
 "id": "41764",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-03-27T07:00:00.000Z",
 "views": "15335",
 "dose": {}
}
