{
 "id": 4178,
 "title": "My Very First and Impressive Journey",
 "date": {
  "submission": "2007-10-18T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tias",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "This happened in the winter 2001 and was the first time I ingested any entheogen stronger than Cannabis. I recently found the file on another site, and was moved at the memory. This one experience changed me forever and has in many ways changed how I look at 'drugs' today, in part if not in full due to my then-mentor and still good friend D. It comes before you without any editing except adding what else I remember, so excuse the poor spelling:",
  "'Hey everyone. I had my first experience with shrooms yesterday, this Saturday, and it was quite awesome in many ways, the trip changing as I went.",
  "I sat with my friends D and L. D is an experienced Shroomer and served the position of guide for me and L. We each drank a glass containing 2 grammes of dried Psilocybe cubensis ground up in water. We sat in his room watching TV, and the first effects sat in after 10 or 20 minutes, I'm not sure how long. His walls are painted with like a million pictures and designs in psychodelic color combinations, and after maybe half an hour they glowed intensely. I also felt really good, a prickling sensation in my limbs and head. I remember shaking heavily while laughing at I-am-Weasel on Cartoon Network. After a while, we saw the walls and furniture begin to move and sway. I decided to get up and walk over to one of his psychedelic art posters. It featured this caterpillar sitting on top of a mushroom, smoking a pipe where bubbles came out of it. The bubbles floated all over the poster, and as I touched the velvet surface, it rippled over the wall like when you touch the surface of a liquid pool.",
  "L said she felt cold, and we talked some, before D went over and put on some new music called the Ninth Revelation. It was good, sounds of the a great jungle or forest mixed with angelic singing and ambient rhythms. In no time the entire room glowed a nearly painful yellowish white, yet it filled me with intense joy and appreciation. Now and then L or D would talk about what they saw and felt, and I could hear myself answering with words that weren't mine, or at least, they didn't speak of any thoughts I normally had. I talked about the eldest of days where love and compassion were the true ways to measure a man, and why love is the supreme force in this world. I began to cry with sheer emotion, talking about how joyous I felt.",
  "D later told me he remembered me at that moment, clad in a robe of green light, like a spirit of nature. The music was changed to Sri Hari - Rising Sign, and as I sung along with the Hindi and Arabic holy hymns, I remembered the same joyous feeling coming to me, as we kept discussing why love for the perpetual or ultimate force far surpassed any love in the material universe. Strange discussion, I know, but we were tripping and listening to holy music after all. Sometimes the room would be glowing white or green, and I could see myself sitting on some huge living treelike structure when I closed my eyes. The psychedelic colored pieces of cloth we had lying around began to melt into our skin, but in a comfortable way, like it was growing onto us. When I removed it, I remember seeing the pattern on it still on my pants and shirt.",
  "We got up and about after finishing our reflections on love and nature, tripping down the stairs and outside on a great snow covered lawn nearby. This is where things got stranger. We stood and looked at the full moon for what seemed like hours. I saw the moon attached to a small stream of cloud. And suddenly the moon flew with raging speed across the sky, dragging a long thin cloud with it. We looked at this phenomena for quite a while, while I discovered clouds flying backwards and bending into unwholesome shapes before my eyes. We kept walking, when I suddenly keeled over, looking into the sky. D said I freaked him out, because where I lay looked like the burn-mark of a man that has burned to death on the field. I apologized to him, but kept watching the skies. Then I asked D if this had any importance, and he said the visions could often tell you something about yourself. I nodded, and took it that the skies ripping so quickly across the sky in neutral colors meant that I had to get on with my life, no matter what obstacles lay before me.",
  "I gave all my valuables and loose objects to L, before trying something I suddenly longed for. Howling and running on my four limbs. I startled D slightly, but he thought it was okay. At this point my thought processes had changed drastically. I knew I was some beast, walking hunched over, and snarling while my long hair fell in my eyes. D eyed me warily, but accepted what I was doing, and I suddenly felt that I could read his thoughts. He later explained that he felt the same way when looking into my eyes.",
  "I returned to normal when we reached the freeway, and D said he saw, what normally was a pile of huge crates stacked by the roadside, an Inca temple. I went to take a piss on this temple, I couldn't see what it was, but suddenly the wall made sounds. Could be words, but I'm not sure. I think this is where my trip crossed from lvl 3 to 4, but it deescalated quickly again. I could suddenly hear the singing, or perhaps crying of a young woman, clearly coming from below the asphalt on the road. I fell down on my face, patting and soothing the road. I even kissed it, and L and D started laughing at me. I'm sceptical at heart, so I cannot say for sure whether this was a religious experience, but it could be a nature spirit feeling hurt this close to the city, if one is inclined to believe in such things.",
  "We went on, and walked through a couple streets, seeing the weirdest stuff. A peugeot sign on a car shop writhing and howling, and some huge building complexes moving around on the ground. I kicked a crushed beer can on the road, and the echo came from above us and behind us, instead of the place the can struck the street. We tried kicking it a couple times, laughing as we got the same result.",
  "After that we walked down a parking cellar under the local shopping mall, tripping over the great wide spaces, and walking into a deserted elevator shaft. This was really freaky, the room felt like it didn't really exist, like we were stepping into some surreal locale in our brain. There were huge icicles hanging from the roof and out from the wall, we tried breaking them off, and in our hands they were warm as they melted, not cold at all. We all remember feeling like this when we discussed it afterwards. After that we smoked a joint, and moved into a very unnerving high/stoned portion of the trip as we moved about. The long corridors and shafts were confusing to behold. All the way from the cellar to the Burger King we were very agitated. We discussed something in the cellar, which I for the life of me can't remember what was, and all the way we walked this sort of haunted us, so we couldn't relax or be happy. I could barely communicate with the poor BK clerk, but I got my whopper, and from there we walked home and watched some TV, before falling over on a mattress. Even in D's room, there were visuals. A green man stepped out of the wall and shook his hand towards me, and then I fell asleep. Today, I'm tired as hell, but the experience was great.'",
  "Re-reading this as I submit it really brings back the memories. It is 20 minutes to 1 pm as I write this, in a cold apartment the 5th of November 2003, near the very same suburb I had that first and magical brush with a certain fungus. I feel like a jaded old man reminiscing like this, and I am but 19 years of age today, But I am about to break my 2 year old vacation in real life. 25 grams of cubensis will soon be growing out from a small substrate box by my side, and 130 mic acid blotter has come to my neighborhood. I take my leave of you, and soon of reality.",
  "Semper Fi,",
  "Tias, Denmark."
 ],
 "erowid": {
  "id": "28181",
  "citation": " Tias. \"My Very First and Impressive Journey: experience with Mushrooms - P. Cubensis & Cannabis (ID 28181)\". Erowid.org. Oct 18, 2007. erowid.org/exp/28181",
  "substance": "Mushrooms - P. Cubensis & Cannabis",
  "views": "2504"
 }
}
