{
 "title": "Harsh Smoke",
 "author": "New guy",
 "citation": " New guy. \"Harsh Smoke: experience with Nutmeg (ID 41809)\". Erowid.org. Jul 20, 2008. erowid.org/exp/41809",
 "substance": "Nutmeg",
 "bodyweight": "170 lb",
 "report": "<p>Background:</p><p>I am 16 the only drugs Ive tried other then this is cannabis frequently for the last while and alcohol once, t3's orally for awhile (ran out) and I tried taking nutmeg orally. Got about 2 spoon full down then the next one I spit up to no effect.</p><p>Earlier this day:</p><p>I haven't eaten since about 6 1/2 hours ago so I have empty stomach, I smoked cannabis bout 7 1/2 hours ago (should be back at baseline). Thats the last of my cannabis. I am really bored and I don't like being sober and read both good and bad reports smoking it so if I don't have to taste it decided Id try it.</p><p>Bowl Size:</p><p>width and length = 1 inch</p><p>depth = 1 cm</p><p>Timeline:</p><p>t+0:00</p><p>I smoked my first bowl, nutmeg is really flammable. When I lit it it stayed lit the whole time, I had to put it out with bottom of lighter. I took quite a few hits, couldn't keep up with the burning but got quite a bit. Also I agree with the statement of it being heavy smoke, I didn't find it harsh on the throat like cannabis the first time but more harsh directly on the lungs. Burns my nostrils when exhaling through nose.</p><p>t+0:01</p><p>It really stinks just like nutmeg so I wet my pipe. Gonna let it dry but needed stink out. Had a drink of water.</p><p>t+0:02</p><p>No effects noticed except slight light headedness. Gonna smoke another bowl.</p><p>t+0:03</p><p>Smoked second bowl doesn't get any easier on the throat really, didn't burn as easily, because I washed it but it did burn but no less harsh but a bit of chunks of nutmeg washed into my mouth while inhaling (ew!)</p><p>t+0:05</p><p>Mild marijuana like high, spacey mainly. I ate a banana, hungry but not from nutmeg just from not eating for awhile.</p><p>t+0:15</p><p>No more effects, want better so I did another half of bowl.</p><p>t+0:40</p><p>No more effects again the same, did another full bowl, decided thats the last if it doesn't work with 3.5 bowls it's not worth it.</p><p>t+1:20</p><p>Went for a walk to avoid parents, felt a little nauseas but thats gone.</p><p>t+1:50</p><p>I feel like Im back at baseline.</p><p>Good Parts:</p><p>mild high</p><p>Bad parts:</p><p>harsh smoke</p><p>nauseas (not too bad)</p><p>heavy smell</p><p>bit of bad taste</p><p>short high</p><p>need to smoke too much for effects</p>",
 "year": "2005",
 "id": "41809",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-07-20T07:00:00.000Z",
 "views": "10253",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": " T+ 0:03",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  "2": {
   "time": " T+ 0:15",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  "3": {
   "time": " T+ 0:40",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 }
}
