{
 "title": "Shaking, Seizure, and Aftereffects",
 "author": "keredpdx",
 "citation": " keredpdx. \"Shaking, Seizure, and Aftereffects: experience with Ecstasy (PMA?) (ID 4180)\". Erowid.org. Dec 24, 2001. erowid.org/exp/4180",
 "substance": "Ecstasy (PMA?)",
 "bodyweight": "210 lb",
 "report": "<p>My first and only experience with PMA was completely accidental. I started out my friday evening like any other, going to my favorite night club to get some x. Being a big guy and having quite a tolerance to MDMA from doing it a lot I usually get three tabs. I get to the club and there was a bust a few minutes before I got there so the whole club is dry. I talked to a friend of mine who worked security and he told me that he could get me some Mitsubishis and only two. I had taken the Mitsubishis before and had a decent experience with them but not great, they were usually just weak x. So I went ahead and got them thinking that I was lucky to have found anything. I get my pills and drop them at around eleven.</p><p>Within a half an hour I'm thinking I'm starting on the best roll of my life. The onset is like x and it hit me like a ton of bricks. But within fifteen minutes I'm starting to wig. All my muscles tensed up and I couldn't stop shaking, I felt like I was in a deep freezer. I couldn't breath right either. My friends were extremly worried when all of this happened because I can handle my drugs. But after a few minutes I was starting to feel good again. I felt like dancing like crazy and everything was moving so fast. This lasted maybe twenty minutes or so. Then I crashed, my muscles went tense again, and I started shaking, everything was muffled, my eyes couldn't focus, I was shaking again but I was hot. Then everything went black for me. When I came to my friends had me lying on a bench outside on the back patio of the club. They said that I turned beat red and had a seizure. I was still high and felt pretty good but it was not a roll at all. this lasted about an hour.</p><p>All in all I'd say that these are not at all safe and the few times I did feel good only amounted to an hour and a half, and the times I was freaking out amounted to about three hours (the seizure lasted for fifteen minutes). I felt afteraffects for a week to. Uncontrollable shaking, chills, hot flashes, and one full blown flashback that lasted about five minutes.</p>",
 "year": "2000",
 "id": "4180",
 "gender": "Male",
 "timestamp": "2001-12-24T08:00:00.000Z",
 "views": "19373",
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA"
  }
 ]
}
