{
 "title": "Sublingual THC Tincture",
 "author": "raybeez",
 "citation": " raybeez. \"Sublingual THC Tincture: experience with Hash (oil) (ID 41802)\". Erowid.org. Jul 7, 2005. erowid.org/exp/41802",
 "substance": "Hash (oil)",
 "bodyweight": "165 lb",
 "report": "<p>Preparation of the sublingual tincture:</p><p>I decided to make and try a sublingual tincture of THC, mimicking a recipe I found in a peer reviewed journal discussing the pharmacokinetics of THC administered in this fashion.</p><p>For those who are interested, the reference for the paper is:</p><p>Guy, G. W., and Flint, M. E. 2003. J. Cannabis Therapeutics. (3/4):35-77.</p><p>I am a fairly frequent marijuana smoker, smoking on average once a day, typically in the evening before bed. This pattern of use has been ongoing for the past 3 or so years. The aim of this experiment was to find another method for administration of the drug, reducing the risk of lung damage/carcinogenicity from smoked marijuana.</p><p>A slight modification of the recipe was used: The authors used 5mg of pure THC per mL of (4mL:4mL:2mL) glycerol:ethanol:propylene glycol. I don't want to infringe on anyones IP rights, and had no PG source other than antifreeze, so decided to omit the PG from the preparation. In addition, peppermint oil which was reported used as a flavouring agent was also omitted.</p><p>A glob of hash oil, about the size as an uncooked pea, was emulsified (by shaking) in 4mL/4mL of 95% ethanol/glycerol (Everclear/glycerin USP, from local pharmacy), in a small, capped vial. This proved difficult to do; when added to the ethanol:glycerol emulsion, the oil caused the solution to separate, and formed a micelle at the interface between the two layers.</p><p>A small drop of olive oil was added to the suspension, which was then gently heated until the alcohol layer on top began to bubble. Upon vigorously shaking the hot solution, it re-emulsified, and the oil remained dissolved without any more fight. The resulting solution was homogenous, and black in colour. The solution was then allowed to stand at room temperature overnight, and the oil remained.</p><p>Dosing:</p><p>Before dosing, I brushed my teeth and the underside of my tongue, and followed with a mouthwash swish to remove any dead cells that could hinder sublingual absorption. I held about a teaspoon of the liquid (T=0) under my tongue for 10 minutes, spit it out, then repeated (T=10min) with the remainder of the liquid for another 10 minutes. I decided to spit the liquid out rather then swallowing to make sure that any observed effects were due to sublingual rather than oral absorption of the tincture.</p><p>The tincture caused some discomfort in my mouth during the first two or three minutes under the tongue. It stung a fair bit, and also caused my tongue and the backside of my lips to become slightly inflamed. The authors of the paper describing the recipe said the tincture was 'well tolerated in all test subjects', but this only really suggests the absence of serious adverse reactions to the preperation. I'm not certain if the missing propylene glycol would have prevented the mouth irritation, or if the subjects in this article experiences it as well. Perhaps this effect was due to some isopropanol present in the starting hash oil?</p><p>Experience:</p><p>I'm not going to waste my time describing how a THC high feels; rather I'll compare/contrast this form of administration with smoked marijuana</p><p>- First effects felt at T=25min, with a gradual build until around T=60min.</p><p>-Peak high lasted till around t=3hrs, with comedown as gradual as onset (T=4.5hr until baseline)</p><p>- High was mostly a body stone. Some mental intoxication was present, but to a lesser degree then when smoked. Certain aspects of the mental intoxication seemed all together missing, however I couldn't quite place my finger them</p><p>- The discrepancy could be related to the size of dose used. I selected a dose of oil comparable to what I might smoke, but I find I usually need to exceed my typical smoking dose with oral marijuana consumption.</p><p>- Very little burn-out/comedown from the experience, compared to smoking and oral administration</p><p>- I'd likely attempt this again, but in the future use a slightly larger quantity (or higher quality) of oil, and maybe cut the amount of liquid used in the preparation in half.</p><p>- I prepared more of this a few days later, using a smaller initial volume of ethanol/glyercin. I had a much harder time dissolving the oil, and had to slowly add more volume, heat, shake, and repeat, until the oil had completely dissolved and the solution appeared homogenous.</p>",
 "year": "2005",
 "id": "41802",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-07T07:00:00.000Z",
 "views": "58374",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "sublingual",
   "substance": "Cannabis - Hash",
   "form": "(extract)"
  }
 }
}
