{
 "title": "Control Freak",
 "author": "Damned",
 "citation": " Damned. \"Control Freak: experience with Mushrooms (ID 41810)\". Erowid.org. Sep 27, 2006. erowid.org/exp/41810",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(ground / crushed)",
   " T+ 0:00",
   "1 glass",
   "oral",
   "Vitamin C",
   "(liquid)",
   " T+ 0:15",
   "2.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>Control Freak</p><p>---------------</p><p>T-7:00</p><p>Me and a friend are driving home from work trying to sneak between rush hour traffic after dropping our boss off.  We pull out of the driveway and are suddenly struck by a bus doing 40mph. We both walked away with no scratches, amazingly. I was worried that this near death experience may come up in my trip, but that turned out to be the least of my problems.</p><p>T+0:00</p><p>I grind up 3.5 grams and mix with a vitamin-c concentrated drink , stirred, and chugged. minutes after I start munching on the other 2.5 grams.</p><p>T+0:15</p><p>Very jittery , I can tell this is going to be a crazy night. The effects keep building stronger and stronger. I'm sitting next to my computer watching live in Pompeii with all the lights on. the visuals are alot more overpowering at the moment than the body buzz. i turn on 'Jerry Garcia - bird song' to put me in a good mood.</p><p>T+1:00</p><p>Its twelve o'clock, my the second batch of mushrooms seems to be kicking in. Everything I see and do seems to be looping, like some continuous deja vu. I shut the music off because its just so intense I can bearly stand it. I decide it's about time to slip into the darkness and put on the hours of pink Floyd I had on my playlist. so I turn off all the lights, tape off any little small light source there is in my room. I lay down in bed and throw my headphones on and spark up a spliff. This is where shit went crazy.</p><p>Before i go any further I'd like to add that my high dose experience was about a year ago, it was on 4 grams of mushrooms and 3 grams of Syrian rue, this experience was very frightening as I had never done such a dose. After that mistake I decided I needed to do alot of preparation before I did such dose again, and that i would do only a pure dose of mushrooms, without the maoi because the maoi seemed to bring a very serious trip that I don't think anyone should have to deal with unless they are very experienced. Mushrooms are nothing to toy with!! As I'd hope most of you know. well anyway onto the journey.</p><p>T+1:20</p><p>I put the spliff out, the mind loops are beginning to subdue me, and that's when the feeling set in, the feeling I only had on my last big dose, the feeling I've been preparing for. I was disconnecting from everything, I was shot out of my body, the fear set in as soon as I realized I was not in control again, this was it, I was dieing. There was no darkness, the visuals were so overwhelming, something straight out of an Alex Grey painting. I was trying so hard to just let the mushrooms take me but the thoughts came back from the last trip , I was so worried I was going hurt myself or someone else if I did not gain control soon.  I looked at the clock, what seemed to be days in this hell was only 5 minutes. I was in for a long ride. every now and again I would find myself again and I could hear a voice in my head saying 'just ride it out', and I think I heard my name at some point, which brought me back for a slight second. I was flying through some hyperspace, 'I' being I don't know. I physically was not to be found. it was like a bad dream, but suddenly I would find myself again , and everything calmed down , everything almost came to a complete stop. then boom! I was off again lost in what I thought was my room.  I kept thinking to myself that this was a bad dream and everything would come-to soon enough. Found the most comfy spot in my bed and huddled up to get nice and cozy.</p><p>T+2:30</p><p>the last few hours have seemed like years. still 'I' am not anywhere near reality. the room i was in wasn't mine, in fact wasn't much of a room at all. i still had NO control over my thoughts, feelings, or body. I was scared to think that if I did fall asleep that I might do something stupid without even knowing it, such as wandering outside or causing physical harm to me or others.  My ego was blown apart, I had literally felt death, and somewhat accepted it's presence.</p><p>T+4:00</p><p>Over the last hour I spent in awe as I was some entities, in language and tone like none other, this is where I gained all the knowledge I learned previously before the trip had began, I was being reborn a new. I got my first glimpse of reality and taught myself to see and recognize where I was , who I was, and what I was doing. The visuals were still very intense, but I was back in my room rather than flying through space, so that was a relief in it own. I found my headphones and put echoes on, I drifted into a deep sleep somewhere towards the end of the song.</p><p>T+9:00</p><p>I wake up to the phone ringing, I'm glad to hear my girlfriends voice, exactly what i needed o hear after a long trip to hell and back. The rest of the day I've had a very nice after glow. i feel VERY refreshed. almost as if all the bad thoughts i once had had been flushed out of my body. i will try this again when the time is right, but i think i will step it down to 5 grams, mckenna style.</p><p>All in all it was an amazing trip, although there were alot of times of being very frightened and out of control. I dont think there is a bad trip, its just how some people take the language of the mushrooms.I dont think I will fully be able to welcome the full ego-dissolving mushroom dose for a long time to come, but hey this was never supposed to be easy from my experience mushrooms are a life long journey, practice makes perfect. But its not about the goal, but the journey.</p>",
 "year": "2005",
 "id": "41810",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-09-27T07:00:00.000Z",
 "views": "3936",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(ground / crushed)"
  }
 ]
}
