{
 "id": 4182,
 "title": "Cure for Backpain",
 "date": {
  "submission": "2007-04-26T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Toadstool",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 Tbsp",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  }
 ],
 "report": [
  "I have recently been experimenting with kava kava for its calming and clarity effects and have found that I enjoy kava kava very much.  The enjoyment of this plant is variable according to the preperation and quality of the plant itself.  However, with the correct preperation and root this plant has provided me with a number of benifits.",
  "To prepare my kava kava I find that two ways work the best, one a blender and two a traditional method of preperation.  When I first started using kava I had a course ground root.  I would put about an ounce in a blender with one cup milk and one cup water and blend for 5 minutes.  I would then strain using a tshirt(which is very difficult). ",
  "Soon after I began using kava I order some fine 12 year old root from a Hawaiin provider.  I found that I could mix this directly into a beverage and simply swallow the root.  However, I found that in order to achieve the desired psycological effects, I would have to consume enough kava that I experienced gastrointestinal discomfort and often vomitted.  I also attempted to blend this root and had better results than before, but still had so swallow the root.",
  "Finally I decided to do some research and discovered that the most traditional method was to put the powdered kava in a pouch and massage it in water for 5 - 10 minutes.  This results in a very brown/grey and very potent drink.  Don't be fooled though, the kava isn't water solvent, this is actually the very fine kava powder in the drink.  Preparing the kava in this manner not only provides the best physical effects, but it also preserves the kava.  While I started using upwards of an ounce for one mildly potent drink, I know use less than a handful for a very very potent drink.",
  "However, when making a potent drink, you must also haev quality kava.  This may be difficult to judge as most people buy it from an internet provider, but be sure you look for root that is at least 12 years old.  Different parts of the root also contain different levels of kava lactones.  When you find a quality site, they will explain which parts are the best.",
  "Now that I have learned to prepare my quality I have found that there is primarily one aspect of this gift that many people over look.  I suffer from hyper tension in my lower back.  This causes me great discomfort and is made worse because I am a student and work full time so I must sit all day.  The only thing that has helped the tension in my back in the past was strenuous abdominal training, however one cup of kava works like a charm.  Not only does the kava numb the pain, but it also relaxes the muscles and alows them to repair themselves, so I benifit from this for a number of days after consuming my kava.",
  "Another effect I really enjoy is the clearing of the mind.  Kava really helps me get homework done, especially when it is writting.  It clears my mind of all the garbage and allows me to focus on jsut one thing.  Perhaps this is why it has been traditionally used in decision making by polynesian tribes.",
  "Finally, I greatly enjoy the effects it has on my dreams.  I am a lucid dreamer and this has provided me with dream that cause greater internal conflict and has enabled me to over come them, which further eliminates stress in my life."
 ],
 "erowid": {
  "id": "28198",
  "citation": " Toadstool. \"Cure for Backpain: experience with Kava (ID 28198)\". Erowid.org. Apr 26, 2007. erowid.org/exp/28198",
  "substance": "Kava",
  "views": "13729"
 }
}
