{
 "title": "Amotivational Syndrome",
 "author": "Anthony",
 "citation": " Anthony. \"Amotivational Syndrome: experience with Cannabis (ID 41824)\". Erowid.org. Jul 20, 2008. erowid.org/exp/41824",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cannabis",
   "(daily)"
  ]
 ],
 "report": "<p>I've had an odd happening occur to me recently, with what a non-smoker may think of as 'heavy' marijuana smoking, and I'd like to share my occurance from my personal view on what 'amotivational syndrome' might actually be.</p><p>I began smoking pot in grade 8, somewhat often, in grade 9 I did only rarely, and from the summer switch to grade 10 I started smoking again on account of I was very depressed and nothing seemed to be helping. I know for a fact that depression had nothing to do with my previous experiences with weed. I would smoke everyday but because of my low tolerance from barely smoking the year prior and what I smoked would amount to only about 2 grams a week. With putting myself in a great environment (primarily listening to Pink Floyd) and smoking just a few hits every night, I noted an extreme change in my personality after a couple of weeks, as did others.</p><p>When grade 10 took in I cooled down and smoked a couple of times weekly, not to 'escape' but to enhance my mind and perception of life, which all drugs are truly for. But then I started smoking increasingly before christmas, and before I knew it I was smoking grams daily (of what I'd think would be labeled very good canadian hydro). I wouldn't think of myself as an addict, but it's not healthy to smoke that much I don't think. Marijuana had lost it's title as a 'drug' and seemed to me as more of a habit.</p><p>I found that my thoughts had gotten more off topic of my own happy life, and I felt less influenced to do things. Here I must add that I've taken Dexedrine for Adhd since just before I went back to school, and that's been a help too. But even with that I was 'going downhill' in my own opinion. I wouldn't consider myself in the least bit 'unstable', but just plagued with strange thoughts of conspiracy, no motivation, and not just tiredness, which I have but it's not a problem, living life slowly is the best way to live it, but laziness. Before Christmas I was extremely motivated by music, by playing music, by my goal to be a musician or a poet, and by being who I am. After I became an everyday smoker it feels kinda like I lost who I am, I'm less motivated to do things, and being a musician seems too long term and unrealistic to accomplish.</p><p>Recently I've stopped smoking, completely, for a little while until I can get my head cleared and go back to enhancing my mind and carrying out long term goals for myself. Today it's been 8 days since I've smoked a joint, and I'm drinking a lot of water and eating healthy to flush myself of the THC in my system. So far I feel better, it's a bit hard to do but I know it's not worth it to quit now. I don't really know why I'm writing this, maybe just to share my point of view of something.</p>",
 "year": "2005",
 "id": "41824",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-07-20T07:00:00.000Z",
 "views": "6851"
}
