{
 "title": "THC Immunoassay Experiment",
 "author": "sensei",
 "citation": " sensei. \"THC Immunoassay Experiment: experience with Cannabis Drug Testing (ID 41823)\". Erowid.org. Mar 29, 2005. erowid.org/exp/41823",
 "substance": "Cannabis Drug Testing",
 "bodyweight": "",
 "header": [],
 "report": "<p>An experiment to verify how long THC (Marijuana) metabolites are detectable with an immunochromatographic assay test within single use.</p><p>My idea is not to try to give scientific-like descriptions which in my opinion are absolutely ridicolous in this context since I'm not a scientist.  All I want to do is provide truthful information with quality fotographs of the process.</p><p>The goal of the experiment was to find out how long THC really is detectable in urine with a standard 50 ng/l immunochromatographic assay test within single use.\r</p><p>The idea of the test is simple: If it shows 1 mark the result is positive (you fail). If it shows 2 marks it means the result is negative (you pass).  Note that even a light strip is still considered negative for THC.</p><p>The person that held the experiment is an 18 year old male weighing 69 kg. An occasional marijuana smoker.  The last time he used the drug was two weeks before and by the time of the experiment he was completely clean from traces of THC.</p><p>No excessive amounts of liquid or other psychoactive substances were consumed during the experiment.</p><p>The process:</p><p>Day 1:\r</p><p>22:24 Before smoking, a test was done to make sure that the subject is clearly negative.\r</p><p>22:45 Substance ingested. To be exact, somewhat half a bowl (approx. 0.2 grams) of quality Dutch Passion Skunk #11 (ground bud and leaf mixture) which resulted in 2 and a half full puffs.</p><p>According to other people's opinions 3 hits of this stuff was enough for a good trip. The trip was in fact quite good.</p><p>Day 2:</p><p>22:36 Test performed. The result appears to be positive although a very slight trail of the second mark remains.\r</p><p>Day 3:</p><p>22:25 Tesing performed again. The result is now clearly negative.</p><p>Conclusion:</p><p>THC is detectable using the simple immunoassay strips only for one day after use if a rather small amount had been ingested.</p><p>Previous experience allows me to conclude that if the quantity (or quality) were higher the time in which the metabolites could be detected wouldn't be longer than 2 days.</p><p>This once again proves the idea of the 'possibility of smoking on friday and being clean by monday' and also proves that the facts presented in the 'THC calculator' are wrong.</p><p>Happy smoking!</p>",
 "year": "2005",
 "id": "41823",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-03-29T08:00:00.000Z",
 "views": "36555",
 "dose": []
}
