{
 "title": "Walking on Water",
 "author": "rivermars",
 "citation": " rivermars. \"Walking on Water: experience with Calamus & Damiana (ID 41866)\". Erowid.org. Oct 11, 2005. erowid.org/exp/41866",
 "substance": "Calamus & Damiana",
 "bodyweight": "120 lb",
 "header": [
  "DOSE:",
  "0.5 cups",
  "oral",
  "Damiana",
  "(tea)",
  "",
  "2 Tbsp",
  "oral",
  "Calamus",
  "(tea)"
 ],
 "report": "<p>3 pm weekday after hours of redundant scanning and absorbing myself with damiana tea (6 cups water - half cup damiana) with hot chocolate and soymilk... </p><p>I made up a 2 cup batch (heaping) of the chopped still soft root with 6 cups of water, steeped in a tea maker, steeped repeatedly with green tea until the 'tea' was a deep amber color and very robust in scent.  (think I may have ran it through the maker 6 times.) Then let it set to 'tighten' a bit. </p><p>I poured a 8 oz glass and sat outside on the balcony to chill out.   As I drank it I did my usual chores (enjoying the first really warm day of the season) watering the plants, checking the lights, sweeping the chicadee dropping into a dust pan and trashing it.   I didn't notice much until I sat back down to catch my breath.</p><p>I felt a tad bit like someone was nudging me and like the balcony was leaning a little.  Like a pleasent vertigo.  I enjoyed it cautiously while I sat to clean up my water fountain of the same chickadee treats they left behind for me all over the balcony. I felt a wee bit happy, it seems now I realize I had a smile stuck on my face the whole time and the sun was warmer than usual on my skin.</p><p>I went back in to finish up the pot.    As I was doing this it felt like the carpet was thicker and spongier than normal.  Not unpleasant.  Seemed brighter than usual in the apartment also.  No audio hallucinations, just very mild 'enclosed, cushiony feeling blanketing me and this comfy vertigo imitation.</p><p>I repeated my prior steps on the balcony.   I noted I had to urinate more and the heartburnish feeling I had from drinking way too much damiana had settled down considerably.  I lost track of time but by checking quickly only one and a half hours  had passed.  (to me I figured it was 6 oclock already) </p><p>The vertigo increased now like swaying, water like swaying.  Still not unpleasent, calling it vertigo is almost unfair.   Soon as I proceeded to go to urinate again (I enjoyed the urinations, it felt very full, clean and completed)  I didn't even feel bloated anymore from all the moisture I had consumed earlier.  No queasiness, no anything stomach wise.   Rather appealing that I didn't feel my guts at all.   I also include that it felt like I was walking in tide pools, gentle, soft, pillowy.   Everything swayed a little. I had to soon prepare a meal, chores were effortless and everything had halos around it, very nice.   Smells were strong, my sense of hearing peaked a tad, nothing incredible though.  Peripheral vision was interesting.  Thinking I was seeing things in my side views but it was just nothing of course.   Visual echoes remained longer than normal.   (looking at something bright and the image hanging in my vision a while longer than before my consumption of the root).</p><p>As I got dinner ready I was chippier than usual, more talkative, goofier, thoughts seemed cleaner, less effort prone to think of 'cognitive explatives' when I made remarks.  Seems my dictionary was open in my head and the words came easier.</p><p>I felt a clarity also.</p><p>The flavor of food had changed, intersting most times, unpleasant with others like chocolate and water had a weird tangy aftertaste.  (tart with a hanging zing to it.  Like watered down poprocks that still go off in your mouth) </p><p>I will do this again of course.   Making note I'm on hypertensive medications (about 6 of them).   i.e.:  clonidine, metropolol, norvasc, hydralazine, (lipitor for cholesterol)  and a nitrolgycler patch (topical).</p><p>No hangovers, no heart rate changes, no weak feeling in the chest like I got from kratom as it wore off.  (from the same process as a tea, mild starter experiment).</p><p>I've chewed calamus and got no real results, only because the 'strong bitter mint' flavor and acidic juice kinda gave my belly a run for its money.   Smoking it was too much for the throat and letting it dry  more to turn it into a powder seemed like making it weaker and less desirable. Next time I'll do exact measurements for accuracy in reports.</p>",
 "year": "2005",
 "id": "41866",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-10-11T07:00:00.000Z",
 "views": "13863",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 cups",
   "administration": "oral",
   "substance": "Damiana",
   "form": "(tea)"
  },
  "1": {
   "time": "",
   "amount": "2 Tbsp",
   "administration": "oral",
   "substance": "Calamus",
   "form": "(tea)"
  }
 }
}
