{
 "title": "Incredible First Encounter",
 "author": "Evan",
 "citation": " Evan. \"Incredible First Encounter: experience with MDMA (ID 41864)\". Erowid.org. Dec 25, 2006. erowid.org/exp/41864",
 "substance": "MDMA",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>The following is something I wrote a few days after my first experience with MDMA. Twice since I have taken the drug with similar results. I was nearly 27 years old, and had only smoked pot before trying this marvelous little number. MDMA lifted me from the depths of depression and anxiety I had been living with for years. I only caution against 'planning' a situation or scenario to achieve your own bliss. It was only when I let it all go that I could take it all in!</p><p>An incredible first encounter with ecstasy.</p><p>Sylwia had been staying with my girlfriend, Ellen and me for a few days while she waited for her dorm to re-open after winter break. Ellen had been working with her for a few months and they had become friends, but the three of us had spent minimal time together. As I was just beginning to loosen up around this new friend our time of sharing a space together was nearly up. But then an offer was made. Sylwia owned a quantity of high quality ecstasy pills and she was willing to share them with us. For a mere $20 per dose we were promised a magnificent experience, the likes of which we were unfamiliar. Our friend had done a great deal of research on the drug, and had also used it several times, so as she explained the risks and rewards we became comfortable and willing to sample a drug with a bad reputation.</p><p>I arrived home from work with a nervous energy that had me zipping around the house scrambling to make everything just right for our evening of play together. Only after a few hours of tripping would I understand that our surroundings were scarcely important, if at all. I picked Ellen up from work a while later scared that she may have changed her mind about taking the pills. I was so eager to have this adventure that I manifested a reason for it to go wrong and Ellen seemed the easiest person to blame. I realize now that my own hidden fear and doubt was the actual culprit. In a few moments we were at last all together and the orange juice drinking began!</p><p>Popping one tiny pill each I said aloud, Its done now. Ellen agreed while Sylwia purred and gave a knowing smile. Ellen needed a shower and I, a couple of relaxing cigarettes. I was a little frightened of what I might do or say as our evening progressed. Most people that I had spoken with about the drug gave accounts of great physical and emotional bonding with hugging, kissing, fondling, and even occasional fucking. Ellen and I have a semi-open relationship, but my potential desire to get my love on with another woman while rolling on E was making me anxious. I was immediately aware of the fact that we hadnt discussed being intimate with our friend. We always talked before situations like this and made a mental list of sorts containing acts that we were each comfortable with, but the time for negotiation had passed and I was filled with fear.</p><p>The effects of this lovely pill kicked in after about forty minutes. I sat on a couch while Ellen and Sylwia lay next to each other on the floor talking evermore intensely. Feeling tingly, but a bit left out, I sat and watched my companions with a heavy gaze that did nothing to conceal my urge to be near them. Ever aware of my hesitation, Ellen invited me to lay with them and Sylwia quickly followed with her own request. I stretched out next to these two beautiful women placing my arm across Ellens waist and BANG; the whole room was cozy and soft. On the other side, Sylwia completed the wrapping of Ellen by reaching her arm over mine, sliding her hand across my sweeties belly. Euphoria, bliss, and happiness all crossed my mind as a means to describe this feeling, but only one word would really do; ecstasy! I left my world of negativity, stress, anxiety, fear, and reluctance and quickly arrived in the small village of ecstasy, population three. Three bugs snug on a rug. But then I remembered an earlier phone call and an invite that Sylwia made for another to join us. He would not be tripping, and I was quite sure this intrusion would ruin everything.</p><p>I sat up in a hurry and my warm, fuzzy buzz was gone. I whined at my companions to call him and recede the invitation, but unlike me, they were excited to have a visitor. I lay back in our cocoon and was amazed by how quickly I accepted the idea of another guest. By the time he arrived I was ecstatic to shake hands with a stranger that only minutes before I was cursing to hell. His name was Brook, and for the next few hours I savoured him as one of the greatest men I would ever meet. Little did I know that the peak was yet to come and the rest of the morning would bring revelation and indescribable discovery.</p><p>Sylwia, you have to kiss my boyfriend and feel what a wonderful man he is, Ellen proclaimed. Without thought or hesitation she leaned over and pressed her lips on mine. Perhaps overzealous, I kissed back softly with much tongue. Oh fuck does that feel good, were the words that sprang from my mouth. Immediately kissing Ellen I knew that I needed more connection and much more contact. Sylwia then asked me for a backrub and I happily agreed. But just as I began Ellen hit a low, which made her quite uncomfortable with my touching. As if reading our minds Sylwia interjected, none of this is sexual to me. Typically my reaction would have been to say, of course its not, but be thinking, oh yes it is. But this time I said the former AND thought the former. This wasnt about sex; it was about sensuality and perhaps even sexiness. It was about every touch, word, and thought being meaningful and important. This drug made us really feel everything around us with complete euphoria, while maintaining mental competence. Two half-naked strippers were before me and screwing either of them was the last thing on my mind! To an incredibly horny fella like me, that moment was profound.</p><p>We spent a total of about nine hours just talking with our hands and lips brushing, stroking, and massaging one another. Ellen and I got past the previous lack of communication about intimacy by the three of us simply asking each other if we could do this or that. May I kiss your hand, your nipple, your tummy. Would you mind if I rubbed your legs, your ass, your head. It was a revelation for me as I am usually quite afraid to ask others for something that fulfills an emotional or physical need. Moreover, it seemed completely appropriate to say such things, and I cannot recall anyone being denied a request. The positive energy in our dimly lit oasis was radiant enough to have me still buzzing two days later. Compliments shot like laser beams between us because we were not concerned with our own egos. Instead, we all wanted to make each other feel good while achieving satisfaction with physical closeness and love giving. As hot and intensely as an outsider may have described our cuddle fest, I still havent had sex or gotten off after four days of recalling our magnificent evening. All I really want to do is snuggle with my two ecstasy friends. Fear, stress, and my usual high level of anxiety seem irrelevant and useless, as I only want to give love and feel acceptance.</p><p>The largest challenge in my life right now to achieve self-actualization is to love and communicate without fear. I need the ability to deflect negativity before it reaches my inner core and turns all my days frustrating and difficult. I must find a way to think positively before rushing to negative judgement, and create a mindset that gives and receives love without being afraid or reluctant. I do not accept or pass love nearly as well as I want and I am quite seriously worried that my past and current patterns of thought and communication will plague the rest of my life. Its all a bit dramatic I know, but time isnt going to slow down and wait for me to catch up. More importantly, the people that I care for will most certainly not pause their lives to wait for me to finally let go.</p><p>Ellen, Sylwia, and a little pill called ecstasy lifted much weight from my tense shoulders. At long last, I can reach up and touch bottom.</p>",
 "year": "2004",
 "id": "41864",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-12-25T08:00:00.000Z",
 "views": "5868"
}
