{
 "title": "Pleased",
 "author": "Tenzin",
 "citation": " Tenzin. \"Pleased: experience with Rhodiola rosea (extract) (ID 41868)\". Erowid.org. Aug 9, 2005. erowid.org/exp/41868",
 "substance": "Rhodiola rosea (extract)",
 "bodyweight": "160 lb",
 "report": "<p>This is a report on my first experience with Rodiola Rosea Extract. In the last ten years, my experience with entheogens include psilocybin, cannabis, MDMA, cocaine, alcohol, caffeine, tobacco, and Salvia divinorum. I am an experienced though now retired psychonaut, and my only habit that I currently am weeding out is Starbucks double shots for work. However, I found that with caffeine, for me, and possibly others, there's a point of diminishing return, where after too much caffeine in one day, my mind starts to simply withdraw and in my case, produce headaches. I enjoyed the boost I got for an hour or two from the rush of the double shot, but after several days of very little sleep and intense work loads, I started to seek an alternative to caffeine.</p><p>Enter Rodiola Rosea. This is a substance which apparently is similar to caffeine, but without the withdrawal headaches or what's termed asthenia (fatigue, decline in work capacity, trouble falling asleep, poor appetite, irritability, and headaches).</p><p>Here is my experience so far:</p><p>(T+2:00) I feel a slight boost in energy, a little fidgety almost, not sure if it's a placebo effect, but seems like I can breathe a little easier and noticed sharper vision twice, once when driving, and again when I sat down here.</p><p>(T+2:30) I do feel some effect from the supplements. it's a new experience so it's hard to pin point what it is that I'm feeling. but I do feel the urge to keep working, just like when I have a Starbucks double shot, which is very good considering I didn't have caffeine to feel this way, need to research  that active ingredient</p><p>(T+4:00) I definitely feel some kind of change in my state. It's a little hard to describe, but it's like, having the motivation I get from caffeine, but without feeling edgy or irritable, still being able to stay in a calm state of mind, yet feeling like I have to do the next thing, and keep going. I also noticed my appetite is somewhat suppressed. I don't really  have an urge to eat yet, though I should be.</p><p>It is now (T+6:15) and I definitely feel that something is keeping me going that is not caffeine. My mind is clear, yet not lethargic as I would be if it were two double shots by this time. Also to note, I feel calm like after five days of not having any coffee products. I read in a research paper that Rodiola Rosea also has a calming effect on the nervous system. I'm quite pleased with the discovery of this herbal extract and will observe further use to see how it affects my overall wellness over the next several weeks.</p>",
 "year": "2005",
 "id": "41868",
 "gender": "Male",
 "timestamp": "2005-08-09T07:00:00.000Z",
 "views": "16816",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Rhodiola rosea",
   "form": "(extract)"
  }
 ]
}
