{
 "title": "I Am",
 "author": "Emerald",
 "citation": " Emerald. \"I Am: experience with H. B. Woodrose (ID 41871)\". Erowid.org. Dec 30, 2007. erowid.org/exp/41871",
 "substance": "H. B. Woodrose",
 "bodyweight": "115 lb",
 "report": "<p>After having tried many of the 'legal' highs, including DXM, salvia, sinicuichi, and amanita muscaria, along with some prescriptions (opiods and muscle relaxers), my interest turned to this little plant called Hawaiian Baby Woodrose.</p><p>Before this, I'd tried some dissociatives, deliriants, and such (see above), but never gotten very impressive results. DXM managed to make me feel horrible for six hours, dramamine was comparable to self-induced schizophrenia. I had thought that I might never enjoy the 'psychedelic' drugs and that they were a waste of my time. But oh, was I wrong.</p><p>I decided on a pretty average dose, 5 seeds, taken orally without any special preparation at 4:45pm. I knew about the nausea; fortunately I had only consumed liquids that day. Afterwards, I decided to take a shower so that I would be in the right place if extreme nausea hit. About an hour after, I started to feel the nausea, but it wasn't overpowering.</p><p>About two hours after the dose, I began to feel heavy and lucid. I realized that I was having trouble focusing. I lied down and a sense of vertigo seemed to come over me; it was as if the room were spinning. My thoughts were becoming jumbled; it was as if my mind were confused. An extreme kind of physical discomfort came over me. I realized I was having trouble breathing and that my heart was pounding rapidly. At the time, I had some allergies and had taken pseudoephedrine HCl beforehand. I'm not sure if this could have contributed to it. I calmed down somewhat but was then interrupted by my mother, who came in and claimed I had a phone call. With great effort, I managed to explain that I wasn't feeling well. Talking coherently was becoming difficult.</p><p>I realized then that I was beginning to lose control of my mind, much like LSD, and that I needed to get myself to a safe and private place where I would not be interrupted again. So, I got up and locked myself in the bathroom and took a bath. Eventually, I could not hold myself up and simply lay on the floor. This is where a seemingly unpleasant experience changed drastically.</p><p>Suddenly, I was not myself anymore. I was everything. I became the universe, life, death, all consciousness at once. I wondered if I was dying. Fears flashed through my mind - what if my mother found me here, dead? But no, I reassured myself, no one has died from these little seeds. I felt suddenly incredible. I was united with the universe, while staring up at the bathroom ceiling. Revelations pounded my mind, as my heart pounded along in unison. Are we all like this, connected? Are we all.. one? What am I? I.. am. I breathed, and it felt like life itself was flowing through my lungs. I got up, and I realized my eyes were more dilated than I had ever seen them before. I went back to my room and stared out the window in awe. How beautiful everything was!</p><p>Portions of the trip were not as pleasant. After this, my mind dwelled on broken relationships I had been avoiding. I actually began to cry, wondering why I had let these precious things fall apart. Then I came to several profound realizations about these things which I owe to the Woodrose. I woke up the next morning feeling as if I had experienced a great catharsis, and that many of my burdens had been lifted from me. I felt an overwhelming love of nature and creation, and that I had been redeemed by God.</p><p>From what I read later, much of what I experienced is comparable to a full blown LSD experience, minus visuals. I plan on taking another journey with Woodrose very soon. I may increase the dose slightly, but 5 seeds seemed to be pretty adequate for me.</p>",
 "year": "2005",
 "id": "41871",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-12-30T08:00:00.000Z",
 "views": "8059",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  }
 }
}
