{
 "id": 4188,
 "title": "Voluntary MDA experience",
 "date": {
  "submission": "2000-09-11T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Seto",
  "gender": "Female",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "My friend absolutely love taking 'Pure Loves' which is 100% MDA.  He describes them as a really intense trip. It doesn't hold the lovey-dovey feelings of MDMA, but you still feel really good.",
  "I am always willing to try anything (as long as it doesn't kill me the first time), so i agreed to taking a pill.  He warned how strong they were, so i heeded and only took a half.  I must confess i had a slight hint of sadness at the party, but from past experiences with pill popping, i usually forget about the problem once i'm x'ing.",
  "The first hour, i was feeling anxious.  I felt i was wavering between the edges of euphoria and a nervous breakdown.  With the added pressure of thinking Happy Thoughts.",
  "Come the second hour into it, i was emotionally dark & drained.  i was spiralling into a realm of depression.  There were no florid reactions.  i  still felt like i had control over my body, but i was psychologically screwed.",
  "I sat and sobbed.  Then along comes a fellow who's been there and was willing to help me out.  We talked and his insight & advice brought me out of the emotional pit.",
  "In short, MDA is pretty hardcore.  Only if you're emotionally stable at the moment would i recommend trying it.  Even then, i recommend taking only a half. Had i taken the whole pill, i would probably be viciously hallucinating.. i can only imagine how intensely out of control i would've been."
 ],
 "erowid": {
  "id": "2821",
  "citation": " Seto. \"Voluntary MDA experience: experience with MDA (ID 2821)\". Erowid.org. Sep 11, 2000. erowid.org/exp/2821",
  "substance": "MDA",
  "views": "17985"
 }
}
