{
 "id": 419,
 "title": "Hell No!",
 "date": {
  "submission": "2002-02-20T08:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cuisinart",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 nuts",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "To this day I NEVER want to smell or taste nutmeg again.",
  "It all started about 5 pm when after reading a book of herbs, trying to find legal means of altering my mind, nutmeg popped up. It never discussed the dose though. I went to the local supermarket and purchased 1 small bottle of whole nutmeg. It probably contained about 15 small nutmeg nuts. I took it home, ground it in a food processor until it was nothing but dust. I downed it the hardcore way..... There was probably about 1/2 cup of the powder, and spoonfull by spoonfull I shoveled it down my throat followed by guzzling water to get it down with. That was about 7:00pm. By 9 pm, I felt ... wierd. I can't explain it. I went to bed with my (now x-wife) and started feeling horny as fuck. I mounted her like there was no tomorrow, and needless to say, REALLY got into it... After another hour or so of just pure passionate fucking, I suddenly stopped. I didn't know where I was, and I didn't know who she was.",
  "After thinking about it, I didn't know who I was either. This scared the hell out of me. Then the worst part.... I felt my heart racing. (Duh... of course it would be after what I had just done...), and decided to take my own pulse while highly disoriented... Not the smartest thing to do, considering that I counted 240 beats a minute. I remember slap freaking out. Going bezerk. I KNEW I was having a heart attack. We were staying at my parents at the time, (I was out of work, and we had just had a baby 2 weeks earlier, so sex shouldn't have been going on to begin with...) I burst in my parents room screaming 'CALL 911 !!! CALL 911 !!!! I'm having a heart attack!!!) So......... yup...... my parents call 911, and the paramedics rush to my parents house.",
  "Being REALLY mind fucked at this point and time, I decide to tell the truth... the WHOLE truth, to the paramedics AND my parents, describing in detail how much nutmeg I had taken, as well as the different positions I had been in. One paramedic had to go outside he was laughing so hard. They took my vitals..... I was fine. They made a call to the hospital Emergency Room and spoke to a doctor, who in returned called poison control. They told me (while laughing) to sleep it off. And I did... I slept for about 20, yes 20 hours.... straight. The reason I remember this so well, is the next day was my birthday. My mom baked me a cake (which I couldn't even eat).. I was up for about 20 minutes, and then...back to bed. The next morning about 10 am I awoke. Every muscle and bone in my body ached.  I mean REALLY hurt.... I was taking a crap about every thirty minutes, and thirsty.... I can honestly say I spent the next week of my life recovering from physical and emotional trauma.",
  "The medics may have breezed it off, but I felt closer to death than I ever have. Because of that entire experience, I now know what hell is. My advice.. Nutmeg.. don't say no...say HELL NO!!!!!!!!"
 ],
 "erowid": {
  "id": "10757",
  "citation": " Cuisinart. \"Hell No!: experience with Nutmeg (ID 10757)\". Erowid.org. Feb 20, 2002. erowid.org/exp/10757",
  "substance": "Nutmeg",
  "views": "30502"
 }
}
