{
 "id": 4191,
 "title": "Heaven Beside Me",
 "date": {
  "submission": "2003-11-07T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "theMadCap",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablet",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "bowls",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "My interest in psychoactives (drugs) is one that has grown a great deal over the past year or so, stemming both from my curiosity, and interest in my own my mind, and also stemming from the creative open portion of my mind (me being an artist). My first experience with MDMA took place roughly 2 months ago, and I would have to say it was by far the greatest, most beautiful experience in my entire life. I was extremely hesitant to try XTC to begin with, as my head over the years had been filled with all the classic anti-drug propaganda, and I'd heard and read enough stories about the horrors of an X-trip gone awry. Since I've started doing X, I've even had a few bad experiences myself. However, even through a few bad times, I can say I would have it no other way. If I could go back and change things, I wouldn't change a thing. I can't even imagine a life without having done MDMA, as it has been literally the greatest experience in my life, and a truly life-changing and revealing one.",
  "Prior to first doing X, I had the tablet on me(a blue J) for about 2 weeks or so before actually taking it. I bought the tablet at a party, feeling I had researched it enough, but even after having it in my possesion, I was wary of taking it right away. For two weeks or so, I continued to research even more, and I asked people close to me about their experiences with the substance. Everyone I talked to told me good things for the most part, and I was pretty positive about it. I also looked around around the verify the safety of the pill and to verify the substance within.  I decided finally to take the tablet the coming Friday of the second week. It was my friend 'J's girlfriend's Birthday, and I felt that if there was any place to take it, this was as good as any. I knew I would be in a good setting, with positive people who I cared for, so I felt that if anything, my experience would be decent.",
  "Little did I realize that decent would not even come anywhere close to describing the night ahead. I spent the whole day at school, and pretty much fasted all day. The day before that I ate only fruit and vegetables. I spent the day excited and enthusiastic as to the night's events. Upon school's ending, I left for my house and packed my things for the night, as I would be staying at my friend J's house that evening. Not knowing what kind of reaction I would have, I made sure that I would not have to go home that evening. Upon packing my things, I said goodbye to my parents, and made my way to J's house, which was only a 5 minute walk from mine, him living in the same neighbourhood as myself. We hung out for along time just trying to stay in a positive mood, thought I'll admit I was quite nervous beforehand. We proceeded to the local conveniance store a short distance from his house, so that I could pick up some bottles of water and some Power-aid, knowing well to keep hydrated. Safety was probobly the top thing on my mind that evening.",
  "As we proceeded back to J's, i admitted my nervousness and slight unease about the situation ahead, and J made attempts to calm me down and keep me in good spirits. Upon our arrival back, our other friend B, stopped by to hang out for abit Until J and myself had to leave. The moment of truth came and with J and B as my witnesses, I downed the blue, sour-tasting tablet with a swig of BerryBlitz Power-aid at 5:35pm. I sat for a moment, with a strange almost-smile on my face, wondering if I had done the right thing. B suggested I start it up by smoking a bowl as it would act as a jump-start to the process. I did so, filling up my stuff into my precious little pipe. B and myself smoked the bowl, passing the time until J's girlfriend came to pick us up. We smoked 2 bowls in 30 mins, before J's girlfriend finally showed up around 6/6:10. B took off, and J and myself got in the car. There were 3 ppl in the car already. J's girlfriend 'M', her friend 'W' and another girl 'C'.",
  "The moment I got in the car, it began to take effect, and I felt a surge through my body like I've never felt before. It was an incredible body of warmth, peace. Just an immeasurable security and Euphoria I'd never ever imagined before. I sat in the car, sighing aloud in literal Ecstasy, and staring out the window with the greatest smile on my face. I don't normally smile much. The girls in the car looked at me somewhat freaked out and puzzled. I figured I should explain myself. As the incredible feeling or 'buzz' surged through me, I tried to explain myself to the girls, and that I had taken Ecstasy. They were shocked, but because they knew me, they were very understanding, and tried to remain OK with it. I at first wondered if they would all hate me for what I had done, but they all were perfect people to be with for the experience, as they immediately drowned any fears I might have, with M stating that we were all going to have a great time, and it was going to be an awesome night.",
  "At that moment, all I could do was agree as the smile came across my face again, and I was overwhelmed and enveloped within the beauty of the experience. Everyone in the car was very supportive and positive, and helped to make me feel great. I felt an insurmountable love for them all right then and there. An appreciation that I don't think I realized before, and I made this completely known to them, stating aloud the whole trip how much I 'loved and cared for them and how glad I was to be with them at that moment'. I thanked them endlessly the whole way for their support, and I just kept repeating how amazing I thought they all were. I still wonder how weirded out they all must have been when I told them them that I felt 'completely in love with each and every one of them' and when I kept repeating how I felt I was now 'one with all of them'. I don't believe they knew quite how to react, but they tried they're best, and just kept saying how 'awesome' it was that I felt that way.",
  "Finally, we arrived at our destination: HOOTERS. This, of any place, I knew would have an incredibly positive atmosphere. I'm not exactly sure why M chose to have her birthday at Hooters, I suppose just to be different as most girls don't seem to enjoy going there at all. We all went in and took our seats. I remember feeling especially clear minded and in the highest spirits I'd been in, in a very long time. I was beginning to find myself especially talkative. I just wanted to talk to everyone and anyone around me, which was something that was new to me, as I'm often pretty quiet. I don't even normally talk to M, J's girlfriend, but this night I took the oppurtunity to start talking to her, and I was completly lost in conversation with her. I felt so open, and incredibly beautiful, like nothing could hurt me. All the emptiness and alienation was gone, and there was a sense that all was good. Nothing could upset me, the world, or this moment in time. I talked to M about all kinds of things, and it felt so good. There was really so little that I actually knew about her. I also took this time to give her a birthday present.",
  "I had got her a little Buddha statue, and the appreciation she showed for it seemed to escalate me to an incredible wave of happiness that was just so new. I talked to everyone at the table, several of the people being those that I normally don't talk to. I suppose during this time I was very vulnerable in the state that I was incredibly open with everyone. However, I never seemed to say the wrong thing. I never ran out of things to say or talk about, there was never an awkward pause, and I felt thouroughly clear-headed. I felt completly enlightened, in the most litteral sense of the word, as though something truly secret had been revealed to me from the inside of my own mind. I felt I was appreciating life for the first time in my 17 years of existance, and I remember throughout the entire evening trying to describe to anyone I was talking to, trying to convey to them what I was feeling and seeing.",
  "I truly thought I reached Heaven right here on earth, and that God had offered me something that so many others weren't privelliged to recieve. I felt truly special, at complete peace, in tune with everything, and in love with everyone. I was able to have in depth conversations with people I barely knew previously, and I was given the chance to open up and fix things with a dear friend of mine, 'A', who I had not been talking to for quite some time due to an argument we had had a couple months earlier. It felt incredible to talk to her again, and I felt that we came to the fist true understanding of eachother that we had reached in an incredibly long time. We had been very close before, but the argument had torn us apart in stubborn human fashion. I was able to see through our blinded ways, and I let my emotions guide me into exactly what I needed to say.",
  "Throughout this time, I made sure to keep myself hydrated, and those around me were supportive enough to watch over me and make sure that I drank whenever I forgot (I became caught up in conversations, and forgot to drink a few times), as well my friends ordered me fries to get some substance in my body since I had not been eating, but I lacked any appetite at all. During this time, food lost all meaning to me, but I forced myself to take a couple of fries in. My mouth was so dry it was difficult to swallow in anyway. No matter how much I drank, I could not escape the dryness of my mouth, but I didn't care. It was not uncomfortable, It was just there. I was talking a mile a minute so to speak, and just was having the greatest time of my life. Despite the fact that we were in Hooters, I didn't care in the least about the girls serving us. I didn't even have one sexual urge in me, as I just wanted to become emotionally closer with everyone. The Eye Candy lost all meaning as well, as I had been transported to a higher state of being, lost in real thoughts, feelings, and true emotions that I felt from all the amazing friends around me.",
  "I felt completly connected to everyone, I was everyone and they were me. I felt I knew what everyone was thinking and feeling just by looking at them. Though it was M's b-day, I feel somewhat guilty to say that I felt that most of the attention was directed towards me. I felt as though i was feeding off of everyone's positive energy. I flet closer to everyone, and more in tune with life and the universe than I've ever felt in my entire life. Everyone was having such a great time, and I felt as though this feeling would never end, or at the least I hoped it wouldn't end. Eventually, we did leave Hooters, and we headed down to Clifton Hill which is like the entertainment area of our city and one giant tourist trap(Tourism is my City's indrustry). We walked up and down the Hill, I was walking with 'E' and she was taking me into different attractions or restaurants where we sat and talked without end. I made complete eye contact with her all night, feeling drawn into the whole of the experience. She told me so much about herself, and I just was so interested and drawn into the conversation. I wanted to learn about everyone around me.",
  "We walked around for along time, and being in a place with so many people made the experience so fantastic, again feeling as though people's positive energy was part of me. I just wanted to be with all of these people I didn't know, lost in the crowd of endless lives. When it finally came time to leave, I walked with E and the remainder of the group back to the parking area. There I parted ways with E and the others, with hugs of course. M drove myself and J back to his house, it was about 2 in the morning now. When we got in, I discovered J was upset slightly after having fought with his girlfriend on her B-day. I felt emotionally connected to him and obligated to offer assistance. We just sat and talked for a very long time, with the Scarface DVD playing on the TV screen. Neither of us paid attention or were interested in it. We talked until B came back at like 3 in the morning, along with F. We all talked and watched TV for a long time, and I spent the time until we all fell asleep describing the amazing night to everyone, and trying desperatly to describe the experience as best I could.",
  "Eventually around 5am I simply fell asleep, still mumbling, and watching TV. I woke up vibrant, and happy. Completly clear minded. We went to breakfast ($.99 breakfast!), and even at breakfast all I could talk about was the incredible previous night. I'll never forget it. And still, I always think about it, wishing I could live it out again. It was the closest I've ever come to loving and understanding myself, the world around me, and everything. I was in tune for the first time. Closer to God, and everything. I felt I had conquered my emptiness, and depression. Heaven was beside me, and it was beautiful."
 ],
 "erowid": {
  "id": "28213",
  "citation": " theMadCap. \"Heaven Beside Me: experience with MDMA (Ecstasy) (ID 28213)\". Erowid.org. Nov 7, 2003. erowid.org/exp/28213",
  "substance": "MDMA (Ecstasy)",
  "views": "7906"
 }
}
