{
 "title": "Delightful, Terrible, Delightful",
 "author": "Jut",
 "citation": " Jut. \"Delightful, Terrible, Delightful: experience with Mushrooms, Oxycodone (Oxycontin), Hydrocodone (Vicodin) & Cannabis (ID 41925)\". Erowid.org. Jul 20, 2008. erowid.org/exp/41925",
 "substance": "Mushrooms, Oxycodone (Oxycontin), Hydrocodone (Vicodin) & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "10 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)",
   "",
   "7.5 mg",
   "insufflated",
   "Hydrocodone",
   "(ground / crushed)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>It was the first day back at college after spring break and I had an eighth of mushrooms that I hadnt eaten over spring break.  I sat down on my bed with my girlfriend and ate the mushrooms.  After about 20 minutes of just sitting on my bed she and I went over to a friends dorm to party.</p><p>There were only four of us at first, so we decided to smoke a few bowls.  While lighting up the second bowl I noticed the flame begin to turn a bit purple.  This is when I knew that I was beginning to trip.  Shortly thereafter two more friends came over and we decided to blow some pills.  By the time they were all crushed up I was definitely tripping pretty hard.  I was experiencing some pretty intense CEVs and feeling very good.</p><p>We then snorted 10 mg of Oxycodone and 7.5 mg of Vicodin.  This made the trip a hell of a lot better, as I was now extremely relaxed and calm.  I think this helped a lot with the CEVs, because they were much more intense.  I was floating all around and there were vivid light patterns and webs spiraling around me.  I felt really good.</p><p>We were all having a good time and we smoked a few more bowls.  Then we decided that a hookah would be nice between the six of us, so we sparked it up.  We smoke out of the hookah for a good 45 minutes.  During this time my experience was much harder.  I kept spacing out when it was my turn, and it was good.  The CEVs were most intense here, and although it was hard to keep my eyes open, everything in the room was beautiful, everyone was happy.</p><p>Mid-Hookah, I began to feel a bit queasy from the pill drip, so I decided to pass on the next few turns.  Next thing I remember I was head in the toilet.  This is when things began to get kind of bad.  I was hearing screams, seeing crazy shit in the toilet, and making unbelievably disgusting noises.  Everyone began to worry so my girlfriend came in and relaxed me a little bit.  After seeing my puke yell at me, and hearing strange noises and becoming really paranoid for about twenty-five minutes, I decided I would try to make it back to my room.</p><p>I got up, and after about thirty seconds I was back in the toilet.  Another 10 minutes of crazy hallucinations and sounds.  I then felt able to make it back to my dorm, its only a one minute walk.  Once back, I laid down.  I figured before I get all clean and change Id let the trip continue, and it was very nice.  I just put on some music and spaced out for a little while with my girlfriend in the room.  I remember discovering myself in zombie like positions, almost like the people look like when they die in that movie the Ring.  It was weird.  The visuals began to die down at about 2:00 am so I decided to get up and get clean.</p><p>Once clean my girlfriend and I just laid down, and had plenty of good conversation, although I was rambling quite a bit.  I also felt really upset about puking and all, I was paranoid that she and all my friends were mad, but it was just the mushrooms messing with me.  The conversations lasted for a while, until we eventually fell asleep.</p><p>Overall I think it was a very nice experience, if I look past the hour or so of total badness.  I know that I got sick from the pill drip, because I always do.  I have taken mushrooms plenty of times and have rarely gotten sick.  I do think that the trip ended a bit sooner than it should have because the mushrooms came up when I ralphed.  As far as the combination goes, however, it was really nice, I highly recommend it, unless you have a really sensitive stomach.</p>",
 "year": "2005",
 "id": "41925",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-07-20T07:00:00.000Z",
 "views": "12318"
}
