{
 "title": "Surely Not Impressed",
 "author": "Sam",
 "citation": " Sam. \"Surely Not Impressed: experience with 5-MeO-DiPT (ID 41986)\". Erowid.org. Aug 28, 2006. erowid.org/exp/41986",
 "substance": "5-MeO-DiPT",
 "bodyweight": "75 kg",
 "report": "<p>After receiving 200mg of foxy in the mail, I was looking forward to giving it a try. Family members S and N were also giving it a go, after S had once tried a tiny tab of what was 2C-E thinking it was cocaine. S had enjoyed the experience a lot. My most recent psychedelic experience was an incredibly intense 5 blotter LSD experience the weekend before, and I'd been smoking a lot of Cannabis during the week-this past drug use may have affected the experience.</p><p>On a Saturday night we went to a friends house around 8:30, we had a few drinks, including champagne and a few shots. Around 10 S, N and myself dosed with between 5-10mg of 5-Me0-DiPT, while our friends dosed with ecstasy. Come up time was surprisingly long for a tryptamine, probably due to a large meal a few hours prior.</p><p>The come up was very gentle and subtle. S felt it first, said it felt a bit like a pill or half of ecstasy. N was looking very smiley and had trouble following conservations-a definite sign of psychedelic intoxication. The buzz was pleasant but subtle, similar to a low 2CB dose. Before heading out to the local nightclub, around 11, we dosed again on a similar dose to before.</p><p>The buzz increased a fair bit, and probably would have probably resulted in a pleasant experience had we not been in the very hot, crowded, noisy nightclub environment (it was Easter weekend so the club was unusually packed). I was very hot, and couldn't tell how much was due to the club environment, and how much was due to the drug's effects (I think it was almost all due to the hot stuffy club). S and I left the club with our friends and went back to theirs. It was 1:30, and everyone was still wired, be it from foxy or ecstasy.</p><p>I shared one hash joint and another mixed skunk and hash joint, and this boosted up the intensity, and a few undulating, liquid visuals appeared. I had a slight headache at this stage also.</p><p>It wasn't easy for any of us to fall asleep, and the next day I was in a state of hopelessness and despair that lasted the entire day. This was shared by N and S a well, especially unusual in that we hadn't had much. This is the first hangover I've ever had with a psychedelic drug (very similar to an MDMA hangover), and I've experienced many different tryptamines and phenethylamines, a number of times. There was no perceivable long term hangover or after effects following the day of depression however.</p><p>I won't be taking 5-MeO-DiPT again however. Last June I quit ecstasy for good due to the depression and wondering how the hell I'd allowed myself to gamble with my brain. This was a similar case, so I won't be taking it again.</p>",
 "year": "2005",
 "id": "41986",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-08-28T07:00:00.000Z",
 "views": "3399",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "2 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(tar / resin)"
  }
 }
}
