{
 "id": 4199,
 "title": "Too Many Side Effects",
 "date": {
  "submission": "2007-06-23T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Liquified",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "After reading various online reports of this Tramadol stuff, I decided to give it a whirl.  I am experienced with most of the members of the opiate family (oxycodone, hydrocodone, raw opium, heroin, etc.), so I figured this non-opiate Tramadol would be kiddie fun.  Which compared to drugs like Oxycontin, it is. I would compare it to codeine: a mellow, mild ride; nothing too crazy.",
  "I procured a script from an online med site (which was relatively easy considering this drug is not scheduled) and took 6 50 mg pills on a Wednesday night.  I cruised down to a record store and checked out the music.  Roughly half an hour after ingestion, I started to feel the effects.  A mild, slow-rising high, not unlike Vicodin or codeine.  I don't get that warm wash of euphoria I get from Oxycontin or H, but a mellow buzz.  A social buzz.  I was able to talk to people easily, which is a problem for me on the harder opiate drugs (I just mumble incoherently and stare off into space). ",
  "I left the store, and cruised home to laze out and watch a movie.  An hour and a half after ingestion, I started to really feel the high.  I would categorize it as really dopey and tiring, and not all that euphoric (the body high was mild).  I started to nod a little, and would wake up every now and then to find a new part of the movie.  I had difficulty concentrating on anything, as opiates tend to speed my stream of consciousness.  I passed out after about 5 hours and slept for about 12 hours afterward.",
  "All in all, mellow.  I was hoping for more of a 'real' opiate high, but I wasn't unimpressed.  The only thing I really don't like about Tramadol are the side effects.  There was no itching, but I had really bad dry mouth.  I had to constantly drink water, and was constantly having to take a piss.  I also noticed slight pains in my sides (kidneys maybe) and I didn't like that at all.  Also my chest felt a bit taught.  So the side effects kind of turned me off.  I myself prefer Oxy's as far as pills go, but I'll keep this stuff around.  Because of its sedating effects, I feel small doses would work well as a sleep aid.  I'll just take it in smaller doses while sitting through class...make the day more interesting."
 ],
 "erowid": {
  "id": "28247",
  "citation": " Liquified. \"Too Many Side Effects: experience with Tramadol (ID 28247)\". Erowid.org. Jun 23, 2007. erowid.org/exp/28247",
  "substance": "Tramadol",
  "views": "35766"
 }
}
