{
 "id": 4204,
 "title": "Bluish-Green",
 "date": {
  "submission": "2007-10-19T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Kritikal",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "3 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Barbiturates",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>It was Sunday, one which I barely remember anything of. I'm 17. It all started at about 7:00PM, when I found some pills in our house. I had been quite interested in drugs for a while now. I smoked marijuana a few times with friends, and I had been drinking alcohol about once a week. I always research, thoroughly, the substance I intend to experiment with. And many I don't. The dose is most likely off, and many details gone, because of the amnesia.",
  "Now, I hate alcohol, it's quite degrading. But, at the time, I didn't mind getting a little drunk. Here's how it all started: I opened the bottle of Ambien 5mg's, and downed 2 of them with some water. Walked downstairs, opened a bottle of Gin, and drank some of that. Now, for whatever reason possessed me to do this stupid move. I walked back upstairs, opened the bottle of Ambien, took another 5mg. Next, I opened up a bottle of Fioricet I found, and took an unknown amount of those. I think one tablet.",
  "I went outside to wait for the effects to come on. I started walking around the neighborhood. I had a flashlight to play with, and it was a little dark. I started shoving it in my face and moving it around thinking about how cool it looked, then I noticed what I was doing and stopped. I looked up, and everything was blue-ish green. Now, I thought this was quite cool, but I figured it was because I was shoving a flashlight in my face. It continued to be this color for a few hours! Somehow I managed to walk home, noting that my there were no hills in my neighborhood. But there is.",
  "I got inside, and I was running into everything. One of my family members noticed, and asked me if I had taken anything, and I told them I had taken Benadryl. I don't know why I said that, but there was a new package of it sitting on the table, and I was probably just reading it. They proceeded to take me to the hospital. Of course, I didn't need to go to the hospital, but I didn't care about that. We got to the hospital, they gave me electrodes and put a needle in to my arm. They were talking about doing some strange procedure to get the pills out of me. Now, I didn't have enough of anything to need this, and I told them that repeatedly. Well, it turned out that they decided against this, and told me to urinate in a bottle, during which they closed the shades around my bed in the hospital. I proceeded to urinate. Not exactly on target, I suppose, because they were replacing the sheets and cleaning off the bed when I was done. After that, they told me my alcohol level, and showed me a piece of paper that said I had tested positive for barbituates. Then we left.",
  "At approximately 12:00AM, back at home, I was lectured for hours, which I didn't really care about. Now it's two months later, and quite a few more substances later, and I still love drugs. I'm fascinated by them, and their effects.</p>"
 ],
 "erowid": {
  "id": "28269",
  "citation": " Kritikal. \"Bluish-Green: experience with Zolpidem (Ambien), Barbiturates (Butalbital) & Alcohol (ID 28269)\". Erowid.org. Oct 19, 2007. erowid.org/exp/28269",
  "substance": "Zolpidem (Ambien), Barbiturates (Butalbital) & Alcohol",
  "views": "17906"
 }
}
