{
 "id": 4208,
 "title": "Social Shrooms and Trippy Rooms",
 "date": {
  "submission": "2007-10-19T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Giger",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "3.5",
    "quantity": "3.5"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Mindset:  Fairly clean.  I feel somewhat confused about where I am in life, but up to the challenge of entering the Mushroom world for a night to see where it takes me.",
  "Setting:  A large house that was never left during the trip.  Music was always on, the progression was 3 orb cds (Orblivion, Ultraworld 1, Ultraworld 2) and then some floyd (The Wall, Animals I think).  Cold night, everyone stayed in.  Numerous sober, or at least non tripping, people were present all night.",
  "Three quarters of an ounce of mushrooms were obtained, and distributed equally to myself, and 5 other people who I will refer to as A, J, E, L, and T. The mushrooms were of higher quality than many I have had, as I was to find out, although there were more stems than caps.  Of our group, I had the greatest amount of psychedellic experience, having taken reckless amounts of LSD in high school, although it was several years after that that I fist allowed myself to take 'shrooms last year.  Every other member of our group had tripped at least once or twice, though.  An hour before eating the shrooms I smoked a fair amount of good pot and got reasonably high.",
  "At 6:30, everyone but L ate their mushrooms.  Other people elected to slam them down or eat them on pizza because they tasted strongly bitter, but I chewed mine carefully and held the debris in my gums, which paid off.  30 minutes later, when we had descended into the living room that would be our home for the next 6 hours or so, I was already starting to trip out.",
  "7:00:  A joint is discussed, but people decide to wait and see where the shrooms are going to lead us.  The room has a fog machine, light projector and laser projector in it and begins to assume bizarre, warm aspects for me.  From here on out, my ability to tell time becomes very distorted.  I stumble through a sentence, and have to stop and say, 'Heh, there it is.  I'm tripping.' and I felt a little stupid because no one else seemed to quite be feeling anything yet.",
  "Withing fifteen minutes, people are making the kind of giggly observations so common with the 'coming up' period.  However, quite quickly I realize that I'm in for a stronger trip than I had pictured, and I grow quiet and somewhat withdrawn.  This seems to be widespread among our group.  L arrives and eats his dose.  One of our sitters comments 'This has to be the quietest group of trippers I've ever seen', and another laments 'You guys are supposed to be entertaining me!'  This brings me back to earth for a minute, and I say, 'No, you have the dichotomy reversed, you're supposed to be entertain us!' and giggle about it for a bit. I am now in the grip of the mushrooms.  Closing my eyes brings a geometeric plane of dancing patterns and shapes, but it feels 'empty' to me.  I realize that I have been here before, but last time there was a 'tower' of personally significant information in this space, and it's missing.",
  "I realize that A has been missing for quite some time.  Someone comes down from upstairs and says 'there's a kid laying down in the hall upstairs'.  J goes up, and an indeterminate time later, they return.  I assume that A was the person laying in the hall, and ask, 'Where have you been?'  He said, 'I took a wrong turn.  I went around a bend, and it got a little bad, but it's better now.'  A sitter asks us how we feel, I giggle and E says 'I feel really good.' I go upstairs to play a game of pool against a sober person.  I do terribly, and the increased lighting makes me nervous.  The balls seem to be made of solid color with no shading at all, and it's the purest colors, the colors of childhood.  But the light grates on me, and I return to the 'trip room' downstairs.",
  "9:30 (T+3:00):  I realize that I have to go to the bathroom, so I walk down the hall.  Someone calls me on my phone, I have a brief and confused conversation with them.  Suddenly I feel faint.  I am about to pass out, I am scared, I sit down, it's dark, I am in hell, this will never end.  With this feeling comes an immense need to vomit, so I go to the bathroom and sit down by the toilet.  I rip off my outer layers, and realize that I am covered in sweat.  But suddenly the naseau subsides, the blackening of my vision ceases, and I feel reborn:  I feel like whatever doubts I have about the existance of a god have just been squashed, because I am aware that I'm back in my own body, and damn if it isn't such a bad place after all.",
  "J and T have come to check on me and make sure that I'm not freaking out or dying in the bathroom, which also makes me feel safer and good.  The bathroom floor is a tiled, hexagonal affair, and the tiles seem to be moving, shifting, becoming 3d, typical 'tryptamine visuals', like acid visuals except more 'organic' feeling.  Instead of hard lines, everything is surrounded by a soft, easy glow. I sit down on a carpet, and start talking to a group of non-trippers who have come to the house after an aborted effort to ride the 'drunk bus' (bus that goes to a club) to Toronto.  T approaches me, asks if I am feeling better.  I say that I am.  He seems a little nervous himself, in fact he seemed relieved when I told him I'd felt lightheaded, because he was feeling the same way.  He asks me to come back to the 'trip room', or if I want to, and it sounds warm and trippy and nice.",
  "I return to the 'trip room' and basically decide to just wait for the mushrooms to wear off.  I was unsettled enough by what happened in the bathroom to worry about the rest of the trip being sour, but I manage to keep things under control, and today I feel that that sense of 'coming home' and really 'belonging' in my own body was well worth the negativity and fear-of-death. For the whole night, L has been especially quiet.  I say, '(L), are you okay?'  He says, 'Better now.  The shrooms are wearing off.'  I ask him the same question about a half hour later, and get the same response.",
  "By 10:30, it seems to me that everyone is leveling off.  Some more cannibus is smoked, and I just 'chill' and watch the laser patterns on the wall become three dimensional.  There's a kitten present who goes nuts over the laser, much to our enjoyment.",
  "At 11:30, J or E turn on the TV.  After a brief cable outage, we just watch Comedy Central for about an hour and a half.  By the time this period is over, some people have gone to bed, and L offers to drive me home.  Since I personally have felt quite sober for at least an hour, we only have 5 blocks to go, and L hasn't had any pot, I decide to take a ride instead of walk in the 30 degree Upstate NY weather.  When L drops me off, we talk a little about the expirience.  I say, 'Yes, well, I had a bit of a difficult experience myself, and I need some time to think about and integrate that, but I will.'  L says, 'Difficult?  How so?' and I reply that I feel out of touch with who I am, where I'm going in my life, and what I want to do, and the mushrooms drove home to me that though I feel at home in my body, I need to feel at home in in my life, too.  L expresses that perhaps some of the same doubts were behind his silent, troubled trip.",
  "All in all, I think this was a positive experience, although I haven't talked to A yet about the 'wrong turn' he took.  It was a rather subdued, quiet experience, but for me aty least it provided a good springboard for introspection and highlighted some of the things I need to be thinking about and working towards.  The negative aspects, however, have made me decide that I may not enter the Mushroom world again until I'm in a different place with what I'm doing and how I feel, or else I suspect I would have very much the same trip again.",
  "As a side note, I had considered taking a quarter ounce because the last batch I ate were weak:  this would have almost certainly resulted in an unmanagable expirience for me.  Mushroom quality varies wildly, at least around here, and I think it's a bad idea to take more than an eighth-ounce unless one takes a smaller dose of the same batch first to evaluate potency.  This is probably smart drug common sense, but I feel that it's worth highlighting, as the lingering anxiety and fear that kept threatening to push the trip into the Hell Bardos would certainly have been able to do so on a stronger dose."
 ],
 "erowid": {
  "id": "28297",
  "citation": " Giger. \"Social Shrooms and Trippy Rooms: experience with Mushrooms & Cannabis (ID 28297)\". Erowid.org. Oct 19, 2007. erowid.org/exp/28297",
  "substance": "Mushrooms & Cannabis",
  "views": "5960"
 }
}
