{
 "title": "The Importance of Atmosphere - Part 1",
 "author": "ZeN",
 "citation": " ZeN. \"The Importance of Atmosphere - Part 1: experience with Ecstasy (ID 4211)\". Erowid.org. Dec 14, 2000. erowid.org/exp/4211",
 "substance": "Ecstasy",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>It's been roughly one-year since I first took E. I had used weed habitually for about a year before that and experimented with mushrooms, acid and inhalants; I considered E just another pebble on the road. I took the pill at a good friend's pad, that first trip was uneventful, the cloud of purple haze from our pipe had masked it. In February, that same friend and I decided to drop again, but lacked enough money for bud, so we took the little white 'Amsterdam Pures' alone. The taste made me wretch, and it is one I will never forget. We sat there waiting, playing music and just fiddling around when I felt this surrealistic power surge through my body. Neither of us had really researched E or knew what the effects were except 'it made people horny' or whatever else we had heard from the grapevine. I really had no idea what to do, but I knew I wanted to lie down. A few minutes later, my friend greeted the carpet as well and we slipped into bliss.</p><p>The next time I dropped was at the same place; it was comfortable and secure. We were always assured that we were safe and that nobody would bother us. There was no interference from anything, people or society's rules of etiquette. We simply acted however we wanted to and just savored the freedom of it all. I never really understood how important security is to an ecstasy user until months later. By may I have read everything I could about E and other drugs found in the black market pills. I figured out all the little tricks with Vicks and massages but still hadn't realized the key to the whole experience... atmosphere.</p><p>I started raving in March and began to use E at those events. Meeting people was great; making new friends, getting to know old ones better all came so easily. The high was never as intense though, but I just attributed that to the declining quality of pills in the area. I never had the money to drop multiple pills so I never tried higher dosages at that time. It just seemed that I was getting used to the rolling feeling and that it had all become monotonous. The body high remained but the spiritual level really got lost along the way.</p><p>During the summer, I managed to spend roughly 120 bucks on bunk or weak pills and became very, very discontent with the whole E scene. I didn't have any friends that were serious about rolling, they only thought of it as a 'cool lil pill that makes ya feel fuzzy', an attitude that angers me. So, I began to make the best of a bad situation and just roll like they did, trying to feel all fuzzy. This is where I lost it. I was being told that people seriously loved some pills I had done, but I always thought they were weak. Id check Dance safe and Pill reports and see that the pills I had been taking were pure MDMA and damn good to some, but to me they were just bitter tasting wallet drainers. Then, it happened. A friend of mine from school was given half a pill called a 'XL' but did not want to take it so they bestowed it upon me. I went home and immediately dropped it. Although it was only half, it seriously floored me in about 35 minutes. I had deep, introspective thoughts of love and care and realized that the magic was back. I didn?t have to drive anybody around, or fear cops showing up at the place that I was rolling at, I was just there. I was secure and happy and knew I had awakened to a new world.</p><p>From there on, it became evident to me that my best rolls were with people I was comfortable with and at places I was comfortable with. The best rolls occurred at times when I could just sit down, talk and chill if I wanted to (small parties or parties where most were rolling or otherwise intoxicated were acceptable surroundings. No parents or authorities to worry about, just bliss. My worst rolls, even on good pills (such as red FY's) took place when I had to drive, worry about where we were all going to roll at and how loud people wanted to act in public.</p><p>Recently, I took 1.5 of a new pill called a HQ at a friend's party and rolled harder than I have since my second time. The vibe was great and I made a lot of new friends that night. That is really the experience I seek: being around those who want to connect with you and that you are safe with. Those are truly the most gratifying experiences I have had in my few years on this planet. It may have taken me awhile, but I now know the importance of atmosphere, and I hope you do as well.</p>",
 "year": "2000",
 "id": "4211",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-12-14T08:00:00.000Z",
 "views": "7755",
 "dose": {}
}
