{
 "id": 4211,
 "title": "My Journey With 'Cyclone' (Cyclobenzaprine)",
 "date": {
  "submission": "2004-02-10T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Mr. Hizodge",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Cyclobenzaprine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "After hearing enthusiastic reports from numerous people about the skeletal muscle relaxant cyclobenzaprine, (or Cyclone, as it has been dubbed by those familiar with it within my circle of friends) I decided that it might be worthwhile to try.",
  "I attained five ten-milligram tablets from a regularly-using friend of mine, and, shortly before 10:00 that evening, while peparing to take a shower, proceeded to pop all of them at once. I took my shower and went to bed at about 10:20.",
  "It should be noted at this point that I was taking, on a daily basis, 10mg fluoxetine (Prozac) for depression and 10 mg of various mixed amphetamine salts in the form of Adderall for my so-called ADHD. I have done no research whatsoever in investigation of chemical interaction between these specific drugs and cyclobenzaprine, based on a simple doubt toward any possibility of such an occurence. (SSRIs have been known to react with various drugs, however.)",
  "Shortly after going to bed, having all but forgotten my recent consumption, I began to notice effects. I felt that the bed was moving slowly to the right and down. This was very interesting, but, not considering the consequenses, I sat up and shook my head. How stupid. Realizing my error, I lay back down, and, after about 30 seconds, the same thing happened, but this time the foot of the bed seemed to be leading me and the rest of the bed down a slowly inclining slope, as on a simple hill. This was more frightening, but I decided not to take any real action this time in fear of losing the sensation altogether.",
  "The sensation continued, and the rate of my fall never accelerated or decclerated, nor did I ever slide to another level on the mysterious, impossible, hill. My percived direction and orientation shifted frequently, however. I do not beleive I made any actual physical movements for some time. I fell asleep at some point in my perpetual fall.",
  "I slept through the night, and also through my 6:00 alarm, and nearly through my brother's last minute wake-up call. In my hurried, drowsy race to get up, piss, dress and eat, I somehow noticed that my tounge had turned from it's normal healthy pink to a purple to bright unnatural pink. Upon seeing this, I realized that I had had an odd tase in my mouth since waking up. I quickly brushed my teeth, to no avail towards ridding myself of the taste, but the toothpaste had apparently accomplished the removal of some of whatever had made my tounge that odd color.",
  "The discolororation had disappeared by 3:00 that afternoon.",
  "My single jouney with cyclobenzaprine was not altogether unpleasant, although very odd. I may even decide to drop them again, especially if daily circumstances call for my having a purple tounge and being extremely drowsy."
 ],
 "erowid": {
  "id": "28304",
  "citation": " Mr. Hizodge. \"My Journey With 'Cyclone' (Cyclobenzaprine): experience with Cyclobenzaprine (ID 28304)\". Erowid.org. Feb 10, 2004. erowid.org/exp/28304",
  "substance": "Cyclobenzaprine",
  "views": "143835"
 }
}
