{
 "title": "The Shakes",
 "author": "Inkognito",
 "citation": " Inkognito. \"The Shakes: experience with Nutmeg, Coffee & Alcohol (ID 42118)\". Erowid.org. Jul 20, 2008. erowid.org/exp/42118",
 "substance": "Nutmeg, Coffee & Alcohol",
 "bodyweight": "55 kg",
 "header": [
  "DOSE: T+ 0:00",
  "1.5 nuts",
  "oral",
  "Nutmeg",
  "(ground / crushed)",
  " T+ 4:00",
  " ",
  "oral",
  "Coffee",
  "(liquid)",
  " T+ 6:00",
  " ",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)"
 ],
 "report": "<p>Being not so experienced with mind-altering beside alcohol and occasionally absinths, I decided to try on nutmeg due to its easy accessibility and supposed hallucinogenic qualities.</p><p>So about 3pm yesterday I ate the nutmeg I'd ground the previous evening, about 1 1/2 nuts. Mixed with milk and sugar it's actually a somewhat tasty beverage provided you like its fragrance. After that I continued my routine unaltered.</p><p>I'd heard about nutmeg taking all from 1 to 5 hrs to kick in, so I planned on peaking the experience at midnight. About 7pm I joined some friends and had several cups of explosively strong coffee in order to speed up the process, since nothing had changed yet. At 9pm I started to doubt anything was gonna happen at all, and thus accompanied the others in their beer-drinking preoccupations.</p><p>After a few beers, barely enough to make me tipsy, it suddenly hit me. I could clearly sense where the alcohol ended and the other thing took over. 9:30pm my eyelids started twitching and felt like laying down. I closed my eyes and had a slight feeling of getting pulled backwards and inwards through the wall I was leaning against. My eyes were now in an REM-like state, rolling and blinking uncontrollably. After a short while I 'awoke' and went into a different room, I was still perfectly aware everything around me, although it seemed abit remote and uninteresting. My throat suddenly went very dry and my voice sounded like I'd suffered a bad cold. People commented on my whacked-out looks and bloodshot eyes. Unable to really participate in any conversation I gradually sank down towards the floor. I was in a somewhat dreamlike state, although I was fully aware of where I was, who was in the room etc. I had no real hallucinations, just a brief vision of having a snakes head and mouth, upon which my tounge and lips started twitching (musta looked real funny).</p><p>Towards 11pm, convulsions grew worse. I gradually lost control of my hands and arms. Some people led me of to lay on a bed, I had some serious spasms by then. I tried to command myself to be still, but I felt my nervous system didn't quite respond as it should. I just couldn't stop my arms and legs twisting and shaking, someone said it looked like I was doing 'the tarantulla'. My heartbeat was erratic and I hyperventilated at times. This lasted for perhaps 30-40 minutes then it gradually subsided. By 1am I was fit enough to walk home without getting overrun. Now as I write this, about 30 hrs since intake, I'm still abit remote and unwilling to concentrate. My vocabulary's really a mess too. Not nice.</p><p>In conclusion this was, for me, mostly a body drug. Thorough my shakes I felt mostly numb and indifferent, no supreme visions or newfound Answers this time. I recommend this for home-use, it would definitely work better by the tv than in a crowd, since it cancels out all wittiness.</p>",
 "year": "2005",
 "id": "42118",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-07-20T07:00:00.000Z",
 "views": "8340",
 "dose": {}
}
