{
 "title": "Moderate-Dose Experience",
 "author": "Sanders",
 "citation": " Sanders. \"Moderate-Dose Experience: experience with Diphenhydramine & Caffeine (ID 42193)\". Erowid.org. May 30, 2007. erowid.org/exp/42193",
 "substance": "Diphenhydramine & Caffeine",
 "bodyweight": "177 lb",
 "header": [
  "DOSE:",
  "225 mg",
  "oral",
  "Diphenhydramine",
  "(pill / tablet)",
  "",
  "400 mg",
  "oral",
  "Caffeine",
  "(pill / tablet)"
 ],
 "report": "<p>I have formerly had experiences with Diphenhydramine, none of which were very noteworthy. I have had experiences with most common drugs: cocaine, ecstasy, marijuana, alcohol, methamphetamine, and psilocybin to name a few, as well as 2c-I (easily favorite). Back on topic, I have had several experiences with Diphenhydramine, but none that I can remember except for feeling extremely light-headed and then falling asleep.</p><p>In hopes of combatting the sleep, this time I took two No-Doze (each containing 200mg caffiene) prior to the experience. Approximately fifteen minutes ago I swallowed nine generic benadryl gel capsules with the only active ingredient being Diphenhydramine. Each pill contained 25mg Diphenhydramine. As of now, no noticeable effects have taken place. It should also be noted that I took these capsules on a full stomach. I am in a relatively calm state of mind, having just finished meditation forty-five minutes or so prior.</p><p>I began to play 'wish you were here' on my guitar and started to notice a slight tingly sensation in my shoulders, an extremely mild opiate-type feeling of relaxation. It has now been twenty-five minutes since dosage. Starting to have mild head buzz similar to marijuana in that it's easier to zone out and concentrate on one thing. Just stood up from kneeling position at my computer while typing and felt unusually tall and mildly nauseated.</p><p>Opiate-like mild buzz has subsided and given way to a more mental buzz mostly characterized by an ambien-like spacey feeling while walking and slight dizziness. It has been thirty-five minutes since dosage.</p><p>Spacey feeling has increased. Starty the 'drifty eyes' stage that I usually experience with the onset of a trip. I feel noticeably more lethargic, but not overwhelmed, and the nausea has subsided. It has been forty-two minutes since dosage.</p><p>Walls are starting to have a slight inward-bulge effect to them, and in my peripheral vision everything seems a bit closer and pulsating ever-so-slightly. Although these feelings are still somewhat on a subconcious level, they are becoming more prominent but still a bit away from obvious. Light-headedness increasing along with spacey feeling, foreshadowing possible confusion and disorientation later. Heartbeat has increased slightly Fifty-two minutes since dosage.</p><p>Light-headedness has increased dramatically almost to the point of being overwhelming in the past eight minutes, and subsequently the nausea has returned. Feeling is similar to the feeling right before your vision fades when the bloodflow to one's brain is restricted, but I feel far from passing out. Hard to concentrate on any one thing in particular. Strange pressure feeling behind my eyes. Like a sinus headache without the headache and not painfull or intense at all. One hour since dosage.</p><p>Starting to feel weak from the lightheadedness. Walking any distance is almost out of the question. Feeling similar to the weak feeling that comes with slight malnutrition after several days of sickness. Nausea is prevalent enough to be felt, but not enough that I will have to vomit. Just turned my head and was slapped with a wave of lightheadedness that was slightly dissociative. Having trouble focusing my eyes on anything for longer than about three seconds. Strong urge to stop typing. Slight pupil constriction and strong dizziness when attempting to walk. Head slightly swaying and bobbing. One hour twenty minutes since dosage.</p><p>Nausea has increased, still not overwhelming, just becoming annoying. Still ambien-like but much more lightheaded. Experience is beginning to feel like an uneventful dream. Lightheadedness still increasing along with the difficulty involved in walking. Other than a substantial amount of difficulty with doing any kind of math and a slightly more dissociative feeling attributed to the lightheadedness, no other changes noteworthy. One hour forty minutes since dosage, beginning to assume this is the extent of a Diphenhydramine high.</p><p>I am now convinced that this is the extent of a Diphenhydramine high. Intense lightheadedness, slight dissociation resulting in substantial confusion, and crippled depth perception and balance. Interesting, but not great. Not bad either (considering that it's roughly $3.99 for approximately 30 capsules.</p>",
 "year": "2005",
 "id": "42193",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-30T07:00:00.000Z",
 "views": "27726",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "225 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 }
}
