{
 "title": "Painful but Good",
 "author": "Smak",
 "citation": " Smak. \"Painful but Good: experience with 5-MeO-DiPT (ID 42206)\". Erowid.org. Aug 19, 2006. erowid.org/exp/42206",
 "substance": "5-MeO-DiPT",
 "bodyweight": "140 lb",
 "header": [
  "DOSE: T+ 0:00",
  " ",
  "insufflated",
  "5-MeO-DiPT",
  "(powder / crystals)",
  " T+ 3:30",
  "1 bowl",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I've used Foxy before and I think the effects are really nice. Prior to this experience, I had only taken foxy orally, in doses of about 15-75mg. It had been 11 months since I had done Foxy, i'd only done it 4 or 5 times in a 2 week period.</p><p>Setting:</p><p>At home with my younger brother and sister. I was looking for weed in my closet [I had no stash and I had found a doobie in there once] when I saw an orange pill bottle in the corner of the top shelf.</p><p>As soon as I saw the bottle I recognized it as the one we had our foxy in the year before. I thought we had finished it but there was about 90-110 mg left inside of a small pill capsule.</p><p>I call one of my friends to tell them about my luck, he'd never tried it before so I offered him about half of it.</p><p>About 15 minutes later, John arrives and we get started. I separated about 2 equal piles</p><p>and one that was about 1/3 of the other piles. I eyeballed the dose but thats how I always take it and Im pretty comfortable doing this. I figured there was about 40-50 mg in the 2 bigger piles and about 15 in the other one.</p><p>T+0:00 - I snorted my small line of yellowish-glassy crystal goodness. John snorts his after me, then my brother snorts the smaller line. About 30 seconds later we all have a very bad stinging sensation in our nose.</p><p>T+0:02 - My throat feels like its burning for some reason, I feel like throwing up. A few minutes later I start throwing up in the bathroom a few times. I think my brother threw up as well, but only a little bit. (we had eaten about 2 hours before this)</p><p>T+0:10 - Most of the bad feelings went away, I start feeling a very psychedelic weird feeling I always get from mushrooms and acid, theyre very different feelings. I felt very pleasant and like everything was right, and I knew I wouldnt be sick anymore. John and I leave the house and as soon as I step outside the street lights and the houses and street and stuff seem so different and really entertaining.</p><p>T+0:15 - We finally manage to get into the car. We start having second thoughts about driving around on this stuff because it just keeps getting stronger. We each light up a cig and start driving. Right before we leave my neighborhood, I open the car door while were moving and start throwing up. After that I felt perfectly fine and we continued on our journey to the ATM.</p><p>T+0:25 - We're at the ATM machine and this is when I REALLY start feeling fucked up. I had no idea what the fuck was going on yet I knew what I was doing... sort of. John couldnt seem to drive close enough to the machine so I had to get out and do the whole card withdraw thing, and I thought the money was sticking out of a closed space on the machine for about 2 minutes, then I started getting really confused because my hand just kept hitting a machine but I saw money. I late figured that the money was about a foot away from the area I was slamming my hand into.</p><p>T+0:40 - We pick up some weed from a friend of ours, then we go back to my house. I keep seeing lots of colors, like small lines that just drift around and then out of sight.. its really cool, and I feel really funny and laugh a lot. Very shroom-like, except much more alrt and 'UP'.</p><p>T+1:30 - When we get home my mom is back and John doesnt feel comfortable going inside being so fucked up, so he heads home for the night. I manage to sneak around and go upstairs without her seeing me, I then run into the shower just so I can hide somewhere till I sober up.</p><p>T+1:45 - The water is REALLY interesting, I play with it for a good  30-45 minutes.</p><p>T+2:30 - Effects seem to start coming down slowly, but it isnt a bad comedown and I dont feel like doing anymore foxy. I feel very happy and peaceful and thankful for such luck and this magical fucked up night. I sit down to watch TV and I feel VERY comfortable on the couch. The show on TV is really stupid and id normally change the channel but it seemed really interesting for some reason. My little brother also tells me he feels like his experience was like 'an upper version of mushrooms'.</p><p>T+3:30 - I smoke a bowl of weed. I feel very focused and the foxy seems to feel a lot more UP than it was before, but the trippy effects are gone and I feel sober, but after the bowl of weed I feel like a light tweak of some sort ;)</p><p>T+4:30 - feel very normal but the foxy still lingers a tiny bit. I fall asleep easily.</p><p>I think when taken orally, its much less trippy unless its a very high dose, but eating it always made my stomach feel really weird and I didnt like it too much because of the discomfort. Snorting burns my  nose but only for a few minutes, and I believe the high is worth it. Foxy is one of my favorite drug</p><p>P.S. With acid: I didnt experience any stomach discomfort if I took the foxy while tripping, and it was one of my favorite combinations ever.</p>",
 "year": "2004",
 "id": "42206",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2006-08-19T07:00:00.000Z",
 "views": "2800",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 3:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
