{
 "title": "I Took Too Much",
 "author": "Anonymous",
 "citation": " Anonymous. \"I Took Too Much: experience with Coca (ID 42234)\". Erowid.org. Mar 12, 2007. erowid.org/exp/42234",
 "substance": "Coca",
 "bodyweight": "175 lb",
 "report": [
  "<p>Before this high I tried Coca tea a few times before. To me it felt like caffeine but it didn't make me jittery and it gave me power as well as energy. I also heard from a very experienced drug user that it has its own unique high different from pure cocaine powder, but personally I haven't tried that.",
  "I was coming down off a long day of smoking pot. I wasn't high at all, I was just really tired from smoking so much during the day. I was passing out at my friends house, so I decided to drink a whole lot of Coca tea to see what happens. At first it really wasn't that different than taking a regular dose, but it kicked in about 10 minutes after my last cup. I had a really strong urge to move my body around, especially my mid-section. I couldn't sit down. I also got a distinct high, which was the best part of it. Everything seemed watery and liquid, and I responded more emotionally to colors. For example, red looked very vivid and interesting. Personally I felt like I was nine years old again: hyperactive, more emotionally-responsive, and I was saying a lot of random shit. It felt like my ego took complete control over my body, and I was responding to everything naturally. And I perceived people, colors, shapes and sounds differently, I also got a very slight hallucinogenic effect from it as well.",
  "The worst part was the next day. I get a hangover everytime I drink coca tea. My stomach usually hurts, as well as my mid-section. Coca tea, to me, is also more demanding than caffeine for alertness. I can fall asleep a lot easier on coca tea than caffeine, but during the night I usually get only a little sleep, and the next day my body refuses rest it off.</p>"
 ],
 "year": "2005",
 "id": "42234",
 "gender": "Male",
 "views": "11411",
 "dose": [
  {
   "time": "0",
   "amount": "3 cups",
   "administration": "oral",
   "substance": "Coca",
   "form": "(tea)"
  }
 ],
 "submissionDate": "2007-03-12T07:00:00.000Z"
}
