{
 "title": "Out-of-Place Inside My Own Body",
 "author": "pixie",
 "citation": " pixie. \"Out-of-Place Inside My Own Body: experience with 2C-I (ID 42271)\". Erowid.org. Jun 28, 2005. erowid.org/exp/42271",
 "substance": "2C-I",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "2C-I",
   "(capsule)"
  ]
 ],
 "report": "<p>I have taken 2C-I only once, and it was kind of a while ago, but in light of all the positive first experiences on here I thought I would let people thinking of trying this drug know that it's not always that great.</p><p>A friend of mine obtained 4 capsules of 2C-I one Friday and he and his other friend took them that night.  I wasn't there, but they told me the next day that it had been a great experience, and since they seemed to be fine my boyfriend and I decided we would take it Saturday night.</p><p>We took the capsules around 8pm.  Neither of us felt anything until maybe half an hour later, when I started to feel very nauseated (we had been warned about the nausea, but my other friends told us it only last about half an hour).  We lay in bed for a long time staring at the ceiling and watching it move-- the light looked really amazing also.  However, the nausea was almost debilitating, and I sent some other friends of mine out to get some food.  When they returned, we went out into the living room to eat.  The trip was pretty fun for maybe the first hour -- I was laughing uncontrollably, to the point that my jaw started to hurt pretty badly. </p><p>After an hour or so of giddiness, my perception became really skewed.  Everything started to seem intensely creepy, like a bad horror movie.  I became oddly obsessed with taking pictures, because I wanted to see if I could capture what it looked like -- I seriously took 54 pictures on the digital camera that night.  Keep in mind, the nausea had still not gone away.  The trip was incredibly physically uncomfortable; I was intensely aware of feeling very out-of-place inside my own body.  This entire time, my boyfriend was having very frightening hallucinations and sat in the closet for a few hours because he thought the walls were trying to eat him.  He wouldn't let me go in the room where he was because he said my face was scaring him. </p><p>After about 2-3 hours of this, we became a little calmer.  We sat in the living room talking, and the drug started making us both very depressed.  I have been medicated before for depression, which I don't suffer from anymore, so the depression caused by the drug scared me a lot and was not a welcome feeling.  I sat for hours thinking about how horrible my life was, how many things I had to do the next day, how irresponsible I was, how much I hated myself.  My mind was going a mile a minute and was stuck in a very negative thought loop that I just couldn't get out of (my boyfriend later confirmed similar feelings).  This seriously lasted 6-7 hours.  By about 5 in the morning, we were very tired but couldn't sleep because we couldn't stop thinking.</p><p>The effects of the drug finally wore off around 6 am.  I wasn't physically tired or worn out, but my mind was exhausted from all the thinking and I still felt a little depressed from all the things I'd been thinking.  I was back to normal by later in the day -- there were really no negative after-effects.</p><p>I definitely would not do this drug again or recommend it to anyone.  It was possibly the most depressing, uncomfortable experience of my life (the nausea and general physical discomfort stayed with me for the entire 10 hours).  I wouldn't really consider it 'dangerous,' since it's not addictive and caused no physical problems, but to anyone thinking of trying it, I would merely like to say that you should be prepared for some negativity if it happens to hit you the way it hit my boyfriend and myself.</p>",
 "year": "2004",
 "id": "42271",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-06-28T07:00:00.000Z",
 "views": "7319",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  }
 ]
}
