{
 "title": "Watching My Ego Roll By",
 "author": "Morninggloryseed",
 "citation": " Morninggloryseed. \"Watching My Ego Roll By: experience with Salvia divinorum (ID 4239)\". Erowid.org. Jun 6, 2001. erowid.org/exp/4239",
 "substance": "Salvia divinorum",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2000",
   "4239",
   "Male",
   "",
   "Not Given",
   "Jun 6, 2001",
   "7876",
   " "
  ]
 ],
 "report": "<p>Salvia divinorum is an incredible experience, quite beyond words.  I know of no way to describe my salvia trips, but here is an attempt.  In some ways, the SAME exact experience happens every time I use it.  Kind of like a sequence of events in a story you keep reading.  Salvia divinorum gives me the experience of watching my ego roll by, as if it were on a newspaper printing press.  I will see all of the little aspects of my personality speed by me.  In a sense, it shows me the ultimate truth.  Everything in my life, and the universe in general, is shown to me with complete clarity.</p><p>The trouble is I usually do not realize I am tripping, and I tend to feel as though my head has been split open for the entire world to analyze.  I assume that reality is not the result of salvinorin A in my blood.  There are entities there, the 'Salvia' people, and they are able to see everything about me, including things I would rather them not know.  This can be a very uncomfortable experience.</p><p>It is a true ego-confronting trip for me, but not always an insightful one.  It does not seem to tell me anything I already do not know; it offers me nothing new to take home.  I still however think the experience is valuable.  If anything, it is also very interesting and bazaar.  Like a carnival or circus.  A wild, crazy, weird, insane experience.</p><p>I can recall one silly little thing on a Salvia trip that could be defined as an insight I got to take home with me.  I had a disagreement with my girlfriend.  When she went to sleep, I went into the bedroom (we slept in the living room.) and proceeded to smoke some Salvia divinorum.  All of the sudden I had a vision of her and I was given a message that I needed to be damn thankful for having her.  I knew that already, and then I realized how silly it was to be angry with her.  I did really upset her.  Then (laugh at the absurdity of this if you will) the spirit of Salvia divinorum proceeded to scorn me for becoming unjustifiably upset with her.</p><p>I came out of that trip with a deepened appreciation for her feelings about the issue we were fighting over, and I truly felt bad for becoming upset.  Had I not tripped that night, I do not feel I would have seen the issue from my girlfriend's point of view.  That was valuable wouldn't you say?</p><p>I must also say that Salvia divinorum in combination with a proper psychedelic goes beyond just being an entheogen-induced experience, but that is for a different trip report.</p>"
}
