{
 "title": "Distortions and Thin Blood",
 "author": "Moretables",
 "citation": " Moretables. \"Distortions and Thin Blood: experience with Escitalopram (Lexapro) & Cannabis (ID 42404)\". Erowid.org. Aug 15, 2007. erowid.org/exp/42404",
 "substance": "Escitalopram (Lexapro) & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "Pharms - Escitalopram",
   "(daily)"
  ]
 ],
 "report": "<p>I recently recived Lexapro for anti-anxiety treatment and I happend to find something very interesting. After moderate use of MDMA I realised that the first day on Lexapro could be felt moderating my mood/attitude/perception.</p><p>I was a casual cannabis smoker and after about 2 weeks on Lexapro I decided to smoke a joint with a friend. My friend that I smoked with decided to head upstairs and I was left alone at the kitchen table. As I stared off into the distance I started to feel a fuzzy warm feeling all over my body. It was an intensity that just kept coming. Sights and sounds were starting to distort slightly. I could almost no longer feel my limbs and then it subsided. I was awed at this phenomenon but it faded quickly.</p><p>About 3 months later still on Lexapro I wound up smoking about 2 bowls which wasn't very much, however, I have a small history of seizures (twice so far in my life time) and I could tell right away when I started to walk my vision started to close in upon me. I calmly sat down and my vision slowly returned. I decided I would go sit down somewhere else and I got up only to hear voices fade and my vision dull until I woke up on the floor with my family surrounding me. I was fine, but the ambulance was apparently called and they did some tests on me right there. Also my blood was so thin that they wanted to take me to the hospital.</p><p>I won't drive after smoking, but, I smoke often and I can repeat this any time. I smoked 2 nights ago and it was so intense that I couldn't feel my legs nor my arms. It almost seems as if my body isn't real. It's almost as if I expect it to be real, and so it is.</p><p>Lastly, this is the biggest benefit of Lexapro and Cannabis. While committing to daily routine of Lexapro, after smoking I usually can remember everything that happeneds and my perception feels hightened. I find it easy to analyze people that are or are not smoking. It brings a control mechanism into the whole experience that never fails. This is one constant.</p>",
 "year": "2005",
 "id": "42404",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-15T07:00:00.000Z",
 "views": "11660",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Pharms - Escitalopram",
   "form": "(daily)"
  }
 ]
}
