{
 "title": "Lost at Intergalactic-Sea",
 "author": "Green-tea fiend",
 "citation": " Green-tea fiend. \"Lost at Intergalactic-Sea: experience with Cannabis (ID 42453)\". Erowid.org. Aug 21, 2007. erowid.org/exp/42453",
 "substance": "Cannabis",
 "bodyweight": "120 lb",
 "report": [
  "<p>The day was greatly anticipated: Friday, noon, a school holiday and I'd be in company of good friends, one of which I have known for a very long time, could, and always have, trusted strongly. But I had no idea that it would be one of the most intense, disturbing, entertaining, groovy, frightening and paradox-infested days of my life, man. It welled up like the great ascension of my favourite song projected into a tidal wave that looms over me in silence; a vision that plays somewhere else in the time-space continuum, while on the opposite side a fainted beat to that song shatters the fearsome dream-state into an infinite amount of pieces that veer off into the Universe only to come shouting back at me with full force, becoming my ego itself.",
  "Don't misinterpret the few negative descriptive words used there though, man; they're just present to throw your conscious-brain off into subthinking and make you forget what reality is like when walking down that long and endless sidewalk that can't quite meet your feet. This is a very small part of the psychological jump that occurred for me.",
  "Forgive the thoughts if they seem unorganized, but they are still struggling to return to this world even now, at 12:29 am after having begun to lose the trail of beta-level of consciousness long ago at approximately 1:00 pm.",
  "I arrived at the place by a couple minutes passed noon, accompanied by my Strat guitar and a tiny amplifier that packs an insane sound that can vary in seemingly a million different ways. Today there was also a groovy navy blue beanie that held itself onto my skull very warmly, something that is somewhat out of character for me. But, luckily, the mood today called for something different, daring, crazy, out-there, and ready to make the world shout, 'Wow'. This something happened to be an unadorned beanie. Ironically, also, this was what saved my very life at one point in the day. Were it not for this thick winter-protective fabric my mind would have been subjected to visions that it wasn't ready to accept. It became a place of comfort and hiding; a physically comforting escape from the fear.",
  "After the arrival, we sat about for a while, jammed a bit, discussed some song possibilities and all the normal shit that I forget after the wave has left every part of my body soaked while the land around me dries up into a vast desert. Then one of my friends invites me to a part of the house that's safe, I know what's going on, he knows what's going on, and he knows that I know what's going on. All is cool.",
  "Standing about, feeling odd and goofy like I normally do when the knowledge of the utter stupor and awkwardness of this adventure brews overhead, my friend extends a nice and pristine bud out at me and says:",
  "'Take a whiff of that, man'",
  "I do so and am totally unable to identify that particular scent, it has a crisp biting effect to it's personal smell.",
  "'Wow, man' I say, 'That stuff seems crazy, man. What is it?'",
  "'Guess. A very cool song was written after it'",
  "'Dude! Purple Haze, man?' I whisper in the closest form of exclamation.",
  "A nod and a big grin is the only response I receive. Now, man, I am not a strongly frequent user of Cannabis [It is only something I gladly indulge in on holidays, special occasions, weekends] and had no idea absolutely that this would be such an insane and other worldly thing for me. Sure, I *knew* this was a strong and crazy substance in front of me, but never did I imagine what was to come.",
  "My friend loaded the bong and, as he did so, gave me a briefing on how to use this particular one. All I could think about was how nice this would all feel, how relaxing it could be. The first hit was nothing, effects didn't settle in like the marijuana I had smoked before and I began to wonder if my friend was even giving me anything at all. The second hit produced some vague feelings of dizziness and so I decided to sit down propped up against a wall, safe from any plunge to the earth below. These were normal sensations for a faint high and I thought nothing of it all. The third hit felt like the second. The fourth was stronger than the others and brought on an odd and different sensation of the muscles I did not know before. I may have taken a fifth or possibly even a sixth hit, but it's hard to truly confirm at this point seeing as my memory began to diminish quickly with specifics.",
  "My friend and I sat in this room for a while and I remember him laughing about someone talking about us as they walked by the door. This freaked me out and made focusing very hard for some reason. Still, however, the effects were not strong at all; just the same as any common and weaker form of cannabis. This, as I remember, gave me mixed emotions that consisted of disappointment, curiosity, very slight paranoia, and a feeling of invincibility.",
  "Finally, somehow, we reach the decision to leave the room and go watch some jamming that was about to take place again. At this point my friend says:",
  "'I hope you're ready to enter the real world with a head full of marijuana, man.'",
  "'Yeh, because I'm about to.'",
  "Standing up and walking wasn't too different from any other time, there was that dizziness, the feeling of overestimating my movement for every step, etc. It was when I sat down on the couch to just watch the jam that everything began to turn. And fast. A sensation of becoming detached from my body began to creep up on me as the others jammed out to some songs I couldn't even identify at this point. I just smiled and enjoyed it, after all, the feeling was mild and rather nice.",
  "Then visual distortions began. My friends began to move away from the world, as if they were coming off of the seems of reality and ripped away from a paper that they had once been glued onto, yet it was all 3-dimensional. This has never occurred before and yielded a feeling of suspicion.",
  "Then the out-of-body sensation was amplified by about 10 times and it began to feel as though I had entered outerspace and couldn't return to my body, which had become a part of the couch. This thought frightened me and I started thinking that it would be impossible to return to reality now. Suddenly viewpoints shifted and it felt as though a part of my self was flying in the air and catching quick glimpses of people at different angles.",
  "A thought entered my mind that perhaps I would regret doing this. I soon found myself traveling through space and time, which now merged insanely. One moment it took centuries for a single second to make it's pass, the next it seemed like hours could have been milliseconds. I began to think that I was moving at the speed of light and had the dire need to 'catch up to my body' but felt like I was moving too fast at the same time.",
  "This is when I became very frightened and started to shake while trying to return to my body. I had to grab onto something and maintain reality, so began to hug the arm of the couch while moving into the fetal position. It felt as though my legs were moving rapidly and my arms and hands couldn't feel my face when I made the attempt to touch it. Nothing felt like it was actually a part of my body, even, almost like I was just a being without a shell, reaching back and touching my discarded and empty self.",
  "My vision darted to every tiny thing in the room and focused on it for what I thought could be maybe just seconds but were possibly hours. This uncertainty of time made me self-conscious for some reason and I feared how my reaction could appear to those outside of my world. Suddenly, and unexpectedly, I noticed my friends laughing and pointing at me. It was like a jump in time to this occuring and they started to transform into these odd bird/dargon/lizard creatures. It was at this point that I felt entirely isolated in another realm and set apart from everything else but still somehow able to see everyone and hear them on some level. But no longer were we in the same place.",
  "'Dude! You're in the fetal position, man!' I remember hearing.",
  "I started wanting to disappear now but remember laughing while feeling my body get forced against the couch, my movements feeling increasingly more rapid and odd. Before I knew it, one of my friends was hopping up very quickly, insisting that I follow because there was a movie file that I had to watch.",
  "Standing up was a real challenging task seeing as my body was out. But somehow I managed it and made it down the hallway to a room with a computer. The insanity of a show called 'Wondershozen' soon came on and it was alright at first, hard to follow or comprehend, yes. But then it became terrifying. The out-of-body sensation had seemed to be wearing off when it suddenly hit me again like a wrecking ball smashing into a rickity old building, but this time it came on about 10 times stronger than it had been before.",
  "A little boy was saying 'Stab you. Stab you. Stab you.' and I watched as his eyes melted off in complete fascination. But I was soon distracted again by the loss of my body and remember feeling odd and grabbing my legs a lot and eventually hugging myself. The insane thing is that I continued to watch this crazy movie file but had no idea what was going on at all anymore. My surroundings became only me and the screen in front of me. There was a vague awareness of others in the room with me, someone standing next to me and such, but that quickly left my thoughts.",
  "The strongest part of this trip came on and began to frighten me. I didn't know what was going on and thought that death was now inevitable if I couldn't return to my body so I was desperately trying to catch up to it but felt as though my movements were faster than the speed of light at the same time. I fell against a wall and held onto the folded parts of my beanie, pulling on it and holding it securely on my skull. The movie file began to get more intense. Things were popping out at me, sounds threatened my safety, eyes stared, mouths laughed, and ears closed to me.",
  "I watched my hands feel the keyboard. Then they were back at my beanie groping the shape of my skull through the fabric, searching, moving like probes.",
  "Soon enough, it became apparent that returning to my body would be impossible and that catching up to it would never be possible and the damn movie was still flashing in front of my eyes. I began to feel hateful towards the odd scenes for their frightening tendencies.",
  "I was told to keep watching it, but I couldn't. I was so frightened of not being able to get back that nothing else mattered. I pulled my beanie over my eyes and began to cry while spazzing out and shaking horribly. However, I didn't even know if I was moving or if I just felt like it. This thought scared me. All the paradoxical realities were so complex with their simplicity that I felt like I was on a grid in the universe and getting lost in each tiny square that is only one in an infinite amount of more just as complicated as that single one.",
  "The wall held me up. If it were not for it, I would have fallen to the floor and reached slowly out to it, to feel that I wasn't within it but just on top of it freaking out more than I ever had in my life.",
  "My long-time friend said something to the effect of, 'Dude... she's really tripping out. Damn... Look at that'",
  "They stopped the movie and I continued having trouble getting out of my spazzing and shaking. Vision became hard to even focus on and because of this, my sight was lost momentarily. I cried more into my beanie and closed my eyes, seeing all kinds of absurd animated-looking images that flowed like violent water into one another.",
  "The question was raised as to whether or not I was okay. Responding was an impossible thing. I couldn't talk. 'or maybe I can' I thought and then wondered if all my thoughts had actually been said. Then I remembered trying to speak and tell my friends what was going on, but it was so hard to truly communicate, sure I had that mystical feeling of being able to transmit all my thoughts, but something told me that wasn't reality; I was giving in to the sub-reality that my body was moving too quickly through. It felt as though I was talking too fast and too slow simultaneously. Words couldn't even be formed, I was just struggling to get a grasp of my body and to catch up to it's lightspeed velocity so that I wouldn't die.",
  "My friends were then taking me out of that room and I remember hearing someone say, 'And it's common for this to happen?' as I was trying to stand. When walking down the hall I had to prop myself against the wall and remember sliding alongside it, feeling like a retarded animal, then I became a bird and felt a hiccup of flight before returning to earth somewhat. I began to become very paranoid, my long-time friend played some soothing guitar and tried to calm me down.",
  "For this, I tried to say, 'I love you, man!' but the spazzing continued. I was given a drink but remember thinking, 'AH! Poison! Oh god, It will kill me again. and again.' I drank it anyway.  Then remembered feeling like I shouted 'Water! Water now.'",
  "Time skipped and jumped ahead, I became aware of the fact that was walking up some stairs and my friends were singing something about going to Mexico. I tripped out and saw all kinds of horse-shoes and other such things you might expect to see in some place like that.",
  "We sat at a table and I laid my head down on it and remember feeling a lot of things on the table's surface. Then I sat up again and had the distinct impression that a malevolent entity was now present in the room with us and couldn't help spinning around to see if it would appear.",
  "I was convinced eventually to just lay down and drink some water. My friends let me be for a while, something that I had wanted at that time. Every now and then one or the other would come back to check on my condition and try to get information from me as to how I was doing but it just wouldn't vocalize yet. I remember feeling very scared, abandoned, and fearful whenever they would leave after that.",
  "Finally, the effects began to become less intense, but were still painfully present. I still felt detached entirely but the uncontrollable spazzing had ceased and it was easier to talk. I might have passed out at one point, it is hard to say, but I do remember waking up and thinking I was hearing a guitar lesson going on below me and that sound of a learning guitarist and his teacher talking and then playing being a very nice feeling that made the return to reality and the eventual repossesion of my body calm and beautiful.",
  "The rest of the trip felt like any normal high. I became entranced by things on the television and couldn't focus on anything at all. The oddity that I never knew could possibly occur on something like marijuana had ended. Life was returning to normal, I had my body back.",
  "All was good.</p>"
 ],
 "year": "2005",
 "id": "42453",
 "gender": "Female",
 "views": "3205",
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2007-08-21T07:00:00.000Z"
}
