{
 "id": 4246,
 "title": "A Night of Complete Serenity",
 "date": {
  "submission": "2008-01-15T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Invictus",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder / crystals"
  },
  {
   "time": "1:00",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Before I get the bulk of the story (for many, details bore), let me just give the overview of my night.",
  "15-20mg dosage yielded about 6 hours of increased energy, incredible extroverted social ability, near total mental clarity, and some of the best visuals I have seen to date. The only two negatives was a VERY slight naseua, and difficulty falling asleep ... Now the story for those interested...",
  "After waiting a long time to get the 2C-I, a friend of mine, B, got his 100 mg. We had no scales and so what we did was broke the total amount into 5 equal lines (about 20 mg each, logically) and then removed a fourth from a line (making an approx 15 mg line) and capsilated it into a gel cap (I used gels caps filled with Fish Oil, available at any GNC etc.) [Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]",
  "At approx 7:45pm i ingested the pill. We built a bon-fire outside to keep warm and talk, waiting for it to kick in. At about 8:45 i became impatient and decided to take a small bump (i simply eyed this amount and have no real idea how much i took, anywhere from 1-5 mg). At this point another friend, N, was with us and had taken a pill of 2C-I earlier. Then we went for a walk...",
  "We decided to go to a rail road track near my house. B and N were starting to feel it, but i yet felt nothing and was begining to get slightly irrate. Once we reached the rail road tracks (B and N already a good 10 min into the start of the effects), the first thing i noticed was the light from the night sky hitting the rail road tracks (the actual metal iron tracks) made them seem to nearly glow. THey were highly pronounced. That was when it started to hit me, at approx 9:30pm, and the clouds clued me into the fact that it was starting to work. The clouds were moving in all sorts of directions, slowly but clearly not normal. There colors began to shift between palettes of red and white, and occasionaly yellowish.",
  "My mind was a buzz with wonder. I felt increadibly joyful, even serene, much like with a couple rolls. We walked up and down the tracks, talking more so than any other drug I have ever tried and taking in the visuals. Contrast between light and dark was very incredible, and visuals like persian carpet and distortians were everywhere. I seemed to notice lights out of the corner of my eyes, but there were of course none there.",
  "Our adventure continued well into the night, we rode around in the bed of a friends truck, looking straight up into the sky where the clouds were practically a euphoric sight. We walked maybe a mile escorting a drunken friend home, which made me realize those not tripping on 2C-I seemed very outcasted to me. We walked to a grocery store and experienced the 'Grocery Store Tripping'. This was rather psychadelic... textures everywhere were moving in crazy patters, ailes seemed to be swaying around.",
  "Then we headed home, and talked... always talking. The amazing thing was the incredibly social ability... everything was funny, but the humor seemed so genuine, strong mental clarity... yet at the same time you could at any time sit back and take in the visuals. This could be done by myself or with many friends. Frankly, I really enjoyed it."
 ],
 "erowid": {
  "id": "28442",
  "citation": " Invictus. \"A Night of Complete Serenity: experience with 2C-I (ID 28442)\". Erowid.org. Jan 15, 2008. erowid.org/exp/28442",
  "substance": "2C-I",
  "views": "2830"
 }
}
