{
 "title": "The Beauty in Music",
 "author": "SRQ",
 "citation": " SRQ. \"The Beauty in Music: experience with Salvia divinorum (21x extract) & Cannabis (ID 42464)\". Erowid.org. Aug 31, 2007. erowid.org/exp/42464",
 "substance": "Salvia divinorum (21x extract) & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>It all started when about 2 monthes ago or so, I went to one of the local smoke shops and had an adult purchase me some 21X salvia, which I've never heard of the 21X but they had it and the guy who owned the shop was tellin me its the best kind to buy.</p><p>I got home and smoke up 3 fat joints of some funky blueberry dro, this was over a period of like 3 hours. Then I decided it was time to try out the salvia. So, I pack up a little bit of green at the bottom of my bowl, and pack up the salvia all the way to the top of the bowl. Its thinner then tobbacco so it burns really fast, but I ended up getting 2 big rips out of it, and one little hit then there was just some green cherried at the bottom. I have to say, salvia is by far the nastiest tasting smoke I've smoked yet. But it went well with the blueberry cuz all along there was green cherried at the bottom.</p><p>As soon as I exhaled each hit, I felt a kind of dizzyness, followed by a weird sweat. The sweat was like a thin layer of water all over every inch of my skin, even my toes. Then, BAM, right after my third hit, I started tripping. I was listening to modest mouse - The Ocean Breathes Salty. Which isn't a song I care too much for particularly. But, it was the most beautiful song I'd heard at the time. I could feel the music inside my body, I was paralyzed by it almost. Each drum beat, each chord played, every lyric made sense to me, and I physically and emotionally could feel it. It was like I could feel something beautiful through my whole entire body, lol. It sounds kind of wierd for me to describe it as beauty through my whole entire body, but I was just so happy and pleased and felt perfect, for once. If I could stay in that moment for ever, where everything is perfect, I would never leave.</p><p>Then things started getting really weird, my walls had mouths all over it. Like, lips. They were transparent lips like the rolling stones logo almost. But they would move like theyre talking, but they werent saying anything. Then, I realized they were my own lips! I was amazed. I opened my mouth, and they opened also. I would stick my tongue out, and they would stick theyres out back at me. I would pinch my lips together like a fish, only to see them do the same thing. My whole room, was covered in mouths. My floor, cable modem, computer monitor. My purple fanta started to giggle at me! Everything looked so realistic. Then, I decided to go sit down and see whos on AIM.</p><p>But when I get to the computer, I noticed my desktop wallpaper. It was a sunset over LA. I could see all the houses, the vivid orange sun shining its light through the once blue skies. The clouds were moving, and there was this man standing on the far left corner of my background. He was kind of painting me, thats the best way I can describe it as. I felt this pressure through out my whole entire body, and I felt like I was being painted against the walls. I look around my room, starting from left to right. Slowly I looked across my room, only to notice that my room was in like fish-eye vision.</p><p>All my posters came to life, my grand theft auto 3 poster was laughing demonically, my bed was swirving around, up and down, up and down like a wave. My dresser was smiling at me. My kangaroo skin pelt from Australia I have in my room was wagging its tail. And my poster of Jimi Hendrix smoking a j, was amazing. He was smiling laughing like hes so happy. Exhaling smoke, takin another hit like it was a ciggerette, and exhales.  His wild curly hair was swirling around in the most peculiar patterns. All of this though, I felt as if I were being painted onto it. Like, I felt like the pressure of the drug was actually painting me onto the everything I layed eyes on, in a sense. That's just the best way I could put it.</p><p>Then, the song ended, and onto the next. Which was talking shit about a pretty sunset - modest mouse. Which I felt pretty much the same effects of the music being through out my whole body. Except a little bit less intense. I was still tripping balls though. So I decided to smoke a bowl of some blueberry to help me relax, because I was starting to get a little bit wierded out by what just happened. Pretty much other then shit moving in my peripheral vision and that I felt like I could understand everything they were talking about in that song that I could never understand before, it was just a blur. I guess my only memory was of that and coming up.</p><p>All in all, if there was some kind of a rating scale for salvia I would have to classify it as, very intense. Of everything I've done, shrooms, marijuana/hash, coke, dxm, hydrocodones, Adderall and codine, salvia is by far the most intense coming up. The rest of it is kind of like I'm just really dazed and out of it. I did it a few more times after that, and each trip was something else far out there. I would say though, its very fun and something I would do again.</p>",
 "year": "2005",
 "id": "42464",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-31T07:00:00.000Z",
 "views": "3393"
}
