{
 "title": "Feeling Hell, Seeing the Real World",
 "author": "Anonymous",
 "citation": " Anonymous. \"Feeling Hell, Seeing the Real World: experience with Alcohol & 5-MeO-DMT (ID 42552)\". Erowid.org. Sep 15, 2005. erowid.org/exp/42552",
 "substance": "Alcohol & 5-MeO-DMT",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Alcohol",
   "(liquid)",
   "",
   "1 hit",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2003",
   "42552",
   "Male",
   "",
   "Not Given",
   "Sep 15, 2005",
   "10708",
   " "
  ]
 ],
 "report": "<p>My friend obtained a small vial of 5-MeO-DMT online. Reading the reports that I've read on it, I was at first scared to do it. I am an avid drug user, minus the psychoactives. I've had bad shroom experiences,  and even marijuana makes me extremely paranoid sometimes. So lets start with that, my brain chemistry. I was watching my friend do the 5-MeO-DMT a bunch of times, and grew more and more interested. He was freebasing it, putting a small pinch in tin foil and inhaling the fumes. He would laugh a little after he did it, and be normal again within a couple of minutes. So naturally, this looked fun and harmless enough, so I tried it. </p><p>The first time I did it, I freebased the suggested amount he gave me.  I inhaled the smoke the best I could and felt the effects almost immediately. I felt... wacky. I stood up from the couch, and felt like I was made out of jello, and I was inside of jello, or something. I just felt really wierd, and cool. It was fun, and the real effects only lasted about 7 minutes or so. Anyhoo... I did this 5-MeO-DMT this way maybe twice before the real EXPERIENCE. It was a couple of days after the first time I tried it, and me and a buch of buddies were out on the town. I was drinking this night and my friend holding the 5-MeO-DMT was with me. I was in the car with three other friends and I asked him to give me some. I told him I wanted a higher dose than anyone's taken so far, because I wanted to feel the crazy effects that I have been reading about (none of my friends yet had felt anything more than  a little trippyness). So in my boysterous drunkeness, I loaded up a much larger pinch onto the foil than I had seen anyone do thus far. My friend lit it up for me, and soon the thick smoke was coming in droves. I sucked in so intensely for at least 20 seconds. Sucking until there was no breath left, blowing out quickly and sucking more. My friend who owned the 5-MeO-DMT along with my other buddies was laughing and saying, 'Holy shit, that's so much...' or something like that.</p><p>I caught my breath and leaned back in the car seat. I initially felt the high that I felt the other times, slight crazy tripping sensation, only this time, it didn't stop there. It kept escalating slowly (as far as the 5-MeO-DMT timeline goes) more and more intense. I started sweating profusely and becoming kind of scared. The feeling wasn't great. I was in this car that seemed to be getting smaller and smaller with my friends laughing at me closing my eyes and saying, 'Oh my god, oh my god' over and over. I was tripping balls. I felt like I was going to die in the car, or I wanted to, and I opened the car door, and fell out onto the grass on my back. The feeling that I was feeling at this point can only be described as such:</p><p>I felt like my body and my soul were being sucked into hell, or sucked into the ground. At the time, it definitely registered as hell. I couldn't really move, and I felt as if something else had complete control of me. I couldn't control what was coming out of my mouth and I couldn't control my body movements. The whole time I felt like I was falling and sinking. I kept thinking that this is what it felt like to die. It almost felt as if I was being sucked into the universe and my body no longer had any bearing on my brain. What it feels like to die, I would imagine. My eyes were closed this whole time, and every time I opened my eyes, I just wanted to close them up again until this horrible feeling was gone. Slowly, the feeling subsided, after ten minutes of intense, horrific tripping. After the experience, I felt really weird and kind of good for the next hour or so. Probably felt good because I wasn't in hell anymore.</p><p>My friend was filming me the entire trip, and the video of me in the car, turning quickly into a dead person saying oh my god over and over, has quickly become the most popular video to see in my circle of friends. For me to watch it was incredible and scary. After I take the 5-MeO-DMT, I face the camera, and to me I look like a completely different person. My eyes are immediately dialated, my face is suddenly titanium white, and I don't recognize the facial expression, or the eyes of myself whom I've seen on video plenty of times. It was definitely scary to watch, but it is so cool that we caught the most intense and hellish drug experience of my life on tape.</p><p>So I obviously told myself that I would never do this drug again, but for some reason, I want to visit hell maybe just one more time.</p>"
}
