{
 "id": 4258,
 "title": "Fall in Rubble",
 "date": {
  "submission": "2007-06-07T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nopigment",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I have experimented with other hallucinogens prior to my mushroom trip such as LSD, Salvia, Nutmeg, Dramamine, DXM, and now mushrooms. I had been wanting to try magic mushrooms for a little more than a year but finding them is not the easiest thing to do.  It all started on saturday night the 15th of November.  I was with my friends D, J, and K.  D picked me up with J and K in the car we went to our local Eckerd to meet the guy.  We got there waited around for about 10 minutes smoking cigs and were doubting he was going to show.  He finally drove up in the dirtiest purple car I have ever seen. D got in the car with him. There was a quick transfer of money and shroomies and then I was finally holding my bag.",
  "I had prepared myself by not eating much that day I had a bagle and three pieces of celery all day.  I quick went into Eckerd for a gatorade and some orange tic tac's and hopped in the car.  No more than 5 minutes later I started eating my mushrooms.  It was 5:50 when I started chewing my first cap, might I add that these were fresh from vermont.  K and J also got 1/8 K only ate half but J ate the whole thing like I did and D stayed sober.  I was told by many that mushrooms taste horrible, but to my suprise they weren't as bad as I thought. I had 2 large caps 3 smaller caps and 1 stem.  I made the mistake of eating them all without stopping after each cap to swallow so I ended up having a big mouthful of mushroom swallowing a little at a time and then holding the remaining mushroom paste under my toung for 10 minutes. ",
  "I was heading for a local show with D, J, and K when some asshole cut in front of us and we almost had a car accident. Boy am I glad that didn't happen.  About 10 minutes after I had ingested the mushrooms I started to feel quite giddy.  I couldn't wipe the smile off my face.  We arrived at the show at 6:10 but no more than five minutes later when I was talking to my best friend B did the mushrooms take control.  B started to grow and then shrink back to normal size again then her voice started to echo.",
  "I told her that I was feeling effects and she asked me if I would like to join her at the coffee shop.  I accepted the invitation and walked down the street to a place called Fennario's.  I got a small green tea with out enough honey.  I sat down on one of those chairs that are really tall and spin.  I then put my hand on the table and looked at it for a minute or two just amazed at how different it looked.  It had taken on an almost alien look it seemed to be bigger than normal and flat.  My friend G who was sitting next to me asked if he could have a sip of my tea.  When I didn't reply he started to ask me continuosly if I was alright.  I finally snapped out of my transe and answered him in a snappy tone 'Yea I'm fine.' I don't know why I was such a bitch, but he ended up getting the tea he wanted.",
  "After I was done sitting and looking at my tea and spinning around I left Fennario's and went outside where I met up with my friends K, D, and D.  I started talking to them about something, I don't remember what, and then B walked out of Fennario's.  B suggested that we go to the art gallery a couple blocks away.  D said he was going to go meet up with some other people so the D who drove K and I to the show went with us.  We were walking for hours or so it seemed it was probably no more than 10 minutes. When we were walking we encountered a sidewalk that was in the process of being redone.  I had to walk through rubble.  I thought I would be fine but I fell in a hole that was as deep as my leg masked by leaves.  I yelped and then laughed about it. When we arrived I was already hallucinating quite a bit so I had to chill myself out before I walked in.",
  "When I entered the gallery I felt like a puppet and I had strings on every appendage of my body.  I put my arm around K's neck to hold myself up. He started laughing and then so did I.  I walked over to the first picture, it was so abstract I couldn't believe my eyes.  I stood there marveling at it for a few minutes. While I was staring at it I felt myself entering the picture and then getting too far out of reality and jumping back out.  Moving on to each picture it was the same thing. D grabbed me by the arm and brought me over to one very interesting piece of art from what I remember it was two shades of black and in the center there was a rainbow shaped glistening piece.  I stood looking at it in awe.",
  "At the other end of the gallery there looked to be a small auction room with chairs in it, there were two extremely comfortable chairs that were black with wooden legs that you could just sink into.  B noticed them and told me to sit so I did and when I sat down the chair completely engulfed my body and I felt like I could never get up again.  D finally came to the rescue and pulled me out of the chair.  A few more turns and the art was so amazing that I had to get out of there. ",
  "A little ways down the same street was a CD store and we all went in to look around.  There was a pattern on the carpet that was green and red and blue with a diamond pattern and there was also a mirror in the back. I walked to the back of the store to look at my eyes, and no suprise to me my pupils were so big that you could no longer see the brown of my eyes.  I stood in the store for a few minutes forgetting what I was supposed to do. I was too distracted by the shiny cd cases and the swirling pixels I was seeing.  We soon left the cd store and were on our way back to where the show was. ",
  "The show had not started yet so B, K, D and I hung around outside of another show on the same street just listening to the music.  B and D were hungry so we went accross the street to the pizza place and they went in.  K and I stayed outside with some other friends.  By this time I was thinking way too much.  I was thinking about everything that was going on in my life and everything about the world for instance what are weeks? Why are there minutes, seconds, hours? What does everything mean? Basically Why this Why that. I kept asking K to answer all these questions and he said that he had the same questions. So many questions with no answers.  I was sitting down next to K outside of the pizza place and I was hugging everyone then I settled in k's lap laying down almost like a dog hiding under my warm hat and was comforted by my hoodie. ",
  "B and D came out of the pizza place and ate their pizza.  We were so cold that D asked if I would like to go sit in his car.  On the way to the car I put my golves on because my hands still looked like alien hands I was so glad I did because I was so cold my hands had gone numb with out me noticing.  We ended up piling in 6 people into his ford focus and listened to some music I didnt know what it was.  In D's car I looked out the window up at the sky and just thought and wondered the same questions. Everything I saw was covered in a different pattern which made EVERYTHING interesting.",
  "We then got out of the car and still feeling like a puppet I stumbled back to the show which was being held above Fennario's.  It still had not started so K and I sat down outside of the other show that was on the same street against the wall.  I remember looking accross the street at a tree and it changing form every time I blinked and then I looked at the sidewalk in front of me which had patterns on it with beautiful abstract faces and circles in all different colors.  Then I was facinated by K's pants which were brown corduroy.  They changed from brown to electric green and swirrled around in different directions. I then glanced back at my own pants which were doing almost the same thing only I could see like I was looking through a microscope.  I could see each individual fiber which was covered in swirling pixels.",
  "I then lit up a cig and started concentrating on passers by.  When I trip if I start smoking I dont stop until all of my cigs are gone, fortunately I ended the night with three out of 18 left.  I saw a dog that seemed to know what I was thinking and a young couple with a baby. That baby really bugged me out it looked like a little demon.  D then told me that we should go pay and get stamped so I got up and walked with him to fennario's.",
  "At this point I was so utterly confused I had to be told exactly what to do.  I got out my wallet and took out three dollars I stood behind D and got impatient and walked outside with the three dollars still clutched in my fist.  Outside I saw my other friend D and some other people I know but can't remember exactly who they were.  D then came outside wondering where I had gone.  He seemed concerned and said in an echoing voice 'You were right behind me and then you dissapeared' I told him that I had forgotten what I was doing and left.  I went back in and gave the guy my three dollars and got my hand stamped.  The stamp was a cup of coffee with steam coming out of it but I interpreted it as a very large mug of soup with smoke billowing out of it.",
  "I then proceeded up the steps with B right behind me.  I sat down on a chair next to B and then got a very worried look on my face, I had become so overwhelmed by all of my thoughts that I didn't know what to think and I didnt know what I had done to myself.  I thought I was never going to stop tripping.  Before I knew it I had started to cry.  B tried to comfort me by rubbing my back and asking me why I was so upset.  I didn't have an answer for her, I said that I was fine and looked away until I had stopped.  I then got up and went to the bathroom, the bathroom had red walls that seemed to be closing in on me.  This frightened me a bit but I calmed myself down and just reminded myself that I was on mushrooms. ",
  "I stepped out of the bathroom and waited for B who went in next.  I stood there for what seemed to be 20 minutes.  I then sat down next to my friend K and started smoking a cig for comfort this helped a little but I still could not stop thinking about life and asking myself all kinds of unanswerable questions.  I struck up a conversation with K about our nights.  Turns out she was pulled over for speeding through a red light and I had almost gotten into a car accident, being able to hold a normal conversation really put me at ease.  My friend M's band had started to play and people started dancing a little.  Then I told B that I wanted to go outside so we did and met up with my friend G who was driving B and I back to her house.",
  "At that point I had almost completely stopped hallucinating but was still asking myself all of these questions.  On the drive back to B's I had stopped hallucinating and just thought about my night and what I had done.  I had a bit of regret at the time but that passed.  When we got back to B's house I sat down in her room telling her what had happened to me and then I washed my face and changed into pj's.  We watched some tv and I talked to B and K online for a little while then I was off to sleep. ",
  "I woke up the next day feeling pretty normal, but I was a little slow.  I really enjoyed my journey on mushrooms and I plan to do them again in a few weeks.  I hope they will be just as much fun.  If I could change anything about that night I wouldn't.  I enjoyed it all even though I over thought everything and got a little emotional. But my first LSD trip was like that also.",
  "~Arianna~",
  "11/16/03"
 ],
 "erowid": {
  "id": "28473",
  "citation": " Nopigment. \"Fall in Rubble: experience with Mushrooms (ID 28473)\". Erowid.org. Jun 7, 2007. erowid.org/exp/28473",
  "substance": "Mushrooms",
  "views": "2438"
 }
}
