{
 "id": 4259,
 "title": "I Will Be Bringing My Experimentation to an End",
 "date": {
  "submission": "2004-02-05T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "vga35mm128",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "2-Aminoindan"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "2-Aminoindan"
  }
 ],
 "report": [
  "After a whole weekend of testing this stuff out, I have come to the conclusion that 2-aminoindan is in fact 'a dud'. It has no psychoactive properties at all. It does effect me very very slightly, and feels similar to drinking a couple cans of pepsi. (and that's after snorting 100+mg!!!!) Seriously, a cup of coffee would have more of an effect on my body. However, after ingesting about 50mg and snorting 100+mg,(not recommended) I get an extreme over-caffeinated feeling; such as anxiety, cold sweats, trouble eating/sleeping, increased heart rate, and all together, these make for an overall terrible feeling. Anyways, I will be bringing my experimentation with 2-aminoindan to an end for now, (I still dont know what i am gonna do with the rest of this shit!) Because as far as recreational purposes go, this stuff is useless.",
  "Also, here are a few facts about my experience with 2-ai: right after nasal administration (snorting) there was  an extremely intense pain in my sinus cavity which lasts about 30 seconds before fading away (perhaps because of the dryness of the powder). The drip following has a somewhat gross but bearable taste as would be expected. (it's mostly bearable because of the intense pain I just went through a minute ago) also, the stuff is way over-priced, so go buy a few pizzas, a case of mountain dew, about 5 dvd's, and call it a night."
 ],
 "erowid": {
  "id": "28486",
  "citation": " vga35mm128. \"I Will Be Bringing My Experimentation to an End: experience with 2-Aminoindan (ID 28486)\". Erowid.org. Feb 5, 2004. erowid.org/exp/28486",
  "substance": "2-Aminoindan",
  "views": "13247"
 }
}
