{
 "id": 4260,
 "title": "Up Too Fast",
 "date": {
  "submission": "2003-11-20T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "alterego",
  "gender": "Female",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I had heard a lot of hipe about 2C-I.  Never one negitive thing.  Being the known queen of the psychodelic drug world in my ring of friends, this was something that I felt I had to do.",
  "I bought (2) 20mg capsules of 2C-I at a party-- one for my fiance and one for myself.  This was going to be the trip of my life... or so I had thought.",
  "We took them the next night. While we were waiting for the pills of 2C-I to kick in, we sat watching a terrifying movie, where everyone in it had horrible trips.  2 hours since we had taken the pills and we hadn't felt a thing.. I was getting pissed. ",
  "As soon as the movie ended, I began to feel tingily all over.  It was as though my body was in an everlasting orgasm.  I began to go up very fast.  I suddenly felt a dire urge to explore the world around me... to go outside. ",
  "Outside, everything seemed so pure, and so clear.  As I walked I felt as though the grass was taller then myself, although it had just been mowed the day before.  I walked to the end of my drive way, fiance at hand.  We stood there for what seemed an eternity.  I had never tripped this hard before.  I began to become frightend that I was to become the first 2C-I related and reported death on erowid.",
  "My fiance and I walked back to the house and sat outside on our front steps.  I felt overly fidgety and couldn't be happy with any way that I would situate my body.  My fiance noticed my aura of panic, and asked me how I was doing.  I explained to him that I had gone up way too fast and how I was begining to freak out.  He still didn't feel anything.",
  "I looked up at the sky.  Not a cloud in sight.  My reflection was as clear as could be in the sky, and my fiance's as well.  This couldn't be happening.  I had never had one bad trip in my life.",
  "My fiance, begining to get worried, called a very experienced friend of ours and put him on the phone to talk to me.  All I could say is that I wanted more then life itself to come down, to end the trip.  He told me that it was 'pretty hard-core stuff' and not to worry. I felt much better.  I was no longer pleading with god (who I never had believed in before) for my life.",
  "We went back to our room where everything was amazing.  I stared at the wall, watching a wave of liquid metal envelop everything.  The curtains, the ceiling, the lights, all looked as though they were a shiny polished metal.  Everything was so pristine.  I looked at my hand and saw the most amazing tracers ever.  There was a beautifully colored rainbow with butterflies chasing the rainbow.  If only it would have lasted...",
  "Digital.  That's what everything became.  It was as though everything in sight had had a grid of wire placed over it and chopped it all into seperate pieces.  They fell to the ground leaving me seeing only the code of the matrix itself.  I realized that there really was NO spoon.  I could hear metallic ping type noises (watch Cube II for a great example).  I stayed in this place until I finally began to come down from my trip.  I began to feel like I was on acid.  My fiance and I were both very talkitive, and in great mind states for the rest of the night. ",
  "In retrospect.. I would definately do this drug again.  Although quite frightening at first, there were a lot of great, detailed visuals, which I completely became a part of.  The feeling of going up too fast could be compaired to taking a moderate dose of ecstacy on an empty stomach while also being dehydrated. ",
  "I would totally recommend massaging those around you who are on this drug, as well as scoring a massage for yourself.  Sex, also, is absolutely ungodly wonderful.  After a while my body began to ache, and these two things put me in complete heaven."
 ],
 "erowid": {
  "id": "28487",
  "citation": " alterego. \"Up Too Fast: experience with 2C-I (ID 28487)\". Erowid.org. Nov 20, 2003. erowid.org/exp/28487",
  "substance": "2C-I",
  "views": "10751"
 }
}
