{
 "title": "Very Physical and Surreal",
 "author": "Hardts",
 "citation": " Hardts. \"Very Physical and Surreal: experience with H. B. Woodrose & Cannabis - Hash (ID 42609)\". Erowid.org. Apr 25, 2007. erowid.org/exp/42609",
 "substance": "H. B. Woodrose & Cannabis - Hash",
 "bodyweight": "66 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5 seeds",
   "oral",
   "H.B. Woodrose",
   "(tea)",
   " T+ 0:00",
   "1.0 g",
   "smoked",
   "Cannabis - Hash",
   "",
   " T+ 5:00",
   "2 seeds",
   "oral",
   "H.B. Woodrose",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2005",
   "42609",
   "Male",
   "",
   "Not Given",
   "Apr 25, 2007",
   "8240",
   " "
  ]
 ],
 "report": "<p>I recently asked one of my friends about mescaline, and where you could get it, he told me about a Danish (I'm Danish myself) site called, shows that the store was actually located quite close to where I live (In the middle of Copenhagen). I thought mescaline was the same as the HBWR seeds at the time. After reading a lot, Me and some friends decided to go down there and have a look at things. There where 3 of us; Me (Ill call myself 'Hardts'), Simon, and Daniel. I expected that I wouldn't talk about ingesting anything bought from the shop since most of it is illegal. Because of that, we did a lot of research about the substance before going down there. It turns out, that the store clerk was happy to tell us anything we wanted to know about the numerous substances they had in the store.</p><p>After hearing about many different things, we settled on the HBWR seeds for which they had in many variants, they had the second class type that costs 100 DKK for 3grams (about 25 seeds), and the first class seeds which where more expensive, but also much more potent (1grams for 100DKK, which is 10 seeds). He told us, that it would be easier to control since a much smaller amount of seeds where needed. 3-10 seeds are recommended with first class seeds, while with the Second Class seeds you would seem to need to triple the dose. So we choose the First Class seeds. We also bought some Tibetan incense to fit the mood of this weird legal drug.</p><p>Anyway, we went home to Simon. Firstly, we prepared the seeds by removing the coat, chopping them up with a ridiculously small knife for which I got a little annoyed that I had to use and then I put the seeds in three glasses of water. We chose to do 5 each, since that was what the guy in the store recommended for beginners.</p><p>After Making the 'drinks' ready, we rolled a nice big Joint, and went outside. He lives in a nice place full of nature, yet still in the middle of the city. In Denmark we call it a 'Garden community', but Im not sure thats correctly translated.</p><p>Anyway the time was about 8:30 pm, we went out for a little walk to smoke the Joint.</p><p>We where all exited of what to come of course, and talked about it. This is the first time I have ever smoked a joint with a purpose other than getting stoned, this time it was different. We did it because we had read it would prevent any possible nausea that might occur after ingestion. Therefore none of us had any of the usual excitement about smoking, It's not that we are not used to smoking, we do it often and enjoy it every time. But this time we just smoked, and it was a funny way to suddenly realize, that you where stoned. 20 minutes later or so we went back, and I dont actually remember if we went to a store to buy some beers and smokes before we got back, or if we did it later, but that was the plan, and we did.</p><p>When we got back to his place (none of us live in our own apartments yet, we are all 18-19 and so on, but live at home) we where quite stoned. I remember being so stoned that I, for a minute there, got cold feet about the whole thing. We did after all smoke a good big one with some expensive hashish I got a few days earlier.</p><p>We took the three glasses out from a shelf we had put it in, and placed them on the table. The setting was good, he's parents where out to a party, and would probably come home drunk later, which was very fortunate so they wouldn't really notice that we where tripping. We where all exited as we began drinking the liquid. It was green! I had read some reports that the taste should be bad, I however never noticed this. I couldn't taste a thing because I was so stoned, so perhaps that was a good thing.</p><p>We started to drink it about 9 pm I think. Daniel actually said, after taking the first few sips, he felt something weak for a moment there, something that wasn't the hashish, something else. I subsided that idea since I had read that it would take approx. a few hours before the effects would start to show.</p><p>An hour after, knowing that we should be close to the start of the trip, we warmed up some food he's parents had made earlier, but that we had turned down because many reports says that its a good idea to keep an empty stomach. This however was a bad idea, It felt very weird to smoke hashish on an empty stomach. The food was good, really good, but halfway or so through my lovely meal, something happened. I suddenly felt my face being very heavy. The feeling came very suddenly, and moments after they confirmed that they felt it too. I didn't really want more food at that point, and I had to admit that I needed to lie down a bit. I felt some nausea, and had felt it rising.</p><p>A funny thing, when I stood up, I noticed how bad my balance had gotten!, I had very bad my motor skills, something that I found very entetaining as it got worse throughout the night. I actually fell, and had to support myself at the kitchen table. Simon and Daniel watched me with surprised looks, and Simon said 'What are you doing..?!? walk straight man,' or something. Anyway, I felt bad, so I wanted to go lie down. So thats just what I did.</p><p>I should note here, that I have a few problems with stress, sometimes it's really serious, and it's sort of a vicious pattern of thought. I don't necessary have to be stoned, drunk or whatever for it to happen. I can also say, that sometimes it works like this: I sense the thinking of the thought of having the stress, and then I quickly think not to think the thought resulting in thinking exactly what I'm trying to avoid thinking. Very unpleasent.</p><p>Unfortunately, thats kind of what happend to me when I lay down. The stress got really bad, and at one point I sort of tried to releas it by letting it take over, trying to be careless, but that made it worse and my heart was seriously pounding hard now. It feels sort of like a fire in my stomach that I have to keep under control. If I loose the control, it takes over and just spreads very rapidly, extremely unpleasant. I think much of it was caused by the fact that I was very exited to see what would happen, and this would trigger the stress.</p><p>Luckily, I actually got it under control at one point, and it sort of disappeared, something that never happens at any other time. Usually it takes a few hours before I can get it of my back, weird. Anyway when I stood up and walked to the kitchen, at about +1:45, I noticed just how bad my motor skills was.</p><p>What followed was Interesting. When I got back in the kitchen, they where sort of done with their food, and could now (like me) feel the effects. They got up, and we went into the living room, and I brought the rest of my food. Eating it was a great challenge, I felt like it was the first time I ever used my body, and it was a completely new instrument to me. My motor skills where very rough, only able to do basic tasks.</p><p>This was interesting, because I felt like at the same time, that my mind was separated from my body which gave the impression that I could watch myself behaving in this odd way, but werent able do anything about it! I was also very visually disoriented; I would sit back in the sofa, get up, walk around the sofa table and then look at the sofa from there. That was apparently to big a task for my sense of direction, I just could not believe that I was looking at the same room.</p><p>Another thing I noticed was, that my physics felt like I was back in the oral phase!</p><p>I constantly wanted to put things in my mouth! also because of the crudeness of the physics, I actually noticed myself drooling at one point.</p><p>Communication was also limited to simple sentences, it wasnt that I couldnt think or anything, just that the ability to stay tuned on the same thought was a very hard task. Therefore, every time I spoke, I didnt get very far before I suddenly interrupted myself with there mere thought of What..?, What was I saying? How can I .. I dont remember.. or something like that, so speaking was hard and actually quite entertaining as it was reduced to ridicules sounds later on as it was so hard.</p><p>For long time, we just sat there in the sofa listening to music, and trying to talk, and smoking a hell of a lot of cigarettes due to the oral phase thing. Not that I think we wouldnt if we hadnt eaten the seeds, cause I always seem to smoke a lot when ever I'm drunk, stoned or anything in the thereabouts.</p><p>Anyway, at one point we decided to go outside. It took us about an hour before actually made it outside because of the communication problem! Simon who lived there, insisted that we did the dishes (or that he would do them at least..) before we went out. I tried to do it, but it was simply to hard as my motor skills where only very basic.</p><p>Finely later we got outside. The problem here is, that here is a leak in my memory, sorry, theres a black hole. I simply cant remember where we went or what we did outside! I only remember getting back, and he couldnt figure out how to open the door hehe. Luckily he succeeded after about 5-10 minutes of jerking with the keys! At least I think 5-10 minutes went by, but that could of course be my sense of time.</p><p>Anyway, we finely got inside and began the process of taking our shoes off. That took ages, and we didnt get done before hes parents actually stepped in the door with the words THATS IT! They wanted to scare us for laughs, and certainly succeeded! We all got a shock, and immediately responded with a Emh, we, of course. The panic quickly subsided as we saw their expression shortly after. Very embarrassing. We went into Simons room and at this point (2 am I think) we were sobering up. However the three of us still had huge pupils and very poor speech abilities.</p><p>After half an hour, a guy name Aske came over very drunk, and told us about what he had done and so on, he wanted us to come to a party which wasnt really a party and was closing up soon. We then came to the conclusion that we didnt plan on doing the seeds anytime in the near future so we might as well just eat the rest now, and see what would happen. We had bought 20 seeds in all, Simon had only had 4 in stead of 5, so that left us with 6 seeds remaining.</p><p>We ate them through same procedure. 1 hour later when Daniel had gone home and Aske too, we started feeling the effects. They where nothing like the trip we had had earlier but more like a taste of it. Now it was at this time my trouble began. Because of the stress I have mentioned earlier, I always have difficulties sleeping. The seeds didnt help of course.</p><p>I didnt fall a sleep before 10 or 11 am the next day. I just laid all night while my stress completely took over. Then I fell a sleep and slept till about 1 am when We woke about the same time, unable to sleep anymore which is highly unusual for us. That was indeed one of my worst nights but it was well worth the experience, next time I wont be eating to more seeds later on hehe. Stupid idea. Something interesting is, that none of us experienced hallucinations, I believe it would take a higher amount of seeds for that, so next time I will experiment with 6 or 7 seeds.</p><p>When talking after-effects, I would like to mention, that I was slightly visually disoriented the next day, and the following day after that. I couldnt recognize shapes and colours until close range. Oh yeah, and my pupils where still big with my right one being significantly bigger ?!? So that was our trip. A very interesting drug the I would do it again.</p><p>Until next trip,</p><p>Hardts</p>"
}
