{
 "id": 4263,
 "title": "First Healing",
 "date": {
  "submission": "2007-01-29T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Infantshaman",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "I have a long history of mental instability and like problems.  I am not touting my diagnosis, but my psychiatrist has labled me as schizophrenic, this will come into play later as it means a splitting of the mind.  I had smoked salvia several times while both drunk and stoned and perceived minimal effects.  I recently have been reading up on shamanic practices and the shaman's interactions with plant drugs.  My drug use has been fairly extensive with my drug of choice being marijuana.",
  "Habituation and psychological addiction led me to stop doing this for a while. ",
  "So a friend gave me a small bag of salvia leaves because he did not enjoy their effects.  I decided to use them in a shamanic way instead of just getting 'fucked up' as I usually do. Note: I was on no medication, perscription or o.t.c., and was not under the influence of any other substances; I also did not have a sitter.  I smoked a reasonably sized joint of them and lay back.  I have read that salvia is very shy and subtle and will not show herself unless you pray (whatever that is :)) and are very calm.  I had very clear intentions of healing psychological wounds that I was conscious of and was in a very medatative state of mind.",
  "The first effects that I noticed were a stregnthening of my focus and ability to 'let that which does not matter truly slide.'  I kept a very prayer-like intent and offered myself to salvia and asked her to help me heal my wounds.  I began to feel a very distinctly female presence that was manifesting herself as both emotive force and an ethereal dragonfly/butterfly/fairy type entity.  I could feel the wings slowly beating against me; their movement resembled water more than solid wings.  This was not a physical sensation, but a psychospiritual/emotive one.  The wings were disproportionately large for the actual 'body' of the entity, and at each languorous beat I felt a soft but powerful surge of energy which spread across my body. ",
  "As I got deeper into trance both by meditating and the effects of the salvia I began to visualize where/when the psychotic split of my mind had occurred.  As I was doing this the entity was swimming around me giving me her energy and encouragement. When I had properly visualized the break in my mind and this was the only thing I was focusing on, I felt one final beat of salvia's wings and the energy spread over me and sealed like a womb or a cocoon.",
  "This next part is rather difficult to describe as I have no frame of reference with which to compare it so bear with me.  I saw my consciousness as two seperate fields of energy kept apart by a very negative and powerful force that resembled a cross between magnetism and occult energy.  I was terrified at this point because I had never confronted this issue so directly as to be aware of both parts of my mind at the same time.  The energy keeping the two fields apart was horrible.  As I got lost in the fear of this energy I felt salvia's pressence again and was soothed somewhat.",
  "She proceeded to calm me with more wing-beats and as she was doing this I could feel her pouring herself into that occult/magnetic energy between the two fields of my consciousness.  As she poured herself into it, she began to encompass it and wrap herself around it, to form a shell around it.  As this shell hardned the fear dissipated and I was able to return to a calmer state of mind.  This seemed to help the process because I could feel the two fields begin to be attracted to each other. ",
  "At this point salvia gave one very serious beat of her wings which I actually physically felt as the energy spread through my body and the hardened shell of negative energy blew away like dust.  The two fields of my consciousness then melded together and the split was healed.",
  "This happened last night and I've obviously been reflecting on it extensively.  I never had any true hallucinations throughout the experience, just very active and clear mental imagery.  The whole experience (based on the timing of a CD that was playing) was about 30 - 45 minutes including the come down which I did not describe as it was just meditation in which I was continuing to pray to salvia and keep the mental image of my mind as a singular field.",
  "I know that this process did not fully get rid of that magnetic/occult energy that splits my mind sometimes, but the singularity has been present all day.  The way I interpret this is that salvia helped me do it once and gave me the tools for doing it myself when I need to; or I can go back to her for help.  I do not know whether or not I accept right now the idea that plant drugs are emmisaries from the Green Kingdom, because I have seen my mind do stranger things on its own.  An equally logical explanation for my experiences is that I do not believe that I have the ability to heal myself and so must use a drug induced trance state along with the hallucination/delusion of another entity, which is actually simply a projection from my unconscious, to do the healing.  Right now I am leaning toward the Green Kingdom idea simply because it didn't feel like me; it was another intelligence interacting with my own.  Thus I speak of salvia as an entity. ",
  "Suggestions for users: be calm, clear, and very open; do not laugh.  salvia is a subtle mistress but is enormously intelligent and helpfull.  CLARITY OF INTENTION IS VITAL",
  "I look forward to trying the extract at some point soon, when i need it."
 ],
 "erowid": {
  "id": "28494",
  "citation": " Infantshaman. \"First Healing: experience with Salvia divinorum (ID 28494)\". Erowid.org. Jan 29, 2007. erowid.org/exp/28494",
  "substance": "Salvia divinorum",
  "views": "15337"
 }
}
