{
 "title": "Effect Depends on Energy Level, Dose, etc.",
 "author": "anonymous",
 "citation": " anonymous. \"Effect Depends on Energy Level, Dose, etc.: experience with Modafinil, Fluoxetine & Various (ID 42646)\". Erowid.org. Sep 19, 2006. erowid.org/exp/42646",
 "substance": "Modafinil, Fluoxetine & Various",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Fluoxetine",
   "(daily)",
   "",
   " ",
   "oral",
   "Pharms - Phenylephrine",
   "",
   "",
   "2 shots",
   "oral",
   "Caffeine",
   "(liquid)",
   "",
   "100 mg",
   "oral",
   "Modafinil",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Having been depressed and out of work for some time I decided to get Fluoxetine (Prozac), I had previously been using a combination of Pseudoephedrine (1 or 2x60mg) or Phenylephrine with Caffeine (Lucozade Citrus Clear works best for some reason) and found this quite a useful upper, especially in the mornings. Pseudoephedrine and Caffeine sometimes led to confusion, an inability to follow trains of thought and conversations instead of giving a high but did help me to lose about 10Kg (20lbs). Phenylephrine and Caffeine generally caused a speed like high (but milder and shorter), the accidental discovery of this combination led to further experimentation.</p><p>After a while on 20mg Fluoxetine and 60-120mg Pseudoephedrine/day I was finding that I was getting less and less sleep as I was needing more and more caffeine to get the desired effect, to wake me up in the mornings and keep me that way. Excess caffeine was also reducing my tolerance for certain people and things. I came across an article in The Readers Digest about Modafinil and have since been trying to find the right dosage and how it reacts to other stimulants.</p><p>I first took the modafinil (100mg) with a 2-shot coffee after earlier consumption of Phenylephrine and was amazed by its effect and decided on 50mg for the next day as it was a little too much given that it lasted so long. However, subsequently effects [from 100 - 400mg] have diminished and its effect does seem to be very dependant on general energy levels and dosage. I'd also add that its effect depends on what I am doing and what I mix it with. I think it does have abuse potential but not in the conventional sense, more as a background on which to apply other stimulants based on the way that stimulants tend to boost one another's effects (e.g. Pseudophedrine doesn't do much but clear my nose unless I add some fairly pure caffeine).</p><p>Observations (Modafinil rather than Fluoxetine):</p><p>General boost in alertness and need to 'do stuff'</p><p>An extasy/speed/LSD type enhancement in music (most obvious in orchestral/dance)</p><p>Improved mental arithmetic and number string recall</p><p>Decreased ability to spell/type correctly</p><p>Effect seems to last until I decide to go to sleep</p><p>Driving ability improved (but more likely to drive fast)</p><p>General situational awareness (and possibly lateral thinking) improved without inducing paranoia</p><p>More relaxed, chatty and talkative in social situations</p><p>Generally makes it easier to focus on a task and makes things more enjoyable.</p><p>Reacts well to Phenylephrine and Caffeine (but not too much when mixed or I'll feel sick)</p><p>Like speed without the psychotic comedown/insomnia</p><p>Like caffeine without the jitters</p><p>Lasts all day, to go all night and through the next day I found it's best to increase the dose or reduce the time between doses once I'm beyond or outside normal waking hours.</p><p>A top-up around mid-day can help (but not always)</p><p>40 hour day is quite feasible without adverse effects, my wife didn't realise I'd been up all night until I told her the following evening, but I do still need to catch up on sleep.</p><p>Sometimes it feels like it's not working</p>",
 "year": "2005",
 "id": "42646",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-09-19T07:00:00.000Z",
 "views": "29453"
}
