{
 "title": "An Archetypal Acid Experience",
 "author": "Captain Planet",
 "citation": " Captain Planet. \"An Archetypal Acid Experience: experience with LSD & Cannabis (ID 42665)\". Erowid.org. Aug 25, 2007. erowid.org/exp/42665",
 "substance": "LSD & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 g",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 0:00",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " T+ 2:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>A few weeks ago, I came into possession of some acid.  Of course, I found a friend to drop with.  For the purposes of this story, let's call this friend Greg.  It doesn't matter, he's not very important to the story anyway.  Greg and I sat inside and smoked 3.5 grams of good weed, pretty evenly distributed between us.</p><p>I took my two hits after clearing most of my last bowl, but Greg decided he would wait for a few minutes.  In those few minutes, he dozed off, and I was unable to wake him.  I've tripped alone before, but I was a bit wary that night, being as it was his house and all.  I sat, listening to music, and began to feel the acid creeping up on me in a about 20 minutes.  The trip turned out to have a little bit of everything one expects from acid.</p><p>T + 00:30</p><p>Mild visuals.  In the corner of my eye, the stucco on Greg's ceiling began to 'drip,' in but would quickly revert to normal when I looked straight at it.  At this point, there was no altered thought process that couldn't be attributed to the pot.</p><p>T + 01:00</p><p>Visuals were a bit weirder.  Staring into Greg's ceiling, I would begin to see fractal patterns composed of Spanish galleons laid over a green sea.  These could be neutralized by blinking or looking away.  I began thinking as if I were born for the first time, yet ironically, the feeling was familiar (I've tripped on acid before).  Common concepts seemed very new to me, such as the idea that hands can be used to touch things.</p><p>T + 01:30</p><p>Intense visuals.  Among some of the most intense were visions of my friend, 'Walter,' appearing in the wrinkles of a towel on the ground.  The ceiling was raining.  I would see Greg sleeping on his bed (where he actually was), then on the floor, then on a table, then on the ceiling.  All these images were clear as day.  My mind was sufficiently lost at this point.  I was more than convinced that my genitals were angry with me for some reason they refused to reveal.</p><p>T + 01:45 (est)</p><p>I went to the bathroom.  Let me tell you right now, Greg's bathroom is not a very acid-friendly area.  Where before I was feeling excitement and physical euphoria, entering his abrasive, lime-green bathroom turned my trip around.  I saw the faces of at least 50 people I've known throughout my life, all hovering outside his second-story bathroom window.  Their pale hands began to slap the window, and I was hearing it all in great detail.  I was briefly concerned that my mother would hear and I'd be caught, forgetting that my mother was not even in the same town, let alone the same house.  This idea made me very insecure.  Then I looked in the mirror and saw that my face was melting and my eyes were gone.  I have yet to experience greater terror.  How I managed to successfully urinate and retreat back to Greg's room is still a mystery to me.</p><p>T + 02:00</p><p>With music and a little more marijuana, my good feelings were restored tenfold.  Colors would dance and blend in front of my eyes in accordance to the beat.  I felt as if my brain was dancing.  At times, I believed Greg was dancing to the music, though he still hadn't woken.  I won't bother to detail the next few hours, as they consist mainly of myself thinking and staring at the images that played in front of me.  I don't think I moved from that spot until the sun began to rise.</p><p>T + 05:00</p><p>At this point, the trip had subsided a bit, and I felt nearly ready to sleep.  Or so I thought.  The sunrise exploded toward me with such a total radiant beauty that I couldn't bring myself to even blink until it had finished.</p><p>T + 06:00</p><p>My thought process had restored itself to normal, but I was still seeing things like mad.  I walked around a bit, but couldn't feel my feet touching the ground.  I hovered over to Greg, who was waking up, and suggested to him that we get some food.  Breakfast was orgasmic.  Seriously, I was feeling so good that I sprouted a triumphant boner and nearly creamed my jeans.</p><p>T + 07:00</p><p>I was still feeling very dreamy, though I think at that point I could have allowed myself to navigate in society relatively unnoticed.  Greg commented on the size of my pupils.  I spent the rest of the day in a blissful little haze.</p>",
 "year": "2005",
 "id": "42665",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-25T07:00:00.000Z",
 "views": "4073"
}
