{
 "title": "Positively Glowing",
 "author": "Thayan",
 "citation": " Thayan. \"Positively Glowing: experience with Kratom & Alcohol (ID 42681)\". Erowid.org. Apr 10, 2006. erowid.org/exp/42681",
 "substance": "Kratom & Alcohol",
 "bodyweight": "165 lb",
 "report": [
  "<p>I had just finished the MCAT and was in need of some experimenting. I was greeted by two bottles of champaign outside of the test and in short order was rather wasted. The second bottle was finished (with a little help from friends) around 5:15pm. Drinking continued over dinner and until around 8pm.",
  "I then ran into a friend who had wanted to try kratom, as I had just ordered some online, and we had been waiting to try it.",
  "I put 1g 'super resin extract' and 2g '2X leaf extract' into 300mL of water and a splash of lemon juice (for good measure, I hear its always better to make things like this acidic) in a double boiler and cooked it until the resin extract disolved, it took some crushing under a spoon.",
  "I filtered the concoction with a coffee filter, added some honey for flavor, and went off to find my friend.",
  "He had started drinking and didn't want to take it after drinking (he didn't tell me why, but I knew that drinking all of this would be a high dose, I believe that this is a lot more dangerous than how it turned out, everyone's body is different).",
  "I ended up drinking almost all of it (not wanting to waste my tea). It didn't taste very bad at all, just like some shitty cheap tea, not too bitter.",
  "The onset began before I finished drinking it (it took me about 15 minutes to finish). I had continued to drink through all of this, and continued to after the trip began.",
  "3 dimentions seemed clearer, my hand would glow as I waved it in front of me. I also felt very clear-headed and could very much hold a conversation, probably better than I could sober. I felt very awake as well. I was very interested in conversations with people, and ended up talking until 3am with a friend about everything.",
  "Sleep was uncomfortable, but I woke up without any sort of hangover (even from the drinking).",
  "After talking with people about this experience, I realize that it was probably dangerous to try this with alcohol, and I probably wouldn't again as I don't know how strong the resin extract was. I had a very good time and have bought more from the same place, but will not mix it with alcohol again.</p>"
 ],
 "year": "2005",
 "id": "42681",
 "gender": "Male",
 "views": "9001",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(extract)"
  }
 ],
 "submissionDate": "2006-04-10T07:00:00.000Z"
}
