{
 "id": 427,
 "title": "We Were Not Prepared",
 "date": {
  "submission": "2002-02-11T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "BevZ",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "26",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "For my maiden voyage on 5-MeO-DMT, I was accompanied by my husband (who was likewise trying it for the first time) and had as ground control three trusted friends who all had multiple prior experiences with the drug.  J and M went first, giving us a chance to see the effects before we experienced them.  J, who did not get a threshold dose, got sick; M, who got plenty, writhed and moaned and made silly noises and climbed up into my husbands lap before coming down and babbling lines from Buckaroo Banzai.  I wondered which experience mine would resemble more.",
  "I went with approximately 26mg combined with about half as much powdered milk (which wed been told would ease the burn).   To keep it in my nose and out of my throat, I split it into a few small lines and snorted them fairly slowly and not too deeply, which seemed to work well  I ended up with a minimal of post-nasal drip.  Definite burning sensation, but not excessively unpleasantand completely irrelevant once the drug kicked in.",
  "Since I typically come on to anything quickly, I lay back right away and closed my eyes, and sure enough, within 2-3 minutes was starting to notice visual effects.  These effects started as monochrome fractals, then quickly blossomed into full-blown psychedelic colors and patterns.  The whispers and other sounds around me were woven into this pattern, which was negative in this case  my brain interpreted them as sounds of concern, so I immediately thought that perhaps something was wrong with me, that I had taken too much and was overdosing.  In particular, I thought I heard my husband moaning in distress, which combined with the sound of someone rushing off somewhere made me think that something horribly wrong was happening  including a brief but vivid moment of thinking that I was dying.  In retrospect, I think this feeling came from the sense that I was leaving my body, and death was the only frame of reference I had for that sensation.",
  "The start of the trip was therefore not very pleasant for me, but luckily Ive done enough yoga that my body naturally fell into a deep breathing pattern that helped me cruise past that initial rough spot.  That, and the image of my friend Js face (Im told I did look over at her and was holding her hand  tightly  the whole time), smiling at me.  Knowing she was there and unconcerned told me that perhaps I was not, in fact, overdosing, so I relaxed into it.  But I had definite thoughts of oh god, Im having a bad trip before I was able to enjoy myself.",
  "This was my first truly immersive psychedelic experience, and I think it fair to say that I wasnt prepared for itthough Im not sure how one could  prepare someone for something like this.  The colors were incredible  really vivid primary colors, radiating out from a brilliant blue center.  The room, my body, everything went away.  My anxiety gradually dissipated, and toward the end of this phase of the trip I had a beautiful flash that started with an image of my long-time girlfriend, connected to the distant feel of my husbands hand in mind, and I felt a rush of love and contentment with that feeling of connectedness to both of them.  I remember smiling broadly at that point, as I came back into my body.",
  "At about 15-20 minutes in, I was able to open my eyes and start to focus on the room again, at which my first words were Holy... ...Shit.  I then looked at J and said quite emphatically: We were not prepared!",
  "I continued to have acid-like visuals  some fractal effects and a lot of shifting/melting - for another 15 minutes or so, and I had a sense of uncoordination and general weakness in the arms and legs for another 15-30 minutes.  I felt pretty completely down after that point except for a little residual difficulty focusing. ",
  "The bottom line for me:  an incredibly intense experience that Im glad I did with people I trust completely.  Id like to try it again now that I know better what to expect, probably with some ritual or meditation first to get into the right frame of mind.  I think it would be useful to do the same sort of preparation that people do for astral projection, to reduce the anxiety over leaving the corporeal self."
 ],
 "erowid": {
  "id": "10776",
  "citation": " BevZ. \"We Were Not Prepared: experience with 5-MeO-DMT (ID 10776)\". Erowid.org. Feb 11, 2002. erowid.org/exp/10776",
  "substance": "5-MeO-DMT",
  "views": "10666"
 }
}
