{
 "title": "Meditation on the Combinations",
 "author": "Ligeti",
 "citation": " Ligeti. \"Meditation on the Combinations: experience with Venlafaxine (Effexor), Cannabis, Mescaline, Cacti, Mushrooms - P. cubensis &  P. cyanescens (ID 42705)\". Erowid.org. Jul 4, 2006. erowid.org/exp/42705",
 "substance": "Venlafaxine (Effexor), Cannabis, Mescaline, Cacti, Mushrooms - P. cubensis &  P. cyanescens",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(daily)",
   "",
   " repeated",
   "oral",
   "Mescaline",
   "(powder / crystals)",
   "",
   " repeated",
   "oral",
   "Cacti",
   "(liquid)",
   "",
   " repeated",
   "oral",
   "Mushrooms - P. cubensis",
   "",
   "",
   "1.0 g",
   "oral",
   "Mushrooms - P. cyanescens",
   "(dried)"
  ]
 ],
 "report": "<p>I am in my late 30's and have been taking Effexor XR 150mg daily to help with Generalized Anxiety Disorder and depression for a year and a half. This is considered a moderate dose. The drug has worked very well for me in reducing symptoms of anxiety and depression--although it makes me sweat like a pig, but that's a small price to pay.</p><p>Having been mired in distressing family law litigation for several years (hence the SSRI) I became more committed to Buddhist meditation practice about a year ago as a means of coping. This along with my psychedelic use (see below) has done more to change my depressive worldview than the Effexor has. The meditation has also dramatically lowered my daily experience of depression/anxiety and lowered my apprehension about feeling those symptoms. I have a much better understanding of what a 'thought' and an 'emotion' is, or to be Buddhist about it, isn't. I'm much more comfortable with my own mind and tend to take it less seriously than I used to.</p><p>In my college years I 'experimented' with a wide range of psychoactives. The most memorable of which were mushrooms and LSD. I can't begin to say how much they changed my outlook on life, although I think at the time I lacked the tools to integrate a lot of what they had to teach me. My psychedelic use dropped off after college, although I still had admiration and respect for the substances and their effects.</p><p>The more I read about Buddhism and the nature of mind, the more I thought about my psychedelic experiences. I got my hands on a copy of Zig Zag Zen, a book of essays dealing with Buddhism and psychedelics and that sort of sealed the deal. It was time to forge back into hyperspace. I'm writing this report to share my experience of the interactions of Effexor and the plant teachers I've been working with.</p><p>Cannabis</p><p>A quick note to say that I have been using a vaporizer to enjoy cannabis nearly every day for the last year or so with no ill effects. I'm a musician and the cannabis is very helpful with relaxing me into states where I can play more intuitively and more creatively. If anything, it seems like I can smoke more than I used to and feel less fatigue (although this may be the high quality of the buds). It certainly makes me more productive.</p><p>Mescaline/San Pedro</p><p>Some years ago I was given 'two hits' of synthetic mescaline (which I had never come across in my youth) from a very trustworthy source. I had saved it waiting for the right time to come along. My first trip in ten years was with a quarter of these 'two hits', or half a hit. The trip came on softly, and it was totally amazing to be near that place again. The mescaline had a 'divine' quality that I remembered experiencing slightly on LSD, but it was much friendlier, and more pronounced. Nonetheless, it felt like a light trip. I wasn't sure whether it was the dose or the meds I'm on.</p><p>After that experience I looked into San Pedro/Peruvian Torch. My first try produced only the mildest effect (8' prepared raw, meticulously removing only the Xylem and skinning it). On my second try however, I hit the jackpot. This time I prepared about 16' of cactus by cutting down the ribbed sections, removing only the inner woody core and sinking the thing (little spines, skin and all) through an extraction juicer. I dumped the mucousy goo into a Teflon skillet and reduced it to about a cup.</p><p>The mucous quality dissipated and it became dark green and tasted very harsh (whereas raw it only tasted 'green'). After about 45 min I started to feel some effects and shortly thereafter, vomited (not a big deal really). The trip was ecstatic. It gave me insights into my meditation practice and my life and I felt a profound connection to the earth and the cosmos. I have since had a similar, and even more ecstatic experience with perhaps a bit more cactus, where I felt a powerful connection to the divine and had a sort of goddess experience on the beach, seeing the entirety of the geology, the ocean, the wind, and life (tide pool creatures, seaweed) as manifestations of a divine fertile dance. With one exception, I have been alone on these trips, so it's hard to say for sure because I haven't been able to repeatedly compare doses/trips and don't have previous experience with it, but it seems to me that the Effexor doesn't interfere that much with the effects of the mescaline, if anything, I wonder whether it potentates it.</p><p>Mushrooms</p><p>I have had less success with mushrooms the trip starts to come on, but then doesn't really arrive.  Most of my attempts have been with cubensis. Most recently I ate a gram of Pan Cyans and had a stronger trip, although nothing like I've experienced with the cactus and certainly nothing like I experienced back in the day with mushrooms. This may be a set/setting thing and it may simply require yet a larger dose. I'll keep trying.</p>",
 "year": "2005",
 "id": "42705",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-04T07:00:00.000Z",
 "views": "18881",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  }
 ]
}
