{
 "title": "Odd Behavior",
 "author": "Skizzle",
 "citation": " Skizzle. \"Odd Behavior: experience with LSD & Cannabis (ID 42735)\". Erowid.org. Jul 11, 2007. erowid.org/exp/42735",
 "substance": "LSD & Cannabis",
 "bodyweight": "140 lb",
 "report": "<p>I am submiting this report at around 2:40 PM, at around 10:30 the previous night me and a few close friends decided to ingest some LSD for the night and have some fun. We ate 2 hits apeice and then watched Fargo. Towords the woodchipper scene the normal giggling and body chills set in. After it ended we smoked smoke pot and watched another movie. During this we were all sitting in the living room, which is also where my computer is located.</p><p>Being quite comfortable with psychoactives I was feeling fine and decided to see how a computer game would be. After activating the program I leaned back to zone out a little while it was loading. This is when somehow I became unconcious, apparantly falling to the floor. I say apparantly because I just remember my friends shouting my name and then waking up to me struggling to get back up. I had hit my head on the way down (in fact I am typing this with a large bruise above my right eye) and could feel my arms moving in that instant where I awoke.</p><p>I think the movement signifies an unconcious urge to protect myself seeing as how I had fallen to the floor. After collecting myself my first response was to ask everyone waht happened. The response I got was that I had just fallen out of the chair. This worries me alot.</p><p>In fact the main reason for my submission today is to possibly shed some light on this phenomena for me. I take no perscription medication and this has happened to me twice before on mushrooms as well. To me it is just as if I am sitting back enjoying my trip untill the rushes of feeling get really intense and I just fade out, regaining consciousness within a matter of seconds. Anyways today I feel fine and I am a man of good health so I suspect no serious damage but I fear that without any knowledge of how I black out I can not enjoy psychoactives anymore. Thank you and good day.</p>",
 "year": "2005",
 "id": "42735",
 "gender": "Male",
 "timestamp": "2007-07-11T07:00:00.000Z",
 "views": "4028",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
