{
 "id": 4275,
 "title": "Memory Absence",
 "date": {
  "submission": "2006-05-20T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nbltrth",
  "gender": "Male",
  "weight": 98
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "13"
   },
   "administration": "oral",
   "substance": "Alprazolam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Less than two weeks ago I found myself barely making it out of a mandatory stay at the local mental institution because of an 'overdose' of Alprazolam (Xanax).",
  "The situation is described below.",
  "At approximately 9:45 PM I consumed 26 0.5mg Alprazolam tablets in less than 5 minutes, with a cummlative dosage equivilant to 13 mg (oral). After which, I remember very little for around 15-18 hours beyond consuming the medication. My parents found me passed out across a desk in which I had been sitting at approximately 3:00 AM that morning. I showed signs of being excessively drunk, although I had no problem telling them the truth (which I otherwise would have conceiled), which was that I had taken an excessive dosage of Alprazolam.",
  "At approximately 9:00 AM that morning, I woke up, and was taken to the local general physician. I told many 'secrets' during this time (information I would have otherwise conceiled). Even thoughts that I had kept personal for a decade or more were revealed to members of my family. After taking a trip from the general physician to a psychiatrist nearly 80 miles away, I was admitted to the ER around 4:00 PM. It was not until approximately 5:00 PM that I became fully aware of the situation I was in. Luckily, I was able to regain a train of thought, and was able to avoid being admitted to the psychiatric ward by telling the doctors that I had only taken 6 additional tablets to my normal dosage (obviously, not the truth). They were not aware of the whole situation, and allowed me to leave shortly afterwards.",
  "No other substances, other than one beer at approximately 5:45 PM the day I had consumed the pills, was involved in this incident.",
  "The best way to describe the feeling of the incident was a 'zombie' like state, with memory lapses far greater than any other substance I have previously used. It was very difficult to realize the entire situation until 30+ hours after the Alprazolam had been consumed. I must also mention that I have been an Alprazolam user (by prescription) for over a year now, with a regular daily dosage of 1.5 - 2.0 mg (oral).",
  "The effects of this medication were much much different at a high dosage of 13mg than they were at 2mg. It wasn't simply a greater 'enhancement' of the effects, but an entirely different experience. Not a good one to add to the book in my eyes!"
 ],
 "erowid": {
  "id": "28552",
  "citation": " Nbltrth. \"Memory Absence: experience with Alprazolam (Xanax) (ID 28552)\". Erowid.org. May 20, 2006. erowid.org/exp/28552",
  "substance": "Alprazolam (Xanax)",
  "views": "43594"
 }
}
