{
 "title": "Problems with Repeated Use",
 "author": "Olga",
 "citation": " Olga. \"Problems with Repeated Use: experience with 2C-E (ID 42793)\". Erowid.org. Jun 21, 2007. erowid.org/exp/42793",
 "substance": "2C-E",
 "bodyweight": "105 lb",
 "report": "<p>Background: I'm 18 and in good mental and physical health. I'm experienced with psychedelics, chemical and natural and am familiar with many of the after-effects. At the time when I had the 2c-e my system was clean, because I hadn't had any marijuana for 2 weeks, and no alcohol for about a month. I don't take any medication, not even over-the-counter, so the side effects I got must have been that of 2C-E.</p><p>I've used 2C-E four times. The first three times there were no noticeable side effects, but the fourth time I did it (after a break of about a month) I definitely noticed some changes. I am not a doctor or a chemist so I don't know what they mean in the long run, but I know when something isn't right.</p><p>1. About 7 hours after snorting 12 mg. of 2C-E I came down but got a strange dull pressure in the back of my head. Not a headache per se, just a constant dull, heavy feeling, as if I'd just bumped my head really hard. I went to sleep and when I woke up 7 hours later, the headache hadn't completely gone away. I could feel the dull pressure all through the day, and only now, 14 hours later is it really starting to fade, although I can still feel it. The reason I point this out is because I never get headaches, especially not like this, so I have no doubt that it is related to the drug.</p><p>2. The day after the trip, I tried reading a passage and although reading itself wasn't difficult, I had trouble understanding the text. I read each paragraph twice and still have only a vague idea of what it was about. I only got through about half a page.</p><p>I don't know what and why I got the side effects that I did, but I do know that it is because of the drug. I only used it four times, with breaks of about a month between dosing, and already feel that something isn't right.</p>",
 "year": "2005",
 "id": "42793",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-06-21T07:00:00.000Z",
 "views": "13343",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "12 mg",
   "administration": "insufflated",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 }
}
