{
 "id": 4282,
 "title": "In Excess",
 "date": {
  "submission": "2006-05-19T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Stray Tom",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 cups",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "1 tsp",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>Recently I've decided to quit smoking cigarettes as well as drink less frequently.  I've been experiencing severe insomnia since I rapidly detoxed my system, and decided to turn to valerian for a solution.  In the past, I've had luck in quitting smoking by using herbal teas to ease the withdrawls.  Kava Kava in particular, though the bulk herb is getting increasingly more difficult to find in local health stores.",
  "My experience begins with a pot of tea.  I always brew it strong, this time tossing in an ounce of bulk valerian root for approxamately 4 to 5 cups of water.  I drank the first cup with no noticeable effect.  This is probably because I'm rather used to this herb on a regular basis.  I decided to take a hot bath with lavander bath salts to help the relaxation kick in.",
  "I took with me another cup of the exponentially strong and equally as putrid tea to the bath.  After soaking myself in barely tolerable hot water for about a half hour, I got out with my empty tea cup.  As I stood, my heartbeat pounded inside my head.  I struggled to put my clothes on and then immediately laid down for a few minutes.  It took about 15 before my head stopped pounding and I stopped dripping with sweat.",
  "I figured the sensation was due to the over exposure to extremely hot water and shrugged it off after I felt better.  Still not relaxed enough, I took a tablespoon of powdered valerian and stirred it up in a glass of water.  I chugged it down in one drink, nearly gagging from the taste (even more so the smell).  About ten minutes passed before it started to kick in.",
  "Maybe I'm slightly allergic, maybe it was because the powder form absorbs so quick, but I nearly died.  The pounding sensation came back, along with an intense sneezing fit.  I could hardly breathe, my lungs felt solid and my heartbeat weak.  I made my way to the kitchen and chugged about 5 cups of water.  It kept getting worse.  I found the door and went outside; I attempted to vomit, even stuck my finger down my throat.  It was no use, if I was lucky I managed to bring back about one cup of liquid.  I went back inside in search of more water.",
  "Good news is, I'm still alive to write this report.  It was certainly not a pleasant experience, though once I came down to a comfortable level I was totally relaxed to say the least.  That relaxation was mainly because I was glad to be alive.</p>"
 ],
 "erowid": {
  "id": "28576",
  "citation": " Stray Tom. \"In Excess: experience with Valerian (ID 28576)\". Erowid.org. May 19, 2006. erowid.org/exp/28576",
  "substance": "Valerian",
  "views": "47111"
 }
}
