{
 "title": "Pleasurable and Smooth",
 "author": "Prism",
 "citation": " Prism. \"Pleasurable and Smooth: experience with 5-MeO-DPT (ID 42846)\". Erowid.org. Jun 19, 2007. erowid.org/exp/42846",
 "substance": "5-MeO-DPT",
 "bodyweight": "67 kg",
 "report": "<p>Dosage of 10mg each, following a few hours after coming down from 2C-C trip. Will report as needed.</p><p>T +0:00</p><p>10 mg ingested with coke (the soft drink, if there was doubt). Stronger bitter/chem taste than 60mg's of 2C-C taken earlier.</p><p>T+0:15</p><p>No discernable effects. Considering another 10mgs.</p><p>T'+0:25</p><p>Feeling a little light-headed. Taking another 10mgs. Fluke is going strong.</p><p>T senses things starting to happen. mild tingling, chills.</p><p>T+0:35</p><p>E: Sudden euphoric rush toes-to-head. things definitely happening, though no sensory distortion. O feeling light discomfort.</p><p>T+0:55.</p><p>O claims neural damage. None of us have any visuals. Good mood, though, except O. Mild-medium euphoric tingling, nothing overwhelming. Testing hash as a possible booster. Issues being debated eagerly: Base jumping and pez.</p><p>T+4:00</p><p>T and E still feeling the good mood and some other trippy sensations, while O just feels tired. E and O heads home.</p><p>Conclusion: T and E found this chemical to be very pleasant and enjoyable, nothing heavy. Whilst O found it unpleasant, had other effects and came down hours before the others.</p><p>Two found it very pleasant, whilst the third had only bad feelings, and had no plans of doing it over.</p><p>Now its T+4:15 and I am alone(T) and still feeling very pleasant. Thinking about snorting 100mg Dpt, but I think I`ll smoke another bong while I think about it some more.</p><p>3 bong hits later: I`m not in doubt that THC really enhances the good vibes and floaty sensation, having problems writhing this, so I`ll take a break. The room is spinning.</p><p>T+7:00</p><p>The ganja is wearing off, and I decide to snort 50 mg of dpt. I am really exhausted because Ive been awake for over two days on amphetamines.</p><p>While the DPT is kicking inn I make two big bong hits, and smoke one. I just float in to a trancelike state, listening to chill out music, and I think I was asleep by 8,00.</p><p>Slept the whole day, until 3 in the afternoon feeling hungry and exhausted. I went out and got some food, and now I feel fine (dropped 20mg valium 20 min. ago).</p><p>This could change the effects a bit, but T (two days on speed) and E quiet rested, had very similar experiences.</p>",
 "year": "2005",
 "id": "42846",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-19T07:00:00.000Z",
 "views": "6407",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "2C-C"
  },
  "1": {
   "time": "",
   "amount": " T+ 0:00",
   "administration": "10 mg",
   "substance": "oral"
  },
  "2": {
   "time": "5-MeO-DPT",
   "amount": "(powder / crystals)",
   "administration": " T+ 0:25",
   "substance": "10 mg"
  },
  "3": {
   "time": "oral",
   "amount": "5-MeO-DPT",
   "administration": "(powder / crystals)",
   "substance": " T+ 4:15"
  },
  "4": {
   "time": "3 hits",
   "amount": "smoked",
   "administration": "Cannabis",
   "substance": "(plant material)"
  },
  "5": {
   "time": " T+ 7:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DPT"
  },
  "6": {
   "time": "(powder / crystals)",
   "amount": " T+ 7:00",
   "administration": "2 hits",
   "substance": "smoked"
  }
 }
}
