{
 "title": "I Belong Nowhere at This Place",
 "author": "Hipper",
 "citation": " Hipper. \"I Belong Nowhere at This Place: experience with Salvia divinorum (5x extract) (ID 42848)\". Erowid.org. Aug 28, 2008. erowid.org/exp/42848",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "report": "<p>This was going to be the third or fourth time I had tried salvia. The other times I had tried it I got some wavy effects but nothing that intense. I also just got really hot and felt very light and floaty when I would stand up or walk around.</p><p>It was a Friday at about 6:30. I went to my friends house to pick up a gram of his 5x salvia. He grows and extracts all of the stuff himself. I then went to my others friends to sit and smoke. I went downstairs to 'the cave' and grab my bong. I packed up .6 of a gram. I took the entire .6 in one bong rip, held it in for approximately 30 seconds then breathed out.</p><p>As soon as I finished exhaling I instantly turned and zoned in on the tv. Seinfeld was on, after watching for several seconds I heard Elaine say 'yada yada yada'. I kept hearing that word repeated over and over and over again. I was sweating profusely so I took my hoody off. Then all around everything besides the tv was just a bunch of parallel lines running sideways with red dots connecting each one. I felt as if that was a wall or a force field that was keeping me from standing up or going past anything that was equal with my distance from the tv which was about 2 feet. I then tried to turn my head and look past and over my shoulder, but I couldnt, that same force field around the tv was parallel with the sides of my body also. I tried to look over the other shoulder but it was impossible.</p><p>I started to feel extremely tense and anxious. I felt 'I need to break this force field. It is the only way I can get out of here.' So I jumped up and ran to the other couch about 5 feet away. My friend started questioning me about his cigarettes. It confused me and I thought he was accusing and blaming me of causing everyone in America to get cancer from cigarettes. So I grabbed my hoody which for some reason I felt very possessive over, ignored his assumption and went outside. I felt I would belong more on the trampoline than his basement. I rolled on the trampoline and looked up at the sky. I then got the same feeling as in the basement. I didnt feel as if I belong on the trampoline. So I walked towards the woods which I thought would be a good place since that is where I roam by myself regularly when I trip on mushrooms.</p><p>I became extremely hot walking towards the woods so I took my t-shirt off and was now wearing nothing in 55 degree weather. About 15 feet into the woods I did not feel like I belonged there either. I also became extremely thirsty. So I went out front to my car and searched for the best looking water bottle I could find. Even though they are all the same exact one. I found it and then walked back down into the basement. I was only in the basement for about 20 seconds when I realized I really dont belong here. So walked up the stairs outside and said I wasnt coming back.</p><p>I went back on the trampoline. I kept thinking to myself 'Where do I belong? I dont know where I belong? Do I belong anywhere?'. The only place I really wanted to go where I felt I would belong was my room at my house. But I knew I could not go there, I was in no condition to drive. So I went out to my car and decided to sit in my passengers seat. All of a sudden my friend pulled up in his car, staring at me as he pulled in the driveway puzzled as to why I was sitting in my passengers seat with a blank stare towards the dash. I looked over at his car and I saw him and my other buddy taking all of our beer for the night out of the trunk. For some reason as soon as I saw that beer I felt as though I belonged somewhere again, in the basement drinking. So I jumped out of my car and helped bring the 30 racks downstairs. As soon as I got downstairs and opened up a beer all of the leftover anxiety and stress left my body. I came back down to a normal deep stoned feeling. So I smoked a blunt and drank a beer to completely mellow me back out.</p><p>This was by far one of the most intense, bad, and nerve racking trips I had ever had on anything. But after the trip I realize, 'Wow, that was scary but I love it'. I love to trip and in my eyes sometimes your worst trips can actually be your best trips, for me at least. But I am also a person that can be tripping on an 1/8 of mushrooms, walk around in the woods by myself for an hour and be the happiest person in the world without a single bad thought.</p>",
 "year": "2005",
 "id": "42848",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-08-28T07:00:00.000Z",
 "views": "2593"
}
