{
 "title": "Two for the Price of One",
 "author": "Unknown",
 "citation": " Unknown. \"Two for the Price of One: experience with DXM with CPM & Drug Testing (ID 42851)\". Erowid.org. Jun 29, 2007. erowid.org/exp/42851",
 "substance": "DXM with CPM & Drug Testing",
 "bodyweight": "",
 "report": "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]</p><p>All in all I probley took about 2000 mg over a period of 30 hours.</p><p>It started all on a weds night, I went to three different stores with my friend Cory and came home with 16 boxes of cccs. At my house we split it up 8/8 and then he went home and I was too impatient to wait to start trippin at school so I ripped open a box n swallowed em. Every time that Im sober when poppin skittles my mind goes back to the first time I tried them I thought they tasted good like cherries. Hahaha. Now I can barely swallow them. Gettin back to the story, was about 11pm weds when I started feelin them and Cory called me to say that he ended up doin the same and neither of us felt like bein alone so he came over and we attempted on playin pool. It was around 1am and we both popped another box each and started watchin tv. I dont think either of us knew what we were watchin cus my bro asked me a couple days later why were watchin 5 hours of infomericals. I kinda have a black out til I woke up at 7am and Cory had already left. I was still trippin pretty hard but I still got up took another box and got ready for school, hiding another 3 sheets on me and I took another sheet before I left for school.</p><p>I dont even remember school or if I took those 3 sheets, I probley gave some away knowing me when Im fucked up but when I got home I took some more, probley 10 or so. I did that again another hour and again another hour later. Supposedly I had some friends stop by to play pool I just dont remember lol. But my mom came home from work and saw me like that and took me straight to the hospital thinking I was going to OD. She always thinks that. But they just took my blood pressure and heart rate and told me not to do anything to raise it more. Then I was givin a blood drug test and urine test. ...FUN... dxm doesn't show up on it (They didnt test for it) BUT pcp and opiates both showed up. I know it wasnt laced weed cuz of the fact I hadn't smoked for over a month, and I don't think I have ever done opiates but it isn't impossible.</p>",
 "year": "2005",
 "id": "42851",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-06-29T07:00:00.000Z",
 "views": "6365",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 }
}
