{
 "id": 4286,
 "title": "No Paranoia",
 "date": {
  "submission": "2006-09-08T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "18 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-MiPT",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Conditions: This was a good time to trip. A significant other and I decided, more or less randomly, to trip last night. We had two different substances, but both seemed promising. I had never tripped with someone I had relations with and was kind of nervous for a few reasons; mainly because I am prone to bursts of uncomfortable insanity and in some cases panic. However, I had high hopes for the situation. We turned off all lights in my apartment and set two rooms up. One with a nice bed and candles and one with an ambient orange glow of an electric fireplace complimented by a red light bulb which displayed some purple patterns on the wall where some of the red film had been scratched. Oh, and Led Zeppelin on the juke box all night long!",
  "Experience: This was my first time with this drug.",
  "Preparation: The 4-AcO-MiPT was prepared by Kreg by dissolving 18mgs into about 12oz of distilled water.",
  "-----------------------------------",
  "We both took our respective substances around 9:30 and waited around in anxiety for about 20mins. My stomach immediately tightened and felt cramped. As with most chemicals I take orally, my throat felt scarred and tight. My sinuses seemed burned. After about 15mins my body began to numb up.",
  "About 30mins later, experiencing nothing but an uncomfortable body high, I left the candle room and entered the red light room. Nothing seemed too odd. Minor visuals, like the onset of shrooms. Hope called me over to a drawing on my wall and asked me what I saw. Nothing at first but then it hit like a freight train. The drawing began moving all over the place. It was a little cartoon drawing of a bug-like man holding a guitar and my response to Hope was This guy is crazy, referring to the drawing. I next laid on my couch starring up at a giant poster of Hokusais In the Hollow of a Wave off the Coast at Kanagawa. This is where the most intense visuals would lie for the rest of the night. I would keep coming back here. The layers of the picture crawled all over and at one point the crest of the larger wave became hands and the crest of the smaller below it was the body of a woman. The hands would move, sending shudders through the womans body. By now Hope was having an intense body trip and begun to put on every piece of jewelry she owned. I watched intently, extremely fascinated by a strand of black pearls she had. They were so smooth.",
  "We moved to the candle room. I laid on the bed and Hope stood by the window in the orange glow of the street light outside. She began to dance, moving her hands and flowing with the music. I saw her entire body tracing through the air. Every time she moved I saw the remnants of motion. I adored her. Her dance sent waves through the atmosphere and her body vibrated with rhythm. She came over to me and laid next to me to talk. This is where the trip became most intense. We chatted back and forth but I was unsure of who was saying what. I did not know if I was her or if she was me or if we were the same person. At one point I asked her if I was talking to myself and if she was even there or actually in the other room and I was tripping that hard. She looked at me smiling and replied Youre right, let me go get Hope. This sent me into a 2minute long mind fuck and moment of panic but Hope soon remedied her joke.",
  "I proceeded to have some of the most intense visuals ever. My floor moved in rolling waves. I seemed to exist outside of my environment. I watched Hope adorn herself in jewelry and then wondered about me adoring her earlier. Zeppelin carried me off many times. I admitted that they indeed are the greatest band of all time. In my opinion. The trip continued like this for about 3 and a half hours. I moved back and forth between the two rooms, visuals everywhere, and completely tripping on the music. My body at on point became completely lose and vibrated with the guitar. I felt an attunement with pre World War II southern Mississippian Aphro-American blues. I experienced no paranoia or uncomfortable mind fuck. The trip was not very introspective at all, though if alone I imagine it could have been. All in all, I would give it a 9/10! Extremely fun time.",
  "Summary: Extremely visual, not terrible introspective (though Im sure it is possible), slight body sickness, slight body trip."
 ],
 "erowid": {
  "id": "28584",
  "citation": " Anonymous. \"No Paranoia: experience with 4-Acetoxy-MiPT (ID 28584)\". Erowid.org. Sep 8, 2006. erowid.org/exp/28584",
  "substance": "4-Acetoxy-MiPT",
  "views": "6003"
 }
}
