{
 "title": "Humanity's Saving Grace",
 "author": "Danse Manatee",
 "citation": " Danse Manatee. \"Humanity's Saving Grace: experience with Cacti - T. pachanoi (San Pedro) & Mushrooms -  P. cubensis (ID 42877)\". Erowid.org. Aug 31, 2007. erowid.org/exp/42877",
 "substance": "Cacti - T. pachanoi (San Pedro) & Mushrooms -  P. cubensis",
 "bodyweight": "",
 "report": "<p>I am quite a well calloused tripper, and do not usually have difficulty tripping in hectic enviornments and keeping my composure. The trip I had was not too intense, however, for a moment it was one of the most profound, life changing experiances I've ever had. At this period I was tripping fairly frequently, not really treating my drugs with the respect they deserve. I would also frequently do pycedelics at times/ places that weren't entirely appropriate for the nature of the experiance - this was one of those.</p><p>I ate my lovely goo at around 7, and shrooms about 8 at about 10 I was tripping fairly mildly on both substances. I find that with this crowd of people I tend to feel slightly isolated, even when sober, as most of the convesation is fairly unwholesome and unintelectual and I find it difficult to communicate deeply with these people. Also none of them, apart from afew of my close friends who were present, do psycedelics. Sports, womanizing and violence being thier main vice.</p><p>I stumbled into into a convesation that was particully ideologically unsound. At this point I did what I normally do in this situatioon - nod and smile, and observe.</p><p>However my mind was sinking into an abyss of deeply concerning thoughts about human nature, and the tradegy of almost every endevour man has got into, almost all being at the expence of others or debalancing the 'god' of conscience. I am athiest and belive religion is a product of the brain, I use god as an easy way of portraying a set of logic that is hard to describe. I notice that my eyes have been drawn to the flaw, a melochollie wave engulfs my body, and my focus blends with the flaw, contemplating my future and how I should interact with the world, which at the time, was feling quite pesinistic about its future.</p><p>And then it hit me. Whilst my vison had fused with the floor I became aware of a infinatly blue/purple light in the left corner of my vision. This might be significant as it hits that the image was coming from the right hemisphere, it grew in size and intensity, its energy flooding me with bittersweet excitement. Out of it's pulsating beauty appeared the image of a dansing female figure, in infnatly beutiful shades of green. It's energy was overwhelming. She was seemingly representing of all the tradgedy of human nature, in her controted, inebriated but melonchollie danse.</p><p>She was also symbolic of human potential, and the beauty of all creation which was portrayed in her energy, vitality and sheer beuty. Being a product of my mind she drew from it all that was benificent in myself and the way I see the world, and the people around me. Whilst at the same time being representative of all the shit that we as humans do to each other and the fundamental flaws of human nature, that I belive doom us from ever reaching a utopean society.</p><p>The experiance was short lived, lasting only a moment, but could as well have been the product of days of contemplation on the matter and instant balance of man's place in the great lifeforce. This experiance is one my most intelectually orgasmic experices and I still glow from it today.</p>",
 "year": "2003",
 "id": "42877",
 "gender": "Male",
 "timestamp": "2007-08-31T07:00:00.000Z",
 "views": "6573",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "500 ml",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "(tea)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "0.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
