{
 "title": "Important Warning About Vicks on Ecstasy",
 "author": "Deidre",
 "citation": " Deidre. \"Important Warning About Vicks on Ecstasy: experience with Vicks used with Ecstasy (ID 4287)\". Erowid.org. Feb 6, 2001. erowid.org/exp/4287",
 "substance": "Vicks used with Ecstasy",
 "bodyweight": "",
 "report": [
  "<p>i have been going to raves for about 2 years now.  i first tried E last year. i took 2 pills to start off, then followed with another pill about 3 hours later.  i was at a rave at the time and someone offered me a sniff off a vicks inhaler.  in case you are not familiar with the vicks (very popular with the rave scene), it is a small tube filled with the vicks vapo rub that you stick up your nose and sniff.  it is usally used to get rid of a cold or for allergies.  well the feeling you get from sniffing the vicks with on E is so incredible, words cant explain it. i loved the feeling so much that i was sniffing the vicks every five minutes.  that went on all night.  at one point one of my friends told me to lay off or i would have a sore nose in the morning.  but i ignored her, thinking that a sore nose was a mere price to pay for the feeling of pleasure the vicks brought.  well the next afternoon when i finally woke up, my nose was a little red and runny but nothing too serious.",
  "now lets skip to the following week.  not only were my nostrils flaming red and running like crazy, i had a horrible head cold and sinus pain.  i waited for it to go away, but a month later i finally went to the doctors.  now about a year later i still have the same symptoms.  its like having terrible allergies 24/7.  i found out that i have severe nasal and sinus damage and permanant loss of smell.  the runny nose has subsided some due to my medication, but i will never be the same again.  just because of the one night i over-over did it with the vicks.  and its so easy to do.  you get caught up in the moment and forget how much you are actually doing.  i still do E every now and then.  i think its fun and enjoyable, but i will never ever do the vicks again.  i urge all the ravers and people getting started with E to listen to my words carefully.</p>"
 ],
 "year": "2000",
 "id": "4287",
 "gender": "Female",
 "views": "38868",
 "dose": [],
 "submissionDate": "2001-02-06T08:00:00.000Z"
}
