{
 "title": "The Goods Giving Gnome",
 "author": "Spothlogy",
 "citation": " Spothlogy. \"The Goods Giving Gnome: experience with Cocaine & Oxycodone (ID 42928)\". Erowid.org. Aug 29, 2008. erowid.org/exp/42928",
 "substance": "Cocaine & Oxycodone",
 "bodyweight": "210 lb",
 "report": "<p>It was another glorious May day, work was horrendously whipping me as usual.  Another day of pulling wire, working on my hands and knees and getting screamed at seemed to be in order; fear not, said I; today was going to be different.  My body aches, my mind screamed; I craved a day off.  While wading in my own sorrows of life and debating on attending the excrement I know as 'work'.  I came across a mystic, magical gnome who wooshed down my chimney and into my living room. He said unto me -- 'Dear sir, I have news for you, you are to take this glorious day off, and consume goods of relaxation and enjoyment.'.</p><p>'Gnome', I said, 'Where are these goods?', and he handed them to me, in good faith and joyous giving. Cradled in my palm were two baby blue god sends at 30mg a piece, and one nice little ball of the devil's dandruff.</p><p>I sat down at my computer, called in sick and began my journey.  I fluffed up some of this dander of the devil, sour, vile smelling hideous crystalline dandruff and insuffulated it.  2 Minutes and a few sips of water later, I was doing most excellent. I busted down four more lines for a total of 6 and the dandruff was depleted.  I sat around and waited, the dandruff swarming my mind, breaking down and out.  I was perspiring like a mammal in heat.  I was soaring up the euphoria scale, sitting in my cargo pants and guinness shirt, relaxed in my tipped back chair, in my own home setting; alone with my cat and all the food and drink I could ever need.</p><p>I thought of going outside, working on my project vehicles, but alas, I was stuck to the chair, glued by an impenetrable force, the two god-like baby blue pills were staring right at me, whispering through the wind, eat me they said, snort me they demanded. So I did. Both, all 60mg, up the nose is where it goes.  10 Minutes later cloud 9 came a calling.  They wanted to invite me to space and beyond. So I traversed. All of the intake of the goods took about 30 minutes.  Within an hour I was practically drooling, but the dandruff had worn off -- unlike the usual come down from it, the 60mg of oc helped me come down in a light and fluffy way, no unwarranted nuisance headaches or drip.</p><p>----------------------------------------------------------</p><p>The experience lasted for almost 4 hours, but as I said above, the coke bit the dust after about an hour.  It was really quite good I must say, was fire-like going up the nose though.  The oc's were a good deal of powder to put up there along with the coke but I was able to handle it.</p><p>The whole experience was very climax-oriented. The coke was the big star of the whole show, but since it only lasts for so long, the oxycodone helped out to close the curtains and clean up the house.</p>",
 "year": "2005",
 "id": "42928",
 "gender": "Male",
 "timestamp": "2008-08-29T07:00:00.000Z",
 "views": "8033",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.0 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "",
   "amount": "60 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  }
 ]
}
