{
 "title": "Rather Vivid Hallucinations",
 "author": "Corner",
 "citation": " Corner. \"Rather Vivid Hallucinations: experience with Trazodone (ID 42924)\". Erowid.org. Oct 26, 2009. erowid.org/exp/42924",
 "substance": "Trazodone",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "Pharms - Trazodone",
  "(daily)"
 ],
 "report": "<p>Back when I was in art school I was on various anti-depressants, one of which was Trazodone. I found a half finished bottle of it in one of my boxes of 'stuff I haven't unpacked yet' and remembered it could help me sleep. So I met with my psychiatrist back home and asked if he would consider writing me a new script for it, and he agreed. He was not my prescribing doctor when I was out of state, in art school.</p><p>I lost my job two weeks ago and have been having debilitating anxiety worrying about finding a new one, and my doctor did write me a one week Xanax script, which helped, but he didn't want to renew it because it's habit forming. Instead, he explained that trazodone was a wonderful drug anyway, and gave me directions to take 200 or more mg to help me sleep at night, and 50mg in the morning.</p><p>The trazadone makes me drowsy, but it's a very dissociating drugged up effect. To top it off, I've had vivid hallucinations when trying to go to bed. It actually has made me scared to continue to take it lately. Basically, I will lie down in my bed, feeling really drugged up and wanting to sleep. If I look up at the ceiling I see swirling rune like circles that quickly morph into very real people. I've had to reach out to make sure they weren't real sometimes. It makes me very anxious, so I'll close my eyes, but then with them closed I see my room as it was before I closed my eyes, and the same hallucinations rise again. This has only happened the past two nights I have taken the drug.</p><p>Time also seems to slow down while I'm asleep. I used to never remember my dreams, but on trazadone I always have long, involved dreams. Some frightening, and others leave me waking up convinced everything that had happened was real. For example, last night I awoke and thought I was in my old dorm room, and I'd felt like I'd been asleep for hours and hours, but it as only 60 minutes later. I was very anxious, thinking I was about to miss class. I awoke about 90 minutes after that convinced I was in my first apartment in Boston. I wasn't. This continued until I eventually just couldn't deal with it anymore and got up and did some work.</p><p>I have been unable to confirm these side effects, but will probably contact my doctor about it tomorrow.</p>",
 "year": "2005",
 "id": "42924",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-10-26T07:00:00.000Z",
 "views": "42145",
 "dose": {}
}
