{
 "title": "Mildly Pleasant",
 "author": "Chris",
 "citation": " Chris. \"Mildly Pleasant: experience with Bupropion (Wellbutrin) (ID 42974)\". Erowid.org. Aug 29, 2008. erowid.org/exp/42974",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "165 lb",
 "report": [
  "<p>I have had a prescription for Wellbutrin for a little over 4 months now.  It was prescribed to treat mild depression.  It wasn't until I was skimming through the internet with no bud before I considered taking the Wellbutrin recreationally.  After reading many reports online, I decided to try it.",
  "The pills I have been subscribed contain 300mg of the bupropion.  After crushing these into powder and taking great care to remove the shell, I split the 300mg into 4 equal parts.  Taking only 150mg at a time, I snorted a 75mg line in each nostril.  A warning to those not accustomed to snorting - Wellbutrin burns.  I became used to it after a while.",
  "The effects are noticed almost instantaneously.  Beginning with a mild body buzz, a light feeling of euphoria set in quickly thereafter.  This report is referring more to a generalized sensation, not a specific experience.  I have noticed a slight psychological addiction to the Wellbutrin, though nothing stronger than say that of marijuana.  I have somewhat of an addicting personality and do not think it likely to become addicted.  Bupropion is known for its local anesthetic properties.  Soon after snorting it, the nostrils become numbed slightly and the teeth begin to tingle.",
  "I have not noticed any ill side effects other than the occasional dizzy spell and/or mild headache.  Of course, these have been rare occurances over the past month and a half and I cannot specifically attribute them to the Wellbutrin.  I have progressed to 300-600mg per day and have not noticed any ill effects.</p>"
 ],
 "year": "2005",
 "id": "42974",
 "gender": "Male",
 "views": "32975",
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "insufflated",
   "substance": "Pharms - Bupropion",
   "form": "(ground / crushed)"
  }
 ],
 "submissionDate": "2008-08-29T07:00:00.000Z"
}
