{
 "title": "A Low Dose Experiment",
 "author": "Sweatyb",
 "citation": " Sweatyb. \"A Low Dose Experiment: experience with 2C-T-2 (ID 4298)\". Erowid.org. Dec 18, 2000. erowid.org/exp/4298",
 "substance": "2C-T-2",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "8.0 mg",
   "oral",
   "2C-T-2",
   "(capsule)"
  ]
 ],
 "report": "<p>My fiance and I were planning on trying a new substance that I have had been saving for the right time it was 2c-t-2 in powder form. I am 195lb male and she, who I will refer to as K, is a 110lb female.</p><p>It was a wet and windy night, we had a nice fire going, and things seemed perfect for this trip. I have done a lot of research on this compound and 8mg seemed like a nice, non-threatining level to start with. I had tried 2ct7, which is supposed to be similiar to 2c-t-2, at 5mg intranasally and figured this would probably be less intense than that experience, which I found very enjoyable. We had eaten about 4 hrs. prior to ingesting.</p><p>5:50pm- Down the hatch 8mg 2c-t-2 in gel caps for both of us.</p><p>6:15- I am feeling a slight warm flushing throughout my head and body, K says she feels nothing and is keeping herself busy cleaning while the drug comes on.</p><p>7:00- We are both starting to feel definite effects. K says she is feeling some definite nausea. I am not. Colors are enhanced and the christmas tree lights have taken on a blurry look. I say it probably won't get much stronger than this, since we are probably at a +1 at this time. Other reports have said anything below 12mgs won't give you more than a +1 with this substance.</p><p>7:15- K is still nauseaus so she tries smoking a little pot. I am</p><p>not feeling any discomfort.</p><p>7:30- K says smoking eliminated nausea and she feels much better. She goes outside to her car to get cd's. She says that being outside in the rain was amazing! I walk outside to check it out and agree that it is very nice and exhilirating. The effects are definitely starting to intensify.</p><p>7:45- Full on effects. Very good feeling throughout the body. Feels alot like MDMA, but not as empathetic. This is alot stronger than I was expecting from 8mg! We are both at a solid +2.</p><p>8:00- Decide to listen to some music and explore our surroundings a bit. Music sounds great, both of us enjoy taking turns playing different stuff. This music appreciation is similiar to MDMA as well. When I walk into the brightly lit kitchen I notice everything is washed with a pinkish tinge. Very nice!</p><p>9:30- The peak is over and we are still in a good place, but, more grounded. Probably coming back down to reality soon.</p><p>10:00- Definitely coming down. K smokes more pot, I decline. My stomach is starting to percolate and churn a bit. K has no stomach discomfort at all (maybe the pot?). I also feel hungry at the same time.</p><p>10:30- We both decide to eat. This helped my stomach condition alot. We are not totally down but very close to it.</p><p>12:00- Both of us are feeling a little washed out. It's not nearly as bad as an MDMA come down can feel, but, your body definately feels like it's been through a fairly intense experience. We decide to go to bed.</p><p>Aftermath:</p><p>We both fell asleep right away and slept solidly until 9:00 am. Both of us felt well rested with no hangover symptoms at all. I would like to note that we both experienced slight headaches towards the end of the trip, but, nothing serious. We would definately try 2c-t-2 again maybe at 12mg, but, definitely not higher. I wonder if this is just a strong batch of material or we are both sensitive to this compound. As I stated earlier we both achieved a solid +2 from just 8mg. All in all a very good first experience!</p>",
 "year": "2000",
 "id": "4298",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-12-18T08:00:00.000Z",
 "views": "16706",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "8.0 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "(capsule)"
  }
 ]
}
