{
 "id": 43,
 "title": "It Was Unreal",
 "date": {
  "submission": "2005-07-12T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Pyre",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ],
 "report": [
  "I had been smoking weed for years, but unusually heavily in the last month. I have a decent amount of experience with LSD, mushrooms, DXM, and a handful of other psychoactives, but nothing could have prepared me for the brain-melting impact of combining inhalants and weed.",
  "I had been smoking for a few hours before and was decently high before I decided to huff a few lungfuls of room freshener. I rarely use inhalants by themselves. The high isn't much fun, but when combined with other substances, any substance really.. it sends you into hyperspace like nothing else can.",
  "So, after a few bowls, I filled a bag with the propellant gas from the can of freshener, and inhaled. It his me like usually, a flushing warmth came over me, like I was in a hot tub. Auditory hallucinations kicked in, the 'Wah Wahs'. I took another lungful. The wah-wah sound became higher pitched. Almost like a chiming. My vision was very distorted. The world was swirling around like boiling soup. One more lungful",
  "-*WHAM*-",
  "Everything began to change. The bag melted into the background of the tiled floor. It swirled into intricate shapes. My thought process changed. I was thinking outlandish thoughts, and coming back with another thought that would cancel out the previous one. This process began to break down. Existence was breaking apart into it's most basic form. I literally forgot that the universe was there! I was terrified. I felt like everything had moved on in time, but I was left behind, in the microcosm of my bathroom, and nothing beyond that existed. My vision was incredibly distorted, each eye was registering something different. The individual centers of my brain must have lost contact, because I could feel and see several different sensations at oncedoes that make sense? It was a very strange, dissociative state of being. Everything was breaking down into simpler and simpler forms. Time didn't only cease to exist, but it never existed!. Eventually, I came to, and realized that the world had not forgotten about me. Everything was back to normal.",
  "This state only lasted a few minutes, but it may as well have been a lifetime for how frightening it was. Its days later and I'm still partially dissociated, but that's probably from the weed-over after last night.",
  "The bottom line, don't fuck with inhalants. I not only lost my sanity, and almost my lifeI almost lost my soul."
 ],
 "erowid": {
  "id": "10031",
  "citation": " Pyre. \"It Was Unreal: experience with Cannabis & Inhalants (Aerosol) (ID 10031)\". Erowid.org. Jul 12, 2005. erowid.org/exp/10031",
  "substance": "Cannabis & Inhalants (Aerosol)",
  "views": "14982"
 }
}
