{
 "title": "A Traumatic Experience",
 "author": "Hessel",
 "citation": " Hessel. \"A Traumatic Experience: experience with Floatation Tank & 2C-E (ID 43015)\". Erowid.org. Jun 20, 2006. erowid.org/exp/43015",
 "substance": "Floatation Tank & 2C-E",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "5.0 mg",
  "oral",
  "2C-E"
 ],
 "report": "<p>I thought it would be easy- lay back, close my eyes, and let the colors unfold and amaze me.  As I lay in the tank it became apparent that a pleasure trip was not in store for me. </p><p>In the dark chamber there was no difference between eyes-closed and eyes-open.  I focused on my usual closed-eye static, which was equal to what I always see before going to bed.  Neither the tank nor the 2c-e changed it at all, whereas the 2c-e usually blows my mind (Delight) at this point.</p><p>A period of waiting began.  I suspect that most people wont be able to get beyond this waiting- they will either get out of the tank (due to boredom or some faux-illness), or not allow it to end.  I felt that weird impulse, which I suspect is common to all humans, to cling to my boredom and rigid thinking.  During this waiting period the few psychedelic effects I experienced manifested themselves. </p><p>The edges of my field of vision flickered a little, from time to time.  This was barely perceptible, and I suspect that it was only a normal body quirk which I noticed due to my unusual situation.</p><p>Slight vertigo- I felt as if I had floated sideways in the tank, which was impossible, or like the tank had inclined 15 degrees- a cool effect considering the water should have pooled at my feet.</p><p>Thinking in sounds- Through the whole process I never stopped thinking, never reached a Zen-state of blissful mind-silence.  (I now see just how much work that will be for me)  However, during the waiting period my thoughts would trail off and turn into the sound of Indian music.  Some of the noises sounded remarkably similar to the sitar.</p><p>Then the experience began in earnest.  It was around the 35 minute mark, (through the whole thing my sense of time was not distorted) and I didnt even realize it was happening at first.  I thought my mind would eventually clear and I would be treated to a lightshow or something until I started thinking about myself.  First I realized that Im not a visually-oriented person, I never spend time thinking about how things look or anything like that.  Then I started thinking about all other aspects of my life</p><p>Its a little too personal to spread around the internet- or maybe the internet is the perfect impersonal medium to blather in, so I wont indulge myself.  Suffice it to say that my world was ROCKED, and I ended the hour taking an ice-cold shower, crying, feeling like I had been raped.  But calling it Rape was only a lie to myself, and a way to get your attention.</p><p>What I really think happened was that I was judged.  In the way that really matters.  Permanent, truthful judgment.  If that sentence doesnt strike you as God-Awful, you are either a saint, a child, or an idiot.  Remember, for me it was like rape. </p><p>Now that I got the important stuff off my back, Ill relate the boring details:</p><p>+19year old college student</p><p>+Taken every drug before, no serious addictions encountered so-far</p><p>+Generally considered smart, underachieving</p><p>+5mg 2c-e 1:15 prior to the experience</p><p>-on an empty stomach</p><p>-this is usually enough to feel, although with any stimulation the feeling is lost.</p><p>+The tank was eight feet long by four feet wide, and four feet tall with a door on the side. </p><p>+cost was 30$ for a student, and Im glad I paid it, otherwise I would have jumped and ran, for sure.</p><p>+The experience kept getting more intense, up to the point where they knocked on my tank to get me out.</p><p>I only include this last part to stop those of you who read this and think, well that man certainly had a heavy conscience, he probably did something terrible and it just came back and bit him in the ass  My only real sin is indulgence, and though my indulgences are frequent, they are seldom worse than a night of drinking.  However, I expend to spend a lifetime trying to redeem myself, for redemption only comes to the sadist after painful death.</p>",
 "year": "2005",
 "id": "43015",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-20T07:00:00.000Z",
 "views": "11681",
 "dose": {}
}
