{
 "title": "The Cold Substitute",
 "author": "Risk Breaker",
 "citation": " Risk Breaker. \"The Cold Substitute: experience with Drug Testing (ID 43035)\". Erowid.org. Jul 4, 2006. erowid.org/exp/43035",
 "substance": "Drug Testing",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Early in 2005, a friend and I were caught for smoking weed in our dorm room. After going through all the bullshit that goes along with getting caught (i.e. eviction, court), I thought that I was through with marijuana. However, one night desire got the best of me and I decided to toke. I know it was a pretty shitty decision, looking back on it, but the worst was still to come.</p><p>The next morning, I call the Health Center and it turns out I'm getting drug tested. Well, at this point, it's fair to say that I was feeling a little bummed out. But, I resolved to go down fighting. After making several calls and purchases, I had my plan together.</p><p>Supplies:</p><p>1-2 condoms (extra on just in case)</p><p>1 unfolded paperclip</p><p>1 heat pad</p><p>1 roll of duct tape</p><p>1 friend who hasn't taken drugs in the last month</p><p>Method:</p><p>Step 1: Find a bathroom in my university's Health Center.</p><p>Step 2: Hide the unfolded paperclip in my sock.</p><p>Step 3: Go to the Health Center bathroom with my friend.</p><p>Step 4: Have my friend pee in a condom and tie it up. Use the duct tape to tape the urine-filled condom to my inner thigh.</p><p>Step 5: I placed the heat pack on top of the condom to ensure the  urine doesn't cool down too much (this later would become an issue)</p><p>Step 6: I Immediately proceed upstairs and deposit my sample.</p><p>Now this method relies on several assumptions. First, that I won't be getting frisked by the drug test administrator. Luckily, the test center had a one-room unisex bathroom with a lock on it so my friend just placed the urine-filled condom in the sink and I went in immediately afterwards.</p><p>So, I use this method and I miraculously pass that drug test. However, our story isn't over...</p><p>On the last day of drug testing, my number is called again. And unfortunately, I need to substitute or face expulsion. So me and my friend go through the method I described earlier. However, as soon as I get out of the bathroom after depositing my sample, the  following happens.</p><p>Drug Tester: Uh oh. You're sample's a little cold. Is that all on the up and up?</p><p>Me: Well, I can go drink some water and go again.</p><p>Drug Tester: Nah, that's ok.</p><p>Now, if he'd insisted I redo the drug test, I would've been in a spot. Luckily, I managed to bullshit my way out of it.</p>",
 "year": "2005",
 "id": "43035",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-04T07:00:00.000Z",
 "views": "8744",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
