{
 "title": "Anything is Everything; Everything is Nothing",
 "author": "PlagiarizedExistence",
 "citation": " PlagiarizedExistence. \"Anything is Everything; Everything is Nothing: experience with Opium & Cannabis (hash oil) (ID 43030)\". Erowid.org. Aug 15, 2005. erowid.org/exp/43030",
 "substance": "Opium & Cannabis (hash oil)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "smoked",
   "Opium",
   "",
   "1.0 g",
   "smoked",
   "Cannabis",
   "",
   "1.0 g",
   "smoked",
   "Cannabis - Hash"
  ]
 ],
 "report": "<p>To describe any experience well, one should begin in the past. After all, the past was once the present, and is everything that shapes the future. Every moment leading up to now has made me who I am. So, it is important that that history be included with this life-altering experience that occurred the other night.</p><p>Im not sure if I should credit drugs for what I have lived through the past year. Currently a rather independent 18 year old, I just finished my first year of college. Ive been called a smart kid, having averaged about a 90-95 through high school with little effort. Despite the slight drop in motivation starting with my addiction to pot, I have retained much knowledge and insight over these years. I learn much better on my own, hence my discontinuation of college after the first year. It is the harder road, but it is my choice.</p><p>Ive grown up with a strong hatred of self, which is complex in itself to explain. Think of it as a perfectionist mindset, in combination with (literally) no self-esteem and confidence. It led to a perpetual suicidal and depressed mindset. I have only since last night realized my selfish, sly tactics of lying to myself (and everyone Im around). I would never show the side of me that wanted to die, though. In short, I made myself believe I was the shit on the bottom of everyones shoes  the lowest of the low. I would play stupid just to get by, and marinate in self-hatred. I felt like I couldnt be around any people unless I was lower than them.</p><p>It was so strong, it was like a high (a low- really) I achieved. Every morning, I would wake up with the thought of, Id rather be dead, which is certainly NOT the easiest way to get out of bed. Sometimes I would come close to snapping and consider ways to die that night (jumping in front of trains was prominent). I didnt care about friends. I didnt give a fuck about the human race. I didnt even consider myself part of it.</p><p>Usually a bong hit or two would remedy this and level me out for the day, and I would most often continue smoking throughout the day  averaging about two to four times each day. I would smoke pot before and after school, and after work. It helped me get through the boring, repetitious day of school and/or work. Pot also helped me relax with other people, and I was more tolerable to be around. Id usually listen to what anyone had to say, and input very little of my own thoughts. I didnt have to think about myself, so I was fine.</p><p>That being said, I extracted hash oil from four ounces of marijuana, and have been smoking that either with or in place of pot for the past two weeks. Its really hard to measure it. Anything else (regs) doesnt really get me high anymore unless theres some hash oil on it.</p><p>Only recently (within two months) have I begun a small dependency of caffeinated drinks (tea, coffee) on the regular for a morning routine, or to help me write a paper for school if I needed to stay up. Most of the time, I would get high and say, Fuck it, anyway, and find an excuse to not do the work. Which has led me to fail a couple bullshit classes in college that I already know, like HTML and French. I stopped caring about doing well in school because I feel it was holding me back from what I really can learn.</p><p>The only other drug Ive done besides pot were pills of Vicodin a long time ago. Also, a single (and sole) trial of mushrooms. I ate less than half an eighth and didnt really feel anything, so I dont count it as the slight feelings of stoned (and despising of hallucinations due to self-hating reasons) didnt interest me enough to try it again. I used to drink alcohol every weekend or so, but that only lasted for a summer. I would get way too wasted off of hard liquor and end up puking the night away. I never blacked out or lost consciousness, but I regret overindulging. I dont find alcohol too much fun anymore, but every once in a while Im willing to try it again.</p><p>Im very inexperienced with opiates. As of the past week, a surge of opium came through town, and I managed to get my hands on a small quantity to experiment. I was instantly hooked as the drug was very appealing to me. Its distant, drunken-like state put me at ease in a crowd. The first time I tried it, I took two hits at a small party. Surprisingly enough, I mingled with people the rest of the night which was VERY uncharacteristic of me. I ended up being given about a gram, and smoked half of it over the course of a week.</p><p>This experience begins on an early Friday night, after coming home from being with my (first) girlfriend. She was staying at her friends house for the night, so I was left with nothing to do at about 8:30 pm. I was borrowing a car from my mother since mine is in the shop, and decided to stop at a gas station to fill it up to return the favor. I picked up a large energy drink (Sobe No Fear) figuring Id be up a while anyway (Im nocturnal by nature).</p><p>After going home and relaxing for a little while listening to music  a very normal thing for me  I downed the drink by 10 pm. I read a lot of forums and such about cars, games, and drugs. Around 11:30 pm I decided with nothing else to do, Id smoke the last of my opium stash and mellow out for the night so it didnt tempt me next week.</p><p>I had just packed the bong and taken the first hit when my long-term buddy, P, called me up a little after midnight. I vacillated between picking it up or not. I felt like being alone for the night, but for some reason I answered it anyway. I told him to come on over. In between the short period of time it took him to get to my place, I took a second, larger hit of opium. When he got there, we talked for a little while before the bong took our attention (it tends to do that!). He wanted to try some, so I shared the rest of it with him, taking another two hits, for four total by a little after 1 am.</p><p>P and I talked some more about our current situations, as we havent talked to each other all week. Ive known him for nine years, which is a pretty substantial time to know someone at this age. I suggested he pack a bowl of pot to see the synergy with opium. I had only smoked pot first, then opium - never the other way around, until tonight.</p><p>P always has great pot on supply, but he was running low tonight. His stash has dwindled down, and only the best pot hed been saving for months remained. This is what we smoked. Being pretty experienced with cannabis, trust me, this was some good smoke. I smeared a bunch of hash oil all over the bud to make sure wed be good. My bowl can hold about three grams, but it was packed a little more than halfway. There was probably a little bit of opium still left in the bowl, too.</p><p>P had to wake up early the next morning, but before he decided to call it a night I persuaded him to take a short walk with me. I had looked at my cold hands, and saw my circulation was bad. Id only taken two hits but by that point, we were both feeling really good, so it didnt matter. It was a beautiful night, so P took a couple more hits for the road.</p><p>When we set out to walk around the nearby parking lots, we were in awe of the beauty of simple light. It was so entertaining to be outside. My mind was racing and I found myself somewhat overwhelmed. It felt good to move, but I wanted to do more. P was so far gone he was acting like a mech, running around with guns for arms making sound effects of boosters and other odd things. Luckily no one was around.</p><p>We had circled the lighted parking lot twice, and by the second time around P suggested to run. I felt that was an awesome idea, because my circulation was still somewhat poor. So, I went from a slow jog to an all-out sprint. P said he never saw me run so fast in his life, and proceeded to tell me Id be good at things if only I tried. He suggested I do all kinds of sports, and get in shape and whatnot, being the athletic type he is. While I was catching my breath, I noticed my heart pounding pretty fast. I figured it was normal since I just sprinted faster than I might have ever sprinted before.</p><p>Things started to go downhill when we returned to my place at about a quarter to two. I could only concentrate on my heart pounding out of my chest, and the fact that my hands were still in poor circulation despite the amount of activity I was just involved in. I tried to relax and listen to some chill music while P was on the computer. But laying down and relaxing was not possible. I felt like shit, and asked P what I looked like  if I looked sickly. I started to get worried about how fast my heart was going. It didnt help that P said I looked really pale, and confirmed my hands were still cold (I couldnt feel them).</p><p>Also, on a side note, Ive been a little sick with something for the past week. My lungs are hard to deflate fully, and feel like theres liquid inside of them. No matter how much I blow my nose trying to get it all out, I cant. After I came home I blew my nose for a good ten minutes extracting a lot of mucus (or whatever the hell might be in there!) from my lungs.</p><p>Eventually it was so bad that I came to terms Id die that night. I didnt really know what to make of it. I wanted to write, mainly, everything that I had just experienced and felt. As writing is my passion, it was all I wanted to do to express myself. I couldnt, though. I just lay there and thought. P was still around, but was about to leave. I told him how I felt and begged him to stay there. He said I should eat something, which was a great idea because I hadnt had an appetite all day.</p><p>So, we walked into my living room and I grabbed a banana. I asked him to pour me a cup of orange juice because I didnt feel like moving. I was shaking almost to the point of trembling. He criticized me that I was just milking this opportunity because of feeling bad. I really made it clear to him how I felt, and thats where it started.</p><p>Sitting at the table, eating my banana and drinking my juice, I asked P if hed sit down and chill with me for a little while longer. I could tell he was slightly irritated and wanted to sleep, which was understandable. I made clear to him that if I lost consciousness, Id want him to call 911 and get rid of anything in the house. I was seriously unsure if Id die of heart failure or something. My heart was still pounding hard and fast, and I gave up trying to hold the banana in my hands they were shaking so bad.</p><p>Thats when it hit me. I didnt want to die alone. Thats what I was neglecting to really accept. I just completely opened up to P at that point, explaining myself in full. I have never felt so close to dying that I would really want someone there. It made me realize the importance of myself to others, and others to myself. I had no qualms about dying myself because I felt so alone all the time. But that night, I had someone there that actually gave a shit about me. I was overwhelmed with emotion in this epiphany. I didnt break out crying , but a couple tears fell that I couldnt help. I decided that from then on Id be a changed person, accepting myself as part of existence for once in my life.</p><p>P and I continued to talk until almost four in the morning. We went in depth about things like we havent before. Nothing substantially deep, like the meaning of life or something, but depth of personalities. We both described ourselves, our relationships, and anything else that felt like it was relevant at the time like we never have before. It was an interesting insight into his personality, because I have normally seen him as a simple, happy-go-lucky person  he is! But he has an intelligence to him, that if he manipulated right, could get him far.</p><p>Writing this now, it is the next afternoon at around 4 pm. I ended up falling asleep around 5 or 6 am when the sun was coming up on the most comfortable leather couch Ive ever slept on. It felt so good to get out all the pent up emotion Ive been laying on myself. Whether or not drugs shaped who I am, I am finally happy with myself for who I am. It took a mixture of the circumstances to lead up to this point, but I am now changed for life.</p><p>NOTE: Energy drink contents in case there was some weird synergy:</p><p>Taurine (2000 mg)</p><p>Inositol (200 mg)</p><p>Panax Ginseng (100 mg)</p><p>Guarana (100 mg)</p><p>Creatine (50 mg)</p><p>Grape Seed Extract (50 mg)</p><p>L-Carnitine (50 mg)</p><p>L-Arginine (20 mg)</p><p>Caffeine (~50-75 mg)</p>",
 "year": "2005",
 "id": "43030",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-08-15T07:00:00.000Z",
 "views": "18866"
}
