{
 "title": "Never Ever Want To Do That Much Again",
 "author": "Green Ninja",
 "citation": " Green Ninja. \"Never Ever Want To Do That Much Again: experience with Methamphetamine & Amphetamines (Dexedrine) (ID 43031)\". Erowid.org. Sep 1, 2007. erowid.org/exp/43031",
 "substance": "Methamphetamine & Amphetamines (Dexedrine)",
 "bodyweight": "210 lb",
 "report": "<p>I had been looking for 3 weeks to get some good meth and finally hooked up through a relative of mine. He had just gotten a huge inheritance from a death in our family and he decided to invest in a large amount to double up his money. The night he finally hooked up, he got an oz. of some of the best shards I've ever seen! He also brought back a bottle of Dexadrines he'd gotten a hold of somehow and a fat sack of good green. We had everything we needed for a weekend of partying.</p><p>He cut out a huge line (3/4 - 1 g.) and split it in two, one for each of us close to about a 1/2 or so a piece. Before I did my line, I ate 2 Dexadrines to kind of enhance the speed buzz. I did my line and felt a really bad burn, worse than any other glass I'd done before. After about 20 minutes or so, I felt nice and energized, but I didn' quite have the rush I was looking for. I decided maybe if I smoked it, that would do the trick.</p><p>I sent my bro to the store for a glass tube. They sell cigars in thick glass tubes for about a dollar. We used the tube and a mapp gas torch to blow a perfect glass pipe. I put just one whole shard into the pipe (about a 1/2 g.) and melted it on down. After 2 hits I was sweating and could feel my heart pounding. Needless to say, I put the pipe down and started playing a video game.</p><p>About 4 hours later (when I got done playing my game...LOL), I felt a little groggy, like I was coming down a little bit. So back to the glass table I went and this time I said 'no fucking around' and snorted a line so big it gagged me! (maybe about 1 - 1 1/2 g). Then I picked up the pipe again and finished what I had left in there earlier, i put about abother 1/2 g or so in it and torched it, too. By this time, my bro was talking fast as hell on the phone, hooking up deals and whatnot, zooming his ass off! The combanation of the Dexadrine pills made the intense rush of smoking the meth last longer than it normally does. It makes the buzz linger much longer.</p><p>After doing more and more lines and more and more Dexadrine, I lost track of time and before I knew it, 2 days had went by. This is where I should have cut it off and went to sleep, but why when you have more meth?! So I continued tweekin until I started having chest pains. I decided to bring myself down a little and started smoking some weed we got. i smoked about a 1/4 oz. and still was wired as before. By this time, I was hearing phones ringing that werent ringing, people knocking that werent' there, peeking out the blinds every 10 seconds... typical tweeker behavior.</p><p>The days went by so fast and my body was aching by the last day. When I finally came down off the buzz and all the stuff was gone, my body felt ravaged from being deprived of food and sleep and my mind was playing tricks on me like shadow people in my kitchen. fatigue had sat in and my back ached with an intensity. I smoked my last 1/4 oz of weed and ate an Oxycontin 40. Within just a few minutes I was out and woke up 2 days later feeling horrible. this is the first bad experience I'd had with meth, but it hasn't scared me away from it. I just know now that i should pace myself and not consume so much next time. meth is an awesomely powerful drug and it doesn't take me much to feel effects from it. I'd done it quite a few times before this incident and it was pretty bad, so I'd hate to see what it would do to a first-time user. Be careful and safe with this drug.</p>",
 "year": "2005",
 "id": "43031",
 "gender": "Male",
 "timestamp": "2007-09-01T07:00:00.000Z",
 "views": "12342",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "14 g",
   "administration": "",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "10 tablets",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": "",
   "amount": "14 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": "",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  }
 }
}
