{
 "title": "From Blindness to Euphoria",
 "author": "SH-101",
 "citation": " SH-101. \"From Blindness to Euphoria: experience with Oxycodone (Oxycontin), MDMA (Ecstasy), Cannabis & Alcohol (ID 43042)\". Erowid.org. Aug 31, 2007. erowid.org/exp/43042",
 "substance": "Oxycodone (Oxycontin), MDMA (Ecstasy), Cannabis & Alcohol",
 "bodyweight": "140 lb",
 "report": "<p>Before reading, know that I generally have low-tolerance to many drugs, although i am a very experenced drug user. This was also my first time using oxycontin.</p><p>10:30 PM - Me and my good friend Chris were tring to find a party and a place to stay on Friday night. We had just bought a QP so we were smokin alot. My two friends, Katy and Crystal, called us up and asked of we wanted to pick them up to go to a party. That sounded cool so we went over to Crystal's house. When we got there they were telling us that the party might not happen. So we sat down, smoked a bowl, and tried to find somthing to do. Chris busted out a pill bottle and he had a 80 mg oxycontin. I asked if I could pay him $5 for half of it and he was cool with that because he didn't wanna take all 80 anyway. Chris broke the pill in half and we ground it up into a line with our I.D.'s. We snorted the lines and smoked a bowl. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>11:30 PM - Before I started to feel the oxy, Katy asked if we wanted to stay at her house so we got up and drove over there. On the car ride we smoked a fat bong bowl, and I began to come up and feel the oxy. Coming up felt alot like coming up on vicodin and I thought it might not be better than vicodin. I would soon find out I was extremly wrong. So I took a roll I was saving for the next day.</p><p>12:00 AM - When we got to Katy's house her stepdad was there, but he was cool with us smoking in the house. He offered us some alcohol, he had a bottle of 151. So we both took about 5 or 6 shots. The girls payed Chris for a roll each and Chris took one himself. After that I started feeling amazing, like I was floating and extremly heavy at the same time. I remember thinking 'I wish I could feel like this forever' and I couldn't get the smile off my face.</p><p>12:30 AM - We all went into her room to hit up a gravity bong filled with sensimilla, and I kept coming up! I was feeling the X a little already. For a split second I felt like I was getting too fucked up, but I put it out of my mind quickly. The gravity bong got to me and I took a humongous hit and about ten seconds later everything started to get darker, and a minute later I couldn't see anything with my eyes completly open. I seriously went blind. I didn't tell anybody for like 5 minutes because I thought it would go away, but I started to feel dizzy so I told Chris and asked if he could help me to the couch.</p><p>1:00 AM - I laid down and crystal was diggin me so she laid down next to me. Katy got me a cold towel to put on my face cause i was sweating really bad. I started to have a 'Oxy-Dream' as my friends call it, It's a dream that you don't know is a dream until you wake up, and you get them when your on oxy. I don't remember what it was about but it was cool. When I woke up I was startled, but I could see light sources and eventully my vision came back.</p><p>1:30 AM - Now that the bad part was over I felt the best I ever have in my life. The X was hitting me like crazy. So incredibly euphoric that I almost started crying out of joy. We smoked another bowl and had a couple more shots, although I didn't really need it. One of the girls was hittin on me, so we fooled around a bit, making out and stuff. I asked if she wanted to hook up with me, and she was into that. We headed back to her Katy's room and starting having sex. After a good hour I had an amazing orgazam that lasted about 2-3 minutes! I passed out after that for like 5-10 minutes.</p><p>3:00 AM - We went back into the living room, where Chris was having sex with Katy on the couch, me and the girl I was with when back into the kitchen cause I needed some water and a joint. We were both peaking on the X and I took off my pants, again. When I did she gave me head and although it took a while for me to cum when I did it lasted almost as long as the last time. We went back to the living room to talk to Chris.</p><p>4:00 AM- I hadn't ate anything all day, and we were getting hungry so me, the girls, and chris all went up to the 24 hour taco bell. On the way we smoked some more and after we got done eating Katy wanted to go home to sleep so we took her back and headed to one of my friend's house named James. James had a sheet of acid so we all took 2 tabs. By this time I couldn't feel the oxy anymore. We smoked a bowl and went to walk around the lake by his house.</p><p>5:30 AM - I started to feel the acid, I started to see figures in my periphial vision. We all knew we needed to smoke out of James' bong so we sat down on a bench and smoked 3 bowls or so. I started to feel the acid real good. I dicided to lay down in the grass and close my eyes to see cool stuff. It was a very good trip.</p><p>6:30 AM- When I woke up it was starting to get brighter outside. I knew a had to take Crystal home soon, but I was still seeing things that wern't there so I asked if she wamted to just stay at my place next door, and she was cool with that, so we smoked a bowl and went back to my place. I was tripping pretty good still.</p><p>7:00 AM - I was so tired I could hardly keep my eyes open. I had been up for over 36 hours. So me and Crystal smoked 2 bowls and went to sleep.</p><p>There you have it. My typical friday. Oxycontin might just be my favorite drug, even though I may have took too much my first time.</p>",
 "year": "2005",
 "id": "43042",
 "gender": "Male",
 "timestamp": "2007-08-31T07:00:00.000Z",
 "views": "15933",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:00",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:30",
   "amount": "5 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 ]
}
