{
 "title": "Everything Is So Alive",
 "author": "Sunstar",
 "citation": " Sunstar. \"Everything Is So Alive: experience with Mushrooms (Mexican) (ID 43056)\". Erowid.org. May 2, 2007. erowid.org/exp/43056",
 "substance": "Mushrooms (Mexican)",
 "bodyweight": "55 kg",
 "header": [
  "DOSE:",
  "18 g",
  "oral",
  "Mushrooms",
  "(fresh)"
 ],
 "report": "<p>This was my first time taking any kind of psychoactive drug. I was in an excited kind of mood; I was at my friend's house with about 7 other people. Only two of us were taking the shrooms (ie. 1 other (gaia) and me), the others just decided to get totally pissed with fuckloads of beer.</p><p>Gaia and I had bought 30g of fresh Mexican shrooms earlier, in Camden. We were gonna split them, 15 grams each. We decided to not eat all of them at first, so we left a few in the bag, and split the remainders in half. I had heard that the longer you chew them and hold them in your mouth, the stronger your experiences, so I chewed mine for aages. (was kinda gross:P) They didn't actually taste too bad! I was expecting that they'd taste like..really gross, but they didn't. so that was excellent.</p><p>After a while, I wasn't feeling any effects, I just thought maybe I was a litttle bit drunk (i'd only had 1.5 cans of beer..but im a lightweight *blush* so u neva know). My body was tingling a little bit, almost as though I had pins and needles all over, but slightly different. I talked to a friend on the phone, and she suggested taking a few more, so I did. I split the shrooms left in the bag into two, and ate my share. (this time I held them in my mouth for 10 mins. I finally swallowed them cuz I was getting death threats, if I didnt swallow them :S (was grossing some of my m8s out).</p><p>I sat in a v. bright bathroom for a bit (fluorescent lights), and felt..just slightly strange. Very hard to describe. Gaia came in, and she'd been crying (problems with her bf, who was also there). She was so red, that to me, she actually looked like she was glowing. But I still wasn't feeling very strong effects, so in a moment of craziness I decided to eat the remainder of Gaia's shrooms as well (I didn't think she had been handling them v. well at all, and she was totally freaked out, so I thought it'd b better for me to eat them than her. yes, a v. rude decision on my part, but..im kinda glad for it, cuz I got some really cool effects after that :D)</p><p>Ok, so after eating those ones (I also held them in my mouth for about..7 mins), I stood by an open window, looking out onto a balcony, and then a garden. There was some wisteria crawling on the balcony, and the leaves were blowing in the wind. It was dark by now, and the garden looked totally magical. I stood there for a LONG time, just looking out. Every single plant looked so alive, and as though it had a face. Like..every leaf/group of leaves, was a face. The trees were waving at me, and some plants' faces were all skulls :S</p><p>I had been talking to a guy who had had a really scary trip on shrooms before, where he said he saw a werewolf, and some flies turned into crows. So that kinda..inspired my imagination somewhat, I guess.</p><p>The whisteria that was growing on the balcony turned into a big pair of paws, with really long sharp nails. It was SO fucking scary. The paws were coming closer, and I was convinced that there was a big werewolf coming to..kill me or something. But I kept saying to myself, 'leaves. They're leaves. Nothing more than leaves', and eventually they didn't look so much like paws as before.</p><p>I then walked down to the garden, where some of my friends were jumping on the trampoline, and having a smoke and stuff. I picked up a flower that was lying, already picked, on the grass. I smelt it, and it smelt so good. So I went round telling everyone to smell my flower, and after that I just went around the whole garden smelling flowers, and telling everyone how pretty they smelt.</p><p>I went back into the house, and into this room which was TOTALLY psychotic. It was AMAZING. It was an office, with one corner full of really jam-packed bookshelves, from floor to ceiling. There was a desk with a computer, with a bouncing screensaver. There were loads of little lights around, from other computer bits and bobs. I found myself just standing there, looking around with my mouth wide open for about ten minutes. There was also a window looking out into a flower bed with waving flowers. I realised that to anyone watching me, I would have looked really crazy and..stupid :P But it was really amazing. Every book was alive, with a face, and every light was an eye. Then one of my friends came and went onto msn on the computer, so that just kinda ruined the whole room's atmosphere, so I went elsewhere.</p><p>I ended up sitting on a chair, looking out into the deserted garden through an open door, with the lights in the room turned off. I was listening to Porcupine Tree (really really really good music, especially when taking shrooms). I felt like I was travelling with every wave of the music, being carried far away. The garden was SO full of life, adn there were so many faces. I spent a long time looking at teh clouds as well, turning them into all sorts of shapes. It scared me how many skulls I saw, in the clouds, as well as in some of the plants.</p><p>I started getting mental images of some of my friends, and then I got one of my mum, reaching out to hug me, and smiling at me, her eyes full of love. I started crying, uncontrollably. Just crying..I cried for the rest of the evening, with varioius people comforting me, but I just really wanted to be alone to just cry. The same happened to Gaia, she was crying and laughing at the same time. We cried and laughed the evening away.</p><p>As the effects were starting to wear off, I sat in the hall, which had a black and white tiled floor, like a chess board. The lines of black and white were moving, and there were all these colours interweaved (later i realised it was also probably the walls reflected onto the white tiles)..but apparently I spent a LONG time just staring at the floor (again, with my mouth wide open, lol).</p><p>Eventually, I found myself a bed to sleep in, and just fell asleep. In the morning, I felt in a very..lonely, serious mood, like I didn't want to talk or communicate.</p><p>All in all, the experience was..amazing. I really enjoyed it, despite the 'werewolf', the skulls, and all teh crying. It made me realise that I really did love my mum. There had been some..resent and questions in my mind.</p>",
 "year": "2005",
 "id": "43056",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-05-02T07:00:00.000Z",
 "views": "2817",
 "dose": {}
}
