{
 "title": "Diet LSD",
 "author": "DrKev",
 "citation": " DrKev. \"Diet LSD: experience with 5-MeO-DiPT (ID 4306)\". Erowid.org. Jun 25, 2001. erowid.org/exp/4306",
 "substance": "5-MeO-DiPT",
 "bodyweight": "145 lb",
 "report": "<p>I had the pleasure of taking 'foxy' this weekend for the first time and I would have to report a marvelous experience with it.</p><p>I measured out my material at a lab in 5mg doses and figured start low and boost later if so desired and we so desired.</p><p>Around 3:30 we each poured our 5mg capsules into some Coca-Cola and gulped it down.  Man that stuff is nasty tasting.  Anyways, effects we're felt in about 10-15mins.  Quite an impressive onset - I think that's actually a nice plus for once.  Anyways, I began to feel slightly anxious as I don't know anyone personally who has taken it before and started wondering, 'hmmmm, was this a good idea, how far up will I keep going?' etc..  Not to fear, I settled quite nicely into it's somewhat unique buzz.  We dubbed it Diet Acid.  A great body buzz, tactilely enhanced, dilated pupils making colors bright and intense.  4:30 we were sure we had reached the peak, though it didn't have a marked peak.  You just kind of went up and up a little at a time then kind of platuead for a period of time.  Music soudned much warmer, gentler and inviting.  We listend to some good ole' Grateful Dead, then moved onto to some tasty String Cheese.  We attempted jamming some, which was very enjoyable.  I didn't think I could hit a wrong note (I should point out that I don't consider myself a stellar guitar player, just one of adequate chops).</p><p>Around 7:30 we decided to take another 5mg capsule ingesting it the same way as before.  The body buzz was much more intense this time, almost the level of ecstasy.  I felt at complete peace with my body and sat very still and took in the calming nature of the music.</p><p>I was still feeling quite good around 10pm but decided to head home and enjoy myself there.</p><p>I should point out that it never interferred with my thinking or made it hard to socialize or anything.  I felt I could easily go to a bar or hang out with people who didn't know what I had taken and gone about being my usual self.  Well except for my huge pupils - but hey, you can always say you went to the eye drs. that day and had your pupils dilated (which btw I always like having done).</p><p>Overall, if this drug doesn't prove to have any detrimental long term effects, I give it a two thumbs up.  Lets hope it doesn't get made illegal - it's certainly fun enough to go that way unfortunately.</p><p>Also, there is wide range of dosages to take, but honestly, I felt quite good on 5mg and can't say I have a huge desire to take more at a time.  I felt great on just a small amount.  I would like to explore this with a female and see how well it works with the somewhat reknowned aphrodisiac qualities.</p><p>Quick background on drugs I've used: grass, lsd, k, mdma, heroin, coke, 2cb, salvia.  A healty background in drug experiences I should say.</p><p>Be safe and enjoy!</p><p>ps - I'm not a Dr, just an old nickname from middle school.</p>",
 "year": "2000",
 "id": "4306",
 "gender": "Male",
 "timestamp": "2001-06-25T07:00:00.000Z",
 "views": "7834",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(capsule)"
  },
  "1": {
   "time": " T+ 4:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(capsule)"
  }
 }
}
