{
 "title": "Spice Damage",
 "author": "Lloyd",
 "citation": " Lloyd. \"Spice Damage: experience with Nutmeg (ID 4307)\". Erowid.org. Apr 17, 2001. erowid.org/exp/4307",
 "substance": "Nutmeg",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "3 Tbsp",
   "oral",
   "Nutmeg"
  ]
 ],
 "report": "<p>I've read through the list and I'm pleased to see that some people have had pleasant experiences.  I must have over-dosed.  It was no fun at all and it lasted several days.</p><p>My friend (female 200 lbs) and I washed several large spoonfuls of the spice down our gullets with water.  If you move fast enough, there is no chance for tasting the intense flavor.  Like some of the other reports here, it was in the early evening, a Saturday night, we were bored and looking for something to do.  I had heard about nutmeg and thought it would be something to try.  We found a full tin in the pantry and split it between us.</p><p>Two or three hours later, nothing seemed to be happening.  I figured it was a washout and went to bed.</p><p>I had crazy dreams in the night and woke in the early morning.  My head was pounding and I felt like I didn't have the strength to move.  I fell back to sleep.  I woke again and could tell by the sun that it was now afternoon.  When I woke, my arm was in the air.  I had the sense that I might have been thrashing around a little.  My head was pounding like the worst hangover ever.  I felt tired and anemic and closed my eyes again.</p><p>When I woke again it was dark out.  I was still miserable and weak.  I closed my eyes.  I woke again and the sun was out.  It was the morning of the second day.  I had never lost a day before and started to feel somewhat distressed.  Except for the dreams, only vaguely remembered, there had been no trippy or otherwise pleasant or interesting effects at all.  I was mostly annoyed and beginning to be worried that I might be in trouble.  I was so weak and hungover.  I thought maybe I should take a bath.  My room was just across the hall from the tub.  Standing up caused too much painful pounding so I slowly crawled to about halfway.  I was exhauted so I took a little nap in the hall and then continued to the tub.  I got in and ran the water as hot as I culd take it. (DON'T EVER DO THIS - I NEARLY LOST MY WIFE WHEN SHE DOZED OFF IN THE TUB ONCE.)  Then I fell asleep again.  When I woke, the water was cold and I got out, crawled back halfway to my room, took another nap, and crawled back into bed. </p><p>That second night, some of my housemates noticed that I hadn't been around and were somewhat surprised to find me in my room.  My head was still pounding but I was able to eat a little spaghetti.  I was still pale and hangover on the morning of the third day but at least I could get up and move around.  I  still had to take it easy.  The feeling was like a severe anemia, I just felt weak and any sudden movement would hurt my head.  I slowly returned to normal over the next two days or so. The remarkable thing is that my friend had no effects whatsoever. Perhaps that was because she was a little heavier than me or maybe I am just predisposed to spice damage.</p>",
 "year": "1982",
 "id": "4307",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-04-17T07:00:00.000Z",
 "views": "35654",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 Tbsp",
   "administration": "oral",
   "substance": "Nutmeg"
  }
 ]
}
