{
 "title": "A Taste I Won't Forget",
 "author": "Johnny Canuck",
 "citation": " Johnny Canuck. \"A Taste I Won't Forget: experience with Zopiclone (Imovane) (ID 43089)\". Erowid.org. Jul 23, 2010. erowid.org/exp/43089",
 "substance": "Zopiclone (Imovane)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "",
   "Pharms - Zopiclone"
  ]
 ],
 "footer": [
  [
   "2005",
   "43089",
   "Male",
   "",
   "Not Given",
   "Jul 23, 2010",
   "7247",
   " "
  ]
 ],
 "report": "<p>Keep in mind, these were my very first times with any Benzos of any kind.</p><p>Here in Canada, like in Australia, Zopiclone is available through a prescription, under the name Immovaine. The ones I encountered were 5mg each, and about 15 (I don't remember the exact amount) was given to me by a friend. Apparently his mother had some insomnia problems.</p><p>Anyways, there are a few interesting things about Zopiclone. For example, it had a horrible after taste. I have extracted codiene before, and I would say that this tasted worse. It also stays in your mouth for quite some time. </p><p>The first time I took it, I took 1 pill. Effects came on in about 10 minutes (which suprised me) and I stayed in a highly drunken like, happy, falling all-over the place state for about an hour. After that it gradually tapered off. I quickly found out that I liked Benzos. Unfortuantly, I'm very, very compulsive. Over the next week I took a pill about every other day. I am an unimaginably forgetful person. I have always been like this, and the Zopiclone just made things worse. I do remember one thing however. I remember taking 3 pills at about 3:00pm, and talking to my friend on the computer. The only clue I have of what we talked about was from a print-out that I made at the height of my state. Apperently we have been talking about mah-jong, me horribly mis-spelling it (not even recognisable), and I could not make out about 1/3 of the words I typed upon further examining. Needless to say, my friend knew something weird was going on. :)</p><p>When I realised that I couldn't remember anything from the last 5 days, I knew I had to stop. Then withdrawl came. The next day I had horrible cramps, an hour's worth of painful dieureah(sp), and could not sleep until 4 am. I figure I'm lucky that I didn't get too dependant on Zopiclone. I felt horrible, but I'm sure it could have been much worse. I remember that I gave the last 2 pills to my good friend as a small birth-day present. It felt unusually good to remember something for once.</p>"
}
