{
 "title": "So I'm a Snake?",
 "author": "Ed",
 "citation": " Ed. \"So I'm a Snake?: experience with Salvia divinorum (10x extract) (ID 43105)\". Erowid.org. Aug 30, 2007. erowid.org/exp/43105",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>Before the experience in mention, I had smoked salvia divinorum 5 times. I only hallucinated 2 of these times, but I could still feel the reminiscent minor symptoms. My skin would feel like it was being pricked by thousands of soothing needles like when your leg falls asleep and first starts to come back. I first thought that I would slur my speech, but after asking my companions I found out that I only felt like I was slurring when I really sounded normal. There is also an indescribable quality that is always there as I first feel the symptoms, which made me start thinking of salvia as a person. It is like hearing an old friend say hello in a tone that only they use but you cannot describe.</p><p>There are qualities to the trip that I felt myself and have heard described by my tripping companions without me mentioning them beforehand. Every trip was reality-altering in nature. They usually lasted intensely for 5 minutes, and then the minor symptoms lasted for another 20-30 minutes. When coming back from the major hallucinations I, and others, had a sense that whoever was with the tripper was trying to trick him/her back. When coming back, there was always a moment in the middle where I had to give up my newly established reality and start accepting the old reality again. Because I only hallucinated 2 of the 5 times, I tried to narrow down the factor that would ensure a trip. I found that nothing can ensure a trip, but there are some conditions that generally help. Don't expect too much. Smoke marijuana first. Use a screen. Keep the lighter on the salvia during the entire inhalation, and be ready to hand the pipe off to a friend.</p><p>My sixth experience with salvia was the most intense. We had smoked marijuana about half an hour beforehand and I was in the backseat of a car parked at a park, with two friends in the front. I do not understand why it was so powerful; I have smoked more 15x before with much less effects. I smoked it in a pipe with a screen, held it in, and was torn away from the world. I remember falling over, but after that was a strain of unconsciousness/hallucinations that lasted probably only a few seconds but I came out into consciousness like waking up. I then had about 5 minutes of strange reality changing hallucinations. The most vivid of which was that my senses were split into 2 sets by a plane that ran between the top of my tongue and the roof of my mouth. These two sets of perceptions were on the opposite ends of a flailing snake-like figure. The snake usually stays latched together like a belt, and when the senses are together like that we perceive it as normal reality. Salvia unlatched the belt and both ends went flailing into othermostly unintelligiblerealities. When the ends touched, I would be myself in reality with my mouth closed. If I opened my mouth to speak, the snake would unlatch again start to thrash around. I would just have to wait for the ends to touch and latch again. My friends voices sounded like they were trying to trick me into the loop and I saw that reality as a trap/prison. After coming back I was dazed, pretty uncomfortable, and tired for another hour.</p>",
 "year": "2005",
 "id": "43105",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-30T07:00:00.000Z",
 "views": "3922"
}
