{
 "title": "Physical Wellbeing = Crucial",
 "author": ": ) / ) :",
 "citation": " : ) / ) :. \"Physical Wellbeing = Crucial: experience with Mushrooms (ID 43154)\". Erowid.org. Sep 7, 2008. erowid.org/exp/43154",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2005",
   "43154",
   "Male",
   "",
   "Not Given",
   "Sep 7, 2008",
   "2622",
   " "
  ]
 ],
 "report": "<p>Me and a couple of my buddies decided one night this past February that we wanted to try out shrooms, as we all smoked pot regularly and had heard a lot of good things about mushrooms. While I have had several extremely positive experiences with mushrooms since this event, this particular evening turned out to be a nightmare I thought I would never wake up from. In hindsight, I should have never tripped that night as I was exhausted from not having any sleep in the past 48 hours, coupled with the fact that the previous day had been extremely exhausting and I had not eaten anything for approximately 10 hours. Before we ate the mushrooms, I was already feeling nauseous and had a splitting headache, but stupidly decided to eat them anyway. </p><p>So, we each ate an eighth of the shrooms at about 10 pm and waited for the magic to kick in. We figured that playing Halo would be a good way to kill the time. Because I had nothing in my stomach, the shrooms hit me extremely fast. Within 15 minutes the woodgrain on my closet door was warping and melting. I attempted to play the video game, but my eye hand coordination was completely out of whack. Every time I died in the game, I felt like I was dying in real life. After taking a particularly brutal shotgun blast to the face, I decided that I couldn't handle Halo anymore. I just sat for a few minutes watching my friends play the game, trying to enjoy what I was seeing, but the walls of the room felt like they were closing in and suffocating me. I told my friends that I needed to go out for a cigarette to try to cure my claustrophobia.</p><p>The 500 foot long hallway to the outside seemed to extend into infinity, and it seemed I would never get outdoors. We finally made it outside, and I felt as if the entire universe was caving in on me. Promptly after lighting my cigarette, I puked. My friends were getting pissed at me at this point for not being able to handle myself, which made me embarrassed and ashamed, furthering me into the bowels of Hell. My trip really took a turn for the worse, however, when I attempted to go to sleep, about two hours into my trip. Every time I closed my eyes I saw images of demons and ghosts. I began drifting into sleep, started to dream, and then woke up from the dream. My brain had no idea how to deal with this abrupt change from dreaming to waking and I felt that I was going insane and/or dying. This caused me to abruptly sit up in bed, wide eyed and drenched with sweat, about every 5 minutes or so.</p><p>My friends (obviously) noticed that I was not well. Since they were worried about me, they started talking, but made the mistake of whispering to each other to avoid freaking me out further. Seeing them whispering convinced me, beyond a shadow of a doubt, that they were conspiring to kill me and I had to do something about it. I leapt from my bed toward my two good friends, punching one of them squarely in the jaw before they wrestled me to the ground.</p><p>After this, I went back to bed, hoping to sleep without incident. This was, obviously, not the case. I began viciously gnashing my teeth, writhing, and talking to the demons in my head, in a tone of voice I have never heard come from my own body in a scene very similar to the movie 'The Exorcist.' One of my buddies said later that all he could think was 'That's not my friend in that bed.' I leapt at my friends on several more occasions that night, but with my sleep deprived state, the fact that I am a 135 pound Irishman and both of them weigh over 200 pounds, and that they were expecting it, they took me down very easily. After I threw my alarm clock across the room, my friends had the insight to take everything within my reach and hide it from me.</p><p>Finally, after about 4 hours of that nonsense, about 6 hours after eating the shrooms, I began to come down from my trip and mellowed out enough to be able to go to sleep.</p><p>I guess the whole point of this story is that physical wellness and mindset are just as important as set and setting. As I said previously, I had the nerve to attempt taking mushrooms again after this extremely unpleasant experience and have had several extremely positive experiences from it, so I am not just a 'tweaker.' I have no history of mental illness (before or after) and consider myself a productive, well-adjusted member of society. My dorm room was an excellent setting and theoretically should have given me a very good trip. Because of the haggard physical condition I was in prior to using this drug, however, I ended up having a very bad time and left my friends wondering whether or not I was mentally stable.</p>"
}
