{
 "title": "Crazy Nightmares and Sleep Paralysis",
 "author": "mextacy",
 "citation": " mextacy. \"Crazy Nightmares and Sleep Paralysis: experience with MDMA (Ecstasy) (ID 43168)\". Erowid.org. Aug 28, 2007. erowid.org/exp/43168",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "180 lb",
 "report": [
  "<p>I only have sleep paralysis after use of ecstasy. Its always the night after consuming mdma(ecstasy). It seems like every time it happens it always gets worse. Also the more ecstasy I have the more serverity of the sp. It has happend so much to me that I have acually gotten used to it.",
  "The first time I can recall it happend was about 4 years ago. I was lying down on the floor in, broad day like, with my face down. I could see out only the corners of my eyes and boom it happend. A monkey ran by my face evily snickering. I couldnt move. He ran by again. I tryed to scream and yell by I couldnt. The third time he ran by I noticed he was carrying a knife. At that point I was scared shitless. Then he ran behind me still evily laughing as if he was posessd by a demon. I heard and felt his foots go farther away then come closer as i felt the knife enter the back of my neck with a loud ringing noise in my ear. I was in so much pain and I still couldnt move then I snapped out of it and told all my friends my story they all laughed as if it was a joke.",
  "Ive had hundreds of similar experiences since then such as.... outer body experiences, being strangled, serveraly beaten, haveing my whole body crushed, visualizing crazy shit hapening as if I were in a stephen king movie, you name it... it has happend to me. It always happens right before I go to sleep so now whenever I know its going to happen I get some popcorn and enjoy the show lol (not really) I found that if i dont fight to get out of sleep paralysis it becomes more intense. Sometimes I try to see how much of the pain and suffering I can handle. like one time....",
  "It started off not bad at all there was a beautiful girl holding a stick (let me set the scene, I was barely awake in the dark lying on my friends couch) she was giggling and started softly taping on my head with the stick. At that point I was relaxed, couldnt move, but I didnt fight to get out of sp. I was trying to talk to the girl but I couldnt say anything. Then the tapping turned into thumping and the giggling turned to laughing. I still didnt try to fight an break free. I tryed to tell her to please stop and that shes so beautiful. Thats when the thumping turned into pounding and laughing turned into evil devilish laughs. At that point I was in so much pain from the pound that I had to try to break free, but I couldnt and the pounding got harder and the laughing got louder then finally I broke out of it and the pain was gone but the girl was still there just standing there I got up and turned on the light only to still see a faint outline of the girl standing there and then she was gone. That happend a couple months ago.",
  "I am almost fasinated yet frightend about these things that happen and I would like to hear other peoples storys</p>"
 ],
 "year": "2005",
 "id": "43168",
 "gender": "Male",
 "views": "10556",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "MDMA"
  }
 ],
 "submissionDate": "2007-08-28T07:00:00.000Z"
}
