{
 "title": "Visions of Life and Love",
 "author": "thayan",
 "citation": " thayan. \"Visions of Life and Love: experience with Prayer & Meditation (ID 43175)\". Erowid.org. Sep 19, 2006. erowid.org/exp/43175",
 "substance": "Prayer & Meditation",
 "bodyweight": "165 lb",
 "header": [],
 "report": "</p>I had been in a relationship with B since the previous october and it was around may. I had been going to a bible study with some friends since the begining of the previous year, and we would always sit in the same section of an auditorium of around 1000 people. There was always music and dancing and people with flags, people bowing in prayer and occasionally someone weeping off to the side in the moment of spiritual enlightenment.</p><p>The night started off as normal, I was quite the caffeine consumer, but occasionally I'd take a week or two off to stomp out the addiction, but chances are I was wired. Other than that I'd not previously taken any mind-altering drug.</p><p>I remember walking into the room before the music even started and my only desire at that time was to run to my habitual spot and lie prostrate.</p><p>I lay down with my head on the floor in deep prayer and I began to see visions more vivid than daydreams or mental pictures, but like I was watching a movie in my mind. I saw a phrase in Hebrew written on my wall at home ('B is given to you as a gift from God'). Then I saw B and she had 6 arms, all were chained to a rock by different shackels. I then saw a desperately swinging sharp flame. The flame blasted off all the chains, but left her naked and she started running in fear. She was given wings but they looked like they had been shaded in with pencil. The wings were taken away and purified by God, and the new ones were glowing white. She began flying toward a ceiling of cloud above her, but before she was able to reach it, lightening struck her into the ground. She flew up to through the first layer of cloud and after she emmerged, she was covered in a shell of sorts. The shell lifted her to a mountain that was covered with worshipers.</p><p>I asked God where I was in this vision. He showed me a seat above the second cloud. I started to see B as the vision started over again, and I tried to leave and help her, but the seat turned black and green and I saw the 6 chains binding myself as well. When I saw her being struck by the lightening I shrieked (in the vision) and clawed against the chains. When B finally rose above the clouds I found that I could move up, but not any other direction. I finally reached to a level where we could see the sun.</p><p>Over the 1.5 hours, I remember asking a lot of questions and trying to force the vision to take different turns instead of being humble and letting it teach me. As soon as I started trying to impose my will on it, the vision ended, and I awoke.</p><p>I spent the next couple weeks fasting and praying to learn what it meant. Since then I have continued to have these visions, they have become more intense and sometimes more a source of fear than enlightenment until I can meditate and pray on them and learn from them.</p><p>The most educational thing I've ever done is smoked Salvia, as its taught me much about these visions and the faculties of my mind and spirit. Other hallucinogens are in the works, but shrooms and all other legal mind affecting drugs (though I haven't tried ayahausca yet) have taught me little.</p>",
 "year": "2003",
 "id": "43175",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-09-19T07:00:00.000Z",
 "views": "5992"
}
