{
 "title": "Forbidden Fruit in the Garden of Eden",
 "author": "Sasha",
 "citation": " Sasha. \"Forbidden Fruit in the Garden of Eden: experience with Datura (ID 43172)\". Erowid.org. Dec 25, 2005. erowid.org/exp/43172",
 "substance": "Datura",
 "bodyweight": "208 lb",
 "report": "<p>I never was fond of any psychoactive found in nature. My drugs of choice were stimulants such as cocaine, ecstasy, some downers like ketamine, but most of all crystal methamphetamine which was for me the drug of all drugs.</p><p>Two years ago I was put in a 45 day rehab program due to abuse of crystal meth, known here in the Philippines as Shabu. The rehab was located in a retreat house for nuns and priests and had a beautiful garden which contained many plants, flowers, and fruits which the nuns took care of growing.</p><p>In the center of the garden was a plant that my fellow rehab mates called the Angels Trumpet. We were told that anybody caught eating the plant would get shut down and automatically start over the program from day 1. I knew that the plant was also known as Datura and was excited that waiting for me in the garden like some forbidden fruit in the garden of eden was a powerful hallucinogen. I loved hallucinating and would often have very vivid hallucinations due to prolonged sleep deprivation due to my methamphetamine habit.</p><p>Ever since I began my life as a part time psychonaut in 2001 I was always very careful to learn about what I put in my body. Every substance I tried I first researched in detail learning of dosage, timing, negative effects, basically everything there was to know of the drug before taking it. Since I was in rehab with no access to any websites, I had no way of knowing how much of the plant I had to consume or how to prepare it.</p><p>But there was no stopping me. I was determined to try it. When no one was in the garden I moved like a ninja to the plant, took one trumpet, rushed to my room and ate the whole thing. I then began the wait. At T+30 minutes I decided to do something crazy! I stole another trumpet and ate it. I figured I had ingested enough to get the job done. I didnt realize at the time that I had taken way too much and had guaranteed a fucked up experience!</p><p>At T+3 hours I started to feel woozy. Every movement began to feel heavy. My body felt glued to the sofa I was sitting in. I felt like I was magnetized to the soft pillows. I felt tired and sleepy. My speech began to slur and my vision became cloudy. My short term memory started to fail me and I had difficulty maintaining a conversation, I would forget what we were talking about. I felt like I was coming up though and was looking forward to my trip. Well thats about all the fun I had. Before I knew it it was the following day!</p><p>The worst part about it is that the next day my eyes were out of focus. I tried to read something and couldnt read it! I thought I was going blind. I didnt have any memory of the previous night it was all a blur. My rehab mates said I didnt eat dinner with them but wandered around the facility in the dark as if I was in orbit saying strange things. They started calling me by the nickname Orbit Boy. If I had hallucinated or seen anything interesting the night before I sure didnt remember it. It was as if a day was erased in my life.</p><p>My eyesight returned to normal 3 days later but in those 3 days I was pretty scared that I had damaged my eyes. I decided I would never try the trumpet again.</p><p>For those of you out there who plan to try datura, please research the dosage and preparation carefully so you dont end up a zombie like I did! And if you ever find yourself in a garden with forbidden fruit, think twice before picking that apple.</p>",
 "year": "2003",
 "id": "43172",
 "gender": "Male",
 "timestamp": "2005-12-25T08:00:00.000Z",
 "views": "59141",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 flowers",
   "administration": "oral",
   "substance": "Datura",
   "form": "(plant material)"
  }
 }
}
