{
 "title": "Living Reality and Being One with All",
 "author": "Roy",
 "citation": " Roy. \"Living Reality and Being One with All: experience with Mushrooms (ID 43174)\". Erowid.org. May 2, 2007. erowid.org/exp/43174",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "report": "<p>We started at the forest. We had an eighth each and my friend was already experienced with mushrooms. However, this was my first time and read about mushrooms for many months. I felt prepared and thought it wasnt going to be too intense, but I was wrong, this was going to be the day of my life. We walked along the dirt path, walking on the threshold of reality actually. Everything was perfect I remember. Everything seemed so happy. We arrived at our spot. I sat down in the ivy and my companion gave his headphones. The music was wonderful. I looked around the scene and the light was beating down on the glorious trees. The breeze picked up and the plants were laughing. They danced and laughed in the breeze and then I started to laugh with them. We got up and walked a little. I felt like running. I sprinted a few yards and stopped. I waited for about ten seconds, and then a rush of energy hit me from behind. I felt my soul come back into me.</p><p>We found a nice a sitting area on the creek bed, I gazed at all the things in and out of the creek. The water flowed so smoothly and the rocks colors were so vibrant. I closed my eyes and I saw a pattern of neon blue. These blue lines were moving and forming new patterns before my eyes. I opened my eyes and dipped my hand in the water. I felt like I was apart of the earth. I was in the water and felt life all around me. We were ready to keep moving.</p><p>I wanted to listen to my music, but my friend got a little odd. He felt that we had to listen to his headphones and listen to the same song. I didnt mind, so we listen to some crazy song that I dont remember. We found a more open spot on the creek bed. We were standing down there, feeling the medicine flow through us. There was an old log passing low over the creek. My friend attempted to go under it, but it scared him for some reason. I tried and I wasnt up for it myself. We stood around looking at everything, and loving everything. I finally gained the courage to go under the dark log. I was scared to do it and I did it anyway. It was like a right of passage. I felt like I faced all my fears and conquered them.</p><p>After a little while we decided to start walking down to the entrance. On our way down I saw a strange dog. It was small and really shaggy, if you know what I mean. As I stared at it, it started to grow longer and longer. It seemed like it was just floating around and was growing to at least five feet, to my eyes that is. We met my step dad, and he drove us home. He felt how happy we were.</p><p>The drive was the time when my peak began. I started to laugh for no particular reason and things started to move around in the car. I put on some of my music and everything was flying by us really fast. I stuck my head out the window and I had a huge rush. The wind was breezing through my hair really fast, and the wind rush boosted my energy. My step dad dropped us off in town and my friend and I walked to a meadow in the back of a church. We had some crackers, talked a little bit and my friend found that he left his skate at the forest. He was depressed for a while. And he talked about life and society. How people are fake and that we are all one. I was feeling like this myself but did not want to talk. He related everything about life to his skateboard, and he needed it. After a while I lied down in the grass and then my peak hit me.</p><p>The peak. I was twirling a long blade of grass in the air and it started to leave a trail. Five or six impressions of the grass were trailing behind it. I stared at the grass on the ground, and it was moving and growing. I stared up at the day light moon and I saw something very interesting. I whole bunch of thin rainbows were forming a tunnel to the moon. There was a rainbow tunnel to the moon, and I wanted to walk through it. I turned my head, and a cloud was growing bigger and bigger. Everything around me was growing. I then thought that time did not exist. I knew that everything happened at the present moment.</p><p>I was thinking about this for a while and then a plane flew overhead. I saw the sound waves it was giving off in the sky. They were huge ripples in the sky, and more and more started to appear. Then it felt like I was under water. I felt light and there were water ripples above me on the surface. I looked at the sunset and the rays were expanding out to the sky. The sun was huge. And I felt like I was apart of the sun. Then realized that I was one with the universe. I looked at the trees and looked at them like equal beings of this lifetime. I loved everything. I got up and ran to a tree. I jumped into it. I thought the tree pulled me into it because it happened so fast. I hugged the tree and felt its life and soul become one with mine. My friend wanted to go meet up with some friends so I thought why not. We left our area and I remember being sad that I was leaving the beautiful place that I just grew up in. I expanded my knowledge and appreciation for life in that meadow.</p><p>We met up some people and nothing really happened. I remember being pissed off about being with people. I wanted to be with mellow people who wanted to talk philosophy. I stayed anyway and just lived in the moment. I kept on saying in my head that this day was the day of life. I loved the world and the universe so much more. And I loved my family more than anything. I will eat sacred mushrooms again for sure, and will be ready to expand my mind even more. I feel now that we all make our own lives, and we are just living to be ourselves. What ever you do or whoever you are, your great. Anything is possible now, its up to you to believe it or not.</p><p>Nameste</p>",
 "year": "2005",
 "id": "43174",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-02T07:00:00.000Z",
 "views": "2734",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.6 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
