{
 "title": "For Excessive Sleepiness",
 "author": "deedee",
 "citation": " deedee. \"For Excessive Sleepiness: experience with Modafinil (Provigil) (ID 43200)\". Erowid.org. Sep 20, 2006. erowid.org/exp/43200",
 "substance": "Modafinil (Provigil)",
 "bodyweight": "",
 "report": "<p>I was prescribed modafinil (Provigil) as treatment for excessive daytime sleepiness, and started trying it out slowly with small doses, since I was unsure about the idea of taking a stimulant and sympathomimetic (I'm a cannabis and mushrooms type, not into speed).  First, let me explain that on a typical day for me, after a night of 8-9 hours of sleep, I am still completely exhausted.  I fall asleep frequently when I'm not deeply involved in what I'm doing, and I feel a constant tiredness - sleep always sounds like a good idea to me.  This is not totally disabling but it would be great to get through the day at work without nodding off.  So, I decided to give modafinil a try.</p><p>I started out with 100 mg, taken when I woke up in the morning.  I noticed effects within about 45 min.  First, the big positive: I felt totally alert and well-rested.  That might sound like no big deal, but I can't remember the last time I felt so good.  Not high at all, just awake, focused, and ready to get going with my day - no desire to crawl back into bed.  To me, this is amazing.  Now, the negative: inceased heart rate (usual resting pulse is around 65, this got me up to 86), some funky gastrointestinal movement (not painful, just sort of noticable extra moving around in the gut) and headache.  Headache isn't exactly the right word, it's more like an unpleasant tension around my temple and neck.  It's not painful or intolerable, but it's not normal and nice for me, either.  Also, this drug was a major appetite suppressant for me - I felt no interest in eating at all.  On balance, the positive outweighed the negative.  I did not take a second dose later in the day, and it did wear off.  By evening, I was back to my regular, super-tired self.</p><p>The next day, I took 100 mg in the morning, and it was not as good as day 1.  I felt less tired than usual, but not 100% awake.  I still had that 'sleep would feel great right now' feeling.  I took another 100 mg about 4 hours later, and had a glass of wine about 1 hour after that (I forgot that you're not suppose to drink on this stuff).  That was a bad idea - I got very, very buzzed on that one glass.  I will probably avoid this in the future unless I'm home and not going anywhere for a while.</p><p>After a few more days of trying out 100 mg twice daily, and getting mixed results, I took it up to 200 mg in the morning.  This was a very effective dose for me, giving me that fully awake and alert feeling with the usually minimal negative side-effects.</p><p>About 6 hours after the first 200 mg, I took another 100 mg.  I continued to feel awake and clear-headed for the rest of the day.  Interestingly, I felt compelled to focus on something at all times - I would casually start something and then get all into it and find that I spent way more time on it than I realized.  And if I didn't have something to focus on, I'd kind of jump around looking for something to grab my attention - I wasn't in the mood to sit and contemplate life, I needed something to do.</p><p>I often smoke some cannabis in the evenings, and I figured I'd see how that works while on modafinil.  I had my usual nice, stoned experience, and I've had the same several times since then; there appears to be no interaction one way or the other for me.</p><p>I have had essentially the same overall very positive experience with modafinil a number of times now taking 200 mg when I wake up in the morning and 100 mg about 5-6 hours later.  This has allowed me to stay awake, alert, focused and clear-headed, with no desire to sleep throughout most of the day and minimal negative side-effects.  I have never experienced any kind of euphoria, other than generally feeling great to be awake.  As helpful as it is, it's not a total cure for me; I do still sometimes experience extreme sleepiness and fall asleep during the day when taking this regimen. </p><p>I have not had trouble sleeping at night on days I've taken modafinil, but going to sleep is a different experience for me under those conditions.  Normally, I go to sleep when I am completely exhausted and cannot possibly stay awake a moment longer, and I fall asleep within minutes of my head hitting the pillow.  When I have taken modafinil, I do not reach that point of total exhaustion, so I have to just say to myself, 'It's time to go to bed now,' and go.  When I do get into bed, it takes me about 15 min to fall asleep (an estimation, obviously).  I wouldn't call that insomnia by any means, but it's unusually long for me so it would take some getting used to.</p><p>I have not decided yet whether I'm going to take modafinil every day or just use it when I have something absolutely critical going on.  My concern about taking something like this regularly is that we don't really know how this drug works and it hasn't been studied for decades to prove very long-term safety.  Whatever my decision in the end, I'm glad I have the option.</p>",
 "year": "2005",
 "id": "43200",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-09-20T07:00:00.000Z",
 "views": "13089",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 6:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  }
 }
}
