{
 "title": "Pushing the Boundaries of Existentialism...",
 "author": "Socrates",
 "citation": " Socrates. \"Pushing the Boundaries of Existentialism...: experience with Ecstasy & Ketamine (ID 4322)\". Erowid.org. Dec 24, 2001. erowid.org/exp/4322",
 "substance": "Ecstasy & Ketamine",
 "bodyweight": "",
 "report": "<p>Myself and some friends ended up waiting about 3 hours for a dealer, with the hope of picking up ecstacy and some hash. We got the e alright, but there was no marijuana of any form, so we decided to try some 'Special K'. All I had ever heard about it before was that you can take skin shots, but a friend who was with us said that it's easiest to snort. He tried to explain the effects as best he could, but it was over everybodys heads. He said it was like one part of your body was in one part of the room, while your arm was out the window, your leg under the bed and your head bursting through the roof. He explained writhing on the floor in fits of giggles with his accomplice on the bed screaming 'I'm an elephant!!!' This was too much for me; I had to try it.</p><p>After making our illicit rendez-vous with our supplier I immediately swallowed my pill, knowing it would take a while to kick in. I was heading to my friend Cian's house in the country. We had an hour bus journey ahead of us. There were four of us in total, myself, Fintino, Marc and Liz. 20 minutes later, I wasnt feeling much from the e, but I hoped it would kick in soon. Marc was trying to tell me how much he loved me, but at that time it meant nothing. Liz was asleep.</p><p>It took an hour in total till we arrived in Dunshaughlin (we're in Ireland here) and it must've been about 11pm.</p><p>I have a history of spontaneous nose-bleeds, and never having sniffed anything before, was a little apprehensive. Fintino cut up around 5 lines from the first half of the ketamine onto the glass from a picture frame. Our friend had said that it took about 20 seconds to kick in.</p><p>I was very strung out from the e, and didnt really know what was going on. It wasnt a pleasant experience, but there was nothing bad about it. My turn on the straw came around. I felt like an 80s movie star snorting up that white powder. There was no stinging and no real bad taste. instantly I felt a little 'stoned', and wasnt entirely aware of what was going on around me. I dont know if we took turns or if I just got a few hits, but the next thing I know Im sprawled on Cian's bed with one hand on the tray, picking up dust and sniffing it. I couldnt perceive sound. I felt like every second I was coming into existence, everything was new and strange. I couldnt focus properly and everything spun as if I was drunk. I wasnt aware that I had a body. I managed somehow to decide to stand up (at this stage I had no perception of reality), and what really shook me was how I basically fell off the bed and ended up standing up straight. I felt lighter than air. The bedroom was rather small. For a period of time (I dont know how long) I was standing there and the room seemed 2 feet cubed, then it seemed like it spanned the whole universe, then I felt like the universe was 2 inches cubed. I wasnt scared, just utterly bewildered.</p><p>I tried to turn around, and my foot caught on my coat which I'd strewn on the floor. I didnt realize this, and I ended up just spinning around mechanically, until someone (maybe Cian who I think was sober) restrained me. I began waving my arms around, amazed at how light they were. I turned and my eyes met Marc's, although everything was double vision, but I knew he felt the same as I did. I opened my mouth and just babbled gibberish. He started saying things like; 'no language... cant... make... words', the general gist of which was that he couldnt speak.</p><p>Cian was calling out to me for some reason. I was almost back in reality, that is I could hear what he was saying but it meant nothing.  Next I found myself walking down the hall towards the living room, but I was walking incredibly slowly and like a robot. This was the best I could do. Once I sat down in front of the TV I was aware of what was going on. I had forgotten about the ecstacy completely. I just felt very stoned, and my eyes were wide open. Cian put on an Eagles video, the track was Hotel California, a live performance which is one of the most beautiful pieces of music ever. On Ketamine it sounded like a bunch of bored chimpanzees banging rocks against logs. it was painful to watch. The music just sounded so disjointed and wrong. Next we watched the Matrix, which I remember little of. Then we went to bed.</p><p>Ketamine gave me a sense of realization about the universe. At the end of the day, we're all just collections of matter, a sequence of co-incidential chemical reactions. I've always wondered what it would be like to not be self-aware (not aware of your own existence), and my experience with Ketamine gave me an insight into this.</p><p>I later found out that ketamine will over-ride the effects of most other drugs. I had wasted 10 ($12) on an ecstacy tablet of the highest quality, and hadnt even begun to come up.</p>",
 "year": "1999",
 "id": "4322",
 "gender": "Male",
 "timestamp": "2001-12-24T08:00:00.000Z",
 "views": "14695",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": " T+ 1:00",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Ketamine"
  }
 ]
}
