{
 "id": 4329,
 "title": "Bizarre But Astounding",
 "date": {
  "submission": "2007-01-29T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Sirmailbox",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.2 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "I had been wanting to try Salvia for several months, and so I finally went ahead and ordered a gram of the 10x Salvia divinorum extract. It arrived in the mail a week later, and so that night my friends and I prepared for an intense trip. I was the first to try it. I inhaled deeply and quickly, just as I had been instructed to, and held the smoke for thirty seconds. I exhaled, and nothing happened. I felt strange, different in a way for which I have no words to describe, though I will attempt to later. My friend Colin was next. He was unsuccessful as well.",
  "Over the next forty-five minutes or so, we continued to smoke more and more Salvia. Normally we would have realized that this was not a good idea, but our thinking was very clouded. Eventually my friend Nathan gave it a try, and the intense trip to another world others have described occured for him. Disappointed and strangely very irritated, I went to sleep.",
  "The next morning, I tried just a moderate dose. The same thing happened as before, and so I put the salvia away and said I would wait until tomorrow. I had read that some people require several attempts before they develop a sensitivity to the drug, so I felt optimistic. When the next day came, I went into my room with my friend Brendan, loaded up a large dose (probably 1/20th of a gram) in my pipe and inhaled deeply. The same strange feeling as before came into me, but nothing seemed to be happening, so Brendan left the room.",
  "I noticed that I felt stranger than I did the other time with a considerably smaller dose, so I decided to try another 1/20th of a gram. Shortly after exhaling, the walls began to be colored by strange patterns, similar to those you might see if you press your hands against your eyes closed, and the bizarre Salvia feeling became considerably stronger. This feeling was unlike anything else I've experienced. The other psychedelics I have done are mushrooms and dxm, but this was completely different. This feeling was to tripping as tripping is to being.. drunk. It felt unbelievably real, crisp and lucid, but paradoxically confused.",
  "I began talking to myself, although I was sort of speaking to another entity or group of entities. I knew in my mind there wasn't anything else there, but I spoke anyway: 'Another hit.. right there..' I poured (very clumsily and haphazardly) the rest of the salvia (another 1/10th of a gram) into the bowl, feeling somewhat encouraged to do so by this entity which had the distinct feeling of being from a separate reality, or perhaps was a separate reality. Salvia's irritability kicked in when my lighter was getting a bit stuck. 'Fucking lighter!', I yelled. Finally it lit and I inhaled.",
  "After this, there are two or three minutes I can't remember. Brendan entered the room saying something to me about his dxm trip, and I began screaming at him, telling him he was insignificant and stupid, and that dxm is a terrible drug. He took this as a joke, though I was quite serious. I pushed him out of my room and closed the door, hoping to feel the full effects of salvia. Suddenly my phone rang, it was my friend Val, I don't know what he wanted but I sort of sang something like 'Not now Val, have to break through reality', and I hung up. Then I stood up and went outside where Brendan and my friend Thom were.",
  "I was mumbling something and announced that it was time for me to speak, though I don't think I knew what I was going to say. I felt like I had some important message from a non-reality. Then I leaned back until my head faced the ceiling and stared for a few moments until Thom asked me to sit down so I don't fall over. I said 'all right' and sat down. Then I tried to say something, I can't remember what, but couldn't formulate even the most rudimentary of verbal sounds. It came out as a frantic 'uhh, uhhh uhhh.' I laughed at myself hysterically and said something like 'I tried to say.. buhhh...' and slipped back into incoherence. Then I gave it one last shot and managed to say, 'I tried to explain what happened.. but I fucked up the explanation too!' or something similar.",
  "At this point my friends left to the kitchen, saying they were afraid of me, which I found ridiculous as I had no intention of hurting them. They later told me that when I came out of my room, I looked like a different person. Brendan said I looked like 'a retard,' and that I looked like I was going to kill someone, that I was possessed. Anyway, after this I began to come out of it, stood up, and went back into my room. I felt very hot and was sweating heavily. I took off my shirt and felt better. Then I walked back to the living room, mostly sober, and began to go over what had happened.",
  "I never traveled to a different world as many people do on Salvia, but I feel that what I experienced was very intense. Salvia did not feel anything like a drug. I felt no body effects (other than the sweating upon coming out of it), everything was completely mental. I felt as though I belonged to a different reality, and I had no way to censor my actions -- societal norms had no bearing on me. It was a bizarre combination of rage, possession and euphoria. Overall I enjoyed it, it was a positive experience but I can't see myself doing it again any time soon, and would not recommend it for everyone."
 ],
 "erowid": {
  "id": "28735",
  "citation": " Sirmailbox. \"Bizarre But Astounding: experience with Salvia divinorum (10x Extract) (ID 28735)\". Erowid.org. Jan 29, 2007. erowid.org/exp/28735",
  "substance": "Salvia divinorum (10x Extract)",
  "views": "2730"
 }
}
