{
 "title": "Too Much Is Never Enough Until You're Dead",
 "author": "Alias: AA",
 "citation": " Alias: AA. \"Too Much Is Never Enough Until You're Dead: experience with Alcohol (ID 4331)\". Erowid.org. Aug 9, 2001. erowid.org/exp/4331",
 "substance": "Alcohol",
 "bodyweight": "145 lb",
 "report": "<p>I am not a big fan of drugs. Am I curious? Of course. Would I try them? No. I have smoked pot. It's about everything I thought it would be. Nothing more, nothing less. And I'm done. I don't like drugs, but alcohol is a different story. I am not going to write about my first time getting drunk. Rather, I am writing about the worst alcoholic overdose a 2 1/2 year (recovered) alcoholic could be involved in without medical assistance or death.</p><p>It was a very boring day, very depressing, and I myself was very depressed. I was contemplating suicide, when a friend of mine asked if I wanted to get drunk at a party a friend of hers was having. I have heard about deaths related to alcoholic overdoses, and thought I might be able to pull it off. So I accepted the invitation.  I figured as long as there was enough hard liquor, I could waste my little body away without even realizing it. So my spirits rose.</p><p>When we arrived at the party, it was rather a little 'let's get drunk' get-together. After scanning the resources, there was almost all the hardest liquor a couple weeks' paychecks could buy. I went up to the counter and just began taking shot after shot of the hardest selected alcoholic beverages. I figured I'd get it done in the beginning so I wouldn't be 'aware' when I was dying.  I loaded myself with about 18-20 shots before someone told me to slow down. This was one of the last moments I remember. I told them I was fine, I can handle my alcohol well...I was fine. I went to pour a shot and I just spilled the alcohol all over the floor. They made me sit down. I sat down on the couch and we were all watching porn. I thought it was boring, and the very last thing I remember is getting up and crashing down on the carpet. The rest of the night I was out cold. And the night was long, and my unconsciousness was even longer.</p><p>The rest of these events have been vividly described and detailed by my very close friends who were there with me. I cannot recall endless hours of the night, I do not remember or recall any of the following, but out of the trust I share with my friends, these events seem plausible.</p><p>After I crashed to the floor, everyone freaked out. Nobody had drunk as much as I had. I got back up and decided to have more alcohol -- to them I had regained mental ability to make choices. They 'fed' me more shots (an estimated 10 more) one after the other until collapsing several times, they quit. I began crawling on the floor begging for more, and I was told that the shots there after were a mixture of soda pop and water, and I believed it. After this, and after they cut off all real and 'fake' alcohol, I completely lost it. I walked around for a little bit, until even that was a task I could not complete. I busted the kitchen table and dining room coffee table from passing out on them. I passed out several times into walls and woke up with very large 'bumps' on my head and bruises scattered over my body. I fell face first into a wall twice and broke up my lip real bad and busted my nose open (I'm thankful I didn't break it), and ended up with blood all over my clothing. During these events I was ranting and raving with very slurred speech that I wanted sex (which I would not say in a sober mindset), and began to talk like a person that was not me. I was told shortly after I started blurting out these things, a guy tried to convince another guy there to rape me, but with 2 of my friends threatening the hell out of him, he backed down. That alone is scary.</p><p>Soon after I lost speech, and the physical ability to move my own body. I would 'pass out' and throw up on myself, choking and suffocating on my own vomit. Nobody would help but my 2 closest friends there, and I am thankful that they were even there. I otherwise would have died. After I threw up several times everywhere I began convulsing. Everyone there was scared shitless and I even scared one guy into not drinking anymore, and one girl just sat and cried. My best friend thought I was going to die. Most everyone agreed to call the paramedics, but the guy renting that particular apartment wouldn't allow it because he was providing alcohol for several minors, including me.  I began to convulse uncontrollably. I also began foaming at the mouth I was so dehydrated. My lips were totally bitten up, along with my tongue because of the jaw-lock I experienced during the convulsions. I would not drink water; I would just spit it out. At this point I learned some of the people there didn't think I'd wake up in the morning.</p><p>Finally I was put in a room monitored by my best friend's boyfriend. I was stripped of all my vomit-covered clothing and continued to dry heave for an hour before I completely lost all mental AND physical abilities and blacked out. I know alcohol is a depressant, and it very well makes you tired in the end, but I wonder where the line was crossed and I was actually 'sleeping'. I woke up very early morning the next day. I woke up in a room I had never been in before. I grabbed the sheet and realized I was dressed in only a bra and underwear and I started crying. I did not know how I got there or why I woke up in that room. When I woke up, at first I did not have any usual groggy side effects. My throat was very sore, and I threw up bile twice that morning, and it felt like I completely burned my throat away, only this time making it to the toilet. I was ordered to take a shower, and so I did, almost passing out in the shower, but I was able to control it. I got out of the shower and lay on the couch while my bloodstained, vomit-covered clothes were being washed. At this point the side effects set in. Even the day after is still a blur to me... I remember lying on the couch and it felt like something was trying to rip my stomach and intestines out. Like somebody was taking a food beater and just beating the hell out of my insides. I remember hot flashes of pain pulsing through my body, my head was roaring, I felt like I could hear and feel my heart beat throughout my body, and at that point I begged for somebody to kill me. The effects last for days, with every day some awful random side effect that would take over my body...headaches, hot/cold flashes, or vomiting, etc. The most reasonable assumption was I had given myself alcohol poisoning, and escaped death by a hair.</p><p>This has taught me a lot.  I still drink, and no, I am not unintelligent for making that decision. I know my limit. I know how much I can drink before feeling any side effects. I no longer drink alone (a big bad habit of mine in the beginning) and I don't usually drink at social events with my peers when there is alcohol present. In fact, I rarely ever drink.  But the urge is always there. The urge is here now. It took a lot to stop drinking as much as I did. And now I can drink and still be 'sober' enough to always aware of my physical abilities and actions. This incident happened a year ago, and since then I have never lost the ability to use clear judgement from alcohol consumption.</p><p>Drinking can be fun at times, but drinking can turn deadly. I have witnessed this first hand. The safest way to drink is drink non-alcoholic beverages, but if you so choose to drink, know the consequences, and know you are not always in control of your actions. I used to be known as the drunk at parties. It lowers your self-esteem because people only see you for what you are when you are drunk. And you don't need a drink to 'be yourself' because having a drink only alters you. I cannot stop the world from engaging in harmful drinking...the only thing I can do is share my story, and hope that at least one person reads this and gains something out of it.</p>",
 "year": "1999",
 "id": "4331",
 "gender": "Female",
 "timestamp": "2001-08-09T07:00:00.000Z",
 "views": "18849",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 }
}
