{
 "title": "Buzzing, Engulfing",
 "author": "Zam",
 "citation": " Zam. \"Buzzing, Engulfing: experience with Nitrous Oxide, GHB & Cannabis (ID 4332)\". Erowid.org. Dec 20, 2000. erowid.org/exp/4332",
 "substance": "Nitrous Oxide, GHB & Cannabis",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 g",
   "oral",
   "GHB",
   "(liquid)",
   " T+ 34:50",
   "2 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 2:00",
   "2 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "report": "<p>This was my fourth time trying nitrous, I had a medium-strong GHB buzz, which was from about 3grams of GHB taken in water over a period of an hour.  At about T+2 hours from starting drinking the GHB, I smoked two medium sized hits of mid grade cannabis bud and lay on the bed with my partner.</p><p>My first experience with nitrous was a single cartridges and it wasn't very impressive.  My second time was a solid breath from a tank which was interesting, but still not much to talk about.  Mostly dulling.  The third time was two cartridges on top of a mild dose of LSD (a single blotter). This was the strongest of the previous experiences and mostly felt like being hit by a big wet mop all over.  I described it at the time as 'a strong body thud'.  It wasn't worth repeating.</p><p>This evening she started, taking her first try of nitrous, a single ISI cartridge in a balloon and then two catridges in a balloon.  Her reaction was interesting and so I decided to try two cartridges.  She described a 'thickness' over her skin and having her attention focused on a 'one inch deep layer all over her body'.</p><p>When I inhaled the nitrous, I was pretty swimmy in the effects of the GHB (mildly drunk with a strong spinny-vertiginous component and a sensual feeling) and had a very mild cannabis coloration on thought.</p><p>I inhaled as much as I could in one lungful and held it for 20 seconds or so.  About 10 seconds after inhalation, a strong buzzing began which was both auditory and 'physical'.  After about 20-30 seconds, I was in the peak of the effects.  It felt like I was being bathed in a medium-high-pitched buzzing noise strong enough to cause my skin to feel it.  The 'buzzing' cycled about twice a second and the overall tone and feeling was vaguely similar to the sound of blowing into a highspeed fan. </p><p>The sensation was quite strong and I tried to imagine it as pleasureable with some success.  Overall I felt disconnected and during the peak I was wondering if my partner was getting the same effects, even though I realized soon after the peak she certainly was not.  The buzzing abated slowly, but was noticeable for perhaps 15 minutes after inhalation.  The engulfing period was perhaps 2 minutes.  I found the feeling mildly concerning and not wholy desireable.</p><p>On my second try about 10 minutes later, I again took two catridges and held them and found the buzzing returned but was stronger than the first time.  As I sort of melted into the experience, the physical sensation of having my skin buzzing and the sound had a sort of ominous feeling of my peripheral nervous system short circuiting or sending aberrant signals.</p><p>I think the GHB may have affected the experience significantly. Combine that with the fact that I'm not particularly fond of nitrous chargers because of the waste and I'm not super excited to try it again immediately.  I find the aesthetic of having metal throwaways from taking short acting 'do a lot' chemicals to be pretty negative.  Although I would like to learn a little more about nitrous and its effects, I wonder how to fit the 'hippy crack' effect ('maybe just one more')  and the mega-garbage effect with some sense of</p><p>balance.</p>",
 "year": "2000",
 "id": "4332",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-12-20T08:00:00.000Z",
 "views": "21073",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 ]
}
