{
 "title": "Swallowing Reality",
 "author": "KRISTINEinRSM",
 "citation": " KRISTINEinRSM. \"Swallowing Reality: experience with Salvia divinorum (20x extract) (ID 43343)\". Erowid.org. Sep 8, 2008. erowid.org/exp/43343",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "175 lb",
 "report": "<p>About 4 days ago my friend Jason called, in a state of shock and confusion; telling me he had just done salvia and it was an experience I could never comprehend unless I tried it. Having done the x5 several times with no effects, I didn't think anything of it and laughed it off. Until yesterday, May 25, 2005; Jason calls me and says 'Come over, you have to try this, TRUST ME, it's nothing like what you had before'. I decided to humor him. It's never done anything in the past so I figured Ill do it and prove to him he's nuts.</p><p>I arrive at his house he prepares me to do it. He tells me to sit in the center of his bed. As I was sitting there I was still making comments to the effect that I think he's crazy; his reply being 'JUST WAIT, JUST WAIT', he was anxious to see me smoke this stuff. He handed me the bong and it was just as harsh as it has always been, to the point where I couldn't hold it in. So I immediately blew it out and started coughing. I immediately got a strange feeling that I was being pulled every which way but I was still all 'there'. I took another large bong hit blew it out and all of a sudden everything was connected to everything. Jason was connected to the desk. I was connected to the bed. I tried to disconnect myself from the bed but something was holding be back in all directions.</p><p>Reality began to be swallowed by nothingness. The world was closing in. My body was already gone although no pain was experienced. I kept repeating 'What's going on, what's going on'. Jason kept saying back to me 'Don't worry Kristine, it will be over in a minute'. Completely thinking that the universe was coming to an end by some strange event horizon, I thought my head was the only thing out of everything in reality with a comprehension of pain and he meant my head was about to be smashed into nothing along with everything else and it would only be a minute more until it was over with and everything was gone. How did he know what was happening and why was he so calm, I thought.</p><p>Then it began to slightly wear off. I had no idea I smoked the salvia. I thought that what just happened really did happen. Then the last time I asked 'What is going on' he looked into my eyes and answered me with 'You smoked salvia'. I have never been so relieved to be alive. I felt my hands, my face it was all still there. Nothing seemed to matter as much as it did before reality was almost swallowed. He told me that he had just spent the last 2 minutes wrestling me to calm down. I was swinging my legs and kicking; and had no idea I had done so. Under any drug I have never lost total control and reality like this.</p><p>I would never do salvia again. Although I am glad it did do it. It allowed me to think in ways I never knew the brain was capable of thinking. The experience I had was so beyond any comprehension I have ever had. I have done several hallucinogens before and they do not even scratch the surface of what salvia can do.</p>",
 "year": "2005",
 "id": "43343",
 "gender": "Female",
 "timestamp": "2008-09-08T07:00:00.000Z",
 "views": "2339",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
