{
 "title": "Tinglings",
 "author": "Shep Herold",
 "citation": " Shep Herold. \"Tinglings: experience with Salvia divinorum (10x extract) (ID 43362)\". Erowid.org. Sep 8, 2008. erowid.org/exp/43362",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "166 lb",
 "report": "<p>Approximately 10 seconds after exhaling:</p><p>Intense pressure and tinglingish pins and needles. A feel of mind-waviness as if Im floating on a sea. Intense tinglings, but pins-and needles style, sort of painful. All parts of the body pushed and pressured into one lying position. It seems like the position was chosen for me, without my consent. Its hard to move, but I don't try, don't want to. Crazy trip in my mind, while all the while this painful tingling is in my body--under the surface. Im suspicious that it is originating in my veins. A face in the yellow prayer flag, a 4-D tunnel made of text and cloth. No 'cosmic awareness' or 'realizations,' but attempts at them. Severe hallucinations. Were my eyes open? Half closed?</p><p>Still tingling painfully. I 'ask' the spirit of the leaves to change the painful under-the-surface tingling in my veins into a feeling of good, warmth. It works. My eyes are watering. Am I crying? That venal tingling swims in the shades of grey between painful and ecstatic. When my eyes are closed, I feel as if Im almost floating away from my body, almost, trying to, but not quite, because something in the back of my head tells me 'This can't be true. Your mind is still attached to my body.' Because of this, I beleive (realize?) that mind and body are not seperate: integrated, not detached.</p><p>But in my mind, I see (without seeing) my body as a tingling cluster of sensations inside a vast, vast darkness. An electric figure laying there in darkness--the electric lines outlining where I feel the tingling, the pins and needles. They are the only sense reference point, only touch is sending signals to my brain. Smell and taste and sound are have long peeled away into the fog--I don't even pay attention to them. Touch is the only bodily reference I have, the last desperate griphold of my _soma_ (body). if it wasn't there, if I learn to blot it out, I think my mind will be totally detached--no sensual input reference-point, simply inside its own world behind closed eyes, created with the help of this strange, strange plant.</p><p>I am off-balanced afterwards, wavy, as if on a boat. Unbalanced, flowy, loosing concentration on the scene, drifting away then snapping back in repeatedly: that type of swaying, you see? Yes, swaying, that's the word, swaying. All this exists in my mind, amazing, how!?</p><p>Above was written in about two minutes, fifteen minutes after taking hits. Below is a second experience quite the same as the first one.</p><p>Tightness, not tingling. But yes tingling. Tingling tightness, but constant, on the inside, under the surface of the skin. Tightness, and waves of feeling--totally absorbed by sense of touch, dominating everything else--imposing, unwanted white noise. But ecstatic feelings, fantastic floods of orgasmic feeling throughout the body. A gooey, inner creamy thickness inside, starting thighs, throat (at the chakras) and encasing whole body, cept pineal chakra (very center of my brain).</p><p>When the center is probed, ventured near, approached (experienced?), the orgasmic feelings intensify and flood throughout--but held back a little, as if there is a huge dam straining to hold back a flood of ..something... but letting some of it through. Only the first tricklings, though, there is _so_much_more_ to come, but lets not predict what will come, eh? Let it flow, experience the perfection of existance right now. It IS perfect...perfect...amazing...beautiful. BE the creator experiencing itself, that's what we are. The creator experiencing creation, tentacles of conciousness feeding back to the collective intelligent infinity through love and _energy_. Energy! The energy of life! Intelligence! I can feel The Energy flowing through my body, the different chakras.</p>",
 "year": "2005",
 "id": "43362",
 "gender": "Male",
 "timestamp": "2008-09-08T07:00:00.000Z",
 "views": "3014",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
