{
 "id": 4336,
 "title": "Helps Lucid Dreaming",
 "date": {
  "submission": "2003-11-28T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Bow Dean Mcnowski",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "DMT"
  }
 ],
 "report": [
  "I have never had the intention of having lucid dreams,  they started happening after experimenting with smoked DMT.  ",
  "During the DMT trance I like to try and see as much detail in the visions as I can,  watching the unfolding of patterns,  flowing colours, this sort of thing.    Then one night during sleep,  my dream state was flowing normally, for reasons unknown I knew I was dreaming all of a sudden.  All I could think of to do was to see what the material dreams where made of looked like.  So with no remorse I grab the head of a character in my dream,  an old man sitting at a table,  I focused all of my attention looking into his face,  trying to see in detail what his face was made of.  He gave me a look of compassion before his face turned into a fractal looking goo that kept morphing.  Upon seeing this I realized that this always moving dream substance was almost identical to the way DMT makes 3 dimensional matter look like.  In fact, at the moment I realized I was dreaming I experienced the same 'rush' that smoking DMT gives.",
  "Having the courage to enjoy DMT visuals gives me more strength in the dream world to hold it intact.  Once I can stablize the 'stuff' dreams are made of, its seems as thou I can experience whatever I can think of. I have found myself eating dream food and even tasting it. ",
  "One thing I did notice though, was that almost everytime I have a lucid dream, right before the transition from normal dreaming to lucid dreaming takes place,  somthing that seems impossible takes place in the normal dream that will make me question my reality.  Its almost as thou somthing is sent to wake me up inside the dream,  then the fun starts!  hope this helps somone!"
 ],
 "erowid": {
  "id": "28775",
  "citation": " Bow Dean Mcnowski. \"Helps Lucid Dreaming: experience with DMT (ID 28775)\". Erowid.org. Nov 28, 2003. erowid.org/exp/28775",
  "substance": "DMT",
  "views": "18739"
 }
}
