{
 "id": 4342,
 "title": "Not Bad, Not Amazing Either",
 "date": {
  "submission": "2006-07-27T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Facers and Tracers",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "22 mg",
   "administration": "oral",
   "substance": "4-HO-DiPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I had a very vague plan that I was going to be doing some sort of drug this evening, however I was not aware of what it was going to be. I took this substance with two other people at some point late at night. I consider myself to be partially experienced in psychedelic substances. I have done 5MeO-AMT , DPT, and LSD, on a few occasions.",
  "However, I was having trouble swallowing this capsule, so I just broke it open and ate the powder, which tasted absolutely terrible. Also, it was the first thing I had eaten in practically 6 hours. I started noticing effects probably about 20 or 30 minutes after ingestion. The first effect I noticed was the regular weird body feeling associated with psychedelics. Except it was different this time. Usually I think that the body feeling is very euphoric and nice feeling but with this drug it was very, very violent.",
  "I could not stop shaking no matter how hard I tried. Eventually I could not handle the room I was in because the other two people were laughing and blasting techno music. This was all too much on the senses, so I went into the bathroom with a portable CD player and some Pink Floyd. At this point, probably about 40 minutes after ingestion I felt extremely terrible nausea. This lasted for something like 10 minutes and then I was back to the ridiculously uncomfortable body feeling.",
  "After about an hour the visuals started coming. They were not too overwhelming. The typical patterning and shifting of things was occurring as well as some mellow closed-eye patterns, however, these visuals could be almost turned off if I wanted, which really wasn't that great because I enjoy the visual aspect of drugs a lot. For the next two hours I sat in the bathroom, in complete isolation, listening to music and watching things. One of the most disappointing things was the lack of creative thinking. I really enjoy the abstract through processes of things like DPT or LSD, but I did not get this on this drug.",
  "Eventually, I came out of the bathroom and began to interact with people. Apparently the other two individuals I was with were feeling extremely goofy and happy, which did not mix well with my mindset. After about 5 hours all signs of the drug were gone and I was left feeling hungry and tired and very lazy.",
  "Overall, it was not a terrible drug. People say it is relaxing, but I disagree. I think that the intense body feeling is quite terrible. However, I would probably do it again, but at a lower dose, maybe to reduce the body tremors more. This is also the only time I have ever been all to myself with under the influence of a psychedelic. I think that this substance cannot be compared with any other ones that I have done. It is in a category all by itself. Not particularly bad, and not amazingly great either."
 ],
 "erowid": {
  "id": "28801",
  "citation": " Facers and Tracers. \"Not Bad, Not Amazing Either: experience with 4-HO-DiPT (ID 28801)\". Erowid.org. Jul 27, 2006. erowid.org/exp/28801",
  "substance": "4-HO-DiPT",
  "views": "6464"
 }
}
