{
 "title": "Narcotic Dreams",
 "author": "buffaloo soldier",
 "citation": " buffaloo soldier. \"Narcotic Dreams: experience with Erythrina mulungu (ID 43433)\". Erowid.org. Jul 2, 2007. erowid.org/exp/43433",
 "substance": "Erythrina mulungu",
 "bodyweight": "70 kg",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Erythrina mulungu",
  "(tea)"
 ],
 "report": "<p>I like to experiment with plants every now and then. I was doing a little research on homeopathy (holistics) and decided to try 'mulungu' for its sedative properties (I suffer from insomnia).</p><p>So I got 3 leaves and a piece of bark of 'mulungu' from the garden, and headed into the kitchen. I washed then sliced the leaves so that the internals would be exposed (not sure if makes any difference though) and placed them in a pot with about 1 liter of water, along with the bark. I let it sit for 10 mins. Then put the pot on the stove (at med temp.). I let it boil (at low temp.) for about an hour. The water had aquired a green color.</p><p>There was a little less than a full cup left. I poured the liquid into a cup and expecting a terrible taste, closed my nose and gulped it down. No bad taste, not pleasent either. I felt a puckering sensation in my mouth.</p><p>I then went to watch some tv, not feeling anything yet. I'm not quite sure how long went by but before I knew it was knocked out. I entered dreamland, filled with comfort and ease (wish I could describe the dreams but an hour after I woke up I had forgotten most of my dreams, but I know they were very pleasent). about 8 hours later I woke up from dreamland. Feeling incredibly relaxed I stood up (whoa... not a good idea) and fell on my ass. I had no sense of balance whatsoever. So I sat back down on the couch and relaxed for a little bit more. about 30 minutes later I tried to stand up again. To my surprise I was absolutely 'normal', as if I had never tried the mulungu infusion, except for that warm, fuzzy, comfy sensation, which remained for 2 more days.</p><p>I really enjoyed my experience with this plant. I hope my experience will be of some use.</p>",
 "year": "2005",
 "id": "43433",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-02T07:00:00.000Z",
 "views": "14293",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Erythrina mulungu",
   "form": "(tea)"
  }
 }
}
