{
 "id": 4344,
 "title": "Speed Light",
 "date": {
  "submission": "2006-05-31T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "kjartanrockefot",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Piperazines - MeOPP",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I aquired 10g of 4-methoxyphenyl (meopp) from my chem supplier a while back, first time I tried it I didn't think much of it, did only 100mg with some 5-htp, felt a mild rush, somewhat like a single crappy E.",
  "I left the bag of 4-methoxy lying around for a few weeks before I started experimenting with it again. I was tired as hell and it was school, and I thought that I might as well do a rather big dose of 4-methoxy just to check it out again, if it'd fuck me all up, I'd leave school and go home (which I'd do anyways because I was so tired)",
  "After a 20 mins or so I started to feel a little nausea, not bad compared to the nausea I've felt on other drugs, but still uncomfortable. After 15 mins of nausea it started to disappear and I started to feel a little more awake and things seemed all more pleasant, just like on speed, but not as intense, also I felt some cold shiverings, very pleasant and some special intense sounds, like from cellphones etc. made me feel like getting a electric shock, it wasn't that unpleasant, actually it was quite interesting.",
  "I had no problem acting natural, also eating etc. was still no problem, experienced some problems eating related to dry mouth, but it was no problem, just drink something and it was no longer there.",
  "At the end of the day I felt the effects disappearing and when I came home I was tired and had no problems sleeping.",
  "Generally I think this is a nice substance, it doesn't produce much of any side effects or after effects (haven't experienced any after effects at all actually), and for those days I just gotta have something to make it through the day it's a better alternative to speed.",
  "-----------------------------------------------------------------------------------",
  "As I had quite a lot left I lent my bag to a friend who was quite drunk. He and another friend kept dropping ~300mg drops all the night, I believe they ended up doing as much as 2g each one night, they got quite weird, and spoke very weird, my friend which I gave the bag was always kinda disoriented and always asked where we were going and what we were gonna do all the time and when we got there he ended up locking himself on the toilet for an hour, only stating 'I'm okay, I'm having a good time, I'm okay, I'm okay' for a while until he finally came out. My other friend kept talking to himself all the time, I though for a while he was saying something to me, then he'd say, 'ah, nevermind, I was only talking to myself', he kept doing that all night, so I guess large doses of this substance might make you quite weird, but AFAIK they had no after effects and felt little to no discomfort..."
 ],
 "erowid": {
  "id": "28811",
  "citation": " kjartanrockefot. \"Speed Light: experience with Piperazines - MeOPP (ID 28811)\". Erowid.org. May 31, 2006. erowid.org/exp/28811",
  "substance": "Piperazines - MeOPP",
  "views": "11621"
 }
}
