{
 "title": "Coming Off is Bad",
 "author": "Jan",
 "citation": " Jan. \"Coming Off is Bad: experience with Paroxetine (Paxil) (ID 43463)\". Erowid.org. Mar 4, 2011. erowid.org/exp/43463",
 "substance": "Paroxetine (Paxil)",
 "bodyweight": "200 lb",
 "header": [
  "DOSE:",
  "20 mg",
  "oral",
  "Pharms - Paroxetine",
  "(daily)"
 ],
 "report": "<p>I was on Paxil for almost 2 years. Unlike some others, I had very few issues while I was on it. The timed-release capsules are definitely better than the regular dose. It releases slowly, and doesn't give me the ups-and-downs throughout the day.</p><p>Then I tried to get off of paxil. I tapered off, like I was supposed to, until I was on 10mg every day (down from 20mg). Then I tried to go to 10mg every other day, and started having the normal withdrawals that have been reported: dizziness, most of all.</p><p>I talked to my doctor, whom I respect very much, but I guess a guy can't know everything and has to rely on the marketing department of whoever produces Paxil. So he told me there wasn't much to be done and that I had to go cold-turkey, since I was already at the lowest dose (going to 5mg every day hadn't ocurred to me).</p><p>So I went cold-turkey, and it was the worst 10 days in a very long time. The dizziness was out of control. Since I don't own a car, and get around for the most part by motorcycle, I was effectively under house arrest. I could hear my eyes (some people say they hear whoosing in their head... I heard that, but only when I moved my eyes). I got extremely irritable, to the point of getting into huge fights over trivial stuff with my wife.</p><p>My doctor, on my second visit told me that he'd seen another patient shortly after seeing me the last time, who reported having tried to get off of paxil for *2 years*. So in hindsight I feel lucky, but will definitely try not to be on paxil ever again, if I can avoid it. Getting off of it is a bitch!</p>",
 "year": "2005",
 "id": "43463",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-03-04T08:00:00.000Z",
 "views": "4735",
 "dose": {}
}
