{
 "title": "Their Vibes",
 "author": "Adam",
 "citation": " Adam. \"Their Vibes: experience with Mushrooms (ID 43476)\". Erowid.org. Sep 8, 2008. erowid.org/exp/43476",
 "substance": "Mushrooms",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "2.5 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>Hi, my names Adam, and it was last summer when I decided to engage in eating 2.5 of the 7 grams of mushrooms I had purchased from a dealer whom I know very well.  After about two days of the shrooms just lying in my room I got impatient and decided to eat some.</p><p>Now I've done shrooms about 5 times prior, but this experience would be different.  How?  I was going to trip at work.  I was a life guard at this pretty big swim club down the street from my house.  Im not quite sure why I wanted to trip while making sure people don't drown, but like I said I was getting impatient and wanted to trip really bad.  So, at about 8 oclock I got to work and went straight to the concession stand to steal an orange juice.  It was a beautiful day, a nice breeze.  The swim club is outdoors and theres a supermarket and a forest surrounding it.  Three lifeguards work there at a time, so it was me, this goofy kid who doesnt get out of his house much named Charles whose my age; 17, and the third guard was this fat chick who is also my age.  The manager wasn't there that day, which was one of the reasons I decided to work up enough balls to do it because he is a real dickhead, and I'm talking a genuine dickhead. The pool opens at about 9 oclock, so I ate the shrooms at about 8:30 alone in the bathroom stall and before I knew it people started arriving and it was time for me to take the lifeguard stand.</p><p>For an hour absolutely nothing happened which was weird because the past five times Ive used shrooms the effects onset in the first thirty minutes after eating them.  I was getting pretty pissed off they werent working.  I started thinking to myself maybe I didnt eat enough shrooms, but then I remembered I ate like five small caps and a couple of stems, and I had eaten a big breakfast so maybe they were just taking a little while.  You might think I'm crazy wanting to trip while lifeguarding but honestly think about this; I hate the job, I mean everybody thinks its so great being out in the sun all day, but its boring as hell, I have to socialize with old geezers and their old fucking wives who are always hitting on me and I get sunburned like a motherfucker. Plus, nobody actually drowns.</p><p>Then, after approximately 1 hour and ten minutes I felt it.  I was sitting in the stand looking and watching the kids and teens swimming and I noticed that this little boy's bathing suit started to become a more vibrant orange than what it was two seconds ago.  I smiled, the effects were starting.  Right after I noticed the bathing suit color, every thing took a brighter shade, and colors just looked all that more appealing.  Then I started getting a body high.  It was a tingly feeling that started in my toes and slowly after about a thirty minute duration reached the top of my head.  It felt pretty damn good.  My attention drifted away from the kids in the pool and towards the nearby forest.  The breeze was pretty strong and it was blowing the leaves and branches causing them to sway.  This was really cool because it looked like the trees were waving at me.  It was like the trees knew I was on shrooms.  This made me giggle my ass off, it was such a funny feeling I was tripping at work as a LIFEGUARD.</p><p>O but my friends, the shit got intense.  About thirty minutes after the tingly feeling reached the top of my head some effects hit me that never happened to me prior before this trip.  This was in fact the most shrooms I had ever ate.  The pool water looked really cool, just the texture of it was amazing. When I looked at the water this one kid splashed on the cement it started to move and become wavy. Think of squeezing a pillow very slowly in and out and thats what the water was doing. After another ten minutes or so peoples faces started to do the same thing.  Their faces were being distorted and becoming wavy.</p><p>I was still completely conscious and everything, I was keeping track of the time and could still see and shit. But shit started to get even more intense.  The fat chick life guard who I work with came to get me off the stand for my thirty minute break and I had a really hard time climbing down the stand, but I managed it and said thanks to the fat girl, and started to walk towards the bath room.  Walking was hard.  Everything I did I knew it was off key, like I was walking weird, talking weird, looking at people weird.  I was almost to the bathroom so I could take a shower to get all the sweat off of me from being in the sun and this guy name John walked up to me who talks way too fucking much.  So I was like o great.</p><p>He started talking to me about school starting and how I was going to be a senior.  I was having such a hard time talking to this guy.  It was almost like I was drunk and slurring but not quite.  I had trouble spitting out the first word of every sentence I said, but once I got out the first word everything was normal.  I knew this guy was noticing this so I told him I had the flu and wasnt feeling good and was really hot and had to get a shower.  But instead of leaving me alone he followed me to the shower. Once I was able to stumble into the bathroom I couldnt understand a word he was saying because the bathroom echoes, so I was just nodding and saying yea to what ever he said.  I got in the shower and it felt so good being in shower.  The water was just such a great refreshing feeling.  The only problem was John was still talking to me and I couldnt understand him at all.  There I was tripping hard 30 minutes away from peeking, everything was wavy, sounds were echoing, water was spraying full blast and this kid John was talking to me about some stupid bullshit I couldnt audibly comprehend.</p><p>Then something funny happened.  While I was in my bathing suit showering I was just looking away from John,  watching the water hit the ground, and he said something really loud so I looked at him fast as shit, I turned my head so fast and looked directly at him right in the eye.  I know he thought 'What the fuck'.  I know it doesnt sound that funny but it was, b/c right after I did it he walked away. A couple days later when I talked to him again he was completely unaware I was high that day.  I looked in the mirror in the bathroom and my pupils were taking up my entire eye and my face was doing the wavy distorting thing.  My face was changing in structure like you can mold play dough.  I remember laughing and just saying to my self holy shit.</p><p>I walked or tried walking rather to the front hut (its this thing where people sign in before they enter the club).  But on the way there though I started looking at people and I know it sounds weird but I was getting their vibes.  Let me explain, this girl walked up to me named Jaime who I had had sex with the weekend before.  She started talking to me and I could tell just by the way she was looking at me that she was upset I didnt want to date her. I could tell she had this longing for finding love.  After I finished talking with her, Charles the other lifeguard walked up to me and I could also pick up his vibe too, when he talked to me I could tell all he wanted was for people to like him and not think he was different. Jaime and Charles did not hint in any way at these things I picked up on, I could just tell, I swear to you.  I did that the whole rest of the afternoon, just talked with people and picked up on what their mindsets and vibes were.</p><p>The most intense part of the trip was when I reached the hut though.  I managed to make it haha.  I sat in a chair and put my sunglasses on and when I did this my visuals got insane.  I was lookin at the roof of the hut and all these fucking colors were swirling and doing this wavy motion.  It was like looking through a kalidoscope.  I swear for about 30 seconds I lost touch with reality.  That part was my peak and after about an hour I was almost sober and I clocked out and just chilled so I could come down completely before I drove. </p><p>Overall, it was a positive experience.  That thing with the vibes was really insightful.  But, some things did piss me off, like I kept telling myself how I don't tell my parents I love them enough and dont spend enough time with them and how I shouldn't smoke cigarettes, just stuff that can get on my nerves and doesnt lay right on my conscience.</p>",
 "year": "2004",
 "id": "43476",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-08T07:00:00.000Z",
 "views": "2942",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
