{
 "title": "Great Therapeutic Benefits",
 "author": "Nicolai",
 "citation": " Nicolai. \"Great Therapeutic Benefits: experience with Bupropion & Sertraline (ID 43484)\". Erowid.org. Mar 26, 2007. erowid.org/exp/43484",
 "substance": "Bupropion & Sertraline",
 "bodyweight": "",
 "report": "<p>Depression runs in my family.  I myself have experienced it to some degree in the past but mostly never had any real problems until I gratuated college and remained in a sort of limbo for two years with not much to do until I entered grad school.  Beginning grad school was quite a tramatic experience, with the high stress of competetion, dpeartment politics, and intense scrutiny from my advisors.  I fell into a profund depression remaining functional on the outside but experiencing horrible feelings of anxiety, social self-consciousness, slow thought processing, zero creativity, negative thoughts, an ever so slight and constant disociative feeling, and generally feeling like I was inside Sylvia Plath's  'Bell jar'.  Everyday I was seriously considering dropping out of grad school or worse.</p><p>I already took Ritalin for ADHD diagnosed when I was in the first grade and now I was using it to treat my depression by taking large amounts at a time (30-40 mg).  This approach was unsuccessful I might add leaving me feeling emptier than ever after about a two hour 'high'.</p><p>I was very wary of trying anything else in the prescription market because my father has a huge prescription drug addiction he has never come to terms with.  I have always had ambivalent feelings about taking Ritalin even though when I take it moderately and only for the things I have most difficulty focusing on, it works great.</p><p>So, it was with some reluctance that I made myself go to the psychiatrist for help.  I suggested Wellbutrin because of its stimulant like effects (I'm very sensitive to anything that makes me drowsy) and started out on 100 mg 2x/day, sustained release tabs.  I had tried Wellbutrin before but got a rash. My last resort, I was willing to try it again.  Almost imediately I began to feel better.</p><p>My general characterization of its effects are that it puts a kind of itch in your soul so that you don't like to sit still doing nothing for very long.  Your focus is improved and sustained throughout the day though not nearly as sharply as with Ritalin.  It tends to make conversation, especially of the mundane, everyday sort of routine socializing that goes on at the workplace seem bearable and enjoyable even.  This was great because now I was able to start functioning again.  I was coming out of the fog.</p><p>But still, I felt depressed and awkward in my place at school.  Unsure of myself and terrified, petrified at social events and places where I might have to speak in front of an audience, even though I have never been a 'shy' person.  I had an intuition that maybe something still was not quite right so I suggested to my doctor an SSRI that helps with social anxiety: Zoloft, and she agreed.</p><p>I had never tried Zoloft before and was weary because of its potential to cause grogginess or drowsiness and slow thoughts or blurr focus but curious to find out if those effects might be counterbalanced with something like Wellbutrin.  Slowly I built up the dose to a low 75 mg.  The noticeable side effects became bearable and counterbalanced by the Wellbutrin drive to stay busy.  Also, I noticed a marked improvement in my social abilities within my activities in grad school.</p><p>I started making more friends, going to professor/student parties and participating in class discussion more.  One of my most proud acchievements has been overcoming some of my fears of public speaking to become a teaching assistant and even give an hour long lecture in front of 150 students.  I still take Ritalin but only on an as needed basis and in about 3x less the frequency and dosage that I used to take it.  My social horizons are expending and my progress in school improving.</p><p>For some, these drugs won't work but for me and for now they are allowing me to vastly improve my life.  These medications have given me a thicker skin and higher tolerance for social pain which is needed to climb out of the hole depression dug me into.  It's been 8 months now and the side effects are not very noticeable.  Occasionally Wellbutrin can get me into a hypo-manic-like state which is why I stay at 250 mg per day instead of the normal 300 mg.  Zoloft also helps to take this edge off.</p>",
 "year": "2005",
 "id": "43484",
 "timestamp": "2007-03-26T07:00:00.000Z",
 "views": "30226",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  },
  {
   "time": "",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  }
 ]
}
