{
 "title": "Touched by Death",
 "author": "buffalo soldier",
 "citation": " buffalo soldier. \"Touched by Death: experience with Belladonna, Cannabis & Datura (ID 43496)\". Erowid.org. Jul 13, 2005. erowid.org/exp/43496",
 "substance": "Belladonna, Cannabis & Datura",
 "bodyweight": "75 kg",
 "report": "<p>I recently had an experience with belladonna, which didn't quite reach the delirium point. The trip was nice but I wanted to lose it, so I grabbed 6 atropa belladonna leaves and boiled them down in 2 liters of water until all that was left was 10 ml of pure dark extract. I was aware of all the dangers of taking this extract, but I set my mind to try it and lose myself completely.</p><p>So I asked a couple of friends to join me. They hopped into the car and we left for the mountains (where not a soul was in sight). We smoked a couple J's and laughed for a while, and then I decided it was time. I grabbed the bottle and shook it to get all the white stuff that settled at the bottom to mix in well. I took a deep breath, put happy thoughts in my head and poured about 5 ml into a glass of water. I stared at the glass for a while. There was something about that reddish/darkish liquid that scared the living shit out of me, but also persuaded me to drink it. Well I finally got the nerve and swallowed it at once. Here is where it all begins.</p><p>40 mins. had gone by and nothing was happening, nothing other than the marijuana effects. I thought to myself 'well I'll make a joint' so I did, but added some magic powder to it (about 10 datura stramonium seeds) to give life a few more colors, I would soon discover I had prepared myself a lethal cocktail of drugs. I am not sure how long went by, but I started feeling different. My vision became considerably disturbed (cycloplegia), I felt like I was expanding (weird sensation) and my toes began to feel numb. So far everything was quite pleasent.</p><p>Maybe 10 mins went by, and things started to get really fuc*** up. I saw thousands of tiny dwarfs running around the sky, dissapearing which dissapeared in invisible doors. After tripping out with the dwarfs things started to get out of hand. I could no longer control my vision at all, and would find myself slipping in and out of different worlds and time frames. I was starting to feel really anxious and confused. My friends got scared and decided it was time to be heading back. Unable to drive I gave the keys to one of my friends.</p><p>Once on the road the effects seemed to be dissipating, but 15 more minutes would prove me completely wrong. I began to feel deliriant and heavily confused, and asked my friends to stop for a little bit. I felt nauseous and tried to throw up, nothing would come out (I had fasted fo 2 days before the experience). I felt really dizzy, the ground looked like it was coming up and about to hit my face. I couldn't stand up any longer so I lay down on the seat. My friends asked me if I was ok, I answered NO. 'Do you want to go to a hospital,' and stubbornly answered no. They decided to keep heading down just in case. A few kilometers down the road I said to them, 'I think I took too much.' The nausea was just killing me. I stuck my fingers all the way down my throat and finally got something to come out.</p><p>Things got really unpleasent, all my happy thoughts were gone and dark negative feelings started to take over. My friends tried to help me forget about those nasty thoughts but it all rendered useless. I started to feel my heart beat rising very rapidly. Then it became alot harder to breathe, I started to panic (very bad idea) and breathing became close to impossible. Confusion took over my brain, thoughts of death were lurking in front of me, then came the suicidal thoughts. I was feeling so bad and out of control that I wanted to kill myself and just end with the misery I was in.</p><p>I said, very frantically, 'I am going to die.' Thats all I remember 'till we reached the clinic. I then recovered consciousness in the emergency room. I opened my eyes and saw blurry shadows (doctor's and nurses) all around me. I fought them off for a bit, and fell back into a trance. I started to see dead people and talking to people the doctor's could not see. A very beautiful female sillouhette reached out her hand and I took it. We began to fly through the underworld. I heard voices that screamed 'HELLLP'. There were special doors to enter a new level in the underground, each one revealing a more disturbing place. It was like going through Dante's Inferno. We finally reached what looked like firm dark 'air' or something like that and stood there. I looked around and saw demonic creatures everywhere. I felt shivers and realized where I was. I had been lured into hell. I can't really remember anything else.</p><p>Next thing I remember was waking up wanting to piss real badly. I stood up and felt an excrutiating pain in my arm. I pulled out the I.V. in my arm (which I wasn't aware I had till then). I was still very confused but was glad the nightmare was over.</p><p>Anyone who wants to try this psychoactive must be well aware of the dangers. A PERSON COULD DIE if you don't treat this drug with the respect it deserves. One must also have a very strong and balanced psyche if one intends to go through the trip without losing their head or dying. Panicking is the worst thing to do if one begins to feel lost, I know its easier said then done. I almost died my friends, I was touched by death and atropos (one of the 3 FATES of greek mythology, her task: cut the thread of life/atropa is derived from atropos) spared my life. I was scared shitless by this experience and will not attempt it any time soon.</p>",
 "year": "2005",
 "id": "43496",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-13T07:00:00.000Z",
 "views": "29520",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "6 leaves",
   "administration": "oral",
   "substance": "Belladonna",
   "form": "(extract)"
  },
  "2": {
   "time": " T+ 0:40",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": " T+ 0:40",
   "amount": "10 ",
   "administration": "smoked",
   "substance": "Datura",
   "form": "(seeds)"
  }
 }
}
