{
 "id": 435,
 "title": "My Dosages for Pain",
 "date": {
  "submission": "2004-02-26T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Chuck Palmer",
  "gender": "Male",
  "weight": 98
 },
 "dose": [
  {
   "time": "0",
   "administration": "transdermal",
   "substance": "Pharms - Fentanyl",
   "form": "patch"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Morphine",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "First I would like to express my thanks for a variety of information and opinions about psychoactive substances. This is the one page that I would donate money to if my expenses allowed. Unfortunately I get by on SSD and don't usually have much money to spend. However, I do have knowledge. So, I wanted to add to the vault in the area of opiates.",
  "Fentanyl is now availabe in transdermal patches for chronic pain relief. I know this because I use them. They come in dosages from 25mcg/hr to 100 or more mcgs/hr. For many with chronic pain they are a blessing. I get a controlled dosage around the clock from a patch that only needs to be changed every 72 hours. This both keeps pain in better check (or at least has been my experience) without having to worry about taking too much or too little. Also, when you have to keep track of as many pills and interactions as I do, the less pills you take the more likely you are to be compliant. This is a reason why most AIDS medications have by now been formulated so that the most you have to do is take two doses a day. The less trouble, the greater the compliance rate. Also, I use morpine sulfate for breakthrough pain and I take far greater doses than what is described in the Opiates FAQ. While I wouldn't advise this for 'newbies' it is true that the more pain one is in, the higher the dose of opiates the body will tolerate.",
  "I sometimes take up to 180mg's of Morphine Sulfate in addition to my patch with no more negative side effect than a little constipation, which while often unpleasant does not usually constitute a life threatening situation. Once again I would also say that until you are very aware of your own limits proceed with extreme caution. Finally if you can tolerate the taste the quickest way, besides insufulation (snorting) or intervenus or sub Q (below the skin) injections, to ingest most narcotic substances is by disolving it under the tongue (sublingal dosing). It often cuts the amount of time between ingestion of a substance to reacting to it in half if not by 2/3's. In this manner I can often get the most bang for your buck so to speak.",
  "Finally, my one question is what substances retain a fair amount of their phychoactive properties when ingested with opiates. I know that LSD's effects are greatly diminished by opiates (I've tried) but I am still interested in having the occasional psychodelic experience."
 ],
 "erowid": {
  "id": "10801",
  "citation": " Chuck Palmer. \"My Dosages for Pain: experience with Fentanyl & Morphine (ID 10801)\". Erowid.org. Feb 26, 2004. erowid.org/exp/10801",
  "substance": "Fentanyl & Morphine",
  "views": "30031"
 }
}
