{
 "id": 4351,
 "title": "Heavenly Bliss",
 "date": {
  "submission": "2001-11-30T08:00:00.000Z",
  "experience": "1995-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "U of T Tripper",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "ug",
    "quantity": "150"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "It was the New Year's celebration of 1995, and I found myself at my first rave, with my first hit of acid in my hand.  It was an experience that was long overdue, and one which I highly looked forward to.  I consulted just about every friend I knew who tried that wonderful drug which I was holding onto with immense anticipation.  I knew all about the LSD experience, for preparation was my safety harness against bad trips.  Finally, as I put the tiny white paper in my mouth, my stomach quenched with nervousness and fear.",
  "'Was I really prepared to experience this?' I thought.  But as the wonderful sounds of Trance filled my ears with bliss, the fear quickly diminished.",
  "After about 45 minutes I was thinking to myself, either one of my best friends ripped me off, or I must be immune to this compound.  Then, in that very second, fantasy merged with reality, as a cartoon train literally came out of one of the television sets which I was viewing.  It circled the room and returned back to the world it came from.  From that moment, everything around me was surreal.  Colors were so intense that I was in awe of how limiting visual perception is in our everyday lives.  Music acquired a life of its own, and it was a part of me.  People around me became fellow explorers in a quest to reach ultimate bliss and fulfillment.  Life was so full and wonderful at that moment, that my only wish was immortality in this beautiful state.",
  "The trip was a wonderful journey, one which had an immense impact on my life.  Since being introduced to this divine world, my outlook on life changed.  Beauty of everyday life made its presence know to me long after the trip was over.  I learned to see the extraordinary in the ordinary.  In other words, LSD was my window to a heavenly bliss, which in many forms persisted and embodied itself in life as I know it."
 ],
 "erowid": {
  "id": "2885",
  "citation": " U of T Tripper. \"Heavenly Bliss: experience with LSD (ID 2885)\". Erowid.org. Nov 30, 2001. erowid.org/exp/2885",
  "substance": "LSD",
  "views": "8176"
 }
}
