{
 "title": "Nick, Remember the Trees?",
 "author": "alex a.",
 "citation": " alex a.. \"Nick, Remember the Trees?: experience with Wormwood & Alcohol (ID 43519)\". Erowid.org. Sep 23, 2005. erowid.org/exp/43519",
 "substance": "Wormwood & Alcohol",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "7 glasses",
   "oral",
   "Alcohol",
   "",
   "",
   " ",
   "",
   "Wormwood",
   "(extract)",
   "",
   "1 ",
   "smoked",
   "Tobacco - Cigarettes",
   ""
  ]
 ],
 "report": "<p>This experience was VERY similar to Absinthe, which I drank in Edinburgh, Scotland two years ago.  I had found a recipe online for a vermouth recipe.  Vermouth is commonly used in Manhattens and Martinis.  It is a fortified aperitif wine.  The trick is to soak herbs in a standard wine and to add some higher-proof alcohol to the wine.</p><p>I bought a bottle of 2-buck chuck Chardonnay and started adding some herbs.  I found that it is easier to add liquid herbal extracts instead of straining the mix.  I added about 3 medicine droppers full of liquid wormwood Artemisia Absinthium, 3 medicine droppers full of liquid wormwood Artemisia annuam, 3 dashes of bitter orange extract, 3 dashes of fee brothers old-fashioned bitters (Contains Gentian root, cloves, cinnamon, and other flavours), and some cloves and sage, which I later filtered.  I then added about 4 ounces of Black rum to fortify the mixture.  I let this sit for a couple weeks, then I strained it.</p><p>The point of this long process was to mask the normally wretched flavour of the wormwood.  It worked.  I ended up with a sweet, pleasant, white wine vermouth.</p><p>I proceeded to drink about seven manhattens on the rocks.  I mixed them about half and half using my new vermouth and Kentucky Tavern Bourbon.  I went outside for a cigarette and realized the trees were moving without wind.  I decided in that moment that I was VERY glad to be alive.  The sounds of the birds were intoxicating.  I went back inside, and I closed my eyes.  I found the sound of the television to be so artificial and scripted.  It sounded inorganic and manufactured.  I decided to listen to some Cocteau Twins and shut the lights off.  The music was so clear and so beautiful. </p><p>I don't want my description to sound too euphoric, but I was experiencing the transcending effects of about 14 drinks without losing any control of thoughts or motor skills.  It was literally hapiness in a bottle, and I couldn't taste the wormwood.  I also woke with little or no hangover effects.</p>",
 "year": "2005",
 "id": "43519",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-09-23T07:00:00.000Z",
 "views": "12320"
}
