{
 "title": "Very Comfortable Experience",
 "author": "Jack the Tripper",
 "citation": " Jack the Tripper. \"Very Comfortable Experience: experience with 2C-I (ID 43526)\". Erowid.org. Jan 13, 2009. erowid.org/exp/43526",
 "substance": "2C-I",
 "bodyweight": "165 lb",
 "report": "<p>After having magic mushrooms about 8 or 9 times over the course of the year and even upping the dosage siginificantly, my friends and I wanted to try a new form of hallucinogen.  We really were interested in trying LSD, but we quickly found out that LSD was not easy to come by.  Instead, we were offered 30 milligrams of a new drug I had never heard of before called 2C-I.  Quickly my friends and I researched online, as we usually do for pretty much any drug inqueries we have, and read up all we could find on this drug.  When we found out that 30 mg each was a heavy enough dose and that the drug was suggested to be a mixture of the effects of LSD and Ecstasy, my friends and I decided to give it a try.</p><p>My friend returned to our room with the drugs, which were in 4 individual baggies.  The interesting thing was that the drug was in a crystalized form on each of the sides on the inside of the plastic bag.  It was not like a powder, per say, where it just sat at the bottom of the bag, but instead was crystalized on the sides.  My friends and I proceeded to carefully tear open our bags and lick up all of the bags contents until we were sure we got it all.  It was about 5 o'clock pm at this point.</p><p>We then went into our living room to watch tv and await the effects.  Probably 20 minutes later I know I began to feel the effects.  First the ground began to twirl and spiral.  Then it felt very overwhelming when more and more people came into the room, as if I could clearly hear all of the conversations that were taking place.  When this became too overwhelming, I went into one of the bedrooms in our place, which 2 of my other friends on the drug followed me, and we laid on the beds and on the floor in the room and turned on some music. </p><p>Shortly thereafter, maybe 1 hour into it, the open eye visuals became more and more intense.  With the lights on, we all had really intense open eye visuals, whether it came from staring at the carpet, the walls, or even each other.  Strange designs began to take shape in the most simple of settings in this room.  The carpet and walls seemed to be dancing and spinning and forming into the most interesting shapes.  At certain times, the visuals got so intense that i really had to get a grip on myself becuase the visuals were all over the place. </p><p>At one point my two friends left to go to the bathroom and I was left alone.  This was one point where I felt really overwhelmed because the visuals were at a real peak and were just going absolutely crazy all around me.  It wasn't to the point where I was scared or wanted it to stop, it just got very intense. </p><p>Along with this, we turned on some very intense progressive music that is very involving and has many elements that stimulate the mind on a drug such as this.  It got to a point where we actually felt and saw and could almost touch the music.  It is so hard to describe this amazing feeling, but the music got so real that we could see aspects of it in the room.</p><p>Also, our sense of touch was much more intense.  Everything felt very comfortable when it was felt, which must have been the ecstasy aspect of the drug kicking in.</p><p>The open eye visuals lasted at least a good solid 5-6 hours.  Not only that but my friends and I laughed to the point of tears several times.  The ideas and things we were thinking of and coming up with were absolutely hysterical and also very interesting at the same time.  We did not end up going to sleep until late into the night probably around 3 or 4 am.  The peak of the drug lasted for at least 6-7 hours it seemed like. </p><p>I felt the material to be very safe, no one involved had any negative effects, and there were no bad after effects days or even weeks after.  As with any hallucinogen, be with great people you can trust and have a great time with and do not overwhlem yourself to the point where you are having a bad trip.  I would say that 30 mg is the perfect amount to take for me.  That is my take on 2C-I and as with any substance, just be careful!</p>",
 "year": "2005",
 "id": "43526",
 "gender": "Male",
 "timestamp": "2009-01-13T08:00:00.000Z",
 "views": "2752",
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-I"
  }
 ]
}
