{
 "title": "Previously Passed Over, Now Highly Respected.",
 "author": "R00fies",
 "citation": " R00fies. \"Previously Passed Over, Now Highly Respected.: experience with Cannibis (ID 43531)\". Erowid.org. Sep 9, 2008. erowid.org/exp/43531",
 "substance": "Cannibis",
 "bodyweight": "135 lb",
 "report": [
  "<p>Mary Jane, the substance I have tried a good number of times but never felt too terribly amazing or anything drastically intense off of. One day, after I get my drug screening I decided I have a good two weeks therefore I can 'smoke up.'",
  "I called my friend and we picked up a couple of grams and got dropped off at a park for a couple of hours while my other friend had to take his GED test. We decided to smoke in the small wooded area next to the park. Now usually, the stuff I get, or have gotten in the past, with a few exceptions, makes me get a nice 'hazy' feeling and calms me. I do not know if the profound experience I achieved was because of the THC potency perhaps, or if it was because I just smoked too damn much for myself personally. After a good three hits I feel the normal 'high'. The woods seemed bigger, everything was nice and hazy, the feeling of some random asshole just happening to catch us from somewhere, the usual. After about five, it was cashed.",
  "My friend then packed more. Now knowing I was completely getting fucked soon after about number 7, I decided to take 'smaller' hits. Why did I continue? Hell, I wanted to finish those damn two grams. It has been a month at least since I smoked last and I wanted as much as I could get. After the tenth, all I know is I felt like I had to fucking sit down. Smoking anymore just did not happen. He proceeded to finish what was left. Not only was I sitting down however, it appeared to me that I laid between two logs in an oddly uncomfortable position that at the time was like a bed. I looked up into the tree tops from down below, everything had a cartoony outline to it. Almost as if I expected to see fucking Bambi running through the forest. Apparantly I lost all my inhibitions and I was talking and stating the first things that came to my mind leaving my friend laughing his ass off on the ground. 'I've never been this high before!' 'Woo Wee!!!' 'Dude that bee just flew by me!' 'WOO WEE!' 'I'm Great!' Shit like that.",
  "After I tried to recollect and not let myself talk out of my ass I sat up and decided I did not feel 'great' at all. I was beyond 'high'. I usually never get cotton mouth to begin with but this was the worst I have ever gotten in any circumstance. The forest had turned into a jungle. I had this goofy pain running from my head moving down to where my chest was, then starting over again at my head and repeating itself. Internally I began to panick. I told my friend I had to lay down and laid on the dirt on the 'jungle' floor. He kept reminding me that I was laying on the fucking ground and that I should try standing, that took a good minute.",
  "I had never heard of anyone 'overdosing' from marijuana before and I kept telling myself that but the 'pain' thing did not subside. Heart rate check, seemed to be normal but I could not keep count as I would forget what the hell number I was on. I got a phone call. My short term memory was so damn bad that I forgot what I was saying or what we were talking about almost every single sentence. The person on the phone knew I was fucked because he asked me if I wanted to buy amphetamines and I told him no, under any other circumstance I would not have said that, but that's another story. My friend and I decided to walk to the park from the wooded area. We both agreed that we were going to get lost in the ten foot by forty foot little blotch of land.",
  "Once at the park, probably about thirty minutes later, it was no better. If you were to look at a 'Microsoft PowerPoint' slideshow (just anything that has changing slides) that's how I was viewing everything. Seriously I was watching the damn park in moving 'slides'. Even my friend complimented that to the sound of birds, which at this time seemed overwhelming, and the look of those woods about twenty feet away, it was a 'jungle'. The park slide was an elephant. We were waiting for my friend to come pick us back up and I could not wait because I needed some damn water for my mouth. Needless to say, I still thought I was going to die. When I did get some spit in my mouth I felt it come on really fast right before I spit it out. I thought my throat 'exploded' and I was about to spit blood. I almost saw it before it happened. I was reassured when I saw the white spit of nothingness.",
  "We kept hearing cars coming and as we both commented, we were both excited when we heard each car, in fact so excited, before we realized it was not our ride. We would SEE the fucking car (A little red 97' Eclipse) until we realized it was not him. We believed it was a conspiracy and that the same people were driving in circles just messing with us. A family with kids came to the park. I mean it was not obvious at all, NO WAY, I mean, you have two kids, blasted out of their own reality staring off into nothing sitting on a park bench. I'm willing to bet any money that this family thought we were heroin addicts and that they were telling their kids to stay away from people like us. This 'high' at this point was frightening and not too much fun. The car came.",
  "Riding in the back, it felt like a roller coaster. My stomach turned. I was honestly scared. So scared in fact that not only we were going to crash but that I was going to die anyways. I kept checking my heart rate, seemed normal to myself anyways. I forgot where we were going and where we were two seconds after we turned onto any given street. We were going to my friend 'Ian's'. When we got there all I did was sit on the swinging bench staring off. I think there were five people packed on it. My original friend I was with went to smoke more. Soon I considerably started feeling good. The 'dissociation-fuckedupness-trippy' part was at least gone. And yes I am serious about that dissociation part, I was in my own world for the first hour, thinking about how my heart was going to explode.",
  "I was still staring off, everything still looked 'Cartoony', and I was not right, however it was all funny as hell now. Soon after we left, not knowing where the hell we went, we went to my other friend's work. They had food, and I was incredibly hungry. It was beyond any 'munchies' I have ever experienced, I loved it. My friend that smoked again claimed he in fact this time 'had never been this high before' as he proceeded to lay down not really talking. I was in the normal 'high' state now as I usually would be. My short term memory was fucked though. On the ride home, my friend turned up his bass incredibly. I could almost 'see' the fucking bass. Don't ask. When I arrived home about three hours later, I had to do a PreCalc assignment. Ha... Fuck that. That was not happening. I forgot how to do any of it and one problem would take me five minutes. Three and a half hours after 'ingestion' if you will, I tried talking on the phone. My girlfriend stated that I was not talking at all and I was just sitting there staring off blankly, not making sense, and on top of that not remembering what she was saying to me. I decided to go to bed.",
  "The next morning I woke up and I was normal again thank God. All day however I would just gaze off. This whole experience makes me realize that it is not 'just weed'. Looking back though, I loved it. Even though I was scared shitless at first, I want to do it again right now! I have smoked prior to that but not to get fucked out of my mind. I took enough and stopped when I knew I would be 'high'. I have gained a lot of respect for the psychoactive I have smoked many times but never really given a shit about. I previously felt that there are better things out there that will 'mess you up' more. Not anymore. Marijuana has easily been shifted up to one of my favorites now as it did not use to be before. I think it just takes getting a little too much one time to realize the beauty of something fully, and that is what happened. I feel as though I have never truly been high before, as if there is a new damn meaning to 'weed'.",
  "On another note, I keep having dreams about the entire experience pretty much on a weekly basis and I love it.</p>"
 ],
 "year": "2005",
 "id": "43531",
 "gender": "Male",
 "views": "2451",
 "dose": [
  {
   "time": "0",
   "amount": "10 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2008-09-09T07:00:00.000Z"
}
