{
 "title": "Alaska",
 "author": "JJF",
 "citation": " JJF. \"Alaska: experience with Methadone & Oxycodone (ID 43555)\". Erowid.org. Sep 9, 2008. erowid.org/exp/43555",
 "substance": "Methadone & Oxycodone",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "insufflated",
  "Methadone",
  "(pill / tablet)",
  "",
  "40 mg",
  "insufflated",
  "Pharms - Oxycodone",
  "(pill / tablet)"
 ],
 "report": "<p>The first illegally obtained substance I have ever tried was methadone.  I obtained a 10mg pill from a friend at school and that night I crushed it and snorted it.  Big mistake.  Something in the methadone burned the shit out of my nasal cavity.  I was flushing water into my nose from the sink.  I couldn't stand it.</p><p>About thirty minutes after this trauma of the nose, I noticed I was staring at a Chuck Norris movie on my television.  Nobody in their right mind watches Chuck Norris movies by their own free will so I knew the drug had kicked in.  I call this the Alaska Syndrome.  Named after a line in a Velvet Underground song called 'Stephanie Says', the Alaska Syndrome is a state of pure nothingness.  I was content to lay in my bed and watch this horrible B-action movie.</p><p>I was buzzing like this for several hours into the night.  Then it happened, I vomited.  I had no tolerance to opiates so it was only natural that I upchuck a little bit, I suppose.  The best thing about this drug is that it lasts so damn long.  Something like 36 hours I believe.  I woke up for school the next day feeling the best I had ever felt.  I actually wanted to go to my classes.  It was the best morning I ever had.</p><p>My next illegally obtained drug was Oxycontin.  My friend is a junkie and he had brought me along his rounds just for this drug.  He said I would love oxycontin if I liked methadone.  After a very shady drug deal in some run-down apartments my friend has scored an oxy 80.  He sucked off the time release and split it into two halves and gave me a half.  40mgs for you math wizards.  I snorted about half of the broken pill right away.  Very smooth.  The drip tastes terrible, but at least it didn't burn my nose at all.  I was really into Alaska after a few minutes.  I didn't care about anything.  My eyes kept fixating on far off objects.  I decided I wanted more.  I snorted the rest of my half about thirty minutes after my first bump.</p><p>I was really loaded now.  On my drive home a car ran a stop sign and almost killed me.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] My motor skills were very much intact and I avoided being T-boned.  The thing is, I didn't care.  If the car would've hit me I would not have cared one bit.  It was beautiful.</p><p>My tolerance was shit zero because I hadn't done any methadone for weeks prior to my first go at oxycontin, so of course I puked once I got home, twice.  I also went on the nod while laying in my bed.  I finally understood what the junkies I knew were always talking about.  The nod is wonderful.  I can only get oxys every few weeks so I know that if I keep out of other opiates before I do oxys I know I can go on the nod at exactly 40mgs every time.  In fact, I just took a 40 before typing this and I am just starting to nod out so I'll end this here.</p>",
 "year": "2005",
 "id": "43555",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-09T07:00:00.000Z",
 "views": "16336",
 "dose": {}
}
