{
 "id": 4356,
 "title": "Laughing at Me",
 "date": {
  "submission": "2006-06-12T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Neveryoumind",
  "gender": "Male",
  "weight": 83
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "tar/resin",
   "specific": "Hash"
  }
 ],
 "report": [
  "The following experience is one, to which I may end up comparing all my sequential experiences with cannabis.  Its not the most stoned Ive ever been, but its the experience I have the clearest, most analytical memories of. Possibly also the most enjoyable.",
  "A friend of mine (lets call him Fred) and I, have a mutual friend (call him George) who was living in London for a while.  Fred and I decided to go visit him there, for a duration of 10 days.  Despite it being a grand experience on its own, our main reason for going there was, despite what we're told others, drug experimentation.",
  "George happened to have some hash left over from when he and someone else had been smoking a couple of days ago. On the first night we tried it, but I didnt feel much, if anything at all.  The next day we tried it some more, and I felt some more, but still not much (I wonder if this has anything to do with the fact that we were smoking it in a pipe, with tobacco).  The day after that, we decided to forget about the tobacco, and just smoke the hash straight. And WOW!",
  "Over a duration of about 20 minutes, we smoked the bowlful of hash, split between 3 people, out of which Im almost certain that I got the most hits.  The effects started out very subtly, kind of noticing that I was saying different things compared to usual, and constantly asking the others 'you feeling it yet?'.",
  "Gradually, I started to notice my eyes getting heavy, not tired-like, just heavy.  Its tricky to explain, but my entire face began to feel heavier, yet no more of a burden, as in it didnt take any extra effort to control facial movements, yet it just felt heavy.",
  "At about this time, I started feeling the 'buzz'.  Now this wasn't a subtle buzz, this was like a long ZAP!  After my 6th (or 7th, or 8th, 9th... lost track) inhalation, I just felt a kinda of 'WEEEEE!' sensation.  Fred once said aptly, that 'it's cool, when you get such a great hit, that you just fall back onto your back with a huge grin'.  Thats EXACTLY what I felt.  After lying on my back on top of a folded-out sofa bed, the buzz became so strong, that it had clearly defined borders on my body.  I remember analyzing it (which at this point seemed the most fun thing to do, and I ended up analyzing the entire high), and noticing that it was concentrated on the lower half of my body, the longitudinally lower half, as in my back, the backs of my legs, arms and head.  I found this most interesting, and believe I pointed this out to Fred and George.  I noticed they were still sitting upright on the bed, and conversing casually (yet not entirely soberly).  After this, I no longer paid much attention to them, I got lost in myself.",
  "Opposite the sofa-bed, there was a window, through which I could see the clouds (it was overcast).  However, I noticed something odd about the whole thing.  Normally on an overcast day, I  look up and just see a plain grey color.  This time, I realized that my depth perception had improved by leaps and bounds, and hence I could start making out individual layers of clouds. I had no trouble focusing on only a single layer of cloud cover.  I stared at that for what seemed like a long time (was actually approximately 2 minutes...). I took it upon myself to find the lowest layer, which I at the time thought I had located, and focused on that.  This particular layer seemed thin, and was moving toward the left. To my amazement I noticed that the clouds making up the layer started forming letters. Or what looked like letters. It was as if they were communicating with me.  After me being quite quiet for a few minutes, I managed to state to the others, that 'I'm having a divine conversation with the clouds', much to their amusement.",
  "This statement caused my thought patterns at the time to change completely, and I forgot about the clouds.  In the chasms of my THC-intoxicated cranium, I started imagining to myself, a random outside observer watching me progress through my high. I imagined them seeing a person laying on a bed, with an idiotic grin, no coordination, and bloodshot eyes talking about conversing with clouds. I started to laugh. The more I thought about myself being watched by someone, the harder I laughed. ",
  "The next stage of the evolution of this amusing idea was that observer seeing me suddenly, for no apparent reason, bursting out in a fit of laughter.  This just made me laugh harder.  And harder. I was locked in a vicious cycle of me laughing at nothing, and imagining a person watching the whole affair, which I found profoundly funny. I just laughed and laughed for what seemed like an eternity. I could feel tears streaming down my eyes, and a distorted feeling of abdominal muscle fatigue.",
  "Eventually the fit of laughter ended, leaving me extremely euphoric for a while. At this time I tried to get up, and managed to, and if I recall correctly, I even managed to score another hit from the pipe.  After this, I lay down again, and the buzzing returns.  I happily focus on it, as it feels quite pleasant.  As if to experiment with the location of the buzz, I turn onto my right side.  And yes, the buzz moves so that now it is mostly on the right half of my body. ",
  "Music had been playing in the background the entire afternoon, but it was only now that I noticed it.  Possibly because I, at some sub-sub-sub-subconscious level, noticed that Fred and George's conversation had reached an end, and both were lying completely still, staring into nothing.  For whatever reason, I began to focus on the music, possibly because there was absolutely nothing else happening in the room at the time.  The music was played out of a laptop computer, out of the laptops own speakers, so the sound quality was pretty bad.  In my state however, I didnt notice the quality as bad per se, but as metallic.  Some time about then, I realized that my state had changed from a 'high' in the most literal sense of the word, to a 'stoned'.  I didn't want to move a muscle, I was totally relaxed, and was just listening to the music (apparently the other two were doing exactly the same thing).",
  "I also noticed that the intensity of the colors in the room had decreased dramatically (probably because it was around 5pm, so it was getting darker).  It was as if the colors in the room all had a tint of grey/blue/green.  I dont know how long this staring-listening-catatonic-paralyzed state went on, but it felt like hours.  The slightest disturbance to the entire setting (a car horn outside, Fred making some inconsequential remark, George rolling over), anything making the slightest noise was deemed by me a colossal disturbance to the tranquility of the whole situation.  The music is everything! Do not disturb the music! (BTW: most the music on the laptop was music I cant normally stand...) During this stage, I was doing a lot of mental pondering regarding various things, although I cannot remember what those things were.  But I do remember feeling wiser having done so.",
  "After lounging around like this for however long we did, we came down, leaving me feeling mellow and relaxed, lasting well into the evening (until we took X, which is another story).",
  "Although this was a totally overpowering high, leaving us incapable of doing anything at all, it was definitely a worthwhile experience."
 ],
 "erowid": {
  "id": "28865",
  "citation": " Neveryoumind. \"Laughing at Me: experience with Cannabis - Hash (ID 28865)\". Erowid.org. Jun 12, 2006. erowid.org/exp/28865",
  "substance": "Cannabis - Hash",
  "views": "3747"
 }
}
