{
 "title": "Popping Candy for the Soul",
 "author": "Limpet Chicken",
 "citation": " Limpet Chicken. \"Popping Candy for the Soul: experience with Virola theiodora, Syrian Rue & Tobacco (ID 43577)\". Erowid.org. Nov 9, 2005. erowid.org/exp/43577",
 "substance": "Virola theiodora, Syrian Rue & Tobacco",
 "bodyweight": "126 lb",
 "report": "<p>I have been experimenting with virola (epena) for a bit lately, I bought ten grams of the resin extract online, and failed quite a few times taking it. This time, one teaspoon of ground harmala seeds was ingested, and I waited 35 minutes for the MAOI effects to take hold, feeling slightly spaced from the harmaline.</p><p>One and a half teaspoons of the resin were wrapped in a square of toilet paper and swallowed, which tasted quite rough and unpleasant on the back of my throat, and after almost an hour I decided that the experiment was a dud.</p><p>I then attempted smoking a mix of tobacco and 1 1/4 its volume of virola, one bowl was loaded intop a pipe and smoked with a direct flame, no body effects were noted, no OEVs, but on closing my eyes and covering them with one hand, some impressive fractal patterns shot into view. The world took on an olive-green color, with what looked like a central conduit of twisting, pulsating energy radiating out from my innermost being, and fratals consisting of squares and right angles nested within right angles were shooting out fast from this energy beam, and were almost impossible to focus on individually, dark royal purple blob patterns began to appear all over my closed eye field of 'vision' and shifted and started morphing into many dark and shadowy faces over the course of maybe five minutes, with an effect of what i can only describe as psychic popping candy, like, small particles of starbusts detonating in ribbons, that seemed as though they were encased in a sort of gel matrix all over the energy radiating out from within.</p><p>I would estimate that the effects lasted maybe 7-8 minutes, and a gently come down, which felt strange, sort of sedated, yet stimulated at the same time. The experience was visually beautiful, but felt strangely empty, like there should have been some bodily effects and mental changes there, but they just weren't ready to show themselves.</p><p>I feel really compelled to chemically isolate some of the 5-MeO-DMT and try vaporising that, it feels almost beckoning at me to do it, but that will have to wait until suitable solvents are available to perform the extraction and recrystallisation.</p><p>I really can't wait to eventually experience the full effects of this substance, its just like being called to have the full experience by some entity, taster of what is to come, a little tease, but just enough that I know I will love the experience, yet just being teased and poked by what I assume must have been a mere threshhold dose, I estimate that I must have took in about 1.5-2mg of 5-MeO-DMT.</p><p>When taking a MAOI, one must follow a strict diet to prevent toxicity from dietary monoamines such as tyramine, stimulants of any kind and phenalkylamine based drugs especially, and, I believe there is much potential for harm with orally activated and potentiated 5-MeO-DMT.</p>",
 "year": "2004",
 "id": "43577",
 "gender": "Male",
 "timestamp": "2005-11-09T08:00:00.000Z",
 "views": "10861",
 "dose": [
  {
   "time": "0",
   "amount": "1 tsp",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 0:35",
   "amount": "1.5 tsp",
   "administration": "oral",
   "substance": "Virola spp.",
   "form": "(extract)"
  },
  {
   "time": " T+ 0:00",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": ""
  },
  {
   "time": " T+ 0:00",
   "administration": "smoked",
   "substance": "Virola spp.",
   "form": ""
  }
 ]
}
