{
 "title": "The S-Side of K",
 "author": "Alex",
 "citation": " Alex. \"The S-Side of K: experience with Ketamine (S-Isomer) (ID 43590)\". Erowid.org. Jun 4, 2005. erowid.org/exp/43590",
 "substance": "Ketamine (S-Isomer)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "IM",
   "Ketamine",
   "(liquid)"
  ]
 ],
 "report": "<p>Seems like I have promised to write down the interesting stuff about s-ketamine... Let's see what I can do. I think in this case it would be best to write about the patterns I have noticed in the course of several experiences instead of describing one particular journey.</p><p>So I was lucky to find some sealed vials of Ketanest S by Parke-Davis, so there's no doubt that I'm talking about what I'm talking about. ;)</p><p>Potency</p><p>If I recall correctly, the stereoisomer s-ketamine is supposed to be (apart from possible qualitative differences) twice as potent as r-ketamine. Which means that 75mg of s-ketamine should have about the potency of 100mg (my regular im-dose) of the racemic. This sounds right to me. 75mg would do a reliable job of taking me on vacation, maybe even more so than 100mg of the racemic would. With the racemic I'd sometimes (maybe 5%) experience a dud, a trip that wouldn't take off. In contrast, all of the s-trips I've had up to now met or surpassed my expectations...</p><p>Duration</p><p>Whereas the regular k-trip lasts about 45-60 minutes for me, it's only 30 minutes with the s-ketamine. However, these 30 minutes seem much longer than a regular k-trip! I know the feeling of 'back so soon?' after resurfacing from regular k, with the s-ket however I seem to be in the infinite place for much longer, and being aware of it. In a way it reminds me of taking ketamine with a booster like 2cb.</p><p>Effects I noticed...</p><p>In the take-off and also during the trip, I didn't see and feel as many wide open spaces as I was used to. That was a pity since I liked that part.</p><p>Most of the time I had an exquisite, blissful feeling of who/what I was. For some part it was a body feeling, but even when I didn't have a body and was just a small ball of pure consciousness that felt very good. :)</p><p>Phases of the journey: 1) Take-Off</p><p>I'm not sure but take-off seems slightly slower, and there is a more pronounced hissing carrier-tone. This is the part where I'm still aware of things, feeling the onset, trying to push it in the right, pleasant direction. Sometimes I actually feel slightly anxious 'Is this it? There doesn't seem to be too much going on?!' Then there's some sort of a cut and I don't notice the transition to</p><p>Phases of the journey: 2) Zero gravity</p><p>I'm at the place to be... Lot's of things are going on. This is roughly the same as on regular k, although I think I feel more aware of things, and remember it better. Not in a way that I'd be able to write it down for you, but it's still with me. On several occasions I went to the place where all things begin, or all things end, just short of the point where time stops. On the last journey I ended up being just a small ball of consciousness floating alone in space, and that was all there was, and God assured me telepathically that that indeed was all there was and that it was fine... So quite often I end up in a very weird world, dimly aware that there used to be some other reality but quite sure that this was the real real for now, and possibly for the future.</p><p>Phases of the journey: 3) Paragliding downwards</p><p>At some point I start being aware of my outer surroundings, in a vague and abstract way at first. This phase definitely feels longer and more pleasurable to me than on regular k. It mostly looks like an 'enhanced reality' kind of a virtual reality superimposed on the real world. So I may have the feeling of lying in my room (like you also can imagine your room after closing your eyes) but an improved version, maybe larger, with cooler furniture and stuff... Maybe in some other cool place I'd enjoy, a place I'd invent for myself. The difference to phase 2 is that these whould be physical places instead of the more abstract energy places. The interesting contrast to having a daydream of, say, being at a beatiful island is that on s-ket (also on k but this here feels more distinct) you're very vividly inside your imagination, like having an especially vivid dream...</p><p>Nearer to the ground, when I'm more and more aware of my body, that body feels very strange on regular k: all skin and bones, the skin has a texture like paper, but it's actually fun touching it. And I have this weird, almost compulsory urge to move my fingers in complex, repetitive patterns. I usually enjoy these physical expressions of the k state but they weren't especially noticable on s-ket. Too bad.</p><p>Recovery</p><p>Recovery seems subjectively faster, I haven't measured it though. But I think speech and coordination come back faster.</p><p>On the whole</p><p>Being a seasoned, maybe even slightly jaded k-traveller, this last journey on s-ket still left me thinking 'Holy shit, oh my god...' when I finally touched ground again. Maybe this says it all.</p>",
 "year": "2004",
 "id": "43590",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-04T07:00:00.000Z",
 "views": "31097",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "IM",
   "substance": "Ketamine",
   "form": "(liquid)"
  }
 ]
}
