{
 "title": "Spiritual Experience",
 "author": "Alex",
 "citation": " Alex. \"Spiritual Experience: experience with Inhalants (Butane) (ID 43597)\". Erowid.org. Jun 23, 2007. erowid.org/exp/43597",
 "substance": "Inhalants (Butane)",
 "bodyweight": "55 kg",
 "header": [
  "DOSE:",
  " repeated",
  "inhaled",
  "Inhalants",
  "(gas)"
 ],
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I used to huff butane a lot. Like every day for about a month, not really realising how badly it was affecting me. I used to huff at least a can a day and used to make me naturally paranoid, delirious, dizzy and freaked out all the time. I suppose I did it because I was addicted and I didn't know.</p><p>Anyway one time I huffed 2 cans and didn't pass out, I have never passed out from Butane. Anyway I sat there huffing away and had my first and only hallucination ever. I saw a fat man in front of me trying to hit me. He swung his fists at me like he was physically hitting me. All I could do was sit there and drool because I forgot how to use my muscles. I just remember being so scared of this man but not being able to move because after 1 can I never could move all I could do was drool.</p><p>Anyway while I was seeing this fat man trying to hit me I actually felt a tap on my shoulder and I was suddenly able to move. I turned around and it was like I wasn't seeing with my eyes. I saw a beautiful woman with my entire vision (I can't really explain this because I didn't physically see her. I saw her in my mind but I actually felt the tap on my shoulder.) She placed a cookie in my mouth and I could feel and taste it. I closed my mouth and bit into the cookie and everything disappeared, including the cookie. I instantaneously was not at all high and could feel no after effects. I think I probably would've died there if it was not for that woman.</p><p>I have never huffed butane since and try to restrain from harming my body in any way any more.</p><p>Thank you God.</p>",
 "year": "2005",
 "id": "43597",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-23T07:00:00.000Z",
 "views": "3925",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 }
}
