{
 "id": 436,
 "title": "PURE INSANITY",
 "date": {
  "submission": "2004-06-25T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Foreigner",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alprazolam",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "3 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "After experimenting with more than my share of drugs: Ecstasy, LSD, Shrooms, K, and all kinds of prescription drugs, I was not as careful on this particular night as I probably should have been. When it comes to my tripping experiences, Ive always been very moderate, never taking more than 2 hits of acid and preparing myself for the mind games that usually occur (remembering that it is not reality).  I don't really know if this was a good night or a bad night... just PURE INSANITY!!!",
  "The night started as many other Wednesday nights do. Me and some friends got together to eat, drink, and smoke some. As everyone headed home, I offered my friend half a bar of Xanax and headed over to his place to smoke and watch some TV. Surprisingly, we werent drunk so we picked up some beer on the way to his place and when we got there he asked me, 'I still have some of that stuff my friend got online, you wanna try it?' I figured, if you can buy it legally, it cant mess you up too bad. Plus, he had tried it twice, and he hadnt made a big deal of it. He said it made one of his friends trip and another one feel like they were rolling. I assumed with the intensity of smoking a bowl of really good weed...  I had no idea what I was getting into.",
  "So we split what he had left into two lines and bumped it (we figured out later it had to have been about 40 mg each). The burn was intense and the drip awful. Ive bumped Ecstasy and K before and this was much worse. I moved to the living room and curled up on the couch. The back of my throat felt like it was on fire. My friend was running around the kitchen trying to subside the drip/burn with beer, and soon ran to the bathroom to throw up. I felt the effects immediately. I stood up and everything started getting fuzzy. I sat back down and tried to call for my friend, but I felt weak. He sort of heard me, came over and I told him to check my pulse. My heart felt like it was racing; he confirmed it.",
  "I feel like I should give you a little description of our environment. My friends apartment is trippy even when youre sober. Theres porch-like rooms in the front and back, and you have to go through the back porch to get to the bathroom. Another friend of mine was there tripping once and she thought she was in a tree house. Many of the decorations are LSD-inspired, for example to word 'DOOR' written on the door and a big poster of Elvis in the living room.",
  "So at that point my heart was racing and I was already having full-blown visuals. The walls were breathing, Elvis seemed to be looking at me, and colors were very bright (a combination of LSD-visuals and Nitrous-visuals). And then I felt the nausea. I stumbled to the bathroom and started throwing up. The only words I can use to describe what followed are 'sheer terror' and 'utter panic'. The bathroom light was out, so the only light was a blacklight, which made the paint on the walls look like blood. I also felt total vertigo: no sense of direction. I didnt know up from down and the whole room was moving (I get motion sickness so this might be why I kept throwing up). I felt like I needed to scream but couldnt find my voice. My thoughts were out of control. I thought, 'If I call 911, theyre going to take me to the ER and think Ive gone crazy and tie me down', yet I felt totally desperate. The only thoughts that kept coming to mind were, 'Oh f**k, I ODd' and that I shouldnt have mixed all this stuff.",
  "I eventually came out of the bathroom and I thought I saw people coming out of the walls. I tried to walk in the hallway, but the floor and the walls seemed to be at odd angles. I had never felt anything so intense.  In those ten minutes I felt all the horror stories I have heard about people flipping out on acid.  When I made it back to the living room, my friend tried to lighten up the scene by putting on something happy, so he put on 'Lady and the Tramp'. I curled up on the couch and although I tried to pay attention to the movie, it was too difficult. I had intense visuals and it was hard to focus. Closing my eyes didnt help because I had closed-eye visuals too. I didnt just see bright colors, but everything seemed out of focus. I felt terrible physically. I was shaking, which was almost impossible to control, and no matter how I sat, I felt uncomfortable. Soon I ran to the front porch and threw up again. When I came back in the room, we decided to smoke to try to calm us down. Good idea!  All of a sudden we looked at the TV and the movie was ending. We didnt know where it had gone! I guess it played while we were running around.",
  "At this point everything changed. While the first hour was horrific, I now felt very dreamy and just plain good. While I felt uneasy and uncomfortable before, I now felt like my body was liquefying into the couch. I felt unpleasant when I moved, so I basically stayed in that position for the next several hours. I felt warm and cozy on the couch with a blanket. For the next three hours my friend and I were delirious. We tried to have conversations, but we couldnt have a coherent thought. I think I was trying to tell him about what kind of dog I wanted to get. We were laughing at everything, EVERYTHING was comical! We started browsing the web. We researched 5 Meo DIPT and the fact that we were probably the only ones in the city that had done it, and that the website were looking at had only one report on snorted 5 Meo DIPT, and that we had done about 3 times the dose anyone had done were all hilarious to us. We were listening to whatever music we could find, and it was all entertaining.",
  "We decided to write one of our good friends an email. This proved to be a difficult task since the words were changing colors, seemed to be waving like a flag, and flying off the screen. A little plastic lizard next to the monitor seemed to wiggle its little head at us. We passed the keyboard back and forth as we wrote incoherent sentence fragments, which were interrupted every now and then by one of us writing 'HA HA HA HA'. I dont think Ive ever laughed so much. I can honestly say I have been insane, if only for a few hours...",
  "It felt like we had been feeling like this for a long, long time. Time was very distorted, only four hours had gone by since we had taken it. Like MDMA, 5 Meo DIPT has a pretty harsh come down. My friend went to lay down on his bed and I started feeling bad, really bad... I felt like I had to apologize to everyone for what I had done. I felt like I put my life in danger and could have died. I called my boyfriend to come pick me up.",
  "When I got to his place I felt mentally exhausted and I wanted to take a shower to feel 'clean'. Well, the shower felt wonderful, I think I stayed there for a long time. When I got out, I laid on his bed and apologized to him for being stupid. We had sex and it was amazing (supposedly this is why 5 Meo DIPT has gained the street name 'Foxy'). For the next 24 hours I was still having mild visuals and felt really 'freaked out' (thats the only way to describe it).",
  "In retrospect, I would try 5 Meo DIPT again, just in a MUCH SMALLER DOSE. Readers beware, there is the aspect of GREAT physical discomfort at first, other reports confirm it.",
  "5 Meo DIPT had strong LSD qualities. I rolled three days later and basically felt nothing (that had never happened to me before)."
 ],
 "erowid": {
  "id": "10802",
  "citation": " Foreigner. \"PURE INSANITY: experience with 5-MeO-DiPT, Alprazolam & Alcohol (ID 10802)\". Erowid.org. Jun 25, 2004. erowid.org/exp/10802",
  "substance": "5-MeO-DiPT, Alprazolam & Alcohol",
  "views": "9567"
 }
}
