{
 "id": 4361,
 "title": "Light Feeling of Clear Focus",
 "date": {
  "submission": "2005-07-26T07:00:00.000Z",
  "experience": "1992-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Spaghetti Kid",
  "gender": "Male",
  "weight": 69
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5.0",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Vinpocetine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "oz"
   },
   "administration": "oral",
   "substance": "Periwinkle",
   "form": "extract"
  }
 ],
 "report": [
  "I would report two experiences with substances derived from the Periwinkle flower:",
  "1.) 1 oz. (1/2 bottle) of extract (contained ethyl (drinkable) alcohol) when I had ingested LSD (2 doses of blotter acid, probably about 170 micrograms - this was from a sheet I had ingested, prior, so felt fairly sure of its standard dose).",
  "2.) Vinpocetine (this is the name of the standardized periwinkle flower-derived substance, which is the more powerful form, as compared to vincamine) from 'Nature Made,' in 5 mg. tablets.",
  "When I was already on LSD for some hours and then, on an empty stomach, ingested the periwinkle flower in extract form, the first time, the periwinkle flower extract re-invigorated the introspective aspect of my LSD experience. An overwhelming feeling of being clearly in focus (on priorities, on whatever it was I was thinking about at any one time) came over me in just minutes after I consumed an ounce of the extract.",
  "On another occasion, when not under the influence of any other substance, I took the other 1 oz. of the extract. I did not have the same feeling of clear focus.",
  "I decided that the LSD must have potentiated the effect of the periwinkle extract.",
  "Ten years later, in 2002, I noticed in a retail sun-dried/drug store, that vinpocetine was sold over-the-counter, and sitting on a shelf next to other supplements.",
  "For most of 10 days, I took up to 20 mg. in a day of vinpocetine. While I did not find that the effects were specifically evocative of introspection, the substance did provide what felt like an increase in mental energy or alertness.",
  "I did not experience any effects on my body, whatsoever, none of the heart palpitations that others have reported.",
  "I only took the vinpocetine during the day, so I do not know if it would have had enough stimulating property to have disturbed sleep.",
  "I would certainly take vinpocetine, again, were it not for the price/benefit ratio."
 ],
 "erowid": {
  "id": "28878",
  "citation": " Spaghetti Kid. \"Light Feeling of Clear Focus: experience with Periwinkle (extract) & Vinpocetine (ID 28878)\". Erowid.org. Jul 26, 2005. erowid.org/exp/28878",
  "substance": "Periwinkle (extract) & Vinpocetine",
  "views": "29354"
 }
}
