{
 "title": "Within the Body of a Creature",
 "author": "Trent",
 "citation": " Trent. \"Within the Body of a Creature: experience with Salvia divinorum (ID 43638)\". Erowid.org. Sep 27, 2007. erowid.org/exp/43638",
 "substance": "Salvia divinorum",
 "bodyweight": "145 lb",
 "report": [
  "<p>Doing Salvia Divinorum is best described as entering a waking dream. I hallucinate in the way that my view of reality changes, not reality itself. This meant that the way my sense of vision and touch were interpreted by my brain was changed, which led to a completely crazy and scary experience.",
  "This change was such that it felt like I was experiencing the outside world in two dimensions: the front dimension (forward) and the back dimension (backward). It seriously felt as if those were the only two directions that existed, as if I were stuck in a pipe or somehow wedged inside a sheet of paper. Imagine being stuck inside a sheet of paper standing upright, that is how I felt. If anyone else besides my two friends were around, they would have known exactly what I thought of them because I would have gotten up and left, or told them to leave me alone. These two people I was with though, we had no dark grounds between us, and we trust each other with our lives.",
  "I smoked twice within about twenty minutes, the first time hallucinating but not feeling it very intensely. I left the doorway and went to sit on the couch and tweak. Now, I have to tell you that the second time I smoked, I did something I shouldnt have. I got in a car and got a ride home while I was tripping. Take note that the second time was when I fully entered the 2D reality.",
  "A quick note on what the 2D reality looked like. I remember that things were not exactly flat, but they looked as if they were unzipping. When moving, or even just sitting still, everything I looked at kept opening up like a jacket being unzipped. Moving through a narrow room felt as if I were traveling through the depths of a creatures intestines. Walls, objects, the floor, and the ceiling were constantly unfolding from underneath each other. Anyway, back to the story.",
  "My friend called shotgun while I was on the way to get in the car, so I was forced to sit in the backseat. During this time, while I was waiting for my friend to take his hit of Salvia, is when I tripped the hardest. I will not even try to literally describe what I felt, but I remember feeling very uncomfortable in the backseat. It was hot out (near 70 F), and for some reason I didnt like being confined to my body. As I got in the car my friend said, The cars eating you! and closed the door to go smoke. This affected how I interpreted the experience, and I realized it actually did feel like I had just climbed into somethings mouth. I wanted to extend both my arms and legs and possibly lay down, but I couldnt do this in the confines of a car that was felt like it was getting smaller and smaller. Knowing I was about to panic and scream, I closed my eyes and laid my head down on the other seat. From then on I tripped very hard and uncomfortably.",
  "At the beginning of the second session, just after finishing my second hit, I think I realized that all along I have been within the body of the same creature my entire life. This creature was the entire world outside of my body. When I walked from the doorway to the couch after my second session, I saw the inside of the house as the insides of a creatures body. This felt similar to the way other trippers have described Salvia making the world seem as if it is made out of a couple or only a single substance. I was seeing the world as only a few colors and patterns that were unfolding and moving in a single direction toward a focal point behind me. Also, the TV was playing in the background, and for a moment I thought it was the voice of God or something, narrating how I was in the confines of this creature/world. The entire peak of the trip, both on the couch and in the car I was freaking the fuck out, and doing my best not to panic.",
  "During the peak and while coming down, I came to realize exactly what my mind (and therefore myself) was capable of in this new 2D reality. And it was very limited. I seemed to have no control over my surroundings and how they would influence my actions. Thus came the introspectiveness of the trip, as I compared myself to the rest of the universe. I realized that I had a very low threshold of things I could comprehend at the moment, and this was terrifying. Now I am humbled at that realization, and know it was not just a truth while tripping, but also in the real world. Youre probably more interested in the trip itself, though, so Ill leave out my philosophical findings.",
  "Luckily for me, I was fully back to normal within half an hour, right when I was dropped off at home. The peak lasted a little past 10 minutes, and from then on I was coming down. Keep this time frame in mind if you find yourself panicking on Salvia.</p>"
 ],
 "year": "2005",
 "id": "43638",
 "gender": "Male",
 "views": "2662",
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 ],
 "submissionDate": "2007-09-27T07:00:00.000Z"
}
