{
 "id": 4363,
 "title": "Greedy Alien Attack?",
 "date": {
  "submission": "2005-07-16T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "BenOliver",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "I recieved the Salvia I ordered on the day I was to leave for a Thanksgiving Vacation. My family had left to meet me at another location so I thought that the (for once) empty house would be a relaxing enviroment for 'a little psychedelic experience'.  I sat considering the fact that I had no sitter, but, thinking that many people do not respond to Salvia and that I was expereinced enough to handle just about anything (as a devoted mushroom, LSD, and DXM explorer of years past...",
  "I decided to go ahead with the experiment.",
  "I placed a small bowlful of the 5X Salvia in my glass 'steamroller' and proceded to quiet my mind and relax.",
  "I reflected that I was to begin a long trip and that, having been quite sober for some time, I would greatly enjoy a hightened psychedelic outlook on where I was heading and where I had been. I put the flame to the bowl and inhaled a large chamber of smoke holding on to the lungful for as long as possible.  As I laid my head back on the sofa I noticed that the blackness behind my closed eyes began to 'echo' or move with exact replacas behind it. I felt the familiar adrenaline rush of tripping. The next thing I knew it seemed that I was in some kind of accident!",
  "I couldn't really see clearly but it felt like I was stuck, half in and half out, in this silly putty-like substance that seemed malicious and alive! It seemed to be infinitly vast and powerful and I struggled to pull free of this horrible creature attached to me. Scared witless, I still laughed at how ridiculous it was for me to die at such an inopportune moment, I tried shaking off this hideous, greedy, consuming 'alien', but it was stuck to me like that oil slick in the movie 'Creepshow', but colorful!",
  "No matter how I shook or tried to free myself this entity was trailing behind me! The entire back of my body was made up of this thing, Salvia. I attempted to reason to threaten to curse...I said I would never try it again if it let me go...I said I would tell EVERYONE I MET never to do it! Anything! Just don't kill me, let me have my pitiful life back! (Which is odd considering I have been happily willing to die under the influences of other drugs.) It was like my face was the spine of a book and it had opened me up from the back and spread me WIDE!! Thousands of miles WIDE!! Fucking frightening! Finally, I began to 'close'. My life was slowly returned to me and I spent the next several minutes reaclimating myself to my bizarre surroundings and THANKING HOLY SWEET MOTHER OF JESUS (or someone similar) that I was back.  So now I've fullfilled my promise, and it will be a cold friggin day in Hell before I vist that particular entity ever again!",
  "Peace and Happiness!"
 ],
 "erowid": {
  "id": "28881",
  "citation": " BenOliver. \"Greedy Alien Attack?: experience with Salvia divinorum (Extract - 5x) (ID 28881)\". Erowid.org. Jul 16, 2005. erowid.org/exp/28881",
  "substance": "Salvia divinorum (Extract - 5x)",
  "views": "3889"
 }
}
