{
 "id": 4364,
 "title": "Don't Do This Stuff",
 "date": {
  "submission": "2004-01-21T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Guy",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "(cookie / food)"
  },
  {
   "time": "2:45",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "Having not tripped in some time, I found myself wanting quite badly to have an experience one Monday evening.  After a few 'what's going on?' to the few people I know, I came into contact with a 'Muffin Man' via a friend of a friend.  This muffin man was selling 5-meO-AMT under the pseudonym @ 5 mg.  At 7:40PM I met Muffin Man, and he sold me an ACTUAL MUFFIN.  He told me that the 5mg were baked in there somehow and that he'd done it through this medium a number of times and was quite happy with the results.  I quickly ingested the muffin (which tasted pretty good... chocolate chip) at what I guess to be 7:45PM.  I've tripped a number of times on shrooms, acid, DXM, and a few other substances.  I go into the trips not expecting anything and more often than not have really great experiences (guess that's why I trip).  I went into this trip similarly but with caution after having read a number of accounts of very hard trips on relatively low doses. ",
  "I was with two other guys this night, both being on the same 5mg via muffin I was; I'd tripped with them a number of times before, on acid -- they're good guys.  No one feels anything for the first hour. At around 9, we all started to feel pretty nausious.  This continued for a little over an hour, sometimes worse than others; no one puked, though we all expected at least one of us might.  After the nausia we all agreed that we'd gotten over the hard part and that we were in for a niiiice trip.  I start to feel as though something huge is going to crash on top of me and kick my ass - similar to LSD, but being my first time on the substance, filled with more anxiety.  At around 10:30PM we decide to go outside to smoke a bowl.  We'd been pushing off smoking until now for fear of it pushing us over the edge, but we wanted something to start happening so we did.  After a bowl we all felt high and happy and chill.  We walked around the town for a bit (it was really very cold, but I really appreciated the crispness of the night and enjoyed it quite a bit). ",
  "We get back inside and one of my friends complains of a headache.  We chilled out until around 1:30AM watching TV, and having shit to get done the next day, we went our seperate ways and gave up on the night.  I watched TV alone for quite some time, hoping to tire and fall asleep.  I'd had no real visuals throughout the experience but when I turned off the television and closed my eyes, disturbing images flashed.  I kept my eyes open to avoid this.  I noticed shadows on the ceiling began to move about.  I rolled around in bed and switched the TV on and off until 4 or 5 in the morning when a headache started.  I'd read a bit about the headaches, and my friend complained of one, but i didnt expect anything.  THIS HEADACHE SUCKS! It definitly feels as though there's a substance in my head.  Burning and eye pain/strain.  I can only describe it as one of the suckier come-downs I've ever had (maybe the worst, considering I hadn't had a trip at all). ",
  "At 6:45AM - 11 hours after ingesting - I write this warning to any psychonaut looking for a good time: this shit sucks. I can see it bringing on a real hard trip, like I've read about, at a higher dosage (something between 6 and 10 mg, maybe???).  This headache is still here, really sucks and is keeping me awake.  I will never do this again. There are so much better - and SAFER - substances out there."
 ],
 "erowid": {
  "id": "28892",
  "citation": " Guy. \"Don't Do This Stuff: experience with 5-meO-AMT (ID 28892)\". Erowid.org. Jan 21, 2004. erowid.org/exp/28892",
  "substance": "5-meO-AMT",
  "views": "11909"
 }
}
