{
 "title": "Celebrated in Style",
 "author": "'Dre",
 "citation": " 'Dre. \"Celebrated in Style: experience with Cacti - T. bridgesii (ID 43669)\". Erowid.org. Oct 11, 2006. erowid.org/exp/43669",
 "substance": "Cacti - T. bridgesii",
 "bodyweight": "160 lb",
 "report": "<p>I'm not sure why I didn't submit this earlier, but I've decided to do so now because I'm being called to the cactus again and contemplating my next attempt. This describes my second use of the cactus--here is my first entry.</p><p>Early September. I decided I would go for a journey with my homegrown cactus sacrament on the eve of my thirtieth birthday (some people think it's silly for adults to do drugs--I think it's dangerous for kids to do 'em and adults sure need their moments of magic, opened existence and euphoria.) I'd be all alone until about midnight, when my wife would come home and find me pleasantly high as a kite.</p><p>I had a light breakfast and just a little fruit for lunch. (I always fast or quit eating several hours before ingesting any plant drugs.) In the late afternoon, I smudged myself and the house with sage, then sweetgrass, said prayers for guidance and fun, then sat down at my table with my cactus laid out in four little piles of four pieces each. That's part of my sacred geometry fixation. I s-l-o-w-l-y ate each little dried piece. They are bitter and don't taste so hot. I had a glass of water that I used to wash down each mouthful. I really took my time, stayed mindful and prayerful and aware of my body. In all, the process was a quiet, editative ritual that took about half an hour. I began noticing furtive leaf movements as the sky went pale yellow and the crickets and cicadas began chanting. I noticed the tell-tale feeling of vague nausea and vertigo and the warm, energized belly chakra. I walked outside.</p><p>The late summer sky unfolded thin clouds like sheep's wool as the tiny shapes of swallows dove and swooped through the golden light. Things slowed down. I lay and smoked a cigarette in the back yard grass, breathed, let my mind drift. I was listening to the low song of the insects as I became more attenuated. Each breath became a pleasant wave. Cigarette lasted a long time. My vision of the cloud pattern shifted and shuttered strangely, but not uncomfortably. It was kicking in for sure.</p><p>A while after I finished my cigarette, I found myself writing stream-of-concsciousness imagery in my journal. Lovely stuff, actually.The bugs clicked in the trees. The dog sighed. I put on this fabulous Velvet Underground Live in 1965 and grooved for a while on the droning tones of John Cale et al. Colors red, orange green.</p><p>My dog and I decided it was time for a walk. (The sun was setting and I have a beautiful path to walk west through a sweet city park.) I hummed little verses to myself as we meandered over the rolling hills and grass of late summer. The fireflies were still swarming in the trees, a Catalpa stood thick with flowers and the dusk settled gently on everything. Down a washy hillside, I discovered multiple colonies of beatiful, vividly glowing mushrooms. I made my way slowly among them,  stooping to look at the babies and the larger caps. They were lovely but said 'don't eat us'. We wound up on a sandbar in the creek. The water trickled and bubbled musically as the fantastic colors of gloaming took over the sky. After a while, we walked on. I had almost a hovering feeling, but still connected to the earth. Lights would glow under trees then extinguish themselves. Trails in the vision.</p><p>On up the path, in a huge clearing, I lay on a hillside while the dog alternately ran around and lay next to me. The clouds and stars against the indigo sky began to form giants and gods. Very cool. I considered that, aided by plants, the ancient peoples could very easily have conceived of those constellations we now strain to see with our screen-bored eyes. One particular figure lingered and watched me. Big guy with a beard, wearing a skin, carrying a club, but not Orion. Sounds swirled around and untraceable voices floated by on the breeze. I heard little songs, sand along, laughed to myself.</p><p>Then shhhwoop! Things just rushed to a point and stopped for a minute of clarity. I'd been there what seemed like an hour. I began walking home slowly along the sidewalk. Big, majestic trees hung dark with their strong, ancient power. Ohhhhh, sadly, I stepped on a piece of glass. I know, I know, I should have been shod, but I couldn't bring myself to put on shoes. The evening was simply too nice and the trip seemed to ask for bare feet. *So tripping on strong cactus is not a good state to be in when you step on glass. Each step was a combination of sharp pain and rubbery nerves. A little time spent in the shower with tweezers  was frustrating and a buzz-kill, not to mention very difficult in my addled, cross-eyed state. But eventually, I found myself lying on the couch, watching little colored lights zip past each other on the crown molding, the walls blossoming with red and green and orange, listening to Eszter Balint. My wife came home, told me happy birthday. I told her I was tripping but coming down. She thought it was funny, but I think she humored me since it was my birthday. We sat and talked and I slowly came out of my pleasant daze. It was now my birthday and I had already celebrated it in style.</p>",
 "year": "2004",
 "id": "43669",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-10-11T07:00:00.000Z",
 "views": "6529",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 oz",
   "administration": "oral",
   "substance": "Cacti - T. bridgesii",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 }
}
