{
 "title": "Goblins and Ghosts",
 "author": "Frank G",
 "citation": " Frank G. \"Goblins and Ghosts: experience with Mushrooms - P. cyanscens & Cannabis (ID 43685)\". Erowid.org. Sep 10, 2008. erowid.org/exp/43685",
 "substance": "Mushrooms - P. cyanscens & Cannabis",
 "bodyweight": "185 lb",
 "report": "<p>This is probably the 7th or 8th time I've done psychedelic mushrooms, nothing really I'm not used to, but then again, I've never really had a bad trip before, or at least, nothing I couldn't handle. I was with a buddy Kris, we are both 16, we pooled together some cash, me and my buddy, and went bought a half-ounce or so, roughly 15 grams. We ate them at my mom's house. He ate an estimated 5.5 grams or so, much more than his previous experiences. I ate about half of what he ate, deciding I wanted to gauge the strength and see what it was like, just because I heard cyanscens were crazy good mushrooms, but have never had the experience.</p><p>At that point when I stood up it felt like my arms and legs were hacked off slow. We were going to a different town, meeting up with another buddy, who was 18, my friend started feeling them half way to the other town, claiming my mom was a skeleton monster. I felt it a little, but not enough to gauge the strength, foolishly I ate the second half, and a pinched half a stem off my other buddies stash, who was also eating these mushrooms, I ate a total of about 6 grams, approximately. Anyways, when we made it to my other buddies house, that's when I started feeling it, not too much to trip out on in someone's house, but I noticed a stage quite similar to drunkeness, ya know, colours appeared sharper, mainly, and then a bit of uncoordination within my walk. He had this huge dog, about 200lbs, when it stood up it looked like a bear. Anyways, it never really liked me, but I didn't think much of it, me and my buddy, Kris, just to verify who he is in case you're confused, we're both looking at who we were in the mirror, for Kris, the experience was almost peaking because of how quickly he ate all his.</p><p>We handed over the bag of mushrooms to my buddy, Colin, and I felt kind of stupid because, he didn't want to eat the whole bag, just half, but I kind of pressured him into the whole bag. Our plans were also changed, we went to some random house in another town, place I've never really been to before, but that's when I assumed it'd be a pretty chill and good trip, I was feelin pretty good.</p><p>When we got there, I had the experience of meeting new people, by that time the trip had fully set, I was having an amazing time, just making new friends, chattin it up, thinking about psychology, and how their attitudes were based upon their upbringings, you know, usual stuff, how everyone is in competition, wanting to be superior. The reasons why people talked about those kind of things. It was at this point I forgot Kris was there, Colin was sitting beside me, but he wasn't looking very good. He went into the washroom and started puking, I should have really know something was weird at that point, but whatever I guess, I was still having an amazing time. Kris was sitting there with a huge smile and a pipe in his hand, took him forever to smoke his little personal, but then again it didn't take me much less.</p><p>After we smoked a gram each of this really gummy indica, highly potent, is when all the hallucinations began to amplify, I was seeing hyroglyphics in the coffee table, trying to interpret them, it was as if the pharoah was shooting a slingshot at this bird and the bird's legs were broken by the rock. The shadows of the lights looked like spectres, and other forms of ghouls and ghosts, but I usually see those anyway. It was like their was a third layer to the atmosphere. I was contemplating the basis of life and our creation, and how in space there is really nothing, and the stars blow up, killing us all, reforming the planets and enabling life to start over again, assuming the conditions are proper. I saw the endlessness of the universe as one, and realized how people use it as a metaphor for God, I'm not religious in any way.</p><p>After an hour or two, I sat back and took a breath, and that's when I had this crooked feeling all over my body, and I felt extremely nautious, the hallucinations intensified by probably 3x, seeing goblins and ghosts everywhere. I went to puke, withdrawn inside my own head, as if I was 10 seconds behind everything. I looked in the mirror, having no idea who I was, where I was, or who the people I was hanging out with were, it was like I was trapped in an unfamiliar world, that was horrifying. I began to dry-heave, feeling like needles were shooting through my back. The problem was, that Colin left because he was having a horrible time, he wasn't into his trip though, he puked most of the mushrooms out, had a level 1-2 trip at most, which isn't anything really special. So we were at this random house, no idea where we were or who we were with.</p><p>I decided just to go back out the couch, as dry-heaving felt useless and I was seeing red daemons in between the cracks of the tiles, and every crack actually that came to my perception. I sat there, feeling like I was melting, feeling like I was in eternity, like the trip would never end. It was this point I understood the feeling of eternal pain, of being caught up in a concept of hell, forever. It was the most horrifying thing I've ever experienced in my LIFE. I was white as a ghost, sweating a cold sweat, contemplating whether or not we took bad mushrooms, because physically going white isn't really something I consider a happy positive sign. Kris was white, and was twitching unimaginably, I got up to help him but I felt like I was helpless, like I understood exactly what he was going through, that feeling that no one could help him, or myself for that mly and I smashed my head, didn't realize it too much, and sat back down, trying to avoid any negativity.</p><p>Eventually, I got Kris beside me, and we talked for a bit, about our old lives, about the experience, and played some Xbox tennis, drying to divert ourselves physically so our minds would be more busy, and eventually, as the cannabis came to a deep burnout, we steadied out of our trip. I went home that night shaking afraid to fall asleep, talked on the phone with my girlfriend for 4 hours, till about 5 am, she was worried, and I was worried.</p><p>The next day I wondered what happened to Kris, we eventually had my mom come and get it, she drove him home, she's very understanding, didn't give us trouble, knew what we went through and what we were doing the whole time.</p><p>Not much I can say, but I've never had a bad trip before that, and since I've had bad trips, so I've stopped chewing until I can get over the fear of a bad trip, and learn to embrace the experience better.</p>",
 "year": "2005",
 "id": "43685",
 "gender": "Not Specified",
 "timestamp": "2008-09-10T07:00:00.000Z",
 "views": "2946",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  },
  "2": {
   "time": "",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
