{
 "title": "I Can't Keep My Eyes Open",
 "author": "Unimportant",
 "citation": " Unimportant. \"I Can't Keep My Eyes Open: experience with Amphetamines (Adderall) (ID 43745)\". Erowid.org. Sep 23, 2007. erowid.org/exp/43745",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "108 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Amphetamines",
   "(capsule)"
  ]
 ],
 "report": "<p>Who would have guessed you could find such an amazing rush of emotions in a capsule? The intensity of simply scratching my scalp while in the hands of Adderall is outstanding and I could not possibly feel better about any of this. And isn't it ironic.</p><p>For a year now I've been chomping down Adderall which, I might add, has never once been prescribed to me. I'm currently in high school and when it comes to grades, I've always had complete lack of ambition. One of my friends suggested that I may have ADD and I should probably see a doctor about it before my grades decline anymore. Of course, me being as shy as I was, I couldn't even bring myself to tell my own parents I was having trouble paying attention in school and that I felt very apathetic in school. Hence, plan B: Make new friends.</p><p>I met this girl in gym class who had recently gotten a prescription of Adderall and we became good friends. Eventually, she noted my lack of motivation and offered up some of her adderall. Actually, initially, I offered some Adderall to her, which I had previously stolen from another friend, and she got her doctor to prescribe her some. I quickly became an addict and I've denied it all year promising myself it was more than possible to stop at any given time, I just didn't want to. Anyway, this girl who we'll call Anna, gave me more and more because I kept insisting she help me out as a friend. I then suggested that Anna go back to her doctor and tell them it's not working well enough and it wears out about half-way through the day. Thus, her prescription kept rising.</p><p>Anna pulled this stunt for me every time I told her to, eventually reaching 30mg capsules for a 105 lb. girl. This was obviously an ample amount for both of us to handle, and I kept insisting on more and more. At the beginning of each week, I would receive 5-10 30mg. capsules of Adderall.</p><p>About 2/3 through the year, I noticed how drastically my social skills have changed. I've always had a lot of friends, and I've always been the outgoing one in school; however, for nearly all of my second semester, I realized how bitter and resentful I was around people when I hadn't consumed enough Adderall or if it was even beginning to wear off. I still have quite a few friends, but they've certainly noted my general hatred for everyone and my somewhat anti-social thoughts/behaviour; some of my friends have even confronted me about it more than once.</p><p>For example, one boy we'll call Joe had a bit of a liking for me, so he invited me to his house. By the end of the school day, the euphoric effects of Adderall wear off quickly and my mood shifts from extremely happy to bitter and spiteful. Joe, not ever realizing this before, was genuinely excited to have me over and tried to engage in thoughtful conversation about whatever. I was definitely crashing. I ended up hardly saying a word and constantly making situations very, very awkward. After Joe saw me like this several more times, he began to complain. When I tried to explain, it pretty much ruined that relationship and we haven't hung out since.</p><p>Adderall has brought me to many places. Gradewise, I was much improved. Adderall allowed me to open up in front of class, raising my hand much more often, questioning things, et cetera, and take much more efficient notes. Also: I've never really studied for a test that hard in my whole life. Even with adderall, I still didn't study for tests, but before big quizes/tests/exams, I always took a fair amount of Adderall and my reasoning for things seemed so much clearer, and I felt this gave me a great advantage. My test grades have improved greatly. Projects become more in depth and thought out. Although they may become a little excessive, my overall project had a persuasive vibe about it.</p><p>Despite how much Adderall may have helped me this year in school, I would do anything to go back before I had ever heard of adderall, before anyone suggested ADD, before anyone offered me anything, before I became so careless and drug friendly.</p><p>Walking around the school at lunch, I've noticed I think paranoid thoughts often. Adderall has also seemed to create some symptoms of OCD: skipping cracks, insane amounts of cleaning, organizing of all school work, checking the same grade more than three times a day, not touching doorhandles, not using public restrooms, chewing on my cheeks eventually swallowing large amounts of blood, scratching at my face unable to stop for more than a second or two, biting my nails until they bleed and then a little more, writing very long journal entries multiple times in a day at certain hours, and quite a few other tics.</p><p>Overall, I would say Adderall has made my life an intense version of hell with short releases of euphoria. I promised myself all year I would stop this summer and now here I am, still going strong, stronger than ever. I regret all of this. I've created awkward gaps in the relationships with my friends. I hardly recognize myself anymore. This cannot be happiness. This can not be improvement. This is me crashing. I regret my actions every day. When intense hunger hits and I am reminded of what a waste this year has been because of a simple pill and my poor decision.</p><p>I'm home from school, I started this entry quite a while ago, and I feel as though I should curl up and die. These are my pupils getting smaller, this is hunger hitting and cheeks bleeding and my life completely going to a warped, apathetic-like depression. 'Trip' always reminded me of 'vacation'. Adderall is no trip, we're here forever.</p>",
 "year": "2005",
 "id": "43745",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-09-23T07:00:00.000Z",
 "views": "12075"
}
