{
 "title": "A Full Barrel",
 "author": "Meperman",
 "citation": " Meperman. \"A Full Barrel: experience with Promethazine (ID 43767)\". Erowid.org. May 8, 2006. erowid.org/exp/43767",
 "substance": "Promethazine",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "75 mg",
   "oral",
   "Pharms - Promethazine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I have taken promethazine before, yet in combonation with meperidine in my favorite capsule called Mepergan Forte.</p><p>Yet my friend recentley was prescribed a bottle of 25 mg promethazine tabs only. Of course he called me up to make a few bucks.</p><p>That night at around 6 PM I took 3 of the tablets.  Before swallowing I snapped them in half on the scored line.  They were quite hard to break actually.  Dont no if that made a difference or not but I broke them anyways.  I swallowed the 3 tabs, 75 mg in all and waited for effects.  I new that on Mepergan I felt a heavy alcohol buzz and a warm heavvvvy sensation.  So I sat and wondered which of the effects would stand out tonight.</p><p>I played cards with some friends and after about 45 minutes the tabs had almost completely set in.  I felt a decent alcohol buzz along with an anxious feeling I cannot describe.  Its not an ampheta type of anxiousness yet a axniousness with which I didnt even think about pursuing nor was I intrested.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] After 2 hours of feeling this my friends decided we should goto another friends house so I drove over and on the way I saw several hallucinations. </p><p>It was dark out and I was driving down a road, feeling the effects of basic alcohol comsumption, Lagged time, blurry vision.  I approached my friends apartment complex and noticed a man standing infront of a doorway. I turned my head and looked back and no one was to be found.  I then pulled up to my friends building and noticed a girl sitting on the stairs.  I turned off my car and looked up to see nobody.  This insanely freaked me out because I didnt know if I was hallucinating or not since my lagged time vision and blurryness, yet these people were so real looking. </p><p>After I arrived at my friends house I felt the anxious feeling plaguing me extremely heavyly.  This is the most uncomfortable and annoyed ive ever felt in my life.  I just wanted this drug to be over extremely bad. I cannot stress how bad I was annoyed and fed up with promethazine.  I felt like id rather die than endure this feeling of coming down for another second. </p><p>At about 1 I drove home with the effects lessing but tiredness increasing.</p><p>I awoke in the morning at 10 A.m. extremely sedated still and extreme tiredness plaguing me.  I felt almost numb.  I went to turn on the shower and I felt myself push the handle up yet, milli seconds after I had done this task it was as if I relieved the physical feeling of turning on the shower.  This repeated feeling is the weirdest feeling ive ever felt from any drug.  It was as if I actually did it again, yet my hand didnt move, but in my mind I felt the physical touch.  This happend several times when touching the soap and shampoo.  Absolute weirdest feeling, its like the opposite of trying to move a limb that has been severed. yet ive never had any limbs severed, that is all I can relate it to. </p><p>I dont plan on ever taking this drug again due to its extremely annoying and eerie side effects.</p>",
 "year": "2005",
 "id": "43767",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-08T07:00:00.000Z",
 "views": "38266",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Pharms - Promethazine",
   "form": "(pill / tablet)"
  }
 ]
}
