{
 "title": "Insanity in a Box",
 "author": "Fireez",
 "citation": " Fireez. \"Insanity in a Box: experience with Dimenhydrinate (Dramamine) (ID 43764)\". Erowid.org. Sep 19, 2007. erowid.org/exp/43764",
 "substance": "Dimenhydrinate (Dramamine)",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  "1150 mg",
  "oral",
  "Dimenhydrinate",
  "(pill / tablet)"
 ],
 "report": "<p>This is a report of my second experiment with this drug. Initially I took 10 pills and had very little effects beyond drowsiness. This second experiment was only a few days later as I had a good deal of the pills left over. I was hoping for more effects this time around but was doubtful. I took the 23 pills and started to just kinda chill. I believe I may have hit a pipe that was going around but I am not sure. The effects came on rather subtly. With most hallucinogens I have been able to identify a come-on but with this I could not. I did notice severe nausea coupled with an inability to vomit. This is possibily because I ate a snack immediately after taking the pills.</p><p>Throughout the experience I think the most common effect was severe auditory hallucinations. However, I am not certain how many of these I had. They did not seem at all unreal. In fact, several of the instances I did not know where hallucinations until I was informed the next day. In fact I responded to 'How many states are in the union?' with 'The African Swallow I think.' Definatily need to be around a very patient trip-sitter.</p><p>Also my communication skills broke down and I frequently would leave statements unfinished or speak about completely non-existent events. I seemed to be recalling false memories, an effect no drug had ever caused me to experience before. I also had three major delerium instances. I would call these hallucinations but they go beyond that term. The first was when I removed my rings to wash my hands. I saw and heard one ring go down the drain and could not retrieve it. I went to get my boyfriend and explain this to him. He came out of the bathroom holding the ring which had never left the countertop but I had been completely unable to see.</p><p>The next major instance occured when I went to remove my contacts. I thought I had taken the left one out and dropped it so I began to look on the floor using only my right eye. I thought the contact was still in this eye and could see clearily through it. Upon giving up and opening the case to take the right one out, I found both contacts in the case and my vision immediatly blurred. I have no clue how the effects of a drug made me able to see clearily. I am severely near sighted.</p><p>The final major event is proof that I needed a trip-sitter. It began with me thinking I saw a bug in the bed. I soon was certain that all the small moles on my arms (at least 12) were ticks. I have an extreme fear of ticks and started scratching and pinching trying to remove them. If not for the efforts of my tripsitter I would have severely hurt both my arms. I could feel the 'ticks' and see both their legs and heads and see them move. I also was certain that moles that I had always had had not been there before that night. This drug is the most intense drug I have ever experienced. I have taken up to 10 hits of acid at once and a countless amount of mushrooms, none of these have caused such an extreme experience. I truely felt completely insane.</p>",
 "year": "2005",
 "id": "43764",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-09-19T07:00:00.000Z",
 "views": "5698",
 "dose": {}
}
