{
 "title": "Aspirin/Water miracle",
 "author": "tch",
 "citation": " tch. \"Aspirin/Water miracle: experience with Cannabis & Drug Testing (ID 43769)\". Erowid.org. Sep 10, 2008. erowid.org/exp/43769",
 "substance": "Cannabis & Drug Testing",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Cannabis",
  "(daily)"
 ],
 "report": "<p>I passed a drug test a mere 36 hours after a long moderate binge, smoking cannabis at least once a day, if not more, that had lasted a couple of weeks.</p><p>Here's the backdrop.  I had been job hunting for awhile, and while there was this one lucrative position that I knew required a drug test, everything else I applied for didn't require a test, so when I hadn't heard back from the good job for awhile I started smoking up, thinking it didn't matter. I get a call one day, and it's the company saying they want to hire me and I have to go in to take a drug test, and I would get a call to schedule it.  Oh fuck.</p><p>So, first thing's first.  I IMMEDIATELY run out and buy cheap detox capsules, and I also buy some aspirin.  I take four aspirin (standard 325mg aspirin) upon getting home, start chugging down water (probably accomplish 1.5 liters before I got the call), and wait for the call to schedule the test, running on the assumption I was going to have to take it that day.  I get the call, and they want me to go in early the next morning, good thing I didn't take those detox capsules in preparation, or I would have been up shit creek.  However, I wasn't happy about having to wait out the 'blah' I felt after taking four aspirin.  Nothing else of interest happens that night except I eat half of a large pizza.</p><p>Next morning I wake up at 4:00 AM and take four aspirin and start pounding down water, the aspirin and the pizza remaining in my stomach have an adverse reaction, and I throw up violently.  I sit down, start slowly sipping the water this time, and this time take 3 aspirin instead of 4, just so I wouldn't over-do it had one of the aspirin managed to stay down.  I drink about a liter of water, take a multivitamin, and I go back to bed and wake up at 7:30.</p><p>At 7:30, I wake up, take the detox capsules, and pound down another liter of water.  I leave for the testing place at 8:20, and stop at a gas station and grab a 20 oz. bottle of Gatorade (591 mL for those of you on metric).  At the gas station, I run back and pee right quick (I hadn't had a major piss that morning yet), and then proceed to the drug testing facility.</p><p>I arrive around 8:40, and naturally they are running late. Not good because I have to pee like RIGHT NOW! Finally I can't stand it anymore, and ask the lady at the front desk if I can use the restroom, whispering to her that I don't want them to wring the sample out of my pants. She let's me go, and tells me to start drinking water immediately after I get done. I start peeing, and oh my god it was a flood.  MASSIVE amounts of urine come out at that point.</p><p>I go back in the reception area, and grab a can of Sprite from the soda machine, and the receptionist says 'I SAID WATER, NOT SODA.'  I give her a look like she'd just made fun of my dead grandmother, and she replies 'just kidding.'  Seems like people who don't give a fuck about your privacy are always so kind and joking...twat.</p><p>Anyhoo, I'm finally called back, and these people don't ask me to list any medicines I've taken or anything, the nurse just sends me into a bathroom, and tells me to pee in a cup, not to flush, and not to wash my hands, and also pours some blue shit in the toilet.  I didn't worry about putting my 'mid stream' in the cup, considering that just 20 minutes before I had pissed out just about everything.  I put the first bit of the stream in the cup, and then finish my duty, and missed the toilet when I quit peeing in the cup.  I'm immediately told I'm free to go, they never asked me if I had taken any medicines or if I was on any perscriptions.</p><p>So it's all signed, sealed, and delivered, and 3 days later I get a call saying I passed my drug test and am to come into work the following Monday.  So in summary, my experience shows that it's possible for a daily smoker to have their system clean 36 hours after smoking their last joint/bowl.</p>",
 "year": "2005",
 "id": "43769",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-10T07:00:00.000Z",
 "views": "26545",
 "dose": {}
}
