{
 "title": "Glad to Experience It",
 "author": "Jacky",
 "citation": " Jacky. \"Glad to Experience It: experience with Lagochilus inebrians (extract) (ID 43775)\". Erowid.org. Sep 10, 2008. erowid.org/exp/43775",
 "substance": "Lagochilus inebrians (extract)",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "20 mg",
  "inhaled",
  "Lagochilus inebrians",
  "(extract)",
  "",
  "20 mg",
  "insufflated",
  "Lagochilus inebrians",
  "(extract)",
  "",
  "40 mg",
  "insufflated",
  "Lagochilus inebrians",
  "(extract)"
 ],
 "report": "<p>I was eager to finally try a pure isolate of lagochilin that I had finally sourced. I had been involved with getting lagochilus earlier than this experience, and consumed the herbal product a year or so ago. I had been ripped off a substantial amount of money initially by an inept Albanian doctor who sent me kilos of the wrong material. So I was very eager to push the envelope of dosage of the reputed desired psychoactive component, lagochilin.</p><p>It was around 11pm after work. I had taken some daily opiate dosages earlier that evening, and a few hits of cannabis a few hours prior, but being a regular user I was pretty much baseline. I am perticularly interested in diterpene pharmacology, and thus so far have rounded up several plant species that contain active diterpene compounds, one is even a kappa opioid agonist, and a beta endorphin type agonist. looking at the reports of usage and effect available on lagochilus I considered that diterpenes similiar in structure found in lagochilin might perhaps be a gabba, benzo, or opioid agonist in nature of effect. So after work I vaporized 20 some milligrams of this lagochilin in a clean glass ginseng bottle, the material harsh, and raspy but not too bad tasting. Mildly floral, the scent was noticeable I think in the smoke of the whole plant.</p><p>What I considered might be a mild effect seemed to creep over me, a mild stimulating feeling, clarity of mind, but nothing strong. So I layed out 3 20 some milligram piles of the material and insuffilated roughly 20 milligrams. The material burned ever so slightly, and seemed to dissolve and saturate very quickly. After waiting 5 minutes, and sitting in a relaxed mode in my basement study, I finished the last 40 some milligrams.</p><p>10 minutes later I find myself feeling pretty good, comfortable, and mildly stimulated, the amount of plant material in my nose was about gone, and I noticed a general feeling of well-being. As the night went on, around 1 pm I started nodding off at the computer, which is NOT a normal thing for me to do, even when taking my moderate daily dosage of a pound of poppy seeds, 150 milligrams of tramadol, and a 3rd of a gram of 50% alkaloid kratom extract throughout the day. I sat and nodded and scanned the internet in a very relaxed and interested state until sleep got the better of me, and I woke up at 3:30 am and went to bed.</p><p>I felt no hangover in the morning, like higher dosages of opiates will do to me, and no hangover like taking large amounts of gaba might. I will try higher dosages probably. I am very glad to have had the experience of searching out an unknown and finally getting the chance to experience the material. I have moved my main interest on to other plants that are very rare or non existant for all I know in the united states, mostly opioid in nature, and some with real 'potential'. I think lagochilus should be taken up as a possible medicinal herb, it has already been profiled by the American Botanical Council as such, seems like ethical harvesting and supply/price is all that is holding back lagochilus as a herbal supplement.</p>",
 "year": "2005",
 "id": "43775",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-10T07:00:00.000Z",
 "views": "23057",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "inhaled",
   "substance": "Lagochilus inebrians",
   "form": "(extract)"
  },
  "1": {
   "time": "",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Lagochilus inebrians",
   "form": "(extract)"
  },
  "2": {
   "time": "",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "Lagochilus inebrians",
   "form": "(extract)"
  }
 }
}
