{
 "title": "Pure Synergy",
 "author": "DK",
 "citation": " DK. \"Pure Synergy: experience with Salvia divinorum (ID 4384)\". Erowid.org. Mar 6, 2001. erowid.org/exp/4384",
 "substance": "Salvia divinorum",
 "bodyweight": "160 lb",
 "report": "<p>I tried salvia for the third time yesterday.  Wow.  The previous two experiences were but mere glimpses into the real realm.  I took one good sized bong load and held it inside for at least 15 seconds, as i started to exhale it hit me.  Totally unique experience, nothing at all like any other psycadelics i've tried.. Salvia  is the first tryptamine that i have ever ingested and there was no way for me to even try and comprehend was was to ensue.</p><p>Five seconds into the trip, the entire room/world/universe completely disolved and all that was left was energy, raw energy.  I couldn't comprehend that there had ever been any other way than this way, this was how the world was, and had always been.  I immediately forgot that i had smoked any salvia at all, just all of a sudden i found myself in this realm where i was energy, in the music, in the air, the light, even my motion.  This energy force i had become could move around, both mentally and physically and everywhere i would move my body, or arms, a force of energy would carry me there.. I melded entirely with the music, at one point i recall saying to my friend Renay, this song is saving my life.  It was as if the song playing (They Love Each Other)was my soul being layed out before me. </p><p>As the effects slowly wore off and the song started sounding more and more comprehensible in ordinary reality i knew i was going to return to my normal mental state and had been given a glimpse into a whole new dimension. Truly the most astonishing substance i have ever experienced.</p>",
 "year": "2000",
 "id": "4384",
 "gender": "Male",
 "timestamp": "2001-03-06T08:00:00.000Z",
 "views": "11434",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
