{
 "id": 4388,
 "title": "Permanent Heart Damage",
 "date": {
  "submission": "2003-12-08T08:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "ZFunk",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>I am going to start by saying that this happened a long time ago, but I thought my experience was worth bringing back. When I was 12, my dad committed suicide. I started having problems at school, and the head doctor decided I had ADHD, so he threw my mom a script for Ritalin. Little did I know, this drug would leave me with a disorder that still haunts me today.",
  "After about the third day of taking it (at the DOCTOR prescribed dose, 25mg I think), I noticed a strange feeling in my chest. I felt over my heart, and my god, my heart was beating so fast. So fast that I immediately got scared and told my mom. After going to a bunch of doctors, including a cardiologist, I was diagnosed with Supraventricular Tachycardia. This condition, SVT as I call it, makes it so that if I have a rapid fluctuation in blood pressure (eg, bending over for about 10 seconds and then walking around) my heart will go into a mode where it beats two times as fast as it is supposed to. This can only be stopped by holding my breath out until I am near passing out, and then swiftly breathing in. Needless to say, this condition is the limiting factor in what I want to do with my life. I had plans to join the military, but even with them not knowing about the Ritalin I still have this heart condition. I know I can have surgery to fix it, but I don't trust ANY doctor to mess with my heart. Maybe eventually I will get it fixed, but not for now.",
  "In summary, this drug has left me with a heart condition that limits what I can do everyday. I get heart palpitations sometimes up to 15 times a day (it happens less when I am in shape, but still happens) and I have to stop to correct my heart beat. Thee is nothing scarier than running for a half mile, stopping for a second, and then having your heart rate double on you when it is already pounding. Not to mention the constant migraines with the medicine to STOP my SVT flares.",
  "If you have a history of heart conditions in your family, don't even CONSIDER using ritalin. The permanent consequences are not worth the up effects.",
  "[Erowid Note: The cause of SVT, according to a number of medical references, is genetic/physical predisposition.  Other medical references suggest that certain diseases, surgeries, behaviours, plants, chemicals, and pharmaceuticals can cause or trigger SVT.  Uses of methylphenidate with a family history of SVT or heart problems should, as the author suggests, contact their doctor to discuss the risks.]</p>"
 ],
 "erowid": {
  "id": "28962",
  "citation": " ZFunk. \"Permanent Heart Damage: experience with Pharms - Methylphenidate (ID 28962)\". Erowid.org. Dec 8, 2003. erowid.org/exp/28962",
  "substance": "Pharms - Methylphenidate",
  "views": "30003"
 }
}
