{
 "title": "Long Term Methamphetamine Use",
 "author": "Sparky",
 "citation": " Sparky. \"Long Term Methamphetamine Use: experience with Methamphetamine (ID 439)\". Erowid.org. Jul 13, 2000. erowid.org/exp/439",
 "substance": "Methamphetamine",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "750 mg",
  "insufflated",
  "Methamphetamine",
  "(powder / crystals)"
 ],
 "report": "<p>I tried my first dose of Meth around August 1996, my life was starting to spiral down around me and things were getting pretty difficult to deal with.  My wife (thankfully now ex-wife) was a hard core speed freak, and I the anti-drug.  She got me to try it once, and that was all I needed.  First time through was a tiny little line of this brownish-looking sticky stuff, probably cut a few dozen times with God only knows what.  It wasn't all that great, put me in a pretty good mood for a few hours, but still enough to get me wanting more.</p><p>When I got back home to California (this all started in Florida, as I was leaving the Navy) it really started in earnest, I learned how to purify it to try and minimize the effects of the cut.  I went from 165 lbs when I started to a shade under 120 (damned thin for six feet tall!) and my trips lasted longer and longer.  Once towards the end I stayed up an entire solid week, rewiring a friend's (also my supplier, seriously good stuff!) Volkswagen bus.  By the end of that trip I was so tired and shaky that I was hallucinating more than any LSD ever made me.  I didn't even know where I was, just that I was high and fixing something.  I was always really laid back, not a care in the world, as long as I had the drug and something to tweak on I was happy.</p><p>Then in late December, after hitting rock bottom (and neither noticing nor caring), my girlfriend, one of our mutual friends, and I were in my VW bus in a parking lot (where we all lived at the time) getting very much spun when...bright lights...cops with guns...Miranda rights...oops!  They found almost a full 1/8th ounce (8-ball, roughly 4.3 grams) in the van, and that was the end of that story.  My GF was extradited out of state for a prior she had there, my friend gave 'em a fake name and was never heard from again, and I got 2 years of probation.</p><p>I've been clean off Meth for a little over three years now (I had to go clean for my probation, due to frequent random piss tests) and I'm still craving a line.  The worst part is that it screws up the parts of your brain that produce Serotonin, the hormone that makes one happy.  So now my brain is perpetually depressed.  Up 4 months, down forever.</p><p>Best advice to anyone thinking of trying meth, don't.  While it's not physically addictive, it's so much fun getting spun that you'll never want to stop, even as your life self destructs.  To those currently using it, be careful and please try to quit. The long term effects simply aren't worth it.</p>",
 "year": "2000",
 "id": "439",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-07-13T07:00:00.000Z",
 "views": "18845",
 "dose": {}
}
