{
 "title": "Fighting for Control of My Serotonin",
 "author": "AmIWeirD",
 "citation": " AmIWeirD. \"Fighting for Control of My Serotonin: experience with MDMA (Ecstasy) & Paroxetine (Paxil CR) (ID 43917)\". Erowid.org. Mar 4, 2011. erowid.org/exp/43917",
 "substance": "MDMA (Ecstasy) & Paroxetine (Paxil CR)",
 "bodyweight": "130 lb",
 "report": "<p>My friends and I decided it would be fun to take ecstasy.  I had taken it before and thought it was a sign from God that I should be happy.  It had been 4 years to the day since I had taken ecstasy.  So much had changed since then... I was no longer a runaway looking for a good time, I fancied myself an enlightened individual. </p><p>I was taking Paxil CR because of my social anxiety disorder and depression.  When my friend asked me to go to her boyfriend's house with her, I was looking forward to the outing because it meant that I got to be creative since he had designated me his muse.  When we got there, I thought I would watch them get smoke some pot and then we would talk for hours like we usually did.  Little did I know that we had more money than we had planned, and so could afford better drugs than pot.</p><p>We went to his friends' house and bought 10 pills.  When we got to our final destination at another friend's house, we divided them up; one for me, one for my boyfriend, one for my friend, one for her boyfriend, one for our other friend, one for his sister, one for her boyfriend, another half for me, and then a few lines for all.</p><p>Everything was going good, we were rolling down a hill, spinning in circles, smoking lots of cigarettes, and generally having a good time.  I decided to sit outside by myself for a few minutes, and that's when it hit me.  I started to sweat and shake and crave water.  As I got up to get the water, I felt a pressure in the back of my head.  I thought it was from sitting down for too long.  I was so wrong.</p><p>When I finally made it inside, I barely got a chance to ask for a garbage can before I started throwing up.  Thankfully, they had a large pot prepared for just such an occasion.  I went back outside for a while to sit and think.  By then, the pressure in my head was so great that I wanted to drill a hole in my head to relieve some of it.  My boyfriend came out and asked me if I was alright.  That's when I started crying and throwing up in earnest.  When I could talk again, I told him that I thought I was going to die.  I told him that I loved him and wanted to marry him some day.  I'm still not sure if he thought I was serious.  After a while outside with my boyfriend, we went back inside where everyone was blowing each other up.  I tried to ignore my pounding headache and have fun with them, but it didn't work, and I just ended up passing out on the couch.</p><p>The next day, I went back to my boyfriend's house and slept all day.  The day after that, we decided to give it another try.  This time, I only took half of a pill, and I thought I was fine for a while.  It wasn't until about two hours later that I started throwing up again and looking for a drill with which to put a hole in my head to drain the pressure.  It took me a while to realize that what I was going to do would kill me, but by then the headache started to recede.  Then some drunk girl came over, and the headache returned with a vengance.  Along with the headache came the paranoia that everyone hated me and that they were all making fun of me.  I called another friend to come and drive my boyfriend and me home.</p><p>The entire week after the rolling parties, I thought that my head would explode.  I stopped taking my paxil and I started to feel better.  During a discussion with my friend's boyfriend, we came up with the theory that the ecstasy and the paxil were fighting in my head for control of the seratonin. </p><p>Since I quit taking my paxil, I have been able to lose 20 pounds, while being a complete jerk to all of my friends.  A few months ago, I started taking Lexapro, and I've never felt better.  I don't plan on doing ecstasy again - ever.</p>",
 "year": "2005",
 "id": "43917",
 "gender": "Female",
 "timestamp": "2011-03-04T08:00:00.000Z",
 "views": "7169",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
