{
 "title": "Filters Knocked Out of Whack",
 "author": "Jimbo",
 "citation": " Jimbo. \"Filters Knocked Out of Whack: experience with LSD (ID 4392)\". Erowid.org. Dec 24, 2001. erowid.org/exp/4392",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "report": "<p>Before starting this, I feel I should give the reader a little background information. I had wanted to do LSD since I was 8 and heard about it on an MTV documentary (during which, my parents told me that if anyone gave me a stamp with a cartoon character on it, I shouldnt lick it). Later, during the summer after my freshman year in high school, I was reading newsgroups on the internet, and found a link to the lycaeums LSD archives. I read everything in there, and began my path into drugdom, becoming a veritable encyclopedia on Psychedelic drugs.</p><p>During my sophomore year, I began smoking marijuana, and when I felt I was sufficiently familiar with being in an altered state, I began looking for acid, though somewhat passively, and came close a few times, but nothing ever panned out. </p><p>Then in my Junior year, I was discussing this subject with one of my friends in my chemistry class, and she told me that a friend of hers had a vial and was selling sugar cubes for $5 a hit. I told her to get me 10 (I wanted it to last me a while), and told her to drop them off to me when I was at work that weekend.</p><p>That Saturday, while I was cleaning the deli, she came into the store and told me to come with her to her car. We went out to her car, and she handed me 10 sugar cubes wrapped in aluminum foil, and I gave her $50. She left, and I rushed to the back of the store and put them in my locker in a plastic bag. The next day at school, my friend C told me that his parents were going to be out of town for the weekend, so we made plans for me to spend the night Friday night, having him pick me up after work.</p><p>During the week I packed for the trip. I listened only to happy, light, positive music (mostly Aphex twin and other techno), and forced myself into a positive mindset. I smiled and greeted people on the street, I smiled more often, and I read The Psychedelic Experience by Timothy Leary. I also learned that someone else in my chemistry class got acid from my friend, and had done 3 hits, and since I was packing and knew just about everything there is to know about acid, I decided I could handle 4 (a dose I later guessed to be about 250-300 micrograms).</p><p>Well, eventually, Friday rolled around, and at 10:00 pm I clocked off work and went into the bathroom to change back into my normal clothes. Before beginning this process, however, I put one full sugar cube into my mouth and licked the foil it was wrapped in. Moron (who I thoroughly dislike) came into the bathroom. He was to be one of my companions for the night. We talked a little while I was changing, and I quickly surmised that he had smoked some cannabis earlier that night. We left the bathroom and met C (whom I did like) as we walked toward the exit. I stopped and purchased an orange on the way.</p><p>We then proceeded to Cs moms car. C and Moron urged me to take another of the sugar cubes I was carrying with me, so I did and licked the foil once again. We inserted Underworlds Beaucoup fish into the cd player and drove to Cs house.</p><p>When we got in, I popped the third cube into my mouth and licked the foil. At this point I was fully experiencing a coming on speediness, or maybe it was just my excitement. We sat in his room listening to some music while I took the last sugar cube (neither C nor Moron wanted any, they were set with smoking).</p><p>(at about t+45 minutes)</p><p>Within about 10-15 minutes, I felt a large amount of energy amassed in my left shoulder, and I had to let it out, so I suggested we go for a walk. They agreed. Before setting out, however, we went downstairs to visit Cs older brother, a former acidhead and a big group of his friends. They screwed around with me for a while, while I wore a huge, gelatinous grin on my face.</p><p>We went to a playground, and on the way back I began to see patterns in the light being cast on the ground through the trees, and at one point distinctly remember seeing a trail of long, flat, slightly geometric children on the ground stretching away around the corner. I wanted to follow the children to see where they went, but C and Moron wanted to smoke a bowl.</p><p>(at about t+1:30)</p><p>On arrival at Cs house, C and Moron turned on a clip from 2001: a space odyssey (yknow, the one at the end where the guys going through all those colors.) I was completely blown away by this. It was amazing, I had never seen anything like it. I was still smiling. When it got to the part where he sees himself dying, I at first saw a maze in the wrinkles on his face, and then as the effect became more and more prominent, I started to watch in awe as entire sections of the room in which the man was in began to shift and move and bulge.</p><p>After this, I was thoroughly enjoying myself, but C and Moron still hadnt smoked their bowl, and they were starting to argue. I found myself suddenly in the unfortunate position of mediator (which really isnt the greatest position to be in, in this state), and decided they both needed to calm down. I said something to this effect, so we went outside into the back of Cs carport so the two of them could smoke. We stayed there for what seemed like hours, and I felt slightly disgusted at the way these two potheads quibbled and inhaled a vile, sour smelling smoke from the bong and blew it out into the crisp night air. I thought if this is what smoking weed is like, I dont want to smoke weed anymore. This thought was further reinforced by the ensuing paranoia both C and Moron tend to get after just having smoked (though I probably would have done the same, were I not on acid). </p><p>(at about t+2)</p><p>By this point I was seeing some amazing visuals, especially in the grain of the curly maple dresser C has in his room, as well as amazing fractally, geometric patterns that were constantly separating and moving outward I even saw these in the mirror. C, by now was thoroughly stoned off his ass and said that he was higher than hed ever been before. He laid down on the floor, put the blanket over his head and started giggling in a strange, stoned sort of way, and began describing to me things that he was seeing, most of which I dont remember now, though he did say he saw a ghost with a white death around him now theres a fox. Oohh he poked him now hes running away. He was also talking a lot about things morphing. I however was seeing almost tribal line patterns on his face, and on mine when I looked into the mirror. This is when one of the strangest sensations I have ever felt took me. In looking at the tribal imagery on our faces, and the colors that surrounded them, I surmised that C was associated in my mind with good and happy and light and airy things (his tribal imagery was rounder and softer, and he was surrounded by blues and oranges), and the image of me in the mirror was associated not with bad things, but more uncertain, strange, unknown things, and I was very surprised at the sensation of being strange to myself (my tribal imagery, btw, had a concave round sharp look to it, and I was surrounded by black and blue).</p><p>(at about t+3.30)</p><p> At this point, Im pretty sure I was peaking, in that I was getting some mild ego dissolution, just sitting on Cs bed, existing.  We sat in Cs bedroom just talking about what we were feeling, and thinking that the other was experiencing the same thing. It was around then that C remembered about the orange. He ate most of it, and I had two pieces. The orange segments were the most amazing, paradoxical things I had ever seen. I just sat there, rubbing it, amazed at the texture and nature of this bizarre object in my hand. It was cool and slick like jet (the stone), and it was hard and soft at the same time. I realized that it was composed of hundreds of tiny sacks of water bound in a membrane, and it blew me away. C reminded me that it was food, and I put it in my mouth, where it seemed very meaty and chewy. It tasted wonderful.</p><p>(at about t+4)</p><p>We sat and talked a little longer, and then decided to go out into the living room where the tv and computer were. I must say that walking was a peculiar sensation. Cs older brother and his friends came up and screwed around with me again, which I enjoyed, and when they were done, C logged on to the internet and posted a message on a newsgroup about how he was on weed that he thought might have been laced because hed never been this high before, and how his friend (me, surprise, surprise) was on 4 hits of acid, and then babbled for a while, while I laughed. The screen of the computer was an endless myriad of shifting colors, which favored green and red (I had been seeing those colors throughout the night for some reason).</p><p>C turned on the tv to the cartoon network while I went to the lycaeum on on the internet to look for trippy things to look at, and was delighted to see that the image at the front of the website was just what I had been looking for. I stared at the mushroom stalks in the upper right hand portion of the image rising into oblivion, only to start again when I moved my eyes. I screwed around on the internet, and then went to the bathroom.</p><p>This, I think is the second most interesting part of the come down of my trip. I was staring at the floor and suddenly all the little specs of dirt and pine needles on the floor started moving. Hehe bugs I thought, and they instantly became bugs: thousands of ants crawling all over the floor and up the wall. Then I blinked and they stopped moving. Every little black spot and pine needle then acquired an electrical pink or green aura-esque glow and built in intensity until they exploded into swirls of black, viney, geometric swirls and patterns that integrated themselves with the pattern in the floor. I toyed with the concept that I was seeing through reality. It seemed like the floor was infinitely flat, and on the other side was the infinity of reality that was kept from us in our normal functioning, but this wonderful chemical had knocked my filters out of alignment, and now I was able to peek behind the curtain and see what reality was. It was then that C knocked on the door to make sure I was alright, since I had been in there for quite a while, and knocked me out of my contemplative state.</p><p>After that, as I came down (and wished I could, but knew I wouldnt be able to, sleep), I screwed around on the computer, watched more tv, and looked at the floor some more and the ceiling (I forgot to mention that the carpet on the floor was comprised of fractals that looked like dogs and cats, spread-eagled, holding hands, that kept spiraling outward, and the ceiling was covered in escher-esque lizards that also were fractal and spiraling outward.</p><p>Not much happened after that. Cs younger brother got up and I had breakfast with him (a bowl of frosted flakes), and then we (C, Moron, and I) went to go drop Cs older brother off at work and then go get breakfast (which Moron and I had already eaten, but I was still hungry, and Moron is black hole of a human being). We went to a mall that was nearby and got breakfast at a breakfast place. We wandered around, joked around a little, dropped Moron off, came back to Cs house, where I finished writing the first draft of this,  watched some tv, then went home and slept for about 22 hours straight. The next day, I felt somewhat depersonalized, and wasnt sure if I was reacting to some situations correctly. For the next couple weeks, I had incredibly vivid (and in a couple instances, somewhat disturbing) dreams.</p><p>As a later note, this report was written in chunks at different times in the day, and thats why the earlier parts of it are more poetic and playful than the later parts still, all in all, I think I did a good job. The background info was written about a month and a half afterward. In retrospect, I wish I had been left in the bathroom longer, to allow that train of thought to continue. Even with what little I had, I was able to put together a coherent philosophy based on things I had come up with long before the trip (the filters that we see reality through), and things that occurred during the trip (like the infinity of reality), that, although far from finished, is very satisfying and makes a whole hell of a lot more sense to me than the philosophies of other, established religions.</p><p>I also feel that having my mind knocked around like that has put me into a state where I must decide what path I want my life to take (I was torn between many things), and Ive begun leaning toward organic chemistry and music (to satisfy both my obsessive aspects: analytical and creative), and I feel that when I do it again, I will have to follow the path(s) that I choose now.</p><p>Overall, I have the say that this experience, while having some negative aspects involving the individual I have dubbed Moron, which I chose to omit, was overwhelmingly positive, and I look forward to the next time I get a chance to ingest that lovely substance again. I still have 5 hits sitting in my closet (I sold one), which I hope to be able to use on New Years Eve (you know what they say: the way you spend New Years is the way youll spend the rest of the year, and I would love to be able to do this on a somewhat regular, but well spaced out, basis).</p>",
 "year": "2000",
 "id": "4392",
 "gender": "Male",
 "timestamp": "2001-12-24T08:00:00.000Z",
 "views": "9330",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 }
}
