{
 "title": "Abuse and the Toll It Takes",
 "author": "AlmostGone",
 "citation": " AlmostGone. \"Abuse and the Toll It Takes: experience with Various (ID 43930)\". Erowid.org. Sep 11, 2008. erowid.org/exp/43930",
 "substance": "Various",
 "bodyweight": "200 lb",
 "report": "<p>I am a drug addict/alcoholic. I have used just about everything, and I smoke marijuana, drink, and pop pills on a daily basis. I'm a doctor shopper, and a thief. I get multipal prescriptions for drugs like Klonopin, Restoril, Soma, Lortab, Adderall, and Oxycontin from many different doctors and dealers. My whole life is centered around finding and using. At age 22 my health is poor. I have had three near fatal overdoses.</p><p>I'm physically addicted to many of the drugs I take and get very sick without them. I use anti-depressants, multi-vitamins, and many suppliments to slow down the amount of damage to my body, and to keep me from going over the edge. It is not a good existance at all. It started out as great fun, but has grown into a problem that makes me a liar, a thief, and a low-life.</p><p>I dropped out of school, I can't hold a job, my family no longer trusts me, I'm on probation for writing fake prescriptions, and I'm responsible for introducing dangerous drugs to good friends who then became addicts themselves. I never planned to end up this way, but I was too foolish and high to see it coming and now I'm trapped. I fight constantly with the part of me that wants to get help. I keep using out of fear and desparation. I've been high so long that the idea of sober living terrifies me. I'll get spun out on Meth or Adderall, then use downers or opiates to come down, and I don't feel comfortable around people unless I'm high or drunk. Anxiety, paranoia, depression, confusion, and loneliness are everyday feelings for me. I was able to get my GED, and I've held a job for a month now, but it is all on the edge of falling apart again because I can't pass a drug test for my probation officer. Not everyone who uses drugs ends up like me. Many people can handle their addictions and function well in society, but some people just can't and end up in a living hell.</p><p>Today I smoked a joint when I got up to get rid of my hangover, took 6mg of Klonopin and 120mg of Adderall, and now I'm off to buy some Vodka because it is my day off (but I would have done all this even if I did have to work today), and then I will do just about the same thing tomorrow. I'm a slave to chemicals!</p>",
 "year": "2005",
 "id": "43930",
 "gender": "Male",
 "timestamp": "2008-09-11T07:00:00.000Z",
 "views": "12369",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Various",
   "form": "(daily)"
  }
 ]
}
