{
 "title": "Passive Enlightenment",
 "author": "Realitybias",
 "citation": " Realitybias. \"Passive Enlightenment: experience with Salvia divinorum (10x extract) (ID 43948)\". Erowid.org. Jan 8, 2007. erowid.org/exp/43948",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "155 lb",
 "report": [
  "<p>Alright. Before I start this and explain the title, I need to delve into my background with Salvia. For a long time, I was a nonbeliever. I had tried salvia and never gotten it to work. It always failed for me. I've heard of some people blasting off with no problem. But all of my friends could also not do it. I wrote the drug off as a hoax.",
  "Fast forward to a month later. I looked through my stuff and found my old 10x salvia bag with a good 2 grams in it. So anyway, I took it out and decided that I was not going to give up on Salvia. I looked online everywhere for directions on how to break through with salvia. I wanted that experience, that high that takes me far past threshhold.",
  "I realized everything I was doing wrong as I searched through site after site. I kept my eyes open and would always do it with friends. I would jump around as if doing so would get me more high, or just to shake off that little numbing feeling behind my head. Little did I know that that very feeling was what would blast me off but 2 hours from when I am typing this very report.",
  "So I decided that this time when I did it, I'd lay down in my bed, have a sitter, stay completely quiet, hit the lights, and keep my eyes closed. I didn't give myself much of a breath between hits, and everytime I exhaled, I would just inhale more salvia. I didn't get a full 20 seconds, becuase I'm not experienced enough as a smoker. However, I made sure every breath I took had pure salvinorin. I also used a water bong, much different from last time. I had two friends do it before me, and they had excellent experiences as well. but now, onwards to my own.",
  "After three big hits and a few small sips in between, I layed back and closed my eyes. There it was again, that warm and numbing feeling throughout my body and behind my head. I couldn't quite place it. But this time, I didn't fight it. I didn't even open my eyes. It just felt like I was sinking into my bed. Then I had a powerful closed eye visual. Two sheets of paper were unfolding on a symetrical plane that I was shooting down at a great speed.",
  "BOOM! The speeding stopped. Not surprising. What was that music? Oh, it was the pink floyd I had loaded up earlier. My face felt like it was melting, and I had no choice but to allow my lips to just smile. I felt like my mouth had become some grossly exagerated length, and then my head felt all funny. I could move my chin down towards my chest infinitely. I later realized that I probably wasn't moving my chin at all.",
  "These minor halucinations were little compared to what would come next. I got up, thinking my high was over. It seemed nifty, but I was somewhat disappointed. I went to say goodbye to my friend, because it was getting late and he had to get back to his dorm. That's when I shook his hand, and I had the most enlightening experience ever.",
  "As I grasped his hand, I felt like I should be feeling my own hand, not his hand. Everything I touched, I felt like I should be feeling my skin, instead of whatever I was touching. Reality inverted itself in some strangely comforting and omnipresent way. I felt like I was everything BUT myself. I held the cell phone, but I felt like I should be feeling my own fingers.",
  "The best way I can describe this is that reality became completely passive. I did not hold the book, but the book was held by me. I did not control my body, instead my body was controlled by me. I felt like I could empathize with anything, but even moreso, I felt like there was this huge world out there that I was not feeling. I wanted so desperately to jump into whatever I touched. I felt as if everything that I could feel had deeper meaning, and though I expected to feel my own fingers from another perspective, I did not. Instead, I felt a numbness.",
  "Salvia has shown me to respect everything and it has made me realize that there are entire worlds within mundane items and everyday people that I will never get to realize. However, just the realization of the EXISTANCE of such great worlds and places makes me tremble, in a way. As my universe is slowly even now becoming active instead of passive again, I feel like my experience today was the most enlightening one I have ever had. This drug is a drug of relaxation and introspection.</p>"
 ],
 "year": "2005",
 "id": "43948",
 "gender": "Male",
 "views": "3479",
 "dose": [
  {
   "time": "0",
   "amount": "0.2 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "submissionDate": "2007-01-08T08:00:00.000Z"
}
