{
 "title": "Beautiful Geometric Patterns Everywhere",
 "author": "TheVoid",
 "citation": " TheVoid. \"Beautiful Geometric Patterns Everywhere: experience with 2C-I (ID 43943)\". Erowid.org. Mar 6, 2008. erowid.org/exp/43943",
 "substance": "2C-I",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   " T+ 1:00",
   "5.0 mg",
   "insufflated",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "43943",
   "Male",
   "",
   "Not Given",
   "Mar 6, 2008",
   "4478",
   " "
  ]
 ],
 "report": "<p>LSD was always my favorite drug and I have not had connections for it for a long time.  I read about 2C-I and decided to give it a try.  It was described as similar to LSD and 2CB. I'm very experienced in hallucinogens.</p><p>I purchased 100mg from a reliable seller.  I eyeballed 5 piles of 20mg each.  I took one pile and made it into 4 piles of 5mg.  I put 20mg in a small shot of water and downed it.  My friend put 5mg in his beer.  \r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]</p><p>I started to feel it in about a half hour.  My head started feeling very pleasantly cloudy.  Colors intensified.  After 45 minutes, I could see the carpets and walls making shimmery waves.  This breathing movement was very much like a moderate dose of LSD.  It would usually take me at least 4 hits of LSD to get the visuals I was getting at this point, and this is only an hour into the trip.</p><p>So exactly one hour into the trip, my friend who had drank 5mg decided to snort 5mgs. I snorted 5mg as well making my total 25mg and his total 10mg.  We immediately felt a rush coming to our brains from the insufflation.  The visuals are now getting very intense.  I am seeing beautiful geometric patterns everywhere.  They are similar to LSD visuals, especially with the melting movements.  It usually takes me 6 hits of LSD to achieve these kinds of visuals.  </p><p>I played Viewtiful Joe, an extremely visually trippy video game, and we watched Fear and Loathing in Las Vegas, which was the perfect choice.  I really enjoyed 2C-I.</p>"
}
