{
 "title": "Turn It Off",
 "author": "Ninja Juice",
 "citation": " Ninja Juice. \"Turn It Off: experience with Salvia divinorum (5x extract) (ID 43952)\". Erowid.org. Jun 23, 2007. erowid.org/exp/43952",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "125 lb",
 "report": [
  "<p>Background:",
  "No meds or vitamins are being taken at this time. I had smoked weed probably about 5 hours ago, but I was no longer high. I consider myself in fairly good health. I have smoked salvia 5x extract but at the time I was not aware that I was supposed to hold in the smoke. It was a fun experience, which consisted mostly of hysterical laughter and very mild visuals, but not very intense. Other drug experience includes: Cannabis, cocaine, shrooms, DXM, codeine(only opiate experience), and other various pharms. ",
  "Its late in the afternoon, on a Tuesday. To my delight, all other occupants of the house decide to leave. I was Killer Klowns From Outer Space, but having seen it a few times before, my mind soon begins to wonder towards the gram of Salvia 5x I had received in the mail yesterday. I call up my homie, K, who Ive known him nearly my whole life, and was with me the first time I tried salvia. Anyway, so I call him up and tell him to come over and smoke some salvia with me. He promptly arrives and were soon sitting down in my room while I carefully pour out a small pile of the stuff near the edge of the table while pouring another in the bowl. I also use a little piece of weed as a clogger. After moving away any debris or material that could cause any potential hazards, we sit down.  Now were ready.",
  "I take my rip. The taste is putrid, just as expected from previous experience. I pass the bong to K so he can pack up. After counting 10 seconds in my head, I go to the window to blow out the vile tasting smoke. I take note in my head that the setting sun makes the view look identical to early morning. By this time K has already taken his rip. Just as I am releasing the smoke from my lungs (still disgusted by the taste) I see my neighbor down in the alley, drinking a 40 covered with a brown paper bag. I relate this sight with the thought of it being the morning, this is too much for me. I immediately burst out in hysterical laughter and try to inform K of my discovery, H is drinking a forty!",
  "Im sitting on my bed now, still laughing my ass off. The laughter was even more intense than my first experience with salvia. K is laughing his ass off by now too. After a few more minutes of extreme laughter, I start to get that really unpleasant hot and sweaty feeling that salvia gives me, especially on my thighs. I try to turn on the fan, but its impossible, not to mention hilarious! I finally get it on but by that time Im already returning baseline. K, still feeling the effects of the extract, slides down the chair in a very snakelike manner. This brings out one last burst of laughter before the experience comes to an end for both of us.",
  "That was fun, just like the first time... But now were ready to explore the effects of the extract of this plant to their full potential. We also decide that we should get another bowl so we can switch more quickly, allowing us to be more in sync while were out in salvia land. So after a quick trip to Ks house were soon back in my room, a loaded bong in my hand and a bowl waiting for a bong to complete its existence in Ks hand. The amount of salvia used is significantly larger than with the first go. We take our rips, deciding to hold them in for 10-15 seconds. 10 seconds pass, Im already feeling giggly and spacey so I get up(mistake!) and lean on the windows sill as I let it loose. K was smart enough to just stay sitting and blow the smoke out towards the window. All gone, I think Ill sit back down nowSike.",
  "Something has gone horribly wrong. I immediately become part of a massive, spherical vortex. The spinning is more violent and disorienting than anything I have encountered. By this time, I have completely forgotten that I smoked salvia and am completely unaware of my surroundings, all I know is this thing Im stuck in. Strangely, I feel another in my presence. (I later come to the conclusion that this was K, though at the time I forgot he was there.) An unpleasant thought passes through my head and for a second I become very paranoid I think that this ball is man made. Secretly produced, a new weapon of mass destruction that they(who the is doesnt matter) made in an attempt to finally rid the population that they loathe so much. They release these unstoppable abominations upon the cities, towns, etc. sucking up every thing that is in its path. This is all going through my mind as Im still rapidly spinning around. Wait a second, I think. That cant be true.",
  "Now I remember the salvia. I think that a long time has passed since I smoked it, and Ive already screwed it up by going crazy. I receive a false memory of me being in a state of temporary insanity, thrashing violently while my family tries to restrain me. Fortunately, this passes very quickly.",
  "This is where some of it gets hard to explain. Forget about remembering that I smoked salvia. I dont know what happened to the vortex either, but Im now inside my head. In the very middle, looking out at all the pieces of my face fall to the ground. My body is composed of billions and billions of tinyslabs? (The best way I can describe this is with a deck of cards. My body being the whole deck, and the cards would be the slabs. The slabs were actually the same shape as cards, and even stacked upon another. Now cover the surface of a table with many decks of cards, and you have my body.) Wait a second, I AM one of these slabs. And each slab is yet another one of me. Laughing at me But something else has gone terrible amiss, these slabs of myself refuse to stay intact with one another. They keep moving ahead of me, despite my desperate efforts to catch up with the next one. (Imagine fanning out one of the decks of cards, and then having them continuously moving forward in that manner.)",
  "Change of paceNow Im the wall, the carpet, and the whole room. I am everything, I am existence. This is nice, but now Im coming back from existence, if that makes sense. Everything is being zipped up. Literally, like a zipper. Woops! My body becomes caught on the zipper from my genitals up. It doesnt hurt, but it becomes really uncomfortable when it reaches my face. (Im still completely unaware of what my actually physical body is doing, but I now believe that half of my body was lying on my snakes cage. Im also starting to become aware of Ks presence again, but I have no idea how hes doing.) Im desperately trying to get uncaught from this zipper. K is helping me get out of this mess, simply by being present. Everything Ive written about so far has been happening very quickly.",
  "Freedom! Im now free from the zipper, somehow. Im starting to come down a little bit, but Im still strong into the trip. It has definitely mellowed out, especially the fast paced environment that I was in. Im now half way submerged in my carpet, looking around the room and at my large friend K(I can only imagine what hes doing standing up, or how.) from a newborn babys point of view. I like this feeling, its very calm, tranquilizing, even. Eventually K snaps me back to reality somewhat. With one of the funniest faces Ive seen a human being make, he points to the T.V. and says in a high pitched voice, Turn that shit off!. Killer Klowns was still on, I forgot! (He later said that it was giving him a hard time.) Purposely avoiding the screen with my eyes, I awkwardly raised this long, inadequate heavy pole of flesh and bone called my arm and tried to turn off the T.V. Finally succeeding, I turn to K to try and talk to him",
  "*Rewind just a little bit: K is doing some craaazy shit. While I was fumbling around with my arms trying to press the power button, K decided to do a jump/flip over my excessively large stash box. Luckily he didnt knock over the bong which was on top of the box. He told me later that, Something was pulling him towards the wall, which he was resisting, but then decided to instead go with it. After his back pressed against the wall, it just kind of led him over the box. Unfortunately I missed his jump, and only got to see him rise up from the floor.",
  "Alright, back on track. K is now mumbling some gibberish, and I see him holding the bong. I wonder what he doing with the bong. I knew he shouldnt be holding it, but I still couldnt move much, let alone talk. I dont know what happened for a few seconds but the bong is now on my bed, water and all.  Were both rapidly starting come down. K apologizes for the water and asks where a rag is. I point towards my dresser and say something along the lines of, boats turtle jingle. We both have a good time laughing at this before I go over in my head what I was really meaning to say, In the third drawer.",
  "By now I can stand, a bit uncoordinated, becoming familiar with whats known as reality again. Soon after we both return baseline. K and I discuss our experiences a little bit. We decide to walk over to his house while continuing the conversation. During this time K is very animated and talkative, which usually isnt him. I feel more calm and reminiscent. I let him enjoy the exited mood he is in and do most of the talking at this point. These after effects soon pass for both of us. We arrive at his house, talk a little more, and later on I go home to sleepAvoiding the bed of course.",
  "Conclusion:",
  "Despite a few(or more) frightening points during the trip, I enjoyed it a lot. I think I blew it somewhat by standing up. Even though I knew it hit fast, it took me completely by surprise and I could have fallen down and hit my head. I think I actually did slowly fall down, but for the majority of the experience I cant recall what my body was doing, nor can K. Ive also come to the conclusion that my eyes were closed half the time, I wish I would have remembered to keep them open.</p>"
 ],
 "year": "2005",
 "id": "43952",
 "gender": "Male",
 "views": "2582",
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "submissionDate": "2007-06-23T07:00:00.000Z"
}
