{
 "title": "Metabolic Syndrome Vs Depression",
 "author": "Nervous Wreck",
 "citation": " Nervous Wreck. \"Metabolic Syndrome Vs Depression: experience with Sertraline (Zoloft) (ID 43966)\". Erowid.org. Jun 16, 2006. erowid.org/exp/43966",
 "substance": "Sertraline (Zoloft)",
 "bodyweight": "208 lb",
 "report": [
  "<p>Ive been on Zoloft for over 5 years, with a few short breaks in between. I had a lovely little nervous breakdown back in March of 2000 and was given a script of Celexa.  After six weeks I realized it didnt work, and got a new doctor and a nice script of Zoloft, Wellbutrin (Buproprion), and Lorazepam (generic Ativan).  This worked pretty damn well.  It also helped that I had massive support from my family and friends, who allowed me to completely collapse, not work for a while, and get better.  I didnt have to check in to a hospital psych ward, thanks to all these factors, and Zoloft probably played a big part.",
  "After two weeks of taking Zoloft, I started feeling much better.  I didnt obsess (had OCD)  thoughts didnt stick in my head for too long.  And many of my thoughts werent negative any longer.  I became hopeful for the first time in years, maybe for the first time ever.  I began to take a long hard look at my life and started thinking about whether or not I was really living it right.  I finally had enough clarity of mind to do this.  Oh, did I mention I also gained 40 pounds in about 5 months?  Oh yes, and it went even higher.  During my depression I dropped to 165 pounds.  Eventually, after about 2 and a half years on Zoloft, I weighed 221 pounds. There are there side effects and weight gain may not be the worst of them.",
  "I can take a lot of shit when Im on Zoloft.  My dose ranged from 100mg to 200mg would be during a depressive episode (had about 3 of them in 5 years, 2 major ones).  100 mg when Im at cruising altitude.  I found, after taking Zoloft (yeah, the tranquilizers probably helped a lot too) I didnt take things so hard.  In fact, I didnt take things hard at all.  Its not as if nothing matters to me, but I wont sweat the small stuff anymore.  If somebody insults me, I can smile and say, OK, whatever.  I find I dont want things I used to want  cars, girls, clothes, sex, whatever.  I look at everything long-term instead of seeing just the short-term.  For this ability, I love Zoloft.  It has made me emotionally much stronger than I ever was.  Ive been able for the first time in my life to go back to school, get a teaching credential, work in a school, and do all the things that normal people do.  Before Zoloft, believe me, I was not normal.  I was a disaster.  So, mentally  Zoloft has been a godsend. ",
  "Now here comes the bad side of Zoloft.",
  "I have just been diagnosed with Metabolic Syndrome.  Its a condition that is a precursor to heart disease, stroke, and type 2 Diabetes.  Very dangerous, and I seriously doubt I would have it right now if I didnt take 100mg of Zoloft every single night of my life.  True, I also take Wellbutrin and Lorazepam, but Wellbutrin is a kind of speedy anti-depressant (Ive taken it alone, doesnt work well for me.  I use it to counter-act some of the side effects of Zoloft) and never seemed to make me gain weight or lose weight getting on or off it.  Lorazepam is something Ive gone on and off of many times, and my weight doesnt change much on that either.  So, I have my sanity, but I might be having a fatal heart attack along with it.  Did I mention Im 34 years old?  Im too young for this shit.",
  "But wait, theres more: sexual dysfunction.  Sometimes I wont get it up, mainly because I wont want sex.  Ive left some poor women extremely frustrated because I refused to sleep with them.  I just didnt want it.  I doubt I would have turned them down if I had not been taking the drug.  So my libido comes to a grinding halt.  Usually. Usually?  Well, yes because there are times  few and far between  when a type of severe horniness comes crawling up on me and I have to get laid, dammit!  Usually, this happens when I just go off the stuff, and Im pretty sure its a withdrawal symptom.  Ive had some weird sexual experiences when getting off of Zoloft  premature ejaculation, hard time achieving orgasm, multiple orgasms (is that a problem?).  The first and last of these happened to me the last time I went off Zoloft  and I went slowly.  Took me about 2 months of tapering down, but the withdrawals were still awful. ",
  "But waitTHERES MORE.",
  "The worst withdrawal symptom and I mean the worst is this: Pure unadulterated rage!  I literally freaked out on people for no reason at all.  I almost became violent with people I didnt know.  Id snap at everybody.  Im telling you, this kind of rage is not normal at all.  When I hear about people killing people because they were on Zoloft, I hate to say this, but I can see how that could happen.  I didnt want to kill anyone, but I could not control my anger, and Im a very, very mellow person.",
  "Zoloft is the only drug that can get me out of a bad depression.  It really is magical in that regard. ",
  "Incidentally, there were two times I was tired of the weight gain, sexual dysfunction, etc.  So I tried to get off of Zoloft, and went through all those lovely withdrawals  I ended up having full blown depression one time  another breakdown and had to get back on it again and go through 4 weeks of absolute hell (but I did drop about 20 lbs or so).  The other time, I saw the writing on the wall (one gets good at depression after a while) and got right back on it when I realized I was going back into the hole.  My psychiatrist tells me I might have to take Zoloft, or something like it, for the rest of my life if I want to continue to be normal.",
  "So now, Im getting off the Lorazepam (again) and doing my best to drop the weight and lower the blood pressure.  I like the way Zoloft makes me think, but I dont like heart attacks, stroke, or type 2 Diabetes. Being fat is not cool, and its certainly not helpful for somebody already battling depression.</p>"
 ],
 "year": "2005",
 "id": "43966",
 "gender": "Male",
 "views": "35388",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Lorazepam",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2006-06-16T07:00:00.000Z"
}
