{
 "title": "Night Out",
 "author": "Wraistlin",
 "citation": " Wraistlin. \"Night Out: experience with Morning Glory (ID 44014)\". Erowid.org. Oct 2, 2007. erowid.org/exp/44014",
 "substance": "Morning Glory",
 "bodyweight": "122 lb",
 "header": [
  [
   "DOSE:",
   "150 seeds",
   "oral",
   "Morning Glory",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2005",
   "44014",
   "Male",
   "",
   "Not Given",
   "Oct 2, 2007",
   "4438",
   " "
  ]
 ],
 "report": "<p>Setting - My House, Beautiful Florida June Day/Night</p><p>Mindset - Anxious, Prepared, Confident, Suspecting</p><p>Intentions - Find a way to heal problems of society, concerns of companionship.</p><p>Notes - Daily I take One-A-Day Men's Vitamins along with Ginseng pills, although the day of the event I ran out so had taken only the One-a-Day.  After the events occured I read through and added things I couldn't explain during the events.  These will all be inside of (  ) to clarify the difference.</p><p>Thursday </p><p>(10:00pm) Ground up 150+/- Heavenly Blue Seeds in a pepper grinder.  Combined ground seeds with 2 cups of water in a jar, screwed on lid tightly, shook vigorously, and put in the refrigerator.</p><p>Friday</p><p>My diet for the day consisted of an egg bagel, canned spinach, tuna fish in oil, cacao beans, baked potatoe, fresh spinach, v-8 juice, orange juice, and LOTS of water to clean out my body. Shook jar vigorously.</p><p>Saturday</p><p>My diet for the day consisted of a raisen/cinnamon bagel, spinach, tuna fish in oil, cacao beans, orange juice, v-8 juice, and LOTS of water to clean out my body. (last time ingested food was approx 2:00pm)</p><p>(6:00) Straining the pulp from the water that has now been sitting since Thursday night.</p><p>(6:07) Ate 2 teaspoon's worth of pulpy material that was strained from the concoction.</p><p>(6:09) Drank a little over half the concoction of liquid.</p><p>(6:13) Stomach getting slightly queazy.</p><p>(6:18) Drank another gulp of concotion. Feeling slightly 'sparkly.'</p><p>(6:21) Finished the concotion.</p><p>(6:28) Nausea has subsided for the most part.</p><p>(6:30) Picked up a book that I have been reading and started reading it.</p><p>(6:43) Nausea become overpowering, thought for sure emptying my stomach would happen.  (Nausea became more intense as the storyline of the book became more intense.  Related an encounter between 2 creatures in the book, dragon and unicorn, as me being the unicorn, wanting to read the book, and the dragon, not wanting me to read the book.  The more I read the sicker I became which seemed like the intentions of the dragon. Interesting)  Although after making a trip to the toilet I realized that I'm fine, and that reading must have had something to do with it, sort of like reading in a moving car.  Effects are starting to become evident, although not able to be explained.</p><p>(7:34) Laid in a tub of warm water to try and fight off the urge to expel the contents of my stomach. Eventually stood up and took a shower due to the seemingly need to stand up.  Effects starting to intensify as I'm typing this entry.  Stomach feels warm.</p><p>(10:49) Watched begining of Star Wars Episode VI, got as far as the part where Princess Leia is dressed up as the bounty hunter asking far more than what Jabba the Hut was willing to give initially, changed it to Runaway Jury, stopped at point of the trolly ride where the money hungry lawyer meets the girl who seems to be calling all the shots.  (This became tied in with my desire to bring to heal society in a very personal way.)</p><p>(10:57) Think I'm at my peak now, feel tingly, no visuals to be noted.  Though the extremeness of the situation has most definitely become appearent.  Think I'm in the eye of the storm, the taste of the concoction is making a comeback, words are becoming hard to type. Intensity.  Feeling of the need to expel my stomach, but seems more like my humanity or understanding of the way the world is viewed as a society is trying to expel it's stomach so to say.</p><p>(12:48) Went and tried to play Rallisport Challenge 2 on xbox, didn't do to bad actually.  Definitely some open eye visuals.  Visuals seem strong when shifting from light to darkness.  Stared a picture on the wall for probably 30 minutes.  It's a picture of a flower garden at night with a blonde queen looking woman playing an instrument with approx. 2 strings.</p><p>(The picture is by Craft titled 'Evening Serenade.' Though the image doesn't actually have any, I strongly seen 2 skinny goblins with huge grins walking across the picture.  Actually the picture was doing all sorts of interesting tricks.  At one point it seemed like it was painted in layers, that the layers were actually not painted on the same surface.  Sort of like there was a main layer with most of the picture, then 2 or 3 other clear layers on top of the main layer an inch or so apart with images that would appear closer to the viewer of the painting, to appear to give it depth.  Most worth noting though is the way patterns seemed to manifest from objects in the painting almost as if they were growing with a motion, then blend into the way the picture is suppose to look.  This all happened while listening to music by the band Clutch, which seemed like it together with the painting was a type of show.)</p><p>It should be noted that I hurt.  My back is sore, my legs are sore, my stomach seems ok after taking some antacid (liquid).  Starting to actually get somewhat tired, time has been mischievous,not completely distorted, just sorta shifty.  This will probably be my last entry tonight, sorta hoping to go to sleep soon, though seems like I have another 2 hours ahead of me of 'no sleep' time.  See you in the morning!</p><p>Sunday</p><p>(9:00am)  Woke up feeling like I slept extremely well.  Had a hard time convincing myself to get out of the bed, it was like I was in a fluffy, warm, and cozy cloud.  Effects seem completely gone.</p><p>Last Notes - It should be noted that a few of the things I did throughout the night could have definitely effected the intensity of the M. Glory's power.  1.) throughout the night I ate a few things here and there to ease the pain in my stomach.  It wasn't much, half a tomato, plate of spegetti, piece of bread, and a few carrots, and a honey bun, not necessarily in that order.  Also in total, around the time of the peak, I took approx 1 dose of Pepto Bismol, and approx 2 doses of Maalox. The stomach cramps/nausea became a little too much for my taste, although it wasn't too bad.</p><p>Around the time of the peak I found that my leg or arm were constantly swinging back and forth.  Sometimes I do this when I'm sick and getting ready expel my stomach contents.  So I'm guessing that it was for the same purpose last night, but I never actually did regurgitate any amount of food worth noting.</p><p>Would do again, though the sickness factor would prevent me from doing it too often.</p>"
}
