{
 "id": 4402,
 "title": "Riding the Wave",
 "date": {
  "submission": "2007-06-06T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Toomba",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "5.0",
    "grams": 0.005
   },
   "administration": "insufflated",
   "substance": "Oxycodone",
   "form": "ground/crushed"
  },
  {
   "time": "0:10",
   "amount": {
    "unit": "mg",
    "quantity": "5.0",
    "grams": 0.005
   },
   "administration": "insufflated",
   "substance": "Oxycodone",
   "form": "ground/crushed"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "mg",
    "quantity": "10",
    "grams": 0.01
   },
   "administration": "insufflated",
   "substance": "Oxycodone",
   "form": "ground/crushed"
  },
  {
   "time": "1:10",
   "amount": {
    "unit": "mg",
    "quantity": "10",
    "grams": 0.01
   },
   "administration": "insufflated",
   "substance": "Oxycodone",
   "form": "ground/crushed"
  },
  {
   "time": "1:45",
   "amount": {
    "unit": "glass",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "1:45",
   "amount": {
    "unit": "mg",
    "quantity": "10",
    "grams": 0.01
   },
   "administration": "insufflated",
   "substance": "Oxycodone",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Background::: I am in my mid 30s have tried many different substances over the last 20 years. I have never used a needle to administer a substance, I feel that needles, in the long term, always seem to turn out bad.  I am not a regular user of any one particular substance.",
  "I havent eaten in about 6 hours. I Just got home from work on a Friday night. Snow falling outside, about 8 inches on the ground so far (Im not going anywhere).",
  "7:30pm crushed 10mg tablet to a power n snorted half of it, minimal irritation if any. read more experiences.",
  "7:40pm nothing yet upon more reading I figured the other half was warranted.",
  "7:50pm starting to feel a bit more relaxed, nothing more than that.",
  "8:00pm I figured I was safe from an OD at this point so I snorted another 10 mg pill, burnt my sinuses a little bit, but no where near the burn of krank. I had snorted heroin about 10 years ago so I kind of knew what I should be feeling, and at the same time mindful of the overdose potential.",
  "8:10pm starting to feel a little floaty.",
  "8:30pm effects are more pronounced feeling a little warmer, starting to notice the itchyness most people mention while on oxy.",
  "8:40pm snorted another 10 mg, no burn the painkilling effects are kicking in.",
  "9:00pm feeling pretty warm and itchy had to open a window to cool off, its 30 degrees outside so that should do the trick. The phone rang and after I answered it, I found I was in a talkative mood but my speech was a lil sloppy. The body buzz is kicking pretty good, like a energetic hemp buzz. My mind is wondering, attention span is somewhat shortened.",
  "9:15pm just finished my first beer. Not really feeling euphoric and after some thought I decided to snort, what I thought would be my final 10 mg for the night.",
  "10:00pm  12:00am I laid down on my bed and spent the next 2 hours in a half asleep, half awake dreaming state. At this point the euphoria kicked in and I felt at peace, the best way to describe how I felt was oneness with the world.",
  "12:10am",
  "Summary::: The time span which I ingested the 50 mg total resulted in a mild to moderate spaced-out feeling very positive and appreciative. The body buzz was similar to moderate alcohol intoxication without the negative effects. The itchiness was very persistent, and did get to be annoying at times, the feeling like every nerve is standing on end. I didn't scratch so much as I rubbed everything and I do mean everything. I did notice that I had difficulty urinating, I felt like I had to go but nothing was coming out. I didnt feel bloated like my bladder was full so I assumed my kidneys were inhibited from the drug. I tried to urinate about every 2 hours while I was in and out of this dream like state waking up from time to time. I finally succeeded in urinating about 12:00pm the next day. In spite of the fact that I didnt sleep more than 2 hours strait, when I finally did get out of bed I felt rested with no negative effects."
 ],
 "erowid": {
  "id": "29009",
  "citation": " Toomba. \"Riding the Wave: experience with Oxycodone (Oxycontin) & Alcohol (ID 29009)\". Erowid.org. Jun 6, 2007. erowid.org/exp/29009",
  "substance": "Oxycodone (Oxycontin) & Alcohol",
  "views": "14177"
 }
}
