{
 "title": "Remember a Day Before Today",
 "author": "DrGobLin",
 "citation": " DrGobLin. \"Remember a Day Before Today: experience with 2C-C (ID 44089)\". Erowid.org. Oct 24, 2007. erowid.org/exp/44089",
 "substance": "2C-C",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "30 mg",
  "oral",
  "2C-C",
  "(powder / crystals)"
 ],
 "report": "<p>About me: I have had 18+ years using pretty much everything in the extreme. excluding only a handfull of research chemicals.</p><p>3:00pm : Took 30mg oral 2C-C powder wrapped in tissue. I was in a good mood, at my home, which recently has been rearranged and cleaned. I live alone with my cat, lots of music and computer equipment. Have eaten half of a sandwhich.</p><p>3:40pm : First hint of effects, very mild, soft body feeling.</p><p>4:00pm : Listening to my mp3 collection. Cant stop grinning, tactile senses have incresed, much better clarity of thought, music has much more depth. I have become extremely relaxed.  I feel great, no discomfort or vertigo, nothing just soft warm glowing feel</p><p>4:30 : Tracers and significant swirling visuals begin. (like the effects of a paddle through the water...) Im starting to feel like ive taken lsd with all the intensity and darkness removed.</p><p>4:45 : Major visual distortions in the form of melting multi-layer swirls.  Ironically I can see no loss of motor skills at all, and my thinking is crystal clear.  There is pleasent mild stiumulant effect.  I walked around my house (its pretty big) and looked at how I have everything set up, i am very pleased. </p><p>5:00pm  Ive been here before, a sense of wonder and innocence pervades.  I am greatfull to have this experiance, I feel like everything is fine with myself and the world, well ok, melting swirlies might indicate something is not exactly perfect but it sure enhances everything.</p><p>The feelings and visuals continued for about 2 more hours.  I never once felt any neqative effects, which is rare with research chemicals (i.e. 5-MeO-AMT and AMT seem to just run over me inside and out). </p><p>7:00pm : decline of all effects except the mild stimulant.</p><p>By 8:00pm im base line.  But I want to sleep and cant.  After several shots of scotch, which normally would get me to sleep, i feel nothing from it.  At 9:00pm I take several more shots, nothing, im not wired, im just awake and I appear to be immune to achohol.  However it does slowly start hitting me over the next 20 minutes. </p><p>I slept great, and like one of the other reports, I slept a few hours longer than i normally do. In the morning I had slight headache which was the achohol im sure.</p><p>The whole of the experiance was like allowing my spirit to take several deep breaths of fresh air and gaze into great beyond again.  It caused me to remember the beauty of psychodelics without digging up some of the heavy 'Lovecraftian' bad trips I have had in the early days.  While the introspection was never too deep (like lsd is) it was sufficient enough to be of good value.  There were things I hadnt thought of in many years that i needed to be reminded of.  I am thankfull for all of this.</p><p>There has got to be real theraputical value to this substance, albeit in perhaps smaller quantities.  The time span of 2C-C is short enough to manage and apparently I never loose control. </p><p>I will definitely try this substance again. Probably 50mg next time.  Morninggloryseed's write up called 'Tripping at Settler's Rock' is an excellent reference to some of the more detailed effects, only thing I differ with is the intensity, I didnt seem to find this overly intense, and definitely not as intense as 5-MeO-DMT, but he had taken 20mg more than me so who knows.  But otherwise he is on the money.</p><p>Thanks Shulgin.</p>",
 "year": "2005",
 "id": "44089",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-24T07:00:00.000Z",
 "views": "6774",
 "dose": {}
}
