{
 "title": "Unpredictable Nights",
 "author": "GWAR",
 "citation": " GWAR. \"Unpredictable Nights: experience with Mushrooms - P. cubensis (ID 44123)\". Erowid.org. Oct 15, 2007. erowid.org/exp/44123",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "114 lb",
 "header": [
  "DOSE:",
  "7.0 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)"
 ],
 "report": "<p>This was my fifth time ingesting shrooms. I was pretty experienced with hallucinogens; I had tried shrooms before (but I never exceeded a dose of 3.5 grams up until this experience), LSD, S. Divinorum, DMT, and had one brilliant journey with mescaline. I have tripped pretty hard before, especially on acid, but this may have been the hardest I have ever tripped.</p><p>It was a magnificent spring day in the very midst of spring break, in which I had a full week to relieve myself of the normal everyday school stress. I had smoked a large amount of hash the day before, but I had ingested no psychoactive substances on this unpredictable day. I had been looking forward to this day for quite some time, and me and a friend had saved enough money to buy a large quantity of drugs to last us through the days off. We were let out to break Friday, which was the day before yesterday. We were traveling up to my moms' boyfriends' cabin to stay for a few days.</p><p>We finally arrived at 5 pm Saturday. I was a bit tired so I immediately made a large cup of coffee. Then there was nothing better to do, so we figured we might as well take the shrooms. We had actually planned to use 3.5 grams for two seperate experiences each, but it was spring break and we had a spacious cabin to ourselves in the middle of a beautiful landscape, and it wasn't long before my friend convinced me to ingest the full 7 grams. We re-arranged and set up the objects in the cabin to make it more comfortable, and by the time everything was ready it was 6 pm. I wanted to be tripping balls by the time the sun set, so me and my companion grabbed a bag of chips and started the horrible task of eating the dry fungi.</p><p>Surprisingly, this certain batch of mushrooms weren't as bad as the ones I've had to choke down in the past, though they were aweful nonetheless. Within 15 minutes I had downed my stash, and my friend was just finishing up. It became apparent that we were in for a hell of a night when 15 minutes later I felt a change of thought and started detecting minor visuals. I did not feel the need to vomit, which was odd as the four times before I was sick for the first half hour. I wasn't up for complaining about it though, and we put on a chill CD and made ourselves comfortable on the living room couch. The sun was about a half hour away form setting, so we had plenty of time to relax before viewing the spectacular show in the sky.</p><p>Within the next 5 minute I was caught in a full on trip. I was oblivious to my surroundings, and everywhere I looked there were intricate swirls of colors and patterns. Every minute or so my mind would think up something so ridiculous that I would burst out laughing, and my friend would join me in laughing hysterically until we were practically in tears, only to start again. Then the sliding glass door caught my sight, and as I stared at it the door slammed open by itself. I stared in disbelief for what seemed like an eternity, but must have been a matter of minutes for the sun was just beginning to set. It was then that my friend reminded me about the sunset and we found comfy seats on the porch. My friend suggested that we pop open a few beers, but I wasn't quite up to it at the time. After a little thinking, he agreed and we sat and enjoyed the bright colors lining the sky.</p><p>As the sun set I could feel the shrooms reach a plateau, and I was tripping hard, but not nearly as hard as I had imagined to be off 7 grams. My friend was feeling the full extent, however, and he was lost in his own world. After a spectacular sunset, we withdrew back into the cabin and put on a movie (Fantasia). The second the movie began I knew that the shrooms were not done with me yet. Up until this point the only hallucination I had was the glass door and an amazing light show of shapes and colors, but nothing beyond the normal shrooms experience. Once the movie began, however, the shrooms doubled then tripled its effects. It started with my couch throbbing in a breathing motion, and the room was alive with activities and movement. The lamp would become a small white elf hanging onto a large golden stick whenever I focused on it. The ceiling fan was a labyrinth of dancing skeletons, and as it continually went in circled the skeletons would take on different dance partners.</p><p>By the time the movie had progressed 10 minutes, me and my friend were incapable of focusing on one object for too long. I noticed I had to take a break to the restroom, I always piss alot when on shrooms for some reason, and found that walking was a puzzling and confusing activity. It took at least 5 minutes for me to locate the bathroom, then another 5 to secure myself inside by locking the doors. This was a challenge, and for some odd reason I kept thinking that I had to lock the doors from the outside, which didn't work because of the lack of me being inside once I was outside. Finally I had everything figured out, and I took the weirdest piss in my life. Such a release of body fluids caused a flurry of rainbow colors, and everything took on a different color glow. Some of the colors I tasted, some of them I smelled, and there were some colors present that I had never witnessed in my life. It took a lot less effort to find my way back to the couch, and once I sat down my body made up its mind and decided not to get up at least until the movie was over. This, I knew, was impossible, and another piss was inevitable.</p><p>Once I sat down my friend said something in an inaudible volume, and I replied with a solid 'Speak up lad, I can't quite understand your dialect'. I had meant to say 'Speak louder', but I was far beyond reason now. He replied in something resembling gibberish, which could very well have been a middle eastern language, but I was not familiar with it and once again asked him to repeat it in some odd fashion. Finally he mumbled 'Where were you man? I mean, to dissappear like that would be magic'. It took me a while to catch his meaning, and after a little thinking I said 'I was in the john. It was nice'. Then my companion smiled and layed back into the couch. I noticed the movie was still on, and the screen showed some crazy ensemble of crocodiles and another animal which I couldn't quite place a name on (I now know it was a hippo). I watched in utter facination for the next half hour.</p><p>After the movie had progressed to some crazy scene which I couldn't comprehend, I decided to do something. I didn't know what yet, but I knew I couldn't sit idle for too long. That something happened to be me going into my bedroom and attempting to play Halo 2, and when finally I reasoned with myself that I was FAR too fucked up to do anything beyond sit and observe. I then placed my headset on my ears and listened to GWAR's 'War Party' CD, which was 750% more badass in my current state, by the way. I eventually fell asleep sometime in the album, and upon waking up felt fresh and great. The usual 'Day after stupidity' hit, and we spent the next day smoking hash, shooting/inhaling some really good heroin, and doing nothing too active.</p><p>All in all, this experience was the craziest thing that has ever happened (involving me). I am glad as hell that I took the opportunity to try 7 grams, and I'm very sure that I will be doing it again, maybe soon, maybe later. Who knows?</p>",
 "year": "2005",
 "id": "44123",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-15T07:00:00.000Z",
 "views": "2807",
 "dose": {}
}
