{
 "title": "I Would Rather Live",
 "author": "Ryan",
 "citation": " Ryan. \"I Would Rather Live: experience with Amanita Muscaria (var. formosa) (ID 44144)\". Erowid.org. Jan 8, 2007. erowid.org/exp/44144",
 "substance": "Amanita Muscaria (var. formosa)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "5 caps",
   "oral",
   "Amanitas - A. muscaria",
   "(plant material)"
  ]
 ],
 "report": "<p>Substances: Amanita Muscaria (formosa)</p><p>Cannabis</p><p>Tobacco</p><p>Dose: 5 caps</p><p>small nug</p><p>1/4 cigar</p><p>Level: 5</p><p>The night started off with a short lightning storm and some rain. I washed the amanita caps in the sink to get the dirt off and pick out any spoiled spots. I then waited about 10 minutes for them to dry a bit and then I ate them along with a chipotle. After ingestion I waited ten minutes or so and then went outside and smoked a bowl and some of a cigar. I felt pretty blown already from the weed so I went back inside and layed down on the couch. I felt slightly nauseus even after smoking and I noted that as being very strange.</p><p>I layed on the couch for probably over a half hour watching chappeles show and other stuff when I started to nod off. I was deeply wanting to sleep which is normal for me and pot. I began to dream almost immediately, very vivid and detailed dreams. Zac woke me up and told me not to fall asleep but little did I realize how devastating this experience to come would be. I started nodding off again, only to find myself dreaming with my eyes open. Soon, in the course of minutes, the dreams became so realistic I could no longer define reality.</p><p>Zac and I were standing in his room talking when I said a simple word, eternity. As soon as I said this my life ended and began a series of loops and rewinds. I became fascinated with the new wisdom that had just occured to me, how simple life really is and how easy the universal code is to crack. I watched myself grow as a child, reliving every child hood memory, and then an astounding new vision came to me. I watched myself, about the age 25, shoot a young girl with red hair right in the head. I was instantly consumed in pain, sorrow, guilt, and anger. I became furious at myself.</p><p>The visions then instantly changed into what I would call nothing short of 'Hell'. I was stuck in a cosmic rift, I felt my soul being purged and tortured second after second, minute after minute, day after day, year after year for all eternity. The realization that I was dead, that I could never return to my friends and family hit me hard. I was stuck in darkness screaming and yelling at an absent audience. Why couldn't I have tried harder in my life to make people happy? Why did I live so selfishly?.............. Why?</p><p>Something came into focus. The room. I was ecstatic that I was back! I was not dead! or so I thought. The room wasn't real. nothing was real. Zac was talking to me, but I couldn't see him and I could barely hear him. I got up, walked to the bathroom, fell through a wormhole in space, got up, walked to the bathroom, fell through a worm hole, probably over 20 times before I realized that I was dead. This wasn't life at all. I was dead, never to return to my body. I was convinced that I had died of mushroom poisoning. Out of the corner of my eye I saw a light, a single small glow. I heard voices outside my range of vision, it was a doctor, my mom, and zac. They were saying how I was finally coming to. I realized that I was looking out from inside a body cast. I was horrified, and dumbstruck at how foolish I could have been to eat wild mushrooms.</p><p>Again, it wasn't real. I touched base with reality and was concious just long enough to realize I was laying on the floor of zacs bathroom with a dread over my eyes blocking my vision. I was out again. Soaring through astral planes, contemplating everything that I had done wrong in the life I lived. I was still sure that I was dead. I couldn't feel my heart beating; I couldn't hear anything; I couldn't see anything at all. All my senses were numb, and my mind had left my body. The next time I came to I was back on the couch. Crazy thoughts were splitting through my head, only they didn't stay as thoughts. Every one was lived out in full experience. My guess is that throughout this experience I lived as many as four lives.</p><p>I vaguely remember puking all over my sorry ass and then falling back into the abyss. I was far from content with death and I wished only to live again. I wanted life above all else. I no longer cared about the quality of the life given to me, or pointless bs problems that seem to plague so many people. All I wanted was life, a life, any life. I didn't care. As long as I could get out of this hell. I do not remember anything further. I woke up the next morning with a head ache and extreme body fatigue.</p><p>I have already forgotten so much that was shown to me last night. I would guess that this is all less than an eighth of what I experienced. I can periodically recall certain things, mainly fear and torment, but they are soon lost again. From this experience I have gained an unsurpassable respect for life. Never again will I waste my time feeling bad, life is too short to waste. People do not know what they are really asking for when they wish for death.</p>",
 "year": "2005",
 "id": "44144",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-08T08:00:00.000Z",
 "views": "14000",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 caps",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(plant material)"
  }
 ]
}
