{
 "title": "First Dance With the Fox",
 "author": "Weezy",
 "citation": " Weezy. \"First Dance With the Fox: experience with 5-MeO-DiPT, Cannabis & Salvia divinorum (ID 4414)\". Erowid.org. Dec 18, 2001. erowid.org/exp/4414",
 "substance": "5-MeO-DiPT, Cannabis & Salvia divinorum",
 "bodyweight": "175 lb",
 "report": "<p>After doing a considerable amount or research on the chemical, my better half and I recently got our paws on some 5-MeO-DiPT.  The reports I had read on the substance had left my curiosity running stupid. So as the weekend and my first opportunity to try the mysterious foxy arrived, I was more than ready to experiment.  At the time of my first experiment I was in a very positive and excited mind frame.  I had just moved into a new apartment with my fiance and was looking into a three-day weekend.  </p><p>I know its not the best method to measure, but I divide out 12 mg of the pinkish cream colored powder by dividing my entire supply into like piles, dividing some more and so on.  I set aside approximately 3 mg more to take later in the evening.</p><p>Mix the schtuff in some cola and down the concoction.  After some considerable cringing and twitching, from the awful taste, I prepare for the arrival of some friends by taking a shower. My fiance and her friend decide to try a small dose of about 5 mg even though they were planning on drinking.</p><p>T+20 minutes shower feels really fucking good!  Ive taken showers on acid, mda, and mdma  and foxy whups um.  I close my eyes and revel the warm stream on my skin.  I rub my skin with my hands and this also feels quite nice.  I can see how foxy got its reputation as a tactile sensation enhancer.   I get out of the shower and have a good time rubbing my fiance and she mentions that she feels tingly and nice, but nothing profound.</p><p>T+30 minutes: Im starting to shiver pretty badly and me stomach doesnt feel great. Im now quite spaced out from the foxy.  Almost too much. Smoke some kind bud and it smoothes things out nicely.  When I scan the room, Its almost like my vision is a bit behind my eyes. See lots of the blue and gold bars reminiscent of other psychedelics on white walls or window blinds.  Particular items appear to be crawling, much like on lsd. My couch is definitely a bit trippy to start, but when I let my eyes relax it comes alive with energy and movement.  Very interesting.  All lights have a glowing halo around them.  I would really like to be at a rave or equivalent with cool lights and eye candy.  All colors appear extraordinarily bright.  My little lady and friend mention slight stomach discomfort, but nothing serious.  I am shocked by how quickly the material has taken effect.  I think to myself that it was because of drinking the powder as opposed to taking it in a capsule.</p><p>T+1 hr:  We sit around for a while talking and prepartying.  Everything sounds normal except my voice.  It sounds out of tune and muffled.  Weird.  I think I am talking a lot just to hear my voice. Take that back.  The music also sounds weird.   I listen to the Carl Cox CD in the stereo and realize that it sounds good, but off.  Like one component of the song is too slow, but the rest is fine. I am able to look deep into the music and dissect its complexity, picking up each layer of sound.  Doesnt sound bad, just off.  I have a buzz of energy, but when I stand up I realize how high I am and feel a bit clumsy.  A rumbling in my stomach tells me Id better make my way to the bathroom.  I chuckle to myself about how high I am as I stumble to the bathroom.  I sit down to eliminate and close my eyes and have some great closed eye visuals.  Kalidescoping patterns paint themselves on my closed eyelids.  I am able to change the patterns with a change in mental picture.  What I tell myself I want to see I see.  I finish on the pot and wash my hands.  The marble topped sink swirls like a cosmos.  I stare at it for a bit and finally make my way out to the main room.</p><p>T+2 hrs the decision is made to go out to a club. I take my last 3 mg in the same fashion as we make our way out to our cars and prepare for the ride downtown.  The snow looks beautiful.  It appears as though sparkling diamonds cover the entire ground.  But of course, no one else wants to stop. We all load into cars and make our way downtown.  I look around and see that Im still quite high and very glad that Im not driving.   We smoke a j before going inside and fumble around with my ID on the way inside.  Bouncer kind of looks at me like 'Yep I know youre fucked up, just gimmie your money and be on your way.' I think to myself that he probably thinks Im rolling.  The last 3 mg definitely gave me a nice boost and I am hammered.</p><p>Inside the techno music is booming.  Great music and atmosphere.  I am not experiencing any auditory distortions any more. The lights are mesmerizing, but less so than on lsd or mdma and obviously the two together. I also remember reports stating that dancing was fun on foxy, but I still feel a bit clumsy.  I try dancing and have a good time, but notice that my feet arent responding like I want them to. Im a bit disappointed in that, but I remain in a positive headspace.  So, I head back to where I know my crew is and kick it for a while.  Conversation is fun and goofy as my fiance and friends blossom into loud and obnoxious drunks. She mentions that she feels the chemical, but is getting drunk. I am also very much in control of my mindset.  No headfuck whatsoever.  I am not feeling a great deal of empathy.  I feel an appreciation for my friends and my fiance, but not any more so than if I had been sober.  I dont feel the foxy has made me any more emotionally opened, but I find it hard to be in a negative mindset, no matter what happens, so maybe it is a mood elevator to some extent.  I find Mda or Mdma is much better for connecting with individuals.  One night rolling together and great barriers are crossed.</p><p>Overall the club was fun, but a club is still a bar.  There are lots of drunks and negative energy despite the many friendly spaced out people.  I think I would have more fun at a bigger rave party where I could more easily get lost in the scene.  I dont think the sly fox will replace mdma or acid in my mind as the party drugs of choice, but it may be fun to synergize with one or the other.  I think the next time I dance with the fox I will use a much smaller dose and try it either as an aphrodisiac or even as a nice lift for hiking or at an outdoor street fair.  It may be to soon to say, but I think there are more exciting party drugs not to mention mind exploring psychedelics to be explored.  Not that it wasnt  fun though!  I do think 5 meo dipt is more of a psychedelic than it gets credit for.  At the approximately 15 mg dose I experienced, It definitely provided some very interesting visual enhancements, although not full blown visuals. At this level, it is fairly intense.  Im glad I hadnt tried more for my first time.</p><p>Got home and we all decide to smoke some salvia.   Each of us take turns loading up the water bong and are gracefully escorted away from our respective consciousness to reflect on the evening's fun.  We have a good time seeing the vacuous facial expression emerge on each others face, as we are wisked away for our short, but intense journey.   I dont feel as though the foxy had any synergistic effects on the salvia, but am not disappointed.  For a good amount of time after I have difficulty walking straight, a strange after effect I encounter with diviners sage.</p><p>Had a little bit of trouble getting comfortable in bed, but after about an hour of rustling, fell asleep.</p><p>No hangover.  Felt happy the next day.</p>",
 "year": "2000",
 "id": "4414",
 "gender": "Male",
 "timestamp": "2001-12-18T08:00:00.000Z",
 "views": "6783",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 2:00",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": ""
  }
 ]
}
