{
 "title": "Complex Mathematical Patterns",
 "author": "Hoogshagenii",
 "citation": " Hoogshagenii. \"Complex Mathematical Patterns: experience with DMT (ID 44152)\". Erowid.org. Oct 24, 2006. erowid.org/exp/44152",
 "substance": "DMT",
 "bodyweight": "67 kg",
 "report": "<p>My acquaintance and I shared an interesting smelling mixture of organic matter that had been calculated to be 25% DMT, the source of which I was informed was an Australian Acacia. Of this I took three lungful tokes sitting cross-legged on damp grass beside a moonlit river at approximately the 11th hour, and after this I felt as I stared at the illuminated clouds very much stoned and giggly. Comparable to cannabis in some respects, as I found these low percentage tokes brought on a sensation of clarity and subtlety to which I reacted with openness. I found in this warmth many a large grin wiped across my face!</p><p>Indeed, after this mild encounter with DMT it was my decision to experience what a 50% DMT containing smoking mixture would be.</p><p>This time we moved away from the river to a backyard garden. I found that whilst I was toking this glass pipe, I was swallowing, much like when one drinks water! I noted this curious thing and continued. My saliva and my tongue almost as soon as the smoke hit my mouth felt electric, and then I had combusted what I could.</p><p>Holding the smoke in my lungs for as long as possible, I was experiencing a rush before I</p><p>had exhaled; by the time I exhaled I was coming up rapidly to the peak. The garden was meditative, and all trees were beautiful in that they were perfect patterns of mathematical precision, and in fact all of the trees were patterns- there were patterns everywhere! My eyes opened and closed during this experience with my brain bombarded with stimuli of all sorts. I remember my left hand when my eyes were closed; my fingers were sort of hollow, like tentacles and these were connected to a feminine creature in a swift erotic encounter. All of this was rapid, and when I opened my eyes and explored what was happening, I found that looking in any direction was irrelevant with regards to 'me', in that there was gravity, but no X or Y-axis. I also remember moving my arms out in front of me, geez they were so long! I then undulated them as if they were travelling along a sine wave- the 'movement' along the wave was forwards as I was looking backwards.</p><p>Movements in general felt very rapid, as if it took no effort at all. There were some aspects of rapid time shifts in and out from slow to rapid. This sensation is very hard to 'english'! My acquaintance was next to me when I was under, and we shared small comments here and there. Sounds where everywhere and somewhat 'metallic' and 'twangy'. Soon I was coming down, and here the frenetic energy of everything slowly subsided and brought with it a meditative-like quality of calm and tranquillity. Being out of doors and sitting on grass, I was sitting listening with closed eyes the chirping of crickets around me. This was so very beautiful; exuberantly majestic in their subtlety- this was a very nice way to get back to baseline!</p>",
 "year": "2005",
 "id": "44152",
 "gender": "Male",
 "timestamp": "2006-10-24T07:00:00.000Z",
 "views": "5094",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "DMT",
   "form": "(powder / crystals)"
  }
 ]
}
