{
 "title": "Smoking with Strangers",
 "author": "Jane Blaze",
 "citation": " Jane Blaze. \"Smoking with Strangers: experience with Cannabis (ID 4419)\". Erowid.org. Dec 18, 2001. erowid.org/exp/4419",
 "substance": "Cannabis",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "6 hits",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>A few weeks ago my best friend and I decided to meet up with two guys we had met a few weeks before. When we met up with them they asked if we wanted to smoke. Me, someone who has smoked on a regular basis for over 4 years now, couldn't decline. But at the same time, I said I'd never smoke with people I really didn't know, in fear of coming across laced weed, again. But I smoked anyways...</p><p>They rolled a blunt in the backseat of my best friends car while we drove to a back road. As soon as we came to the back road we lit the blunt. After two or three hits I was already feeling the effects. I only smoked through one more rotation and I stopped smoking. And so did my friend. We took a total of maybe 6 hits from the blunt each. The two guys continued smoking.</p><p>After about 15 or 20 minutes my whole body was numb and tingly. My vision was blurry and I felt like I was looking through a straw. If I focused on one thing, I could see it. But, everything around it was blurry and white. My heart was beating so fast my chest felt like it was on fire. My fingers and legs were locked and I couldn't move them. I felt paranoid and scared because I didn't know what was happening. My legs were wobbly and walking was hard. But, then I remember what a close friend once told me 'Don't fight it.' So I didn't.</p><p>In all my years of smoking I never experienced something like this before. And I've smoked many types of weed, too. The effects peaked and after that I calmed down a little and felt awesome. I felt peaceful. Not just high, something better than high. And this high lasted for about 5-6 hours. Where as with regular weed, the full effects are gone after about an hour or so. To this day, I still don't know what it was I smoked, but it was an experience I'll always remember.</p>",
 "year": "2000",
 "id": "4419",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-12-18T08:00:00.000Z",
 "views": "6314",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
