{
 "title": "Gateway to insanity",
 "author": "Scott",
 "citation": " Scott. \"Gateway to insanity: experience with LSD & Cannabis (ID 44204)\". Erowid.org. Dec 7, 2007. erowid.org/exp/44204",
 "substance": "LSD & Cannabis",
 "bodyweight": "195 lb",
 "report": "<p>On Thursday night, myself and four of my friends took a trip down LSD lane. This is our story.</p><p>First, I have to introduce the characters...</p><p>Mike: Laid back and somber, well dressed and intelligent. Mike has been a stoner for about the last three or four years, and has had one trip on Mescaline from a San Pedro extract. He used to have epilepsy, and is otherwise inexperienced with drugs.</p><p>Ari: An Aztec warrior. Very quiet, very laid back, a Mexican adopted by Jewish parents. Ari is deep, into meditation, a stoner, and decently experienced with drugs. He had tripped acid before twice, mushrooms a few times, e a few times, and has done some other drugs. Fairly experienced.</p><p>Dan: Typical college kid. Wears visors, sunglasses, and beer t shirts. Short, stocky, loud as hell, sometimes annoying, sometimes really fucking funny. The most intense person I know. Tripped shrooms a bunch of times, stoner for a long time, thats it for drug experiences though. Claims to have eaten 3 hits acid once and not felt it. Decent artist.</p><p>Kelly: My girlfriend of the past six months. Tiny girl, crazy in love with me and the reverse applies as well. Only smoked weed a few times, never did any other drugs. Took a few sips san pedro and claimed to feel effects, but I doubt much really happened.</p><p>Scott (me): Your friendly narrator. I'm the most experienced tripper out of the crew, having done e, dex, lsa, shrooms, mescaline (from both Peruvian torch and san pedro), salvia (didnt break through though), and acid once before. I was disappointed with my last trip because it wasn't strong enough, one cube didn't cut it. I organized the trip and got the acid.</p><p>---</p><p>Now that the characters have been established, on to the trip.</p><p>---</p><p>It was an absolutely perfect day. Gorgeous; Clear blue skies, 75 degrees, and the air smelled like summer. Kelly and I walked side by side down the happy looking suburban road to old my elementary school. We were talking about whatever couples talk about in summer, smiling and flirting, having a grand old time. We turn a corner and I tense up: Two police cars are sitting at the end of a road. Normally, I could give a flying fuck about police. Today, the 8 acid dropped sugarcubes in my pocket led to a little aprehension about walking toward them. Still, we weren't doing anything that was obviously illegal, and they looked busy yelling at some Spanish guy, so we pressed forward. As we got closer we heard the yelling, a female cop shouted 'Call me sweetheart again and your going to jail, mister.' We got 50 feet away, and I leaned over to Kelly.</p><p>'Baby, what we're doing tonite is probably twice as illegal as what that guy is up to.'</p><p>She laughed.</p><p>After crossing the highway via an overpass and walking down a few more streets, we come to the school. It's 7 PM, daylight is fading, and slowly but surely all the trippers trickle into the spot. While we wait we talk about our hopes and expectations for the trip, and normal bullshit that normal people spout. We were first, then mike, then ari, and at long last, Dan made it by 8pm. I unwrap the little package of foil in my pocket and hand out the cubes. One for Kelly, one for Ari, one for Dan, one for Mike, and one, two, three, four for me. I wanted to make sure I got the full experience this time, since last time seemed sort of unimpressive. The cubes may or may not have been multi-dropped, I don't know and I'll never know. We ate them in the bleachers of the baseball field and watched the sun set as a guy played with his awesome remote control airplane, which seemed to move in impossible ways. Both were good images to start this shit with.</p><p>After about 20 minutes or so, it began to kick in. An odd, strangely electric feeling started shooting up my body, and everyone else chimed in to say they were feeling something like that. Kelly said she felt 'Wiggly' and we all agreed it was a good word to use. At this point I got extremely cold. The temperature didn't change, or at least I don't think it did, but I was freezing. Since we were thirsty, we decided to split up. Me, Mike, and Kelly would go to 7-11 to buy drinks while Ari and Dan waited for our friend Knoll to show up and hang out. We separated and started our walk.</p><p>Things just kept getting more intense. Nothing looked right around us, but there was nothing specifically wrong with it. It just looked and felt off. Mike was walking so fast, and me and Kelly had a hard time keeping up. At the same time though, we felt that we couldn't stop moving because of the strange wiggly feeling in our bones, so we made it to Sevs in a pretty timely fashion. Crossing the street was terrifying, but the street lights looked amazing. Once we were in 7-11, things were getting overwhelming. The bright, unnatural flourescents hurt my eyes and there was a never ending stream of white trash gangstas walking in and out. We got our drinks, paid awkwardly, and left.</p><p>Walking back to the guys was an adventure. The road on the walk home was very well vegetated, and the extreme amount of plant life made it feel like we were walking through a jungle. The ground looked weird when you looked down, soI chose to just look straight and walk forward. We got back to where everyone was, made a few calls, and then everyone just plopped down in the grass and started talking. At this point it was about 9 PM and the acid was at an awesome stage. The comeup feeling had all but gone away, and everything looked beautiful. It was halfway between dusk and night, so part of the sky was black and stary, and the other was a rich blue. It was beautiful, there were two grey streaks of clouds that broke up the night sky and the stars looked more clear than they had ever looked before. By this time we were all losing our minds, and no one yet knew whether they liked it or not. Except me. I loved it.</p><p>I took kelly over to the bleachers because I was sort of uncomfortable sitting in the grass of a somewhat dirty field behind a school, and we talked and kissed. She told me she was feeling amazing and I could tell by the look in her eyes that she was feeling it so intensely. Shes 4'11' and 100 lbs, so any acid in her would hit her hard. We rejoined the group and decided to hang out on the overpass and watch cars go by.</p><p>We get up on the foot bridge and there are already a bunch of asshole high school kids up there drinking, smoking weed, and being douches. But whatever, we were on our side, they were on theirs. We watched the headlights of the cars sparkle in our brains, we felt the trucks that went under pass through our bodies, and Dan told me and Kelly that he could jump off the bridge without getting hurt. We talked him out of that one. We left the bridge, passing the group of kids. I said excuse me and one asshole black kid on a back said something like 'Yeah you better say excuse me bitch' which would've pissed me off a lot any other day. But I was on acid and didn't want conflict, so I just laughed at it and we went on. When we got to the bottom, Mike had this evil look in his eye. He was staring at his bottle, and said 'I'd like to break this bottle.' He did so by hurling it at the overpass where the kids were, without thinking, and Dan was like 'Yo don't you know that means BEEF you asshole? We better go.' We left with a bunch of douchebag kids shouting at us, but none were running down with bats so everything was okay again. We head off to mikes house a few blocks away.</p><p>On the walk, everyone but me refuses to use sidewalks, and Kelly and Ari start staring at peoples houses if they had lights or fancy siding. One house was built of stone and Kelly just kept staring at it. I told her to come and she got mad at me for making her stop looking, but then I asked her how she'd feel if 5 kids on acid were staring down her house and she moved along. We get to mike's house and sit on the curb for a while. The whole world looks marvelous and terrifying by now. Nothing makes sense, but nothing's supposed to. I put my arm on Kelly and she pulls away. 'No.' she says. 'You're bad.' Hm, interesting.</p><p>Mike decides that it would be a better idea to go into his house. We walk on the side and there is this strange gooey feeling under my feet, and I get this dread as if I were in Indiana Jones and the Last Crusade. It turned out they were gross berries and we ended up tracking them all over Mikes Living room. He wasn't too terribly upset, but he was a little OCD about cleaning it up. His living room is great, he put on the best soundtrack of the night, and it felt like the 1960s. Ari and Dan are tripping deep right now, and decide they want to start drawing. Me and kelly sit on the couch, but again she says 'You're bad, get over there.' 'Hm' I think, as I lay on the other side of the couch. She starts staring at mike and I realize that she's absolutely in love with him now. Very weird. She starts being a total bitch to me whenever I try to talk to her. Mike doesn't even realize.</p><p>At first, I was upset. I really thought this was gonna bring us closer together and instead she's all hot over my friend. Whenever I say something she just snaps 'YOU'RE BAD' or when I agree she says 'No you cant agree only mike can.' You can see in her eyes she's gone. At this point I realize how hard she's tripping, so instead of getting mad, I just stop talking to her and start bullshitting with mike. The basketball game is on and muted, and me and him bullshit for a little while. Kelly grabs paper, hides her face under it, looks at me and starts crying. I ask her if she's okay and she tells me when she hides under the paper she has to cry, but it feels good. Me and mike ignore her and dan and ari don't even notice, too wrapped up in drawing. Ari is drawing weird cave paintings and Dan is deep into drawing a fucked up face in marker. The music is Lucy in the Sky with Diamonds. I'm laughing at kelly and bullshitting with mike and I draw a picture and the world is fun again. It felt like it was the 1960s.</p><p>Knoll decides he'd like to go smoke some weed, and Mike decides were being too loud in his house. So again, we split into 2 groups. Dan, ari, and knoll go buy pot, me, mike, and kelly start the mile or so walk back to my house.</p><p>As we're walking, Kelly insists on being in the middle of me and mike. She says that mike is good and I'm evil, and that she has to stay balanced between the two. We walk and talk and laugh and say and see weird, tripped out shit, and finally kelly stops and kisses me. I'm still evil but she likes it now. We walk more, and kelly tries to convince us to let her walk in the middle of the street. We tell her she's fucking dumb for that, and she reluctantly agrees to stay off the well trafficked main road we're wandering down. Mike lights a cigarette and me and kelly watch in awe as it glows and trails behind him. We pass a baseball field and I look at the sky, which is amazing. It was like being in outer space, it was full of stars. Another two blocks walked and we're at my house. My sister and her friend walk out to their car just as we're walking up the driveway, and jump. They were surprised to see us, but they both knew we were on acid so they talked to us for a little while. They left, then we sat down on my porch and smoked what felt like 1000 cigarettes, just talking about religion, politics, meditation, etc. We go inside and Kelly loves me again. It's hot, but me and mike decide we want tea, so I put a pot on and heat it up. Kelly, on the other hand, wants to draw. So I get her a box of crayons and put her in my room. She tells me to get her when everyone gets here and I agree.</p><p>Me and mike sit down and bullshit for a few minutes and then the rest of the guys knock at the door. I let them in and Dan instantly tells me there was almost a fight. Knoll rolls his eyes and says there wasn't. Dan tells his version, knoll tells his, and it ended up that there were just some douchebag drunk kids and some words were exchanged in a very passive aggressive way on both parts. Dan starts twisting up the blunt and me and mike tell him its a bad idea since we all were already tripping balls, but he refuses to listen. I run up, get kelly, and kiss her for a few minutes. She comes downstairs with drawings for knoll and mike, and Dan gets insulted and asks 'WHERES MY DRAWING?' and she sneers at him. She doesn't like him tonite and has the gall to tell him so. This would be a trend. She started to tell mike and knoll that they both don't like her, she flipped out about how we shouldn't talk about her when she wasn't around. We weren't, and I told her that not everything is about her.</p><p>Everything in my house looks pixelated. My brain is in the clouds. But somehow, I manage to keep my composure. Not even on purpose, thats just how I trip. Knoll tells me I seem the least fucked up but my pupils are the size of tree trunks so he knows Im out there. The blunt gets twisted and we had out to my back porch. Nothing but colorful fish shaped lights and the glow of the red cherry on the blunt illuminate the room, and in the background the stereo plays the self titled CD by Owls, which is fantastic trip music if you haven't heard it. We all end up smoking weed but kelly, and knoll gets much more fun when he's stoned. We talk and laugh and do shit that stoners do, and Kelly starts trying to tear down all these emotional walls by asking my friends questions, mostly about their girlfriends. They all answer pretty honestly, and when the blunt is done Dan and Ari decide its time to go home. Its 1 am at this point but Im sure theyre still tripping like mad, plus they just smoked. But I wont stop them if they want to leave so I say my goodbyes and they leave me, mike, and kelly to talk amongst ourselves. It was nice and chill, until...</p><p>The drunk kids showed up.</p><p>Or friends Worm, Sean, and craig had been out drinking all night and knew we were here and on acid. So they decided to drop by. Now, I love these kids, but let me tell you, drunk people and trippers DO NOT MIX. Kelly flipped out and told them she didn't like them (wasnt true but she was on acid) and mike said they should go. They said they were staying all night, and knoll came back from dropping off ari and dan at this point. So I take kelly in and let her play with my computer, and then try to figure out a way to get rid of the drunk kids. I go out and start bsing with them, when my sister comes home. 'thank god' I think. 'Time to go everyone, my sister is gonna drive my girlfriend home so everyone out.' I felt bad sending mike, the last tripper, home, but he wasn't having any fun with the drunk kids there anyway so he was down to leave. We said our goodbyes, then I grabbed kelly and started making out with her. When I closed my eyes I saw rainbow diamonds sparkling in my brain. Don't ask what that means, thats just how I described it at the time.</p><p>3 am rolls around and kelly has to go home. The stuff is on the way out but its still going, and my sister agrees to take kelly home. We take the 20 minute drive and I enjoyed all the sights the parkway has to offer and I walk her to her door. She finds her way in okay and I go back to my car and talk to my sister about the trip, who just sort of laughs at me because she's stoned and thinks it's funny. We get home, I jump on the computer, and I get an IM from mike that says 'I think I have to go to the hospital. Great.</p><p>His leg had been numb all day. He had no clue what it was but the acid was fucking with him and he was worried as hell about it now. He'd gotten piss drunk the night before, probably banged it. He sounds like he was on the verge of going into a bad trip though, so I told him to meet me halfway between my house and his. I ran out the door, popped a cigarette in my mouth, locked up, and went out into the world by myself at 4 am. My footprints sounded like they were coming from behind me and even though it was scary as hell having imaginary people following me, it was cool, and watching my shaddow stretch and distort as I walked past lampposts was awesome.</p><p>We met halfway and I told him that he just walked about a mile no problem, so whatever injury he had in his leg would be able to get fixed tomorrow if he needed it, when he wasn't tripping. He agreed with my logic, but he said he couldn't go in yet because every time he tried to sleep he would see mayan drawings in his head. So we start walking. We go to a donut shop, get gatorades to replensih our broken bodies, and come down together. I see a car's headlights doubled up in a reflection, but there was no puddle, so the reflection didn't actually exist outside of my brain. We talk about how nasty we felt, how cool it was, how scary some of it was, and so on. I asked him if he regretted doing it and he said no, he liked 75% of it. But he said he wouldn't do it again because that last 25% was just too fucking scary. I have a pretty strong mind so I didn't get scared, but I understood where he was coming from. We drank our gatorades on a curb outside and watched the sun come up as we came down. We walked back to my house, and when we were both pretty much sober I drove him home. It was 9am at that point. I finally got to sleep at 11:30 am and got up at 4 to go into NYC for a concert. The concert itself was a hell of experience, but that's another story for another forum.</p><p>Oh, and Dan ended up having a bad trip when he got home. Sucks.</p><p>Bonus 1: Comparisons to other drugs I've done.</p><p>Shrooms: People compare acid and shrooms all the time, but they're really very different. Acid made me feel like my brain was superhuman, mushrooms always made me feel very unhuman. LSD was like a computerized brain, and mushrooms gave me an animal brain. Also, all the effects I thought I was gonna get from LSD (Shaddow kick trails, morphing mirror images, etc) came from shroom trips and my LSD trip had more patterns and colors.</p><p>LSA: LSA feels like an AppleIIGS to LSD's G5 PowerMac. All my visuals on LSA were big and clunky and low res, the colors were mostly just red and white, and the trip felt really slow. Acid felt realy fast and had very small, finely detailed visuals with more varied neon colors. The body load was much worse and the hangover was awful, whereas there wasnt any with acid.</p><p>DXM: Way scarier than acid, completely different though. Next.</p><p>E: Not totally a trip, but it felt nicer and lights actually looked cooler on E. Much worse hangover than acid.</p><p>Mescaline: Much, much smoother and more spiritual than acid. Visuals less obvious and more natural looking. Mescaline lulls you into a trance whereas acid clubs you in the head and makes you see stars.</p><p>Salvia: FUCKING FUCK FUCK FUCKED UP BAKLAAAAAAAA I hate salvia.</p>",
 "year": "2005",
 "id": "44204",
 "gender": "Male",
 "timestamp": "2007-12-07T08:00:00.000Z",
 "views": "2968",
 "dose": [
  {
   "time": "0",
   "amount": "4 ",
   "administration": "oral",
   "substance": "LSD",
   "form": "(cookie / food)"
  }
 ]
}
