{
 "id": 4420,
 "title": "Not for Everyone",
 "date": {
  "submission": "2008-09-23T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Dr_Green_Thumbxxx",
  "gender": "Male",
  "weight": "270 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.0 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>This was my very first time using this substance, and would say its definitly not my last time.  I have spent many months researching this drug and its affects, and would reccomend doing so before trying it.  I recieved a gram finally today after waiting a couple of weeks for it and had to try it out. ",
  "I meditated before trying this to lower my pulse and breathing pattern.   After making a CD to trip out to (I reccomend something your familiar with, that has a slow calm tune to it, like Jefferson Airplane's White Rabbit, Beatles or PINK FLOYD!) I sat back in my water bed, listened to the music quitely for about 50 minutes, breathing slowly, almost in a sleepy state.  I tried about 4 mg in a glass pipe with a butane lighter, but it dissolved into liquid and smoked for about 2 seconds, which wasn't enough to enhale, so i tried it again with about 5 mg., and the same result happened, so them i got out the candle and lit it, and put in about 12 mg. and put over the candle.  Soon it began to make a little smoke, when i bent over to inhale, all of a sudden i could see the pipe fill up as i inhaled to my lungs, and just like everyone says, it hit me the second it was in my lungs. ",
  "I started feeling like i was seeing stars, just like when you hold your breath too long.   As soon as i exhaled, it was over from there, gone to a different world, left earth, into a blackness as i closed my eyes. One thing I must really focus on when tripping is the breathing, at first it was a little hard to keep it slow and thats when i felt a little fear and regret from smoking it, but when i calmed down again, it wasa  good trip from there.",
  "Now i normally don't have too many visuals when using other psycidellics like mushrooms, except when i eat about 7 grams and have PINK FLOYD in the backround, but i was seeing swirls of blue and white as i was listening to Wheat Kings by the HIP. After six-seven mins. of intense tripping, i was back to reality, and as happy as a clam,  it has now been about 25 minutes since my comeback, and its was great!!!</p>"
 ],
 "erowid": {
  "id": "29069",
  "citation": " Dr_Green_Thumbxxx. \"Not for Everyone: experience with 5-MeO-DMT (ID 29069)\". Erowid.org. Sep 23, 2008. erowid.org/exp/29069",
  "substance": "5-MeO-DMT",
  "views": "2621"
 }
}
