{
 "title": "Slight But Worth It",
 "author": "???",
 "citation": " ???. \"Slight But Worth It: experience with Passion Flower (ID 44213)\". Erowid.org. Jun 5, 2007. erowid.org/exp/44213",
 "substance": "Passion Flower",
 "bodyweight": "135 lb",
 "report": "<p>I recently bought a passion flower vine from my local garden store. I have been looking for a legal high for some time and had discovered passion flower. The previous day I had eaten some of the stems of the plant and noticed a mood change. I was very happy and smilling a lot. I would contribute that to placebo however I wasn't expecting any effects from the amount I ingested. I was just tasting the plant to see if it would be palatable. The next day I tried a dose that I expected to feel.</p><p>I boild a cup of water and poured it over 4-5 cut up leaves (2-3 grams) and let it steep for 20 min. After I strained out the leaves I then squeezed the remaining liquid from them.  While the tea cooled I ate the boiled leaves. They taste horrible so I rolled them into little balls and swallowed them with water like a pill. The tea tasted ok but not good so I drank it in a few large gulps. I took my mind off it and started doing other things.</p><p>About a half our later I picked some fresh leaves and stem parts and ate them, about 2-3 grams. About 15 min. later I started to notice a heavy feeling in my body. I then went to the mall and movies with my friend. For about 1.5-2 hours I felt mildly euphoric, very relaxed. There was also the slightest hint of a weed buzz.</p><p>My take on the whole experience: not what I was hoping for (being high) but definately a relaxing and enjoyable experience. I do think that the effects were too strong to be just a placebo effect but I could be wrong. I will definately do this again (probably more concentrated) and I would also like to try smoking it some time to see if its effects are different. I'm not sure how to make an extraction of it but a high concentration liquid or powder would be great.</p>",
 "year": "2005",
 "id": "44213",
 "gender": "Male",
 "timestamp": "2007-06-05T07:00:00.000Z",
 "views": "34294",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "(leaves)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:30",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "(leaves)"
  }
 ]
}
