{
 "id": 4428,
 "title": "Coming Apart Perfectly",
 "date": {
  "submission": "2004-01-05T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Luke",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Woah!  Today has been the most incredible day Ive ever experienced, or one of them.  DPT is the most amazing drug that Ive ever experienced, and is something to be worshipped.  My fear and humble respect are given to this drug, and the doors that it opens into myself. The awesome power that this drug has shown me is incredible.  I seen visuals unlike any Ive ever seen before, and I tripped unlike I ever have before. ",
  "It began after 60 mg. insufflated, extremely intense, into thinking about being attacked by Egyptian giants (provoked by thinking about the Discovery Channel), and then thinking about what awesome alien gods that the Egyptians must have worshipped to build such great scary structures of giant cats (Very weird trip to think about). Eventually I sat on my bed and was able to somewhat gather myself, noticing that it seemed like I was sunken into my bed, to the point that I was actually part of my bed.  This is whenever the best part of the trip began.  The most awesome sense of respect and understanding occurred to me.  I began to discover my own potential, because I have never seen myself able to see what I seen then like this!  I was in a state that I was superhuman, and I could have been levitating off of my bed and I wouldnt have been surprised in the least.  It felt like molecules were separating, and I was one with everything.",
  "Then I observed my dresser, and patterns of eyeballs in my dresser.  Visuals beyond anything Ive ever seen.  I was connected to the universe unlike any way that Ive ever known, and it felt like I was communicating psychically with dead spirits, and this lead me to concluding that I was face to face with Death itself.  I felt a hollowness around me that scared the living shit out of me, faces of torment began to appear in front of me, and this was a learning experience that actually made me feel inner pain for the awesome nature of death itself and to the dying process.  I felt a coldness that I tried to wrap my arms around, that made my insides feel like an abyss, just empty death.",
  "This gives me a greater understanding of what death is because this is the closest Ive ever came to knowing it with myself.  After I forgot what I was trying to understand, I came out of a deep thought by forgetting what I was thinking about.  This is when I just enjoyed this awesome and fearful state with a foothold, and I was able to navigate it better.  I began to find very great meaning in everything that Ive neglected to give deserved meaning to.  Most importantly, my own death.  I dont want to die, and the reality that Ive seen makes this acknowledgement very scary.  The power that Ive experienced, the only way that I can describe it is as being religious and extremely emotional.  I was able to see into the details of perfection and understanding.",
  "It is like the smashing power of 5-MeO-DMT, prolonged into an amazing trip that is possible enough to navigate, with the most incredible visuals Ive ever seen.  I havent yet tried DMT, but now it is at the top of my interests.  5-MeO has basically scared the shit out of me too much to want to go back to it that often, but this DPT has become my favorite drug Ive ever had.  I will know this drug as much as possible!"
 ],
 "erowid": {
  "id": "29102",
  "citation": " Luke. \"Coming Apart Perfectly: experience with DPT (ID 29102)\". Erowid.org. Jan 5, 2004. erowid.org/exp/29102",
  "substance": "DPT",
  "views": "9221"
 }
}
