{
 "id": 4430,
 "title": "Not Worth It",
 "date": {
  "submission": "2007-04-10T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Peterframpton",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:04",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:07",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:11",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Tonight was my first experience with catnip.  I have been a long time smoker of cannibis but I recently had to quit.  I'm graduating so I figure I'll have to find a 'real' job soon.  I've been searching for some kind of legal high to pass the time.  Catnip was my first attempt. ",
  "6:30PM    I went to the local pet store to check out the catnip selection.  I bought the most expensive pouch for around $4.00 Pretty cheap for the amount that you get. It smells a little menthol-like but not quite. ",
  "2:37AM   I finally got home from work that evening.  I went home and threw in 'Fear and Loathing in Las Vegas' as I often used to when me and my friends used to smoke the buds. (stereo typical stoner movie, I know)  I broke out the rolling tray and rolled myself up two fatty joints. I've read that you're supposed to go 50/50 with tobacco but I opted not to.  I decided that I would just smoke cigarettes in between.",
  "2:40AM   I start smoking.  It was pretty dry, so it burned quickly.  It was probably the harshest thing I have ever inhaled into my lungs, but nonetheless tolerable.  I pushed through the first joint.  I felt a little something coming on.  Nothing very intense or all that impressive. ",
  "2:44AM   Smoked a cigarette, my head started to feel mildly buzzed up.  I quickly finished the cigarette and decided to smoke the other joint",
  "2:47AM   I suffered through smoking the other joint.  By this time I was feeling alright.  Again not too strong of a feeling.  Definitely no visuals or anything. ",
  "2:51AM   I smoked another cigarette.  By now the buzz was at it's peak.  I'd say that it's somewhere between the buzz you get from the first cigarette you ever smoke and a marijuana buzz.  I walked outside to get a good feeling.  My perception of everything was still very clear.",
  "2:55AM  Buzz is gone completely and I sat down to write this. I know they say this stuff is supposed to be a 'natural cure' for a sore stomach but it seemed to have upset mine a little bit. Peraps that was only because I had an empty stomach. ",
  "Overall, the buzz was mild and most importantly VERY short-lived.  To all those out there considering smoking catnip, I would have to advise against it, or at the very least don't get too excited about it.  It was harsh to smoke, the buzz wasn't intense at all, and it lasted for only a few minutes. I think I'll just stick to getting drunk to fill the hole of smoking weed instead."
 ],
 "erowid": {
  "id": "29104",
  "citation": " Peterframpton. \"Not Worth It: experience with Catnip & Tobacco (ID 29104)\". Erowid.org. Apr 10, 2007. erowid.org/exp/29104",
  "substance": "Catnip & Tobacco",
  "views": "20441"
 }
}
