{
 "title": "False Negative Drug Screen",
 "author": "FL Work Comp sucks",
 "citation": " FL Work Comp sucks. \"False Negative Drug Screen: experience with Oxycodone (with Acetaminophen) & Drug Testing (ID 44330)\". Erowid.org. Sep 5, 2007. erowid.org/exp/44330",
 "substance": "Oxycodone (with Acetaminophen) & Drug Testing",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Oxycodone",
   "(daily)",
   "",
   "525 mg",
   "oral",
   "Acetaminophen",
   "(daily)"
  ]
 ],
 "report": "<p>I was injured on the job in Sept 2002 and diagnosed with a herniated disk. There was also a tear in my left sacroiliac that was not Identified untill May of 2005. I went a long time without needed pain medication as my pain was dramatically underestamated regardless of the words and opinions that were coming out of my mouth to providers of what is called health care.</p><p>In January of 2004 I finally made it to a pain management doctor who prescribed me percocet and it was the first relief of pain I had recieved. I was also diagnosed with piriformis syndrome in November of 2004.</p><p>In June of 2004 after going to the doctor and going through the paces of getting prescription refilled and taking another drug screen as I was told was necessary under Florida workers compensation laws to make sure I wasn't taking any illicet drugs. When I went to the pharmacy the following day to pick up my percocet, they told me the doctors office had called and canceled my prescription. When I called the doctors office to inquire as to why, they informed me that I had had three negative drug screens since January of 2004 and the doctors assistant assured me that it meant I wasn't taking my medication and that I was probably selling them.</p><p>With the amount of problems I had that had not been diagnosed at that time, they were severely wrong. I tried to find someone who would test my hair, but I couldn't do that without a doctors prescription and i could only go to workers compensation authorized doctors.</p><p>I called a [doctor name / lab deleted] in Ft Myers Florida and discussed how I was using the medication along with the amount of water I was drinking to keep my system flushed as I'm unable to exercise and sweat. He told me with synthetic opioids such as percocet that a test called a GC/ms (Gas Chromotography/mass spectrography) had to be done in order to get a true positive result unless I was abusing my medication, which I don't. So with the original drug screen that I had in January they had not order a GC/ms, of course the fact I had not been prescribed the percocet at that time is kind of a no-brainer that I would test negative. In the April and June test they had not ordered the right test.</p><p>Before the test in June, I had taken my U/A I had taken my last percocet about 17 hours the night before from the time of the drug screen the following day. I don't take the narcotic in the mornings when I have to drive somewhere as it just seems dangerous to. But I didn't know they were testing me for the percocet to verify i was taking it. I thought as I had been told I was having the drug screen to insure I wasn't taking or doing anything else.</p><p>My doctors answer to his screw up was to dismiss me as a patient and in the discharge letter he did offer to refer me to a detoxification physician to help me with my problem. I responded yes, please. If I had a negative result for taking the medication I must need to detox. They didn't do it, they just got away from me as fast as possible to hope to avoid any liability, but Florida has this nifty little statute that says in work comp you can not collect damages for pain and suffering and since they were getting paid by my employer/carrier they weren't actually working for me.</p><p>My money benifits ran out last October and I am still unable to work, much less go to school. The only surgery I have has is the day I went to the doctors and signed the first peice of workers compensation paperwork - they removed the Bill of Rights from my life.</p><p>I have another story about getting prescribe Neurontin in Sept of 2003 for my pain, eight months before the FDA fined Pfizer 427 million dollars for fraudulently marketing that medication. It was like a Tazer for the brain, but wasn't quite as bad as being prescribed Tramadol and Zoloft at the same time and getting the experience of serotonan syndrome. It a fun, fun world. Good thing I'm not taking those horrible illegal drugs that could kill me as I lay around on my heating pad and suffer.</p><p>There are also big issues about the 'war on drugs' in Florida, but they allow insurance these long and drawn out delays between doctors appointments, while I'm trying to get well and having to stay on the percocet, they are trying to not pay for getting me well. I can't wait to get out of these dysfunctional relationships with my state.</p>",
 "year": "2004",
 "id": "44330",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-09-05T07:00:00.000Z",
 "views": "23012",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(daily)"
  }
 ]
}
