{
 "title": "Made a Complete Fool Out of Myself",
 "author": "Dale",
 "citation": " Dale. \"Made a Complete Fool Out of Myself: experience with Absinthe (ID 44369)\". Erowid.org. May 13, 2008. erowid.org/exp/44369",
 "substance": "Absinthe",
 "bodyweight": "45 kg",
 "report": "<p>[Erowid Note: 500 ml of absinthe is considered an extremely high dose, also an extreme dose of alcohol (>10 shots)]</p><p>I do not recommend anyone to drink 500ml of straight absinthe. This was a very stupid idea and I can't really remember drinking it. My story really began when I woke up on a grim Saturday morning full of cuts and bruises and a wicked headache. I had no idea what had happened except for the first few shots I had with my good friend who had brought back a bottle of absinthe from Spain. I had to phone him. No answer. I continued to phone around in hope that someone may have some if not all of the story. I managed to gather the information that I had wandered over to my local pub with my mate who was also drinking the absinthe.</p><p>Apparently I made a complete fool of myself, shouting and swearing and wanting to fight a large group of steroid abusers. And this is not my nature at all. Make love not war, I have always said. I'm usually a quiet person who just enjoys a smoke and a few mushrooms now and then. But that stuff changed me in way that I now see why Vincent Van Gogh cut his ear off. Because he was drinking that devilish stuff excessively and I was in such a state that I probably would have as well. My mother apparently found me outside my backdoor with my trousers around one ankle, head butting the door and cursing everything under the sun. And no mother wants to see their 17 year old son in such a mess, trying to make snow angels on wet grass in the pouring down rain. By the next day some things started coming back to me.Very hazy memories of tripping my face off. This was stronger than any acid I have taken before. I completely lost all control of mind and body. And I don't think the steroid boys are happy with me at all. But nevermind them, they're just another brick in the wall.</p><p>I had no idea Absinthe was so weird. After just a few shots, I became perfectly articulate and clear and happy. And when the bottle was emptied by just two of us, then I became a jibbering moron with no logic or self control. As for my freind, he was found outside the pub on a bench and taken to hospital. Were both ok now but I still feel like I've shamed myself for no reason.</p>",
 "year": "2005",
 "id": "44369",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-05-13T07:00:00.000Z",
 "views": "29328",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 }
}
