{
 "id": 4441,
 "title": "Heat Stroke - Near Death Experience",
 "date": {
  "submission": "2004-09-15T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Relentless",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "36 caps",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens"
  }
 ],
 "report": [
  "Kast year when me and my friend split 72 caps, big and small, on a cheese pizza, I had a life threatening experience. I'll start about 5 hours into the trip when things took a turn for the worse. I was sittin in the front room of the house, doors closed, people smokin. The first feeling I got was sort of a clog feeling in my forehead. Then it started to actually feel like the front part of my brain was liquifying into my nasal cavities, causing MAJOR fear due to me bein so clouded with thoughts. I got up to look at myself in the mirror, no color in the eyes, just black with a grey ring around it. My vision started to get fuzzy with white, so I went for the couch to sit back down... but 2ft from it I collapsed falling face first into the couch. At this point the people around me started to get scared, saying 'There's something wrong with A' (yes my name is A in this story). They suggested I go out back, outside. By this time I was completely blind with white. So I began to walk, using my arms to feel whats in front of me, and friends directing my way.",
  "Just as I reached the room with the backdoor, I completely lost it and collapsed... felt like a seizure. I even squirmed and shook for about 5 seconds as I remember, I could still hear the voices around my, but I just had the main thought 'I'm done for, my life has reached the end, there's no way I can fix this'. Well I came to, vision came back about 10 seconds later, and I was just scared out of my fucking complexed mind. Proceeded outdoor, and literally forced myself to puke my shoving my fingers down my throat... seeing whole shrooms come out and land in the grass.",
  "Today, a year later, I finally started to figure out what happened. I think it was a heat stroke... the room I was in had no ventilation, and people were smoking. The part that scares me is... If I didn't go to that back room with the door already open and cool air, I would have passed out in the front room, not having a chance to be in a ventilated area, which is why I came back so quick back there. People fucking die from heat stroke if not properly taken care of quick, meaning if passed out 10 seconds earlier, I could quite possibly be dead. If anything like this happens to you.. for your life, go straight to the outdoors or a fucking cold shower."
 ],
 "erowid": {
  "id": "29129",
  "citation": " Relentless. \"Heat Stroke - Near Death Experience: experience with Mushrooms - P. cyanescens (ID 29129)\". Erowid.org. Sep 15, 2004. erowid.org/exp/29129",
  "substance": "Mushrooms - P. cyanescens",
  "views": "12305"
 }
}
