{
 "title": "Fireworks",
 "author": "Enfect",
 "citation": " Enfect. \"Fireworks: experience with LSD & Cannabis (ID 44419)\". Erowid.org. Oct 16, 2007. erowid.org/exp/44419",
 "substance": "LSD & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  "DOSE: T+ 0:00",
  "0.5 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  " T+ 24:00",
  "1.75 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  " T+ 0:00",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>This past weekend I obtained an ounce of marijuana to smoke/sell, and 4 tabs of acid to split between myself, and my friend Jules on the 4th of July. The night prior to the 4th, I had just come home from a party at which I drank and smoked; however, I did not want the night to end so early, as it was roughly midnight. I was thinking about going to bed so I can enjoy acid the next day until it hit me, I have work on Tuesday (the day after the 4th). Three days a week, I am a foot messenger in New York City, and deliver packages all across Midtown Manhattan, something you do not want to do after an evening of acid. I began to stress over this and decided to simply take a half a tab tonight and a lower dose on the 4th. I placed half a tab on my tongue, and nothing. I had expected the paper to dissolve, but it did not; it just sat there.</p><p>After about 5 minutes of waiting for this piece of paper on my tongue to disappear, I decided to simply swallow, as I figured it would work as long as it was in my body. I called my brother to surprise him with the fact that I was dropping acid for the first time, he was excited for me and informed me that it should kick in within 20  45 minutes. I played video games until then. I checked the time, it was an hour past ingestion (1:45 am). I got slightly frustrated that I did not feel anything and decided to go to the bathroom.</p><p>As I walked to the toilet I noticed the first sign of the acid. My entire downstairs floor is black and white tiles in a checkered pattern, and as I was walking they seemed to be flowing together slightly; outside the borders. However, I could not decide if it was the marijuana and alcohol, or the early stages of the trip I desperately desired. I went back to my room, and sat on the computer for a little bit. I decided I should smoke a joint and hopefully boost the trip. Roughly 2  2.5 hours after ingestion (shortly after smoking) I was laying on my bed and felt a pleasant body buzz, as well as a heavy head (literally).</p><p>As the trip progressed, the vividness of my memory decreased; I was on the phone with 2-fellow-LWSers, but I do not remember who. My brother then came home and we listened to some music before he went to bed. I definitely felt very different and pretty damn good. At around 4:45 AM I decided sleep was necessary for my big day, but the acid did not seem to agree. Sleeping seemed almost impossible and whenever I did fall asleep I would wakeup in what seemed like 5 minutes to tell my friends they had to go home, but no one was here. This happened many times, and I vaguely remember dreaming about a friend who looked like your classic hippy and rode a colorful umbrella bicycle.</p><p>The next day was rough. I figured I slept around 3 hours, possibly less, possibly more, but I did not feel like any satisfying number. I went with my family to a barbeque, and attempted to take a nap but once again could not. I was exhausted, but found that ice-cold water replenished some energy temporarily. I then went home to grab the acid and the weed, and Jules picked me up and we went to the next town over, Livingston. The plan was to hangout at this outdoor festival form 6  12 (PM) with some girls I knew in the town, we had no idea what to expect.</p><p>It was taking place at the field of the towns high school and we knew there were to be fireworks. Jules and I both dropped one and three-quarter tabs of acid (6 PM). The 3 girls met up with us at around 6:30 and we hung out on some rocks. About an hour after ingestion (7 PM) we agreed we felt a very slight buzz but nothing significant. We walked over to the field and many more people were there, Id estimate between 300 and 500 people. At this point Jules and I were just chilling, laughing to ourselves about whacked out people as they passed us, until the skydivers came.</p><p>There were four skydivers who seemed to have appeared out of the sky with American flags and streamers attached to their legs. The first diver came down quickly, and we were almost certain he was going to get hurt. The three other divers landed in a much more pleasant manner, but during the entire event we were hysterically laughing. Once we collected ourselves we wondered if the acid was responsible for such giddiness and joy, or at least we hoped. Jules, I, and one of the girls, Liat went to her house to hangout for a second and smoke a Joint. As we walked Jules said he was definitely feeling something, but I could not determine whether I was or not. Once we began to smoke Jules said he would not partake, for he wanted to see how acid was on its own.</p><p>As we walked back to the carnival both of our trips started to elevate, intensely. The sun had set, and it was 9 PM, and the first firework test shots were being launched as we reached the field. The entire grassy area was filled with adults, kids, teens, everyone from the town and then some; filled with well over 2,000 people. As Jules and I walked we lost Liat and the rest of the girls and walked side by side through the see of people hysterically laughing and grinning ear to hear. We could not handle the happiness around us. It was truly incredible.</p><p>Finally, we walked deeper into the field and lay down on the grass to watch the fireworks. MAGICAL. We were blessed with 20 minutes of the greatest show of our lives. I was never a big firework buff, never really into them; but this was like nothing I had seen before. It was as if I was watching fireworks with 3d-goggles with color enhanced lenses. Various times throughout the show both Jules and I broke into laughter and Jules began to cry at one point. We were definitely at our peak.</p><p>Following the fireworks, we met back up with the girls and went to the local convience store, which was packed with Livingston kids around our age. During the time we walked to the fireworks to now we were engaged in what seemed like deep philosophical conversation, most regarding to the culture of the society around us. We analyzed how people act and perceived things, as well as their conversation; defining invisible walls that so many peoples minds do not surpass. At the same time, everything we saw and felt was utter happiness, and good feeling. I felt so happy to see anyone and anything, and everything felt more comfortable. We continued our conversation on the way back to Liats.</p><p>It was 11:20 PM when we arrived at her house. We went up to her room and Jules began to get very nervous. I told him he should call his dad to pick us up from where we were, but it was clear he was in no condition to hold a conversation with his father, let alone give him directions to somewhere he himself had never been before. I told Liat we had to go outside and chill, and that I felt Jules needed some air and space (we were cluttered and hot in her room). Once we got out he cooled down a bit, and suggested we walk back to the store and have his dad pick us up there. Jules said he was much more comfortable and Liat instructed us on how to back there.</p><p>On the walk back to the store Jules began to get upset, and within 5 minutes I did as well. We were talking about our future and how we did not want to live in a world in which our occupation rules our lives. We did not want to kill ourselves, but rather find a new way on our own. We talked of learning how to utilize solar power, water power, and windmills to power our own houses and electricity; and live without jobs. This was one of many connecting moments we obtained during the night. Throughout the evening, we began to converse and totally connect on new levels; it was as if our minds were tuned to another frequency than everyone else.</p><p>When his dad picked us up I almost burst out laughing in the car because of the music his dad was listening to and the awkwardness of the situation. It was strange how when we were around someone we had to seem normal in front of that we just were not sure how to act. None the less, we both pulled it off, and got passed our parents no questions asked. When I got home it was a little past midnight, and I had work the next day. I hung out a little bit, talked to some friends and decided to try and sleep. I could not. I texted (text messaged) Jules  neither could he. For the next hour I struggled to lose consciousness and by 3 AM succeeded.</p><p>I woke up at 6:30 AM, exhausted. I went to the bus stop (I commute to work) only to be sent home from work at around 11 AM because I had forgotten my ID and could not get into any buildings, this was a blessing. I already doubted if I could succeed in todays messenger services and was given the golden opportunity to go home. When I arrived home I watched a documentary and got some rest. Smoked a little weed, and Jules came over around 3 PM. The remainder of his night was slightly more interesting. He told me when he got home he was staring into the mirror and his face was morphing and like his eyes turned into his mothers on his face. He also started to draw a little (did not come out too good, although he is an incredible artist) and attempted to write a story. He too passed out at around 3 AM.</p><p>All in all, the 2-day experience was one I dont think I will be forgetting anytime soon. And the second day was easily one of the best days of my life. The most common question Ive been asked so far is how does acid compare to shrooms? I say, It doesnt. The two experiences were extremely different and I dont think they could be accurately compared. As far as the level of enjoyment, that is simply a matter of taste =).</p>",
 "year": "2005",
 "id": "44419",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-16T07:00:00.000Z",
 "views": "3104",
 "dose": {}
}
