{
 "title": "My First Trip to Paradise",
 "author": "Daydreambeliever",
 "citation": " Daydreambeliever. \"My First Trip to Paradise: experience with Mushrooms (ID 44429)\". Erowid.org. Oct 16, 2007. erowid.org/exp/44429",
 "substance": "Mushrooms",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>For the most part, I do not participate in drug use. I have smoked marijuana a few times in my 40 something years; however, I have never enjoyed the high. I do drink alcohol, but rarely to get drunk anymore. So, when my friend wanted me to join him on a trip on mushrooms, I was quite aprehensive, down right scared really. But I wanted to face my fears, as my friend assured me the trip would not turn out to be something out of my control, that I wouldn't get lost and never make it back, and so I did it. Here is a short synopsis of my amazing experience.</p><p>Preparation:</p><p>The day before our trip, I ate very light: fruit, veggies, no meat, lots of water. On the morning of, we ate only fruit and drank tea.</p><p>Set and Setting:</p><p>My friend's place on the edge of a redwood forest. I feel extremely safe here, and it proved to be our own little Eden. </p><p>Dose and form:</p><p>I ate about 1.5g of dried mushroom caps and stems (probably Liberty Caps).</p><p>Timing:</p><p>My trip followed the graph shown on this site very closely. I began to feel a buzzing in my head, which then traveled through my limbs. I began feeling a fair bit of nausea, chills, trembling, fast breathing. My friend, who had tripped before, helped to get me out of myself. He reminded me to breath slowly, told me the bad stuff would soon pass. All this occurred within about 30 minutes. Walking through the forest, I began noticing patterns, fractals, tunnels through the trees, rainbows of light, and my depth perception began to change. Things looked closer to me than in my usual reality. And then colors began to really stand out. Greens were the most vivid, gorgeous, lush greens of the grass and trees. All of this by the end of hour 1.</p><p>Plateau:</p><p>I pleteaued within an hour and a half, and what a time I had! I cried a lot, I laughed even more, and I felt unbelievable joy. I saw the beauty of nature as I never had before. Everything I had read and been told about how mushrooms would change my perception were true. My ablitity to concentrate was increased and diminished all at once. I was able to change my focus at will, or remain on a topic as long as I wanted. But typically, I wanted to do and experience everything at once. Of course I didn't because my body felt heavy and lazy and moving around was no easy feat. </p><p>Truth serum?</p><p>I found myself speaking aloud nearly every thought that occurred to me. Lying would be an impossibility for me on this drug.</p><p>Out of Body Experience?</p><p>The most amazing sensation I experienced was the lack of physical sensation I had. I knew my nose was running when I cried, but could hardly feel it. When hunger occurred, I talked about the sensation as if it were happening to someone else. I repeated things such as 'my body must be hungry' or 'apparently my nose runs a lot when I cry'. When I walked barefoot on the hard ground, it felt soft and warm. I felt release from my physical body and came to a realization that I am not my body. It was really quite a spritual awakening.</p><p>Visuals:</p><p>I had closed eye visuals much like those I have read about. Geometric shapes, kaleiscope images, typically in green and purple. Open eye visuals included mild halucinations such as seeing a flower open before my eyes, when of course it really hadn't.</p><p>After glow:</p><p>After about 6 hours, I felt 'myself' again, but still slightly affected. And I felt wonderful, minus a bit of slight nausea and a mild head ache. During a walk, I felt as if I was seeing for the first time. I was able to see birds at the slightest movement and identify detailed characteristics. I felt free and light, and at home in my body. This feeling lasted for nearly two days, and continues to some extent. I feel a desire to be outdoors, exploring nature.</p>",
 "year": "2005",
 "id": "44429",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-10-16T07:00:00.000Z",
 "views": "3218",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
