{
 "title": "I Had to Try Acid...Now I've Got HPPD",
 "author": "HPPD SUCKS",
 "citation": " HPPD SUCKS. \"I Had to Try Acid...Now I've Got HPPD: experience with LSD (ID 44431)\". Erowid.org. Feb 28, 2010. erowid.org/exp/44431",
 "substance": "LSD",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "oral",
  "LSD",
  "(blotter / tab)"
 ],
 "report": "<p>If your going to try drugs stick to weed and shrooms (in moderation,please.I can't stress this enough.. I have hppd and dp b/c of all my bad and crazy trips on lsd and extacy. I have taken acid 3 times and extacy 4 times. hopefully the low amount will equal fewer years dealing with hppd and dp</p><p>My first time tripping on acid was during my senior year of high school. I was 18 at the time. a friend and I got the chance and decided to take it. my friends name is D.well after getting the acid I was real happy about getting it. went to his rent's house to trip. at midnight we each took 2 micro-dots. D sat down in his bed but not before he got me a regular bean bag to sit on. I was like YES I get a FUCKING BEAN BAG to sit on when I experience acid for the first time for the whole night. being pretty unfucking comfortable being it in the middle of winter and sitting on a bean bag. I waited for the acid to kick in. I just took the acid without really peparing my mind for a few minutes or anything. this may have played a crucial role in my experience. also the fact that I realy wanted to be trippin outside during the day so that I could get as much positive energy in me as possible didn't help either. but what the hell I figured the acid would take my mind away from it all. so d and I just sat silent for 45 min. then suddenly I felt myself getting really high. it wasn't positive though like weed or shrooms it was  like a bad chemical was controlling me. I didn't laugh giggle or have a good vibe. I decided well this may be somewhat of a weak bad trip. then I began seeing visuals which I decided to concentrate on. the walls started to breath and where all 3d-like and the carpet patterns started to crawl and shift. I knew then that this was going to be so cool. words cannot descible the feeling,sensation.</p><p>I've never really understood what loss of ego meant but it definitly happened to me. well the acid or myself must of not wanted me to leave d's room because I sat there for the rest of the night looking at D's room. telling myself he must be going thru this same stuff as me or he might be having a competely different trip. for some reason I couldn't get up the courage to talk to D. and ask what he saw or to tell him that him and I should go get something to eat and take a walk around the neighborhood. I got real pissed off at the fact that their was no talkin going on. see Im a real talkative kinda guy. and know that talking on acid would be a positive thing. I did finally say something like whoa look at the carpet and the walls. but this wasnt enough. anyway. i sat there like that till 7 o'clock in the morning. wishing for it to end. I fell asleep after that. ..... this rest of this i have written for anyone dealing with HPPD.</p><p>well I wish that was the end of the story but since that trip i got really depressed, quit my job..I have been real tense since and its been 2 and half years. teeth grinding kind of tense. like when you roll on e (probably another reason i have this problem).I also have been extremely weird since then. and I know im not making this up b/c people from my school during my senior year told me to my face that im weird. Im just one of the persons that shouldn't take acid. It got so weird that I quit talking for a looongg time and I mean months. and just doing weird things like start playing the guitar when in reality Im a drummer. I see geometric patterns a lot when  close my eyes, I have trouble scheduling my time or have regular flow of thoughts.</p><p>Im pissed off that Im putting my family throgh this and that they've had to pay over a thousand dollars to pay for my psychiatrist whom i recently quit seeing and knew I shouldn't be seeing in the first place bc noone can help me I got to get through it myself. I've been on many meds and my opinion is is that they all suck.</p>",
 "year": "2003",
 "id": "44431",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-02-28T08:00:00.000Z",
 "views": "5111",
 "dose": {}
}
