{
 "title": "Was it Really MDMA?",
 "author": "Anonymous",
 "citation": " Anonymous. \"Was it Really MDMA?: experience with Unknown (sold as Ecstasy) (ID 4445)\". Erowid.org. Jan 23, 2001. erowid.org/exp/4445",
 "substance": "Unknown (sold as Ecstasy)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "Unknown",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I initially started using ecstasy in the summer of 1999.  I have ingested approximately 40 pills of different 'types' of ecstasy, and never really had a bad experience.  One time I had taken 3 pills, which is another story altogether.  Recently, a good friend of mine had acquired some yellow ecstasy(?) pills called VIP, as they had those letters stamped on the top.  All the ecstasy I ever took were white, so I was a little skeptical at first.  I was in a very comfortable setting, in my own apartment that I shared with some other guys who I am good friends with, so there were no bad environmental settings.  I was also in a good mood, as I had just finished up a semester at school and was ready to party.  I ingested one of these pills.  Roughly 35 minutes after ingestion I began to feel the first vibes of the drug taking effect.  Shortly after the initial effects surfaced, I noticed some stomach disturbances, nothing major I thought, just a little grumbling like if you are hungry.  About 1.5 hours after taking the pill I began to reach the plateau.  The effects were similiar to ecstasy: jaw clenching, teeth grinding, energy, euphoria, openness, compassion, very talkative, etc. But there was a very noticeable 'meth' quality to these pills.  Shortly my friends and I proceeded to smoke a  joint of high-grade weed (some strain of kind buds).  About a half hour after this, I could feel that my body temperature was rising abnormally.  I was dressed lightly, and I was drinking gatorade prior to this, so I was a little scared about what was happening.  All of a sudden, I got the most intense headache of my life.  I was sweating, my eyes ached, my heart was *pounding*, and my brain was hurting.  With every heartbeat I could feel my brain 'bulge' inside my skull and my heart was beating very laboriously and slower than normal (like 1 time every 2 seconds).  I thought my heart was going to beat right out of my chest and I had serious thoughts of rushing to the hospital.  Everytime my heart beat I clinched in pain as throbbing shards of pain surged through my head, similar to a migraine headache I assumed.  Thankfully, this 'headache and heart' episode subsided after I projectile-vomited 3 times.  I immediately knew that this could not be true MDMA, or it was cut with some other methamphetamine.  After I vomited, the trip was very enjoyable the rest of the night with no bad effects.  Another odd thing is that I was awake for almost 46 hours, I couldn't sleep if someone paid me a million dollars.  In all my prior ecstasy experiences I never stayed up anywhere near that long.  Also, throughout the night, I had trouble remembering anything.  I had trouble understanding what people were saying, remembering what their names were, etc.  So, in short, I do not believe these were true MDMA pills and I urge anyone who comes across these to NOT take them, as they could have the same bad reactions I did and may not be so lucky...</p>",
 "year": "2000",
 "id": "4445",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-01-23T08:00:00.000Z",
 "views": "17163"
}
