{
 "title": "Fun, But Nothing Special",
 "author": "delysiduous",
 "citation": " delysiduous. \"Fun, But Nothing Special: experience with 2C-I (ID 44451)\". Erowid.org. Nov 27, 2005. erowid.org/exp/44451",
 "substance": "2C-I",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I was sitting in my room one night, bored as hell. Way too cold to go outside, and I got a little tired of the computer/tv/book/video games. I had some 2C-I, so I decided to do a controlled experiment. This was my 3rd time with this substance, but the other two times I mixed it with other hallucinogens, so this is the first 2C-I only experience. All time increments are in minutes. Here goes:</p><p>T(8:10 pm) 20mg 2C-I dissolved in a cup of water. Drank water, refilled cup to get anything that was left, drank again. Immediately after drinking I felt like I was coming up a little bit, pretty sure that was placebo effects though because I usually get that everytime I take something. Decided to play a game on my computer for a while, cuz I know this stuff takes a while to come on.</p><p>T+50 I'm definately starting to trip a little bit; slight visuals, my pupils are a tiddle bit dilated, and when I try to read something it's difficult to focus on the text.</p><p>T+55 Wow. I never knew that 5 minutes could make such a difference. I am reallllly tripping now. It's music time. I am feeling slight pressure in my head, not nice but not strong enough to be uncomfortable. My walls are breathing like they just ran the marathon, and I am getting all kinds of semi-pleasant body sensations. For example, a bit tingly all over now and then, some spikes in my body temp (never too high), a bit a dead weight in my legs, and still that pressure in my head.</p><p>T+115 I am having a damn good time at this point. I get up from the chair I ws sitting in, and start moving around to see what I can feel. Strangely, I feel a little bit like liquid. Then I realized why that is. I can (at least think I can) feel the blood in my veins. If I put my hands up in the air, I can feel it going down my arms, and when I drop my hands, I feel it rushing back down there. It is a pretty cool feeling, one that I have never felt before. The trails are really good at this point, and it is almost like I can cut slices of air with my hands. Visuals are pretty damn good, like 150 mics of acid I think, but a little different.</p><p>T+125 Close encounter of the parental kind. Shit. I am still under the influence of my parents, so this is the sort of thing I have to worry about from time to time. My mom has caught me high millions of times, and tripping once. I can usually act normal, but it is my facial expressions that give me away. When my mom sees me she sez that I look like I was up to no good, and fortunately she doesn't notice my pupils, she just thinks I am high. I convince her that I was in my room the whole time, and since it doesn't smell like smoke, I obviously couldn't be high. I am shaking like crazy at this point, my heart is beating like a hummingbird, but luckily, she buys it. Phew.</p><p>I notice that there are almost no cevs at all, definately no definite patterns, I'm a little disappointed in this respect.</p><p>T+170 I am still having lots of fun, but starting to get disappointed with the intensity of the trip. The visuals are just about good enough for me, that's not the problem. There is almost nothing in my head but that pressure, and I can easily focus on something and ignore the trip. I like it when the hallucinogen is much more assertive of its power, and I have to fight for it if I want to do something other than trip.</p><p>Since the cevs are almost nothing, I decide to check out my mind modulator. This thing is a little hard to explain, check them out at www.mindmodulations.com (I think I am within the rules here because this is not a supplier for substances (thats what the rules say), but electronic devices). I have the Sirius model. When I am sober, this thing shows me kinda cool kaleidiscopic patterns, cool colors, its much better than nothing. When I am tripping, WOW. Think of the cevs you would be getting from your whatever strength trip, and multiply that buy 100. That's what its like. Its super cool. Anyways, this is able to give me some pretty good cevs rite now, I enjoy myself for about 15 minutes like this.</p><p>T+230 Trip is slowed down a bit I think. Visuals are still apparant, body load is a little less, I feel alot calmer than I did before. Decide to put on some cool music, don't remember what, and I was thinking about how it's weird how music can do funny things to my head. I play around with the Alt key and the number pad for a while, looking at all the different symbols I can make. I didn't realize the 4 suits of cards were there, . </p><p>Where I am sitting, there is a light above me to the right, and above me to the left. it keeps looking like the lights are flashing in the corner of my eyes, when I look right at them they are normal though. It seems that the lyrics to every song I listen to have a deep meaning for me, no matter what the song is about.</p><p>T+365 Feeling just about nothing at this point, still getting some slight visuals. I could easily have gone to sleep, but I woke up late that day so I wasn't tired. Played some more games on my computer.</p><p>T+470(4 am) Trip has wound done to almost nothing. The visuals I am getting are only slightly more intense than the ones that I get when I am sober (I am constantly 'seeing' stuff these days). I decide to read for about an hour, then go to sleep. I woke up at 2 pm the next day, feeling very rested, and very much myself.</p>",
 "year": "2005",
 "id": "44451",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-11-27T08:00:00.000Z",
 "views": "7641"
}
