{
 "title": "All Extremes of What Emotion has to Offer",
 "author": "still tired",
 "citation": " still tired. \"All Extremes of What Emotion has to Offer: experience with MDA & Caffeine (Sold as Ecstasy), Alcohol & Cannabis (ID 44469)\". Erowid.org. Apr 24, 2007. erowid.org/exp/44469",
 "substance": "MDA & Caffeine (Sold as Ecstasy), Alcohol & Cannabis",
 "bodyweight": "145 lb",
 "report": "<p>Well, Id like to report an experience I have just had a few hours ago. Lets see, its 9pm now, at 12am this morning my friend and I were camping out, playing poker drinking beers and smoking bud, we decided to kick it up a notch and take our pills - 1 each. After doing some research, I realized that the pills I had were MDA and caffine. Let me note that drinking and taking pills is a dumb idea, so dont do it. Its just so easy when your rolling so hard.</p><p>anyway... 12 am -dosed up</p><p>1am - Playing poker getting good alerts. Luckily I researched this drug and the slow come on that builds up to a roll didnt alarm me. I was not expecting the rush of MDMA. This was my friends first ever full blown XTC experience, its a shame it was not real MDMA</p><p>1:30ish' am - Feeling extremely good. Nice conversation. Poker is infinetly fun. some body sensations were noted. mostly extreme mood elevation and increased empathy.</p><p>1:30-2am  - We decide to grab some beers, pack the bowl and head down to the beach. The walk to the beach was incredible. Lying on the sand was even more intense. I just layed back, closed my eyes watched the psudeo psychedelic visuals and 'melted' into the earth. I remeber saying something like, 'Why cant we always be at peace like this?' My friend was having a more talkative roll and wanted to discuss EVERYTHING. I humored him but to be honest it took me down here and there, I felt bad for him becuase I would occationally suggest that perhaps silence is best at times. Overall very content. I remeber telling my friend who wasnt quite feeling it strong yet that it felt like a gift from the universe and the world was making love to me. we made many trips to and fro to the beach that night.</p><p>Around 2am - I thought I was peaking but was not. All of a sudden I felt the to familiar 'holy crap, this is intense' feelings. For a second I didnt know if I could handle it; now I was peaking. I could feel my temp rise. Instead of freaking out I rather suddenly got up and insisted I needed water bad, we headed back to the site and guzzled gallons of water. I felt much better after that.</p><p>2-3ish' am - I couldnt stop dancing! even sitting at the picknick table I was grooving all over the place. Smoking bud felt terrific. frequent urination was prevelant.</p><p>3:30am - I was still riding the peak but noticed that I was coming down a bit. Overall it was ok.</p><p>4am- The best effects are over. Still riding whats left but does not nearly feel as good. Start getting more and more agitated at everything for no reason. I tryed to tell my friend so I didnt offend him. I was quite aware this crash was going to be horrid.</p><p>By 5am there was only uncomfortable body energy and the horrendous wtf am I doing to myself feelings that happen time to time after such experiences.</p><p>Past 5 am - The sun coming up was hard. Wasnt ready for it. CONSTANT urination. No appetite completely drained, trying with all my might to 'hold it together'. Sleep was not an option, I finally got some sleep a few hours ago but that was it since I woke up at 10am yesturday morning. I managed to ride out the worst of it and was only feeling very small effects by the time I lyed down. DAMN CAFFINE! there must have been a ton in that pill becuase I was feeling extremely strong caffine feelings with the uncomfortable amphetamine energy tremors as well. I felt hot and drained, hung over (beer) and burned out (pot) overall that sucked.</p><p>Post roll - Even though I was 'down' there was still some left over psychedlic/speedy effects that were subtle but apparent, my eyes stayed dialted till about till six or seven this morning. I was not feeling well at all, so I took some 5-htp and valarian root for nerves and hopes of ending the bad feelings.</p><p>Overall I would have to say that I must have took too much, that or caffine and amphetamine is a bad idea (why use caffine anyway? no sense at all!) I am back to baseline now. No depressed feelings, no feeling stressed out, nothing of the sort that I was experiencing this morning around 5-6.</p><p>Conclusion - extrmely amazing night the feelings I had were of the upmost divine pleasure and physical sensuality with complete emotional stabiity. It was like sex for the soul that lasted six hours. However the crash almost made it not worth it. I have NEVER crashed before, well not like that, usually its just a sad goodbye to a good time. The crash this morning cannot be put to words, then again neither can the complete euphoria I felt. I guess you have to experience it for yourself. I probably would have not felt so shitty If I wasnt drinking. I remeber saying to myself, 'Remeber this, remeber how shitty you feel after, dont abuse this, respect it, dont forget'</p>",
 "year": "2005",
 "id": "44469",
 "gender": "Male",
 "timestamp": "2007-04-24T07:00:00.000Z",
 "views": "8626",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDA"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  },
  "2": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
