{
 "title": "Difficult Symmetry",
 "author": "Angry Young Spaceman",
 "citation": " Angry Young Spaceman. \"Difficult Symmetry: experience with Salva divinorum (ID 44473)\". Erowid.org. Sep 15, 2008. erowid.org/exp/44473",
 "substance": "Salva divinorum",
 "bodyweight": "190 lb",
 "report": [
  "<p>I had been under the impression that Salvia had been trying to enter into my life. I had heard it mentioned on the way back from a zen meditation retreat by one of my fellow practioners. It sounded intriguing, but I had long renounced all of my earlier experiences with entheogens, which had taken a good seven years (about 15 to 24) of my life. Those experiences had centered entirely around LSD, mushrooms, ecstasy and mdma. I had been extremely fortunate and lucky, not a bad trip to report and a general feeling of possibility, empathy and ecstasy from each one. So it was odd that, at this later point (I am now 36), I'd feel compelled to tamper with consciousness again. But Salvia had been described as gentle and legal, an introspective aid to meditation and so on. Never would I have guessed that it is one of the most powerful and distorting hallucinogens (taken at relatively high doses) that I'd ever tampered with.",
  "Acquiring it was simple. Powdered Divinorum leaf is available at most head and grow shops so I ducked into one nearby and was given a gram of the powdered leaf. The seller said nothing about the concentration though I assume, now shaking from the aftereffects, that it was of top drawer potency. I then ducked round the corner and purchased a little ten dollar bong. Salvia had been popping up all around me, in conversations, references, and on the web, so I was convinced the green lady had something to tell me.",
  "My intention was to do it alone, since the literature told me that, while operation of heavy machinery should be avoided, the first experience was generally mild. Euphoric, mildly dissociative, nothing more. Thank fucking Christ I didn't decide to do my first bong hit with my girl-friend, who is generally skittish and inexperienced with any drugs, in the next room. Instead I decided to call a good friend and moderate drug veteran who was the just right combination of goofiness, empathy, and adverturer to want to join me. I called and promised him a night of shamnistic fun and he readily agreed.",
  "I had a glass of wine first since most of the experiences I read said alcohol wasn't a serious contraindication. It wasn't, but I was still completely unprepared for what followed. The instructions from the grow store told me to pack a full bong load and take 'a HUGE bong hit'. With my friend grinning at me from the couch I packed the entire bowl with about a third of gram, lit my butane lighter, and dutifully started sucking away.",
  "I remember feeling the effects sharply after an alarmingly short period of time, perhaps seven seconds, and then, according to my friend, since I have no recollection of what happened next, my face went completely slack and infant like. I apparently looked like a six month old and I attempted to put the lighter and bong together over and over again, as if it were a machine or device of some sort. I began speaking gibberish. He gently took the bong out of my hands and asked me what I wanted. I then started to have a very intense and inescapable sense of being locked in the cellular structure of some enormous organic and geometric grid, like that of an an M.C. Escher drawing. Like a patient under the influence of anaeshtesia or someone who has almost been asphyxiated, I had the bizzare sense of not being either awake or asleep, but somewhere else in between.",
  "While I was locked in this organic and ruthlessly geometric pattern (my body has dissolved entirely into it's pulsing contours) I felt it vibrating with an intense energy that was neither positive or negative, just intensely weird. It was dissociative in the extreme and very terrifying, because I had the feeling that I was disappearing and becoming part of the vast geometric pattern, whatever it was. I remember sensing that I was integrated into part of a vast curved surface. The sensation of not being an individual and not being able to move was very disturbing and weird beyond all imagining. My friend reported that I repeatedly tried to get up and was uttering unintelligible fragments that meant I did no like the experience at all. At that moment I'll agree that I didn't, but in retrospect I'll say that it was too completely overwhelming to be categorized under 'like' or Dislike'. Let's just settle for overwhelming.",
  "I also had the sense that my friend was also a part of the grid, somewhere else, and that he was fine with everything. I even imagine him living in his part of the grid like some sunny and surreal Escher elf, happy and completely bizzare, giggling away. That was just my friend being a good sitter. He later reported that though I thought his words were reassuring, he was only speaking soothing gibberish to me. I looked like a baby, so this made sense to him. What is strange, however, is that I distinctly remember him saying 'It's cool, all of life is like this'. All of life is like being cemented into some pulsing geometric Teletubby land?",
  "I remember wanting the experience to be over, to get back to the land of distinctions, when I'd be able to distinguish who I was and what my limbs were and be able to move again. But the stronger that wish grew the more the experience seemed to intensify the threat of completely dissolving me altogether. I'm sure that a stronger dose and I would have lost myself entirely. Of course the threat of ego death is one of the key aims of entheogenic experience, but this dissolution of self and ego was so....literal. It's great to think of myself disappearing poetically, or religiously, or metaphorically, but LITERALLY? By which I mean, and have no doubt, I was LITERALLY stuck in some gigantic pulsing geometric pattern where my body was slowly dissolving into it, had no sense of time, and a sense that my self was about to liquify.",
  "There was also the bizarre sense of being outside of my own life, as in: when we are surrounded and cushioned by our comfortable concepts such as space time and self, we divide our lives into day and night. This time, however, I was outside of the sense of day and night, I was only watching my life unfold as a third party, which gave it a slightly horrifying quality - like an endless dream or wheel from which I would never escape. Was this the wheel of samsara? If so, it was crushing me and it was absolutely, balls to the wall fucking terrifying.",
  "My friend kept making reassuring cuckoo noises and I gradually, very gradually, returned to myself. I remember feeling ashamed, as my friend, not an old old friend but more of a recent buddy, had been asked to witness too much. I'd just had my entire pulled head first directly out of my asshole and then flung into total oblivion. I felt as if I'd just undergone triple bypass surgery or had my diapers changed in front of him. Psychedelics are nothing if not humbling. The first thing I said as things gradually, and thankfully regained their distinctness, was that he probably would not want to undergo the experience. He wasn't a eager veteran of psychdelic experience like I had been, and seeing me go slack, infantile and incoherent didn't whet his appetite.",
  "Coming to, however, I kept marveling at the extreme discrepancy between the hallucinogenic world I had been in and the sensory world around me. The hallucinogenic world had been huge, absolute, brutally symmetrical, soul dissolving. The world that emerged afterward was particular, small, lovely, distinct, full of unexpected asymmetries and quirks than a more symmetrical world would allow. It continued to surprise me. Every thing seemed incredibly complex and wildly extravagant compared to rudimentary, cellular and bizzare world I had almost been dissolved into.",
  "It occured to me that I had visited some very basic level of existence - maybe the cellular level, and was now able to appreciate the incredibly complex human world: of forms, concepts, metaphors, similes, symbols and semantics. Instead of experiencing these as chains from which I had been liberated I returned to them ravenously. 'Look at this wall'! I kept saying about the brick wall of my apartment 'It's so...irregular!' I've always known that asymmetry at just the right point is the key to beauty. But I never fully appreciated it until now.</p>"
 ],
 "year": "2005",
 "id": "44473",
 "gender": "Male",
 "views": "3046",
 "dose": [
  {
   "time": "0",
   "amount": "333 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 ],
 "submissionDate": "2008-09-15T07:00:00.000Z"
}
