{
 "title": "Made Me Quit Forever",
 "author": "Bob G",
 "citation": " Bob G. \"Made Me Quit Forever: experience with Tramadol (Ultram) (ID 44485)\". Erowid.org. Jun 24, 2007. erowid.org/exp/44485",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "160 lb",
 "report": "<p>[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I have done some painkillers before, mainly vicodin and percocet, but I had never tried ultram before. The first time that I did it was last night. Anyway, I was in my room, just bored as hell, and I remembered I had the tramadol. I crushed three of them into powder, and then mixed it into some OJ. After that, I took two more. Total ingestion time took about 2 minutes.</p><p>Well, after that, I started feeling generally slowed, euphoric and warm, and I also got to thinking that I wanted to see my friends at a local coffee shop. I drove there and back, it took about an hour total, and by that time an hour and 20 minutes had passed. I started to feel the high intensify. Thoughts would enter my head and go out the other end with little care from me. </p><p>An hour later I would know the meaning of fear. I got onto the computer at home and started chatting with my friend, and I started to feel a bit nauseous. Queasy. My breath was becoming labored. Looking at the wall I started to notice a spinning, double vision, like a bad inebriation.  I started to panic at this point, but I knew that if I lay down, that everything would probably be okay. My heartbeat went up to the pace of a drum, and I knew that it was very unhealthy. I crawled to the couch and lay on my side. I started hearing this *clack clack clack* noise, and I realized that it was my teeth chattering. I was shivering all over, and sweating. My mindset was... ' Oh my GOD, Bob you've overdosed you're going to die what were you thinking' But I calmed myself with serene thoughts.</p><p>My heart rate seemed to slow after that, however it would speed up manically independent from any movement or thoughts that I had. Waves of nausea and... buzzing still continued. That's when I struggled to get to the gallon of water on top of the fridge. I consumed about 3/4 of a gallon of water in about 20 minutes.</p><p>After that, I tried to throw up with no luck. An hour later, I had to piss. I stumbled to the bathroom, (and this is kind of gross) but I couldn't. It felt like my prostate had shrunk and it would only come out in trickles. That experience, combined with having to piss so bad was just like the lowest point of the high. I felt like everything was going out of control, I didn't know if I was going to die or not, my heart rate would not go down, and on top of that I couldn't piss to save my life.</p><p>I started to feel the onset of like a nodding feeling, a feeling that I usually welcome after I finished pissing, but I knew that I could not let myself fall asleep. At the time I was convinced that if I nodded off, my parents would find me in the morning, dead in my bed. Finally, after I sat up on the couch, indian style and trying to my control irrational thoughts, and frightening symptoms, I started sweating. A lot. And it felt like the more I sweated, the less the nausea was. Eventually, after about 4 hours of the bad trip, I was able to calm down enough, and have the symptoms retreat enough so I could get some sleep.</p><p>I awoke at about 6 am, and had to piss. Same prostate trouble that I had before, and I noticed that I was still High. I went to bed again. About an hour ago, at 3 in the afternoon, I awoke, still a bit shaky, but pissed normally. It made me quit pain pills forever, because I never want to go through that bad trip again.</p>",
 "year": "2005",
 "id": "44485",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-24T07:00:00.000Z",
 "views": "39972",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(blotter / tab)"
  }
 }
}
