{
 "id": 4449,
 "title": "Smoking - Noticable or Not",
 "date": {
  "submission": "2007-06-07T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "-=Anti-Hero=-",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.25 g",
   "administration": "smoked",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "0.25 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "0.5 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "At 11:30pm, one of my friends decided that he would roll a weed/mushroom blunt. I urged him not to, as I had been informed through my own internet research that heat is harmful to psilocybin, but this advice was shot down because he 'just wanted to try it out.' So, he rolled one gram of weed and one gram of mushrooms, mixed together well, into two blunts.",
  "This was done, and lit up at 12:00am as five of us were relaxing in a partialy enclosed patio (fairly small) that was filled with comfortable chairs and couches, and lit with blue, almost christmas style lighting. Between the five of us, two smoked very little, and I estimate about a quarter of a gram of each weed and mushrooms were smoked by myself; with about the same for the remaining two. When this was done my friend brought out half of a cap for each of us, so I chewed it up, and placed it in my gums for about 20 min (I forgot it was there for a while).",
  "As I suspected it was relatively mild, mostly feeling like weed alone, I could hardly notice anything out of the ordinary (I have never done mushrooms before) except that I seemed a little bit happier, and a great deal more introspective and accepting of the outcomes of my own mental wanderings than usual. The reason I say perhaps there were no affects of mushrooms is because the last few times I've smoked I've been happier and more mentally active than all the other times I have smoked. There's not been much weed for me in my lifetime, but what can I say, I do it sometimes because it's readily available; but most of my drug experience is based in ecstasy and morning glory usage.",
  "I suspect my friend had two reasons for not dosing higher: one, to ensure noone dosed too high on an unknown method of using mushrooms, and two, to see if any of us had extreme reactions to mushrooms(only my friend, and his brother, who took a small amount this time had shroomed before). Whatever the reason though, I believe we should have just eaten some to begin with...",
  "My friends all said that they thought they felt something, but most are quick to jump to conclusions and to deem something a success based on only minor evidence that may or may not point in a particular direction. I am sceptical that this method was sucessful at all, and I believe that if it was, the response due to mushrooms was small. One notable fact however, is that my friend and his brother are quite the avid pot smokers, and as such people probably more in tune to how stoned they are, said 'the stoned feeling lasted far too long,' and was 'too intense' for them to have had on such a small does of weed even if the weed was the super-potent stuff it seemed to be before.",
  "For me, the stoned feeling went away completely (light-weight) at about 03:00am. At around 04:00am, wishing to continue the night in a relaxed, but awake pace, I did 1/2 of a hit of ecstasy (pill is quite potent, probably around 100mg MDMA in a full pill), and around 250 morning glory seeds, to see their synergistic affect, but that's a whole different story all together.",
  "Exp Date: Dec 10, 2003",
  "Suggestion: Eat the little things..."
 ],
 "erowid": {
  "id": "29161",
  "citation": " -=Anti-Hero=-. \"Smoking - Noticable or Not: experience with Mushrooms & Cannabis (ID 29161)\". Erowid.org. Jun 7, 2007. erowid.org/exp/29161",
  "substance": "Mushrooms & Cannabis",
  "views": "8087"
 }
}
