{
 "title": "Black Hole of the Mind",
 "author": "SgtPepper",
 "citation": " SgtPepper. \"Black Hole of the Mind: experience with Mushrooms - P. cubensis (ID 44527)\". Erowid.org. Sep 15, 2008. erowid.org/exp/44527",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "150 lb",
 "report": "<p>My memory on this experience is a little fuzzy even though it only happened the other day. About 2 weeks ago I purchased 3.5 grams of Mushrooms from a friend of mine. He said that they were 'The best shrooms this house has seen' which he also mentioned 'Is saying alot considering how much shrooms have come through here.' It was 35 dollars for the whole bag ($10 a gram).</p><p>I tried the shrooms a couple times taking only a fraction of a gram each time just to be safe. Each time I was given a sense of clarity.  I would turn of my light and stare up at the ceiling and get light visuals. The easiest way to describe these visuals would be 'like looking at TV static with 3D glasses on'. Not because the static looked 3D, which it didn't, but because the static was all red and blue like 3D glasses.</p><p>One thing I'm quite proud of that I thought up when on one of these light shroom trips is this theory (well, more like a philosophy) I like to call the theory of proportions. I'm pretty sure some scientists have come up with ideas like this, but I've never heard any. Here it is copied the same as I wrote it while one of my shroom trips:</p><p>Imagine you are an ant, or at least the size of an ant. Now to you everything is bigger. A portable TV is the size of a movie theater, a bread crumb can feed you for a week. But if you were your normal size a bread crumb is nothing. If you were starving to death and you saw a bread crumb you wouldn't waste the energy to pick it up. Now you understand how proportions work. Now think about this; space, not like planets and stars, but the actual space in which they exist is infinite. So in proportion to the universe we, Earth, the galaxies, and all matter are infinitely small. Infinitely small is basically the same as nothing. Nothing meaning non-existant. Therefore we do not exist and nothing we do, see, or feel will ever matter.</p><p>It's not very scientific, but it's an interesting way to look a things.</p><p>For some time I was saving most of the mushrooms until I could meet up with my friends and share it with them, but it was summer now and school was over, so I had no way of meeting up with them. So the other night I was watching Fear and Loathing in Las Vegas and I guess I just decided to do the large dose of shrooms I was planning on doing. Maybe it was watching Hunter Thompson trip on acid, or maybe I was just plain sick of waiting. My friend J recommended that I just start off with like 1 gram, but the people I know who are heavy drug users implied that more was needed to get a good trip going.</p><p>I got a piece of bread, drowned it in peanut butter, sprinkled on just over 2 grams of chopped dry mushrooms, folded it in half, and ate it with a glass of some very crappy lemonade. It was at 4:30am. My mother was asleep in her room in our tiny apartment. It was only about 15 minutes into the movie (Fear and Loathing in Las Vegas).</p><p>First I noticed light visuals and the usual way everything looks 'different'. I saw the carpet doing some odd things, already more intense then my usual light trips. As I'm watching the movie I start to notice that nothing they are saying makes any sense. It all sounded like jiberish to me. Occasionally I would make out 1 or 2 sentences. I could hear them perfectly, in fact I think the shrooms made the TV sound louder than it actually was. They would seem to be talking normal but instead would say something like 'Frudkin malusk binfurd dorra?'</p><p>When I knew I was seriously tripping was the scene in the Elevator with Cameron Diaz. They still weren't making any sense. You know when you look at your fingers and move your eyes out of focus you will see 2 of each finger? Well that's what Cameron Diaz's face looked like, only instead of two faces in a wide space there were like five all in the same small space. It seemed like it was going in slow-mo. If I hadn't of already seen the movie several times I would have sworn they were just doing visual effects to show you how high Hunter Thompson was. Although he wasn't actually high in that scene.</p><p>I wrote down in my book that I felt like I was in Hunter Thompson's High. I could think extremely clearly, but I could barely write at first. If I didn't remember what I had written down I never would have been able to read it, because the handwriting was so horrible. I couldn't even write in complete sentences.</p><p>'SOUND WORD SPEAK SOUND JIbERiSH' I wrote.</p><p>Everything I was seeing was so beautiful. 'Vegas must be the perfect city for shrooms' I though, admiring all the lights as I watched Hunter Thompson and his lawyer drive through the strip. I paused the movie and went into the kitchen, but I can't remember why, not now or when I got there. When I got in the kitchen was when I realized I was SERIOUSLY hallucinating. A dirty pan was out, that was filled with grease looked like it was bubbling and moving. The pattern on one of the plates began to move in beautiful ways. Everything was oozing. I was very excited and was hoping/expecting for the whole trip to go like this. I must of been in there for 20 minutes half because everything I looked at was beautiful and amazing, and half because I couldn't walk without wobbling. My eye-hand coordinations was almost non-existant. In addition to that I felt like I had no energy at all.</p><p>Eventually I made it back to my room and this is when everything went terribly wrong. Suddenly I felt very naseaus. I thought I was going to throw up. This is when I panicked. It was about 5:30am now and my mom was awake. If I went into the bathroom and threw up my mom would hear it, come to see what was wrong, talk to me and instantly know that I was stoned since she herself had done acid and possibly other substances in the 60's. Panic hit me like a train. I decided I would go outside and vomit in the bushes outside the apartment building. I thought this was a very bad idea but I didn't have many options. I rushed to put on my pants and after I did I was trying to find my T-shirt. I looked under the bed, but it wasn't there. I should have just opened up my closet and gotten one out of my dresser, but I was too stoned to figure this out.</p><p>After that I blacked out. Which I didn't realize until what I am roughly guessing to be two minutes later when I woke up jammed between my bed and my nightstand. I no longer had any urge to vomit. I got off the flour and climbed into bed. This is when things got really painful. The easiest way for me to explain what I was feeling as I layed in my bed was a Black Hole of my mind. Everything; my senses, my memories, my emotions, my thoughts, were all just melting together in a puddle of mud that was my life. Everything I saw was beautiful and colorful, but in my mind was the single most painful experience of my life. Random thoughts and memories. All my thoughts were in the voice of Johnny Depp as Hunter Thompson from the movie.</p><p>In a conversation I had with my mother a week earlier we were talking about the movie we had just seen; Batman Begins. In the movie there are a couple of scenes where people have very vivid hallucinations. She said something like 'all hallucinations are are brain spacims'. So now all through this 'Black Hole' my mother saying 'Brain Spacims' is going through my mind over and over. It really felt like I was in hell. The mushrooms felt just like poison going through my body. It felt like I was dying. I was so afraid. I was afraid that I would lose the people I love. That I would be helpless to stop it. I tried bargaining with myself. I said told myself I would never do drugs again, that I would always treat my body with respect.</p><p>I started to think about my life and started to realize how horrible I had been to everyone. I didn't feel anything for anyone so I didn't know how I hurt people. Now I was being hurt and I was forced to realize the pain I caused those around me, and how we all caused pain to those around us. I realized that the reason we are in pain is because we do pain to others. I discovered there are 2 basic reasons why people hurt other people. The first is out of ignorance, and the second is out of fear. People hurt other people because they don't understand the pain they cause. And they hurt people because they themselves are afraid of being hurt.</p><p>I wanted to call up my step mom and tell her that I respect her as a person. I wanted to call my father and tell him to I love him. Mostly I just wanted to be nicer to everyone. Even if I didn't like them. I had always been mean to people just because I thought they weren't as smart as me, but I now realized that everyone is both very stupid and very wise at the same time. They are wise because only they can understand the things they've been through, and they are stupid because they will never understand what others have been through. Somehow knowing this, and knowing some other piece of wisdom I picked up during my trip, but now forget; I realize what the yin-yang symbol means. It's not about balance. It means everything is the same, and equal. I can't remember anymore, but I knew this during some of my trip.</p><p>Laying in bed, I managed to fall half asleep. Now I saw hell. It looked like it was in the earth's core, except instead of being surrounded by lava, I was surrounded by hallucinations. Rainbow colored snakes coming out of every directions. It was like a multi colored lava lamp. Still, everything beautiful. I was in hell with millions of other people. We were all just trying to walk around without stepping on each other, which at the moment I thought was a good metaphor for life. Next I imagined Jerry Seinfeld Standing up in all of this chaos and just decided to do a bit. It was actually very funny, though I can't remember any of it now, and I think it helped me relax a little bit.</p><p>I couldn't fall asleep though. For some reason it felt like there was a big hunk of steel in my pillow case. I fluffed my pillow over and over but it was still just jammed in my face. Because I was so tired and so stoned this really really hurt, but I couldn't get rid off it and I had so little energy that getting out of bed was unthinkable. Finally I figure out that there might be something under my pillow that was doing this, which normally would have been my first thought but the shrooms had disadvantaged me. So I reached my arm under my pillow and pulled out one of my cat's toys that I had place under there earlier for whatever reason. Just as this happened I realised that I was starting to come down. It gave me a great sense of relief that I could now rest comfortably, even though I was to screwed up to actually sleep.</p><p>After a while I got bored with trying to sleep and had enough energy to get out of bed and finish watching Fear and Loafing in Las Vegas to try to take my mind of the anxiety the mushrooms were making my feel. At this point I was feeling the trip that I had been hoping for, and actually managed to enjoy the movie. After the movie was over I took a shower and eventually came down at 9:02pm, though I kept feeling light effects until I fell asleep at 6:30pm.</p><p>Today I am feeling completely sober and though I believe that to have been the most painful experience in my life I am greatful for it. Now I am a much better person, and show people respect. I do not regret taking shrooms at all, though I still don't plan on taking them or any drug ever again. However I expect I will use Marijuana again, but certainly not anytime soon since the mere mention of taking drugs makes me want to vomit.</p>",
 "year": "2005",
 "id": "44527",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-15T07:00:00.000Z",
 "views": "3124",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.2 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
