{
 "title": "Helped with Opiate Withdrawal",
 "author": "BB",
 "citation": " BB. \"Helped with Opiate Withdrawal: experience with Kratom (ID 44536)\". Erowid.org. Aug 20, 2006. erowid.org/exp/44536",
 "substance": "Kratom",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 Tbsp",
   "oral",
   "Kratom",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>For three weeks, I made poppy tea daily from dried and fresh heads of Papaver somniferum.  I typically used 10-20 heads for a moderate to strong dose of morphine.  After this brief period, I found myself mildly to moderately physically dependent.  Having experienced morphine addiction to its fullest less than a year prior to these three weeks, I was acutely aware of the signs of dependence and withdrawal: runny nose, watery eyes, lack of muscular strength, uncontrollable yawning, aching back, excessive sweating, and persistent insomnia.  This is not to mention the emotional emptiness, despair, painful sensory overload, and constant nagging hunger for more opium.</p><p>I received powdered Mitragyna speciosa foliage from an online vendor with the hopes that it would ease the discomfort of my minor withdrawals.  Heading into the first morning of withdrawals after an almost sleepless night, I took one level tablespoon of the powdered leaf and drank it down in some hot water.  Bitter, green flavor  not terrible, but not pleasant.  I returned to my bed where my lover slept, unaware of my withdrawals.  I stared lovingly at him, smelling him, watching him breathe, and waiting for some relief. </p><p>Ten minutes after ingestion, I felt suddenly comfortable.  I no longer had the desire to twist and turn and stretch my achy back.  Also, a mild wave of euphoria, similar to but not as powerful as that caused by morphine, washed over me.  I closed my eyes, and for the next twenty minutes, felt as though I could make up for an entire nights lack of sleep in an instant.  My mind wandered dreamily; felt like slipping comfortably into dreams late at night or being stuck somewhere between dream and reality in the early morning.  For a few minutes, I saw shadows and ghosts of closed eyed visuals, teasing to take more solid visual form, but drifting away before doing so. </p><p>The initial comfort and euphoria gave way to a general good mood, with no sign of opiate withdrawal.  I made breakfast for my partner, enjoying the food terribly.  I could not wipe the smile off my face, an effect I have found from both him and opiates.  After an hour or two, we contentedly walked around my neighborhood, holding hands, enjoying the sun.  I noticed around this time that my pupils were practically non existent, and I looked to myself like I was on morphine.  I also began to feel some dizziness, and a strong urge to sleep.</p><p>At t + 4hours, the effects were subsiding, and I felt fine but for some dizziness.  I later found that a third of this dose is optimal, providing comfy opiate-like effects without dizziness or sleepiness. </p><p>I should like to provide a warning that I have found Mitragyna to be physically addictive itself, with withdrawals similar to but much less severe than morphine, but will not go into the rest of my experiences with this fascinating plant here and now.  Enjoy!  Be safe!</p>",
 "year": "2005",
 "id": "44536",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-08-20T07:00:00.000Z",
 "views": "17087"
}
