{
 "title": "Pizza with Rainbow Music",
 "author": "Hirotheavitar",
 "citation": " Hirotheavitar. \"Pizza with Rainbow Music: experience with Mushrooms (ID 44565)\". Erowid.org. Oct 19, 2007. erowid.org/exp/44565",
 "substance": "Mushrooms",
 "bodyweight": "145 lb",
 "report": "<p>To start with, I have been looking for shrooms for the past eight or nine months with no luck. I followed every lead, asked every druggie I met or smoked with, or anyone with anything to sell. Not a soul seemed to be able to find any psychoactive drugs. Finally, my luck changed. After promises of shrooms, then lsd, and many 'We couldn't get them, man's my friend Crystal finally came through. $250 for an ounce. They were supposedly grown by some scientist in one of the larger cities near me and were thought to be extremely potent. I'm not sure if this is true or not, but I'll tell you my story and you can decide.</p><p>So, I was impatient the whole ride home and excited as hell. Chris and I picked up our friend Sally and went over to my house to begin setting up. We cleaned up a bit, got some water and peanut butter and started eating. I said 'We'll each take three and trip balls!' and began chewing on the PB-coated shrooms. Well, the first thing I discovered was how horrid they feel in my mouth. It's not so much the taste as the texture that makes me want to gag. We finally got them down, with not much help from the sticky PB, and sat back to wait. And wait. And wait. And wait. The hour was filled with 'Oooh, I think I feel a tingle.' and not much more than that. After two hours I was fairly upset and wondering if we'd got burnt or if it was simply too low a dose, and goddamit I was GOING to find out! So I ordered a pizza and pulled another 14 out of the bag. I chewed them all down over a few minutes and sat back to wait.</p><p>After 10 or 15min I started giggling at little things, and feeling in a good mood. I thought maybe this was going to be it, but was in such a good mood I didn't really mind. I got up off of the couch and told Chris and Sally, 'I guess we're just SOL, but I've got to piss.' and went off to the bathroom. That's when the insanity started. The lights were out, and as I was pissing I couldn't help but notice the shadows on the bottom of the tub were moving around and that the shower's curtains were, well, they were breathing. Not only that, but EVERYTHING in the bathroom was breathing. I yelled to my friend Chris, 'HOLY SHIT! IT'S KICKING IN!' and started looking around some more. He yelled back, 'Yeh?! What's up?!' and I told him about the room's breathing and then told him how I had suddenly noticed the bits of the wood door melting into each other.</p><p>I was in total awe. When I emerged from the bathroom everything in the house was breathing on its own. I layed down on the couch and looked around wide-eyed attempting to describe how each item was breathing when I was suddenly hit with what felt like a psychic wave. It was like a burst of energy rolled over my body. My whole body convulsed with the wave. I told my friends what were happening to me. This happened a few times over the next minute, and each time my friend Chris would laugh and say 'Another wave, eh?' I was like, 'Yeh. Wow.'. Suddenly the entire room seemed so much larger and I just lay back on the reclined couch taking it all in. At one point Chris seemed to take on very pig-like features and looked like a cross between a pig and a person; I started laughing at him and saying things like 'Hahaha. Leave me alone you crazy pig-man!' I simply couldn't get past the pure glee of him being a pig as well as man. Finally Chris said, 'Alright. Let's go outside.' And what a trip that would be.</p><p>I made the long voyage to the door, and as soon as he opened it I almost fell back in amazement. Every single plant outside had a rainbow-colored aura coming off of it in little waves. It took my breath away and I staggered down my steps to the ground. I turned and looked at this huge pink flower we had been growing and stood transfixed as I watched each part of it breathe. It seemed like it was trying to communicate with me, and I couldn't help but sit there attempting to listen. They finally got me into the car and we headed to my friend Jon's house to see our mutual pal Scotty, an ex-shroomhead.</p><p>The entire ride was beautiful and made me grin. The whole way I kept telling my friends I should have taken more to get a god-like experience, and then going back on it and exclaiming that I had taken way too much. John lives far into the country, so it was quite a trip being out there surrounded by so much nature. Scott was amazed I had taken so many and seemed to think I would have a bad trip. He was wrong. He told me a few helpful hints, and then my friends just sat around and talked. I kept feeling like I could empathize to a psychic level and wondering if Scott or John were upset with me. They told me they weren't over and over, but I kept asking. Finally we left, and the visuals had calmed down a bit. I couldn't help but notice how very beautiful nature was in my town(I hate my town) and how it enveloped all of the buildings. I was under the impression we were much like hobbits, building our homes into the side of nature.</p><p>When we finally got to the house, things were still breathing and swirling a bit but most of the visuals were running out. So I lay back on the couch for awhile and had more of a introspective piece of the shrooms. I started thinking about the people in my life, and suddenly it all made sense. I understood how every person felt about me, and how I felt about them and what our connection was. I knew all of my problems, and how to solve them. I understood how humanity worked and felt as if the world suddenly made sense. I started crying because I was so happy with this information, and everything felt so right and beautiful.</p><p>I got a phone call and went into my bedroom and layed down and spoke to someone(can't recall whom) about how beautiful everything was. I do remember them saying, 'You are sooooo high.'. But I refused to accept it as a simple drug trip. The impression I had at the time was that drugs were a disgusting thing. Meth, Pot, Coke, Pills, those were drugs. Surely this wasn't a drug, it was an experience provided by nature to let us appreciate her more; a defense mechanism against the way human beings can ravage the earth without a care. I eventually got up and went back into the living room to lay down on the couch with my friends while they listened to some very trippy music. I simply layed there and started thinking.</p><p>I started thinking I had taken far too many shrooms because I could not just stop thinking for even an instant. It was like my mind was racing faster than I could keep up with suddenly. I began wondering if I was ever going to come down and got very frightened I wouldn't. I became sad because I didn't want to go back to the normal world where everything was still and normal and I would have to become part of 'the system'. It was strange, I didn't want to go back to normal, but I was so afraid I wouldn't that I as simply dying to be off of this drug. It alternated back and forth very rapidly. After half an hour or so of this, I sort of snapped back to normal a bit and regained my ability to speak(it had seemed so difficult before). So I told my friend Chris to make sure to ask me things if I stopped talking and to make certain I was alright.</p><p>I told them, 'You could not imagine the thoughts I've been having over the last few minutes alone.' and I began trying to teach them about how human beings were and had always been hunter/gatherers and that our role was the same, the only difference was that we had evolved. Now our doctors were our healers and our farmers were our gatherers, etc., etc. He just listened and gave good feedback. Finally we got up again, and went outside. The visuals were all gone but I felt very connected to all of the bits of nature I saw. I sat on the steps that are my 'porch' and they both sat to my right and left directly in front of me. I sat there for awhile and talked and told them so many things that I can't remember. After awhile I came down and realized I was back to normal so Chris took me to eat chinese. The only noticable difference was that I stared at my sweet and sour sauce for a good 10min while I stirred it.</p><p>It took about 4 - 5 hours from the time I took the shrooms with the pizza until the time I came down. Reading all of the experiences and FAQs helped me deal with this first trip in much better ways. I knew what to do to prepare, how long to wait, and how to deal with any crazy things that popped up. I understood alot of the subtle parts as well(like the afterglow) and the information provided online made the whole experience so much better.</p>",
 "year": "2005",
 "id": "44565",
 "gender": "Male",
 "timestamp": "2007-10-19T07:00:00.000Z",
 "views": "2654",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "3 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 2:00",
   "amount": "14 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
