{
 "title": "A Dark Carnival",
 "author": "Kaoskid",
 "citation": " Kaoskid. \"A Dark Carnival: experience with Salvia divinorum (20x extract) (ID 44575)\". Erowid.org. Oct 19, 2007. erowid.org/exp/44575",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "215 lb",
 "header": [
  "DOSE:",
  "1 hit",
  "smoked",
  "Salvia divinorum",
  "(extract)"
 ],
 "report": "<p>Herein I will attempt to describe my first experience with salvia.</p><p>It was my birthday and my salvia extract had arrived earlier that morning, it was taped to the inside of the shipping container, came in a small poly bag similar to those used by jewelers and had a very peculiar musty odor. I was very tempted to rush off to my room, take out my pipe and give it a try. I then remembered that a friend of mine who does not share my enthusiasm for psychedelics would be arriving shortly and he tends to feel some discomforture around people who have injested anything more than a glass of wine. I wanted him to feel completely comfortable in my home so I decided to wait.</p><p>Long after the celebrations had died down and everyone had gone home I decide to try the salvia. I went to my bedroom, pulled my pipe (a gift from my stepfather, a miniature round based bong) out of the almost impenetrable depths of my closet and prepared myself for the experience. Sitting in front of my altar with a mixture of excitement, curiosity and trepidation I placed a pinch of the extract in the bowl of the pipe, lifted it to my lips, place a lighter flame at the lip of the bowl and inhaled until I felt as though my lungs would burst and lay down upon my carpet. As I lay there writhing from the harshness of the smoke I opened my eyes and looked up towards the ceiling, which was not clearly visible as I had turned off the lights just after preparing the pipe, at the very moment the effects started to occur.</p><p>The effect was incredible, it was as though I was looking at a window through a kaleidoscope, hundreds of traditional four pane windows, three to a set, forming something akin to Euclid's 47th proposition around an equal sided triangle. The next vision was more disturbing, three people dressed in radiation/hazmat suits were doing something to a me that wasn't me but I could not be sure of exactly what they were doing until it dawned upon me that this was my metaphorical birthing into the world of salvia. I succeeded in standing but when I moved my arm it felt as though it was warping in the opposite direction. I turned on my stereo, it began to play something by some up and coming Mcrockband from some Mctown somewhere, I decided to keep listening and turned to crawl in to my bed, a very comfortable four-poster made by my uncle, but I could not, my bed had turned into a miniature cottage that resembled nothing so much as an overly large gingerbread house constructed of balsa wood and heart-shaped christmas decorations, complete with candycane filigree.</p><p>I did what any salvia influenced person would do, I opened the door. I was instantly transported to a world straight out of my childhood fantasies, which were nothing short of disturbing, even for an adult. A world of creatures too bizarre and detailed to describe and plants in all shades of red, purple and some color that doesn't even have a name. If fnords were animals it would be the color of their fur. the scene dropped away from my feet, giving me a view of the entire landscape. The sky was red and below me was the carnival, a sinister place that could have held amusement sometime in it's past. In one direction there was an evil looking ferris wheel, it's carriages swaying silently in the breeze, in another, a silent and frightening forest that must have once been vendors stalls. Running straight through the middle of the place was a sinister looking river, it's purple shimmering surface rippling with danger.</p><p>And then I was no longer myself in that dark and frightening place but a child of about twelve years old sitting on a tree branch, dangling his toes into a serene and comforting lake that stretched for as far as his eyes could see, a beautiful golden sky with splashes of blue filled with billowing white clouds overhead. Within a second of that last, heartwarming, scene it was over, I was in my bed and almost completely baseline. Though I still fell some after effects, similar to a mild cannabis high, I was completely exhausted and dropped off to sleep almost immediately.</p><p>In retrospect I would say that salvia is something that threw me high into the air and then pushed an enourmous goose down pillow underneath me to break the fall.</p>",
 "year": "2005",
 "id": "44575",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-19T07:00:00.000Z",
 "views": "3996",
 "dose": {}
}
