{
 "title": "Personality Alterations, Follow-up",
 "author": "Dr. Smooth",
 "citation": " Dr. Smooth. \"Personality Alterations, Follow-up: experience with DMAE, Tyrosine & Panax Ginseng (ID 44570)\". Erowid.org. May 1, 2007. erowid.org/exp/44570",
 "substance": "DMAE, Tyrosine & Panax Ginseng",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "DMAE",
  "",
  " ",
  "oral",
  "Tyrosine",
  "",
  " ",
  "oral",
  "Ginseng"
 ],
 "report": "<p>My DMAE usage continued unabated through the spring of 2003, at the start of the summer I found myself traveling abroad and saw the common sense not to attempt to bring jars of various ill-tasting powders with me, and reduced my intake of supplements to only Vitamin C and a strong B-complex.</p><p>Upon returning to America in the fall of 2003, I found much of my life structure destroyed (lost girlfriend, bestfriend, job, etc.) and ended up drinking more than anything else, bottoming out shortly before New Years 2004.  Regaining an interest in health and more positive ways to deal with my psychological distress, I did try DMAE again.  I have not found great results this time, and like my first experience, seem to have only headaches from larger doses.</p><p>However, I have been experimenting with various other 'nutraceuticals' and biological stimulants, and the certain interaction and potentiation makes my prognosis murky.  It certainly appears that _daily_ intake of the substance is required and that it does take quite some time for the effects to begin.  Finding instant results from other substances, I have not kept myself in a dutiful regimen in regards to DMAE, though I may try again.</p><p>Re-reading of everything that I had written at that time does reinforce the idea that my personality was fundamentally changed, becoming in essence a high-functioning manic, which is far from my natural tenor.  Unease at the radical change of who I was has also deterred me from restarting with DMAE, though I stand behind my earlier report that these changes were neither unpleasant nor unproductive.</p><p>DMAE seems to have as much psychological potency as prescription pharms and should be treated accordingly.  Occasional use as a stimulant is pleasant, if not terribly impressive, and a serious commitment to the drug will lead to serious results.</p><p>I will add some brief notes on two other chemicals I have found to be worthwhile.</p><p>Tyrosine -  a precursor to Dopamine in the brain's machinery, upon taking 1/4 teaspoon (level) I find an almost instant rise in alertness, a positive sensation somewhat like doing a very small amount of amphetamine, but much more smooth.  Certainly there is also pain relief potential as well as aggression.  I ended up ingesting this before every soccer practice and it gave me a psychological and physical edge I need (not a great baller!).  Also a rise in libido and reduction of appetite.  All in all a winner as it is also very inexpensive and seems to have no serious or unexpected side effects.</p><p>*Some tolerance develops, but given the innocuousness and cheapness of the amino acid, I really haven't been alarmed.</p><p>Panax Ginseng Extract -  Certainly _the_ wonderdrug for hangovers.  An uplifting yet mostly serene feeling, increase in libido and perhaps in semen production, longer endurance in exercise.  Tomes have been written about this substance, but I add my vote to this healthful, inexpensive and ancient substance.  I injest about 1/5 a teaspoon four or five mornings a week.</p><p>These plus B-complex, fish oils, exercise and healthful diet have lead me to a far more pleasant state that is still 'me'.</p>",
 "year": "2005",
 "id": "44570",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-01T07:00:00.000Z",
 "views": "29036",
 "dose": {}
}
