{
 "title": "Body Buzz, Mania, then Endless Thoughts",
 "author": "DeltaHeavy",
 "citation": " DeltaHeavy. \"Body Buzz, Mania, then Endless Thoughts: experience with H.B. Woodrose & Meclizine (Dramamine 2) (ID 44595)\". Erowid.org. Sep 16, 2008. erowid.org/exp/44595",
 "substance": "H.B. Woodrose & Meclizine (Dramamine 2)",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "6 seeds",
  "oral",
  "H.B. Woodrose",
  "(capsule)",
  "",
  "25 mg",
  "oral",
  "Pharms - Meclizine",
  "(pill / tablet)"
 ],
 "report": "<p>Preparation method: Weighed the six seeds and then crushed them in a Ziploc bag with a hammer and put the crushed contents into an empty 000 gelatin capsule and swallowed with one Meclizine HCl 25 mg tablet to (hopefully) prevent nausea. My good friend D will be joining me on our first psychedelic trip on this hot summer Saturday afternoon. We both have about the same body weight and dosage. Notes preceded with D are written by my friend.</p><p>1:30 PM (T+ 0:00) We each swallow our capsule with water, having only eaten a small breakfast earlier in the day. I also remembered to take an Allegra for my seasonal allergies.</p><p>(T+ 0:30) I am starting to feel as if I drank one or two alcoholic drinks: I have a slight body buzz. D said he sees flashing lights in his peripheral vision which is somewhat annoying. The patterned ceiling looked pretty cool to him. He is having visual effects while I am not.</p><p>2:30 (T+ 1:00) I definitely have a +1 (PiKHAL) effect now. The biggest effect is a pleasant body buzz. I pinched myself and I feel the pain but have little reaction to it. Colors seem to be more noticeable. They are not particularly more colorful; its just that I am noticing them more now. At this point, I have no nausea but my stomach feels a bit bloated, like I need to burp but cannot. If I swallow air and then burp the feeling gets better but it is still there. My friend also says he feels nauseous but cannot throw up. The nausea is overpowering. He is sitting near the toilet with the lights off and smiled when I walked in to see if he was okay.</p><p>3:00 PM (T+ 1:30) We decided to walk to the pharmacy to look for some ipecac syrup to help D so he can throw up. When we got there he felt better, not sure if it was exercise, heat, or time that reduced his nausea, but we still ask for some just in case. They dont have any. We get some ice cream and head home. Physical movement requires more mental effort than normal. He later said the nausea was still present, but other effects became more noticeable and he was able to ignore the nausea.</p><p>4:17 PM (T+ 2:47) Back home now. I really feel like listening to that song with the lyrics Strange, strange world on my Satoshie Tomiie CD2 Track 9, so I put it on. This feels like being drunk and silly. I am slow at typing. Everything with movement of the body takes a lot of effort, including typing.</p><p>4:30 PM (T+ 3:00) I looked in the mirror and pupils are dilated like when one takes MDMA. Natural light seems harsh. I closed the blinds and turned on some soft lights.</p><p>4:38 PM (T+ 3:08) I seem to get stuck in whatever mental state I want to be in. If I say Im tired, I feel tired. If I want energy, I can get up and dance to the music and enjoy that too. I am very impatient and my attention span is very short!</p><p>D - 4:40PM (T+ 3:10) We need preparation!!! But we cant prepare because we dont know what we want till we want it! And once we want it we need it or we wont want it.</p><p>D - 4:50PM (T+ 3:20) I want to write but I dont want to because as soon as I start doing one thing I know I am missing out on what else I could be doing. Its too hard to commit to one activity knowing that if I start to do that. I will be missing the opportunity to do what else there is and the experience will be over before I get everything out of my head that I wanted to. This paragraph was recorded in less than a minute though I could swear it took an eternity. Es note  Time distortion is variable. Sometimes time goes by slowly and sometime time goes by quickly.</p><p>D - 4:53PM (T+ 3:23) The clock must have feelings and know when we want to savor this moment so it will slow for us, when the experience changes to, not unpleasant, but not the same euphoria time will pass much more quickly to get you to the next happy place.</p><p>4:56PM (T+ 3:26) Totally a good thing, +2 (PiKHAL)</p><p>D  4:57PM (T+ 3:27) I lost my thought. My mind is like a switch, whatever I want to do or enjoy, I just have to decide thats what I want to do and turn on the switch.</p><p>5:04PM (T+ 3:34) Time in my mind is long. Real time is short. Thoughts were going through my head at a rapid pace.</p><p>D  5:14PM (T+ 3:44) It's not that thought is lost, it's that I cant express what I want before it's gone, it's all up there I just need more than 1 trip through time to experience every part of what I want. E thinks I want a +3 instead of a +2 which weve decided this to be. So I cant decide and the trip just takes me to that place I want to be, or if it decides to take me to another path I will have to be along for the ride</p><p>5:30 PM (T+ 4:00) At this point, neither of us could decide what we wanted to do. We end up lying in the living room silently thinking, eyes closed. Thoughts came and went, sometimes enjoyable, other times, slightly uncomfortable. The music was enjoyable. I had a hard time getting comfortable and I remember feeling hungry but not wanting to eat. My nose was also stuffy. I didnt want to move around. I did not sleep for some hours. I stopped keeping track of time. I remember wanting to be back at baseline so I can make more sense of all these thoughts, most of which are later forgotten. Slowly the effects became less intense and I end up falling into a dreamlike state or sleeping.</p><p>9:30 (T+ 8:00) I woke up for a bit. Im back to a +1. I get up to eat a granola bar and drink some water because I was hungry and thirsty but did not feel like preparing any food. It is mostly tasteless but I can feel the texture. My mouth is very dry, possibly dehydration? I drink some water.</p><p>11:00 (T+ 9:30) Near baseline with some lingering after effects. D has gone home; his shoes and car are gone and the door locked. This experience has been interesting but not entirely what I expected or hoped for. We both sat in our own worlds thinking about stuff. I am hungry. Food tastes normal now and I feel restless.</p><p>I know I didnt come up with anything profound and I don't remember most of the thoughts I had. I woke up the next day feeling rested and completely normal. I'm not sure if I will repeat the HBW experience but it was an interesting introduction to the psychedelic world.</p>",
 "year": "2005",
 "id": "44595",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-16T07:00:00.000Z",
 "views": "4113",
 "dose": {}
}
