{
 "title": "Scared but Pleased",
 "author": "Sir BloodThrone",
 "citation": " Sir BloodThrone. \"Scared but Pleased: experience with Datura (ID 4462)\". Erowid.org. Jan 8, 2001. erowid.org/exp/4462",
 "substance": "Datura",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tsp",
   "oral",
   "Datura",
   "(seeds)",
   " T+ 6:30",
   "1 tsp",
   "oral",
   "Datura",
   "(seeds)"
  ]
 ],
 "report": "<p>I am an 18 year old Greek guy who got interested in psychedelics after a period of solving my personal problems. I knew of erowid a long time ago so i thought i should consult it before using any substance. I looked and looked through the files and i found something easy to obtain but that would give me an unforgetable experience.</p><p>So in my mind were morning glory, Datura and salvia. I looked for all of them in shops but i was eager to try something at low cost so i took the first thing i found DATURA!.</p><p>I got hold of 100 grams of datura seeds (black to brownish) and i had the common sense not to use them all at once (im happy i didnt)!! I was at my home with my family and because they trust me i prepared everything almost in plain sight. At first i grinded up one teaspoon of datura seeds and boiled them in 1/2 cup of water. The liquid was yellowish and before consuming it i added some sugar. After this beverage i felt completely normal and i had another one but without blending the seeds. Nothing happened and i decided to go out with my girlfriend. Thessaloniki (the city i live in ) is crowded and i thought that if this seemingly harmless thing had any effect i could maximize them by interacting with people and the scenery. I went out and my girlfriend had the idea of going to the cinema. So we did. After 2 hours of consuming it i STILL felt sober but i noticed that something was different. Everything around me got an eerie dreamy aura and my mouth went completely dry...The movie seemed like a dream, out of focus and as if it was only in my head. I tried eating pop corn and i almost choked on them leaving my girlfriend wondering what has happened to me.</p><p>After 6 1/2 hours of consumption i was back at home but nothing radical has happened although i noticed i was missing something from the picture. So, foolish enough, i decided to chew another teaspoon and down it with some water. I went to sleep but i felt my body getting hot and i started seeing red flashes about 2 hours later. I got amazed because they werent in my head i could see them with closed eyes and they would repeat. The morning i woke up at 10 oclock and weird stuff started happening. i closed my eyes in a half sleepy state and i could swear i could see through my eyelids and i could observe the room. I felt it was so alive and i could see people around me but in different rooms since i convinced myself i could look through walls too. I waited for 2 hours to pass and i decided to get out of my bed since this stuff couldnt be that strong. When i entered the room my family was in they started looking weird at me because of my dilated pupils (actually you can be more accurate if you call them black holes, not pupils). I assured them i was 'Ok,sober and fully functional' and went to spend sometime with my pc...Well...This gave me the creeps...I was letterblind, i COULD NOT READ, everything was blury and really really scary! I tried experimenting with colors and i light up my lighter turned of all light in the room and move it at high speed in front of me...to my amazement it left traces of purple hue behind it. I know it wasnt my pupil dilation because XTC which gave me pupil dilation too had no such effects on me...I started thinking that i have just caused myself permanent damage but i waited for 6 additional hours trying to sleep in my home just to see if i needed any medical help. Eventually it started clearing up so i decided i should give it time....</p><p>My advice to anyone who reads it is that datura is not a game, it is a tool and if you are advised to 'paly' with it or 'fool around' with it should consider it better....Ever heard of anyone fooling around with a knife or a handgun? Its almost the same...It CAN kill you!</p>",
 "year": "1999",
 "id": "4462",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-01-08T08:00:00.000Z",
 "views": "17527",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tsp",
   "administration": "oral",
   "substance": "Datura",
   "form": "(seeds)"
  }
 ]
}
