{
 "title": "Beautifully Profound",
 "author": "Trippin' Proletariat",
 "citation": " Trippin' Proletariat. \"Beautifully Profound: experience with Morning Glory (ID 44635)\". Erowid.org. Nov 1, 2007. erowid.org/exp/44635",
 "substance": "Morning Glory",
 "bodyweight": "135 lb",
 "report": "<p>I had just gotten off working the night shift Sunday morning and I was feeling mellow, as I always do in the mornings after working all night. I took the bus to a used record store and bought Yes' Close to the Edge, a CD I had been waiting for on order for a long time. On the way home, I stopped in at N's house, being as he had a coffee grinder and a digital scale. I was ready to try the morning glory seeds I had bought on Thursday, oh boy was I ready.</p><p>I weighed the seeds out to be 6.9 grams, and realized I only had enough for myself. I ground the seeds in the coffee grinder as I had heard this helps the potency of the seeds come out, but some of the powder spewed out the sides and was lost forever.  I then mixed the seeds (still not completely ground, I stopped in fear of losing any more powder) in with a bottle of water, and drank it all down. To my amazement, the tasted exactly like P. Cubensis. This must have been around 2 o clock.</p><p>After an hour, I felt a physical buzz, and noticed a few tracers and such, but no real physical effects. I smoked a few cigarettes, and smoked a roach out of my friends bong. I left for home around 7, feeling a strong buzz, my thinking upside down.  The real effects werent noticed until I got home, away from my friends. I noticed profound changes in my thinking, not on generalities, but on deep issues that I had been considering for a long time. It seemed that my mind instantaneously drew conclusions on issues that I had been mulling over for years, and probably wouldnt have come to my own conclusions for more years to come.</p><p>I played guitar for an hour or two and found this extremely enjoyable. I found myself improvising with theory I had never learned, doing everything right. My eyes were closed and I had a strong visualization of the fret-board, and I was moving about in the seemingly uncontrolled manner of Hendrix. So this is what the psychedelic rockers of the late sixties felt like, I thought to myself. This took on new meaning, as I remembered that Jimi Hendrix had never learned any guitar theory himself. After working up a very decent sweat, I decided to call it quits.</p><p>I went outside and looked at the stars, noticing that I could focus in very closely on satellites and airplanes and such. Upon looking at my fence, I noticed that the wooden boards went angled, and then straight again. I did some more deeply profound personal thinking and made all sorts of conclusions that I knew would alter my everyday thinking for the rest of my life. Burning out from the weed (I hate weed), I finally decided to go to bed. It was 12:30 am and I had been up for 24 hours, finally realizing that the next week would be completely shitty because I stayed up so long after working a night shift. While washing my face, I looked in the mirror to find my face shifting proportions constantly, almost like Johnny Depps face on the cover of fear and loathing in Las Vegas. My pupils were the size of dinner plates, my face red as mars.</p><p>It is now Tuesday, two days later, and I feel like shit. Since my experience, my thinking has been very different, I have been constantly thirsty and had to piss once or twice a day no matter how many glasses of water I drink, all I feel like doing is sleeping and I cant get any physical labor done. A lot of these effects are probably from missing a lot of sleep; a lot of them are probably from the un-ground seeds still letting out LSA in my intestines. I will probably feel better in a few days.</p><p>To sum up my experience, I would say that I felt a strong warm feeling in all my muscles, especially my abdomen, which I think would account for the nausea that other people seem to feel that I didnt. There were some spatial distortion effects, no colors or blurriness or anything, and I could focus very, very clearly with my eyes and ears, all my nerves really. I mainly ignored all of the visual parts, because I became caught up in the psychedelic insight, something I found... godly. I felt like the nietzchean super-man, I found this mental pleasure better than any euphoria or experience I had ever felt. It was wonderful, but in the future I would either extract the LSA or just buy acid to counteract all the negative effects. A wonderful, wonderful experience, I have never had so much fun in all my life. The perfect drug for me.</p>",
 "year": "2005",
 "id": "44635",
 "gender": "Male",
 "timestamp": "2007-11-01T07:00:00.000Z",
 "views": "12178",
 "dose": [
  {
   "time": "0",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(ground / crushed)"
  }
 ]
}
