{
 "id": 4469,
 "title": "The Giver",
 "date": {
  "submission": "2006-05-26T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mr. Nothing",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "oral",
   "substance": "Zaleplon",
   "form": "gel tab"
  }
 ],
 "report": [
  "I have long known that Ambien and Sonata have some interesting side effects; maybe from the first time I used it as per doctors instructions and found myself experiencing minor hallucinations. ",
  "Anyway, here is the lowdown on this particular time. ",
  "1.  around 11 pm I go out drinking.  Over the time from 11 to 2 a.m. I drink a total of three and a half Stella Artois beers--a wee bit stronger than the typical bud light crap. ",
  "2.  Around 2 am, feeling kind of tired, I go to my girlfriend's house.  I eat a bag of chips along the way.",
  "3.  I arrive back in my own apartment at about 4 am.  I immedietly take two pills.  I open each gel cap and shake the powder into my mouth, and then place the gel cap in my mouth as well (so I don't miss any of the powder). ",
  "The effects creep up in a subtle way about fifteen minutes after ingestion.  I prefer to be doing something mildly productive, such as drawing or reading to await the effects.",
  "Effects:",
  "mild euphoria --> moderate euphoria coupled with feelings of dissasociation.  minor hallucinations, such as the bathroom towel waving in the air.  Mental thoughts went crazy.  significant loss of inhibition.  I was thinking in a slowed down way about these crazy ideas to submit the drawing I was working on to a gallery. I went more and more into my fantasy and imagined myself having an entire show in some gallery, and even more crazy ideas.  Everything has a extremly lucid feeling.  Very dreamish.  Dream-like.",
  "Two hours later and everything is fine.  back to normal.  six am I get up, drink a glass of water, and go to sleep.  I have wierd dreams--dreams that feel suspiciously like I was taking sonata when dreaming.",
  "Other:",
  "Cannabis:  I've never tried smoking while under the effects of sonata, but I've smoked and then taken sonata before.  The cannabis seems to deny the effects of the sonata.",
  "This is not a terrably intense drug. The disassociative elements can be surprisingly strong."
 ],
 "erowid": {
  "id": "29207",
  "citation": " Mr. Nothing. \"The Giver: experience with Zaleplon (Sonata) (ID 29207)\". Erowid.org. May 26, 2006. erowid.org/exp/29207",
  "substance": "Zaleplon (Sonata)",
  "views": "18532"
 }
}
