{
 "title": "The Most Fun!",
 "author": "Dr.B.N.",
 "citation": " Dr.B.N.. \"The Most Fun!: experience with Mimosa hostilis & Syrian Rue (ID 44770)\". Erowid.org. Aug 26, 2005. erowid.org/exp/44770",
 "substance": "Mimosa hostilis & Syrian Rue",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 g",
   "oral",
   "Syrian Rue",
   "(ground / crushed)",
   " T+ 0:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 0:30",
   "5.0 g",
   "oral",
   "Mimosa tenuiflora",
   "(tea)"
  ]
 ],
 "report": "<p>The reason I feel it necessary to write this, is that many people characterize these experiences as 'not fun' and 'only useful for self exploration' and the like, and it just isn't true; I have had more fun on this drug then any others. My reason for wanting to try this drug in particular was that somebody had compared it to DPT, which I had many fine experiences with but thanks to last year's DEA raids was unable to get.  TDS's 'this week in god' did a report on the Santo Daime church, which was very funny and got me reading. I began doing my research as I do before taking any drug, safety first right people. The general consensus seemed to be, at least from my perspective, that it was a Salvia like drug*, uncontrollable and often unwanted in its intensity. Still I decided to go for it.</p><p>* For those of you who have not tried Salvia an extremely close approximation of it can be seen in Batman: Begins, as the fear toxin seems almost identical to Salvia.</p><p>Prep work:</p><p>I planned on tripping with my brother so two doses were prepared. First we ground up 6 grams of Syrian Rue in a coffee grinder and gel-capped them by hand.  Then we broke up 10 grams of purplish red Mimosa bark into a boiling pan of water (about 30 oz's) and reduced the heat to a simmer. After the water had taken on a dark purplish red color we removed the liquid and strained it in a coffee filter, put one cup of water in the pan with the bark and repeated, then combined the two mixtures and cooled them in the freezer. After they had cooled down a sediment had formed and we strained the mixture then boiled it down to about a cup of liquid and then cooled it again, and again sediment had formed which we strained out. The liquid now looked like a cross between tea and cranberry juice, the taste was a little Tannin and bitter but not as bad as people say, and no where near as bad as hard liquor.</p><p>The Experience:</p><p>(8pm) T-30min- We both take our Rue capsules and begin smoking weed to calm our stomachs.</p><p>T+0min- We chug the brew easily, very high from the Rue and pot, little stomach discomfort.</p><p>T+10min- Any stomach discomfort has passed and the first alerts begin, a sober friend who came to trip sit for us lights some candles, and starts making faces which kind of freaks me and my brother out. Every face he makes looks like a Dick Tracy villain and I forget that its not how he actually looks, after I explain that he stops.</p><p>T+30min- Trippin Balls, we have moved to my brother's room were he had set up an incense censor along with several tea candles on a tin foil sheet, the only light is coming from a lamp with a blue lightbulb, the candles look like their floating on a sea of Mercury and the Censor looks like an island Pagoda in the middle. My brother turns on 'Lucy in the Sky with Diamonds.' </p><p>T+33min- Our sitter, and us were talking for what seems like forever, when I ask how much time has passed he looks at me weird and says 'Lucy in the Sky with Diamonds is still on man.'</p><p>T+45min- I accidentally spill my soda, but I think its just the floor perspiring and so I don't respond, yeah that's where my mind was. My brother starts cleaning up and gets way too into it as the general vibe of cleaning seems too intense  at this point. I am still pretty sure it's just floor sweat, until our sitter corrects me, but tries to tell my brother that it's all cleaned up, but like myself, I think the brown of the floor is confusing him too so he refuses to stop, I find this intolerable and retreat to my room were I collapse on my couch.  </p><p>T+50-110min- As soon as I close my eyes I am in another world of vast vivid hallucinations, each image exuding euphoria, each image making me feel more and more amazing. Soon, the images began to form a cohesive story line. I began hearing a booming voice commanding things, which then came to be, I thought at first the voice was god or some other vastly powerful being, but then I realized the voice was my own. It commanded there to be 'life' and from the ground came life, and for that life to 'Stand up' at which point the animals began changing, taking on human form, and strange tribal music began playing. Then I heard 'build' and the landscape of the world turned reddish gold,  pyramids and cities sprouted from the forests and deserts. The music shifted from drums and chants to symphonies and operas. 'War' boomed through my mind in my own voice, and the animal men began killing each other forming into nations and empires. 'Clean' I heard and then the skies opened and the earth was torn, devils and Demons came from the cracks in the earth and Angels from the sky and they began killing, the Animal men formed behind the Demons and the Angels and killed each other to the man as the universe began to unmake itself.</p><p>Soon the entire world was one green prairie and the only sound that existed was some sort of beautiful song which sounded like nothing I have ever heard and no voice or instrument could make, as a feeling of perfect serenity enveloped me. The weirdest part of this whole thing was that I was experiencing it all at the same time, there was no beginning middle or end, just the total experience like some Meta Visual omniexperience, very cool. My body was numb and the few times I opened my eyes I could barely believe that the flesh was mine (I thought of it as nothing more then meat), and I thought of it as a 'it,' it needs to swallow, it needs to close its eyes, it will need to go to the bathroom, my ego had gone on vacation and I was loving it, all that was important was the experience.</p><p>T+110-200min- I manage to get up and go back to my brothers room, were he had turned on the daily show whose graphics and set up looked very trippy and Jon Stewart's hair kept on forming into an Afro and then receding into baldness. After that we switched to the Aqua Teen Hunger force with the Mooninites who seemed very three dimensional, so much so that I believed them when they said they had five thousand dimensions and that Frylockes inability to see them was truly a personal issue.</p><p>T+200-250min- the effects taper off till I am left with a slight buzzing euphoria, a general sense of everything everywhere being awesome, and feeling of being unusually wise, though I was also exhausted and had to go to sleep.</p><p>Next morning- I felt a little out of it but good and a lot of the feeling of optimism and wisdom from the night before stuck with me for a couple days.</p><p>Conclusion:</p><p>Ayahuasca is amazing, since this experience I have tried it 3 more times each with higher dosages and all the trips have been amazing and varied. Aside from its relatively short duration it's the perfect psychedelic. Smarter then acid and more emotionally real then Shrooms, the experience is a lot more of a personal exploration.</p>",
 "year": "2005",
 "id": "44770",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-08-26T07:00:00.000Z",
 "views": "8779",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(ground / crushed)"
  }
 ]
}
