{
 "id": 448,
 "title": "Learning to Enjoy",
 "date": {
  "submission": "2007-02-24T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cityhunter",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "90",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Codeine",
   "form": "extract"
  },
  {
   "time": "0",
   "amount": {
    "number": "50",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "substance": "St. John's Wort"
  },
  {
   "time": "0",
   "amount": {
    "number": "10",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Kava",
   "form": "tea"
  }
 ],
 "report": [
  "Codeine 90 mg, diphenhydramin 50 mg, st. Johns wort and kava kava (10 gm tea)",
  "For the past 6 months I have been experimenting with codeine at rather low doses.  I am getting quite good at extracting it from tablets containing 10 mg codeine and 500 mg parasetamol (or acidaminophen as you call it), I think Im getting about 80-90% extracted and I have had to practice quite alot.  I was in Greenland a few months ago and there you can buy painkillers with codeine without any trouble, as much as you like and very cheap.  I never take acidaminophen if I have a headache, its to poisonus for my taste.",
  "At first I didnt feel much from the codeine taking 100-200 mg.  I thought the extraction was not working.  Now I think codeine is one of those drugs you have to know to enjoy, like Kava Kava.  So be patient.  I think I had to take it 20 or 30 times before I learned to enjoy it and even recognize it.",
  "Last weekend I took about 90 mg of codeine and one tablet of diphenhydramine,  I also drank some St. Johns Wort and Kava Kava tea.  Diphenhydramine is a very potent drug and should not be taken in high doses but it has the power to potentiate opiads if taken in moderation.  After about an hour I felt very sedatet, confortably numb you could say.  I just sat in my living room and watched tv, the movie was Dracula 2001.  I dont really remember the film, it might be the effect of the diphenhydramine, but I felt very nice.  My mouth was rather dry (probably the diphenhydranine) and when I looked in the mirror I had pinpoint pupils, I looked quite stoned.  I took my bloodpressure and it was in the normal but quite alot lower than usual, my bloodpressure goes down when I take Kava Kava.",
  "The next morning I woke up and felt quite good but rather lazy.  A few weeks ago I had taken about 150 mg of codeine and then there was a blackout, I saw almost nothing because of my pinpoint pupils.  I think codeine is nice but quite abusable.  I plan to use it only once a week."
 ],
 "erowid": {
  "id": "10834",
  "citation": " Cityhunter. \"Learning to Enjoy: experience with Codeine, Kava, Diphenhydramine & St. Johns Wort (ID 10834)\". Erowid.org. Feb 24, 2007. erowid.org/exp/10834",
  "substance": "Codeine, Kava, Diphenhydramine & St. Johns Wort",
  "views": "10164"
 }
}
