{
 "title": "Hooked",
 "author": "User",
 "citation": " User. \"Hooked: experience with Sceletium Tortuosum (Kanna) (ID 44830)\". Erowid.org. Jun 24, 2007. erowid.org/exp/44830",
 "substance": "Sceletium Tortuosum (Kanna)",
 "bodyweight": "65 kg",
 "header": [
  "DOSE:",
  " repeated",
  "",
  "Sceletium tortuosum",
  "(plant material)"
 ],
 "report": "<p>I heard about Sceletium Tortuosum on the internet. I first bought 1 gram. It was the traditional brown preparation. I separated the finest powder to insufflate it, and I smodked the rest. I found out that it was effective as a mood shifter by itself or smoked in a damiana cigarette, and as a Cannabis booster. So I ordered 20 more grams.</p><p>Again I separated the finest power with a towe in order to sniff it(the more pleasurable way). The effects are quicker and different this way. I smoked the rest with damiana or pot, and sometimes chewed some, most of the time with a nicotine gum. The mix with damiana, coffee or nicotine is nice and energetic. Very quickly, I used it everyday, or nearly, sometimes  many times a day. The Sceletium 'high' makes me often want more. It's one of its side effects.</p><p>After some weeks of regular use (5 days/ week - several times /day), tolerance has built up. After having used 15 grams (3 months +/-), I bought another 25, which was light green and bitter. It wasnt the traditionnal fermented preparation, but the modern heaten one. Again, I separated the finest part for sniffing.</p><p>But something was wrong. I didn't have any positive effects. It wasnt the new preparation, cause it was the same with what was left of my older supply. Everyday, I felt the urge to take some. Something like the need of a cigarette for a tobacco addict. I took repeated doses with no postive effects, but with some depression and a massive instant tiredness.</p><p>4 months after my first use I realized that I was taking too much and that it had no positive effects anymore. But It was hard not to take some everyday. I left my home for 8 days, and I avoided to take some Sceletium with me. Though I had some need for it during these 8 days, it was not a problem. When I came back, I resisted 3 days more. The need was lighter at this time.</p><p>Now, I take reduced amounts with  at least 48 hours between 2 hits, more often 3 or 4 days. Everything is fine. The positive mood shift and pot amplification are back. The 'take more effect' during the high is manageable and the need to take some everyday almost disappeared.</p><p>I'm a former heavy tobacco smoker, and the need for Sceletium was very similar to the need of smoking, except that it happened only once a day, and for 5 or 10 minutes, when the need for smoking was at least 30 times a day, but lasted only 2 or 3 minutes.</p><p>So, my conclusion is :</p><p>The abuse potential of Sceletium Tortuosum is real.</p><p>The 'need for more' is a part of the high.</p><p>Tolerance builds up quickly when I use it often.</p><p>Abuse leads to tiredness and depression.</p><p>Increased dosage doesn't give more positive effects, but quickens tolerance and lead to depression.</p><p>The stimulating effect is stronger with low doses.</p><p>I was really hooked, with a need which seemed hard to resist. But fighting the habit is not so hard. Certainly easier than to fight tobacco addiction.</p><p>The secret for keeping Sceletium harmless and pleasurable is to use it at low doses and occasionally. It is not because it is legal and not a strong psychoactive that it doesnt affect you.</p><p>Now I'm rather happy with it, and the 10 or 15 grams I still possess will last a long time!</p>",
 "year": "2005",
 "id": "44830",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-24T07:00:00.000Z",
 "views": "22249",
 "dose": {}
}
