{
 "title": "Adventures in Mushroom Wonderland",
 "author": "Adam Walker",
 "citation": " Adam Walker. \"Adventures in Mushroom Wonderland: experience with Mushrooms (P. cubensis) (ID 4484)\". Erowid.org. Dec 27, 2001. erowid.org/exp/4484",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "78 kg",
 "header": [
  "DOSE:",
  "10 ",
  "oral",
  "Mushrooms",
  "(tea)"
 ],
 "report": "<p>I had consumed an infusion which I had made with Stropharia Cubensis, otherwise known as the 'gold top' magic mushroom. Ten of these mushrooms I had boiled up in two cups of water that afternoon on the kitchen stove. The stench the mushrooms produced was rancid. I remember my sister and our housemate inquiring what the terrible smell was, and I making up some excuse. I recall claiming that it was burning rubber that was making the smell. After I had consumed the mushrooms I sat down with my book and began to read whilst I waited for the mushrooms to take effect.</p><p>Now that I was aware that they were, I put the book aside and took up my drawing pad and pencil. Closing my eyes I waited to see if any images would come to me. Purples, pinks and greens. The colours came together making patterns, swirling, circular, spirally patterns. It was as if I were peeping through a kaleidoscope, or standing at the edge of some gigantic twisting wormhole. What I was seeing looked like something from a video game or science fiction movie. There I stood on the border of reality, staring in the face of that bizarre and wonderful other. Was I ready to take that leap into hyperspace? I cannot say. But, as it turned out, I had no choice in the matter; the effects of the mushrooms were now coming on strong and fast. Millions of pink mushrooms protruded from the mossy surface of the tunnels. Always shifting, ever changing, growing and taking on new forms and every now and then reversing directions and shrinking. I made a few poor attempts to put what I saw on paper, but this I soon realised was useless. I decided to put my things away and just sit back and enjoy the trip.</p><p>* * *</p><p>I had picked the mushrooms about a week before. Two friends and I had organised for a girl we knew who was a local to the area the mushrooms were supposedly growing in to be our guide. She, being a good friend of the local drug dealer, knew where all the places the mushrooms had been reported being seen. Her task was to show us where these places were and to point out which mushrooms were in actual fact the 'gold tops.' \t We awoke the morning of the hunt eager to get going and find as many mushrooms as we could. It took us about an hour's drive to get to our destination. An hours car ride full of three young male's excitement and anticipation. We were going to find the mushrooms, thousands of them. We were going to bring them home, cultivate them, sell them, eat them and have enlightening experiences. We all had different reasons for looking for the mushrooms; each of us had our own private plans for them. My reasons for the mushroom hunt were more for spiritual purposes. I was seeking the flesh of the gods and longed to taste that fruit and acquire a glimpse of their forbidden knowledge. Temptation was my incentive. I was planning on cultivating them for my own personal use. I was to bring them home, grow them in the back shed and use them when I needed a bit of instant enlightenment. I had never actually tried them before but had only read about their effects in books by Timothy Leary, Gordon Wasson, Terence McKenna Jim DeKorne and other writers of the psychedelic sixties. I was eager to learn from the experiences that the mushrooms had to offer.</p><p>We returned that evening disappointed, our supply consisting of about thirty mushrooms and not the thousands we were anticipating. Nearly all were obtained from the round about in the middle of the main street, directly in front of the police station. The looks we received from the passing motorists were hilarious as the three of us were crouched over the small group of mushrooms in broad daylight frantically picking them and throwing them into our paper bag. We were eager to get out of there before anyone realized what we were up to, especially the cops.</p><p>* * *</p><p>The storm had broken outside and was whirling around the house like something from the wizard of OZ. More than once a clap of thunder or a flash of lightning snatched me from an altered state of consciousness and placed me once again in the world of reality although only for a brief moment before my mind would wander off once more.  At some point through the night the rain got so heavy I could hear it flowing beneath the house. The trickling sound of water connected with my mind and it began to dissolve. My mind, my thoughts and my ego were disappearing. I had no control over them, they were flowing away with the water. Like the ebb and flow of the tides, images from hyperspace washed over me. A thought or a feeling would rise up inside me and then once again flow away, bringing me back again to reality. A flash of lightning and I was back in my room lying on my bed.</p><p>It was here that the most bizarre event of the night happened. I could see ants everywhere, they were coming out of the wood-work, out from beneath the sheets and pillows, they were crawling all over me. I knew they were not real but were only a hallucination. I did not fear them but was more curious as to what they were doing. It wasn't for some time that I realised what was happening, they were dismantling me. The ants came and one by one they took away each of my cells, carrying them back to where they had came from. When they returned putting me together once again, there was something different, something magical happening, each cell was faintly glowing an amber colour. Although this was a wonderful feeling, to be glowing all over, there was one thing still of concern, the ants had re-assembled me but they had forgotten something, my mind. I had a strong feeling they were waiting for another time to replace that, it was as if they were waiting until I was ready. That moment never came that night and I soon forgot about the ants and my missing mind as another flash of lightening jolted my train of thought on to another path. This random and disconnected train of thought continued throughout the night as I continuously slipped in and out of an altered state of consciousness. Eventually I drifted off into a dreamless sleep from which I awoke fresh and back to normal.</p><p>And, just like Alice, as my own adventures in wonderland came to an end, and reality returned. The world in which I had been part of for the preceding night faded and turned into nothing more than a pack of cards come tumbling down around me. I was left with only a memory of that long enduring night and the feeling that in some way I had been reborn, although still missing my mind.</p>",
 "year": "2001",
 "id": "4484",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-27T08:00:00.000Z",
 "views": "7816",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 ",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  }
 }
}
