{
 "id": 4484,
 "title": "Her Soul Lingers On",
 "date": {
  "submission": "2003-12-16T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mandrake",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Datura",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ],
 "report": [
  "She captured me.",
  "Sucked me in.",
  "Drove my mind crazy.",
  "And I loved her grasp.",
  "So I see people all the time now who don't exist. Big deal. I wake up in the night and think that people are in my room, I talk to them, then they disappear and I wonder why they ran away. Sometimes I get a spot of color stuck in a certain place in my vision for days. My mind is alright though, I am as smart as I ever was, but this feeling lingers.",
  "I grew her from the gound up. I went to the store, bought the seeds and put her in the soil. Datura, a lovely little friend of mine, sprang from the ground and it was good. I would eat her leaves at night, two or three at a time, at first i would make tea, then i just ate them right off the plant, I loved the disorientation, the people who didn't exist, not knowing what the fuck was going on. After going crazy about 20 times on the tea, I was able to handle myself well under full datura disorentation, I knew how to handle walking, i knew who was real and who wasn't. At one point though I was taking a stronger dose then I usualy did, and i was talking to this man (he wasn't real, I just knew it) and i had figured out that I could stick my hands though anyone who wasn't real, and this man put down the pipe that he was smoking on my bed stand and said to me 'so you know that i am not real?' and i turned to him and nodded, then he reached over and stuck his hand right through me. this completly destroyed all sense i had of reality at that point and i spent the next two days sure of that fact that i was the only not real person out there.",
  "during these experiences i would look out my window at night and see different landscapes completly believeing that they were real, at one point i went outside and walked right into my kitchen and started to cook myself up some pancakes, only to find my self naked in my front yard. I would see the same things alot, when I looked at my ceiling at night i would see these glowing worms all over the place. after a while I got bored of the plain old datura, and i started adding morning glories to the teas that i made. I would put around 100 seed pods   in the tea, and this made the experience more visual, the people i saw became less of shadows and started to have whole lives which i would witness whenever i visited their world. They became more playfull and talked to me more and more. My  trips would start with me hearing voices and then they would develop into extremely complex visions and worlds growing in my room developing into ever more interesting stories.",
  "I wish I could gain these visions without the horrible dry mouth though.",
  "One day while on datara I saw some Amanitas. Bright red ones with white spots, or so I thought. I picked a whole patch of them and put them in my pockets. I eat 3 big ones and prepared myself for the complete mindfuck that comes with eating soma. But the only thing I got out of it was horrible feeling in my stomach. I heard a voice in my ear whispering something. I could not understand it at first then it came to me. 'Throw Up!' it started shouting. it was this horrible womanly voice. 'Death....' So I did. I puked my brains out and felt much better afterwards. Later when i was back in reality I stuck my hand in my pocket and pulled out what was clearly a death cap. I dont know why I am not dead. I think my mind must have had some intuition as to the fact that they were not soma, and so it was my body's attempt to stay alive. But I have this wierd feeling that datura was with me that day, and saved my life.",
  "crap thats a load of shit. I believe in science.... I think.",
  "Oh yes and Don't do datura unless you truly like losing your mind. having no more grasp on reality. or if you hate not being able to read for a while afterwards but dont worry it always goes away. sometimes the people dont though..."
 ],
 "erowid": {
  "id": "29256",
  "citation": " Mandrake. \"Her Soul Lingers On: experience with Datura & Morning Glory (ID 29256)\". Erowid.org. Dec 16, 2003. erowid.org/exp/29256",
  "substance": "Datura & Morning Glory",
  "views": "22690"
 }
}
