{
 "id": 4487,
 "title": "Entheogenic Madness",
 "date": {
  "submission": "2004-07-11T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Solomon",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "4-HO-DiPT"
  }
 ],
 "report": [
  "How can I possibly describe the complete shift of reality I experienced with a rather large dose of 4-Hydroxy-N,N-Diisopropyltryptamine...",
  "The drug came to my apartment on one Saturday night in the month of December.  A friend who I place a lot of trust in brought a small, marked vial of the soft white powder for our researching purposes.",
  "He and I are no strangers to tryptamines, and hallucinogens in general, so we tend to make our doses a little generous.  Ya know, we ",
  "kinda like to push it to the limit to see what the drug is really capable of. ",
  "As I umped out a mound of the powder my friend, Farris, prepared a small porcelain plate and produced a tooter and card from his pocket.",
  "I have a pretty good eye for weighing out powder doses and I estimate that the amount that I chose to split with Rabz to be near 100 mgs.  I formed the mound into a perfect square and split it in half with a credit card... Farris emptied out two St John's Wort capsules.  I wasn't prepared to endure the taste of the awfully disgusting flavor of the chemical.  After ingesting the cap I drank a full glass of water and waited for the hallucinogenic magic to",
  "present itself.",
  "Within the first ten minutes I felt my first alert.  A very strong sensation of powerful energy rushed through my entire body.  I felt somewhat uneasy and slightly nauseated.  However, the nausea grew and grew until evolving into a state of complete stomach discomfort.  I really felt as if I was about to throw up for a brief moment and in the next I felt completely fine.  Shortly after the visuals started to take effect.  I would compare the initial scenery to be reminiscient to a slight psilocybe cubensis trip.  A field effect of more vividity in color, short trails, developing patters, but nothing to intense yet.",
  "Very slight and subtle.  Yet I could feel the drug still making it's way through my central nervous system in a very powerful way.  So I knew that there was more yet to come.  Over the next 30-45 minutes the drug progressed into it's early stage of full bloom with the visuals getting more intense and the body buzz starting to really kick my ass.  My body felt quite heavy and walking was a somewhat difficult task.  Staggering through the house I made my way back to the bedroom so I could put on some music and lay down. ",
  "Now I would have to say that what happened next was an experience that I have never had on hallucinogenic drugs on any kind.  I have tasted LSD, various strains of mushrooms, MDMA, AMT, 5MeO AMT, 2CT7, 5MeO DiPT, 4HO DET, Mescaline, Ketamine, DPT, 5MeO DMT, Salvia Divonorum, and some dried peyote which I smoked.  It's blatantly obvious that I'm not experienced in the world of hallucinogens of all kinds.  As I mentioned earlier the open eye visuals that I experienced earlier were very subtle and mild.  When I closed my eyes, however, I entered a completely different dimension.  Colors weren't 2 dimensional like I normally experience with the use of acid or mushrooms.  They had much more depth and changed more rapidly.  A lot of blues and greys which would slowly morph into new shapes which were completely three dimensional.",
  "As the visual wonderworld progressed the colors and shapes started to form.  I witnessed alien life forms creating tablets with which many different languages were imprinted on.  English is my only spoken language, but for some reason I could understand what the tablets were speaking of.  I felt as if I was in total connection with a higher power.  As if something was trying to reveal the workings of the world we know, and the world with which we do not know.  It was almost like that moment you have while on nitrous oxide where you feel that figured it all out. ",
  "Many parts of the trip are very foggy to me.  I remember opening my eyes at one point and having many more open eye visuals than I did intially.  The trails or tracers were much longer and stuck around for a longer period of time.  It's hard to make a comparison to another drug but they were more like acid at this time than they were initially.  All I can really say is that I felt like I had a deeply spiritual experience on this drug.  Nothing has really gripped me by the balls like this substance other than maybe DPT or DMT, but my thoughts on this drug were more clear and stable.  DPT completely shifts my mentality and interpretation of reality which is almost shocking or scary at times, while DMT renders you unconscious. ",
  "If you have some experience using hallucinogens and you are interested in a deeply entheogenic trip I highly recommend this drug to take you there.  I would not recommend this drug for first time users."
 ],
 "erowid": {
  "id": "29266",
  "citation": " Solomon. \"Entheogenic Madness: experience with 4-Ho-DiPT (ID 29266)\". Erowid.org. Jul 11, 2004. erowid.org/exp/29266",
  "substance": "4-Ho-DiPT",
  "views": "13462"
 }
}
