{
 "id": 4488,
 "title": "April Fools Day",
 "date": {
  "submission": "2007-07-25T07:00:00.000Z",
  "experience": "1997-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Peth",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  },
  {
   "time": "0:20",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I was browsing through the caffeine vault and noticed the estimated fatal dose in humans is one to four grams, depending on body weight and tolerance. More than half a decade ago in high school, I had a terrible overdose experience, among the most unpleasant of my life.",
  "At the time, I was an inexperienced novice drug user. As a child, I could drink a 12-pack of cola and not feel any stimulant effects whatsoever. I began taking Vivarin in moderate doses (three or four pills) at school to initiate a pseudo-mania state of mind or to mimic the effects of crystal meth (so I thought). On April Fools Day, I was bored and took four Vivarin during a lunch period on an empty stomach. Having taken the same number of pills the previous week with no side effects, I was confident that exceeding this dose slightly would have no consequences. Approximately twenty minutes later, I popped four more.",
  "When lunch period ended, I headed for class with a mild stomachache. I wasnt aware what I had gotten myself into and assumed it would take care of itself. Within ten minutes, I knew something was seriously wrong when the nausea grew worse. Some of my classmates began to show concern as I no longer could contain myself to act like a civilized student and displayed symptoms of physical discomfort. My body was burning, sweating, and shaking uncontrollably and the room became a dizzy spin.",
  "Luckily, we werent doing much in class, and I asked my teacher if I could call my mother because I felt sick. He granted permission and gave me advice not to trust cafeteria food. As I waited outside for my ride, I spewed out yellow vomit. When my mom arrived, I still had the urge to throw up. I lied to her about my illness and blamed it on the cafeteria food. Having no significant prior history of drug abuse, she believed me. Once or twice (I dont remember exactly) she pulled over to let me puke.",
  "My sickness grew even worse when I came home. I cancelled my drum lessons and went straight to bed with a bucket near me. You can imagine the amount of sleep I got was next to none. My parents were convinced it was food poisoning, but I knew the truth. I called my girlfriend at the time for comfort since I felt she would understand being fairly knowledgeable about drugs. When I informed her what was going on, she initially thought it was an April Fools joke since it was April 1st. It didnt take her long to figure I was in a state of delirium and sheer agony. Boy, I sure wish I were joking.",
  "I puked and dry-heaved many times over, more than I ever have that night. Uncontrollably shaking, I mumbled and pleaded for the misery to go away, but it didnt for at least twelve hours. It was a slice of purgatory torment. I dont think I came close to dying, but I definitely came to the realization how simple caffeine, if not taken as directed, can make you really sick.",
  "Since that crazy night on April Fools Day, more than six years later, I still have a strong sensitivity to caffeine. Now I easily feel the psychoactive stimulant effects from only drinking one cola, but I suppose this is normal. I believe while drugs generally cause a person to develop a tolerance, substances also have the potential to induce a reverse tolerance if taken in extreme."
 ],
 "erowid": {
  "id": "29269",
  "citation": " Peth. \"April Fools Day: experience with Caffeine (ID 29269)\". Erowid.org. Jul 25, 2007. erowid.org/exp/29269",
  "substance": "Caffeine",
  "views": "9606"
 }
}
