{
 "id": 4493,
 "title": "Weird hallucination",
 "date": {
  "submission": "2001-11-28T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "BuBu",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Me and my friend B were pretty steady pot smokers until B had to go on vacation and he had to stop use for 2 weeks. I had still been using but not as often.",
  "I wanted to smoke out of our 2 foot bong we call the cannon to bring back that marijuana feeling. For me the bong was always the most efficient way to smoke. Basically, the bong got us fucked! We bought an 1/8 of mids (decent weed, few seeds) from my dealer and headed on over to a hidden area for us to smoke in peace. Well, we began by packing the first bowl. We took the enormous hits which occasionally made us cough. After the second bowl, I noticed I was feeling extremely fuzzy-eyed and kind of floaty. As soon as we were done smoking, we decided to take a walk to the store to buy some munchies.",
  "We sat down outside of the store to just chill while we ate. I felt pretty good at this point, but there was this feeling of anxiety. I would watch the cars drive by and criticize the shitty ones and point out the ones I thought would be nice to drive for the day. Then as each car drove by, it started to get annoying to look at them and everything was bright. When the cars drove by they seemed to move slower than usual. They were all 2-D, like I couldn't see all the dimensions of the car and I couldn't tell where the corners of the car were.",
  "We got up to walk to a friend's about 30min. later and I saw patterns around my vision. You know where you can see farther right or left when looking straight ahead. Well, in the black area around my vision I could see patterns. I know I'm not crazy because I am sitting here typing this today more sober than I have ever been and I can't even see the blackness around my eyes. I think it's just me, but many times when I smoke I get the weird tunnel-like vision that I experienced that day."
 ],
 "erowid": {
  "id": "2928",
  "citation": " BuBu. \"Weird hallucination: experience with Cannabis (ID 2928)\". Erowid.org. Nov 28, 2001. erowid.org/exp/2928",
  "substance": "Cannabis",
  "views": "7214"
 }
}
