{
 "id": 4494,
 "title": "Butane Extract Warning",
 "date": {
  "submission": "2003-12-16T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "plantshaman",
  "gender": "Male",
  "weight": 69
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(extract)"
  }
 ],
 "report": [
  "I've recently started using butane extracted honey oil. The stuff is amazing. I used a brand of butane called purilite. After about a week I developed some crazy bumps on my tongue and inside my mouth. I thought it had been an infection or an allergic reaction to something. I went to the doctor. a few weeks later it stil  hasn't gone away. I now am exibiting the symtpoms of Peripheral Neuropathy which may be caused by exposure to toxins. I looked up burning in legs on web md, the burning started about 5 days ago. I read about it and I seem to have all the symptoms. I have a hernia and I thought the aching and burning in my legs was associated with it but it slowly spread into my hands then arms and all down my legs. After reading this I boiled off maybe at most 1/16 of the large bottle of butane and got a pretty substantial amount of a yellowish oil, probably some patroleum distilate, which I know causes swelling if in contact with the mouth. ",
  "I go to the doctor tomarrow. I may just be crazy. My friend just called says his mouth is starting to get bumps too. I can't yet say for certain on the peripheral neuropathy but I exibit all signs. The intermittent burning/cramping started moving through the extremeties. Now it's in all legs and arms. Tingling, stabbing, burning sensation on the skin of my face. Cramping in my muscles, worse at night. And I'm kind of stoned at the moment but there definitely could be a numbness/tingling in all my extremeties. ",
  "Hash oil is in my opinion the ultimate way to ingest THC but PLZ don't be stupid like me! Make sure you boil off a good sized sample of your solvent before using it! Do not use purilite brand butane!"
 ],
 "erowid": {
  "id": "29281",
  "citation": " plantshaman. \"Butane Extract Warning: experience with Hash (oil) (ID 29281)\". Erowid.org. Dec 16, 2003. erowid.org/exp/29281",
  "substance": "Hash (oil)",
  "views": "18853"
 }
}
