{
 "title": "First Proper Experience",
 "author": "Poi",
 "citation": " Poi. \"First Proper Experience: experience with Ecstasy (ID 4495)\". Erowid.org. Dec 27, 2001. erowid.org/exp/4495",
 "substance": "Ecstasy",
 "bodyweight": "10 kg",
 "report": "<p>Ingested substances: Ecstasy</p><p>  T       19:00pm - Entered Venue</p><p>  T+03H30 22:30pm - 0.5 pills</p><p>  T+04H30 23:30pm - 0.5 pills</p><p>  T+05H30 01:45pm - 1.0 pills</p><p>  T+09H   04:00am - 0.5 pills</p><p>  T+10H30 05:15am - 0.5 pills</p><p>It is currently the 2nd of January 2001, and the night I am referring to was a couple of days ago. This is going to take me ages to type because my arms are sore! I am a fun, generally well behaved, outgoing 18 year old. I am writing this report mainly to try and shut myself up as my mates are becoming annoyed with my incessant ramblings about this night! Also because I remember it fairly well and would like to share it before it is lost. It's long and maybe not exactly what erowid is looking for, but me brain is not functioning to full effect right now, I can still feel the ecstasy in my body, slowing down my thought patterns :) Anyway, here goes...</p><p>PS. I apologise in advance for the length of this thing, didn't mean it to become so huge but it just happened. Hope it's worth it ;)</p><p>The date, 31st December year 2000, we had been planning this night for the last two months, we were to visit one of the biggest underground dance events in the UK on this night, it was to last for 11hours, starting at 7pm and stretching over the welcoming of the new year right through until 6am. When I refer to 'we', I mean me and a friend, there were other people we knew who were there, but only 2 of us stuck together. We had aquired some White Shark skunk the day before, and we smoked a fair quantity of this on the way down, probably about 5 or 6 very potent and packed reefers on the coach journey down there, as well as drinking a few cans of lager each.</p><p>During the last hour or so of the coach journey, I began to experience mild anxiety and 'butterflies in the stomach' due to anticipation of what was to come. I can vouch that this was nothing to do with the weed or alcohol, as I have been drinking for many years and smoking cannabis pretty much every day for longer than I've been drinking, so I am used to that.</p><p>I had taken ecstasy on two previous occasions, a friday and a saturday night of the same weekend, each night ingesting half a tablet and chilling out at home. I noticed I was very talkative and became mildly hyper-active. The morning after the 2nd night I felt very drained and this stretched out for a few days.</p><p>Never before had I been to a 'rave' of any description, I have been out to regular clubs on many occasions and got very drunk, but never gone out specifically to dance my nuts off all night on ecstasy. When we arrived at the venue, they placed us in a queue, which seemed very strange to me as we had paid extra for VIP entrance. It was freezing cold (always bloody is in england) and after about 20 minutes a security guard came to escort our coach party into the place.</p><p>After passing through airport-esque metal detectors and strangely not getting body-searched by the bouncers (everyone else seemed to) we were finally in, around 7pm. The venue was split between 3 seperate warehouses, each seperated by about 20feet of freezing cold harsh outside where there was also a fairground. 99% of the people coming in through the entrance seemed to go straight to the least noisy warehouse, which, upon following them, we discovered to be the 'chillout area'. This contained a large (with insane queues) cloakroom, a merchandise stall, lots of sony playstations and a huge cinema screen. The floor was lined with beanbags, couches, and hundreds (thousands?) of people. All was calm.</p><p>Our friends dropped their pills at around 9pm, but we did not, we got a bite to eat and dropped the first pill at around 10:30pm, and proceeded straight to the first of the two warehouses which were pumping out the sounds. As I entered, the first thing that struck me was the sheer volume. There was, in total, over two hundred and twenty thousand (yes, 220K+) watts of sickening music power, and this warehouse was the loudest. It housed the drum and bass arena (our favourite), with insane lighting effects, inflatables, multiple levels, digital video projection walls, entertainers, you name it, they had it. Anyway as I entered, everyone seemed to be moving in a very trance-like way, all synchronised with the music. My friend had been to such events before (none so immense mind you :]) and he instantly joined them, whereas I found it harder. I went to get a beer and stood at the bar marvelling at the sheer bass that my favourite kind of music was presenting to me. The atmosphere of the place was something else. Everyone knew this night was history in the making, two of the biggest underground dance event organizers in the same place, each with a seperate warehouse.</p><p>Around 20 minutes later my friend decided he was to drag me into the center of the crowd, the middle of the arena infront of the DJ where the lights took full effect. I danced for around 10 minutes and soon began to realise I was 'coming up'. It had seemed to take a while, probably because I had eaten a lot. Anyway it became a LOT easier to dance, almost necessary, there was some strange incessant feeling to rave to the music. I saw a lot of people with flashing lights, and was particularly enchanted by the yellow glow sticks a lot of people had. I grabbed my friend and told him I was to go and purchase some glowsticks from the merchandise stall. He came with me, and we sat here (in the chillout area) until about 11:30. As we left the chill out area at about 11:30, I dropped another half a pill (I was aware that my friend was taking more than me, but he is more experienced).</p><p>Anyway back into the drum and bass arena, to witness what was to be one of the country's (world's?) finest dj's spinning the first set after the time crossover from 2000 to 2001. We stood at the back of the arena, where we could see across the top of the crowd (there were raised platforms a bit like football stands and a 2nd tier), watching in awe as everyone held up their lighters, and the happy new years celebrations started. This lasted for a minute or two, I was particularly impressed by the authenticity of the whistles and horns, making the oh-so familiar background sound to the tapes I had heard for the last few years.</p><p>Then the music started. The music was absolutely stunning. I cannot describe how much I enjoyed the midnight set from (in my opinion) the best dj around, and I soon felt an inevitable urge to get as close to the dj, lasers, and speakers as possible. As we tried to move forward through the crowd, we realised that almost the entire population at this event (three arena's worth, approximately 8000 people) had packed into this one arena, to enjoy history in the making. As I was dancing (with very little space!) it became apparent that the other half a pill had kicked in and I was going mental. I danced relentlessly, as did everyone else, until this particular dj had exhausted himself and stepped down. I looked around and was slightly disturbed by the fact that my friend had not yet returned. Continue raving. Keep raving. Keep going. Probably at about 1:30am when the arena was less packed, he returned, we were probably seperated for an hour or so, unable to find each other due to only the sheer number of ravers.</p><p>We returned to the chillout area and bought a few bottles of water, and I noticed how easy it was to talk to people. Every second person whom you made eye contact with would come and shake your hand, 'happy new year!', everywhere there were smiles. Anyway I felt very much awake and spaced out, as if wherever I walked I was floating. I soon realised that as there were a good four hours of raving left, I would be needing more substances. I asked my friend (who was keeping hold of our stash) for a full pill, and dropped it with no hesitation. This was the first time I'd ever dropped a full pill. We sat for around another half an hour, and as I felt my legs going all light and the rushes of energy through my body, we returned once again to the drum and bass arena.</p><p>I was coming up hard and fast, I had never experienced anything like this before, the other two halves had me dancing and this full one was kicking in full force. I soon realised that this was far too much for me, and retired to the back of the arena, where there was more space. I told my friend I was going to get some fresh air, as I began to feel ill and queezy, but not so bad as to feel I was 'going under'. I walked outside, god only knows what state I must have looked, and lent up against the nearest thing I could. I knew I was going to vomit. I began to heave, but nothing would come out, this happened every few seconds for about 30 seconds, and was horrible. A girl walked past, shouting 'smoke a cig mate, it'll help it come up faster'.</p><p>I took her advice, and soon enough I was sick, such a small amount I could hardly believe I was so discomforted, and then I felt fine. Usually being sick is a disgusting experience, but this felt positively healthy, as soon as I was done I felt great, and noticed I was leaning against a police riot van, so ran back inside the arena, and returned to the calmer area at the back. After a drink of water and a few minutes to compose myself (tremendously glad my night was still going ok and I wasn't in the back of the ambulance outside!) I returned to the raving. I realised I was absolutely off my pickle. The lasers and strobes were hypnotising me, I felt totally overcome by the need to dance and did so. By this stage I had lost all grasp of time, so I will approximate using blurred visions of glances at my watch.</p><p>We decided that we had spent enough time in this one arena, and visited the other warehouse, which gave home to the massive hardcore arena. During the stretch of the whole night, I only saw one person who seemed to not be high on ecstasy. He couldn't get with the rhythm and flow, he seemed out of place and anxious, unable to understand how everyone else was going so hard, so fast. I left him to it, he seemed to be enjoying himself nonetheless.</p><p>I was sat in the airflow-port of one of the massive speakers when I noticed two very attractive girls who were stunningly impressive movers. One in particular caught my eye, I did feel libidinous towards her, but dancing seemed the most important thing. I floated over to them, and the girl I had been admiring seemed to be mesmerised by my glowsticks. She signalled that she wanted one of them, so I passed it to her. I found it very strange how she acted with it, having to use the other hand to wrap her fingers round it and get it locked into place, then continue dancing in this strange, almost professional looking trance-like state. Before she moved away, she returned the glowstick to me. There were other people around, I remember one incredibly spaced-out looking guy who had a keyfob, which, when shook side to side, produced a word from the LED's on the side. the word it was saying was 'X T C' and he was stood staring at me, shaking this contraption so I could see what it was saying. I went over and tried to talk to him, but he was so far-gone he could not reply to what I was saying.</p><p>In the hardcore room once again I sat down on the tiers at the side, taking a well earnt rest. An older guy came over, probably 25 or so and he had a blue glowstick in each hand, the curves and rhythm with which he was moving impressed my deeply, and I felt I just had to talk to him, admiring his moves.</p><p>The raving continued for another few hours, we floated between rooms, never stopping, until about 04:45 when I visited the bathroom, and witnessed some hilarious (they seemed that way to me) scenes. Picture this. Four urinals not being used. One of them is blocked and is filled to the brim with urine. One guy walks in. I conciously observed him take a good hard stare at all four urinals, then he promptly walked upto the full one, and began to relieve himself. It was overflowing, pouring all over his feet, but he was completely oblivious. He believed he was doing the right thing. Ah the effects of ecstasy :) I was brought out of my hysterical laughter by a 'bang bang' on the cubicle door in front of me, and a security guard shouting to the inhabitant, 'get out here, now!'. a few seconds later the door opened, and a lad followed by a girl emerged, each with cheeky grins on their faces, the guard just said 'get back out there raving' ;) I splashed some water on my face and returned to the hardhouse to find my friend.</p><p>As the night was maturing, and we were into the not-so-small hours of the morning, I began to notice numerous people with a total ecstasy overload. I don't know the slang name for this, but it's when people's eyes close up and go like little slits, they sometimes foam at the mouth, and have moronic, almost retarded grins on their faces. It reminded me of the 'totally wasted' smiley ecstasy face that was so popular among the oldskool rave culture, and at the same time reminded me of some alien out of the X-Files or something. I found the sight of these people rather disturbing, and after asking my friend why they looked so fucked, he said it was simply 'too many pills.' They looked permanantly disfigured, but he assured me it was only temporary until the E wears off.</p><p>We went into an adjacent arcade, and this was where I met the only person who showed any hostility and aggression I had seen all night. Nothing came of it, he just wanted the seat where I was, to which I obliged, not wanting any trouble. I got another couple of halves of a pill off my friend and took one, we proceeded back to the chill out area.</p><p>The music stopped. 'THANK YOU EVERYONE!!@' the MC screamed into the mic. We looked around and realised that most of the people had left. We ushered into the chill out area to try and find our coats, but could not. It struck me how much mess, beer cans, cigarette stubs lined the floor. I went to the merchandise stall to buy a t-shirt to keep me warm on the short walk to the coach. We were one of the last people to leave the venue, getting on the coach at about 6:20am, the music had finished at 6am. I was still rushing and coming up as I got onto the coach, and I can remember the driver being startled by (I assume) the deeply spaced-out look in my eyes, then some liverpudlian lad noticing me with my hands still welded to the glowsticks as I walked up the coach's central aisle, shouting 'this one's still flying!'. I retired to my seat and played with the glowsticks some more. By about 6:30am we were moving. My friend rolled up a couple of fat reefers and within about an hour he was asleep, but I could not relax. I sat talking to a few of the other people on the coach, noticing half of them were still as pilled up as I was, and smoked weed. I was not becoming stoned. In fact it seemed to do very little. As the inevitable paranoia began to engulf me, it became light outside.</p><p>By around 7:30 it was fully light and most were asleep. I stared at the headrest of the seat in front of me, trying to fall into a slumber, and I realised that I was hallucinating. I was not expecting to halucinate off ecstasy, I have take shrooms and LSD before, but this was different, seeing distinct objects. Any flat surface I was looking at vibrated, as if it was the cone of a loudspeaker, in time to the music (drum and bass) which was being played on the coach radio. We stopped at a service station around 8am for some food, but I was not hungry. There was another coach parked next to each other, and I kept getting that very strange feeling that the other coach was moving forward, or we were moving backwards, or vice versa. In truth neither moved a single inch. I stared out the window, looking at the 3 bands of colour which were the sky, the white coach trim and the coach window, and this space became my own drawing board in which my vision was distorted and I hallucinated all kinds of things. They were rapidly changing, but nothing evil, a pleasant experience, it probably helped that I had tripped before.</p><p>The people who had eaten soon returned and the coach headed off. After some more hallucinations I fell into a deep sleep, and woke a few hours later to find us almost home. I was recognising landmarks which we had passed on the outbound journey, and I was no longer hallucinating. My glowsticks had expired. I was coming down. I still felt a few rushes through my body, but nothing great. We soon arrived in our home town, and I left the coach leaving my second pair of trainers on there. That's what I get for taking pills huh, I'm not usually a forgetful person.</p><p>We got a taxi home to my friends house, arriving there about 12noon yesterday (new years day) and retired to bed almost straight away. I woke at about 5pm and we got out of bed, I had come down almost completely, but I did not feel bad. I was expecting the much dreaded 'come down' but I just felt tired. My jaw was sore as were my gums, and I had bruised backs of middle fingers from where the glowsticks had been lodged all night. We headed out at around 8pm to another friends house, to gloat, and tell everyone how foolish they had been to not come with us on this night to top all nights! I realised that it had been almost 24 hours since I had last eaten anything, so we ordered a pizza. We finished off the last of our skunk and I made it home for about midnight. I slept for about 12 hours, and I felt fine and dandy in the morning. Maybe it was because I had raved all the ecstasy off, I don't know. The come down from the half a pill a few months earlier had been like 100x worse than this, almost nonexistent one. They were the exact same pills too. Huge dirty phat things.</p><p>I guess it's the atmosphere that made this night so good, thousands of people all there to have a good time, no-one causing trouble. I felt secure. I would go to the next rave that is happening but I will end up spending half my months wages on raving, and besides, I have a car to run and exams to think about. After I leave college this year, I am taking a gap year before university and will probably hammer the pills like hell and go to as many raves as possible. Now I know what to expect, and a much greater awareness of the culture and how to pace myself, I can't wait to return.</p>",
 "year": "2001",
 "id": "4495",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-27T08:00:00.000Z",
 "views": "9621",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  },
  "2": {
   "time": " T+ 3:15",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  "3": {
   "time": " T+ 5:30",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  },
  "4": {
   "time": " T+ 6:45",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  }
 }
}
