{
 "id": 4497,
 "title": "Love's Tender Whiskers",
 "date": {
  "submission": "2003-12-17T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Andy E",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "8.0"
   },
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I wanted to cry. I thought about all the injustice in the world. How quickly a life can be taken away. I thought about karma, and energy flow. I looked to the right of me on the bed and my beautiful girlfriend laid to my right looking straight into me. She really knows 'me' I thought. She smiled and I almost had to cower into her chest because I would have looked a moment longer I would have said that dreaded words, 'I love you,' that brings a relationship to a different level.",
  "We've all been abused and have been told we're loved when we weren't, sometimes those that love us most never need to tell us, so I kept my mouth shut and told her, 'You're perfect.' Our hands caressed each others bodies seemingly having sex without really going there, but when we did (a couple hours later) it was wonderful (but it always is).",
  "The night wore on, and spectacular conversation lingered. Despite lack of sleep we were very in tune, on the ball. Laughter was awesome, and we surprisingly did not wake up the roommate. I came up with crazy ideas like creating a 'Fucked Up Parade' for my hometown of Milwaukee. Each moment was great, and amazingly didn't seem shadowed by the drug, but part of a natural progression.",
  "The evening brought me much closer to my loved one and I'll never forget that smile. It's hard to know if such a night would have ever happened without 2C-I, it's possible, either way it was wonderful. The onset was long, and very smooth, and the feeling was very natural. I had very little visuals and consider a dose in my range to be more 'serotongenic' than anything else; however, notably different than MDMA.",
  "** I hope to never see this remarkable chemical on any schedule list, but much care needs to be taken. Our sacraments are quickly fleeting because of those who abuse them. Real research needs to be done on the effects of this chemical, because despite its beauty little is known about its long term affects. We need to be careful people, don't destroy your minds and bodies. But any thing in moderation just makes you stronger (homeopathy)! Much love and respect."
 ],
 "erowid": {
  "id": "29290",
  "citation": " Andy E. \"Love's Tender Whiskers: experience with 2C-I (ID 29290)\". Erowid.org. Dec 17, 2003. erowid.org/exp/29290",
  "substance": "2C-I",
  "views": "6963"
 }
}
