{
 "title": "A Gram and Me",
 "author": "Shafrakwalon Phexon",
 "citation": " Shafrakwalon Phexon. \"A Gram and Me: experience with DPT (ID 44975)\". Erowid.org. Jan 11, 2007. erowid.org/exp/44975",
 "substance": "DPT",
 "bodyweight": "140 lb",
 "report": "<p>Here are my notes about DPT, starting with the night I recieved the DPT and snorted some of it, and ending with the night that I smoked the last of it out of a light bulb. But first, a word of advice:  Weighing out your doses of powdered drugs before ingestion is the responsible thing to do.</p><p>Now, DPT really irritates my nostrils. It leaves my nose feeling raw as hell and it hurts the roof of my mouth.  I first took it on the day that I recieved it - a pretty little bottle filled with a fluffy, light, white powder that smelled like nail polish remover. The label on the bottle said DPT hydrochloride.</p><p>I had no scale but I estimate my dose based on later use of a scale with DPT to be about 65 mg. It was a medium sized line and a half. It came on and the body vibe felt pretty similar to acid, I had solid (there but not everywhere) visuals, nothing too crazy. I was baseline in about 4 hours.</p><p>The chronology of the insufflated DPT experience goes:</p><p>1. Insufflate</p><p>2. Body vibe starts coming on, start to feel trippy / sometimes giggly.</p><p>3. Body vibe in full effect, cue visuals.</p><p>4. Body vibe and visuals platue at peak lvls for about an hour.</p><p>5. everything slowly goes away till baseline.</p><p>What I'm calling the 'body vibe' above, can be a pretty tumultous and sweaty affair (especially on the way up), I come up fast on DPT. I come down fast, too.</p><p>On the next night I took considerably more, probably around 90 - 100 mg's, it was a couple big sized lines. Again, the body vibe still felt moderately similar to LSD, this time I saw intricate patterns and occasionally 3 dimensional CEV's.</p><p>The night after that (the 3rd night in a row), I took a weighed out dose of 75mg insufflated. This time I got some body vibe and visuals but it was pretty toned down. Tolerance, built up from the previous nights, most definately had it's way this time.</p><p>-This is a strong drug not to be taken for granted-</p><p>Note: Its 8/2/2004 now, and the DPT has been gone for a few weeks. I had many cool and interesting trips on it, here are some more experience notes:</p><p>Summaries:</p><p>The time when I ingested more DPT by far than all the others, was like being in a pocket underwater, with flashes of other places. It was extremely deep and any image I thought of behind my closed eyelids, I would immediately see.</p><p>I insufflated 2 really big, un-weighed lines (maybe pinkie sized? it was by far the most DPT Ive ever done) to get there. I was sitting on a couch in a friends living room. There was a large black dog barking in the room and no one else was on DPT. I began to truly grasp the gravity of my situation when I looked at the Super Nintendo next to the TV and it promptly began to bend around, dent, and warp. I was a little anxious as the DPT experience got progressively deeper and stronger, but I knew I was in for the ride, so I figured I might as well do my best to take it in stride.</p><p>Once it had fully sunk in, my entire field of vision (with eyes open) was obscured / blurred / glowing / mixing / etc. It looked alot like an underwater las vegas - thick wavy multicolored neon bars. I shut my eyes and thought deathly thoughts, and promptly saw deathly things. I saw a thousand consecutive deaths in incredibly fast motion. The deaths / mutilations / gore went by at first slow, but then began to increase in speed until they where flashing one after another on my consciousness, each remaining for only a split second. Most of them (if not all of them) were on a white background, with the death and gore occupying the middle of my visual field.</p><p>Eventually I decided to think about serenity, the death-imagery subsided then and I saw in 3d the chrome silhouette of a cross-legged human figure floating in outer space. This serenity state was abruptly perforated by brief swaths of time where I looked through what were possibly someone elses eyes, a different set of mine, or both.</p><p>Regardless of whose eyes I was seeing with, I found myself in a train station looking around, and I knew a train was coming soon (possibly a train I was waiting for). This happened a few times (Which is why I say that it 'perforated' my serenity experience) and each time the transition was totally abrupt. Kind of like crossing a line, an instantaneous transition that lasted what seemed like a few minutes, and then went back to the normal sensual-pocket DPT state. Eventually I began to come down, and then came down altogether. Almost the entire duration of the plateau of the trip was spent sitting in a large chair with my eyes closed. Opening them was not as interesting, and was slightly disorienting due to the complete alteration of my visual field.</p><p>After that experience I had many others over the period of a few weeks, all of them were very interesting, many were pretty intense, and a few had some (stuffy / runny / irritated) nose problems.</p><p>I finished the DPT by smoking what was left of the HCL salt in an emptied out light bulb. The more I toked, the more I tripped, and this was great.</p>",
 "year": "2004",
 "id": "44975",
 "gender": "Male",
 "timestamp": "2007-01-11T08:00:00.000Z",
 "views": "6347",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "95 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 }
}
