{
 "title": "An Astounding Flow",
 "author": "Astaroth",
 "citation": " Astaroth. \"An Astounding Flow: experience with Morning Glory (ID 44986)\". Erowid.org. May 31, 2006. erowid.org/exp/44986",
 "substance": "Morning Glory",
 "bodyweight": "160 lb",
 "report": "<p>I heard about the psychedelic properties of Morning Glory seeds from a friend I met. Upon returning home, I investigated it for myself. Finally I decided to try it. I went to and purchased 6 packets of assorted morning glories. Heavenly was nowhere to be found. At home, I picked out all but the purple seeds, as I had noticed of a picture from the internet that the seeds of Heavenly Blues are purple. Makes sense, but it probably doesnt work that way. In fact, it doesnt. The purple is the result of an insecticide spray or something, and the majority of the seeds that I have seen, Heavenly Blue or not, are purple. Judge by the label, not the shape or color of the seeds. Later that week...</p><p>3:00 P.M</p><p>I used a coffee grinder to grind 50 or so seeds. I added the grounds to water and allowed them to sit for thirty minutes. I then strained the stuff through a coffee filter, which produced about 2 ounces of piss-yellow liquid. I mixed this with some apple juice and drank up. It actually wasnt that bad. In fact, the two flavors complemented each other, which was a plus. I sit around and wait.</p><p>4:00 P.M</p><p>Nothing significant thus far has happened. I decide to visit another store in search of actual Heavenly Blue seeds. I head out the door and begin walking to our local grocery store. On the way, I begin to feel a strange, mellow happiness come over me. I smile at passersby and they give me odd looks. I become more aware of things, and this entertains me for a while, but soon fades away. I reach the store and purchase roughly 11 grams of seeds (200-250 seeds?) I walk home and begin the extraction process over again.</p><p>5:30 P.M</p><p>I grind all 11 grams of seeds, soak them in water for another 30 minutes, and strain. I used substantially less water, and the liquid produced was more of a dirty brown this time. Only about an ounce was yielded. I wonder if this provided enough LSA for a substantially vivid trip, and decide to find out.</p><p>6:00 P.M</p><p>I mix the liquid in with lemon Gatorade, apple juice, carbonated grapefruit juice, and peach nectar. The carbonation, I might add, is essential to the recipe. Unfortunately, the purple food coloring is nowhere to be found The brew tastes absolutely wonderful. I sit back, pop in some music, and await a trip that, hopefully, will be as far out as my concoction.</p><p>6:30 P.M</p><p>I eat dinner, and a mild sensation of nausea begins to set in.</p><p>7:00 P.M</p><p>I begin to feel strange. Theres something about my vision that doesnt appear normal, but I cant yet put a finger on it. I start watching some television with the lights out. The colors seem intensified, and patterns seem to smear across my eyes. Out of the corner of my eyes the world kaleidoscopes subtly, colors flashing in geometric form, barely tangible. I laugh at everything the cartoons say. I switch over to Nick at Night. A normally abhorrent show, Full House, becomes a land of dreams. I keep thinking about how far out that guitar guy is. Definitely having fun. The nausea slowly fades away.</p><p>8:00 P.M</p><p>My mom yells down to me to come up. I giggle a bit at this, and eventually comply. I am confronted with one of the coolest things I have seen in my life. Outside the window, the street is orange. I look about, and so are the other houses. I laugh under my breath and step outside. It is raining heavily. I look up and see a double rainbow, glimmering in the sky. The clouds are moving in. A bird flies over me, and my eyes follow it until by some odd coincidence they end up on a spot of blue. I snap out of whatever temporary state I was in, and realize its my elderly neighbor in his raincoat. I kind-of wave, and he gives me that typical, bushy eye browed, I-hate-stoner-teenagers glare. I laugh mirthfully and step inside. My mom gives me an odd look, but, fortunately, she already thinks Im a strange kid, so she thinks nothing of it. I return to my room and watch AcidWarp for a while.</p><p>I notice things within the patterns, the colors seem to be washing over me. My head begins to move, and I feel as if I cant control it. I stare wide-eyed at the screen for what seems like hours. I snap out of it yet again. I look at the clock. Its only been 14 minutes. My face lights up. I want to draw! I grab a couple of pieces of paper and a pencil and return. I sit down and draw for a bit, noticing objects within the patterns I drew and writing what I see somewhere on the page. It is a masterpiece, I say to myself, then laugh because I know whats going on, and I realize how horribly clich it is. I put it away, feeling content. The white of this electronic piece of paper is flashing black and white in triangles.</p><p>9:00 P.M</p><p>My dad comes down and yells at me, which really freaks me out at first. What if he notices? Oh my god! I respond, and laugh at myself. I can control it! A profound sense of euphoria comes over me, and I am reminded of some random task that needs doing. I make some noises to myself, and my dad looks over, puzzled. I have a lighter, and I am playing with it. I try to touch the yellow streak. It glows so intensely, like a tube of light. My finger begins to burn, and I pull back, tossing the lighter aside and touching my finger slowly. It feels wet. Perhaps I am melting, I think gleefully to myself. Do humans melt? Instantly my mindset changes, and I am in some room near a staircase from Alice and Wonderland or something. I listen to myself laugh. It sounds so very strange in this room, this made-up room.</p><p>I head upstairs and sit with my mom and brother for awhile. She is reading to him from some kids book, and looks at me quizzically as I sit. I never listen to her read, not since I was 10. I mumble something unintelligible under my breath which she takes as a cue to continue. I stare blankly ahead, listening to how some owls are flying through needles and land on a sliver of rock. For some reason, I think of A Wrinkle in Time. I envision a rock floating in midair in a sea of hovering pine needles. The ceiling fan is on. It looks like it is sending out ripples in the air, ripples of darkness. I grow restless, and return to my room. Eleven minutes have passed. I turn on the television again, yet as I begin flipping channels, the power shuts off. I am left in total darkness, from which patterns begin to emerge. I sit as the other members of my family stumble about, complacent and content.</p><p>I watch with childlike amazement as I close my eyes. What was black becomes green, and begins to move. Splotches appear. I open my eyes, and the green glow slowly fades. After awhile, I go upstairs. My parents are rummaging around with candles. My mom tells me to take some down to my room. I am dazed for a moment, then remember I already have a bunch scattered around. I return to the basement and begin lighting candles as well as a stick of incense. I then lie on my bed and stare at the flickering, listening to the howl of the wind. I point my flashlight at the ceiling and look at the shadow of my hand. There appears to be a strange aura around it. I casually glance at it and tell myself not to worry, its only my essence. The smoke from the incense takes on an odd appearance in the half-light, and I look at it for a while. I go into my bathroom and stare into the mirror, my face lit up with a solitary candle.</p><p>I pretend I am Satan, but stop after I begin to really freak myself out. I start looking at the backs of some CDs I have laying around. Thin, rainbow lines scatter around the room under the glow of my flashlight. It is absolute magic. I venture back upstairs where my family sits in the glow of a kerosene lamp. I then have the strangest feeling. I can feel what my brother feels, or it least it seems that way. I get an odd feeling of warmth and comfort, sitting around in the fuzzy light of the old, Aladdin lantern, listening to the soft beat of music through my headphones and watching the shadows creep about the nooks and crannies of the ceiling. My mom and I start playing with the cats, the two sleek black shapes, almost figments of my imagination, that seem to flit in and out of existence, reveling in the glory of the night. We laugh, and for a moment I feel like she is tripping as well.</p><p>I almost tell her about the seeds, but quickly regain my composure. Suddenly, the lights flicker back on.</p><p>10: 30 P.M</p><p>I smile as I return to my room. How wonderful that was! And the best part is, Im still going! Light seems to bulge and contract as I sit in bed, reading. I felt as though I could feel the characters emotions. What I read became crystal clear. I then become distracted by the music. I can see it. Some of it is round, and some of it is sharp and spindly, twirling around the long, log-like strand of bass. The tube suddenly stops progressing, and I felt as if my mind has shut. It takes me a while to get over this, but eventually I turn back to my reading.</p><p>11:20 P.M</p><p>I pace about the room, laughing euphorically to myself. This is so crazy! What a crazy place to be! Round? What a crazy shape for a planet! Oh man. Fun does not even begin to describe the time I am having. I look through a picture book on horses. On one page it has a picture of two knights jousting. I couldnt tell, try as I might, which lance belonged to which knight. I puzzled and puzzled (til my puzzler was sore), all over this seemingly trivial issue. It seemed like such a deep, complex problem. Perhaps it is As I continue to look through the book, my childhood rushed through my brain, a torrent of not physical memories, but mental ones. Snapshots from my past hit me at random, and for awhile I would linger inside them as a mental state, but eventually moved on to the next.</p><p>I decide to go to bed, as I have to wake up at 4:00 tomorrow. I lie in my bed, looking up at the ceiling and watching the tiles slowly undulate and shimmer. I take out the goa/trance mix I had been listening to earlier and put in a classical CD. The first song is Concertino by Cecile Chaminade. I feel as if I am in heaven. There are no words to describe my bliss. I wanted to literally burst with happiness. I close my eyes, yet strange flashes of color dominate the darkness. I cant sleep.</p><p>1:00 P.M</p><p>Fuck! I cant sleep, and Im still feeling happy. I warily decide to take a tiny bit of Nyquil in order to gain a proper three hours sleep. Fuck! I hate licorice. Who decided to make Nyquil licorice flavored? Why cant they make sugar flavored cough syrup, for Christs sake? My anger, however, is quickly subdued by the power of the mornings glory, brethren. And soon I fall fast asleep to the land of dreams. I wake up the next morning subdued, with no come-down symptoms whatsoever</p><p>Synopsis: Absolutely astounding! Having nothing to which to compare it (i.e. pot, shrooms, peyote, et cetera), all I can say is that it was wonderful. This was amazing, perhaps on the threshold of life changing.</p>",
 "year": "2005",
 "id": "44986",
 "gender": "Male",
 "timestamp": "2006-05-31T07:00:00.000Z",
 "views": "6311",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  }
 ]
}
