{
 "title": "Warm, Peaceful",
 "author": "Ano.",
 "citation": " Ano.. \"Warm, Peaceful: experience with Kava (ID 44984)\". Erowid.org. Jan 12, 2007. erowid.org/exp/44984",
 "substance": "Kava",
 "bodyweight": "245 lb",
 "report": "<p>I bought a package of kava tea from my local grocery store, 16 packages of 78mg's each (other plants were already in the tea--roots to give it a drinkable taste; cinnamon and jamacian something root.)</p><p>Around 12:30-1:00 after taking a shower;</p><p>I drank an 8oz cup with two tea bags (156 mg). I put on 'Ambient 1 - Music for Airports' by Brian Eno and relaxed. Within 5-10 mins my throat had more of a burning (pleasently warm though) feeling rather than a numb one (As most people report). It was pretty close to being numb, (usually higher doses have stronger effects-). Since this drug is very subtle, I won't report my effects in chronological order, but in general how I felt during and after I ingested the tea.</p><p>-Comes in small waves (on and off)</p><p>-warmness in body</p><p>-subtle changes of perception (feeling peaceful, less worrysome)</p><p>-Relaxing feeling, could fall asleep easier than ever.</p><p>-Focused. Could concentrate better.</p><p>-Music seemed much more flowing.</p><p>I noticed all these things by relaxing and really paying attention to the effects of the kava. These effects are not strong, but subtle, very, very subtle.</p><p>At 3:00;</p><p>I drank another cup with two bags of tea (another 156 mg). Relaxed and played a lot of music, things seemed to flow better, could focus on what I wanted to do. Same effects as before, no more intense or less intense, same.</p><p>At 6:00;</p><p>Drank another two.  No change in effects.</p><p>At 7:00;</p><p>Drank another cup of two bags of tea. This time, (I'm not sure if it's from all the other kava tea I drank before, but) I felt much more relaxed, peaceful, warm. The effects seemed intensified. I didn't drink anymore tea, I felt very relaxed, peaceful, focused and content.</p><p>Fell alseep at 11:00 after having band practice. I Remember having a very peaceful sleep, and it was very easy to sleep. At around 11:00 the next morning, I was still feeling the effects, but to a much lesser extent. I drank four cups of tea this time, all at once. Four tea bags in 8oz of water. I talked to my friend a little bit afterwards, said my goodbyes and started my walk home.</p><p>The best part about kava is it's subtlies, and it's waves come and sneak up on you---</p><p>As I walked home, I was very introspective about everything. Everything seemed very, well, balanced. Not quite euphoria (well, to a small extent). Walking was nice, did not become tired at all of walking. The sun felt like pure warmth against my skin, quite an amazing feeling. Even though it was hot outside, My body seemed to not mind as much as it usually would. Even though there were some things I could complain about usually, I didn't. I just felt as if it were trival and I can enjoy life anyways, even though there are these small factors. I didn't drink anymore tea because I was pretty content for the rest of the day. I just relaxed with my friend.</p><p>All in all, Kava's effects are enjoyable when they can be noticed. Kava is not like any other drug. It's not a substitute for getting stoned- it's not a sub. for anything, it's effects are diffrent than weed or opium, it's a completly diffrent feeling. I will likely drink Kava tea once in a while before I go outside for a walk, or if I feel like a peaceful day. If I am busy doing something, I don't quite notice the effects as much.</p>",
 "year": "2005",
 "id": "44984",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-12T08:00:00.000Z",
 "views": "47258",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  },
  "2": {
   "time": " T+ 5:00",
   "amount": "2 cups",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  },
  "3": {
   "time": " T+ 6:00",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  },
  "4": {
   "time": " T+ 22:00",
   "amount": "4 cups",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  }
 }
}
