{
 "title": "On the Job",
 "author": "The Veil",
 "citation": " The Veil. \"On the Job: experience with Mindfulness (ID 44993)\". Erowid.org. Nov 1, 2007. erowid.org/exp/44993",
 "substance": "Mindfulness",
 "bodyweight": "160 lb",
 "header": [],
 "report": "</p>I graduated college not knowing what I wanted to do with my life and not wanting to participate in the 'real world' as much as possible.  I needed to work so I got a job as a maintenance/grounds person at an apartment complex.  I've been working there for about a month now.  My job is pretty good for the practice of mindfulness; I never get nagged to speed up my work pace, and mindfulness, even if I'm not try to, slows me down.  I usually dedicate one section of the day towards mindfulness and do it during other times when I think to.</p><p>Each day I have to pick up the trash from around the complex I use a mechanical trash picker upper thing and a paint bucket, this usually takes 1.5-2 hours.  During this time I try my best to concentrate on what Im doing.  When I pick up a piece of trash I will drop it in the bucket and say 'here' in my head to remind me to be in the moment and to redirect any of the thoughts in my head to the moment.  I will be mindful of different things during this time, sometimes I concentrate on my feet as a walk, I feel every step, or I listen to the sound every time they swish through the grass or sound they make when I step on pavement.  Other times I will concentrate on other sections of my body, one of the things I really didn't realize until I started doing this was a natural high my body often has, if I just take the time to notice it.  Sometimes when Im really struggling being there I will use the classical breathing exercise being mindful of my breathing.  I often say 'in' and 'out' in my head with each in and out breath. </p><p>This is pretty much the extent of my exercises; I do them at other times of the day too and just be mindful and try and stop the constant flow of thoughts in my head.  It can be quite difficult at times, especially when I just want to be at home.  I've also noticed that certain activities at home affect my abilities at work to be mindful, any kind of TV, movie or even music listening can disturb my ability.  What they seem to do is speed up my mind, they over stimulate it and then in the lack of that kind of stimulation the mind seeks more of it and has trouble with just being.  I have found that moderation is the best way to deal with this. </p><p>Effects.  The effects from these mindfulness activities have been great.  Sometimes Ill just laugh or smile out of nowhere, it just comes, it's kind of like experiences Ive had on marijuana or salvia where laughter just comes and I have no idea why I'm laughing but I do.  I also have a more upbeat mood, I feel calmer, and I feel more compassionate and understanding to those around me.  I also sometimes get this high type feeling almost like a light MDMA type high, Im not sure if it's the mindfulness or if it's always there like I was saying when I look in and just be mindful of my body I notice this great feeling there most of the time.</p><p>Anyway my ultimate goals with these exercises are to free myself, to become awakened, to be a Buddha, to be one with God, to kill my ego.  Whatever you want to call it.  I'm not sure if that will ever come unless I work more (or less) with all this, but either way these simple effects are great by themselves.  And if I could recommend a book Thich Nhat Hanh - Peace is Every Step.  This was probably my main inspiration.</p>",
 "year": "2005",
 "id": "44993",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-01T07:00:00.000Z",
 "views": "4441"
}
