{
 "title": "GHB Overdose or Poisoning??",
 "author": "Julia Gantt",
 "citation": " Julia Gantt. \"GHB Overdose or Poisoning??: experience with GHB (ID 45)\". Erowid.org. Jun 9, 2000. erowid.org/exp/45",
 "substance": "GHB",
 "bodyweight": "170 lb",
 "report": "<p>I do not know if I should consider this experience a drug overdose or poisoning... At a friend's house, he is an EMT offering me GHB for the first time. I trusted him, being in the Navy, and he told me to take the reccomended dosage for a female my size of 4cc (4 ml). I was told not to eat for 4 hours prior to taking the drug, which I hadn't so it would work well.</p><p>I did not know anything about the drug GHB and at first I did not feel anything after taking the dose. I took a total of 18 more cc when he wasn't looking. 7 minutes later, I felt a strong and sudden reaction to the drug. I felt very dizzy and drunk and my vision was choppy and wavy. I told the EMT friend I was feeling it. I remember him pulling me into the bedroom to have sexual affairs and I remember acting very silly. The radio was on and I could hear the music around me very clearly and loud. I know my orgasm lasted nearly a minute and was very hard to achieve. It was more intense then any other time in my life. I left the room after having sex.</p><p>Still awake and wanting to talk, I sat down on the floor with my knees to my chest for about a minute, and the next thing I knew I was waking up the next morning... As I awoke, my eyes were rolling in the back of my head, I was unable to remember where I was, I was literally freezing cold, my teeth chattering. I had to urinate right away so I crawled to the bathroom and pulled myself onto the toilet. I felt so nausiated, my teeth still going, and my skin ice cold. The room was spinnng very fast.</p><p>The last dose I had taken of the GHB was at 4:30 am. When I awoke suddenly, it was only 8:30. The EMT friend was no where to be found, yet a letter was left for me... 10 minutes later, my eyes no longer fluttering, I began to read. 'I had to leave for work, please take this Thermadrene pill so you can drive yourself home. Please sleep as long as you need to in order to drive safely.' I drank some water, still below normal body temperature, wrapped myself up and went to sleep again.</p><p>Though I had a lot of trouble falling asleep. I was out in 20 minutes after laying there. 6 hours later, I felt okay to drive home and did so.</p><p>Calling the EMT friend, I asked what had happened to me. He said when I left the room, only minutes later, he came out to bring me into the bed where I can sleep comfortably, I was choking on my own tongue, about to swallow it. He layed me down on my side with a pillow and blanket, in a position where he knew I would be okay. He checked my vital signs, I was going to be okay.</p><p>I would call it an overdose, but since I woke up the way I did, so dissoriented and eyes rolling in back of my head, I didn't know if this would actually be poisoning... For the next 3 days I was depressed, forgetfull, had diareah, ate nothing, talked to no one. I eventually came out of the GHB trance after 3 days.</p>",
 "year": "2000",
 "id": "45",
 "gender": "Female",
 "timestamp": "2000-06-09T07:00:00.000Z",
 "views": "16914",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "22 ml",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 }
}
