{
 "title": "A Description for the Curious",
 "author": "Gungnir",
 "citation": " Gungnir. \"A Description for the Curious: experience with Mushrooms (ID 45009)\". Erowid.org. Nov 3, 2007. erowid.org/exp/45009",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "report": "<p>This description is intended for those who are curious about the direct effects of mushrooms and are not interested in spritual journeys or an overabundance of poetic metaphors.</p><p>I'm a twenty five year old male, 130 lbs, with general drug history, primarily marijuana. I've always been interested in mushrooms but have never had an opportunity to try, until one day my pot dealer advised me that he had acquired a few eighths. I don't know the exact type of shrooms, nor how potent they were compared to other species, but he assured me they were of good quality, and though I have no experience with other types I tend to agree.</p><p>We decided to take them late afternoon, around 4 pm, so that we could sleep off any unpleasant comedowns. I'd heard they taste terrible, but I didn't find them too bad. We just chewed and swallowed the dried pieces and washed them down with orange juice. We'd also heard that orange juice is a must-have when shrooming, and again I tend to agree.</p><p>After ingestion, we layed around in my room waiting for the effects to kick in. I was very nervous and had no idea what to expect, and it was difficult to tell whether I was actually feeling anything or just projecting the effects out of expectation. After about an hour I noticed the first real symptoms; my vision began to show odd afterimages as I looked around, as though I'd just looked at something relatively bright, and I thought my body was feeling sensitive, but this could have been psychosomatic. My roommate was saying that he felt very 'liquid-ey,' but I still felt nothing and began to think this was all there was to the experience and was a little let down. My recommendation: be patient, you'll know when it's starting.</p><p>And start it did. I had music playing on my Playstation 2, which has a screensaver featuring a rotating cube and a clock showing the track number and length. Soon green auras began to rotate around the cube, and my perception of time became odd. Sometimes the cube would be rotating very slowly, then very quickly, and everything in between. I told my roommate to look at the seconds counting down on the clock, and he agreed that he was seeing the same thing. You couldn't get down the rhythm of the seconds, they would seemingly stop, then skip quickly through a few digits. The cube began to look very three-dimensional and sported textured, continent-like shapes on it's surface. At this point I closed my eyes and 'dove.'</p><p>The High</p><p>My roommate and I compared notes during and after the experience, and we both had similar effects, though his kicked in sooner, which is odd since I'm skinny and expected my low body weight to be a factor. Physically, we felt very warm, even feverish. I soon found out what my roommate meant by 'liquid-ey;' I felt as if my whole body had turned to warm, syrupy water, and my clothes felt wet and clingy. Much of the liquid feeling was focused around my abdomen and crotch, which was probably the most unpleasant aspect of the experience. I was constantly checking my pants to make sure I hadn't involuntarily wet myself, and noticed my roommate doing the same thing. Unfortunately, with the high body heat and the damp feeling of everything, I could never really be sure. Later I noticed no urine smells in my room, so this must be a side effect. This feeling wasn't helped by a strong flowing sensation in my genital area.</p><p>Mentally, my mind seemed to come alive in odd ways, mostly visually. I didn't hallucinate in the general sense, meaning I didn't flat-out see things that weren't there. It was more like intricate, active patterns and prisms were covering everything, and the visuals didn't get really interesting unless I closed my eyes. As for my mental state, I did feel otherworldly. With my eyes closed my mind went adrift, landing shortly on random visions, like impressionistic dreams on speed, before moving on. The visuals were much like you'd expect from an hallucinogen while listening to music. A lot of trippy, hyper 3-D, colorful movements that more or less reacted to the music. I saw a lot of things that looked like visual interpretations of very complex mathematics, and was mostly in awe that my own mind was capable of such intricate and perfect complexity. I can see how spiritual people walk away from the experience feeling as if they've had a revelation, or saw the inner workings of the universe.</p><p>At the peak of the high I tried to think of a description of what I felt like physically, and came up with a decent analogy. When I was a kid we had a jacuzzi, and I used to enjoy going under and bracing myself against the bottom, holding myself in one place for as long as I could. It was a lot like that. External sounds seemed muffled and strange, and everything felt warm and wet and dark, but not necessarily unpleasant. Almost womb-like.</p><p>Visually, my mind was completely in awe of itself. The visuals took on a power that was absolutely impressive. Huge uber-complex systems swam and exploded, thousands of ribbons with strange and unique symbols moved in random directions like movie film. I would often open my eyes and feel as if I'd woken from a dream, surprised at my surroundings and the fact that I have a body. I'd then drink some orange juice (nectar of the God) and go back under.</p><p>Another thing I'd like to mention, the time-bending gets stronger, and if I focus on it it can be disconcerting. I had to turn off my stereo at one point, because the notes seemed to drag on and on and get lower and lower in pitch, becoming unpleasantly discordant and unfamiliar. I also often thought my heart was beating too fast or too slow, or not at all, and at this point a little panic started to set in and I could almost feel a bad trip coming. But personally I was still able to recognize what has happening, and was able to go with the flow instead of letting my mind fixate on that. One thing that helped me was to focus on the pulses of heat radiating from my abdomen. My roommate and I both felt it, and it wasn't uncomfortable. Think about the rhythms of your mind or the physical rhythms of the drug, not standard rhythms like seconds or heartbeats, or you can become very uncomfortable with how alien these normal beats seem to you.</p><p>The Comedown</p><p>In short, the comedown is just great. Gradually the visions lose their urgency and power, and your mind stays grounded for longer periods. I've heard a term used to describe the after-effects of shrooms, and it's very fitting: the 'afterglow.' I felt as if my mind had been completely broken into a million pieces, each part scrubbed with a wire brush, then the clean and shiny pieces were put back together. Smoking a little weed and taking a walk to enjoy the cool night air was heavenly, mostly to cool off our burning bodies and compare notes, and it was just comforting to see the stars in the sky after feeling as if you'd just witnessed their birth. Everything seemed to glow with cleanliness and all was serenely quiet, especially after the rather violently chaotic experience. We didn't really talk much, mostly because our minds were pretty blank. It was enough to just look around and absorb everything, and even after the visuals wear off, during the afterglow everything looks like you're watching it in high definition. After a good nights' sleep, the next day we both felt great.</p><p>I highly recommend using mushrooms at some point. Be ready for the cons: high body heat, unpleasant liquid feeling of muscles and organs, sense of time becoming distorted. But the pros outweigh them, and the overall experience is definitely worthwhile. I've done them 2 times since, and the last time I again became bummed out by the time bending and had a little trouble escaping, but other than that I've really enjoyed the experiences.</p>",
 "year": "2004",
 "id": "45009",
 "gender": "Male",
 "timestamp": "2007-11-03T07:00:00.000Z",
 "views": "2890",
 "dose": [
  {
   "time": "0",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
