{
 "title": "An Awesome Break",
 "author": "Joelle",
 "citation": " Joelle. \"An Awesome Break: experience with Diazepam (Valium), Oxycodone (Perocet) & DXM (ID 45002)\". Erowid.org. Jan 26, 2008. erowid.org/exp/45002",
 "substance": "Diazepam (Valium), Oxycodone (Perocet) & DXM",
 "bodyweight": "129 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)",
   " T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Oxycodone",
   "(pill / tablet)",
   " T+ 0:30",
   "240 mg",
   "oral",
   "DXM",
   ""
  ]
 ],
 "report": "<p>It was my second time doing any kind of drugs. It was thanksgiving break and my sister and I were at my father's. We were taking .5 mg valiums through out the evening. I took 6 in total. Then about 9 or 10 pm we each did a double perc. *10 mg*. I was feeling very relaxed and didn't have a care in the world. About 30 mintues later I did 240 mg of DXM. It kicked in about 45 mintues later.</p><p>I was starting to see things and it was hard to read. I was giggly for no reason. Music sounded amazing. I could just feel the bass and you can hear every beat to it. Everything I touched felt different and more interesting. A plain old pillow could be entertaining for a long time. I was at one with everything. I just saw pink little triangles moving around.</p><p>Then theres a long period of time which I can't remember what happened. Apparently I took my dad's golf cart for a ride and I was all over the road. *My sister had to tell me this and I still can't remember*. Then I remember laying on my bed, I saw these two old people smoking on a bench at the end of the bed just watching me but they didn't talk. Another thing I saw was my friend's dog and I was playing with him I was calling its name and petting it. My sister was: Wtf are you doing and I said: 'I'm playing with my friend's dog can't you see him, I wonder how he got here'. Which none of that was real.</p><p>Around 6 am I went to sleep. For the next 3 days I had a hang over. I was very tired. I barley ate anything at all and  I slept most of those days. I also had a difficult time to pee. I couldn't pee for two days. I wasn't painful but I just couldn't pee. But in over all it was very fun and worth it.</p>",
 "year": "2004",
 "id": "45002",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-01-26T08:00:00.000Z",
 "views": "11857"
}
