{
 "id": 4501,
 "title": "Waves of Relaxation",
 "date": {
  "submission": "2004-03-01T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Man of Decency",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 ug",
   "administration": "IV",
   "substance": "Fentanyl",
   "form": "liquid"
  }
 ],
 "report": [
  "A couple of weeks ago I had the opportunity to try some Fentanyl that my friend had procured (along with a slew of vials containing various high-powered tranquilizers). I had read a bit about Fentanyl in the past and was excited to see the vial and have the chance to try it.",
  "I have tried many drugs over the years such as cannabis, shrooms, AMT, 5-MeO-DMT, Foxy, cocaine, opium, nitrous, and lots of pharms. I do not take any OTC's or herbal preparations, but I drink lots of coffee (I get horrible headaches if I don't). I am of sound mind and accompanied by my best friend, I felt prepared for the possible ride that this substance promised.",
  "My friend and I injected half of the vial (250 mcg each) and laid back and watched TV. I felt the familiar opiate tickle throughout my body. The fentanyl's effects slowly increased as wave after wave of ever-increasing rexalation took over me. My mind was completely clear unlike morphine or opium. However, I was completely immobile. I was not incapable of movement, it was just that movement was not required where I was, an opiate induced crescendo of sensations. I felt comfortable. Not in the sense of sitting in a plush chair, but in the sense of being in the womb. I was immersed under miles of warm calming water and my brain was free and clear to explore all of it.",
  "The comedown was gentle and brought me back to earth peacefully. Upon reflection, my friend agreed with my assessment of infinite relaxation. The experience was by no means remarkable which perhaps was due to the fact that the hospital dose is the whole vial plus the other tranquilizers, but I would definetely repeat it."
 ],
 "erowid": {
  "id": "29312",
  "citation": " The Man of Decency. \"Waves of Relaxation: experience with Fentanyl (ID 29312)\". Erowid.org. Mar 1, 2004. erowid.org/exp/29312",
  "substance": "Fentanyl",
  "views": "24924"
 }
}
