{
 "title": "On My Plantation",
 "author": "Dr.Pepper!",
 "citation": " Dr.Pepper!. \"On My Plantation: experience with Salvia divinorum (5x extract) (ID 45022)\". Erowid.org. Dec 16, 2008. erowid.org/exp/45022",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "165 lb",
 "report": "<p>I am sitting here totally and truly humbled by my experience with the last of my salvia 5x extract last night. I have smoked salvia many many times but this one takes the cake for the weirdest and, maybe I'll even say, most profoundly eye-opening coupla minutes I had ever experienced.</p><p>The night started off with B-Gizzle and I heading over to our suppliers house. We were hoping to get some THC, but what we got was 'Uhh, my mom is home right now, you guys, duh.' I replied 'Whatever,' knowing I had something much better waiting in the car. Salvia.</p><p>Where I live, there is sparse farming grounds all around so I took the wheel and drove over to a nice spot where it was dark yet there were things to gaze at. I packed a bowl, in retrospect I went a little skimpy, for there was not much left and I would want a turn to explore her world too. He hit the bong and a couple seconds later, became very loud and I was scared he was becoming belligerent. I turned on the car and headed back to his place to drop him off, I really didn't feel like getting a fat punch to the face for no reason.</p><p>Soon, he calmed down after yelling at the road to 'Take off [its] nose! Take it off!' Noticing he was better, and we were now near his home, we rolled on down to a quiet, dark cul-de-sac. I packed a heaping bowl, sort of feeling sorry, yet surprised I was going to do this much. I had never done this much, just out of respect for the plant. Then, I asked B-Gizzle to switch spots with me so I could sit in the passenger seat and he could drive away if necessary. Now, I was all ready. I hesitated and heard a single bird chirping. I looked at my friend's cell phone, it was midnight. Needless to say, my setting was very earth oriented, no people about, just trees, the dark, and the bird, and a soft warm glow from a streetlamp just ahead. I was finally ready, light, hold, look at salvia squiggling and red, inhale, hold. This were the steps leading to WTF! land. Now the trip:</p><p>As always, the first thing I notice is the taste of the smoke, very, I don't know, salvia-like. And that's pretty much the last semi-rational thought I have before the intense body feeling, like getting hit in the head with a frying pan and seeing stars, dominates my being. It came on super quick! The reality as I knew it shifted and dissolved, and all knowledge or relationship of the surrounding trees and houses went with it. Soon, it was just me and these shapes. My eyes never shut but I never had any clue they were open. It was like a crusty ol' curtain was raised and I could see the fresh, clean shapes that were for so long being concealed. Next, audible words became unspeakable, they seemed forever to speak, like I had a stutter or something. I think I was able to let out one solitary sentence, but whatever I said, I wasn't aware of what I spoke or even was trying to say. My mind seemed to do a backflip and I was straight plastered on this upside-down reality. Everything at this point seemed slowed and choppy, like when you pause a movie and play it inch by inch to see Tyler Durden standing in the background. Dreamlike in a way.</p><p>This new world was a very busy one, I had the feeling urgent work was being attended to all around me. My gaze turned downward so I could notice I was now clad in white. In my periphreal vision, I could see rows and rows of men and women sporting the same attire. We were all waiting for something, standing in lines inching forward, although I stood still. From my right, a nice woman handed me a white coffee mug. I looked at her confusedly.</p><p>And, as usual, the panicky thought, 'Oh I must remember this!' bursts in and usually ends the whole thing. But salvia seemed to be giving me a choice this time. Two people, who I don't know in real life, ran after me in a wait-up-for-me! kinda way. They were my age, boy and a girl, and I immediatley recognized them from an earlier trip, in which they wanted me to follow them. But now, we were in this virtual looking neighborhood and I seemed to be heading home with an envelope (home is reality, envelope is the memory of all this). They really wanted me to stay. I could feel their gravity sucking me towards them. The girl then spoke to me. 'Don't do that,' she pleaded as I headed towards the door of this flat, backdrop house. Noticing I was still going for the door, she joked with the boy to cover up her defeat, 'I can't believe he's actually gonna try to remember this!' The guy laughed.</p><p>Well, as you can see, I made it to the door with the envelope. When I entered the house, that's when I regained conciousness of reality, but really, I was still far far from it. Nothing note-worthy happened in these few minutes I was trying to get my bearings, just some intense body feelings and confusion. When I came back to where I semi-understood my situation, I noticed my skin was slippery and clothes clingy. I had sweat so damn much, not just the little droplets I get like usual, this was the real deal and I knew I'd be smelling ripe the next morning.</p><p>I turned to my friend who I was oblivious to this entire time. I asked him, 'Yo, did I do or say anything weird?'</p><p>'Yeah, you freak! You were all, 'There are so many people on my plantation,' and then you started laughing.'</p><p>This news flash shocked the hell out of me because I had no recollection of any of that. Then, I noticed the bird chirping. It sounded familiar and, as I was still tripping, the face of the girl surfaced in my mind. The girl's voice was just the freakin' bird chirping! Oh man, I was screwed up.</p><p>He drove me to his house where we watched Harold and Kumar Go to White Castle. Then, I went home and had crazy dreams of mushrooms and lesbians.</p><p>I think making room for salvia in my life has really helped in dealing with personal problems. She has: cured my depression, made me aware of the wonders of a good 24 hour laugh, taught me how to be spiritual and accept guidance, and recently, showed me the world of the working man (that's what this trip was, I guess). See, I have a problem with accepting that one day, we'll have to throw our dreams away and stand in line sipping coffee while waiting to recieve the next chore. But salvia has a mission to help me with it. Maybe next time I won't leave in the middle of the lesson.</p>",
 "year": "2005",
 "id": "45022",
 "gender": "Male",
 "timestamp": "2008-12-16T08:00:00.000Z",
 "views": "2170",
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ]
}
