{
 "title": "An Effective, Pleasant Tasting Recipe",
 "author": "Birdie",
 "citation": " Birdie. \"An Effective, Pleasant Tasting Recipe: experience with Nutmeg (ID 4502)\". Erowid.org. Dec 26, 2001. erowid.org/exp/4502",
 "substance": "Nutmeg",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  "12.5 g",
  "oral",
  "Nutmeg",
  "(ground / crushed)"
 ],
 "report": "<p>The other night my parents went out of town for a few days, leaving me alone in the house with nothing to do.  I decided that I would fry, but I couldn't get hold of the girl I usually buy acid from.  So, after some</p><p>thought, I decided to try Nutmeg, having previously heard of its possible psychedelic effects.</p><p>Before taking the spice, I researched its properties on the Internet.  I found an article saying that an appropriate dose was 0.75-1.25 g per 10 lbs of body weight.  That said, I decided to try 12.5 g, an even</p><p>1.00 per 10 lbs of my body weight.</p><p>The worst part, I thought regretfully, would be getting the stuff down.  All the reports that I'd read spoke of having to gag down the awful taste of Nutmeg.  Dissolving and drinking it, I figured, would be much easier and quicker than choking down the raw powder.  I do a lot of Adderal, and usually dissolve the pills in orange juice, which I've discovered masks the medicinal taste.  I opened the fridge and discovered a bottle of juice drink, which was as close to orange juice as I could get.</p><p>When I poured the 12.5 g of Nutmeg into an 8-oz glass of the juice drink, I noticed that the solution was extremely concentrated and was as a result bitter and hard to swollow.  So I dumped about a quarter of it into another 8-oz glass, and filled it to the brim with juice drink.  This produced a sweet, slightly spicy elixir which not only went down easily, but tasted very pleasant. I then repeated the procedure three more times, so that in the end I had consumed four 8-oz glasses of juice drink, each containing an average of 3.125 g of Nutmeg.  I couldn't believe that I'd completed the supposedly terrible task of ingesting Nutmeg without any trouble, and that I'd actually enjoyed it.</p><p>I drank the juice drink at around 10 p.m.  Around 11:30 (T + 1.50), I wasn't feeling anything, and I started to get bored and frustrated with the lack of effects.  I decided that there was no point staying up if nothing was going to happen, so I decided to smoke a bowl and go to bed. I took one hit and felt a really powerful, intoxicating rush.  I felt like I'd just smoked an entire bowl, rather than just one hit.  Confused, I took another hit, after which I no longer had the coordination to take another.  I put down my pipe and stretched out on the floor, feeling the world bounce up and down around me.  It was exactly like being very, very, VERY stoned, but never before had I felt so much after smoking so little.  Gradually, the effects began to wear off, and by 12:15 (T + 2.25), I felt pretty sober again - still a little buzzed, but pretty damn close</p><p>to baseline.  I figured that the really stoned feeling I'd experienced was an effect of the Nutmeg, but I figured that since I felt pretty normal again, the trip must have worn off.  Therefore, I picked myself up off the floor and got ready for bed.</p><p>Lying down, I quickly realized that something was wrong. My heart was beating much too rapidly, preventing me from falling asleep.  By 1:00 (T + 3.00), I was feeling an obvious body high, but I was exhausted - it was a lot like the comedown from LSD or from Adderall can be, where no matter how much you long to fall asleep, your body won't even think of letting you. </p><p>Around that time, the trip really began.  For me, the experience was quite similar to the two trips I've had</p><p>on Morning Glory.  The world seemed to shrink around me, and time lost all meaning.  Random, disconnected thoughts jangled through my head - it was a true mental trip, but much calmer and milder than the trip from acid.  I didn't get any visuals (other than some faint trails), but I had really intense audio hallucinations.  Suddenly, I felt as if I understood the world, and I could decipher all of life's mysteries.  I</p><p>laughed in delight, pleased with my newfound discoveries.  The entire trip I spent lying in bed, smiling and nodding to myself as over and over again I confirmed the meaning of life.  (This is not an unusual activity for me; every time I fry on acid I seem to discover the meaning of life, only to decide once again that it cannot be translated into human language, and later lose track of its essence entirely.  I had this same experience while tripping on Nutmeg).</p><p>Sometime later, I got up to use the bathroom, and noticed that it was 4:00 (T + 6.00).  I think I was starting to come down then, because I started drifting in and out of sleep.  The rest of the night was filled with colorful, extremely realistic dreams, and I finally woke up at 11:15 (T + 13.25) feeling refreshed and content.  I didn't experience any kind of hangover feeling, and I didn't notice any lingering after-effects.  The rest of that day went by quite normally, with the only difference being that I was perhaps more relaxed than I usually am.</p><p>",
 "year": "2001",
 "id": "4502",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-12-26T08:00:00.000Z",
 "views": "88735",
 "dose": {}
}
