{
 "title": "Cementing a Relationship",
 "author": "Anonymous",
 "citation": " Anonymous. \"Cementing a Relationship: experience with Ecstasy (ID 4508)\". Erowid.org. Jan 23, 2001. erowid.org/exp/4508",
 "substance": "Ecstasy",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>it was new years eve. my fiance and i just sent our son to stay with his grandma and we were just sitting in the living room deciding what to do on that particular evening. finally, he just blurted out, call 'kelly' and see if she could hook us up with some ecstasy. those words were heaven to my ears cuz i always wanted to try that. anyways, we found some and decided that we were just gonna sit at home alone and enjoy the experience together. it took about half hour to forty five minutes for the effects to kick in. and man, they kicked in like boom ya know?? i was feeling sooooo good. nothing like i have ever felt before. i felt light and my eyelids just hung on me. i felt like i was in another world, or something like that. it was so unexplainable. also i was feeling really sexy. i didnt want sex, just to feel sexual. i am only 19 and my man is 21. we have been together for a long time but we never opened up to each other. i was very reserved and shy about my body (notice i said WAS) but X took all that away. everything seemed perfect. the world, our problems, it felt like we were the only ones alive in the whole world. well, we lit like 7 or 8 candles and shut off all the lights in the house and sat in the living room on the couch facing each other and just poured out our emotions to each other. it felt so good to just talk and touch. i know because of that experience we have a better relationship and an energy between us that i can feel even now when he walks into a room. i just look at him and want to grin from ear to ear cuz we told each other our hearts desires and feelings. i wish it would last longer but when i was coming down, i just wanted to sit back and be silent and let my mind wander. let my body float into nothingness til i drift off to sleep. we did it again last night and i was up by 9 am with the kid and fuctioned as i normally do, although i felt so hyper and stuff, that kinda sucked. but i was out the door by 1230 pm to go to a job interview. i will never forget my experience with X and i would strongly suggest that anyone in a serious relationship thats having problems should definitely consider X. it literally changed my life.</p>",
 "year": "2001",
 "id": "4508",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-01-23T08:00:00.000Z",
 "views": "7397"
}
