{
 "title": "Chance at Enlightenment",
 "author": "Entre",
 "citation": " Entre. \"Chance at Enlightenment: experience with Morning Glory (ID 45080)\". Erowid.org. Sep 4, 2007. erowid.org/exp/45080",
 "substance": "Morning Glory",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "13.3 g",
  "oral",
  "Morning Glory",
  "(extract)"
 ],
 "report": "<p>I ordered 40 grams of morning glory seeds from an online vendor that claimed to be organicly grown.  My only previous drug experiences include: pot, small amounts of salvia (no breakthrough), and low doses of kratom.  I mention this because the fact that this is my first experience of this nature might change how you interpret my accounts.  I can not say how similar or disimilar the trip was to SD or shrooms for example.</p><p>Set: 2 of my friends, were with me.  1 is a very familiar friend who I enjoy being with very much and feel that we have very similar views of reality and the world around us.  I will call him N.  The other guy is a guy I know and a good friend of N's.  He will be called R.  Another friend of N's arrive later in the evening and did not partake in the morning glory experience.  He will be called J.  We were out camping at this place I found in a national forest where we were miles from any other human being.  We were next to a pond and at the top of a hill.  It is a very relaxing and healing spot that I visit.</p><p>Preperation:  We had 40g of seeds total.  I mixed them up with my coffe grinder until it seemed they wouldn't grind any furthur.  They were pretty much powder.  We put the powder into a cup and mixed it with 2x as much water by volume as powder.  We stired for 30 mins.  At this point we decided to try to filter the mess with a coffe filter.  This proved to fail fairly miserably.  Only a couple drops of water would pour through the filter each second and the process was going to take quite a while.  We ended up dividing the sludge up into 3 cups (eyeballed this).  We tried drinking the substance but found the texture and taste to be fairly revolting.  We then decided to pour more water into our cups and let the seed matter settle.  We could then drink the water without getting any sludge/seed.</p><p>T+ 0:10 - We were all laying down and feeling sickness comming on.  At this point it wasn't bad, but we layed down to help.  It progressively got worse for about 30 mins until which we were all fairly sick.</p><p>T+ 1:30 - We managed to keep everything down for this long until we all had to puke.  After this we all felt significantly better.  There was a very large body load and we were all really lazy.  We had a hard time getting the energy to collect wood and keep our fire going.</p><p>T+ 2:30 - J arrived to the area and we hadn't began really feeling any effects yet.  Our campsite is about a 15-20 min walk from the parking area and no trail exists.  I am the only one of the 4 of us who knows how to navigate the area.  By this time it is very dark out and we need flashlights to navigate the woods.  I have navigated back to the car and back with only a full moon before but I was sober then.  This time I walked about half way back to the car with R to help J find his way up to the site.  At this time I was noticing very vivid colors.  The leaves were extremely green and the ground very brown in contrast.  We made a bunch of noise until J finally found us.  Then N, back at camp made a bunch of noise so we could be sure we could get back to the camp site safely. We were fairly intoxicated by this time.  When we got back to camp everyone of us noticed that we were very disoriented.</p><p>T+ 3:30 - The peak was getting very intense by this time.  Although I don't really remember many visuals throughout the entire trip, I do remember lots of hallucination especially when I closed my eyes.</p><p>T+ 4:30 - At about this time I really have no idea when events occured relative to other ones.  Time is pretty meaningless and doesn't seem to matter.  I had an experience where I was given an opportunity to become enlightned.  White light began to surround me and I felt my soul being lifted from my body.  I am by no means religious in the traditional sence, although I do beleive in some types of buddhist teachings and enjoy contemplating deep topics.  I decided not to go at the time because I was afraid that if I did, I would become mentally insane or go into a comma.  I figured that if I ever reached that state, there was no way I would 'recover' in the traditional sence.  I could not imagine the pain and suffering my 'overdose' would cause to those who loved me and felt like it wasn't fair for me to become enlightened.  In retrospect, I am not sure what would have happened if I would have embrassed this feeling and let it absorb my soul.</p><p>T+?: At some point in here I threw up again but I didn't really care.  The nausea came back for about 5 mins very slowly then I abruptly had to puke and felt infinately better 10 mins later.  R puked a second time and N decided he probably should have puked a second time but didn't.</p><p>The rest of the night was exteremely intense 'spiritually' for me as I contemplated and came to many realizations about myself, reality and many other things I had and still am thinking about often.  I often either had my eyes closed or was completely unaware of my surroundings, body, environment.  Because I was so absorbed in my thoughts I am not really very aware of many visual or auditory changes.  I do know however that I could summon visual hallucinations on demand.  No bending walls or anything of the like.  Although I do remember thinking that our bon fire was extremely large. J who was sober at the time assured us that it wasn't that big at all.</p><p>T+ 6:00 - The tripping was still fairly intense.  Still hallucinating and having very different though patterns.  At some point around this time, I had a cyclic thought cycle which I here is farily common.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>T+ 15:00 - By this time I was still noticing very vivid colors and an interest in everything around me.  It took us a very long time to pack everything up and finally get back to the car.  It was a 20min drive back to my house.  I had to be very careful that I stay focused on the road.  In retrospect, it probably would have been safer for me not to be driving.  We all took showers and met back up in our town's downtown area. </p><p>T+ 18:00 - We had a bite to eat and a local resteraunt which tasted great.  Colors were still vivid but I could notice things getting less intense.  We saw a movie which I think I was much more interested in than I normally would have been.  I am not normally a big fan of romanticish comedy types.</p><p>T+ 30:00 - I reached baseline sometime around here while I was sleeping.</p><p>T+ 36:00 - Visuals are not quite so vivid as they were the previous day but I am still in a very good mood overall.  Not sure if this is due to the drug or not.  It feels like its pretty much gone by now.</p><p>Overall I found this to be an extremely intense experience and very constructive and helpful.  It's definately not something I plan on doing often but something I gained immensely from.  If I ever do it again though, I am going to have to try one of the extraction tecs because I doubt I will be able to control my gag reflex with that drink ever again.  Maybe if I can mix it with some drink I will be able to.</p>",
 "year": "2005",
 "id": "45080",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-09-04T07:00:00.000Z",
 "views": "5495",
 "dose": {}
}
