{
 "id": 451,
 "title": "Fear and Loathing in Eau Claire, WI",
 "date": {
  "submission": "2001-01-07T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Jeff",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I drove to Eau Claire, WI (I am a student at the University of Wisconsin in Madison) with a friend for the weekend.  It was one of those situations where a person has a preconceived expectation of an entertaining experience; the three hour car ride was filled with this sort of enthused anticipation.",
  "When we arrived, I was greeted by friends and we decided to wait until the next evening to take the acid.  By the next night we were ready.  We had two sugar cubes and two gel tabs. (One of the gel tabs, however, was cut abnormally large.) My friend was an acid virgin and decided to take only one of the sugar cubes - this left one sugar cube and the two gel tabs for me.  I had taken acid several times before and wasn't going to complain.  I was reading Tom Wolfe's 'The Electric Kool-Aid Acid Test' at the time, so I figured it would be historically clever to dissolve the sugar cubes in cherry Kool-Aid.  I remember searching the foreign kitchen for 'the appropriate glasses' from which to drink the electric Kool-Aid.  As I opened the cupboard doors, an image struck me like an ethereal sign from the drug god: two sparkling martini glasses! ",
  "The cubes took about half an hour to completely dissolve. When they did, we drank up. (The acid, as I had expected, was tasteless in the Kool-Aid.) There is a sort of mystique to taking acid, because there is no turning back.  Plus, you never really know, unless you made the acid, how much you're taking.  You always know how much weed you're smoking or how much coke you're snorting, but acid can be deceiving.  A little piece of blotter can have a shit-load of acid on it. After about a half hour, my friend was obviously experiencing some effects:  a big smile, intermittently unstoppable laughter.  He also claimed to have vague 'trails.'",
  "My acid took longer to kick in - about an hour.  And for that first hour, I had the same effects.  Nothing unusual I thought, and I was happy.  About twenty minutes later, the trip began to get slightly more intense - I began to develop what John Lennon called 'kaleidoscope eyes.'  Everything in the room began to have hints of reds, yellows and blues.  This was very exciting, and I was very happy.  Two to three hours passed and everyone (they had all been only under the influence of alcohol) retired to their rooms to sleep.  My friend did the same - his trip was obviously fairly uneventful.  I went upstairs to sit in a friend's room.   This guy lived there and is a tropical freak.  His room resembles a jungle (especially on three hits of acid).  So, I sat there and looked around.  Alone.",
  "This is when things started to go awry.  First of all, I now know it's a bad idea to trip alone unless you have something significantly distracting to do.  Secondly, this room was not user-friendly.  Oh yeah, this guy had three pet snakes, too.  Shit.  Everything in this bizarre room began to move and change color.  Simple things that normally remain simple began to take on severely different characteristics.  There were colorful, moving geometric designs in broad air.  One interesting point:  I remember thinking that, even",
  "though I was beginning to become frightened, the geometric designs you see on acid when you concentrate on something are very beautiful - they are indescribable and no artist could possibly reproduce them well enough to do them justice.  This is why I am not going to try to explain my hallucinations to you.  Other things are interesting, however, and easy enough to explain.  For example, this guy had a mural of fish, and when I looked at it, the fish were actually swimming around.  It didn't think this sort of thing was actually",
  "possible.  I had never really believed people when they had described things like this.",
  "Hallucinations can be fun.  The down side is that acid messes with your thinking process as well.  I tried to write down what I was feeling, but by the time I had written down three words, I had forgotten what I was trying to say.  It gives you a strange sense of paranoia as well.  You seem to think something bad is going to happen to you.  And you usually believe yourself.   But why not?  This is  an easy thing to do, when nothing you have seen in the past four hours has been real.",
  "After about eight to ten hours, I seemed to be peaking.  This really scared the shit out of me.  After awhile I was able to realize that it would all end in time, but minutes seemed like hours.  I wanted to sleep - my body was tired, but my mind was racing.  And, of course, I couldn't sleep, but this came as no surprise.  I remember trying however:  It was awful - the hallucinations I saw when I closed my eyes were worse than the ones I saw when my eyes were open.  I woke up one of my friends to talk with me, to keep me from going",
  "insane.  I couldn't look at him though - his face started to turn into awful things.  It would become all contorted, and his hair turned into tentacles which began moving toward me.",
  "Finally the drug wore off.  I still couldn't sleep though; I had that strange physical feeling where you're tired but you can't sleep, and you just accept it.  I was almost happy.  I remember thinking on the ride back to Madison - a voyage which was as metaphorical as it was literal; from utter craziness and a lack of reality back home to sanctuary and reality - that although my experience was very frightening, I still wouldn't call it a 'bad trip.'  I had experienced things that most straight people will never experience in three lifetimes.  I tried to tell people about it as I am trying to explain it here, but you really can't because it is an indescribable experience:  'I can't explain; you would not understand. This is not how I am.'  I don't know if I would have done it having known the consequences.   I don't know if I will do it again now knowing the consequences.  I probably will."
 ],
 "erowid": {
  "id": "1084",
  "citation": " Jeff. \"Fear and Loathing in Eau Claire, WI: experience with LSD (ID 1084)\". Erowid.org. Jan 7, 2001. erowid.org/exp/1084",
  "substance": "LSD",
  "views": "8712"
 }
}
