{
 "title": "A Delightful Surprise",
 "author": "Anthony",
 "citation": " Anthony. \"A Delightful Surprise: experience with Trazodone (ID 45117)\". Erowid.org. Dec 17, 2008. erowid.org/exp/45117",
 "substance": "Trazodone",
 "bodyweight": "140 lb",
 "report": "<p>I am prescribed trazadone as a sleep aid for my insomnia and have been taking 50mg at bedtime every night for about three weeks and have had no real psychedelic experience with it before, but a few nights ago I was bored and in the mood for a high.  Being broke and having nothing of real use to me I decided to try an amount of trazodone.  After reading up on other experiences I found that nobody had tried to snort it before.  I had little expectation that anything special would happen so I thought what the hell, little did I know I was in for a very pleasant surprise.</p><p>At about 11pm I crushed a 50mg pill and split it into two lines, I decided to start off small so I snorted one line and saved the second one for later.  As I did the first line I was surprised to find that the trazodone was virtually painless going up and gave my head a nice tingling sensation.  I waited 15 minutes without noticing any change in perception so I decided to do the second line as well.  I sat back down and began to chat online with my girlfriend.</p><p>After about 45 minutes from taking the first line I noticed that colors became more defined and things began to move in a sort of slow motion.  Objects became outlined and everything seemed to stand out.  I got up to get a drink of water and my balance was about the same as it would be after getting drunk; I had a very hard time walking straight.  At about this time my mood jumped; I became extremely happy and couldn't stop smiling.</p><p>An hour after the first line was taken I began to get a pleasant body sensation that is somewhat comparable to a low dose of heroine and my body just pulsed with good feeling.  I went to the bathroom to see how I looked and I saw that my eyes were red and my veins were bulging.  At that point I checked my pulse and found that my heart was beating a little faster than usual, but nothing fast enough to be concerned about.  After that I just sat on the couch very relaxed and watched tv for a while.  I drifted off to sleep sometime after and woke up early the next morning feeling well rested and with a lot of energy.  My lifted mood was very apparent the next day as well.</p>",
 "year": "2005",
 "id": "45117",
 "gender": "Male",
 "timestamp": "2008-12-17T08:00:00.000Z",
 "views": "66308",
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "insufflated",
   "substance": "Pharms - Trazodone",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 0:15",
   "amount": "25 mg",
   "administration": "insufflated",
   "substance": "Pharms - Trazodone",
   "form": "(ground / crushed)"
  }
 ]
}
