{
 "title": "Can't Dance, Won't Dance!",
 "author": "M. White",
 "citation": " M. White. \"Can't Dance, Won't Dance!: experience with MDMA (Ecstasy) (ID 45118)\". Erowid.org. Jan 26, 2007. erowid.org/exp/45118",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "report": "<p>I have one pill that was given to me as Ecstasy/MDMA. I had split the pill in half, and swallowed one half with some tap water.</p><p>An hour passed and I felt nothing, so I swallowed the other half with some tap water.</p><p>A Half hour passes and I still feel nothing. So I undress and lay down in bed and try to go to sleep assuming the pill was bunk.</p><p>As I lay in bed I can feel tingling sensation crawling down my back from my shoulders, then a while later I moved my head and it felt incredibly light as if the force of gravity had been reduced. I then noticed the same sensation in my arm and decidied to get out of bed as I may now be feeling the sensation of the drug.</p><p>I sat in front of the computer and put on some music with headphones as it was late at night. I didn't notice any auditory distortions, but I felt differently about the music, possibly more emotionally connected.</p><p>My limbs feel so easy to move like they had been oiled. I wanted to dance to music but I was so physically relaxed that I found it difficult to hold my body upright.</p><p>As the experience intensified I became more physically relaxed to the extent that while sitting in the computer chair I coudln't hold my head upright either, all my limbs were floppy. I ended up laying on the floor with a pillow as I couldn't support my body.</p><p>Over all I notice a time dilation through the experience.</p><p>At about 3 hours into the experience I went back to bed and went to sleep quicker than I usually do when sober.</p><p>I woke up about 7 hours later after a some of the best sleep I've had in a long time. For the next 2 days I feel totally relaxed as I did during the experience but all other effects of the drug are absent. This relaxation makes it difficult to to concentrate and focus on work.</p>",
 "year": "2005",
 "id": "45118",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-26T08:00:00.000Z",
 "views": "4110",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
