{
 "id": 4513,
 "title": "I Remember This Feeling",
 "date": {
  "submission": "2007-03-29T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Sushirawk",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "144 mg",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(extract)"
  }
 ],
 "report": [
  "My love of opiates began in 2002, when I was taken to the ER because I had a cripling migraine, and the pain was so intense that I was crying and scared I was going to die. I saw a neurologist who promised me that I wasn't having an aneurysm, or anything like that. He gave me 20mg oxycontin, and a fioricet. and wrote me a script for percocet and fioricet. 6 months later I was addicted and getting pills any way I could, I checked into a methadone clinic and detoxed in 3 months.",
  "So, one night a couple of weeks ago, I had a craving, a dream, and in that dream, I was high, and I remembered the feeling. So, I got desperate, and ordered some otc codiene from an online pharmacy in Canada, god bless our northern neighbors.",
  "I'd done my reading on the cold water extraction technique in the days waiting for my medicinal saviour to arrive.",
  "I crushed up 18 pills and added 45ml of lukewarm water, gave it a stir, and let the glass sit in an icewater bath, with a thermometer in it. Once the temp reached 40F, I let it sit for 20 more minutes, and then filtered the solution through a regular coffee filter, soaked in cold water of course.",
  "I downed the filtered solution at 9am, on a relativly empty stomach, I ate half a hotdog to start my digestive juices flowing in order to get the quickest and most intesne high.",
  "+ 0:15 - Feeling the tingle, I remember this, some anticipation, I can really feel the caffine taking hold now.",
  "+ 0:35 - Ah, Codiene bliss. Opiates rock. Music is fun.",
  "+ 1:05 - Wow, the ichies really hit me with codiene, I got them with oxy and percs the first couple of times, but then after my tolerance built up I never experienced them anymore. Call me crazy, but I rather missed them.....it wasn't ever intense, just a warm fuzzy itchiness. I feel relaxed, but the caffine really makes the codiene buzz a little less enjoyable.",
  "+ 2:00 Codiene buzz fading, still really shaky from the caffine.",
  "+ 3:00 All gone, got another batch brewing. This time I will try 200mg",
  "All in all, I liked it, OTC codiene works, I just wish there was a way to lose the caffine.",
  "Be careful, I've been through the throws of addiction, maybe not as hardcore as some people, but its no joke, I used to sit and say that heroin/opiate users were weak, and that the 'withdrawal' was just an excuse to keep using.",
  "Withdrawal is real, it is absolute hell.",
  "Best of luck to the rest of you psychonauts.",
  "sushi"
 ],
 "erowid": {
  "id": "29354",
  "citation": " Sushirawk. \"I Remember This Feeling: experience with Codiene  (ID 29354)\". Erowid.org. Mar 29, 2007. erowid.org/exp/29354",
  "substance": "Codiene ",
  "views": "22374"
 }
}
