{
 "title": "I Got a Gourd",
 "author": "The Apothecary",
 "citation": " The Apothecary. \"I Got a Gourd: experience with Yerba Mate (ID 45144)\". Erowid.org. Jun 14, 2006. erowid.org/exp/45144",
 "substance": "Yerba Mate",
 "bodyweight": "63 kg",
 "report": "<p>I got my gourd and bombilla at a local Saturday Market, and have since found a health food store which sells a variety of gourds and bombillas.  A kilo bag of mate can be purchased for $5.  I'll probably spring for one of the more expensive brands for my next bag, but even the cheap stuff tastes great.</p><p>First, I fill my gourd between half and 2/3 full (for my gourd, I use 1/4-1/3 cups of mate... weight-wise, this works out to 1-1.5 oz, 30-45 g). Next,  I slowly add cold tapwater, periodically shaking the gourd vigorously in a circular motion to wet all of the herb.  Once the herb is saturated thoroughly (no dry or clumpy bits), it's time to insert the bombilla.  This takes a little bit of practice. I don't insert it into the very bottom of the gourd, but let it rest against one of the slopes.  Once it is in place, I try it out.  If I suck up a gritty solution, or I have to suck hard to clear the gourd, then I re-wet the herb, move the bombilla, and try again.  Once it's pulling cleanly, I don't move the bombilla around or stir the mate.  It's now ready to be enjoyed.</p><p>I just keep a water bottle handy to fill my gourd with whenever I want to take a pull.</p><p>In terms of effects, mate is distinctly different from caffeine.  It is very stimulating (like caffeine), but gives me more focused energy, while at the same time being more relaxing.  It reportedly contains theobromine and theophylline in addition to caffeine.  Though vendors like to claim the vitamins, minerals, and antioxidants (which are all well and good) are the reason people prefer the mate buzz over straight caffeine; my money is on the theobromine and theophylline.  Unfortunately, I can't find any info on the theophylline content of the herb.  Making the rough estimation of 1% caffeine content and .5% theobromine content, that works out to 280 mg caffeine and 140 mg theobromine in a 1 oz gourd of mate. </p><p>Now normally, 280 mg caffeine would be enough to set me uncomfortably close to the threshold at which I get bad side-effects from caffeine.  But I've also had experience with a similar dose of theobromine (in the form of an ultra-potent homemade chocolate beverage) and found that to be significantly more relaxing, to a degree where I could reasonably see it offsetting some of the negative effects of the caffeine.  If I can figure out a convenient way to isolate it, I hope to find out what the theophylline contributes to the mix.</p><p>The high from this herb is much more recreational than the harsh edgy buzz of coffee.</p>",
 "year": "2005",
 "id": "45144",
 "gender": "Male",
 "timestamp": "2006-06-14T07:00:00.000Z",
 "views": "11305",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Yerba Mate",
   "form": "(tea)"
  }
 ]
}
