{
 "title": "Body Convulsions of Death",
 "author": "Haldol",
 "citation": " Haldol. \"Body Convulsions of Death: experience with Haloperidol (Haldol) (ID 45168)\". Erowid.org. Mar 8, 2007. erowid.org/exp/45168",
 "substance": "Haloperidol (Haldol)",
 "bodyweight": "200 lb",
 "header": [
  "DOSE:",
  "40 mg",
  "oral",
  "Pharms - Haloperidol",
  "(pill / tablet)"
 ],
 "report": "<p>My experience with haldol was the worst drug experience of my life.  A friend of mine (Joe) had been sick for a few days, and was give several tabs of haldol by a mutual friend.  The mutual friend said that haldol was an opiate pain killer [Erowid Note: Haldol is an anti-pyschotic medication and is not an opiate.] , so my friend being the happy pill popper he was took two the first day.  He said he felt relaxed and passed out.  The next day when his body aches returned, he took 3, and went back to sleep.</p><p>On the third day when I found him, he was complaining of massive body aches, and asked me to hand him some of the haldol from his desk.  I was pleasantly intoxicated on alchol and asked if he minded if I popped a few.  He said yes, so I took four.  My previous experiences with pill popping had lead me to beleive that I needed quite a few to feel any major effects.</p><p>Over the next hour and a half I began to feel drowsy and had aquired a decent body high which could be compared to percocet. I even began to itch which led me to believe it really was an opiate.  I passed out after about 2 hours, and woke up about 12 hours later.</p><p>Feeling a bit hung over and a little shakey, I went down to Joes room to smoke some bud and see how he was doing.  He was in horrible pain and was clinched up on his bed in a the fetal position.  I smoked some pot with him and then sat down to watch tv.  I was feeling better and got hungry so I ate some choclate cake that was in his fridge. </p><p>THIS IS WHEN MY WHOLE LIFE CHANGED.</p><p>About three bites into the chocalate cake my tounge began pushing against the back of my teeth, almost like I had bad cotton mouth.  I would pull it back, and it would slowly edge forward until it was pressing against my teeth.  Feeling a bit strange,  I went to my room to lay down.  This is approximately 24 hours since I had taken the haldol.</p><p>Upon arriving in my room, I was unable to sleep because of the involuntary movements of my tounge.  I drank some water and tried to relax, but it was getting worse.  Now my tounge was pushing past my teeth and protruding from my mouth.  I would have to forceably pull it back in and lock my jaw down.  Then I began to get a little bit scared.  I decide to try to completely relax and maybe I could go to sleep with my tounge stuck out.  My tounge continued to push out until it strecthed to the point it was painful.</p><p>I began to panic and forced it back in and clenched my jaw shut.  After clenching my jaw for about 10 mins., my neck began to slowly bend to the right.  Much like my tounge, I was unable to stop its movement or hold my head up straight any longer than a few seconds.  Now I'm in my room by myself, my tounge is stuck all the way out, my head is crushed into my shoulder, and I am crying because it feels like I am about to break my own neck from the force of the muscles clenching.  This lasted for four hours.  I had the most horryfying thoughts going through my head.  Thoughts of being stuck like this forever, and paranoia of my roomate coming home with his gf, and having to explain.  Finally I fell asleep.</p><p>Upon awaking the next morning, I felt fine.  I jumped up and probably did a little jig around the room. The happiest moment of my life was to be convulsion free. 8 hours later, 48 hours from the initial dose, it came back.  Just as bad as before.  I lost it.  For the first time in my life, I wanted to die if this was how I was going to be stuck forever.</p><p>I sent my buddy to the store for liquor and sleeping pills.  I was either going to go to sleep, or I was going to die trying.  Upon his return, I consumed the fifth of liqour and 12 sleeping pills.  Nothing.  Still clenched up on my bed I decided to go off the deep end. I took the remaining 12 sleeping pills and 2 pills of X I had purchased for the weekend (I was willing to try anything now). An hour later, I finally drifted off sleep.</p><p>I've spent the last 4 months of my life scared that 'they' will come back.  Joe's experience was 10 times worse.  He had been on haldol for three days, and his whole body locked up for two days.  Looking at the haldol website says 'will cause parkinsons like symptoms'.  That was no lie.  Haldol is evil, and is not meant to be abused. Please do not try it.</p>",
 "year": "2005",
 "id": "45168",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-08T08:00:00.000Z",
 "views": "13247",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Haloperidol",
   "form": "(pill / tablet)"
  }
 }
}
