{
 "title": "So Fun I Was Up All Night",
 "author": "Loki M",
 "citation": " Loki M. \"So Fun I Was Up All Night: experience with Phentermine (ID 45194)\". Erowid.org. May 8, 2006. erowid.org/exp/45194",
 "substance": "Phentermine",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "30 mg",
  "oral",
  "Pharms - Phentermine",
  "(pill / tablet)"
 ],
 "report": "<p>When I first started taking phentermine, I was 14 years old. I had never dnoe drugs of any kind before, and I didn't really know what this would do. I just knew that it was illegal without prescription and would make me 'not hungry'. I smuggled some illegaly in to the states from mexico. I wanted to be thin, and at 14, drugs were the obvious way to do it!</p><p>Phentermine makes me happy, it makes me hyper... and it makes me manic depressive when abused. I developed a tolerance to taking one pill at a time pretty quickly, so I upped the dose to two. I also took it later in the day to give myself something to look forward to at the end of the day. Bad idea. this lead to entire nights where I would be up making lists. Lists of eveything. Lists of things to do, presents to get people for christmas, presents I wanted for christmas, things I should pick up at the store, songs I should download, CD's I should buy, money people owed me... I'd do it all night. I'd clean all night long sometimes. I'd fast for days. My diet was diet coke and speed. What a druggie.</p><p>I was 145lbs to begin with. I was 115lbs when I realized it was time to stop. For someone who is 5'7'', this is not good. Because I was skeletal. But at the time, I thought I looked great. Eventually, I started to run out and had to weedle myself off of it. I was anorexic and obsessive about the drug so this was difficult.</p>",
 "year": "",
 "id": "45194",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-05-08T07:00:00.000Z",
 "views": "14586",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Phentermine",
   "form": "(pill / tablet)"
  }
 }
}
