{
 "title": "Reptilian Restaurant",
 "author": "Hunter",
 "citation": " Hunter. \"Reptilian Restaurant: experience with Mushrooms & Tobacco (ID 45249)\". Erowid.org. Nov 12, 2007. erowid.org/exp/45249",
 "substance": "Mushrooms & Tobacco",
 "bodyweight": "160 lb",
 "report": "<p>Three days ago I had been hanging out with two friends who I'll call James and Jack. Jack and I had been bored so at 11 AM we had called James and had him pick us up. We of course wanted to enjoy such a nice day so we began our search for bud. We weren't able to get any until 3 hours after we started, a few towns over. When finally at the dealer's house I decided to buy an eighth of shrooms instead of the usual weed. I wanted a little extra fun that night after work. I was told that the shrooms I was buying were quite possibly the best batch this dealer had ever gotten, and that I should trip when I am alone at home. I wasn't listening, however.</p><p>After Jack left for home and James left for work, I did the same - headed to work at 5 pm. I work a relatively easy job, which is dishwasher at a seafood restaurant. But we are located right next to Old Orchard Beach in Maine. There are tens of thousands of tourists that come each summer, so during the summer months the restaurant gets quite busy. Coming in expecting to immediately start rushing to work, I was surprised to see the restaurant at a calm pace. When I came to the dish area, there was nothing to do, not a single thing. After 15 minutes I had enough boredom - I had some magic mushrooms in my pocket and I wanted to make the night interesting. I went into the bathroom and I ate the eighth.</p><p>About forty-five minutes later and still not feeling anything, I was talking to a coworker, Shane, who was on a smoke break. I had a few drags of his cig, that is what set off the shrooms. As I opened the door to the kitchen it hit me and time started to get slower. My fellow dishwasher, whom I'll call Ron, looked like his skin was green. Usually I scrub and spray, but since there was the two of us I started to dry. The cloth on the rags we use felt so strange on my hands, and while drying buckets it felt like I was reaching a mile down when cleaning the inside. After a few minutes I headed back into the bathroom to concentrate and focus on not acting strange since I was at work. The room was much bigger, and the walls were breathing. I looked into the mirror, watched all the slight movements of my face and watched as it rotted away into that of Freddy Krueger's. My face kept stretching, as was my body - twisting up, down, left, right. I snapped out of it and decided to get back to work.</p><p>I left the bathroom and suddenly I was very tall and lean. I decided to do something I knew would be trippy - walking through the four dining rooms to collect trays. The amount of people in the dining rooms was starting to increase and I noticed it was getting much busier, all the more to make this more interesting! One of our dining rooms has stuffed animals everywhere, on the walls and a scene in which a bear and a wolf are fighting. This was very fun to look at. The bear looked as if it would tear my face off, and the giant moose head we have was triple the normal size. Returning to dishes, it was T this point when I peaked.</p><p>I decided to start scrubbing. This was interesting, as the water levels kept changing on me. First the water would be near the drain, then looked like it was going to overflow. And the amount of dirty dishes coming into the 'IN' pile kept changing also. But then when Shane came back to return some plates, he started fucking with me, knowing I was tripping. At one point he was wiggling his head back and forth and I thought he looked like a black python with golf ball sized eyes. Then I started to realize that some of my coworkers were the same.</p><p>Looking around me, I started to recognize which people I work with that were not, in fact, human. Shane was black snake, Jay was a small T-Rex with a mohawk, and the Lithuanian workers were the head dinosauroids! One of them was clearly a raptor in disguise. It was all making sense! There are creatures among us that are not human, but reptilian beings. These beings visited us in ancient times from otherworldly destinations. Their intergalactical empire, the Draconian Empire, was, and still is, planning to slowly gain control over our galaxy. Their plan is to take control over the borders, then once that is accomplished, then proceed to take control of the inside afterwards. Their race has been on the planet since biblical times. They once ran freely on the earth, but were later driven into hiding by human resistance. Since then they have been hiding and living underground. This explains demons and the myth of hell! They have extensive and advanced technology far beyond our imaginations. Capable of not only universal conquest and planetary domination, they have succeeded in time travel and transdimensional flight.</p><p>I felt as if all the knowledge and secrets of the universe were suddenly being poured into my head. I was starting to realize the true meanings of life! I started to wonder how this could be, unless I am a reptile and do not know it! Yes! That's the answer! This trip has triggered my lost memory! Somehow the mushrooms had allowed me to see underneath the human mask of flesh and see my brethren. I remember now, my mother's ancestors descended from the distant 12th planet! I am a half human half reptilian! Yes, our agents have infiltrated the pentagon and have slowly gained control of the U.S. government. Soon the humans shall be ours.</p><p>Whoa! These are great shrooms! The rest of the night passed by with ease. I slowly came down and started to realize what was actually real and what was not. But what a great trip. For three hours my workplace was filled with evil drug-running lizards and dragons intent on destroying the world behind a veil of religion. How wacky.</p>",
 "year": "2005",
 "id": "45249",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-12T08:00:00.000Z",
 "views": "4747",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "1": {
   "time": " T+ 0:45",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(plant material)"
  }
 }
}
