{
 "title": "An Enviromental Disease",
 "author": "Magicure",
 "citation": " Magicure. \"An Enviromental Disease: experience with Migraines & Psychedelics (ID 45243)\". Erowid.org. Jun 25, 2009. erowid.org/exp/45243",
 "substance": "Migraines & Psychedelics",
 "bodyweight": "170 lb",
 "report": "<p>I am a 52 year old male in Vancouver, BC. I suffered from periodic severe cluster headaches for almost 30 years. They would recur about every 2-3 years for a 2-4 month period, in 1-2 hour 'drop me to my knees' headaches occurring 4-6 times daily. I nicknamed them 'suicide headaches', and could not work or function normally during the clusters. I used dihydroergotamine (Migran), sumatriptan (Imitrex), and large amounts of ibuprofen or acetominafen in attempts to control the pain with little success. In desperation I finally targeted my diet and for one year stopped eating all meat, dairy products, chocolate, sugar, all sweets and soft drinks, and avoided prepared foods and restaurant food. I lived for that year on only beans, rice, tofu, canned sardines, canned tuna, canned salmon, granola with soy milk, fresh (raw) vegetables and fruit, and multigrain breads.</p><p>That was six years ago. I have had absolutly NO recurrence of the headaches in that time, other than a brief 1 minute 'flash' of the type of pain associated with cluster headaches, caused by ONE bite of chocolate 4 years ago. I have noticed a migraine 'aura' about 4 times in six years but no pain. I consider myself self-cured and have little faith in the medical profession or the pharmaceutical industry. I have slowly and carefully added things to my diet but it is still centered around the things I lived on for that year. I believe that cluster headaches and migraines are an 'environmental' disease caused by poisoning from eating things that only 'look' like food, but are not food. I have no evidence that what worked for me will work for anyone else.</p><p>I have used LSD, magic mushrooms, and peyote numerous times in my life. I am a moderate smoker, and have perhaps three of four alcoholic drinks per year (usually scotch). None of this had any immediate positive or negative effect on the clusters.</p><p>I think though, that the heightened awareness produced by psychedelics was helpful in giving me enough awareness of what I do (knowingly or unknowingly) to myself to give me enough clues to what I can change, and it may be that the psychedelics I've used in the past were, in that sense, what cured my clusters.</p>",
 "year": "",
 "id": "45243",
 "gender": "Male",
 "timestamp": "2009-06-25T07:00:00.000Z",
 "views": "4397",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "",
   "substance": "Various"
  }
 ]
}
