{
 "title": "'I Am Going to Die'",
 "author": "'K'",
 "citation": " 'K'. \"'I Am Going to Die': experience with Cannabis (ID 45255)\". Erowid.org. Nov 7, 2007. erowid.org/exp/45255",
 "substance": "Cannabis",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "15 hits",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>This is some weird shit, but anyways I will tell my story anyways.  I have tried weed 4 or 5 times before I freaked and had no problems.</p><p>All started like this.  After school one day me and a friend got some pretty good shit.  We were walking and I couldnt wait to smoke and we finally got to the spot and thats all I could think bout was, getting so stoned. Me and my friend passed the hitter. After about 4 hits I strted feeling sumthing and I just bursted out laughing.</p><p>It felt as I was a camera and I took a picture of my friend and everything just froze up right there. I didnt realize it but by the time we stopped, I had about 15 hits and he had about the same (and 15 hits was alot for me and I usually never smoke weed)</p><p>We were supposed to walk to a friends house but I started to feel.... Fucked up.  I sat down and I could feel my heart beating and I got really scared, it was really fast and hard. I told my friend the same and he said, yea thats fucked up. I just started thinking about all the shit that could be wrong.</p><p>I told him to call our other friend to have him come pick us up, I was fukin scared as hell. As we were waiting, everytime I turned my head a certain way I heard a theme song, this may sound weird but its the truth.  So after like 15 min we finally get picked up and I started freaking out even more and felt like I was going to die in the car and I wanted to go to the hospital, thats how scared I was.</p><p>We got back to his house and I us laid on his couch and I accually felt like I was going to die and it just kept getting worse.  I couldnt take it any longer and they wanted to know what I did because I looked so fucked up and I told my friends sister and she told everyone at their house and then I kept hearing in my head that I was going to die. I wanted to tell my mom.  I dont know why I did want to but I really thought I was going to die and I wanted to tell her  because I thought it would be the last time I was talking to her.</p><p>I called and told her and I regreted it like an hour after I said that to her.  But after about 4 hours everything was back to normal and I felt fine.</p><p>I think I could have been having a panic attack while I was high and thats what made me freak out but I'm not sure.  But from then till today, I still freak out if my heart rate is higher than it is supposed to be. But like whenever I do anything like smoke ciggs or drink, I always feel my pulse to make sure its not fuckin racing like it was when I smoked the one time.  I regret ever smoking weed and would have have taken that decision back if I had the choice.  All I know is that from then till now, I have been feeling to see if my hr is fast. Mostly everyday, all because I smoked up that one time.  What I'm trying to say is that if you really want to smoke weed and really want to try it like I did, do not smoke a lot for the first times u do.</p>",
 "year": "2004",
 "id": "45255",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-07T08:00:00.000Z",
 "views": "2218",
 "dose": {}
}
