{
 "title": "Pain Does Not Stand to Pleasure",
 "author": "windchild",
 "citation": " windchild. \"Pain Does Not Stand to Pleasure: experience with Anadenanthera colubrina (ID 45261)\". Erowid.org. Oct 10, 2005. erowid.org/exp/45261",
 "substance": "Anadenanthera colubrina",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "4 seeds",
   "insufflated",
   "Anadenanthera colubrina",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>Four seeds of Anadenanthera Colubrina were microwaved so they'd pop, which they did a little, they didn't burst, though. The popped seeds were crushed with baking soda (about 1/4 volume - usually people use limestone, but its really about being basic, not about a specific material) until they were about as fine as the soda. The mixture was wettened a little (to help the active substance solve and to soak the soda into the material), then dried again and crushed. The result was nearly a teaspoon full of brownish material. I split the material into 4 pretty long 'lines' for insuffulation.</p><p>I proceeded to insuffulate it as quickly as possible, which was 2 lines in quick succession, then a pause of a few minutes, trying to bear the pain, desire to sneeze violently, and nasty taste. My nostrils felt filled with cement at that point. I began to notice effects during the break.</p><p>Then I insuffulated the other 2 lines, with a short break in between. I laid down on the couch. The psychoactive effects were quite noticeable, but short of a real trip. Some colorful CEV's, definite trippy feeling, definite 'intoxicated' feeling, but no real trip. Runny nose later on.</p><p>Critique:</p><p>- apparently my nostrils were quite dry. That might mean the DMT wasnt solved to get into my bloodstream, and that some of the first 2 lines ended up in my throat instead of where it belongs. Later on, when my nose got runny, the effects were a little stronger. I should have split the material into several shorter lines, so that my nose would get runny quickly, and the material would stick better.</p><p>- the material should be insuffulated completely in as short a time as possible, which I just didnt manage. The pain and smell were just overwhelming. The fear of sneezing and blasting half a litre of mucous/drug mixture everywhere was overwhelming.</p><p>- maybe it could have worked better with limestone, which is a little more basic, iirc.</p><p>- the psychoactive effect was generally pleasing, extremely visual for such a low level (impressive colors)</p>",
 "year": "2005",
 "id": "45261",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-10-10T07:00:00.000Z",
 "views": "16236",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "4 seeds",
   "administration": "insufflated",
   "substance": "Anadenanthera colubrina",
   "form": "(ground / crushed)"
  }
 ]
}
