{
 "title": "Terror, Detox, Withdrawal",
 "author": "hiv",
 "citation": " hiv. \"Terror, Detox, Withdrawal: experience with Methamphetamine (ID 45262)\". Erowid.org. Nov 6, 2007. erowid.org/exp/45262",
 "substance": "Methamphetamine",
 "bodyweight": "122 lb",
 "report": [
  "<p>For starters, I'm not usualy one to spill my guts, and personal information to unkown sources. But this is a story of somebody who got caught up in an addiction and continues to feel the pain of that addiction to this day. I'm here simply to warn users of this, and any other addictive drug (is there any other kind?) of the danger they may encounter.",
  "I live in a rather high class community, wealthy and fairly clean as far as drugs go, the occasional pot, but nothing to serious. This was everything I wanted to get away from, old mentality, clean cut, downright yuppie enviroment, I didn't fit in because I myself was not high class. I was a loser, and an outcast in this school. I felt the only way I was noticed was smoking pot, and I began seriously considering taking harder drugs.",
  "I began smoking pot around age 12, and began meeting people in the bigest town near mine. I met a friend who I will refer to as L. L and I first met when he offered to throw down on a some pot with him and I gladly accepted. We were laughing and having a great time and never thought once about who we were and where we were from.",
  "L and I got to talking, and drugs quickly became a primary topic. L was knee deep in the drug business, his family was as well. He had pounds of coke and heroin coming in and out of his house weekly. He had a meth lab as well in his greenhouse. I visited L's house a short time after we had met. I quickly sank my feet into his town, meeting a girlfriend, and getting into a band with L, It all made me feel so accepted.",
  "Eventually drugs became a huge part of my life. After pot I explored the realm of Hallucingents (acid, psilocybe, mescaline). But nothing stuck with me like meth. I first tried meth at age 14. L brought out a sack after practice, and offered me a line. I insuffelated a large glassy, rough textured line, tilted my head back and... oh man this is great. Everything is such a speedy good feeling, everyone around me likes me, man I can run a marathon and clean my entire house.",
  "The drug made me a person I always wanted to be. In my town nobody liked me, and basically disregarded my exisistance in general. But on meth, I felt like everybody liked me, and everyone wanted to be near me, I was social, funny, energetic, and just a better person. I continued to snort meth everyday for about a month. After a month of constantly being high on the stuff, I tried to stop for a while, and that was a mistake. Withdrawal left me sitting in my room for days. Not leaving for fear that the police were out there, to bust me for my use of the drug. I pushed my bed against the door and sat in the middle of the room shaking for a long amount of time, barely ever sleeping. I knew what the only thing that could make me feel better was.",
  "I got to L's and began snorting again. Week after week, just trying to never be sober, not even to get high sometimes, just for fear of the crash and withdrawal. My girlfriend was enraged about the drug, and would get into huge fights with me about it. This added to my depression and uneasyness which already came with chronic meth use. I was caught between my love for her, and my love for meth. I began to lash out at the little friends I had before my meth use. Blaming them for my unhappyness, and ignoring them when they said I had a problem. I began thinking suicide, I cut my wrist numerous times, and attempted to hang myself, and even drank bleach, just to see if I would die. I was living a shallow sad existance.",
  "Eventually my girlfriend broke up with me, we couldent handle the pressure of everything going on and the relationship just ended. I was morbidly depressed. I decided to quit the drug cold turky and never come back to it again, and to deal with the withdrawal in my own way. It came on quickly, the intense paranoia, insomnia, and now intense vomiting and physical sickness as well. It all lasted for 2 weeks straight. I eventually got better, and got my feet onto the ground. Withdrawals now come once a month, I constantly crave the stuff, and I have only had a few relapses.",
  "Meth, and addictions in general are things we do to make ourselves feel better. There somthing we can turn to in our time of need. This is not a healthy way of dealing with our problems. For any other kids facing these problems, don't turn to drugs to fix them.  If your going to do drugs, use them for fun, not a fix.</p>"
 ],
 "year": "2001",
 "id": "45262",
 "gender": "Male",
 "views": "3445",
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2007-11-06T08:00:00.000Z"
}
