{
 "title": "Time Travelers on this Earth?",
 "author": "Mr. Me",
 "citation": " Mr. Me. \"Time Travelers on this Earth?: experience with Ecstasy (ID 453)\". Erowid.org. Jul 30, 2000. erowid.org/exp/453",
 "substance": "Ecstasy",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "3 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>One Thursday evening, my friend and I obtained some pills, which were called Crown Royals (if anyone else has had an experience like ours, I'd love to see it posted).  Anyway, at 11:00 PM, I ate one tablet, and my friend ate two. An hour later, one more for me, and two more from my friend. As you know, those are pretty high dosages (all in all that night I ate three pills and he ate six). </p><p>It unfolded like regular MDMA, but a very intense roll with some strange but subtle visuals.  After eating another pill, we went outside around 5 am to look at everything and chill out.  Well, we were staring across a field as the sun started to rise, and at that point I began one of the most beautiful and strange trips of my life.  I was staring at the huge pine trees lining the far-off horizon, and to my amazement, I was back in the mid-1800's. The 'trees' were actually Confederate soldiers marching in the distance - I could actually make out their legs marching and their buttons gleaming in the morning light.  Stunned, I turned to my friend and asked him if he saw the soldiers. He turned and stared at me, and confirmed that he too had the same vision.  This was only a hint of things to come.</p><p>At that point, it was about 6:30, and the sun had about risen, so we traveled to our local duck pond to check out the atmosphere.  Upon arriving, we were greeted by small ducklings waddling about the sand surrounding the lake. Of course, we both realized that these were not ducklings, but actually very tiny camels traversing their confined desert existence.  The lake itself was heaven on Earth.</p><p>The new sunlight filtered through the steam rising from the lake, radiating on us.  As I stared at the pristine fairy-taleness of it, I realized that this was the home of the Lady of the Lake.  In the middle of the pond was a small island swarming with exotic greeness and life.  Out of the corner of my eye, I saw something on the water.  Apparently a giant silver beach ball, it was swept gently by the breeze into view, slowly driting perpendicular across my field of vision and reflecting the sunlight into a thousand directions, like some ancient and beatiful alien artifact that landed in the lake.  These visions were certainly the most beatiful and astounding things I have witnessed, and are a favorite story of mine to tell.  After that, we procedeed to the library to await the opening and maybe take a little reading in. </p><p>Well, directly across from the library exists our town cemetary.  And, of course, we decided to pay it a visit.  We made a slow beeline towards the centerpiece of the cemetary, which was a 10-foot-tall, larger than life crucifix with a stone-carved Jesus hanging reluctantly from it.  Being careful not to disturb the spirits, we ended up in front of the crucifix, and we both stared at Jesus...  who, to our sublime delight and horror, proceeded to literally turn his head, open his eyes and look at us.  His mouth opened as if to speak, when my friend blurted out, 'I'm sorry!', and ran about thirty feet away.  I just stood and gaped at the hallucinations we were having.  That's about the end of the trip.  We soon thereafter went to bed for a *long* time.  Many other strange and exiciting things happened during that trip. </p><p>We both had fully lucid dissociative experiences, where we completely knew who each other was and what time it was and what we were doing, but we were sitting outside his house and freaked out because we could not figure out *where we were* for the life of us.  My friend just said 'Hey man, where are we?' when I realized that everything was the same, but completely unrecognizable to us.  We also found ourselves frequently forgetting things that happened seconds ago.  To quantify this, we often play the band name game, where you name bands alphabetically back and forth, repeating all the bands that were said beforehand.  I think we got through Anthrax, the Beastie Boys, and Candlebox before we both looked at each other strangley because we forgot what we were doing.  We visited a McDonald's, and after we placed our order, found ourselves confused as to what we were doing there and why we were giving people with the funny hats our money.</p><p>Needless to say, I've had similar experiences with Superman pills.  Three of those over the course of a night led me to a Jurassic Park in my friend's backyard, where I experienced the most vivid hallucinations of 30-feet tall, roughed-skin dinosaurs lumbering and playing in the forest.  Not to get into detail, but I also visited Tweedle-Dee and Tweedle-Dum's cottage in Wonderland.  Keep in mind that these were not CEV's, but fully waking and believable transmogrifications of reality into whatever my mind projected it to be.  If anyone runs or has run into the higher dosages of these pills, let's hear from you.  I have not matched the intensity and reality of these hallunications with mushrooms, acid, DMT, or any other hallucinogen.  It was totally unique and totally mind-blowing.  I wonder what those chemicals were...</p>",
 "year": "2000",
 "id": "453",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-07-30T07:00:00.000Z",
 "views": "5824",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
