{
 "id": 4533,
 "title": "Christmast Trip",
 "date": {
  "submission": "2007-07-01T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Blork",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>This experience was initiated through my discovery of a massive bottle of Ambien in my fathers possession.  Being a keen observer, I imediately began to research its effects.  I came up with conflicting reports, but a few commonly accepted effects.  It seems this drug causeses some effects similar to drunkeness and small doses of hallucinogens.  Above all the common thread in each report was a small, harmless case of amnesia.(that is assuming you didn't do something real bad... :) )",
  "So Yesterday I decided to give it a try.  Without hesitation I threw back to white bars of Ambien(20mg's).  I hoped into the car of my oblivious friend and we drove off to talk to my friend at work.  Ten minutes later I sat in the video store talking to my friend.  I began to notice that confusion that comes with the initial stages of a trip.  I began to laugh hysterically at random video cases and suggest possible plots of each unrelated film.  Of course my memory at this point was entirely shot, so I wasn't a bit coherent.  My friend seemed to notice something was up and remarked that he thought I was tripping :)",
  "So I coereced a friend to take a walk with me.  We stepped out into the brisk winter air as I wandered off in search of christmast lights.  I couldn't even walk straight unless I was paying concious attention to it.  The next 30 mins through an hour are a blur.  I remember sticking my face into a bush to stare at christmas lights.  Examining my shadow for a bit.  Laughing in the middle of the road.  And a random break dance competition with some punk kids in the road.  Throughout this entire period I didn't even realize I was tripping, of course this seems to be a common side effect.",
  "Some time later(probably an hour) I returned to the video store largely sober.  Well, at least I felt sober.  We went to smoke some pot at my friends house about 30 mins later.  By this point I had totally come down off the Ambien.  My high from the pot was amazing, of course it always is, so I can't really attribute it to the Ambien.",
  "All in all I had a wonderfull time.  After I had been informed that I was tripping several hours later I just threw my head back into a big laugh.",
  "The drunkeness/triping syngergy the Ambien created was a nice combination, like tripping without anxiety, and no memories or cognetive stimuli to overwhelm and frighten.  My only reservation about this drug is the very short duration, probably about an hour for the main effects.  B/c of this, I could easily see the Ambien being excessively abused.  As with all drugs, this presents the problem of damadge to your health.</p>"
 ],
 "erowid": {
  "id": "29416",
  "citation": " Blork. \"Christmast Trip: experience with Zolpidem (Ambien) (ID 29416)\". Erowid.org. Jul 1, 2007. erowid.org/exp/29416",
  "substance": "Zolpidem (Ambien)",
  "views": "22190"
 }
}
