{
 "title": "Believe It or Not",
 "author": "Experi-mental",
 "citation": " Experi-mental. \"Believe It or Not: experience with Catnip (ID 45388)\". Erowid.org. Apr 11, 2011. erowid.org/exp/45388",
 "substance": "Catnip",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Catnip",
   "(plant material)"
  ]
 ],
 "report": "<p>I am an experienced user of several of the psychedelics and am a frequent user of cannabis.  In fact, I really like to smoke cannabis every day if possible and when I can not find any, I am compelled to try new things as a substitute.  I am also a gardener and have several herbs in my garden including catnip (which I grow for my two lovely cats).  I sometimes partake of catnip tea and have experienced subtle sedative effects from it.  I had heard of smoking the leaves and flowers of the plant and tonight, being without any cannabis to toke on, I decided to give the catnip a try. </p><p>I used air-dried catnip leaves and flowers from the plant in my garden.  I started with a fully-packed bowl.  The smoke tasted much like the smell of catnip (pretty terrible) and had a minty--almost 'icy-cold'--effect on the back of my throat.  Although this may sound pleasant, it most definitely was not.  It really irritated my throat (and I'm a habitual smoker of menthol cigarettes).  The first bowl that I smoked had a definite effect, somewhat reminiscent of smoking strong datura leaves.  At the end of this bowl, I decided to pack another to get more intense effects.</p><p>The second bowl that I smoked was fully packed as well and by the time that I was done smoking it, I was definitely high.  The feeling was not unlike cannabis but really more like alcohol intoxication.  My eyes seemed to bounce around making it difficult to focus on anything.  My thoughts were clear and seemed unaffected.  Visually, I experience slightly increased phosphene activity (I was smoking in a pretty dark room and I don't expect that I would have noticed the increased phosphene activity had I been in a more well-lit environment).  I felt slightly uncoordinated as if I had a couple of beers but had no difficulty moving about normally.</p><p>In conclusion, I would have liked to smoke a third bowl to increase the effects even more but the taste and throat irritation prevented me from doing so.  In fact, the throat irritation may prevent me from doing this ever again.  However, I am glad that I tried this method of experiencing this herb and may or may not experiment with some type of extraction (ethyl alcohol should work) in order to create a more potent and more pleasant smoking experience.  I should also mention that the catnip from my garden smells SO MUCH STRONGER than the pre-bagged store-bought garbage.</p>",
 "year": "2005",
 "id": "45388",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-04-11T07:00:00.000Z",
 "views": "11971",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(plant material)"
  }
 ]
}
