{
 "title": "Mild Mood Lifter and Stimulant",
 "author": "User",
 "citation": " User. \"Mild Mood Lifter and Stimulant: experience with Catuaba (ID 45399)\". Erowid.org. Mar 13, 2007. erowid.org/exp/45399",
 "substance": "Catuaba",
 "bodyweight": "64 kg",
 "header": [
  "DOSE:",
  "1.0 g",
  "oral",
  "Catuaba",
  "(tea)"
 ],
 "report": "<p>After some tries with long periods of time between them, I finally went to consume Catuaba bark tea almost everyday. I searched the internet for info.</p><p>At lower dosage (1g approx.) the effects are not noticeable but there's a light increase in well being. Stronger dosage gives a long lasting energy, with a lower heart rate increase than the one of caffeine. Also, it lasts longer: 7 hours most of the time. Effects come on quick (1/4 hour) and then very slowly reach  a peak after 2 or 3 hours, but that part of the curve is very gentle.</p><p>Beside being mildly stimulated, I also feel calmed. It gives a feeling of emotional stability. Used with pot, it seems to reduce  paranoia. The first times I used it, I was sometimes easily irritated, but it could have been not totally related to the catuaba, as it doesnt happen anymore. It also seems to have an aperitive effect, as well as a diuretic one.</p><p>The emotional stability (which is not unlike Valerian) seems to last after the comedown, which is almost unoticeable.</p><p>I recently bought some bark. It came from Brazil while the one I had before came from Peru. The taste is not exactly the same. Brazilian bark has a color a little bit more bright and the tea is not exactly as dark as the peruvian one. But it is really close. Both as been sold as Erythroxylum catuaba.</p><p>Catuaba is useful and pleasurable. Like a light Ephedra/Caffeine mix, but lasts longer and is more friendly for the stomach lining. I didnt try high dosages and I'll probably will not.</p>",
 "year": "2005",
 "id": "45399",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-13T07:00:00.000Z",
 "views": "13274",
 "dose": {}
}
