{
 "title": "Careful with That Axe",
 "author": "The Lizard Shaman",
 "citation": " The Lizard Shaman. \"Careful with That Axe: experience with Salvia divinorum (10x extract) (ID 45398)\". Erowid.org. Dec 19, 2008. erowid.org/exp/45398",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>I am an a vetern tripper and before Salvia had become popular had grown and used the plant myself for several years. I had even made my own extract a few times before. However this was very low potency and I did not use it much as I like to use Salvia for spiritual tripping purposes primarily. That said a friend of mine bought some leaves off an online site and got a small bag of 10x extract as a promotion. This happened months ago, but figured it was good to post anyhow, I can't forget this certainly.</p><p>I have tripped many times on LSD and mushrooms and enough other things that I am familiar with the Salvia experience, even strange mixtures of Salvia and other things, however I was not prepared for what came next and was glad I had friends sitting in. The four of us took up seats around my friends room and we each took a turn smoking a bowl of the extract, nothing else, not even pot. When it came to my turn I took the first three hits and then felt the world melt away. The Salvia X-tract burns fast so a few hits and I took it all in. It was as if it melted into a drain on the other wall. I could no longer hit the bowl at this point, as I could no longer discern my arm from the bowl. In fact I was afraid to burn my self.</p><p>When I looked up at my friends things got even weirder. Everyone had gone 2D and it appeared as if my friends mouth had melted into the image of the room. As he talked it appeared almost like crinkles in a paper. I began wondering where this was going and soon closed my eyes to go the realm of visuals I knew would come. In my own head I am in more control and so I went there. Though the scenes were alot less disturbing, they weren't any less weird.</p><p>I was in a world akin to Carlie and the Chocolate Factory (the old movie, not the new with Johnny Depp). An addict friend of mine wore a black suit with back coat tails and a top hat. He looked as if the local early 20th century gentry had decided to become a circus ring master. In his warehouse were a variety of strange attractions all free of course. They had pieces of street section complete with street lamps, fire hydrants, building walls, sidewalks etc, that you could pass out on. There were all the images of how an addict might fall into squaller, yet everything was clean and sanitized, it was only the illusion of squaller. You could go there and be a 'dirty junky' but not actually be dirty.</p><p>Eventually I came out of it and looked back to my friends, who of course in the paper 2D looked cracked out and smiling (they were just laughing in real life). I looked at my friend and 'Where the hell am I?'. He said; 'Dude your right here, your with us.' and with that the cracked out world faded from reality and things slumped back from to normal leaving me with a slight itching sensation that would persist for another half an hour.</p><p>Overall, bad trip?, no, but if I hadn't been experienced in massive ego loss, and hard core tripping it would have scared the shit out of me. I think I'll stick to the leaves from now on, but damn that sure was one hell of a ride. I did not included an T+ in this entry as this entire trip happened in around 5-7 minutes. Happy tripping.</p>",
 "year": "2005",
 "id": "45398",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-12-19T08:00:00.000Z",
 "views": "2658",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
