{
 "id": 4540,
 "title": "Open and Candid",
 "date": {
  "submission": "2000-09-13T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Flotsam",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "3:45",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ],
 "report": [
  "6:20 pm",
  "This is the oddest tryptamine I've seen -- a purpleblue, almost gooey substance. I weigh out 40mg.",
  "6:30 gulp",
  "6:45 first twinges; sticky throat, stuffed up nose. Yup, its a tryptamine. Wait a few more minutes and then eat 2 slices of pizza, hoping its not too soon after ingestion to affect the outcome.",
  "7:00 teaching firebuilding to child.",
  "7:10 My heart just bloomed. It felt as though it swelled to larger than normal and then unfolded itself and blossomed within me.",
  "7:30 Heart racing. Jelly limbs. Very pleasant feeling. Sort of jovial -- not the spasms of laughter of LSD, but a satisfying all-over body smile.",
  "Suddenly realizing I forgot to check my stock of smokes before launching, I wonder about driving to the store and interacting with the clerk. I do a few mind/body checks (typing to check my manual dexterity [wpm was noticably higher without errors], a few math problems in my head, and a few vision tests like shaking my head rapidly with eyes open and then trying to snap to focus. Everything checked out, so I hopped in the truck and headed out. Noted the only visual difference the entire evening on my way to the store - depth perception seemed 'deeper'. The entire excursion went very well and I was back home in a matter of minutes.",
  "8:00 Full bore. Marvelous. Clarity of thought, although there's a bit of spaceyness to it. Moments where my whole body quivers like jello forcing me to lay down briefly... feelings very similar to significant doses of psilocybin, but not so intense as to make me question my physical existence. Feel very confident serving as ground control for Jetsam's second high dose LSD experience as I drip 4 drops on her tongue.",
  "9:00 Still going strong, but starting to wane physically. Thoughts are a bit scattered, ADD-like. Consider doing something else, but can't consider it long enough to decide what. Watching Jetsam from a distance and occasionally holding her hand feels glowey.",
  "Get the children well settled for the night (so I think) and lay on the futon with Jetsam. Sensuality overtakes us both and soon we're nekkid and writhing. It wasn't like MDMA where everything is tingly and feels just incredible; it was more like swirling our minds and bodies together. Of note to me was the indefatigable nature of my erection; very un-tryptamine-like, in my experience. Viagra's got nothin' on this stuff. ;) Orgasm was delayed and when it arrived, it came surging in like a tidal wave, completely particalizing my body and sparking an amazing kaliedascope in my mind. Wow!",
  "10:00 Getting sleepy, but my mind is still going strong. Definitely nowhere near baseline. Familiar tryptamine post-peak bowel rumblings and gas passing.",
  "A friend and I had planned on meeting over the net and taking LSD simultaneously across the country from one another. There were some roadblocks, but just after 10, we agreed we were ready. Around 10:15, I consume 2 hits of fine acid. I'm interested to see how the effects are different due to the 4-acetoxy-dipt.",
  "Sometime in this hour, one of the children experiences a major bowel movement in his sleep, requiring a diaper change involving waaay too many wipes. Given Jetsam's state, I volunteered. Let's just say the times I've dealt with bloody injuries while zooming were distinctly more pleasant than that diaper change.",
  "11:00 Found it very difficult to discern the difference between the 2 substances. The LSD is definitely coming on, but there are no G-forces or additional jelly limbs or jitters; just a very smooth transition into a similar but somewhat different space. At the 45 minute point, I would normally be in no condition to sleep, but I felt I could about that time if I decided to.",
  "Spend time going back and forth from talking/sprawling with Jetsam to the computer room and IRC. Feel the need to defecate and find that I have diahhrea also (not uncommon for me on tryptamines). Get what I can out without any trauma and continue on my way.",
  "12:00 midnight OK, I'm feeling the acid now. No sleep for awhile, it seems. I find that wondrous deep thought space that acid induces and enjoy several deep conversations over IRC with friends. Topics turn to relationships and I spend the next several hours discussing what it means to be with someone for years.",
  "Another round of diahhrea, less pleasant than the first. Ugh. Child also still agitated, so my time was busied with trying to relax, trying to get the kid to sleep, chatting on IRC, and shitting.",
  "1:00 Excellent talks with Jetsam and IRC people. The two substances combine to create a wonderfully thoughtful headspace. Body starting to shut down, but my mind is still highly active.",
  "2:00 Continued talks and more splaying on the futon. Child finally falls asleep around 2:30 and we both seem to start sinking shortly thereafter.",
  "Finally shut everything down about 3:30 and try to sleep. Sleep isn't found until after almost 2 hours of tryptamine hypnosis (which I enjoy).",
  "Awake with the children just before 8am and feel surprisingly OK. The day after L for me is usually blah and ughy feeling, especially after only 3 hours sleep, but I feel warm and open and alive. My body is tired, but my emotional state is wonderful. I felt like talking openly and candidly with Jetsam and the kids and doing so was wonderful; something we don't do often enough together."
 ],
 "erowid": {
  "id": "2943",
  "citation": " Flotsam. \"Open and Candid: experience with 4-Acetoxy-DiPT & LSD (ID 2943)\". Erowid.org. Sep 13, 2000. erowid.org/exp/2943",
  "substance": "4-Acetoxy-DiPT & LSD",
  "views": "12916"
 }
}
