{
 "id": 4541,
 "title": "Peace Colors",
 "date": {
  "submission": "2007-11-06T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "PotLuver",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "6 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>First off, I would like to start off by saying that I consider myself an experienced pot smoker. I have smoked many types of pot and have been stoned on many occasions. But I never looked at marijuana as a strong hallucenogenic drug until this one night. The night started off by me going over my best friends (we'll call him M) house. The first thing he said to me as I walked in his door was 'Dude do you wanna smoke?!' I happily abliged. We left his house with 3 other of our friends (D, S, and K). We all went to our favorite smoking spot. Our spot is a clearing in the woods by our high school. It is our favorite spot because it is calm, serene, and out in 'nature.'",
  "When we arrived at our spot, M pulled out a bag of I think 3 grams of extremely strong shit. We all sat down on a log as M proceeded to pack the bowl. As I waited for the pipe to work its way through everybody I looked around and really appreciated the beauty of our little smoking spot, nothing like being high and out in the wild at night. Then the pipe made it to me and I begin to deeply inhale some of the smoothest smoke I have ever tasted. The pipe was passed until most of the bag of weed was empty. When we were finished smoking I began to recognize that amazing feeling of being stoned.",
  "We got up and played around a little, laughing and such. It was then I realized that I was still getting higher and higher. I looked at my watch and found that only 10 minutes had passed and the weed doesn't peak until around 20. I was in for a ride. While walking back to M's house I close my eyes and find that I have amazing closed eye visuals. They reminded me of hippy like peace colors morphing in and out of different shapes. Kind of like a rainbow kaliedoscope. Then I told everyone else to close their eyes and they'll love what they see. All I heard was laughter, and shouts of joy.",
  "We finally made it to M's house I noticed that I even had opened eye visuals. It must have been going from the dark of night, and then into the light of M's house. But the second I walked in I started seeing the same 'hippy kaliedoscope' that I saw earlier. I then looked at the clock and saw that 45 minutes had passed since my first hit. We each drank a bottle of water to combat cottonmouth and then we decided to go on M's trampoline. The trampoline was the best part of my marijuana trip. We bounced around and laughed until we couldn't even breathe.",
  "We then sat down on the trampoline and began to slowly rock up and down. K reminded us of how amazing it was to close our eyes and watch the show. Somehow, gently bouncing on the trampoline began to enhance my closed eye visuals by sort of sending me on a journey. One image morphed into another and it felt like I was watching an amazing movie. We bounced around for about 15 minutes and I decided to lay on my back and looked up at the stars. I remember looking at the stars and being so amazed at how many of them there was. I began to think and think and think. Thinking about the purpose of life, The vastness of the universe, and many other things that I don't normally think about.",
  "We decided to go back in M's house to eat. I looked at his clock and saw that an hour had passed thinking and pondering. It has now been 2 hours since my first hit and I was still really high. We went into M's basement and we each quickly went through 4 boxes of cereal. The rest of the evening pretty much consisted of eating, playing with M's strobe light, and listening to music. They put on hard rock, which I hate, But at that moment it sounded so amazing.</p>"
 ],
 "erowid": {
  "id": "29435",
  "citation": " PotLuver. \"Peace Colors: experience with Cannabis (ID 29435)\". Erowid.org. Nov 6, 2007. erowid.org/exp/29435",
  "substance": "Cannabis",
  "views": "2375"
 }
}
