{
 "title": "Acid and Schizophrenia",
 "author": "Ben Straight",
 "citation": " Ben Straight. \"Acid and Schizophrenia: experience with LSD (ID 4542)\". Erowid.org. Feb 4, 2001. erowid.org/exp/4542",
 "substance": "LSD",
 "bodyweight": "170 lb",
 "report": [
  "<p>All right, I just want to let you all know that I'm writing this to perhaps guide or inform those who are curious and thinking about doing acid. First off, I've done it on around 10 different occasions. I took one hit the first time and experienced mild euphoria as well as visual distortions, and the last time I did it I did four hits, the most I've ever taken. I consider myself to have a pretty good head on my shoulders, and to be of average intelligence. As other people on this web site have mentioned, LSD can and will make permanent, marked changes to your personality based on your dosage and set/setting.",
  "The main time-frame of my life that I want to write about is about a year and a half ago, the summer of 1999. I was working at a state park in Vermont and living with a friend of mine at my father's log cabin in southern Vermont. About half-way through the summer, we decided to ride down to Hartford, Connecticut, to a rock concert to pick up some acid. We found what we were looking for soon enough, and decided to purchase 20 hits. We took two that night and had a very introspective trip, but were in our own worlds more or less, lying on the couches and listening to classical music (which was incredible). Over the next three weeks we each finished our 10 hits.",
  "Now is the part that I really want people to listen to. Upon returning to school for fall semester, I was very paranoid and didn't feel like leaving my apartment at all. All my friends told me that I 'seemed distracted' or 'preoccupied' and I felt extreme difficulty interacting properly or in an acceptable manner. I just barely passed my classes that semester and then decided to take the next semester off to 'chill out' for awhile. During this hiatus from school, I decided, on my parents' advice as well, to see a psychiatrist. Well, after an hour session with this supposedly very experienced professional, I was told that I have schizophrenia. I've been on medication for it ever since, and have not touched psychedelics (except for some pot). I never really heard or hear any voices or anything like that, I just have a lot of the negative symptoms (which means that I lack some of the personality traits that I used to have). There really isn't much more to this story, it is just to let you know that even though I probably would have gotten schizophrenia anyway had I not taken the acid, the acid probably brought it out, and if you think that in any way you might be suspect for a mental illness, you should probably avoid this drug and maybe even mushrooms and pot. I hope that my relating this experience will help someone, and I'm not saying never do acid, but be aware that it is a very powerful drug and you have to know your limits.</p>"
 ],
 "year": "1999",
 "id": "4542",
 "gender": "Male",
 "views": "28647",
 "dose": [],
 "submissionDate": "2001-02-04T08:00:00.000Z"
}
