{
 "title": "I Wish My Brother Hadn't Seen Me Like This",
 "author": "Drew",
 "citation": " Drew. \"I Wish My Brother Hadn't Seen Me Like This: experience with Inhalant - Duster (ID 45459)\". Erowid.org. Dec 20, 2008. erowid.org/exp/45459",
 "substance": "Inhalant - Duster",
 "bodyweight": "145 lb",
 "report": "<p>Ill start off by saying that I have been using marijuana heavily within the past year and started a couple of months before that. Im 16 years old and I am short for my age, about 5'3-5'4. I have started using psychedelics in the past months. I have had experience with LSD, DXM, marijuana, alcohol and combinations of these drugs.</p><p>Well last night my mom came home from shopping and I had seen she brought home a box of 4 keyboard dusters. I was talking to her and she told me that I was going to have to take a blood test the day after tommorow. This got me upset and confused because I have been smoking weed daily for a very long time now so if my mom decides to have it tested for drugs I will be screwed. My mom has found out I smoke weed but she is not cool about it at all.  She works in a methadone clinic for recovering heroin and crack addicts so she really hates any type of drug.</p><p>So after she told me this I decided that I really shouldnt smoke anymore weed until after the blood test just in case. So I took one of the keyboard dusters to my room and waited till my mom fell asleep. I was sitting in front of my computer and decided that I was going to try the duster. So I closed one nostril of my nose with one finger and inhaled through the other.</p><p>Almost immediately after exhaling I felt a tingling in my fingers and then it spread through out my body. For some reason it felt like a familiar high even though Ive never done it before. It felt as if my body was pulsing and my mind was concentrating on the high. It passed very quickly (maybe 4 minutes). This is where I should have stopped but I didnt. I took 2 hits this time and it came on stronger then before but it was the same type of feeling then I took 3 hits and this is where it got very weird. The next thing I know I found my self on the floor of my room kicking my keyboard stand and I did not remember the high that occured before that. So when I sobered up a little bit I decided to lay on my bed and I brought the duster with me. I continued to take hits up until I fell asleep I cant really remember much of it though.</p><p>When I woke up this morning I felt something very annoying in the back of my throat and I was feeling very nauseous. Then my mom and brother woke up so I waited a little until my mom went downstairs and my brother was busy on his computer. I decided Ill take another try at the drug. I took some hits and the same feeling came on and I went to watch t.v. so it wore off in about 5 minutes and I decided that I was going to do it again. Now I had really taken it too far!! I do not remember anything after this, the rest of my report is based on what my brother told me.</p><p>I think that after I took the hits I decided to go watch more t.v. and to get there I had to go through my brothers room. He said that I was walking and I fell unconsious with my eyes open rolled into the back of my head on the floor and he couldnt wake me up. Then he said I came to about 5 minutes later and I walked back to my room and then he heard another loud thud and I fell unconsious once more with my eyes open and in the back of my head. He said he tried to move my face and when he touched it my cheek was covered in my drool. I was unconsious lying next to my bed with the duster in hand (I must have been taking more and more hits). This is where I regained my consiousness and my memory came back to me. I remember my brother telling me Your drooling. Are you okay? I said Im fine and get out of my room.</p><p>I climbed up to my bed and heard my brother coming so I threw the duster under my pillow. My brother is 14 years old and this is something he should have never seen.  I know he is probably scared mentally for life because of this incident. He knows I smoke weed and drink but he has no idea that I use other drugs and I never want him to know. When I came back to being normal again he kept asking me are you okay? And I just kept telling him yea. Somehow I managed to convince him that all this happened because of a drinking binge I had the night before. Im glad though that my brother came into my room instead of my mom. I feel very mad and guilty for having my brother see me like that though. He kept asking me why did I hear the duster going off constantly? And I just kept telling him I was dusting my computer but Im not sure if he believes it or not. I was feeling VERY VERY nauseous after this and about 2 hours later I puked my guts out. It was a relief but I still felt a little nauseous. I ate food an hour later and I felt a little better. It is now about 8 hours after the experience and I still feel a little weird. This was not a good experience at all.</p>",
 "year": "2005",
 "id": "45459",
 "gender": "Male",
 "timestamp": "2008-12-20T08:00:00.000Z",
 "views": "17166",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ]
}
