{
 "id": 4545,
 "title": "Down but Feeling Sound",
 "date": {
  "submission": "2006-06-07T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ridskid",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "0.5 mg",
   "administration": "insufflated",
   "substance": "Pharms - Triazolam",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "0.3 mg",
   "administration": "insufflated",
   "substance": "Pharms - Clonidine",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "The day started with me waking early and eager to find some way to get downtown. Then I called my friend C and wanted to go downtown 2, so after 5 mins of mindless rambling C decided we should take the bus somewhere. We took the bus, got to the mall shopped for mom and dad while C mostly shopped for his younger brother, after that we went back home by a ride from my dad. C and J came over and we cracked open some cold vodka. We drank about 7 shots then smoked some joints and took some mad bong hits. J didnt do any drugs he is straight edge and doesnt do them, dont change the guy he just dont like to get high. After that we obtained some triazolam and clonidine off a friend J knew for $2.After that I went to my house and sniffed all those downers to my head.",
  "As the full effects kicked in I laid down and rested. I felt very strong wind like effects, that seemed the trough of my center of balance as my arms started to warm up like a heating pad Id often get nauseating rushes, I never puked but still to close for comfort. I also couldnt walk worth shit, my walking was poor. I had blurry vision. My thoughts were always calm and peaceful."
 ],
 "erowid": {
  "id": "29442",
  "citation": " Ridskid. \"Down but Feeling Sound: experience with Triazolam & Clonidine (ID 29442)\". Erowid.org. Jun 7, 2006. erowid.org/exp/29442",
  "substance": "Triazolam & Clonidine",
  "views": "12972"
 }
}
