{
 "id": 4550,
 "title": "Losing My Psychedelic Virginity",
 "date": {
  "submission": "2000-09-13T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Flotsam",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  },
  {
   "time": "3:00",
   "amount": "8.0 mg",
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "set: generally good headspace; moderately active day; somewhat scattered thoughts during the day, but not in a frustrating way.",
  "setting: Home, alone with Jetsam. No public/societal stimulation. Safe.",
  "summary: 2ct7, within a certain dose range, is the most mind-altering psychedelic experience I've had since the first time I took LSD.",
  "7:35p 30mg orally",
  "8:35p Drove to store for supplies. Sunset. Twinge of alteration, but nothing tangible. Very mild and wholly pleasant.",
  "9:30 Distinct feeling of going up",
  "10:00 Deep thoughts, dreamy, almost sleepy if I just lay around. Moving feels good. Noticable red-blue separation visually, but nothing I can't control. Thoughts could be examined in great detail very quickly. It was different from the spiralling thoughts of LSD. It was layered. Everything had multiple depths to it and each layer could be discerned and examined. Extremely impressive.",
  "10:30 8mg nasally. Loooong lasting dull, unpleasant burn. Within 3 minutes there is a feeling of a rush and a new level of alteration blossoms. This is somewhat deceptive, as it seemed to plateau for 5-10 minutes and I thought that might be it, when BLAM! Somewhere in the 9-12 minute timeframe, my skull opened up and pieces of my brain inserted themselves into every sensory input and then some. I could do nothing but lay back and wallow in it.",
  "For the next hour I was pretty much oblivious to my surroundings. I knew where I was. I knew how to get to the bathroom to puke (which I did often). I knew that Jetsam was dancing, got hot and whipped off her dress, and was dancing provocatively in front of me. I was definitely turned on in all senses of the word, but I didn't seem to want to 'go for it'. I was gelatin of various degrees of, uhm, firmness. I was seeing multi-vision, only much more than just crossed eyes; these were 'frames'; my visual perception was collaging still images. Oliver Sacks refers to this in 'An Anthropologist on Mars' as motion blindness. I would get 8 or 10 still images overlaid upon each other. When Jetsam would move, I would get single frozen images added to the collage without flow. I can remember trying to concentrate enough to watch the oldest frames disappear, but I couldn't manage it. I could sort of determine the new frames as they were added, but often times even that was difficult. There was no sense of Time in my visual perception.",
  "I can't be sure (my analytical abilities at that point were minimal), but I *think* that some of my nausea was brought on by trying to make sense of what I was perceiving. Working my thoughts *seemed* to bring on body stress, while just laying back and letting things wash over me was generally comfortable. I'm very uncertain of that hypothesis, but I thought I would toss it out. It left me with the sense that this substance is much less maleable as far as setting goes. This isn't something I'd want to do at any significant level in public or somewhere I didn't feel safe. On a lot of substances, I enjoy a somewhat challenging setting... I would not do so with 2ct7.",
  "One last comment on the puking... it was quite unique. I didn't have any strong abdominal contractions. I just kind of opened up and out it came. It was definitely more of an annoyance than it was unpleasant, at least until it got such that I couldn't keep fluids down.",
  "11:4x I became more aware of my surroundings -- the time, the music, able to converse with Jetsam. I was still very very altered, but felt more able to interact with my environment.",
  "~midnightish did not recognize our own child's cry... that I didn't was quite disturbing. In all my experiences with other substances at high dosages, our children's voices (especially a cry) would cut through to the heart of me and snap me to attention. I didn't even flinch at the sound until Jetsam pointed out my lack of reaction.",
  "The next two hours were a series of coming down and bouncing back up, slowly becoming less and less affected. Much like before the boost, thoughts were very layered and complex. During this time I experienced kaliedescope visuals similar in nature to DMT, but 3 dimensional and transparent and in mid-air before me. They made DMT visuals look fabricated and contrived.",
  "Around 2am we decided to try to sleep. I was suffering from a headache (mostly likely from near dehydration) and yet couldn't keep even a swallow of water down, much less an ibuprofin. So I spent the next 3 hours wishing I could come down enough to drink fluids or to get to sleep even with the ever-increasingly pain of the headache. I was finally able to drift off to sleep about 5am. Once I awoke my headache had mostly disappeared and my stomach readily accepted much fluid and then food.",
  "In summary, 2ct7 is a Powerful psychedelic. I think it has more potential than anything out lately. It should be stressed, though, that this one should be done with safety in mind beforehand... once into that space, it can be thoroughly discombobulating and I believe one could readily find themselves in a compromising situation without realizing it until later. Whatever safety net(s) work for you, employ them for this one."
 ],
 "erowid": {
  "id": "2945",
  "citation": " Flotsam. \"Losing My Psychedelic Virginity: experience with 2C-T-7 (ID 2945)\". Erowid.org. Sep 13, 2000. erowid.org/exp/2945",
  "substance": "2C-T-7",
  "views": "6504"
 }
}
