{
 "title": "A Night Dancing with Peruvianus",
 "author": "Ska",
 "citation": " Ska. \"A Night Dancing with Peruvianus: experience with Cacti - T. peruvianus (ID 45548)\". Erowid.org. Mar 17, 2007. erowid.org/exp/45548",
 "substance": "Cacti - T. peruvianus",
 "bodyweight": "168 lb",
 "report": "<p>I have had 2 experiences with mescaline now. The first wasn't too good so I will just tell you about my second. I went to my local headshop and purchased 20g of dried cactus cuttings not expecting much from them. I was just curious, I didn't dare dream of the results I would get from them.</p><p>I ground up all of the cactus in my trusty little herb grinder, which took quite a lot of effort to be honest. I then filled 47 0 capsules with the powder. I have tried to make cactus tea before but it was truly vile. The taste wasn't too bad, nowhere near the bitterness of good Kratom, but the texture was similar to that of vomit.</p><p>Getting the capsules down is a piece of cake. I can swallow 3-4 at a time so it took 5mins max. I checked the clock, it was 10:10pm. I went downstairs and decided to watch TV as I didn't really expect any results.</p><p>After 1 hour I was feeling a strange buzz, I honestly thought I was faking it though and felt bad for being screwed out of my money. Another hour passed and I was sure I could feel something, mescaline is like no other psychadelic I have taken, it creeps up slowly. It was only when I realised it was past midnight did I feel something special.</p><p>I went to my room with some considerable trouble. There I spent most of the night. I remember flashing images in my mind, random thoughts searing their way across my concious. The images weren't going by as fast as I thought they would, I could focus on them. I found myself drifting out of my body on several occasions. I went through all emotions imaginable that night. I had more euphoria than anything else but I did have terrible moments in which I thought I lost my sanity and myself.</p><p>The open eye visuals were fantastic yet subtle. People will misinterpret subtle as weak. These were not weak visuals, my bed sheets moved like an ocean with wind tearing through it, my walls were covered in shimmering aztec-looking glyphs. I tryed to focus on one blank piece of wall and found it impossible due to the intensity of the visuals.</p><p>I was lucky that I stayed in my room I realise now as several times I found myself out of my bed and in the centre of the room totally naked not knowing how I got there.</p><p>The next morning I realised with some despair that I had not slept all night. It was 6 when I went downstairs and escaped the confinements of my mind. My room seemed like it was no longer mine, but instead belonged to someone else, this other person who had seen all of the things I did. I ventured outside and instantly felt waves of cool euphoria washing over me. I spent the rest of the morning in a brilliant haze, all visuals had gone but I felt as if in the night I had been cleansed. All of the tainted parts of me had been purged in a movement of my soul.</p><p>I know that I am not a person who can eloquently describe the feelings and images of this trip but I honestly can tell you that thinking back to it brings a very real tear of happiness to my eye.</p><p>On a final note, I am only 17 and I feel that not many people can say that they were lucky enough to experience mescaline at this age. For this reason I really do feel as if I was chosen by the cactus. It called out to me because it sensed I needed to be cleansed, something that I could not do alone. It leant me strength.</p><p>Peace Out,</p><p>Ska</p>",
 "year": "2005",
 "id": "45548",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-17T07:00:00.000Z",
 "views": "4541",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 g",
   "administration": "oral",
   "substance": "Cacti - T. peruvianus",
   "form": "(capsule)"
  }
 }
}
