{
 "title": "Trapped in a Loop",
 "author": "Enjoi",
 "citation": " Enjoi. \"Trapped in a Loop: experience with Salvia divinorum (20x extract) (ID 45580)\". Erowid.org. Nov 2, 2007. erowid.org/exp/45580",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "smoked",
  "Salvia divinorum",
  "(extract)"
 ],
 "report": "<p>INTRO: I am an 18 year old male and have recently been experimenting with different types of mind altering substances. I have smoked MJ almost daily over this summer and occasionally during the school year before. I would not consider myself an experienced drug user. I have tried an average dose of mushrooms, LSA and 2CI as far as psycedelic drugs go. I have also taken many different types of pharmaceutical drugs, oh and ether as well.</p><p>Ok, so after having an interesting mushroom trip for my first time I was eager to try another substance that would make me hallucinate. I had heard from friends and read online reports about Salvia and how you could get visuals from this. Me and a few friends had accquired some rather expensive 20X salvia extract from a local headshop. Right after we got it we went to one of my friends house to smoke it. Me, Matt, Zack, and Henry (obviously not real names) went out onto Matts back porch and sat down to smoke.</p><p>It was a very warm muggy humid day outside and the sun was shining. I placed a small ammount of the salvia extract into my glass pipe and discussed with my friends who should take the first hit. They decided it should be me, I was somewhat nervous at this point and realized I didn't exactly know what to expect, and what happened next I never could have expected.</p><p>I took one hit and held it in as long as I could. Immediately I felt my body temperature rise and a strange feeling in my arms, I felt horribly sticky from the hummidity but it was abnormally uncomfortable and I began tugging on my shirt. I began to laugh uncontrollably and slobbered on my pants on accident. I saw no visuals and didn't feel all to different.</p><p>So I packed up the bowl again with alot more than the first time because this time my friend Zack would take a hit after me. I lit the bowl and breathed in deep. I held in the smoke and passed the bowl to my friend who did the same. We both exhaled and started to stare at each other. Right away I started getting hot again but this time it was alot more intense. My friend started laughing histarically and so did I.</p><p>This is when things got scarry. I felt as if I was being pulled into the chair I was sitting in and I could not stop laughing, but I wanted to so bad. My friend seemd to be experiencing similar effects. As we looked at each other and laughed I felt as if we were each a spoke in a wheel and were spinning. The laughing was the way the spinning got going but I felt as if it would never stop and this scared the shit out of me. I started panicking and my mouth felt very odd, I felt as if my whole existence was for nothing, such a stupid thing, to be a spoke in a wheel that wasn't even visible, all I could do was feel it there. This loop had to be broken and my friend Zack luckily felt the same way and told me to go inside all while still laughing uncontrollably.</p><p>I immediately stood up which felt very wrong and difficult to do, and asked him why he told me to go inside, hoping he would say 'to break the loop' or something to that effect. He didn't say anything he just kept laughing. I was told later that I was talking very loudly at this point. I opened the sliding glass door and walked into the house. The AC felt good but I was still very altered. I just wanted to lay down. It was like something was pulling me to the ground. I crawled on the ground and felt like a complete idiot, everything that I felt at that point seemed wrong. Nothing was right, the texture of the carpet was completely foreign and rough. The whole time all of this was happening I remember just thinking how could this be real, this cant be happening, how can I prove its not real?!</p><p>I layed on the floor for a while still stuck in my state of dillusion and heard my friend Henry say he would make a sandwich. I figured this salvia should be wearing off by now so I will try to make one too. I was extremely hungry at this point. Making a sandwich was so hard, I could not for the life of me get a single slice of ham, I couldnt pick it up. I had to rip at it to get any out of the package and it was the most frustrating thing I had ever experienced, still very much in an altered state of mind but trying to perform normal activities.</p><p>Suddenly everyone traveled downstairs to Matts step brothers room who was gone at the time, I layed on his bed and my friends started going through his stuff looking for something. I wanted the feeling I was having to end, but it wouldnt stop, I kept thinking, oh ok im back to normal, then I would see that I was not at all. I remember getting angry and yelling at my friend Matt to get a kinfe.</p><p>I remember this part so clear. I yelled at Matt to go and get a butter knife so that we could get his step brothers safe open, he seemd to not listen to me so I yelled at him over and over again until he finaly left and got the knife. Later I apologized to him for yelling and he told me that none of this yelling had happened.</p><p>When I finally came down completely I felt somewhat stoned and more comfortable with my surroundings. I couldnt belive what had just happend to me. It was the most intense and copmletely un-explainable feeling in the world. I felt as if there was nothing that will ever make me feel the way I felt at that time. I sat down trying to comprehend what had happend and make something from it but found it difficult to do so. I only had bits and pieces left in my memory from the experience.</p><p>I went to work shortly after coming down from the salvia and felt kind of depressed. I felt there was no need for me and that it was pointless to work. I felt this way for the rest of the day and slept good at night. The next day I woke up back to normal, no depression.</p><p>CONCLUSION: After experimenting with this insane substance a few times after my initial experience, everything about it seems wrong to me. The way it makes me feel, the sound it makes when it burns, the harsh smoke when I breath it in, the places it takes you to. I do not like it all but yet it intrigues me so much  that I would reluctantly try it again. To be honest, it scares me to death. I would not recomend it to anyone unless you are prepared to have you ego and everything else you know completely ripped away from you.</p>",
 "year": "2005",
 "id": "45580",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-02T07:00:00.000Z",
 "views": "3158",
 "dose": {}
}
