{
 "title": "Depression and Withdrawal",
 "author": "Gianlucapaul",
 "citation": " Gianlucapaul. \"Depression and Withdrawal: experience with Venlafaxine (Effexor) & Bupropion (Wellbutrin) (ID 45594)\". Erowid.org. Jun 27, 2007. erowid.org/exp/45594",
 "substance": "Venlafaxine (Effexor) & Bupropion (Wellbutrin)",
 "bodyweight": "220 lb",
 "report": "<p>Note:  I took Trazodone and then Seroquel for the ever-present insomnia, but not concurrently.  I'm not sure either one affects this scenario, but I have no proof other than my feeling.</p><p>I've had several slides into depression in my life and didn't really realize that I had depression until 3 years ago when I went to the doctor at the behest of my girlfriend at the time.  They said I was most likely experiencing a severe depression and they suggested I see a psychiatrist.  I went to a psychiatrist and we talked for a while.  She started me out on some SSRI's and for the most part they were ineffective. </p><p>After some switching around we found that a combination of Wellbutrin and Effexor were pretty effective at keeping a chemical balance that allowed me to eventually become more mentally stable.  I don't advocate any drugs, but they really helped me at that time.  I read in The American Journal of Psychiatry that sugar pills were more effective in counteracting depression that SSRI's.  In actual clinical trials placebo's worked 'better' (that's the word I keep seeing it's pretty subjective though) than sugar pills. </p><p>I'm a pretty big believer that a large segment of the depressed society does not have a chemical basis for their 'depression.'  For this type of depression all of the symptoms are caused by the person's thoughts.  They don't like what they see, hear, or whats going on in life and their thoughts make them feel hopeless or sad.  The difference between that and a person with the disease I feel is a chemical one.  The person with chemical depression can really not get out of their depression without a little chemical help.  They also have the negative mental thought patterns but that may be a symptom and not a cause.  Depression is a very physical disease and after feeling bad for a long time negative thinking can really take over.  Even if the symptoms are reversed chemically the thought patterns still remain.  The hardest part of depression for me has been that mental shift of one to rational acceptance of life.  While in a really depressed state I couldn't look at life rationally and I was angry when I wasn't sad.</p><p>SSRI's to a degree flatten me out and are not pleasant, but Effexor was very effective at providing a little kick (as was Wellbutrin.)  I referred to it as coke to myself because it forced a positive mentality on me.  I realize the irony of that concept after experiencing the withdrawal.  I really started to feel that life was good and that I had been cured.  I was tapering off and I could feel the depression start to return along with various other really unpleasant side effects.  The first three nights on the smaller dosage I did not sleep.  The lack of sleep may have been worse than anything really. </p><p>By the end of the 3rd night I was pretty desperate and felt terrible.  I took a whole bunch of the Seroquel and smoked a couple of large bowls which is what finally knocked me out.  For the next four weeks I had opium-like stomach pains, moderate depression, and a lot of trouble sleeping.  It basically felt like depression with stomach cramps and a headache.  Ive heard about vision problems, ones that I experienced, but at the time assumed were from heavy psychedelic use in the past.  I would cry on the drive to work because I didnt want to go.  That wasnt a large part of my depression before and suddenly was in the weeks following the cessation of Effexor.  I eventually overcame the withdrawal, followed shortly after by my fianc moving to another country, and then losing my job.  This led to a lot of soul searching and hallucinogenic eating and they are really the tools which helped me gain a positive way of looking at the world. </p><p>I feel like I will always have the chemical aspect of depression.  My neurochemistry is just not quite right, but I will be alright through this disadvantage from what I have learned to value and what I have learned to think.</p>",
 "year": "2003",
 "id": "45594",
 "gender": "Male",
 "timestamp": "2007-06-27T07:00:00.000Z",
 "views": "14958",
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Trazodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
