{
 "id": 4561,
 "title": "Lunatic Excursion",
 "date": {
  "submission": "2007-05-22T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "SuBtLeFuGe",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "<p>The night started off quite regularly. I had been riding in a beaten-up Mazda for several hours with my friend (let's call him Lex) trying to find the equipment to satisfy our plans for the day. The idea was: we'd have black lights galore, tons of rave toys to entertain ourselves with, ten hits of acid (naturally), and a few drug-driven movies to watch.",
  "Shortly after meeting up with our friend at a pre-concert tailgate party at around 6 PM, we acquired our first and most important item...the acid. Something described to us as 'Pink Elephant' by the local dealers. It came on blotter paper and sealed in a ziploc bag. We were promptly instructed to keep it out of the light. Whether this was for protection of the acid, as they asserted, or protection of themselves, we didn't argue. I stuffed the acid into my back pocket and proceeded to buy a beer from one of the vendors. After perusing the event for about thirty minutes, we decided to leave and make the journey back to Boulder (my home town). Along the way, we called a few friends who had also planned to trip that night, with mushrooms being their substance of choice, to get the blacklights and glowsticks. With that taken care of, it was just a quick drive to Blockbuster and we were prepared.",
  "Back at the apartment, Lex and myself proceeded to entertain our drug-crazed guests as best we could. Fortunately, given their state of mind, they would have been content trying to make conversation with a stapler, so we didn't need to strain ourselves. We decided to eat our shares of the acid on the spot, being that our friends were already warming up to their oncoming experience. After a bit of an argument over the sparse contents of our nearly emptied stomachs, we elected to take 500mg Vitamin-C pills, two at a time for the next several hours. Lex being the acid veteran, he insisted the vitamins would make for a better trip. I had no choice but to agree. After all, why trip if you're not going to TRIP?!?",
  "The hour of seven found me in a state of daze, turntables rotating furiously as I attempted to cope with the rising jitters that accompanied the dose. The music in my headphones sounded unusually clear, and seemed to reverberate throughout my head. My extremities were noticeably numb, and the only thing bigger than my apprehension was the dumbstruck grin on my face. I was nervous. Not twitchy as one might expect, but I had never indulged in this quantity before. So, needless to say, I was excited to see what lay ahead.",
  "As my watch passed eight(T+01:00), the sun was descending and so was my ability to commit to rationality. I felt as though someone was tugging at a string that ran down through the top of my head, and that was all there was to keep me on two feet. My body was vaguely responsive to my commands, but all the while I felt as though there were energy waves moving through me, dictating my motions. Tired of spinning and curious to explore my now less-familiar apartment, I threw LTJ Bukem into the player and slunk away to my bedroom.",
  "As I had expected, the visuals were not wholly intense at this point, but I noticed that if I stared at certain objects for any length of time, they would bobble and shift slightly. I decided to stretch my tense muscles for a bit and attempt to meditate. After about ten minutes I deemed it a lost cause. I had been easily able to focus on previous mushroom trips, but my current state proved too energetic for me to remain calm.",
  "After a few minutes spent in stark confusion, I resumed my activities in the living room. My friends were involved in a heated debate about how the smurfs should be politicians. Interesting, I thought, but hardly substantial. I loitered for a few minutes, unable to sit down, and then proceeded to aimlessly surf the internet for the next fourty minutes.",
  "Just as I signed off, at about T+2:00, it hit. The torrential swirling replaced the overpowering glare of the computer screen with innumerable shades of iridescent colors that blew me back in the chair. I stared in awe as the bare wall shifted and shimmered, eventually turning to dust and fading from view. Excited and determined to experiment, I migrated to the bathroom, where I stared at my slightly shifting face until I was satisfied the reflection was, in fact, real. Next came the blacklit living room, where my fellow space cadets were occupied shooting nerf weapons at each other.",
  "Fighting through the chaos, I decided to play a video game. My unfortunate choice was 'Sega GT' on the XBOX. I played for a half-hour, and six wrecked Audis later, decided to give up anything involving coordination. I instead went outside into the mellow summer air for a smoke, and watched the fading sunlight disappear behind the grey-shaded mountains. This was definitely a high point in the trip, as the slightly rotating clouds and varying reddish and purple hues captivated me. Once the sun had set, I went back inside to be greeted by two cloaked figures toting glowsticks and LED hand lights.",
  "The display was intriguing. The spiralling light sources left trails that appeared several feet long. Being an avid raver, and having never seen glowsticks present such charisma, I was left speechless. All I could do was stand and stare. The lights seemed to carry a certain emotional connotation that changed with the shades. This is a difficult feeling to relate but basically, I was 'feeling' colors. Yellow elevated my apprehension, blue calmed me, green gave me a sense of energy, red made me uneasy, and white blinded me, leaving light-blue dots imprinted in my vision.",
  "Though the lights were interesting, I decided it would be best if Lex and myself went for an excursion. The clock passed ten before we were ready, and we left the apartment with assurances echoing from the peanut gallery that they wouldn't 'fuck up the place.' This gave little comfort, but we were too energetic to be held back. We donned the cloaks that formerly were worn by the light show duo, and ventured out into the wild.",
  "The scence in the parking lot was somewhat frightening. I wanted to talk to everyone, but knew that many wouldn't share my enthusiasm with hallucinogenics, and may end up reporting something to the authorities. This considered, we took the paved path that lead out to our local golf course.",
  "We were two acid-tripping imbeciles stumbling around a driving range at 10:30 PM, in cloaks, no less. I felt awkward but somehow open. The next two hours were spent quite constructively, with discussion involving everything from political policies to the stupidity of the act we were indulging in. What followed has stayed with me for quite awhile. Lex turned to me briefly, a look of ardent enthusiasm on his face and exclaimed, 'Dude, you know what's an awesome word? GLOOP!!! It's like glop and soup combined! Doesn't that sound awesome?!?'",
  "Now if I had been high, this may have triggered more of a response, but all I could do was smirk. I was amused, certainly, but I also couldn't help but fear for the sanity of mankind. I eventually succumbed to giggling and after five minutes, our conversation rotated exclusively around our newly created word. This could only have been upstaged (which it was) by our crusade to find and capture the missing 'moon nuggets,' which to any normal person would have resembled golf balls.",
  "So, at about 1:00 AM (T+06:00), our pockets loaded with thirty-nine total golf balls (yes, we counted them), we arrived back at the apartment. To our surprise, the mushroom children were huddled on the floor, clinging to a few oversized bean bag chairs, watching 'Fear And Loathing In Las Vegas.' Satisfied that our night had been a productive one thusfar, Lex and I joined in the ordeal and watched intently as the movie seemed to make less and less sense by the minute. By the time the movie ended, circa 2:20 AM, I could feel the acid beginning to wane in intensity. For the next several hours, we sat and watched the blinds covering the screen door, as we could discern rainbow-like patterns emerging from the cracks between them.",
  "Time passed, and Lex proceeded to describe his surroundings. The black lights appeared to take the forms of shimmering purple skulls, as he described them, and he eventually began laughing at a vampire supposedly trapped inside an 'Ocean's 11' poster. I would have expected this to cause a bad trip, but he claimed to be far too happy to have complications. The darkness gradually relinquished its hold on us as the sunlight crept over the horizon. After smoking a few cigarettes and chatting about various subjects, being that we were the only ones left in the apartment, we decided to go to sleep, which proved more challenging a task than it sounded. Three hours after beginning the attempt, I finally dozed off.",
  "The next day was a bit hazy, and contrasts were enhanced, but otherwise I felt great. For that matter, I felt as if I had been somehow enhanced spiritually by the experience. Whether it was the moon nugget hunt, or the magical exploding wall, I couldn't be sure. One thing, though, I WAS sure of. Next time, I'm trying it at a rave. Should be interesting.</p>"
 ],
 "erowid": {
  "id": "29489",
  "citation": " SuBtLeFuGe. \"Lunatic Excursion: experience with LSD (ID 29489)\". Erowid.org. May 22, 2007. erowid.org/exp/29489",
  "substance": "LSD",
  "views": "3475"
 }
}
