{
 "title": "A Great Combo",
 "author": "anonymous",
 "citation": " anonymous. \"A Great Combo: experience with Kratom, Cannabis & Caffeine (ID 45624)\". Erowid.org. Oct 13, 2005. erowid.org/exp/45624",
 "substance": "Kratom, Cannabis & Caffeine",
 "bodyweight": "130 lb",
 "report": "<p>T0:00 3:15</p><p>I just filled up a tablespoon (about 14 grams), tilted my head back, and tossed it all in. Chugged coke until I got it all out of my mouth. Not too bad (but not good tasting by any measure). I think it would be worse mixing it with anything as it kinda clumps together (plus changes whatever the substance is too a greenish/brown mush.)</p><p>T+10 minutes</p><p>Starting to feel something. A little relaxed, seems to have relieved some fatigue I was feeling and I feel like my brain is a bit sharper. Nice so far.</p><p>T+20 minutes</p><p>Strong desire to work. Play guitar, write songs, anything creative sounds fun. Listening to music. Very clear-headed. Smoked a few puffs of MJ from a pipe to spice things up a bit.</p><p>T+25 minutes</p><p>Wow, what a difference. I think Kratom should have MJ to go with it. It's very synergistic.</p><p>T+30 minutes</p><p>The effects have gotten stronger. My body is warm and fuzzy but my mind is still sharp and relaxed. Coffee sounds really good. So off I go. Will probably sprinkle a little Kola Nut in it for a stronger cup of java.</p><p>T+40 minutes The warm and fuzzy is still increasing. Feels like a low dose of MDMA body wise. Rubbing, stretching, scratching are all more pleasurable.</p><p>t+60 minutes  I think I'm peaking now but it's very subtle. Feels good, I'm very talkative, more patient and understanding with people. Mind is dulled a bit now, I think from taking a tad too much, but this is enjoyable for sure.</p><p>4:27</p><p>I can tell this will last a while. I could take a great nap, but I think MJ and coffee will be the way to go. I'm actually enjoying playing my guitar scales ;)</p><p>4:36</p><p>Next time I will probably take a little less. I enjoyed the stimulant effect. I higher doses Kratom acts as a CNS depressant. Plus it's expensive :) Still felling groovy though. ANd still playing scales :P</p><p>4:56</p><p>Kinda blurry eyed. Not really a strobe effect, but it feels like my eyes are slowing crossing and then straightening out again (slight double vision). Doesn't bother me though.</p><p>Overall this felt kinda like codeine. A good body high. I doubt this will be legal in the states for long. It's by far my best bet for a legal high that is safe. A good special occassion drug. Not one to be used everyday (I imagine it could be mentally addictive).</p>",
 "year": "2005",
 "id": "45624",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-10-13T07:00:00.000Z",
 "views": "9679",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 Tbsp",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 0:20",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 0:30",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  }
 }
}
