{
 "title": "When the Sunset Is Dripping Off of the Leaves",
 "author": "Tucker",
 "citation": " Tucker. \"When the Sunset Is Dripping Off of the Leaves: experience with Mushrooms & Cannabis (ID 45648)\". Erowid.org. Nov 27, 2007. erowid.org/exp/45648",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "210 lb",
 "report": "<p>It was the middle of a beautiful Spring in my home of Northern California. There were some very intense and potent shrooms going around my circle of friends, and although I hadn't tripped with anyone on these yet, I had attempted to buy some but we had gotten busted by the cops a little ways earlier and my buddy with my shrooms on him got arrested, as I escaped with my friend Cody.</p><p>Anyway, Cody had an 8th of these shrooms left, and we decided to take them sometime in the afternoon. We split them in half and ate them, downing it with a couple of glasses of orange juice. We then went to the backyard and I brought my guitar and we started just talking and playing guitar and all that good stuff. It didn't take long for these particularly gnarly shrooms to hit us. My dog was in the backyard with us, and is a big, hyper, obnoxious, but beautiful, German sheperd. Within ten minutes her coat began to glimmer and and shine more vividly. My fence and the very rich red-orange wood of my patio began doing what things usually do on mushrooms, that is they started glowing and melting.</p><p>After amusing ourselves with how terrific everything looked for a while, Cody and I decided to get ourselves moving because people were supposedly going to be home soon, although I found out later no one was there all day--oh well, it was for the better. We wound up with a bit of couchlock and watched some amazing stuff on the HD channel. Now for the first great part of this. Cody needs to get up to go to the bathroom, so he excuses himself and heads off to my bathroom, and my dog peacefully follows him. Usually my dog is an annoying and all around awful dog, and she's big and strong so there's not often anything I can do about it except for expend a lot of energy before I either grow frustrated or I actually get her in the backyard.</p><p>However, my dog followed him without a bark, a jump or anything. A few minutes later Cody reappears into the room and reveals to me that he had a 'connection with my dog'. I laughed. 'Really? Like how?'</p><p>'I don't know, man. But I told her to sit there, and she did. She didn't jump or bite or do anything like that this time. We just had a connection...you know.'</p><p>'Cody...you're on mushrooms'</p><p>We both laugh for some amount of time at this. Anyway we finally leave after easily getting my dog outside and head over to a small little place where we're regulars, affectionately coined 'The Mexican Bakery' by most that know the place. There are a few chairs and a table out front, real old ones with some real character. At this point the mushrooms were coming into full effect and everything was purely beautiful. I felt like I was in a movie, and our converations were just like we were in a movie as well. Cody and I were having conversations about the most complicated and yet simple things, about everything. From how mechanical trucks are to why people laugh. There were no breaks in our conversation, we were both so intensely interested in what one another had to say and there were no 'uh''s in our speaking. We were having completely uninhibited communication between our brains, which is even more odd than usual since we generally are high when we hang out.</p><p>Anyway, Cody's girlfriend was tripsitting us and she went inside and got me a very strange candy from out of the bakery. I didn't eat it for a while but when I did, it was amazing. It was so unlike anything I had ever eaten, on shrooms or not. Still is, and it always reminds me of this trip. We sat outside of that bakery for about 40 minutes talking and talking before I asked Cody 'What time is it? Our trip must be almost over by now. It's been forever.' Well Cody tells me that it's only been forty minutes, we laugh and thank the heavens that our trip has only begun. After a lot more conversation, we move on to a Mexican taco/burrito kind of place (the best in town) and sit down on a bench outside of it, where we meet three other kids.</p><p>Now this is interesting. Like I said, we were intensely eager to learn and loved finding things out. I just played guitar and smiled, as I had been doing out front of the bakery. I got to know these kids a little by talking to them, but the information I got from them taught me so much about them. They all came off as such great kids, all having a good but tiring day tubing at the lake or something like that. We talked for a long time, and even better, the sun was beginning to set.</p><p>A sunset on mushrooms is terrific. A sunset on mushrooms on a small, quiet, familiar and clean shopping center was amazing. The buildings all glowed with a vivid orange, and the leaves around us were dripping with this lovely orange color. The entire sky was orange and an orange glow was cast over the freeway next to us. The bench we were sitting at was old and weathered, and the chipped pieces of paint and wood grain flowed like a river across the top of the bench.</p><p>Later on we briskly walked to Cody's house where felt inspired to talk to his mom about his marijuana habits that night so he didn't have to hide it any more. I did the same with my parents and things got a lot better for us as a result. Anyway, I had a great conversation with Cody's girlfriend (who's also a close friend of mine) and watched some of a movie called the Corporation, which blows my mind, especially on mushrooms. That night Cody and I wound up smoking a lot of bowls out of my very hard hitting steamroller with one of our friends, and our trips came back a bit. It was a great trip, the best one I've ever had.</p>",
 "year": "2005",
 "id": "45648",
 "gender": "Male",
 "timestamp": "2007-11-27T08:00:00.000Z",
 "views": "2727",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
