{
 "title": "Absolute Amazement",
 "author": "NUSHAman",
 "citation": " NUSHAman. \"Absolute Amazement: experience with Salvia divinorum (leaves) (ID 45653)\". Erowid.org. Nov 28, 2007. erowid.org/exp/45653",
 "substance": "Salvia divinorum (leaves)",
 "bodyweight": "140 lb",
 "report": "<p>This report could describe one or all of my salvia divinorum experiences. </p><p>I have always been very open minded about drug use, and had tried numerous substances including marijuana, psilocybin, methadone, mescaline, and numerous pain pills.  However, my brief and relatively shallow experiences with hallucinogens sparked my interest in the actual magic behind these substances.  Salvia, however, exists on a totally separate plain from anything else that has made you trip...ever.  No exceptions, except possibly DMT but I have never experimented with that. </p><p>I am extremely receptive to salvinorin-A.  The effects I obtain from 1-2 hits of unenhanced, natural leaves are comparable to 1-2 hits of 7x extract for a normal person.  I always smoke out of a small, inexpensive waterpipe with a straw and the bowl coming out of a rubber cork you push into the glass chamber.  Very cheap, yet very effective.  After loading the pipe I normally find a quiet, dimly lit room to sit in, but the experience is mindboggling no matter the set and setting.  I light the bowl and inhale deeply, normally until my throat can't take it anymore.  I then hold the hit in for a few seconds, allow my throat to cool off and then continue inhaling smoke without letting the first hit out.  I normally inhale until I simply can't anymore, and then I hold it in as long as possible.  It is during this time that the effects rapidly begin to take hold.</p><p>The onset effects are most noticeable with eyes closed.  Closed eye visuals begin to unfold and increase in complexity and vividity very rapidly.  However, what I see is nothing compared to what I feel.  Normally there is a feeling of utter amazement at how truly immersive the experience is.  I can actually feel my mind being pulled out of my skull(pleasant not painful) and relocated in a kind of fairy-tale world.  It is during this time that I attempt to overcome my absolute amazement for just a moment to finish off any remaining salvia in the bowl.  Opening my eyes reveals intense open eye visuals.  This is impossible to describe in words.  The term 'open eye visuals' is not accurate.  Things do not necessarily look different to my eyes, they seem to look different as registered by a different sense, a sixth sense (3rd Eye, Perhaps?) that can feel the presence of magical beings in such incredible detail and intensity that I truly believe that I am seeing them.</p><p>I close my eyes again and these feelings become full-fledged closed eye visuals, accompanied by an intense cerebral overhaul.  Phenomena such as becoming a different person, communicating with strange beings, and traveling back in time are not only possible but probable.  Imagine seeing a strange woman whose body is composed entirely of alternating red and white cylindrical segments, contorting her legs to spell out words to you.  That is her form of communication.  What is mine?  It is difficult to say.  All I know is that when I put my pipe away after the effects have worn off (5-10 minutes after smoking), I feel as though I am securing a magical portal into my own fairy-tale world, infinite in expanse, unequaled in complexity, and unrivaled in mystic energy.</p>",
 "year": "2005",
 "id": "45653",
 "gender": "Male",
 "timestamp": "2007-11-28T08:00:00.000Z",
 "views": "3733",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 }
}
