{
 "id": 4566,
 "title": "Extreme Paranoia",
 "date": {
  "submission": "2007-11-06T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Chicana",
  "gender": "Female",
  "weight": 49
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "tablet"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "4:00",
   "amount": {
    "number": "1",
    "unit": "tablet"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I have take x approximately 8 times, and I will never take it again, although sometimes I miss the feeling. There is nothing like a good trip on x, it's too incredible to describe. No one can really understand unless they've done it too.",
  "Now for the story:",
  "This was my fifth time taking x. I always took it at raves because it could keep me up all night, dancing, talking and feeling like I could really just let loose and forget about anything and everything. I'm not normally very social, but with x I could dance in front of anyone and not be embarrassed, and I could talk non-stop. I could be a social butterfly for one night a month. I always take two pills, after I start to come off of the first one I wait as long as possible and then I dose again.",
  "I came to the party feeling great. I was excited for it, and I hadn't been stressed at all in the weeks prior, so there wasn't much for me to worry about. I got in the doors around 10pm and started to dance a bit, loosening up, mingling with a few people I've met before and just enjoying the music. I waited until approximately 11:45 and then I dosed. The night was completely perfect(or so it seemed). I was dancing like a maniac, and aside from a little bit of a stomach upset I was partying like usual. Everything seemed completely normal. The same feelings of euphoria, limitless energy, and needing to talk. I took the next pill around 4am. I came back up and all was good until about 7am.",
  "Suddenly I started to see things differently, I turned to look at my friends and I felt like they were talking about me. Then I started to think everyone was talking about me, making fun of me. I imagined I could even hear them, but this isn't possible. I can barely hear what people say into my ear over the music, and these people weren't even close to me. I became completely paranoid that everyone had it out for me, I went from feeling completely happy, to terrified.",
  "After the party ended we went to a friends house and I couldn't shake the feeling that everything people said had a hidden meaning, everything was aimed at me. I couldn't feel anything but fear. I have never been that scared in my whole life. I was unable to talk or move, I just sat there thinking about how horribly things were going. This feeling persisted for almost 4 months. 4 months of paranoia and fear. Feelings I had never felt before that moment at 7am.",
  "It's been almost a year now, and every now and then I still get scared. It comes and goes. I tried to do x three times more and the same thing happened. Because of one night, I will be plagued by this paranoia forever. Most of the time it isn't so bad, but once the thought enters my head I can be paranoid for weeks. My last episode was almost 2 months.",
  "I think that the x has triggered an underlying condition, but either way the x did this to me, and I can never do it again. I fear that I may do more damage to my already fragile mind. If x doesn't hurt you it can be beautiful, but if it does, even once, I suggest you just forget about it forever. It just makes it worse. X can change you for the better, or for the worse, never forget that. I won't."
 ],
 "erowid": {
  "id": "29503",
  "citation": " Chicana. \"Extreme Paranoia: experience with MDMA (Ecstasy) (ID 29503)\". Erowid.org. Nov 6, 2007. erowid.org/exp/29503",
  "substance": "MDMA (Ecstasy)",
  "views": "11336"
 }
}
