{
 "title": "Confusing World",
 "author": "Baron Von Bad Guy",
 "citation": " Baron Von Bad Guy. \"Confusing World: experience with Salvia divinorum (10x extract) (ID 45735)\". Erowid.org. Oct 24, 2005. erowid.org/exp/45735",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   "",
   "",
   "0.5 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>Salvia Divinorum is an incredibly hard drug for me to try and describe. When smoked enough of, its effects, while incredibly overwhelming, seem to fall out of my grasp to fully comprehend them. (Its short and manic duration certainly doesnt help either.) Imagine as you sit here reading this, someone comes up behind you and hits you in the back of the head with an axe. It doesnt physically feel like this, but it is such a radical shift in consciousness that getting struck by an axe seems plausible enough as a description.</p><p>When smoked by itself, it usually tends to bring on some physically uncomfortable feelings. Intense perspiration, skin becomes irritated easily, not to mention the smoke tastes something awful, almost synthetic. While high on cannabis, the Salvia smoke is, for me at least, much more bearable. It also seems to lessen the negative physical feelings (or at least masks them.) I would also recommend taking cough drops and/or cough syrup before smoking.</p><p>When I take Salvia (especially in high doses) it has more of a paralyzing effect on my body. However, it does seem to pull my body into a specific formation. Ill notice my head tilting to one side and then stopping, as though it locked into place. Its hard for me to imagine having an urge to get up and explore after smoking a large amount of it.</p><p>---</p><p>I had already smoked quite a good amount of cannabis over the duration of a few hours, and threw a beer into the mix assuming it could only make the experience that much stronger. Ready to take on the Salvia (10x I believe,) I stuffed a decent amount of it into my hash-pipe and proceeded to take a rather large hit. I looked toward the wall as I held it in, I could start to feel its effects kicking in. I took note of my shadow which was cast quite clearly against the wall. About 30 seconds after inhaling, I released the smoke from my lungs. Within a few seconds, its feelings completely dominated my senses...</p><p>Reality suddenly came to an abrupt halt. It was as if I became aware of a new layer of being which encompasses all of the reality we know, along with other realities which lay on the same horizontal axis as our own. I suddenly experienced the segment of reality I occupied get separated from the rest, like a single link in a bike chain getting pulled upward, causing all the other links around it to fall to its side. I believed that a Queen or Mother presence from this new reality above our own had halted all forms of reality, like someone pulling the brakes on a train. At one point, I believe it felt as though I was looking out at this new consciousness from the inside of a bag, in a shopping cart, in a super market. Everything I perceived shifted drastically. As I pushed forward I briefly became a flat wooden face with a door in the middle of it that slamed shut. I became conscious of this feeling. Everything was still frantically being altered. It was as if every sense I was aware of had been twisted into something else.</p><p>At one point I seem to recall feeling like I was two circular disks pulling away from each other, a feeling of being unzipped. I also noticed midway through the experience that I would begin to worry about things which are completely irrational to the reality that we know, but seemed to be relevant to the one I was experiencing.  There would be words I would think of in my head, which at the time, seemed to naturally be used to explain different feelings produced by the drug. The same way I would understand the word sneeze to be affiliated with the action it is used to describe, I would become conscious of say the word Alzepopa to be the action of a semi-present box outline pulling away from itself and then jutting itself into its original position. It almost seems as though when I smoke Salvia, I become conscious of an entirely new field of reality, with its own logic that seems to, at the time, make perfect sense.</p><p>As for the visuals, their very being seemed to be a contradiction, in that, to a degree I understood their presence visually, while simultaneously I was unable to grasp it vividly enough for it to be clear and distinctive. The visuals were more along the lines of something I would see at the very end of a dream, right as I am starting to wake up. They are not as present or clear as say, something I may have seen earlier on in the dream, but they still have an almost unexplainable form to them.</p><p>I recall worrying how I could possible describe the things I was experiencing later on, and then suddenly, that worry was swept away, and transformed into something relevant to the world I was in. I assume it was my brain's best effort to make sense of what was going on, but due to it being in such a confused state, spewed forth irrational forms of logic that reached even the senses causing them to distort and conform to the currant delusional state of consciousness.</p><p>The trip ended when I began to become aware of the various different thoughts as being irrational. I notice at lower dosages, or toward the end of an experience brought on by a higher dose, as I lay on my bed looking across horizontally, it feels somewhat like I am looking up or down vertically. Occasionally having a mild feeling like I could, say for instance, fall from my bed into my back door, as if gravity had shifted.</p><p>A few bits and pieces I really couldnt fit in from the trips I had that night:</p><p>A train, electricity moving throughout it, a view from a mountain, the picture above my bed becoming a symbol of something I am not able to understand, a stamp? A logo? An image surrounded by swirling colors produced from my television and distorted from Salvia, a constant flow of logical insanity, everything drastically switching, impossible to truly describe, can only be experienced. Like becoming aware of a new sense used to help interpret a reality which was unknown beforehand, yet not as profound a reality as that of our own due to its instability and inconsistency. Space seems to distort, what normally is visible is now almost completely alien, taken on a new meaning and thoroughly distorted. Everything shifts rapidly. An almost telepathic communication with different things. Strong sense of moving, barreling forward from one point to another. A crumb of some kind that was irritating my body, when wiped off, felt like I was sharing something with a friend. Things constantly shifting, as if I was being bombarded with an endless stream of information that continuously corrected itself.</p><p>In retrospect, these seem like the kind of things people would freak out over. But they arent quite as frightening as they sound, because during the time of my experience, it is as though I somewhat understand what is going on. That and I really seem to have little desire to move around.</p><p>A few trips prior to this one:</p><p>On a previous, somewhat less intense trip the room seemed to shift and melt together, the television became hard to see, just a bunch of images being flipped around in the distance. I recall feeling like I was getting picked up by some form of transportation, and then rolled forward back to my current position. A few other times I took it which were significantly less powerful than the most recent few times, I noticed things seemed to change in size and dimension. One of my first experiences happened when I smoked outside, and for a short period of time, understood the tree branches in front of me to be dragons (virtually still maintaining their original branch form) which seemed to communicate telepathically. I came to understand it was a mother and father dragon, with their son. I either thought to myself 'thats a damn fine son you have there' or said it out loud. I hope I said it out loud, just for the sheer hilarity of it. I snapped out of the trance, and began to feel uncomfortable due to all the mosquitoes biting me along with the naturally unpleasant physical effects of Salvia. I said something to the extent of Fucking-A, man! These fucking Mosquitoes! Sat up from the chair in my backyard, and walked into a little tent area set up near my backdoor.</p><p>I have yet to try any other strong psychoactive substances, despite my best efforts to find them. When I do, I really hope for the experience to be more definitive, clear visuals which appear to be just as real as everything else around it, rather than the Salvia visuals which seem to be my brain's best way to try and comprehend what it is going through. Dont get me wrong, I plan on taking it again. Salvia produces some really amazing experiences. But I am looking for an experience that, if not profound, is at least crisp in visual clarity and not as physically uncomfortable. A long lasting trip wouldnt hurt either.</p><p>Anyhow, I thank you for reading and hope you found this to be an interesting, if not enjoyable report.</p><p>Take care,</p><p>Mike</p>",
 "year": "2005",
 "id": "45735",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-10-24T07:00:00.000Z",
 "views": "13711",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
