{
 "id": 4574,
 "title": "Strange Mindstates",
 "date": {
  "submission": "2003-12-28T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "rockin",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  },
  {
   "time": "8:00",
   "amount": {
    "unit": "tablet",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "Please think about mixing any kind of drugs together because their effects can be very intense and undesirable.",
  "Last night me and my buddy were planning on going to a small rave just out of town. We had been drinking beer all day and at about 8 o'clock we started getting into some liqour. I was feeling pretty good and i was stoked on going to this party since i havnt been to a rave in almost a year.",
  "We got a ride out to the party by my friends girlfriend and arrived there about 10 pm. We went in and checked out the scene to find it was kind of dissapointing. The people there were not really my kind of people, they all seemed to be pretty out of it. And the girls were all kind of average looking. Alot of the girls that were there were girls i have been involved with in the past which made being there feel kind of awkward.",
  "When i got offered a tab of ecstacy i accepted it because i wanted something to highten the mood. Ive only done E once like 6 months ago and the last time i rolled i quite enjoyed it. So my buddy and I popped a pill and pretty much forgot aout it.",
  "A sort time later i started to feel really good and went dancing. One thing that really bothererd me though was that i really had a strong urge to talk to someone and it was very difficult due to the very loud music. I didn't let it bother me to bad because i took alot of outside breaks and talk to people out there. I found i was chain smoking and my pack which was full upon arrival was now getting low.",
  "After about 2 hours i felt as if my peak on the E was coming down as did the liqour and i was starting to feel kind of 'run down'. A doobie was being passed around and i took some tokes. I don't smoke pot much so it has a strong effect on me. After smoking the joint i forgot about it cause i have been smoking so many cigs and my short term memory seemed kind of scrambled.",
  "All of a sudden being in the rave i thought that everyone who was whispering into someones ear was talking about me and i was the center of attention at the rave. It was such intense paranoia i couldn't handle it. I just wanted to go home. It felt like i was losing my mind because the paranoia felt so real. I knew i was just tripping but the feelings were to intense to shake off. I just wanted to go home and curl up in my bed by this time.",
  "The E was losing its effect and i was crashing hard of all the liqour i was drinking. I felt opposite feelings that i had earlier, i didn't want anything to do with these people. I started having sinister thoughts and i was getting really negitive.",
  "I told my friend about the paranoia and he was like 'bro, its just the weed.' I remembered about the weed and that eased it cause i remembered that weed sometimes has an effect like that. I feel asleep in the car for a few hours and got home at 9 am feeling like shit. I slept all today and got up at 6 pm. The only thing that motivated me to get out of bed was the fact that dinner was ready. I still feel a little strange and i seriously doubt i will roll ever again. I hope that my experience can be somewhat useful to any one who reads this."
 ],
 "erowid": {
  "id": "29539",
  "citation": " rockin. \"Strange Mindstates: experience with Alcohol, MDMA, & Cannabis (ID 29539)\". Erowid.org. Dec 28, 2003. erowid.org/exp/29539",
  "substance": "Alcohol, MDMA, & Cannabis",
  "views": "10499"
 }
}
