{
 "title": "Heavy Skins and Voices",
 "author": "Pepperlandman",
 "citation": " Pepperlandman. \"Heavy Skins and Voices: experience with Belladonna (leaves) (ID 45757)\". Erowid.org. Apr 11, 2006. erowid.org/exp/45757",
 "substance": "Belladonna (leaves)",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "500 mg",
  "oral",
  "Belladonna",
  "(tea)"
 ],
 "report": "<p>I tried Belladonna last night on my own, and I agree with a lot of people, it is certainly not a drug to be taken lightly, I can not emphasis that enough, but that's just my opinion, and this was only my first time.</p><p>I put roughly 0.5 grams of dried leaf into 1 litre boiling water for 10 mins. I let it reduced to around 300ml (a lovely piss colour). I let it cool, the taste reminded me of green tea.</p><p>45 minutes later I felt a wavey warmth over my brain, I could feel it playing with my brain chemistry. Different synapes being opened and closed.</p><p>2 to 3 hours in I had a minor panic attack, because the dehdration was getting out of control, and I also felt really drunk.</p><p>All drugs are toxic, but with Belladonna I felt physically poisoned. I had plently of water... but it just flowed right past my throat, where I needed it. It's an EXTREMELY discomforting situation, and in that very moment I severly regretted taking Belladonna. I just wanted her out my body. Because of this, I'm a little reluctant to try it again so soon.</p><p>I can't even begin to explain my dreams/waking dreams, or mystery objects in my room that I couldn't pick. My depth perception was simply not there. I tried to pick up things that actually existed in my room, even tried to open doors, but my hand would go right through them. If I blinked they would disappear, and then suddenly I would be in my bed. The same happened with books, pens and paper. I was reading my book in bed, it was physically there in my hand, I was flipping pages, reading, then it just disappeared!</p><p>I woke up the next morning with scratches on my stomach and chest. In between waking and dreaming, I hallucinated several family members who came to pay me a visit. They disappeard too, at a snap of a finger. I found myself talking to myself constantly, even when dreaming. It was absolutely randon jibberish, mumbling. Should have recorded it.</p><p>I was feeling very uncomfortable in my own skin. I threw up. My heart was pumping so fast. My penis shrunk to a far smaller size, to a quarter of its size, and it was difficult to urinate, not painful, just a real effort. Never could I fully empty my bladder.</p><p>My choice of drug is cannabis and shrooms, and I've tried at least 5/6 LSD trips.</p><p>I was expecting a europhic high from Belladonna, a connection with my surroundings, transcendence, but what I got from Belladonna was a vague wake/dream/drunk stuper. All I can say it was unusual, and that I have fear for this specific plant.</p><p>I was in control of myself, but with a high dose I think I could have lost myself somewhere easily. Sure there's the Belladonna high/drug effects, which are very curious and different, but I found it very unnerving and I wanted that drug out of my system asap. I felt I wasn't full there, like the plant tucked me away into a dark corner of my brain for a few hours. Thats why they have sittes.</p><p>I really did feel the toxic effects in my cells. I polluted my ocean, and really the toxics feel heavy in my body and mind. It wasn't a good experience or a bad one, it was just the dehydration that was making me panic and this horrible sensation right underneath my skin, mostly on my legs. I also felt a strong gravitation effect, which made it difficult to move. At that very time the deydration was severe, and the opposite walls of my throat were glued together.</p><p>Any higher dose, I believe I would have lost my mind. 0.5g dried grams was enough me. In the future I think I may try it again, but thats a long way off. It really is a heavy poison.</p><p>From this experience I've learned to not panic, its very important not to, I was so close to physically sprinting to the local hospital 10 miles away for no logical reason, it was an urgent feeling to get help. I had to just try and take it easy, deal with my dehydration quickly and all the time, because I could have easily gotten lost and confused. Such a mind altering experience, but I can't remember much of it.</p><p>The Belladonna trip finished around 10 hours ago (it was in my dreams too).</p><p>Side effects are a little rough however. Hot and cold flushes, nausea, sensitive eyes (my pupils returned to normalcy the next morning), fast heart rate, paranoia.</p><p>Know myself and the plant first, moderate the dose (I think 0.5g was a lot for my first try), but no means is it a recreational drug, I've been warned.</p>",
 "year": "2005",
 "id": "45757",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-11T07:00:00.000Z",
 "views": "22164",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Belladonna",
   "form": "(tea)"
  }
 }
}
