{
 "title": "RGB Ripples",
 "author": "123",
 "citation": " 123. \"RGB Ripples: experience with Syrian Rue (ID 45767)\". Erowid.org. Apr 7, 2008. erowid.org/exp/45767",
 "substance": "Syrian Rue",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE:",
   "6.5 g",
   "oral",
   "Syrian Rue",
   "(seeds)"
  ]
 ],
 "report": "<p>At approximately 10:00 A.M., my friend, K, and I started the brewing process.</p><p>K and I ate our last meals without any foods high in tyramine at about 7:00 P.M. the night before the experience.</p><p>Approximately 13 grams of syrian rue were put into zip-loc baggies and smashed to bits. This was then put into a metal cooking pot with enough bottled water to drink. We put it on medium heat until it became warm. Then, about 1/4 of the fake lemons with lemon concentrate were added to the brew. This was left to boil on medium heat untill some of the water was evaporated (15-20 mins.). We mixed in one packet of crystal light peach tea with ice. We kept a glass of orange juice to drink after every sip of Syrian Rue...This stuff is absolutely horrid! I don't think I've ever tasted anything like it.</p><p>Over the course of about 10 minutes, K and I sipped the brew (about 6.5 grams of syrian rue each). We finished drinking it finally.</p><p>(15 minutes) We both agreed that we could feel something subtle.</p><p>(30 minutes) I never read anything about a body high with this stuff. K and I both agreed we had extreme body highs especially in our legs.</p><p>(35 minutes) We started to watch MTV (I hate MTV) but the Gorillaz - Feel Good Inc. video was on. It was definitely good. Better than if we had no S. Rue in our stomachs.</p><p>(40 minutes) K said 'F*** this' and he went into his room to listen to some Pink Floyd. I followed to see if he was alright. He said he was great and he just wanted to chill out and listen. He laid on the bed and I on the floor. We both agreed on Wish You Were Here.</p><p>(48 minutes or so) The singing in Shine on You Crazy Diamond started. I decided to try to stare at the white ceiling and black everything else out. This proved to be quite an experience. (I forgot to mention that this was my first 'psychadelic' experience) As I blacked everything else out, the black dot that appeared turned into a wormhole. (This was not a hallucination but more of an intense visual). Then, out of nowhere, a tunnel appeared around my head and the wormhole and I was sucked backwards through it. I got up and told K to do the same thing. He did and said he saw the same thing.</p><p>(55 minutes) It felt like I had lost all control of my eyes and they would follow invisible black dots around the ceiling. I found this to be not frightening, but wonderful.</p><p>(1 hour) I had to pee really bad. I got up to go upstairs. I almost immediately lost my balance. I was extremely dizzy and moving my eyes and head too much caused uncomfortable dizziness. I went upstairs and looked in the mirror in the bathroom. There didn't seem to be any change in the appearance of my eyes. After using the bathroom, I went back downstairs to listen to more music.</p><p>(1 hour, 10 minutes) Even though I think they were there the whole time, I started to notice very small, subtle Red, Green and Blue Ripples. They weren't intense or anything but I was really excited. I asked K if he saw it too. He paused for a moment and optimistically said yes. I laid back down.</p><p>(2 hours, 10 minutes) We both went upstairs to watch television. Mine and K's stomach started to feel upset. We both went into different bathrooms and vomited the contents of our stomachs. This is when it started to wear off I think.</p><p>(2 hours, 30 minutes) Our friend M called and asked if we wanted to go to Taco Bell to eat. We complied and about 20 minutes later he came over.</p><p>(2 hours, 50 minutes) We let M know what we did and we got on our bicycles to go to Taco Bell. It was then that I remembered that we can't eat certain foods and as I suspected, K forgot about it as well. Riding bikes felt really good with the wind going past us even though we were almost base-line at this time. We ordered tater tots and a soda each and consumed them.</p><p>(3 hours, 15 minutes) I had to leave to go home on a 5 mile bike ride. Although mostly uphill, it was a fun bike ride.</p><p>In conclusion, this was probably one of my favorite experiences. I've only done a few drugs because I'm pretty new at the drug scene, but my experiences only include Marijuana, and small doses of Morning Glory Seeds (Not enough to do much of anything). However, I think the body high felt like what I would imagine opiates feel like. The visual element was not overwhelming but it was very pleasant. The only thing about the experience I didn't like was the dizziness. In the future, I plan to do it again as I have about a pound of the stuff, but in a higher dose.</p>",
 "year": "2005",
 "id": "45767",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-04-07T07:00:00.000Z",
 "views": "3876",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6.5 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(seeds)"
  }
 ]
}
