{
 "title": "Too Much: Psychotically Beautiful",
 "author": "ECT",
 "citation": " ECT. \"Too Much: Psychotically Beautiful: experience with 2C-T-7 (ID 4577)\". Erowid.org. Jan 8, 2001. erowid.org/exp/4577",
 "substance": "2C-T-7",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "160 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>\nI found myself on New Year's Eve with 200 or so mg of 2C-T-7 in my possesion. The plan was to go to a huge, commercial, suck-your- money-away-in-spades rave in downtown LA called Together as One. My friends were all content to roll on some E of questionable purity, but I had the REAL shit. A friend and I had tested it out the night before, each taking an eyeballed tenth of the powder. That trip was mild to say the least. The stoplights left mild tracers as we drove around in his piece of shit car, but that was about it. That made me  determined to find out the psychedelic potential of the remaining 2C-T-7. What better night to OD than New Years Eve? Especially if you're prone to fits of recklessness and over-indulgence... as I tend to be. Anyway, i had it in my head that I was gonna go for it and run a field test comparison between LSD and 2C-T-7 by ingesting a massive dose of the latter. This would have to be some powerful shit to rank up there with high dose acid. I've have annihilating,   psychotically beautiful, mind-melting experiences with LSD and I wanted to see how far I could push it.</p><p>While one of my rich friends was driving the six of us in his plush SUV to the E-man's house, I took out my little knife and scooped all the powder in my bag onto the blade and into my mouth... Then i licked the bag. It was a quater after ten. The excitement began... Few things are as exciting as waiting for a NEW drug experience to take effect. Right away I was tingling with anticipation. Within ten minutes, I notice a warm, electric feeling in my chest. I was a little bit scared and  bit chagrinned... after all I HAD read the article about the 2C-T-7 related death. And nobody really knows what the fucking LD50 for this shit is anyways. Or at least I don't know if anyone knows...</p><p>We got to the rave around 11 and by this time, i was feeling pretty damn stoned. Weird kind of brain dysfunction. It was more stoned that I've ever felt on acid or shrooms before. Walking was weird, not difficult. It just absorbed all of my awareness. I could only think about one thing at a time... the slow mindfuck was already beginning at T + 1.0</p><p>Once inside the rave, we wandered from area to area. The first area was the LA Sports Arena. I remember being transfixed by the huge translucent, phosphorescent pyramid that hung over the DJ booth like a giant cocoon. THe effect was such that I was convinced the DJ was spinning from inside a lava lamp. I was mesmerized by the dancing too. I've fried at raves before, but this was much more surreal. There was a certain WAY to dance. Each move was BACKWARDS. There was a uniform beauty to the way all the good dancers executed each move and made it look like they were on a video in rewind mode. I started dancing like them and eventually I caught on and learned how to dance BACKWARDS too!! I've been to enough raves to hold my own dance-wise, but I've never been able to bust out any amazing skills. Wow, for awhile I was convinced that I was the SHIT on the dancefloor! I haven't been able to remember exactly how i did it... I'd like to think I was actually dancing as well as I thought I was ... oh well. After that a few bad things happened.</p><p>ON our way back to the main area, i got seperated from my friends. No big deal. But the lonliness started getting to me after a couple of minutes. Everyone else was with their friends and I was wandering around by myself. Everytime I saw a couple, i became acutely aware of my remote little niche in the universe.</p><p>Also, i was seeing things in multiple images. The crowds looked ten times thicker, the lights occupied more space, things were travelling in waves, sounds were cascading off of the giant concrete walls of the Colisseum.</p><p>I don't remember what happened in between, but suddenly I realized I was walking in circles around the Hip-Hop aena, more confused than I've ever been on ANYTHING. I knew this had all my acid trips beat. There were moments when everything looked so foriegn, i thought I'd been transported to China. Why China of all places, i don't know... but that word popped into my mind at the time. I didn't recognize anything. It was fascinating, i was capable of enough lucid thought to objectively assess my condition as 'more fucking disoriented than I've ever been' For an hour, i was amazed just wandering around, looking at the sky, which seemed to be sliding down at the sides like jellyfish goo. I was able to assess people to, determining their intelligence, socialiability, creativity, offhandedness, etc... but when I ended up in the hardcore area, things started to go a bit south.</p><p>i thought it would be a rush to go down to the hardcore area in the basement, where Omar Santana was spinning(I learned who it was later on). well, it intensified the experience, but overwhelmingly so. the sheer force of the fucking music was enough to melt my brain through my ears, but the feeling of the music pounding up through the pavement through my legs, into my insides was unsettling.</p><p>the visuals became so intense, everything was leaving trailers. peoples faces would become mottled with purple, grotesque, zombie-like sores and welt, undulating. with acid, i've always been able to (sort of) control which objects were more intensely visual. but wherever i looked, something HAPPENED. all these hallucinations were EVENTS. and I'm sorry if this is a grossly inarticulate way of putting it - BUT EVERYTHING WAS FUCKING WEIRD AS HELL. that was the only thought my brain really gave expression to at that moment.</p><p>luckily i relocated to the trance area where I laid down to look up at the lasers shooting off into the deep sky BEFORE two security guards were stabbed in the hardcore area I just left. I thanked my lucky stars after I found out that I didn't have to see THAT. Christ...  I would have flipped out, sprung a leak in one of my important sanity hoses.</p><p>Anyway, I closed my eyes and had my own little private light show set to a melodic, soothing trance beat for a few hours before my friends stumbled over me and sat down. It was three o'clock and I was still on a plateau way above them, so I refrained from opening my mouth or my eyes too much. The close eye visuals were actually pretty tame for such a mammoth dose. They were pleasing, but I've seen more disturbing shit on acid. But when I opened my eyes, I was plunged into the ocean of tracers, neon outlines, streaks, etc.</p><p>well, we danced some more to a beautifully anthemic set by Sandra Collins, and around six AM we left. I was still off my nutter completely. But I had an appetite strangely enough. I was disappointed to remember that it was Jan 1, 2001 and all businesses were closed for the day. We drove around looking for a place. Not even a fucking donut shop. In the car, i wanted to explain to my friends that 2C-T-7 was definitely a powerful psychedelic, but earlier I had lied to them and told them I was frying. I didn't want to attempt to correct this until i had a few more of my wits about me.</p><p>Eight o'clock, back at my friend's place, we were watching the Rose Parade. The visuals had abated, but there was still a lot of morphing going on. The soft light of morning isn't conducive to visual hallucinations. They don't go together in my experience. Time to come down. I watched the parade in a state of mild physical, mental irritation, eating  oatmeal until one of my friends announced that it was time for the first blaze of the new year. We sat and smoked a few bowls. Snug and gratefully stoned, I was able to go to sleep. When I woke up around one, everything was normal.I was relieved that I hadn't rewired something. Permafried. After all, I took like five times the recommended strong dosage. I'm lucky I don't have a heart valve defect or something. It was  a rewarding experience over all, but i think i was fortunate that it didn't go the OTHER way. I think there is potential for grievous mental disaster in that amount. I don't know how narrowly i missed it. A mg sensitive scale is on my shopping list.</p>",
 "year": "2001",
 "id": "4577",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-01-08T08:00:00.000Z",
 "views": "12080"
}
