{
 "title": "Made Me a Shining Star",
 "author": "Sigmund",
 "citation": " Sigmund. \"Made Me a Shining Star: experience with Cocaine (ID 45784)\". Erowid.org. Jun 27, 2010. erowid.org/exp/45784",
 "substance": "Cocaine",
 "bodyweight": "170 lb",
 "report": "<p>Although I frequently (re)read the cocaine experiences online, I feel that none of them convey the idea that some people can use drugs, perhaps, all illegal substances, responsibly under the right circumstances. After a lifetime of anti-cocaine rhetoric thrown at me, I decided to take the plunge and experience the white powder for myself to see what the controversy truly was all about.</p><p>Before I start this, I must concede that this experience was technically not my first one with the drug; I had done the equivalent of about a line's worth of coke by taking frequent bumps off of a key at a friend's house party once. At the time, I really didn't see what the big deal was, all the coke did was sober me up a bit from the liquor I was drinking at the time.</p><p>However, the following experience is a true and accurate description of my mind state while on cocaine. To avoid going into too much detail, I had to write a lengthy term paper due the next morning, and I absolutely hated the idea of having to spend the night working on an essay about federalism and its shifts from and to state governments. To put it another way, it wasn't the topic that bored me, it was having to consult a wide range of sources to come up with a valid argument....it gets tedious!!!! So, armed with the knowledge that Sigmund Freud experimented with cocaine, I decided to buy a $20 bag of coke and apply it to my paper writing.</p><p>I'd be lying to you if I wasn't absolutely thrilled when I crushed up the rock of coke and cut up my first line.....there's no better feeling in the world to be doing something bad...wait, that's not true. The best feeling in the world is doing something bad and getting away with it!!!</p><p>So, after a few minutes, the surge of energy hit me like a ton of bricks. I then proceeded to crash right through those bricks and take advantage of this amazing power. I felt too good at this point to be serious. The paper had to wait. I ran to my piano and started playing some chords, very uptempo. I then sang along with the uptempo key playing and felt such harmony! Everything in my mind, body and soul was in sync with each other, and we were all happy! The euphoria intensified as I let myself go even further and lose my inhibitions. As I sang, my voice and my piano playing danced with each other....It was like having amazing sex...I stopped thinking and let my heart run free....</p><p>Of course, what goes up must come down, and after an hour and half of high octane thrills, I began to feel heavily fatigued. It was tempting for me to go to bed and call it a night, but I had to finish my term paper. So, I cut another line, and BOOM! There was my energy again! To be able to go from zero to 60 so quickly...no wonder people get hooked on this stuff.</p><p>This time around, though, I let the cocaine guide my thought processes as I began writing. I don't want to say it made me smarter, but it did help me realize my potential. It accelerated my thoughts to the point where I could seamlessly combine my practicality, my discipline and my creativity. It made me want to go dig deeper into myself to make something that I could actually be proud of. Instead of rushing to complete the paper when it was in the 'A' range, the coke helped me go the extra mile to discover facts that no one else had before....I became an undergraduate PhD!</p><p>I handed in the paper, and I got a '100' on it. It blew my professor's mind! Later, I read that he considered it graduate quality work. It meant a lot to me to hear that, especially when this was a 101 level course.</p><p>Yet, I know that this was only a one-time thing. Not because I think I won't get that high again, but because we, as human beings, aren't meant to be flawless all of the time! I see this as being for the times in life when I am actually required to put the pedal to the metal. Moments that require my fullest potential come few and far between. Most of the time, I can just coast on by and blend in with the crowd. Coke made me a shining star, but honestly, do I really want to be a superstar EVERY SECOND OF MY LIFE?</p><p>So what did I learn? Cocaine is an amazing drug. It can lead to higher heights and made me realize how amazing we as human beings are. It doesn't make me a star, but it does make me realize that I can make myself into whatever I want to be. For those times in life when I need a little artificial affirmation, I see no reason not to supplement my actions with a few lines. But, and this is a HUGE but, I see no real reason to use coke for anything else.</p>",
 "year": "2003",
 "id": "45784",
 "gender": "Male",
 "timestamp": "2010-06-27T07:00:00.000Z",
 "views": "28403",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 lines",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ]
}
