{
 "id": 4584,
 "title": "Anyone Get the Number of That Train?",
 "date": {
  "submission": "2006-12-20T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Noggin",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "Unknown",
   "form": "(capsule)"
  }
 ],
 "report": [
  "<p>So for Christmas I get a bag containing what are quite obviously two paper hits (both appear to be fake) and two clear coat gel capsules containing a small amount of a greyish powder substance, small amount meaning less than an 8th of the capsule... It was rather dumb but I decided to eat both of the capsules and set about the days tasks...",
  "This was not such a marvelous plan as I had thought...",
  "The onset of the drug was like a shitty acid high with no visuals... Like waiting for, or coming down off of weak LSD... Anxiety, apprehension (i was in a library, but musicks pumped to my brains via headphones seemed to keep me insular from any threatening realities)",
  "I checked my emails and did my usuals online then decided to depart to the mall to visit a friend... At this point I started accumulating more of a visual stimulus from the drug, but it seemed to be inextricably linked with some form of tactile sensation...",
  "Two hours later and the mall seems to me as a vast repository for the shitty indiscretions of those predisposed to giving the sideshow carnie a fiver and asking to be 'blown away' only to have the carnie show the customer his own turd and declare its worth another finksi where that came from...",
  "Fila F's and Nike swooshes are emblazoned upon my very rapidly combining sensory fields with an invasive flourish I can not bear...",
  "Visuals are VERY pronounced now... Like high level doses of LSD, but the anxiety has worn now and there seems an almost euphoric presence to the drug (this at about 4 and a half hours into the trip)... Board a public transit train to a friends house and begin having very extreme moments of what I can only describe as brain pleasure... As if the brain were a gentalia being manipulated in the most delicate and exquisite manner possible...",
  "Come very close to having an 'orgasm' on the bus, but decided against it seeing as how it might have merely resulted in a schizoid embolism...",
  "Now at a friends house I am sitting on the stairs, considered the idea that I had just possibly ingested a large quantity of really, really good LSD, things start to get wicked...",
  "It manifests itself as an aural hallucination of varying frequency and pitch beginning at the base of my right ear and then spiraling out, spatially, behind me and above me but then gradually moving across this field, behind my back to come and rest at the base of my left ear...",
  "Process reverses and repeats itself and is very, VERY pronounced and there is some synesthesia involving a very tactile feel to this...",
  "(symptomatic at about 6 hours of trip time)",
  "Retreat upstairs to listen to soothing musicks and contemplate the notion that Ive ingested farrrr too much of an unknown psychedelic substance...",
  "Lay down and have an EXTREMELY ugly and EXTREMELY real hallucination of the face of brutality and ugly violence manifest in the form of a serpent demon who seems to inhabit both my internal hallucinatory world and my external hallucinatory world... (both are now one and Im very surprised I had the courage to shake its shoddy visage of death from my eyes)",
  "Snap out of it like a dream exiting to a dream that took place in a dream someone was having about someone dreaming...",
  "Begin a comedown sequence about ten hours into the trip that gradually relinquishes hold of my visual field, while oddly maintaining the auditory/tactile hallucination nearly fourteen hours later...",
  "No desire to eat... Although food seems palatable enough...",
  "Much trouble urinating however, distressingly so at times...",
  "And a feeling like the auditory/tactile hallucination would at any second manifest itself as an embolism or a stroke...",
  "Very sleepy now, and feeling totally depleted...",
  "Not entirely unpleasant, but not necessarily something id like to repeat if I can avoid it... Any hints?",
  "Help?",
  "Does this sound like anything anyones ever taken before, or did I just magickally ingest some experimental pharmies?",
  "HELP! lol</p>"
 ],
 "erowid": {
  "id": "29570",
  "citation": " Noggin. \"Anyone Get the Number of That Train?: experience with Unknown (ID 29570)\". Erowid.org. Dec 20, 2006. erowid.org/exp/29570",
  "substance": "Unknown",
  "views": "7557"
 }
}
