{
 "title": "Tormented by Chewing",
 "author": "Alex",
 "citation": " Alex. \"Tormented by Chewing: experience with Salvia divinorum (21x extract) (ID 45904)\". Erowid.org. Jun 28, 2010. erowid.org/exp/45904",
 "substance": "Salvia divinorum (21x extract)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "0.25 g",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "report": "<p>I came to my friend's house to try salvia. A couple of weeks before I had smoked two bowls of a extract with minimal effect. This time, he obtained an extract much stronger than before-21x.</p><p>He packed the bowl, which was still warm from the two times that the bong was hit, one from my friend, and another hit by his friend. He packed the bowl generously, using almost a 1/4th of a gram. I made that conjecture based on how much was in his gram bag versus what was there before he packed the bowl. We all sat on his couch which was covered with a sleeping bag. The lights were off. The only light came from the back door. My friend put the barbecue lighter to the bowl, nearly topped with salvia. I inhaled as he turned his head to talk to his friend at the other end of the couch. With the lighter lit for well over 5 seconds, I dragged in the thick smoke, held it in for longer than I inhaled it, and exhaled slowly. I passed the bong to my left, and waited. Nothing happening (1 second) nothing happening (2 seconds)BAM.</p><p>My vision turned to black, and I had felt that I made a grave mistake. The sound of the chewing of the guy on the other side of the couch grew louder and more annoying. A strong visual began to overtake my field of vision and moved to the rhythm of the chewing sound. It looked to be a sea of yellow, turquoise, and white interconnected mushrooms, being drawn towards my eyes by the immense sea of black all around me. To me, the visual was extremely disturbing and distressing. As it drew nearer and began pushing me, it appeared that its fabric and rhythm was impenetrable. Its rhythm was hypnotizing or possessing me. And as it touched me, pushing me against the back of the couch, it became clear I would have to fight it or break it for an opening. I leaned to the left and the chewing became almost twice as loud. At this stage in my trip, I was convinced that a supernatural being had arrived. Its purpose was to consume or transform all life or at least that is what I had convinced my self.</p><p>The guy who was chewing said, 'Just let it happen.' I became startled by that phrase. I wanted that guy to leave so badly because it seemed to me that he was helping the force. I realize now his chewing was what I interpreted as the sound of the being consuming me. I wasn't sure whether to fight the sound, or fight the force of the sea. I remember struggling to escape. I kept hearing the voice, 'Just let it happen.' But, I was not content with letting my existence vanish or be taken over by this supernatural force. I dove to escape the darkness and the sea of mushrooms. I paused as the force grasped me from all sides. I tried to walk, I stumbled and wobbled towards the door. Then my friend drew me back to the couch where I lay down. I thought it was over. Then, I felt the grip of the force's strength inside me. I decided it was too overwhelming to fight. I wanted badly to erase the sound of the chewing by disposing of the person, but I lost all strength and I became at peace with my fate. I arose slowly what seemed to be minutes later, to see the astonished look of my friend and his friend, what I had supposed to be the tormentor in my trip.</p><p>This was a lesson to me that, it is very hard to judge what reaction I will have on this class of hallucinogen. Afterwards, I understood what he meant by, 'Let it happen.' He just meant relax. But, boy, that phrase truly haunted me during the trip. I can't foresee myself on this drug ever again. Worst trip ever.</p>",
 "year": "2005",
 "id": "45904",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-06-28T07:00:00.000Z",
 "views": "2824",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.25 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
