{
 "title": "Meet the First Thing Ever",
 "author": "Reverend Five",
 "citation": " Reverend Five. \"Meet the First Thing Ever: experience with Salvia divinorum (10x extract) (ID 45921)\". Erowid.org. Dec 6, 2007. erowid.org/exp/45921",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "175 lb",
 "report": "<p>One night in the late summer, my older sister and her friend decided that since I live legally clean through necessity but have a fondness for altered states of consciousness, she would both fund and monitor a Salvia Divinorum trip for me. A kind gift from a kind family member. It's that kind of family.</p><p>A little background, I'd tried Salvia Divinorum before, six years prior, but all it gave me then was an uncomfortable vibrating sensation and a feeling that the silk shirt that I was sweating through had somehow turned to burlap. I was willing to try it again, admitting to myself that the last time I had partaken of this substance, it was a low dosage and I wasn't really willing to give anything back to it.</p><p>Back to the story at hand. We went to her friend's small studio apartment and after sorting through a rather impressive music collection, we decided on some Massive Attack for 'traveling' music. Mellow enough, but not without well defined rhythm, which is important to me, as I've used music as a ground in the past. A way to find my way home. Just in case. He offered me his bed or a reclining chair, but the floor is really more of my thing. Dirty apartment carpet is good enough. One can't fall off the carpet.</p><p>I leaned against a bookshelf, crowded with Robert Anton Wilson books and old pulp science fiction novels and tried to prepare myself for the experience. All I had to go on was a dim memory of one interesting though mildly unpleasant prior experience and the promise that this was of much higher quality and potency than whatever I'd had before and that I'd only scratched the surface before. The only foreign chemicals in my system at that point were caffeine and nicotine.</p><p>First hit botched slightly: The smoke tasted like acidic mud. Swampy. Harsh. I tipped the pipe back too far and got some of the water in my mouth. This also tasted like mud. Swampy. I spit the water into my hand and wiped it into my jeans. I held the smoke for maybe fifteen seconds, give or take a couple. The smoke was very harsh, but I managed not to cough.</p><p>First hit, Take Two: More confident, now, I tried again. This time, it was a VERY large hit. I filled my lungs as full as I could comfortably fill them and held the smoke in as long as I could. Twenty or thirty seconds. I exhaled again slowly, feeling a familar sensation of vibration. My sister asked me if I wanted to hit the pipe again. I told her sure, but to wait until I was done rolling forward, as that's exactly the sensation I was experiencing. That, and the feeling that I was being pressed downward by a blanket of incredibly strong static electrical current.</p><p>I sat, letting the sensation wash over me, but then I found the position I was in to be uncomfortable, so after a bit of experimenting, I persuaded my limbs to direct me to a more comfortable position, lying on my stomach in the middle of the floor. That's the last I saw of that apartment for a little while.</p><p>My memory jumps to a very specific image: I saw a vaguely circular pattern, a sliver of silvery white on the right and the rest more of a maroon color, seeming to spin counter-clockwise, vertically, facing me. Maybe ten feet away? Maybe ten miles? Ten million years? It seemed to be resting(?) in a pool of water. I got the impression of a rich swamp, minus the vegetation. My guess is that most of that impression was due to the swampy taste in my mouth and the large wet spot on the outside of my left knee, where I had wiped the water.</p><p>This image just WAS. It seemed to rest in one place, but it was spinning too fast to accurately describe its state as 'resting'. It was the entirety of reality and I was just one observer. The only observer. Ever. It seemed to be very powerful and VERY foreign. Alien, but not in any outer-space Hollywood blockbuster kind of way. Just the most foreign thing I could possibly perceive at that moment. I felt that it was in the far past and the only thing that had ever existed wherever/whenever it was. It was unique, ancient, aware. I was all alone with it.</p><p>I became aware of its voice. It seemed to be communicating through what I assume was the bassline of one of the Massive Attack songs. I'll have to listen to that album and see if I can find that particular bass line. It seemed to be using it as its voice. It seemed to be telling me something very important, and I was trying to understand. Like Moses climbing to the mountain top only to find out that God spoke Spanish. I needed to understand it. The need was urgent.</p><p>About that time, my sister bless her soul, got the impression that I was in some kind of distress. She did something to interrupt my 'communication'. I distinctly remember being both very annoyed at her for bothering me and very glad that she was there, because she is my sister and I love her. I heard her laugh and I was laughing, too. I was once again aware of being in the room.</p><p>I made myself sit up, after a bit and heard her friend tell her that it was her turn. I was trying to communicate my experience to her, but I was having some trouble making my mouth work, like I had to teach myself to talk over again so I could make words. I remember telling her that now she could be the only servant/student/witness of, and tried to describe it by making a counter-clockwise motion with my left hand and fore-arm. It was all I could do.</p><p>This of course elicited more laughter from my sister and her friend. I became more aware of the room and my surroundings. I waited for her to take her hit and since I seemed to be lucid and in control of myself, her friend also had some. There was still some left in the bowl after her friend had had his share, so I decided to try to regain the state I had attained and lost. It didn't work. I managed to find a place to put the pipe where it was out of the way and reclined in the chair. Just the physical sensation. No more of the frontal-lobe massage that I was looking for.</p><p>Once I was able to make words, I was trying to tell them about it, but my sister didn't get past the physical sensation and wouldn't allow the Salvia Divinorum to tell her what it needed to. She said she just felt hot and itchy and it was hard for her to move.</p><p>Overall, I'd say that the smoked herb stimulated the part of my frontal lobe that's tied to spirituality and thumped it very hard. I could describe the experience as looking at God's baby-picture and not feel like I was exagerating much. I experienced a distorted perception of time and space, in the company of or perhaps aided by extremely impaired motor skills (I couldn't TALK for fuck's sake!) and a dramaticly reduced sense of balance.</p><p>The sweating and itching, I'm not terribly certain what causes this, but my sister's friend describes it as being similar to the effect of a super-dose of Niacin. I believe that's what he said. He described it as dilating the capillaries, causing a lot of body heat to come to the surface. That's all I know and can relate at the moment. I hope it's informative, useful, or at least entertaining to someone.</p>",
 "year": "2005",
 "id": "45921",
 "gender": "Male",
 "timestamp": "2007-12-06T08:00:00.000Z",
 "views": "3431",
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
