{
 "title": "Nice Pleasant Trip",
 "author": "Igge",
 "citation": " Igge. \"Nice Pleasant Trip: experience with Bromo-Dragonfly (ID 45928)\". Erowid.org. Sep 8, 2005. erowid.org/exp/45928",
 "substance": "Bromo-Dragonfly",
 "bodyweight": "80 kg",
 "report": "<p>I'm from Norway and my english is not the best :/</p><p>I've tried Ecstasy (about 20 times), LSD blotters (2 times) methamphetamine (a whole lot of times) and shrooms.</p><p>I was over in Sweden visiting an old friend of mine. We talked about old times when we tried LSD blotters... Suddenly he said he had bought something that maybe could be interesting. He showed me a nice powder.</p><p>- It's called Bromo, he said. It's a research chemical product I bought on the net, I don't know if it works, he said...</p><p>- How much do u have, I asked.</p><p>- Two ziplocks with 200mcg each... are u ready to take a trip? They say it as potent as lsd, so we can take one ziplock each.</p><p>I looked at the powder and asked myself why not? It was years ago I was tripping and the last thing we took then was some lsd blotters.</p><p>Place:</p><p>his wife was home so we had to walk around in the forest, behind his house... it was not so dark outside but pretty cold.</p><p>00.30 (+00.00): My 200mcg was taken orally. It really tastes like... nothing...</p><p>+01.00: Now the first effects came on I think.  I feel some energy bubbles inside me that just wants to come out... there is very enjoyable to just go around and look at things.</p><p>+01.30: The trees are starting to move forward and backwards, just as on shrooms, but pretty mild. Feeling a little bit of nausea.</p><p>+02.30: The nausea is gone, but the effects has just began... I look around and the forest colors are beautiful... the leaf colors changing from green to yellow to pink and then back to green again... Now it really reminds me of shrooms... The waves and the colors. But I've got a whole lot of energy that wants to come out... I feel very happy.</p><p>+03.30: For some seconds I didn't remember who my friend was, who I was and where we ware at, it felt strange, like a dream. It makes me a little bit paranoid for some seconds but soon I've start thinking of other things again...</p><p>04.00: WOW! Really heavy OEV:s now... I move my hand from right to left, and there are really heavy trailers after it... My friend stands and watching some bushes, I ask him how he feels.</p><p>-I'm feeling great, we are lucky that it was cold outside when we left, coz I feel very warm now, but nothing uncomfortable, it's more like a warm body glow!</p><p>I felt it too. I think the peak stops around here, dont remember exactly... but the OEV:s don't become any stronger. We walk around in the forest for about 3 more hours before we move toward the house....  When we had walked for some time I recognize a lake... it's the lake behinds his house... when I think about it, I've seen it 4-5 times... I ask him if he recognizes the lake.</p><p>-Yes, it's the lake behind our house,  I think we walked around it three times...</p><p>Hmmm....three times, and it could not be longer than 0.5 miles.... so I guess we walked about 1.5mile in about 7 hours... The sun started to rise and was reflecting on the lake, it was really beatiful! It's impossible to describe it and the feeling of my body.</p><p>Home at 08.00 or something, don't really remember. Tried to sleep but still too much energy. Feels still like I am going with my legs, laying is uncomfortable in every way... Still there are small waves when I look at something. What feels like hours could be minutes but to the end I fall asleep. Wake up in the afternoon, and felt no aftereffects at all...</p><p>Overall: It was a pleasant experience and it's comparable to a mix of shrooms and lsd... the day after I had no problem driving back to Norway.</p>",
 "year": "2005",
 "id": "45928",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-09-08T07:00:00.000Z",
 "views": "12589",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "200 ug",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "(powder / crystals)"
  }
 }
}
