{
 "title": "To the End of Reality",
 "author": "DemiG0d",
 "citation": " DemiG0d. \"To the End of Reality: experience with Morning Glory (Heavenly Blue) (ID 45949)\". Erowid.org. Dec 1, 2007. erowid.org/exp/45949",
 "substance": "Morning Glory (Heavenly Blue)",
 "bodyweight": "175 lb",
 "report": "<p>I have never had experiences with LSD or any other psychadelics. Morning Glory was my first. It all began when my friend and I were looking for new substances to try. I suggested morning glory seeds. We referred to the way that the seeds were used in the past by the Aztecs. 'Maybe we will meet the sun god' we joked. These seeds are no joking matter.</p><p>I waited in anticipation for the seeds I ordered in the mail to arrive. When they came I called up my buddy Zach and we both went to the park. We ate 200 seeds each, making sure to chew them very good and make them into a paste, at the park and waited for while. We weren't sure how long it would take for them to kick in so we just waited. After about 30 minutes we began to think that we got ripped off so I suggested we go home and eat more. We got to my house and I counted out 50 seeds more for each of us. This put us up to 250 each. We sat there watching movies for about a half hour and I still wasn't feeling anything so I took 50 more. I had now ingested 300 seeds. Something I would greatly regret.</p><p>I started to feel sick so we went outside. Nature seemed to be sanctuary from the pain that the seeds brought. Inside the house I felt trapped and anxious. It felt like nothing existed outside of my bedroom walls. The only thing that helped I realized was going outside. We went to the store and bought some food. We were feeling really good at this time. I felt like I was going to die but there was a good feeling at the same time. It felt like everything belonged just the way it was. After we ate, I began to feel horribly sick again so we went back to my house.</p><p>When we reached my house I went straight to the bathroom. It was apparent that Zach and I were having very different experiences. He was having very mild visuals and seemed to be having a pretty good buzz. I on the other hand felt horrible. I was in the bathroom for about 10 minutes trying to force myself to puke. I couldn't puke and I felt closed in and anxious in the bathroom. I began to flip out. In my head I could not stop thinking that I was going to die and I had to go to the hospital but part of me was still sane and knew that everything would be okay. Finally after almost going crazy, I left the bathroom.</p><p>In my room I sat down and started to feel good again. I felt like I could never be better. I didn't feel sick anymore and the visuals really started going. This was about 2.5 hours after we started. I said 'Man, this is really great. Maybe I would try this again.' Earlier I had said I would never do this again. In about 30 minutes I began to sweat and got anxious again. I thought I was going to die again. I kept thinking that maybe I was already in the hospital dying and this was just my mistake flashing before my eyes. We decided to leave again.</p><p>We went and sat near the river and just stared out onto the water. I felt good again. I felt like everything was perfect again. It was very serene. Everything had a warm glow around it. My friend Zach started to look like a hologram. This is when I started to hit the edge of reality. I looked at the water and it didn't look real anymore. It looked like a 3-D rendering created by a computer program. We started talking about how it felt like we were sitting in a lab with a giant screen around us and the image of the world was being projected on it. The thing is I felt really good the whole time. I felt like I was coming down.</p><p>We went back to my house again but I didn't come down. I started going crazy again. My stomach was hurting and I felt like I was going to die again. I kept drinking water because I thought I was going to get dehydrated. Due to the amount of water I was drinking, I had to urinate a lot. This caused a problem because I would start whigging out every time I went into the bathroom. The walls closed in and I was sure I would die. I kept thinking of going to the hospital but at the same time I felt that I would be fine and the smart thing to do would be to let everything run its course. At this time it was about 4 hours after we had started. </p><p>I couldn't sleep because every time I closed my eyes I saw strange visuals. Long trails of arrows kept flowing and spinning around before my eyes. Not only did I think I would die but I prayed that it would happen soon. Then another fear kicked in. I started to fear that maybe I would never come down and I would have to live with these feelings forever. Quickly going from feeling good to feeling sick and horrified without warning. I started to come up with solutions and think about how I would have to pretend like nothing was wrong to live in society. I felt I would rather die than live like that.</p><p>Finally, I fell asleep. The next day I woke up feeling great. I was very happy that my experience had ended. After a few minutes of being awake I realized not all of the effects were over. My vision was still blurry. I couldn't hold myself up straight. After a few hours that stuff went away and I just felt strange. I felt like I knew more about the world and reality than I had when I started. It felt like the sun god had touched me with his knowledge. I still won't try MG again. This is serious stuff. It's not a joke.</p>",
 "year": "2005",
 "id": "45949",
 "gender": "Male",
 "timestamp": "2007-12-01T08:00:00.000Z",
 "views": "12737",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "200 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "50 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  "2": {
   "time": " T+ 1:00",
   "amount": "50 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 }
}
