{
 "title": "Magic Kingdom",
 "author": "Hiighbri",
 "citation": " Hiighbri. \"Magic Kingdom: experience with MDMA (Ecstasy) (ID 45979)\". Erowid.org. Feb 29, 2008. erowid.org/exp/45979",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA"
  ]
 ],
 "report": "<p>My friends and I were finishing up our freshman year and had decided that we were going to end it right with one last crazy weekend. Our drug of choice for the past couple of months had been E, so we managed to find some tablets from a friend that were highly recomended. We drove an hour and a half away from school to my friend's boyfriend's private beach house. When we got there realized that we had forgotten to get cigaretts so we sent one of our friends out to buy a carton. Because it was getting late, around 2 am,  we decided to take the pills first, thinking that she would have time to go to the store and back before the effects really started to hit here. So we popped them, she left, and the rest of us wwent out to the deck with couch cushions and pillows to make a huge bed under the stars.</p><p>About fifteen minutes after taking the pills we began to feel the effects. Things were harder to move. Everything felt so surreal. We all kinda looked at eachother and realized that the pills were really strong and that we were already starting to roll. Our friend arrived clutching our cigaretts and her 'fuzzy blankie' and we all sat down on the cusions and began to give messages. About 30 min later we decided to venture down to my friend's boyfriend's car to watch a DVD we had gotten from the museum of science of all of these amazing pictures of space with relaxing music in the background. It was amazing. We were just sitting there on this private island having the best roll of our lives.</p><p>Around four thirty we decided to move down to the beach. The sand and breezes and sounds of the occean were amazing. We all sat and talked about how much we loved eachother and how much we were going to miss eachother. The sky began to brighten and we witnessed the most breath-taking sunrise I have ever seen. When we realized what time it was we were surprised that we were stiill rolling as hard as we were. Nothing has lessedned in intensity. I decided to go walk the beach and find shells. Florida shells are so beautiful and soft and smooth so I was having a truly great time when my freiends yelled to me to come back. We waded into the water and, just as we were, pods of dolphins began swimming around us. It was like being in a magical kindom where anything was possible and everything was amazing.</p><p>The weekend was a perfect way to end an amazing year and it made it almost more special because some of us were leaving at the end of the year.  just wanted to share my best-ever roll. ~ciao~</p>",
 "year": "2004",
 "id": "45979",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-02-29T08:00:00.000Z",
 "views": "2537",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA"
  }
 ]
}
