{
 "id": 4598,
 "title": "Where Does This Go In the Brain?",
 "date": {
  "submission": "2006-05-26T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Mrunderhill",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "Pharms - Zaleplon",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I have taken the substance before, but tonight was wuite different. I RAILED four emptied-cut-lined capsules in one sitting. when I stood up my balance was altered, though not impaired. I had a good feel for gravity. aside from that, the rest is all new experience.",
  "When I was getting dressed and drying off from my shower, I found that without thinking about it, I began doing it in a dancing and singing manor! who would have thought. well I decided, when I noticed the peculiarity, I should let the spirit in me have its way and well just dance and sing. when I looked at the mirror, I saw a reflection of myself, and without batting an eye began to loudly talk to it. We had a very interesting discussion about the nature of this drug, and how the mirror was very facilitative at letting me talk to my split-self. Talking to myself is nothing new, but doing it in the mirror and on this substance was entirely real. The wood trim in the bathroom however caught my eye, when I saw it's color and shape variations just melting and floating down like falling water. I even found that I could control the flow with my touch. now I sit here. It should be noted that my social mind, the part which controls logic and speach, the parts that I hear and see with, these are all completely normal, and all the strange things beheld on this short trip were just believed and taken to be part of the trip.",
  "And at the same time, my mind accepts the strangeness when I can interact with it around me. and one last thing, people and creatures, although I know they are not, seem to be all around me. I have the feeling of being surrounded by life when I am alone. To think of it, this is very much like a dream. The rules that govern my present thoughts could be described only as the same rules that govern dreams."
 ],
 "erowid": {
  "id": "29615",
  "citation": " Mrunderhill. \"Where Does This Go In the Brain?: experience with Zaleplon (Sonata) (ID 29615)\". Erowid.org. May 26, 2006. erowid.org/exp/29615",
  "substance": "Zaleplon (Sonata)",
  "views": "10317"
 }
}
