{
 "title": "My First Difficult Experience",
 "author": "Shamsu",
 "citation": " Shamsu. \"My First Difficult Experience: experience with Amanitas - A. muscaria,  Salvia divinorum & Cannabis (ID 45990)\". Erowid.org. Dec 6, 2007. erowid.org/exp/45990",
 "substance": "Amanitas - A. muscaria,  Salvia divinorum & Cannabis",
 "bodyweight": "170 lb",
 "report": "<p>I have to say that this is my most pain full experiences with Amanitas.  They have always treated me well and I have come to expect a little pain, it comes with the territory.  But this time I was shown the pain that other reports have described, and I learned that the pain is not something I can just think away.  I used to think I was controlling the pain in the beginning of my trips.  I guess I was mistaken.</p><p>I took one nice completely open dried cap from my stash.  It was a lovely dark red cap that faded to a dark orange on the rim.  The mushroom came from my grade-A Siberian bag, mushrooms supposedly picked in the wilds of Siberia earlier this year.  This is my first meeting with the legendary Siberian variety.  Previous encounters were only with the yellow and white American variety.  Anyway I set the cap in the oven for roughly 7 -13min @ 215 deg F.  the crispy cap was crumbled into a cup of salsa and used to top a grilled burrito.  I usually just eat the salsa with chips but the shroom taste was very strong this time.  I topped my burrito and ate it in over the course of 10-15 min.  while I was finishing up I grabbed  of a small cap and added it to my last three bites.  So the wait begins.</p><p>Or so I thought!  In only ten minutes I started to feel a shift in my self awareness.  My inner body felt free of the external one.  Well not free but separated.  I sat down to roll a blunt, I knew that with the first signs of effects comes an uneasiness in the stomach.  Probably as much from anticipation as from the drug.  So I smoke  of it down with my girl.  Then I gathers some fresh salvia leaves from my plant as I selected cuttings to root. I selected the 16 largest best looking leaves and rolled them up into a quid and hung the rest to dry.  I took the quid and broke it in half and chewed it up and mixed my spit with it and laid it under my tong.  If I keep my tong pressed against the roof of my mouth I don't taste any of the bitterness until I spit it out.  After 10 min I spat out the first half and chewed up the second half.  I was starting to feel the salvia creep up on me when I switched to the second half.  By the time I spat out the second portion I was seeing the familiar Arches of Salvia. I see these arches first every time I use salvia.  It is as if I am going trough an unseen tunnel.  Now I am feeling free and my mind is incredibly clear.</p><p>After a few min walking through the Salvia Garden I decide to take another cap.  So I  take another Med cap from my bag and fold it into a little triangle and slice it into thinly.  I lake the slices like pills with a glass of water. Then I grab a seat in front of the TV and watch the slow relaxed Salvia visuals and end up having a long conversation with myself in my head.  Then it hits me.  The first wave of nausea.  Sweat starts pouring off me.  My stomach clamps down and I run to the bathroom.  This is much more painful than any of my other amanita experiences.  As I sit on the pot my mind starts to race and I think about what if the shrooms grew to close to some evil caps or what if the pickers didnt know what they were doing and so on.  I didn't realize all these stupid thoughts were a result of the trip starting.</p><p>I had to catch myself and calm down.  After a long sit on the pot I tried to go roll another blunt, with some hash added this time. As I walked down the hall I felt like I was in someone elses body and it didnt fit right and it was all wet and cold.  Then I realized that I was pouring down sweat. I had already dried off with a towel and was dressed.  My cloths were stuck to me and my girl was asking if I was alright.  She said I looked scared and in pain.  Well the pain was right but I wasnt scared I knew what was going to happen.  I just had to hold down the shrooms as long as I could, then go puke and trip my balls off for the rest of the evening.  Boy was I wrong.</p><p>After I sat down to roll the blunt I started to loose the ability to focus my eyes. By the time I had the blunt broken down and the weed and hash sitting in it.  I could not see past my elbow, literally I could not focus my eyes past my elbow.  Everything in my lap was a blur and I almost ripped the blunt paper trying to roll it.  I had to pass it to my girl to roll.  I have had slight blurring of my vision on other occasions but nothing like this I was almost blind.  After a wile I could see anything beyond six inches past my nose.  Then the vertigo kicked in and I almost fell down.  Closing my eyes yielded the same result as it does when your way too drunk, instant spin with nausea.  After she rolled the blunt took two hits and got cramps again.  I rushed to the pot again and had to have my girl retrieve a bucket too puke in.  I was stuck on the pot for about 20 min.  intense flatulence with diarrhea, and very painful forced vomiting.  Usually I have a very short and easy purging session. This lasted too long and it was very painful I thought I was going to shit out my intestines.</p><p>Note: I was abusing morphine for 2-3 days prior to the trip and was still constipated from it, but I was not under the influence of the morph when I started my trip, witch was supposed to clean me out.</p><p>After the bathroom I laid in bed and had very lucid dream/thoughts. If I concentrated enough I could escape into the dream world for short periods of time to escape the pain.  The cramps and nausea continued until I finally fell asleep.  I dont know when I fell asleep but I remember some very cool and scary dreams.  I awoke about 12 hrs after my initial ingestion.  My vision was back and my pain was gone.  There was a slight buzz in my head, and many trails appeared with movement and I felt good, refreshed and cleaned out.  All the excessive sweating and defecation left my body feeling clean I guess.  As I sit here writing this I am getting sleepy again, and I still see movements and trails. It is about 15 hrs after I ate the first shroom.</p><p>I dont remember the time between puking and going to sleep.  Except the cramps and discomfort. I remember walking in the woods(vision) and something about a mountain and a beach other than that I dont remember the time period that should have been the come up and peak.  My girl said I took the dogs out and left them out and wandered the house looking lost.  I wouldnt call it a bad trip just difficult.  I know and understand the ways of the mushroom and I think that is what kept me from freaking out in the beginning.</p><p>Here is a ruff timeline</p><p>3pm shroom-salsa on burrito</p><p>3:15 first sensation of altered state</p><p>4:00 first quid</p><p>4:12 2nd quid</p><p>4:45 sliced shroom w/water</p><p>5:30 first wave of pain</p><p>Sometime around 8:00  I think I fell asleep</p><p>Woke at 1am, 3am and got up at 5am to type this</p><p>It is now 5:45 am and my stomach is still a little unsettled and I am still experiencing a lot of flatulence.  Need to go eat something.</p><p>This was not to scare anyone just to inform.  Every shroom will be different. I think next time I will grind them all up into a homogeneous mix and eat 5-7 grams to start.  This might give better results or at least more even results for that bag.</p>",
 "year": "2005",
 "id": "45990",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-06T08:00:00.000Z",
 "views": "9711",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 cap",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  },
  "1": {
   "time": " T+ 0:10",
   "amount": "0.5 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 1:00",
   "amount": "8 leaves",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  "3": {
   "time": " T+ 1:12",
   "amount": "8 leaves",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  "4": {
   "time": " T+ 1:45",
   "amount": "1 cap",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  },
  "5": {
   "time": " T+ 0:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
