{
 "id": 4608,
 "title": "The Sick Combo",
 "date": {
  "submission": "2007-06-16T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Meat",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Pharms - Aripiprazole",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I was recently placed in the mental ward of my local hospital by my family for exhibiting 'delusions.' The hospital deemed me to be potentially schizophrenic but decided they cannot know until I am older, due to me being 17.",
  "While in the hospital, I was given two Abilify each day; one before bed and one in the morning. I am unsure of the actual dosage.",
  "The day after being released from the hospital I did some coke with some friends and took a few hits from a pipe going around. Within a few minutes I felt incredibly nauseated, but I reckoned the coke did it because I had not smoked very much pot at all.",
  "A few days later I smoked a joint with my friend's family and got the same sickness, only worse because I had smoked more, but I figured I was just car sick because we had been driving around all night.",
  "Another few days later, I smoked a joint with some friends. To my dismay, this made me very sick once more. Being the sleuthful debunker of mysteries that I am, I have concluded that the marijuana did it.",
  "However, I've always smoked pot. I've probably smoked my weight in pot over the last few years. Then I determined that I cross medicated myself with marijuana and Abilify because I was still getting mild side effects of Abilify (Blurred vision, for one).",
  "Cocaine still works, though, but I can't smoke pot, for a good while, I imagine."
 ],
 "erowid": {
  "id": "29637",
  "citation": " Meat. \"The Sick Combo: experience with Aripiprazole (Abilify) & Cannabis  (ID 29637)\". Erowid.org. Jun 16, 2007. erowid.org/exp/29637",
  "substance": "Aripiprazole (Abilify) & Cannabis ",
  "views": "21613"
 }
}
