{
 "id": 4613,
 "title": "Long Time Coming",
 "date": {
  "submission": "2000-09-14T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Anonymous"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Prologue. I've been taking 300mg of wellbutrin for about four weeks and have noticed that it enhances the effects of other drugs.  I have to stop at one cup of coffee, even less if i don't have food in my stomach, pot hits me a little bit more strongly, and one tablet of dramamine stuck w/me much longer than it normally does.",
  "When discussing w/ my compatriots what to take, i thought that a low dose of something enjoyable would be all right.  I did not want a full-on trip, but did want to share the trip space w/my friends.  I decided 20mg of 2ct7 would be great [this was my first time taking 2ct7].",
  "Trip. I dropped at ~9pm and started to notice effects about two hours later, coming on slowly for another couple hours.  I was giggly, happy, enjoying watching my trip partners and appreciating the mellowness of my trip.  By ~1am i was getting small, bright flashes of light in my peripheral vision when i moved my head and at ~2am visuals were strong and colourful.",
  "I was soooooo happy :).  My euphoria was mixed w/a very down-to-earth feeling of simply recognizing my good fortune.  I shared this trip w/people who i care for and who i'm lucky to have as friends.  My lover is an extraordinary person who i'm blessed to have as my life partner.  Wonderful things are happening in my life and some impending changes are even better.  I spent what felt like a very long time lying back watching the pattern on the ceiling and the lights, and marveling at how amazingly lucky i am.  And i felt expansively good, everything was oooooh-kay w/the world :).",
  "Over the course of the night, we all laughed so long and so hard that our faces were pretty achy.  Smiling hurt, but there was no way to avoid it!",
  "At 5am i was tripping hard and still amazingly happy, alongside two others of our party who were having a gooood time; our fourth was just tired :).  By this time the bodyload i was feeling was intense.  I felt dizzy when i stood up, all my muscles were tight and a couple of times i felt a very strong urge to vomit.  But i was insanely happy enough that all this discomfort didn't interfere w/my trip! At 5:30 My sweetie & i crawled off to bed. Sex really helped me relax [as well as being oh-my-god-amazing!], But i still wasn't able to get to sleep until after 7:30Am.  It didn't occur to me until the next day that smoking a little pot probably would have helped a lot, but i would have had to force myself, as i didn't have the desire to consume anything while i was tripping.",
  "Epilogue. Twice during the night I said I was having a wonderful time and the most terrifically powerful trip I'd had in years, but that i didn't want to do 2ct7 again.  It was powerful enough to scare me--what if i take it again and that trip is as horrible as this trip was fantastic? Normally i don't do much 'what-if'ing of that variety, because i don't find it productive.  'What if i have the most horrible trip i could possibly have on this drug?' Is a not very useful extreme and highly unlikely, given the amount of control i have over the environment in which i trip.  I will, in fact, probably do it again, but it won't happen for a good long time.  This trip set me free for 8 solid hours to feel good and be happy...And as i'm writing these words, i'm thinking to myself, 'then why is there any question about whether or not you'll take it again? Shit yeah, you will!' Well, at the very least, it's not a closed issue :).",
  "The trip I had was exactly what I needed, because it's been a long time since I've relaxed enough to feel really good.  It's been a long time coming.",
  "Huzzah!"
 ],
 "erowid": {
  "id": "2966",
  "citation": " Anonymous. \"Long Time Coming: experience with 2C-T-7 (ID 2966)\". Erowid.org. Sep 14, 2000. erowid.org/exp/2966",
  "substance": "2C-T-7",
  "views": "6000"
 }
}
