{
 "title": "Stimulating Indeed!",
 "author": "sasquatch",
 "citation": " sasquatch. \"Stimulating Indeed!: experience with Modafinil (Provigil) & Venlafaxine (Effexor) (ID 46143)\". Erowid.org. May 15, 2006. erowid.org/exp/46143",
 "substance": "Modafinil (Provigil) & Venlafaxine (Effexor)",
 "bodyweight": "195 lb",
 "header": [
  "DOSE:",
  "200 mg",
  "oral",
  "Modafinil",
  "",
  "",
  "150 mg",
  "oral",
  "Pharms - Venlafaxine",
  "(daily)"
 ],
 "report": "<p>Day one</p><p>Time / Experience:</p><p>I am not much of a recreational drug user, and a former nicotine addict. Currently the only drug I use on a regular basis is caffeine, which has, for the most part, lost all its effectiveness for me, even though I am still addicted to it. So I am a new user of Modafinil (for Narcolepsy), never used it before, or any other amphetymine-type stimulant. My tolerance should be very low. In addition to Provigil I have been on Effexxor XR at 150mg/day for my mild depression.</p><p>My doctor suggested Provigil for my excessive and uncontrollable sleeping spells during the day, and here is my report of its effects on me the first day:</p><p>(baseline=10:15am): took one pill of 200mg Provigil with 6 oz of water. Feeling very groggy and sleepy now, as usual.</p><p>(11:15am): No stimulation or increased wakefullness yet, after one hour. Still extremely tired, same as before, a little disappointed. Thought it would begin to kick in sooner than this.</p><p>(11:45am): still not much increased wakefullness. Perhaps a LITTLE bit of an energy boost coming on, almost inperceptible, but definitely something there. Just slightly above baseline.</p><p>(12:15pm): It's Finally Kicked in!!! :)  Definitely becoming more alert now. As an experiment, I leaned back in my chair and rested my head on the back, staring at the computer screen. Normally my eyes would immediately become heavy and a strong feeling of drowsiness would come over me in a matter of seconds. About a minute or two later, I would typically be asleep. Now, after 2 hours of Provigil, when I perform the same experiment, I feel no heaviness of the eyes at all. Eyes wide open, with no feelings of drowsiness. Feel perfectly alert, but not overextended, hyper, or jittery. Feel like a normal, well-rested person. For now, 120 mins seems to be the point of beginning of the effect.</p><p>***Side note: enjoying work all of a sudden. Don't want to take lunch yet, I want to get more work done. I am in no rush to take a lunch break.***</p><p>(1:15pm): The last hour went by very quickly, my work was performed at lightning speed. Concentration is effortless. Sudden confidence in mental abilities. Level of alertness same as an hour ago. No side effects yet, not shaky or nervous (like I get with too much caffeine). Feel quite relaxed, but do not feel tired. There are no intoxicating effects with this drug at all. In fact, all it does is make me feel well-rested and alert. However, it is easy to see how this drug can be abused: by students who want to pull all-nighter cram sessions, businessmen who need to wake up for a conference after flying across several time zones. When I think about it, the possible applications for this med are endless.</p><p>***Side note: I took a break and went outside. Noticed that everything looks clearer and sharper, as if everything is more in focus. Is this possible? Placebo? Sharper mind means sharper eyesight? Hmm***</p><p>(4:30pm): Still very attentive. End of workday, work was virtually effortless. I love this stuff! 200mg seems about right for me, but I hope I don't develop a tolerance too soon. Still wide awake, and happily typing at my PC. Unlike amphetamine-based stimulants, Provigil keeps me alert and awake, but not hyperactive. I don't feel like I MUST do something ALL THE TIME. It allows me to wind down and relax after work (yet stay awake). Not many stimulants can do that.</p><p>(11:00pm): up till now, the med kept me awake very well, with no side effects. I am beginning to feel sleepy again, which works out well because I'm going to bed now anyway. GREAT first day of this med, can't wait to take it early in the A.M. tomorrow!</p>",
 "year": "2005",
 "id": "46143",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-15T07:00:00.000Z",
 "views": "19362",
 "dose": {}
}
