{
 "title": "I Punched a Cop In the Face",
 "author": "Gobs One",
 "citation": " Gobs One. \"I Punched a Cop In the Face: experience with Brugmansia (ID 46179)\". Erowid.org. Sep 4, 2006. erowid.org/exp/46179",
 "substance": "Brugmansia",
 "bodyweight": "255 lb",
 "report": "<p>Me and my crew had all heard about the plant we did not know how it really looked but we knew it was shaped like a bell. One day the homie Bos said he had found it and there was about 25 other bushes. He showed me the plant and off I went. We snatched about 6 to 10 flowers Me, Wombat, Bosone, and Kelso we also brought a propane powered stove and a big pot and water. I dont recall around how much water we used but I filled a 20.fl.oz bottle we filled four of them they all said that would save theirs for the following day but I said fuck it!</p><p>I want to get high now so I drank it all. At first I was like this shit sucks around 20 min. Later I felt like I drank a bottle of whisky I felt so drunk it was fun at fist the walk home seemed short I remember getting home I went to my room I took a bite of a chicken I had left over from dinner  when I tried to swallow it I choked on it my throat was so dry like cotton mouth but worse I felt so drunk that I got tired and I said to my self thats it Im done I laid down to sleep that was the worst mistake I ever made I dont remember waking up I had a flash back after and see my self walking right into the wall in my room but I dont remember nothing really only certain things.</p><p>My mom had seen me tripping see tells me that she asked me 'hey whats wrong with you'?</p><p>I turned and looked at her and said dont worry about it and slammed the door in her face she ended up calling the cops because she didnt know what to do my older brother was there and my sister in law she said that she saw me in the rest room with conditioner all over my hands and face I was really tripping then.</p><p>By the time the cops showed up  I was seeing things my eyes were all blurry I could not focus and one of cops told me hey do you know were youre at? I said sure we are at the police station when we were in my front room then the cop asked me have a seat and of course said no but you see cops dont take no for an answer so he grabs a hold of me and sits me down I reacted and punched him right in the face. At that same moment I snapped out of it I heard my mom yell stop!! And my brother say the same the cop whips out his beating stick I remember seeing it click I heard it also from there my mom took me to the hospital with to cops as escorts but I dont remember the ride there but I recall some things like seeing rats every ware seeing objects and shapes and all this might seem fun but it wasnt because I didnt enjoy the high any ways I spent about 3 days tripping in the hospital the come down was sick I felt weak for 2 days.</p>",
 "year": "2003",
 "id": "46179",
 "gender": "Male",
 "timestamp": "2006-09-04T07:00:00.000Z",
 "views": "14420",
 "dose": [
  {
   "time": "0",
   "amount": "20 oz",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(tea)"
  }
 ]
}
