{
 "title": "A Walking Time Bomb",
 "author": "More Cowbell",
 "citation": " More Cowbell. \"A Walking Time Bomb: experience with Tramadol (Ultram) (ID 46216)\". Erowid.org. Jun 24, 2007. erowid.org/exp/46216",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "225 lb",
 "report": "<p>From 1998 to 2003, I was a daily user of Ultram.  At the time, given a choice between hydrocodone or oxycodone and Ultram, I would've taken the Ultram almost every time.  I was first given Ultram by my doctor for migraine headaches.  After taking the first dose, I was instantly in love with the substance.  Despite the typical opioid side-effects like itching, nausea, etc, I found tricks to overcome vomiting. For instance, if I took Ultram in a large dose (i.e. over 400 mg daily), spacing the doses over a couple of hours instead of doing it all at once, vomiting isn't as likely to occur. </p><p>Ultram gave me a full body buzz like no other I had felt.  It was better than sex, which was a good thing since reaching orgasm with tramadol is almost impossible in high doses.  My affair with Ultram continued for several years, fed by a relative who was able to get me free samples of the drug, as she worked at a doctor's office and the pills are not a controlled substance.  At the height of my usage, I was taking over 700 milligrams a day.  For those who doubt the addictive quality of tramadol, I can attest to severe withdrawal symptoms when I came off the drug for a week or two every month.  Body aches, headaches, trembling, nausea and ungodly diarrhea.  Depending on my average dose, the withdrawal could be as bad as coming off Lortab.  But despite the drawbacks, the feeling I got from Ultram was worth it for the feeling it gave me. </p><p>The end of the road, however, came for me in 2003 following three different seizure episodes.  One of the side-effects of Ultram is a lowering of a person's seizure threshold.  While I had never had a seizure prior to taking tramadol, it didn't matter.  I was standing each time I seized, and the fall from each episode broke vertebrae in my back.  I ended up with six compression fractures in my back, one of which failed to heal and required a spinal fusion surgery.</p>",
 "year": "2003",
 "id": "46216",
 "gender": "Male",
 "timestamp": "2007-06-24T07:00:00.000Z",
 "views": "13122",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(daily)"
  }
 ]
}
