{
 "title": "The World that Wasn't There",
 "author": "Lost It In Smoke",
 "citation": " Lost It In Smoke. \"The World that Wasn't There: experience with Cannabis - Hash & Calea zacatechichi (ID 46254)\". Erowid.org. Jun 22, 2006. erowid.org/exp/46254",
 "substance": "Cannabis - Hash & Calea zacatechichi",
 "bodyweight": "10 kg",
 "report": "<p>I had just received my big bag of calea and 100 HBWR seeds and I was stoked. I had read as much as I could about calea and I realised the idea was not to try to be blasted into space, but to allow the effects to manifest themselves gently, as I am getting to sleep.</p><p>I packed a joint with its crumbled leaves, and 2g of hashish- let me make it clear that this is not the beautiful exotic form, but rather the cheap hash the is so unfortunately found in the poorer areas of the United Kingdom (of America) haha. After a day of light smoking and drinking I was up for the effects of the drug. At about 11:30 I went outside and sat under a birch tree, that was so beautifully being swayed by the mesmerising nighttime breeze that the Atlantic so kindly brings for us. the joint burnt beautifully, and I have to say I was rather proud of it, seeing as I had to make a cone first and then pack the drug in.</p><p>Within 5 large tokes on it I was feeling an odd effect. Clearly not thinking this would be the calea affecting me I put it down to sleepiness and cannabis intoxication. I smoked and smoked and smoked; the joint lasting at least 20 mins at this point. I looked up, and one tree looked like the perfect form of any tree I had ever seen. After staring at it for a fair while, I looked around to everything else and my vision was mildly more beautiful than before. As I stopped looking around, I suddenly felt that apart from what was directly in my view, there was nothing else in this reality, and I had absolutely no fear of this. In fact it was incredible because it did not feel physically incapacitated so could remind myself I was still on the same planet!</p><p>I was not expecting any strong effects during my waking hours, but had done, so I decided to leave the last 1/4 of the mother of a joint n hit the hay. I led in bed, feeling the effect of the cannabis, which was making me feel rather floaty, but none of the other effects I was having, could (in my experience) be attributed to hash. I was having auditory hallucinations (mosquitoes around me, which did not bother me much, people talking, but not being able to work out where the sound was coming from- which did not seem to be an issue at all). I kept having closed eye visions of events happening- like parts of dreams, and my mind was just running through a few ideas it was having. They were like very mild hallucinations, because upon opening my eyes, I could just see my room.</p><p>It took me quite a while to get to sleep, and I put this down to me being a little over excited about the dreams I was going to have. As it was, it turned out me dreams were actually not too amazing or vivid- a factor contributing to that could be the hash I smoked having a rather sedating effect after half an hour or so.</p><p>So... sure Ill try it again- but I will try it when I sleep after a HBWR session- and I will smoke some high grade Budz thru my pipe.</p>",
 "year": "2005",
 "id": "46254",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-22T07:00:00.000Z",
 "views": "10029",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": "2.0 g",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(tar / resin)"
  }
 }
}
