{
 "title": "Jaw Clenching All Nighter",
 "author": "Fry",
 "citation": " Fry. \"Jaw Clenching All Nighter: experience with Dexedrine (ID 4628)\". Erowid.org. Dec 29, 2001. erowid.org/exp/4628",
 "substance": "Dexedrine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>\nAmphetamines are a wonderful and awful drug at the same time.  My experience of taking it left me with mixed feelings.</p><p>I took 60 mg of dexedrine pills. at around 6:30 p.m.  I was going to a bonfire dance where everyone got drunk and blazed, but I had something else is mind. speed.  15-20 minutes after I took the pills, I was watching TV with my friend at home before we went to the dance.  I was just relaxing on the couch when I noticed that I felt really good just sitting there, relaxing, chilling, I felt like I was the shit, just real cool and relaxed.  I got a feeling of 'well-being' like everyvody says.  I was thinking about the dance the whole time and geting really excited about it.</p><p>We got to the dance at 7:30 and I was just hanging outside with a bunch of friends. I was real happy and excited to talk to them, i felt real confident talking to them and it was cool.  After about 15 minutes, we went it and started dancing.  The memory of me dancing and just feeling the music is really great. </p><p>I think speed left me remembering and really appreciating the music and the dancing.  I was also able to talk to many people comfortable and lots of girls too.  It felt realy good to just chill with girls and have this confidence come out of nowhere.  Throughout the whole dance I had drymouth and My legs were shaking.  I just wanted to dance.  When the bonfire was lit around 11:00, people were hanging out and drinking and celebrating.  I was extremly social and having so much fun talking to everyone.  Watching the fire too was wicked cool. </p><p>I went home around 11:45 and I could tell that the fun effects were gone, I was left with insomnia and jaw clenching.  I COULD NOT GO TO SLEEP THAT NIGHT.  it just would not happen.  Also I didn't clench my jaw on purpose, it's just that I couldn't stop biting my jaw to a beat of a song.  I would do it for a minute then realize I was clenching my jaw and I would stop.  But then a minute later, I would somehow forget and let the beat take over my jaw and I would be biting again.  IT was wierd.  I was exausted for the next 2 days or so.  It wasn't like a hangover.  I didn't feel like crap.  I just had some fatigue and I didn't feel like doing anything active, just sitting at home watching tv, doin nothing.  It took a toll on my body, not being hungry and being tired after and not sleeping one night, but looking back on all the fun I had, I would do it again, not too often, but for the right occasions.</p>",
 "year": "2001",
 "id": "4628",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-29T08:00:00.000Z",
 "views": "28627"
}
