{
 "title": "Snow Globes and Easter Eggs",
 "author": "Najwa Abella",
 "citation": " Najwa Abella. \"Snow Globes and Easter Eggs: experience with DXM & Cannabis (ID 46290)\". Erowid.org. Jan 8, 2007. erowid.org/exp/46290",
 "substance": "DXM & Cannabis",
 "bodyweight": "130 lb",
 "report": "<p>This isn't an account of one trip, but a collective pool of my fantastic exploits on Robo, otherwise known as Robitussin. I'm going to weave some of the best features and parts of my robo trips into one story though, as trying to leap back and forth between different experiences could prove to be aggravating for the reader, and I want people to stick around and read this. No parts of the story will be fabricated.</p><p>On every experience I opt to swallow an only mildly excruciating 20 pills of Robo Cough and Cold, rather than participate in the chugging contest of the liquid syrup (being female, I have no inclination to prove how low my balls hang). In any matter, on every occasion I make sure I get Robo without guaifenesin, as it will make you vomit, among other more serious things (I vomit anyway, but taking the guaifenesin is like holding up a slab of meat to the wolves).</p><p>After ingesting the robo, I packed a couple of bowls with my friends A, B, C and D. I'm not sure if the weed intensifies the experience (as I've never tried without), but its fun with it.</p><p>After smoking I lied down and listen to music. I started lying down when Im coming up on Robo because I don't throw up this way. Also, when I'm lying down I can't tell I've lost balance and coordination, because of this I can only rely on the gradual unraveling of my sober consciousness to prove I'm fucked up. In my experience, this mind-dependant onset is so much better than running around to find an altered state; its subtlety is key to contributing to a profound experience.</p><p>I've never cared much about the time when robo starts to take affect, but I'd say it's about 40 mins after ingesting the pills. At this time I started to feel really giddy, it's a characteristically kid-like feeling, where everything you do could turn into an adventure.</p><p>My friend A likes to fuck with people to make them trip, but I didnt know this at the time. When he saw my eyes glaze over in that conspicuous blissful stupor he turned on his strobe light and some Beatles music (67-70 to be exact) and just started messing around, doing the robot and shit. But a little into Strawberry Fields Forever', his moves became more calculated and considerate. It was the most amazing theatrical performance I had ever experienced, I felt like he was some live-action old time movie. Id occasionally go out to touch him, but would fall back onto the bed before ever reaching that sort of tangible reality check; it was more fun like that.</p><p>After his show we smoked a couple more bowls and I decided to go up to the trampoline with A and B. The robo had made most of my body go a little numb and my vision a little blurry (along with sobriety), so after jumping around a little we started doing things just to see how it felt. At one point we held hands in a circle and played a game of ring around the rosie, just without the words. Instead we ran as fast as we could, keep in mind our drug-induced clumsiness, around and round until I had convinced myself that our childs play was actually a skydive, except I stayed in the clouds making aerial figure 8s long after wed fallen to the ground.</p><p>A little later though, I came back to the trampoline, and just sat looking at the stars. I started rambling about things that didnt make any sense, until I could trigger imagery to go along with my words. I finally got it when I started talking about how the stars sorta looked like snow, and how the bars and netting around the trampoline made it seem like we were all in a snow globe, and that if we bounced around, it would be like we were just figurines in a snow globe. The strange thing was, was that when I started to bounce A and B did also. I loved how we were all in it together, no judgments and no fabrications. We were just completely determined that we were figurines in our frost encumbered world.</p><p>I went along with this group enthusiasm and quickly determined we were actually in an Easter egg, and that the trees encompassing the trampoline was just grass, and we had been hidden, and that when we were discovered, we had to be really happy for our finder. So when it happened, we all put our hands and feet in the air and smiled our hugest smiles, screaming and hollering our truest congratulations.</p><p>After things got settled down a little more C and D had joined us on the trampoline, and we all just started talking. I didnt know C that well, he was a friend of Ds that wasnt part of our regular round up, but he was the closest to me so I started talking to him.</p><p>Its really weird the things youre willing to talk about on robo. Its like a truth serum and any walls that youve built for yourself in respectable society come crashing down. I remember specifically talking about how I dont feel like I fit in with how sexual people are, and how strange it was to me that people build entire lives around trying to get some, and C admitted to me how he felt the same way, and that its a big reason guys feel insecure about themselves, because they want to seem cool for the female species.</p><p>I bring this up because I had always kept my asexuality to myself until that point, and when we got into other conversations and more intimate details I felt like I wanted to be with C for the rest of my life. That he was someone who understood all of my peculiarities and could make peace with them.</p><p>I always feel this way on robo at some point (with anyone Im with), and even if its imagined then, its a feeling that I long for more than anything in the world now.  It has become my purpose to find that sort of deep and platonic connection with someone, because it is the most overwhelmingly securing feeling Ive ever experienced.</p><p>After some more major bonding we all go inside and watch movies until we pass out, and remain comatose until our adventure continues. The day-after robo ritual, which honestly deserves a headline of its own, Ill wrap it up with a quick summary:</p><p>See, the day after robo, you still have a little retarded glow about you, and instead of letting it annoy you with actually trying to do something productive, my friends and I have decided its really just an extension of the whole robo experience.</p><p>So A, B and I get a bunch of weed, pack up the car with water and head off to McDonalds. We sit in a far off corner booth, and let A do his dead on impressions. He opts for a conversation between old friends Arnold Schwarzenegger, George Bush, and Bill Cosby. And the thing is, A has this sort of Jew fro thing that wiggles on his forehead whenever he gets really into Arnold, and thatll usually keep B and I entertained for hours. And basically for the rest of the day we smoke weed and take nature rides in the car listening to happy Beatles music until were back to normalThe End.</p>",
 "year": "2005",
 "id": "46290",
 "gender": "Female",
 "timestamp": "2007-01-08T08:00:00.000Z",
 "views": "11719",
 "dose": [
  {
   "time": "0",
   "amount": "20 tablets",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
