{
 "id": 463,
 "title": "Another Good Time",
 "date": {
  "submission": "2005-07-03T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "LSD Pirate",
  "gender": "Male",
  "weight": "300 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(freebase)"
  }
 ],
 "report": [
  "<p>The town was always flooded with good pot and hash but once in a blue moon some one would come in from the city with some hard drugs, usually crack or coke.  I had had a hit a few months before buying the half gram so I had a good idea what it was going to be like.",
  "After getting wind that there was a coke connection that would be around for a bit (the coke sucks but hey, it's coke) I wanted to get some, until he also mentioned that he had some rock as well but that was probably only going to be around for a little while. So me and a good friend bought a half gram of crack for $65CAN and scraped tiny chunks of it off and put each one on top of a bowl of pot (as we had none or knew how to make a crack pipe)and lit it good and hard. ",
  "As soon as I inhaled it and was holding it in I could feel it instantly start to go to my head, like a rush, real high real fast.  The best way to describe it was just pure rush to the head, it happens so fast words almost can't describe it.  But as soon as that rush was gone and the crack had onset it seemed like the high was going away right aways, and I just kept wanting that rush again and again.",
  "The plan was to smoke the half gram throughout the evening, a little here or there, but once I started I couldn't stop.  I kept topping the hoots one after another, taking bigger and bigger each time, until when the whole rock was done it was just monster chunks I was taking at a time. ",
  "Before we knew it, 45 minutes later the whole thing was gone, and I was 35$ poorer and as the high left I felt shittier than I did when I started.  It's something thats good for a special occasion, but I wouldn't make it a regular habit of smoking crack or I'll never know where I'll end up.</p>"
 ],
 "erowid": {
  "id": "10865",
  "citation": " LSD Pirate. \"Another Good Time: experience with Crack Cocaine (ID 10865)\". Erowid.org. Jul 3, 2005. erowid.org/exp/10865",
  "substance": "Crack Cocaine",
  "views": "25593"
 }
}
