{
 "id": 4633,
 "title": "Burning on the Inside",
 "date": {
  "submission": "2004-01-04T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "cricket",
  "gender": "Female",
  "weight": 43
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablets",
    "quantity": "6"
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "The internet bluntly has the effects and side effects of all common (and not so common) drugs.  Learning more is just one click away.  So, before my friends and I were going to try Triple C (Coricidin Cough and Cold) we researched what exactly we were about to put in our mouths. There was a special warning about triple c, we read it, acknowledged it at first, but still we disregarded all of this and went ahead: two girls (95lbs. and 110lbs.) taking 6 pills each.  This dosage, although exceeding use when taken for medicinal purposes, is not an unreasonable amount for someone taking triple c in order to intoxicate him or herself.  Our friend, 130 lbs, took 7 pills (this was the second time she had tried triple c).  Beforehand, we were nervous about our intake--we were hesitant.  But, we thought to ourselves, its New Years Eve!  Why not?  We were smart, responsible teenagers who went to one of the most competitive academic high schools in the country.  We were smart enough to make good decisions, right?  As a matter of fact, our biggest worry was that we would fail our finals two weeks later--we were not the least bit worried about the immediate effects it would have on our bodies. ",
  "The 6 pills took approximately 1 hour to take effect.  The first feeling experienced was drowsiness.  All of us felt a lot of sensitivity to light, dizziness, and inability to hold still.  Reading aloud was incoherent, and we slurred our words whenever we spoke.   Everything was loopy; when we jumped it felt as if we were staying in the air for minutes.  We felt hot, feverish and confused.  Our faces and limbs were twitching.  There were four girls--three of which were tripping, and the other was plastered (half a bottle of rum on her 110 lbs frame).  Still, towards the end she was more sober than us, having to keep us still and awake. ",
  "The crash is by far the worst part of the trip.  For the two first time users, the crash was traumatic, but the second time user felt nothing (except becoming increasingly sober).  One first time user (weight: 95 lbs) locked herself in the bathroom, and refused to open the door.  We kept banging on the door, asking her what was wrong.  Finally, she answered (clearly in agony) with, 'I'm burning on the inside.'  Well, this made the rest of us freak out even more (considering we were already tripping a little).  We banged on the door, threatening to break it down, when finally we heard the toilet flush and the door open.  Our friend came out, drenched with sweat and shaking.  Her chin was quivering again.  She thought that she was going to die.  We all thought that she was going to die.  The almost-sober-drunk girl took her downstairs, where she collapsed onto the floor, shivering, but boiling.  The other first-time-user felt fatigued, but our friend told us never to fall asleep during or directly after a trip (good advice!).  She remembers closing her eyes and shaking, then being woken up.  Over and over again. ",
  "Later, we had all cooled down a little.  The 'burning on the inside' began to cease, but she still says she felt as if she was going to die at any minute.  After this, I called a friend who said that someone told him doing Triple C was worse than taking 4 E.  This scared us even more, but we tried to contain our fear.  We hadn't died. ",
  "Even though we are fine now, our experience with Triple C has made us aware of the dangers of drugs.  There is no worse feeling in the world than feeling that you are going to die--that you are 'burning on the inside.'  Although the trip was incredible--we were flying, we had no cares in the world--the crash was not worth it.  Even more, the risk is not worth it.  We could have died. ",
  "Teenage years are a series of decision-making.  Each decision made has great impact on life ahead.  Don't fuck it up."
 ],
 "erowid": {
  "id": "29711",
  "citation": " cricket. \"Burning on the Inside: experience with DXM (with CPM) (ID 29711)\". Erowid.org. Jan 4, 2004. erowid.org/exp/29711",
  "substance": "DXM (with CPM)",
  "views": "28130"
 }
}
