{
 "id": 4636,
 "title": "Always Wanting More",
 "date": {
  "submission": "2007-11-10T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Speedy",
  "gender": "Female",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Amphetamines",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Pharms - Methylphenidate",
   "form": ""
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Cocaine",
   "form": ""
  }
 ],
 "report": [
  "Going through middle school and part of high school, I was always very un-happy with my weight. I ran cross-country, but was always hungry. I saw an advertisement in a magazine for Adderall, and I saw that a main side effect was loss of appetite. I asked my parents about getting tested for ADD and they said no. After my parents divorced, I asked my mom and she said I could get tested. I made the appointment with my doctor, and then my doctor told me that I would have to go to a specialist to get my testing. I went to her, and I acted as 'ADD' as possible. Sure enough, I was diagnosed with ADD. I was very, very excited to finally get it. My normal doctor wanted to put me in Strattera instead of Adderall, and I had to fight with her for 2 months to get it. Once I got the Adderall, she gave me 25 mg pills.",
  "I absolutly love Adderall. The first time I took it was at about 8 p.m., because I wanted help with my homework (stupid move). I snorted 1 pill, and took 2 other normally. I took so much because I heard from someone that the first time you ever do any type of speed is the best effect you'll have cause your body hasnt ever had anything like it, so I wanted to make it REALLY good. Holy shit was it ever. I finished my homework in like 10 min., and then I cleaned my entire room. Then I cleaned my bathroom, and basement. I came upstairs at 3 am and started getting the vacuum out because I wanted to vacuum my living room, but then I didnt cause I didnt want to wake up my mom.",
  "I didnt sleep at all that entire night, and the next day around 8 am, I took another and wasnt tired at all throughout the day. I was so happy and awake! After that I would take it in the morning, and have a smile on my face for no reason. Normally when would I walk into my first class of the day, I would be tired and just sit down. On the Adderall, I would be energetic and happy, and talk with people outside of class. It made me very confident and positive. I never ate on it either. I could go up to 6 or 7 days without eating a single meal. After that I would finally break down and eat something. Before being put on the Adderall, I was around 175 lbs. I am 5'10'', so I was not obese, just insulated if you will.",
  "After a few weeks of taking the Adderall, I noticed that just 1 pill a day wasnt as good as it used to be. So then I started taking 2 or 3 a day. Sometimes I would snort it in the morning if I felt like it. I started running out really early, but I was the one to make the appointment with my doctor, and my mom never came with me. My doctor is so stupid that she never noticed that my appointments were 2 weeks earlier then they should have been.",
  "I started loosing a lot of weight. In 3 months of taking the Adderall, I was down to about 140 lbs. It was the most happy I had been with myself ever. I was so confident with myself, and everyone complimented me about how good I looked. I did notice that I was getting a little strung out though, I was rarely sleeping, and the Adderall was helping less and less, even though I was taking up to 4 pills a day (100 mg/day). I always got really bad dry-mouth too, and would drink 6 water bottles during school (my water bottle is 32 oz. so thats like 192 oz a day). I was also really dependent on it, and would be depressed if I didnt take it.",
  "My doctor soon noticed my weight loss and flipped out on me and said she couldnt believe she let this happen and get so far and shit like that. She told me that if I didnt gain 10 lbs in 2 weeks, then she was stopping my treatment completely. No way was I going to gain all that weight just for her, so I didnt and she got pissed. She put me on Concerta, which I refuse to take. I hate the effects it gives me. On it I feel sad and introverted. It doesnt help me concentrate, its like here take this pill so you will feel like shit and will be really sad, no thanks.",
  "This kid I know told me about how his sister used to take Ritalin and he did too but he stopped, and they still had a ton in his house. I was interested (of course) and he sold me a bottle of 20, 20mg. Adderall and 60, 10 mg Ritalin for 5$ (haha GOOD deal!). I took all of the Adderall, and started on the Ritalin. I always had thought that Ritalin was more of a rush then Adderall, and was better. For me it wasnt at all. I didnt feel anything really, except when I snorted it. I felt slightly 'up' for 20 ish min. and that was it, like a really weak line of coke. It didnt help w/ the appetite either.",
  "Then a friend asked me if I wanted to try Coke with her, and I was all for it. We bought a gram and shared it between 3 of us. I guess it was really bad coke cause it didnt do much for me. My pupils got really dilated, I started sweating, I was a little energetic, but that was it. People always said that coke was amazing and wonderful, but it wasnt for me. I was bummed, and we got another gram a couple days later to see if it would be better this time. It wasnt at all and some of our other friends found out what we were doing and got all mad, and the whole situation was just fucked up.",
  "I kinda gave up on coke because I wasted a lot of money and my only source was really shitty coke. Since then I have gained back some weight and Im really sad about it. Without the Adderall, I feel slow, stupid, and depressed. I was taking to my friends step-mom about drugs once and she said 'I never wanted to do them because I knew I would like them- people dont shoot heroin in them because it hurts, it feels fuckin good. I know I would like it too much, so I never will even try it.' I thought that was cool of her because I know that now I always want some kind of thing to speed me up. Its boring being normal."
 ],
 "erowid": {
  "id": "29724",
  "citation": " Speedy. \"Always Wanting More: experience with Amphetamine (Adderall), Methylphenidate (Concerta & Ritalin) & Cocaine (ID 29724)\". Erowid.org. Nov 10, 2007. erowid.org/exp/29724",
  "substance": "Amphetamine (Adderall), Methylphenidate (Concerta & Ritalin) & Cocaine",
  "views": "11545"
 }
}
