{
 "id": 4637,
 "title": "The Matrix, The Platform, and Aftermath",
 "date": {
  "submission": "2004-03-11T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "anonymous",
  "gender": "Male",
  "weight": "167 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "958 mg",
   "administration": "oral",
   "substance": "DXM"
  }
 ],
 "report": [
  "This was my 3rd or 4th tryst with DXM. Me and my friend were gonna try to hit 1000mg. (He did, I was just 42mg under). We got to my friends house with the supply of DXM products. I proceeded to slowly take the pills while watching TV, my friend chugged his two bottles and swallowed his pills slowly along with me. I was done taking the pills. I chugged half the bottle of syrup and saved the rest for later so that I could trip harder by introducing the DXM more slowly. We shut off his lights and watched TV until the trip started. When it really hit, I could see in matrix code. I was convinced that I was The One. We layed down on his big bed and started the CEV parade. I don't remember anything of what I saw at first. I opened my eyes after what could have been 10 minutes. 10 minutes was an eternity by this time. I chugged the rest of the bottle (I thought there was a bit left in it, but the next day there was just some water [we still haven't figured out how water got into it]). I went back to my spot on the bed and closed my eyes again.",
  "I was in the matrix universe again. I was the machines, but in a different way. I was a giant omnipitant being made up of all the machines. My robo itch also affected my trip. As I itched my body, with my eyes closed, I could see the giant machine version of me scratching itself. As it did this, patches of little machines would fall off the places that were just scratched. I had glimpses of Trinity and Neo, but they made no sense. I could see snapshots of their faces, but they weren't actually there in my machine world, yet I could feel their presence. I opened my eyes. Everything in the room that I could see was zooming around. My world was spinning. I told my friend to grab his trashcah, and I hurled.",
  "All the DXM had already been absorbed by my body so puking didn't decrease the trip at all. I layed back down and closed my eyes. I was being carried away on a platform of purple glowing heads. The heads were Naiobe, Morpheus, Ghost, and some other people. I was seeing myself being carried away in the third person. I was watching from above. The platform carried me through the wall I was lying against, and I could feel myself go through it even though I was no longer in my body. I'm not quite sure what happened for a while after that, but when I was aware of everything agiain, I was convinced I was a female director directing elaborate underwear commercials. I was directing one particular commercial about dalmation pattern underwear in a ballroom that kept changing size, shape, and even began to defy reality with it's warpings. I opened my eyes and asked my friend if he was still human. He mumbled a response that I took as yes. I closed my eyes again and continued directing my commercials.",
  "I opened my eyes again. I yelled for my friend to get the bucket, but he didn't know what it was. (I found out later that I had been yelling 'barrel!!' and he didn't understand what a barrel was.) I puked all over his bed, and then began on a trip so hard that I don't even remember what it was. I came too and I had been lying in my puke. I yelled for the bucket again, and he gave it to me. I puked again and again and again, my muscles were clenched so tightly from the constant puking that I accidentally soiled myself (#2, ladies and gents). After this, I told my friend I wanted to take a shower because I was covered in puke and feces. He didn't understand why I wanted to bathe. So I told him over and over that I needed to. He continued to not understand why.",
  "Eventually my dad called, (we took everything at 7, it was only 9 but it seemed like days had passed) and I told him that I had puked and needed to come home. I'm not sure how I managed to talk to him. I continued to sit around and stare at my friends radio clock until I heard my dad honk. I managed to get up and grab my stuff and walk to the door. I'm suprised he didn't know I was high. I had the stiffest robo movement I've ever heard of. I got home and showered. This was a really interesting part of it all.",
  "I was standing in the shower, and I was getting wet, but I don't remember the water ever hitting me or ever even being on. I got out of the shower and looked in the mirror. I was definitely wet and definitely clean from my excrement. I tossed my clothes in the laundry and ran back to my room, hit my matress, and passed out immediately.",
  "It was definitely a worthwhile experience even with the embarassments. I'd do it again, and I plan to hit the 1308mg mark next time.",
  "One more thing. We were listening to Infected Mushroom songs the whole time we were tripping, and at one point we both heard a 5 year old british girl in one of the songs. A few days later, my friend listened to all the songs and could never find a little girls voice in any of them. It's a tad freaky to share an experience with someone on that level.",
  "I'd also like to say to not use the new robatussin gel caps. They cause extreme nausea compared to the syrup.",
  "Thanks"
 ],
 "erowid": {
  "id": "29725",
  "citation": " anonymous. \"The Matrix, The Platform, and Aftermath: experience with DXM (ID 29725)\". Erowid.org. Mar 11, 2004. erowid.org/exp/29725",
  "substance": "DXM",
  "views": "8050"
 }
}
