{
 "title": "An Awakening from Depression",
 "author": "Dumaro",
 "citation": " Dumaro. \"An Awakening from Depression: experience with MDMA (Ecstasy) (ID 46373)\". Erowid.org. Nov 27, 2007. erowid.org/exp/46373",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "175 lb",
 "report": "<p>For years I've experienced various levels of depression (3 years). For the first 2 years I was diagnosed with major depression after two attempts at my own life. I sought treatment and was put on zoloft. During the 6 months when I attempted a 'cure' through these methods I was not doing any drugs (including alcohol). I soon discontinued this aid as the long term effects of zoloft had not presented their usefulness.</p><p>3 years later at Burning Man 2005, a friend asks me if I would like to try ecstasy for the 'burn.' I thought about it for about 14 miliseconds and prompted to take the little blue pill that would alter my life so greatly. This was my first 'trip' in about a year (maybe longer), and my first on ecstasy.</p><p>The experience was purely positive; none of the 'downs' that people associate with ecstasy found me. I went to the 'burn' (a huge bonfire/rave/spiritual experience, indescrible to those who haven't been to burning man) in the best mood I've ever been in. I was hugging people, telling people they were various positive things; dancing (for the first time in my life). I was surprised how little paranoia there was at this extreme lift in my mood. Normally I would be afraid of being so outwardly loving toward strangers; but it never crossed my mind to be so.</p><p>As the 'man' began to 'burn' (this was my first burning man) I realized how intense of an experience it was. I listened to this guy portray his views of what the 'burn' meant. He said 'We don't burn the man to move on in our lives, we burn the man as a symbol of all the pain and suffering in this world. We, the artists and creative peoples that are attracted to this event, who are strong, can turn all that pain into love and excitement; can channel the worlds pain into love.' The huge fire itself might be the means by which we channel these things.</p><p>Anywho, I danced around the bonfire for an hour or so. After things begin to calm down (only 1000 people from the roaring 30,000+ that were there) I sat down to meditate, as some were doing. I met a woman who ultimately stayed with me till the sunrise (my confidence was so extreme on ecstasy). As I was laying with her watching the sunrise; everything felt perfect and as one. I felt an alleviation of all my depressive symptoms; I felt the need to create art. I felt a rush of all the love I felt for the world prior to my sinking into depression 3 years beforehand. Everything was right in the world.</p><p>When I went to sleep that night I had strange closed eye visual hallucinations. I didn't know ecstasy could do this. I slept for about 1 hour until I awoke to feel the best I've ever felt in my life. Since then; I seem to have a more comfortable smile; that seems to be around a lot more often. This extremely spiritual experience has led me to living a more active life. I really don't care to do ecstasy again; but would think about it if offered.</p>",
 "year": "2005",
 "id": "46373",
 "gender": "Male",
 "timestamp": "2007-11-27T08:00:00.000Z",
 "views": "12483",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
