{
 "title": "Existed As Everything Forever",
 "author": "Metasyn",
 "citation": " Metasyn. \"Existed As Everything Forever: experience with 5-MeO-DMT (ID 46391)\". Erowid.org. Dec 10, 2006. erowid.org/exp/46391",
 "substance": "5-MeO-DMT",
 "bodyweight": "145 lb",
 "report": "<p>9/16/05 - 11:00pm</p><p>The first time I smoked 5-MeO-DMT, almost 4 years ago, I was quite shaken.  My total annihilation and subsequent reaction of shock and horror ended up scaring me off from pretty much all psychedelics for a couple of years.  Recently however, I came across a small quantity of the rare magical powder and I suspected that today, in a more prepared self, I might react to the intensity of the experience more out of love than fear.  So one Friday night alone at my apartment, I smoked 25mg split between 15-20mg vaporized in a DMT pipe and then, when this only got me halfway through, the remainder sprinkled on top of some cannabis. </p><p>As I was ascending I became increasingly more aware of my breath.  It seemed like such a large part of me; my life force.  In fact, now that I thought of it I was my breath, and I existed as nothing else.  My sphere of my consciousness had contracted to encompass only what was occurring in my lungs.  Then, without warning, my awareness expanded, no - e x p l o d e d - to encompass all there is.  I was the chaotic, probabilistic quantum mechanical gurglings that underlie all of reality.  I was the vast enormous galactic meta-dimensional everything.  There was no fundamental difference between myself and anything in the universe.  In a kind of harmonic resonance, I vibrated in peace with all the forces playing out around me.  Visuals were either absent or unimportant compared to the overarching feeling of divine connectivity. </p><p>This time there was no hint of a fear reaction, because, if fear is just an evolutionary product of self-preservation then what is there to be afraid of when you are everything?  The experience was, by far, the most beautiful thing I have ever felt. </p><p>The feeling of unity stayed with me for a while.  Even 60 minutes later I was still basking in the temporal reflection of the awe felt at that moment of cosmic union.  As I wrote down some reactions to the experience on paper, it felt like the pen was writing me; the words that were coming out were completely outside of conscious control and rather a direct manifestation of the galactic energies I was a part of.  Moving to some music on the stereo required no decision on my part; it felt like the music was dancing me.  I was so absorbed in being that even the simple planning of action and thought did not exist.  Everything that existed at that exact moment existed as everything forever.</p><p>The next day felt like a glistening sheen of love and acceptance was thrown over all people, objects, and events in the new world.  The feeling was beautifully slow to dissolve, and will probably (hopefully) never leave me completely.  Even though it will surely take some time to fully absorb and process this experience, at this point I seem to have discovered what Ive been looking for - the universe is now perceived as utterly complete.</p>",
 "year": "2005",
 "id": "46391",
 "gender": "Male",
 "timestamp": "2006-12-10T08:00:00.000Z",
 "views": "8174",
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ]
}
