{
 "title": "Not Too Exciting",
 "author": "McWyrm",
 "citation": " McWyrm. \"Not Too Exciting: experience with Yohimbe & Wormwood (ID 4643)\". Erowid.org. Feb 6, 2001. erowid.org/exp/4643",
 "substance": "Yohimbe & Wormwood",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Yohimbe",
   "(tea)",
   "",
   " ",
   "oral",
   "Wormwood",
   "(tea)"
  ]
 ],
 "report": "<p>I have recently experimented with yohimbe and wormwood together, as suggested by Rogue Psychonaut.  I made two attempts, but I did not experience anything I would call 'psychedelic'.  I don't think I'll try again.</p><p>Initially, I made an infusion using 2 tablespoons each of wormwood and yohimbe, and 1 tablespoon each of skullcap and ephedra.  I steeped these in about 1 quart of water for around 15 min. (sorry I can't be more precise).  The resulting mixture tasted awful, but so does espresso - I managed.  I felt nothing for about an hour.  Then I started feeling a bit warm and tingly.  I felt like my heart was beating extremely rapidly, but I did not count beats, so that might have been just paranoia.  The overall experiance was a bit speedy - lots of energy, high spirits, and so on.  The effects lasted 5 or 6 hours, and I did not have trouble sleeping that night.  I did not have sex during this time, nor did I feel any special urge to.</p><p>I tried again, this time using only 3 tablespoons yohimbe and wormwood in 1 pint of water.  I also added 500 mg of vitamin C (I've read that this makes the chemicals in yohimbe easier to absorb).  I boiled the mixture for 20 min. and let it cool.  This tasted even worse, but there was less to drink.  The effects were more pronounced and I started noticing them right away.  I noticed that my eyes were *very* bloodshot (they're not normally).  I became rather uncomfortable about my heart rate, so I laid on my back and breathed slowly through my nose.  That helped a lot.  I did have sex that night, but I didn't notice anything out of the ordinary, although that night and the next morning I did have some rather persistent and random erections.  I also had trouble getting to sleep.  I drank the stuff at about 8:00 pm and was in bed by 12:00 - I may have fallen asleep by 2:00 or so.</p><p>As I said, I doubt I'll try the stuff again.  It wasn't especially unpleasant, but I didn't think it was worth the effort.</p>",
 "year": "2001",
 "id": "4643",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-02-06T08:00:00.000Z",
 "views": "24978",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "(tea)"
  }
 ]
}
