{
 "id": 4645,
 "title": "Unfolding Lotus",
 "date": {
  "submission": "2004-01-04T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Catling",
  "gender": "Female",
  "weight": 67
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "23"
   },
   "administration": "oral",
   "substance": "2C-B",
   "form": "powder/crystals"
  },
  {
   "time": "4:00",
   "amount": {
    "unit": "capsls",
    "quantity": "3"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "specific": "P. cyanescens"
  },
  {
   "time": "7:00",
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  },
  {
   "time": "7:15",
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Make me one with everything.",
  "Isn't there a joke about that?  Involving a Zen Buddhist and a hot dog cart?",
  "Anyway.  5-meo-dmt.  Dosage unknown, I was trusting my wingman, who is utterly trustworthy in this respect and has done it before.  He was staying sober the better to be able to monitor me.",
  "I asked him to measure out a 'strong dose.'  We had discussed whether I should smoke it or snort it.  I wanted to snort it because it seemed like the scent was foul, the faint edge of a cloud of it when the pipe was lit up caused me to hurl.  (Turned out the pipe residue was DMT, not 5-meo-DMT.  God help me when I try DMT, I know that i will).",
  "So, he measured out what should have been a strong dose.  I insufflated it.  Immediately, a burning pain spread through my nose and into my sinuses.  He led me to the quiet room, I waved to everyone in the living room as I went.  I lay in his arms and prepared for liftoff.  I felt my heart accelerate and breathing became challenging.  I saw something behind my closed eyes, a silvery twisting road, and some figure like Galadriel beckoning (did not look like her, just was her, if that makes any sense).  But it never happened.  I waited in the dark, my nasal passages on fire, and it passed.",
  "I expressed frustration.  My wing man soothed me, saying that it was probably all the 2cb and mushrooms I had taken, but we could try again in half an hour and probably still get me there.",
  "The hilariously frustrating 'waiting for the high' period ensued.  We walked about.  I went out back to pace and smoke... and discovered that the stars were just lovely.  Wow.  Crystalline, beautiful.",
  "Time came.  I asked him to triple the dose.  He caught the eye of his friend, and they consulted and agreed.  Triple dose, measured out, snorted by yours truly.  OW.  Just fucking ow.  Before this, I had snorted K and E.  The pain there just does not compare.  This is like shoving broken glass up your nose and breathing it into your sinuses.  Afterwards, it feels like nasal rape.",
  "But I was assured it would all be worth it if it got there.  My gods....",
  "Back the to dark quiet bedroom.  Back to his safe, warm embrace.  (He and I had already crossed into empathic/telepathic bond earlier that night)  He held me close and after a few minutes I grumbled 'Once again, I think it's not enough.'",
  "He replied, 'you haven't started yet.  Trust me.'",
  "I did.  My heart began to pound.  Right up into tacchycardia.  Terrifying.  I couldn't breath.  Panic.  My heart, fluttering like a trapped bird trying to escape my rib cage, panic, panic... outside in the larger room, someone was using a singing bowl, sending chimes into the mosly silent house, chime....",
  "chime...",
  "flutter",
  "chime.....",
  "A lotus exploded behind my closed eyes, unfolding in a way that defies description, fractal, lotus, light, dark....",
  "Gone.  The room gone.  The chime, still carrying me, somehow.  My wingman somehow there with me, but not something I need to focus on.  I died.  I felt my body die, felt it gone from me, a noble shell that had served its purpose and was needed no more.  I was lost in someplace where the stars were pouring themselves through my veins, where the velvet darkness enfolded me.  I dissolved, I stopped thinking, I stopped feeling, all I was for a time was everything.  I became one with the universe.",
  "No words.  The terror was gone as soon as the body was gone.  (Ed note:  I strongly believe that part of the terror is the physical bodyload of the drug, the racing heart and short breath is part of what makes it so scary, makes it feel like physical death)",
  "Somewhere in there, I spoke, spoke of something deeply personal, and my wingman was able to follow the thought and respond, pointing out that I was once again blaming myself for something not me.",
  "I saw that pattern, as I was floating back from All, into Me.  I saw it.  And entered it.  And dissolved it.  (lets see if that holds)  I let something and someone go.",
  "And then I was there, safe in his arms.  Still feeling everything.",
  "It's still there, when I sleep.  It's been a few days, but when I drift off to sleep the lotus unfolds and I slide into everything as I lose myself to sleep."
 ],
 "erowid": {
  "id": "29738",
  "citation": " Catling. \"Unfolding Lotus: experience with 5-MeO-DMT (ID 29738)\". Erowid.org. Jan 4, 2004. erowid.org/exp/29738",
  "substance": "5-MeO-DMT",
  "views": "15479"
 }
}
