{
 "title": "Communication Through Touch",
 "author": "RM",
 "citation": " RM. \"Communication Through Touch: experience with Mushrooms (ID 46466)\". Erowid.org. Dec 26, 2007. erowid.org/exp/46466",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2005",
   "46466",
   "Male",
   "",
   "Not Given",
   "Dec 26, 2007",
   "2645",
   " "
  ]
 ],
 "report": "<p>My girlfriend 'K' and I decided to eat a fair amount of shrooms on a sub sandwich one morning.  I might've had slightly more (about 3 g), and she had done it once before, which might account for what happened later.</p><p>After 40 minutes or so, we left my place and started walking to hers.  K started feeling her body dragging her down, and I had a similar sensation that my body weight was seperating to my head and my feet.  I increased talkativeness almost to the point where she was annoyed by it and said I was having 'diarrhea of the mouth'.  We resolved this issue quickly before we stepped into her place so we wouldn't have a negative mindset going into the trip and into her house where her roommate was.</p><p>Once inside, she got ready for trekking around outside and talked to her roommate while I walked in circles, restless in the kitchen, only stopping to observe that the kitchen counter was bubbling up and breathing.  I enjoyed this visual and K enjoyed that I was liking it, so we quick went outside to look at the beautiful landscape-like scenary.  K talked about the beauty nature while I talked about the advantages of machinery.  From this point on our trips seemed to be separated and I never enjoyed it to the fullest because she would always have a different perspective, mentally or physically, than mine, and it was difficult to share anything, even emotions.</p><p>It was more than an hour into it, but after this time became distorted, as well as memory and vision.  I remember being amazed how different this drug was than any I had done before (alcohol, marijuana, x, dxm) and being somewhat amazed at how I could change my perspective to focus on a wider view than ever before or more intricate than ever before.  I saw trails of motion as they flashed all colors of the rainbow for a second before vanishing, and K enjoyed making the trees around us dance.  I began poetically philosophizing, saying things like 'the only way our minds can truly communicate is through touch' because I could tell her in words what I was seeing but she would never truly know.  I knew she felt the same.  It seemed that humor and seriousness flipped on and off like a switch as we observed different scenes around us.</p><p>It must've been 2 hours that passed when things really started getting crazy.  K and I laid together and kissed, feeling extreme sexual urges, but resisting, as we were in a public area.  We laid and looked upward and the trees and sky.  I didn't recognize the sound of the river next to us as water, and things started morphing beyond my control.  The spaces of sky in the trees above us filled intensely with color as my body was rushed with emotion and I felt as if I was figuring something out about the universe and K also felt a feeling of 'getting somewhere' or 'seeing the light'.</p><p>We noted that everything in the universe is a cycle and our trip, too, was creating cycles of emotions and thoughts.  We also noted that our bodies felt like they weren't ours, that we were solely minds trying to escape to something better but using our bodies as vessels to get us there.  Visuals intensified as K's face turned into an ogre or lizard and I really believed what I was seeing.  I also saw dark worlds inside of her hair.  K believed that she could jump inside of my mouth.  She was enjoying, but I was growing more scared.</p><p>Suddenly out of nowhere I grew nauseous and threw up pretty quickly.  Then things spiralled out of control for me and I felt very sick and negative.  I didn't have the energy to stand up as I could barely control my body, and I grew VERY dizzy every time I stood up.  K kept telling me that I could control it, but I tried and tried to no avail.  I felt like I was going to die.  I had to lay around for about an hour or more while the physical sickness went away, however during this period my memory totally messed with me.  I began rapidly forgetting what was outside of the area around us, and I totally forgot my purpose.  I remembered words, like student, and college, but could not think of why I was that word, or what that even meant.</p><p>I then thought of who I am, and past memories, and couldn't think of anything but vague words.  These words connected to no memories or ideas at all.  A good friend of mine even called my cell phone at this time and K tried to get me to talk, but I could only wonder if I knew him or not.  It seemed like I should.  A car drove by in the distance playing a song on the radio that I recognized and I had the feeling that the noise was a band- 4 different people.  That made me wonder how many different people there actually are on the world.  It felt like maybe 20 or 30 or so.  Including that band (which I don't know personally).</p><p>So about 4 hours passed until I could finally walk back to her place and clean myself up.  I was still dizzy as everything around me was breathing and moving and I still saw patterns of lines that weren't supposed to be there.  I felt slight nausea and only felt better if I blew my nose as hard as possible because I felt like I was blowing the mushrooms out of my nose (I know, it doesn't make sense).  Other than that, I laid on the floor and watched the clouds until my trip had diminished.</p>"
}
