{
 "title": "Cradled in My Mother's Arms",
 "author": "timothy",
 "citation": " timothy. \"Cradled in My Mother's Arms: experience with Alcohol (Hard) (ID 46485)\". Erowid.org. Jan 11, 2008. erowid.org/exp/46485",
 "substance": "Alcohol (Hard)",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "8 shots",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)"
 ],
 "report": "<p>I was in the ninth grade and on spring break.  I'd drinken before, but never gotten drunk.  I was eager to try it.  One night, everyone in the family went to bed around 10.  My father had two antique liquor bottles.  One had burbon.  The other had gin.  They had been laying there for months.  I figured, what the hell.  I began by taken a couple  sips of the burbon.  It was sour and I absorbed it the best I could.  I then took a big gulp out of the vodka  bottle.  It went down better.  Though my throat was burning a little, I headed for the kitchen to get a shot glass.  I had two shots of burbon and a shot of gin.  I then became very relaxed and started rolling around in my bed.  The way i felt was how heroine addicts described the peak of heroine.  I felt like I was being 'cradled in my mother's arms.'  I began to roll back and forth in my bed.  Something was on television, but it just seemed like a bunch of racket.  I began giggling. I staggered back to the liquor cabinet and took two more big gulps.  I think I put some music on the stereo.  I don't remember what it was.  I might have had a beer too.</p><p>When I woke up the next morning hungover,  I watched 'Brestwer's Millions.'  He was hungover after a night in the movie too.  I kept a secret with our maid and told her I got drunk.  She kept it.  Overall, I liked getting drunk and have done it often since then.</p>",
 "year": "1996",
 "id": "46485",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-11T08:00:00.000Z",
 "views": "5436",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "8 shots",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
