{
 "title": "It Works with Time",
 "author": "Slick Rick",
 "citation": " Slick Rick. \"It Works with Time: experience with Trazodone (ID 46484)\". Erowid.org. Oct 26, 2009. erowid.org/exp/46484",
 "substance": "Trazodone",
 "bodyweight": "145 lb",
 "report": "<p>I was prescribed 100 milligrams of Trazodone to help with insomnia, and to alleviate mild anxiety/depression. The first night I took a dose (on an empty stomach), all my thoughts were focused on getting to bed and sleeping. And of course, this is what happened. Before I got to bed though, I suspected that I would be drowsy in the morning. To my surprise, I woke up a half an hour before my alarm went off, and I was full of energy. There was no way I could go back to sleep.</p><p>About two months after starting the drug, I started to see positive benefits. I could go out with friends more, I was making better grades, and was all around happier. Also, I could smoke weed again without running the risk of severe anxiety or too much introspection which would trigger a depressed state.</p><p>One time, my bottle ran out and I couldn't get to the pharmacy for a while. After three nights of not having my regular dosage, I was back to where I was without the drug, possibly even worse off. On that fourth night, I took my dose again. This time, it knocked me on my ass and I felt like I had been physically assaulted the next day. It took no more that two nights for the drug to not rip me apart.</p><p>I often eat a small snack right before I take it. Once I take it, I have 10-20 minutes to be ready for bed. If I am not in bed at this time, I will feel like I have an inner-ear infection. It can occasionally cause breathing problems; I typically alleviate this by using my albuterol inhaler. This drug allows me to go to sleep at the same time every night, and wake up at the same time every morning. Its wonderful.</p>",
 "year": "",
 "id": "46484",
 "gender": "Male",
 "timestamp": "2009-10-26T07:00:00.000Z",
 "views": "13675",
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Trazodone",
   "form": "(daily)"
  }
 ]
}
