{
 "title": "My Favorite",
 "author": "avispa",
 "citation": " avispa. \"My Favorite: experience with Cocaine (ID 4649)\". Erowid.org. Dec 30, 2001. erowid.org/exp/4649",
 "substance": "Cocaine",
 "bodyweight": "150 lb",
 "report": "<p>My first experiences with coke were great! I had the flu for a whole week and my sinuses were clogged. My boyfriend and friends were all sitting around the table getting coked up. They kept telling me to try it, it would help me. It helped for a little while, then it was worse. I kept doing it though, I loved it.</p><p>I enjoyed it so much I wanted it everyday. I wanted that to be my drug on New Year's, my boyfriend did too (sex is incredible on coke). We scored some. The whole night all we did was snort coke. I was feeling good at first but then I started trippin'. I felt like there were too many people in my room. I told my him to get everybody out. I was upset with him for no apparent reason, I wanted to be left alone. It felt good to lie down in my bed and just enjoy the numb, yet alert feeling I was experiencing. I laid there for a while. I then realized there were at least 30 people in my apartment at 2 in the am. I got up and everything was cool until I went to bed. I think I just needed time to myself with the drug.  The only thing I did not want to do that night was smoke marijuana. I enjoyed the feeling of being alert and having energy on coke.</p><p>I did it straight everyday for two weeks. I unfortunately had to travel, so I promised my boyfriend I would not do none without him. I haven't yet. I don't think it's addicting or totally bad for you. My experience with it is that I am more willing to do tasks, unlike with good ole' Mary Jane. I feel I can think straight when I am on coke. The only thing is that I have to be a strong-minded person to do this. 'Weak-minded' people, I have observed, let it take over them. The cocaine makes them paranoid, restless, and it is hell on your blinds and carpet. I will not lie, I have felt paranoid at times but I understand why and I just let the feeling go. When the feeling starts to wear off, the best thing, I have found, is to try and sleep. It is difficult at first but like everything else its mind over matter. Or the more traditional remedy, of course, Marijuana.</p>",
 "year": "2001",
 "id": "4649",
 "gender": "Female",
 "timestamp": "2001-12-30T08:00:00.000Z",
 "views": "30508",
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ]
}
