{
 "id": 4649,
 "title": "My Mind Was Made Up to End My Life",
 "date": {
  "submission": "2004-12-31T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "scotchwhiskey",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "oral",
   "substance": "Fluoxetine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "875",
    "grams": 0.875
   },
   "administration": "oral",
   "substance": "Amitriptyline"
  }
 ],
 "report": [
  "At the time, I was currently being treated for bad depression with 20mg of Fluoxetine daily. This was helping to an extent, but not as much as I would have liked. In addition to this, the depression was causing me sleep problems, so my doctor had prescribed me with 25mg tablets of Amitriptyline (a sedative Tricyclic antidepressant) to help with my sleep.",
  "The night when all the shit went down, I was a few days from being evicted from my flat, my grandfather's funeral was the next morning and to top it off, me and my girlfriend had just split up a few hours previously so naturally, I was not feeling very good. As it all sunk in, I became very depressed and the packets of Amitriptyline tablets caught my eye. There and then I decided fuck it, I was sick of always being depressed and tired of the cycles of being down then up then average then down again and my mind was made up to end my life.",
  "I fetched a glass of water from the tap and then downed the tablets, 33 of them, 875mg in all. After taking the tablets, I sat there for a while, kinda chilled out and wondering what it would be like to lie down on my bed, close my eyes, and then go to sleep, never to wake up.",
  "About half an hour after taking the tablets I decided to have second thoughts about what I was doing and started to get really anxious about what this would do to my best mate as she means more to me than anything else in the world. The anxiety started to get really bad so I figured I better get to a hospital and set out to the bus stop only to find out when I got there that I had missed the last bus. This was about 45mins after taking the tablets and I decided to walk towards the city centre, guessing that I could flag a taxi down and even tho I had no money, if I lost conciousness then they would have no choice but to take me to the hospital or police station.",
  "About 10 minutes later (maybe an hour after dosage?) I really started to feel the effects and I started to get unsteady in my walk and suddenly it felt like my legs turned to jelly and I almost collapsed to the ground.",
  "I found a wall to sit on and took out my cell phone to call an ambulance from the emergency services. I dont really remember much from then on in, but I remember knowing that I really had to keep my eyes open and that my legs still felt totally like they were made of jelly. Somehow I ended up sitting down on a sidewalk and I vaguely remember someone talking to me, might have been a cop, I'm not sure, but I remember panicking and insisting that I needed an ambulance and the guy tried to reassure me that it was on its way. Eventually, I saw flashing blue lights at the end of the street and I can only assume this was the ambulance as the next thing I can remember (vaguely, I was starting to pass out) is being in the ambulance and the paramedic shining a torch into my eyes (presumably to check my pupil reactions) and being asked my name.",
  "At this point I was terrified of being sent to a psychiatric ward the following day and tried to bullshit the paramedic that my name was John Doe. Naturally he didn't buy it and I think I either told him my name or he got it from my wallet, but that is the last thing I remember until I woke up the next morning and realised that I must be in hospital, as I had an oxygen mask on my face and there was something that kept beeping. This was most likely an ECG (heart monitor), as heart problems are common after Tricyclic overdose. Some nurse then came over to check on me (I think my panic at waking up in a hospital set off some alarm on the ECG) and then left me to come round. Before I was allowed to leave, I was interviewed my a psychologist who informed me that I had to be sedated as I was 'thrashing around so much'. I am not sure whether or not this was me resisting treatment or convulsions from the overdose, but I would suspect it to be convulsions as I sought out treatment of my own free will and I dont see why I would resist, having decided that I wanted to live.",
  "Once I discharged myself, I grabbed a bus into town, withdrew some money and then went into Burger King as I was absolutely famished and thirsty as hell (presumably due to the anticholinergenic effect of tricyclics) and then took another bus home and slept for a LONG time. When I woke up, my memories were somewhat patchy and I dont know for sure when I came round or went home or anything, but I remember being in BK and eating and still had salt sachets in my pocket, so I know that I DID visit at some point.",
  "Now, my depression has lifted (I'm currently on 150mg of venlafaxine) and things have never been better. I am happy for the first time in years and I feel quite positive about the future and glad to be alive. I don't regret what I did as at the time, I truely did want to die and I think that if I had not taken the overdose, I would not appreciate my life as much as I do now. It was certainly an interesting experience and one that I am not likely to forget and even less likely to repeat."
 ],
 "erowid": {
  "id": "29752",
  "citation": " scotchwhiskey. \"My Mind Was Made Up to End My Life: experience with Amitriptyline & Fluoxetine (ID 29752)\". Erowid.org. Dec 31, 2004. erowid.org/exp/29752",
  "substance": "Amitriptyline & Fluoxetine",
  "views": "48740"
 }
}
