{
 "title": "Arjay",
 "author": "Moses",
 "citation": " Moses. \"Arjay: experience with Inhalants - Glue (ID 46493)\". Erowid.org. Sep 19, 2007. erowid.org/exp/46493",
 "substance": "Inhalants - Glue",
 "bodyweight": "65 kg",
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>The substance in this report is called Bostik Wallboard Adhesive and is used to put together special plasterboard panels called GiB. It comes in tubes or sausages which have special preparations for use in glue guns. The glue, which is commonly known as 'arjies', is whitish-yellow in colour and is inhaled through a bag avaliable in the fruit and veges sections of most supermarkets. Other glues are avaliable that produce a buzz but they are usually accompanied by painful and unstable side-effects which make long-term inhalation unrewarding. To highlight this, in comparison with Shelly's glue, or Liquid Nails for example, Bostik 'Gold' is relatively pleasant to inhale whereas the aforementioned glues produce a painful headache and 'siren' noise.</p><p>The first noticeable feelings I associate with arjing are a dynamic change in the feelings of my facial muscles, in particular, those around my jaw. I experience a feeling of paralysis which is accompanied by a sense of relaxation surrounding the entire body. This can lead to loss of bodily control which usually amounts in alot of drooling.</p><p>I experience euphoria and a sense of invulnerability. I sometimes experience hallucinations and/or OOBEs (out of body experiences). I recall times when I was seriously believing I could cast magic with the aid of the glue. I saw myself fly into space, I looked into the past and the future. I had direct confrontations with demons and the Devil. I thought it was fun for a while until I realised that the only reason I pulled through it all was because God would never let me be taken away by my habit. I would listen to music while I huffed and feel as though I was traveling through space-time via wormholes, directly into the underworld. I would challenge the very gates of hell by refusing to enter. I report this in full truth and am very much confident that what I am saying is accurate.</p><p>One night I was sitting on a cliff-top huffing out of a bag while I listened to 50 Cent's 'The Massacre' and stared into the ocean. I felt myself totally removed from the world. I looked a plants and they died in my gaze. I closed my eyes and I felt myself traveling through a tunnel that took me wherever my mind lead. The music would prompt certain feelings or revelations. I felt like I could understand everything. Yet whenever I was on the brink of knowing, I'd lose my control of the buzz and have to go back to working the bag. I was angry at my friend nearby for his interferences. I was seeing things which I thought were memories re-lived, and the lives of other peoples. I saw myself go into places spiritual and indefinable. I eventually felt myself wondering why I was leading this constantly evaporating lifestyle.</p><p>My buzz was more intense than I can ever convey, but it wasn't satisfying. I asked God if I could see such things then why couldn't I understand myself. My next buzz saw myself sitting in that exact spot, crying. I decided to throw off my bag. I looked up and all the rain around me was being diverted by some divine force of nature as though no cloud could rain on my head. I looked out and caught the sunset in it's last, glorious moments. I fell to my knees and prayed that God would lift me out of my depravity. I prayed there for what felt like hours, and then I walked home. I did huff some more glue after that experience, but I could never again lie to myself about my relationship with Christ.</p>",
 "year": "2005",
 "id": "46493",
 "gender": "Male",
 "timestamp": "2007-09-19T07:00:00.000Z",
 "views": "11974",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(liquid)"
  }
 ]
}
