{
 "title": "A Pleasant Trip to the Beach in Ireland",
 "author": "Epoch93",
 "citation": " Epoch93. \"A Pleasant Trip to the Beach in Ireland: experience with DOB (ID 46544)\". Erowid.org. Oct 11, 2005. erowid.org/exp/46544",
 "substance": "DOB",
 "bodyweight": "78 kg",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "DOB",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2004",
   "46544",
   "Male",
   "",
   "Not Given",
   "Oct 11, 2005",
   "12089",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: The identity of the substance described below is uncertain.]</p><p>Estimated (guessed) dosage 2mg</p><p>I had just read in a newspaper about a bad batch of Ecstasy tablets that had hit the streets. These pills were not in fact MDMA, but a related chemical; part of the Phenylethylamine family called DOB. The problem was that the ecstasy users has been eating one of these pills, feeling no effect, so taking another, then another with no seeming effect. MDMA takes 30-60 minutes to affect the body of the user if administered orally, it then lasts approximately 4-6 hours. DOB however takes some 3-4 hours to start working, and then it lasts for quite a while, according to Shulgin 18-30 hours! A very long lived psychedelic indeed, which these poor MDMA users found out to their peril. I heard one report of some poor chap taking 6 of the tablets, he lay awake for 2 days curled up in bed with visions of demons scratching at his window. The shock of a full on psychedelic experience which lasts for days would be a nasty shock to one who was expecting an MDMA hit.</p><p>Knowing this was a very rare substance indeed, I managed to get hold of one of these tablets and decided to share it with my wife to be. Clutching a copy of Alexander Shulgins PIKAL in which experiments with the drug are described in great depth, we drove to the North West coast of Ireland a booked a hotel room for the night. The rather crumbly tablet was split in two and washed down with a cup of tea when we had booked into our hotel room in mid-afternoon. According to sources the drug would take a good 3 or 4 hours to kick in and then last for long time which suited me as generally the longer the effect of a nice drug, the better as far as Im concerned. We went for a meal into the village then drove two miles up the coast to one of the most beautiful beaches in the whole of the British Isles. </p><p>The drug it seems was indeed DOB because at 3 hours after ingestion, we were starting to slowly come up. Walking onto the beach my visual perceptions were enhanced to a lovely degree, I was overwhelmed with the beauty of the landscape, colours were brighter, sounds were more detailed, and everything seemed sharper and more in focus. This was accompanied with a nicely mild feeling of euphoria, with no bad points whatsoever.  We walked for a while, and as is typical of this part of the world in the month of September the weather changed suddenly and very drastically to a shower of extremely large hailstones which were being blown off the sea at a tremendous rate. I had my large golfing umbrella with me for protection, but within few brief moments it had been battered and bent out of shape completely leaving us to the mercy of the supercharged hailstones which hurt when they hit us in the face. We had to run for a while to reach the sand dunes and a bit of protection from the wind. We were soaking wet, battered by hailstones, but completely invigorated, it felt good to be alive! </p><p>We returned to the hotel in search of dry clothes, driving of the car had been completely unaffected, I felt alive with sharpened senses and quick wits. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] We then went for a few drinks in the local bars chatting to the locals and generally having a most agreeable evening with the drug still in full swing. Its most useful effect however we were to discover was as an aphrodisiac, our lovemaking on the substance was little short of spiritual. Nothing except perhaps LSD has ever had an effect like the DOB had in bed for us. Sublime would be an understatement. We found that, it did not, like most Phenylethylamines, suppress the ability to eat or sleep. We rose early the next morning, ate a huge breakfast and were still tripping, the enhancement of the senses was still in full flight, but it had worn of by around dinner time.</p><p>I went on to have quite a few more experiences with DOB having tracked down more of the dodgy Es which people were only too happy to give to me at a very cheap rate, no-one else wanting them. </p><p>To summarise an excellent, easy going psychedelic, none of the rapid come ups of mushrooms or LSD, very little confusion or disorientation, a drug on which one can, on a reasonably light dose, go to work and generally go about ones daily business whilst tripping on it with no trouble whatsoever. It is also a supreme aphrodisiac, and good for meditating, doing spiritual exercises etc... But as an agent for inducing full on out of this world trips like those of high dosage LSD, Psilocybin or DMT it seems pretty useless. I went on to take an estimated 10mg one night, and it just didnt take me to the heights I should have expected. Resistance to the drug also builds up rapidly. I like DOB, a very practical clear clean headed psychedelic. Ill just quote Shulgin himself, Wunnerful, gorgeous stuff. It is a great pity that such life enhancing benevolent molecules like DOB are criminalised by ignorant legislation, hopefully one day this will all change, and Shulgins materials amongst others, can be used by therapists, scientists and artists for the benefit of mankind.</p>"
}
