{
 "title": "The Living Life Force",
 "author": "Gandalfe",
 "citation": " Gandalfe. \"The Living Life Force: experience with Cacti - T. peruvianus (ID 46541)\". Erowid.org. May 4, 2006. erowid.org/exp/46541",
 "substance": "Cacti - T. peruvianus",
 "bodyweight": "178 lb",
 "report": [
  "<p>I will try to give some brief information about myself.",
  "I am a 53 year old spiritual seeking Reiki Master, and have been a regular meditator, for most of my life. Also a Recreational cannabis user, incorperating it into my meditations. Cactus is used more for spiritual purposes[Taken 4 times].I took a premeasured 40 gram dose with me, on a 1 week wilderness camping trip.It is disgusting tasting stuff so I also tookk a cup of mango pudding to mix it with[bad mistake]The pudding had crunchy things in it which made me have to chew rather than gulp the stuff.I somehow managed to get all pudding and cactus, down my gullet, without barfing.",
  "I had a daypack stuffed with music player,light foodstuffs[fruit and nuts etc.],and other nessessaries.I decided to hike from my camp to a place on a  smnall island accessable in low tide.Found a place to lay under an ancient grove of gerry oaks and began to start tripping on the cactus[+45 minutes]I learned from my past trips to start the trip meditation, so I entered into a light to mid alpha state.A wonderful warm spiritual feeling flowed over me and I started to feel at one with the oaks near me.I gazed at their strong branches and marveled at how the living and dead branches existed in harmony with each other. Life and death on the same limb.",
  "I reached out and touched the tree and felt a gentle communication.I felt amazed that these plants around me experienced conciencesness too.Got out my music player nad put on Beethoven's 6th synphony.A great choice as Beethoven's ,interpretation of the outdoors, blended in perfect harmony with my interpretation of cactus reality.I stood up and walked, to the windward side, of the island, and marveled at the power of the sea.All this energy around me.Cactus ,Beethoven ,and meditation go together very well. I find my cactus trips are like an 8 hour meditation with a very gentle letdown.</p>"
 ],
 "year": "2005",
 "id": "46541",
 "gender": "Male",
 "views": "3681",
 "dose": [
  {
   "time": "0",
   "amount": "40 g",
   "administration": "oral",
   "substance": "Cacti - T. peruvianus",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2006-05-04T07:00:00.000Z"
}
