{
 "title": "Bitter 'Blue' Wine",
 "author": "splice",
 "citation": " splice. \"Bitter 'Blue' Wine: experience with Nymphaea nouchali var caerulea & Alcohol - Wine (ID 46557)\". Erowid.org. Apr 24, 2007. erowid.org/exp/46557",
 "substance": "Nymphaea nouchali var caerulea & Alcohol - Wine",
 "bodyweight": "165 lb",
 "report": "<p>It's supposed to mix well with alcohol so I soaked about 30 grams [a little more than an ounce] in a bottle of wine [white...next time maybe red] for about a week. Based on the research that I had done I thought this would be about 1.5 'servings' so I expected very noticable effects. the wine was now quite bitter and I decided to get something to eat to mask the taste. After double-checking to make sure it wasn't a MAO inhibitor or something like that I picked cheese. The cheese was a great idea and with its help I drank about half of the bottle of wine while I watched the Tarantino episode of CSI. there was a mild 'good' sensation that seemed to come and go, but nothing too noteworthy.</p><p>I didn't feel anything from the alcohol at this point so I decided to keep drinking. I strained out the flower bits and I don't know if that lessened the experience, but there's no way I could have eaten them...the wine was difficult enough to drink. by the end of 2 hours I had finished the entire bottle of wine and that was it. I felt slightly 'different' and not one tiny bit drunk...not even tipsy. I even interacted with others once I had completely finished the wine and nobody questioned my sobriety. the 'different' was more pleasant than not though and I'm definitely interested in trying again...but since the experiment cost me about $25 I don't think it will be anytime soon.</p>",
 "year": "2005",
 "id": "46557",
 "gender": "Male",
 "timestamp": "2007-04-24T07:00:00.000Z",
 "views": "15182",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "30 g",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(extract)"
  },
  "1": {
   "time": "",
   "amount": "30750 ml",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
