{
 "title": "The Surging Energy of the High",
 "author": "WC",
 "citation": " WC. \"The Surging Energy of the High: experience with Amphetamines (Adderall) (ID 46560)\". Erowid.org. Dec 21, 2007. erowid.org/exp/46560",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "70 mg",
  "oral",
  "Amphetamines",
  "(pill / tablet)",
  "",
  "30 mg",
  "insufflated",
  "Amphetamines",
  "(ground / crushed)",
  "",
  "80 mg",
  "oral",
  "Amphetamines",
  "(pill / tablet)"
 ],
 "report": "<p>I was first prescribed Adderall about two years ago. At the time, I expected to use it only at my prescribed dose of 5-10 mg to cram for tests and write papers. I did not take it every day as many do, but only when I really needed to buckle down and get some school work done. At first, the thought of Adderall as an enjoyable, recreational drug never crossed my mind. I first experienced Adderall as such about a month ago. After reading online experience articles on Adderall, I became intrigued by its supposed 'euphoric' effects. I was also interested in the substance as a stimulant that could help me curb my need for sleep without constantly feeling fatigued. I hate coffee, but Adderall is sweet like sugar.</p><p>It was about 11 pm on a school night when I took 70 mg orally and experienced my first amphetamine high. Over the next hour I felt an amazing energy slowly build up in my body. I could only describe the experience as fantastic. I felt a surge of wonderful, life-giving energy rushing though my body. Parts of my body, especially my legs were tingling as if a light electric current was running though them, and it felt amazing. This, however, was not the best part. At a time in my life when I was overwhelmed with stress, all of my problems suddenly seemed to melt away. I was on top of the world, and nothing could bring me down.</p><p>This feeling was not entirely artificial as I did get about 6 hours worth of school work done in less than two, a huge load off my back. I did not sleep all night and expected the next day to be hellish. I expected to be overcome with exhaustion and depression as Ive heard most people coming down off of Adderall feel. I could not have been more wrong. The electric euphoria somewhat subsided, although not completely. I continued to shutter every so often, and my legs still felt as if light electricity was running though them. Despite not having slept for some 40 hours, the feeling of boundless energy continued all day. School had never been so enjoyable. I immediately recognized how potentially addicted to this substance I could become. I had read about the addictive potential of amphetamines, and the rapid tolerance buildup, so I decided not to use it recreationally for a while. After this one amphetamine high, I felt unusually drawn to taking more the next day and the day after that, but I refrained. This was my first recreational experience with adderall. I still took my prescribed dose once every week or two to cram for tests and write papers.</p><p>I was hoping to go out and party tonight, as I've been homebound with the parents for several days. Hurricane Rita... I hung out with a few people for a while, but we couldn't find anything to do. I was really craving some kind of drug, anything at all, so when I came home, I decided to get high off of my Adderall again. At midnight, I snorted 30 mg and immediately felt the comforting rush of energy. I immediately ate another 80 mg. Soon the rush was almost overwhelming, but it wasn't a panicky or uncomfortable feeling. It felt great. It literally took my breath away. Music sounds amazing. I also feel an overwhelming urge to socialize with everyone and am rambling at every screenname on my buddy list signed on at this ungodly hour of the morning. Were I talking to someone in person, I would be speaking at about a million words a minute. Every so often, I catch myself rambling out loud to noone. I am constantly shuttering, and the familiar electric current feels incredibly strong all over my body, but it is still totally pleasant. Adderall is totally unlike any drug I have ever experienced. I've never tried cocaine, but I've heard many compare the amphetamine high to that of low quality coke, except that it lasts for hours. Unlike with most drugs which cause a lack of coordination, blurred vision, and difficulty making rational decisions, when I'm speeding, all of my senses are working at about 200 percent their normal capacity, as is my mind.</p><p>As I sit here rambling on, my heart racing, I can clearly see the addictive potential of this amazing drug. Even though this feeling will persist for about a day, I will crave for the feeling to be stronger again, but the craving is certainly not overwhelming. It only takes a bit of self control. Adderall is nothing like any other drug I've tried. It makes one feel invincible, like some kind of superhuman. If I took just my prescribed 10 mg every school day, I would easily make straight A's. I only refrain because after taking Adderall for several days straight, a very uncomfortable and constant feeling of depression sets in. There's a million more things I could say about the potential of this amazing drug, but to sum up the experience of a strong amphetamine high, I could only say that it is like a life-giving breath of fresh air.</p>",
 "year": "2005",
 "id": "46560",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-21T08:00:00.000Z",
 "views": "42813",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "70 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "30 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(ground / crushed)"
  },
  "2": {
   "time": "",
   "amount": "80 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 }
}
