{
 "title": "What They Didn't Tell Me",
 "author": "$20 Bill",
 "citation": " $20 Bill. \"What They Didn't Tell Me: experience with Opioids (Hydrocodone & Oxycodone) (ID 46576)\". Erowid.org. Feb 3, 2011. erowid.org/exp/46576",
 "substance": "Opioids (Hydrocodone & Oxycodone)",
 "bodyweight": "220 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Opioids",
  "(daily)"
 ],
 "report": "<p>This is hard for me to go through but I want to warn everyone out there who may be thinking of trying opiates what might happen.</p><p>First off, as far as my drug background goes, I was a normal experimental college student. I have done every drug except meth and heroine. I smoked a half once of weed everyday for years until the christmas before I graduated College when I knew that I would have to take many drug tests to get a job. I never thought that my problem would be with something they didnt even test for.... And that I was supposed to be taking.</p><p>You have to understand that I'm not in good health. I had my first kidney stone when I was 18 years old, I'm now 27 and I have had roughly 90 stones total. For those of you who dont do math... Thats 10 stones a year... Almost one a month. I started off trying to just get through the pain by going to the ER when I got stones ... That got expensive quickly. My grandfather has had all kinds of problems so he had a huge supply of pills and would give me just a few to get through the pain with out having to go to the ER for another 1000 dollar visit.</p><p>When I started looking for a job I got nervous about the drug test seeing that I was taking a pill that I didnt have a script for. So I found the local good ole country pain doc and he start prescribing me pills.... Lots and lots of pills. 360 10 /325 hydrocodones and 200 5 mg oxys. I would sell all the oxys and half the hydros and use the rest for my self... I didnt need all them. Then I started selling less and less and taking more and more. In march of this year I took a week of vacation from my job because I went through my whole script in 2 weeks.... 2 freakin weeks.... I made it through barely... I checked myself into the ER twice because I was afraid I was going crazy. I was sick to my stomach, the skin between my fingers and toes wouldnt stop itching... God the itching!!! I really didnt think I would ever feel normal again. I decided that I would rather live through the pain of kidney stones than eat opiates like most people eat popcorn.</p><p>I had been doing good until last week when I got another stone... A bad one... One that I needed pain meds for. So I went to see the ole country doc and he had lost his license. Ok...that sucks ... So I went to the ER. I got a script for 45 hydros and went through them in about 7 days.  I started to get that feeling again. So I decided that I could make it the last few days without a refill. Its been & day since I took a pill and the withdrawls were not as bad this time but it was still alot of hell. I'm commited to living through the pain of kidney stones the rest of my life just so I never have to feel the withdrawls again. Thats how serious this is.</p>",
 "year": "2005",
 "id": "46576",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-02-03T08:00:00.000Z",
 "views": "2330",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Opioids",
   "form": "(daily)"
  }
 }
}
