{
 "title": "Make it Stop, Please",
 "author": "MDMA_20",
 "citation": " MDMA_20. \"Make it Stop, Please: experience with Ecstasy (ID 4661)\". Erowid.org. Jan 14, 2001. erowid.org/exp/4661",
 "substance": "Ecstasy",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>when i first started using 'E' it was awesome. everyone used to tell me and my friends to stop doing it because it was terrible and going to mess us up in the long run..but..YA RIGHT..we didnt listen. it was the best feeling when you pop one and then 30 minutes later your calf muscles are tensing and tingling, your head is getting light and your jaw is tightening. you could just walk in the club and have the best time..even if you were the only ones there. it didnt matter, you were on E.</p><p>i started doing it about a yr and a half ago. i started by a friend telling me to try. and oh boy did i try. i loved it SOO much i was out doing it every weekend. but i didnt care it was so fun even if it did cause damage. it was at the point where i FELT like i always wanted it and 1/2 the time i didnt but my body just remembered its feeling and wanted more... i was popping 3 a week sometimes.. that may not be as bad compared to many but it was to me.</p><p>i tried to stop it about 5 months after i started..but i couldnt stop. i just slowed down with my usage. that may be a step foward from what it was before but i wish there was more for me to do then just WANT to stop.</p><p>here i am a yr. and a 1/2 later on my 30-35th pill and i am just starting to feel some real side effects. who knows if that is the reason i get ALL of them, but i believe it is. i got a real bad anxiety attack on Xmas Eve that scared the SHIT out of me. i have constant headaches and HORRIBLE mood swings. my boyfriend says i'm 'like doctor jeckle & Mr. Hyde'. one minute i will love him the next i am being a bitch or crying my eyes out about nothing. another thing thats not REAL bad is...i do get depressed alot more easily then before. the last thing that really bothers me is the fact that i have shooting pains through my heart & chest. it feels kind of like a heartburn but i know that its not that. i want to get it checked out but what am i gunna say? 'its from all the MDMA use i did...?'  umm nooo..</p><p>the grossiest part of this is.. i have 1 pill upstairs for me to pop this coming sunday...am i crazy or what??? i just wish in a way i never even got myself into it...but on the other hand..its the best thing i have experienced in my life..</p>",
 "year": "1997",
 "id": "4661",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-01-14T08:00:00.000Z",
 "views": "27629",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
