{
 "title": "Legal but Dangerous",
 "author": "SP",
 "citation": " SP. \"Legal but Dangerous: experience with Caffeine (Coffee) (ID 46628)\". Erowid.org. Jan 11, 2008. erowid.org/exp/46628",
 "substance": "Caffeine (Coffee)",
 "bodyweight": "120 lb",
 "header": [
  "DOSE:",
  "1 glass",
  "oral",
  "Coffee"
 ],
 "report": "<p>I'm feeling quite strange today. The only caffeine I have had in the past three months constitutes a little bit of chocolate here and there. When I found out I was pregnant, I stopped my daily habit of downing 3-5 cups of coffee and drinking tea and soda as I pleased. But yesterday afternoon I decided that a Starbucks frozen Frappuchino was everything that I needed at that moment and so I gave in to my cravings, drove to the nearest corporate drive through  and slurped one down in about 5 minutes. </p><p>About fifteen minutes later, my heart is beating out of my chest and my skin is crawling. My eyes feel as if they are popping out of my head. I think I am having an anxiety attack.  I take silent deep breaths to try to calm myself. This intensity passes after about 45 minutes and I continue my afternoon with little more than heightened energy. When I finally  lay in bed at night, I toss and turn for quite some time, trying to relax and then after somewhat falling into a hazy reality but not even close to REM, wide awake again at 2am and not able to sleep again until 4 and up at 7am once again, then trying in vain to get some resemblance of sleep and finally giving up and dealing with the day, part zombie, part coming down -  speed freak. I honestly feel like I did a bunch of coke yesterday. Or maybe even Meth. I'm still wired. War on caffeine!!!!! Take note: I am an experienced drug user-everything from psychedelics to narcotics to speed and I now realize that without tolerance built up, caffeine can be just as intense!</p>",
 "year": "2005",
 "id": "46628",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-01-11T08:00:00.000Z",
 "views": "21171",
 "dose": {}
}
