{
 "id": 4667,
 "title": "It Hates Me",
 "date": {
  "submission": "2006-05-04T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Sdragoon",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ],
 "report": [
  "[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "I myself am lucky to be alive and will never ever huff anything again.",
  "It all started when I was about 13. My friend and I decided one night after a game of basket-ball that we would huff some gas in the garage. I'm not sure why we decided this because we were not exactly the type of kids that went out of our way looking for ways to get high but it sounded like a good idea at the time.",
  "Well the first time we tried it, we enjoyed the effects so much that we became gasoline junkies so to speak. Not fully understanding its effects we would meet almost everyday after school at one an others houses and have little huffing parties. Before we knew it we had an entire group of our mates all joining our little huffing clan. At school all I thought about was getting high with my friends after school. Well... things spiraled out from our little group and soon little huffing groups were springing up all over the place.",
  "Sometimes we would get together with them and have huffing parties with 12+ people. The weird thing is we really didn't ask anybody to join us it just happened. I think I can relate and trust them because they same common interests as me but I hardly even knew these people.",
  "My mind was clouded most of the time and I didnt really know what was going on 1/2",
  "the time.",
  "I know it sounds stupid but at least 1/4 of the people in my grade were abusing inhalants of one type or another around this time. I guess it was just a popular/",
  "cheap drug for kids our age at the time.",
  "I can't say that I didn't enjoy the effects of huffing the gas because I did. I saw a great number of very trippy things some good some bad. When you huff gas its unlike any other drug in the I have ever done. It messes you up big time. I would see and hear things that I can hardly describe.",
  "There is a deja vu factor where everything repeats itself in loops. Everything goes in these endless almost mathematical loops when I'm tripping on gas. I would always hear this odd robotic sound and it was singing to me. I hated it but I loved it at the same time. I would also see these odd waves in the air. They almost looked like the screen of an old TV that can't get the channel tuned in correctly, but they were transparent.",
  "I also thought that I was on an elevator and the higher I got the elevator would take me to the next level then stop till I achieved the next level. Once I got to the top I knew that something crazy was going to happen but I never new what and something crazy always did happen.",
  "I remember one time when I finally got to the top. These guys were walking down the road with a boom-box and playing rap music. I looked behind me and there was this giant skull and crossbones except instead of a skull it was a giant cartoon dog face. So basically it was a cartoon dog face with crossbones under it. With each sound of the drum in the music the bones would send this shock wave out that rippled everything around me. This was a massive hallucination at least 15 feet in size. This thing then launched itself into the air till it was so high up it looked like a pin dot. Then it descended downwards spiraling right at me.",
  "I new it was going to land on me and I thought it was going to kill me. It did land on me and it exploded into huge blue spheres which filled my entire surroundings. A huge vortex opened up under my body and began sucking all the blue spheres into it and pulling me into it as well. I though I was dieing. I looked up and a huge green hand was hovering above me and blood was dripping off its fingers onto my face. I sputtered and tried to regain reality but I couldn't.",
  "I woke up in a puddle of my vomit. Who knows what happened to me. I might have",
  "stopped breathing.",
  "I might have been slipping into a coma. I might have actually temporarily died. I can't say for sure.",
  "It was soon after this that I decided that huffing gas was dumb. It was not worth the risks.",
  "I really dont even know how long I was out for.",
  "I find it hard to believe that I did this for over 3 months and am still alive. Some of the people that I new that huffed gas refused to stop and some of them actually had to go to the hospital because they nearly died. I was not aware of the health effects caused by gas and I think that they should stress them more during drug education at schools.",
  " One definite thing I noticed after my gas huffing binge is that I now have a slight stuttering problem. Its nothing serious but it does happen and It never did before I huffed. I can speak perfectly fine but when I try to say things quickly it happens from time to time. I guess Im lucky for now.",
  "Its been 10 years scence the last time I did that evil drug and if there was just one thing I could change in my life it would be to never have huffed gas."
 ],
 "erowid": {
  "id": "29802",
  "citation": " Sdragoon. \"It Hates Me: experience with Inhalants - Gasoline (ID 29802)\". Erowid.org. May 4, 2006. erowid.org/exp/29802",
  "substance": "Inhalants - Gasoline",
  "views": "18833"
 }
}
