{
 "title": "We Fell in Love",
 "author": "EManda",
 "citation": " EManda. \"We Fell in Love: experience with MDMA & Cannabis (ID 46681)\". Erowid.org. Dec 20, 2007. erowid.org/exp/46681",
 "substance": "MDMA & Cannabis",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE:",
   "1.25 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I first started using ecstasy in August of 2004. Before then I had been an avid pot smoker and an occasional tripper of DXM. Still, the pure thought of ecstasy alone scared me. I had classified it into the most dangerous group of drugs, and swore I would never touch it.</p><p>To this day, I still believe doing ecstasy was the best decision of my life. It's the only drug out there that I have used thats given me something back, and helped me find the love of my life.</p><p>The first time I ever used ecstasy was with my two best girl friends. I wasn't sure what to expect at first. My friends had told me the feeling was unexplainable and by far the best they've ever had. We popped Blue Christmas Trees at about 9 o clock that night. 20 minutes later I was already feeling the effects. My muscles were tensing, palms sweaty, light fuzzy feeling in the head, and a sense of openess. Sadly, I thought this was the most I'd expect. Not even 15 minutes later I was peaking in a steam room in the bathroom. Peaking is probably the most difficult part to describe of ecstasy. Peaking is ecstasy. Usually when I peak I find myself moaning, naked, clutching and massaging myself. All my brain and body tell me is that I love myself. I love everyone. I love life. It's absolutely amazing.</p><p>The first time I peaked me and my two girlfriends sat in the bathroom with steam all around us and held each other naked. All we talked about was how much we loved each other and how beautiful we were. My whole life I had been extrememly self concious and for once, I felt beautiful. I walked around the house naked for that night in front of everyone that was there. All I could do was hug everyone and tell them how much I loved them. From that night on, I knew ecstasy was going to be a problem for me.</p><p>The next 4 months were a blur of ecstasy. My group of friends and I became hooked to the amazing feelings of ecstasy. Every spare moment we had, we were rolling. Ecstasy almost began to loose its meaning. I got sick of people (mostly guys) telling me they loved me and wanted to be with me while I was rolling, and then the next morning it was like nothing had happened. Maybe the reason I loved ecstasy so much was because I meant what I said on it. However, most people only say the things they do because they are rolling. The Glow shows, techno music, and rave-like parties were only fun for so long.</p><p>Then the after effects started kicking in. I never got any sleep and was always a wreck/e-tard at work. I started getting depressed from doing ecstasy too much. I hated my sober life. I stopped doing ecstasy for pretty much the entire month of January. I thought I was finished for good.</p><p>Now, the part of the story I've been wanting to get to. For about the past year I had secretly liked someone who I had hardly known. His name was Aaron, and I only knew him because he would occasionally stop by my work when his friends were working with me. After awhile we had started talking, and occasionally we smoked together. Nothing big. I knew he wasn't interested, and I knew nothing would happen. I had pretty much given up on love at that point in my life. In the back of my mind I knew if I could get him to roll maybe something could happen. Turns out I got him to roll, but I didn't get to roll with him. The pills he took were pretty horrible, and he didn't have an amazing first experience like I did. I was scared Aaron would never want to try ecstasy again because of his horrible first time. So again, I gave up on the thought of us ever being together.</p><p>Then out of the blue a few weeks later he called me up asking If I wanted to roll with him and a few of his friends. Now, at the time I was seeing someone and I knew I should be a good person and say no, but I couldn't. This was the chance of a lifetime for me and I wasn't going to pass it up. Saturday night came and literally after spending 3 hours getting ready I went over to his friends house. I remember feeling so nervous and excited, I knew something was going to happen between us. We each popped a pink teddy bear and sat around talking while we waiting for the effects to kick in. I remember when I first started feeling the effects kick in I couldn't take my eyes off of Aaron.</p><p>Suddenly I was so confident. I kept talking to him and following him around. After the effects began to heighten I suggested that we make a steam room. As we sat in the shower I ripped off my shirt. Normally, I wouldn't have done something like this. But I felt confident, and I wanted Aaron to notice me. After the steam room we went back into his friends bed room as a group. I was sitting a couple feet away from Aaron. At this point we were talking heavily and I hinted towards a massage and how good they felt when rolling. So of course, I began to massage him. The next thing I remember is someone walking in and asking Aaron if he was getting on me. He said something like 'No, she has a boyfriend.'</p><p>Of course, that was denied by me instantly. So thus, the cuddling began, and I confessed to Aaron that I didn't want this to go any farther because of previous guys who had hurt me before while we were rolling together. Aaron then told me that he wasn't like that, and that he had liked me for so long and had wanted to say something but never could. I have never been happier in my entire life. To know someone feels the same way about you that for so long you had felt about them is amazing. Let alone there is no better time to find this out then when rolling.</p><p>I told Aaron I didn't want to do anything because I felt bad for the guy I was seeing. He said that was fine, so we cuddled with each other for awhile. During this time Aaron was running his hand up and down my stomach. I must have orgasmed four of five times. It was so amazing to have him touching me. I couldn't resist not to kiss him anymore. For the remainder of the night we talked about how much we had liked each other and how this wasn't just a one-night thing. I left there at about 3 that morning and went home. I don't think I shut my eyes for a second that night. I was way too damn happy. In the morning before work he sent me a text message saying that he still felt the same way. Normally work would have been hell for me the next day, especially without any sleep, but it was the complete opposite. I fell in love that night.</p><p>Without ecstasy I doubt I would have ever had my chance with Aaron. He is honestly the love of my life and no one could ever make me happier or more alive then he does. We still do it from time to time. No more parties, no raves, just by ourselves in the quietness of his home. And that is the best ecstasy experience you will ever have, with the person you love. Sharing ecstasy together is the greatest gift we can give one another.</p><p>I love you Aaron. 'Imagine just you and me together forever.'</p>",
 "year": "2005",
 "id": "46681",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-12-20T08:00:00.000Z",
 "views": "8362",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.25 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
