{
 "title": "Ego, Sanity, Paranoia",
 "author": "Shrooms",
 "citation": " Shrooms. \"Ego, Sanity, Paranoia: experience with Mushrooms (ID 46701)\". Erowid.org. Apr 21, 2008. erowid.org/exp/46701",
 "substance": "Mushrooms",
 "bodyweight": "68.5 kg",
 "report": [
  "<p>Me and my friends wanted to trip on mushrooms for a long time already. I had heard different things about trips on LSD or mushrooms from songs and people I've met. Also I had had quite a large drug experience in the past summer. Lots, lots of weed, also some Speed, Coke.",
  "So this one day my friend G said he had bought the stuff and we decided to trip on Saturday. Thats how we did it. On Saturday we went to my friends Pete's countryside house, near the sea and were ready to trip. There were 4 of us, three had a first time experience and the 4th user hadn't used acid or shrooms for like 7 years, but had had quite a lot of experience before that time (let's call him Max). So we took a dose that was meant for 5 (that's what the dealer told my friend) and split it to 4. After eating them we drank some tea and were all anxious about what will happen now. Only the guy who had used psychedelics before sat calm all the time, reminding me of the white rabbit from Alice in wonderland. He kind of knew what's gonna happen, but stayed all mysterious about it.",
  "We ate half of the dose at around 20:30 and the other half some 15 minutes later. Max had found some mushrooms growing in the wild himself and we tried to eat them too, but they tasted very sour so we decided to throw them out better. I had felt ok the last days, nothing much was bothering me, neither there were any problems in my life, but I was little afraid of the possibility of a bad trip. Then the first effects started. Our pupils became dialated and I felt upbeat, the trance music that Max had brought started to sound more and more ambient and the colors were getting kind of brighter, like the contrast would have been doubled up in my eyes. For a moment I felt like I will vomit at any minute but it passed in like 5-10 minutes.",
  "Max was watching the clock quite often, saying that the drug will kick in after like 30 mins and we will probably have like 4 hours of trip. I did not see the use of this clock watching then, but later it helped a lot to have someone track the time. Then Max and G decided to go to the nearby shop. I and Pete stayed at the house. The drug started to kick-in seriously like 10 minutes after they left. The walls started vibrating like a subwoofer to the music and I started feeling like the table we were sitting on lifted in the air a little bit, but it was still nothing much. More than anything I had experienced before, tho.",
  "Soon Max and G arrived, they had bought something, I don't remember what, tho. I think some sweets. Right about then I was already quite close to the peak of the trip. I was on some kind of emotional uplift, I was laughing and crying, filled with joy and love, I was feeling like some kind of Love rabbit, white with a huge red heart, and was jumping around, only laughing and crying about everything. Before the eating of the shrooms there were lot of jokes about Alice in Wonderland and the bunny going on. Then I noticed I was freaking out my mates and kind of got it together.",
  "Then all 4 of us decided to go to the sea, which was in like 10 minutes of walk. As we got outside (it was dark, around 21:20 already) all of a sudden I became blind for like 10 seconds, at least thats what I thought had happened. After I regained vision everything was already looking different. The back yard of the neighbours was like a megabig cinema screen for me. I and Pete stood for some 10 minutes looking at it, seeing different things there.",
  "I was feeling strange and unsecure all the time so I found Max somewhere in the yard, it was quite a small one, like 50 m2 or so, but seemed huge at the time, and stood by him, telling him that this way I felt safe. I have always been a social guy and strong at convincing people. I myself had always looked at me like some kind of a natural leader of the pack. And only then it hit me that I actually wanted to be around others because of the fear to stay alone with myself and the insecurity and lack of confidence. It was a very important realisation for me.",
  "So we took off to the sea. After the 10 minutes walk, which alone was an experience of a lifetime, we got to the sea. And God it was beautiful. We stood watching it for like 10 minutes when I started to concern about the fact that I simply loved the world in which the drug had brought me and I started talking to Pete about that. He, on the other hand was all happy and relaxed, considering that he is kind of a loner in real life, back then he was the one talking the most. That was stressing me out, I could not communicate with him or get him to calm down, cause he was on his own wave, trip. I started getting cold and asked him if we could go home cause he earlier promised me that he would get me back home since I didn't know the way so good. He said 'Ok!'.",
  "So we started walking back when, on crossroads, he said 'Let's turn right cause I always go left, I wanna turn right.' I said that it would be ok as long as we get back home to the warm kitchen, cause I was really getting cold, at least in my own mind I was. Pete didn't say anything at that time. He was in some kind of a state of mind where nothing can be known for sure, well actually we all were. So he mostly was answering my questions with phrases like 'Maybe yes, maybe not. I don't know.' And when he told me the above to my next question if we are heading home I became really paranoid. I started to think that maybe he just doesn't remember the way himself cause it looked like it didn't really matter to him if we get to home at all or not. I felt like we were walking for like 20 minutes already and still no sign of home to me, nor the way back to the sea where G and Max had stayed. I started freaking out and wanted to go in some random house just to get in a warm room. I didn't want to die under this drug. I thought about how my parents would feel if I died under some drugs.",
  "I was realy realy scared at the moment when we turned left somewhere and I noticed that in front of us is the house. I got inside and almost run up the stairs to the kitchen on the second floor. All of a sudden I wanted all this to stop. I ran to the clock and looked at it, trying to tell what time it was but the numbers just didn't mean anything to me. I asked Pete if he thought this would stop and all he said of course is that he didn't know that and maybe it would, maybe it wouldn't, what's the difference. Some minutes later I asked again and he told he didn't know cause it was my trip, maybe it will not end at all for me. And at that time I believed that was 100% true. I though that Max had been living in this state of mind all the time since he had eaten shrooms for the first time and now he had pulled us in this too and it's never gonna be the same and all of a sudden I was scared from him.",
  "I had already aclimatized with the thought that this is never gonna end now and at the beginning I wanted to cry for all the people I loved and will not be able to communicate to normally again. Then I started working on a plan, how to act so none would notice in the rest of my life that I'm in this strange state of mind. I thought I could go to a doctor, but then I decided I could not prove to anyone I'm not insane and they would just put me in a mental hospital. Then I started to think about killing myself and told that to the others when G told me I had been mentioning such a thing before too and yes, I have really been thinking about that in my life, not seriously tho, cause my beliefs of reincarnation would never let me do such a thing.",
  "I became really freaked out and started walking from the living room to kitchen, looking at the clock but it seemed like each one would show different time. I couldn't understand a thing when I sat at the table and decided to write down the numbers shown on the clock of my cell phone and after a while write down the new numbers to see if the time is running and this is really going to it's end.",
  "Right then G and Max arrived home. I told Max about my strange feeling and he just nodded and told me he was sure this will end. He told me he had also taken track of time and told that three hours had passed since we ate the drug already so this should end in like 1.5 hours. This information calmed me down at last.",
  "Then the strange part of the trip started. I calmed down and felt enlightened. Like my ego had died. Nothing was worse or better than anything at the time. I had no attitude towards anything. I would describe this as if everything and anything would be the same but not in a way that I would not care about something. No, it was more like every thing, every action was very important but there was no better or worse ones. I then started talking with my friends about these strange thoughts and feeling of enlightenment.",
  "Soon I realized I could predict the answers my friends gave me about these questions. Soon I started asking questions and answering them myself and my friends told that the answers I gave was just what they were going to say. That was funny. Everything was funny. I started thinking about things of everyday life, relationships, work, and it all seemed very interesting and funny to me. I did not depend from anything. I thought I could make some money tomorrow, but I could as well make some tea. Sagely I can not explain many things I realized while in this condition cause It was not like I understood anything, I simply started becoming aware of things. They started hitting me one after another. And then the trip ended.",
  "Since then I have changed my attitude towards people, understood my deepest fears, changed the music I listen to, and lost interest in any mind altering substances. The fact is, the trip really has not ended. I have still some questions to my brain tho, so I might do this again in a year or so.",
  "I hope you understood something of the above because it is really hard to explain. Almost impossible, words are such a weak instrument to communicate.</p>"
 ],
 "year": "2005",
 "id": "46701",
 "gender": "Male",
 "views": "4390",
 "dose": [
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:15",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2008-04-21T07:00:00.000Z"
}
