{
 "title": "Kills the Effects of MD*",
 "author": "Cactushead",
 "citation": " Cactushead. \"Kills the Effects of MD*: experience with Venlafaxine (Effexor) & MDA (ID 46747)\". Erowid.org. Jul 31, 2006. erowid.org/exp/46747",
 "substance": "Venlafaxine (Effexor) & MDA",
 "bodyweight": "130 lb",
 "report": [
  "<p>I just wanted to post a report about the strange interactions that occurred when a friend of mine who takes effexor wanted to try ecstasy for his first tme. The pills we had that night were MDA. Jon and I only needed to eat 1 pill and we were rolling about 40 minutes later. However, our friend Ben (who takes effexor) didnt feel anything by the first hour. So he ate a second pill, waited another half hour of so, and still didnt feel anything. At this point, he took a third pill, and sure enough, he still wasnt rolling. About 2 and a half hours after we all ate the first pills, Ben still wasnt rolling, so he decided to smoke some pot. Once he did this, it kicked the MDA into gear for him, but he didnt have the usual experience. He was getting good visuals and said he was tripping really hard (as MDA can do), but he had absolutely no body high or emotional high.",
  "The second time he tried rolling, it was on some pills that were MDMA. My friends and I need to eat 2.5 to get a good roll. Ben decided to eat 4 pills and smoke pot later to help kick it in. It only took an hour for the rest of us to start rolling, but Ben still wasnt feeling anything after two and a half hours. He decided to smoke some pot, and like his MDA experience, it caused him to get some visuals (although far weaker than the MDA visuals), but again, he didnt not feel any body high or any emotional uplift.",
  "He didnt experience any negative side effects, and he never appeared to be in any physical danger, but nothing really positive came out of the experience either.</p>"
 ],
 "year": "2005",
 "id": "46747",
 "gender": "Male",
 "views": "10113",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDA",
   "form": ""
  },
  {
   "time": " T+ 1:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDA",
   "form": ""
  },
  {
   "time": " T+ 1:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDA",
   "form": ""
  },
  {
   "time": " T+ 2:30",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "submissionDate": "2006-07-31T07:00:00.000Z"
}
