{
 "id": 4677,
 "title": "Unusual Little World",
 "date": {
  "submission": "2004-06-07T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "wonka and friends",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "5-MeO-MIPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:00",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "5-MeO-MIPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "3:30",
   "amount": "1 bump",
   "administration": "",
   "substance": "5-MeO-MIPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "9:00",
   "amount": "1 bump",
   "administration": "",
   "substance": "5-MeO-MIPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Due to limited information on this substance my lady and I thought we might give it a try. We started at 5pm with a small dose taken orally about 5-7mg. Within 20 minutes we felt mild effects. After about an hour we took another 5-7mg dose. The first real effects were warm body sensations, minimal visuals, music of all types sounded excellent and an overall sense of well being set in. By 7pm it was obvious that we had reached our plateau, the conversation was rolling well and we were generally happy. There was a hint of anxiety, the desire to want to move, sit in a hot tub, and have sex or dance. At about 8pm a mutual friend stopped by and let us know that other than seeming a little hyper-active we both functioned socially very well. At this point my girlfriend was really interested in the friend's clothing, textures, and kept saying how pretty it was. The friend was heading to a show and wanted a small amount for the auditory effects. We gave her minimal dose of about 5mg. because she was driving.",
  "By 8:30pm we decided to have another hit to pick things back up. This substance reminds me of cocaine with the urge to want to keep doing more when the buzz decreases. I feel that this drug could be especially dangerous for those who have never experienced a trip and have no clue how to visually measure powder. This bump really got us going, the visuals were about a five on a 1-10 scale within 20 minutes. We decided at that point we would stop with the additional doses. At 11:30 two more friends came by who had been drinking a considerable amount of liquor and beer. We dosed them with about 15mg each and in about 20minutes they were completely tripping. We watched Naqoyqatsi a visually fascinating movie, with music by Philip Glass (Warning: do not watch if you have an aversion to violence, this film is a social commentary suggesting that war and technology are destroying humanity). Then we watched Willy Wonka and our buddies laughed all night like giggling school children. I would assume the alcohol had something to do with this.",
  "In about the middle of the film I decided once again to try a small hit and the effects were minimal compared to earlier in the evening. By now it was about 2:30 or 3am we kicked our buddies out who happen to live next door and decided to try and sleep. At 7:30am we made food which tasted incredible and by 9am I was fast asleep. The crash wasnt nearly as harsh as LSD and surprisingly we all remembered our complete experience. The girlfriend complained of a headache, but she gets them anyway and some minimal stomach cramping. I felt physically fine. The buddies also didnt end up sleeping until about 8am. Next time I will try a 15-20mg dose early in the morning. 5meomipt is certainly an unusual trip."
 ],
 "erowid": {
  "id": "29826",
  "citation": " wonka and friends. \"Unusual Little World: experience with 5-MeO-MIPT (ID 29826)\". Erowid.org. Jun 7, 2004. erowid.org/exp/29826",
  "substance": "5-MeO-MIPT",
  "views": "16105"
 }
}
