{
 "title": "Downing the Black Liquid",
 "author": "C. Skeleton",
 "citation": " C. Skeleton. \"Downing the Black Liquid: experience with Coleus (ID 46787)\". Erowid.org. Oct 10, 2005. erowid.org/exp/46787",
 "substance": "Coleus",
 "bodyweight": "220 lb",
 "report": "<p>This past summer I got seriously interested in plants (especially those which are psychoactive). I learned about coleus and wanted to try it out. I bought a plant about 1 ft. tall for $2.50. I clipped basically the entire plant (nearly 60 or 70 leaves plus stems). I rinsed the leaves and stems in the kitchen sink and placed them in a blender along with precisly 1 pint of water. After thoroughly blending (chop) I had a blackish liquid with with a thin layer of foam on the top. I cut holes in the bottom of a plastic cup and covered the bottom with cotton balls to filter the remaining plant matter so I would just have the black liquid.</p><p>I drank it down quite fast and sat in an isolated room in the house. Windows closed and lights out. Here are the notes I recorded during the effects:</p><p>Drank liquid at 4:00 pm EST.</p><p>Effects begin at 4:10 pm</p><p>Subtle. I feel a sort of humming in the cheek-muscles of my face. I feel safe and secure.</p><p>4:20 pm: Seems as though my hearing is jumping from ear to ear; back and forth. Accelerated breathing but calm.</p><p>4:30 pm: A subtle warping and movement in all things around me. Not much but some. Slight tightness in shoulders and arms.</p><p>4:40 pm: I feel sleepy but not like I want to sleep. Like being in a lucid dream state.</p><p>From 4:45 to 6:30 pm I fell asleep and had some of the most realistic dreams of my life: On safari in Brazilian rainforest hacking out a trail through the jungle with a machete. False awakenings. Suddenly thrown into urban warfare running from building to building carrying an AK-47.</p><p>When, finally, I awake for real at 6:30 pm my vision is hazy and blurred. I look around the room and everything appears to be made of small square blocks. Within a half hour the effects fade.</p><p>Earlier in the day I smoked cigarettes but abstained for the duration of my experiment. It has always been my experience that smoking cigarettes (tobacco) during the use of hallucinogenic drugs causes the drugs power to weaken and I begin coming down sooner than I would if I hadn't smoked. I have experimented with this theory on many different hallucinogens and found that when I smoked the trip was not as long or as powerful as it was when I abstained from smoking (I recently quit smoking).</p>",
 "year": "2005",
 "id": "46787",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-10-10T07:00:00.000Z",
 "views": "18815",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "65 leaves",
   "administration": "oral",
   "substance": "Coleus",
   "form": "(extract)"
  }
 }
}
