{
 "id": 4681,
 "title": "Passed Out",
 "date": {
  "submission": "2004-01-19T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "heather",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "8"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "I started smoking mj when I was about 17, right before I left for college. I loved the mellow feeling it gave me, and how much my friends and I laughed when we were high. I didn't smoke that much--if I had some, it would be every day. If I didn't, maybe just a couple of times a month, or whenever it floated my way. I still smoke on and off to this day (10 yrs later), though it has dwindled to about 10 times a year.",
  "The occasion that sparked the title to this essay, happened a few years ago. I was smoking a few hits everday after work and had been for about six months. One night, I went with a couple of friends to a party--we smoked in the car on the way there, and then toked again at a friend's apt before heading to the party. The amount of pot we smoked was a lot, but nowhere near as much as I had smoked before--I didn't think twice.",
  "About a half hour later, at the party, I was sipping on a beer when I started to have an extreme panic attack. I was really stressed out about something (not having a private bathroom, let's put it that way), and I couldn't get this thought out of my mind. I was becoming increasingly agitated. My stomach was in knots and my breathing was getting faster and shorter at the same time.",
  "One of the friends I rode with (an acquaintance really) started to talk to me and I asked him if I could go somewhere and lie down. He started to walk me towards the last apartment we were at. We were walking, I felt a little better, but before I knew it, I started to get tunnel vision. We reached the stairs where I remember falling, and blacking out. I was only out for a second, and came to lying on the cement with this guy calling my name. For the next hour or so I just sat around, too scared to stand up again. I kept slurring my words too! It was really embarassing...",
  "I still smoke MJ as I reported before, but I'm curious to this day as to what exactly happened there. Other people had smoked the same stuff, so I am pretty positive it wasn't laced. It was just a just a really abnormal experience for a drug I consider so mellow, and safe, and trust me, I've done my fair share of harder drugs. But that's another story.\r[Erowid Note: Although uncommon, people have been known to pass out very briefly just after smoking cannabis.  Possible explanations include low blood pressure dipping just after the effects start and from people holding their breath too long, but it is not known how common this is or what the cause is.]"
 ],
 "erowid": {
  "id": "29831",
  "citation": " heather. \"Passed Out: experience with Cannabis & Alcohol - Beer (ID 29831)\". Erowid.org. Jan 19, 2004. erowid.org/exp/29831",
  "substance": "Cannabis & Alcohol - Beer",
  "views": "10563"
 }
}
