{
 "id": 4684,
 "title": "Quit Cold Turkey",
 "date": {
  "submission": "2004-01-19T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Dan",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>I never ever thought I would become truly addicted to cigarettes. I started around 1998, whilst in high school. I would smoke one or two cigarettes a day, and despite my friends telling me not to smoke, that it stank, that I would get cancer... etc, I still kept smoking (I think that now I probably smoked all the more, just to annoy them). Well it went from one or two a day, to around 5 a day within a year or so. It stayed that way until 2000, at which time I began smoking more and more. Half a pack wasnt unreasonable for me at first, then almost a full pack and finally in 2002 I was on a pack or so per day. My tar and nicotine consumption had also increased - from low tar, to mid tar and finally to high tar (12 - 16 mg's tar per ciggie/1.2 - 1.5 mg nicotine per ciggie).",
  "Last year, 2003, I tried many times to quit. Mainly for health reasons. Although I had only smoked for 5 years or so, the health impacts were considerable - shortness of breath, feeling sick and lethargic, smokers cough and getting colds all the time. I quit many times, often for no more then one day at a time. Finally in July 2003 I was that sick of tobacco that I decided I would quit for good. I quit cold turkey (I have tried Nicotine Lozenges/Patches/Inhaler - they don't work, in fact they make me want to smoke more) The first week was absolute hell, constant physical and psychological cravings every 20 minutes or so. But I was determined to quit, and it has now been almost 7 months! I would highly recommend the Cold Turkey quit website http://www.whyquit.com - if I felt like smoking I would visit that site, and wait until the cravings went away.",
  "Although I have now quit, I am still scared by tobacco. I know how addicted I was after only 5 years. Most of my family smokes, and its sad to see (a smokers cough is probably the most disgusting thing you could hear of a morning.) I'm scared cause I know it wouldn't take much to make me addicted to tobacco once more. I'm worried for many family members, they are smoking more, getting more skinny and I have real concern at least two may develop lung cancer in the near future, and one may also develop emphysema - yet they simply will not give up smoking at this time. Even now, even with family members severely affected by their smoking I could go back to it if I smoked a few ciggies. When I smoke pot I can't add tobacco, or the cravings come back. I know so long as I don't smoke, then I won't take it up again. I'm only 20; so I know there is a good chance most of the damage of 5 years smoking can be reversed.",
  "This might seem some health department warning story - but trust me it's not (I never believed tobacco was addictive, and didn't until I could not go a few hours without smoking). Keep smoking, or take it up and within a few years and you will see this happen to yourself.",
  "Live long, stay healthy  tobacco will steal your life, your money and your future if you give it half a chance.</p>"
 ],
 "erowid": {
  "id": "29843",
  "citation": " Dan. \"Quit Cold Turkey: experience with Tobacco - Cigarettes (ID 29843)\". Erowid.org. Jan 19, 2004. erowid.org/exp/29843",
  "substance": "Tobacco - Cigarettes",
  "views": "26204"
 }
}
