{
 "title": "They Make Me Nocturnal",
 "author": "bluedolphin",
 "citation": " bluedolphin. \"They Make Me Nocturnal: experience with Mushrooms (ID 46847)\". Erowid.org. Nov 22, 2005. erowid.org/exp/46847",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " T+ 0:15",
   " ",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "report": "<p>Hopefully this trip report will be coherent, but I only got 4 hours of sleep after shroomin' last night before I had to wake up for work (where I'm writing this from). I'm glad my job isn't one that requires a whole lot of responsibility</p><p>...</p><p>So my buddy back home sent a 4 gram bag of dried mushrooms my way. He told me they were very potent, and looking at the bag I could see no reason to doubt him. The bag contained the following:</p><p>18 full mushrooms</p><p>10 stems</p><p>1 big cap</p><p>a little bit of shroom shake</p><p>In my limited experience, a whole lot of little shrooms is a much better deal than a few big ones. Speaking of my limited experience, I've shroomed about 5 times. I've never eaten much more than 2 dried grams. It is known to all my trip buddies that I am somewhat sensitive to tryptamines, and I have never been 'dissapointed' with any mushroom trip on account of it being too weak.</p><p>My lovely girlfriend Psilosara also enjoys mushrooms. I'm pretty sure they're her favorite drug. So we lay out our 18 shrooms + 10 stems + 1 big cap + a little bit of shroom shake and took turns individually choosing the shrooms we would eat, and putting them in our respective piles... then the stems... then I took the shake and gave her the big cap. We broke up our shrooms and mixed them with honey to mask the flavor. It was a little tough swallowing the honey without chewing, but I've gone through much worse to get high (think cactus) so I wasn't complaining. Anyway I guess my overall dose was about 13 small-to-medium sized cubensis shrooms because Psilosara and I both donated a little bit of our shroom-honey mix to our friend T.</p><p>So we finished eating them around 9:00pm. By 9:15 I noticed a definite mood lift. By 9:30 I was shroom-buzzed. A couple of my friends were hanging out in my room and I soon found this hard to deal with because 1) Their conversation seemed very chaotic, and 2) They kept cranking up my stereo. I normally find shroom come-ups to be a little difficult, and this was no exception. Fortunately they wanted to smoke some pot so we went outside to toke. Psilosara and I both had one toke, mostly to help deal with the empty, uncomfortable feeling that shrooms tend to give my stomach. We stood around outside for a while while T and W packed bowls, but their conversation and laughter was only making me uncomfortable. I knew what I had to do...</p><p>I excused myself and went up to my room to be alone. I sat down on my bed and felt so much better to be in a calm and peaceful environment. I felt the waves of relaxation and release wash over me. Ahhhh, this was just what I needed... to live in a more relaxed state, and at a slower pace. I spent some time melting into my sheets and enjoying the visuals. The entire room had come to life. Nothing was still. The walls were breathing and furniture looked like it was sliding across the floor and coming closer to me. I've tripped enough that these visuals normally wouldn't entertain me so much, except that with the mushrooms I could *feel* them as well...</p><p>You see, the whole time I was aware of shifting gravity-like currents moving about the room. These currents pulled my 'center' around the room, which felt like my brain and life-force-energy was being gently (yet intensely) pulled in different directions. Sometimes these currents would swirl around within each other, and I could see how these currents were affecting the room by bending them. It's hard to explain, but what I was feeling and what I was seeing was directly connected. In this way the mushrooms made me feel very connected to the natural world around me. The buzz at this point was very intense, but relaxing at the same time and never *too* intense.</p><p>After a while of enjoying the serenity, Psilosara came upstairs to see what's up. She had also been sitting in her room enjoying the peace for a while, and when she came in she recommended I turn off the lights.</p><p>What an incredible idea! The darkness felt so much more natural and calming, and I realized I must be enjoying darkness for the same reason I needed to get away from chaotic conversation and noise. I noticed that the dark seemed to increase my visuals... I could see the currents much more clearly now.</p><p>Soon T and W came back. T was tripping very happily on the small dose we gave him, and W was baked as hell. They talked about some stuff with Psilosara but I wasn't really interested in much conversation. Psilosara and I both agreed it was time to smoke a spliff. It took me about 15 minutes to motivate myself to get the herb and papers, and another 20 minutes to roll it. Like I said, I was compelled to do everything at a slow and peaceful pace.</p><p>So we went outside to smoke. Afterwards Psilosara and I split up with T and W again and went back upstairs to enjoy the quiet and darkness. Now we were both VERY high and feeling great. So we sat up on my bed and talked about how peaceful we felt and how great shrooms are, etc. Then we started having some cool conversation about human evolution:</p><p>We thought it would be nice to walk barefoot more often, and also we wondered why people didn't use their feet for more tasks besides just stepping on them. If we did start using our feet more, we'd probably have to be crouched down like monkeys. This would allow us also to be closer to the earth. However, our bodies aren't made for being crouched down any more, and surely we'd all develop serious back problems if we tried doing that. Our species would have to evolve very quickly in order for humans to survive this self-imposed crouching. I thought, 'Wouldn't we just revert back into really smart monkeys?' But Psilosara argued that we could evolve in any number of ways, and we could turn into something totally different, and more connected to the earth. We both loved the idea of this self-imposed genetic revolution.</p><p>Psilosara wanted her water bottle so she turned on the light to find it. I closed my eyes to prepare myself for the bright light. When she turned it on I saw the most amazing psychedelic imagery behind my eyes, like dancing fields of diamonds surrounded by flames all in completely unnatural and vibrant colors. She turned off the light and I closed my eyes. What developed were probably the most beautiful CEVs I've ever seen. Just when I was in doubt if I still thought mushrooms had the best CEVs after a couple of recent LSD trips, I was reminded clearly and obviously that nothing compares to the complexity, beauty, and life of mushrooms CEVs. My mind's eye was overtaken by living and dancing psychedelic landscapes. I kept my eyes closed for a while and enjoyed this thoroughly!</p><p>We spent a good deal of time enjoying ourselves in this peaceful environment and having conversation... sometimes deep, sometimes rediculous. We probably spent about 15 minutes watching each other's faces melt and contort and laughing at that.</p><p>A little while later we went out for another spliff, then on Psilosara's request we retreated back to her room. We kissed and it took about 5 seconds before we were making out with max intensity. I've been with this girl for almost three years and I'm still amazed at how hot she is... absolutely bangin' body and the most beautiful, loving face in the world. It was like some sexual animal instinct clicked on inside of her. Needless to say the next hour and a half was amazing. In our embrace she experienced us as a blooming flower, fully wrapped up in this experience until she realized she didn't 'have a stem'.</p><p>By 2:00am I was pretty damn tired, and I knew I had to wake up at 6:45am for work, so we fell asleep. I was mostly come-down by that point. It was a relatively short trip, I guess, but it felt much longer because of the slow pace and peacefulness of the evening.</p><p>Then I woke up, went to work, and wrote this to keep myself from falling asleep on the job</p><p>I don't really think the trip could have gone much better...</p>",
 "year": "2003",
 "id": "46847",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-11-22T08:00:00.000Z",
 "views": "5708"
}
