{
 "title": "Slave to the Shadow God",
 "author": "bluedolphin",
 "citation": " bluedolphin. \"Slave to the Shadow God: experience with Salvia divinorum (ID 46844)\". Erowid.org. Nov 1, 2005. erowid.org/exp/46844",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "16 leaves",
   "buccal",
   "Salvia divinorum",
   "(dried)",
   "",
   " ",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "report": "<p>This all happened less than an hour ago.</p><p>I'm in my freshly cleaned dorm room, lights off except for a red rope light, and Brian Eno ambient music is playing in the background. I got an ounce of dried Salvia leaf in the mail today (along with 65 HBWR seeds and a gram of Salvia 5x), so I thought it would be a good opportunity to try the quid method of taking Salvia. Of course by 'good opportunity' I mean that I have the drugs and there are no pressing matters I have to attend to.</p><p>So I make two quids, each with about 8 dried leaves crushed and wrapped up in a bit of coffee filter. I stuck the first one in my mouth and chewed and juiced it like a wad of chewing tobacco. After 20 minutes of that all I was noticing was a bit of a sparkle in my vision, so I took it out and popped in the other one. I lay down on my bed and felt like my body was levitating above the bed a couple of feet, which was kind of pleasant but I could imagine it being more 'pleasant' on certain other drugs. My vision was pretty much normal, except for a bit of 'sparkle vision' and this shadow-figure that kept appearing for a couple seconds on the wall right in front of me. The longer I chewed the quids the more defined the figure became, and it seemed masculine which surprised me since, if anything, I was expecting Lady Salvia to come greet me.</p><p>I spat out the second quid because it didn't seem like anything major was going to happen with that method tonight, and I packed a single leaf into a bubbler.</p><p>After the first hit I was definitely in sub-breakthrough Salvia-space. This space is hard to describe... it's not like any other 'psychedelic space'. I think the main difference is that I have no control over Salvia space.</p><p>I take the second hit and go lie down on my bed again. Now it feels like my brain is being grabbed, and I sense that it is the Shadow God. I use the word 'God' instead of 'figure' because by this point his power was undeniable. I felt like I was about to break through into something intense, since my brain and body felt like they were being literally pulled away from my current resting place. I have experienced this sensation on Salvia before, but never with such force. At first I tried to relax and go with it, but I wasn't getting anywhere. It became uncomfortable, and I wished I would either break through or come down. I tried to fight it by ignoring it, and that seemed to work. However, I believe I was tricked into thinking I could fight it, because the next thing I knew I was packing another leaf and sparking it up. I toked it down in two big hits and sat back into my canvas chair... but only for a second...</p><p>The next thing I knew I was standing up. I had not willed myself to stand up. I felt a VERY strong urge to take a step to my right. Then another step. And another.</p><p>'Wait! I am in control of where I go, and I'm staying right here!'</p><p>Yeah right. The urge to keep walking was undeniable. I reached my desk and felt like I was being 'allowed' to put my bowl and lighter back in my drawer. Then I realized my destination was my bed, so I surrendered to the urge and lay down on my bed.</p><p>Once I was on my bed I felt a huge relief, although I hoped that Salvia was going to play nice at this point.</p><p>Then I began to sink into my bed and felt like I was becoming one with the bed. I was looking down at my body and noticed it started to turn into scales. The scales then became what I can only describe as living, breathing Plant-Eyes. It was clear to me that these Plant-Eyes (which soon engulfed my entire body and most of the room around me) were slaves to the Shadow God. Since I was made of these Plant-Eyes (and since I wasn't even completely in control of my own body) I was also a slave to the Shadow God.</p><p>But being a slave wasn't that bad. Actually I was grateful for the Shadow God's forceful means of showing me this, because otherwise I wouldn't have had that experience.</p><p>After a few minutes of this (I had no time distortion, by the way) I thought I was coming down, and noticed I had to pee, so I walked down the hall to my bathroom, with the intention of going back to my room afterwards. However, several times in the bathroom I was tricked (by the Salvia / Shadow God) into being convinced that I actually had intended to go downstairs into the common room where my friends were watching a movie. Then I would remind myself, repeatedly, that I actually was going to go back to my room.</p><p>Of course I went straight down to the common room, but by the time I got down there I was mostly back to baseline, but still in awe of what just happened and how I could be manipulated so easily by Salvia.</p><p>So, the experience freaked me out just a little, but not too much. It certainly wasn't 'enjoyable' or 'recreational' but it most certainly was 'weird' and 'powerful'. It was also the first time I have been controlled by an entity =)</p>",
 "year": "2003",
 "id": "46844",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-11-01T08:00:00.000Z",
 "views": "4508"
}
