{
 "title": "Collective Insanity at a Music Festival",
 "author": "Bluedolphin",
 "citation": " Bluedolphin. \"Collective Insanity at a Music Festival: experience with Cannabis, LSD & MDMA (Ecstasy) (ID 46852)\". Erowid.org. Apr 15, 2006. erowid.org/exp/46852",
 "substance": "Cannabis, LSD & MDMA (Ecstasy)",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  "1 tablet",
  "oral",
  "MDMA",
  "",
  "",
  " repeated",
  "oral",
  "LSD",
  "(blotter / tab)"
 ],
 "report": "<p>This might take a while to tell, but if you bare with me I guarantee a wild story</p><p>My buddy Shaggy and I were on our way to kick the summer off right. Without any advance planning, and with little in the way of preparation, we decided to go to a music festival featuring a dozen or so hippie-type jam bands. I cant be any more specific because whats written in this report could probably count as evidence against the festival promoters under some hidden provision in the Patriot Act. But I can say there were several bands at this festival that I was looking forward to seeing.</p><p>Our supplies were slim. I had $90 in spending money, about a gram and a half of Mazar (top quality Afghani indica), a hoodie sweatshirt, two canvas lawn chairs, my bubbler, and the clothes on my back.</p><p>Shaggy had perhaps $50 cash, nearly a full eighth of G-13 buds (even better than my Mazar), a tent, a sleeping bag, and a cooler filled with water, a bag of cherries, two bananas, and four skones.</p><p>Whatever, we were only camping there for one night. If we didnt have it, we didnt need it. Except drugs, thats what the money was for.</p><p>So as we paid for our tickets and drove into the lot at around noon on Saturday, we both had huge grins on our faces. Maybe the bowl of G-13 we had just smoked had something to do with it, but there was so much more. Immediately upon seeing the old Volkswagon vans, Saab 900s, Subaru Loyales, and tie-dye buses which lined the lot I felt like I was home. And when I saw the people, I knew it.</p><p>So Shaggy and I grabbed our stuff and started off to find a camping spot. Awkwardly balancing our cargo, we walked pass the stage and the rows of vendors selling food and all kinds of fresh hippie gear. There were several trails heading into the woods and we headed down a random trail. The trail lead us though a pine forest of small rolling hills, covered with a thick bed of pine needles. In almost every manageable spot somebody had set up a tent, tarp, and whatever else they brought. Soon enough we found a spot and pitched the tent.</p><p>Then we smoked a bowl of G-13 and got very baked. We set up the canvas chairs and sat down in front of our tent, enjoying the fact that we were finally settled in at the music festival which we had been looking forward to for the entire 15 hours in which we even knew we were going.</p><p>I said, This would be a good place to trip.</p><p>Shaggy said, This will be a good place to trip!</p><p>We both cracked up, because it was so true. Of course wed be tripping!</p><p>Right as we said that someone approached us and muttered something under his breath.</p><p>Huh? I knew he was selling something but I didnt know what yet. He opened his bag to show me his wares.</p><p>He showed me some pot. Headies, he said. I checked out his bag of beasters and told him I had that covered. Molly, he said.</p><p>Oh yeah? Lemme check out that molly.</p><p>He took out a roll of about 10 pills, unmarked and white, and handed them to me. Nice pills. Wheres the molly? Apparently I had yet to learn that any MDMA-related product was advertised as molly as this particular festival. Anyway, I was looking for real molly, so I sent the guy off dispite his claim that You can tell these pills are good just by looking at them.</p><p>After that we got a visit from someone from the tent next door. It wasnt hard to figure out that this particular tent belonged to about six people working together to sell pressed ecstasy pills. So this kid came over and immediately started giving me a bad vibe.</p><p>Immediately he started talking shit: Yo what up bros. Fat festie huh. I cant wait until fucking night time, you know, when its dark out. Then its time to dilate the pupils, you know what I mean? You gotta get your buzz on. Whatever makes your pupils go *boink*, you know?</p><p>I though this kid was an absolute jackass, but he stuck around for a few minutes talking the same shit. Then another guy came over and said, Rolls. Well, Im a curious person, so I asked what the stamps were. Then both of these guys started to gang up on me:</p><p>Jackass: Yo theyre number ones, theyre good.</p><p>Me: A one with three stars above it?</p><p>Jackass: No theyre number ones.</p><p>Me: I thought he was selling them.</p><p>Seller: I am.</p><p>Me: So tell me about them.</p><p>Jackass: Theyre good, you know?</p><p>Me: No, are they speedy?</p><p>Jackass: Yeah, the first two hours is like whoa.</p><p>Me: I dont want a speedy pill. How much?</p><p>Seller: $20 for 1, $45 for 3.</p><p>Jackass: $45 for 3, thats a good deal! We should go in together on 3 and save money!</p><p>Dont ask me why but for some reason I spent $30 on two of these pills. I guess I was ready to do some drugs. Mostly, I was baked, and those two guys confused me. I think they were working together.</p><p>But it was time to go for a walk and check out the entire camp grounds. The trails were beautiful and both Shaggy and I were still in the greatest spirits possible. The smell of fresh pine, pot smoke, and incense mixed to create the most delightful olfactory sensation. After walking for a couple minutes, and being offered more rolls and headies we heard someone ask if wed like some mushrooms.</p><p>Well, yes we did! We asked to see them and Shaggy was handed an eighth bag of some excellent looking mushrooms. The guy wanted thirty bucks, but to our absolute delight handed us back too much change so we ended up only paying twenty. Our intent was to split these mushrooms once it got dark, but of course I was still keeping my eyes peeled for a certain something else.</p><p>We ended up on the concert field and caught the start of a certain band Id never heard of before. Id love to give them public props, but I cant give away their name. Anyway, they were sick. The guitarist was busting out some clean and original riffs, the keyboard player had crazy sideburns and long hair blowing behind him in the wind (hey, I was amused), and the bass player kept climbing on the speakers and drums. Shaggy and I sat on the lawn puffing more G-13.</p><p>The G-13 high, by the way, is exceptional. It provides a powerful body high and mild mind trip which leaves my body feeling both relaxed and energized while putting the smoker in an instantly excellent mood. Two or three hits of the stuff is enough to get very baked, yet we smoked the stuff as if we had just discovered the miracle of fire and needed to keep that precious flame going.</p><p>We hadnt tapped into the Mazar yet. We figured a pure indica like that is best used when its time to mellow out. Right now, we were just getting fired up!</p><p>So, as we sat there watching a nearly unheard of band rock out, with dozens of beautiful young flower-dress and no-bra wearing ladies dancing right in front of us, we agreed that life is indeed good.</p><p>After the bands set was done we were ready to do some more wandering. We walked through the various trails checking out some of the crazy tents people had set up and constantly being offered headies, rolls, pharmies, and mushrooms. Soon we came to a river bank and sat on the shore to smoke a bowl of G-13. Very baked, again, we ran through the woods for a while enjoying our time in the great outdoors.</p><p>We went back to the campsite to grab a frisbee. Once again we took a look at the fine specimins of P. Cubensis mushrooms that we had. Each one was picked just before the veil was broken. Some people were gathered in front of our tent, and as we packed and smoked a bowl of G-13 we overheard someone say with no hint of uncertainty that LSD would soon be flowing through the festival.</p><p>And, after a quick game of frisbee, followed by a longer stretch of stoned people watching, I suspected the prophecy had come true. See, I noticed a group of ten hippies, ordered oldest to youngest, walking through the path as if they were Native Americans or a group of elves from The Lord of the Rings. I mean, as they walked by I could feel the vibe: serenity, peace, higher consciousness. I could tell there was LSD flowing through their veins, and that they were the ones responsible for whatever LSD might be available.</p><p>So, it was time to take another walk. We went back to the concert field at perhaps 7:00pm and I ate one of my ecstasy pills. We watched a band for a while. Initially I thought they sucked, but after about an hour I would catch myself getting into the music. Regardless, the music still sucked and no amount of MDMA would convince me otherwise, so we headed off for another walk through the woods. It was now dusk, and the trails took on a different feel to them. I knew once it got dark out all insanity would break loose.</p><p>And then, I heard it.</p><p>Doses.</p><p>I stopped dead in my tracks. Oh yeah? What are they?</p><p>Dragons.</p><p>How much for a strip?</p><p>$100 a strip, $10 a hit. But its the only real stuff here, and its gonna go fast.</p><p>Ouch. Well, I took a look at the sheets and they were for sure the Dragon blotter which Ive heard is supposed to be good stuff. I couldnt afford a strip at those prices so I grabbed three blotters.</p><p>Now, with LSD in my possession and MDMA increasingly infiltrating my mental processes, I was as happy as could be.</p><p>We got back to the tent and Shaggy asked how the ecstasy was affecting me, since he didnt notice any really drastic changes in my personality or actions besides those which could be explained by the cannabis. This was a good question, as I hadnt really thought about that yet myself. I felt I was fully up on the pill, and that it was clean MDMA, just that it wasnt really a very strong pill. Id guess there was 60mg of MDMA in there. I told him I had a nice buzz going, I had a push towards being in a great mood, and I was a bit more social than usual. I explained, had I double dropped, Id probably be more noticeably fucked. But I didnt want to double drop an unknown pill, especially if the contents of said pill could affect my ability to enjoy a psychedelic evening.</p><p>I looked at the doses. It looked like I actually had more like 4 hits. It was unperforated, but a generous cut indeed.</p><p>So Shaggy, now that Ive got this acid I dont think Ill be doing those mushrooms.</p><p>Yeah, I figured.</p><p>Do you want to eat the whole 8th by yourself?</p><p>I sure do! I was thinking that myself!</p><p>Cool. You owe me ten bucks.</p><p>So Shaggy munched upon his 3.5 grams of mushrooms and then we smoked a bowl of G-13 and got very baked.</p><p>Some time passed, and Shaggy had come up on his mushrooms, and then we heard some music that sounded pretty good from the concert field so we walked over there and sat on the grass for a while. But I was really excited to have the doses in my pocket, so pretty soon we went over to my car where I cut off about  of a hit and let it chill on my tongue for a while. I thought Id start low to see how good the acid was, and to leave open the option of eating some more ecstasy later on. We went back and sat on the grass.</p><p>After about twenty minutes I noticed the earliest effects of LSD. First, I noticed that my vision had sharpened beyond my normally perfect vision. I could see clearly, even though it was getting dark, for a much longer distance than usual. Second, I was enjoying an unusual mental clarity. As a guitar player, when I watch a band on stage I usually pay close attention to the guitar, especially if its any good. Normally I understand most of what the guitarist is doing, and I am surprised by a few tricks or riffs that I never would have thought of. As I was coming up on that first  hit of LSD, I understood everything. This is hard to describe, but it was as if I was able get inside the head of the musician to understand how and why he was playing that way. Therefore, climactic moments in the song felt like a shared musical victory. I was quite confident that I could have been on stage and had the crowd rocking. In fact, I wished I was. I believe the tab of ecstasy, which was still in effect, added an extra-emotional aspect to the beginning of my acid trip. The primary emotion was joy.</p><p>I noticed how clean the acid felt, and that I had absolutely no anxiety, so I dropped another half-tab or so of the Dragon blotter, bringing me up to about 1.25 blotters.</p><p>Meanwhile Shaggy was having a good time on the mushrooms. He complained of gut rot, and this made me glad I took LSD instead, because good LSD really has no negative physical effects worth complaining about. I was also surprised, considering how good those shrooms looked, that Shaggy was able to maintain his composure and keep a relatively coherent conversation. Of course, coherency is relative, and we were relatively high.</p><p>Soon another band came on stage, and this time it was the first nights headlining act. I had never seen them before, so it was a pleasant surprise to see how much these guys rocked! I analyzed every note at hyperspeed, down to the finest details like the angle of the pick attack. Sometimes it is hard not to feel like a super genius on LSD when my mind is working on overdrive and thinking in totally new ways. The fact that this band was made of musical virtuosos combined with the fact that I understood what they were playing so completely led me to the euphoric conclusion that I had the capacity to do the same.</p><p>My intent gaze, previously fixated on the band, caught a glimpse at the sky. The sun was setting, and the scattered puffy clouds were intensely colored. The sky looked as if it were digitized, and pixels of color were seperating and regrouping to form solid bands of color. Ah, visuals! I looked down at the ground, and sure enough the grass was crawling around in some kind of repeating triangular pattern.</p><p>I looked around the crowd and was fascinated by the different people. There were hippies, young and old. There were Hells Angels bikers. There were people that looked relatively mainstream. What was really interesting is that everyone was fucked up. I noticed that MDMA seemed to be the drug of choice tonight, because it is obvious when someone is rolling. I looked around some more, and saw a few people who I was convinced were on mushrooms. I could see through to the organic, animal quality of their experience. But where were my fellow acid trippers? I looked around some more, until I caught the eye of the man dancing right next to me. He was perhaps 60 years old and looked a lot like Jerry Garcia. I looked into his eyes, and him into mine. We both knew, and without saying anything gave each other a smile, turned back towards the band, and returned to dancing at full intensity.</p><p>After a while I turned to Shaggy:</p><p>This acid is great man!</p><p>Yeah? I think my mushrooms are starting to wear off. My belly still feels like crap though.</p><p>You should eat some acid. That will make you feel better. Hahaha!</p><p>Hmm maybe.</p><p>If you eat a hit of acid Ill eat another hit of acid.</p><p>Okay!</p><p>See, previously Shaggy was under the opinion that mushrooms were superior to LSD. I felt this was because he had never had a worthy LSD trip, and my intent was to change this so he would recognize the true prowress of LSD. Besides, I knew my night was just getting started.</p><p>We walked (floated?) over to the car and got inside to cut the last bit of acid. In front of us was a field of tall grass, and then a forest made of short trees. It looked like the field turned into a weird ocean, and that if I drove my car forward I would get lost in the tall grass. Things were starting to move around quite a bit now, and I realized I was tripping adequately. So I cut off a slightly larger piece for Shaggy and told him to stick out his tongue as I dropped it on. I had another  hit, bringing me up to two hits total.</p><p>As soon as I stepped out of the car, I was in crazy land. The ground, which was full of ruts and uneven spots, was moving all over the place. I stumbled on a couple ruts, which I thought was strange considering I was still floating. We got back to the field, and another band was playing but they didnt sound as interesting. It was dark out now, and the vending tents were lit up. I swear they looked like candy-land huts. The buildings were swinging back and forth to the music, and they were incredibly bright and I could see the energy vibrating off of them. We walked over to one such vendor hut and bought a really nice blanket, for it was starting to get pretty cold out.</p><p>We decided it was time to go for a walk in the woods. Wow! What a different feeling they had at night! Nestled among the pine trees were hundreds of tents, most of which had a small light revealing a small group of people acting crazy. Im sure this wasnt just me projecting my own trip on others: the whole place was on drugs. As we walked back to the tent we heard people throughout the woods hitting sticks against trees, forming some kind of giant primitive drum circle.</p><p>We got back to the tent and sat down for a minute. Everything was moving around and glowing with the rainbow colored vibrations which are a characteristic visual of LSD. I closed my eyes and was blinded. All I could see were incredibly bright explosive fountains of every color at once. The CEVs were too intense and unstructured for now, but I knew later on in the trip they would start to take some fascinating forms. So Shaggy and I sat talking for a while, laughing almost constantly as we heard loud laughter breaking out throughout the forest.</p><p>The tent next to us, which was apparently selling lots of mediocre ecstasy, had sent some guy up to climb a tree. He had some kind of rope light which flashed at an incredibly high frequency and created a trippy strobe effect. After some time he finally got it up there and our part of the forest broke out in applause because that rope light was trippy as hell and everyone loved the show.</p><p>For the next ten hours I hallucinated people jumping about in the tree tops, no doubt caused by this guy climbing the tree in the first place.</p><p>Right after that one of Shaggys friends stopped by the tent. He had some molly (mdma powder). Since this, along with LSD, was what I was hoping to find that night, I asked him about it. After much confusion regarding the cash in my wallet (I couldnt tell which bills were which, and I tried to buy way more molly than I had money for) I finally settled on 300mg of molly. Then I proceeded to nearly lose the gel caps because they blended in with my sweatshirt and my hand. This was a difficult purchase!</p><p>At the time I had no intention of eating any of that molly though. Lord, I was high enough, and didnt want to fuck with a perfect trip! I just thought it would be a good thing to save for some time when I wanted to have wild sex with my girlfriend until the wee hours of the morning. I have since eaten the molly, and it was good. I never write mdma trip reports though, because, believe me, you dont want to read them</p><p>Soon after that some one of Shaggys other friends stopped by (we will call him A), and had with him two of his friends (B and C). For some reason we were looking for some cabins where the late-night bands were supposed to be playing, so we set off on a walk with these guys to find them. On the way there we were delayed several times by the following events:</p><p>1. B and C wanted to eat some mushrooms. I guess each of them ate just under an 8th of shrooms each. So we stopped at their tend and they chowed them down.</p><p>2. Some Hells Angels stopped us and asked, in the lowest, scariest, graveliest voice imaginable, if we wanted to buy pounds of weed or mushrooms. We very tactfully turned down their offer. I tried not to freak out or crack up. I wasnt sure which one I was about to do, but I was glad to be on my way.</p><p>3. A wanted to buy an ounce of herb, so we had to stop by some tent and wait around for what seemed like a long while. Meanwhile, waiting around, I had a fun time chatting with B and C. B, in particular, seemed like he was losing his sanity, to my great amusement. See, on LSD, no matter how fucked I actually am, Im really convinced I have the mental advantage over anyone Im around. I am the wittiest, clearest-thinking guy alive</p><p>4. We found a river and stopped to smoke a bowl. I smoked about four hits of the first cannabis Id had since I dropped the acid. I was so high already that I couldnt tell if the weed did anything. Actually, I think it gave me gas. Meanwhile Shaggy and A were sitting on a fence post, and the fence post broke and they both landed on their asses. Im sure you can imagine the non-stop laughter that broke out.</p><p>5 through 43. Yes, there was quite a large number of times when we got sidetracked simply because we were all tripping balls and somehow ended up standing around before we remembered that we were on a mission of sorts.</p><p>Anyway, eventually we got to the late night cabins, but they were too packed to get inside, so we stood around outside for a while. There was one guy, who was quite large and wearing a fur hat with ear-flops, who offered me some Jagermeister. I turned down the offer because I was happy with my current mindspace. Then he stuck out his hand and I noticed a bunch of people gathered around him. I looked and saw he was handing out mushrooms like he had an endless supply of them. I admit, the mushrooms were more tempting, but I was still peaking on the acid and didnt really feel like dealing with gut rot. This guy was fucked up beyond belief, and quite a large guy, and I thought it was halarious.</p><p>Then I bumped into someone behind me, turned around, and saw a huge black leather jacket with the famous Hells Angels logo. The biker seemed like he was harrassing some kid who he must have fronted a bunch of drugs to earlier on in the night.</p><p>Hey Shaggy.</p><p>Yeah?</p><p>Im feeling the urge to go for another walk in the woods. What do you say?</p><p>Allright.</p><p>So our group of trippers took off once again. Walking back to our tent, we passed a string of three police officers walking the other way. I still had no paranoia, except when it came to the idea of getting harrassed by a 250 pound biker.</p><p>We arrived at the camp site and by that time B and C were rather fucked from their mushrooms. B, in particular, was starting to lose it. We had some African-type thumb piano (pardon my ignorance, I have no idea what this thing was actually called) and he only seemed to be happy when he was playing it. He was constanly muttering nonsense and he seemed really confused. At one point he ran across the trail to another tent and handed somebody three dollars, apparently thinking they were looking to break a three-dollar bill. Since I was having fun talking to this kid earlier on in the night I took it upon myself to make sure he was doing allright, especially once I had learned it was his first time tripping. He was totally disoriented, stopping people on the trail and saying, What did you say your name was again? and Have I been bad? and stuff like that. Thankfully we were in just about the best place for something like that. Everyone was very understanding and nice to him (even though many couldnt help crack up at him anyway). He kept asking for Neilson and I had no idea who he was talking about. Perhaps two hours later I finally got him to describe Neilson, because I wanted to find him so B would mellow out. It turns out Neilson was what he decided the African thumb piano was called, so I got that thing for him.</p><p>We sat around smoking copious amounts of ganja and random people stopped by in various states of insanity and confusion and it was tons of fun.</p><p>At one point, Shaggy collapsed on the ground and started cracking up. Later, I asked him what the deal was with that, and he said, Thats when the acid hit me!</p><p>Now, at perhaps 5:00am, I was a bit tired of sitting outside in the freezing cold and listening to B continue to talk complete nonsense (I have never seen anyone affected by mushrooms so hard for so long), so I went inside the tent to wait until it got warm out again. I knew there would be no sleep tonight, because now, nine hours after eating acid, I still felt like I was peaking. We smoked a couple bowls of Mazar, and enjoyed the relaxing qualities of this fine indica.</p><p>Shaggy joined me and spent a lot of time moving about the tent, and I made fun of him for not being able to settle down and chill out. We knew the next four hours would be spent on the verge of sleep, but not being able to sleep. Even if the LSD would have let me sleep, the constant sound of chaos and laughter outside the tent wouldnt have let me.</p><p>Over the next few hours several people decided to use my canvas chairs as a place to sit down and hold some seriously e-tarded conversations. Take this, for example:</p><p>Guy 1: Yeah, you know how we do it, legit deals only man.</p><p>Guy 2: Word, theres not enough people like us left these days.</p><p>Guy 1: You know, I work with like 5 other people and we call ourselves the monkey gang.</p><p>Guy 2: Huh?</p><p>Guy 1: Yeah, we like run around the forest acting like monkeys, its totally chill.</p><p>Guy 2: Huh?</p><p>Guy 1: You know, its like a joke and stuff. We run around and go, oooh-oooh, aaah-aaah!</p><p>Guy 2: Well thats cool you can poke fun at yourselves.</p><p>Guy 1: Yeah its not meant to intimidate, you know, we figure we might as well have some fun while were working, you know.</p><p>Guy 2: Huh.</p><p>I know there were several weird-ass conversations that I wished I had a notepad to write down, because the level of randomness and e-tardation occuring outside my tent that night was at an all-time high. But, since I knew I couldnt sleep anyway, I thought it was interesting to listen to these oddball conversations.</p><p>Eventually the sun came out again. The sun shone through the trees and cast some fascinating shadows on the canvas of the tent above my face. I realized I was still tripping full force, and this must have been 14 or 15 hours after dropping the acid! Excellent, I thought. This is going to be a strange day!</p><p>I turned over on my side and looked at the side of the tent for a while. Slowly, the moving shadows caused by the sun and the swaying tree branches transformed. After a minute or so they had turned into a couple of three-dimensional people dancing inside the tent. It was totally realistic and maximally trippy! I couldnt believe my mind was still being blown so long after taking the acid.</p><p>I stepped outside and everything still had the LSD vibration. Outside, some people were outside cooking breakfast. Some people were walking around looking strung out as hell. Some people looked like they had just taken a fresh capsule of molly and were still going strong. I heard people saying, Im still tripping! and was glad not to be the only one.</p><p>Shaggy woke up (that bastard actually got some sleep) and we smoked a bowl of G-13. I looked down at the ground and had an amazing vision. The ground, covered with pine needles, turned into a completely flat surface. Then, all the pine needles started glowing and I could see each one, from below my feet to the horizon, in perfect clarity. I could see the entire network of pine needles across the forest floor, and saw that each one was placed with mathematical precision by the forces of nature. Then, the entire forest floor turned into what I can best describe as The Matrix. I will leave this to your imagination, because it is really indescribable. I will say, however, that it looked far more amazing than the green digital text of the movie Matrix.</p><p>That day we continued smoking bowls, and I found that even though I was tired, I wasnt as physically exhausted as I might have been. I was hungry, out of food, and broke though! I will say that the LSD lasted 20 solid hours, because that was the point when I finally gave in to Shaggys insistance that I go for a quick drive to the ATM.</p><p>So, that is my introduction to the American hippie music festival, for those of you who have never been to such a thing.</p>",
 "year": "2004",
 "id": "46852",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-15T07:00:00.000Z",
 "views": "7016",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": ""
  },
  "2": {
   "time": "",
   "amount": " repeated",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
