{
 "title": "I Stood Up and I Said 'Hey! Yeah!'",
 "author": "bluedolphin",
 "citation": " bluedolphin. \"I Stood Up and I Said 'Hey! Yeah!': experience with Mushrooms (ID 46862)\". Erowid.org. Nov 4, 2005. erowid.org/exp/46862",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "report": [
  "<p>Last night I had one of the best drug experiences of my life.",
  "I never would have guessed, after a summer of hardly any psychedelic drug use, that the 1.8 grams of mushroom shake I chose to eat last night would have a greater impact on me than the single dose of LSD I ate at a concert last weekend.",
  "Early on in the summer I experienced three days of psychosis due to accidentally ingesting a medium-large dose of methamphetamine (disguised as MDMA pills, they turned out to be half and half) along with 7 strong hits of LSD. For three sleepless days I lived the life of a paranoid schizophrenic, and following that 'trip' I was left in a bad sort of depressed / anxious funk.",
  "Before this experience LSD had always been my greatest psychedelic ally, so last week when I was ready to give it another chance I delighted to see that the LSD experience was far from ruined for me. Fucking methamphetamine.",
  "But, yesterday I had the house to myself. And when I've got the house to myself and nothing much to do I have a statistically 674% higher chance of ingesting psychedelic drugs.",
  "Now I've eaten mushrooms plenty of times. I've had some fantastic trips, experienced ego-loss and rebirth, and had plenty of shitty nauseous and anxiety filled trips on mushrooms as well. Basically, since I first tried LSD, I have considered mushrooms pretty much 'obsolete'. Mushrooms could be a religious experience, but LSD always seemed so much more human, enabling me to learn about myself and my place in humanity.",
  "Anyway, I had some mushrooms and they looked pretty damn good. I think they are some Thai strain like Koh Samui. I thought about whether I would eat some all afternoon, and finally around 5:00pm I ate half a peanut butter sandwich so I wouldn't have to eat the mushrooms on a completely empty stomach. Then I began powdering and gel-capping 1.8 grams of mushroom shake.",
  "The reason I gel capped them was to give the sandwich time to settle, and also because I can't stand the taste of mushrooms, and I am disgusted by the little bits that get stuck between your teeth and then expand upon being introduced to the moisture in my mouth. Since I didn't bother stuffing the gel caps very tight, 1.8 grams ended up filling 8 or 9 gel caps. I munched down the first 5 caps, watched half of Malcolm in the Middle, and then ate the other three.",
  "Why such a wimpy dose bluedolphin, and why bother spacing out the gel caps, are you afraid of 1.8 grams of mushrooms? Pussy.",
  "Whoa, take it easy there, guy! Actually I was a little scared of eating mushrooms, as they have a tendency to kick my scrawny ass. Plus the last time I ate more than a gram of them was over a year ago.",
  "The first noted effects was a little churning in my stomach. This could very well have been psychological, because I expected it, but it turned out to be very mild and fleeting. About 45 minutes after eating the gel caps I was starting to feel a bit heavy, but in a good way. Like, extra relaxed. I also noticed a nice tryptamine buzz coming on, which if you haven't experienced it, feels kind of like energy flowing through your veins. But not in an amphetamine-like way. In a God-energy like way. The body energy of various tryptamines, like mushrooms, 4-ACO-MIPT, DMT, and LSD are similar, but feel like they tune in to the God-energy on slightly different wavelengths. LSD and 4-aco-mipt have steady, shorter waves; and DMT and mushrooms have more variable waves. The more variable waves gives the impression of another force conducting how you (or perhaps I should just say 'I') feel. Therefore I believe the mushroom and DMT tune one in to the God-energy frequency most closely.",
  "However I found DMT difficult to work with on a spiritual level because it felt like I was receiving crossed signals from all over the universe. In other words, perhaps DMT tunes in *too* well, and provides us with far too much visual and somatic stimulus to work with.",
  "If you think that sounds crazy, remind yourself that you are the one who is reading somebody's story about eating some mushrooms",
  "Anyway, on to the trip, right?",
  "So now it's 7:00pm and I'm pretty high from the mushrooms, and looking around I notice red/orange/yellow tones are enhanced. Also things look, well, more interesting. In another 15 minutes I was having some nice moving visuals, like objects slowly shifting in patterns and slight morphing. Nothing too extreme but beautiful nonetheless.",
  "I was talking to some friends online and decided it was time to turn off the TV and step away from the computer, as I was actually starting to 'trip'.",
  "My first thought was to take advantage of my psychedelic mindset and play guitar. So I picked up my guitar and played some improv for a bit, but I kept slowing down and eventually stopping. My head felt heavy and my hands felt slow and awkward. I realized the onset of a mushroom trip was not the best time to attempt to play guitar, and hoped I would have better luck later on.",
  "Since I felt heavy I moved over to the couch, and laid down. My body felt excellent, very fluid and soft actually, with that pleasant God-energy flowing through me at the same time. I watched the ceiling for a little while and it morphed a bit and the colors were excellent. Then I closed my eyes and watched transparent waves and blobs of color shift around as if carried by a cosmic breeze. My closed-eye visuals never got photorealistically intense during this trip, but that's just eye candy anyway.",
  "I thought some music might be nice so I put on some tracks off of The Flaming Lips' 'Soft Bulletin', followed by the entirety of their album 'Yoshimi Battles the Pink Robots'. This turned out to be a most excellent decision. At first I was a little conscious about how loud the music was and turned down the subwoofer a bit, but once I convinced myself it wasn't too loud (even though it wasn't too loud to begin with) I fell into a kind of a trance, following the music on what seemed like a very deep level. Music never sounded so good before, and I've taken a lot of psychedelic music-enhancing drugs!",
  "When 'The Spark That Bled' came on, I had a sort of epiphany. Here are the lyrics, in case any of you have sparked up a nice spliff in the past hour or so and are actually getting into this trip report",
  "I accidentally touched my head",
  "And noticed that I had been bleeding",
  "For how long I didnt know",
  "What was this, I thought, that struck me?",
  "What kind of weapons have they got?",
  "The softest bullet ever shot",
  "I stood up and I said, yeah!",
  "I stood up and I said, yeah!",
  "I stood up and I said, hey! Yeah!",
  "From this moment on",
  "Blaring like a trumpet",
  "Coming from above us and somewhere below",
  "The confidence of knowing",
  "Descending to relieve us of the struggle",
  "To believe its so",
  "I stood up and I said, yeah!",
  "I spoke up and I said, hey!",
  "I stood up and I said, hey! Yeah!",
  "And it seemed to cause a chain reaction",
  "It had momentum, it was gaining traction",
  "It was all the rage, it was all the fashion",
  "The outreached hands had resigned themselves",
  "To holding onto something that they never had",
  "And thats too bad",
  "'Cause in reality there was no reaction",
  "I accidentally touched my head",
  "And noticed that I had been bleeding",
  "For how long I didnt know",
  "During the lyrics, 'I stood up and I said, hey! Yeah!' I felt so euphoric and couldn't resist standing up with a massive feeling that all was well in my life. Then, while standing up, I noticed how fluid my body felt and how fucking great The Flaming Lips are, so I started to dance.",
  "Now, I never dance. I never really liked dance and thought watching people dance was boring as hell. But I tell you I was doing all kinds of crazy interpretive dance to the Flaming Lips, using every part of my body, and I realized the power of dance is equal to the power of music. Although that doesn't change the fact that I still like music better than dance",
  "Since it was really hot that day I was working up a good sweat, and ended up stripping down to my underwear, because there's really no point in having 'extra' clothes on while you're on shrooms, is there?",
  "My dance was guided by the God-energy. It was effortless, creative, beautiful, and felt great. I danced for about two hours, and during this time I presented myself with many questions regarding my path in life. With each question the mushroom helped myself to see that I am on the right path, and that I am indeed at a turning point that will make me a happier person for much of my life.",
  "Then I posed the trickiest question: 'Is it okay to use psychedelic drugs, or are we meant to learn these things in our natural journies through life, or perhaps after we die?'",
  "There was no definitive answer. So eventually I decided that:",
  "- I was having a blast.",
  "- I was actually dancing, which is a healthy activity.",
  "- My body was in no harm.",
  "- My mind would probably be better off having this experience.",
  "So, what the hell. I already know it's bad to take psychedelics too often, having done that for a few years until I had sapped all value out of them for a pretty good span of time. I already know some psychedelics are essentially worthless. I have come across no phenethylamines, for example, that tune in to the holy God-energy. Most of them have an amphetamine-based energy. Mescaline comes closest, and is a great spirit teacher. But learning from a spirit teacher is different from tapping to the universal and multi-dimensional God-energy waves.",
  "The song 'Do You Realize??' came on, near the end of Yoshimi Battles the Pink Robots, and blew my mind. If you are reading this trip report and have not really listened to The Flaming Lips I highly encourage you to do so.",
  "The line, 'Do you realize, that everyone you know, someday, will die' really struck a deep chord at the time.",
  "After a couple hours of dancing I was just barely starting to come off my peak, so I sat down and tried to play guitar again. It was slow going at first, but slowly I worked my way into a state of mind which felt inspired at the time.",
  "I wrote a song:",
  "This guy is",
  "what I am",
  "That guy is",
  "what I am",
  "The sky is",
  "what I am",
  "Some good mushroom inspired lyrics eh? Anyway I jammed that song out for like 20 minutes (even though it can be cut down to 3-4 minutes, but why do something like that??) and had a lot of fun listening to the dank sound of my own guitar. Playing with my Boomerang Phrase Sampler is always a blast, it's just about the best thing I ever bought, and it was even more fun on shrooms.",
  "So I probably played guitar for an hour and a half or so, and had tons of fun. After that I was down to a medium ++ and decided to go back online and start raving to some friends about how these were the best mushrooms I ever ate. I felt like I just had an extremely religious and healing experience... and with no anxiety or nausea! I still felt incredibly dank.",
  "The comedown was very smooth, and by midnight I was left barely feeling the effects of the shrooms, but still slightly tuned in to the slightly stimulating God-energy and feeling like I had just been blessed by the universe.",
  "Around 1:00am I took a 1mg Xanax (I am an insomniac to begin with) and half an hour later passed out pleasantly.",
  "Best. Shrooms. Ever!",
  "Thanks for reading :)</p>"
 ],
 "year": "2005",
 "id": "46862",
 "gender": "Male",
 "views": "16322",
 "dose": [
  {
   "time": "0",
   "amount": "1.8 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(capsule)"
  }
 ],
 "submissionDate": "2005-11-04T08:00:00.000Z"
}
