{
 "title": "A Pretty Bad Time",
 "author": "Jewel",
 "citation": " Jewel. \"A Pretty Bad Time: experience with 2C-B (ID 46878)\". Erowid.org. Jan 12, 2009. erowid.org/exp/46878",
 "substance": "2C-B",
 "bodyweight": "135 lb",
 "report": "<p>I had obtained 2 pills from a friend who told me not to take 2 20 mg pills at the same time especially since i was only used to one and had only done 2-cb twice, but on a random weeknight I took the compulsive and experimental incentive to take 2 ...alone. My parents were asleep. I took the pills a few minutes apart around 1:30 and went out into my porch and smoked cigarettes for about 15-20 min. after waiting and nothing happening i figured the pills weren't good and went straight to bed.</p><p>Around 3:30 I woke up in my dark room more terrified then I have ever been in my life. I was definitely tripping but the darkness and unknown combined made it a terrifying experience. I got very cold even with sweaters and blankets on, I felt I was in Antarctica. I was definitely convinced I was going to die with all the shaking and stiffening of my muscles. I felt I was on a high speed train that was heading for a brick wall , but I was forever stuck in the last millisecond before it crashed.I saw the devil laughing at me and felt things crawling on me.</p><p>I saw pretty sick things happening, until finally i couldnt' take it and at 3:30 i texted my poor friend and told him i thought i was going to die. he texted me back telling me to call him so I did. He began to talk me through, telling me it was just a drug and that it would pass. He told me to listen to music, soft buddha bar music, and turn a low light on, and that the experience would get better. After talking to him sometime and hanging up i turned a light on and the experience changed, it was very bright at first but of course it was 4:30 by then and the drug had been going for some time. The trip lasted for 8 hours complete. I walked around my room, was told not to look in the mirror, but i did anyway and i didn't like what i saw sometimes. Smoking pot may have helped it, but it was great nevertheless. My pupils were dilated for 8 hours. The come down was 4 hours and the after effects were about 8 hours. I got very dehydrated and totally hungover and could NOT SLEEP.</p><p>MY experience lasted longer and was terribly intense because i took two. It was terrifying at first, but two of those pills is so amazing visually that i would do it again but in a better environment and under a better state of mind, and definitely not alone. In a crowd it may be disorienting, but in a small group or couple it would be a great experience. One pill was comparable to ecstasy, while two was like lsd.</p>",
 "year": "2005",
 "id": "46878",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-01-12T08:00:00.000Z",
 "views": "7905",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "(pill / tablet)"
  }
 }
}
