{
 "id": 4689,
 "title": "I Just Ate a Universe!",
 "date": {
  "submission": "2004-01-26T08:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Treefingers",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "15",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "fresh",
   "specific": "P. cubensis"
  }
 ],
 "report": [
  "One day while walking through my house I stumbled upon a few small mushrooms growing up through the floor. My first thought was to remove the unwelcome fungi, but upon closer inspection I noticed that they were of the species Psilocybe cubensis, the Ecuadorian strain to be exact. An estimated 15 grams wet, I put them into a blender with some OJ and drank this magical concoction.",
  "I found my brother and told him of my happy little encounter, and asked if I could hang with him for a while I shroomed. I wouldn't say that he was delighted, but he agreed to it.",
  "In a surprisingly short amount of time I felt a definite change in my perception (I always begin to feel my mushrooms within the first ten minutes. Of course I also always take them in the manner described above, or in a tea). The world was beautiful! I was incredibly happy. While the visual aspect wasn't exactly apparent, I could see tiny details within the world around me. While gazing out the window I saw a little yellowjacket hanging on to the screen. I got up close and stared in amazement at this creation. It wasn't moving, and I was sure that it had passed on. I sat and mourned for the pest until it finally flew away. Once I realized it wasn't dead I was overjoyed and cried tears of joy for the bug's new chance at life.",
  "My brother laughed at me, then began to play Zelda on the Nintendo 64. What a boring game. How could my brother be interested in this stupid game when there was so much to explore in the world around us? I got a bag of tortilla chips and ate them. I wasn't particularly hungry, I just felt like experiencing the act of eating. It was incredible. I could feel the chips begin to break down within my salivating mouth. Swallowing was particularly enjoyable. I was reveling in my body and the amazing feat of eating. I thought it incredible that we obtained our energy in such a disgusting manner. I loved being human. I also told my brother than I loved him several times. He seemed more annoyed than touched, but he always repeated it back to me which kept me content.",
  "For some odd reason I decided to look at my chips up close. Oh my god! There were tiny universes within each one of them! I had already eaten an innumerable amount of innocent souls! I was filled with remorse and guilt, or perhaps maybe I had just become full.",
  "I grew bored with video games, and tortilla chips and so I went into my room and called a few people. I told them all that I loved them. They thought I was crazy. I told them that I thought I was crazy. They hung up the phone on me. I love them, every one of them.",
  "All in all an enjoyable day."
 ],
 "erowid": {
  "id": "29862",
  "citation": " Treefingers. \"I Just Ate a Universe!: experience with Mushrooms - P. cubensis (Ecuadorean) (ID 29862)\". Erowid.org. Jan 26, 2004. erowid.org/exp/29862",
  "substance": "Mushrooms - P. cubensis (Ecuadorean)",
  "views": "7152"
 }
}
