{
 "title": "Testing Out Some Kitchen Chemistry",
 "author": "Desperate Psychenaut",
 "citation": " Desperate Psychenaut. \"Testing Out Some Kitchen Chemistry: experience with Methcathinone (ID 46910)\". Erowid.org. Mar 21, 2006. erowid.org/exp/46910",
 "substance": "Methcathinone",
 "bodyweight": "140 lb",
 "report": "<p>I attempted to prepare methcathinone acetate (I couldn't obtain any hydrochloric acid) from 720mg of pseudoephedrine using the chilled permanganate method.</p><p>My friend L. and I divided the powder into roughly ten lines.  We each snorted a line, and realized that too much acetic acid had been added.  We dissolved another line each into water and consumed that.</p><p>We did some laundry and temporarily parted ways to do some cleaning. Whenever I sat down, my leg would bounce.  L. reported that she could not sit still.</p><p>I got some cramps and felt the need to defecate (but only managed to emit a bit of water).</p><p>After about two hours of laundry and cleaning/organizing, we decided to dose again.  L. tried to snort another line, but the burning was too intense, so she consumed the remainder of the line orally.  I consumed one more line orally.</p><p>After dosing, we set out on a long walk.  Everything seemed sharp to the both of us.  My senses felt fine-tuned.  I wasn't over-talkative nor irritated, but I was pretty happy in general.</p><p>The stronger effects seemed to last around two hours.  For me, the speediness came in waves.  I was never sure if I was plateauing or coming down.  I had done DXM the previous night and the cat cleared up any last 'fuzziness' feeling remaining in my head from the DXM.  I felt a bit physically worn out (I tend to get the tired-but-still-wide-awake effect on uppers).</p><p>L. had no appetite, and couldn't get to sleep for around seven hours.  I managed to sleep after a few hours, but the sleep was somewhat interrupted.</p><p>(After the walk, I think we consumed a line more apiece in water solution, but my memory is fuzzy... I have about two lines left, so this seems right.)</p>",
 "year": "2005",
 "id": "46910",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-03-21T08:00:00.000Z",
 "views": "10621",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "",
   "substance": "Methcathinone"
  }
 }
}
