{
 "title": "Separate fine. Together hell.",
 "author": "Krieger",
 "citation": " Krieger. \"Separate fine. Together hell.: experience with LSD & Cocaine (ID 4691)\". Erowid.org. Dec 31, 2001. erowid.org/exp/4691",
 "substance": "LSD & Cocaine",
 "bodyweight": "185 lb",
 "header": [
  "DOSE:",
  "6 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  "",
  "3 lines",
  "insufflated",
  "Cocaine",
  "(powder / crystals)"
 ],
 "report": "<p>Well, I had done cocaine alot before and I knew that drug fairly well. I had also done alot of acid before. I had fairly pleasurable results using these 2 drugs seperately of one another, but I was unable to find a good description of what the synergies of the two would be. So, being the kind of brave(stupid?) person that I am, I decided to take it into my own hands and find out what it was like.</p><p>Well I learned pretty quickly that it ain't fun. Tripping is fun by itself. Cocaine is fun by itself. They are even kind of fun together for awhile. But then take the cravings and the darkness of cocaine with the fragile mindset of tripping and something horrible happened to me. My throat became extremely dry and constricted. I could barely breathe. And the more I thought about it the more I fixated on it. Within an hour or two I thought I was dying. I could barely swallow and my breathing was completely shallow. I choked on every other breath and I swallowed fluid just to keep my throat open. My mind was racing and my heart was racing faster. My whole body was numb and I was starting to black out. At a very last resort I came out of my bedroom and let my sister know that I had done something very very stupid and that I may have to go to the hospital. I could barely choke out the word 'Help'. I lay on the ground for a good 2 hours or so barely breathing struggling for life and sanity.</p><p>I never made it to the hospital, because my sister talked me out of it. She said that they would most likely pump my stomach and put me into a rehab or something. That didnt sound like something I was interested in, even if I was half-mad on acid and struggling for life. Eventually I calmed down and my throat loosened to the point where I could easily breathe. So there you have it. I didnt die, and I never made it to the hospital, but I sure made a jackass out of myself in front of relatives and I ruined my(and their) weekend. It also brought out in the open my use of drugs, something which I had previously kept private and hidden from them. Its kind of hard to hide something like that when you stumble out of your bedroom in the middle of a regular evening trying to breathe and choke out 'Help!'.</p><p>Please post this to inform anyone else who is looking to combine these 2 drugs as to one possible result of their actions.</p>",
 "year": "2001",
 "id": "4691",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-12-31T08:00:00.000Z",
 "views": "40935",
 "dose": {}
}
