{
 "title": "Melting Into the Furniture",
 "author": "Korny5858",
 "citation": " Korny5858. \"Melting Into the Furniture: experience with Cannabis & Salvia divinorum (leaves) (ID 46934)\". Erowid.org. Jan 16, 2008. erowid.org/exp/46934",
 "substance": "Cannabis & Salvia divinorum (leaves)",
 "bodyweight": "135 lb",
 "report": [
  "<p>Tonight, a group of friends and I got together for our weekend partying and since its homecoming at our school this weekend, we decided to take it up a level and try something new -- Salvia.  I had smoked salvia alone many times before with very little if any effects, but there was one time when I mixed the leaf with cannabis and had a VERY strong and very long-seeming trip. ",
  "We were hanging around my friends apartment and before long, a pipe was loaded with very decent cannabis and passed around between 5 people.  After the first bowl was gone, another was loaded and smoked shortly after.  When we polished off that bowl, I was the first to load up a bowl of straight dry-leaved salvia - normal potency.  It was a very harsh, very hot smoke that seemed as though it were trying to tear through my throat and lungs. ",
  "The effects were almost immediate, I began to melt into the chair.  Not a calm slow melt like an ice cube, but a fast and crushing melt; as if I were being sucked into the chair by a gravitational pull.  I couldnt possibly move.",
  "When I got my strength back and I wasnt glued to the arms of the chair any longer, I figured what the hell, might as well load another bowl.  This time, the open eye visuals began.  Patterns formed in the swirling smoke in the air of the room, spirals were very evident and geometrical shapes lined all the walls and ceilings.  The heaviness came back with a vengeance and my body felt as though weights had been stacked on top of it holding it into the chair. ",
  "The visuals were soon joined by auditory hallucinations.  I was looking off into the distance and I heard someone talking but I wasnt sure if it was to me or not.  Another friend was standing in the doorway of the kitchen and was looking past me and I couldve sworn he said something to me but I knew he hadnt because his mouth had not opened.  But then it happened again - he talked without his mouth moving at all.  I couldnt hear what he was saying totally so I yelled to him What?  What are you saying?  He looked at me with a confused look and I felt sort of uncomfortable after this.",
  "Time went on and people came and went.  I took a seat on the more comfortable couch in the room and someone loaded up a bong with more cannabis and passed it around.  After the first pull on the bong, I felt as though I were tripping on mushrooms without the color shifting and morphing.  My arms felt like they were forming to the contours of the couch, like they had fused with the fabric, the music had the walls and everything around me pulsing along with the beat and I figured what the hell, may as well go balls-out tonight and smoke some more salvia. ",
  "I pried my arms from the couch and packed the bong with some more salvia and passed it back and forth between a friend and myself.  Each and every hit caused more and more of a pressing body-trip.  I felt my internal organs being crushed by some force that I couldnt see yet I knew was there.  The visuals were getting very intense and everything around me moved in a very shifty way.  Everything looked like the camera-views in music videos such as 1979 by the smashing pumpkins.  Everything continued to look like this for a very long period of time.",
  "My friends then decided it was time to go to the bar.  I am unable to do so for I am not yet 21 years old but since they were leaving, I had to find somewhere to go.  We took off walking out the door and into the cold night air.  It was VERY hard to walk straight and I continued to lose my balance and was zig-zagging on the sidewalk.  I felt a strange urge to skip but that was soon done away with as I found I didnt have the energy.  My friends walked to the bar and I stopped at mcdonalds for some quick food and an energy boost.  I found it very hard to concentrate while ordering and Im pretty sure it was evident I was struggling to comprehend even the smallest thing such as standing in a line.  I kept zoning in and out while looking at the menu and decided that it wasnt such a good thing to be standing in the middle of so many college students, most of which were completely drunk and loud.  One wrong move could have sparked anger from such a crowd and being this is a very rural area, drug use is looked down upon but alcohol is abused like no other. ",
  "After I had finished eating, I decided just to go back to my dorm and listen to some more music.  This was around 3 hours after I had started the night and the trip was still pretty strong.  It was physically hard to move and my mind didnt want to stay still.  Ive been struggling with visualizing the shapes of molecules in my Organic Chemistry class so I wanted to see if this visual trip would allow me to see the shapes in a new light... boy was I in for a surprise. ",
  "I looked at the basic structure for Propane and closed my eyes.  The shape was still very clear in my head and I could rotate it around in a 3D motion at will.  I opened my eyes and looked at a simple cyclohexane shape and closed my eyes for a second time; I could see the 3D shape floating in front of me and I was able to fully manipulate the shape and was able to see it from any angle.  It was incredible; I finally understand how the molecule can be in different forms and I know what it looks like and what it has to go through to get to each; a very cool thing to see at 1 am on a Saturday night.",
  "From what I have read, trips on this drug werent supposed to last a long time.  I tripped for a good 3 hours if not longer tonight from the large amount of salvia that I ingested over a 45 minute period.  It was a really cool trip that somewhat mimicked the first time I tripped from salvia and cannabis.  The effects vary greatly from person to person, however.  my friends all had different reactions from the drug but none of them had a horrible experience by any means.  Once again, I have been introduced to more angles of reality and feel confident in my stance that psychedelic drugs can be used positively in many ways.</p>"
 ],
 "year": "2005",
 "id": "46934",
 "gender": "Male",
 "views": "4742",
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "submissionDate": "2008-01-16T08:00:00.000Z"
}
