{
 "id": 4693,
 "title": "Temporary Insanity",
 "date": {
  "submission": "2004-03-18T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Stupid Girl",
  "gender": "Female",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 oz",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  }
 ],
 "report": [
  "Before I begin the story, I would like to explain that contrary to what you might think after I'm finished, I am and was a very experienced pothead. At the time this episode took place, I was smoking on a daily basis, a cutback from when I used to smoke 5 times daily. I was a successful grower, very knowledgable on the subject of cannabis.",
  "Now, I had about 2 lunch-sized brown paper bags filled with pot that was harvested a bit too early. Mind you, I had smoked this premature pot previously in times of need and it got me high. It was still smokable weed. There were just a lot of fan leaves and not-so-potent plant parts mixed in with the smokable stuff.",
  "I decided that I wasn't going to smoke it and I didn't want to throw it away, so I cooked it into butter. I threw the grass into a pot of boiling water along with a stick of butter. After it simmered for a few hours, I squeezed all the juice out of the grass, and all the remaining liquid was in a bowl, I then put it in the fridge to solidify. Once the hard butter was at the surface of the bowl, I put the butter in another bowl and disgarded the remaining green water. From there, I made rice crispy treats as usual.",
  "Once they were hardened and ready to serve, I had about a 12 X 8 pan of rice crispy treats laced with THC. I had attempted making 'magical' rice cripsy treats before and while they got me high, it was not very intense. So without taking into consideration how much more pot I used this time, I assumed the results would be similar. My previous attempt used no more than a 1/4 of the weed I used this time AND I only ate 3 average-sized treats. Very stupidly, I ate about half the batch immediately.",
  "I went upstairs and chatted to friends on AIM while waiting for it to take effect. I would guess that about anywhere between 30 minutes and hour had passed and I decided I needed to eat more. I then ate the rest except for about 2 normal-sized treats which remained.",
  "Out of nowhere, I started to feel high. I was giggly and giddy and definitely stoned... really stoned. 'This is awesome,' I thought. 'I didn't have to smoke anything and I'm fucking high as a kite.' Feeling quite baked and sluggish, I decided I'd enjoy my high as I drift off to sleep. Afterall, I had to be up early the next morning. Again, bad planning on my part. If you are going to consume THC orally, make sure your schedule is clear.",
  "As I laid in my bed, I realized this high was very different. I expected it because I knew it would last much longer than merely smoking. What I didn't expect was to keep getting higher. I had erroneously thought that I peaked hours ago but now I could barely think, literally. I felt completely knocked out, like I had been hit with a tranquilizer. I couldn't move. I wanted to reach over to get a sip of water but just couldn't. Even when I tried to sit up, I could get half way there and I'd plop back down on my pillow. Realizing this kind of made me laugh inside for a second. I was fucking retarded, but everything was still fine.",
  "I continued to lay there for a while, any concept of time at this point was absolutely unthinkable, and I got higher and higher. I do remember the numbers on my clock being very blurry and each time I checked it, the minutes felt like hours. It was becoming umcomfortable. I was TOO high. I could not fall asleep as much as I wanted to. I laid there twitching, unable to sleep. I knew I needed sleep if I was going to be up tomorrow morning. That started to worry me. Then, in my backyard, I could see through my window my neighbors lights flashing. This just scared the shit out of me. The paranoia I felt was snowballing and seeing these lights flickering had me wondering if it was a cry for help. What if something terrible was happening and I was just ignoring it? I was bugging out. I did NOT want to be high anymore. I was getting higher every second and I was getting scared. My thoughts weren't making much sense to me anymore. Something felt very wrong.",
  "I got out of bed and went downstairs for a change of scenery, hoping it would help me shake these thoughts I was having. When I got down there, I just walked around for a few minutes, stumbling and completely confused. I was walking funny which weed NEVER made me do and the thoughts in my head were in this cycle of confusion and concern. Weed, no matter how much I had smoked, NEVER caused me to feel anything like this. I got VERY scared. I thought I was dying. I thought that there was something in those plants that was deadly. Something was poisoning me, I was dying, or so I thought. I needed help, ASAP.",
  "I mustered up the energy to get the phone book and the portable phone. I needed to call someone who could tell me that I was going to be ok. I couldn't wake up my dad. There had to be some sort of professional who could help me. I searched through the phonebook trying to find the poison control center, or the hospital. My brain was fried, I could not even remember the alphabet. I was so frustrated, not being able to find a simple word in the phone book that I knew I SHOULD be able to find. I was so fatigued. I used so much energy trying to find those numbers and I couldn't. I was frustrated and wanted to give up, but the only number that resonated in my head was '911.' I mumbled it to myself over and over so I wouldn't forget it, the only thing my brain could grasp. I felt like I was running out of time (because I was dying, remember), so I just dialed it. A man from the local police department answered. I was scared about dying but I was also scared about getting busted, so I tried to ask him if my phone call would be confidental. That is not how it came out of my mouth at all. I was incoherent and the man at the other ended sounded nervous. That REALLY scared me. I told him I had the wrong number and hung up. I knew I felt weird and I scared that man, I was terrified.",
  "After much deliberation, I went and woke up my dad. I told him that I hadn't slept and I told him what I did (I think). I told him how wierd I felt and how something wasn't right. He was looking at me strangely. He called my mother and I heard him on the phone say that he understood me but I was acting weird. I don't even think my high had started to peak until this point.",
  "I felt like I was losing feelings in my hands, so I waved them frantically because for some inexplicable reason, it made me feel better. On and off, this continued for the rest of my 'trip.' I would lose feeling/sight of my hands so I would wave them or hit them together. I convinced my dad to take me to the hospital.",
  "The people in ER were looking at me like I was insane. I felt insane. I was shaking and ranting, not thinking before I spoke. I laid there in the bed and sometimes I would spaz-out for no reason and grab onto the railings for dear life. I was mumbling all sorts of things about how I felt. I became convinced I was crazy. I thought this was permanent. I would never be normal again. I had a grim moment where I had accepted to myself that my life, as I knew it, was over. There was nothing I could do and I had to accept that I was insane. I had to accept that I would be living in a mental institution for the rest of my life without a grip on reality.",
  "I don't know if it was paranoia or real, but it seemed like people were walking past my curtain to hear my talking to myself. I felt like they were in groups pretending to talk about work, but they were looking at me out of the corner of their eyes, talking about me. I even exclaimed things, like 'Go ahead and stare, I don't care!'",
  "The doctor hooked me up to an IV, which ironically, was supposed to be a sedative. My heart was racing and they wanted me to stay there until it went back down to normal. They were trying to flush the THC out of my bloodstream. When I got home, which was about noon, I slept until the next morning. When I woke up, I felt stoned. The normal kind of stoned that I was used to.",
  "This experience was, above all, embarassing. I really underestimated the power of marijuana. This experience was also a wake up call that everything needs moderation. Even harmless, soft drugs like marijuana should be taken seriously.",
  "If you are planning on eating some weed-laced goodies, please, 1: Be patient for the effects, 2: Start at a low 'test dose,' 3: Be sure you have nothing to worry about so you can thoroughly enjoy what happens, 4: Try not to do it alone, 5: Know what you are taking so if you start to feel weird, remember that you are in the real world and you're only high; it'll pass. When eaten, the high will last much longer and be much more intense than the exact same amount smoked, but it will take longer to come on. I hope you all find this story informative and helpful. Or at the very least, entertaining."
 ],
 "erowid": {
  "id": "29873",
  "citation": " Stupid Girl. \"Temporary Insanity: experience with Marijuana (ID 29873)\". Erowid.org. Mar 18, 2004. erowid.org/exp/29873",
  "substance": "Marijuana",
  "views": "17883"
 }
}
