{
 "title": "Codeine Bliss",
 "author": "Anonymous",
 "citation": " Anonymous. \"Codeine Bliss: experience with Codeine & Caffeine (ID 4694)\". Erowid.org. Dec 31, 2001. erowid.org/exp/4694",
 "substance": "Codeine & Caffeine",
 "bodyweight": "170 lb",
 "report": [
  "<p>It was a Friday evening and I was just coming down from a marijuana high, and since I had a considerable number of codeine-containing pills in my possession, decided to take a large recreational dose.  Having used codeine recreationally about 7 or 8 times before, I am fairly well-practiced with the extraction technique in the FAQ, and I measured out enough pills for 320 mg of codeine. The pills I have are low-priced generic Canadian AC&C pills from a local drugstore, and have the standard 8mg codeine, 15 mg caffeine, and 375 mg ASA (aspirin).  Normally I would flavour the concoction with sugar and kool-aid, but as my parents were in the kitchen, I had to choke it down with only a glass of orange juice as a chaser.  Very disgusting solution, but I downed it all in less than a minute.  I knew it would take about half an hour until I felt anything, so I played a computer game for a few minutes waiting for it to kick in.",
  "Then in about 45 minutes I turned off the lights, put on my headphones, put in a Strung Out CD, lied down in bed, and just relaxed.  Soon I could feel the familiar tingling sensation all over my body as the one hour mark approached.  It is such an incredible feeling, like your body has gone to sleep, but your mind is still awake.  You are overwhelmed by a feeling of warmth, relaxation, and total contentment.  As I had eaten about two hours before downing the solution, I figured it would take about an hour and a half to peak.  My timing was almost perfect, and by the time ninety minutes had passed, I was feeling a very strong euphoria.  I could barely feel the rest of my body, and with my eyes closed I was lulled into a dreamy state by the powerful music. ",
  "I have never experienced the nausea or vomiting that usually accompanies codeine use, but the itching side effect can be a little annoying.  Since the technique outlined in the FAQ is unable to rid the solution of the caffeine that comes in these pills, I had ingested a fair bit as well.  I have never used codeine without the accompanying caffeine (Canadian law dictates that all OTC codeine products have 15 mg of caffeine per pill) and I figure the same amount of codeine without the caffeine would make you even more drowsy and euphoric.  My fingers get a little jittery throughout the whole experience, but I never experience any other negative effects from the large amounts of caffeine.  One more thing is that the drug makes my pupils very, very small, so hiding my intoxication can be a little tricky.  After about two and a half hours, I began to come down gradually, but I experienced no tiredness, sickness or depression. ",
  "Rather, at that point the caffeine had me even more awake and alert than before.  320 mg is my usual dose, and is also the highest dose I have ever taken.  I might try 400 mg sometime in the future, but I am quite content to remain where I'm at for the time being.  Keep in mind that codeine can become addictive and you can easily develop a tolerance, so always keep your usage and dosage in check.  Other than that, Enjoy!</p>"
 ],
 "year": "2001",
 "id": "4694",
 "gender": "Male",
 "views": "48214",
 "dose": [
  {
   "time": "0",
   "amount": "320 mg",
   "administration": "oral",
   "substance": "Codeine"
  },
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Caffeine"
  }
 ],
 "submissionDate": "2001-12-31T08:00:00.000Z"
}
