{
 "id": 4697,
 "title": "Became Very Moody",
 "date": {
  "submission": "2004-02-10T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Deathisg0d",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "insufflated",
   "substance": "Pharms - Gabapentin",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "900 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Starting out with the idea that snorting these Neurotin pills would be the best way to get the 'goods' into my system was probably the wrong thing to do.  The Neurotin pills are a pain in the backside to crush up entirely, so we know what this means, horrible drip.  However, without realizing this at first, i snorted one 600mg pill, then after about fifteen minutes of good swearing and the inner burning of my nostrils i decided to just chew and swallow the remaining 1.5 pills.",
  "After the snort, call it placebo or not, about ten to fifteen minutes had passed and I had a slight buzz.  Mostly visual with the fact of my eyesight opening to all surrounding objects, but focusing mainly on those directly in front of me.  Soon after say 1/2 an hour after completely consuming the product, while standing still I notice that I seemed to weigh 500 lbs, yet when I walked or moved around I felt light like pillows were tied to all of my limbs.",
  "It seemed to me that after the consumtion of these pills I became very moody, reacting to whatever anyone said to me.  If someone said something remotely nice or pleasing to me, they were my best friend in the world, and if they said even something slightly offending, even such as 'you have some fuzz in your hair' they became satan himself and I could never have thought how someone could say something so horribly mean and revoke our friendship in an instant.",
  "I got bags under my eyes, and sensed some drowsiness followed by falling asleep about 5 hours later, after the drug was really just starting to wear off.  I woke up with no hang-over, or anything to the effect of being out of the normal waking from a nap.  I would recommend this for something light to do.  It wasn't difficult at all to play sober while on either, except for the slight stumble now and again."
 ],
 "erowid": {
  "id": "29881",
  "citation": " Deathisg0d. \"Became Very Moody: experience with Gabapentin (Neurontin) (ID 29881)\". Erowid.org. Feb 10, 2004. erowid.org/exp/29881",
  "substance": "Gabapentin (Neurontin)",
  "views": "39393"
 }
}
