{
 "title": "Experimenting with 'The Thuje'",
 "author": "Brad",
 "citation": " Brad. \"Experimenting with 'The Thuje': experience with Wormwood, Alcohol & Cannabis (ID 46980)\". Erowid.org. Nov 4, 2009. erowid.org/exp/46980",
 "substance": "Wormwood, Alcohol & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  " repeated",
  "smoked",
  "Wormwood",
  "(tar / resin)",
  "",
  " repeated",
  "oral",
  "Alcohol",
  "(liquid)",
  "",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Absinthe has a colorful history, which led to my curiosity about wormwood.  I purchased some powdered wormwood and some wormwood 10X resin (which I confirmed was extracted with alcohol, strained and evaporated, hence, it's basically the same thing as 'The Thuje') from a reputable dealer of entheogenic herbs. </p><p>My first couple of experiences involved smoking thuje before making trips to the bar.  I can't recall exact dosages, but it's safe to say that 4-8 good hits induce subtle changes in perception of color, depth and distance.  After 3 or 4 beers, a strange and happy buzz is felt.  I might have to go outdoors to really become aware of the nature of it.  I may just find it hilarious that the sky is soooo blue :).</p><p>My most recent experience involved a little cannabis in the mix.  After smoking enough to get the desired level of effect, as well as having three beers, I had one hit of some fairly dank cannabis before going to a party.  I felt great and had a good time socializing with everyone.  I'd say I drank 2-3 more beers at the party.  It was after the party that I made a mistake.  I took two more monster hits of the cannabis-and got waaay too messed up.  I've smoked my share of weed, and I've had some of the best in the world.  Rest assured that I've never had an experience like this on weed alone.</p><p>My entire field of vision became incredibly sharp.  Objects in the far corners of my peripheral vision were every bit as sharp and focused as objects right in front of me.  My depth perception was utterly fubar, as the world sometimes looked as if it were a one-dimensional picture.  I felt my body dissolving into the universe as well as into my girlfriend next to me.  Walking was difficult but not impossible.  It was almost impossible to concentrate on anything.  Closed eye visuals were present.  This, ladies and gentlemen, was a bona fide trip...  which I was not ready for. </p><p>I am sure it could have been a nice experience, in the right setting (I think a dark room with some nice music and a warm friend to snuggle with would be about right).  As it was, it was fairly miserable due to the fact it surprised me and the setting was shit. </p><p>It's two days after my trip, and my brain still doesn't feel quite right.  Yes, boys and girls, thujone is exceptionally persistent.  That said, I don't feel any less functional than before, my brain simply feels funny.</p>",
 "year": "2005",
 "id": "46980",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-11-04T08:00:00.000Z",
 "views": "4560",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Wormwood",
   "form": "(tar / resin)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
