{
 "id": 4698,
 "title": "A Welcome Madness",
 "date": {
  "submission": "2007-11-10T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Devilpoet",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Previous drug experience: pot fairly often, shrooms, dxm, hawaiian woodrose seeds, salvia, and alcohol. A few days ago, I decided to finally take some Dramamine that I had gotten solely for the purpose of tripping some time ago. I had been planning on tripping that night and when a native american friend of mine told me it was a full moon, the night they traditionally do their peyote rituals, that gave me even more of a reason to trip.",
  "Right before my trip I talked to my girlfriend on the phone, it wasn't a very pleasant conversation, we were both very stressed. I wrote her a poem before the trip really started kicking in. The first thing that happened was I got a kind of head trip, different from the feeling I get on shrooms, and I also started seeing patterns on my door start to move like on shrooms, except they were pulsating and moving more rigidly than with shrooms.",
  "Then I started to get small hallucinations at the edge of my field of vision, such as black specks or flashes of light. after quite a while, I saw the most beautiful thing, a small crystal tree growing from my hand and somehow illuminated. I was in the dark, so that may have been part of it. Every now and then I would hear conversations between people I didn't know and sometimes they were about me. I had to use the bathroom many times during my trip because I had had a cup of coffee before my trip and several glasses of water during it. When I was leaving the bathroom one of those times I saw a friend who doesn't live very close to me. He said something and I responded and then he just disappeared. Only then did I realize he was only a hallucination.",
  "For a while I sat on the couch in my living room with 2 of my roommates (who were real). One of them was playing a video game and I was talking to them, but I must not have been making much sense because they would just give me these really weird looks. About 3 hours after I initially started tripping, I wanted to play some video games, but I was afraid I would wake up my roommate that was living in the living room. It turns out that she wasn't even home that night, she was at her boyfriend's. But I could almost swear I saw her boyfriend sleeping in the hall as I got ready for bed.",
  "The next day I awoke 10 minutes after my school bus had left, and when I went to put my contacts in, I noticed that the left one was ripped. I had no 'hangover' or anything like that, but I did have to go through the whole day with no contacts.",
  "My experience on dramamine wasn't a negative one, but many people do experience negative effects. I probably won't touch dram again for a while, but only because I like to be able to tell fantasy from reality."
 ],
 "erowid": {
  "id": "29884",
  "citation": " Devilpoet. \"A Welcome Madness: experience with Dimenhydrinate (ID 29884)\". Erowid.org. Nov 10, 2007. erowid.org/exp/29884",
  "substance": "Dimenhydrinate",
  "views": "5372"
 }
}
