{
 "id": 47,
 "title": "Interesting in the Beginning",
 "date": {
  "submission": "2013-09-21T07:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Daniel S. Renegade",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "pill / tablet"
  },
  {
   "time": "0:50",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "Just acquired a prescription for generic Ambien (Zolpidem) and figured I'd give its recreational value a test after reading a couple reports.",
  "11:50 - Ingest 15mg",
  "12:07 - Things might be feeling a little slowed down.  Noticing burps, which usually for me means the pill is being absorbed.",
  "12:09 - Noticing more frequent yawns, and a little jittery all over my body.",
  "12:18 - At this point, my desk starts spinning around like the tea cups ride at Disney Land",
  "12:20 - Getting the feeling like people are around.  Starting to feel like I do on a Xanax",
  "12:22 - Very shaky and confusing.  So far, it's just like a xanax stupor.",
  "12:35 - Now I am suprisingly close to baseline in my opinion.  Going to eat other 5mg half soon.",
  "12:40 - swallowed other 5mg, making it a total of 20.  I feel like I should definitely feel a bit more than what I am.  In the beginning it was promising, but then mellowed out drastically.  If things don't get more interesting, i'll spark this spliff.",
  "1:08 - Get up walk outside and spark spliff",
  "1:20 - Give up on it and go to bed.  Actually have a bit of trouble falling asleep.",
  "All in all, it didn't really do much for me personally.  But through research, i've found Ambien can affect everyone differently, so someone else might have a vastly different experience."
 ],
 "erowid": {
  "id": "100343",
  "citation": " Daniel S. Renegade. \"Interesting in the Beginning: experience with Zolpidem (Ambien) (ID 100343)\". Erowid.org. Sep 21, 2013. erowid.org/exp/100343",
  "substance": "Zolpidem (Ambien)",
  "views": "753"
 }
}
