{
 "id": 4700,
 "title": "Scared Out of My Mind",
 "date": {
  "submission": "2004-01-15T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Joe",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "108 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:30",
   "amount": "54 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I have been reading up on ADD medicine and how taking lots of it could be like speed. I got a free bottle of some 30 pills of 54mg Concerta from a friend and read up on it. I thought it wouldnt hurt to try it. I took one dose and felt great, never before have I felt happier or talkative. I also seemed to concentrate more.",
  "Later that day when I got home from school I was reading up on some expiriences. Most were positive, so I decided to crush and insuffilate 2 pills at around 10Pm. It felt great, like coke. I was having fun blasting music. Its hard to describe what I felt, an overwhelming sence of pleasure and I could concentrate on anything. At around 10:30PM I decided to chew one more 54mg pill.",
  "Bad mistake, at 12:30 I felt sick to the stomach and I could not stop shaking. I decided to lay down for a while. Suddenly I began to hallucinate. It was scary what I saw and I never want to go through it again.",
  "Now its 5:30 Am I had a fear if I fall asleep I would die. And I kept shaking the entire night hallucinating. Now the hallucinations have stopped but I am still shaking and my blood pressure is high. Im not sure when I will sleep. I have work in four hours. Never again am I touching that."
 ],
 "erowid": {
  "id": "29892",
  "citation": " Joe. \"Scared Out of My Mind: experience with Pharms - Methylphenidate (Concerta) (ID 29892)\". Erowid.org. Jan 15, 2004. erowid.org/exp/29892",
  "substance": "Pharms - Methylphenidate (Concerta)",
  "views": "77918"
 }
}
