{
 "title": "Three Minds",
 "author": "Xiansi Xaz",
 "citation": " Xiansi Xaz. \"Three Minds: experience with Mushrooms & Mescaline (ID 47019)\". Erowid.org. Jan 8, 2007. erowid.org/exp/47019",
 "substance": "Mushrooms & Mescaline",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1.5 caps",
   "oral",
   "Mushrooms - P. cyanescens",
   "(plant material)",
   "",
   "350 mg",
   "oral",
   "Mescaline",
   "(tea)"
  ]
 ],
 "report": "<p>In July 2005, three friends and I took a road trip to Canada. After taking three days in the states, we arrived at our destination, Vancouver B.C. We asked around town on where to pick up some marijuana and was directed to Hastings St. We walked down the street stopping in every head shop we came across. One shop we went into was selling various drugs we did not know one was able to purchase in Canada, including such things as Coca leaves, amanita muscaria, DMT, peyote, etc. One of the friends I was with bought some coca leaves, and his brother bought 700mg. of (peyote) mescaline alkaloids.</p><p>We went on our merry way enjoying the city and somebody's coca leaves, and eventually picked up a half an ounce of marijuana from the bouncer at the pub around the corner from the New Amsterdam. We left Vancouver that night and headed north becoming stranded in Whistler as our wheel from the truck we were in came off and dissapeared down the mountain freeway. After camping for four nights, the truck was repaired and two of us went into town to get the truck and wine/beer while the other two stayed to watch camp.</p><p>When the two arrived back, instead of buying wine/beer, they had picked up a bag of psilocybin cyanescens from some of the local residents. So we packed up our stuff,(regretably as we were camped on the most beautiful lake I have seen to date), and went to town. I bought two bottles of wine, a six pack, and two 40oz. We went to find another camping spot this time, which happened to be a dead-end dirt road just off of the highway, but still out of site to passing cars. We got out, set up camp, and began sampling the flavours of Canada's lovely wines and extravagent beers. This was now around 6pm on July 28th.</p><p>So we divied up the shrooms among three of us, the other opting out as he was to experience mescaline for the first time, having previously done shrooms several times. As for myself, the only psychedelic I had ever experienced was salvia divinorum. I ate the mushrooms, and having drank aprox. 12oz of beer decided to quit drinking. In about 15-20 minutes after ingesting the mushrooms, the first effects began to set in. I was aware of hightened sounds and colors with a feeling of euphoria and uncontrollable laughter coming at random times.</p><p>The feeling was similar to having smoked marijuana the first few times. The one of us who had mescaline had prepared it in a tea, and invited all of the group to 'taste this,' in which none of us turned down. By the time the second wave from the mushrooms was cresting, I was beginning to see rather strange apparitions floating about, random colors coming in and out of the ground and trees, and hearing people talk to me that weren't really talking to me. Mr. Mescaline then handed me the bottom of his tea and said, 'drink this' I asked, 'all of it' and he nodded in approval.</p><p>I was rather talkative, though I don't recall what I was talking about, and he changed his mind and said, 'give me that.' I stubbornly said, 'NO!' and not thinking, downed the remaining alkaloids in the bottom. 'There was a bunch of crap in your cup,' I said. He told me, 'yeah asshole, you just ate all the alkaloids.' This is when I realized what I had done. I ingested aprox. 350+mg of mescaline. My mood changed from exstatic euphoria, to anxiety and panic.</p><p>At this point, two of the group went down a trail to look for a river we knew was not too far from camp. Mr. Mescaline and I stayed behind to wait and see what the others found. He sat there unhappy about his decision of letting me have his tea, and I looked at paintings and drawings we all had contributed at various points on the road-trip. I drew a pencil drawing and sat around feeling somewhat relaxed, although there was a nagging feeling of, 'what now? nausea? puking?' I was now on my third peak, of which I didn't come down from for about 4 hours.</p><p>The mescaline had kicked in and I was feeling the effects. I was able to tell mood just by looking at Mr. Mescaline, and as I talked to him I could see that he was angry with himself but his mood would contantly change as he would focus on different things that he was doing. When I looked up, the clouds were changing color from the sunset, but I only saw what appeared to be colored foil rappidly morphing into each other. I could hear the sky talking to me, asking me questions but still not quite distinguishable in my mind.</p><p>The two of us left in camp decided to go to the river as the others had not yet returned. I watched Mr. M go down the trail and turned to put something away. I walked to where the trail forked and suddenly realized that I was lost. I looked to my right and I could see camp about 100 yards away, but I didn't know where I was. Fortunatly one of the original two who had gone to the river came walking up the trail and I told him, 'good thing you came along, I'm lost, and I haven't even left camp.' He chuckled and lead me down the trail and through a forest that if he wasn't in front of me, I would have no idea what I was doing or where I was going. We got to the river and listened to it for some time.</p><p>I could watch the waves and swirls of the water and again something was talking to me, this time it was the river. I still could not distinguish what it was saying as the roar of the water was to loud to hear what the river was saying. I enjoyed watching the colors of water change from green to blue into undecribable other colors. We all decided to head back to camp as it was now getting dark, and we didn't want to get lost in the forest.</p><p>Now back on the trail I began exclaiming, 'OH MY GAHD!! WE'RE IN CANADA, ON SHROOMS, ON PEYOTE!!' over and over again at the top of my lungs. By this time, anything that came out of my mouth was not necessarily what I was thinking, as my mind had separated into three different minds. One was my own, which pretty much sat in the back and observed, one was spiritual and was taking in all the sacredness of what was around, and the other was the obnoxious inexperienced foulmouth who now had control over everything I was saying.</p><p>When we were back in camp, I lay down and looked at the sky. By this time the stars were out and I could see them breathing and forming 3-dimentional shapes which would come down from the sky almost slamming into my face. I had a feeling of serenity in my spiritual mind, confusion in my real mind, and anxiety and fear in my third mind. I don't recall what my third mind was saying, but the others in the group say that I was talking of 'memories, what are these? past thoughts which we dwell upon? why?' and repeatedly shouting 'I need to take a fucking shit. It's pissing me off!' I layed down in my sleeping bag to try and settle some nerves that were becoming frayed.</p><p>At this point, with all the Canadian biting flys and other insects accumulating on my face, I experienced death and went through several stages such as decomposition, becoming earth, growth into new plants, and spiritual reincarnation in the depths of outer-space as almost a gasseous thought floating around and observing all the cycles of everything in, on or about earth. I at once understood everything. In the middle of the night I realized that I was myself again, and bluntly stated, 'I'm done.' to the other members of the group. They welcomed me back and I appologized for anything I may have said or done.</p><p>We ate, set up our tent, and went to sleep but not dreaming. I told everyone that I was glad I was already crazy before using the drugs, because anybody else who experienced what I had just gone through would definately need mental-hospitalization. I highly recommend the experience, but be cautioned and be mentally prepared, our choice of camp just off the highway was a bad choice. At least I came out of the trip a new enlightened person.</p>",
 "year": "2005",
 "id": "47019",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-08T08:00:00.000Z",
 "views": "27131",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.5 caps",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(plant material)"
  }
 ]
}
