{
 "id": 4703,
 "title": "Like a Bubble Splitting In Two",
 "date": {
  "submission": "2001-12-16T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Geek",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "liquid"
  }
 ],
 "report": [
  "First experimentation:",
  "I sat on my porch and lit 1 bowl of pure Salvia leaves.",
  "The first hit was very potent, instantaneously I felt gravity pulling",
  "me towards the ground. I could feel the magnetic floor trying to",
  "devour me, though I struggled to free away from the calling of the floor.",
  "With all the stress (earth pulling me, and I pulling away from it) my body",
  "was ripped into two. Like a bubble splitting into two. I started to",
  "giggle, but held the laughter because people were sleeping (this was around",
  "11:30PM). I started to run around our car. It was fun because I was running counter-clockwise, and my other self clockwise. The next thing I did was run into my room. Though I knew I was running straight into the open door, but I suddenly ran into the wall. It seemed that one of me was running through the door, but I was actually the other me who ran into the wall next to the door. I didn't really care about the pain since I was having too much fun. I sat down in front of my computer and started to yack about what was happening to me to my local friends who were in a private AIM chat (they were going to experiment with me as well later at 12AM).",
  "This was cool because I was seeing my hands typing gibberish, but I was actually on the other end of the room. This was the time when the Salvia was starting to wear off (T+3minutes). I felt my other self start to reunite with me, after a few seconds I was back to my normal self, safe in one piece. Heeheehee.",
  "Second experimentation (later that night/morning):",
  "I met my friends in a park located next to a large patch of big trees. I let my friends take their hits and watched them enjoy the magical herb. When it was my turn I distanced myself away from them and started the spiritual voyage. I took a large hit of 5X extract (around 150mg), I was",
  "amazed that nothing had happened to me. So I took another big hit and held",
  "it for a long period of time (20seconds or so). When I blew away the smoke",
  "I started to trip out. I looked around me and saw my whole surroundings",
  "starting to dance. Then I felt like I was part of the trees around me, they",
  "were being absorbed by my skin visually and spiritually. I started to laugh, but I held the laughter. I stood up and started to walk around me.",
  "Something very far away was calling me. I started to walk towards it. Suddenly everything started to twist around, and a friend of mine was walking towards me. He was in the middle of all these twists. This lasted for a minute or so. I returned to my other friends and started to tell them my story. It was fun.",
  "Thoughts:",
  "I love Salvia, but I wish the trip was a bit longer. I probably didn't enjoy it that much since my shroom trip was even better. Like, Salvia * 1,000 = magic shrooms. I'll try alone next time with one sitter. This time it will be 10x extract in my room. I will use a jet-lighter so I can vaporize the active ingredients, and inhale them through a water bong (we used a small, metal hand pipe this time). I'll be playing soothing music and try to meditate."
 ],
 "erowid": {
  "id": "2991",
  "citation": " Geek. \"Like a Bubble Splitting In Two: experience with Salvia divinorum (ID 2991)\". Erowid.org. Dec 16, 2001. erowid.org/exp/2991",
  "substance": "Salvia divinorum",
  "views": "5552"
 }
}
