{
 "title": "Nothing Left to Give",
 "author": "ZeN",
 "citation": " ZeN. \"Nothing Left to Give: experience with Ecstasy (ID 4703)\". Erowid.org. Jan 19, 2001. erowid.org/exp/4703",
 "substance": "Ecstasy",
 "bodyweight": "132 lb",
 "report": "<p>This one goes out to freeflyer, i have a similiar story to tell. So there i was, the last week of 2000 with 5 HQ's (damn good pills) aquired from hard earned christmas money. I was supposed to sell them to turn a profit but my weaknesses showed and i just could not help myself. I had just come off a horrible flu that floored me for 4 days and was ready to go back out into the world and have some fun. I had lost a substantial amount of weight when i was sick, about four pounds and was still rather weak physically but i paid no mind.</p><p>So, back to the main part of my story, i have more pills than i have ever had at one time. I give one to a friend and we roll our butts off, usually that would be the last time i would taste E for a few weeks, but no, i had 3 more dammit! The next night i didnt do anything with the pills but admire them. The next day, i was in a adventurous mood so i thought about snorting up part of one and did so. DAMN, snorting was different, burning in the nose, yucky post nasal drip but more potent as a method of ingestion by far. So i go out with my friends and we do the usual nothing. I come home for a little while and snort the rest and the effects hit again. I must note that snorting seems to have a shorter duration for me and seems to bring out the speediness a little more.</p><p>The next two nights i did the same; overall putting 3 pills in my nose in three days, 4 in one week. By the last night, i was already pretty burned up, i was down to 130 pounds because i hadnt been eating, losing a total of 10 pounds in just short of 2 weeks, and was walkin around in such a manner that my friends called me 'dead man walking' because i was on a perma-hangover from the E. So that last night, i had 3/4 of one pill left and put it all up in one sitting, expecting a roll i was used to from HQ's but recieved quite the opposite.</p><p>All i got was a speedy feeling, i realized that there must have been almost NO serotonin left to use, i had simply run out and my brain had nothing left to give. This scared me because i had always read about the possibility of this happening but never really thought it would happen to me. Goes to show you how stupid a person can be.</p><p>The next 2 days were just like the previous, dead man walking mode, but the 3rd day, something awful happened, a crash that was unbearable. I have had 'terrible tuesdays' before, but not ones where they last an entire week and a half more! Depression was all i knew for those long, long days. I couldnt eat or sleep properly, i was always in a bad mood, not the usual blank mood i get from a hangover, and found myself crying about something every single day! I was in such a bad mood that when an argument arose over getting a free sandwich from my friends work, i thought about literally killing him. I knew what it was, my brain was fried and it would take awhile to normalize. This brought me to the conclusion that i need to abstain from all drugs for awhile, and wait at least a month before i drop again, but that is even tenative. I was droppin for the wrong reasons, just to have a lil more fun in an altered reality. E shouldnt be done just to do it, you should do it when it will be useful, like parties and little get togethers. It isnt like Bud where you can use it all the damn time, this stuff will harm you in very very bad ways.</p><p>So here i am now, jan 15th, weight is still down to 132 lbs, mind is coming back to almost normal but with new wisdom, too much E in too short a period has long term detremental effects on my body and social life. Happiness in a pill isnt a reality for me anymore, its a loathed statement.</p>",
 "year": "2000",
 "id": "4703",
 "gender": "Male",
 "timestamp": "2001-01-19T08:00:00.000Z",
 "views": "9031",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 46:00",
   "amount": "0.5 tablets",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 49:00",
   "amount": "0.5 tablets",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 72:00",
   "amount": "1 tablet",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 96:00",
   "amount": "1 tablet",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
