{
 "title": "Fireworks",
 "author": "Uni-bonger",
 "citation": " Uni-bonger. \"Fireworks: experience with Datura (ID 47122)\". Erowid.org. Mar 13, 2010. erowid.org/exp/47122",
 "substance": "Datura",
 "bodyweight": "220 lb",
 "header": [
  "DOSE:",
  "5 cups",
  "oral",
  "Datura",
  "(tea)"
 ],
 "report": "<p>This night took place on October 15, fall 2005.  During one of our board nights at a friends house we decided we wanted to trip really bad. We couldn't find any shrooms at the time so we collected some datura seed pods.  First we opened quite a few seed pods and filled the bottom of an average size sauce pan of Datura seeds.  We brought it to a strong boil, than let it simmer on medium heat with a sauce pan top cover for 1 hour.  We had 2 batches going at once.</p><p>Next we consumed it.  I used a small coffee mug to drink it, and I filled the mug about 5 times, maybe 5 and a half.  It only took about 30mins for me to start feeling a slight trip.  I noticed that if I looked at my hands I could see what looked like tiny white molecules running up and down it, at this point I knew it was only a matter of time.  After about 3 hours my speech was slurred and walking was very difficult because I felt like my body was weighed down.  The following is the minor details I remember the rest of the night, although they may not be in correct order.</p><p>I don't know how I got outside to my truck or why I did, but the next thing I knew I was sitting in the drivers seat in front of my friends house defrosting my windshield.  Things happened almost like a dream that I didn't realize was a dream.  It all seemed like perfect reality to me.  Another memory I have is going down a streat leaving town when I suddenly realized this isn't where I want to be so I turned around. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]   Now as far as I can remember there was no one else in my truck with me, but suddenly my brother was in the passenger seat (he lives 3 hours away).  It seemed completely normal to me though and we started talking (I don't remember where I drove or where I was going). </p><p>I do have a horrible memory of what happened next though.  I clearly remember looking over at my brother (who was either all in my head or it was someone else riding with me).  He had the scariest look in his eyes looking straight out ahead of him, then suddenly he slumped over and closed his eyes.  I began shaking him violently telling him to wake up and not to die on me.  I'm not sure if I parked for this or not.</p><p>Next thing I know I'm at a corner of 2 streets stepping out of the car to see where I was so I could find a hospital.  But when I stepped back in my car the passenger seat was empty.  I may have imagined it all or I scared one of my friends so bad he ran off. </p><p>Next memory I have is being in a parking lot of an abandoned grociery store.  All of a sudden the night skie was filled with fireworks and for some reason even though it was 3am my mind registered it as a football game on campus (even though I was no where near campus).  These fireworks were insane with flashing outter edges to the circle and sparks chasing each other around in the middle.  Then I looked behind me to see if anyone else was around.  There was a girl I've never seen before sitting in my back cab.  You have no idea how bad this scared me, I turned my head back to the fireworks and tried to forget about it.  After about 5mins I turned around and the girl was gone.  I then remember the fireworks drifting down to the ground as they burned out.  They would skid the streets and sidewalks slowly fading away. </p><p>I no longer have a memory of what happened next, I woke up the next morning in my bed with a slight headache.</p>",
 "year": "2005",
 "id": "47122",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-03-13T08:00:00.000Z",
 "views": "3987",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5 cups",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 }
}
