{
 "title": "Flowers, Renoir, Pink Floyd and Trance",
 "author": "UV",
 "citation": " UV. \"Flowers, Renoir, Pink Floyd and Trance: experience with LSD (ID 47141)\". Erowid.org. Jan 17, 2008. erowid.org/exp/47141",
 "substance": "LSD",
 "bodyweight": "78 kg",
 "report": "<p>It was my 13th trip, and the most beautiful. I was in a kibbutz in the north of Israel with friends. After a really sad dream about my ex-girlfriend I woke up at 7 in the morning and waited for the others to join me. We dropped the acid at 8:40, very fine stuff that gave me 11 hours of visuals a week earlier.</p><p>We walked to a spring nearby as the acid was starting to kick in, but when we arrived we found it disappointing visually. I was seeing visuals already, unrealistic looking vegetation, and looking through a friend's red optical sunglasses was really warped and beautiful. Red and orange sunglasses have the quality that they reduce the number of shades you see, so you see borders between colors more clearly. My mind on acid works with that and gives me more patterns, so more stuff looks like magic items out of D&D.</p><p>Feeling responsible for the group (i was the only one familiar with where we were staying), I led the way back into the kibbutz in search of better visuals. My friend's girlfriend was tripping for the first time and I knew the confusion might keep her in one place for the next few hours where instead some beautiful stuff awaited elsewhere.</p><p>A kibbutz is the most comfortable community you can imagine. A road runs around it, but on the inside there's just pathways, everything is green, and grassy areas all over. These people work in agriculture, so they set up their own private gardens REALLY nice. As soon as we crossed the gate back to the kibbutz we were in flowerland. Flowers are amazing to look at on acid, I knew that and was not disappointed with the stroll across the kibbutz. Everything was beautiful. Roses especially are amazing to look at when tripping, all glowing from inside. We just walked around and whenever we took a turn we had to stop and admire the amazing flowers and trees and greenery.</p><p>Not too long after that (mental note: walk around more next time) we got to the house we were staying at. The garden there had a lovely spot shaded with a vine. The summer was over so the vine was green colors with large brown patches on the majestic leaves - it was really awesome.</p><p>Most of that time I was listening to really cool trance music. A few months ago I downloaded all the good trance that was hip in the isratrance.com forums in late 2004 and early 2005, and put it on my MP3 player without listening to it. On my previous trip the week before I sorted through it, and Lish's 'Free Fall' came out the winner. Really beautiful trippy music to blow you away, and not at all too harsh like many Israelis like their trance, on the contrary very progressive and mellow and most important creative.</p><p>It was hot, and we've been walking around, so now it was time to take a shower. The semi-transparent glass walls of the shower were swaying like curtains. The feeling was incredible. All of my good trips included immersion in water, at the height of the trip it's really something out of this world. I even played with the hot and cold water, and was really grooving on that, before I stopped from fear it would fuck with my system too much and I would faint.</p><p>After that a friend showed me how to see hallucinations without any visual stimulus: I looked at the bare ceiling, and after a few seconds what I saw was irregular, broken shapes like hexagons. Holding one point steady all of my visual field would become caleidoscopic. Neat!</p><p>Then I listened to some more quality trance, from the same batch: 'Bonky 2' by Bonky. Bonky was a dutch DJ and she died and there are two albums out. This one from 2003 is really confusing, top notch psychedelic music, very 3 dimensional. I was going through an art book I took from my folks. There is an incredible Renoir painting there, Noirmoutier, of a tree in a field and the sea beyond that. It can give some pretty nice visuals and on my last trip when I found it I was already past the peak. So I checked it out - good thinking! The tree was swaying WITH THE MUSIC! I couldn't get enough of it. The whole painting became extremely 3 dimensional, there is a lot of play with focus in that painting that the mind works with just beautifully. Tripping on Renoir is awesome.</p><p>I took a pen and started scribbling some thoughts. It was the first time I was writing when tripping, and it came out quite nice. I wrote some more stuff over the next few days following that positive experience. Why haven't I tried this earlier? too much nature tripping and in parties, I guess.</p><p>At some point a friend wanted to cut the trance and move to Pink Floyd. I resisted but when he said that he's going to listen to it on headphones in the other room I immediately became suspicious that I was losing something and let him put it on, not before he darkened the room which I felt was a shame, such nice visuals going... aha! I was wrong! listening to Atom Hearth Mother, Pink Floyd's superb psychedelic masterpiece, was an extremely moving experience, very emotional. Those crazy artists, why don't they do more projcets like this? Alan Parsons was the producer for this album by the way. It was one of the most intense musical experience I ever had, somewhat reminiscient of when I was listening to Led Zeppelin's 'Stairway to Heaven' stoned right after I took up pot, only way longer, Atom Heart Mother is a very coherent and tight album with its wonderful ups and downs.</p><p>Then we listened to 'Meddle', also an amazing work.</p><p>All of this took around 6 hours. The rest of the trip was relatively uneventful, some laughing, some music, a little bit of nature - the second half of an LSD trip is always an unsolved issue  to me, how to best put it to use. I guess if I trip in the city I can go friend hopping during that time, or to a museum. In any case the most significant things I remember from the second half is tasting honey, which was absolutely fabulous, and looking at that vine again when the sun came down, under a neon light, which gave a magical silvery tint to the whole scene which was incredible as it is.</p><p>Writing this, a few paragraphs ago, I get a phone call that more acid can be had :-)</p><p>Peace</p><p>uv</p>",
 "year": "2005",
 "id": "47141",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-17T08:00:00.000Z",
 "views": "4926",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
