{
 "title": "Path to Lucidity",
 "author": "Themanwithnoname",
 "citation": " Themanwithnoname. \"Path to Lucidity: experience with Calea zacatechichi & Voacanga africana (ID 47152)\". Erowid.org. May 28, 2006. erowid.org/exp/47152",
 "substance": "Calea zacatechichi & Voacanga africana",
 "bodyweight": "165 lb",
 "report": "<p>Pre Trip:</p><p>Boring raining day, looking forward to hanging with friends but it got postpond. I took 700mg (2 pills) of St. John's Wort (been doing it everyday for a month or 2 Ate a crap load of chinese food -2 hr with coke (caffeine) and was in a good mood for what I hoped to be a trip.</p><p>My intensions was to trip out with these seeds but I got something else instead.</p><p>7:00 Crushed about 60-65 seeds with hammer and swallowd with water (They tasted horrible and almost gaged)</p><p>7:20 O felt somewhat diffrent like something was going to happen.</p><p>8:00 Nothing really happend. Kinda felt diffrent but just had mild stomch disconfort.</p><p>8:10 somewhat disapointed and guessing the huge meal I ate before had to do something. I was bored and pulled out some Calea Zacatechichi and rolled about 1-2 gram joint. This is the first time ever trying to smoke this and wasnt exspecting anything dreamwise to happen. Smoked the tasty joint and felt happy and talked to people online and watched tv.</p><p>10:30: Kinda bummed nothing happend I went to bed exspecting absolutly nothing to happend</p><p>I was WRONG!</p><p>I must of had about 5 amazing Dreams I Remember perfectly. These were not any regualr dreams, these dreams were crazy.</p><p>For the first dream I knew I was in bed sleeping. It was a simple dream about me smoking a cigar but the amazing thing was I felt an incredable cigar buzz. And I knew I was sleeping and laying down but I could feel this great sensation.. I woke up for a minute and said wow.</p><p>I then had another dream about me and this girl walking down the street with her really cool mother ive never seen. But like the prevouse dreams I could feel the happiness and warmth of love while sleeping. I woke up for a minute and then went back to sleep having another dream. The cycle of me dreaming feeling great sensation and then briefly waking up to fall back asleep to dream another dream...</p><p>I woke up for good in the morning and felt amazing. I couldnt belive I had all of those dream experiences and rememberd almost all of them</p><p>IT was nice also becaue the whole summer beforeI couldnt remember any of my dreams</p><p>The next night not taking anything I went to sleep and had a simalar exp but only with one dream.</p><p>I am amazed at my results with these 2 drugs. The night after that I just did the seeds (about 40) and had same exp but only remberd 1 or 2.</p><p>Conclusion:</p><p>I will return to this combo again many times.</p>",
 "year": "2005",
 "id": "47152",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-28T07:00:00.000Z",
 "views": "19349",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "700 mg",
   "administration": "oral",
   "substance": "St. John's Wort",
   "form": "(daily)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Voacanga africana",
   "form": "(ground / crushed)"
  },
  "2": {
   "time": " T+ 1:10",
   "amount": " ",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": "(dried)"
  }
 }
}
