{
 "title": "Plush Doll Love",
 "author": "Megville",
 "citation": " Megville. \"Plush Doll Love: experience with Nutmeg (ID 47176)\". Erowid.org. Mar 29, 2008. erowid.org/exp/47176",
 "substance": "Nutmeg",
 "bodyweight": "230 lb",
 "report": [
  "<p>Reading the reports I was interested in the effects of nutmeg. I found the whole nuts on sale for $2 a box! I brought them home and chopped about five nuts up with a razor blade. I have found since that a spice grinder is the way to go, and you get to keep all of your fingers. These nuts are hard. So I grind five nuts and throw them in a 20oz jug of flavored milk.",
  "After about 3hours, I felt a little something. Not a heavy buzz, just mellow. 4 hours it was more pronounced, and I felt good just kicking back. 5 hours - this is the peak. I remind you that I am not a small guy, so even 'pharmies' take a lot to get me going.",
  "At 5 hours I felt a nice disconnected buzz. Still very functional, but happy. It was not debilitating like pot, but mild and actually more focused. I zoned out watching tv for a while and seeing that I was not going higher, I went to bed.",
  "Now this is the best part. I am in my 30's so I enjoy a good night's sleep, rather than staying up all night. This stuff made the bed feel so good. I cuddled with my partner and she felt like those little plush dolls you get that feel unbeliveably soft. I kept rubbing myself on her and against my blanket. Everything that touched my skin felt great. Needless to say this started something that I can describe as the best sex I have had so far with her, excluding the first time.",
  "The next day was nice. It took the edge off of everything and I started laughing during a job interview when I had a mild distortive hallucination of the interviewer's face.",
  "Summary: nice legal alternative. I had no bad side effects.</p>"
 ],
 "year": "2005",
 "id": "47176",
 "gender": "Male",
 "views": "5357",
 "dose": [
  {
   "time": "0",
   "amount": "5 nuts",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ],
 "submissionDate": "2008-03-29T07:00:00.000Z"
}
