{
 "title": "Drugs and Enlightenment",
 "author": "Benjamin",
 "citation": " Benjamin. \"Drugs and Enlightenment: experience with Methamphetamine & LSD (ID 47186)\". Erowid.org. Jun 17, 2010. erowid.org/exp/47186",
 "substance": "Methamphetamine & LSD",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Methamphetamine",
   "",
   " ",
   "",
   "LSD"
  ]
 ],
 "report": "<p>I found this website by entering the search terms: 'meth will kill your soul'</p><p>I believe that's true, although I wouldn't have told you that when I was still using. No, I would have told you that I could focus, intense focus. I tell you, I got things done. I caught up on all my school work, turned it all in and graduated. I was the only one of my friends to do so. The thing I liked most about doing meth was the introspection. I was accelerated, I didn't have time for petty thoughts, small mindedness, and the daily blah blah. No, I was tackling huge ideas about life and existence. I thought about the concept of god and my being in this huge world. I had a purpose, I just didn't know what it was.</p><p>I also did a lot of acid, the good stuff. Clean LSD is so different because your whole trip isn't focused on the physical sympotoms, just the mental. That was where I thrived. Yes, many night of endless chatter about the metaphysical world and some really strange tangents. I would get so out there that I forgot where I had started from.</p><p>Now, being a fairly intelligent dude and knowing lots of things is one thing, enacting them is another. After all this meth, alcohol, weed, cigarettes, LSD trips and not eating well, I got really sick. I had a lung infection that was so bad that I would constantly cough. (because I smoked my drugs) I would cough so bad that eventually I would vomit from the muscle contractions. I went on like this for a long time. At this time when I was sick I couldn't smoke anything. I hurt to. I had to deal with the reality that I had done this to myself. Still, I wanted to be high.</p><p>During this forced physical rehab, all I wanted was to get high but any little puff on something-- I would vomit. Not cool. One day I was sitting at the park watching these guys play basketball. I sat there on the grass and I was just amazed at how altered I felt. I was high from not being high, I relized this. When all I knew was one reality, getting high on drugs, I forgot what I was getting high from. The clear reality. The clearness helped me to see a lot of things.</p><p>I remembered this quote that I had read in Richard Alpert's 'Be Here Now' book. LSD can take you up to the top of the mountain and let you see the valley, but it cannot take you there. How true.</p><p>My drug addiction was mainly based on a craving for interesting mental trips, long bonding conversations about the unknown (but supposed) and when that had run it's course, it was time to stop. My continuing to get high would be a lie to the truth, myself and god (in whatever way you may or may not perceive god)</p><p>A side note, I remember LSD being all-encompassing mentally, where as meth was so disgustingly linear. like a bad rollercoaster ride. I HATE meth with a passion, it's killing the working class people and their families.</p><p>If you want to stop, remember how you were as a child, remember all of the crappy things you have done to those who care about you, look in the mirror. Peace and good luck. --B</p>",
 "year": "1998",
 "id": "47186",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2010-06-17T07:00:00.000Z",
 "views": "7850",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Methamphetamine",
   "form": ""
  }
 ]
}
