{
 "title": "A Long, Slow, Twisting Journey",
 "author": "ElectricLadyland",
 "citation": " ElectricLadyland. \"A Long, Slow, Twisting Journey: experience with LSD (ID 47191)\". Erowid.org. Jun 8, 2007. erowid.org/exp/47191",
 "substance": "LSD",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "oral",
  "LSD",
  "(blotter / tab)"
 ],
 "report": "<p>I am a 20-year-old college sophomore who started smoking weed just about 6 months ago.  Before coming to college, I had had no experience with any substances, including alcohol.  However, drugs had always interested me, and when I did some research and realized that some very careful experimentation can be useful and relatively harmless, I decided to try herb.  I loved it, and after a few months of that I began to wonder if there was anything else worth trying.  I did a lot of research and decided that basically every drug had some severe risks.  However, acid was appealing because the dangers are almost totally mental and very few substances known to man can actually affect the human body in an amount as small as that which can be absorbed on blotter.  So, after a lot of thinking and reading, I decided I would try it.  Fairly soon after I got to school, I made up my mind for sure and started asking around.</p><p>It took a while for me to find some, and the first stuff I found was fake.  However, a friend of mine brought me back around 2-2.5 hits torn off a tiny strip of white unperfed blotter and sold it to me for $10.  It was a weeknight, but I decided to do it that night.  I figured it would be less time to get nervous and less time for the acid to be destroyed by the elements of my room.  Now, I wanted a solid first trip, because I only planned to do this once or at most two times.  Flashbacks and mental problems are not my cup of tea, so I figure the less times the better.  I put the blotter under my tongue and immediately got nervous.  I have read so many experiences, and I didn't quite know what to expect.  I expected to see some good visuals with a solid dose, but I had heard LSD's visuals weren't always the most insane, and that it's the mind fuck that gets you. </p><p>I had my roommate with me, and he was to stay sober and watch me the whole time.  He was a good friend for doing that, and a sober sitter is always a bonus for the first time.  If nothing else, it put my mind more at ease.  I did trip alone, however, which was not necessarily the best idea.  It was a lot of fun, and I think part of it was cooler being alone, because it was just like taking a journey within myself that no one else got to be a part of, but I think I could've avoided some of the negative thoughts had I been with an enthusiastic psychonaut.</p><p>After about 20 minutes, I began to feel a little funny.  I've never done stimulants, so I assume that it might feel like a mild stimulant buzz.  However, things quickly became really funny.  Now, I had felt some similar effects the first time I tried the bunk acid.  I suspect that the bunk acid was actually real, just very very very weak, but at the time I didn't know if my giddiness was purely a placebo effect or the acid actually starting to kick in.  My roommate took out his video camera and interviewed me a little bit as the effects were coming on, which was a good time.  I was lying on my bed listening to music, and I realized that my depth perception was a little funny.  When I reached up to touch the top bunk, it seemed like the mattress was a lot closer than it looked.  This was quite funny to me.  Then the bunk started to wave a little bit.  It just looked like a flag blowing, although very slowly, in the wind.  At that point I knew the stuff was real, so I buckled up.</p><p>The emotions were totally happy at that point.  Most everything was started to wave a tiny bit and I was getting mild tracers.  I described it to my roommate, and he told me to try standing up.  I did, and all of a sudden I realized how messed up I was.  The floor seemed like a mile below my head, and the room spun a little bit.  At that moment I experienced the first of many feelings of 'spatial confusion', as I have taken the liberty to dub it.</p><p>I would be standing in the middle of the room, but I would feel like the wall was right behind me.  When I would turn around and realize that I was still in the middle of the room, it felt quite strange.  It's like that feeling you get when someone is behind you or watching you, and then you turn around and no one is there.  Not really unpleasant, just interesting.  We turned off the lights for the first time at this point and the lights from my stereo and whatnot were quite cool.  The light from a power strip in the corner seemed to be shooting out little blips of lasers at me even though it was just a steady red light.</p><p>Then I plopped back down on the bed and put in some Radiohead (OK Computer).  The springs holding up the top bunk started to go crazy at this point.  They were made up of interlocking metal rings, and the rings were flying along like on a very fast conveyor belt and changing colors.  After a few minutes of this, two of our friends entered the room.  One of them had tripped before and I asked him to stop by to check on me, but he actually freaked me out by acting his usual, crazy self.  The other friend was a girl, and I wanted her to stay because I was not totally trusting the other two at this point.  She got weirded out because I probably asked in a really creepy way, which kind of put me in a bad mood.  However, they left soon and my roommate and I decided to go for a walk, which was a great decision.</p><p>Walking outside on the city streets felt like floating.  It was a mild out of body experience at this point, perhaps 90 minutes into the trip.  When I say out of body experience, I don't mean that I am viewing myself from above or anything, I just mean that I felt completely detached from my body.  My walking was on autopilot, and my consciousness was just floating along with my body.  The city blocks stretched very very far, and traversing a single block felt like many minutes.  My sense of time was almost completely gone.</p><p>We went to a pizza place where I was loud and obnoxious, and I kept walking around the room, kind of 'sampling' it, trying to get a feel for how big it was because my sense of space was so fucked.  The floor was made up of large tiles that were mostly blue but had slight tints of different color, and they were moving like crazy.  The darker spots of the tile were dancing like little ants.  After that, we went to rent some movies.  We decided on Pet Sematary (not the best idea) and 2001.  Pet Sematary had scared me as a kid, but I was feeling good and thought it would be fun to push myself a little bit.  I managed to pay for the movies without making an idiot of myself (he has no account at the store), and we headed to the supermarket to get a few more snacks.</p><p>My roommate informed me that I was in danger of attracting too much attention when we were in there, so I tried to keep quiet.  I almost died trying to keep in my laughter while we were in line, but then I caught a glimpse of something crazy: my own self in the mirror.  I had read something about this, and let me say, it was quite intense.  My face was expanding and contracting, and although my skin is fairly clear, the few zits that I had on my forehead looked like landmines.  I quickly looked away and decided I'd try it again back in the dorm when it wouldn't matter as much if I freaked.</p><p>On the way back to the dorm, we passed this hobo woman that my friends and I find particularly amusing/annoying, and I found this hilarious.  We also passed a friend who originally planned to trip with me.  He was disappointed that I had already done it without him, but I explained it was all I had and he was supportive.  Time to head back to the dorm.</p><p>Back in the dorm, things started getting a little too weird.  First, I began thinking about how my girlfriend was really upset about this experiment.  Then, my mind wandered to many other things, like how we will never know anything about the universe. I have been really into philosophy lately, and it had a huge negative impact on my trip.  These thoughts were quite depressing.  I also took my first long gaze into the mirror.  I'm not exagerating when I say it was one of the more memorable experiences of my life.  I saw myself objectively for the first time.  I looked like some sort of rat creature, and I began to grow horns.  This freaked me out quite badly, and I began to explain to my roommate and our close friend who decided to hang out that I was a huge tool.  They assured me I wasn't, but I would hear none of it.</p><p>Meanwhile, I noticed that touching my arms, legs, and fingers was quite strange.  My limbs felt extremely skinny and long.  It made me realize how insignificant my body is compared to the world and the universe.  My fingers felt like little pencils.  Also, my nose and eyes felt incredibly tiny when touching them.  Ever since looking in the mirror, I've been having a pretty serious 'out of body' feeling.  I am seeing everything I do as I do it, even though I am still seeing my surroundings normally, as normally as you can on acid, anyway.  It's like I was watching my own actions the way you watch a memory or fantasy play out in your head, although much more detailed and realistic feeling.</p><p>The fibers of the carpet swayed to and fro lackadaisically and in perfect unison.  My roommate really wanted to watch Pet Sematary, but I insisted that I was too depressed about seeing myself in the mirror and thinking about the meaninglessness of the universe.  I stayed in that frame of mind for a while, but after a few minutes I relented.  The movie wasn't scary, although I didn't pay that much attention.  Many many memories of my childhood came flooding back to me as we watched, and it was like I relived them in an instant.  After the movie, he kind of drifted off, and things got a little rough.</p><p>It had been perhaps 6-7 hours since I dropped, and I was ready for it to be over, but the 'cid had other plans.  I just sat in bed for a couple of hours, which seemed like an eternity, pondering how huge the universe is and how small and meaningless I am.  Every few minutes I would get up and write a page or two in my journal.  I would post the rants here, but I don't want to embarrass myself.  Basically, I just wrote about skepticism and how acid makes me feel like I can't know anything because my perceptions are shattered.  Now, this might seem like a 'bad trip,' but only part of it was bad, and the 'bad' stuff was definitely important stuff to think about.  After what seemed like days of this, I had finally come down enough to close my eyes and attempt sleep.  It came eventually, but it was difficult.</p><p>I woke up in a few hours still quite tired but weird feeling and EXTREMELY hungry.  The trip occured last night, and I feel almost back to normal but still a little strange.  The mental effects of the trip are definitely still hanging with me, and I have been quite weirded out all day by the 'ego separation' that occurred.</p><p>I am glad I tried it.  It was very very interesting.  My senses were altered less than I was expecting, but my mind was completely destroyed far more than I was prepared for.  Feeling as if my soul was outside my body was quite exhilarating, albeit disturbing.  I probably won't do it again, because even though I have heard of more intense trips, especially visually, I don't think I would learn much more from taking more, because I experienced the 'objective' view, and I have never wanted to take LSD for any reason other than experiencing something crazy and new one time just to see what it was like.</p>",
 "year": "2005",
 "id": "47191",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-08T07:00:00.000Z",
 "views": "4034",
 "dose": {}
}
