{
 "title": "The Experience, The Hangover, The Itch",
 "author": "Baron Von Bad Guy",
 "citation": " Baron Von Bad Guy. \"The Experience, The Hangover, The Itch: experience with Kratom, Cannabis & Alcohol (ID 47211)\". Erowid.org. Dec 22, 2005. erowid.org/exp/47211",
 "substance": "Kratom, Cannabis & Alcohol",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 Tbsp",
   "oral",
   "Kratom",
   "(extract)",
   " T+ 0:00",
   " ",
   "oral",
   "Alcohol - Hard",
   "",
   " T+ 0:15",
   " ",
   "smoked",
   "Cannabis",
   "",
   " T+ 0:00",
   "2 Tbsp",
   "oral",
   "Kratom",
   "(extract)",
   " T+ 0:00",
   " ",
   "oral",
   "Alcohol - Hard",
   "",
   " T+ 0:00",
   "400 mg",
   "oral",
   "Pharms - Sertraline",
   "(daily)",
   " T+ 0:00",
   "14 mg",
   "oral",
   "Pharms - Mirtazapine",
   "(daily)"
  ]
 ],
 "report": "<p>A little background on my mental health and some of the substances I have experimented with: I am a very frequent Marijuana smoker (Daily), somewhat frequent drinker (Weekly). I've done Salvia a number of times, LSA twice and Kratom a few times. There are many other substances I plan on experimenting with, unfortunately most are very rarely available. I take 400 MG of Zoloft every night for Obsessive Compulsive Disorder (OCD, which I have had for about as long as I can remember) and Remeron (15 MG I believe) to help me sleep.</p><p>FIRST DAY: Preparation/Experience</p><p>Preparation: Put about 4 tablespoons worth of Kratom (Normal Strength) into a coffee mug, mixed in enough vodka to encompass the Kratom, then covered the cup with plastic wrap and let it sit for about three hours. I then put the mug into the microwave for a few seconds, added more Vodka, stirred the concoction around and placed it back into the microwave. I continued this process until I felt content that enough of the Kratom had been extracted into the Vodka, at which point I filled the mug with water and warmed it up once more. I strained the remaining liquid into a separate cup, (squeezing left over clumps of Kratom with my hands to get out as much 'juice' from it as I could.) I mixed the finished product with some cola and syrup and drank down the bitter fluid over a period of 15-20 minutes.</p><p>The Experience: The effects crept in within 15 minutes after ingestion. I decided to smoke some marijuana from my bong. After the first hit I felt completely inebriated. Kratom is incredibly synergenic with Marijuana, only a few hits and the high becomes overwhelming. Closed Eye Visuals, mild Open Eye Distortions, an overall shift of consciousness. Like a strong Marijuana high with the addition of a very pleasant, warm, happy, drunk sedated, dreamy feeling. I seem to remember my head feeling 'melty' as if parts of it were made from gelatin. I can't recall much more from that night, so forgive me if parts of this are somewhat vague...</p><p>After a few hours of laying around, enjoying the very pleasing feelings of Kratom, the high began to wear off, this was when I decided to make another batch. I took the remaining 2 tablespoons worth of Kratom and prepared it the best I could. After drinking it, the high came back full force. Again, I can't remember very much.</p><p>SECOND DAY: The Hangover</p><p>I woke up the next day, I believe around 12:00 pm. feeling quite tired and sick. I seemed rather sensitive to the temperature, if I were to come out from under my covers and walk upstairs to get a drink, I would find myself feeling incredibly cold. Shivering and such by the time I got back downstairs. To sum it up, it felt like having a really, really bad cold, only without sneezing, coughing or having a sore throat. I noticed my lower back aching quite a bit. That whole day I didn't do much other than lay in my bed, take warm baths and drink water.</p><p>Later on that night I was feeling somewhat better. I decided to take my temperature. 101.9 Quite a fever indeed, I should have taken it earlier, I'm almost certain it would have been higher. My mother gave me something to reduce the fever. My temperature was down to about 100.5 by the time I was ready to go to bed.</p><p>THIRD DAY: The Itch</p><p>I woke up feeling a great deal better, no more cold symptoms, no more back ache, no more fever. However, my body was quite itchy. When I had nothing to do, I found myself scratching my hands, arms and legs a great deal. I went to the mall that day to see some of my friends, still itching on and off. Other than the itching, I felt baseline, and was able to interact with everyone normally. By the fourth day the itch was completely gone.</p><p>So, needless to say, I have some mixed feelings about my experience, while the high was indeed quite swell, the hangover was indeed quite shitty. Will I do Kratom again? I'd have to say all signs point to yes. It is still quite an enjoyable drug, I'll just make sure never to drink so much of it again. And while the hangover was by no means anything I would like to experience a second time. I have had a far worse hangover from alcohol, and that hasn't stopped me from drinking.</p>",
 "year": "2005",
 "id": "47211",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-12-22T08:00:00.000Z",
 "views": "18815"
}
