{
 "title": "More than I had expected",
 "author": "I-Pod",
 "citation": " I-Pod. \"More than I had expected: experience with Salvia (10x extract) (ID 47222)\". Erowid.org. Sep 17, 2007. erowid.org/exp/47222",
 "substance": "Salvia (10x extract)",
 "bodyweight": "165 lb",
 "report": "<p>Two days ago, I had my first Salvia trip, and I can honestly say that I was completely blown away. I was with 3 relatively close friends and one of them, S, had recently purchased 1 oz of dried Salvia leaves, and 1 gram of the 5 and 10x extract, and we had decided that there was no better opportunity than the present to try something out for the first time.</p><p>We started by smoking a bowl of the leaves, sprinkled with a dash of the 5x, and that was interesting, sort of a mushroom-like stone for about 15 minutes, nothing too intense. S and myself were both very educated about the effects, smoking method(s), duration, after-effects, etc, of Salvia and we both wanted to see what this plant could really do. We decided on jumping into the 10x and see what would happen. We each took turns, S went first and myself went second. After I had seen the look on S's face during his trip, I knew that I was in for a ride. I had been looking forward to this experience for quite a while, and the entire day I was in a fantastic mood and was ready for whatever Lady Salvia was ready to throw at me.</p><p>I took my first hit and held it in until I counted my way from 1 to 45. I blew out the smoke and my friends each said 'There's no smoke left man' and I replied with a simple 'Sweet'. I took my second and final hit. After I took the hit, I was holding it in and was trying to count up to just 25 this time. But as I was holding it in I was slipping into the grip of this strange plant and my friends had to tell me to exhale.</p><p>It started with my vision, everything began to get incredibly blurry and within less than a blink of an eye I was watching TV, it was as if I was sitting in front of a TV and watching what was going on right in front of me. I found this to be quite funny for some reason and I started laughing hysterically. I mean laughing like I've never laughed before, the kind that felt like it was coming from my soul and not just my voice. After I don't know how long of watching the strange visuals (it was mostly tracers and odd colors that seemed out of place) and laughing at them, I leaned down on my leg because I felt that some force was making me want to lean down and rest for a moment, before I really took off.</p><p>I don't know how long I was laying on my leg for, sitting in the back of a suburban truck, but S leaned me back up because he was getting worried that something was wrong. As he did this I thought that I had fallen down onto the ground and I gasped with shock. I looked between my legs to try and see what the hell was going on and I saw a very angry looking saw coming for me. I blinked my eyes to see if it would go away, because let's face it, watching as a saw is coming closer and closer to my stomach, is a little freaky.</p><p>When I opened my eyes, I thought that I was on a subway. When I say that I was on a subway, I don't mean on the inside in a seat, I mean being dragged along for dear life holding onto the side of the door trying to get in. And it actually felt like I was being raced down this dark tunnel actually holding on for dear life. Once again I blinked to make it go away, and opened my eyes to the sight of Coca-Cola bottles surrounded by dancing and twirling candy. This amused me. And as I was trying to enjoy the lovely visuals, I looked down at my feet, because it felt like something was grabbing at them. I ended up seeing this incredibly frightening rip that was going down the middle of the truck. That did it for me, I was terrified. I had to get out of there.</p><p>So I abruptly got up and ran outside to get away, because I didn't want to know, at that time, what was on the other side of that tear through the supposed universe. As soon as I got outside, my vision cleared, I could actually tell who my friends were again, I remembered that I had smoked the Salvia and that I was gonna be ok. I then sat back down in the truck and waited for the plant's effects to completely wear off.</p><p>In conclusion, Salvia kicked the shit out of me. I'm an experienced psychoactive and psychedelic user and this was much more intense than any acid trip I've ever had. On acid, I find that I can ease myself into what is going on. I know that I had taken the acid, I know to enjoy the show, and I can let it work its magic and tickle me and my senses, but with Salvia, it's like being hit in the back of the head with a sledgehammer. I can't remember the last time that I was in awe of a substance.</p><p>One of the most interesting things about Salvia to me is that it only lasts for maybe 10 or 15 minutes, how can my mind be totally torn apart and then reassembled in only 10 minutes? I know that I have only scratched the surface with Salvia, and am excited to be able to try it again, only in a much better setting than the back of an SUV in the woods. I think that Salvia has much potential for me and my psychoactive use. I highly recommend Salvia to any psychonaut who is willing to put their mind through a very serious ass-kicking.</p>",
 "year": "2005",
 "id": "47222",
 "gender": "Male",
 "timestamp": "2007-09-17T07:00:00.000Z",
 "views": "2969",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "600 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
