{
 "title": "Euphoric, Psychedelic",
 "author": "Speed Weeder",
 "citation": " Speed Weeder. \"Euphoric, Psychedelic: experience with Fentanyl (ID 47228)\". Erowid.org. Mar 21, 2010. erowid.org/exp/47228",
 "substance": "Fentanyl",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "sublingual",
   "Pharms - Fentanyl",
   "(patch)"
  ]
 ],
 "report": "<p>All the reports I've read here about fentanyl seem pretty negative or not very positive, so I'd like to share my experience with this drug.</p><p>I got the gel patches for free a few months ago, 4 patches to be exact. I decided to be stupid and eat the gel inside. I took a little drop at a time, put it on a paperclip, and stuck it under my tounge. 5-15 minutes later I would do more until I had the desired effects.</p><p>Anyhow, I loved this stuff. It made me feel pretty damn euphoric, as well as relaxed. Eventually when I went to bed it seemed to have psychedelic effects, the same every time. I would always hear voices having conversations or see shadows move out of the side of me eye...stuff like that. I enjoyed this a lot and it was a fun way to get to sleep every night. Around this time I would also get pleasently itchy if I had done enough.</p><p>I continued use 3 days in a row, a 2 day break, then 3 days again etc. The first patch lasted into the second cycle, but by the end I was using half a patch a night. I took a break for about a week when I only had one patch left, but I still had a high tolerance when I came back to it.</p><p>Recently I tried oxycontin and I found the effects extremely similar, oxy just had more of an itch. The only problem was I needed 80mg of oxy to feel the effects much at all (common doseage is 20), and that's snorting it. So watch out for opiate tolerance, cause fentanyl does that well. I felt myself always craving that taste when it was gone, and I might have gone through a minor withdrawl (only 2 weeks of use, so it may have been a sickness).</p>",
 "year": "2005",
 "id": "47228",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2010-03-21T07:00:00.000Z",
 "views": "6593",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "sublingual",
   "substance": "Pharms - Fentanyl",
   "form": "(patch)"
  }
 ]
}
