{
 "title": "Gave Me a Grand Mal Seizure",
 "author": "Belt of Orion",
 "citation": " Belt of Orion. \"Gave Me a Grand Mal Seizure: experience with Alprazolam (Xanax) (ID 47278)\". Erowid.org. Sep 1, 2006. erowid.org/exp/47278",
 "substance": "Alprazolam (Xanax)",
 "bodyweight": "190 lb",
 "report": "<p>I love xanax.  it makes me feel happy, and frees me from my anxiety.  It makes my day more productive.  but....I love to have some when I'm drinking. It seems a concern with this drug is the withdrawal symptoms.   I had been taking two or three 2 mg bars on most days for some time after easily getting a prescription for them on the internet.  I was in a 'pill phase' which included valium, vicodin, ect, although trying to not be obviously stupid with the wrong combos. </p><p>At the time of the incident I was only taking xanax for the past several weeks.  So anyway, I had a ton of work at the time, was very busy for a couple days and my dog was attacked by a friends dog and wounds became infected.  So I was stressed, unrested, and not eating properly going a thousand miles an hour.  Ah, the American life.  I rushed to get my work done and then drove 400 miles to the bay area to the pup's animal hospital.  I had no xanax, booze, or anything for three days.  I then dropped dead weight in a market and had a grand mal tonic-clonic seizure.  This is the most severe of seizures.  I was out cold for 10 minutes, flipping like a fish.</p><p>When I 'came to' my brother had driven from his house to the market after my friend with me called him, and he called the ambulance.  When they arrived I still didnt know my age when asked and felt lifeless.  I have never felt more tired or confused.  Every muscle in my body had clenched as hard as possible.  By the time we made it to the ER, I was feeling better, was given a salt solution to prevent another seizure, a cat scan and released.  Cat scan and MRI were clear.  The ER reported the seizure to the DMV as required by CA law and my driving license was suspended.  It took me a year to get it back after many neurologist visits and EEG tests and a lot of DMV red tape and waiting. </p><p>As far as the doc knows, this wasnt epilepsy, I've had no seizure before or in the 2 years since.  The seizure was caused by my body withdrawing from the drug.  If I had weaned myself off it wouldnt have occurred.  After the seizure I had shiver like twitches for 2 months and irregular EEG tests for four months.  Thats how long it took my body to free itself of the drug. </p><p>Cost me my drivers license for a year, a few thousand $ for hospital bills, and my auto insurance rates doubled.  And it scared the shit out of me.  If I was driving when the seizure occurred as I was five minutes before it happened, I could have killed someone.  My doc said that perhaps xanax could be a useful drug for me, but must be used properly at a normal dose and no 'cold turkey' quitting.  Tolerance builds fast with this stuff, it's addictive, so this is a tricky substance that should be used carefully.  I didn't see this coming.</p>",
 "year": "2004",
 "id": "47278",
 "gender": "Male",
 "timestamp": "2006-09-01T07:00:00.000Z",
 "views": "25097",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(daily)"
  }
 ]
}
