{
 "title": "Where Did My Emotions Go",
 "author": "DepressionIsBoring",
 "citation": " DepressionIsBoring. \"Where Did My Emotions Go: experience with St. John's Wort (ID 47289)\". Erowid.org. May 7, 2007. erowid.org/exp/47289",
 "substance": "St. John's Wort",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "St. John's Wort",
   "(daily)"
  ]
 ],
 "report": "<p>I've been suffering from depression for quite a number of years. I'm usually very emotional, I cry a lot, I easily get angry, etc..</p><p>Anyway, so I was walking around aimlessly in my local pharmacy and I stumbled upon St. John's Wort. I've read that it's used for depression but being OTC, I didn't really think much of it. I was bored so I decided I'd give it a try.</p><p>The recommended dose is 900mg a day. One dose in the morning, afternoon and evening. My first dose was 3 300mg caps. Then for the next few days I was taking maybe 1200mg a day. I wouldn't say I was feeling better, but the sadness wasn't there. I wasn't thinking about anything.</p><p>I Googled the lethal dose, and being that there isn't any documented, I just started taking caps whenever I saw the bottle in front of me. Some days I would take 25 caps a day (7500mg).</p><p>OK, it has been about two weeks now. I feel VERY emotionless. I feel like a zombie. I can't tell if this is good or not. I don't cry anymore, I'm not sad.. but I'm very empty. I find myself in bed for 18 hours a day. I feel extremely extremely bored. My mind is just blank.</p><p>As a side note, I need very little Marijuana to get really high, and when I do, it's almost too much to handle. My heart also tends to race faster when I'm high.</p><p>Overall, I wouldn't really call this a mood enhancer. It doesn't make me happy, it just removes some of the negative feelings, leaving me neutral. Being relatively safe and OTC (in the States anyway), it's probably worth a try. They say this is not for severe depression (which I have) but for moderate/mild depression. I now understand why. YMMV.</p>",
 "year": "2005",
 "id": "47289",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-07T07:00:00.000Z",
 "views": "43403"
}
