{
 "id": 4733,
 "title": "An Interesting Little Quid",
 "date": {
  "submission": "2004-01-14T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Slime",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3.3",
    "unit": "g"
   },
   "administration": "buccal",
   "substance": "Kratom",
   "form": "leaves"
  }
 ],
 "report": [
  "Oooh... feeling rather floaty. Maybe I should explain why - I think this little foray into kitchenology may help some of you internet-pundits out there use your drugs a little more palatably.",
  "I was bored & pretty dejected after working my figurative balls off for a boss who thought humanity'd benefit from my sour little wage packet. Seeking a reboot, and perhaps a little chemical comfort. Time to break out my pharmacopea and see what can turn my brain to adequate slidginess...",
  "After a little ponderance at my box of tricks I yanked out a good ten grammes of kratom, some cocoa beans and some neem leaves, and decided that I would make myself a culinary frankenstein... here's how it went:",
  "I divided the ten grams (after shredding and de-veining) of kratom into three equal piles (just to eyeball a suitable 'quid' measure). Then mixed them all back together and whacked them into a cup. Added the juice of half a lemon and some brown sugar, threw in the cocoa beans whole. Nuked the concoction in an 800w microwave for about 45 seconds (after which the wonder sludge smelled like a lemon crisp bar, if those actually exist, after being dumped into a bag of peat). I spooned this into three partially dried large sweet neem leaves, added some cinnamon and other little goodies. Also some cocoa beans decided to jump in there. Wrapped up the leaves and loaded one into my lower facial orifice.",
  "Sucked",
  "Chewed",
  "Sucked some more.",
  "I Tried not to swallow what saliva resulted, as I was keen to see whether mitragynine would permeate through the mouth's membranes.",
  "After perhaps ten minutes of suckery I grew bored and put another one in the other loading bay (it's still my mouth, no matter how much crap I speak).",
  "Sucked a little more, chewed and finally swallowed.",
  "This was perhaps twenty minutes from zero, so perhaps this method (I surmised this from other reports) is not as quickly uptaking as making tea, as reports suggest as little as five minutes for effects to begin.",
  "I began to feel mellow. I mean triple-distilled 99.99% BP ubermellowness, and slitheredd my way to my laptop to watch some neon genesis evangelion. Chewed the last quid at about t+1 hour, by which time movement seemed an alien and morally repugnant concept. Goddamned dynamic universe. Stupid quanta.",
  "However, there was a marked difference in effect - I've tried it in every form other than suppositories and this time I completely missed the stimulating effect (which normally exhibits itself for around ninety minutes) -this instead was an instant ticket to mellowness.",
  "However, the effects seem combined now - that whole tweeky / sedatey dichotomy seem to be superimposed upon one another, occasionally alternating in 'waves' - As I write this verbatim, my hands are fluent upon the keyboard, and yet I don't even remember the home position. Marked analgesia, apparent bronchial dilation. Visual flanging (only very marginal) and the faeries seem intent on pulling me deeper. Fareies are good - my last session with this unique plant resulted in the untimely binning of good trousers, as I fell asleep in my clothes and decided to lay some free range batchelor seed.",
  "Aside from wasted sperm, I've had nothing but pleasant experiences with kratom - however, I once used it on five sequential evenings and ended up with a mild, but unabating and annoying face-ache as a reward for my plant loyalty. Guess that concept is crap as well.",
  "I won't conclude that the effects are different to other ingesion methods until I've 'bioassayed' a few more quids - as most druggies know, there are too many variables in the soup to allow for that. Next time, however, I plan to make an extract of the leaves first.",
  "(To whoever read this - Apologies for the convoluted style and general pretentious language - some drugs just do that to me).",
  "So, the tripe's in the cooking pot and the sun's rising on the cabbage farm - and it's left me feeling pretty smashed.",
  "Peace, love, and wandering thoughts",
  "The emissary of the slime duchy."
 ],
 "erowid": {
  "id": "29992",
  "citation": " Slime. \"An Interesting Little Quid: experience with Kratom (ID 29992)\". Erowid.org. Jan 14, 2004. erowid.org/exp/29992",
  "substance": "Kratom",
  "views": "41986"
 }
}
