{
 "title": "Thought I Was Going to Have a Heart Attack",
 "author": "Kazaric",
 "citation": " Kazaric. \"Thought I Was Going to Have a Heart Attack: experience with DXM & Dimenhydrinate (Dramamine) (ID 4734)\". Erowid.org. Jan 3, 2002. erowid.org/exp/4734",
 "substance": "DXM & Dimenhydrinate (Dramamine)",
 "bodyweight": "150 lb",
 "report": [
  "<p>One ordinary friday night I downed 270mg dxm and about two hours later 1000mg of generic dimenhydrinate to see what was so great about the two mixed together. I'd heard about the combination from users on Third Plateau's IRC chat. Apparently it wasn't to be so great for me, however. About ten minutes after consuming the dimenhydrinate I felt a huge rush of tiredness come over me. It seemed really odd to me that the effects were coming on so fast and I found it hard to stand up so I found a chair and quickly sat down.",
  "I remember seeing my mom's face asking me if I'd taken a drug and talking to a bunch of my friends who weren't there. Then I woke up in a hospital with electrodes strapped all over me. Nurses were taking viles of my blood and shoving an IV in my arm. They asked me if I was seeing things that weren't really there and I said 'no' for some reason. I had to drink two cups of liquid activated charcoal, which, in case you're wondering, tastes like shit in liquid form.",
  "Then a bunch of different doctors came and saw me and asked me if I was trying to kill myself, which I wasn't, so I was pretty confused. They didn't seem to understand that I was just bored and trying some cheap drugs out of curiosity. I didn't find out why they were so concerned until the next day. My mom told me that the doctors thought I was going to have a heart attack. My heart had been over 140 bpm and my blood pressure 200/100 for so long that they were ready to defibrilate me when my heart stopped. I'm lucky I made it out alive without any permanent heart damage.",
  "I did have to talk to a crisis nurse and convince a hundred people I wasn't trying to kill myself. There is no possible way this combination was worth it. Dimenhydrinate has been kind of cool at times in the past, but not that cool. The doctors told me that they get cases all the time of kids coming in OD'd on dimenhydrinate and that it's a big problem. When the side of the bottle says not to take more than two tabs it's serious. Some people might overdose on 30 pills and some people only on 10 but why risk your life? And it is a risk - Because you never know what your tolerance is, what your bodies ability to metabolize dimenhydrinate on any given day will be or whether or not you'll be lucky to get away with taking that high dose again.",
  "I hate to rattle on like a highschool principal, but dangerous drugs just aren't worth it, and dimenhydrinate can be a very dangerous drug. Take it if you must with extreme caution, but don't be surprised when you die of a heart attack at 20.</p>"
 ],
 "year": "2001",
 "id": "4734",
 "gender": "Male",
 "views": "18835",
 "dose": [
  {
   "time": "0",
   "amount": "270 mg",
   "administration": "oral",
   "substance": "DXM"
  },
  {
   "time": " T+ 2:00",
   "amount": "1000 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate"
  }
 ],
 "submissionDate": "2002-01-03T08:00:00.000Z"
}
