{
 "id": 4734,
 "title": "Two Completely Juxtaposing Experiences",
 "date": {
  "submission": "2007-06-12T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "The Warrenite",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "If I tried to give the entire background to both experiences, I would be here all night.  Instead, Ill give you a general idea and a few essential details.  This is the story of two experiences that changed my ideas about marijuana so drastically and in such short time that I still do not know what to think of it. ",
  "My cousin, Dru, and I had been planning a smoke session for about 5 or 6 months before I finally went with a few friends to meet him.  We met and me and my friend went with Dru out into the woods of Michigan State to smoke a joint and a bowl or two.  I had smoked a few times before but never had a real high; the last time I smoked was 3 months prior.  As we arrived at the designated spot in the forest, Dru took out his joint of average weed and lit it.  I could take hits fairly well so I took advantage of that.  My first hit sent me coughing so that I couldnt participate in the next round.  I finished off the joint in my next hit and we took out the bowl.  I took 2 more hits off of that and it was cashed.  Dru had more weed but we all decided that we had had enough.  As we were walking back, I wasnt feeling very high except I was hallucinating small things, mostly thinking that certain shadows had depth and could have been small animals. ",
  "We walked a different way than we had come and I still cannot fully recall which way we walked because I was concentrating on what was happening to me.  I decided it was probably going to be a dud of a trip again because the effects seemed to be taking quite a while to really come on.  Then it hit me.  I cant remember any transition at all, other than, seriously, a blink of an eye.  It seemed as though I had tunnel vision except I didnt have any blind spots, almost as though my eyes were focusing binocularly.  Hearing became quite a trip: when I spoke, it almost seemed to come out of my head as a whole rather than from my mouth; other peoples voices became closer and clearer but I could only concentrate on a few things at a time.",
  "Hallucinations seemed to really take hold because my glasses had fallen off and I put them in my pocket. My cousin had to take them away later when I was trying to bend them like a twist tie in my pocket.  I dont have too bad of vision, but things really started to distort, especially in the darker backstreets of the campus.  Somehow, 2 full-size oaks became 2 scale-size statues of people, a garbage can became an old lady on a bench; Alfred Hitchcocks silhouette momentarily appeared in the shadow of a tree.  ",
  "I remembered things from earlier in the day except I thought they were part of a dream I had recently.  I got back to my cousins dorm and I bid him adieu and drove off with my friends.  As we approached my friends dorm, where we were staying, I said, You guys, I remember this dream I had last night.  We were driving towards this hotel or something and on top of the roof were these two huge nutcrackers and they said something like happy new year.  My friend had the decency to point out two enormous nutcrackers holding a Merry Christmas banner on top of my other friends dorm as I was saying this, upon seeing them I TOTALLY freaked out.  I thought I was in a dream for a short while. ",
  "On the whole, this was a very positive experience.  I definitely had a new outlook on marijuana.  Before, I thought it wasnt worth the coughing and didnt see what the big deal was, but now I understood the power of its psychoactivity.  This is why when I went home the next weekend, I was not apprehensive when my friend Dan offered to have me come smoke with him and a few of his friends.  I thought it was a little too soon to smoke again but I hadnt smoked with Dan in about a year.  I met Dan at his house and we waited for some 3 people to come by (all MUCH more experienced smokers).  Somehow I was coerced into sitting bitch.  Im no short guy so it was that much less enjoyable.  They had some shit weed from Detroit and Dan had some hydro that he forgot at his house.  Dan broke up the weed very finely and placed it into a small glass bowl.  We clammed out mikes car to get an enhanced effect.",
  "I took my first hit and held it way too far past my bounds, causing me to swallow part of the hit.  I took another hit after burping profusely.  This one I let myself cough out.  I passed the next round and hit the next bowl once.  At this point I became very irritated, not in an angry way, just I did not like anything about my present situation.  I started to complain about how smoky it was: I could barely catch my breath.  They courteously rolled down the windows because by this time, they were pretty much done.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "They started driving to somewhere; I do not recall where.  Every turn was an ordeal.  I did not want to lean with the turns but I also didnt want to take the effort it required to prevent leaning.  They stopped at a gas station to get some smokes and I asked the person going in if he could get me something to drink because I was obviously not coherent enough to get up and do it myself.  The next hour, or what seemed like it, was mostly spent concentrating on rhythmically drinking my 7up.  I heard them mention my name once or twice but I could not interject myself into the conversation to ascertain what they were talking about. ",
  "Dan then went home and got his dro.  I can barely remember what happened then.  He explained, Dude, that other stuff was shit weed.  All you need is one hit of my hydro and youll feel better.  I was convinced because I dont think I had the logic in my present state to refuse.  I dont remember what we smoked it out of, either a joint or a bowl but after that I could barely stay conscious.  Contrary to what I was lead to believe, this hit did not make me feel better.  I sat in the car not aware of my surroundings with my eyes shut tightly supporting my head with my hands with my arms resting on my lap.",
  "I cannot accurately describe what I saw most of the time with my eyes shut.  I was hallucinating I suppose, what could only remotely be described as a kaleidoscope.  Then I felt like I was a roller coaster that was constantly angling down.  I felt like if I let my arms out from under my head, my head would fly down through my lap onto the road below.  I heard someone say my name and everyone laughed but I could not muster the energy to counter.  We all decided to go back to Dans house to chill.  I have been friends with Dan for a long time and I know his parents quite well.  I realized that they were there but I couldnt acknowledge them without feeling like I was making a total ass out of myself.  I was SO thirsty by this time.  Under normal conditions, I would have been parched because I hadnt drank anything in many hours but I NEEDED something to drink or I felt like I would pass out.  Dan fed me some Tostito chips and two lukewarm Pepsis.  I fell asleep sometime before 2 AM about 5 or 6 hours after I started smoking.",
  "The next morning was almost a disaster.  My mom called me at 9:30 and reminded me that we were going shopping that morning.  It took every ounce of effort in my body to not look and sound high at that point.  I went shopping for 3 hours and it was some of the longest and least decisive hours of shopping I have ever experienced.  I still dont know if my mom thought I was high. ",
  "Im willing to give weed a chance again though.  Its been about 5 weeks since those two weekends and I think Ive calmed down enough to try it again.  I now realize that even weed is not necessarily a fun-loving drug, no matter how benign it may seem."
 ],
 "erowid": {
  "id": "29996",
  "citation": " The Warrenite. \"Two Completely Juxtaposing Experiences: experience with Cannabis (ID 29996)\". Erowid.org. Jun 12, 2007. erowid.org/exp/29996",
  "substance": "Cannabis",
  "views": "1969"
 }
}
