{
 "title": "Expensive, Worth It",
 "author": "silvergraph",
 "citation": " silvergraph. \"Expensive, Worth It: experience with Modafinil (Provigil) (ID 47389)\". Erowid.org. May 1, 2006. erowid.org/exp/47389",
 "substance": "Modafinil (Provigil)",
 "bodyweight": "",
 "report": "<p>I have a neurological disease that doesn't kill people but makes horrible inroads on their energy and ability to focus.  Some research led me to believe that Provigil, the air traffic controller's pharmaceutical pal, might help me too, and my doctor was willing to prescribe it.  Provigil is very good stuff.  It comes in 200 mg tablets; half a tablet is generally quite enough to launch me on my day when I've wakened feeling bad. It raises my blood pressure slightly (though not as much as Prozac, or Mobic, the fancy anti-inflammatory drug I used to take).  I also find that it has good effects on the stiffness and muscle pain that are part of my condition. It might not literally relieve these feelings, but it disattaches me from caring about them so much, and since it facilitates being active, I do think it helps me reduce my stiffness.  The only caveat I have is that if I'm dealing with something annoying, it can put a little spin on my temper and make me more willing than usual to lose it. Perhaps it's disinhibiting to some slight degree. A very clean drug in its lack of murky mood effects, withdrawal, and physical side effects.</p><p>It doesn't produce euphoria, just improved, generally cheerful energy. The conservative dose I take will, if I'm exhausted and actually sleep-deprived, make me able to function; or, if I've had enough sleep but am feeling stiff, slow, and zapped-out regardless, will lift me out of that state and to the point that I can put in a full day.  I do notice that it wears off rather abruptly in about twelve hours; I can definitely tell when that happens.</p><p>When I take Provigil, I avoid coffee and tea; it's stimulant enough in itself - and strong enough to deserve respect.</p>",
 "year": "2004",
 "id": "47389",
 "gender": "Female",
 "timestamp": "2006-05-01T07:00:00.000Z",
 "views": "14477",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  }
 ]
}
