{
 "id": 4738,
 "title": "Elemental Insights",
 "date": {
  "submission": "2000-05-31T07:00:00.000Z",
  "experience": "1995-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Panda Monium"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Datura"
  }
 ],
 "report": [
  "I'm at a Rainbow Gathering and a desert thunderstorm is bearing down quickly, so I jump into the nearest available shelter, a teepee inhabited by some seriously Rainbowed-out characters, one of whom is a Polish sadhu, passing around a chillum and saying prayers to Shiva. Why not, I think, and take a couple of hits. The taste is tobaccoey, but more so... 'What's in this?' I ask. 'Ganja. And tobacco. And Datura.' Yow. Datura has always been on my 'Don't EVEN Go There' list.",
  "The buzz is like tobacco, only more so (which I've only ever had in very small doses, mixed with pot. I figure it can be okay to dance with the tobacco spirits, but don't invite them in or they'll eat you up from inside. I expect datura is also like this, only more so.) The storm blowing over as quickly as it came, I leave and go wandering. Its very subtle, just an added dimension to the marijuana high.",
  "At one point I'm on the trading trail where everyone has their blankets laid out with a profusion of hippie  trinkets, and a posse of armed forest service rangers comes riding through on horses. Some of the more agro hippies start yelling warnings and generally creating a disturbed vibe in what had up to then been a very peaceful atmosphere. A few minutes later, a dust devil whips across the trail, touching down right in the area where the disturbance had occured and... The atmosphere is restored to its previous peace. The wind has cleared out the bad energies, or so the datura informs me (not as a voice speaking to me, but rather as catalyst for thinking along channels that might not otherwise have been available able to me.)",
  "Later, I'm looking down a valley at another rainstorm, knowing how good it will feel to the land to get some rain after being inhabited and trampled by ten thousand hippies...I feel the datura has allowed me to become aware of the interactions of elemental energies in my environment, which is something I hadn't much thought about up to that point. This was 5 years ago, and I haven't tried it again since, but I could see going into the wilderness (desert seems most appropriate...) and smoking a bowl of pot and maybe a postage stamp-sized piece of datura leaf.",
  "Folks, if you must play with datura, play safe - tiny amounts in a good setting, and smoke it, don't eat it. "
 ],
 "erowid": {
  "id": "30",
  "citation": " Panda Monium. \"Elemental Insights: experience with Datura (ID 30)\". Erowid.org. May 31, 2000. erowid.org/exp/30",
  "substance": "Datura",
  "views": "51732"
 }
}
