{
 "id": 4739,
 "title": "Nothingness",
 "date": {
  "submission": "2001-08-20T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tree",
  "weight": 72
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Cocaine truly is one of the most deceiving drugs I have ever come in contact with, it gives you a feeling of being great or even greatness. It is a very egotistical drug that makes most people I know arrogant assholes, myself included on a number of occasions.",
  "After taking cocaine on and off for the last 4 months or so I truly believe it is a nasty substance, not in its natural plant form but rock or powdered form. The other night I went out with my friend and we bought a gram of coke for about 70 US dollars. We went to this bar and after getting our drinks we quickly escaped to the bathroom and cut up a fat line each then went back to our seats feeling that we were tricking the rest of the world. The drip was nasty, as usual, this time a little more so. My teeth went pretty much completely numb and I was off. I was feeling nervous and could not concentrate on anything for long periods of time, so a time later we went for another line and then another. There were some minor visual distortions, the lights had a definite brighter glow to them and some minor color enhancement. My palms were sweating so much that I was constantly wiping them back and forth on my jeans when I was not biting my nails or smoking cigarettes one after the other.",
  "I was not really very social at all and was not having much conversation with my friend at all, except when we hinted at escaping to the bathroom for another line. We would tell each other 'it's good, heh,' and all the other bullshit that I vomit out in whilst high on cocaine. I was not comfortable anywhere I was and not comfortable with myself. I felt nothing for no one or myself and all I wanted was another line when the gram was finished. The subject of getting another one was brought up at 7:0o AM in the morning. Thankfully we did not and went home.",
  "I think coke is a fake drug that gives me a nothingness feeling and it is also bloody expensive. Never again will I fall in to the same repeating film of coke and coke nights out on the town."
 ],
 "erowid": {
  "id": "300",
  "citation": " Tree. \"Nothingness: experience with Cocaine (ID 300)\". Erowid.org. Aug 20, 2001. erowid.org/exp/300",
  "substance": "Cocaine",
  "views": "25001"
 }
}
