{
 "title": "Psychological Trainwreck",
 "author": "Hclam",
 "citation": " Hclam. \"Psychological Trainwreck: experience with LSD & 2C-E (ID 47415)\". Erowid.org. Jan 18, 2008. erowid.org/exp/47415",
 "substance": "LSD & 2C-E",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " T+ 2:00",
   "1 repeated",
   "smoked",
   "Cannabis",
   "",
   " T+ 2:00",
   "10 mg",
   "oral",
   "2C-E",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Until this trip I had been relativly comfortable with Lsd, having used it a dozen times or so, and I had once tried 15mg 2c-i and although that was a frantic mindmelting adventure, I maintained a safe mind set and managed to enjoy myself.</p><p>A long time friend of mine and I took 2 hits of paper acid at around 4pm, on a warm sunny friday, we were in a very good spirts and expected a good trip. The first 2 hours were rather light, just buzz not to much visuals, but very enjoyable. Around that time we met up with a friend of his and used his cannabis vaporizer, He wanted to trip with us but since we had eaten all the acid I had, the idea came up of splitting 2 2ce 15mg capsules 3 ways. I didn't have a accurate enough scale so I opened them and split the bright white crystals into 3 piles as equal as I could make them, poured each onto a small piece of toilet paper and wrapped it into a ball. We swallowed them and went back outside.</p><p>I didn't mentaly prepare my self for the 2c-e at all. I didn't even really think through that I just took a powerful pscycidelic which I had never done, on top of an acid trip which isn't even in full gear, and that I was about to tripping out really hard and should make accomidations. Within 5 or 10 miniutes all three of us felt the effects.</p><p>About an hour later, I made a classic tripping mistake, going back to my room alone. Its started to get a little windy and chilly so I went back to my room to change. The cold started to raise abstract doubts, and bring down the positive energy. After taking a shower for about 2 hours, I called my friend who had also done the acid and 2c-e, and asked him to come to my place. When he got there we started having a very emotional albiet nonsencical discussion/argument. At the end of which I was crying and screeming and I told him to leave. It was the last time we've spoke. The hullicination I was having a distortion of the image I have of my self. I hated this person, who I just realized I really was. I felt I didn't deserve to live.</p><p>Complicating the issue was the full bottle oxazapam (like valium), in my desk, making suicide a readily available option. It was torture, my life was in my hands, and 100% of my consciousness was telling me to let it slip into the abyss. I think the main thing that kept me from doing it was the thought, that I'd be the only one who wouldn't have to deal with my death. I called one of my better nontriping friend who knew  me well, and is an artist at defusing crisises drug related and otherwise. I stayed up all night, the visuals, didnt subside till around 6am.</p><p>As bad as my trip was my friend who took the same shit I did had it much worse. Although I havn't talked to him personally, I hear that he had a mental breakdown of some type. What I do know is that he was acting eractict enough on saterday that some authority saw him called the police and had him commited to mental institution for a few days, and had him kicked out of school. From what I hear he returned mentaly back to normal around 3 or 4 days after the trip.    </p><p>Was this a result or circumstance, prexisiting stress, or an inherent result of taking 2c-e and lsd together. I think a bit of all three but, I don't think they are few many people who could handle a trip so intensly stimulating and relentless visually hallucinagenic.</p>",
 "year": "2005",
 "id": "47415",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-18T08:00:00.000Z",
 "views": "15567"
}
