{
 "title": "Strange, Interesting, Scary and ... Pleasant?",
 "author": "Lucid Vengeance",
 "citation": " Lucid Vengeance. \"Strange, Interesting, Scary and ... Pleasant?: experience with Salvia Divinorum (extract) (ID 47425)\". Erowid.org. Dec 2, 2010. erowid.org/exp/47425",
 "substance": "Salvia Divinorum (extract)",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Salvia divinorum",
  "(extract)"
 ],
 "report": "<p>This was my first time trying Salvia. I've had considerable experience with mushrooms, MDMA, weed, and some LSD and Kratom, and went into this with the intent of experiencing something new and expanding my understanding of the substances. I used my girlfriend as a sitter and had a very pleasant setting in my apartment with soothing music and lighting. I had my Erowid T-shirt on, and my mind was at ease.  I felt confident and calm about the experiment and was looking forward to a new experience.</p><p>I was using 10X standardized extract cut with an equal amount of dried salvia leaves (to provide more bulk for smoking), so I would guess it would compare with a 6x standard in terms of average strength.  I was clean from any other medications.  I started on the couch with a pillow at the ready and began to hit my small one-hitter pipe, long deep drags using a torch lighter.</p><p>After two large drags, the onset began quickly, starting with a sort of visual, sensory disturbance not unlike alcohol or weed but stronger, and quickly disorienting me.  As I took a third toke, I felt a rippling sensation beginning at my lips and working downwards over my body, sort of like having a bunch of rollers such as a conveyor belt roll over me.  The sensation was strange, disorienting, but oddly pleasant. I remember remarking to my girlfriend, this is good, this is a good drug.</p><p>When I lay down, I had an incredible urge to go deeper so I attempted to smoke some more.  Time was becoming a difficult concept, so coordination of my movements was confusing.  My girlfriend tried to help me get the pipe in my mouth, but I found her assistance irritating, like she was trying to stick the pipe in my face (I think this was due to the time distortion. She obviously was having a hard time understanding me). I was having trouble talking, but finally said why are you sticking the pipe in my face!?, and then why are you acting so weird???. It immediately occurred to me that she was the sitter, and I was the patient, so my accusations were pretty absurd!  I said No, thats ridiculous, its me thats acting weird! I had another toke, then decided to let the trip take me, lay down, and after pondering this dialogue, began to laugh hysterically, and then slipped away into a different phase of my trip. </p><p>I found myself in and out of void, pondering the stoned state I was in.  My ego self was incapable of coherent thought in this stoned state, but there was another part of me, an intellectual yet immaterial self that could think fairly clearly and was observing my stoned self.  It occurred to me that when I die, this intellectual, immaterial self that I was now in tune with, would separate from my body and move on unfettered, and that death is merely a departure of this entity from the body (i.e. body:mortal, identity:immortal).  Strangely, while one might think this revelation would be comforting, I found it very frightening, because I realized the time would come that I would have to grieve my own death, and the prospect of that was very unsettling.</p><p>This fear morphed into a less tangible, irrational fear, similar to what I felt in the dark as a child. I asked my girlfriend to cover me completely in a blanket, and sure enough, once covered my fear dissipated.  I realized afterwards, the act was an exact equivalent of cowering under the covers when afraid in bed as a child.</p><p>So, thats the gist of it.  It all lasted about 40 minutes.  About 10 minutes of intense tripping, another 10 of moderate tripping, and another 20-25 of comedown.  All in all it was a very positive experience and I look forward to doing it again.  Interesting and strange but not necessarily what I would describe as fun. My girlfriend asked whether I thought Salvia is escapist.  I replied, escapist yes, but not in the sense of escaping ones troubles as one would with alcohol or opiates. Rather an escape from reality in a profound way that may or may not end up being comfortable.  I wouldnt recommend Salvia to everyone.  Great for the psychonautic traveler, but not the partier, and that might be why there are so many bad trip reports in here.  Definitely use a sitter!</p>",
 "year": "2005",
 "id": "47425",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-12-02T08:00:00.000Z",
 "views": "3674",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
