{
 "title": "Thoroughly Life Changing",
 "author": "DT",
 "citation": " DT. \"Thoroughly Life Changing: experience with Ayahuasca (ID 47451)\". Erowid.org. Jan 28, 2006. erowid.org/exp/47451",
 "substance": "Ayahuasca",
 "bodyweight": "75 kg",
 "report": "<p>Sessions were held fortnightly over 4 months in a secluded area, away from the city, a small community of people of both genders including children 13-15 years imbibing in vegetal. A master opens the ceremony with  the chanting of ancient hyms a local indian dialect (brasil), after which those at the table take a drink of vegetal (80-100ml) which then proceeds to the other members, no marijuana is used during or after the session, just vegetal in varying doses, you are free to ask for another glass if the amount ingested is not sufficient, a bitter bitter potion usually inducing vomiting for the first couple of sessions especially if you have had alcohol in the days previous to the session.</p><p>After some  more sessions I never felt like vomiting, althought I did feel intensely cold even though I was covered up I kept shivering, I  could hear the ringing of bells and every time I heard them my experience peaked to a new level, like waves crashing on the shore, although  I am short sighted I could see every detail in crystal clear clarity. Smiling a lot in one session, crying uncontrollably the next. During the session we were encouraged to ask any question, for which inevitably there were answers, previously I was not a very strong believer in spirituality, but these sessions helped me to come closer to my maker and changed some facets of my personality for good.</p><p>Some sessions I felt detached from my body, found myself looking  at the other participants from above floating, happy, connected to mother earth, I could if I wished  travel into the leaves and roots felt the energies and auras.</p><p>After the sessions which lasted a couple of hours, they were then closed with further incantations and we were free to eat or talk, the next day I felt completely energised, did not feel like smoking a cigarette or drink alcohol for many days if not the whole week.</p><p>On the whole a throughly life changing, experience.</p>",
 "year": "2000",
 "id": "47451",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-01-28T08:00:00.000Z",
 "views": "12360",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "90 ml",
   "administration": "oral",
   "substance": "Ayahuasca",
   "form": "(tea)"
  }
 }
}
