{
 "title": "It Altered the Very Essence of Who I Was",
 "author": "Warped",
 "citation": " Warped. \"It Altered the Very Essence of Who I Was: experience with Amphetamines (Adderall) & Paroxetine (Paxil) (ID 47529)\". Erowid.org. Jun 9, 2006. erowid.org/exp/47529",
 "substance": "Amphetamines (Adderall) & Paroxetine (Paxil)",
 "bodyweight": "144 lb",
 "report": "<p>To give some background, I have been on the following drugs; Adderall, Ritalin, Focalin,provigll,Staterra, Paxil , Lexapro , prozac , abilify and ambien, Id also like to note, that I am only 18.</p><p>I have quite an extensive experience with many of the effects of various meds. My difficult experiences on these drugs have led me to almost obsessively learn about drugs and their effects, I do this in hopes of maybe reversing the permanent damage I seem to have inflicted due to these drugs.</p><p>Sometime in the middle of 8th grade I was prescribed the drug adderall. My mom was attempting to correct my problems in school. I was forgetful, disorganized, spacey, and it was extremely difficult for me to sit down and do my homework. I was not the stereotypical *off the wall* ADHD child, I had self control in that respect, I just had the general focus problems I listed.</p><p>So with me being essentially indifferent about the situation, I callously took that blue pill for the first time and went off to school. I started noticing that I was feeling really *good* during my first period class, for whatever reason, I never correlated it to the drug though. I thought the drug was just suppose to make me concentrate better and thats it, I really didnt expect euphoria. I was really ignorant of the drugs effects, I just figured I really liked my 1st period class, since I was intensely interested in every word that tall, long necked man was saying, nope I never attributed the *happy feeling* to the drug.</p><p>So I was on ten milligrams of adderall and everything was going fine. The only side effect I seemed to exhibit ( I didnt even think this was the drug either I just thought I was crazy) was this vocal tick, where I would feel forced to make this weird noise, it was almost like an Obsessive Compulsive thing. People thought I was weird, they thought I was nuts, but oh well, I was focused and more productive, and really didnt even notice being on the drug.</p><p>This successful trial of the drug, was quickly ended. What was about to happen was going to set a horrible chain reaction resulting in me going through the trial of 8 other psychotropic drugs, it was in direct relation to the psychiatrist's next move.</p><p>The psychiatrist thought itd be a good idea to raise the dose from 10-20 mg, this apparently changed everything. My body had a limit, 10 mg was sufficient, it just couldnt tolerate 20. With 20, of course came noticeable side effects such as the *crash* which is one of the most unpleasant things I have ever experienced, but the main problem was my ability to tolerate problems and stress.</p><p>The adderall would amplify every situation 1000 times, it would make the most minor issue seem like a catastrophe, it would result in me ruminating endlessly about many things that just made me feel crappy. It was soon enough that I got myself in a significant enough quandary, to make my mood just flip out. I got in a fight with a good friend, and felt terrible afterwards. I felt that wed never talk again, and since he was one of the few friends I had, thatd be a pretty big blow. After this happened I was over analyzing everything, and looking at things from the worst possible point of view, I was irrational, the drug was making me over emotional, and this resulted in me going into a depression.</p><p>I waited a few days after the incident, made amends with my friend, but I was still sad. I eventually told my mom about my low mood and even she thought it was related to the adderall increase, since I became depressed about 4 days after the dose was increased. I stopped the adderall, but the depression was still there, it had already been triggered, and I needed a way out. It was then, I was prescribed Paxil..</p><p>With Paxil, I had pretty much the same attitude that I had with the adderall. I just thought this will make me feel better and took it, I didnt study up on it, I trusted doctors, they knew what they were doing, I felt I had support from my family, and that I could get through this. After about being on 10 mgs of Paxil for a couple weeks I saw no change in mood. Then came the increase, it was increased to 20 mg. On 20 mg of paxil I started noticing effects. I was elated, I was always smiling, my mood was high, I laughed at everything, I joked around and talked more then I ever had, I was no longer this shy, humble, person that kept to himself, my personality underwent a glowing transformation. I was doing things I never did before like, speaking out in class. I am going to list the effects I initially had on paxil.</p><p>Fast speech</p><p>I was more articulate then ever</p><p>More creative, witty</p><p>More talkative</p><p>Became interested in more sophisticated topics.</p><p>Amused easier, smiled a lot.</p><p>The paxil seemed to induce a borderline hypomania, it was no problem though, no one really noticed, not even my closest friends. They just noticed I was telling more jokes, more talkative, and much more fun to be around, I started getting invited out more, everything was cool.</p><p>Then all the life was sucked out of me.</p><p>I cant pin-point when this happened, I just remember I was concerned what the drug was doing to me. The hypomania stuff seemed to be going away, and I felt as though my identity was being sucked out of me. I just didn't feel the same. I was deathly scared that Id be like this forever. Here were my side effects, that manifested themselves after being on paxil for about a year and a half.</p><p>Slow Thinking- I would often talk to a person, and my thoughts seemed to be going in slow motion. Theyd often ask me something or say something and Id think of what I wanted to say back minutes later, when it was to late, this happens constantly today. ( never happened before the meds, Id like to STRESS)</p><p>No personality- I can't seem to relate to people anymore. I dont seem to have anything to say anymore, or when I do its to late. Me and my best friend use to talk for hours on the phone. Now were lucky to draw out a 15 minute conversation</p><p>Typical side effects.</p><p>No motivation - I use to have many passions, these have all been stricken from me. I use to play basketball for hours and hours and hours, now I play maybe once a week, I use to work out daily also, I never do that either.</p><p>No emotion - no emotion, I think that ties into no motivation as well.</p><p>Horrible memory- I am lucky to have a normal conversation these days, its a daily obstacle. My head is scrambled. I cant even remember other stuff.</p><p>Of course when experiencing this, I tried to get off the meds, but I had the following problems. When I came off the SSRIS my personality became even duller I couldnt articulate my thoughts, Id often phrase sentences the wrong way, like for instance * I have gum on my shoe* Id say * Gum have I on my shoe* ( thats a terrible example actually) I felt so slow, and incoherent.</p><p>( Id like to note, that upon coming off the paxil, I felt a period of normalcy. It was when the drug was depleting from my system, I thought my old self was returning. But that just lasted briefly)</p><p>So, trying to rationalize this situations and steer it * away * from the possibility of brain damage, I convinced myself that, the paxil just stopped working ( which it can) and I just became depressed again, ( even though, I really didnt feel depressed) I looked endlessly over the internet trying to validate my theory, looking to see if depression can be the cause of what I was experiencing, I talked to my psychiatrist, and he pretty much laughed when I floated the possibility of brain damage, thats it, its depression again. I decided Ill just go on another SSRI, and Ill be fine.</p><p>This started my trial of lexapro. When the Lexapro climbed in my system I felt like the old me again.. But when the dose stabilized, I felt unmotivated, emotionless, all the side effects returned. The only time when I feel any sense of normalcy is when I increase or decrease the dose suddenly. I feel somewhat normal, but only briefly but it really isnt a sure fire thing I just play around with the dosage and Ill get a few ok days.</p><p>In this space is years of me complaining about the drugs, talking to the psych, my therapist. None of this resolved anything</p><p>So here I am, I am 18 years old, and I feel as if my identity has been visiously stolen from me, I just don't feel like who I originally was nor do I think I ever will, I believe I have changed for the worse, and these changes will effect me down the road as my ability to relate to people has been impaired. I would give anything to set my chemistry right again, I would do anything to be myself again.</p>",
 "year": "2005",
 "id": "47529",
 "gender": "Male",
 "timestamp": "2006-06-09T07:00:00.000Z",
 "views": "53758",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(daily)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(daily)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Escitalopram",
   "form": "(daily)"
  }
 ]
}
