{
 "title": "Infant Gnostics of Platonic Love",
 "author": "Staraflur",
 "citation": " Staraflur. \"Infant Gnostics of Platonic Love: experience with 5-MeO-DMT (ID 4752)\". Erowid.org. Jan 1, 2002. erowid.org/exp/4752",
 "substance": "5-MeO-DMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>* Onset (2-3 minutes)    </p><p>The setting for my first DMT experience was a soft blue room lit by a string of christmas lights draped around the perimeter of the ceiling.  My mindset was relaxed and high from a few bowls of Cannabis sativa earlier that evening.  The music was 'Shine on You Crazy Diamond', and the two DMT-experienced individuals in the room carefully instructed me on the gentle process of smoking DMT: </p><p>1.  Don't let the lighter flame touch the crystals.</p><p>2.  Hold the lighter on the substance for a good 30 seconds. </p><p>3.  Hold in your hit for as long as you possibly can. </p><p>My cosmic companion of entheogen-experiences was sitting across the room staring at me with psychadelic anticipation and warm support.  As I inhaled the vaporizing DMT crystals I began to hear a high-pitch ringing in my ears that reminded of a N2O trip.  The feelings that followed, however, were nothing like nitrous. I felt as though my entire being was concentrated within my eyes, and I was quite displaced from my somatic self.  I was not only admiring the most admonishing beauty in the universe, but also I was completely aware that I was an integral part of the complexifying function of this insanely beautiful existence called life. </p><p>* Peak (10-12 minutes). </p><p>'Oh my God', my words sounded strange like they did not really belong to me as my essence began to renter the room.  'Here dude, let me take the pipe from you', a friend offered. As I was forewarned I was not getting any real visual hallucinations, but instead overwhelming waves of the purest emotions combined with an intensely over-stimulated brain.  During the previous few minutes I was completely unaware of my present surroundings including 'Wish You Were Here' which I was just now deciphering as a familiar album.  The pulsating frequency continued to resonate through my eyes for the next ten minutes as my jaw dropped in astonishment at the way I felt.</p><p>Falling like a gentle leaf down, I began to talk more about the things that I was still experiencing as I began to feel completely relaxed within a new defintion of contentness.  It was difficult at first to remember what had just happened as the waves of emotion broke the the walls of my concentration. </p><p>The whole experience lasted approximately 20-25 minutes.  It was different than the common psychadelic experience of psilocybin and lsd-25 in that I never recieved an impression of the presence of a higher mind, or what Terence McKenna calls the Transcendent Other.  I did feel like a slightly aware citizen of the collective consciousness along with complete connectedness with the most loving and sentimental part of this universe.  The relaxed high of the later portion slowly slithered away from my brain and left me feeling more sober and stable than when I started.  </p><p>I have smoked 5-MEO-DMT a total of four times, including this first experience, and everytime I seem to absorb the feeling of breath-taking beauty on a deeper and deeper level within my most cherished parts of my psyche.</p>",
 "year": "2001",
 "id": "4752",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-01T08:00:00.000Z",
 "views": "8751"
}
