{
 "title": "In the Arms of Psilocybin",
 "author": "Miganis",
 "citation": " Miganis. \"In the Arms of Psilocybin: experience with Mushrooms (P. cubensis) (ID 4753)\". Erowid.org. Jan 4, 2002. erowid.org/exp/4753",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "150 lb",
 "report": "<p>I consumed the dried and powdered mushrooms at approximately 11:00PM on a Saturday night.  My two friends, Dan and Allison, had also consumed some powerful psychotropics, Psilocybin and MDMA, respectively.  The first hour and a half of the trip consisted of a visit to the casino.  Bright lights and soft comforting sounds filled my brain with psychedelic mind candy.  Pink lemonade and cigarettes were my new love affairs as I wandered through the rows of brightly colored machines.  Eventually we departed the casino and headed home.  I was starting to feel the peak come on and I began to prophesize the possible dangers of operating an automobile.  With this in mind I took a fat resin hit from my pipe (which had been coated by seven bowls of nugs the night before).</p><p>This is where the trip really began.</p><p>The drive home was fairly uneventful and we reached my friend's house safely.  I received a phone call from one of my good friends while I mingled in the dark kitchen enjoying the interplay of lights and shadows on the wood floor.  I made my way to the basement where things became pretty intense.  We turned out the lights and I began to dance to the techno trance emanating from the stereo speakers.  I could feel the music travel through my limbs and my blood pump faster through my veins.  My body felt so full of life and wonder.  I looked at the ceiling and saw my shadow staring back down at me.  I reached out and shook my shadow's hand and then he extended his arm around to pat me on the back.  I felt an amazing connection to my own self through this.  My shadow was a huge three-dimensional figure representing me.  It was much more intense than simply looking in the mirror because it was like I was faced by another version of myself.</p><p>I played with my shadow for half an hour and then proceeded to swim through the darkness and roll around on the floor through fractals and spirals of color.  We put on some Pink Floyd and I sat in the corner and contemplated my existence.  I thought about how beautiful all of my friends were on the inside and how much I loved my family.  I felt the plants and trees outside connecting to me and I could feel the life force of the planet.  I balanced upside down in the 'tripod' position and laughed hysterically, bathing in mushroom ecstacy.  I made patterns in the darkness with my lighter and watched the afterglow patterns morph and sink into the ground.  We turned the lights on and it was like a pulsating star exploded within my vision, sending bright patterns of light everywhere.</p><p>I said my farewells to my friends and decided it was time to go home and attempt to sleep.  It was now approximately 3:00AM.  I put some Aphex Twin and Moby into my disc changer and listened to the infinitely complex beats of Aphex Twin and created intense patterns of light behind my eyes (it was absolutely incredible).  I listened to Moby next and I had a vision of my entire life being presented for me to review and interpret.  I saw my birth, my mother crying, my casket being lowered into the ground and my children crying.  I began to cry.  It took hold of me and sent amazing waves of emotion through my whole body and I think that I experienced bliss.  I sat in the afterglow of this event, bathing in the immense beauty of life and the amazing powers of psychedelic drugs.</p>",
 "year": "2001",
 "id": "4753",
 "gender": "Male",
 "timestamp": "2002-01-04T08:00:00.000Z",
 "views": "40286",
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ]
}
