{
 "title": "Surrounded by Demons",
 "author": "The Owl",
 "citation": " The Owl. \"Surrounded by Demons: experience with Mushrooms (ID 47567)\". Erowid.org. Jun 20, 2006. erowid.org/exp/47567",
 "substance": "Mushrooms",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Mushrooms - P. cubensis",
  "(tea)"
 ],
 "report": "<p>O.k. so me and 2 other friends decide to do some shrooms, for me like the 10th time, and for them the first. We're all between 23-26 years old. Roughly 2.5 eighths in weight of some killer goodness steamed in tea, then drank and ate what-ever was in the tea.</p><p>Location: Forest in Illinois</p><p>O.k. so this is like April/May 05' and we're wearing jackets, we have beer, and a nice sized boom-box with a bunch of weird psychedelic CD's, mostly new age weird experimental stuff and meditation CD's) So we just ingested the shrooms before entering the forest, roughly 10 minutes in, we can all feel it kicking in faster than usual. About a mile in, it hit me so hard that I couldn't walk anymore, neither could the others.....so we stopped at a huge fallen tree where we sat.</p><p>O.k. everythings cool, we put on this weird experimental tape that I found in a 2nd hand store...no titles...just really weird music. The usual happens, fluidity, it felt and looked as if I had crystal fluid glasses on because my vision was fine but felt like looking through a cartoonish type translucent lense. This was new. THIS TAPE is incredible, it was shocking to hear this type of oddness. Everything's good, until the inevitable!!!!!!!!!</p><p>About 30 minutes into the trip. I'm still sitting on this log, the other's standing up. I look to my left, and my one buddy is intently staring into the woods with his flashlight, as if he sees something. I tell myself....he's a funny 1st timer, I look at my other buddy and he's staring in the opposite direction at something as well. I'm thinking to myself, these amateurs, until I quickly realize 2 balls of light 1 red and one white floating in between the tree's close to each other but separate movements real slow. My 1 buddy was staring at them, and I quickly scanned my mental vault on all my previous experiences, never finding any oddities like this. Since I was a seasoned tripper, I never ever found myself seeing outside self sustained illogical forms with their own personality, at least not on shrooms and never to a point where we're all seeing the same thing.</p><p>So I'm keeping an eye on the balls of light, roughly 40 yards in front of us, and I instantly look back to the 1st friend staring off into the woods. I follow his stare to find that there are some kind of entities hiding behind the tree's in the other direction and making noises by stepping over twigs and leaves, also roughly 40-50 yards off. So I do two things. First I ask the buddy what he sees in the tree line and he points to the 2 balls of light still floating in between the branches. I then ask the other buddy what is he seeing, and he mentions the strange beings hiding behind the tree's. He points one out as it moves from behind one tree to behind another tree closer to us, and we all see it move, roughly 5 feet high and odd shaped, slender, and definitely not a person.</p><p>The adventure begins. I could sense an evil energy or presence from these beings and so could the others. We decide to leave and as we try to make it back to the path, we find ourselves skipping time, and no matter which route we tried, we always ended up back where we started from. The time skipping went something like, I would mention something like 'is this the right way?' as I stepped on a twig cracking it, then instantly, we're back to that same moment of me asking the same question, snapping the same twig. Instantely we all stop and ask ourselves if time just skipped. Logically we come to the conclusion that it's illogical, but quickly fin ourselves repeating various skips and always ending up in the same original place. We decide it's no use, we must be in a time warp.</p><p>As we sat back down on the log, we could see that there were now close to 20-30 of them, and we were starting to see flashes of dark red lights that would come on and illuminate roughly 10 foot diameter circles of areas in the forest. This happened 3-4 times around us...maybe 10 yards away. This area was illuminated as if someone turned on a red light bulb, but we could never find the light bulb or source of the light. They would stay illuminated for roughly 5-10 seconds and would scan the ground area for 1-2 yards.</p><p>Earlier in the trip a 4th friend was supposed to join us and said that he would drop by to see how were doing and have a beer. We roughly remembered that he was dropping by soon, as luck would have it, he calls just when we make the realization of this time warp and red illuminations. He's in the forest and walking toward us so we direct him over the phone. Finally he finds us and we tell him everything. As we're telling him the story, the 4 of us (one of us is not shrooming) still see a bunch of something in the distance (a litlle further now than previously) and we hear an evil shriek laugh above in the tree lines, clearly not the sound of 2 tree's rubbing against each other. It was an intelligent laugh. The 4th non-shroomin dude is like, 'I'm outta here, follow me since I know the way out.'</p><p>I couldn't walk. Something was keeping me there and my mind was skipping time again. I told them I'll be right there because I still had to grab my boom-box and beers, but by the time I picked them up, the 3 of them were out of site. I yelled to them, and they yelled back, 'Just run over here.' I tried and still trying to follow their voices time kept skipping and I kept ending up in the same place. That was it. I stayed and had to figure out what to do next.</p><p>So I'm standing up in the middle of the original spot, and as I look, I can clearly see these evil demonic looking dragon type beings closing in on me and all around me. It seemed like hundreds of them as far as I can see. 50 yards, then 40, then 30, then 20. It begins to rain on me and thunder a little. I make a realization that I'm going to have to fight my way out of here, my only chance of survival. I took my leather bomber off and started stretching my arms and back for battle. I felt extra strength and made a realization that I should pray for divine intervention.</p><p>They close in so tightly that I can see the white of their eyes, faces distorted and dragon like, each one with a different look to it. As I prayed and began to spin around in circles trying to anticipate which one would lunge first, my next realization was to really ask God for a favor. Under my breath I asked God to help me out in this situation and I asked with as much faith as I could muster.</p><p>Then instantly, the sound of a train, since there is a train yard close by. But this one was extremely loud. The rain stopped and while I did not know what was going on, I noticed these demons were moving back a little. Instinctly I knew God was sending some-one to help me. I actually thought I was going to meet Christ or some arch-angel to get me through this. I waited for the arrival, when lo and behold, I hear my buddy in the distance yelling out for me. 'Where you at?????' 'I'm over here'........So he meets up with me and the first thing he says is.....'just look down, dont even look at them and follow me.' I asked him if he knew the way out and he obliged. At this point the trip is over for the both of us, but we still see 'them' amongst the trees as we make our way back.</p><p>Since that day, the 3 of them don't even want to discuss this day. While we have all shroomed after, they have purposefully tried to etch this out of their memories. Still I get it out of them every once in a while. Small details here and there. After extensive research, I found out that...this particular area was the scene of 3 dead bodies of young boys back in the 70's called the famous Schuessler murders. Also these areas are rich with cult activities from the last 4 decades. I am now changed and obsessed with God over this one experience.</p>",
 "year": "2005",
 "id": "47567",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-20T07:00:00.000Z",
 "views": "3447",
 "dose": {}
}
