{
 "id": 4758,
 "title": "Beware of Shower",
 "date": {
  "submission": "2004-01-16T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "JRHuffNStuff",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "plant material"
  },
  {
   "time": "2:00",
   "amount": {
    "number": "5",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "flowers"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco"
  }
 ],
 "report": [
  "First off, I am 19 years of age, I used to just smoke weed, but soon I was awed by the many reports of my friends of what they experience on mushrooms, acid, and other substances that caused visual and auditory hallucinations.  It wasn't long before I decided that I needed to try these substances, I tried, mushrooms, DXM, 5-meo-amt, and a few less potent substances (nutmeg and the like).   So I am pretty knowledgeable about these things now, and for the life of me I never saw this coming, as often is the case with psychedelics.",
  "I started off the day very early as I worked at UPS at the time (End November) around 3am in the morning, after work I went home and slept alittle, I got up again at 2 in the afternoon and went to my old school to take care of my college transcript, and recieved 90 dollars from my dad.  I told him I needed it for a processing fee, which was a lie, but I don't like my father so I felt no remorse at this.  After all of that I returned home and called my friend S, who told me that he found someone who could get me some really kick ass mushrooms.  I quickly agreed to this and met up with him around 4 in the afternoon.  We then went to his friends house G.  She gave them to me with the assurance that they were quite potent.  After this I went to my house with my friend.  When I got home, I got in a fight with my sister over my use of mushrooms, and not paying her money this week.  I walked away from that arguement feeling no negative feelings, but it still may have had a huge impact on my trip. ",
  "Another important factor was soon to play out, at first I didnt plan on taking them that day, I was supposed to wait for my friends to trip with me, but I couldn't wait and downed the 4g of the mushrooms, which considering the circumstances of the day was a REALLY bad idea.  About 20min later I was hit by some uncomfortable coming up symptoms of nervousness and twitchyness, but was otherwise just getting giggly and euphoric.  At about 40mins in I was starting to get some good visuals and S said that his friend needed a dime(I had some personal I was willing to sell), so I decide to go with him(WTF was I thinking?).  When I got outside I realized that I was starting to feel it alot.  All the cars in my lot were out of proportion, like they were flattened by a crusher, and trees were very animate, it looked like they were all stretching thier limbs torwards me to grab me.  I started getting this erie feeling like it was a horror movie.  After all, I was outside, and it was very dark in the fall, no one was outside, and it was almost dead silent (No leaves on trees), not to mention the sky was rolling as if it was waves.  It made for quite a chilling scene. ",
  "We made it to his friends house who luckily only lives down the street from me.  When I got there I was the only one shrooming, and everyone else was very ghetto, and were all talking very gangster like, which made me instantly more uncomfortable.  The dude I was selling to seemed to notice this and called me inside (TIME: +1h10m).  When we got to his room he said, 'Yo man, what are you on, you look supremely geeked'  I said I would be ok and sold him the dime.  My friend S wanted to stay, so I walked back to my house alone, and noticed that everything still looked fucked up, but even more so.  Upon returning to my room I was greeted with some awesome visuals of my posters melting into the wall, letters jumping around when I tried to read stuff, colors of all kinds flowing around my room.  I thought I had already peaked, but I was SOOOO wrong.(TIME: +1h45M)  I called my friends, who wanted to shroom with me, but hadn't taken their's yet.  So they came over and took a very small dose compared to mine, and we all rolled a blunt with the collective weed we had. ",
  "Now keep in mind I had this blunt rolled because of my thinking that my trip was leaving soon, but what I didn't know is that it was just a really harsh comeup.  This became clear to me when I hit the blunt like 5 times.  I looked around the room we were smoking in and realized something had gone seriously wrong.  Everything left a streaking trail of whatever color it was when it moved, my cat had no legs and was trailing out the bedroom door, everyones faces started doing odd things and I couldn't handle it after a while, because the visuals got way too out of hand(Too many to handle at a time).  So I abruptly left the room, and went into mine, stood in the middle of the room, and then realized that I was peaking, plus I was blazed.(T +2h30m).  Oh SHIT, I'm FUCKING PEAKING!!!!, I exclaimed really loudly.  My friend who was in the room at the time looked at me in sheer fear, I've never seen him so scared at me before.  I then for another unknown reason, screamed at him to get the fuck out of my room..... NOW!!!!   He ran out of my room pretty fast. ",
  "I sat there for a time trying to reason myself out (I believed my mind was being poisoned), but to little avail as my ego had long ago started flushing itself out.  I eventually came to a shaky sanity and walked out into the living room to apologize to my friend, who was quite upset with me as he is homosexual and harbors some odd feelings for me, which I a strictly heterosexual person didn't understand. Also he didn't understand that on high dose mushroom trips it's hard to keep in full control no matter how experienced you are. ",
  "(T +3h) For some reason I decide to take a shower, I will never know why, I just decided to, little did I know it would be one of the biggest mistakes of my tripping career.  I got in the shower and sat down and turned on the water, as soon as I did the intense noise of water rushing caused the entire world to shake and move on me causing intense discomfort and mental anguish.  It paralyzed me completely, and to make it worse when I touched the water, I started MELTING, now I don't know if anyone has ever experienced the melting feeling before, but you don't just see yourself melt, you FEEL yourself (Bone, muscle and skin) melting and before I got used to it, it was very painful.  And when I felt myself start melting down my shower drain I started losing it.  I tried to get out of the shower only to fall down when my 'water' legs gave out from under me, I was still naked and odd hallucinations of extra limbs in odd places could be seen and felt and it was starting to weigh in on my already battered Mushroom induced psyche. ",
  "I managed to put on clothes, which eliminated the extra limbs feeling, but I still felt like I was falling apart my skin was crawling around on my head, pieces of my lips were falling off, and my limbs bent and streched in odd positions.  I finally got out of that fucking cursed bathroom and sat down with my friends in my room still with the feeling that my body was oozing around and falling apart. (T +5h) I finally came down a little, but then I got stuck in a loop of words with my friends, which I couldn't get out of till the left, stupid stuff, like how to not think about not thinking, really tripped out things, I noticed something very important about hallucinations when they left however.  When they left my hallucinations became more intense because I didn't have that hold on reality anymore, so it was amazing to see what I could make happen.  After watching alot of Adult Swim I decided to go to sleep. (T +6h30",
  "The next day I awoke feeling great, and filled with a new sense of being. I had no adverse side effects(I never have)",
  "One thing I learned about mushrooms, no matter how many times you use them, must always have great care taken when using them, you never know what's going to happen until you take them, and then it's wayyy too late.  Also the shower is no place for a person who is peaking on mushrooms....... :)",
  "Take care of yourself, and use care, everyone is affected by everything differently, don't be discouraged from doing mushrooms by reading this report, and don't be encouraged, you may have a better, same as, or much worse trip than me at the same dose, so do a small dose until you figure out what's right for you, also if you are scared easily, I would stick to weed, these are for those with mental strength, which I now am sure I possess."
 ],
 "erowid": {
  "id": "30078",
  "citation": " JRHuffNStuff. \"Beware of Shower: experience with Mushrooms & Cannabis (ID 30078)\". Erowid.org. Jan 16, 2004. erowid.org/exp/30078",
  "substance": "Mushrooms & Cannabis",
  "views": "8245"
 }
}
