{
 "id": 4759,
 "title": "How MDMA Lost It's Magic For Me",
 "date": {
  "submission": "2000-11-04T08:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Blazinbecciestarlite",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Rolls (E, beans, whatever you call them) lost their magic for me REAL fast.  the first time I took one, I was in heaven.  Like it says on the effects page, I wanted nothing more than to come off and eat another one.  I thought 'this is how i want to feel ALL the time.'  I was super confident, funnier than usual, very open, sweet, and of course, the 'I love you, man...'   It was sweet. ",
  "But soon after I needed two to get me where one took me.  ridiculously (may I emphasize RIDICULOUSLY) soon after, 2 wouldn't cut it and I'd need three.  When you're in highschool and mooching off your parents... wasting anywhere from 30-60 bucks in one night (maybe more, depending on where you're going, what you're doing, etc...) can raise a lot of questions for your parents.  Besides, no one wants to be wasting that much money chronically and not have anything to show for it. ",
  "On TOP of all this, they just weren't putting me in that wonderful place anymore.  I'd be at that peak for 5 minutes then come down and be real depressed then peak up again for another 10 minutes and then back down.  It was an emotional rollercoaster of the worst kind in a pill.  And the mornings-after just kept getting worse and worse.  I felt absolutely brain dead after a while.  I didn't wanna turn into some of my friends who've taken way too much E and is evident in their behavior, slow talking, and new-found slurs. ",
  "That's how rolls lost their magic for me.  *tada*"
 ],
 "erowid": {
  "id": "3008",
  "citation": " Blazinbecciestarlite. \"How MDMA Lost It's Magic For Me: experience with Ecstasy (ID 3008)\". Erowid.org. Nov 4, 2000. erowid.org/exp/3008",
  "substance": "Ecstasy",
  "views": "9245"
 }
}
