{
 "id": 476,
 "title": "No Pleasure...",
 "date": {
  "submission": "2003-12-02T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "FoolBinger",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "12 tablets",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": ""
  }
 ],
 "report": [
  "After reading about someone taking dram and caffeine, and taking into effect how easily accessible each drug is, I decided to give it a whirl.  Another factor was that I can never stay awake when on dramamine, and it kind of ruins the experience.",
  "Unlike the other report, im not sure if it makes a difference or not, but I took the caffeine first.  400 mg in all.  Then I downed the dramamine (all 12 at once) about 5 minutes later.",
  "I waited and waited for the dramamine to kick in, but no luck.  I began to get very sleepy.  So after much struggle to stay awake, I finally gave in.  I went and laid in my bed and fell quietly asleep.",
  "Throughout the night I woke up and was talking to people, dogs, other animals, the floor, etc... and then I'd realize that it was the dramamine and stop.  Then I'd fall back asleep and do it again.  This repeated all night long.  Not exactly enjoyable, especially when you wake up talking to people and they just disappear on you.",
  "The next day I was very tired.  But something was wrong.  I had pains in my chest.  Right in my heart.  Everytime I breathed deeper than normal it hurt.  Sometimes it just hurt... it almost felt like my heart was tired or something.  And it was beating irregularly.",
  "It has since stopped and so has the pain, but it persisted for about a week.  That was pretty alarming.  I won't be repeating that again."
 ],
 "erowid": {
  "id": "10905",
  "citation": " FoolBinger. \"No Pleasure...: experience with Dimenhydrinate & Caffeine (ID 10905)\". Erowid.org. Dec 2, 2003. erowid.org/exp/10905",
  "substance": "Dimenhydrinate & Caffeine",
  "views": "11073"
 }
}
