{
 "title": "Dreaming Awake",
 "author": "Preston",
 "citation": " Preston. \"Dreaming Awake: experience with Zolpidem (Ambien) (ID 47625)\". Erowid.org. Jan 9, 2007. erowid.org/exp/47625",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "145 lb",
 "report": [
  "<p>I was feeling bored one weekend so I decided to try out a pill I had been given a while back. Let me just say now that I had never successfully tripped before this night. I had read reports of hallucinations, and reports that didnt mention it, so I didnt really know what to expect as I ingested 15mg of the strange new drug.",
  "Just as the reports had said, this drug kicks in fast. Within 15 minutes I felt the beginning affects, I expected it to be hard to stay awake, but I felt very little drowsiness.",
  "Now that my little experiment was in motion I decided to lay on the love sac (for anyone that doesnt know, its like a giant soft been bag) completely still, to see if I could feel anything different. I did. I knew the affects were starting to strengthen as I started to feel the love sac poke and prod my legs. Then I turned onto my belly and looked at my wooden floor, it was melting away in the direction of the grooves, and also parts would rise and fall. I looked down and a wood right in front of me swelled, so I decided to push on it with my thumb, it went back down. I could actually touch these hallucinations, I could feel my finger sinking into the floor.",
  "After a while, I got up and walked to my room to fetch the other 7.5 mg, and I noticed parts of the floor would rise under my feet making it hard to balance.",
  "I eventually returned to the living room and sat down at the computer by the love sac. I looked back, and the love sac was breathing. I turned on the tv, I felt like I was in the same room with all the laughing people. So when they would laugh, even if I wasnt watching the tv, I would laugh too. Next I remember having a crazy grin on my face as I proceeded to break the pill into many different pieces (I dont know why I did this, seemed like a good idea at the time). I then ate the little pieces one at a time for about 3 minutes.",
  "I then signed onto instant messenger and typed things to my friends. Crazy things like I hin te flor is tring tu drag he lov sak away. It became even harder to have these conversations as the other 7.5 mg kicked in. For example, as I would type the sentence would get further and further away (sort of like in the beginning of starwars). I found myself with my nose against the screen trying to read what I was typing. Well anyways, my friends must have thought I was out of my mind. 10 minutes later, I was seeing people in my peripheral vision, laughing on cue with the people on tv and pointing at my computer screen, I would laugh too, and nod in agreement to whatever the hell they were pointing at.",
  "Looking around the room, I realized every inanimate object was moving, my pants on the floor, my soda can, they all had souls, and did whatever they wanted. I then decided that it was time for a cigarette, so I went outside and lit one up. Looking around, and examining myself, I decided I had most of my mind back. My senses were still crazy though. Then, I looked at my dads truck. It looked like there were people in the car, robbers I presumed, about 10 of them. But I knew in my mind that this must be fake so I walked up and they slowly faded away, except for one which shrunk and I looked it in the eyes (I now think this one was my reflection).",
  "After that, I took a step back and looked at the truck and it was moving up and down, like it was on hydraulics, but much slower and much much smoother. I sat staring at the mass of machinery which now had life, this is when I decided that this was definantly a chaotic trip, everything had its own agenda, and there wasnt shit I could do to stop it. I suddenly felt insignificant compared to everything around me.",
  "Next thing I know its 3 in the morning, and I can just faintly remember the 4 hour trip, almost everything was back to normal, except the floor and lovesac.",
  "Overall, I enjoyed the experience. But I dont think was wise to ingest a dose over 15 at once my first time. It kicks in so fast, theres enough time to up dose. Good luck.</p>"
 ],
 "year": "2005",
 "id": "47625",
 "gender": "Male",
 "views": "50349",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:30",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2007-01-09T08:00:00.000Z"
}
