{
 "title": "Freak Out!",
 "author": "ReDragon",
 "citation": " ReDragon. \"Freak Out!: experience with 2C-T-7 (ID 47642)\". Erowid.org. Mar 6, 2007. erowid.org/exp/47642",
 "substance": "2C-T-7",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "6.0 mg",
   "IV",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Put about 12mg in a spoon with 30 units of water. Put lighter under spoon, all disolves well and clean.</p><p>I think that this may be a bit much for a first try via this route of admin. so I shot about half and waited... I didn't have to wait long! Think like being on 50 acid tabs at the same time in 30 sec short, with still a needle in your arm and all the coulors of the rainbow riding waves and plusations over what would otherwise be my sink if the object I percivied were the actual objects themselves.</p><p>I got anough control over my self to take out the seringe, cap it, put everything in a bag and threw it at the bottom of the medecine cabinet. The next hour or so was hell, physically and psychologically; I vomited 3-4 times and it seemed to help. My body seemed hell-bent on getting rid of all that nice mucus I had stored up from years of smoking; and in those times, let me tell you; what the body needs, the body gets. So with all the mucus, the vomiting and the fear of dying, it got pretty disgusting.</p><p>Psychologically, on the other hand, I would say that it was a very interesting and worthwile experience, just start with WAY lower dosages than I did when using the IV route. Be accompanied by someone who is qualified to detect signs of trouble before trouble does arise. In my case, I was lucky. A good milligram scale is a must.</p><p>Ciao, it is 4 and a half hours after, I can still feel it, but it's now 95% over, so good night lads and lasses,</p><p>Believe in the Day</p>",
 "year": "2005",
 "id": "47642",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-06T08:00:00.000Z",
 "views": "6820",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6.0 mg",
   "administration": "IV",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 ]
}
