{
 "title": "Tapering Off to Avoid Withdrawal",
 "author": "YS",
 "citation": " YS. \"Tapering Off to Avoid Withdrawal: experience with GHB & Citalopram (ID 47659)\". Erowid.org. Dec 9, 2005. erowid.org/exp/47659",
 "substance": "GHB & Citalopram",
 "bodyweight": "129 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "GHB",
  "(daily)",
  "",
  " ",
  "",
  "Pharms - Citalopram",
  "(daily)"
 ],
 "report": "<p>I am currently undergoing GHB withdrawal, after 3 months of around the clock 'auto-dedication'. As I am afflicted with anxiety/panic disorder, I noticed that GHB was more effective than benzodiezapines (Xanax) at eradicating any form of attacks, and was definitely a social facilitator. I was under trial for a mild dosage of Celaxa antidepressant, but it did not significantly reduce panic attacks. GHB seemingly has the calming effect of Benzos without the weakness (problems performing in sports) I also found that it altered my memory less significantly in the context of studying (neurobiology, how paradoxical.)</p><p>But seems like a miracle soon turned into a nightmare, as I found myself absolutely paralysed if not dosing every 1 1/2 hours minimum. Aside from becoming a serious financial fiasco, dosage became insane as it basically took overdose to do away with withrawal symptoms. Lower dosages would elicit withdrawal symptoms; hence I did overdose frequently, and everywhere (bus, school). At lower dosages on lower frequency, I experienced the following: insomnia (less than 3 hours a day), severe tachycardia, shaking, inability to speak, auditory hallucinations (voices), fever with intense sweating, severe dysphoria, severe confusion, amnesia, anorexia... and of course the initial anxiety/panic symptoms seemed to be multiplied by factor 10, and I became agoraphobic and stopped doing sports. Also experienced was increased appetite (but only under the effect), gastro-intestinal distress and disregulation of menstrual cycle. It was clear that overall neuronal activity was significantly disrupted, and since I did not manage to get any medical help (typically, the only response was inpatient detox for 2 weeks, but I wanted to save my semester) I had to taper off myself.</p><p>So I am now undergoing my second week of tapering. This may be informational to a few, since it seems to work.</p><p>Week 1: on the first day I reduced dosage by 50%, but not the frequency. I also took 0.5mg Xaxax morning and twice this at night to induce normal sleeping pattern, as a starting point. Also, I am taking Clonidine (0.1mg morning and night) for the tachycardia, which proved really effective. TO BE NOTED: do not undergo this unless under supervision, the symppoms quickly undermined my mindset when I got confused or hallucinated... I myself removed myself from my house and only took a minimum amount of drug with me.</p><p>The first two days were intense in sweating and confusion. But then I tapered off furthermore on a daily basis, by removing a half dose a day, then halving the Xanax, and so on.</p><p>I am starting week two with again a 50% reduction for two days undersupervision, and will thereafter not take anything for a few days until I can discontinue the benzos as well. I will keep the Clonidine and antidepressant (worthy to note that if you take any medication for any other condition that GHB addiction, or if you smoke cigarettes, or even if you drink, as is my case) these should be kept CONSTANT throughout the course of weening. If any of these should be ceased, it should be weeks after the last ghb dose.</p><p>I give myself a very good prognosis concerning the psysical addiction (I can feel it go away), but less so for the psychological addiction, since GHB will forever be bookmarked as a anxiety reductor/social facilitator. But one must remember the financial and psychological hell of picking up the habit when using to target problems of every day functionning, and only seeks to eliminate the WORSE ones. Nobody's life is bliss, and sometimes a problematic life is better than one spent spent in feelings of unreality...</p><p>Good luck!</p>",
 "year": "2005",
 "id": "47659",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-12-09T08:00:00.000Z",
 "views": "14872",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "GHB",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "Pharms - Citalopram",
   "form": "(daily)"
  }
 }
}
