{
 "title": "Next Time I Will Think Twice",
 "author": "Anonymous",
 "citation": " Anonymous. \"Next Time I Will Think Twice: experience with Venlafaxine (Effexor) (ID 47672)\". Erowid.org. Jun 20, 2006. erowid.org/exp/47672",
 "substance": "Venlafaxine (Effexor)",
 "bodyweight": "72 kg",
 "report": "<p>My doctor suggested I try this for mild anxiety/depression.  I was initially skeptical, since I have had depression on and off for a few years and in all my research have unearthed nothing but conflicting reports about the efficacy of current drug treatments.  It is my stated belief that anti-depressants merely treat the symptoms, not the disease itself.  Of course, if the symptoms are severe enough (e.g. suicidal impulses, self-harm) this may warrant treatment, and of course different people respond differently to drugs, so this is only my opinion based on my experiences.</p><p>I thought it over for a few days after getting my prescription then, during a period of fairly severe depression and sleep disturbance, took one efexor XL tablet after a meal, at about 22:00.  Having read the contra-indications and side effects on the enclosed leaflet that came with the medicine, I was fairly sure that I would be able to function more or less normally the next day.  I went to bed as usual at about 23:30, feeling completely normal.  I was able to get to sleep without any problems.</p><p>I awoke at about 04:00 the next morning and my immediate impression was that I was still dreaming.  My body felt strangely disconnected and I had the feeling that I was floating.  All my senses, particularly hearing, appeared affected.  I realized that I was in fact awake and that the efexor must have kicked in during the night.  I gave up any hope of sleeping further and went to the bathroom, feeling groggy and 'wired'.  My pupils, under the bright bathroom light, were extremely dilated and I looked pale and sweaty.  I was aware that I was clenching my jaw and fists spasmodically.</p><p>Despite not having slept any more that night, I decided it would be OK to go to work.  At least it would get me out of the house and into some fresh air as I walked to catch my train...  In fact the journey to work was an ordeal I would never like to repeat.  Once inside the crowded commuter carriage, I was aware of just how wired I was.  I felt extremely anxious, was grinding my teeth audibly, and having to avoid any eye contact with fellow passengers in case they saw my dilated pupils.  It basically felt like I was on speed, but with an associated 'spacey' feeling and increased anxiety.</p><p>Unfortunately I had chosen a pretty bad day at work to be in this state, as I was supposed to be meeting and greeting some important clients and showing them round our facilities.  I managed this with some difficulty, having to make up excuses for my obviously altered state.  It was hard to concentrate and my mind seemed unable to focus properly.  After lunch I gave up and took the rest of the day off.  My colleagues seemed to think it a good idea, since they had certainly picked up on the fact that I was acting strangely.  The rest of my day, up to about 23:00 that evening, was spent gradually feeling more tired and run down (similar to the feeling of coming off amphetamines), with associated muscle pain and stiffness.  I flushed the rest of my prescription down the toilet that night.</p><p>I don't think efexor worked for me. Admittedly, I am not suicidal, nor am I depressed enough to consider self-harm or experience other severe symptoms.  It's strong stuff.  Naturally, I'm aware that the first few weeks of any anti-depressive treatment are usually associated with worsening symptoms and the drug has a greater effect, presumably due to lack of tolerance. Personally, I'm going back to my tried and tested regime of exercise, social activity and professional psychiatric help to beat depression.</p>",
 "year": "2005",
 "id": "47672",
 "gender": "Male",
 "timestamp": "2006-06-20T07:00:00.000Z",
 "views": "18915",
 "dose": [
  {
   "time": "0",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(pill / tablet)"
  }
 ]
}
