{
 "id": 4768,
 "title": "Did I Just Do Something Bad?",
 "date": {
  "submission": "2004-01-17T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tony",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "6",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco"
  }
 ],
 "report": [
  "I went to my friends house yesterday to smoke along with 2 other friends of his, both who I knew. All together we had a good 25 sack. Then my friend Jeff decides he wants to call over some chicks. I don't know one of them and from the start she's being a bitch. She wants to put way too much weed in the blunt and then she doesn't even wanna cut it up real fine, she wants to use her fingernails. Whatever. I just wanna get high.",
  "So we smoke and already I'm feeling it. This was really strong stuff. I was trippin within 5 minutes. There turned out to be a total about 8 off us there. Three girls were sitting on a couch, one got up so I took a seat. I would stay there for very long. All of a sudden I am really getting high now, I don't know whats going on but I'm laughing at everything. So I look across the room and I see my friend Chester, and we're looking at each other and he's laughing, so I start laughing. Then he starts pointing at me and laughing, 'Jeff, look at this kid!'",
  "Thats when I can't remember anything. Everything got super slow. And every time I turned my head it was like I was looking at pictures on a wall. The 2-D effect some people say they have had. I turned my head and its like I was just looking at pictures on a wall, but they weren't completely frozen, just really slow....almost STROBE like. Next thing I know everyone is looking at me strange. The  2-D feel is gone, everything isn't normal, but I definitely know something is wrong. Everyone is looking at me funny, almost like I had just done something terrible. I laugh and am like, 'what did I do?' I turn to the two girl's next to me who are practically on each other from fright of me. There's a good 2 feet between us compared to the several inches before. One girl behind me says, 'Why is he acting retarded?' I start to feel really weird.",
  "Then I look across the room and this other kid is like, 'Dude, you talk funny. Don't talk anymore' I also heard the two girl's next to me saying, 'What is wrong with him?' Then I hear my buddy Jeff next to me say, 'Dude, do you want me to splash your face with some water?' I really have no idea whats going on. Why are they acting like this? One of my best friends is patronizing me. I just reply with, 'No, what did I do?' Then just like a FLASH everyone is talking. No one is focussed on me anymore, they are talking about something else, and its not like the conversation they are talking about just started, they are in the middle of it. I still feel like I did something REALLY stupid, or something I shouldn't have done. I felt like I had really disturbed this people, almost equivalent to if I had just killed a dog and ate it, those are the looks they were giving me. Could  I have suddenly lost all control of what I was doing and THOUGHT I was doing (I thought I was just laughing) and was really just tweaking out in spazms or something?",
  "I sat there for a good half hour thinking, 'What did I do?' I wanted to cry cause I felt so embarrassed. I turned to Jeff and began whispering to him, 'Dude, what the fuck just happened?' and he laughs and go, 'What? We've been just sitting here chilling' and I go, 'No dude, did I do something really stupid?' (Note that I am not smiling or laughing, I am in complete shock) 'No dude, we've been just chilling here' I kept telling him I felt really bad (my heart was racing and my legs were twitching) As the night went on someone hit me in the head with a pool ball (there's a pool table in the center of this room)  think I mightve blacked out, but I remember more of the people laughing at me, 'Oh my god! He's got a huge bump on his head!' My friend Jeff had me get up and walk around, one of the girls yelled, 'Dont' make him walk, he'll fall over!' I walked around hoping my high would go down, but It didn't. Everything was insane in my eyes.",
  "Things happened last night that I'm not sure if they happened or not. Could I have simply blacked out a moment when being hit in the head with the ball, then think of all the things that happened in the past, but DIDN'T happen? Like the 'everyone being in shock by me' Could that actually have been put in my head to appear it happened BEFORE the ball hitting my head? Could I easily have just IMAGINED all those things happening, but they never happened? When we would all get up to do something I'm not sure if that happened, cause  when we returned to sit down, everything we had gotten up to do was very vague, almost surreal as in, 'Did we just sit back down?' It was Deja Vu while returning to sit down. Everyone looked like we hadn't even gotten up (Again, listening in on mid conversation, but where did the conversation start? Did I make more stuff up in my head that I thought happened?) All I know is that I thought everyone was against me, I just wanted to go home, when I woke up with morning I felt better. But I still don't feel right."
 ],
 "erowid": {
  "id": "30114",
  "citation": " Tony. \"Did I Just Do Something Bad?: experience with Cannabis & Tobacco (ID 30114)\". Erowid.org. Jan 17, 2004. erowid.org/exp/30114",
  "substance": "Cannabis & Tobacco",
  "views": "11430"
 }
}
