{
 "title": "Technique is Everything",
 "author": "Drei2000",
 "citation": " Drei2000. \"Technique is Everything: experience with Salvia divinorum (10x extract) (ID 47694)\". Erowid.org. Aug 31, 2007. erowid.org/exp/47694",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>I had recently bought the a gram of the 10x extract of salvia divinorum leaves. That very day, I decided to try it and see if it really was all I expected. I packed a bowl (between 0.1g and 0.2g) in my friend's zong and I tried it. I brewed it slowly and I got two hits off it. It had a bitter aftertaste, but short of some tingling nothing happened.</p><p>However, only two days later, I decided to try another technique. This time, I lit all of it at once and breathed in very rapidly, pooching the entire bowl after my hit. I actually breathed out all of my air before starting to brew. After I took the hit, I held it in for as long as I could (about 20-30seconds) and very soon after, the room began spinning, much like being intensely drunk.</p><p>Shortly after that, I no longer actually saw reality. I was in a two-dimensional, outlined, bright coloured world. I myself was a carton and this entire world was made of rectangular pieces of plastic, all spinning, like the displays in older train stations. I felt that all over my body and soon, there was a rip in the page of my world. Everything outside that page was pitch black with tiny dots of light that I assumed were stars. I had absolutely no notion of actual time, because the only thing I was seeing, and actually being involved in was my cartoon world. I had two friends with me and they were about 2 meters away and the rip in my page was directed towards them. They were also cartoons and had otherworldly expressions on their face. I felt myself being moved towards them and I soon found myself on the very edge of the page. Only one of them was holding me from falling into the void of space.</p><p>I was told that I moved back and forth in the room quite a bit during my trips. I was also told they only lasted from 10-30 minutes. After the trip, I didn't even really remember what I saw and did in the trip. I was told I moved strangely (on my back but on all fours, they called it the 'crab walk') and after some time I sat down and said: 'OK, I'm done' and then be perfectly fine.</p><p>It felt incredibly intense and real and I was truly scared that I was going to fall off my page. During the trip, I completely forgot everything I ever knew in my life. I wasn't anywhere else but in the cartoon and knew nothing at all. I didn't much and was controlled by pre-determined moves or a superior force, the one that was ripping my page. At no point could I actually identify my real surroundings until I came out of it.</p><p>The onset was very sharp, the halucinations were deffinetly out of body-intense and coming down was fairly quick as well. The longest trip could not have been longer than a half an hour but it seemed like it was a past life. Or perhaps a parallell existance. I would deffinetly reccomend it, but I have to stress that you need to smoke it correctly for it to work. A sober or less intoxicated sitter is a very useful thing; I don't know what I would have done if I fell off the page.</p>",
 "year": "2005",
 "id": "47694",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-31T07:00:00.000Z",
 "views": "2499",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
