{
 "title": "Imagination Stimulated",
 "author": "EchoAssimilator",
 "citation": " EchoAssimilator. \"Imagination Stimulated: experience with Absinthe (ID 47696)\". Erowid.org. Feb 1, 2008. erowid.org/exp/47696",
 "substance": "Absinthe",
 "bodyweight": "166 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47696",
   "Male",
   "",
   "Not Given",
   "Feb 1, 2008",
   "21068",
   " "
  ]
 ],
 "report": "<p>Over the course of several occasions drinking absinthe, I have made the following observations:</p><p>The effects include a distinct euphoria that is different from that of codeine, cannabis, or alcohol alone.  The mental clouding of the alcohol doesn't seem to occur to as much of an extent although the influence of physical movement and such is still characteristic of alcohol and there is a certain lucidity, an ability to hold multiple thoughts and images in the mind simultaneously and synthesize ideas and theories from them.  There is also an increased rate of learning and ability to follow long and complicated streams of data.  Social skills are greatly enhanced as background anxiety dissolves and mental nimbleness and wit increases.  Imagination is also quite noticeably enhanced, with a somewhat reminiscent aspect of cannabis or salvia's effects in this respect in its result, but not its source or flavor/feeling-tone.  This can be described as a mild ability to make anything possible within the mind and then believe it.</p><p>Creativity is stimulated, allowing interesting connections to be made and original ideas to be synthesized which can be translated tangibly into drawing, painting, coming up with interesting mental constructs, word combinations, etc.  When mixed with cannabis, the usual background paranoia and anxiety is dulled considerably.  The imaginative effects of cannabis and absinthe superimpose perfectly, enabling complete engagement in cognitively interesting mental thoughts and pursuits, sometimes to such a great extent to lose complete track of one's surroundings more so than cannabis alone.  The other aforementioned effects also stack with cannabis.  This can be pushed aside when communicating with others or doing activities that require attention, as with cannabis alone.</p><p>I have bought two 0.5 L bottles of a popular brand Czechoslavakian absinthe.  The first I drank earlier this year (around 1/05 to 2/05) over the course of about a month, enjoying 1 to 3 drinks worth (1.5 oz each) on a friday or saturday night or both weekend nights until the bottle was finished.  At first, effects weren't noticed or felt very much.  After the 3rd or 4th occasion they started to emerge but not to an extent beyond what I would consider 'definitely different from alcohol intoxication but too weak to really describe very well, beyond simply feeling slightly more creative and euphoric'.  The former adjective can be illustrated by an occasion in which I had a spontaneous desire out of nowhere to paint which I hardly ever do, and the latter describes a feeling beyond alcohol's euphoric effects alone.  After the first bottle was finished, I decided to save the 2nd for another time.  I also decided absinthe is more enjoyable and better than alcohol, but not good enough to warrant the price.</p><p>I decided to partake in the second bottle several weeks ago on a friday night (10/05).  I consumed one drink after smoking up and drinking 1.5 glasses of whiskey and felt many of the effects described in the first paragraph distinctly ('Holy crap this stuff is strong.')  I poured a second drink and couldn't finish it I was so overcome with the combined effects of the cannabis and absinthe.  On three other occasions following this, some without cannabis and some with, I developed the above analysis of the effects.</p><p>In conclusion, I believe that it takes multiple occasions of consumption over a long period of time to begin to notice and appreciate absinthe's effects fully. Additionally, it helps to be well acquainted with the effects of equal volumes of alcohol (a couple drinks) upon one's psychology to be able to identify the effects even more easily.  Wormwood imparts a unique altered state which can be enjoyed alone or with other substances.  It ranks somewhere between kava and cannabis in its 'thickness' of effect, thickness meaning how much the altered state is with me at all times, like the difference in the effect on one's vision between looking through glasses slightly tinted red and deeply tinted red.</p>"
}
