{
 "id": 4771,
 "title": "My REAL First Time",
 "date": {
  "submission": "2001-12-16T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Alexander D.",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "I had dropped before but I only had half a tab of red snow. I went out to party but all I got was nothing, thought it was over rated.",
  "One weekend my friend asked me to join their group so I did. Once I got there they were handing them out so it took 1 new superman tab. The place was just a big living room with all the furniture pushed to the sides with mattresses on the floor with room enough to dance and a dj at the end, and was very dimly lighted. At first I thought that nothing was going to happen, but people around me were all suddenly peaking people fainting people hugging people spinning it was wild, all of a sudden the room came to life and everything started to feel better. I decided to get up from my seat to look around and thats when it hit me!",
  "I suddenly felt all warm and slight dizziness but that was alright. My friends walked up to me to ask if I was feeling alright and I said yes. Thats when the party really started picking up and I started to jump dance and move around. For someone of my build I do not dance at all, I'm more of a spectator but for that night I felt like dancing and didnt care what they were thinking.",
  "So I danced the night away with a feeling of over all goodness/wellness, I felt smug like nothing bad was going to happen, I mingled with the people made a new friend or so. The music seemed to keep getting better and better and there I was about to peak when my friends decided to take me for a spin. They spun me like I have never before been spun and now I know what it does it totally disoriented, adding to the already slight intoxication I felt from the pill. After that I took some time out to curl up with my girlfriend who I brought along who only after 10 mins was hit, while it takes me longer to feel anything thats why at first I thought it was over rated.",
  "To make a long story short the place, crowd, ambience, music and company made a world of difference. Only when I am away from all that hustle and bustle of daily routines do you feel this extraordinary sense of belongingness. The general mood of the night was that of joy and carefree. The people I was with were all on it and had lots of experience and they all understood what one can do on it so they did not react. I cant stress the point enough that it is the mood, company, and place that maximized the soothing effect."
 ],
 "erowid": {
  "id": "3013",
  "citation": " Alexander D.. \"My REAL First Time: experience with Ecstasy (ID 3013)\". Erowid.org. Dec 16, 2001. erowid.org/exp/3013",
  "substance": "Ecstasy",
  "views": "11685"
 }
}
