{
 "title": "Rockets, Pillows and Waves",
 "author": "The Flow",
 "citation": " The Flow. \"Rockets, Pillows and Waves: experience with 2C-B-Fly, Cannabis & Methylone (ID 47732)\". Erowid.org. Nov 7, 2005. erowid.org/exp/47732",
 "substance": "2C-B-Fly, Cannabis & Methylone",
 "bodyweight": "102 kg",
 "report": "<p>Substances:\tT +0:00\t16mgs 2C-B-Fly (orally)</p><p>\t\tT +3:25\t0.3g weed (smoked)</p><p>\t\tT +5:10\t20mgs Methylone (orally)</p><p>Subject is a healthy male, 102kgs, no meds taken during the last 10 days.</p><p>T +0:00 Ingestion of 16mgs of 2C-B-Fly solved in water with some apple juice on an empty stomach (last food ingestion was approx. 8 hours before). BP 141/79 mmHg, HF 68 bpm.</p><p>T +0:17 Definitely onset. Some body sensations and I feel a little cold. A little stomach discomfort.</p><p>T +0:23 A good +. Colours are much enhanced, they seem brighter. Some slight morphing effects. Stomach discomfort has gone. BP 144/78 mmHg, HF 80 bpm.</p><p>T +0:29 ++ now. I have to dim the lights a little. Body feeling is very much enhanced, touching is very intense. Minor auditory distortions.</p><p>T +0:34 A very strong ++ (and still rising!). During the last 10 mins. I tried to watch TV but this is definitely too much. My sitter lights some candles, all other lights are switched off. This is much better. I put on Ommadawn by Mike Oldfield, this music feels very good. Very vivid closed eye visuals.</p><p>T +0:51 Reached +++ during the last minutes, but it seems that Ive plateaued right now. This is strong, really strong! Got some muscle cramps in my legs, my mouth is very dry. Drinking some water helps a little but not for long. BP 153/88 mmHg, HF 96 bpm.</p><p>T +1:04 Some very unpleasant jaw clenches, also some stomach discomfort again. I go to the balcony to smoke a cig. Looking into the darkness of the park behind our house is very interesting  lots of morphing effects. I run up and down the balcony because I feel that I need to move a little. After I returned to the living room I find it hard to sit down again. Lots of energy and I dont know what to do with it.</p><p>T +1:12 I turn on the Nintendo, maybe doing a game will canalize the energy. I give up after approx 5 mins., because I cant concentrate on it. Still +++. BP 146/77 mmHg, HF 80 bpm.</p><p>T +1:26 Clenches have gone. My sitter and I decide to do a little walk into the park. Aah, thats good! The cold air feels very refreshing. Fortunately, theres nobody around at this time (approx. 10:50 pm). I feel that I could get quite paranoid if I met someone. Dwarfs and goblins seem to hide behind the bushes. The stars seem brighter than ever before. The darkness around me seems to have its own colour: its not black, but its a very dark green. We pass an old maple tree: its morphing all the time and everywhere in the tree, I can see faces of spirits. I hug the tree, because I want to become one with it and its spirits. It seems to pulsate. Quite a spiritual experience.</p><p>T +2:02 Back to our apartment. During the last 10 mins. I had a little of a feeling, that Im coming down. BP 142/80 mmHg, HF 92 bpm (arrhythmic!).</p><p>T +2:08 Down to ++. Im a little disappointed, because I hoped, this material would last longer. I turn on the TV and find Dude, wheres my car. I love this movie under weed, so lets see how it is under the Fly.</p><p>T +2:25 Now this is irritating: Im back to +++. Whats happening here? And the clenches are back.</p><p>T +2:31 Im back at ++ again. This is really strange. During the next 40 mins. Im riding a wave between ++ and +++ for 3 times again. BP 154/97 mmHg, HF 84 bpm.</p><p>T +3:16 Back to a stabile ++. I discuss with my sitter how to go own with the trip.</p><p>T +3:25 I smoke 1/3 gram of weed. Instantly I shoot back to +++. Still very much energy, but a the same time I feel very tired. I cant describe this, its somehow like trying to sleep while riding a rollercoaster. Saturday night live has just started, but once again I cant concentrate on the TV, so I ask my sitter to put on a CD again. She chooses Bo Hanssons Lord of the Rings, one of my favourite trip CDs. I can really feel the music, but some parts are just too fast for me. Once again I go to the balcony to smoke a cig. Very intense visuals as I look out into the darkness. The trees move in a gentle fall wind and morph all the time. Some kind of weird manga is running before my eyes. Its quite cold out there but I dont feel it. BP 138/86 mmHg, HF 104 bpm.</p><p>T +3:47 Trip is still very fast and slow at the same time. I still cant describe this state. My thoughts are running at high speed but most of it doesnt make any sense. I feel that I have lots of ideas, but I fail to put them down. My sitter offers to assist me, but I find out, that there are no words to describe my ideas. They have a lot to do with physics and chemistry, but nothing really makes sense.</p><p>T +3:58 As always, when a trip is very fast, my smoking frequency rises. Im back to the balcony when it comes to me, what I tried to describe during the last 30 mins: this trips is like a rocket flying into a huge pile of pillows again and again. Yes, thats it! At one moment Im the rocket, at the next moment Im the pillows, and one moment later Im neither the rocket nor the pillows, but the pure speed energy! Visuals are still wild. BP 135/87 mmHg, HF 108 bpm.</p><p>T +4:23 Fortunately, the trip has become a little slower during the last 5 mins, a strong ++ now. Now Im really enjoying this (not that it was too unpleasant before, but at some times, the energy was simply too much). Back to the TV, South Park is on. I have lots of fun during the next 30 mins. After that I try a little gaming on the PC, which goes surprisingly well, but becomes boring after approx. 15 mins. BP 142/77 mmHg, HF 84 bpm.</p><p>T +5:05 Im getting tired. Its already 2:25 am, but my sitter has had so much coffee during the evening, that she dont want to go to bed  neither do I. I bring on the idea from my first 2C-B-Fly experience, that some Methylone could be quite interesting. Unfortunately, I only have 20mgs left. We decide that I should try it.</p><p>T +5:10 20mgs of Methylone solved in apple juice are ingested.</p><p>T +5:16 Wow, here comes the rocket again! Ive never had such a fast response to Methylone before, and the 20mgs feel just like normally 150mgs do. Talking is easy. Writing is easy. Everything is just easy! BP 162/101 mmHg, HF 112 bpm.</p><p>T +5:28 The waves are back, but this time with a much higher amplitude. Try to imagine this: Changing from +++ to threshold and back to +++ within minutes. Now this is what I call a psychedelic rollercoaster! (I wonder what might had happened, if I had had more Methylone available) At one moment I feel like up in space and the next moment I think I could perfectly run machines or drive a car  which Id never do under RCs, but it brings my sitter to an idea: Some months ago, we luckily got a copy of an original training program used in some driving schools. I start it on my PC and off I go well, not too good After causing 2 major and 9 minor accidents and killing 8 innocent pedestrians, 2 cats and 1 deer within just 13 minutes (only virtually of cause!), I realize, that operating any kind of machine at this moment wouldnt be a very good idea Going back to the TV.</p><p>T +5:51 After zapping around for a while, I find a documentary movie about the Apollo Project, underlayed with music from the 60s and 70s. As Apollo 10 takes off, I have a wave to +++ again. I am the rocket! This is really great. I switch on the beamer and the surround system for full cinematic experience. Wow! This is really like the state Im in! I phantasize being an astronaut and flying into space. This is just the right stuff at the right time.</p><p>T +6:44 The documentary movie is over. Im getting a little tired again, but am still riding the waves. How long is this going to last? BP 158/91 mmHg, HF 92 bpm.</p><p>T +7:02 Very hungry all of a sudden. I realize that I havent eaten for more than 15 hours. I assist my sitter in making some pasta, which tastes surprisingly good, but isnt enough for my hunger. I eat some crisps and some chocolate, but miss the point to stop now the stomach discomfort is back!</p><p>T +7:41 Feeling a little better  and more tired. Im coming down a little, but its still a good ++. Maybe the eating pushed the metabolism of the substances a little. BP 151/84 mmHg, HF 80 bpm.</p><p>T +8:05 Still a stabile ++. The visuals have become weaker, but theres still a lot of morphing around me. Like in the beginning, some minor auditory distorsions. Once again I try the Nintendo, but find it to be unsatisfactory. Watching TV isnt the best either, but I have no idea what to do with the rest of the night (or morning, actually its already 5:25 am!).</p><p>T +8:40 Getting more and more tired, the same does my sitter. At + now. We decide to go to bed right now. First I think, that a little weed could help me sleep better, but as soon as Im in bed, I realize it to be unnecessary. Within minutes I fall asleep, still at +. Very wild and vivid dreams.</p><p>After 11 (!) hours I awake (at 5 pm), still a little numb, but finally out of the experience. After only 6  hours, I have no problem going to bed again. Next day I wake up fresh and clear.</p><p>Conclusions:</p><p>The 2C-B-Fly / Methylone combo is definitely worth further exploration. If 20mgs of Methylone have such an effect, how high could I go with, lets say, 100mgs? If this was already a rocket to the moon, a higher dosage could easily lead to warp 9! I guess the next time, Ill lower the 2C-B-Fly to 10-12mgs, but mix it with a higher Methylone dose ingested at the same time</p>",
 "year": "2005",
 "id": "47732",
 "gender": "Male",
 "timestamp": "2005-11-07T08:00:00.000Z",
 "views": "24364",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "16 mg",
   "administration": "oral",
   "substance": "2C-B-Fly",
   "form": "(liquid)"
  },
  {
   "time": " T+ 1:04",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": " T+ 3:25",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 3:25",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": " T+ 3:58",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": " T+ 5:10",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(liquid)"
  }
 ]
}
