{
 "id": 4775,
 "title": "Definitely Worth a Try",
 "date": {
  "submission": "2008-07-17T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Dustin",
  "gender": "Male",
  "weight": "111 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "11 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I had heard of this chemical not too long ago and was looking forward to buying some of it...it was white with a sweet smell(or was that the bag that i was smelling?!),i took it the next day without taking any of my prescription drugs(Prozac,Adderal), the day of the trip, and the day before.",
  "When i measured the dose(visually) it looked like i had taken about 11 miligrams or so....though when i took it my mind-set was quite nervous but overall a mostly positive experience,anyways as soon as i put the powdered substance in my mouth i felt some definte effects ,the stuff tasted kind of like rubber(not that i've tasted rubber before) and also very bitter and hard to flush taste....the effects came on quite quick since i had little to eat....here's what happened starting from beginning(11:40 PM) to end(?),",
  "T+5 seconds: I felt different, light-headed, and relaxed, not much going on.",
  "T+20 minutes(12:00 AM) minutes: the effects have maximized somewhat, I had gotten more relaxed, giggly, and I had some Anti-anxiety properties which were very effective.",
  "T+40  minutes(12:20 AM): At this time I was watching 'The Fifth Element' which was pretty insane because it felt like I was in the movie and got vivid gravity shifts.....i was laughing for about 10 minutes....at this time visuals felt much more vivid. I felt like I could feel something from a large distance away. I felt like I could fell what it/he/she was sad about or just felt emotionally and physically.....at times i felt like i was in pieces and felt real relaxed.",
  "T+60 minutes (12:40 AM - 2:20 AM): I had qwit watching The Fifth Element because it was getting extremely stupid, at this time I could pick up on so many glitches/details, I went down stairs and wached Shaolin Soccer which was very moodlifting, funny, vivid,and it felt like i was in the movie....I wasn't getting much more effects this time,I had reached the plateau and was getting very mild visuals (though i wasn't focusing on any visuals though), the movie was REAL GOOD I really liked it alot and had recognized events that I had not recognized when I watched it when I was sober...when the movie was over it seemed I had went down in effects somewhat and was real relaxed and under control of anxiety,also was real tired.",
  "T+3:40 hours (3:20 AM): at this time the effects have went down alot, basically just had mild relaxation and effect of something different was going on.",
  "T+5:40 hours (5:20 AM): at this time I tried to go to sleep in my bed. when i was trying to go to sleep the visuals before one goes to sleep gets more vivid and and has a strong gravity high to it, not as tired as before at this time and still had relaxation effects on me.",
  "T+14:20 hours (3:00 PM): at this time i have after effects that are mild and mostly feel cool about everything",
  "Overall this experience was very enjoyable and pleasant and was almost just what i was looking for...I am going to do some tonight and increase the dose about 7 miligrams."
 ],
 "erowid": {
  "id": "30139",
  "citation": " Dustin. \"Definitely Worth a Try: experience with 2C-I (ID 30139)\". Erowid.org. Jul 17, 2008. erowid.org/exp/30139",
  "substance": "2C-I",
  "views": "2828"
 }
}
