{
 "title": "The Juice Saved My Life",
 "author": "Basikone",
 "citation": " Basikone. \"The Juice Saved My Life: experience with Methadone (ID 47766)\". Erowid.org. May 8, 2006. erowid.org/exp/47766",
 "substance": "Methadone",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Methadone",
  "(daily)"
 ],
 "report": "<p>Hello everyone. I am an 19 year old guy from a small town in Ontario. I was always a 'good' kid growing up, I got good grades, I was respected by my family and friends, never got into much trouble. I was introduced to drugs at age 12. I knew alot about most drugs and I hadn't even used yet. Its funny because I hear people say that 'the disease of addiction starts well before you take the first drug,' for me its very true. I smoked pot and drank for a while but I did not like the feeling of being 'messed up', disoriented, and plain stupid feeling. I quit that and started doing low grade opiates at age 14. I would steal some tylenol 3s and 4s from my mom and grandmother and they made me feel ok, but I quickly wanted something stronger.</p><p>I talked to a guy who I used to get pot from, and said I really enjoyed the opiate buzz, and asked if he had anything stronger than codeine. He had some percs, so I bought 10 and ate them all in one night. I really enjoyed it, it was like I was in love.</p><p>I did those for a few weeks and then he said he got a new hookup with a steady supply of oxycontin 40s. The first time I sniffed half a 40, and I was hooked. Not physically hooked yet, but mentally I couldnt get enough. I wanted more and more. He eventually got 80s and it went from a once a week thing, to everyday, every couple hours. I ended up shooting anywhere from 8-15 80s a day, shooting fentanyl 100mcg patches, dilaudids, morphine, anything I could get my hands on. Oxy is not cheap here either, 30-60 bucks per 80, doing 8-15 a day. It caused me to do alot of things im not proud of. I ripped my mother off for a total of $56,000, ripped my cousin off for $13,000, and countless other things like robbery and stealing, lieing and cheating.</p><p>I used opiates for a total of 5 years, and finally I couldnt do it anymore. I was able to live with my parents the whole time but they wanted to kick me out. I was thousands and thousands of dollars in debt and had no money, the bank was after me for doing bank fraud, and just got diagnosted with hep. c. I gave up. I went to detox and was in the worst pain I have ever felt.</p><p>I found my way to a little methadone clinic and told them what was going on. The doctor wasnt in that day, but they sent me to his clinic where he works as a family doctor. He agreed to see me and started me on methadone. I started on 20 mg, which didnt do much, but quickly increased. Once I got over 50 mg everything started to get better. It saved my life. I have not touched anything, not even pot or alcohol for 4 months now. </p><p>NA and methadone have saved my life. I am on 110 mg of methadone, and have been for a while now, I got 2 carries and getting my 3rd next week. My life is starting to look good. Opiates had me chained up. My whole life was based around oxycontin. It was all I thought about all day. I have sold everything I owned and I have a potentialy fatal disease because of it.</p>",
 "year": "2005",
 "id": "47766",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-08T07:00:00.000Z",
 "views": "21961",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Methadone",
   "form": "(daily)"
  }
 }
}
