{
 "id": 4778,
 "title": "Shattering Boundaries of the Material World",
 "date": {
  "submission": "2006-06-21T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Monolith",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ],
 "report": [
  "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "I understand it may not seem like much, but the vapors from a little tube of rubber cement can show me amazing things.  My first experience was earlier today after swiping a tube of the stuff from a drugstore.",
  "It all started after going back behind a shopping center and finding a place to sit down where nobody would bother me... behind a sort of structure up close to the wall of the building.  I squeezed the rubber cement into a plastic bag and started inhaling repeatedly.  After a while, I felt all warm and fuzzy and I swear it was as if my soul was departing from my body with every exhale. ",
  "Sparkly things were everywhere, and my head was swaying back and forth without my doing.  Sound became extremely slow and was audible after several seconds in which it should have already been produced.  While this was happening, a weird song was playing with the sound of me inhaling slower than I really had been in the background.  I started laughing like a maniac for no apparent reason as my head bobbled back and fourth, and then I fell over to the side, smashing my head into the asphalt.  I didn't feel a thing as I continued to laugh, and that's when I blacked out....",
  "Suddenly I found myself in another world.  I was in a blank void with my eyes wide open, peering out at the strange double vision I now possessed.  My vision consisted of one set of designs to the left, and another to the right, and every now and then a strange transition occured to display another bit, in which the original was pulled down beyond my position of my eyes to leave room for the new images (sets.)  The only signs of life was the sounds of the material world beyond, and some strange music I call 'The Song of the Void.'  It was the scariest tune I have ever heard, and I will never forget it.  It seemed to be representing progression of some sort, and the transitions in my vision to new 'frames' only supported this.",
  "I was paralyzed.  I couldn't wake up to the real world.  I was trapped in the void.  I honestly believed my fate was resigned to this world, and that I had broken the boundaries of the material world with my soul, leaving my physical body behind.  My logic was that I was the only thing in existence, and that all I used to see in the past was, in reality, just a cover-up of my true abode... probably to either prevent myself from going mad with boredom, or to cover up some sort of secret.  Now I had broken through the disguise and found that I occupied a void.  I believed I would never get back to my body and that my soul would live in the void while my physical self sat around as a disconnected vegetable.  'As long as I never reach it-' I thought, '-if I am too late and I die, I would forever be contained in this hell listening to the song of progression and viewing these irrelevant frames of distorted designs.'",
  "All this time, I was laughing.  I have no clue as to why.  It was so bizarre because I could hear that it was my body in the real world laughing upon every decision my soul made to laugh.  I then realized that I must be capable of forcing my physical self to speak... it was my only connection to that tragic world I oh so missed.  And so I began to produce speech from my unconscious body, behind that shopping center.  I remember I had myself say to the world as I lay there paralyzed 'Hello?  Hello, is anybody there?  If anybody is there, please take me away from here!  I am stuck in another world!  Take my body to safety!'  I heard my physical self say this!  It was as if I was unconscious, yet at the same time conscious.  As if even though my soul was disconnected from my body, I could still produce speech from it!",
  "Time passed by, and then finally each design of the set converted into the wall of the building and the wall of the structure, and the sky appeared in the center.  I guess I regained consciousness and found I was laying on my back gazing at the sky.  I have never been so relieved in my entire life!  I looked around for the bag, and noticed my left arm was lightning fast while my right was normal paced, and I grabbed that thing and threw it!  I got up, still laughing uncontrollably, and stumbling around like a drunk.  I walked into several stores and I'm sure people were staring, but I didn't care at the time.  Everything was funny and I was so relieved. ",
  "I am so glad to have done this as it made me really appreciate what I have.  I could have wished for nothing more than to escape the void.  Now that I think about it, I believe my eyes were open the whole time and it was just my brain clouding over my vision and everything like that, because, as I mentioned before, the walls were parallel to the set of images while in the void.  The only downside is that that damn song is stuck in my head and it has been a few hours after regaining consciousness.  The song is set up in such a strange manner.  It progresses in speed, and then decreases and stops, and then resumes again.  It is maddening, but I think I'll get over it. ",
  "I might give it another go some day in the future, but I doubt I will any time soon.  I think I've had enough of shattering the boundaries of the material world for now.",
  "Oh, and upon getting home, I found a children's video in my jacket pocket.  I freaked out and wondered where it came from, and then realized I must have stolen it from Big Lots during my escapades around the stores.  I then remembered I did just that.  I'm just glad I wasn't walking around while in the void.</p>"
 ],
 "erowid": {
  "id": "30151",
  "citation": " Monolith. \"Shattering Boundaries of the Material World: experience with Inhalants (ID 30151)\". Erowid.org. Jun 21, 2006. erowid.org/exp/30151",
  "substance": "Inhalants",
  "views": "13028"
 }
}
