{
 "title": "Alive in a Funhouse",
 "author": "bleugrasskid",
 "citation": " bleugrasskid. \"Alive in a Funhouse: experience with Salvia divinorum (ID 47837)\". Erowid.org. May 23, 2006. erowid.org/exp/47837",
 "substance": "Salvia divinorum",
 "bodyweight": "125 lb",
 "report": "<p>I'm not a pot smoker, or an alcohol drinker.  Nothing good ever seemed to come from either one, so about a year after quitting the two, I got into alternative drugs.  Remembering a drug my friend had tried before, I went out and bought some salvia.  Later that day when I tried it out for the first time, it automatically became my favorite mind freeing substance.  One large hit on my friends bubbler (I make sure I use a water bong of some sort, dry pieces have never worked with me), sent me on a beautiful trip.  Before exhaling I could feel my body slipping away and the effects beginning.  I didnt remember anything until about 2 minutes after the hit.  What I do remember is standing up, because sitting was incredibly uncomfortable, and wanting to explore this new world. </p><p>The only way to describe my view of the world was a wonderland-like-funhouse, which seems to be my general experience in subsequent trips.  It was dusk, but there were still colors to be seen all around.  The ground at one point became a puzzle piece that attached itself to the sky as I tried looking up, without sucess.  One fun thing to do was play a didgeridoo, which became my spirit tunnel. Closing my eyes I could see a tunnel that seemed to be the tunnel to somewhere, but I didnt feel like going.  As time progressed I came to full conciousness and went to eat.  The after effects were pleasurable in themselves, in that I became tired but definetly peaceful and more introspective.  It is really the most pleasurable enthenogenic experience I have ever experienced.</p>",
 "year": "2005",
 "id": "47837",
 "gender": "Male",
 "timestamp": "2006-05-23T07:00:00.000Z",
 "views": "3085",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 }
}
