{
 "title": "Keep Out of Reach of Children",
 "author": "Elsie",
 "citation": " Elsie. \"Keep Out of Reach of Children: experience with LSD (ID 47840)\". Erowid.org. Feb 3, 2008. erowid.org/exp/47840",
 "substance": "LSD",
 "bodyweight": "60 lb",
 "report": "<p>Just to make this all abit less confusing for you, here's some background information. At the time of my first and only acid trip, I was six years old and living with three of my grown/teenaged cousins because of issues with my imidiate family. My cousins were deeply involved with the drug culture. They manufactured, sold and binged on numerous types of drugs frequently during my time with them and as far as I know, still do.</p><p>Ok, now for the story. We were going on a road trip for a reason I still do not remember and don't actually think I ever knew. We were in the Reno, Nevada area in my eldest cousin's (Will's) old hippie van. Me and Logan (the youngest) were sitting in the back talking and he started tell me about acid. he made it sound like such a magical drug that would make everything better. I told him the I would love to try it sometime. He said he had a hit on him and offered it. I accepted. I popped it and resumed talking with him. I quickly forgot all about it and the effect came as quite a surprise.</p><p>After about and hour I started to feel the effects, which started with calidescopic patterns ariving on the inside of my eyelides. For some reason seeing these things made me giggle and everyone started looking at me, and Logan explained how he had given me acid. Will (the oldest) started bitching at him how I was to young to do stuff that hard because I might see something that could traumitize me. As soon as Logan relized that he regretted ever giving it to me.</p><p>Soon it was open eye hilucinations and the posters on the roof of the van seem to be coming out at me and coming alive and moving. For example, one of his Marilyn Manson posters (The one where MM looks like he's a female alien) appeared to be walking and waving to me. This scared the living crap out of me. Then I started thinking in ways no 6 yr old would ever think, I began relizing how wrong what my cousin's were doing was. And then a police car went by us and I thought it was coming for us and I began crying.</p><p>Logan told me to shut up and that it would be over soon. Then I started having flashbacks to the past year, recalling an incident where I was sexually abused by one of my cousins that I had until that point forgotten about. I attacked the one that had done this to me, screaming why and punching him and crying. One of the others managed to pull me off him and kept me pinned to the floor until I calmed down but I was stilled very shaken. Will said that we would arrive soon and that I can't be in this state when we do. So he insisted that we stop at a motel until I come off, by then about 3 hrs had past since I first started feeling the effects.</p><p>So we stopped and ate a junk food dinner, and I was told to sleep through the rest, which was difficult and unenjoyable. But I managed to do so and when I woke up I felt fine and we continued the trip drug free. I had no dreams while on acid, at least none that I remember. I had been given whiskey to prevent this and it worked. I do think acid would be a good drug to try under the right circumstances and certainly not at the age I had done it. I would do acid again if given the oppurtunity.</p>",
 "year": "1998",
 "id": "47840",
 "gender": "Female",
 "timestamp": "2008-02-03T08:00:00.000Z",
 "views": "15000",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
