{
 "title": "Drug of Choice",
 "author": "Katkibble",
 "citation": " Katkibble. \"Drug of Choice: experience with Oxycodone (Roxicet) (ID 4785)\". Erowid.org. Oct 27, 2001. erowid.org/exp/4785",
 "substance": "Oxycodone (Roxicet)",
 "bodyweight": "178 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5.0 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)",
   " T+ 1:45",
   "5.0 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>I have tried in the past only weed, alcohol, and unfortunatly an extremely bad expirience with Coricidan (DXM)</p><p>My family is prone to hurting themselves, so we have always had some percocet lying around for one reason or another. It is an effective painkiller, but I had never tried to use it recreationally before and have never had the nice effects that happened when I finally did.</p><p>I had a bad day at work, and was turned down for a night of hair-bleachin' fun by a very close friend/love of mine, so I was feeling kind of blue. I really wanted to get stoned, but wasnt in the mood for the paranoia and I didn't have anything to drink. So i looked in the pantry and found I still had 4 roxicet tablets left. I had heard that they could be snorted, and I was feeling adventurous, so I grabbed one. I didn't want to do too much, I try to be safe...</p><p>I ground the pill down into a fine powder. It turned out to be very light and soft. I poured it out onto a CD case, cut two lines, rolled up a twenty, and snorted it. The slight irritation of snorting was nothing as bad as I had heard from friends who do coke and K. About 10 minutes later, I began to feel very relaxed...I had slight perceptual changes, and walking was very fun. After about 15 minutes, I was happy and warm and felt all my problems could be dealt with..but I was also very clearheaded and aware. There were no negative side effects, like paranoia or twitching. Just pure pleasentness...not euphoria exactly...just goodness.</p><p>I went upstairs and talked to my family for a littlw while. i felt very free and it was easy to talk to them. I was happy to be around people.</p><p>This lovely states continued for about 50 minutes...and then I began to slowly come down....it was barely noticable. It was easy and although I was relaxed I wasn't tired.</p><p>The effects finally wore off about an hour 1/2 after that. Unfortunatly, all i could think about was how nice that was, and I snorted another and went to my friend's house to chill.</p><p>The next day I had work again. My mind kept coming back to the fun of last nite, and as soon as I got home, I snorted another. I realized that prescription opiates would be easily addicting..so i decided not to do anymore that day. i still have one left and I'm waiting for the right time to take it. This is the nicest drug i have ever done, but i want to be careful...it's almost too attractive. Still, I'd call it my Drug of Choice.</p>",
 "year": "2001",
 "id": "4785",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-10-27T07:00:00.000Z",
 "views": "63984",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "5.0 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  }
 ]
}
