{
 "id": 4786,
 "title": "Strong Visuals, Weak Sense of Purpose",
 "date": {
  "submission": "2007-11-09T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Sir Krishna",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1000 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "It was 3am and I was on the internet trying to find the name of the hallucinogen in cats. instead, I stumbled across a Dramamine FAQ.  Interested by visuals that supposedly blended with reality, I took a trip to the drug store the following day and bought a 36pack of dramamine for 10.99. After heading back to my house with a friend to keep me in line, I popped 20 pills. I had not smoked herb or done a single mind altering substance in several days, I was as sober as I could be. I'm never completely sober, I always have a lofty stoned feeling that has stayed with me the past year Ive started a serious relationship with mary jane, enough said.",
  "I started feeling drunk after 15 minutes, in a clear-headed sort of way, found my self not being able to walk without hitting something.  After an 45 minutes to an hour I could not hold a conversation. The interesting thing is, as fucked up as I was, I was not lost. I had a clear train of thought, I simply couldn't express it. Then the visuals. looking at my hands, they were slightly shroomy looking, with lots of dead skin. Little brown spiders with long legs would pop up and run across my hand, I could even feel them until I smacked them, when they would vaporize. Other features in my room remained normal, except for the wood grain on the floor shifting and my drumset sparkling. Although the spiders were startling, I managed to convince myself they were hallucinations.",
  "According to my sister, my friend left at 6:30pm. Everything after this point is much less clear, as I remember talking to him and occasionally seeing  him for several hours after that. I would see him for several seconds, before he would vanish.  I walked into my bathroom, and to my surprise, my sink which is grimy and missing a faucet was sparkly clean with I shiny new faucet. When I went to turn it on, it returned to the way it was.",
  "Listening to the moody blues they sang an entire verse in what sounded like Latin.  Seemed like devil and some cryptic old language.  I also listened to dark side of the moon live in 72, but can't remember much. I slipped further into delerium. I went to bed at some point, while the spiders followed me. I could not ignore them, or they would itch and bite. Serious itching kicked in too. At one point I saw my friend standing at the end of my bed, but she soon jumped into the Maxfield Parrish poster. Listening to two people talk down stairs, their voices became melodic and rythmic and eventually other instruments chimed in. I don't know what was dreams and consciousness after this point, but I remember jungles littered with objects from my room and sweeping sunsets, when it mostly wore off I would still occasionally see spiders running across my walls and a mouse in my vent.",
  "I woke up the next morning to find my pants covered in paint, with some in my mouth, as well as Pink Floyds The Wall shattered on my table. This may be amusing but it is the devil's trip. Who in the right mind would break a Pink Floyd CD or eat paint? I enjoyed the experience, but was certainly not under control. 2 days later, I still see occasional hallucinations and have detailed, bizzare dreams, but can communicate fine. I am going to experiment with this drug again over long periods of time, but am afraid of long term damage, because when on it, I do feel severely retarded, and I would hate for that to cross over into my sober life. After this trip I have lost my care free stoned feeling I have had for so long. Seeing something so surreal has made me aknowledge how real everything actually is. Although there were serious hallucinations, the trip felt very empty, like there was a hole in my head and absolutely no meaning."
 ],
 "erowid": {
  "id": "30169",
  "citation": " Sir Krishna. \"Strong Visuals, Weak Sense of Purpose: experience with Dimenhydrinate (ID 30169)\". Erowid.org. Nov 9, 2007. erowid.org/exp/30169",
  "substance": "Dimenhydrinate",
  "views": "5664"
 }
}
