{
 "id": 4793,
 "title": "Quick and Powerful",
 "date": {
  "submission": "2004-07-05T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Anjovis",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "4-HO-DiPT",
   "form": "(capsule)"
  },
  {
   "time": "2:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "20.15 30mg of 4-ho-dipt taken in a gelcap.",
  "20.40 first alerts are surfacing, this thing really comes quickly.",
  "21.00 I feel it is a good time to go walk outside. Come up is getting really strong and I am getting lots of energy to spend somewhere. This is not really any major stimulation, I found it quite identical to the energies I get on acid. In retrospect, I think this could be some physical side effects from the quick transformation of your consciousness. I wear contact lenses this time and my field of vision is very spacious. Iprocin extends this feeling considerably, so I feel very spacey when we finally manage to get outdoors.",
  "Effects grow in almost alarming rate. I feel slightly suffocating mental pressure. Time is warping here and there. It is around 0 C outside and snowing. Trees look like 3d fractals again. Snow flakes create flowing stream under the light of street lamps.",
  "21.05 We arrive into the woods. There is a downhill path here, tall snowy spruces rise high above us like magnificent living giant inhabitants of this planet (which they actually are). I am getting some moderately strong visuals. There is no wind, but it looks as if the whole forest was under turbulent winds. Sky looms dark purple on the background. We stop and enjoy the moment. The forest is slowly melting in front of my eyes. These magnificent trees wriggle themselves into my head, starting to fill it with the vast consciousness of the mother earth. Someone skis by and interrupts the merging of our consciousness (me and the nature). Since I feel uncomfortable to meet strangers, we head back inside.",
  "21.35 Inside I sit beside the table and try to concentrate on my state. I close my eyes and try to let my mind go freely. My friends talk some pothead theories somewhere on the lower parts of my consciousness. Music (Shpongle) creates turbulences inside my closed eyelids. Thoughts flow like large and powerful rivers.",
  "21.50 I feel like stretching. I used to be quite athletic when I was younger, but I have let my health to deteriorate. I removed my trousers. I wear warm wool pants and socks underneath. They are very flexible and feel very smooth against my skin. I sit in lotus position, stretching my legs all directions every now and then. Slow controlled movements take all the extra energy away and I can concentrate on my thoughts more.",
  "Eyes closed my mind draws a sketch of the surrounding world using the sounds I hear.",
  "Sounds create fluffy but intimate enviroment. When I open my eyes I am very surprised to find myself sitting in such a large and spacious room. When I close my eyes I fall back in the dense world of sounds. Holding things, like a cup of tea, is like holding continuously mutating piece of clay.",
  "22.15 I feel the peak subsiding already. Effects are still strong, but the highest peak has passed. I smoke a couple of small hits of cannabis.",
  "22.30 We watched 'flashback' animation. The animation drew me in, it became my full focus of attention filling all thoughts.",
  "23.00 I try to socialize with (or rather listen to) my friend A,",
  "his girlfriend, who had just got home, and K talking old trip stories and misc ideas. I get easily distracted into following my own flows of thought. Tea, Pepsi and rice pie taste the most extraordinary thing in years. Tastes are familiar, yet quite unusual.",
  "00.40 Heading home. Snow flakes still make very interesting flowing patterns around the bus stop where I am waiting for the bus to get me downtown.",
  "02.20 Trip is pretty much dying out. I find it incredible that it has been six hours since I ate the gelcap and I am almost back to baseline after riding an hour that high.",
  "Very warm and beautiful afterglow. Trip had similarities with",
  "5-meo-dmt, acid and mushrooms, yet wasn't identical to anything I've tried before. I found very little laughter in it, it was warm and quite deep, but not humorous. Also my will to socialize was quite minimal. I rather sat there and explored this extraordinary state of mind, especially during the peak hour. If some similarities can be drawn between this and psilocin, it would the smooth nature of the trip, even though the come up was rather spiffy.",
  "I would like to explore this on 40-50mg range, but I wonder how steep the come up would be. I had eaten very lightly a few hours before dropping the gelcap and I am quite certain that if I had eaten heavily, I would have propably thrown up during the strongest lift. This was solid +3 on Shulgin's scale during the peaking hour, but diminished to +1 when approaching the fourth hour. Comparing this to my first attempt with this material taking 15mg, this was considerably stronger.",
  "This substance is very nonlinear in its effects, double the dose and you don't double the effects instead you're shot into a couple orders of magnitude higher. The peak is very strong and leaves lots of things to",
  "process. One of its kind compound, definitely."
 ],
 "erowid": {
  "id": "30193",
  "citation": " Anjovis. \"Quick and Powerful: experience with 4-Ho-DiPT (ID 30193)\". Erowid.org. Jul 5, 2004. erowid.org/exp/30193",
  "substance": "4-Ho-DiPT",
  "views": "10693"
 }
}
