{
 "id": 4794,
 "title": "Stuck in My Body",
 "date": {
  "submission": "2004-08-30T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "night tripper",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract)"
  },
  {
   "time": " T+ 0:30",
   "amount": "20 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "(extract)"
  }
 ],
 "report": [
  "I have enjoyed looking at others eperiences and I recently had one that I feel is worth sharing.  First off I just finished reading two books, one concerning traveling and the other DMT. (Adventures Beyond the Body by William Buhlman and DMT the Spirit Molecule by Rick Strassman) I found both books very thought provoking and was determined to experience out of body travel.  After a week of mental exercises and a test run of my extractions I decided I was ready to go for it.",
  "Thirty min. after taking the rue I took my mimosa and went to my room to lye down.  Within ten min. of taking the mimosa i could feel it coming on.  It was quite pleasent for the first hour or so as I concentrated on controling the vibrational frequencys I was experiencing but then as I started to peak I had to throw up.  This is where it all went down hill. First I was tripping so hard that I could not walk so I had to crawl to the toilet. After puking (dry heaves)for aprox. 15 min. I went back to my room but no longer could I concentrate. My thoughts started to get out of controle and the anxiety started to build. At that point something inside me broke and I could no longer rationalize anything. I was convinced I would die and I was really sorry I didn't have a guide with me to help reasure me. I called out for help several times but no one was around to hear me. I was having thoughts of killing myself to make it all stop. This must have been the closest I have ever come to  near death experience.",
  "Finally (thankfully) maby three hours in I blacked out. In conclusion I realize I took twice the dose I should have. Although it was one of the worst trips I have ever had I don't think i would have done anything diff. It really brought back my appreciation for life and respect for the unknown. I will deffinetly experiment more with this combination but I think I need a couple months to reflect on my last experience."
 ],
 "erowid": {
  "id": "30199",
  "citation": " night tripper. \"Stuck in My Body: experience with Mimosa hostilis & Syrian Rue (ID 30199)\". Erowid.org. Aug 30, 2004. erowid.org/exp/30199",
  "substance": "Mimosa hostilis & Syrian Rue",
  "views": "9099"
 }
}
