{
 "title": "LSD Trancendents Are Go!",
 "author": "starchiLL",
 "citation": " starchiLL. \"LSD Trancendents Are Go!: experience with LSD (ID 4794)\". Erowid.org. Jan 4, 2002. erowid.org/exp/4794",
 "substance": "LSD",
 "bodyweight": "70 kg",
 "report": "<p>I am touched by the stories I've read about LSD, a lot of the bad stories too. I have always wanted to express my feelings about this drug, but there was never a chance to do that in the past (thank those LSD-crazy hippies [not Gore :)] for inventing computers and the internet).</p><p>The first time I tripped is almost a legendary story for me. It happened in Kansas in a trailerhome. I was there as an exchange student. A friend of mine (he later followed the Dead) gave me some acid to keep while he was going on vacation; he said he didn't mind if I took some.</p><p>In Holland (where I come from) it's legal to smoke weed, so my craving for a relaxed drug experience after one year of Kansas skunk (one bud) was getting to me....</p><p>After I cut the trip into pieces (I wanted to build up), I took some pieces and some more.</p><p>DETAIL: In the trailerhome where I lived, were at the time 5 people who had no idea that I was tripping. They thought I had gone to bed and sleep.</p><p>Then the acid kicked in and I passed out. Still after all these years I get flashbacks of what I saw that night.</p><p>Old computer graphics, surreal graphics, cartoons, images from books I read when I was young (a lot).</p><p>After 5 hours I became aware of myself. Before that I didn't even have an idea of anything anymore, only tripping; I discovered that there was a raging thunderstorm outside and I was thinking I was hallucinating those noises</p><p>When I became aware of myself I started to get a little frightened. I couldn't get in touch with reality anymore and when I looked at my hands I could see the bones right through them and broken glass was cutting into my back.</p><p>At this time I was becoming aware that my cd-player was on repeat (Sisters of Mercy) and that the vibe in this music was getting me down. I turned on the radio and heard the sound come out backwards, turned on other music but everything sounded like shit. I was thinking 'how can I listen to this shit'; in a couple of hours my complete musical tastes changed. My whole collection sucked.</p><p>In a last attempt I put a Jimi Hendrix cd on. The room turned pink and I was home again. I had this same experience with Hendrix a couple years later with 5 tripping friends (always have a Hendrix album in your basement).</p><p>But this was not by far the end of the trip. It was almost 6 in the morning and I had to take a piss. The trailerhome looked like a cubist boat from Picasso. When I entered the room there were claws coming through my curtains. I was shocked, it was too real, this was no mere hallucination. I heard something outside and approached my window. It was our cat, she wanted to come in. I was relieved it was for real, I was sane...only the cat was made of nails, but I knew that it was the trip.</p><p>Now I was coming down but not really - my mind was tired but the trip was raging on. Here came the bad part, I couldn't sleep and was trippng my eyes out.</p><p>I didn't sleep all night and had to act normal all day. How I managed is a riddle; they didn't notice anything but I kept on tripping. In the afternoon I called the dealer in despair. I wanted to know if it would ever stop, and he said that it would (it was the stupidest telephone conversation ever).</p><p>Somehow the trip wore off and I called my girlfriend. We went out and drove to the nicest sunset I have ever seen, it was like paradise after hell.</p><p>I hope when somebody is real deperate on LSD and reads: YOU ARE NOT ALONE, THIS WORLD IS BERSERK, THE FEELING IS GOING AWAY, MAKE FUN WHILE YOU'RE AT IT, he smiles and thinks it's true.... I have done L after this trip and some of the trips were bad and some good (scene, setting, friends).</p>",
 "year": "1991",
 "id": "4794",
 "gender": "Male",
 "timestamp": "2002-01-04T08:00:00.000Z",
 "views": "13469",
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
