{
 "title": "Leveling Of All Emotions",
 "author": "AceOfSpades",
 "citation": " AceOfSpades. \"Leveling Of All Emotions: experience with Venlafaxine (ID 47964)\". Erowid.org. Nov 29, 2005. erowid.org/exp/47964",
 "substance": "Venlafaxine",
 "bodyweight": "175 lb",
 "report": "<p>Due to a lifelong habit of self-medication with everything and anything, mostly alcohol and prescription opiates (legally doc prescribed), I was finally persuaded to seek professional help. The recommendation was 225 mg of Effexor XR, which ended up being 3x75 mg at 6:00 am. I actually felt 'better' from the first week, but Effexor took about 3 weeks to reach the state of over-stuffed contentment that I am now at, and the dose, which was reduced to 150 mg at the halfway point of the 2 months total thus far, has in fact reduced the almost lethargic self-satisfaction that the 225 mg brought about.</p><p>Oddly, although Effexor has diminished my motivation, once I do get going, I have boundless energy. Where before Effexor I could barely get through an 8 hour workday, and then always nearly fell asleep at the wheel on the way home and actually needed an hour nap after work, I now with Effexor never need and never take naps, and in fact I now put in voluntary overtime. My tendency to med-seek and beer guzzle has vanished, but so has my sex drive. I actually had more desire at 225 mg, but at 150 mg there is not much left, but if my wife and I do actually make it that far, then the official side effect of abnormal ejaculation is obvious. One day, I forgot to take the 150 mg at 6 am and left the house... at about 14:00 (2 pm) I began to feel very strange and had some mild elecric jolts going through my brain, and I could only imagine what it would have turned into after a few days... danger danger.</p><p>Anyhow, there are mostly negative reviews for Effexor here and I don't want anybody ignoring the side effects, possible withdrawal symptoms and the fact that no long-term studies have been done on pathologic changes in brain chemistry, such as the possiblity of Lou Gehrigs Disease, Parkinsons, Multiple Sclerosis and the rest of the neurological nightmare diseases that may or may not result from use or prolonged us of Effexor, or any SSRI/SSNRI.</p><p>Effexor has done for me what it promised. The demon-monkey is off my back and I am grateful. Sure, I don't have any up-moods anymore with all the laughing and happiness, but I surely don't have any more deep, dark cloudy and dreary moods either (which could last for weeks, btw). A trade-off? Absolutely... One I am willing to make.</p>",
 "year": "2005",
 "id": "47964",
 "gender": "Male",
 "timestamp": "2005-11-29T08:00:00.000Z",
 "views": "11418",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  }
 ]
}
