{
 "title": "Contemplating Suicide",
 "author": "Josh",
 "citation": " Josh. \"Contemplating Suicide: experience with Mushrooms (ID 47995)\". Erowid.org. Jun 26, 2007. erowid.org/exp/47995",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "",
   "",
   "1.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "47995",
   "Male",
   "",
   "Not Given",
   "Jun 26, 2007",
   "4842",
   " "
  ]
 ],
 "report": "<p>I would consider myself to be an experienced drug user. Over the past 2 years I have tried many drugs including, cannabis, , ecstasy, cocaine, pain killers(hydrocodone, oxycontin, etc...), salvia, hashish, nitrous, alcohol, and for my first time now mushrooms. I was highly anticipating trying mushrooms for the first time. I thought it was going to be a lot of fun and a great experience, but boy was I wrong. </p><p>I picked up an 1/8 of all caps from a buddy of mine and got ready to eat them. I crushed them up into small pieces and made a peanut butter sandwich and sprinkled all the mushroom flakes all over the peanut butter. I had not eaten anything in about 6 hours or so and my stomach was quite empty. I decided to eat them at around 7 pm. </p><p>After I ate them I did not feel any effects the first hour at all. I thought that it had been a total waste of 30 dollars. I was pissed. After being angry, I went to take a hot bath since I had nothing better to do while waiting to see if I would trip or not. I got into the tub and I started feeling it them a little bit. I was kind of giddy and just started to feel really weird. I was anxious to get out of the tub so that I could go sit down and watch tv while I was coming up. I started to giggle constantly after about 2 and a half hours after I ate them. </p><p>After this giggly stage ended, I went into my room and lay down. I started to go into deep thought. I began talking to myself about things and it was like my mind was talking to me. I had no control over anything coming out of my mouth. Now it was about 10:30 pm or so and I was lying in my bed contemplating my life and such. I went to my room to smoke a joint. While I was smoking the joint lying on my roof, I felt as thought I was going to slide off my room and fall. It was about a 15 foot drop onto concrete and this frightened me. </p><p>After I finished the joint I looked around outside at neighboring house and such. I saw very vivid colors and bright lights outside peoples house. I started to hear noises from bugs, air conditioning machine, wind, leaves rustling, and such. This began to frighten me even more so I went back into my room to lay down. After this I became very scared. I had no control over my body. I felt like I was a retard and was mentally challenged. I was licking my arm for no apparent reason. I was still constantly thinking out loud to myself. </p><p>At around 12 midnight I became restless. I had wished I had not taken these mushrooms and just wanted to go to sleep. But when I closed my eyes I saw nothing but flashing colors in weird patterns. Soon after this I tried to turn my lights out. Now I became even more freaked out because I thought someone or something was in my room. I turned the lights back on and continued to lie in my bed thinking aloud. I was telling myself that none of this was real, but it was happening so I couldnt believe myself. I began to contemplate whether I was going to be like this for the rest of my life. And that I was going to end up on the 4th floor of the hospital or something terrible like that. I told myself that I wanted this to end. </p><p>Time was passing even slower and slower now. I'd look at the clock every second thinking hours had passed but it had not even been a minute. I now heard myself talking saying 'What the fuck is going on, this is not cool, I want to fucking die.' I continued, 'Should I kill myself, I am never going to be a normal person again.' Luckily, I do not own any guns nor were there any sharp objects in reach so I could not go on with this. But if there happened to be a gun laying on my dresser I would have shot myself and killed myself. This was the worst drug experience I have ever had. I kid you not this is exactly what happened and this is the exact  definition for a 'bad trip'. They say users not supposed to try psychedelic drugs if they depressed and maybe that is whats wrong with me. But never again will I try a psychedelic drug in my life. </p><p>P.S. Now I just stick to pain pills and smoking weed. Occasionally I'll get drunk but I try to stay away from coke because I have seen it ruin to many lives. Ecstasy is the shit but thats what I feel like the next day.</p>"
}
