{
 "id": 4800,
 "title": "Sensual, Easy Fun",
 "date": {
  "submission": "2004-02-02T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "santadog",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "2C-T-21",
   "form": "(liquid)"
  },
  {
   "time": "1:15",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "2C-T-21",
   "form": "(liquid)"
  },
  {
   "time": "2:15",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "3:30",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "4:00",
   "amount": "repeated",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  },
  {
   "time": "4:30",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "2C-T-21",
  "T+0:00  5mg oral",
  "T+1:15  5mg oral",
  "Occasional cannabis, alcohol and nitrous oxide.",
  "Before yesterday I hadnt tripped in 10 years.  Back then I had dozens of acid and mushroom trips until one day the desire for more just disappeared.  Nothing bad happened, I was just done for a while.  The curiosity returned this year and I wanted to try a new material.  I felt like it was definitely time again, my soul was really itching for it.  I chose 2c-t-21 for my first trip back because its been reported to be very easy on the body and easy to direct and frankly I had no idea how Id respond to a phenethylamine.  I was especially psyched to be working with something relatively unknown (as far as trip reports and studies Ive read) but figured it would be gentle enough to get through without too much anguish, even if I turned out to be unprepared or a lightweight.",
  "Heres how it went down:",
  "Setting:  a friday in january, somewhere in the foothills of the central rockies, snowing lightly, off work, home with the cats.",
  "Set:  happy, little anxious, ready!  Fasted for 15 hours, a little hungover from hockey game night before.",
  "T+0:00  (3:00-3:20pm)",
  "Consume 5mg 2c-t-21 in 6oz crangrape juice.  Material dissolves very easily and has no detectable flavor.  Im taking 5mg for now at the off chance I have a freakish reaction or something.",
  "T+0:45",
  "Already feel a little something, light headed, widening periphery, listening to zappa sounds really great, 5min song lasts forever.  My hangover is suddenly gone.  Basically I feel a very light headspace emerging with occasional energy bursts.  Very affectionate with the cat, pleasant anticipation.  Definite energy push at T+1:00.  Mild heartburn but overall very easy.",
  "T+1:15",
  "Ingest another 5mg in same manner as above, knowing Im not exactly going into cardiac arrest on this stuff.   The world outside my window takes on an orange glow occasionally.  Music really floats.",
  "T+1:30",
  "out for a walk!  Neck and upper back tingling, glowing.  This is a very controlled energy with just an incredibly pleasurable, smooth and sensual come on!  Feeling in that post-orgasmic mellow place, a horribly pleasant state of mind.  The mountains are blurred by light snowfall and look more 3D and majestic already.  Thoughts of undersea ranges.  I see new details in the peaks and find perspectives I hadnt taken time for in the past.  I run into a neighbor out walking his dog and join them for the rest of their walk.  Have energetic conversation and feel really comfortable just strolling along despite the goofy accelerating rush Im under.  I get back to my place at T+2:15 and leisurely smoke a medium bowl of cannabis under the silently drifting snowfall at dusk.  Feel on the verge of the storm.",
  "T+2:30",
  "Back inside.  The effects are coming on harder and harder now, find myself pacing around a bit getting used to my new surroundings.  The mj really accelerated things I think.  Flash of paranoia passes in a minute and I feel the need to just get comfortable for a while.  Turn tv to PGA in Hawaii, tres relaxing.  Colors in the room and especially on tv are super crisp and much brighter.  There is a faint doubling to everything and a lot of peripheral dancing.  Glowing waves of warmth from my neck and face bring nice somatic pleasure but not exactly euphoria, the euphoria rolls in much more subtly somehow.  Cat zonked at my side, a warm and sensual room.  Things continue to shift slightly and I epitomize Relaxed.  In control, clean.  The opposite of muscle tension.  Very, very easy so far.  Temperature increasing.",
  "T+2:33",
  "Time has Slowed.  3 minutes just felt like 30.  Looking around I can literally see time unfolding around me.  Difficult to explain but easy to conceptualize at the time.",
  "T+2:45",
  "Starting to remind me of past mushroom experiences.  Love this!  Strange heat on face and nose.  Had to hunt extensively for CDs, interrupted by my own giddy laughter.  I have great precision of sight and hearing, thought and movement  but Im still fucked up.",
  "T+3:00",
  "Listening to transmissions from the satellite heart.  Much new detail previously unheard.  Voices everywhere, heard the very faint quiet ending of one track for the first time after years of listening.  I can direct this drug, so can the music. Waves.  Even acoustic tracks are soaringly majestic.  I am truly at relaxed peace.  CEVs suggest primitive peoples in ceremonial dress gyrating in bliss. At this time I start to feel a horky chemical drip, Im also a little clammy and sweaty and cold.  NONE of this is a hindrance at all and I grab a blanket for the last half of the CD.  Time is indeed moving at dinosaur pace.",
  "T+3:15",
  "Decide to measure pulse, its a bit high but not physically noticeable.  Eyes medium dilated.  Music still deep and richer than ever before.  It defines the mood, the entire space.  Through headphones the music vibrates my body in subtle swirling patterns.  Lovely CEVs but not much color.  sexy, rushing and a blast.",
  "T+3:30",
  "My tongue is thick.  Lost easily in CEVs.  Still ok, in control, high ++.  Toying with +++.  Now starting to remind me of past acid experiences.  Little wobbly, cold extremities, tip of nose now cold with drip.  Sort of jittery-jauncy-happy and still quite fun.  Going to try some nitrous and more Pot.",
  "T+4:00",
  "Surprised to find first nitrous balloon didnt have much effect.  What?  Second balloon was luxurious, my consciousness and surroundings were brought into pure glowing precision.  Had a few moments of such brightness and clarity it seemed the world had stopped.  Seconds later things seem unrecognizable, swept away.  Effects of the n2o last much longer than normal.  Time has slowed down in nitrous space too. Took a walk up the driveway and toked a few hits from the bubbler along the way.  The walk back down was so long and treacherous, sort of funny, not too weird really.  Warm thrill of confusion.  Walking up to the house and into the garage underneath felt absolutely cavernous.  The darkened garage was like a bottomless cave.  Made me laugh.  Saw vague patterns of color in the darkness.",
  "Came inside and got a call from my mother.  Conversation was relaxed and quite amiable.  Felt a lot of love and gave her lots of kind words.  Conversation and all of its possibilities are very easy,  yet fascinating.  This is a great communication tool.  Rolling along with little pinpricks of euphoria..",
  "T+4:30",
  "Had a sandwich, crackers, leftover pizza and a beer!  Physical load is non-existent, my body needed to eat.  Eating is heavenly.  Starting a movie and going to n2o land occasionally now..",
  "Throughout the movie Im slammed by simple revelations Id never considered before.  The terrorist element of the blue meanies.  The ability to transcend time and work outside of it.  Timeless characters/personalities we are all a part of.  Feeling very satisfied and empathic.",
  "Caught a glimpse of the aquarium as I was walking by and was in awe of the movement within the tank.  Sat on the floor and observed plants swaying in the current, every fuzzy, microscopic growth of algae dancing in patterns.  Fishs gills contain so much depth I cant even explain.  Put my ear to the glass and lose myself in the circulating ocean.  Lay in front of the aquarium for quite a while, grinning, sighing.",
  "T+7:30 (11pm)",
  "Coming down.  Dropoff is pleasant, steady and nearly unnoticeable.  Have had a few drinks and cannabis here and there, and looking back Ive had a wonderful evening.  Here is a low-dose smooth-acting psychedelic with no obstacles or surprises as far as I can see.  Probably mild for some but absolutely perfect for my intentions today, I think I reached a low-mid +++.  This will make a good phenethylamine intro for my wife too.  I can see many weekends of wonder on the horizon.",
  "Today (day after) I feel perfectly fine.  I slept hard for 8 hours and woke up sharp and happy.  Did some work around the house, ate and talked on the phone.  Going out tonight and doubt Ill be coming home early.  This was a directable, sensual 8-hour vacation.  I had a great experience.  No soul-shattering insights or epiphanies this time, but definitely a therapeutic cleansing.  Please use these tools responsibly and hopefully theyll be around for us in the years to come."
 ],
 "erowid": {
  "id": "30229",
  "citation": " santadog. \"Sensual, Easy Fun: experience with 2C-T-21, Cannabis, Nitrous Oxide & Alcohol (ID 30229)\". Erowid.org. Feb 2, 2004. erowid.org/exp/30229",
  "substance": "2C-T-21, Cannabis, Nitrous Oxide & Alcohol",
  "views": "12201"
 }
}
