{
 "id": 4802,
 "title": "From One Extreme to Another",
 "date": {
  "submission": "2001-12-17T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Trisse",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": ""
  }
 ],
 "report": [
  "The experience I had has been one of two of the last times I have taken e, and has led me to be a little disheartened and hesitant in taking anymore for a while. ",
  "My partner s and I were going to a house party where a friend of ours was DJing.  We had a meal about 4 hours previously and had 2 multivitamins each.  We shared what was left in our baggie of crystal meth (which worked out to be approximately .2gm each).  It was good quality speed, so that got us into a bit of a party mood.  We hadn't decided if we were going to have any e, and didn't know if there would be any at the party.  When we arrived, we found that there were pills for sale, so we bought one each and decided to have them when we got home.  They were called blue barrels (W .75cm x H 1cm). We were unable to test them as a fried had our test kit, but we were very old and good friends with our dealer, so the trust factor was very high.  We were having a really good time at the party and had met some really cool people as well as catching up with some old friends, but at about 11 we decided to go home and drop the pills.  Basically, we had the pills, and had a pretty rocking time (although as a longtime, but not frequent user, I feel that the magic has sort of gone from the pills) they took quite a long time to come on, and I felt very groggy and had major cases of trisma, nystagamus as well as bruxia (the latter possibly because of the meth)",
  "The problem I had was next morning.  I only had 5 hours sleep, and woke at 8am.  My partner was still asleep, so I got up.  My head felt like goo, and for most of the morning, my mind was racing and my body felt exhausted.  I went through the conversations from the night before, and analyzed them right down to the punctuation.  I kept on thinking that I had made a fool out of myself, I was saying really stupid things, people were going to think I was an idiot... When my partner finally woke up, I asked him what he thought.  He said I was being silly and I shouldn't think those things.  When I questioned him about how he felt, he just said that he felt like he didn't know his place in the universe.  I felt like that too.   I also went through periods of guilt with regard to having the pill and speed. e.g...'These things really mess my body up, why do I put these chemicals into my body?'  I sometimes have those thoughts, but only fleetingly...This pill just seemed to magnify every thought and feeling I had the next morning.  I was also really pissed that we hadn't tested the pills.  We certainly have learned our lesson and won't take a pill ever again without testing.  Pills make me 'I don't knowish' the next morning, but this was totally rediculous... Maybe someone else has had a similar experience?  Could it have been the pill, or the cocktail of meth and MDMA... Although, I have combined the 2 before, and never had that result."
 ],
 "erowid": {
  "id": "3024",
  "citation": " Trisse. \"From One Extreme to Another: experience with Methamphetamine & MDMA (ID 3024)\". Erowid.org. Dec 17, 2001. erowid.org/exp/3024",
  "substance": "Methamphetamine & MDMA",
  "views": "19530"
 }
}
