{
 "id": 4804,
 "title": "Worst Freakout I've Ever Seen",
 "date": {
  "submission": "2004-02-02T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tripping_2_Orbital",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "9.0",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-E",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "My wife is a very experienced tripper, and our friend that was with us was also an experienced drug user, but niether of them were prepaired for what lay in store for them with 2cE...",
  "Both of them had taken 2cE before, but had decided that they would like a larger dose.  Both of them took about 8-10mg of 2cE along with me, I took around 15mg. We started out the night doing what we always do when we trip, coloring on stuff with high lighters under my black lights.  My wife had had to get up early that day, so she wanted to take a quick nap before the trip really started, so she went to bed right after taking it.  We had the beatles movie 'magical mystery tour' playing, we figured it was an apropriate movie given the nights activities.  We were a little way into when our friend started asking questions, but she could never finish the question, she would stop half way through it.  After a short time they started making less and less sense, and i was quickly recognizing that she was losing it, so i woke my wife to help me.  Within about 10 minutes, our friend was lying on her back, not recognizing me or my wife (we're all REALLY good friends, so for her not to recognize us is very strange). ",
  "She has a habit of biting her nails, so she was trying to bite her nails, but was missing and biting her fingers, then she started biting her arms, legs, anything she could get ahold of.  We got a cold rag and put it on her head, hoping that it would kind of snap her out of it, but it just made it worse.  As the night progressed we could see her seperating farther and farther from reality.  She was starting to freak out like she was seeing scary things, so we decided to take drastic measures.  We stripped her down and put her in a tub of medium-warm water (we didn't want it too hot or cold because that could make her body temperature change which would be very bad).  Not only did the water not snap her out of it, but she didn't even realize that she was in water, i had to grab her to stop her from going under several times.  After a while we gave up on the tub, pulled her wet naked body out of the tub and dried her off.  we dressed her in some loose fitting clothing and situated her on the couch. ",
  "She was still bitting herself, but it was less frequently attempted (i was watching her like a hawk to stop her from biting her self, she already had made some dark bruises on her arms).  We were sitting there talking to her and after a while we started seeing evidence that she could somewhat here us, and she seemed to recognize me.  I was holding her arm and she started to pull it towards her mouth like she was going to bite it, but insted she kissed my hand.  After a while of talking to her and having her keep kissing us (it seemed to calm her and it was helping her come back) she finally snapped out of it.  But she had no recollection of anything that we had done, talking, the bath tub, anything.  Although she was back, through out the night, if she was not constantly talked to, she would slip back.  But when she did she was easy to get out of it. ",
  "I've been with dozens of people when they've freaked out on drugs, but this was the worst i've ever seen.  She had no perception of pain, she was squerming all around (i was afraid she was going to break or dislocate something she was moving so much), at times she started crying, she had no connections with the real world, and nothing we could do could bring her back. ",
  "2cE seems to be a VERY powerfull drug, i freaked out on it myself and i was completely gone for about 2.5 hours.  My wife tried everything she could to snap me out of it and nothing would work.  And while i was gone, the chemical was overwelming my brain, blocking out concious thought.  Its not that i was thinking crazy, i wasnt' thinking at all, i couldn't.  Our friend reported simular things, but she wasn't as gone as i was (i took 20mg and it was my first time with the drug), she could remember what she was seeing during her freakout, where as i have no memory at all of anything that happened when i was gone. ",
  "So in conclution:",
  "2cE is not to be taken lightly, it is a VERY strong drug that must be shown respect.  ALWAYS have a sitter with you when you're on it, because you can be totally out of this world, but your body still has pretty good motor skills. You can and probably will walk around if you lose connections with reality.  When i was gone, my wife said that i got up and went to the bathroom several times and i was walking around the house, and i was completely off in a differant world.  If someone freaks out, there is really nothing you can do about it, just make sure that they're physically ok (they're not hurting themselves, or overheating, or stuff like that) and wait for them to come out of it.  Its a pretty 'happy' drug, i was having the best time of my life when i was freaked out, and so was my friend when she freaked out, so you really dont have to worry about things going bad for them mentally.  Just be alert and use your head.",
  "Trip wisely."
 ],
 "erowid": {
  "id": "30257",
  "citation": " Tripping_2_Orbital. \"Worst Freakout I've Ever Seen: experience with 2C-E (ID 30257)\". Erowid.org. Feb 2, 2004. erowid.org/exp/30257",
  "substance": "2C-E",
  "views": "25838"
 }
}
