{
 "title": "Two-Tone, Pixelated 2-D Reality",
 "author": "Superseed",
 "citation": " Superseed. \"Two-Tone, Pixelated 2-D Reality: experience with Salvia divinorum (10x extract) (ID 48059)\". Erowid.org. Oct 21, 2006. erowid.org/exp/48059",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "145 lb",
 "report": [
  "<p>Last spring, salvia was gaining popularity in my town, and talk of its short duration of effect and variety of interesting effects caught my interest. With the expenditure of $20 and a trip to a local head shop fading in the rear view mirror, I drove into the forest with three friends, one acquainted with the herb, one curious, and one committed to his role of sober sitter.  We descended into the abandoned quarry as glimpses of sun became lower and redder through the pine trees.  When we reached the sandy bottom and unpacked the requisites of our endeavor, twilight was coming down.",
  "My friend  call him N.  took the first hit.  I followed shortly after, and we consulted with each other, arriving at the conclusion that more was needed.  I had not smoked weed at this point in my life.  Trying to describe what I felt after this hit, I said something I paraphrase as, Things are just sort of different.  My head feels larger.  Someone brought up the importance of holding the smoke for as long as possible.  I took another, larger, longer, draw off of the pipe.",
  "This is something.  I tested the waters of this altered reality, swiveling my upper body side to side from the waist.  I saw that the universe was comprised of two layers of transparent gel-like material that my motions were rotating against each other.  The trees surrounding our clearing bent and heaved against the glowing sky.",
  "In my memory of the experience, there is no transition between this perception of the layered structure of ordinary reality and strange next plateau that followed.  I had somehow focused on the ground.  In the fading bluish light, two basic colors filled my field of vision: the cobalt tinted white sand and the murky dark grey of the stunted weeds creeping over it.  What shapes I could discern were warped and flattened into two dimensions.  Sometimes they resolved themselves into exemplars of geometry in motion, or, more specifically, they would construct a level from Super Mario World, with grinning hills and clouds, with platforms gliding by.  All of this I saw through a filter of pixelation. It was not like the neat, stationary matrix of squares that one becomes familiar with through computer screens.  Arcing through two dimensional space were curved tracks in which bean shaped quantanizations of reality glided concentrically past each other in alternating directions. ",
  "As the salvinorin began thinning from my brain, I realized that I could move my body, a thought that had not occurred since the third dimension had evacuated my perception.  I tilted my head, or maybe my eyes, upwards.  N. was in front of me.  His face was discernable as a wide smile and a pair of eyes that integrated themselves into the scenery of Marios super world.  He spoke to me, I understood and tried to reply. No words came.  I had lost the faculty of language; only laughter could come.  N. was asking too much of me trying to communicate  more than was natural.  I could only make a flailing gesture to indicate my disapproval of his behavior.  He laughed, and I laughed.  Then I saw the key.  The pixelation was a soup I was submerged in.  I lifted myself up out of it, and when my larynx was above its surface, I could produce weird speech.  Helpful in treading this water was the circular motion of my hands in front of me, which seemed to pass through each other in their ability to accomplish perfect and complete revolution.  Laughing I would sink down, once again consigned to gurgling.",
  "Eventually I was completely out.  I explained most of my experience to my friends.  Two dimensions. Two colors. Pixelated, not fluid reality.  I was tired, and I walked off to sit down.  I perceived, but did not see visually, that as I walked a trail of light followed behind my feet.  It took effort to bend it, and I preferred to maintain a straight course.",
  "N. had seen lightning coming from the heads of myself and my friends.  This had something to do with the fact that he was Neo from the Matrix films.  J., who had smoked salvia before, finished the bowl.  He uttered, Bad memories, and walked off to the edge of the woods and back again.  He had fought off the trip, motivated by unspoken terror.  P. drove us back into town; we ended up at a small hotel party.  I was still worn out, but content.  The experience was impressive; I knew that I wanted to wait a while before trying salvia again, but planned to at some point in the future.  Recently I purchased an ounce of unfortified dried leaf, but only achieved light effects through smoking it.  Chewing sounds more promising, Ill probably try it soon.</p>"
 ],
 "year": "2005",
 "id": "48059",
 "gender": "Male",
 "views": "8626",
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "submissionDate": "2006-10-21T07:00:00.000Z"
}
