{
 "title": "Tryptamines are Your Friends, You Hope",
 "author": "Mr. Hamilton",
 "citation": " Mr. Hamilton. \"Tryptamines are Your Friends, You Hope: experience with 5-MeO-DMT, Harmala & Diploterys cabrerana (ID 4805)\". Erowid.org. Jan 22, 2001. erowid.org/exp/4805",
 "substance": "5-MeO-DMT, Harmala & Diploterys cabrerana",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.5 g",
   "oral",
   "Syrian Rue",
   "(tea)",
   " T+ 0:30",
   "8.0 g",
   "oral",
   "Diplopterys cabrerana",
   "(tea)",
   " T+ 0:30",
   "1.0 g",
   "oral",
   "Syrian Rue",
   "(seeds)",
   " T+ 1:00",
   "20 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I'd read about all the interesting tales of ayahuasca and thought that I might be ready for a powerful experience so I decided to brew my own.  Having just moved to the area a few months ago I don't really have a net of friends setup for psychedelic drug usage so the following experiance was all me.</p><p>It was a saturday, and I spent all day gathering the supplies needed to brew the mixture: food processor, scale, pan, lemons, and Vitamin C tabs.  The recipe was a synthesis of about all the others I'd read.  First I ground 2.5 grams of syrian rue seeds and boiled them in 1 cup of water made acidic via lemon juice and a vitamin C tab.  I let that boil for roughly 10 minutes, then I filtered out the Rue, and reboiled it in fresh water.  Then I filtered again, and drank the brew.  It didn't taste that bad, to all the people that complain I say 'overwhelm the taste with lemon juice', hey it worked for me :) Most refs said to use 10 grams of Diplopterys Cabanera leaves but being the cautious person that I am I only used 8 grams.  The leaves were shredded and and processed in the same manner as the Rue, except 2 cups of water was used per extraction.  After 2 extractions the volume was simmered down to 2 cups and drank.</p><p>I feared the MAO inhibition might not have been enough so on a whim I put a spoon full of Syrian Rue seeds down the hatch.</p><p>I waited 20 minutes, nothing.  30 minutes, minor visual disturbances, nothing spectacular. </p><p>Determined to salvage this trip I put on my best ambient psychedelic trance (ie. Are you Shpongled yet?, TIP: Mystical Experiences, Atmos Headcleaner),  relaxed, pulled out my new smoke bubbler (basically a 20 dollar lightbulb with a built in straw for smoking pure chemicals) put ~20 mg of a substance which I'd never tried, 5-methoxy DMT, in and proceeded to toke the bitch.  Soon (ie 5 seconds) the drug hit me like a freight train forcing me to put the pipe down, close my eyes and concentrate on the art of breathing, for fear that if i didn't I'd stop breathing :) It felt great but I hadn't approached ego-death.  Ego-death has rocked my world twice on acid, and really really scared me.  I could feel the painful tugging, but I was unprepared to let go, so I merely let the effects of the 5-MeO wear off a bit.  The 5-MeO really really engaged the DMT and my body felt wonderful.  No nausea or chemical nastiness of any kind.  Just me, my energized body, great trance music, and beautiful kalidoscopic visuals (OEV and CEV)</p><p>I smoked more 5-MeO, but it only made me mildly higher.</p><p>By 3 hours I was almost fully down from both substances.  So I left my room and watched the brain eating filth box (aka TV) for about half an hour.</p><p>All and all I was hoping the experiance to be stronger with more significance.  But I fear that at a higher dosage my ego will be ripped to shreads and I'll have a terrifing 5 hours of saying 'why the fuck did i do this'</p>",
 "year": "2001",
 "id": "4805",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-01-22T08:00:00.000Z",
 "views": "27547",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(tea)"
  }
 ]
}
