{
 "title": "I Think I Almost Died...",
 "author": "Evil Pookie",
 "citation": " Evil Pookie. \"I Think I Almost Died...: experience with Mushrooms (ID 48062)\". Erowid.org. Sep 10, 2007. erowid.org/exp/48062",
 "substance": "Mushrooms",
 "bodyweight": "250 lb",
 "report": "<p>Most of what I can say is that I took WAAAAAYYY TOO MUCH.  It's taken me this long to be comfortable with talking about my experience.  It was my 21st birthday and my wife had decided to get some mushrooms for the occasion.  We dabbled and took a cap here and there to get ourselves used to it - mainly experienced a 'buzziness' and dialated eyes.  When my birthday came around we boiled down about 25 caps into this substance that looked like motor oil.  It tasted terrible.</p><p>I have a cast iron stomach, I never got nauseated.  My wife and neighbors on the other hand all vomited - I wish now that I had.  About 30 minutes after ingestion I knew that I had taken way too much.  Instead of your the slight change in mood and occaision sense distortion the others were feeling, my visuals were so intense that I could no longer orient myself in my own house.  It was worse than blindness. Sounds were completely distorted - words would no longer process. The worst thing about the experience was that all of my rational concepts - like how time moves linearly, our circulatory systems, how life is not eternal in this package, they no longer made sense.  This was really frustrating. It was so intense and terrifying that I wanted to end my life in order to make it stop.  It was like a panic attack with the fear that you suffer really present.  For instance, I was scared that demons were going to kill me and replace me with a demon duplicate so that evil could rule the world in my place (sounds a little strange, I know...); but not only was the fear of this happening messing with me, the demons were really there!!!</p><p>After about 2 hours after ingestion, my wife told me that I collapsed after saying something about a mental hospital - she used an electronic thermometer (no glass) to check my temp (orally).  It was 104.1!!!  She with my neighbors made an ice bath where they were able to help me break the fever. The strangest thing was that after about 4 hours from ingestion, I completely snapped out of complete delusion - no more fever, buzziness, euphoria (except from that knowledge that I was still alive) - only the slight distractions in the corners of my eyes.</p><p>I talked to a friend of mine who is a medical doctor couple of days later - I had burst blood vessels in my eyes from high blood pressure during the experience.  He stated that I had survived an overdose and was very lucky to be talking to him about the experience. [Erowid Note: The author could have had a severe allergic reaction to something else in his material, or just an unusual reaction to the stress of the dose, or some other unknown reason.  He might be lucky to have survived, but the suggestion that there is commonly a risk of death from taking psilocybin mushrooms is false.]</p><p>If anyone ever has to go through what I went through mentally and/or physically that night, I feel so bad for them.</p>",
 "year": "2002",
 "id": "48062",
 "gender": "Male",
 "timestamp": "2007-09-10T07:00:00.000Z",
 "views": "3883",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  }
 ]
}
