{
 "title": "An Unpleasant Alternative?",
 "author": "Bear",
 "citation": " Bear. \"An Unpleasant Alternative?: experience with Buprenorphine (Subutex) (ID 48086)\". Erowid.org. May 11, 2006. erowid.org/exp/48086",
 "substance": "Buprenorphine (Subutex)",
 "bodyweight": "57 kg",
 "header": [
  [
   "DOSE:",
   " ",
   "IV",
   "Pharms - Buprenorphine"
  ]
 ],
 "footer": [
  [
   "2005",
   "48086",
   "Male",
   "",
   "Not Given",
   "May 11, 2006",
   "31443",
   " "
  ]
 ],
 "report": "<p>This drug can be useful for withdrawing from opiates or as an alternative to street heroin or other opiates. I feel my own experiences could provide solidarity perhaps for other users who have tipped the balance of sensibility... OK, now for my History:    </p><p>I have been continally prescribed 12 mg per day of buprenorphine (subutex)  as an alternative to methadone or a street heroin addiction for the last three years, before which I was a heroin addict for one and a half years. For the first year or so I just took 4mg per day sublingually and found that this held me, i.e.- stopped me from feeling withdrawal symptoms, for between 24-30 hours per dose. During this time, I discovered that although Buprenorphine did inhibit the effects of opiates, this greatly depended upon the dose; the individual, and the time elapsed after taking the dose. Simply, the higher the dose taken, the more effective at blocking other opiates for longer. </p><p>I am sure that it could be considered `dangerous` for people to take benzodiazepines with buprenorphine, but I have taken large amounts of each, on many occasions, as have many people I know, and experienced nothing worse than the usual sedating effects of the benzos. If you have no tolerance to Opiates or Buprenorphine, it could be dangerous for people who aren`t used to it to mix it with too many benzos.</p><p>Amyway, onto a much more previously unmentioned subject, is the intravenous use of buprenorphine. I was injecting 12mg of Bup three times a day for a few weeks (before I went back on smack to stop fucking myself up, and now I have been on 4 x 2mg hits a day for about three months, but, hey!!), and found that it makes my veins very unelastic, hence I rapidly discovered the best way to prepare this drug for injection to minimalise bodily harm, although it is NEVER harmless to inject this stuff.</p><p>Anyway, as follows I:</p><p>1) place the appropriate dose of subutex or bup in my nice clean spoon. </p><p>2) Add the correct amount of water so that I will be able to hit up in the appropriate quantity in one go, and then mix well with, preferably, the cap of a sterile works until I can feel no crumbs or grains in the spoon, within reason.  </p><p>3) LEAVE FOR AT LEAST HALF AN HOUR for the impurities to settle, or as long as I can, then</p><p>4)  Get a clean filter, from a straight or a filter tip for a home-made, and cut a thinnish slice off it as I would a Swiss roll, so I still have a full width bit, but not too long. </p><p>5) Drop this widthways into the centre of the spoon, so that the fibres run horizontally, and then proceed to slowly and carefully draw up the liquid through the filter. I should find that most of the impurities stay at the base of the spoon. </p><p>6)  Whilst Intravenous injection is certainly not good for me, injecting into skin or muscles has been shown to lead to a high chance of developing abscesses on those sites. I have injected this stuff, foolishly, a great deal intravenously, missed a few times, but never had an abscess, although, it is bad for my overall circulation, veins, and spare a thought for the kidneys. </p><p>It`s usually only worth doing if I'm so ill withdrawing from opiates then it can`t get any worse, but everythings relative and everybody`s different, so hey, this is my contribution anyway.</p>"
}
