{
 "title": "Experiences from a Head",
 "author": "Lecherousmetro",
 "citation": " Lecherousmetro. \"Experiences from a Head: experience with Yerba Mate (ID 48126)\". Erowid.org. Jun 14, 2006. erowid.org/exp/48126",
 "substance": "Yerba Mate",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Yerba Mate",
   "(tea)"
  ]
 ],
 "report": "<p>I see it as a kind of natural 'energy drink', one that I think works more pleasantly, effectively, and safely than all of that over priced, super-charged, sugar coated caffeine in a little can that people are sucking down like water these days.  My experiences are the same.  Mate gives me good, sustained energy, mental clarity, and a good mood, without feeling 'jittery' or 'amped-up' like even relatively small doses of green tea or soda will do to me. I have once or twice drank a little too much on an empty stomach, and gotten a very caffeine like effect, but this is rare with Mate, and doesnt seem to feel so bad coming down.</p><p>As for the taste, I personally found it very palatable from the get-go (more so than coffee or tea), but I can see where it could be a very acquired taste for some. Different brands of Mate have subtle taste differences. </p><p>I have scored it in small Middle Eastern markets, sandwiched in between hookah tobacco and Turkish tea, as well as Oriental markets.  In fact, the giant Asian supermarket down the street from me here has just added an 'argentine' sub-section to their 'Latin foods' aisle, and they have literally about a ton of it, all different brands.</p><p>I have had it in a teabag, from a mesh teaball, a French press, as well as the traditional gourd and filter straw.  I have to say that I could form a kind of usage spectrum with the teabag being the least enjoyable (but most convenient) method, and the gourd and straw as the most enjoyable (but least convenient) way.  The magic middle ground is the French press.  The consistency and flavor it brings out is great, and I can use the press for the occasional cup of coffee, without having to own a coffee maker, or for making homemade herbal teas.  </p><p>The traditional method is really cool, directly passed down from the natives of the forests where it has always grown, and deeply ingrained into the culture of modern day southern S. America. It does fill a void left since the Cannabis plant really started to disagree with me many years ago, and is, in my opinion, a much healthier plant to be ingesting on a regular basis. </p><p>One last note, because of the way Mate is dried and aged; I will always get some amount of sediment in my cup, no matter how fine the filtration is.</p>",
 "year": "2005",
 "id": "48126",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-14T07:00:00.000Z",
 "views": "9589"
}
