{
 "id": 4815,
 "title": "Never Again",
 "date": {
  "submission": "2007-11-11T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nico",
  "gender": "Male",
  "weight": 102
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  }
 ],
 "report": [
  "A week before I was going to try it, I picked up 8 packets of morning glory seeds from a local grocery store.  I got 5 packets of Heavenly Blues, two Flying Saucers, and one Pearly Gates.  When I got home, I emptied all the seeds into a wire strainer and rinsed them repeatedly with dishsoap and water.  I spread them out on a paper towel and let them dry.  That night I ground the seeds up in a coffee mill and dumped the pulp into a mason jar.  I then added enough Naphtha (Zippo lighter fluid is a good source) to submerge the pulp and screwed on the lid.  I let this soak for two days, shaking every now and then.",
  "On the third day, I poured the mixture through a Bunn coffee filter.  Bunn filters work by gravity alone unlike some other coffee filters that require steam pressure from the coffee pot.  After I squeezed out all the naphtha that I could, I flattened the filter and spread the pulp out on it to let it dry.  Three days later I was left with a fine grayish powder, and the petroleum smell had disapated.  I then dumped the pulp back into the mason jar (after I cleaned it out), and this time covered it with about four shots of 151 rum.  I let this sit for a day, again shaking occasionally, and then poured this mixture through another filter.  The resulting rum mixture I saved.",
  "The next night was a Friday, so I took my magic rum mix over to a friends house.  Like me, nobody there had any experience with morning glory and were a little weary, so I decided to be the lone guinea pig.  I first mixed up a small shot into a rum and coke and drank it down.  I waited about half an hour, then drank another slightly larger shot in orange juice.  We all sat down to watch movies.  The effects came on slow and were minimal.  After about an hour I felt tired and dreamy, almost like a marijuana high except my thoughts were clearer.  I waited a couple of hours, afraid of having a bad trip, then drank another shot in coke. ",
  "At that point, I was afraid that the chemistry that I was so careful with had removed all the good stuff along with the bad stuff.  At least I didn't have the horrible abdominal cramping, nausea, and vomiting that I heard reports of.  So, I considered it a waste of about $15 in seeds and asked my friend for a ride home.  I think I was clear enough that I could have driven, but I didn't want to risk it.  On the short drive to my apartment, I got terrible cotton mouth.  I also started feeling really tired.  Visuals were still very limited, so much so that I wasn't sure if it was placebo effect or not.  Then I noticed that I had lost some depth perception.  Climbing the stairway up to my apartment, I realized that I had lost my sense of balance.  It was like I was drunk, but clear enough in the head to be frustrated at my stumbling.  I party pretty hard and I'm a big guy, so the amount of rum that I had would normally be barely enough to give me a buzz.",
  "After I got to my apartment, things get really hazy.  The few memory fragments I have are so jumbled that I'm not really sure what happened.  I woke up the next morning and my first thought was 'Who the fuck has been in my house?'  My folded socks were out of the drawer and strewn all over my living room.  Everything on my cluttered desk was now all over the floor.  I was sleeping only under a blanket, my sheets were hanging up on the bathroom door.  My bedroom floor was wet and my bathroom floor was green, I later found out to be spilled mouthwash.  I later found the empty mouthwash bottle in my microwave.  I saw blood on my bed and found a large gash running across my thigh.  The water glass that I always keep near my bed had a mysterious green bottle cap in it.  It took me a week to find out that it was to my rice wine vinegar.  Apparently I opened a new bottle, drank or poured out some of it or who knows what, and put the cap in my glass. ",
  "All this was at least tolerable, comparable to a very heavy night of drinking.  That isn't why I'll never do this again.  When I woke up, I realized that I couldn't read my watch.  No matter how hard I tried, I couldn't focus my eyes.  It was one of the scariest moments of my life.  I was effectively blind to things at close distance.  I could make out blurry images, but I couldn't even see well enough to make breakfast.  Strangely, if I looked out the window in the distance, everything was clear.  This wore off gradually over three days. ",
  "So, for three days I couldn't read and I certainly couldn't drive.  Over that time, I recovered a few memories from that night.  I remember tripping and falling over my dog's wire kennel, which must have been where the cut on my leg came from.  I also remember sitting in on the bathroom floor in the fetal position crying because I heard angelic music.  I'm pretty sure that while I was on the floor I wasn't getting visuals, but I was very dilusional.  I remember thinking that I was close to death and the music was trying to bring me in.  I have a feeling a neighbor was playing music but my mind made up the rest.  In any case, blindness and blackouts are not my idea of fun and I'll never do morning glory again."
 ],
 "erowid": {
  "id": "30307",
  "citation": " Nico. \"Never Again: experience with Morning Glory & Alcohol (ID 30307)\". Erowid.org. Nov 11, 2007. erowid.org/exp/30307",
  "substance": "Morning Glory & Alcohol",
  "views": "4887"
 }
}
