{
 "id": 4818,
 "title": "Dexofan Stupidity",
 "date": {
  "submission": "2004-03-05T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "mGoLos",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "A while ago I heard that you could high if ate a bunch of Dexofan, at the time I didn't really care because I was smoking hash daily. Three beers and a joint always messed me up worse than anything I can think of.",
  "A few months ago I stopped my abuse and soon the restlesness and the boredom took over. So I bought 20 pills of dexofan, each containing 30mg of DXM. I rented tombraider II, turned on the lavalamp, found my notebook and got comfortable on the sofa. I swallowed ten pills with some orange juice and watched angelina jolie for a while, she is very hot in the skintight suits.",
  "+15 min. My stomach is a bit upset. This may be caused by anxiousness.",
  "+30 min. Something is going on, but I'm not sure I like it yet. Feeling a warm sensation in my body and still my stomach is a bit upset. This feeling continues for about another hour. In many ways it reminds me of the very familiar hash feeling.",
  "+2 hrs. I'm not liking this at all, I feel extremely strange, my motorskills are shot, walking is near to impossible and when I open the door into my well-lit hallway I am nearly blinded. I feel like I'm extremely drunk, but still being able to focus and stand up. Nothing seems to hold my interest and I decide to go to bed.",
  "+2.30 hrs. Something weird happens. I switch realities, my mind thinks I am walking in the city looking for something and suddenly it is real and when my mind switches thoughts I find myself very surprised that I'm lying in bed. This happens four times before I fall asleep.",
  "+14 hrs. I wake up, I feel dull and slow, walking still takes a bit of effort and my head hurts. My cat must have been trying to wake me, because I forgot to feed him. However I dont remember waking even once.",
  "In conclusion, this was a stupid exsperiment and one I will never repeat. The effects were present, but they were not desirable. But at least I wasn't bored last night. There are better drugs out there and for now I will merely wait for my 5-MeO-AMT to arrive."
 ],
 "erowid": {
  "id": "30312",
  "citation": " mGoLos. \"Dexofan Stupidity: experience with DXM (ID 30312)\". Erowid.org. Mar 5, 2004. erowid.org/exp/30312",
  "substance": "DXM",
  "views": "15587"
 }
}
