{
 "id": 482,
 "title": "A Day of Bliss",
 "date": {
  "submission": "2002-02-22T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Stato",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "AMT"
  },
  {
   "time": "0",
   "amount": " T+ 5:00",
   "administration": "3.0 g",
   "substance": "smoked"
  }
 ],
 "report": [
  "<p>My friends and I have lately decided to escape the world of just marijuana and to expand our minds using psychoactive agents.  Almost all of us had done mushrooms and LSD, so we figured lets try some other research chemicals.  A friend had recomended AMT and 2CT2 to me about a week earlier so I figured why not.  He told me that it would take about 2 hours to peak and would last about 15 hours including the coming down stage.  I planned my day on a saturday.  I figured I would get a good nights sleep so that I would have the energy to deal with any effects it may cause.",
  "I awoke at about noon, took the gel tab, and ate some breakfast.  About a half hour had gone by now, so i decided i'd jump in the shower.  I did so and then got dressed.  I called some friends and asked them if they would like to chill for the day.  I made sure to have one friend with me who I knew would know how to help me if I started to 'Wig out'.  We went to a house that i was very comfortable in and had no authority figures around who would be disgruntled at my experimenting with the chemical.",
  "It started to kick in at about 2 o'clock.  My vision became blurred to some extent but not bad, and as with other hallucinogens everything moved rather wierd and kinds of constantly rocked, like I was on a boat.  I sat there and allowed myself to drift off into my own world and fall into a more sub-concious state.  I decided this would be best to do in a room where i would have some privacy and some music that tends to set you a drift.  As I fell into this state I began to think of how I would like things to be and what direction I wanted to head in in life.  As I did this I could visualize as clear as day, the situations that I wanted to arise and was able to see what it was that I had to do in order to achieve the things I want to achieve in life.",
  "Soon I was fealing like I was on top of the world.  I saw what could become of me if I really strived for it and now I had a euphoric sensation.  I decided to join my friends for a bag of grass.  We smoked about an 1/8 of marijuana.  This, to my dismay, posed as a problem as the high overpowered the trip.  However as soon as the high went away it was a full on effect of the AMT again.  Everyone became hungry around 7 o'clock so we decided to take a ride and get some food.  We chose a relaxed environment (an Applebee's) and we ordered some food.  I was able to eat my whole meal with relative ease and had no symptoms of nausea what so ever (this may be an effect of marijuana being used as a means of preventing nausea as it is in kemotherapy patients).  The ride home was also quite enjoyable because I was with a young lady who really enjoyed a good cuddle.  This brought about a broad sense of love for everyone and everything (especially the young lady).  The effects were some what similar to the effects of MDMA.",
  "I smoked a couple cigarettes that day, however the ammount I smoke was significantly lower than ussual (not that they made me sick, but I just didnt seem to want them; maybe AMT can help you quit smoking.?!).  Later that night I returned home where I was alone.  I sat down and watched a movie(The Emperors Groove)and when it ended i put on a CD (Translucent Mix 2001) and began to ponder how society would be if we all treated eachother with equal respect.  This brought about a sence of belonging as well as a visual of how it would be to sit down with people with whom I have quarelled and had a decent civilized conversation as well as shared some marijuana.",
  "The trip lasted me till 3 a.m. at which time I went to sleep.  When I awoke the next morning I had full memory of what had happened the previous day, I felt no side effects (nor addiction), and was in an all together better mood than I ussually am in the morning.  To this day when I am asked what it was like I respond 'What it was like for me, may not be what its like for you, however the best way to describe it, is 15 hours of pure bliss'.</p>"
 ],
 "erowid": {
  "id": "10928",
  "citation": " Stato. \"A Day of Bliss: experience with AMT & Cannabis (ID 10928)\". Erowid.org. Feb 22, 2002. erowid.org/exp/10928",
  "substance": "AMT & Cannabis",
  "views": "6979"
 }
}
