{
 "title": "4 Years Later & I'm Still In The Hole",
 "author": "Mystyx",
 "citation": " Mystyx. \"4 Years Later & I'm Still In The Hole: experience with Methamphetamine (ID 48206)\". Erowid.org. Feb 16, 2008. erowid.org/exp/48206",
 "substance": "Methamphetamine",
 "bodyweight": "130 lb",
 "report": "<p>It all started one weekend when a 'friend' came down to our little town and brought with him a party. Being naive and not wanting to say no, I tried what he had for me...a big line of crystal meth. I never thought that I would ever put something up my nose, but for some reason that summer night I did. So began the most trying years of my life. My friends and I used meth every second weekend that summer, and by the time fall came, we were doing it every day. During that period, I would sleep a night, then stay awake a night. Some of my friends would resist sleep for days until they entered a waking dream state and their body basically forced them into sleep. The downs were a horrible experience for me, especially if I did not take care of myself while I was tripping. Because of meth's ability to suppress normal drives such as hunger, I would often go all weekend without thinking to eat or drink anything.</p><p>In order to stop using every day, I had to lock myself in my room for over a month, doing nothing but eating and sleeping. At this point in time, I did not have a steady job, which is not suprising, as one can not be expected to hold a job when they cannot form a sentence of more than three words.</p><p>The next cycle I faced was every three days. After that, every three weeks, where I would manage to stay clean for almost 21 days before starting it all over again. The time in between using was a constant struggle, meth was at the front of my mind constantly, tempting me. Next came an approximatly three month cycle, and this is where, four years after I snorted my first line, I am stuck today. My record of staying clean is five months, and that only happened once.</p><p>I can honestly say that from the second time I used meth to now, all I have ever wanted to do is to STOP. Every time I use meth, the weight of my addiction gets a little bit heavier. Trailing behind me as I wade through my days are a stream of broken promises and the knowlegde that one day soon I will once again trip and fall. Fall back into the grind, trip right back into the endless nights and the embarassing moments that follow in the days to come as I try to unsuccesfully hide my exhaustion.</p><p>I have managed to acquire and keep gainful employment, even a job or two that I like. But sometimes when I show up to work wide-eyed and brainless - due to a visit from my old friend meth the night before - I wonder how many people notice the sudden change in me, and I am filled with shame.</p><p>The friends I once tripped with have grown distant, even though they were the best friends I ever had before meth came and tore us apart. Some of them have managed to quit using, but only by moving out of town and cutting their ties with the rest of us. Some are where I am, caught in a vicious cycle with no end in sight. The 'friend' that introduced us to meth in the first place remains the most affected, sometimes binging for months at a time, losing employment and more importantly, credibility. I know that I am to blame for taking those first lines and for everything that followed, but it seems to me that if somebody has a disease, and they know how bad it is, that they shouldn't want to go around spreading it.</p><p>The worst part about addiction is the lies. The lies I tell myself as I promise for the hundredth time 'I will never do meth again!'. The lies that I tell to my friends and my family when I say I am 'doing well' in regards to my drug addiction, and that they should not worry. The lie in my heart as I pray to God, with whom I once had a very close relationship. Lies, lies, lies. The result of this constant deception is that I no longer trust or believe in myself, and in this I find the most horrible truth of all: the further you go, the harder it is to get back. Every day it gets harder for me to remember why I want to stop.</p><p>One rarely listens to the part of them that can sense a crossroad along life's path, some don't even realize that voice exists. I heard the warning, but the action seemed so inconsequential that I overlooked it in favor of a good time.</p>",
 "year": "",
 "id": "48206",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-02-16T08:00:00.000Z",
 "views": "6329",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "",
   "substance": "Methamphetamine"
  }
 }
}
