{
 "title": "Moonflowers: A few Bad Experiences",
 "author": "N",
 "citation": " N. \"Moonflowers: A few Bad Experiences: experience with Brugmansia (ID 48224)\". Erowid.org. Mar 14, 2006. erowid.org/exp/48224",
 "substance": "Brugmansia",
 "bodyweight": "60 kg",
 "report": "<p>I have had a few personal experiences with Moonflowers. I took ten white flowers (a dose way above the 'recommended') boiled them in 200ml water and added 100ml milk afterwards. This was at about 7pm.</p><p>The first (approx.) hour was all waiting, but somewhere in the following hour I became extremely incoherent. The last thing I remember was shading my eyes from the brightness of the street lights. Apparently, I had run into to the road and was duly run over.</p><p>The night in hospital was hell...for everyone else that is. I had become a madman, security having to hold me down. I had almost lost my life in the crash, yet I was oblivious of any pain or discomfort.</p><p>The next morning the hallucinations were still running rife. I smoked imaginary cigarettes that would constantly fall out of my fingers or disintergrate into sand. I couldn't recognise my own mother and my mind had somehow convinced itself that I was at home in my bed and everybody in the room was just strangers in my room, even though I couldn't remember where the sores on my ankles and head had come from. I only became 'fully' coherent at about 8pm the night after I had consumed the flowers. Strangest thing was that I couldn't read for about three days, the letters were just one huge blur. The problem with this stuff is that there is no way in which one could tell the difference between a hallucination and reality.</p><p>Now you might say that I took way too much, but then again this wasn't the last trip I experienced. After hearing about my experience, a friend who had thought my story was very funny, declared that he also wanted to experience this trip.</p><p>Knowing that I had taken way too much last time I prepared a 'much softer' batch. I took three flowers, some hot water and just softly pulped the flowers for about a minute. I then rewarmed this and made coffee out the concoction. He drank it at approximately 8pm. My friend spent his entire trip at my house, luckily for him. I never expected him to become so tripped out. At first he seemed fine, for the first 35 min. He went to the bathroom and didn't come out. 20 minutes later his brother and I went into the bathroom and found him lying inside the bath. He couldn't walk, couldn't speak (although he constantly seemed to mumble things), but I could see in his face that his mind was working overtime. The hallucinations were too strong for him to handle. He wet himself twice that night, and did not sleep for one second.</p><p>The trouble came in the morning though, because by now his body had 'come to'. He was able to walk, but his speech was still impaired, and yet the hallucinations were still running his mind completely. He knocked things over everywhere and was having a 'hectic conversation' with my mother (who couldn't understand a word). He kept on speaking about horses standing in my garden and wanted to open the doors. This was at about 8am. About 2 hours later (when the hallucinations began to calm down and his ability to speak had fully returned) I began to 'experiment' on how his cognitive mind was working. Well... it wasn't. Simple math sums, like one plus one and five hundred plus five, posed a huge problem to him. His inability to tell me his own or mine or his brother's or his father's names also really bothered me.</p><p>This, unfortunately, was not the last time the 'drug' was used by a friend. I've had a few more who fell victim to their use of this plant, and each and every one of them ended up in hospital or jail. One of my friends got 'lost' in a large stretch of veld not too far from his house and spent almost the entire weekend falling around in the veld. The latest 'fool' wasn't so lucky, it does not seem as if his mind will fully recover from the trip. He resides in an institution until his mind recovers, if it does. I say 'fool' because this was a friend who knew what had happened to everybody else (only bad experiences), but still took the chance and he..., well, paid the price.</p><p>I'm submitting this as a warning to others. PLEASE don't mess around with plants or any other substances you know nothing about. Just because it's natural does not mean it won't screw you up or kill you. Most of the alkaloids in plants are natural defense mechanisms against plant feeders, so they are poisonous. I am not saying don't ever try anything at all, but you have to know what you are getting yourself into, if you care about your life and your mental health.</p>",
 "year": "2005",
 "id": "48224",
 "gender": "Male",
 "timestamp": "2006-03-14T08:00:00.000Z",
 "views": "24237",
 "dose": []
}
