{
 "id": 4823,
 "title": "A Stimulated Night",
 "date": {
  "submission": "2007-01-14T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nortyy",
  "gender": "Male",
  "weight": 83
 },
 "dose": [
  {
   "time": "0",
   "amount": "108 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:25",
   "amount": "54 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  },
  {
   "time": "1:55",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "1:55",
   "administration": "smoked",
   "substance": "Opium",
   "form": ""
  },
  {
   "time": "5:23",
   "amount": "54 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "Total Dosages throughout the night:",
  "Methylphenidate(Concerta)=216mg (108mg Oral, 108mg Snorted)",
  "Cannabis=1 pipe bowl(glass pipe)",
  "Opium=1 pipe bowl(smokedat same time with Cannabis)",
  "Setting:",
  "Parents are out for entire night drinking/partying with freinds.",
  "My Brother is out with his freinds and I have no idea when he will return. He's 13y/o and doesn't use any drugs but doesn't mind if I do.  So house is to myself for the most part and it's a Friday night.",
  "About Me:",
  "I'm 16y/o, about 6ft tall and 184lb.  My drug history consists of Cannabis, Opium, most all of other opiates, except herion, DXM, LSD, Mushrooms, Adderall, Diphenhydramine, Alcohol, and some others I left out. My mood is happy, relaxed, and just all around good.  I've done Methylphenidate numerous times before just not as high dosage.",
  "Experience:",
  "At 4:20 P.M. ;-), I cut 2 Concerta 54mg pills in half getting rid of the green sponge part.  I swallowed the 2 white halfs with a glass of water.",
  "4:35: I feel the first effects of the Methylphenidate.  Noticable increase in sex drive, warmer, and mood lift, some euphoria.",
  "4:45: I crushed and snorted 54mg.  Right away my chest gets warm and tingly.  I get a pleasent dizziness and a even more increased sex drive.  My mental awareness is at its maximum.  I feel very energetic, warm, and euphoria.  I feel like a million bucks!",
  "5:00:  Going great!  I feel so happy, I'm just going around the house to walk.  The music is on and is awesome.  I pet my dog, he seems as happy as me!",
  "5:30:  Same effects as before but little stronger.  I think the 108mg I took orally is nearing its peak.  It's like the Methylphenidate is coming in waves or intervals, it just feels so good.",
  "6:00:  I got my pipe, Cannabis, and some Opium I plan to smoke in a short while.  I read up and asked some freinds and it would be fine to mix the Opium with Methylphenidate.",
  "6:15:  I have my pipe packed, with a little opium on top of the weed.  The Methylphenidate has peaked for sure and is staying steady. I now leave to smoke in my garage. I shall return!",
  "6:38:  Just got back, The high is great, usually with weed and opium I get really lazy and barely move, but now I feel very energetic, incredibly happy, high euphoria, also body high is amazing.",
  "7:15:  I ate some Oreo's and milk and it went down very nicely.  I can actually feel the ritalin through the THC and opium.  Still energetic, no feel for sleep at all.  Playing rave techno music and I'm dancing to it.  I feel like a Billion bucks now!",
  "7:53:  I can tell the Methylphenidate is starting to come down.  Not as energetic, and just don't feel the unique buzz of the Methylphenidate as strong anymore.  The Opium is going down to.  The pot is still keeping a strong buzz, which is making the Methylphenidate comedown much easier to handle.",
  "8:00:  I feel easily agitated, I have the urge to do more Methylphenidate.  I don't wanna return to baseline.  The THC stills feels great though!  It's keeping my mood happy as I still comedown on Methylphenidate. Thank god my comedowns don't ever last longer then 2 hours, even at large doses.  I'm also having weird stomach feelings, they're not painful or anything they just feel weird and kinda tickle.",
  "8:41:  Well the Opium is pretty much worn off, it usally only lasts about 2 hours with me.  The THC is still buzzing pretty good and the Methylphenidate is coming down slower than usual.  I don't feel like shit but have the urge to snort another 54mg.  My heart beat average so far has been about 100BPM.  I'm really thinking about snorting or swallowing another 54 mg.",
  "9:00:  My girlfriend called and is coming over.  I still have enough energy to clean up the house(Dirty clothes and shit laying around).  This has actually put a mood lift knowing that shes coming over.  And my brother is gonna sleep at a friends house for the night.",
  "9:20:  Well the Opium is gone, the THC is hanging in there and the ritalin has comedown.  My girlfriend has arrived and I crushed her 2-54mg pills and she sniffed both.  She said almost right away she could feel a buzz coming on.",
  "9:43:  I couldn't resist, I snorted one more 54mg, I got the warm chest again, the increased mood, ebergy, and mild euphoria.  My girlfriend seems talkative, energetic, and I think both of us have increased sex drive :-).",
  "10:00:  My girlfriend and I made out a little which really does seem better on Methylphenidate.  The buzz is going pretty good for only 54mg.  My girlfriend wants to have sex, but I don't wanna because I'm afraid my heartrate will increase way to much.  It's going steady at 100BPM, sometimes jumping to 120-110BPM.",
  "10:43:  During the last 43 mins. I relaxed on my bed as I let my girlfriend masturbate me for a about 15 mins. I could really feel my heart going and the sensitivity was increased but not by much.  Though then I masturbated my girlfriend and either I seemed to do a better job or she felt much more sensitive.",
  "10:50:  We've decided to go to her house and spend the night there.",
  "Summary:",
  "It was a great expierence! Doing other drugs while doing Methylphenidate was fun to try.  But I would rather just take Methylphenidate alone then with other drugs."
 ],
 "erowid": {
  "id": "30332",
  "citation": " Nortyy. \"A Stimulated Night: experience with Methylphenidate (Concerta), Cannabis & Opium (ID 30332)\". Erowid.org. Jan 14, 2007. erowid.org/exp/30332",
  "substance": "Methylphenidate (Concerta), Cannabis & Opium",
  "views": "31460"
 }
}
