{
 "title": "Enlightenment",
 "author": "violator c",
 "citation": " violator c. \"Enlightenment: experience with Mushrooms (ID 4831)\". Erowid.org. Jan 4, 2002. erowid.org/exp/4831",
 "substance": "Mushrooms",
 "bodyweight": "151 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " T+ 2:00",
   "1.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>\nAround 8:20 p.m., I put my dried mushrooms on a scale and weighed 1.5 grams. I then put them into a coffee grinder and ground them up into a fine powder and put them into gel caps. I took all of the caps and then waited for them to take affect.</p><p>After about an hour, I was getting this weird stoned feeling in the front of my head. Lights had weird auras around them and I felt a peace within myself. After 2 hours had passed, I didn't get any extreme hallucinations so I took another gram.</p><p>I went into a dark room and listened to a cd called Euphoria 4. As the music played, I saw snakes coming from underneath the door. I closed my eyes and I saw a pyramid and I saw a jungle overlooking it. I opened my eyes again and I kept seeing more snakes. I got this feeling as I was listening to the music and the next time I closed my eyes, I saw Aztec style art and I let it engulf me. It was a great feeling as if I could let go of everything else and be in a totally different place. I saw neon pink, green, and orange wheels turning with faces all smiling at me. The faces then turned into evil sadistic faces and they all had their features warped: their kind eyes became enlarged, their noses became twisted, and their smiles became gaping mouths full of sharp teeth. This scared me and all of a sudden, I felt a horrible feeling and so then I immediatly opened my eyes.</p><p>My watch had such a weird green glow to it and so I focused on it for a while. The hour markers re-arranged themselves so that they formed a smile. I smiled back and then the smiled warped and changed into a horrific mouth with sharp pointy teeth. I took my eyes off of my watch and by that time, the cd was over so I left the dark room.</p><p>The rest of the night, I didn't see any visuals, but I felt very good emotionally, and enlightened. A little later, I listened to some weird laser-sounding music and I closed my eyes and right before me was Obi Wan fighting Vader in a lightsaber duel. That was interesting. A little later, I got mild heartburn and some stomach cramps so I smoked some mary jane and I felt better.</p><p>Overall the experience was well worth it. I feel as if an emotional cloud has been lifted from me, and I see things through different eyes.</p>",
 "year": "2001",
 "id": "4831",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-04T08:00:00.000Z",
 "views": "37356"
}
