{
 "title": "Nutmeg - Never Again",
 "author": "The Cams",
 "citation": " The Cams. \"Nutmeg - Never Again: experience with Nutmeg (ID 4833)\". Erowid.org. Jan 4, 2002. erowid.org/exp/4833",
 "substance": "Nutmeg",
 "bodyweight": "75 kg",
 "header": [
  "DOSE:",
  "-1 Tbsp",
  "oral",
  "Nutmeg",
  "(ground / crushed)"
 ],
 "report": "<p>Well, being young and impressionable my best mate and I had heard stories of nutmeg from a girl we knew. Being the kinda guys to try anything once, then maybe a few more times, we thought we should give it a go because we found it humorous that this was possible from an ingredient all our mums keep at hand.</p><p>So, we had a party to go to that night and bought a small bottle between us from the corner store. We had heard it can take a while to come on, so we had it at about 4pm, mixed in with milk to make a milkshake. We had not had any other drugs that day, or in our lives for that matter, other than the occasional smoke.</p><p>Luckily my parents and family were out of town, so it was the perfect time to try something new. So, we had half the bottle each (probably equivalent to about 4-5 tablespoons). And nothing for about 2 hours.... We thought this girl was having us on, then it started to creep up on us. Then I remember being at this party with my mate, uncontrollably laughing at each other and everything around us. So much so that our stomach muscles were in pain.</p><p>We were having such a great time, I remember thinking this is so much better than pot and alcohol...but it just kept going and going with such intensity. We left the party around 2am and I was driving. I only went about 200 meters and couldn't do it any longer. It felt as though I was going about 200 km/hr. Lights were flying past me so quickly, then I looked at the speedometer and I was going 30 km/hr. At this point I let my mate drive the car (which was quite something because at this stage in his life he was the most untrustworthy driver).</p><p>We dropped some people off, then I spewed for about 5 mins. Then I started to hallucinate in the back seat of the car. 'Mysterious Ways' by U2 came on the radio and my mate and I were sitting in the back of the car and could both see little birds flying around in the car. This is when we looked at each other and said 'Shit, will this ever stop?'</p><p>We finally got home and went to sleep around 4pm. Slept through the next day, then night, and the following day. We woke up intermittently during those two day for a few minutes and we would check to make sure the other was still alive, and we were both still tripping badly. Then when we woke up 2 days later we were still spinning and both white as ghosts. I had to go to work that afternoon and I lasted about 1 hour before I had to go and throw up every 1/2 hour. Another mate came and saw me at work and said I looked dead, all white and very spun.</p><p>I finally made it home that night and went straight back to sleep. When I finally woke up I was starting to feel better. It took a total of 4-5 days to recover.</p><p>My mate and I cannot eat anything with nutmeg on it now and even the smell of it makes me get cold shivers.</p><p>It was one of the most fucked up experiences of my life and I would wish it on no one. I would never touch the stuff again.</p>",
 "year": "1992",
 "id": "4833",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-04T08:00:00.000Z",
 "views": "25534",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "-1 Tbsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 }
}
