{
 "title": "Relaxed and Tingly",
 "author": "Timpindude89",
 "citation": " Timpindude89. \"Relaxed and Tingly: experience with Promethazine with Codeine (ID 48334)\". Erowid.org. May 1, 2010. erowid.org/exp/48334",
 "substance": "Promethazine with Codeine",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "40 ml",
   "oral",
   "Pharms - Promethazine",
   "(liquid)"
  ]
 ],
 "report": "<p>First I would like to mention that Phenergan with Codeine, has 10mg of codeine and 6.25mg of promethazine per 5 mL of the syrup (so I took about 80mg of codeine and 50mg of promethazine)</p><p>T+ 00:00</p><p>Watching T.V. and instant messaging. Found a bottle of Rx cough syrup. I take about 3 5ml drinks out of this little medicine cup I have, then about a 20 ml drink, and a tiny sip out of the bottle, all this with some water. You can give or take a couple ml on the dose I said I took.</p><p>T+ 00:10</p><p>Feeling relaxed, kind of warmer feeling in my face, good feeling though.</p><p>T+ 00:20</p><p>Same feeling just more of the relaxation part. Decide to turn TV off and put some tunes on.  Now I am listening to The Postal Service and still instant messaging.</p><p>T+ 00:35</p><p>Feeling a mild/nice head buzz, nothing really intense. Pretty relaxed.</p><p>T+ 00:40</p><p>Realized that time went by really fast, doesnt feel like its been 40 minutes, but now Im feeling more of an Opioid painkiller type feeling and kind of like everything is nice right now in the world, my legs feel a little tingly, but nice.</p><p>Basically it stays like that for the remainder of the time that it lasts for.  I do not know if the Phenergan in the syrup had any affects, I know its for cough suppressant, but I took the recreationally and I dont have a cough.  I also have not taken codeine before, but have taken oxycodone and vicoden and such.  I would have to say that this is a really good relaxation method, or if you cant fall asleep this would probably help a lot.  I can compare this feeling to maybe snorting a little bit of oxycodone, or a mild oral version of it.</p>",
 "year": "2005",
 "id": "48334",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-05-01T07:00:00.000Z",
 "views": "11699",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "40 ml",
   "administration": "oral",
   "substance": "Pharms - Promethazine",
   "form": "(liquid)"
  }
 ]
}
