{
 "title": "Paranoia, Anxiety and Disjointed Thoughts",
 "author": "philbert",
 "citation": " philbert. \"Paranoia, Anxiety and Disjointed Thoughts: experience with Buprenorphine (ID 48331)\". Erowid.org. Mar 9, 2006. erowid.org/exp/48331",
 "substance": "Buprenorphine",
 "bodyweight": "80 kg",
 "report": "<p>I had recently come out of a week long stint in hospital, I had undergone surgery and had been receiving morphine both before and after the procedure. A friend of mine had been prescribed  Buprenorphine under the pharmacological banner Subutex, and had been taking 10mg (in sublingual tablet form) a day for the past two years. After assuring me that the Buprenorphine would be similar to the effects of morphine I administered myself a 4mg dosage which I dissolved under my tongue.</p><p>It took over a good hour for the  Buprenorphine to have any effect. The initial experience was enjoyable and I felt almost like a sea of euphoria has washed over me. I felt the sudden urge to take more and would have done so if not for the fact that I did not have any more in my possession. I nodded on and off for a few hours in which I felt safe, detached, painless, content. During this time I began to have some very strange thoughts, which to this day I cannot for the the life of me remember. Although at the time I felt that I was receiving life-altering, world shattering epiphanies  which suddenly appeared to me in the form of visions which unearthed the intrinsic unreality of life the universe and everything. These realizations showed the underworkings of the external world (our reality). I  became increasingly aware that they had slowly become coupled with some very disturbing, dark and horrible images, these darker visions began to occur after each and every good realization. Throughout the duration of the experience I nodded on and off contuinally this lasted about  24 hours, after about twelve hours I became nauseous and vomited on and off for further eight hours.</p><p>I experienced the (once pleasurable) and disturbing visions every now and then for at least another four days after taking the initial dosage. During which time I thought that I had seriously done some permant damage to myself and that I was doomed to remain a mentally disturbed person forever (as this is how I felt). It took about a week for me to start feeling normal and sane again. I would not recommend this poison which comes under the guise of Buprenorphine to anyone.</p>",
 "year": "2005",
 "id": "48331",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-03-09T08:00:00.000Z",
 "views": "20575",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4.0 mg",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": "(pill / tablet)"
  }
 }
}
