{
 "id": 4835,
 "title": "Uninhibited Vibrations",
 "date": {
  "submission": "2007-06-14T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dante",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "bowl"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I had purchased three grams of some low-quality chronic from a friend of mine about a week earlier on Monday. Me and my sister decided to smoke it that Sunday night, but because we lacked the materials needed to make a joint, and I refused to smoke from foil, we used an apple. The hits were nice and smooth, and tasted slightly apply. Being only my second time, my sister was thoroughly surprised how hard I was hitting it while not coughing that much. Every time I took a hit she would proclaim, 'Oh, nice hit.' Together we shared two bowls.",
  "After my last hit, probably about ten minutes from beginning smoking, I didn't really feel much at first. My sister was complaining about the quality of the weed and how she was only buzzed, and I told her that I wasn't feeling anything at all. Then, it started happening. I started laughing, and it seemed as if I was moving in a circular motion as if I was a top. I new from my one previous experience that this was normal and that I was buzzed, but I didn't expect what happened next.",
  "As I sat there in the chair with my arms on my legs to support my weight, I moved one of them to position myself, and immediately noticed a vibrating feeling. It started at the very center of my arm, and radiated outward, and it would grow stronger and last long the more I moved. I started rubbing my hands on my pants uncontrollably because it felt so good. I knew I had to stop, but each time I tried to stop, I forgot and started again. I was very susceptible to laughter, and whenever I moved I had these wonderful vibrations. The top motion began to grow stronger, and eventually I fell out of the chair laughing and vibrating on my way down. Upon my sister handing me my stash box to put away, I also noticed how unable I was at handling objects and placing them in designated areas. I must have missed the small opening in my wall where I hid the box about five times before my sister intervened and put it away herself.",
  "By this time, I was giggling furiously, rocking in a circular motion, and vibrating all over my body. My sister continued to tell me that I was freaking out, and that I should go to bed, but my perspective on everything was altered. It was not really consciousness any longer, but almost like watching a movie. Anything I said or did seemed to come sporadically, and I was just watching. I've had the same sort of feeling before after being deprived of sleep for more than three days, but this didn't have the same fatigue involved.",
  "Eventually, I made it to bed, and I layed down to rest. As I lay there, the vibrations subsided slightly and just hung there like an engine idling. The bed felt as if it was encompassing me, and I eventually had the feeling of not even laying on a mattress, but on a cloud. Suddenly, I started pumping my legs as if I was riding a bicycle. It wasn't voluntarily at first, as I am known to twitch like this at times, but I soon began to pump them because the vibration feelings were stronger when I did so.",
  "I did remember to mark the time down, as I was informed it alters your time perception, and it had seemed like at least an hour before my sister called me over to the computer to fix something five minutes after I went into bed. Using the computer like this was quite an experience. I knew everything I had to do to fix this specific problem, but each time I went on to the step, I forgot that I had done it, and wound up repeating it several times. My typing speed was also greatly inhibited. Normally, I can do about 110 WPM, but on this high I must've only been averaging around 10. My sister eventually just told me to go back to sleep.",
  "I lay there for about thirty minutes, and the feelings of rocking back and forth and vibrations subside slightly, and I am able to go on my computer an operate it as if normal. I talked to one of my friends for a little while, and it was increasingly difficult to pay attention to the conversation, as it was to even recognize when she had said something, as she soon notified me of by asking why I wasn't talking much. At that point, I decided to sign off and simply told her I was tired; I did not want this friend to know that I was under the influence of marijuana.",
  "This high I experienced was quite an experience, and I'd have to put it on the positive scale. The feelings were wonderful, and throughout I can't remember having a single negative thought. The strong partvibrations, rocking, giggling feverishlylasted about an hour, and then the effects seemed to dull slightly, and finally an hour-and-half later wore off into a mild buzz that I had previously experienced."
 ],
 "erowid": {
  "id": "30370",
  "citation": " Dante. \"Uninhibited Vibrations: experience with Cannabis (ID 30370)\". Erowid.org. Jun 14, 2007. erowid.org/exp/30370",
  "substance": "Cannabis",
  "views": "3356"
 }
}
