{
 "id": 4839,
 "title": "A Total Understanding",
 "date": {
  "submission": "2001-12-06T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Phil/Avatar",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.34 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "This was by no means my first experience with Marijuana, but it was by far the most insightful.  In the past, I have been awe-struck by the slow passage of time, or the fleeting moments when I believed myself to be in total understanding of the infinite depth of the universe.  However, this trip was most unusual.",
  "Two friends and I, let's call them D and E, set out the other day to find a mystical environment to smoke up.  We found a small wooded area with a large tree in the center.  Once in the wooded area, we could hardly see the fields around us.  The area was perfect, the sun was out, the birds were singing, the place had the atmosphere of being somewhere in the jungle.",
  "We lit up and soon, as was well anticipated, time slowed down to a crawl and we were thrown into hysterical laughter.  Once the laughter died down, we began to try interesting things.  E began to rapidly blink and let his head sway around on his shoulders.  Becoming a bit nervous, I poked him with a nearby stick to snap him out of it.  He quickly explained that he felt like his head was a tetherball, floating about his body.  Immediately, I said 'cool' and began to do the same thing myself.  I completely understood the feeling.  On a previous trip, E began breaking sticks, claiming that he was super strong.  We all thought he was nuts, but this time I actually understood what he was talking about back then.  E held out a fairly thick stick and I karate chopped it.  I must have hit it so perfectly that my hand seemed to pass right through it.  We began to find bigger and bigger sticks and would be able to chop them in half with the greatest of ease.  Realizing our incredible power, we decided not to try anything thicker for fear that we would seriously hurt ourselves.  The funny thing is, when we all had come down from our trip, our hands didn't hurt.  Weird, no?",
  "D always tends to go internal while tripping so he didn't have too much to say.  However, he did suggest smoking a cigarette while high.  This was probably the best thing I could do.  Cigarettes give you a head rush to begin with.  Now imagine if that blood is tainted with THC.  It all goes to your head and it is an absolutely amazing feeling.  I'd definitely recommend it.",
  "Anyway, perhaps the message behind this account of my experience is that, if you try, you might find it extremely easy to relate to other stoned people's experiences at the time.  I think this is the most rewarding part of being stoned."
 ],
 "erowid": {
  "id": "3038",
  "citation": " Phil/Avatar. \"A Total Understanding: experience with Cannabis (ID 3038)\". Erowid.org. Dec 6, 2001. erowid.org/exp/3038",
  "substance": "Cannabis",
  "views": "29180"
 }
}
