{
 "id": 4841,
 "title": "I see Jesus!",
 "date": {
  "submission": "2009-07-01T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "DY",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ],
 "report": [
  "Computer Duster:",
  "My friend Craig was down and looking to get fucked up because his Girlfriend was in Canada on a Cruise (smoking lots of bud and opium.) So we went over to a hardware store and looked around for some Computer Duster.",
  "It was really funny, the can had a computer sparying himself with the duster, he looked really stoned, and he was laughing.",
  "Anyways we went off to our other friend, Dan, who had some nugs, but he wasn't there so we decided to hit the can some. We went down in this sewer and walked across it. We each took a couple hits and i could feel it kick in a few seconds later. I hit the can just like some weed.",
  "I could hear an echo, this really weird sound that kept on going the entire time i was high. Also I could hear my heart beating, it wasn't going fast, I could just hear it really well.",
  "Then Craig started hallucinating some. He said 'Look out D----! Theres a girl over there!' After it wore off he asked me if I saw that girl smoking a joint, and I told him he just hallucinated it all.",
  "I started hallucinating some and I thought I saw Jesus at the end of the tunnel, so I started following the light. It was all very weird, but very fun.",
  "Then Dan came back. He tried it a couple times and loved it excedingly.",
  "The next day Dan came over and we went to hit the bottle behind this building. We did it a few times, and then he took a big one, starting trippin out, and fell face first into the concrete.",
  "He busted both his teeth and had blood everywhere. At first I thought he was dead. He then came too and later got oxycodone (christ! its like a lottery for idiots!)",
  "Effects:",
  "Lightheaded, euphoria, laughing, mild to full blown visuals based on how many hits, loss of concious",
  "Duration:",
  "Kicks in, in a few seconds, lasts a 1-2 minutes",
  "After Effects:",
  "Chills, body might start shaking for no reason, mild hallucinations, drowsiness",
  "Computer Duster can kill.",
  "It is very urgent that you don't do this alone, and that if you do it with another friend make sure they are tripping out when you are. Don't do it around hard places, around water, or anything else you could hurt yourself around if you do pass out.",
  "Computer Duster also kills brain cells and damages your lungs.",
  "If you do it, proceed with caution."
 ],
 "erowid": {
  "id": "30387",
  "citation": " DY. \"I see Jesus!: experience with Inhalants - Duster (ID 30387)\". Erowid.org. Jul 1, 2009. erowid.org/exp/30387",
  "substance": "Inhalants - Duster",
  "views": "9940"
 }
}
