{
 "title": "Sinister, Seductive, and a BAD psychedelic",
 "author": "bluedolphin",
 "citation": " bluedolphin. \"Sinister, Seductive, and a BAD psychedelic: experience with Methylone & Cannabis (ID 48461)\". Erowid.org. Dec 18, 2005. erowid.org/exp/48461",
 "substance": "Methylone & Cannabis",
 "bodyweight": "150 lb",
 "report": [
  "<p>9:00pm",
  "My partner and I both ingest 190mg Methylone in a gel cap.",
  "9:15pm",
  "First alerts. Feels like generic amphetamine creeping up.",
  "9:30pm",
  "Amphetamine-like feelings start to give way to more MDMA-like feelings.",
  "10:00pm",
  "Now it's pretty much fully developed. MDMA-like, except with a clearer headspace. My partner says she thinks this is better than MDMA. I tend to agree at this point, but only on the basis that MDMA has pretty much lost its magic for me. We decide it's time to get naked and we fool around in the bedroom for a while. Talking is nice and there is definitely a solid empathogenic quality to this drug.",
  "10:30pm",
  "My heartrate is pretty elevated. The clear-headed mindspace is starting to give way to a more scattered and confused mindspace. Sex is difficult and awkward.",
  "11:00pm",
  "This stuff definitely is starting to feel like shit. Reminds me very much of an E pill cut with amphetamine, because my heart is racing with no sign of chilling out any time soon. There is a definite visual quality to this drug... things look 'softer' and shift slowly in my visual field.",
  "12:00pm",
  "Allright, at this point I'm pretty much flashing back to every bad MDMA/Ecstasy comedown I've ever had. I don't take Ecstasy anymore because I basically fried my brain on that garbage. What made me think I could take Methylone? Damn... starting to regret this.",
  "12:30am",
  "Around this time I smoked a bowl. I enjoy smoking on MDMA, I figured this would be similar...",
  "1:00am",
  "Holy shit, I'm tripping. Like +++ tripping. Generic cross between MDA and 2C-B like visuals. The trip itself reminds me of 2C-B, which I consider a very sinister and counter-productive psychedelic. And I can imagine my neurotransmitters self destructing. Around this time I started resisting the drug quite a bit, in some psychological self-defense mechanism to 'cut my losses'.",
  "2:00am",
  "This shit hasn't died down a bit. At this point I'm pretty much insane, my body feels like a bad Ecstasy comedown and my mind is just.... tired..... sad.... and also trying to analyze the nature of this weird drug.",
  "3:00am",
  "Not wearing off one bit. What the hell. I am emotionally beat. It's been a looooong time since I've let a drug get the best of me like this. And it's pissing me off. The Methylone has hijacked my brain into a way of thinking that I have tried to put aside a long time ago when I gave up 'evil' pseudo-psychedelics like MDMA, MDA, 2C-B. I am not willing to give in to the effects of this drug. I simply won't.",
  "4:00am",
  "I am forced to eat some Xanax (probably 2-3mg) to chill out and eventually get some sleep.",
  "...................",
  "In my opinion, Methylone is total garbage. If you are looking for a hedonistic good time or you are still enamored and amazed by the effects of MDMA you might like this.",
  "If you are like me and find 2C-B to be garbage and MDMA to be pretty much useless and shallow, I doubt you will find anything better out of methylone. Personally I really dislike these kinds of drugs, and find them physically and mentally taxing. Methylone was just as bad.",
  "The +++ level visuals I got were an unwelcome surprise. Perhaps smoking pot caused this to happen, because my partner got barely any 'psychedelic' effects. However, this is *NOT* a true psychedelic. For me, this was a sinister drug that wears many layers of masks.",
  "I was taken into a 'spirit world' which forced me to come face to face with negative thoughts. The drug left me feeling weak in both body and mind. It was a very draining experience and something I will never repeat again.",
  "......",
  "In conclusion, this is the worst drug experience I've had in a very long time.",
  "Fortunately I was able to smoke a bunch of DMT the next day and that seemed to reorient my brain back into a positive mindstate</p>"
 ],
 "year": "2005",
 "id": "48461",
 "gender": "Male",
 "views": "24911",
 "dose": [
  {
   "time": "0",
   "amount": "190 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(capsule)"
  },
  {
   "time": " T+ 3:30",
   "amount": " bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(dried)"
  },
  {
   "time": " T+ 7:00",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2005-12-18T08:00:00.000Z"
}
