{
 "title": "A New Question Arose",
 "author": "Small Axe",
 "citation": " Small Axe. \"A New Question Arose: experience with Mushrooms (ID 48489)\". Erowid.org. Jan 26, 2008. erowid.org/exp/48489",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2005",
   "48489",
   "Male",
   "",
   "Not Given",
   "Jan 26, 2008",
   "2930",
   " "
  ]
 ],
 "report": "<p>Perhaps the most significantly spiritual night of my life occured between the night of May 1st, and early morning of May 2nd 2005. I had acquired 4 grams shrooms, mostly shake, with 2 acorn sized caps. I had planned to spend the night relaxing on my hammock in my back yard, and I was filled with excitement, as this would be my 7th mushroom experience.</p><p>Around 9pm, I ingested the mushrooms on an empty stomach, and took my sleeping bag, as well as my cd player outside. I got comfortable on the hammock, and rocked in anticipation of what was to come. After about 15 minutes my mind began racing with second thoughts and doubts about what I was getting myself into. It seemed as if my imagination was trying to force the trip.  These thoughts were gone, however within 5 minutes, as I began to feel the warm body high that accompanied the initial effects.</p><p>30 minutes after ingestion, I began to become slightly bothered about something, though I couldn't quite put my finger on it. I looked over to the edge of my house and began thinking about my recent daily routine. It seemed as if I, and all humans, had been following routines throughout our existence. As I thought about the vast amount of time that existence covers, Time took on a new meaning. The word 'Day' no longer made much sense, as I began to think of my existence as flowing, and not repeating. It seemed as if the duality between night and day disappeared, and the looping of the calender was no longer important. This thought was very liberating, yet it also seemed taboo, for reasons that I have yet to comprehend.</p><p>I decided to turn on some reggae, and looked up towards the moonlit leaves above me. Still slightly nervous I tried to calm myself by thinking 'Everything's ok, I'm in my own yard.' After staying on this train of thought for a moment, a new voice entered my head. It said 'Let me show you something.' This excited me, because the voice seemed very warm and comforting. The music gave me a euphoric feeling, and a my mouth burst into a smile. Suddenly, I heard a multitude of voices saying 'We live in the music.' These entities seemed to be the notes themselves, and the bouncing of the rythm gave me visions of wild African-like tribesman bouncing on drums and riding the waves of sound. The whole affair seemed incredibly joyous and I replayed the same song several times.</p><p>It was around the third time I had repeated the song when suddenly I felt my trip accelerate to new heights. Suddenly I found my consciousness in the leaves above me, Bouncing wildly with the music from branch to branch. The tribesmen were replaced by the leaves themselves who grew smiles and strange piercing eyes. Though my consciousness was focused in the tree, the tree took on a very profound meaning. It seemed as if God had lifted me up to the kingdom of heaven, and everything was as it should be. My realization of myself completely disappeared, and I was in a state of ego loss. The leaves seemed to be changing colors wildly, and the outlines melted and shattered to form shapes of incredible beauty. It seemed as If I had discovered the reason why apes spend so much time in the trees. The entities continued to play with 'me' and it seemed as if eternity was suddenly a feasible concept. I knew that no matter what happened to me in the future, that one day I would return to this place, and every wrong-doing would be erased. </p><p>Suddenly I realized what was happening, and realized who I was and what I was doing. I felt elated as I got up to relieve myself in the bushes. As I did, the sky appeared magnificent, and it seemed as if I standing on a balcony overlooking the vastness of space.  I turned off the music, so that I might experince the night sounds for themselves, and went back to my hammock. It was at this point that I slipped back into an ego-loss state. I began to question the reality of humanness. I asked (though I'm not sure exactly who I was talking to, maybe God) 'What the hell is a person?' Along with this question came a very mischevious feeling that excited me greatly. I asked again, somehow knowing that if I asked enough times, eventually someone would answer.</p><p>I probably asked this around 15 times over a period of 5 minutes, each time falling into a state of extreme euphoria and warmth. I felt as If I was a few feet above myself peering back at my body. I continued questioning until the mood changed. Suddenly the question provoked feelings of loneliness and abandonment, but I did not cease in the process, as I could feel the answer coming on. Then it came. 'A PERSON IS LOVE', it burst aloud from my own lips in a voice that seemed as deep as the ocean. My consciousness soared back into the heavenly state as I repeated the answer over and over aloud, Each time feeling the utter vastness of God's love. I realized that love is the fuel on which humans are powered.</p><p>I got up again to relieve myself when a new concept struck me. New words burst from the depths of my soul. 'Why does everything seemed planned?' I began to giggle as the answer shot down a moment later. 'Because Everything is planned!' This idea gave me an incredible amount of comfort in knowing that everything that occurs is a lesson, and part of the process leading towards the ultimate goal of reaching an egoless paradise. This idea stayed with me as I layed back in my hammock, and it seemed as if the scenes I was acting out had occured somewhere before in a universe far away. Every action, every blink of the eye seemed as if it was happening at exactly the right moment, and every breath of air seemed as if it had been planned for eons. It seemed as if every action was already written in a book that my unconscious mind was constantly studying. It seemed as If I had always known this, yet in retrospect, it's probably the first time I had really thought about it. This continued for quite some time, and I got up pretty soon to release even more psliocibe from my system (3 times within an hour). </p><p>As I did this, a new question arose. 'Why do mushrooms mean life?' I realized the key to contentment while here on earth, and it laid inside the energy within the mushroom. I began to think about the strange appearance of mushrooms, and an incredible idea entered by head. I pictured mushrooms as a form of a heavenly raindrop that was made available to all before they took the ultimate trip at the end of their lives. It seemed as if mushrooms were a cosmic key to unlocking the door, at least temporarily, to the great and wonderful unknown within us. I continued to ask 'Why do mushrooms mean life?' and juxtaposed the works 'mushrooms' and 'life' comparing the two for any obvious connections. Then I realized that the question was not meant to be answered, that it was supposed to be a mystery, and that's why they were so incredible. </p><p>I began to come out of the egoless state and slowly back into my own body. My consciousness seemed to rocket from somewhere behind my face up towards the trees, and elastically bounced back to its correct position. I looked down at my arms and question their practical use, and found joy in moving my fingers. I peered down at my sleepingbag-covered body and began to have visions of baby Jesus lying in a manger. The year 2012 appeared before my eyes. At first I didn't understand, but eventually I connected the Christ with 2012. I began to feel as if the Christ was presently incarnate somewhere on the earth, but he/she had not yet realized their full potential. I looked at the tree trunk and memories of the crucifixion arose. I felt the Christ energy enter my body and I arose slowly, but with extreme preciseness to my feet. I had an extreme feeling of duty and integrity, and it seemed as if I had just realized my mission. A sword appeared in my hand, and a mountain arose from a spot in my backyard. Then I had a vision of Satan standing on the hill waiting for me to strike. I realized that it was a trick, and threw the sword down, and instead defeated him with love. The Year 2012 flashed before my eyes again, and it the Christ energy left as quickly as it Came.</p><p>This part of my trip was perhaps the strangest. I was raised Christian, but never had very much enthusiasm about my faith, and never really even thought about God or Jesus that much at all. But suddenly it seemed to make sense. The connection between 2012 and Jesus was very strange and it seemed to me as if the answer was still a bit too blurry to understand. It seemed as if the only thing I could do was wait 7 more years.</p><p>The number 7 seemed strange; I remembered that it was past midnight, and the date May 2 (5/2) also added up to 7. I felt the urge to run inside. I did, and looked at the clock. 2:05. Once again, the number 7 arose. Then the fact that this was the 7th trip I've had came to mind. I remembered that 7 had always been described as a holy number, and suddenly the vision made sense. It seemed as though I was being alerted to what would happen in 2012. Now whether or not Jesus would come back, or whether each of us has to make the decision whether to love or hate was unclear to me. It seems as if we'll find out soon.</p><p>Anyway I went up to my bathroom and looked into the mirror, I had come down alot, but my pupils were still giant, and my appearance made me laugh. I found amazement at gazing into my dark pupils, and probably did it for quite some time. Eventually I made my way to my bed and turned off the lights. Though I wasn't tripping very hard, psychedelic visions still loomed close by. Everything seemed extraordinarliy colored, and a strange pattern kept appearing before my eyes. After some time I finally was able to rest. The next day my mind felt incredibly clear, and I seemed to be in an exceptional mood. At school, it seemed as if all my friends seemed happier too, and I even was able to focus better in class. </p><p>It's taken me some time to write all this down, but the memories still remain quite vivid with me even 7 months later. The night was the most incredible experience I've ever had, and it seems as If the events that happened there truly beacon something great to come in 2012. I have begun to talk to God daily, and ask for assistance with my troubles. The trip reacitivated my spiritual side, and I find myself more spiritual than ever before. Currently I am growing mushrooms in order to continue my journey into the exploration of the plan, and I hope to one day see you all in Heaven.</p>"
}
