{
 "id": 4848,
 "title": "Like Mushrooms, But Better!",
 "date": {
  "submission": "2007-11-11T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Mushroom Being",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "850 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Ok, this was one of the most weird and unforgettable experiences of my life. First off I bought a bottle of no-named Gravol from a local pharmacy. 50 pills at 50mg a piece.  Me and a friend wanted to trip out hardcore so each downed 17 pills. I remember the wait for it to kick in was a little bit frustrating but it paid off.",
  "After about an hour I noticed that when I would move my head I couldn't really feel it but I knew it was turning. I felt really light headed but at the same time had to try to keep my head up because it was sooo heavy. Kinda weird but thats how it was. I started to get a little worked up and decided to go hop into the shower to mellow out a bit. While in the shower I kept seeing the shower curtain twitching alot, almost like little bubbles were inflating out of it then quickly deflating, sorta like a heart beat. I was very amused at this but could not tell if it was real or a hallucination. I went and looked really close to it and it still did the same thing. I touched but it stopped, but the minute I let go it started again.",
  "After that I got out of the shower ran down stairs but found it incredibly hard to run. My feet were soooo heavy but felt so light that I could walk on air. I had barley enough balance keep me standing so I laid down on my bed. Things started to get a little intense for me so I buried my head into my pillows. I remember that even though I was awake I could dream with my eyes open. I could stare off till the point that all I saw was black. I kept awaking from these 'dreams' and asking my friend where certain items that dreamt about were.",
  "My short term memory was gone. None whatsoever. I would start a sentence and around the second word Id forget what I was going to say and what I had just said. If I stared at the wall I would see a clear smoke-like substance spread all over the place. Looked sorta like the creature from the show predater. I remember when I started to come down that I got extremely itchy and though spiders were crawling all over me. But I was laughing alot at the stupidity it had induced to me. I also remember hearing voices from upstairs, even though there was no one home.",
  "All in all it was a great experience. I would recommend it but beware, read into it first and make sure you are mentally strong enough to handle it. I would easily classify this drug in the same category as mushrooms. It is alot similar to mushrooms but for me, more hallucinations. I will definitely do this again, perhaps at a stronger dose."
 ],
 "erowid": {
  "id": "30403",
  "citation": " Mushroom Being. \"Like Mushrooms, But Better!: experience with Dimenhydrinate (ID 30403)\". Erowid.org. Nov 11, 2007. erowid.org/exp/30403",
  "substance": "Dimenhydrinate",
  "views": "20545"
 }
}
