{
 "id": 4849,
 "title": "Like Blood to a Shark",
 "date": {
  "submission": "2004-02-16T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Amrou",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:20",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 3:10",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": " T+ 4:25",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ],
 "report": [
  "<p>My first 5-MeO-AMT experience goes as follows:",
  "======",
  "General:",
  "======",
  "My setting and mindset:",
  "I'm sitting in my room, in an upstairs flat, on a bean bag chair.",
  "I'm tired and not exactly thinking straight (might explain why I went on impulse and eyeballed an extremely potent hallucinogen).",
  "My purpose for the partaking of this mind expanding substance is to:",
  "1) Have a new experience",
  "2) Test out if the hype is real... alot of my aquaintences say its the greatest thing that they have ever done, surpassing both E and LSD (and for that matter both combined)",
  "3) Try a tryptamine (first timer)",
  "I am an eighteen year old male, I weigh about 130 pounds, have a crummy job and live in a crummy flat with a crummy flatmate (who is away for the weekend). I have a fair amount of experience with such things under my belt. I'm not on any prescriptions nor am I on anything OTC.",
  "=========",
  "Chronology:",
  "=========",
  "T+00:00 (21:50) ingest an unknown amount, I THINK about 2-10mg, of powdered 5-MEO-AMT, eyeballing it from a vial of 500mg.",
  "--- in retrospect, this was stupid... Ah, well, hindsight is 20/20",
  "T+00:15 (22:05) feel kinda warm (might be because the heat is finally working... It hasnt been up to spec lately)",
  "T+00:20 (22:10) remembering reading about intense nausia, I realized I had some dramamine chewables... I munch one down",
  "T+00:25 (22:15) I starting getting signals that remind me of amphetamines, an increaced typing pace and an overall increase in energy, physical and mental.",
  "T+00:30 (22:20) deside to put on the headphones and just chill for a while, removing all the music that I currently deem unfit for the experience I am hoping to have... That which I deem fit is mostly happy hardcore and trance. Definitly getting some speed alerts... Hands shaking a little and a bit of trisma(jaw clenching)",
  "T+00:30 (22:25) the base of my spine is tingling a little, another feeling I associate with amphetamines",
  "T+00:50 (22:40) uh-oh... The chemical madman grin has just crossed my visage... Oddly no nausia has crossed my tummy as of yet... Giggles insue...",
  "T+01:10 (23:00) definatly have some stimulation :)",
  "T+01:15 (23:05) potty and cig break...   No noticable pupil dialation",
  "T+01:20 (23:10) mmm... Giggles...",
  "T+01:40 (23:30) am I seeing things... Or did the walls start lightly breathing? Hmmm... Interesting... Methinks I should check my pupils...nothin...still a little stimulation, a bit of a dry, odd taste in me mouth",
  "T+02:00 (23:50) i've started noticing some (very minute) tracers....  Got up to get some water to try to get the taste and dryness out of my mouth, but it proved futile... Not dry-cottonmouth like datura but noticable. I dont think I could go to sleep if I wanted to. Changed the music to Paul oakenfold live at the rojan in shangahi (I always used to put this on when morning glory seeds (LSA) just starts kicking...  Mebby it will get my brain in psychidelic mode or something",
  " T+02:30 (00:20) I cant put my finger on it, but something feels....  Off ...  Very chemically feeling... Feels like the onset of DXM....  I'm no longer euphoric, just anxious for _something_ besides dry mouth and speediness...  Ooh... Scratch that... I just got the tinglies... Heheehehe tingle, tingle, tingle...",
  "T+02:40 (00:30) I feel like masturbating...",
  "T+03:00 (00:50) oh my god... That was the most intence feeling i've ever had! I felt like broke a dam! Whoooosh!!    (btw, tracers are go!!) Still have a chem taste in my mouth... But its not noticable unless I notice it... (that made no sense, but I dont care b/c I feel pretty good right now.)",
  "T+03:10 (01:00) I feel like having a smoke... So I will... Wow, I feel good (a fucked up good hehehe) I'd guess my dosage to be about 2-4mg: just a taste... Nothing worldshattering... (but if I smoked some salvia... Hmmm... Naw... I feel like going for an unadulterated 5-MEO-AMT trip so I can see what to look for in the future :)  ....   Mebby next time",
  "T+03:20 (01:10) I feel like I could go to work right now and be just as if not more productive than usual (speedy) the cig was unusually harsh, but thats probably because of my dry mouth... So I got more water... Feels good to hydrate =) I dont feel like listening to music anymore... Odd...   I think I'll do something else with my ears... Paraliminal tapes from Paul Sheele sound like a good diversion/amusement... So... I get comfy on my bed, slap on the headphones and go to it...  See u in 40 minutes or so... Mebby i'll have some more to journal... Perhaps the time will be enough for me to get a little deeper into 5-MEO-AMT land",
  "T+04:10 (02:00) that was easily the most relaxing and enlightening thing that I have ever experienced waking or otherwise... I used a past life regression tape... Excellent material sober... Tracers are excellent right about now... Suprisingly, everythinkg is very clear... My little trippy gizmo... $6 @walmart strobefx oooohh....   Its like an orgasm of colours and trails and rainbows and oohhhh!!!",
  "T+04:20 (02:10) ten minutes??? More like 3 seconds... I want this to last.....   I can see how this could be addictive though... Such a gooood feeling.... I must be very careful... This taste/feeling is going to be like blood to a shark...",
  "---note to self... Next time get a tape recorder... Chaos will ensue on higher doses of this fine chemical...",
  "T+04:25 (02:15) potty, water and a cig time...",
  "T+04:30 (02:20) it was snowing.......  Oh my god it was like someone was dropping glitter! At times it was like static, golden multidimentional static. At others it looked like all the stars in the sky were all shooting at the exact same time! Tracers are wonderful things... Still the same dry chemmy mouth... But its barely noticable compared to the other more wonderous effects... A breathmint was like the finest chocolate in the world.... Back to good old paul oakenfold... Which sober is sheer and utter en_trance_ment to hear... Now it's like the whole world reverberates with the music....this is weird, I feel like I am sober, only altered a little to the point where everything is good. Heck, even the 3 degree weather feels good and just right. Yeah, thats a good way of putting it. Everything feels _good_ and just.... right   /`|^|`  Like my birdie?  Tweet tweet? Birdy?",
  "T+04:50 (02:40) um... Yeah... Things just got kinda weird... I was drawing and yea....   Everything just got ... Um... Weird... Hella-vuh-lot of trisma right now...  I'm awake but I feel tired... Words are starting to move a little...",
  "T+04:55 (02:45)  methinks I will try to go night-night... Doubt highly if I will, but it'll give me a chance o catch some cev's...  Right?",
  "+++++   End of recording as it happens...",
  "T+04:55 - T+07:15 (02:45-05:00) Somewhere in here I fell asleep, after some crazy vortexy CEV's. I'm finishing this up 4 days after dosing. The day after my nice little trip was spent in bed, resting. I had some extreme nausia at times, and I couldn't eat or drink much without the nausia coming on strong. A testament to my strong stomach and will, I never vomited. The day after that was spent mostly chilling, feeling kinda down mood wise. The third day after the trip I felt renewed and refreshed, but still kinda down. Today, a whole FOUR days after tripping, I finally feel good (even better than before I dosed!), energized, ready to go...",
  "=====",
  "Notes:",
  "=====",
  "As an afterthought, I think that I was being stupid with chems: impulsiveness, poor (no) planning, not weighing the dose (stupid, stupid! STUPID!)... The trip was beneficial to me as to show the nature of tryptamines (first time with them), and just as a relaxing, fun time.",
  "I'd like to point out a pair of good (I think) quotes:",
  "'I can see how this could be addictive though... Such a gooood feeling.... I must be very careful... This feeling is going to be like blood to a shark...'",
  "'Still have a chem taste in my mouth... But its not noticable unless I notice it...'",
  "Overall, I am looking forward to my next paycheck from my crummy job so I can get a good scale, and some veggiecaps (I have friends interested who are vegan). Wheehoo! I guess I'm done.</p>"
 ],
 "erowid": {
  "id": "30405",
  "citation": " Amrou. \"Like Blood to a Shark: experience with 5-MeO-AMT (ID 30405)\". Erowid.org. Feb 16, 2004. erowid.org/exp/30405",
  "substance": "5-MeO-AMT",
  "views": "14244"
 }
}
