{
 "id": 4850,
 "title": "Great Legal Alternative",
 "date": {
  "submission": "2004-02-16T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Snadman",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Leonotis leonurus",
   "form": "(plant material)"
  },
  {
   "time": "0:15",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Leonotis leonurus",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I just bought an ounce of Wild Dagga from an online vendor. A lot of people explained that it would be a bunch of crap and not give anything. It does.",
  "After one bowl, by myself, I immediately got similar relaxed body effects as I do when I take a Vicodin. I am very tolerant to pain killers though as I have taken all too many. I wanted to try something safer, and this was it. So after one bowl, I was feeling a bit dizzy and some relaxed muscles. No big deal.",
  "I decided to smoke another bowl after about 15 minutes. I personally like the smoke, but don't try and be a big shot about it and take a huge hit. The huge hits are the ones that burn and make you not want to do it again. Take small hits and just relax on it, like you would do when smoking cigarettes. This second bowl gave me some mild euphoria and some mild hallucinations, similar to those of Canabis.",
  "I smoked a final third bowl, which didn't intensify the effects necessarily, but more just made them last longer. The effects lasted for about 2 hours. I appreciated the fact that I felt as though I had just smoked Canabis, yet it was cheaper and the negative effects of Canabis weren't felt. IE: Dilated pupils, red eyes, dry mouth, anxiety of getting caught, etc.",
  "There are even places that sell just the flowers, and although it's more expensive, it's worth it because the effects are felt better with more flowers."
 ],
 "erowid": {
  "id": "30408",
  "citation": " Snadman. \"Great Legal Alternative: experience with Leonotis leonurus (ID 30408)\". Erowid.org. Feb 16, 2004. erowid.org/exp/30408",
  "substance": "Leonotis leonurus",
  "views": "31582"
 }
}
