{
 "title": "It's Good To Be Alive",
 "author": "Nick Nightshade",
 "citation": " Nick Nightshade. \"It's Good To Be Alive: experience with DOC (ID 48517)\". Erowid.org. Dec 8, 2005. erowid.org/exp/48517",
 "substance": "DOC",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 mg",
   "oral",
   "DOC",
   "",
   " T+ 0:00",
   " repeated",
   "smoked",
   "Cannabis",
   "",
   " T+ 0:00",
   "1 glass",
   "oral",
   "Alcohol",
   "(liquid)",
   " T+ 0:00",
   " ",
   "",
   "Vitamins / Supplements",
   "",
   " T+ 6:00",
   "5.0 mg",
   "oral",
   "Pharms - Oxycodone",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Comin' atch you Live on the spot</p><p>Long-time listener, first-timer caller.</p><p>What's up Yaestrum?</p><p>It's like this and like that and like this and uh...</p><p>Be Here Now</p><p>In a dream, my pet tarantula dissolved somewhere between 18-24 mgs into 60 mL everclear and squirted 9 mL of the supernatant with an old spore-syringe into a shot of orange juice for a psychedelic screwdriver, Salud! </p><p>T+O</p><p>Nervous about first time, but all around good intentions. Cleaned the house and blessed with white sage;  offerings of tobacco were given, got Escher, Van Gogh, and Ram Dass on coffee table.  Incense burning, low lighting, plenty of distilled water to drink, ate very light meals today, a list of herbs and supplements too long to mention.  Aware of possible stimulation, but not expecting it. Trying to get back some of the mojo I lost two weeks ago in high dose methylone healing session. Jah is giving a magnificent snow storm.</p><p>T+52</p><p>awwwe yeah, this is gonna be a guuuud night.</p><p>Turned on the Brain Wave Generator, while watching some Grateful Dead on DVD.</p><p>'Never gonna get enough'</p><p>Drugz are cool, dreamz are better. Stretches feel great! Talking with my buddy, a Philosophy major, about his Pagan rituals, what a fascinating guy! We both became curious as to why humans never adapted to their environment such as other animals are able to.</p><p>T+1.30</p><p>Yup! Were now watching the movie Dead Man.</p><p>T+2.00</p><p>Very happy I didnt eat 4 mgs. Tightness in upper left shoulder, open a beer. Kind of concerned for awhile about the stimulation. If I knew more about what my heart rate or pulse is supposed to be, 72 right? I'd feel a whole lot more comfortable. I took CPR classes (Just got home from illinois, locked the front door, oh boy...), why can't I remember this stuff? Decide to check resting heart before I go for a walk but I can't find my pulse and give up. Still not completely sure how it's metabolized and what my blood pressure is?</p><p>T+4.00</p><p>Very easy to relax between thinking I'm dying of various human diseases. Major yawning fits while we were walking. Be Here Now. Chopping the wood and carrying the water. Let's watch some POT TV... Contemplate talking with Salvia D. even though I'm having a difficult time staying IN my body. Here's a letter I wrote her:</p><p>Quote: </p><p>Dear Sally,</p><p>Thank you for your lessons, may we greet them wisely. 'Petition to Keep Salvia Legal' if I knew the way, I would take you home. Please guide the rift-raft out. Love ya.</p><p>T+4.26maybe</p><p>Well, I thought this stuff actually had a lot of depth and was highly spiritual and slightly recreational. Felt close to blacking out a few times. Still have more respect for the tryptamines.  It did have the I want to be a better person push to it for me.</p><p>On the walk, my vision would 'Zoom in' on objects in the distance. Trees, oh god, someone save the treeees. I absorbed Chi from every living and non-living creature within a 3 mile radius. The stones piled in a man-made erosion control effort look just like little people crawling out of the river. Watched ice float down the river for about an hour, didn't feel much like smoking cigs. This is where vortexes are born! When my HR really got high while walking, I had a yawning attack that wouldn't stop.</p><p>Decide to watch the movie Dream Keeper between POT TV and trying to smoke Sally if my neighbors would quiet down. Keep drinking water. Phenethylamines seem to give me tightness in the upper left arm and chest that tryptamines do not. Still a very thorough healing experience though. Body load alternates between being highly uncomfortable to very, very pleasurable.</p><p>When I closed my eyes my friend was wearing a feathered ceremonial head-dress that would start to bleed in to the open-eye visuals. There's a portal in the living room trying to pull pieces of me through. Not much for spirals or floating DNA that I've heard about, must need to combine with GBL, although the wind always amazes me. Very floaty feeling, I am in the Lords house.  Bright Light is STatiC!</p><p>Definite waves going through the room.</p><p>My friend left, and it's a shame because he was very interesting to speak to as he had eaten ~2 mgs as well, he noted less visuals and a good body buzz, although he seemed to be having quite a nice time in my opinion. Maybe I'll get him to write a TR. Do organic chemicals have more localized geometric fractilized visions? I thanked him for being a guinea pig, and he thanked me for letting him.</p><p>I dunno this stuff is awesome. If you're more into the tryptamine buzzes (something about the phenethylamines always makes me a little too nervous) stick with those, I'm certain they're ultimately more healthy for the body, brain and soul. For me this had way more of a body load than 16 mgs 2C-P, but DOC may have a lot more mind fudge, while both are extremely lucid. 2C-P seemed to be more euphoric with an eye-popping and excessive mucous that was non-problematic. DOC is more like find your Nicotania Rustica and Pray!</p><p>Why do research chemicals make my farts smell like fireworks? I thought it was just because I was drinking creek water, I guess not. Tried to meditate and just ended up drooling, however OMing was very cool.</p><p>T+5.00</p><p>Stimulant is mostly all gone, visions still going strong. Art books--Whoa! I think my wife might like this stuff at a lower dosage. Eyes still very dilated, think I'll wait a few moons before trying this again. Current Set: Fun, playful, imaginative. Setting: Home alone, errie.</p><p>hOly down with DOC, it's like OCD with a COD, and hopefully we dont run into the..Blah, blah, blah, tryptamines are better!!!!!!They fully open the lines of communicating with our Elders, but that's just my crazy white boy's opinion. Trying to decide if this is a burden or blessing. STICK to the tryptamines people, if I wasn't experienced with the phenetylamines 2C-T-21 would be more to the average Joe's liking I believe, unfortunately there was high toxicity with that one. This stuff is nicely therapeutic, but to me Kratom when mixed with caffeine does a fine job of that.</p><p>The Road to Hell is Paved in Good Intentions</p><p>Tryptamines feel a lot more biological to me, and that is my preferred method of treatment. I would like to find a way to brew Ayahuasca as to not get too sick, at least it's got a long-history of use on its side -- and it's where it's ReAlley at by the way ;)Get your plants and grow them while there is still time.</p><p>Be Here Now</p><p>T+5.785%</p><p>Do feel slightly hungry.  Earlier my friend said the cottage cheese I gave him really helped his tummy. I prefer to chew crystallized ginger, and had no problems with stomach discomfort.  Neither one of us had clenched fists or diarrhea.  The walk certainly reduced a lot of tension though.</p><p>Side note: My most profound experience ever was 1 gram mushrooms + 3 tokes plain homegrown Sally leaf.</p><p>Rant</p><p>I really hope this stuff doesn't get out on to blotters, I would be very unhappy with it. Why you ask? Because it aint no LSD, honey =( Lucy is so much gentler.</p><p>Regarding Temperature fluctuations with Wienhickuliclar Modulation</p><p>Don't know if my body temperature fluctuated much. It's always hot in the flat and when I went outside I was fine. I did get a chill once while inside and that was nice. There was some erotica, but it shall remain nameless...Let's just say I was very aware of my sexuality  and chose to do nothing about it.</p><p>OMG, the visions were freaking awesome, it was like being in cartoon factory, but sadly that is not my purpose for eating an entheogen. However some of the highlights were snow that became mycelium, bouncing wall-paper that bubbled and melted to the floor, then realigned itself in an undulating motion. Floating ice that became totems. </p><p>T+6.00</p><p>Administered 5 mg oxycodone orally. I hope I was able to give some answers, and I didn't piss too many people off, thank you all for listening.</p><p>Extensive preparation for this experience seemed like the right thing to do, but there was definitely already some magic in the air before I took this substance.</p><p>I don't think it quite took me all the way home, stick to mushrooms people ymmv..</p><p>4-aco-det seems to be one of the more welcoming spirits, I hope demand brings it back.</p><p>I cant stress enough that Set and Setting are everything, Cannabis, Oh thank for you for letting us see in. </p><p>Ought-O, my heart hurts.</p><p>Discipline yourselves people, these things are neat but it is it worth unraveling all this information? Only you can decide.</p><p>T+6.23</p><p>Stop reading this and go for a walk you lazy bones, this stuff is a total fantasy </p><p>Jon Stewart for President '08</p><p>T+7.20</p><p>Started posting this into the message boards, maybe I'll edit later when I figure out what happened, at least I didn't get the convulsions that 20 mg 2C-I + methylone gave me. I only tried 2C-E once, but I almost think I might prefer it over the DOC, what a Love/Hate relationship, 30 mgs 2C-E had no body-load for me and was more overwhelming but in a tranquil way, I like that.  I think the only substance that worried me more about the body-load would be the last few hours of a high dose AMT journey.</p><p>I have no experience with mescaline but I have 12 years experience with LSD, and she is a different lady altogether, sorry to give your hopes up =( The DOC stimulation was bordering on being quite frightening at times.  I think that once I understand more about my physical responses, I will re-evaluate this substance.</p><p>Extracting my own DMT is so much more rewarding than this stuff, at least that pushed me to furthur seek and understand my goals, and started teaching me how to take care of my family, but take into consideration that my experience is limited.</p><p>T+9.42</p><p>just finishing writing this (and my beer), still not really tired, mild psychedelic after effects, Suns coming up now. Going to lay down, sleep came easy.  Woke up 6.5 hours later feeling quite well mentally but still had pains in my left arm.</p><p>T+19+44</p><p>Now that I smoke a pipe and reflect on the experience, WoW! It was good. I think I was just being pessimistically cautious; I was going into it with more of a 'contribution to science' mindset. It was the world's greatest microscope/telescope, outstanding change in perspective. I believe that if I had the chance to really let myself go, I would really enjoy this stuff.  I am a strong critic, but let me tell you, 4-chloro-2,5-dimethoxyamphetamine is beautiful!  There is so much that I that Im not yet able to translate into our written language. I also wanted to add that w/o any medical equipment to properly monitor my vital conditions or anyone there with a clear mind to do so - the stimulation could have all been a part of my perception or due to a pre-existing medical condition; heart-disease runs in my family and I have a common non-psychedelic injury that affects my circulation.</p><p>The weight has yet to be confirmed on a .00000000000000000000000000003 scale.  Dissolving into a higher ratio, say 100 mL of everclear would be wiser.  Psssst, one teaspoon = 5 mL.  Amber and blue glass vials are easy to come by, get one.  And get yourselves a decent scale its worth the piece of mind, someone getting hurt on this stuff will put an end to the Love, it has happened before.  Knowledge is your friend.</p><p>It was actually everything I was hoping it to be and more. Thank you to our creators, to the people who keep the information coming and going, and all the psychedelic warriors out here, and thank you to the people taking the risks - you know who you are ;), and thank you for being here. I Love you all so much!       </p><p>BE safe out there peeps, and dont forget to Be Here Now.</p><p>So just chill till the next episode</p>",
 "year": "2005",
 "id": "48517",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2005-12-08T08:00:00.000Z",
 "views": "12588",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "DOC",
   "form": ""
  }
 ]
}
