{
 "title": "Was It Dust?",
 "author": "Dan",
 "citation": " Dan. \"Was It Dust?: experience with PCP (?) & Cannabis (ID 4852)\". Erowid.org. Aug 17, 2001. erowid.org/exp/4852",
 "substance": "PCP (?) & Cannabis",
 "bodyweight": "140 lb",
 "report": "<p>At around the time I started smoking weed on a regular basis I also starting smoking alone at home. I would always buy weed from the same person and a couple of time it was laced with coke and that was fine because it just made it better. I probably should have realized that maybe this guy wasnt so reliable considering I didnt ask for coke.</p><p>I was home alone and had nothing to do. I hated being bored and I knew that if I were high I wouldnt be bored anymore so I decided to smoke a little reefer. I got out my friends bowl that I borrowed because I didnt know how to roll blunts yet (and blunts were all I smoked). I didnt smoke much before I started to feel different than I normally feel when I was high. Something was definitely different. I just figured it was different weed or it was the coke weed again because something was definitely not right. I hadnt tripped before so I didnt know I was tripping.</p><p>I went downstairs and made a sandwich. I took a stool from the dining room and brought it into the kitchen. I pulled it up to the counter and ate there. I couldnt stop thinking about the fact that I was eating at the counter. It seemed so strange. But was it really? I didnt know. I tried to think about something else, anything else, but I couldnt. Why was I eating at the counter? If someone saw me would they think like I was? Would they know how weird it was? Would they think that people that didnt eat at tables were crazy? Was I crazy? Something was clearly wrong.</p><p>I went back to my room still thinking about where I ate. I was thinking all about it. Was it really bothering me? I guess I had felt like this for about a hour when it got even harder. I stopped being able to put things together. Sentences didnt make sense because they were more than one word. I understood what was going on and I didnt at the same time. Reality was incomprehensible but I knew what was happening. It was so unexplainable. I realized that I couldnt put two things together so I tried to concentrate and get my thoughts straight. I would say to myself, Ok, the bed is here and Im sitting on the bed. I didnt make sense. I could only comprehend myself or the bed alone, not together. I tried a few other examples in my head but nothing worked. Comprehension was SO confusing. I started to get really frustrated. I crawled into a ball on my bed hitting my hands on my head (not hard) trying to think straight. It was so annoying. Then I started to think if this was reality. Did I normally think like this? Was I imagining that something was different? No, something was definitely different. </p><p>I stated to think what if I never went back to normal. What if things stayed like this? I was convinced they would. I didnt know what to do. I had to stop thinking about it. I thought Id go insane if I didnt stop. I walked to a friends house. I was supposed to meet him around this time. On the walk there I just thought about what was going on. When I got about a block from his house I started to smile. I was happy for not apparent reason even though I was having a bad time. I told him and my friend who was already there that I think the weed I smoked was laced with something. They could tell by the way I was acting that something was up.</p><p>They tried to be stupid and tell me things that werent true to see my reaction. I knew what was going on. I told them Im aware of what theyre doing. They never tripped before so they didnt know what it was like. They just figured I was in an idiotic, gullible state. Reality was completely different but I could tell what was real and what wasnt. I noticed there was something about my friend. I figured it out. He was a superhero. I knew it was ridiculous and untrue, but there seemed to be truth behind it. I couldnt put my finger on it. There was something there that made him a superhero. I knew it wasnt true and I knew it was at the same time. It was so crazy. I told him I knew. I told him I was aware that he was a superhero. I knew it would sound so stupid but I had to tell him. Since I couldnt put my finger on what it was that made him a superhero I asked him what his power was. There had to be some truth behind this ridiculousness.</p><p>Since he wasnt tripping I really couldnt have a conversation with him. He starting telling me obvious lies again. I told him I knew when he was lying and telling the truth but it didnt phase him. I started to get pissed off. It was really annoying trying to talk with them. They just didnt get it.</p><p>We started to walk to the movie theatre to meet people and do something. I think I fell a few times on the way there, I really dont remember. When we got there I went to talk to my other friend who worked at the concession stand. He was pissing me off too. He reached at me and I fell on my ass. It was kind of funny. When I got up he reached at my head again and I thought he was trying to pull my hair out so I started to swing at him. He was being such an asshole. I wanted to hit him. I clearly made a scene so I had to leave. We went into town and the craziness eventually diminished. What an insane experience. It was so frustrating I hated it. There was nothing fun about it. Im pretty sure it was PCP. Ive tripped on other drugs since then and enjoyed it but this first time sucked. I wouldnt do it again because there was nothing good about it. Nothing at all.</p>",
 "year": "2000",
 "id": "4852",
 "gender": "Male",
 "timestamp": "2001-08-17T07:00:00.000Z",
 "views": "30441",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "PCP"
  }
 ]
}
