{
 "title": "Not a Party Drug But a Medication",
 "author": "shroomRx",
 "citation": " shroomRx. \"Not a Party Drug But a Medication: experience with Mushrooms (ID 4855)\". Erowid.org. Jan 9, 2002. erowid.org/exp/4855",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "5.0 g",
  "oral",
  "Mushrooms"
 ],
 "report": "<p>I have many experiences I could share that to me are amazing and entertaining, but that is not the reason for what I'm sharing here.</p><p>I wish to express the symptomatic relief that mushrooms gave me from depression, social anxiety, panic attacks, manias, and alcoholism. I have spent most of the last 17 years taking trials of medications that psychiatrists prescribed to me with mixed and disastrous results.  It was coincidental that acquaintences of mine offered me mushrooms at a party. (I was not taking meds at this time.)</p><p>Someone at the party produced a large bag of mushrooms he 'claimed' weighed about 30lbs. He also claimed that he stole them from a biology lab at his local Colorado college where fungicides were being tested.  He alleges the growing process made them extremely potent for clinical purposes.  The mushrooms were of different sizes and colors.  The small baby ones were dark blue and juicy.  The large ones were dry like ashes and golden in color with large caps. </p><p>That night I was apprehensive, so it took about six beers before I was disinhibited  enough to even consider trying the shrooms.  The atmosphere was alcohol induced giddiness, and the peer group was of low emotional and intellectual evolution.  They prodded me a lot, since I have bad reactions to pot I was scared of getting the paranoias and anxiety, I knew nothing about mushrooms at the time. I did my own literary research afterward.  I was definitely curious.</p><p>I finally broke down and ate about six of them, some small and some large.  I think someone with a scale told me they weighed about 4 to 6 grams total.  What followed was the most beautiful experience of my life.  I had multi-dimensional visions, and I was tranported to other</p><p>places.  I heard beautiful music, and felt a strong connection to the other guests, the universe, and some interpretation of 'God' being in me and everywhere around me in different abstract forms.</p><p>Needless to say I enjoyed the experience and repeated it again a handful of times over the next year or two.  What I find most profound is that the experience changed me on multiple levels in my life while not under the influence of the shrooms.  My symptoms of mental illness disappeared for several years afterward.  I was constantly full of energy, and I spoke to people I previously would have found unapproachable or uninteresting.  I became fully involved with life, and enjoyed things I never would have considered before.  I slept normally, had no depression or panic attacks, etc.  What is most amazing is this relief lasted long after the sessions ended.  I found I did not enjoy sessions where the atmosphere was party like or the people were just trying to get a 'buzz'.  I would prefer to retreat with one other person where I could enjoy the experience in a mutually interactive way, or just drift quietly. I don't recall if I ever did a session alone.  Another interesting fact is that my concentration improved and I was better at tasks that require careful attention.</p><p>I suspect my psycho-illness symptoms result from a mixture of biological predisposition (family history), and post-traumatic childhood violence and sexual abuse.  I am just happy to share that mushrooms effectively relieved my suffering without daily taking pills with terrible mental and physical side-effects.</p><p>This was about 5 years ago and I haven't had any shrooms since.  I have regressed slowly to my previous state, with some degenerative symptoms.  I am diagnosed with bipolar affective disorder with rapid cycling, panic disorder, and post traumatic stress.  I think the trials of psych-meds have damaged my thought processes and I continue to feel degenerative effects.  It is really sad that the war on drugs halted the research of hallucinogens in the field of psychotherapy.  I truly believe a medical miracle is being supressed.  Can anyone else relate to this? </p><p>I am afraid to try eating shrooms again because Paxil and loads of other meds I don't take anymore have left my brain chemistry terribly imbalanced.  I am also physically dependent on oxycodone and hydrocodone opoids I take for pain and depression.  Are there medical contraindications for mixing these with mushrooms?  I am also contemplating getting on Methadone maintenance to balance out the mood swings the pain-pills induce and avoid the withdrawals they cause.  If I am making a mistake it is mine to learn. </p><p>Good luck to people out there seeking enlightenment through hallucinogens.  Maybe we will live to see the day when the war on drugs eases up and medicine will use our planets precious resources to heal our minds and bodies.</p>",
 "year": "1994",
 "id": "4855",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-09T08:00:00.000Z",
 "views": "26385",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 }
}
