{
 "title": "Hangin' with Dad in Heaven",
 "author": "Miro",
 "citation": " Miro. \"Hangin' with Dad in Heaven: experience with Mushrooms (P. cubensis) (ID 4856)\". Erowid.org. Jan 25, 2001. erowid.org/exp/4856",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "175 lb",
 "report": "<p>Ive written a couple other reports on this site, only level three though. ive only been using psychedellics for about a month now. Ive done acid one time (two days ago), and mushrooms 4 other times. My last mushroom trip, last weekend, was a bad trip.</p><p>Last night, i was home, realized that nothing was going to happen with any of my friends, and the thought crossed my mind that i might want to trip on my own again. I knew that i had access to nature: behind my backyard is a bit of a forest. i knew i had access to all of my music and movies: i was in my room. And i knew i had access to my computer to communicate if possible and to turn on the cool music visualizer i just got. As far as i was concerned, i couldnt have asked for anything else in the world to make me more content and happy.</p><p>I took out the 1/8 bag of shrooms that i had, laid down in my bed with my laptop in my lap, and slowly started to eat them. I had eaten nothing that day, and i eat my shrooms plain. I have actually somewhat begun to like</p><p>the taste, amazingly enough. I had taken a low doze xanax earlier to counteract the anxiousness i get when i trip. I knew that i wanted to sit still, and i needed to not be anxious to achieve that goal. It worked flawlessly with one other interesting effect, i couldnt feel the trip</p><p>coming on. I began to wonder if anything was going to happen when things started getting a little weird.</p><p>I was talking to two of my friends only, and having just finished my 1/8 bag of very good, carefully dried P. cubensis, i proceeded to tell one that i did the mushrooms, she said ok. To the other i said:</p><p>Do you remember the moment when you realized that the future is fake and that nothing but this very moment is real?</p><p>He replied: No, i dont remember, not sure if i ever had that realization.</p><p>At that point, i start forgetting things. I know that i signed offline after some period of time. Put tool in the stereo (apparently im the only person around, that i know of, that can listen to tool no matter how hard im tripping, especially on acid), hit repeat, and proceeded to turn on the music visualizer on my computer. It is an amazing program, creating the most beautiful colors and patterns. I became lost in it several times.</p><p>I put on the Dark City dvd, put the computer at the foot of the bed, turned up the tool, and and got into the most comfortable laying position i think i had ever been in. I was taking in the movie and listening to the music. It was fabulous.</p><p>Suddenly, the telephone rang. It was my business partner, and man who is like a brother, D. We had recently had an argument on the day after my bad trip, where i was more depressed and hopeless than i had ever been. I got upset, withdrew, and he called me a loser. I hadnt talked to him since. I was beginning to really trip, and i talked to him and made up. We finally</p><p>realized that our relationship is like a brother, not a friend. I felt so much love and was so grateful to have him in my life at that point.</p><p>I then decided to go get a few more shrooms from a bag of 1/4 ounce that i had in the freezer. I grabbed about 4 of them, and went back to my room. I ate them over the next 20 minutes and things quickly faded to black.</p><p>My next impulse was to close my eyes....suddenly, everything vanished, and the strangeness started.</p><p>From this point on, everything i think is just the physical and symbolic interpretation that i have forced myself to make to be able to understand what happened. There are no words that the imagination could even comprehend that would hold a candle to a lousy explaination of what happened. Please understand that everything was on a level of magnitude much greater than what i can say here.</p><p>I dont know how long this took, but suddenly i was in a different place. I was walking when suddenly i found myself embraced by a man who said he was my father. he was weeping with joy. All of his feelings filtered into</p><p>me. I felt what it was like to have infinite love and infinite joy. I was finally home. I began to cry, for love, for joy, for sadness for being gone.....it was powerful.</p><p>He began to teach me, question my assumptions, expanding my consciousness. At one point, he just laughed and opened a door which contained, to the</p><p>best of my vocabulary skills...enlightenment. Suddenly i understood everything...it was filled wtih the greatest level of ecstasy possible. As quickly as i knew it, it was gone...but the impression lingers....and i thank everything for that.</p><p>I suddenly came to normal consciousness. I felt extremely drunk and disoriented, and didnt feel like i was really tripping. I was looking for visuals, but wasnt really seeing any...things were just blurry. I somehow</p><p>got online and my friend mike was online. Apparently i conversed with him and said:</p><p>i just cried with my father and he loved me</p><p>m said, what did your dad say?</p><p>i said: what are you talking about?</p><p>I dont know what to really make of that.</p><p>Something very important happened there.....</p><p>I drifted back off and found myself in another place. I have no way to describe it other than i was just there. I began to consciously think about things there and question it.</p><p>As quickly as i went there, i left and was thrust into another reality. I lived there for a while, and eventually was brought somewhere else. I could have lived for 1000 years as 1000 souls in 1000 worlds, or i could never have been...its impossible to say. I just had a sense of knowing. Each time i would change levels it would be like waking up from sleep. I would be fully aware, exist, have an environment, but nothing was quite right.</p><p>Eventually, i came back to the real world. Each of these trips lasted about 2 hours. I never felt fear or anxiousness.</p><p>When i was first going under the spell of the mushrooms, i actually said: now i understand the mushroom.</p><p>The key to the mushroom experience is realizing that they put you in total touch with the unconscious and your feelings. Acid focus more on thought processes. This is a much more powerful experience overall...</p><p>This has changed my life.</p><p>I have been spending the past day writing and drawing for the first time since i was 13. I drew 15 pictures. Some of them ended up being really good....</p><p>Here is a poem type thing that i wrote:</p><p>And I came unto him</p><p>who welcomed me</p><p>with weeping arms</p><p>and endless joy.</p><p>Eternal love</p><p>Devoid of betrayal,</p><p>Flooding over my soul.</p><p>I feel renewed,</p><p>awash in endless love</p><p>And acceptance</p><p>HE welcomed me home.</p><p>Quizzing my mind</p><p>and searching</p><p>my soul for worthiness.</p><p>Level upon level</p><p>Puzzles of puzzles.</p><p>Finally reaching.</p><p>Travelling 1000 years</p><p>As 1000 souls</p><p>Remembering it all.</p><p>Layers of reality forming.</p><p>Complete awareness of each</p><p>Always real, never quite right.</p><p>Finally, after waking up</p><p>from level upon level</p><p>of consciousness,</p><p>ego reinstatement.</p><p>Delusional and questioning</p><p>Playing games</p><p>Fooling the mind</p><p>It wasnt a dream</p><p>It wasnt my imagination.</p><p>It was.</p>",
 "year": "2001",
 "id": "4856",
 "gender": "Male",
 "timestamp": "2001-01-25T08:00:00.000Z",
 "views": "18780",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 2:00",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(plant material)"
  }
 ]
}
