{
 "title": "All Natural Detox",
 "author": "Adolfo",
 "citation": " Adolfo. \"All Natural Detox: experience with Tabernanthe iboga (ID 48582)\". Erowid.org. Oct 1, 2007. erowid.org/exp/48582",
 "substance": "Tabernanthe iboga",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "17 g",
  "oral",
  "Tabernanthe iboga",
  "(rootbark)"
 ],
 "report": "<p>If I had to compare Iboga to anything, it would definitely be Salvia. It's all there, the natural aspect, the question of intent and the ever-present danger of falling into fear. I don't know if this really qualifies as a report, maybe just an experience, but here goes nothing.</p><p>That summer, and perhaps earlier, suicide had become my ultimate cop-out when faced with horrible future possibilities. Although 2-3 years ago, after making some poor academic decisions, I had actually thought about ending it, by now I knew I'd go homeless or to the psych ward before biting the bullet. In other words, I never actually consciously believed that I'd kill myself, but (unbeknownst to me) I would always have this escape mechanism in the back of my mind when I found myself in a seemingly dead end future. If I found myself unable to convince myself that some horrible image of myself was false, or that someone wasn't better off than me or simply when my self-esteem would falter I would unconsciously threaten with something like, 'Well, I can always end it..' and a pretty strong conviction that I knew something of what was awaited me.</p><p>Anyway, Iboga finally called this control drama's bluff, only to have the whole house of cards come tumbling down once and for all (spectacularly, at that). I had planned to take Iboga for a long time, as a personal initiation and spiritual quest for guidance (the stories of visions and afterglows didn't hurt, either). I don't know if it was because I never seemed to get the setting just right or if I was just procrastinating, but the summer was coming to an end by the time I finally had time to take it.</p><p>Maybe I took it on too much of an empty stomach, or I should have prepared an extract to get rid of the plant matter, because I ended up reacting to it in the worst way. I had expected a little nausea, but not two full days of feverish haze. Uncontrollable sweating, pain and just pure fear.</p><p>My most distinct memory of that experience wasn't a vision, I only remember barely seeing (and I was looking) a small picture of a shrine the size of a piece of paper superimposed on the wall beside my bed in a sort of after-image kind of way. My most vivid memory was the point when I was so frustrated with the experience that I fell back upon my usual suicidal escape reasoning, that is, 'Well, I don't need to win that badly anyway, I can just die and continue.' To which I got the ultimate shock, 'Do you really know what'll happen?' Accompanied by the conscious realization of everything I had been doing, that I was being childish and that this was nothing more than a control drama.</p><p>It never occurred to me how similar this was to the collection of Salvia trips I've experienced, also for the first time that summer.</p><p>If and when I try this again, I believe I will extract the alkaloids to avoid any excess fever caused by ingesting large amounts of what is basically wood.</p>",
 "year": "2005",
 "id": "48582",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-01T07:00:00.000Z",
 "views": "9913",
 "dose": {}
}
