{
 "id": 4861,
 "title": "The Inner Voyages",
 "date": {
  "submission": "2007-05-05T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Kaosexplorer",
  "gender": "Male",
  "weight": "55 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "<p>I have been hearing of more and more people these days taking salvia, whether this is good or bad remains to be seen, just remember people, it is already schedule 1 in Australia and for one reason or another (I have speculations) the powers that be do NOT LIKE IT when we find legal substances of a mind expanding nature.",
  "Background information:",
  "I live in switzerland so I regualary smoke better bud than even the best stuff found in the US (believe me, I've compared). I have done mushrooms enough to be acoustomed to the different effect of different species. DXM, well I'm one of those ex-DXM kids, you know one of those who have done so much their body has leared the substance in pill or syrup form and rejects it by vomiting. By now I have done alot of salvia. 2C-I I have done multiple times but do not enjoy. 5-DMT I have done in doses much too high. Dramamine, which I hate and other things that I cannot recall at the moment. Enough braging as some may see it, I just want to make it clear that I know what I'm doing when it come to psychedelics. As much as anyone can know what they are doing.",
  "So I am going to describe one of my most memorable experiences with salvia that I feel can give a general appreciation of what kind of substance it is.",
  "I was in my room one night, the house was empty. I had already done salvia a couple of time with sucess but I had read of people having mindblowing experiences, some difficult. I was relaxed but eager, my mood was a steady calm waiting for action. Having never experienced any discomfort with salvia before, I decided to try smoking an entire bowl of salvia 10x. Turned on my stereo which started playing nofx, I packed a very big bowl and smoked it in two hits, keeping the smoke it as long as I could.",
  "After my second hit, I was feeling the inetial salvia trip. It was strong but I wanted it to be stronger. I turned off the music which was distracting me from the trip and the microuniverses that I could see poping up everywhere. I emptied the bowl and filled it again halfway (rather hard due to my hands shaking). It took me two hits to finnish the second bowl.",
  "As I put the bowl down, I felt the room spinning around me, I then saw the entire room turn two dimentional and fly into the bowl which I somehow was still holding in my hand. Disoriented by this, I realized I had put the bowl down, then closed my eyes. The spinning sensation was rather intense and could be quite terrifying if one was not in the right state of mind.",
  "And then the most incredible thing happened, as I closed my eyes again I was projected into memories of my early childhood. Memories I had not revisited in many years, memories I had forgotten. I was not only going through the memories, I was reliving them, remembering what it is like to see the world through the eyes of a child, a rather cynical atypical child. I experienced what could only be described as a second childhood, time was distorted beyond belief. I relived the pain of past memories, but also the joy. It was a positive experience.",
  "When I opened my eyes, I realized I was still tripping and that only 10 minutes had gone by since I smoked the first bowl. Considering how long it took to pack the second one, I would not believe that possible if time was flowing in a normal linear manner. I felt renewed, like I was more myself than I had been in a long time.",
  "I was then taken by curiosity, I wanted to see what I would look like to myself in this state. I went to a mirror, and when I looked in, all I stared at was my eyes. Into my eyes I saw the infinate complexity of my being, I saw right down into myself and I fully understood that the eyes are the doorway to the soul. I saw that I am an incredibly vast being and how only a fraction of my true self inhabits the physical realm. And even then, it does not truely inhabit the physical realm, it is mearly confined to observing the physical for most of the waking hours.",
  "That is all I have to recount of that night. However I did gain something that I still have over a year later. My imagination is stronger than it ever was since being a child. Some might see that as useless, but for those who understand the true nature underlying imagination, they will see it is an priceless gift.",
  "Personaly I love salvia and have never had anything that I could call a bad trip on it. I have friends however who have had traumatic experiences from lower doses, of the same stuff I had consumed. So be carefull if it is one of your first few times, as it is the drug that choses you, not you it. And if it does not agree with you, you will have a most unpleasant journey.</p>"
 ],
 "erowid": {
  "id": "30438",
  "citation": " Kaosexplorer. \"The Inner Voyages: experience with Salvia divinorum (10x Extract) (ID 30438)\". Erowid.org. May 5, 2007. erowid.org/exp/30438",
  "substance": "Salvia divinorum (10x Extract)",
  "views": "2532"
 }
}
