{
 "title": "The White Lady with the Sinister Laugh",
 "author": "Gina",
 "citation": " Gina. \"The White Lady with the Sinister Laugh: experience with Cocaine (ID 48613)\". Erowid.org. Oct 19, 2009. erowid.org/exp/48613",
 "substance": "Cocaine",
 "bodyweight": "62 kg",
 "report": "<p>It all started one afternoon, 3 months ago. I had just finished from a two week tough work on my dissertation which, ironically enough, is on substance misuse. I was truly interested in mind altering drugs but had never taken more than the usual weed here and there, I'm not a heavy weed user cos many times it had bad effects on me, and the couple of E's during good parties.</p><p>My friend, let's call him John, a heroine addict who's in complete denial of his addiction, was having withdrawals & craved a hit of coke. Since I had never tried the drug, I wasn't particularly interested, but after constant pressure, I gave in to it & said yeah why not? Wouldn't that increase my empathy towards the clients I was interviewing at the time? A couple of hours went by, contacted dealer and a very close friend who loved coke, let's call her Leslie, to share the gram and here goes the rest:</p><p>First grm: divided it in half, half for John and the other half for the 2 of us.</p><p>John preferred to shoot it. I watched. Didn't want 2 get at my part before Leslie came round. Was quite afraid actually. But after John's reaussurance that one doesn't get hooked on it unless one takes it constantly for at least a year I decided to plunge in. First snorted a small line. Nothing. Then curiosity took over & I shot another bit. Yes, I wasn't afraid of the needle at all, which is already a bad sign. Nothing except a bit of hyperactiveness which I didn't attach to the drug. Concluded it's not worth the hassle and the money.</p><p>But I was so wrong!</p><p>Hours went by, another 2 grms scored, and I shot them, God what a sensation! Shot the third of a gram, after having had another 2 quarters shot an hour or so earlier, watched while John mixed it with water and took it up the new insulin needle through the cotton. Tourniquet, and you got the picture. The feeling was so overwhelming, the lovely, insane ringing in my ears, the rush, my heart racing fast...had to sit down on my bed! absolutely stunning!</p><p>Days passed and I was itching for more. John called me up a few days later. Said he had a third of a gram mixed already in the spoon waiting 4 me. Before I knew I was dressed up and ready to leave until Leslie confronted me and said that this reaction isn't a good sign. Eventually managed to calm down and get to my right senses.</p><p>To cut the long story short, these past 3 months I've been mainlining coke with John and another friend of his on and off. Had bruises, inflamed skin out of wrong shooting, trouble finding veins etc. Last week we bought 5 grms, called the dealer 4 times and went 4 needles 5 times! $455 spent in one night. The stuff was so good I wanted more and kept urging the others to score more and more. Ended up shooting half a gram at a go, twice, with the disappointment of not feeling the same rush I experienced the first time I injected. I was chasing the rush and couldn't find it and hence wanted more! Blew up so much money that night! Had so much anxiety and guilt feelings! Had to take two valiums to eventualy calm down and I never had valium before.</p><p>This week I decided I'll quit coke.</p><p>It's like riding the train to somewhere, not knowing where it's taking me, but I keep on longing for it yet I know it's doing me no good but only leaving me with this empty feeling, a loneliness and a crave for more. The first time I had that blasting hit I thought: I found the drug for me. I associated it with a boyfriend who never lets me down but how wrong was I! So before that train takes me to a place where I can't go back, I'm going to stop at this stage, get off it and wave goodbye.</p><p>Something which helped me say goodbye was shooting another gram for the last time, and knowing it was the last time gave me such a high because I know I don't need that shit in my life. And I'm glad, relieved, I'm waving goodbye.</p>",
 "year": "2005",
 "id": "48613",
 "gender": "Female",
 "timestamp": "2009-10-19T07:00:00.000Z",
 "views": "6993",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "IV",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
