{
 "title": "Quite a Chemical",
 "author": "NonEntity",
 "citation": " NonEntity. \"Quite a Chemical: experience with DOI (ID 48630)\". Erowid.org. Jan 26, 2007. erowid.org/exp/48630",
 "substance": "DOI",
 "bodyweight": "145 lb",
 "report": "<p>I have had several experiences with DOI in the recent past and can say that it is quite a chemical. Most definately my favorite phenethylamine so far (I have taken 2C-B and 2C-I several times in the past). The effects don't really remind me of either 2c-b or 2c-i, but the visuals are relatively simliar to 2c-i.</p><p>For me, DOI is a lot more enjoyable in groups. Getting several people together and trip is pretty amusing. However, most people I have tripped with (including myself) think it is less fun to be around sober people while on it.  Some people also seem to require more for dose. One male, about 180 pounds, took 3mg and felt little more than a slight amphetamine effect. Same thing happened to another person. Others seem to do fine in the 3-4mg range. I have not experimented with anything above 4mg.</p><p>This report is about my first experience with DOI.</p><p>The first night I recieved some 100mg of DOI, I dissolved it in 200ml of Everclear and a friend, 'A', and I ingested 6ml (~3mg) each at about 6:30pm. While I was mixing the DOI and alcohol solution a small amount (probably no more than a milligram) got on my finger, which I licked off and forgot about (kind of a bad idea), so my dose was probably around 4mg.</p><p>We had to wait about 2 hours for the effects to really start hitting us. It's a rather long wait. When it did it was incredibly speedy. I got slight visuals around this point and the walls and floor where 'breathing'. Colors were a little intensified. A seemed to be pretty wired and had to do something to keep occupied, but he kept getting distracted. I felt very little amphetamine feeling.</p><p>+3 hours: A, myself, and a friend smoke a joint. I haven't seen many reports that describe smoking marijuana on DOI. It's amazing. There is very little 'stoned' feeling, but the doi seems to intensify incredibly for a little while, then drops back down about an hour or two later. After I smoked that joint I was tripping probably harder than I ever have before. At this point the amphetamine part seemed to kick in hard. Not uncomfortably, but really quickly and pretty strong.</p><p>I walked back to my place a few blocks down. When I got home I checked my eyes and they were fully dialated. Everything was moving, my computer screen, my cieling, my wall, I just couldn't look at anything. It was midnight and I kind of wanted to sleep, but I figured that wasn't happening. I went back to A's house, he wasn't tripping as hard and said he had no visuals, but a few CEV's. I had both, the CEV's were quite vivid and really impressed me.</p><p>The effects were nearly gone by about 9 AM and I went to class. Crashed later that night.  I've had two other experiences with 3 and 3.5 mg, neither were as visual but still very fun. Overall it is a great chemical I plan to explore further.</p>",
 "year": "2005",
 "id": "48630",
 "gender": "Male",
 "timestamp": "2007-01-26T08:00:00.000Z",
 "views": "8774",
 "dose": [
  {
   "time": "0",
   "amount": "4.0 mg",
   "administration": "oral",
   "substance": "DOI",
   "form": "(liquid)"
  },
  {
   "time": " T+ 3:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
