{
 "title": "The Physical World Disappears",
 "author": "Lying On Pavement",
 "citation": " Lying On Pavement. \"The Physical World Disappears: experience with 5-MeO-DiPT (ID 48655)\". Erowid.org. Aug 16, 2006. erowid.org/exp/48655",
 "substance": "5-MeO-DiPT",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "insufflated",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Before this trip, I did MeO once but even though I took the same dose, for some reason it didn't hit me as hard as this time.</p><p>I snort 20 mg, and like down next to my boyfriend. At first, everything is fine, and my body is becoming relaxed, my breathing is becoming slower and deeper. Soon though, I start becoming confused. I feel like my throat is opening and that I'm going to be sick, but I'm not sure yet. My friends and I are listening to Sublime but the music seems to be going so slow that I can't follow it and I don't know what song is playing. I start losing the concept of all things physical.</p><p>When I touch my hands, they seem to disappear, and my face when I touch it seems to melt. I try not to touch anything because I dont like the melting sensation. For about 10 minutes (although it seems like ETERNITY), my mind is completely confused and lost. I dont remember exactly what I'm thinking but it was something along the lines of me trying to figure whats happening to me and what I'm thinking about. Reality completely slips away from me, and as I try to find it again, it slips even further down.</p><p>My friends are all hanging out and having a good time, and I'm looking at them but I can't seem to understand anything. It's like we're on two different planes, and I barely register them. My friend comes into the room and looks at my face but I look through her, because I don't think she's real. I feel like if I touched her, my hand would go right through her.</p><p>I start thinking that I'm freaking out (which is a bad idea because that just makes you freak out even more), and I go into the bathroom and am sick. At that point, I feel so shitty that I'm tempted to just lie down on the floor in the bathroom and curl up but I resist that temptation because in one small part of my mind I realize that's not a good idea.</p><p>By this time, everything around me is swirling and the walls look like they're melting.</p><p>I go into the living room and my friends realize that I'm not doing so well. At first I can't understand what they're saying and I cant say anything back. My friend holds my hand and tells me that I'm going to be alright. Snorted, the trip is only supposed to last 30 minutes and Ive gone through about 20, even though it feels like its been a lot longer. Suddenly, I find my voice and start talking to my friend and automatically start coming down. The come down is pretty pleasant and I feel calm now, but I definitely freaked out first.</p>",
 "year": "2005",
 "id": "48655",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-08-16T07:00:00.000Z",
 "views": "3865"
}
