{
 "title": "More Than I Had Hoped",
 "author": "Earth_angel",
 "citation": " Earth_angel. \"More Than I Had Hoped: experience with BZP & TFMPP (ID 48678)\". Erowid.org. Dec 6, 2006. erowid.org/exp/48678",
 "substance": "BZP & TFMPP",
 "bodyweight": "62 kg",
 "report": "<p>The other night, I decided to try out a Red Heart pill that I ordered from New Zealand. I wasnt sure what to expect, but the pamphlet said a safe alternative to extacy, so I went in to it hoping that I would have a great experience.</p><p>Well, I certainly didnt expect as much as I received! My Mum and I took 1 pill each at 7.45 pm. The pills were slow to act; about 1 hour, as apposed to about half an hour for an E. The Red Heart also came on less dramatically. I didnt get a rush of the drug entering my system. Rather, it was a slow gradual increase in the intensity.</p><p>About an hour after we took the pill, Mum suggested we have a few cones. It was Mums gear and I hadnt tried it before. So, I had a couple of cones and passed the bong on to Mum. I stepped back and looked at her and said wow, thats good pot Mum. It really good pot! Thats when Mum said are you sure its the pot, and not the pill? I realised at that point that these Red Hearts were really awesome!</p><p>The sensations that I felt were similar to extacy, but a bit different. The Red Hearts seemed to connect me with my intuition and subconscious on an unbelievable level. Every moment was filled with life-changing realisations about life, and everything in between that you could ever imagine. I understood things so deeply, it was amazing!</p><p>Time stood still. These Red Hearts had me pumping, I had limitless energy, motivation and interest in everything. I felt like I didnt have a single need for anything. Being thirsty wasnt unpleasant; my 3 inch heels didnt hurt my feet, even after wearing them for hours and hours.</p><p>I felt loving and warm and comfortable within my self, my surroundings and in other people. I had to stop and remind myself that it wasnt extacy that I took, it was a red heart. As with extacy, I had an intensification of my senses, and WOW could I dance!!!</p><p>My internal dialogue was (in hindsight) hilarious! If anyone knew what I was thinking, they would have thought I was so up myself. I had an intense feeling of purpose and ability. I became intensely interested in being the best person I could be; intelligent, attractive and an all round nice person. I realised that the character of Reece Witherspoon in Legally Blonde 1 and 2 was my idol. I wanted to be just like Eve!</p><p>I had a dramatically heightened sense of appreciation in every sense of the word. In fact, a lot of things that I said started with I have a heightened sense of understanding other peoples needs or I have a heightened sense of acceptance or I have a heightened sense of self-awareness. Every perception was heightened, and I couldnt stop saying it!!!!</p><p>And the best thing is that Mum was in the same frame of mind, and everything I said to her was so interesting, so we never had a dull moment. The worst thing was that I had to get up early because it was my sons 6th birthday the next morning, and I had to do the present thing and put on a little party. At 3.30 am, I was still pumped, and wanting to party. But, I just couldnt sleep (even when I thought I was sleeping, my thoughts didnt stop, so I dont know if I actually slept at all, or if it was a case of having intense thoughts during my sleep), I was majorly bummed out energy wise all day.</p><p>On the subject of negative side effects: I had way less adverse reactions from the Red Hearts, except I still clenched my jaw terribly (although grinding wasnt a problem). I didnt have the emotional low that I have had after taking an E, and Im sure if I was able to sleep the next day, that I would have bounced back faster.</p><p>Overall, I think that Red Hearts are definitely worth the money. For me, they are a suitable substitute for extacy. They are not exactly the same as extacy, but I feel that if my body copes better with the side effects of the red hearts, that the extra bit of edge you get from extacy isnt worth it, if I suffer so much more with the comedown.</p><p>By the way, Ive already ordered more. NEW YEARS EVE here I come!!!!!</p>",
 "year": "2005",
 "id": "48678",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-12-06T08:00:00.000Z",
 "views": "13250",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Piperazines - BZP",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
