{
 "title": "'It CAN happen to you'",
 "author": "Skunk",
 "citation": " Skunk. \"'It CAN happen to you': experience with Mushrooms (ID 487)\". Erowid.org. Aug 7, 2000. erowid.org/exp/487",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "report": "<p>I had tried mushrooms 2 times before and had nothing but great experiences on it. But this trip would turn out to be not so enjoyable. Me and 2 of my friends decided that it would be a good idea to celebrate the turning of the new millenium with a good mushroom trip. We had all tripped together before so I was comftorable just sitting at home tripping with 2 of my close buds. So anyway we wanted to peak right around mid-night so we figured we should eat them around 11:00. My friend didnt really feel like eating the shrooms so he decided he would make some tea, while me and my other friend would chew them up. We each took around 2.0 grams and had kinda of a lot of tea left over (we ended up sharing this through the rest of the night.)</p><p>Within 20 minutes we were already feeling the effects, I immediatly began to see slight visuals. I still felt a little nauseous from the taste of the mushrooms, so we smoked a bowl. It calmed my stomach right away, and I could tell that I was really going to enjoy this trip. The hallucinations were constant now and I had a feeling of being at total peace. Me and my friends just layed in the living room staring at the ceiling for what seemed like an hour. In actuallity it was only around 11:40, the new millenium was approaching! But I just layed there taking in everything that these mushrooms had to offer. The feeling was incredable! I was taking very deep breathes just trying to comprehend all that I was seeing and feeling.</p><p>It had just turned 12 and the trip suddenly turned from a visual experience to a mental experience. We sat there talking for a while when I began to feel really overwhelmed by what I was feeling. My mind started to race faster than it ever had before, and I began feeling a little uncomfortable. I had some weed so we decided we should pack a bowl. I was so out of it that I couldn't even handle packing the bowl, I had no choice but to let my friend pack it. We smoked it but unfortunately it didnt help. The thoughts in my head were uncontrollable, I had this urge to just walk out of the room and go to bed. My 2 friends were enjoying there trip, they were 'bonding' much I like I had done in my previous trips, but I felt somewhat left out. I now HATED being there. I just wanted to go to sleep, but my mind was racing way too fast.</p><p>By now it was around 1:30am. At around 2:00am my friends sister showed up with about 15 of her friends, they had just returned from a local New Years Eve party. From here my night just got worse. Everyone sat there celebrating the new millenium, but I was unable to enjoy it all. I just sat there staring off into nowhere thinking how bad I wanted to be at home in my own bed. My mind was in such a state of confusion that I was able to hold a conversation with some one, all of my social skills were gone. So everyone pretty much left me to my self. I just sat there for what seemed like days, wishing I could somehow just go home.</p><p>Finally at 4:00 in the morning my mind slowed down enough to where I thought I could go to sleep. So I told my friend (whos house it was) that i wanted to go to bed. They both agreed that was a good idea so we went to bed. I layed there for another 1/2 and hour then finally dozed off.</p><p>It's hard to explain exactly how I felt, but I'll just say it wasn't an enjoyable occurance. Actually now that I look back at it, it was probably the worst day of my life. I always told my self that I would never have a bad trip, but I would definately consider this one. Im not done with mushrooms, I just look at the whole thing as a learning experience.</p><p>So just a few final words: don't let this story discourage you from using mushrooms, because it's a great mind expanding drug. Just dont rule out the possability of things not going exactly how you had planned.</p><p>Have fun, be safe, and remember theres always sweet Mary-Jane!!...420</p>",
 "year": "2000",
 "id": "487",
 "timestamp": "2000-08-07T07:00:00.000Z",
 "views": "9647",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  },
  "1": {
   "time": "",
   "amount": "0.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  }
 }
}
