{
 "title": "Definately Good",
 "author": "BleuCheese",
 "citation": " BleuCheese. \"Definately Good: experience with Atomoxetine (Strattera) & Cannabis (ID 48709)\". Erowid.org. Sep 22, 2007. erowid.org/exp/48709",
 "substance": "Atomoxetine (Strattera) & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "Pharms - Atomoxetine",
   "(pill / tablet)",
   "",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Strattera is a great experience.  I was interested in trying a new ADHD medicine.  I went to the doctor and he prescribed me with Strattera.  I had seen a commercial or 2 and remembered that it was a non-stimulant medication.  I checked out everything online before I tried it, but for some reason most of what I found was negative experiences.  I found a few positive cases and decided it was definitely worth a go.  So I took the pill.  It was supposed to kick in within the first hour but for some reason it never did.</p><p>I then realized that it had indeed kicked in, on a very very GRADUAL rate.  Nevertheless, I was starting to feel the effects.  At first I had a slight feeling of nausea accompanied by a little light-headedness.  It was actually a little like feeling stoned.  I looked it up and found a report about people getting 'too high' when they mixed the two.  Where I am from (undisclosed) there is no such thing as getting 'too high' so I loaded a big bowl in my water pipe and let the good times roll.</p><p>And wow after that bowl I felt FANTASTIC.  Definately something I have never experienced on Adderall.  It was GREAT.  I really enjoyed the rush I got.  We went to the grocery store to buy a lil bit of food (yes it decreases appetite but not as bad as adderall).  When I walked in, my high and senses went into overload.  It was quite an experience.</p><p>I am back at the place now and I still am very active.  I don't know what will  happen next but so far it has been quite enjoyable and I can study great now.  Worth it.</p>",
 "year": "2005",
 "id": "48709",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-09-22T07:00:00.000Z",
 "views": "31657"
}
