{
 "title": "Antidepressant Success Story",
 "author": "the man",
 "citation": " the man. \"Antidepressant Success Story: experience with Duloxetine (ID 48777)\". Erowid.org. Jun 21, 2007. erowid.org/exp/48777",
 "substance": "Duloxetine",
 "bodyweight": "200 lb",
 "header": [
  "DOSE:",
  "60 mg",
  "oral",
  "Duloxetine",
  "(daily)"
 ],
 "report": "<p>I am an 18 year old male. My father has clinical-depression and my mother is a narcissist. All my life I had thoughts of how much better it would be to go to sleep and not wake up. Think about a seven year old boy holding a steak knife thinking 'I want to kill myself'.</p><p>Depressing right? Well little did I know that those morbid thoughts would be a reoccuring theme in my teenage years.</p><p>I was always socially awkard before highschool. I only had one or two close friends for many years. In the 8th grade I started to get friends and have a fairly active social life. It was also in 8th grade that I started smoking weed. Now, I wasn't smoking weed because of my new friends, (infact they were all antidrug except for one, the one who hooked me up with my first herb) I started smoking weed because I was interested. There was no peer pressure at all. In the 5th grade we had DARE classes, boy did those not work for me. The idea that you could take a drug and feel completly different intrigued me beyond anything else.</p><p>I should get back to the story but first I have to say this: Weed is not a problem for me, I don't smoke it because I am depressed. Anyone who says smoking weed works for depression doesn't know what depression is. If I am in a shitty mood smoking some pot will make me feel better. If I am depressed smoking pot will throw me into a circular thought pattern of how much I hate myself and my life. I am a pothead and I smoke everyday but it is because I like to relax at night and play video games. I do recognize it as a great tool to study myself, but if I did that everytime I get high I would be a pretty selfish person.</p><p>So 8th grade ended and I had my new group of friends. I had the greatest summer ever of innocent youth fun with solitary experimentations with some weed. It really was a great summer, everyone excited for highschool.</p><p>I live in a small town and every generation of kids hangs out in the same area downtown. I have a weird socially awkard cousin who lives in the same town and would follow me and my group of friends around. For my whole life I had to act as a social worker for my cousin. Almost every weekend of my childhood my cousin would get dropped off at my house by his mother, leaving my to spend the whole day with him. I actually asked my parents if i could have a 'cousin free weekend'. Finally I had cool friends and here my weird cousin won't leave me alone. Well my new friends weren't related to this weirdo and as kids often do, they ridiculed him; all summer. I could do nothing but teeter between defending him and making fun of him with these friends I never had before.</p><p>At the end of the summer my cousin waited for me and my friends downtown. We saw him standing there with a can of gas. We ignored him for a while then he got our attention. He said he was going to kill himself because of us. He then poured the gas on himself and attempted to light a lighter. Immediatly me and my other friend (without a doubt my bestfriend) grabbed him and got the lighter from him. The crisis was averted. Afterwards my cousin was completly fine and acted like nothing had happened. Talk about a mindfuck for someone who is just going into highschool.</p><p>For days afterwards I felt dissociated and I couldn't hear what people were saying. For weeks I had reoccuring thoughts of what would have happened if he had lit the lighter, why didn't I try harder to prevent this? We the fuck did he do this?</p><p>I had Post-traumatic-stress-disorder and as a result, my underlying clinical depression came to the surface. It took me until 10th grade to admit to my parents that I was seriously considering suicide daily. I finally went to a shrink, and he tried a suitcase of drugs. Effexor, Paxil, imipram, lexapro. All ineffective. I did this for about a year until the end of 10th grade. I stopped taking them and for the summer I didn't feel depressed. Once school started again the depression kicked in, but this time I wanted Adderall and thought I had ADD, so instead of SSRI's I went on speed. Major weight loss, personality loss, my brain was too fried to process emotions. I stopped taking Adderall out of concern for my physical health.</p><p>It wasn't until the summer of 2005 had I realized how depressed I really was. I hadn't graduated highschool, I had no job, no car, nothing to do. I was out of shape and didn't go swimming the whole summer. I abused magic mushrooms to no end. I can not count the number of times I ate shrooms. How I didn't have a mindbendingly bad trip I don't know. But it took me about 5-7 times of wishing I hadn't eaten shrooms to stop taking them. It was a summer of smoking weed and reflecting on myself. I realized I needed to do something. I went to a regular doctor who knows my family and who also has clinical depression. What he told me was a breath of fresh air. Clinical depression is a disease. Taking medication for it is no different than taking insulin for diabetes. If you don't take medication you get stuck in a circular thought pattern and are in hell. He prescribed me Cymbalta and I convinced myself to try the pill route again.</p><p>I started in september 2005, it is now almost January 2006. All I can say is wow. I no longer am depressed but instead I can feel a diverse amount of emotions. My concentration is stronger then ever and I can think so clearly. I can analyze social situations, why people do the things they do, what role each person plays. It is a strange gift and I am not sure if it is something to be proud of, but it works in my favor. Thank you Cymbalta.</p><p>My only concern is what am I going to do in the long run, certainly I can't take this my whole life.</p><p>There are no side effects. If I miss a dose I feel withdrawal symptoms unusually quick but that is due to its short half life.</p>",
 "year": "2005",
 "id": "48777",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-21T07:00:00.000Z",
 "views": "18759",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Duloxetine",
   "form": "(daily)"
  }
 }
}
