{
 "id": 4880,
 "title": "The Divine Vision",
 "date": {
  "submission": "2001-12-17T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "wildmuir",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 drops",
   "administration": "oral",
   "substance": "LSD",
   "form": "liquid"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "2:00",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  },
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": ""
  }
 ],
 "report": [
  "I began my trip with two drops of LSD on my tongue around 4pm on a Sat. I had slept all day and had planned the trip the night before. I knew I wouldn't start to peak with good visuals until around 5:30 pm. I did not expect anything with this trip and did have some trip toys present. I had a black light and a red lava lamp in a white painted room with a surround sound stereo. The music was techno rave type music. As soon as I noticed a shift in my senses I smoked a party bowl of weed and became very stoned and did not recognize any heightened LSD effect. I had small pattern visions at this point and did see them move and form with the beats in the music which had seemed to slow down and make sense for some reason.",
  "At about 6pm. I started in on my favorite drug nitrous oxide, inhaled in balloons. The first balloon I pulled I noticed that I seemed to come out of my trip into normal reality. I thought that this was strange and continued to inhale and exhale the nitrous back and forth into the balloon. I suddenly became aware of the music and then closed my eyes as I felt myself drift into someplace so strange and extremely fast. I had wonderful closed eye visuals and started to loose myself into each beat of the music. I opened my eyes and let the balloon wizz from my fingers. The sight I saw is hard to describe but it was as if the room I was in and had become shapes of liquid that would shimmer with every very slowed down beat. I had to think for a minute to realize that this was not real and was part of the trip. Soon though it faded back to the same old patterns and the beat seemed to pick up even though I knew it wasn't. I repeated this same process with the same but varying results with the nitrous.",
  "After about 15 nitrous cartriges I decided to give the salvia a smoke test. I was pretty well tripping and did not care or think to look at the clock at this point. I fumbled to get together two bowls of the salvia because I new that I would want another one to prolong the trip with in the trip I was about to have. I had never smoked salvia and tripped before at the same time so I really didn't know what to expect with this combo. I smoked two big lung-fulls out of a bong and didn't realize a change until the third lung full. I didn't even realize a change until I looked up from the bowl and exhaled. My eyes were open I know but they were not seeing anything that was real. I am not sure of what I saw but it was so real to me I didn't realize it wasn't until I came down and the room came into focus. I did the same thing with the second bowl and remembered right afterward what I saw, Again hard to explain and even hard to understand but the music was alive with color and I could hear the colors morphing. They made sense of something but I couldn't catch what it was, nor could I comprehend it. It was DIVINE in all parts of the word so beautiful and so blinding that I feared that if I understood this that I would know the key to life on a spiritual level.",
  "To me after I came back to the room I had seen heaven. From then on though the trip seemed so peonish and totally human. I kept thinking though about the divine vision and now I see things different and do believe I will for all my life. Not a bad different but a more respecting different. I know hold a new reverence for the salvia plant than I did before with the visions of past use. The visions given to me after I smoked it were not of anything my mind could think of...almost as if I tapped into the heavens if only for that vast instant."
 ],
 "erowid": {
  "id": "3050",
  "citation": " wildmuir. \"The Divine Vision: experience with LSD, Cannabis, Nitrous Oxide & Salvia divinorum (ID 3050)\". Erowid.org. Dec 17, 2001. erowid.org/exp/3050",
  "substance": "LSD, Cannabis, Nitrous Oxide & Salvia divinorum",
  "views": "13293"
 }
}
