{
 "title": "Two Tests",
 "author": "Garth",
 "citation": " Garth. \"Two Tests: experience with Blue Lotus (ID 48863)\". Erowid.org. Mar 12, 2007. erowid.org/exp/48863",
 "substance": "Blue Lotus",
 "bodyweight": "83 kg",
 "header": [
  [
   "DOSE:",
   "2 Tbsp",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(tea)",
   "",
   "6 bowls",
   "smoked",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2005",
   "48863",
   "Male",
   "",
   "Not Given",
   "Mar 12, 2007",
   "8699",
   " "
  ]
 ],
 "report": "<p>We'll I'd read a bit about Blue Lotus (what little there was) and decided I'd give it a try. I ordered it from an online vendor and decided to try two preparations and to note their effects.</p><p>The first preparation I did was with two tablespoons of the dried plant material in a cup of boiling water, left to sit for 10 minutes and with a teaspoon of sugar added to taste.</p><p>I downed the mixture as quickly as I could, though was unable to actually eat the soggy plant material at the bottom of the cup - I tried - but it was just too disgusting. After 20 minutes or so of waiting I noticed a very very mild relaxing effect, but it could have been as much a placebo as anything else. I deemed this first test a failure.</p><p>The second test involved loading up a bong with the material that had been previously pulverized in a coffee grinder to almost a powder. I smoked the first cone of the material and noticed a quite pleasant taste to the smoke - also that it was quite easy to smoke. I decided I'd do this properly and quickly loaded up 5 more cones of the material in quick succession smoking them all over the space of about 10 minutes.</p><p>Five minutes later I realised I was feeling some effects. I can describe it sort of like a marijuana stone, but not nearly as strong, though it does sort of feel the same. There was a heavy sort of feeling in my head and I felt quite relaxed. Another thing I noticed was a sort of humming or droning in my head, which I have noticed on other occasions using Blue Lotus. </p><p>There are none of the really trippy thought patterns you'd expect from marijuana (though your mind does tend to wander), but I did notice one pseudo-psychoactive effect in that I could see detail of close up objects very well. For instance it became quite interesting to look right into the plate of icecream I was eating, I could see all the little details and intricate patterns within it. This was a very mild effect mind you, nothing out of this world, but it was kind of cool. I was unable to notice any effects of the blue lotus 2.5 to 3 hours after ingestion.</p><p>The only after effect I got was a head-ache about 2 hours after the smoking test, but I can't fully attribute it to the blue lotus as I often get headaches.</p>"
}
