{
 "title": "Prescribed to Me by My Creator",
 "author": "Almir Velagic",
 "citation": " Almir Velagic. \"Prescribed to Me by My Creator: experience with Fasting (ID 48937)\". Erowid.org. May 3, 2006. erowid.org/exp/48937",
 "substance": "Fasting",
 "bodyweight": "195 lb",
 "header": [],
 "report": "<p>From the earth did We</p><p>Create you, and into it</p><p>Shall We return you</p><p>And from it shall We</p><p>Bring you out once again.</p><p>-Qur'an, Surah Ta-Ha\r</p><p>Muhammad (peace be upon him) said: 'Fasting is a shield and a powerful fortress.'</p><p>Fasting  is one of the pillars of Islam.</p><p>The fasting that begins on Ramadan lasts throughout this holy month and basically involves starting a fast pre-dawn (before sun begins to shine over the hilltops and landscapes) up until the sun sets behind the horizon. The essence of the fast is waking up in the morning before sun is about to show its first rays and eat and drink in small amounts and pray/meditate to aliviate my soul of impurities and desires. It acts as a barrier and as a tool to fight my desires and teach me self restraint. During the day I am not allowed to eat or drink a single thing and refrain from negative activities. After sun sets I am allowed to break the fast with a date and a glass of water and pray/meditate yet again to thank my creator for providing the sustinance that some do not have in this world. After I meditae to the sunset I eat and drink normally and repeat for a month.</p><p>I came into this religion as an adult and always found this month the most spiritually lifting month of the year. The prayer/meditation serves as a spiritual fuel to carry me through the day when my body is weak and sluggish. First three days will be somewhat difficult, but if I wake up in the morning and follow the procedure it won't be difficult at all.</p><p>The idea behind the fast in the Muslim tradition is to weaken the physical body, so I can easly get to the soul and refuel it so it can overpower the bodly desires and make me into a positive human being that radiates with joy and internall happiness. This fasting has been done by Muslims all across the world for centuries (Even Arabs whose days are very very long). It is not unhealthy as some people claim and it will not cause any harm to my body if done properly as mentioned above. After all this was prescribed to us by our creator who knows everything about us.</p><p>After the month I will feel more enegetic, cleansed and more spiritually uplifted to tackle the desires which can be destructive to our body's and soul's. Self restraint is what makes us human, so in the esence I become more human and in touch with my inner self.</p>",
 "year": "2005",
 "id": "48937",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-03T07:00:00.000Z",
 "views": "6476",
 "dose": []
}
