{
 "title": "Uncovering the Self with the Ancient Soma",
 "author": "Shakti's Disciple",
 "citation": " Shakti's Disciple. \"Uncovering the Self with the Ancient Soma: experience with Amanitas - A. muscaria (ID 48945)\". Erowid.org. Oct 31, 2007. erowid.org/exp/48945",
 "substance": "Amanitas - A. muscaria",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "25 g",
   "oral",
   "Amanitas - A. muscaria",
   "(dried)"
  ]
 ],
 "report": "<p>This was my third experience with Fly Agaric, after 2 less successful encounters, using 1 gm and 1.5 gm of X10 extract respectively. Those experiences had led to rather disappointing experiences which at best were slightly hypnotic. I had come to the conclusion that for a more intense trip, I would need over 20 gm of dried mushroom material.</p><p>I obtained 2 X 25 gm packs of dried extract from a shop about 300 yards from where I live. I decided to take the mushroom one Sunday in December 2005. Contextual factors that may have experienced the trip: The previous day, I had gone for an intense 55 mile cycle ride. This would have increased levels of Serotonin and Endorphin. I had ingested some vegetarian Pizza the night before.</p><p>First of all I ground the dried mushroom material using a blender, which reduced it to a course powder. I then mixed it with canned mushroom soup, which I heated on the top.  The mixture had the texture of porridge and the colour of Butterscotch whip. I quickly consumed it from a large soup bowl. Luckily it was of a pleasant taste, mushroom soup with a bit more intense flavour. I took the mushrooms at 1200 hours GMT. After consuming the mixture I listened to some music, Rammstein and Clawfinger.</p><p>About 45 minutes after taking the mushrooms I began to feel drowsy, typical of the coming up phase of taking Fly Agaric. I had been advised that when this occurs it is best to lie down as it is when the mushroom's ibotenic acid is converting. I went up stairs to lie in bed in my bedroom and put on some more music. I felt a bit like when I take Pscibolin mushrooms with a MAOI such as Passiflora, where drowsiness entails, which is followed by somatic symptoms and then psychodelic experience.</p><p>With Fly Agaric I was experiencing some nausia, and whilst this was not too challenging or making me vomit, was more than experiences with Mescaline containing cacti. A sort of loop like experience was forming in my mind, a bit like a repetitious thought cycle, each lasting about 5 seconds. I was sweating profusely, and feeling hot yet chilled at the same time. Eventaully these thought loop like experiences evolved into an intense spiritual state. It was like a complete ego reducing out of body experience. I was experiencing the pure spiritual self, a bit like a Shulgin +4 experience I had had with Mescaline exactly a year previously!!! Time had slowed to almost nothing and it seemed like a moment of 'actual time' was like years of experience.</p><p>I was moving into some lucid dreaming, and it seemed like I was moving from life time to lifetime. This was re-affirming my belief in reincarnation and associated Hindu/Neopagan concepts. I came to the conclusion that if the soul lives on beyond physical death, I would survive this experience and not move on to oblivion/nothingness.</p><p>As with the Pscibolin mushrooms, music playing seemed to have more meaning, and was easier to take in due to time passing more slowly. Physically I could not feel myself, so it was an out of body experience and I did go downstairs to changeover CD, though did not feel any physical exertion of running back up stairs.</p><p>At about 1830 hours GMT I had peaked, and the trip was starting to become less intense.  I went downstairs and rung one of my friends to tell them about the experience. I went back upstairs, experiences were similar but less intense, about a Shulgin +3. I was listening to music such as Nine Inch Nails and Dio, it seemed a bit like the music was stopping and starting, though it wasn't.</p><p>By 2230 hours GMT the trip had down graded somewhat, and was a bit like the afterglow from an intense Mescaline trip. I felt relaxed and very refreshed. I went to a local outlet to buy some frys with cheese. I went to bed at around 2330 hours GMT, still felt serene and refreshed.</p><p>The next few days I felt rather chilled out at work, and was not working as productively as usual. Libido was far lower, though came back with vengence 5 days later.</p><p>In all a life changing, awe inspiring experience.</p>",
 "year": "2005",
 "id": "48945",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-31T07:00:00.000Z",
 "views": "30088"
}
