{
 "id": 4894,
 "title": "History, Rewritten",
 "date": {
  "submission": "2007-06-18T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Elohim",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "The following happened sometime in 2001, in the early part of the year. This is the report of my first breakthrough experience on salvia. The experience that completely shattered my perception of reality and existense forever.",
  "Its about 10 AM, everyone in my house has left so I prepare to smoke my Salvia 5x extract. I get out my pipe and extract and a lighter. I sit in my backless computer chair, load the bowl, and shut off the tv. I light the bowl and inhale, 2 big hits holding each for as long as I could. Close my eyes. Next thing I know I feel powerful pulling on my body. I'm being dragged to the ground. I look over and a group of quite powerful beings are dragging me into a vehicle of some kind. Sheer terror sets in.",
  "I'm driven to another place, another time, another dimension, a complete other plane of existense with these beings. I fear I'll never get back to the familiar cozy existense that I've been familiar with in the 16 years previous. Finally we arrive at our destination, a large completely empty plane, sans for a extremely large table and 4 or 5 massive beings who I intuitively know are my true family. My cosmic superbeing family. And I am one of them. I look at myself and I too am one of them. Any idea of who I used to be is gone. I was always this way. Its how I was meant to be. In the corner of this plane, I don't how how it suddenly developed a corner. Is every human being I've ever encountered. Perfectly detailed down to the hairstyle. All small enough that I could pick them up in my hand at once. I'm being scolded by my new family about not meddling in human affairs. Its not my place to do so. I just sit and listen.",
  "Slowly things start to fade. I'm back in my old existense, only it doesn't seem real. I frantically run around trying to confirm its the old world, but I remain sure its just a parody world. A doppleganger, looking similiar but lacking the true depth and soul of an actual reality. I decide to go downstairs. As I'm walking down the stairs an intense blinding yellow light envelopes my vision, from behind my eyes. I jump on the couch to avoiding falling. And close my eyes hoping it will stop. It eventually does and still feeling this sense of unreality I do everything I can think of to comfort myself. I sit on the floor wrapped in a blanket frantically jamming orea cookies and milk into my mouth, trying to focus on the tv. Trying to regain a sense of place thats real.",
  "Salvia does something no ordinary hallucinogen/psychedelic/entheogen does. It doesn't distort reality. It creates its own. Complete with a history. It erased my entire existense and wrote a new one for me. My previous life never existed. I had no question this is how I was. No idea I'd taken a drug, I was previously 'human'. I've never been the same since this experience. Once it happens, theres no going back."
 ],
 "erowid": {
  "id": "30546",
  "citation": " Elohim. \"History, Rewritten: experience with Salvia divinorum (5x extract) (ID 30546)\". Erowid.org. Jun 18, 2007. erowid.org/exp/30546",
  "substance": "Salvia divinorum (5x extract)",
  "views": "2775"
 }
}
