{
 "title": "Sedative Effects",
 "author": "Hypersphere",
 "citation": " Hypersphere. \"Sedative Effects: experience with Pedicularis groenlandicum, P. canadensis & P. lanata (ID 48967)\". Erowid.org. Sep 30, 2010. erowid.org/exp/48967",
 "substance": "Pedicularis groenlandicum, P. canadensis & P. lanata",
 "bodyweight": "120 lb",
 "report": "<p>I became interested in exploring the effects of Pedicularis species after finding a few references to sedative or hypnotic effects in herbal medicine books. Other books claimed that Pedicularis was edible, so I wasn't too worried about poisoning myself. Numerous alkaloids have been reported in this genus, and often the alkaloids vary between species. I also found an online article about incorporating different Pedicularis species into smoking blends, and the effects were said to be comparable to Cannabis.</p><p>The first species I found was Pedicularis groenlandicum, known as 'elephant's head' because the densely clustered flowers do indeed look like little elephant's heads with trunks. This plant is reasonably common in marshy areas of Canada, and is very easy to recognize because of its bizarre purple coloured foliage and flowers. I harvested some of the flowers (supposedly the strongest part) and dried them out. When they were dry they looked remarkably like purple cannabis buds. I packed a large bowl and smoked it all to myself, holding in the smoke with each inhalation. After finishing, I noticed a slight calm, relaxed feeling. About an hour later I went to bed and almost immediately went to sleep which is very unusual for me (I am prone to insomnia). However, the next day I felt abnormally irritable, which may or may not have had anything to do with the Pedicularis. I have since smoked groenlandicum a couple more times, and each time gotten little more than a mild sedation.</p><p>I also managed to find a very small amount of Pedicularis canadensis (a yellow flowered variety) and Pedicularis lanata (which is adapted to grow at extremely high elevations by growing a dense wooly coat all over the flowers). Pedicularis lanata is supposedly the strongest species for sedative effects, and in my one experiment is did seem to have a stronger effect than groenlandicum. Pedicularis canadensis caused some euphoric effects the first time I smoked it, but I was unable to attain any effects on two further trials.</p><p>To sum things up, I found that P. groenlandicum and P. lanata both had mild sedative effects, and P. canadensis is still in question. Certainly these plants are no substitute for Cannabis.</p>",
 "year": "2004",
 "id": "48967",
 "gender": "Male",
 "timestamp": "2010-09-30T07:00:00.000Z",
 "views": "6649",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Pedicularis spp.",
   "form": "(dried)"
  }
 }
}
