{
 "id": 4897,
 "title": "Comprehending Infinity",
 "date": {
  "submission": "2004-02-12T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "m0ckturtle",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "10",
    "grams": 0.01
   },
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "insufflated",
   "substance": "5-MeO-AMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I will preface this by saying that I am not sure exactly how much 5-MeO AMT I ingested that night, because my scales are within a 1-2 mg accuracy.",
  "If you choose to do this substance, make sure you know EXACTLY how much you are taking. This is a powerful substance.",
  "Now, on to the report..",
  "I had tried 5-Meo AMT on 2 prior occasions. The first at ~6mg parachuted, the 2nd being ~8mg parachuted. I fasted for 12 hours the first time, and for about 8 the 2nd. On both of these, I vomitted around 20 minutes in. Neither was NEAR as intense as the one I am reporting on.",
  "It was around 9pm on a weekday and I thought, well, I'll give the meoamt another shot... I was very disappointed with the my first 2 experiences. So I weighed out 11 mg, dropped 10 mg right into my mouth chasing it quickly with some dr pepper (The taste isn't THAT bad, but it is quite unpleasant) then I snorted the remaining mg. Then I sat back to watch a movie for the first hour or so in which I expected to do nothing but try my hardest not to vomit. Surprisingly so, the vomit never came and was (relatively) easy to hold back. (Note, I didn't really 'fast' beforehand per se, but I hadn't eaten for about 6 hours)",
  "+30 I felt the tryptamine body buzz begin with the lower stomach tighening",
  "+1hr Thoughts began racing through my head that I had taken too much so I panicked. The next hour or so was spent calming myself down & telling myself it would be okay",
  "+2hr This is where it gets insane... the visuals were better than any I had ever had off of LSD. Colors EVERYWHERE. Sounds were 'digital.' I remember going to the bathroom and thinking, 'Wow. Its way to bright in here' so I reached to turn off the light and it was already off. ha.",
  "+3hr I put in 'Underworld' since I figured that would be cool to look at in this state, and boy was it. It all looked like a cartoon... and all motion on screen was nearly indescernible from the intense & long lasting tracers.",
  "+6hr Now this is when it gets a bit crazy...",
  "My dad was asleep during all this & was going to work the next morning. I knew I couldn't interact with him so I decided to act like I was asleep. So I sat in my chair. Just sat there... being quiet as a mouse... and thinking. The thinking was what got me. I kept trying to 'comprehend infinity' and felt that I was going to go insane if I continued but I just couldn't stop. I realized that that's what makes people crazy, trying to comprehend infinity.",
  "+9hr My dad finally left for work and I was noticably coming down a bit, but still feeling good. I could finally leave the confines of my room & I just walked from window to window, looking outside. If it had been warmer, I would have loved to go outside. I decide to play my guitar for a bit, because at my lower dose experiences it was so much fun. The colors from the strings, the beauty of the music.... I wish I would have been able to do this earlier in my trip when it was still strong",
  "+12hr all effects gone. Still I'm not too tired so I get on the internet for a while.",
  "All in all, definitely the most intense psychadelic experience I have ever had. Though the side effects make it a bit unpleasant, and doing anything but sitting was near impossible during the peak... I walked like a drunk, having to hold on to things to keep from falling over. Its worth a try, but there are FAR better psychadelics out there. But will I do it again? Most likely not... I got what I felt I wanted from it.",
  "Happy Trippings!"
 ],
 "erowid": {
  "id": "30557",
  "citation": " m0ckturtle. \"Comprehending Infinity: experience with 5-MeO-AMT (ID 30557)\". Erowid.org. Feb 12, 2004. erowid.org/exp/30557",
  "substance": "5-MeO-AMT",
  "views": "9158"
 }
}
