{
 "id": 4900,
 "title": "Gnostic Odyssey on Two Wheels",
 "date": {
  "submission": "2006-06-20T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Universal Shaman",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "A friend and I hopped our bikes, dropped a trip each; he had one of those miscellaneous trips we get with a coctail of unknown substances, normally speed or pseudoephedrine -based, I had a clean acid tab.  We'd been waiting to drop together for some months.  We didn't have a chance to utilize the mushroom season to its full potential back in August, so it has been a good year since we've had a good trip together.  So the anticipation was high, and our minds were open for the reception of whatever was to come.",
  "We rode along walking trails that follow a creek for some kilometers.  It was after dark, park lights were spotting havens for rest...not that we needed it, and the spirit descended as the peddling pumped the blood carrying chemical catalysts through the body's gnostic antenna, the nervous system.",
  "It was a moderate dose affair that proved strangely enough to have dramatic psychological ramifications, and which brought back the usual torrent of profound insights, which I havent experienced to such depth since I gave up weed not long ago.",
  "I was surprised at the lack of body-heaviness on this occasion and this is my reasoning for calling it a lower dose, coupled with the fact that patterned visuals (open or closed eye) were mostly absent.  In fact I was full of energy. I felt like I could ride my bike at any speed for any distance without feeling any tiredness or lethargy.  While I was riding I said to my friend Im gonna feel this in the morning.  Surprisingly, I didnt.",
  "Perceptual enhancement was exceptional from the kick off; bright, vivid, multidimensional colours made brilliant halos around street and park lights.  My body and the entire environment surrounding me seemed to buzz with energy as if I was perceiving the various vibration levels inherent in the subatomic particles of different types of matter: the creek seemed to vibrate like a trillion dominoes cascading in every direction at once, the purest perception of fluidity Ive ever experienced, whereas the vibrations of tree trunks were stifled and muffled by the density of their wood; and every type of matter in between had its own distinct level of subatomic vibration that determined whether it was hard, soft, fluid or gas.",
  "The times I stopped to take a breather from riding I would meditate (open-eyed) so that a full psychedelic trance would engulf my consciousness, and these were the richest moments of psychological/spiritual/mystical revelation and perceptual enhancement.  (The following is an aggregate description of the 3 or 4 times we stopped).",
  "Sitting, staring blankly ahead, removing any intentional thought from my mind, I began to receive the bombardment of information that almost always accompanies these states of mind.  At first I noticed that I could actually watch beams of light being emitted from the park lights, and I could follow their propagation through space without moving my eyes or head, using the eye of my awareness alone.  It seemed like my entire Being had slowed down to such a degree that for once my mind had the time and space to actually process the speed of light.  Of course I could be delusional.  Or just tripping.  Whatever the case, it confirmed to me, in ways I know not how, the simultaneity of the reality of physical science and the validity of subjective human perception: and this realization opened the flood gates.",
  "Everything I saw from this point on took on qualities and expressions of life and mystical symbolism.  Everything was living, moving, growing, changing, and displaying deeper meanings than surface appearances.",
  "I realized that plants are a manifestation of things totally unseen.  A healthy plant is just an indicator of the right soil, the right climate, the right location, the right neighbouring plants and animals: this goes for any living thing, plants, animals, humans, even atoms, molecules, stars, planets and galaxies: we are all expressions of the things that surround us and have surrounded us since we came to life, the things that we consume and interact with, physically and psychologically.  The miracle of a living entity is that it is not an autonomous entity at all: a tree is merely the representation, a sign or symbol indicating that a whole range of seemingly unrelated factors and conditions have coincided in the same place at the same time.  Nothing stands alone  all is one  and the one displays the all.",
  "One cannot judge the meaning of human life on Earth without understanding the ups and downs of our history, because we must know who we are in relation to each other.  And one cannot understand the meaning of human life in this place without understanding the cosmological history of the Universe, because for this we must know who we are in relation to this Universe, and what we can offer it.  The same is said of animals and plants in the environment: I cannot explain what this or that animal is without including information on where it lives, what it eats, how it survives, and even what animals preceded it in evolution. ",
  "One cannot judge a person without understanding where they have been, what they have done, who they relate to, how they see things, and why, as well as what they want to offer the world.  Every thing in existence is the expression of its environment, which means that literally everything is interrelated, and no thing can be separated from another, the Universe is a single entity, one whole organism; and we do have a role that exceeds the  meaninglessness inherent in the evolutionary 'fluke of partial chaos': we are an organ of the Universal body.",
  "People forget that we are part of the Universe: there is no separation.  We are made of the same stuff; we exist with the Universe and interact with it at the same time that it interacts with us: we are the Universe, just like that rock, or my bike, or our solar system.  We are not in the universe, we are this universe.  Everything is this universe.  Consequently, what people rarely realize is that when we speak, the Universe Speaks.  When a person speaks we say they are speaking because meaning-encoded sounds are coming from a part of their body.  Our bodies are just as much part of the universe as rocks and bikes and stars, so that when we speak, meaning-encoded sounds are coming from a part of the body of the Universe.  Therefore we represent the speech  and the thought and the emotion and the action  of the Universe.  Of course there may be other races of beings who are contributing to this voice, but that doesnt reduce the fact that intelligent human life is the brains of the Universe.",
  "During the whole experience my friend and I were on a similar level.  We always knew where each other were, mentally speaking.  We both spoke few words but somehow communicated a great deal.  I guess gestures and facial expressions helped a lot, but at times there did seem to be a kind of mutual understanding which we laughed at a couple of times in amazement.  At least I was amazed.  Though there is always the sceptical thought that maybe were thinking totally different things and were both just tripping, but generally actions or subsequent conversations confirmed that we were both very aware of each others state of mind.  I should note that this mutual understanding related to our level of intoxication, and also how our personalities work, so to speak, not so much in terms of insights or gnostic information.  It reminded me of when I first started smoking weed with my mate Rick.  After wed both finished our first bowl, Rick would always ask with a laugh, you stoned yet man?  And it always helped get us in the same frame of mind.",
  "All in all it was a deep thinking, high energy experience that was very smooth and containable.  The next morning I was physically a little groggy, but no more than a usual late night.  I was mentally alert and in a glowing mood after the grogginess went, and four days later I am still high, feeding off the infinite insights opened to me by a chemical relative of Gaias most profound gifts."
 ],
 "erowid": {
  "id": "30570",
  "citation": " Universal Shaman. \"Gnostic Odyssey on Two Wheels: experience with LSD (ID 30570)\". Erowid.org. Jun 20, 2006. erowid.org/exp/30570",
  "substance": "LSD",
  "views": "3416"
 }
}
