{
 "title": "Dancing with the Devil",
 "author": "Comfortably Numb",
 "citation": " Comfortably Numb. \"Dancing with the Devil: experience with Diethyl Ether & Inhalants (Starter Fluid) (ID 49005)\". Erowid.org. Jun 18, 2006. erowid.org/exp/49005",
 "substance": "Diethyl Ether & Inhalants (Starter Fluid)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "inhaled",
   "Inhalants",
   "(gas)",
   "",
   " ",
   "inhaled",
   "Ether",
   "(gas)"
  ]
 ],
 "report": "</p>\n[Erowid Warning: The water extraction method is ineffective in separating diethyl ether from the volatile hydrocarbon liquids/gases in starter fluid. Our understanding of the literature is that there is no such thing as safe use of volatile hydrocarbon gases: their psychoactive effects are inseparable from nerve and organ damage.]</p><p>This is not necessarily a retrospective on my experience with this powerful and numbing, but ultimately mind-numbing drug, as the few times I tried it the experience was similar.</p><p>Fear and Loathing was my inspiration, as was the need for something harder hitting and easier to get than Cannabis (the king of all psychoactives in my opinion). I researched it along with asking friends about it. Only a handful of people I know, many of whom had done much harder drugs than I have. One (an avid Hunter Thompsan fan) recalled huffing it, along with formaldehyde and who-knows-what, from a preserved shark specimen. I was not about to go that far, though what I did was probably just as dangerous.</p><p>I could not fathom where to get the pure stuff, so I purchased a bottle of starter fluid from my local department store, feeling quite stupid. I sprayed it out and distilled it in a plastic bag using water. By adding water and shaking, the fluid splits into two layers, with most of the heptanes etc. on the bottom, and the ether on the top..</p><p>I drained the heptane out and put the remaining ether-solution into a cup. I was ignorant so I did not really prepare correctly for what I was about to do. I lay on my bed and huffed a bit of the ether I splashed on a few sheets of  paper-towel (this is the best way, I can tell) and got nothing but some light-headedness. I read a bit, somewhat disappointed, even though I knew I just hadnt taken enough.</p><p>About half an hour later, I inhaled more and more ether through my nose. I didnt notice the fact that I was high immediately because you are too busy huffing. When I finally looked up, it was like I was in a dream. Even more, it was like I didnt exist, I could not imagine I was the person I was a minute ago. Then, it hit me that I was in the same room, with the same posters on my wall as it was before. This led way to a strange euphoria, and objects appearing as they are zooming in on me.</p><p>The whole experience flowed with a strange sort of rhythm. It was a fast-tempo pulse that seemed to be the noise from outside my window, and inside my head blurring together. It changed with the progression, and I noticed different rhythms and sounds I hadnt before. These were synchronized with what I was seeing all around me as well. Pulses of light were in the form of constantly but orderly changing geometric shapes (mainly squares), were all over the walls and the ceiling. I can best describe it as being inside a futuristic machine or retro video game.</p><p>Along with the pulses, visions, and euphoria, there was such a strong sense of deja vu. I honest to god felt (and still do feel) that when I was a child I experienced the same trance during a dream. It seemed so familiar and I hold that to this day.</p><p>Coming down was a bitch. Ether has a pleasure very reminiscent of sex. I feel a lot of the same feelings, and I  always want more because I dont want those feelings to stop, and I want them to grow to a peak. This is what is very dangerous. It is extremely addictive In the short and long term. Thank god I was able to come to terms with myself and say 'enough is enough'.</p><p>There is not physical withdrawal, only mentally that lasts for about an hour. It isn't bad. The hard part is stopping, and not doing it again.</p><p>This is the summery of the three times I used ether. I then got rid of all I had left because I was scared with so much I would become addicted and lose even more brain cells. It is quite and amazing and life changing experience, though it has its consequences.</p><p>It did change my brain. I can tell, because now when I am tired and lie down, it is easy for my to get a pulsed/euphoric feeling that is sort of like being on a rocking boat, but very relaxing and trippy. This is not really a bad thing, but I really hate to think what else it has done.</p><p>In conclusion, this shit is dangerous, and a fuck of a lot harder a drug than I thought. It was a very unique and pleasant experience, but it is not in my taste to do it again.</p><p>Ether is an enticing devil.</p>",
 "year": "2005",
 "id": "49005",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-18T07:00:00.000Z",
 "views": "14365"
}
