{
 "title": "Makes Me Want to Live Life",
 "author": "Medidate(Ritalin)",
 "citation": " Medidate(Ritalin). \"Makes Me Want to Live Life: experience with Methylphenidate (ID 49007)\". Erowid.org. Jan 29, 2008. erowid.org/exp/49007",
 "substance": "Methylphenidate",
 "bodyweight": "155 lb",
 "report": "<p>I've never gotten into uppers that much.  I've done coke once, liked it, but only done it once.  I've tried adderall, a lot, and have done up to 140 mg at once (not pleasant).  I've always been into getting real, real fucked up (mushrooms, pot, lsd, dxm, etc.)  This expierience made me think about my drug use.</p><p>An hour ago, I was coming down from a 1/2 oz. smoking session with my 4 dudes and I decided to mess with sum time release ritalin.  At first glance, it looks just like adderall xr, its little balls inside of a capsule, about the same volume and mg of a standard addy, except the balls are white not orange.  Anyways, to crush these balls I put the stuff beteen 2 spoons and grinded them together until it was powery, then I poured it onto a piece of paper and smoothed it out with a spoon until it was a fine powder, with a coke-like texture.  I tasted it.. not bad, no numbing sensation tho(frown). </p><p>T+0  I crushed up 3 pills at 20 mg each between a spoon and snorted it.  The taste wasn't bad like meth or other pharmasweuticals, but it wasn't as easy as adderal.  It was about a 3/10 on the pain level.  A few minutes later, I had a runny nose, drip isn't bad.</p><p>T+0:15   Start to feel less like passing out, and more like talking.</p><p>T+0:20   WOW! I feel like I'm on coke, I'm not jiterry, I feel like a million dollars, and I just wanna talk to people on AIM and talk about how we should hang out more.  My vision is the same as an oxycotton buzz, sharper images, everything seems a little darker and brighter at the same time.  I want to express myself.</p><p>T+45:00  I'm feeling less euphoric, and a little more jittery, like the coke comedown.</p><p>T+1:00  I'm on the comedown. I'm not shaking like I do on coke, I just feel like I have extra mental energy, but I don't feel like moving.  I feel a little depressed that it is over and decide to try it again, like I do on coke.</p><p>T+ 1:05  I blow 40 more mg(2 pills) in one line, nasal drip kinda sloppy, but not very painful. </p><p>T+1:15  This time it took effect very quickly, it is probably combining with my previous dose.  I feel awesome.  I feel like I need to get power, and I need to make friends with everyone I know. </p><p>T+ 1:25  I never want this to end, and want to drop out of school and become a cocaine dealer, and have this feeling whenever I want.</p><p>T+2:00 (right now)  The second dose lasted very long.  I don't feel crappy, I feel like I just popped adderall.  I'm going to snort more now.</p><p>Well.  Ritalin should definately be abused a lot more than it is.  It feels just like coke!!!  Seriously, from this expierience I've decided to spend all of my money on coke(to sell) ritalin(for me) and booze (for poon)!  The bottom line is, even though noone I know believes me, I am extrememly excited that I figured out how good this shit is.  It makes me want to live life.  It makes me feel happy and awesome and it makes life wonderful.</p>",
 "year": "2005",
 "id": "49007",
 "timestamp": "2008-01-29T08:00:00.000Z",
 "views": "21445",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "60 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": " T+ 1:05",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  }
 }
}
