{
 "title": "Short Shrooming",
 "author": "Quale",
 "citation": " Quale. \"Short Shrooming: experience with Mushrooms (P. cubensis) (ID 4901)\". Erowid.org. Jan 10, 2002. erowid.org/exp/4901",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Syrian Rue",
   "(seeds)",
   "",
   "1.7 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "report": "<p>About 10pm measured out 2.5g Syrian Rue in a very poor scale.  Ingested this dose and added an extra half spoonful for good measure.</p><p>10:40 crushed up about 1.5g old dried mushrooms chewed and swallowed with water.  Five minutes later had another (quite small) mushroom head.  This was my first mushroom experience.</p><p>Effects came on fairly fast and I was noticing a difference after only 45 minutes.  Unlike the fear and trepidation that marks the begining of an acid trip I felt tingly and good like the begining of a roll.  Before long I was in a great mood laughing uproariously at the smallest joke.</p><p>My friends had to run some errands at this time so I came with them.  Riding in the car was a party but I was still experiencing only mild euphoria.  My topics of conversation started drifing more than usual but other than this no psychedelic effects.</p><p>Once we got back the euphoria was turning into a sort of sexual energy filling my body.  I would think some thought and then twist it around to 'look' at it sideways.  The experience was still non-visual but I was still looking at my thoughts in that paradoxical manner.</p><p>At this point I left to a darkened room with a CD player and surrelistic pillow.  The lights on the ceiling began moving and shifting and I quickly slipped into that wonderully familiar psychedelic state where I live and exist in the eye of the mind unconnected to the real world.</p><p>I saw (edieticly not visually) black and white take form as if they had been peeled from a chessboard.  These were not just the sight of black and white but the essential essence of the colors, the platonic forms of black and white.  Then extending in that perfectly fluid display of pure sensuality unique to the psychedelic experience they meet in a kiss.  Not the wet messy exchange of fluids required of mortals but the perfect touch of extended archetypes frozen in eternity at the moment of barest contact.  Still though I was lost in the experience of those forms coming together.</p><p>Then, less than halfway through my CD, I was suddenly sober.  It was only 12:17 and I headed home.  I still could see the sparkly blue/green patterns and trailers in my vision but psychologically I was almost entirely sober.  In a half hour those were gone as well leaving me with the annoying insomnia of acid combined with some of the calmness of the e comedown.</p><p>All in all a good, if somewhat disappointing experience.  Maybe fresher mushrooms would have done better.</p>",
 "year": "2001",
 "id": "4901",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-10T08:00:00.000Z",
 "views": "16006"
}
