{
 "title": "Intense Euphoria",
 "author": "Aopocetx",
 "citation": " Aopocetx. \"Intense Euphoria: experience with Pseudoephedrine with CPM (ID 49016)\". Erowid.org. Mar 24, 2008. erowid.org/exp/49016",
 "substance": "Pseudoephedrine with CPM",
 "bodyweight": "130 lb",
 "report": "<p>I had bought a pack of Sudafed and wasn't expecting three pills to do much. A minor stimulant at most, I thought. I wrote the following while under its effects.</p><p>---</p><p>Forty-five minutes, no effect. Perhaps breathing is a little easier. An hour in, a feeling of relaxation overcame me. As if every orifice in my body has cleared up. Ten minutes later I feel great. Breathing is easy and everything feels very good. It is a bit similar to ecstasy, minus the emotions and visuals. I had no idea pseudoephedrine would have such an effect. From what I have read it is a second-rate stimulant. I am writing this real-time, and it blew my expectations away. Taking a bite of food is orgasmic. I am in a state of euphoria. There are no negative effects as of now. No stimulant properties, either.</p><p>Effects are still rising. I am feeling better by the minute. An hour and twenty minutes in and an even more intense euphoria is overcoming me. I feel as if I am experiencing some sort of prolonged orgasm. I can not believe how similar this is to ecstasy, and at six bucks per packet of twenty-four. Everything I had heard about this great substance is nowhere near what I am feeling. The sunlight is very beautiful.</p><p>Five minutes later I have become accustomed to the gentle relaxation and I am being overwhelmed by a feeling of love. I am blanketed by a feeling of unity with the world around me. I am starting to get disinterested from writing this log, as if there is a much higher purpose to my life. Nevertheless, I will continue on. I should add that I have ingested 12mg of chlorpheniramine maleate, which was present in the medication along with pseudoephedrine, although I doubt it is responsible for these feelings. As I am writing this, words seem to flow freely. I do not have to concentrate to put my thoughts on paper.</p><p>This substance, this gift from God, is something I will come back to in the future. For now, I am content with lying on my couch, enjoying the rays of sunlight bathing my body. But the question still lingers in my mind: why does this have such an intense effect? As far as Ive looked, no one has repeated what I have written here. Perhaps it is the chemistry of my brain maybe it is different from theirs, but pseudoephedrine is marvelous.</p><p>Almost two hours after taking the substance, I am still feeling great. I had to force myself to come and write down this note: music is enhanced. Not any auditory enhancements, mind you, but I am appreciating the skill involved in making it. The sun is setting outside of my window and looking at it almost forces tears of joy. Suspended animation/a state of bliss, lyrics from a Pink Floyd, describes this greatly.</p><p>Most of the effects seemed to have worn off two hours later. That is to say that my trip lasted about an hour. I still have a great desire to lie down and relax, and taking deep breaths is a great feeling. I experienced no jaw-clenching, no sweating, and very doubtfully an increased heart rate. My pupils did get dilated.</p><p>Six or seven hours later I still felt relaxed and even dissociative, as if I would be looking in on myself from a camera attached next to my body. Each look would last only a few seconds. Furthermore, it was not a visual but rather a mental thing.</p><p>---</p><p>After a bit of looking I found out that chlorpheniramine maleate can act as an antidepressant. Perhaps this is what caused such an intense euphoria?</p>",
 "year": "2005",
 "id": "49016",
 "gender": "Male",
 "timestamp": "2008-03-24T07:00:00.000Z",
 "views": "51217",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "180 mg",
   "administration": "oral",
   "substance": "Pseudoephedrine",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "(pill / tablet)"
  }
 ]
}
