{
 "title": "Better Than I Expected",
 "author": "Methadone",
 "citation": " Methadone. \"Better Than I Expected: experience with Methadone, Alcohol & Cannabis (ID 49059)\". Erowid.org. Jul 24, 2007. erowid.org/exp/49059",
 "substance": "Methadone, Alcohol & Cannabis",
 "bodyweight": "150 lb",
 "report": "<p>A few days ago I managed to get my hands on some pills called methadone. I wasn't exactly sure what they were at first but I soon found out. They were just used to treat opium addiction. Last night a few of my buddies and I decided to go camping out. I have had the pills for a while now, I was just alittle nervous about taking them, especially out in the middle of the woods. I asked my friends if something went wrong and I had an allergic reaction would one of them be sober enough to drive me to the emergency room, several of them said yea dont worry about it. I took one 10 mg pill at about 8 pm as we were sitting around the camp-fire.</p><p>I didn't really feel a thing until about an hour later. My body started tingling and I just felt real good. I thought to myself, I guess this is all the pills are going to do to me, I'll be fine if I drink a few beers. After I drank about 2 beers I was feeling great, I honestly can't describe it. I can really tell why these pills are so addictive, I absolutely love the way they made me feel.</p><p>I drank about 3 more beers and as soon as I finished number 5 one of my friends showed up with some reefer. I told him I was really messed up and he asked me if I wanted to smoke. Of course I said yea. We went to his SUV and smoked 2 bowls out of my pipe. I was feeling fine and walked back to the fire. When I went to go sit down that was when I realized I was extremely messed up, the marijuana just increased my high from the pill.</p><p>It was 23 degrees and I couldn't feel a thing, the weather seemed like a perfect spring day. At about 12 I had to go back to my friends house that I was spending the night with. I walked into his kitchen and all of a sudden everything started spinning in one giant circle, kind of like when your drunk but 10 times worse. But I never got sick from it.</p><p>I laid down and fell asleep at about 1 am. I woke up the next day at around 12 pm and I felt sort of out of it. My body was still pretty  numb and I felt just relaxed. I figured the pill would have worn off by now, 24 hours after I took it. Overall it was a great experience but I would reccomend being extremely careful in taking them. I've took many differnt kinds of pills but nothing was like taking methadone. I honestly don't know if I would ever take one again because I can get an endless supply of them. That would be really difficult to explain to my parents why their 16 year old son is addicted to synthetic heroin.</p>",
 "year": "2005",
 "id": "49059",
 "gender": "Male",
 "timestamp": "2007-07-24T07:00:00.000Z",
 "views": "13681",
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Methadone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "5 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
