{
 "title": "The Self-Proclaimed Family Destroyer",
 "author": "A. Victim",
 "citation": " A. Victim. \"The Self-Proclaimed Family Destroyer: experience with Crack (ID 49093)\". Erowid.org. Jun 19, 2006. erowid.org/exp/49093",
 "substance": "Crack",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " repeated",
  "smoked",
  "Crack",
  "(freebase)"
 ],
 "report": "<p>Crack. Rock. (Free)base.  I'm sure you know many more names for this drug that was surely invented with the sole purpose of destroying mankind as we know it.  Sure, one might argue that I have never tried it.  I would say that being a close relative to an addict is just as damaging.  Here is a paraphrased account of what experience I have with crack. </p><p>NOTE:  I am aware that some anti-drug freaks post fictitious stories to steer people away, but trust me I did not make any of this up.</p><p>Let's see here...  It all started one day when my mother's boyfriend (at the time) came home that day.  He held up some rocks and asked her if she wanted to 'party'.  She had tried crack years before when she was still with my father, but she didn't like it.  He is very convincing, however, and she eventually gave in.  If I ever had a chance I would kill him for this very moment in my life.</p><p>Her addiction went on for a couple years before I had any clue, as I was naive to drugs at the time.  During this time of my unknowing, however, I do remember hearing about a comment that this boyfriend made to some of his crack buddies.  'Yeah, guys, I got her hooked alright!'  Another moment that I could kill him over.</p><p>Well, the secret finally came out December of my freshman year in high school.  By this time I had already done pot a few times, so I wasn't completely blind to the drug sub-culture.  Anyways, one of my mother's friends was driving me home one day when she said it.</p><p>'You know why your mom acts weird sometimes don't you?'</p><p>Trying to go along with it, I said sure.</p><p>She responded with something about crack being a bad habit, and that she had done it with my mother as well.  This is when I snapped.  The first thing that came to mind was the thought of my own mother doing one of the more damaging things I was taught to stay away from.  The friend obviously knew that I wasn't really aware until she let it go.  She begged me not to tell but it was the first thing I did when we arrived home.</p><p>Now for those of you who have never seen how anyone acts on crack, it is honestly scary.  It's like they are zombified, but with intense energy.  I can't even have a reasonable conversation, everything I say is heard but not interpreted.  Also, they are always digging through stuff.  In this case my mother would always dig through her drawers and shelves, and when I asked what the hell she was doing she would just reply with 'Looking for something.'  The voice was very distinctive too, yet hard to describe.  It sounds almost like the person has something in their mouth and is using a different tone.</p><p>Well, time went by, her and the boyfriend split (after a fistfight between him and I), and eventually (after a 3 day crack binge and hallucinations that the feds were hiding in the forest planning to ambush) my grandmother and I got her into rehab over the '04 summer.</p><p>We thought we had finally done the right thing, but this proved to be in vain.  After almost a month, I swear to god, the very first night she returned she did the shit again.  I couldn't take anymore, so I left on foot and stayed at a friend's place for about a week.  We have never had the same relationship since.  The story isn't over, though.</p><p>Oh no, many more fights over that deceptive rock and another trip to rehab after she attempted suicide by swallowing many pills (11 of which were hydrocodone from when I broke a bone) would follow.  And it still goes on today.  After run-ins with law enforcement, social services, and almost every family dispute known to man, the fire still blazes.  In fact, I sit before you writing this article on Christmas eve, 2005...  2 days after my mother's last relapse.</p>",
 "year": "2005",
 "id": "49093",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2006-06-19T07:00:00.000Z",
 "views": "24529",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(freebase)"
  }
 }
}
