{
 "title": "Strip Club Adventure",
 "author": "SD",
 "citation": " SD. \"Strip Club Adventure: experience with GHB (ID 49127)\". Erowid.org. Jun 25, 2007. erowid.org/exp/49127",
 "substance": "GHB",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>One night, almost 2 years ago, I was very depressed. It was because of a girl; she just wanted to be 'friends' after we had what I thought was a romantic night. I had a bottle of G around that I was doing a few times a week. I'd usually take it at night and wake up at 6am feeling refreshed and ready for work.</p><p>So here I was, depressed at home, my friends are all working. What would cheer me up? The strip club! I had never been to one before. So I pour some G into a bottle of iced tea (probably 4 grams) and off I go.</p><p>I get there and admire the ladies, and sip my iced tea freely, feeling quite happy and sly of the fact I am consuming a powerful illegal drug right in front of everyone. Soon I started to feel relaxed and mellow, almost like an opiate feeling but with more clarity. It was like alcohol as well but with more pure vibes. Soon I felt drunk. I was smiling, and talking to some people when I went to the snack machine. I am a pretty nonsocial person, but this stuff made me do a 180.</p><p>Suddenly, I wake up to a stripper at the main table tapping me. 'Hey, this isn't the place to sleep!' she said in an offended but playful way. 'You had too much to drink?' 'No just tired' I say. Wow that was embarrassing. I wake up and move around some, trying to get the blood flowing.</p><p>Things went well later that night. I talked to a guy that worked there about who is best for a lapdance and what followed was my first lapdance. I was all friendly and horny. Damn what a great time after the embarrassment had worn off. I stayed another hour to make sure I was good enough to drive. I started feeling the comedown effect of G, which is a friendly stimulation. I felt much better about my life situation, and had feelings of acceptance of it.</p><p>I could have drank to the point where I couldn't be woken up, and I hate to think what would have happened. This wasn't the only time I nodded out from G. I've done it at a club once with friends. I just passed out in a chair but was awakened easily. Also I've drank a lot of it at once and gotten memory loss. Such as suddenly waking up naked with the TV on loud, not remembering how I got that way.</p><p>Its real fun stuff though if used carefully. I remember when I did it by myself before bed, I could watch any movie, even stupid ones, and be entertained. It sure cures boredom.</p>",
 "year": "2004",
 "id": "49127",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "5674"
}
