{
 "title": "Bizarre Emotionless State",
 "author": "As",
 "citation": " As. \"Bizarre Emotionless State: experience with Eszopiclone (Lunesta) (ID 49126)\". Erowid.org. May 26, 2006. erowid.org/exp/49126",
 "substance": "Eszopiclone (Lunesta)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "2.0 mg",
   "oral",
   "Pharms - Eszopiclone",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Lunesta kills my emotion, except for (to a small extent) happiness and laughter. I found it to be a rather disturbing experience.</p><p>The first time I took it I was awake like usual, hoping for a decent nights sleep before the finals I thought I had the next day. The onset was not terribly noticable, I noticed that I could breath somewhat easier through my chronically clogged sinuses. It was not for a good hour and a half that I noticed that I wasnt feeling emotion. I suffer from auditory hallucinations, and the medicine I was taking at the time was being totally ineffective. The usual things that evoked emotional responses were not doing so. The auditory hallucinations increased in the dramaticness of the content, until I knew, were I not on some twisted drug, I would be seriously upset. Then I started to freak out.</p><p>Calling it freaking out is not quite the right thing to say. It was more of a state where I knew, were I sober, that I would be freaking out. Each new emotion I felt as a slight surge, then it would disappear, almost as if something was eating the emotion. I found this to be extremely disturbing. I stood in front of my sink debating whether to flush the stuff. I did not, but I really should.</p><p>The fun part came 11 hours later. I have no idea why this happened. 11 hours later I started laughing uncontrollably. Everything was funny. I started walking to school, several hours off (turns out no one was there anyway), noting that I felt as though I was on a hallucinogen, but that I only had the most imperceptable of visual hallucinations. In fact, I only really noticed them while standing in a bathroom looking at a mirror. The angles of the doorway and the proportions of my face seemed slightly off.</p><p>It was extremely fun, and eventually led to me taking the drug a second time, hoping for the same effects. It was a sort of mental battle; I abhored the emotionless state, but when I started 'tripping' my thoughts started to connect (I started to try to think of a backdoor for the attendence machine that would be usuable by a person with severe dislexia for some reason) and jokes flew through my mind - while I was the happiest I'd been in some time. The second time I took the drug this effect barely happened.</p><p>The third time I waited around a week before taking it. I hoped that it was some sort of tolerance. It gave me a night of slight colors and vivid dreams.</p><p>I still have the bottle of lunesta, and despite passionately hateing the crap I'll probibly take it again. Gah.</p>",
 "year": "2005",
 "id": "49126",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-26T07:00:00.000Z",
 "views": "21172",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Eszopiclone",
   "form": "(pill / tablet)"
  }
 ]
}
