{
 "id": 4913,
 "title": "Omen and Synchronity",
 "date": {
  "submission": "2007-04-23T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "3c",
  "gender": "Male",
  "weight": 58
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.8",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "Set: I'd been wanting to try LSD for some time, had no big troubles with life, and was just looking forward to spending some quality time with two of my best friends.",
  "Setting: My friend's house, no parents for a couple of weeks, only chance of intruders would be my friends brother, who is a very nice guy and who we didn't expect to frighten us in any way, not even by looking really really angry. We mainly used the livingroom for our adventure, but one sometimes feels the need to piss, thus ending up walking through the hall, into the toilet, and back through the hall. We didn't confine ourselves to one space.",
  "Time: About 21:00 or something.",
  "*My participating friends will as from now be known as O, who supplied the house, and E, who is a mad painter.",
  "The trip:",
  "We started by listening to Count Basie and Duke Ellington, and divided the trips. We had 2,5 papertrip, so we cut them apart in 3 pieces so that each of us had approximately 0,8 trip. We then put them away somewhere in our mouth, only to find them back a couple of hours later in the trip.",
  "I don't know exactly how long the onset took, probably about an hour, which we spent watching this thing on Animal Planet about futuristic animals, that had been videotaped by my girlfriend, especially for occasions like this.",
  "When the trip started, I felt about the same way as I feel when the mushrooms kick in: anxious, high, and experiencing that typical hallucinogen-weirdness that you only notice when it's gone, slowly creaping up your mind, indicating that you are then officially tripping.",
  "After a change of music (we felt like we needed music that was as weird as possible, and Yonderboi wouldn't do) we decided to build a jungle in the livingroom out of the many plants that were at that time positioned on a square table by the wall. So we arranged them as they looked their best, and then went out into the house, looking for stuff to put into our little paradise.",
  "O's mother makes all this stuff herself, like dolls and all, and in her glass closet we found a large jungle-house, a circle of witches dancing around a candle, and a mushroom-man on a piece of wood. We also gathered a large rock, some wooden lizards, 3 wooden elephants, 2 wooden men ploughing the land with the help of a wooden ox, and some weird wooden art-object that looked really cool. We set these up in the jungle and started playing with it. I will spare you the whole story.",
  "Throughout the trip some weird stuff happened, as is to be expected when tripping. I have on same age developed a feeling that I am better, smarter, more advanced than others of my age. I acknowledge this feeling, and I hate it and it want it to go away. Somewhere in the trip we each took a cup out of the kitchen to drink from. I took the one that said 'Wim', which was the name of O's father. I told them I was the boss in this house because I had that cup.",
  "Later, there was a large pillow lying on the bank, on which I decided to sit. It looked sort of like a throne, and this is what I imagined while sitting there, feeling like since I was very good at thinking and very smart, and I'd read a lot of stuff about drugs etc, and I would sort of 'lead' this trip. All of a sudden, O and E started joking about how I tried to be the leader and tried to be the best because of the thing with the cup and now I was sitting in a throne, like I was better than they were. I didn't like this, so I sat down on the ground really quickly because I didn't want to be like that. Afterwards we talked about this and they didn't mean anything they'd said, they had just been joking, but for me it was some real evidence that change was needed, like the LSD pressed me with my nose onto the facts.",
  "Another thing that happened was when we were listening to Wim Mertens. E and I had on more than one occassion talked about this song by Wim Mertens, called 'Wound to Wound'. I really loved it and so did he, but a friend of his used to freak out on that song while tripping, because the music goes on and on in what may seem like neverending spirals. Now I had just put on the Wim Mertens CD, not even thinking about 'Wound to Wound' being on it as the final song. Suddenly the song began, and E asked me 'Wound to Wound?' and I answered 'Yeah...what a coincidence'.",
  "So there we were, in an LSD-trip as we had often imagined, listening to this bizar song that his friend would freak out on. It was really amazing, I saw the most beautiful forms and figures with closed eyes and was intensly enjoying the music. E told us he had flown through his school and he could see every corner of it, into the smallest detail. O had been watching the circle of witches dancing around the flame all the while. And when the last notes of the song had ended, he saw how, with a last flicker, the flame died out, like it was ment to be that way.",
  "After that we thought we might listen to Godspeed, although I was in doubt about the effect it would have on our trip (the music being not very optimistic). Here I saw how easy someone can talk himself into a bad trip. I went to the toilet, I felt some beginning naseau, I added the Godspeed to it, mixed in some negative thoughts, and my bad trip was on it's way. Although I don't believe a bad trip to be a bad thing, I didn't want it then, so I started thinking of positive things. This really helped me, and I discovered that one can talk himself almost as easily in as he can talk himself out of a bad trip, at least while tripping on LSD.",
  "Afterthoughts:",
  "We did MDMA the next day, and in the week that followed these two drugs, the coincidences have been extremely frequent. It is a fun thing to notice those coincidences in your life, and the way they seem to increase with every trip you experience, like the trip opened up your Doors of Perception, but they have never fully closed again.",
  "In the long run I first didn't feel like I had truly learned something during that trip. But now I see that maybe this trip hasn't literally learned me something, but has learned me something inside my head, something I have not consciously experienced yet.",
  "LSD seemed to me more ordered, more clear and steady, less shaky than mushrooms. With mushrooms it was often chaotic, but LSD seemed straight to the point. This first time LSD-trip was really great, and more will surely follow. I hope we will build more jungles with more friends, and I hope everybody will build jungles with their friends, tripping on LSD (or anything you desire), listening to Wim Mertens' 'Wound to Wound'."
 ],
 "erowid": {
  "id": "30611",
  "citation": " 3c. \"Omen and Synchronity: experience with LSD (ID 30611)\". Erowid.org. Apr 23, 2007. erowid.org/exp/30611",
  "substance": "LSD",
  "views": "2911"
 }
}
