{
 "title": "Coca Tea Positive",
 "author": "Anonymous",
 "citation": " Anonymous. \"Coca Tea Positive: experience with Commercial Coca Tea (ID 4913)\". Erowid.org. Jan 29, 2001. erowid.org/exp/4913",
 "substance": "Commercial Coca Tea",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "oral",
   "Cocaine",
   "(tea)"
  ]
 ],
 "report": "<p>One sunday morning i had an upset stomach so i drank a cup of tea brewed from one bag of 'Windsor' brand coca leaf tea. The next morning, I took a pre-employment drug test (stupid of me but i didn't think herb tea mattered). The test was for a fairly big construction co. (Desilva-Gates in the East SF Bay Area).</p><p>I don't know the brand of the test they used, but it was a two part test; they wanted about 80 or 100 ml in a shot glass to send off and first used a drop or so on a paper-in-a-plastic frame that showed about 5 drug classes.  It tested positive for coke 24 hours after drinking the tea made from a 1/2 gr. tea bag.</p><p>The last time i had tried the drug had been two years earlier, and the time before that was 17 more years back.  'till this i thought herb tea was just herb tea; medicine. </p><p>I was told in Bolivia, where they ought to know, that it takes two or three k's to make a dose.  if i'd have chewed a wad with lithia the test gear would have probably melted down. [erowid note: coca leaves are reportedly between .1 and .8 percent cocaine, which would yield 1-8 grams of powder cocaine per kilogram of leaf.]</p><p>I took another job immediately, so it's ok.  i can only hope that desilva found someone to do their layout who makes the usual dumb and costly mistakes.  Companies that test for stupidity instead of stomach ache medicine will be the profitable ones and eventually take their place.</p><p>a couple of other asides about coca as medicine:</p><p>-the us embassy in la paz bolivia recommends coca tea to new arrivals having  headaches and or stomach problems.</p><p>-chewing leaf with something like lime or burnt banana or baking soda will help alleviate altitude sickness.  i can swear that if you chew at 20,000' above sea level you will feel like you are at only 17,000' and while at 22,800' you will feel as 'good' as you do 'down' at 20,000'.  in me this comes with no mental effects or 'high' at all.</p><p>-theories abound.  some say it increases the efficiency of the kidneys, some say it does some good to the hemoglobin; whether helping with uptake or dolling out oxygen i don't know.  some say it just kills pain but the body is actually functioning better, not just numb.  cops, christians and other idiots would probably believe that it 'speeds' one.  since it would take a month of methodical mastication to consume what goes into one drug-for-the-effect dose that lasts for 45 minutes; i really doubt it.</p><p>-drug sniffing dogs do not recognize coca leaf as coke.</p><p>-the couple of times that i did the drug it felt like 3 or 4 cups of coffee and not fun.  i may be wrong but i am convinced that the aphrodisiac qualities ascribed to the drug are at least partly derived from the thrill of burning up that much money for nothing.</p>",
 "year": "2000",
 "id": "4913",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-01-29T08:00:00.000Z",
 "views": "55520"
}
