{
 "title": "Experimenting with Doses",
 "author": "Happy Catipilar",
 "citation": " Happy Catipilar. \"Experimenting with Doses: experience with 2C-E (ID 49148)\". Erowid.org. Jun 21, 2007. erowid.org/exp/49148",
 "substance": "2C-E",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "2C-E",
   "(capsule)",
   "",
   " ",
   "insufflated",
   "2C-E",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I found myself unemployed with free time between school schedules, so I thought I'd put it to good use.\r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active as such a small dose, eyeballing is particularly unwise. See related article]</p><p>From known weights, usually 250 mg or 100 mg, I have eyeballed divisions to guess at my pill weights.  So there is probably a +/-5% involved.</p><p>This report is specifically for a series of trials with 2C-E.</p><p>12.5 mg ingested orally proves very visual, but physiologically overwhelming, vomiting is probably a given.</p><p>8.66 mg orally relieves the physical, although the emotionally unstable my still have a bit of difficulty integrating (and will still pop.)  This is my dose in snuff, a bit harder than the 12.5 mg oral dose, but 2c-e has an effect within 15 minutes by this route, otherwise it can take an hour to two hours.</p><p>2ct-2 trials, 31.25 mg oral. </p><p>The trip was amazing, the visuals were almost constant... distinctly distortions of what I was seeing though, nothing manifested as with a pot/acid combo.  I make mention of this chem though, for it has greater potential as a synergist.  2c-e, usually at 10 mg with 20-25mg 2ct-2 creates oceans out of carpet, rainbows from white walls, etc.</p><p>Trips are usually visual for 5 hours after onset; for 2C-E and 2c-I. The visuals are pretty hard to ignore the first 3 of those (I refer to it as the self-guided phase).</p><p>2C-E becomes unbearable past 2x a dose.</p>",
 "year": "2005",
 "id": "49148",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-21T07:00:00.000Z",
 "views": "4318"
}
