{
 "title": "Mixing with Meds",
 "author": "Lynn Z.",
 "citation": " Lynn Z.. \"Mixing with Meds: experience with Cocaine, Paroxetine (Paxil), Zolpidem (Ambien) & Clonazepam (Klonopin) (ID 49187)\". Erowid.org. Jun 7, 2007. erowid.org/exp/49187",
 "substance": "Cocaine, Paroxetine (Paxil), Zolpidem (Ambien) & Clonazepam (Klonopin)",
 "bodyweight": "96 lb",
 "report": "<p>I've had an on again off again habit for a few years. I started at 17 and Im now 24. Although I have experience with cocaine, I was confused on what to do now that I take so many prescription medications. I tried researching the specific combination of cocaine with the medications listed, however, I did not find much information. I usually don't do more than 3 bags in one day, so if you use more, I can't say for certain the results will be similar, or safe.</p><p>Cocaine/Paxil 20 mg: Alone, this combination I find to be safe. Neither seem to effect each other.</p><p>Cocaine/Ambien 12.5 mg: Alone, I didn't find the ambien to help much with the crash, or help me sleep. Neither had an effect on each other.</p><p>Cocaine/Paxil/Ambien: Together, the sedative effect in the paxil and ambien combined seemed to help calm me a little, but not much.</p><p>Cocaine/Klonopin .5 mg: Alone, Klonopin really helped if I took 2 pills equaling 1mg. Klonopin works within 30-45 minutes. Therefore, I found If I took them right after my last lines, they kicked in quick enough to drastically reduce my crash time, and allow me to get to sleep a lot faster. I recommend them. Xanax can be used as a substitute. They have similar effects.</p><p>Cocaine/Klonopin/Paxil/Ambien: I tried this even though I was scared it would be too much. I'm still here to tell you about it, and I weigh very little. If I can take it, I'm pretty sure its ok. I was very wired after a long night, and the coke had lost it's effect, meaning I felt like I was crashing for a while. I did my last lines, popped the klonopin, and waited 30 minutes. I still felt jittery and anxious, so I took the paxil and ambien at that time, hoping it would help. I crashed for about an hour all together before I could even sit down. An hour after my last lines, I felt relieved to finally feel calm. However, I still couldn't fall asleep right away. In my opinion, I'm pretty sure the Klonopin alone would not have been enough to calm that night. I feel the extra help from the paxil and ambien to be beneficial.</p><p>I now cure my crash with the whole mixture since it never hurt. Keep in mind that I never do more than three $20 dollar bags in a day, and I never pop more than a recommended dose of the prescription medications. I can say from experience with friends who overdosed, taking too much coke, with too many downers of any kind at once is deadly. I don't care how desperate you are to avoid your crash, DO NOT do either in large amounts! Be patient, and you'll feel better soon.</p>",
 "year": "2005",
 "id": "49187",
 "gender": "Not Specified",
 "timestamp": "2007-06-07T07:00:00.000Z",
 "views": "41376",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": "",
   "amount": "12.5 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": "",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  }
 }
}
