{
 "id": 4922,
 "title": "No Feelings, No Emotions...",
 "date": {
  "submission": "2004-02-05T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Krull",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine"
  }
 ],
 "report": [
  "I had been feeling down for quite some time now, and I had noticed that there were times that I would feel overly excited/happy, followed by periods of deep sadness. So, after extensive research on the Internet, I decided to make an appointment with a psychologist a few months ago. I went to the psychologist and after the first session she diagnosed me with bi-polar disorder, OCD and dysthymia. Honestly, I wasn't surprised, figuring that this would be and easy way for her to make money off of my insurance company. She suggested that I start taking an anti-depressant and a mood stabilizer so she suggested I go see a Psychiatrist (of course) to evaluate me. I decided to go to my regular doctor, since he has known me for years. Well, I was shocked when I went to see him and he prescribed me Paxil.",
  "I started taking paroxetine on a Tuesday, and started feeling the effects immediately. I lost my appetite. I started to lose sleep. I felt overly irritable, hypomanic, light-headed. A week after I started taking this mind-altering drug, I decided to smoke some cannabis. I smoked a bowl and the effects hit me like a train moving at top speed... apparently, paroxetine intensifie the affects of THC. Also, I tried alcohol in conjunction with paroxetine and it made me extrememly tired, but the feeling was a lot better then drinking without the drug.",
  "A month has gone by now... I just got my prescription re-filled last night. All of the initial side affects started to dissipate. My body has adjusted itself to this drug, and I figured out how this drug may work. This drug prevents me from having any emotions or feelings. It also makes me lethargic and un-motivated. The past few weeks I've noticed myself not feeling the way I used to when it came to certain things. My desire and libido are virtually non-existent. I have no motivation to do anything, not even workout (in my pre-paroxetine days, I would go to the gym consistently). All I want to do is sleep. I've been drinking more and smoking more cannabis then usual, and find this combination very interesting... I've lost weight, and been having vivid, unusual dreams... my life has become meaningless, as if my soul and heart have been ripped from me and all I have is my mind in this deserted body.",
  "I want to go off this drug. I want to get back to normal, but I fear that I may never be normal again..."
 ],
 "erowid": {
  "id": "30654",
  "citation": " Krull. \"No Feelings, No Emotions...: experience with Pharms - Paroxetine (ID 30654)\". Erowid.org. Feb 5, 2004. erowid.org/exp/30654",
  "substance": "Pharms - Paroxetine",
  "views": "21240"
 }
}
