{
 "id": 4923,
 "title": "An Amazing Experience",
 "date": {
  "submission": "2008-01-29T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Joey",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  },
  {
   "time": " T+ 6:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": ""
  }
 ],
 "report": [
  "<p>Alright, so 2 weeks a go my friend, C comes back from a short vacation to Switzerland, he calls me up and tells me he brought back a few souveneirs, I head over to his house, thinking he got some nice, famous swizz weed. I get there and he shows me these two little gelcaps, and I'm like 'what the hell is this?' He responds, 'It's 2Ci.' I stare at him, wondering what the hell 2Ci was. He says 'its that shit that Alex used to do.' (Alex is his Junky brother) I remember his brother talkin about it now, and say 'Oh snap that sounds awesome!'",
  "I decided not to do it that night , as I knew little about this drug. I go home, research it, and decide that I would do it. We decided to do the next weekend.",
  "So I come over C's house, he tells me everything is set up, his parents wouldnt be home 'til 2:00 A.M., and it was 8:00. There is also another friend there, J who decided it would be fun enough just watching us do it, and decided not to try it. So C and I both take 15 mgs of the stuff, and wait for it to kick in. About 45 mins later, I can feel it kinda kickiing in. I feel a slight tingly feeling, and my mind comences to philosophize (is that a word) and anylize the weirdest shit. I ask my friend, 'you feeling anything?' he replies 'I think so.' We than move from C's bedroom to the TV room, and this is where the fun starts.",
  "We decide to watch the Simpsons. about 30 minutes later I see my first visual, as I can see the tv kind of swaying, and moving torwards me. I look over to C, he seems to staring at the floor. I look to J, and he just begins to laugh, saying we looked like zombies. About an hour later, (about 2 hours and 15 minuts into the trip) I begin to feel really happy and greatful that I had such great friends. The trip is also becoming amazingly psychodelic,(sp?) and I begin to start seeing things warp in and out. Also, I kinda forget about my surrroundings and just stare off out the window. I'm not exactly sure how long I did this for, but later according to J, he tried to talk to me, but I didn't even notice.",
  "I come back to the world, and am startled to see that no one is in the room with me. I walk around looking in closets for my missing friends. I began to get worried, and my heart started beating hella fast. I walk out of the room and continue my search. After about 15 minutes of searching, I find J eating a freshly ordered pizza and C laying on the ground, staring at the ceiling. I feel totally relieved about finding my friends, and begin to start enjoying my trip.",
  "As the hours pass by, I feel really happy about everything, and I am in total Bliss. Its been about 5 hours and I can feel the shit wearing offm I still am seeing things, but I no longer am feeling these crazy feelings. I look over to C, and he seems to be falling out of it too. About an hour later, I am no longer seeing anything, and I decided that it would be best that I try to get some sleep. All three of us popp 2 ambiens, and tried to get some shut-eye. I dozed off, and had great dreams. When I woke up, I felt so great about the trip the night before, but also fealt glad to be in my normal state.</p>"
 ],
 "erowid": {
  "id": "30660",
  "citation": " Joey. \"An Amazing Experience: experience with 2C-I (ID 30660)\". Erowid.org. Jan 29, 2008. erowid.org/exp/30660",
  "substance": "2C-I",
  "views": "2627"
 }
}
