{
 "title": "Potent Painkiller",
 "author": "Limpet Chicken",
 "citation": " Limpet Chicken. \"Potent Painkiller: experience with 2-Aminoindan (ID 49250)\". Erowid.org. Jan 1, 2006. erowid.org/exp/49250",
 "substance": "2-Aminoindan",
 "bodyweight": "90 kg",
 "report": "<p>I recieved my order of 1 gram of 2-aminoindan, and decided to do a quick bioassay.</p><p>Set: bedroom, with a few friends, music playing.</p><p>Mindset: in considerable pain due to unknown arm injury, unable to move arm or type without severe pain.</p><p>No medications or supplements were being taken, cigarettes were occasionally smoked, 120mg dihydrocodeine had been taken the previous night, but had worn off by the time the dose was taken.</p><p>100mg was weighed out, and split in half to give two doses of approximately 50mg, 50mg was divided into two 25mg (approximately) lines, and insufflated, one into each nostril, this was at 14.34 on 30/12/2005, the time is now 07.57 next day.</p><p>The burn produced on insufflation was intense, worse than snorting methamphetamine, Virola resin or vilca/yopo snuff, I wouln't reccomend insufflation of this compound, it literally brought tears to me eyes, streaming down my face as I gripped onto my arm-chair handles.</p><p>The pain in my arm appeared for no apparent reason after waking up two days ago, movement was severely restricted, and quite sever pain, after about 10-20 minutes post-insufflation of the dose of 2-AI,  the pain had significantly decreased.</p><p>A few friends, including my girlfriend came over, we all chilled out, they were aware of the substance I was on, but were all sober, the pain had noticeably decreased by quite enough to be able to move my arm, although still quite sensitive.</p><p>Around 4-5 hours later, my friends left, leaving my and my girlfriend alone, although I was by now, again in severe pain, and feeling, paradoxically enough, very tired, but yet unable to sleep, my girlfriend then left, at around 7-8 pm, as she decided it was best I rest alone for a while.</p><p>I immediately laid down, smoked a cigarette, and attempted to go to sleep, at first, I took 2.5mg nitrazepam to help sleep, and fell into a very shallow doze, with many thoughts rapidly running through my head, I took 25mg promethazine to help actual sleep, which did nothing, but quieted the mental stream of thoughts, to my dissapointment, this lead to taking a further 50mg nitrazepam, and laying down trying to sleep.</p><p>Sleep just would not happen, 50mg of nitrazepam should by all rights, combined with the promethazine, knocked me out cold, but I am still wide awake, alert, and feel no ill effects from the substance, the pain in my arm, has now almost gone, the time now is 8.08 AM, and although not wired or jittery, I am wide awake, and very alert, sedatives or no sedatives, the 2-AI totally overpowered them.</p><p>Pulse rate is fairly rapid, breathing is regular, no jitteriness, tweaked out feelings, just relief from pain, and total alertness and a feeling of well-being, not so much euphoria, but the general feeling all isn't too bad.</p><p>I just took a further 100mg or so, in two lines, to keep away any unpleasant feelings that typically come from all-night periods of wakefulness, and as yet, have felt no ill effects.</p><p>I had read from another subject who has taken 2-aminoindan, that pain relief is roughly equipotent with morphine, although second-hand advice, I would not personally disregard it, as the subject sharing the information has quite considerable knowledge of pharmacology.</p><p>Apparently, 2-AI is synergistic with the antinocioceptive abilities of typical mu-opioid agonist painkillers, although I have yet to try the two in combination, I will, and hopefully, this will help me reduce the dosage of the painkillers I must take for a chronic knee condition.</p>",
 "year": "2005",
 "id": "49250",
 "gender": "Male",
 "timestamp": "2006-01-01T08:00:00.000Z",
 "views": "22999",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "2-Aminoindan",
   "form": "(powder / crystals)"
  }
 }
}
