{
 "title": "Anything in Excess is a Bad Thing",
 "author": "Anchia",
 "citation": " Anchia. \"Anything in Excess is a Bad Thing: experience with Caffeine & Sleep Deprivation (ID 49264)\". Erowid.org. May 4, 2011. erowid.org/exp/49264",
 "substance": "Caffeine & Sleep Deprivation",
 "bodyweight": "142 lb",
 "header": [
  [
   "DOSE:",
   "4 cups",
   "oral",
   "Coffee",
   "(liquid)",
   "",
   "20 oz",
   "oral",
   "Caffeine",
   "(liquid)",
   "",
   "4 ",
   "oral",
   "Chocolate",
   "(cookie / food)"
  ]
 ],
 "report": "<p>Well, it just so happens that this particular experience is still ongoing.  Currently, I am eating vegetables, bread, and drinking lots of water.  6 hours ago was a very different story.</p><p>I had decided to stay up and watch tv and surf the net.  Its winter break, I have some papers to do, but I haven't done them.  Well, I drank one cup of coffee and I finished off the soda that I had from subway.  I think that if I hadn't had that sandwich...I would have been in much worse shape than I am now.  Anyways, I went to go get another cup of coffee, some chips and salsa, and 4 pecan delights.  I hustled those down and I didn't really feel anything.  I had another cup of coffee when my dad got up at 4.  It was crazy.  Then I had another cup of coffee at 6am with my mom.  Though I use sweet n low, it still doesn't calm down the caffeine that's in regular coffee.</p><p>So here I am, no sleep, junk food, coffee and soda.  At 8 or 9, I started to get the shakes.  I was shaking so much...my teeth were chattering.  I almost felt as though I had to be cold because my teeth wouldn't stop chattering.  I felt that I should take a bath...so I did, but it didn't help.  I started freaking out thinking that I was going to die.  So I got out of the bath and I was instructed by one of my friends to lie down and have lots of water.</p><p>Well this resulted in frequent visits to the bathroom.  I had a terrible ache in my stomach and I tried to lay down...but I felt like I couldn't go to sleep otherwise, I wouldn't wake up.  I was so alert of everything, even touching my arm was scary.  I was so alert that I was paranoid.  I started semi dozing off, but then I would snap out of it...it was almost like I was in a dream state and I knew I was, but I felt like if I snapped myself out of it, I wouldn't fall asleep and die.</p><p>I couldn't sit still so I would walk around the house...but, climbing the stairs was a chore and breathing even seemed to be a little more intensified.  I would like to say that this is the first time that this has happened, but it's not.  I just realized this sensativity to caffeine this past June.  I thought it was stupid to blame it on the caffeine...but sure enough...each time I have it.  I get achey and I go into panic/anxiety attacks.</p><p>This is it.  I am done.  I never want to experience this again, and the funny thing is that I used to drink caffeine all the time when I was younger...in my teens and such....and it never affected me.  Maybe I never paid attention.  But my body can't handle it anymore.</p>",
 "year": "2005",
 "id": "49264",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2011-05-04T07:00:00.000Z",
 "views": "7756",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "4 cups",
   "administration": "oral",
   "substance": "Coffee",
   "form": "(liquid)"
  }
 ]
}
