{
 "title": "Holy Fuck Again It's 1975",
 "author": "Strawalker",
 "citation": " Strawalker. \"Holy Fuck Again It's 1975: experience with Salvia divinorum (10x extract) (ID 49260)\". Erowid.org. Nov 9, 2007. erowid.org/exp/49260",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "260 lb",
 "report": "<p>I had recently had a Salvia experience [Experience #46718] that left me entirely shocked and in a state of total wonderment I was finally willing to try it again but with much trepidation. My experience has repeated itself in a significant way. </p><p>The setting was my home living room. Very uncluttered and comfortable. I had asked a friend to watch over me because the last time I tripped I did a lot of walking around and mumbling incoherently all of which disturbed my wife to no end and that I have no recollection of doing. I had drunk a half bottle of wine about four hours earlier and had one beer. I had also smoked about four bong hits of good grass and was on penicillin (apo vk) to fight off an ear infection.</p><p>I spent a good amount of time telling my self not to be afraid and to just go with the experience and made a mental plea with the Salvia to be gentle with me. I inhaled very deeply one fingernail sized hit of 10X Salvia and held the not unpleasant smoke deep in my lungs. I passed the bong to my friend and closed my eyes letting out the smoke at the same time.</p><p>What I was immediately looking at was instantly recognizable to me from the last time I took Salvia yet I was in as much a total state of shock and disbelief as in the first trip. What I saw with my eyes closed was my parents home on a sunny summer day but this time a date stuck in my mind and I knew that it was 1975. That would have made me seven years old. Now when I say I was looking at my parents home and it was 1975 I was also experiencing a duality of consciousness that I had experienced before in my earlier Salvia trip yet I had forgotten it. I opened my eyes and on the left side of my body and also slightly above me was 2005 with my living room and my friend sitting on my couch watching me and smiling. On my right side was the 1975 street scene and in the middle was little Rubiks Cubes with a mix of the two realities and as I drew my attention away from my living room and towards my parents house I became who I was in 1975 as if I was going to leave this reality altogether and as a seven year old everything seems brighter and sharper its not better vision its vision with out pre-judgment and as the seven year old consciousness took over I would look up and to my left and see my friend and my living room disappearing into the Rubiks Cubes but as an amazed seven year old with a ghost of a memory of who I was up their and I could feel my old life slipping away but this time I fought it.</p><p>I stood up and said you're starting to fade I can't believe this, then I sat down again and I forced my consciousness away from 1975 and back toward this reality by applying all my concentration on the left side. 1975 just disappeared when I looked back and I then spent the next ten minutes freaking out trying to explain what I had seen to my friend. The whole trip lasted about 15min.</p><p>Now in the last trip I had forgotten the transition between realities the whole Rubiks Cube breakup of my living room but when it started again I remembered the feeling of being seven and looking up and thinking is this me or is that me and watching the three dimensional pieces of this reality seamlessly blending into 1975 reality through these magical Rubiks Cubes and wondering which reality is correct.</p>",
 "year": "2005",
 "id": "49260",
 "gender": "Male",
 "timestamp": "2007-11-09T08:00:00.000Z",
 "views": "2827",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": " ",
   "substance": "smoked"
  },
  "2": {
   "time": "Cannabis",
   "amount": "",
   "administration": "",
   "substance": "1 hit"
  }
 }
}
