{
 "id": 4928,
 "title": "Terror and Beauty",
 "date": {
  "submission": "2004-03-08T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Treefingers",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Kid A and I decided to finish off our vial. Initially I was hesitant. That vial was supposed to last the whole summer, and was already half gone. But he gave an extremely convincing argument. Let's just do it all now, and go completely insane, it'll be so cool! I had to agree with him. It was going to be the greatest trip ever.",
  "So late that night, I took roughly 30-40 hits as did Kid A. I have yet to meet someone in person who has done this much!",
  "My visuals were simply amazing. Nothing has come even close to them. I was flipping through my Dali book, when suddenly, Dali's artwork seemed to take over my visuals. I ran to the bathroom, and in the mirror, my reflection was still my face, but it was my face painted just like Dali's own self-portrait in the book. Incredible. The whole world seemed to enter Dali's surrealistic fantasy. I was lost within the visuals and seemed to be consumed by them. I began conjuring up different images, and they seemed to flow from my mind in intricate, detailed patterns.",
  "Suddenly there was a noise. Kid A told me to shut up. I thought it was from within my house and turned off the lights, in case my parents were up. He told me to stop moving around...the sound was coming from outside. I didn't believe him, but within a few minutes I heard what he was talking about. It was coming from outside.",
  "Terror struck deep within me. What other-worldly entity could be stalking my friend and I? Had we accidentally opened a portal with our insanely huge dose of LSD? My initial response to this terror was to turn back on the lights. I needed to be able to see what was going on outside. WHAT WAS THERE?!",
  "As I got up to turn on the lights Kid A screamed, 'NO! That is a BAD idea!'. And suddenly I saw the incredible error that I was about to make and the horror that would be brought upon us. I inherently knew that if I were to turn on the lights the whole world surrounding me would dissolve into a primordial ooze. It would be lost and all that would remain would be a clear light with my soul being lost within its power forever. I knew that all would be lost, and I would be alone. I felt that LSD had created a cosmic hole in my head, and the entire universe would be sucked into it leaving me completely alone.",
  "Kid A and I lay in our separate beds, scarcely breathing. Both of our hearts racing, Kid A countlessly uttered, 'I'm tripping so hard, oh my god, this is really scary'. I too was feeling the intense effects surrounding me. My mind was awash in visuals. I was struggling to discern what was real around me, and was extremely grateful for having Kid A there. He helped ground me, and allowed me comfort in that I wouldn't be lost in this psychic journey.",
  "Slowly the terrifying presence seemed to take less of a hold on us, and actually became a little humorous. We decided to blast some Jimi Hendrix out my window. His righteous wailings on the guitar would surely scare the evil force that was residing on my front lawn. And it did. The intensity subsided quite a bit after this. But I don't exactly know when Kid A and I stopped tripping. We definitely had residual effects for the rest of the summer. Thinking back on it, I believe that I had tripped my way into an oblivious transcendent state. I felt enlightened, and appreciative of my life and my surroundings. What ensued after our crazy summer was perhaps the most productive and happy times of my life. I truly felt that life was beautiful, and every moment was to be treasured.  I was truly aware and happy.",
  "A note on this trip. At no time was this trip actually scary. I mean it was, but it was also incredible. It was extremely enjoyable. I loved each second of insane terror that was induced. It was almost too much to comprehend. I never thought that I could feel anything to this extent, and being able to almost brought tears to my eyes. It was a trip that reminded me that life is beautiful. Beauty is within everything. Don't believe me, just look at a tree for a minute. You'll find it and wonder how you could ever miss it.",
  "oh yeah, and the noise, it was a raccoon."
 ],
 "erowid": {
  "id": "30683",
  "citation": " Treefingers. \"Terror and Beauty: experience with LSD (ID 30683)\". Erowid.org. Mar 8, 2004. erowid.org/exp/30683",
  "substance": "LSD",
  "views": "6906"
 }
}
