{
 "title": "A Waste of Money",
 "author": "anonymous",
 "citation": " anonymous. \"A Waste of Money: experience with Cacti - T. cuzcoensis (ID 49353)\". Erowid.org. May 11, 2006. erowid.org/exp/49353",
 "substance": "Cacti - T. cuzcoensis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Cacti",
   "(liquid)"
  ]
 ],
 "report": "<p>I researched san pedro online, and I finally came to one of the many websites that sell it. I decided to get T Cuzcoensis.</p><p>So when I received it, I boiled it the traditional way. I added lemon coolaid to provide the citric acid to help extract the alkaloids. The stuff didn't taste nearly as bad as everyone describes it to be. It was viscious . Like well, the only way to describe it is 'cactus juice'. Slight bitter taste, but the lemonaid covered it up well. I boiled all of it for 3 hours. I greens after I strained it, and downed the thick liquid. I did not feel much/if anything at all. I did feel kind of happy, lights seemed to be a bit brighter, and things seemed a slight bit more 3-D. This could have been in my head though. I did not get sick, except for a slight bit of diarrhea in the beginning.</p><p>So, the next day I decided to boil the leftover greens again, thinking that maybe the mescaline could still be in there. This time, I used a blender, and tried to down as much of the mulch as I could. When I was finished, there was just scraps of the pulp of the cactus left that wouldn't get any smaller in the blender. Kind of reminded me of wood chips. Again, no feeling.</p><p>So, sad to say I got ripped off 60 bucks. After doing research, I found that T. Cuzcoensis contained very little mescaline, and the real winners are peruvian, and san pedro. I followed a recipe, and even went as far as just ingesting the plant material.</p>",
 "year": "2005",
 "id": "49353",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-11T07:00:00.000Z",
 "views": "6481",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Cacti",
   "form": "(liquid)"
  }
 ]
}
