{
 "title": "The Two Week Hangover",
 "author": "AM",
 "citation": " AM. \"The Two Week Hangover: experience with Nutmeg (ID 49394)\". Erowid.org. Mar 13, 2008. erowid.org/exp/49394",
 "substance": "Nutmeg",
 "bodyweight": "145 lb",
 "report": "<p>Note: I consumed no other psychoactive substances during or before my experiences.  I am 17 years old and have used very few psychoactive substances in my life.  I am not on any type of medication.  My standard dose was either one or two nutmegs, which I consumed only with water.  I have tried to keep my experience report as accurate as possible.</p><p>I have used nutmeg six times, each time enjoying the experience.  I first tried to experience its effects with pre-ground nutmeg (probably very old), but I could feel nothing, even after waiting hours.  I decided to consume whole nutmegs and tried them first on the 19th at around 12:00 at night.  My method of consumption was to grind the nuts completely into a powder and just pour it into my mouth, gulping it down with water before I could really taste that disgusting flavor.</p><p>My first experience, like all of the others, was quite intense and enjoyable.  I did not experience any of the intense nausea reported by some others, although I felt a little tightening of the stomach -- nothing very intense or horrible.  The only major side effect that I felt was an incredibly dry mouth.  I would drink water and my mouth would feel like cotton ten seconds later.  Other than this unpleasantness, nutmeg's effects were quite enjoyable.  I felt very dizzy often, and my sense of balance seemed to be affected in a manner similar to mild drunkenness.  My whole mind felt different, seemingly removed from everything around me.  My vision was affected by being enhanced; my vision seemed more clear and sharp.  However, my depth perception seemed to be pretty screwed up.  Objects tended to appear two dimensional but sharply defined.  My eyes would easily go out of focus when viewing any kind of patterns, especially stripes, floor tiles, or anything with sharp contrast.  Patterns seemed to move around, and in the dark, lights floated around on my eyes.</p><p>From my experiences, the feelings start about four hours later on a fairly empty stomach and the primary effects last around 12 hours.  I was able to function during this period and do tasks, but the effects were certainly strong.  After this time, nutmeg seemed to leave a mindset of being removed from my surroundings for about another day or two later.  This after effect was not exactly pleasant, although not especially bad either -- mostly just a mood of being way 'out of it'.  During this time, as some others have referred to, I experienced some paranoia, but this went away along with the mood after one or two days.</p><p>HOWEVER, after consuming a total of 13 nutmegs in a period of approximately one month (Nov. 19th to Dec. 17th), a problem began to appear.  After my last normal dosage of two nuts on Dec. 17th two and a half weeks ago, some of the effects would not go away.  In fact, they are still affecting me today, and it is not always enjoyable.  The side effects of dry mouth and slight nausea all disappeared in the normal time period (about 12 hours), but other effects stayed: the 'out of it' mood, screwed up vision and depth perception, and occasional returning feelings of 'tripping' and lack of balance, especially under the influence of caffeine, which seemed to amplify the effects.  My depth perception has been screwed up for more than two weeks, my vision wavers and does hallucinatory things when viewing patterns, and I can't shake my feelings of removal from my surroundings.  Granted, sometimes the visual effects and feelings are enjoyable and pretty cool, but they have lasted waaaaay too long.  I am ready to be rid of these effects, and they just won't go away.  Now I am back in school, trying to focus while still feeling these effects.  It's not much fun.</p>",
 "year": "2005",
 "id": "49394",
 "gender": "Male",
 "timestamp": "2008-03-13T07:00:00.000Z",
 "views": "14151",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ]
}
