{
 "title": "I Was a Junkie",
 "author": "Dr. Robert",
 "citation": " Dr. Robert. \"I Was a Junkie: experience with Kratom (ID 49447)\". Erowid.org. Mar 15, 2006. erowid.org/exp/49447",
 "substance": "Kratom",
 "bodyweight": "180 lb",
 "report": "<p>I go to AA meetings and consider myself relatively sober, but while getting into meditation one day I remembered I had some old salvia divinorum in my closet and it was great so I ordered more and figured hey, I'll try some of this here kratom I see advertised.</p><p>I heeded the warnings about addiction, but was busy in my meditative/salvia explorations (the kratom goes great with salvia but that's another post)and didn't think it could happen to me, a recovering alcoholic with 8 years sober.</p><p>Within a week I noticed that around halfway through my work day I would start to feel achy and sick, all the problems kratom took care of so beautifully would return... sore legs, bad circulation, etc. So I'd get home and make some tea and feel better, oh so much better! Gradually my afternoon work performance suffered so much I started bringing the tea to work in a snapple bottle and drinking a bunch after lunch time.</p><p>This was about 9 months ago. Since then I've been a kratom junky.</p><p>Who would have thought? Well, I guess an alcoholic tolerance, prone to addiction thing didn't help.</p><p>I've never tried to kick, as of yet, but I'm sort of gearing up for it. Maybe in the spring. Reading all the horror stories makes me consider trying to ween myself off via reduced dosage and a substitute substance like blue lotus. As it is, I can feel the withdrawal creep in like clockwork every day around noon, and every evening around 4 or 5. The stuff literally lasts 4 hours with me, period. Four hours and I'm shivering inside.</p><p>How did it happen so fast, who knows? It's not like I've noticed any side effects whatsoever, and in some ways I'm happier as I'm less achy and cranky all the time. But as a recovering alcoholic I have a weird love/hate relationship with feeling like 'the meter is always running' on my physical well being.</p><p>I'm not really saying anything new here, but I thought I'd chime in with my own cautionary tale in case someone out there needs to know they're not alone. The thing is, if  I am in pain without it, how can I just leave it there?</p><p>Oh the humanity!</p>",
 "year": "2005",
 "id": "49447",
 "timestamp": "2006-03-15T08:00:00.000Z",
 "views": "21331",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  }
 ]
}
