{
 "title": "Small Dabs II: New Year's Eve",
 "author": "Brick Plane",
 "citation": " Brick Plane. \"Small Dabs II: New Year's Eve: experience with bk-MDEA, Methylone, 2C-I & MDMA (ID 49454)\". Erowid.org. Jan 31, 2007. erowid.org/exp/49454",
 "substance": "bk-MDEA, Methylone, 2C-I & MDMA",
 "bodyweight": "65 kg",
 "report": "<p>My last report including a simlar combination can be viewed at: Report ID=46258</p><p>On New Year's eve I took ethylone, methylone, mdma and 2-ci.</p><p>Other than with my last experience, I took smaller doses and took these doses in one go, in a gelcap, with a meal. Bowel irritation was considerably less than last time. Doses were also lower. Still eyeballed though.</p><p>In case you really, really insist on estimates: about 40 mg of ethylone and methylone each, less than 50 mg of mdma, less than 20 mg of 2-ci.</p><p>Less than 1.5 hours later I already started feeling it. The first three substances came on first. Suddenly it (they) hit me. In one snap second I got real clear and light in the head and started getting pretty talkative. Being with the family was nice.</p><p>I was feeling energetic and excited so I took a bottle of coke and a bottle of water and hopped on my bike and rode into town, staring at neon signs, enjoying some very light rain and wind in my face. I picked up a couple of packs of gum at a night shop. It must have been around 23.30.</p><p>I got back home but didn't go inside. On the way, I stopped here and there to look at the fireworks. There was almost no one in the street. There were some bouts of light rain. The fireworks all came from isolated little parties and neighbourhood parties.</p><p>Orientation was getting somewhat difficult. Nevertheless, I was able to find an old narrow road through some fields and pastures, leading up to a hill top. The view was fascinating. The 2-ci was beginning to manifest itself. I just stood there, staring in the distance at all the lights, at the stars and the clouds, at the fireworks at least 6 km away. I stared up.</p><p>OEV: It was as if my vision had two layers. I could not distinguish whether movements and shape changes of clouds were real or not. I started seeing some little multicolour 'twinklings'. The starred sky behind some clouds seemed higher and bigger.</p><p>CEV: Kaleidoscopic with triangles that had black and white yin-yang halves inside, hooking into each other and spiraling. I could have completely remained into it and spaced out like that, had I wanted, but I realised that the weather wasn't that good to stay outside too long like that.</p><p>I got on my bike and rode off the hill (WHEEEE!). Looking back, I'm surprised I didn't fall. A little snow had remained on the narrow road. I had to break in short bursts (like an ABS-system in cars) and with my foot.</p><p>I went back home, it wasn't that far, 3 km or so. I must have done over 12 km that night, at a rather high speed. I had some bronchitis but luckily it didn't get worse because of my effort.</p><p>I chilled by watching some TV. There was a Mexican artsy drama from the year 2000, with parts in black and white and parts in colour. It was something with a religious/moral theme and a happy mellow end. The desert imagery was nice to look at. I also watched some other stuff. I saw part of some spectacle at the Vatican (I think it was the Vatican). It had a keyboard player (Vangelis? dunno), a choir, an orchestra, a laser show and a huge croud. It also showed pictures of John-Paul II and the lights were shaped like crosses. Pff. I felt as if the catholic church was showing off.</p><p>Then I went upstairs and turned on my computer. Reading the monitor was doable, but took some effort. First I listened to some goa and psy-trance and to wind down I put up some Tchaikovsky.</p><p>I went to bed, took 400 mg of l-tryptophan and read a magazine with art, literature, photography, articles and so on. The trip was getting more and more introspective. I stared at the ceiling and saw the higher, bigger, starred sky again, and some twinklings. I closed my eyes. I only got little sleep that night. The trip was getting more and more introspective, dissociating with my ego, forcing me to look at myself and inside myself.</p><p>My brain felt ... (fried?) as if it had been pushed too far. The day after I ate another 400 mg of l-trytphan and approx. 35 mg of effexor, an SNRI. (Currently not on anti-depressants, I still had it laying around.)  Anyway, I don't feel that bad right now.</p><p>Edit: feeling down very slightly at day+2 midday</p><p>Side effects: slight short-term memory impairment on day+0 and day+1. Otherwise fine.</p>",
 "year": "2006",
 "id": "49454",
 "gender": "Male",
 "timestamp": "2007-01-31T08:00:00.000Z",
 "views": "9945",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "bk-MDEA",
   "form": "(capsule)"
  },
  {
   "time": "",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(capsule)"
  },
  {
   "time": "",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  },
  {
   "time": "",
   "amount": "18 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  }
 ]
}
