{
 "id": 4947,
 "title": "Perfect Synergy (Ying + Yang)",
 "date": {
  "submission": "2004-04-23T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Platinum907",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "powder/crystals"
  },
  {
   "time": "3:00",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "powder/crystals"
  },
  {
   "time": "4:00",
   "amount": {
    "unit": "mg",
    "quantity": "21",
    "grams": 0.021
   },
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "capsule"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "6:30",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "powder/crystals"
  },
  {
   "time": "14:30",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "4:30 pm - I was heading out to an Indian Festival so I decided to ingest 20mg of 4-ace to heighten the experience.",
  "5:00 pm - First sensations as I am eating a plate of food. I couldn't finish it once I started tripping.",
  "5:15 pm - I'm really starting to feel trippy now. I have slight visual enhancement and I have a big cheesy smile on my face looking at all the people in Indian clothes and the music playing, It was very comical to me in that state. I decide we should go home considering I was smiling uncontrollably.",
  "5:30 pm - 7:30 pm - We arrive home and I watch tv with a mushroom-esque vibe in my head. 4-ace is a remarkable substance because it gives a full body smile and bright lucid headspace.",
  "7:30 pm -  I am coming down pretty good now, I decide to redose with 20 more mg of 4-ace.",
  "8:10 pm -  The downswing on the first dose and the upswing on the other meld so smooth I couldn't tell if I was getting higher or what.",
  "8:30 pm - Now I know I am back in that vibe that I was earlier, I decide it's early enough to take some 2c-t-2. I take a 21 mg capsule and wait. I smoke a joint to counteract nausea and to heghten up trip.",
  "10:00 pm - I am feeling the 2c-t-2 and the visuals from both substances are incredible. I notice the patterning and color change of the 2ct2 but the incredible dreamy, euphoric state my mind and body felt from the 4ace. The synergy of these substance is perfect. The 4ace keeps the side effects of the 2ct2 at bay and the 2ct2 brings a more psychedelic feel.",
  "11:00 pm - The combined positive headspace and body vibe with the visually stunning tryptamine/phen combo of 2c-like visual patterning and colors with body and facial distortions and overall brightness of the 4-ace. This is too good to be true. I decide to ingest one more dose of 4-ace and The rest of the trip was positive and trippy.",
  "7:00 am - I finally take some tylenol pm to sleep and smoke a little pot. I had trouble sleeping and the next day I felt physically and mentally drained, it could be because of the tyl pm but overall this combo is killer They synergize perfect with the ying and yang effect."
 ],
 "erowid": {
  "id": "30764",
  "citation": " Platinum907. \"Perfect Synergy (Ying + Yang): experience with 2C-T-2 & 4-Acetoxy-DIPT (ID 30764)\". Erowid.org. Apr 23, 2004. erowid.org/exp/30764",
  "substance": "2C-T-2 & 4-Acetoxy-DIPT",
  "views": "12238"
 }
}
