{
 "title": "Systemic Lupus",
 "author": "Dawn",
 "citation": " Dawn. \"Systemic Lupus: experience with Cannabis (ID 49481)\". Erowid.org. Sep 13, 2008. erowid.org/exp/49481",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "report": [
  "<p>Ive read that over 1.5 million americans suffer from some form of Lupus. There are two kinds, systemic and discoid. Discoid causes severe rashes and allergic reactions/sensitivy to a variety of things. I have the systemic version of Lupus. This causes severe pain, and through the years I have also developed many problems with major organs. There are a whole other host of symptoms, but it's mostly the pain that is important here.",
  "I have had symptoms of Lupus since I was 14 years old. I am 22 now, and experience very severe pain on a constant basis. The effects of chronic pain are life altering, to say the least. I've tried the pain medications that the medical community suggests, meditation, and other pain management programs. Nothing however, compares to the relief I feel when I smoke a cone or two of cannabis. When I smoke, I feel relief immedietly. The muscle pain, and joint pain subsides. This allows me to participate in fine movement activities that I would other wise have to give up, such as painting and writing. It also allows my mind to rest. When your in constant pain you can't think of anything else sometimes. It's so overwhelming and exhausting, mentally. The cannabis allows me to relax in the ways that most people take for granted. No one in my life knows that I use cannabis for this reason.",
  "I'm posting about this, because I feel as though there are other sufferers that could benefit from the legalization of medical marijuana. The more medical benefits that it has, perhaps the more likely it will be to legalize it nationally.</p>"
 ],
 "year": "2005",
 "id": "49481",
 "gender": "Female",
 "views": "9662",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2008-09-13T07:00:00.000Z"
}
