{
 "title": "The Sleeping Tiger of LSD",
 "author": "Felix Fishpaw",
 "citation": " Felix Fishpaw. \"The Sleeping Tiger of LSD: experience with LSD (ID 4953)\". Erowid.org. Feb 1, 2001. erowid.org/exp/4953",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "LSD"
  ]
 ],
 "footer": [
  [
   "1969",
   "4953",
   "Male",
   "",
   "Not Given",
   "Feb 1, 2001",
   "82517",
   " "
  ]
 ],
 "report": "<p>\nI took LSD at least 100 times between 1968-1972.  Generally I approached it as a scientific experiment rather than a 'party drug'. </p><p>Thirty years later, those experiences stand out as some of the most remarkable of my life, although I am convinced that the benefits are NOT cumulative.  That is, I probably derived no more benefit from doing it 100 times than if I had only done it 5 times.  Perhaps even once was enough.</p><p>I was always left with the nagging feeling that I had come very close to grasping some ultimate truth, but I was never quite satisfied that I had really gotten there.  Hence the need to go back to it over and over again.</p><p>Aside from discovering (or not) any ultimate truths, I certainly became aware of, and awed by, the incredibly intricate workings of the mind.  It was truly fascinating to watch my mind working on many levels at the same time, creating all sorts of curious realities and unusual interpretations.  </p><p>And therein lies the sleeping tiger of LSD.  New interpretations of reality come flying from every direction, and not all of them are warm and cozy.  When the world of all possibilities is unleashed it can get extremely frightening.  </p><p>So even though I would make careful preparations to ensure positive LSD experiences (and in fact they WERE positive for the most part), there were more than a few times that it became paralyzingly clear that I was not in control of anything that was happening.  In those situations one hopes to just 'go with the flow', but that can be easier said than done.</p>"
}
