{
 "id": 4954,
 "title": "Watching the Living Floor",
 "date": {
  "submission": "2007-11-12T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Drawed",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "8.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ],
 "report": [
  "I had dropped Morning Glory once before---4.5 grams---I was disappointed by the effects.  Im driving to a friends party after having a good night, so I was in a good mindset.  Right before I get to his house, I dropped two packets (Heavenly Blue) without any preparation method.  I got lost a couple of times on the way and got pretty frustrated.  I arrived 15 minutes later and immediately dropped four more packets (1.5 g each).  When I was eating the last packet, my gag reflex kicked in, and I spat out around 1g of the seeds.  This was around midnight.  I hadnt eaten since 4:30 that afternoon.",
  "15 minutes later, and Im already feeling it.  I know this is going to be big.  I run out to accompany a friend, S, whos smoking a bowl.  I dont partake.  Im sitting in her car listening to music when I look down at my hand thats resting on my thigh.  It slowly blends into my pants and disappears completely.  Im ecstatic that Im tripping and also surprised at how quick it took.  The other time I did it, on a full stomach, it took 2 hours to feel the threshold effects.  My stomach starts hurting pretty badly, and I stick my finger down my throat a couple of times, but I cant throw up.  I go sit down on a couch and listen to/ watch a Flaming Lips DVD.   As I sat there, the morning glory kicked in harder and, the pain went away.  ",
  "It was amazing.  I had a great buzz going and was having a great time.  I looked up at the ceiling and noticed some of the beams were blending into the top of the ceiling.  I looked out the window at the ground which was situating itself into geometric patterns.  My sense of touch felt amazingly sensitive.  The next thing I know, I look at the clock and it was 1:30.  It had already been more than an hour.  I realized I had absolutely no concept of time.  I got tired of the DVD, so I went out to the fire my friend had set up.  I wasnt seeing or feeling anything, so we eventually went up to his pool room.  There, I sat down, and for no reason felt depressed and apathetic to life.  I dont know how long I was sitting there, but we eventually went back to fire, where I stared down at the ground and immediately felt extremely giddy again. ",
  "At the fire, I stared at trees, whose leaves would shift left to right.  Looking at a tree, I saw faces morphing in it.  I felt like I could talk to it.   I looked up at the moon and noticed a rainbow halo surrounded it.  I blinked and immediately, I saw the trees again, but they were completely made out of tiny circles.  When I looked at the ground, I felt as if my head were resting on a wall and the ground itself was another vertical wall.  I then went to my friends garage (which is on the way to the pool) and stared at his car.  The surface of it looked like it was water.  Its body looked entirely liquid.",
  "We then went to play some more pool, and this is where I started peaking (around 4 AM).  I looked at the checkered tiles of the floor, and they would rise and fall and move around.  I saw an added dimension to them.  The flat surface looked 3d.  I played some pool, which I was surprisingly good at, and watched the balls as they would move around at their leisure after I hit them.  The pattern on the felt jumped out at me, something I had never noticed before.  There was a geometric pattern embroidered on the felt.  I checked the next day and sure enough, it was still there. ",
  "Colors became brighter, my friends blond hair became a neon green.  At one point we listened to The Whos Tommy.  When the song Holiday Camp came on, it sounded so amazing that I couldnt stop smiling and jumping around.  I feel as if that was the very height of my trip.  We then walked back to the house where doors were shifting and dancing.  We played a board game from 6 till 7 AM but I couldnt concentrate on it because the grain of the wood on the table kept moving.  In my peripheral vision, aluminum cans danced around, but when I turned to look at them, they stopped.  I then went to go brush my teeth.",
  "Staring at my reflection in the mirror was amazing.  My face turned entirely to stretched out rubber and became huge.  It also detached from my head and started floating around left and right, as my gray shirt turned green.  Also, when looking at my reflection in a window, my mouth became that of a sad clown.  I started laughing and decided I needed some sleep desperately.  When I went to the bed and put on the covers, I felt as if the covers had melded to my body.  I looked up at them and they were situated so it looked like a giant turtle was lying on top of me.",
  "I was rudely awakened 3 hours later at 10:30.  For a couple of hours after that, colors were somewhat brighter, and for the rest of the day I was worthless.  This may be due to the lack of sleep I got or the MGs, Im not sure.  This was the first time I ever outright tripped.  I had had a brief but amazing shroom flirtation but it didnt yield hallucinations.  I had an incredible time, and I believe morning glory is an excellent place to start out for hallucinating."
 ],
 "erowid": {
  "id": "30793",
  "citation": " Drawed. \"Watching the Living Floor: experience with Morning Glory (ID 30793)\". Erowid.org. Nov 12, 2007. erowid.org/exp/30793",
  "substance": "Morning Glory",
  "views": "2519"
 }
}
