{
 "id": 4961,
 "title": "2C-T-whatever",
 "date": {
  "submission": "2004-02-19T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "gandalf",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "8.0 mg",
   "administration": "oral",
   "substance": "2C-T-21",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Setting: Alone on a weekday evening. My comfortable apartment.",
  "Set: Well rested, non-stressed. Excited about my first trial with this relatively unknown substance, 2C-T-21.",
  "6:00 pm - 8mg dissolved in orange juice. No discernible taste. I cleaned up my home a bit to help pass time while I waited for initial effects.",
  "7:00 pm - The first alerts consisted of feeling simultaneously energetic and sedated. My skin registered erotic/sensual in ways reminiscent of MDMA.",
  "7:30 pm - Slow ramp-up. Pupils not dilated. Stimulated but in a way that was difficult to describe--a certain part of my psyche that sometimes reacts with panic at the onset of a psychedelic seemed triggered again, yet I was not really that altered.",
  "7:50 pm - I started to feel much more panicky, with heart pounding in my chest. I tried to take my pulse but could not focus enough to keep track of counting. I had paranoid thoughts about the nature/purity of the compound, and the stupidity of trying, without supervision, a new substance that had little track record. Pupils not dilated.",
  "8:30 pm - While the stimulation continued to increase, I was able to push away the panic with positive self-talk, deep breathing, and drinking a cup of mint tea--all psychological tools that had helped calm me in the past. On the other hand, I also became progressively more introspective. Pupils had become quite dilated.",
  "9:30pm to midnight - I continued to sink into a brooding mood characterized by little mental clarity, and no tendencies towards analysis, understanding, or resolution. The effects of this compound seemed mostly emotional--a phenethylamine version of drunken emotionality. I would occasionally remember that I could focus on positive thoughts, and my mood would turn on a dime. This pendulum swinging continued for a few hours, my disposition responding to the slightest mental lead. I would have these strange mental journeys that would start out positive and then degenerate. A rush of loving feelings, for example, elicited by thought of friends and family, and very reminiscent of MDMA, would suddenly veer into sadness as I thought of the frailty of life and human connections. Throughout, visuals were very mild, consisting mostly of subtle melting effects--so that my world seemed filtered through a viscous and slightly sparkling liquid.",
  "Although I didn't feel that this substance was terribly rough on my body, it occurred to me at some point that I was simply not having a good time. Absent were the open-hearted flushes of MDMA, the eroticism and insights of 2C-B, the visual fireworks of 2C-T-2, or the cosmic spirituality of 2C-T-7; instead I felt a pervasive sense of being stimulated in an emotional yet useless way. Exasperated, I remember thinking to myself: '2C-T-whatever'. At some point, trying to check my pulse, I got a reading of 90, (my normal is about 60-70), but was unsure if I had enough clarity to keep an accurate count. Pupils were still quite dilated.",
  "12:00am -The mood swings stabilized, and I started to feel my normal self.  I was tired, but not physically drained, just sleepy. Pulse 85, and I was at that point mentally sure of my ability to keep count. The feelings of physical stimulation were still present at about 1/4 the peak level, with pupils still a little dilated, but I was able to snack and then fall asleep for the night. ",
  "7:00am - Woke up refreshed--no hang-over.",
  "What was the point, I wonder? Perhaps this substance requires a stronger context to give the experience wings. I may try 2C-T-21 again, at the same dosage, but in a different and more emotionally directed environment--around friends who are using MDMA, watching a comedy, perhaps while having sex. But then again, I feel no inclination at this point to repeat a trial."
 ],
 "erowid": {
  "id": "30816",
  "citation": " gandalf. \"2C-T-whatever: experience with 2C-T-21 (ID 30816)\". Erowid.org. Feb 19, 2004. erowid.org/exp/30816",
  "substance": "2C-T-21",
  "views": "22396"
 }
}
