{
 "title": "One of the Best Nights of my Life",
 "author": "Suze",
 "citation": " Suze. \"One of the Best Nights of my Life: experience with MDMA (Ecstasy) (ID 49631)\". Erowid.org. Mar 16, 2008. erowid.org/exp/49631",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "130 lb",
 "report": "<p>I feel a little awkward about writing this because I don't think I fit the typical profile of posters on this site. At 49 years old, my chronological age probably puts me in an over-the-hill category, especially for a first time user. But I certainly feel, and for what it's worth been told I look, much younger than my years and am open about most new experiences especially where mind and body are concerned. I also firmly believe that some things are simply meant to be, and my path to Ecstasy, in every connotation of the word, was along the direction the universe had been leading me.</p><p>I had been interested in trying X for awhile, having read about the effects both at raves as well as treatment for cancer patients. As fate would have it, and it generally does, I happened to mention my desire while visiting friends out west. And, as luck/coincidence/the cosmos would have it, my friend happened to have some he was willing to share with me. He gave me time to think about it, which I did over the course of the following day. I called with my decision to proceed late the next afternoon.</p><p>We decided to do so later that evening during a previously arranged dinner out, with his recommendation first that I refrain from eating. Upon picking me up a few hours later, he kindly arranged to have me speak to a friend of his who provided some preparation for my journey. I admit to being a bit nervous as I took the X, in a divided dose, but was eagerly anticipating the effects.</p><p>Shortly thereafter, while in the company of some truly inspiring, avante garde people, my friend asked me if I felt my heart opening. My heart, I responded, was always open--how would I know the difference? Well, not ten minutes later, I KNEW. I'm not sure if it was when my vision turned technicolor, like when Dorothy enters Oz where everything that had been black and white suddenly became vividly bold and dazzling or when I turned to my friend, blinked and felt like I never wanted to open my eyes again.</p><p>He wisely pronounced it time to leave as he led me back to the car where I felt a tremendous peacefulness overpower me. That, and absolutely no censorship between what was in my mind and what came out of my mouth. It was total, raw, unplugged honesty. Later, thinking back to some of the things I said, I thought I'd be mortified...but as a person who places tremendous value on honesty, I didn't feel embarrassed at all, although I did feel the need to apologize in case I inadvertently made my friend, my 'sitter' for the night, feel uncomfortable or offended in any way. The fact that I became so uninhibited may have contributed to some discomfort on his part but I think such moments are to be expected and anticipated, especially during a maiden voyage such as mine, and fortunately something we've been able to move past.</p><p>At any rate, when we arrived at our destination which provided me some needed privacy away from others, I felt what I subsequently described as a 'heart ejaculation'. I was overcome by such intense, rhythmic contractions in my chest that seemed to be pumping out pure love and total openness, total acceptance of everyone and everything. I found visual stimulation to be so intense I needed to lay down in a dark room, and my head felt so heavy, so filled with thoughts I'd never expressed I just had to rest it gently on my friend's - I don't know if it was his lap, his chest or where but had a feeling he was just an extension of me so what did it matter where I rested my head?</p><p>After I poured out some raw emotions I simply wanted to hear his voice, to hear whatever thoughts were important to him, because if they were important to him they were important to me. My mind felt sharpened and my body felt...tingly. Wired. Electrified. Nothing more really. I was comfortable with the sensations that were occurring naturally and didn't require any other stimulation although I imagine that would have been amazing in the right situation. All I can say is I was savoring simply FEELING.</p><p>After a couple of hours, the peak had passed and I bid my friend good night. But while my body slept, my mind remained awake, visiting recesses of my mind and past that had been unexplored, leading me to some connections I needed to make. The next day was a lengthy one as I had to fly back east on no less than three flights. But the time afforded me the opportunity to become introspective and let some lessons truly sink in. These past ensuing weeks I've continued to ride the crest of the power surge that remains within me, and ideally, emanates beyond me.</p>",
 "year": "2005",
 "id": "49631",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-03-16T07:00:00.000Z",
 "views": "6211",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "MDMA"
  }
 }
}
