{
 "id": 4964,
 "title": "Talking to the Trees",
 "date": {
  "submission": "2001-12-17T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Boqs",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100",
    "grams": 0.1
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "Weird is the nearest single human word that sums the experience up.",
  "Hurrican Gordon was still causing a lot of wind, as it was leaving our area. The moon was full and clouds were tearing across it at high speed. The moon's presence and the powerful wind gusts seemed highly suggestive of something strange being afoot.",
  "Coming straight home from my uncle's and pulled up in the yard. I decided to stay in my truck, so I'd be out of the wind. The wind was extremely variable, gusting to 30 mph and then stopping totally to a dead calm. I decided to 'go in' again, settled safely in my truck, ready for voices and visions.",
  "I toked an estimated dose of about 100 mg and waited a few second before blowing out. The wind stopped at about the same time I felt reality ripping apart. Instantly I felt like a non human creature, my skin prickled, I became hot all over. My legs felt like they were painlessly being sliced off at mid-shin. I was breathless and overwhelmed and leaned my head out the window to siphon off some cool outside air. This was the the first 4 seconds into onset.",
  "A rising drone of odd voices and 'presences' emerged as the odd body sensations and hot flash intensified, as did a severe claustrophobic feeling from my own clothes, the steering wheel and the warmth of the truck interior.",
  "Simultaneously, the voices were becoming understandable. I was getting scared by this point. The friendly voice of a mexican man and the skeptical voice of a mexican woman spoke to me and to each other undertoned with a background chatter formed by every plant, blade of grass, rock, even my house. Amid the chatter, the male voice was applauding my realization that everything in the surrounding area did have a voice, but the female expressed her skepticism as to my intentions for coming into this space, rumbling that I was not a priest and was only meddling with a privelege.",
  "While this was happening, my moonlight view of the outside was tinted violet/magenta and repatterned in Aztec/Mexican style decorative patterns of extreme complexity.",
  "My fear by this point had become too much, and as I began to leave the truck the cycad plant(cycads look like palm trees, but are short and have spine tipped fronds) beside my truck started talking in its own way, but I could'nt understand it.",
  "I knew the cycad tree wasn't malevolent, but my fear was so intense at this point, I couldn't stay in the truck. I had parked close to the tree and because of that, it touched me, or rather grasped me on the hand as I fled. And I do mean fled.",
  "I was so happy to see the lit garage as I walked around the house. I started coming down while I sat in a rocking chair talking to the still lingering presences that I had just encountered for the first time. I was apologizing to the female presence for using a sacred plant to 'get high' like an infidel. This experience was so intense and real that I had to report it.",
  "Summary: Salvia is no joke, and it really rejects abuse. I am still freaky around that tree even now because it talked to me. Incidentally I planted that very tree 6 or so years before, after a friend had uprooted it and given it to me while she re-landscaped her yard. I was very careful with it while replanting and it prospered. No other mind altering substance has ever opened up plant to human communcation before or induced anything like this in me before. The voices and presences were the most frightening, in the extreme. I had no idea they would appear, much less express their feelings to me.",
  "One thing I might add is that Salvia seemed to have a character. Many plant allies have one, for example Cannabis has one, albeit a whorish, take all comer's character tht blinds and fogs.",
  "Salvia commands respect, and she will get it even from the uninitiated, like myself, if they succeed in 'going in'. I was not expecting to be swatted down so strongly by her power. ",
  "My eyes are opened!",
  "I'm ging in again soon, this time humbly, and not near that talking tree."
 ],
 "erowid": {
  "id": "3083",
  "citation": " Boqs. \"Talking to the Trees: experience with Salvia divinorum (ID 3083)\". Erowid.org. Dec 17, 2001. erowid.org/exp/3083",
  "substance": "Salvia divinorum",
  "views": "9499"
 }
}
