{
 "title": "Hope for Flying",
 "author": "Batman",
 "citation": " Batman. \"Hope for Flying: experience with Valerian, Melatonin & Passion Flower (ID 49691)\". Erowid.org. Jun 28, 2006. erowid.org/exp/49691",
 "substance": "Valerian, Melatonin & Passion Flower",
 "bodyweight": "127 lb",
 "header": [
  "DOSE: T+ 0:00",
  "1 bowl",
  "smoked",
  "Cannabis",
  "(plant material)",
  " T+ 0:40",
  "750 mg",
  "oral",
  "Valerian",
  "(pill / tablet)",
  " T+ 0:40",
  "180 mg",
  "oral",
  "Passion Flower",
  "(pill / tablet)",
  " T+ 0:40",
  "3.0 mg",
  "oral",
  "Melatonin",
  "(pill / tablet)"
 ],
 "report": "<p>I had been very determined to find a combination of herbal supplements to help initiate a lucid dream.  I had lucid dreams in the past, but had been finding it difficult to have one lately.  After researching online for the past month I decided to buy a bottle of 3mg Melatonin, 125mg Valerian Root (containing Passion Flower), and a bottle of 100mg B-6.</p><p>My fiance and I tried all sorts of dosages and combinations with little results.  I had read that it's not good to take B-6 regularly because it can jack up my nerves and send me to the hospital, so tonight after smoking a bowl we came inside and took our supplements.  My fiances dosage did nothing for her so I'll just describe my own...</p><p>At 2:30am I took 6 pills of the Valerian/Passion Flower supplement (750mg Valerian root and 180mg Passion Flower total) and 1 pill of the Melatonin (3mg total).  Before this, the most I ever took was 5 pills of Valerian (625mg) and nothing really happened except difficulty waking up. </p><p>I was still high but had come down quite a bit so I was expecting the normal drowsiness from the supplements and cannabis combination about 30 minutes from baseline.  I'll document this the best I can:</p><p>T+0:00 Smoked 1 bowl of Cannabis.  Felt slightly detached from reality like normal.  My sense of touch is always drastically changed for quite some time after smoking.  Went inside.</p><p>T+0:10 Ate a Nutri-Grain bar and half a box of croutons.  Damn munchies!  Then got in the shower.</p><p>T+0:40 Took the supplements (Valerian, Passion Flower and Melatonin) in doses listed above, all at once.  Felt pretty tired at this point.  Laid down in bed.</p><p>T+1:10 Felt a little out of it.  Figured I was probably just tired.  Became talkative, much to the dismay of my very tired fiancee.</p><p>T+1:25 What the fuck?  I'm getting slight pains in my side (which I feel suddenly while writing this, weird).  Because of the paranoia I get from cannabis I worry that I took too many supplements and would have to go to the hospital.  This fear faded though. </p><p>T+1:30 What in the hell is going on in my stomach?  It feels like my stomach is 'boiling'.  Never felt like that before.  Felt no nausea though.  Began to feel as if I was floating above my bed.  No, it felt more like my stomach was physically lifting the rest of my body off the bed.  Felt like I was on a strong painkiller like Vicodin (I took once when I had a tooth infection).  I couldn't believe the difference that 125mg more Valerian was causing!  I doubted the cannabis had ANYTHING to do with this great feeling because I knew it had worn off by now.</p><p>T+1:50  I imagine this is when I fell asleep.  It felt so good to be floating that I drifted off peacefully and quietly.  It was VERY nice.  I had very vivid dreams that were weird, but not bad.  Lately I had been prone to nightmares but tonight there were none.</p><p>T+7:40 Woke up and figured it must have been around 12:00pm because I felt so well rested.  I was surprised to find it was only 10:30am.  Didn't even need any coffee this morning!  I felt great!</p><p>I think I'll try this again to induce lucid dreaming.  Have fun!</p>",
 "year": "2006",
 "id": "49691",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-28T07:00:00.000Z",
 "views": "26988",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": " T+ 0:40",
   "amount": "750 mg",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 0:40",
   "amount": "180 mg",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": " T+ 0:40",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  }
 }
}
