{
 "title": "Everything and Nothing",
 "author": "B-rabbit",
 "citation": " B-rabbit. \"Everything and Nothing: experience with 5-MeO-DMT (ID 49690)\". Erowid.org. May 8, 2008. erowid.org/exp/49690",
 "substance": "5-MeO-DMT",
 "bodyweight": "140 lb",
 "report": "<p>About a week ago i discoverd a variety of legal drugs. First i bought some fly agaric mushrooms. After they came in and i ate about 7g and i have to say i was very dissapointed, it just gave me a small body high similar to what a small amount of hash would give me so i decided to sell the rest of my stash to the dumbasses around town for like $20.00 a bag.</p><p>Then an old hippie friend of mine said something about how nothing is as trippy as 5MEO-DMT. I did a lot of research on this drug and then acquired some. inside the envelope was a small zip lock bag labeled 5MEO-DMT and it had a small amount of yellowish crystal/powder in it. immediately after its arrival me and the son of the old hippie dude went to another friends apartment to test it out. I went first since it was mine and i put a very small amount on some tin foil and smoked it like dope. It broke down into a liquid like meth does also, but the first hit just made me feel kind of weird and my heart started beating fast.</p><p>Then i started to think this shit might be bunk just like the shrooms so i put what looked about like 1/10 of what i had left on the tin foil. I smoked this just like i did before and as i inhaled the smoke i was already feeling fuzzy and everything was distorted. i held in the hit for about 20-25 seconds and upon exhaling i was tripping so hard i didnt even know what tripping was any more. My sitters said that when i exhaled my eyes got glossy and crossed and i fell back onto the couch. i had no idea what was going on or even what i was.</p><p>The best way i can describe it is that my entire universe was compressed into an infinatly small piece of matter and suddenly it exploded like the big bang or something. I was the universe, I was everywhere and nowhere, everything and nothing all at the same time. The trip must have lasted for at least an hour in my head but when i came to and knew what was going on only 4 or 5 minutes had passed. After i came to i was still tripping for a good 30-45 minutes. This sounds like it would be a scary trip but when I am that fucked up I dont even know what fear is.</p><p>All in all i think this is a very fun drug.</p><p>Cheers, B-rabbit</p>",
 "year": "2005",
 "id": "49690",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-05-08T07:00:00.000Z",
 "views": "2937",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "9.0 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 }
}
