{
 "id": 4972,
 "title": "Totally at Peace With the Universe",
 "date": {
  "submission": "2013-07-15T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Biochem student",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 g",
   "administration": "oral",
   "substance": "Poppies",
   "form": "tea",
   "specific": "Opium"
  }
 ],
 "report": [
  "I have been enjoyin subscription opiates for a while now, mainly in the form of codine or hydrocodone.  Recently I became interested in making poppy tea to try morphine.  I ordered 65 dried poppy pods off of an online store for 14 bucks.  They were the smaller 'mini' pods which are rumored to be not as potent as the regular.  However I found that they were very potent indeed.  I ground all the poppy pods up in a blender until it was all powder and then weighed out 12 grams.  I added the poppy powder to hot water and let it steep over night.  I also added some lemon juice from fresh lemons for the acetic acid content that in theory should have changed a very small amout of the morphine molecules to diacetylmorphine (heroine). ",
  "The next day I strained the tea and drank it all at once.  In about 40 minutes I was feeling pretty high and relaxed.  In an hour an a half I was totally at peace with the universe and completley content to lye on my coach and listen to relaxing new age music all day... and thats exactly what happend. I took the poppy tea around 1:00 p.m. and I was still feeling pretty damm high and still had constricted pupils at 3:00 a.m. that night.  I had a great time but I hade no idea that the effect would last that long. All in all it was a great expierence but make sure to clear alot of time for the expierence because it can last for over 12 hours."
 ],
 "erowid": {
  "id": "30877",
  "citation": " Biochem student. \"Totally at Peace With the Universe: experience with Poppies - Opium (P. somniferum) (ID 30877)\". Erowid.org. Jul 15, 2013. erowid.org/exp/30877",
  "substance": "Poppies - Opium (P. somniferum)",
  "views": "604"
 }
}
