{
 "title": "Evil Horror, but I'll Do Them Again",
 "author": "Chucky",
 "citation": " Chucky. \"Evil Horror, but I'll Do Them Again: experience with H.B. Woodrose (ID 49737)\". Erowid.org. Sep 29, 2007. erowid.org/exp/49737",
 "substance": "H.B. Woodrose",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "15 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2005",
   "49737",
   "Not Specified",
   "",
   "Not Given",
   "Sep 29, 2007",
   "6494",
   " "
  ]
 ],
 "report": "</p>\nHaving experienced much of what shrooms, salvia, nitrous, and other less pleasant psychedelics (Peganum Harmala -Uggeh) have to offer, I bought some of these seeds as a cheaper, legal substitute for LSD. I should have known it was a bad idea at the specific time, a friday night, after a pretty emotional day as my much beloved cat was showing signs of deterioration; it was clear he was soon to die. Especially bad for a first timer, I suppose. I took 15 seeds around 7.00 in the evening, having microwaved them in a small cup of water for around 30 seconds, then chewing them up and downing. Not at all a bad taste compared to some of the shit I've ingested. Basically I thought 'Well I hope they don't work'. I'd had dud seeds before.</p><p>The nausea I'd expected came in maybe 40mins-1hr from ingestion. I was sitting cradling my cat, comforting him in his suffering. He had a bad infection/rot in the head/eye. I suppose the nausea was slightly trippy in itself, it lasted for around 2 and a half hours, and my emotional anxiety grew with the physical hurt, the two eventually seeming to meld. It took increasing effort to sit and tend to my cat, with breaks of lying flat on my bed, feeling horrible physically and emotionally. I felt moronic and selfish to have taken these when my cat needed me, on top of the nausea. </p><p>Well after this, which truly was bad enough, the nausea gradually faded, to be replaced by a hugely intense trip of agony. I experienced a feeling that had been growing through the nausea, that I was feeling my cat's real pain. Almost physical empathy. This grew to titanic proportions as the trip came on, like my personal hurt mixed with received agony of my cat next to me. I just burned. Then at a crest of one such wave, my cat walked out of my room and I was sure as hell he'd gone off to die. The next 4-5 hours were some of the worst I've ever been through. I'd guess it was around 11.30 when he left. I had the lights off and wanted to sleep. ha.</p><p>I, at that point with my shroom 'evolution', had the concept of there being love at the heart, the centre of everything. That love is beneath even the darkest sorrow, the worst hate etc., and the thing is to reach it. Well I think the reason the seed trip fucked me so badly is that, while experiencing this extremely intense horror, I searched and searched, probing deeper it seemed into existence itself, trying to reach the source, where I would find, I thought, the love that binds everything. And I just couldn't find it. This vein of darkness went on forever, and the sense of hopelessness at this destroyed me. </p><p>On the physical level, I was constantly grimacing and grinding my teeth hard, while it felt like my eyelids had turned up on themselves. My eyes were fixed at the 'third eye' position, rolled up. I writhed in pure agony that went from my lower back, up through my body to my upper chest. It was absolutely unbearable. This was as real physical pain as anything. It occurred to me through this hell that this was like cold turkey, though I have no personal experience of that. I moaned softly throughout. Regarding hallucinations, at one point when I rarely had my eyes 'down', my hands seemed to have strands of flesh between them like goo, they stretched as a parted my hands. Wierd.  </p><p>So I continued through this tunnel of hell trying to find the end of love, and never doing so. the deeper I went the worse it was. And for hours it was the same, the thought of the imminent death of my cat repeatedly sending me into spasms of, well, hell. I must have slept around 4-5ish, and woke around half 11, still not down. Lying still I could bear this state. I was crying silently at what I had witnessed in the night, but getting up and moving, as I needed to do to help my parents administer ointment to my cat, who hadn't died that night, but soon would. It was nauseous torture. I couldn't see or walk, a bit like whitying on weed, and it took a burning will and love for my cat to get myself down stairs and hold my cat. I just wanted the whole thing to go away. I felt a level of apathy to the entire world. I felt the horror revealed to me in the night was universal. Hope was an alien concept. I guess I was fully down by 12.30 so round 16-17 hours for the entire experience.</p><p>Now, some 7 months later, I'll try them again because I see it was the set and setting that had me trip sooo badly. And, in a twisted way it was a valuable experience. Also I'll do half the dosage, I think 15 was too many.</p>"
}
