{
 "title": "How MDMA Influenced My Sex Life",
 "author": "Spliffsnatcher",
 "citation": " Spliffsnatcher. \"How MDMA Influenced My Sex Life: experience with MDMA (Ecstasy), Alcohol & Cannabis (ID 49739)\". Erowid.org. Dec 31, 2009. erowid.org/exp/49739",
 "substance": "MDMA (Ecstasy), Alcohol & Cannabis",
 "bodyweight": "70 kg",
 "report": "<p>In the period between 16-22 years old, I used MDMA frequently, about 3 tablets on a night out, once in a month. Later on this was about a gram of powder; the tablets are almost never pure, even here in Belgium. And as with every substance pure is always safer.</p><p>This night (winter 1996) we were going to an event about an 2hours away with the train, about 10.000 people, and the best DJs off the world, I surely love Belgium, every weekend you have at least one 5000+ people event with very quality line-up. Carl Cox, Sven Vath, Aphex twin, you name them and I have probably seen them. This night was no different, going to see the people from the past events and meeting some new people, and as always almost everybody ready to talk about the most absurd and yet so interesting things. One of those positive effects of MDMA.</p><p>We arrived at the party, me and 5 friends, were we met the friend of my girlfriend, they know each other from school. She had provided us 2 with a place to stay in Gent that night, always nice to have a place to rest that is not to far away. Finally inside, without having to throw away the bag. Never had to do that btw, I always wonder how people can be so stupid to get caught trying to bring something inside.</p><p>11.30 PM: I put some powder on the top of my hand and lick it with my tong, this method seems to work very good except for the unpleasant taste of the crystals. It doesnt matter how much I have eaten, the substance is directly put in my bloodstream trough my tongue, so very quick response. The 2 girls shared there capsules, so there effects came later on the evening.</p><p>T+20 minutes: feeling the first effects, my eyes are closing sometimes, I feel light in my legs, something like very very good weed, when you get completely relaxed. Drinking some Stella and my girl some white wine. Enjoying the music and talking to my mates who came along. After a while I usually start to walk around a little bit and check out the place, having a drink and meet up with old familiars.</p><p>T+60 minutes: I have another lick of MDMA and rejoin my girlfriend who is clearly feeling the effects also because see is intensely talking to her friend. The 3 of us decide to get a new drink and head towards the DJ booth.</p><p>T+90 minutes: its now 1PM and my legs won't stand still, the girls are enjoying them with giving comments on peoples dancing skills, always good for laugh I guess. The night progresses with a lot of fun and dancing, and thinking how beautiful my girlfriend is when another pumpt-up steroid guy gets rejected.</p><p>3PM: we managed to get some tablets of a guy, 25 euros for 6 ying-yangs and decide to take one each and save the rest for later. We are all feeling very good, not to much yaw clenching, not to warm and gave attention at drinking enough.</p><p>5PM: we decide to go home and take a taxi to the girls flat. Me talking at the cabdriver about the most weird things that I came up with, the girls laughing with the situation, cant blame them.</p><p>5.20PM: I said that I would sleep on the sofa, and the two girls in bed. Off course non of us could sleep and we ended up smoking some good quality white widow cannabis and talking in the dark about silly urban legends and so on. As I reach for my pants to get a lighter I find the three pills. We couldnt sleep anyway so we decided to take them. The next events took place between 5.30 and 9 PM as I lost track of time.</p><p>We kept on talking about all things in live and off course sex was one off them, about how we managed to stay together so long and that she managed to get only stupid guys who could not tell the difference between a Dali or Van Gogh. The tone off the conversation got more aroused as the last pills began to work. I am not going to tell you what exactly happened, but the 3 off us ended up in bed together.</p><p>It was so nice it's hard to describe, its the most soft and intense experience I ever had. My skin reacted on every stroke, and all was said without words, I felt so very close that it is very trust giving. With the blink off an eye I seemed to feel and understand what the other is feeling.</p><p>Now what I find very weird is that most rapports claim about not being able to get an erection, it has never happened to me unless there was speed involved, pure MDMA I find opposite, I checked it a few times with my girlfriend and its true, my penis was larger, about 4 centimeter and we could make love for several hours non stop. Maybe it works on male hormones because my hair seems to grow faster, very weird but true I can definitely say that the MDMA is one of the reasons that I am until now happily married. We can talk about anything we want now, and not knowing any shame or  discomfort.</p><p>These days I dont use any drugs, sometimes a joint in the evening. I can safely say that it has not affected my mind what-so-ever, except for my way off thinking. I am a happy father off two kids and work as an engineer in a building company.  I will always tell my children when there older to stay alert and watch out with such things, but I will surely not believe all the made up stories about them.</p><p>In short; MDMA intensifies the moment, when I dance I dance harder and better, when I drink good wine I taste the tanninnes better, when I am having sex every single square inch of skin feels electrified.</p>",
 "year": "1996",
 "id": "49739",
 "gender": "Male",
 "timestamp": "2009-12-31T08:00:00.000Z",
 "views": "9528",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:20",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": " T+ 1:00",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:00",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": " T+ 3:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 5:50",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 5:50",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
