{
 "title": "Bloody Blood Blood",
 "author": "Anonymous",
 "citation": " Anonymous. \"Bloody Blood Blood: experience with Melatonin & Coffee  (ID 49751)\". Erowid.org. Mar 12, 2007. erowid.org/exp/49751",
 "substance": "Melatonin & Coffee ",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Melatonin",
   "(pill / tablet)",
   "",
   " repeated",
   "oral",
   "Coffee",
   "(liquid)"
  ]
 ],
 "report": "<p>I recently obtained a bottle of Naturalist Melatonin (3 mg/cap, includes 89mg Calcium, 69mg Phosphorus).  I find myself frequently lying in bed for several hours with a very racing, creative mind, which is good in some ways, but bad in others (obviously lacking sleeping time).  I had heard/read some good things about Melatonin and I decided it would be a good choice for a sleep aide.</p><p>Wrong, so wrong. Well, at least for my case.  The first time I took it, I noticed it's effects come quickly.  It was kind of interesting.  I noticed euphoria, with a sense that, 'God I need to be in bed so badly', while colors seemed to appeal a little bit more, and things kind of had a stoned effect.  Lying in bed I had a bit of an unpleasant feeling, can't describe it too well.</p><p>I took Melatonin three days in a row (the bottle simply says WARNING: Do not take more than 1 tablet within 24 hours, each time was ~24hrs of the last).  I also drank Coffee in the morning 2 of the 3 days as well, which is something definitely to be noted.  On the third day, while I was in class, I suddenly felt like water was coming out of my nose.  Random nose bleed, first time I have ever had one, second time my nose has ever bled.  After thinking for a bit, I concluded it must have been the Melatonin, and Googled it.  I found some sites referring to blood thinning/minor bleeding as a result from Melatonin, so I am pretty sure that Melatonin is involved.</p><p>Yesterday I took Melatonin again (about a week without using Melatonin at all), because I had been falling asleep fairly late, and I needed to wake up at 5:30 AM this morning because I was going fishing.  It worked as it had before, and I fell asleep within about 45 minutes.  I was feeling unpleasant as hell falling asleep though, especially because of the bad memory of my previous nosebleed.  I would have slight pains in my stomach, individual fingers might get sudden bursts of pain, and overall I felt very uncomfortable.  This persisted throughout the next day.  Then later in the day I went to the bathroom and had bloody stool.</p><p>I realize now that taking Melatonin with Caffeine is a bad idea anyways, and why I took it before researching is stupid. Regardless, I found Melatonin to be a little unpleasant and contrary to what I have heard, Melatonin produced blank, black sleep for me, with absolutely no dreaming/recall.</p><p>Good thing I test-drove this sleep aide before using it incase of a bad Shroom trip.  It doesn't even make me fall asleep anyways, just gives me that tired sensation that its 3:30 AM and Ive been up and about all day and hopes I can find your bed and complete the story.</p>",
 "year": "2006",
 "id": "49751",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-12T07:00:00.000Z",
 "views": "14343",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  }
 ]
}
