{
 "title": "The Flower Bloomed in Front of My Eyes",
 "author": "William Rafti",
 "citation": " William Rafti. \"The Flower Bloomed in Front of My Eyes: experience with 2006 LSD Symposium, Basel (ID 49769)\". Erowid.org. Jan 24, 2006. erowid.org/exp/49769",
 "substance": "2006 LSD Symposium, Basel",
 "bodyweight": "",
 "header": [],
 "report": "<p>I first heard about this LSD gathering back in May of 2005 from Mark McCloud (the convention didnt even have a web site up at the time). I expected the symposium would be a bit boring and more expensive than I could afford; however Mark doesnt understand the meaning of the word no and my finances improved. I also had severe concerns that excessive drinking; illicit drug use, and childish antics would ruin the event.</p><p>I actually found the attendees to be quite sober; 2,000+ attendees with none of them appearing impaired; which is remarkable when you consider that the symposium was a celebration of one of the most powerful mind altering substances known. </p><p>The only illicit substance (by American standards) available for purchase in or around the convention center was absinthe, which surprised me as I assumed the event would be a magnet for drug dealers. It seemed that unless you brought your own illicit drug of choice that your odds of being able to 'score' anything were virtually zero. If you are considering going to the next convention I beg you to leave your 'habit' at home, as its stupid to try to smuggle a stash, and there will be no drug dealers to greet you at the convention. My carry on luggage was searched four times and I was frisked once, if there was anything in my luggage or on my person that I should not have had I am sure they would have found it.</p><p>This symposium was a major draw for intellectuals of all ages, and walks of life, I was handed business cards from new acquaintances that came from as far away as Hawaii and Australia. If people normally felt the way that I felt at this convention Im sure recreational drug use would vanish. The one beer I had only served to dampen the joy I was sharing with everyone I met. Day after day I met some of the most beautiful people in the world- beautiful not by the narrow media driven definition, but in the sense of being free of the ego problems and biases that are pervasive in other fields (Google William Rafti).</p><p>In no way did the convention suggest that everyone should 'Turn on' to LSD, the simple message is that for some people LSD (and other psychedelics) can be an effective tool for harm reduction and may prevent addictive drug use and self destructive behavior; the drug culture of the 60s has matured and shed the juvenile behavior that is to be expected in any youthful pursuit. The flower children have bloomed!</p><p>Day after day these beautiful loving people expressed thoughts that brought tears of joy to my eyes, as well as many others including Dr. Hoffman who confessed that he could not find words to express how deeply moved he was, he went onto say he now believes that his 'Problem child' (LSD) has become a 'Child Prodigy' and implored us all to spread the message of LSD to the world.  </p><p>I didnt go looking for an LSD conference to attend, it came looking for me; and it turned out to be nothing less than a religious experience. I feel very blessed to have been a part of this historic and pivotal world event.</p>",
 "year": "2006",
 "id": "49769",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2006-01-24T08:00:00.000Z",
 "views": "20065"
}
