{
 "title": "Subhuman on Crack Cocaine",
 "author": "cubicleboy",
 "citation": " cubicleboy. \"Subhuman on Crack Cocaine: experience with Crack Cocaine (ID 4977)\". Erowid.org. Jan 10, 2002. erowid.org/exp/4977",
 "substance": "Crack Cocaine",
 "bodyweight": "135 lb",
 "report": [
  "<p>I am a 3rd year university student with a history of drug abuse as a teenager.  From the age of 16, I have abused halucinogenic drugs, alcohol and marijuana until I detoxed on my own will in december of 1997 and stayed clean for over 2 years.  I used drugs to get away from myself as I am bisexual and I used to be tortured by the way I felt about it.  Many bisexual/gay people have lived a similar experience.  Not helping was the fact that I had moved a lot and felt like I had no roots. ",
  "Soon after detox, I decided to tackle life by studying to become a successful professional.  All went very very well (I aced my courses and got great jobs) until I had major depression in september 2000 (not related to drug abuse but to personal problems).  I was hospitalised and made friends there, including a very pretty 37 year old woman.  At the time, I didn't know she was an inveterate crackhead, but I was soon to find out.  Still depressed but off all medication except tranquilisers by that time, I called her one of those days and went to her place.  This is when I smoked crack cocaine for the first... AND LAST TIME!!! ",
  "Here goes the experience...  She cooked the cocaine in a spoon using baking soda and water.  A yellowish precipitate formed and she scrubbed it out of the spoon with a knife.  This was the crack.  Then, using a simple pipe, she put a piece of crack in the pipe and she inhaled.  Since I am a depressed former drug addict, I was vulnerable and was not able to resist the temptation to try.  So I took a big puff and...  BAAAAAAAAAAAAAAAAMMM! ",
  "I felt like I had been hit by a 50 pound mase on the head.  It is by far the strongest high I had ever had.  Even two LSD hits were nothing compared to that.  The headrush was so powerful that I almost lost consciousness.  Yet the extreme high subsided quickly and I took in a couple more puffs.  I was in a severely disrupted physical and mental state.  Physically, I needed to move badly.  I felt like a battery operated toy that works on 2 volts but that had been plugged on a 900 volt battery!  My body wanted to dance, dance, dance and have sex.  Oh yes SEX!  My libido was increased to a point you couldn't imagine.  My heart was pounding like a jackhammer and this is what stopped me from taking in more of the drug. ",
  "Mentally I was wasted.  My memory was awful, my inhibitions almost completely gone, my judgment was severely impaired, my perception of time was completely messed-up and the only things I thought about were dancing and having wild horny sex.  I told this to my friend and she said it was normal.  I was in such an altered state that I asked her if she felt like having some of the wildest and kinkiest sex in the world!  I felt like a superlover, a sexmaniac, a penis brain.  Did I mention sex?  And this is not me!  I like sex a lot, but I am not a maniac and I was never that obsessed with sex, not even when I was drunk as a skunk. Since my friend was starting to feel a bit uncomfortable, I apologized.  Yet I could not think about anything else.  I wanted to do her so bad...  and she knew, yet she was so hooked on cocaine that she had lost all interest in sex.  She had a cute younger guy next to her and she had zero libido...",
  "To be able to sleep that night, I had to take in a quadruple dose of tranquilisers and it barely worked.  The next few days I was still hyper and still obsessed with sex.  This sex thing was starting to seriously annoy me.  I had tremors, dry mouth, a slight headrush, backpain, restlessness, difficulty sleeping, difficulty concentrating, and sexual thoughts for days and days after the experience. ",
  "I guess I am one of those lucky people who tried cocaine and ended up hating it.  I say lucky because a friend and a cousin have completely lost their mind due to crack cocaine addiction.",
  "M.</p>"
 ],
 "year": "2001",
 "id": "4977",
 "gender": "Male",
 "views": "60673",
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Crack"
  }
 ],
 "submissionDate": "2002-01-10T08:00:00.000Z"
}
