{
 "title": "Tingly Multicoloured Rabbit Realities",
 "author": "Bobby/Gwynne",
 "citation": " Bobby/Gwynne. \"Tingly Multicoloured Rabbit Realities: experience with Salvia divinorum (5x extract) (ID 498)\". Erowid.org. Aug 7, 2000. erowid.org/exp/498",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "",
 "report": [
  "<p>Febuary 25, 2000",
  "Around 10:30 pm, friday. Salvia 5x extract was smoked, not very much at all, I would say...an average sized bowl between the two of us. We smoked it through a regular pipe - we (bobby and gwynne, a happy couple) were too lazy to make a bong so we just used Bobby's pipe. We were at Bobby's house. His parents were at the movies. This was Gwynne's second Salvia experience. The first experience offered virtually nothing. This was Bobby's fourth or fifth attempt at getting something from Salvia. This time was the first time Bobby experienced anything worthwhile.",
  "The entire experience lasted less then 15 minutes for both participants. The onset was felt seconds after inhaling. Residual effects lasted no more then 30 minutes.",
  "We did not intend to do salvia as a recreational experience. Both of us believe in a greater spirituality, and would never disrespect any plant. Anyway...",
  "-gwynnes voice-",
  "After I took my first toke, I started to feel a little strange, after my second toke all i remember is...",
  "Reality started to unfold infront of me. I knew I had smoked something, but I do not remember ever exhailing.",
  "In waves, like a rollercoster our/my reality was slashed in half and pulled apart. Reality started to move like a kalidescope (sp?). It was like i was stuck under the kalidescope watching our reality turn and move.",
  "There was a beautiful arrangement of colors that continually twisted in space. As strange as this seems, the colors were made up of thousands of tiny rabbits. The colors I most vividly remember are blue, red and yellow. It felt like i was watching our reality turn and move in this kalidescope motion for about 10 minutes, after which the the colors and the new reality started to slow down and stop moving. Bobby informs me that all this actually took 3 or 4 minutes.",
  "I then found myself looking to my right side at what seemed to me a light bluish/green pale plane.  I immideatly knew that this 'plane' was another reality, another 'world'. To my left, I then saw Bobby.  Realizing he was here, I tried to explain to him that there was another world beside me. The other world was calling me, inviting me to come to it, I did not know however how i would get there. I then suddlenly felt torn. I saw Bobby, and I wanted him to come to this other world with me, however; I knew he was not allowed. I sat there thinking what to do, and trying to explain to Bobby what was happening. I felt a 'presence' from the other world that was 'calling' me to it. Also, whenever I spoke, I heard an almost mocking voice, something/someone repeating every word I said a few seconds after i said them.  This voice was coming from deep within the plane.",
  "Slowly the effects wore off, and things started to go back to normal.  This has been the most powerful substance I have ever done. Yet, i don't feel overly excited to do Salvia again right away. I feel almost frightened by what awaits me the next time I try Salvia. However; I do feel like there is something important i will learn from future expierances.",
  "-bobby's voice-",
  ">From what I can remember....",
  "Upon closing my eyes I reliazed that I understood my alter-ego, my second self. I understood that not only was I really two beings (possibly more), but that I only really appreciate this reality in my normal day to day life. From this experience, I am almost sure that there is atleast one other reality super-imposed on ours. It wasn't a happy or amazing or orgasmic experience, it was just something that showed me that we don't know everything we think we do. The other reality I saw...",
  "I was with two other beings. They had characteristics of people I know, but were not people I know. We were trying to move some object, and because of this strange time-shift, my other self in the other reality was unable to function. The object we were trying to move at that point began to turn into a large spike that was stabbing me in the face. It sounds harsh, but it wasn't painful, just annoying. At this point I began to try to explain this to Gwynne, but then it all folded in on itself and disapeared. I tried to lay quietly for a bit, with my head in the covers, but once I had thought about it...it was too late. Then, stardetdly, I heard the sound of Gwynne saying to me: 'Are you okay?'.",
  "I got up and went over to the other room, where Gwynne was sitting. She hadn't said anything. From that point on it just kinda felt like my other Salvia experiences. I was hot, sweaty, etc, with a large pressure being forced on my body. Then she got off the computer and I begin writing this. When I began writing, I was still very high, and upon reading the first sentance over, I realize that I wasn't really concious of what I was trying to convey. Now I'm almost fully back to normal.",
  "I do not claim that this has any spiritual or actual significance. It seems to me like only a tease as to what I can really learn...I know that this other reality was probably just a part of my own mind, but I would never brush it off as just that, as that would stop me from learning all I can from it.",
  "Our advice: go smoke some Salvia now! And you'd better respect it.</p>"
 ],
 "year": "2000",
 "id": "498",
 "views": "6979",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "submissionDate": "2000-08-07T07:00:00.000Z"
}
