{
 "title": "Cherry Road, Cherry Stars",
 "author": "Lytes",
 "citation": " Lytes. \"Cherry Road, Cherry Stars: experience with MDMA (Ecstasy) (ID 49807)\". Erowid.org. Jun 16, 2006. erowid.org/exp/49807",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "5 tablets",
  "oral",
  "MDMA",
  "",
  "",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>The first time I did E was the craziest day of my life. Before this I had only ever drank and smoked weed, never thought I would even touch other drugs. In July of 2004 I was in summer school. I had made plans to go with a buddy who was also there after school. I didn't see him in the morning, but at lunch I did. We'll call him J. Well he missed the morning and was kicked out for missing too many days, and was leaving then. I hadn't missed much so I took the rest of the day off with him. We got in a car with G, who was the driver. They told me they had been on E for the last couple of days and hadn't slept, J asked me if I wanted to buy one, I had $30. After thinking about it for a few minutes I bought it, and swallowed immediately without chewing it. I didn't know what to expect, I knew little to nothing about the drug. But I thought 1 pill can't hurt, right?</p><p>Well after this we went to my friend A's house. We woke him up, J was living there for a while. We sat down for the next hour and a half and watched a Family Guy DVD. J and G always asked me how I felt, I responded by saying good. I just felt good, but wasn't sure if the bomber was hitting me yet or not. Now that I think back to it, I was pretty high. Drinking water felt good, and I was running the arms of the chair I was in. But sitting down made me not feel it as much. When we got up, we went to G's house so he could get games and CD's to pawn. While there they talked about the next E deal, J mentioned I wanted to drink later, but I told him I'd do whatever, and throw in my money on more bombers.</p><p>After going to pawn the games, we went to the dealer and got a lot of ecstasy. All green cherries (as were the first one I took). We went to a parking lot, and J and G crushed up 1 pill each. They asked if I'd ever railed anything, I hadn't and they said not to start with E because it burns. This was 2 hours after my first, they handed me the book and I took the crushed E on my finger and licked it off. Nasty taste. 15 minutes later I felt an immediate rush and sensation in my body that can only be described as ecstasy, I guess that's why it's called that I thought. I could tell crushing it up hit A LOT quicker than swallowing whole.</p><p>After this we went to a golf course where another guy who had been rolling with them the past couple days worked. While there I was really high, and felt great. I watched the golfers and talked to some people I saw there. While waiting for B to get off work, the others guys hit some balls on the range. After he got off work, we decided to go out to B's house. I live around the corner from him, but this is in a small town a half hour away from the city we were in. Before going out there we stopped at a gas station to get gas, gum and water. I went in the store for gum and water, and remember when entering the air conditioned store my body felt crazy with the change of temperature. I thought the worker there knew I was on E, but he definitely didn't.</p><p>When I got back to the car, J gave me another pill and I swallowed it. This was about 4 hours after my first. I wasn't too fucked now, thought E would be way more intense. I thought since I'm a pretty big guy it might not hit me as hard (how wrong I was). On the drive out to the N-Town, I remember looking at the clouds the whole way. They looked cool, like pillows in the sky or something and I thought about how they would feel if I was up there. I was constantly rubbing my fingers on the interior of the car, and knew the clouds would feel so much cooler, I could tell just by looking at them. When we got to N-town, I got G to drive me to my house because I had a 25 of water in my basement and I could drop off my school stuff.</p><p>I went into my house, my grandma talked to me and I was a little nervous but talked to her fine. I know when I'm stoned my eyes to real shut and she knows, so I made sure to open my eyes wide when I went in there because I didn't know if they were shut or not- but in the daylight pupils are small so I thought I was okay. She definitely gave me a weird look though, but I asked for $5 more and got it, then went downstairs and filled my backpack with somewhere around 16 water bottles and left. I went over to B's house, and just a half hour after the third, J gave me my fourth. I didn't even realize it was my fourth, but didn't think twice about it. I mentioned I got another $5, and J tells me 'that's good for another pill'.</p><p>Around 5 o'clock we headed back into town. In there we went to the mall for something, and I had to take a piss. I'd been in this mall a million times, but I couldn't find the washroom if my life depended on it. After wandering aimlessly for a couple minutes, I found J again to direct me. I then went in and pissed for what seemed 2 or 3 straight minutes. After this we went to Subway, where J bought a 12-inch sub for us to split. I hadn't ate a thing all day, and thought I was so hungry. I sat down and took one bite, and chewed it for a long time just to delay swallowing it because it was so gross. Swallowing it was so hard and the most disgusting thing I'd ever done. I took another bite and started to chew, J mentioned how he couldn't eat it after his first bite, and which point I just decided I wasn't eating it and spit out my bite right on the table. We got up and left after that.</p><p>By this time it was almost 6, and J organizes pickup hockey every Friday just renting the rink. He wasn't playing tonight, but had to collect everyone's money. When we entered the rink is when I knew just how fucked I was as the 3rd and 4th pills were hitting me HARD! Walking just felt so awesome, and in the rink it was cold and the cool air again made me feel the ecstasy through every inch of my body. I didn't want the people I knew at the hockey to know, but I remember sitting there and the 2 guys across from me laughing at me for a while. When I wrote this I asked one of them why they were laughing, to which he replied 'you were fucked out of your mind, you looked like ya just got hit by a truck'.</p><p>After J collected the money and we watched the hockey for a few minutes, we left and I remember my mind racing with thought at this point. I just thought of a million different random things all at one time and was lost in my thoughts. While driving I just thought about stuff and didn't even talk, my thoughts were crazier than anything else going on at this point. We picked up a guy I'd never met before, D, and the car was packed now with 5 people and it was kind of uncomfortable. After this we went and picked up more E. A little after 7, I took my 5th. That was my 5th pill in 7 hours. I remember sitting in the car and J telling D 'it's this guys first time and he's already taken 3, this is his fourth' and his voice sounded like that was a lot for your first time (I wasn't sure), then I corrected him and said fifth, and everyone in the car gave almost a collective 'holy shit you're gonna be FUCKED'.</p><p>I didn't know much of anything about the drug to know how much to take, all I knew is I took 'em all and was feeling just awesome. At around 8:30 or 9:00, we went to a party. It was a small party, only about 25 people there and mostly guys who went to my school and were a year older than me (just graduated that June). G and B were in their grade but I knew them more than the rest. I felt weird in there, being so fucked around all these people I knew, but didn't know well at all. After a while me and J and G hopped back and forth from this party and another just around the corner with about 15-20 people all who I didn't know, eventually that party came over to the other. This was around 10:30 or so and when the night got real crazy for me.</p><p>It felt like the whole way to this point, all the E just kept building and building on top of each other before they all reached their peak at this time. I could feel every part of my body just engulfed in the same feeling, my whole body was rushing and this feeling didn't go away the rest of the night. Any time I walked during the day I felt awesome just to be doing something, but when I stood up at this party it just felt too good, I couldn't walk I was paralyzed by the feeling. I remember smoking a few bong loads (I had my bong in the backpack I had my water in all night) thinking the weed would calm it down, but it just brought it up. Around this time I could barely do anything. As I said I couldn't move much without feeling just TOO good, and any time I talked my face would feel weird and I would either talk too fast, too slow, too quiet or too loud, it was different every time.</p><p>Around this time too, I began to see the auras around every light I looked at. Soon though, the auras changed. It was the halo like so many people see on psychedelics, you all know what I mean, but it wasn't just the same color as the light. It was a rainbow of swirling colors. I immediately knew this was the first hallucination I'd ever had. It was at EVERY light too. The one light in the basement was the worst for the rainbow of swirling colors. Clocks did it too, there was a clock with red numbers and it had a red/orange glow and swirl. The microwave upstairs with green numbers had a green/blue glow and swirl. Just every light I looked at usually had this happening. And whenever I closed my eyes, I would just see a crazy amount of colors, there was no black like when you normally close your eyes. Just bright, vivid colors.</p><p>Some crazy trippy things happened to me at the jig too. First one guy had a lot to drink, he was bombed. I knew him alright, and thought it was funny how drunk he was and was talking to him for a couple minutes. After I was talking to him I went somewhere and came back and he had just smoked some weed and was white as a ghost, I'd never see someone look this pale before. Then suddenly he puked in the trash can, so much. Then he did it again. He was so fucked, and someone said 'Tim looks like he's gonna die'. With all the crazy thought running through my head, my hearing that made me think that this guy was going to die from alcohol poisoning. I only told J and someone else I thought that, to which J jokingly said 'man I think we should be more worried about you than him at this point'. I was convinced he was alright after that, since I was feeling awesome and just realized he was fucked and having fun.</p><p>A while later I was sitting outside at a picnic table, some people had a huge 4-litre bucket they were smoking weed from they named 'Thor'. I don't remember, but supposedly I hit it. This is the only time it could have been cause this was when I was sitting with them. But anyways, the owner of the party has a bird and it was on the picnic table I was at outside (it's wings are clipped so it can't fly far). The bird walked over to where my hand was, and began to climb on it. It's claws on my skin was the coolest thing I have ever felt in my life. I sat there in a trance as this bird climbed up my arm, just loving the feeling it made on my arm. Then it got to the back of my neck and I couldn't see it, which freaked me out a bit. It was crawling around the back of my neck for a couple minutes, and it wouldn't get on my finger and leave, and it was pissing me off until someone came and took M off me which relieved me because it was freaking me out. The guy and looked and me and asked if I was okay, I replied by saying 'I am now, thanks for saving me'.</p><p>After he left, I looked through the house to the door. From where I was sitting I could see inside, the sliding doors were open and then there's the kitchen, and through the entrance to the kitchen I can see the front door. Well I was looking at the door, and I was my buddy A (who's house I began the trip at) walk through the door. It was him, don't tell me it wasn't. he walked in and someone went over and greeted him, and A asked where J was, whoever greeted him said downstairs and they went to the door.</p><p>I didn't wanna get up, but a few minutes later J was upstairs. I went and asked him where A was, he didn't know he was here. We went downstairs and J asked a few people, everyone said they hadn't seen him. 'You must be seeing things' J said to me, I didn't know what to think and said 'I guess so'. Now when I think back to when I saw A walk in, the way I remember it feels like how you remember a dream, and I just know it was a hallucination. I saw A walk in to this party, IT WAS HIM!!! I was so sure he was there. It makes me think that some other stuff I hear/saw there must not have been real either, because it seemed so real at the time.</p><p>The music that was on downstairs most of the night was rap or techno. I listen to rock, pretty much hate other music, especially rap. But the beats in this music all night I loved. I could feel the bass inside me, and the beats just flowed through my body. The music and my thoughts kept me entertained the whole night along, I didn't even need to talk to anyone else I was in a different world than anyone else at this point. Some of the stuff people were saying or doing to and around me tripped me out, I just couldn't process the rest of the world in my mind all night.</p><p>The party was done around 4 or 5 I think, dunno what the actual time was when we left. But 6 of us packed in to G's little car, the same 5 we had earlier and someone else we were driving home. Before we left, suddenly in the front seat (2 passengers and driver were in front) D and B started smacking each other, then got out and starting throwing punches. It was random, but from what I knew about D that I learned at the party this was the type of thing he does. They threw a few bombs, then got back in like nothing happened and we drove off. We dropped off the other guy, then there was 5 in the car.</p><p>We were driving around for a while, then suddenly when we were on a road with no other cars driving slow, but still about 40 km/h, D just opened the door and rolled out of the car!!! We stopped, and he got back up and in and J and G asked what the fuck he was doing, but he didn't reply it was like nothing happened. I guess later we found out he did it because he felt bad about beating up B earlier. Also one time we stopped and J had hiss leg out of the car, and G started driving and ran over J's leg with the back tire, that tripped me out too I thought he broke his leg but after a while he was fine. Those 2 things were fucked up. Anyways we drop off D at home, then dropped off B at work (he works early in the morning at the golf course getting it ready for the day). It was back to me, J and G just like the beginning.</p><p>The whole time we were driving around I was still hallucinating. It's hard to explain, but every streetlight I tripped out on. Every single one I couldn't see the pole holding up the light, all I saw was an orange faded light with lines of what seemed to be neon/electric orange swirling in and out of this faded dull orange. EVERY SINGLE streetlight was like this!!! It was fucked up. I also kept thinking I saw things either coming towards us or on the sidewalk in the distance, but when we got closer it just wouldn't be there.</p><p>We drove for hours, it was all dark when we started and a few hours later we were still driving and the sun was coming up. As the sun was coming up I thought it looked awesome, and this was the first time I could feel starting to come down. We had just been going so long, it was more than 12 hours after I took my last pill and it was only starting to come down now. We kept driving though, just doing random shit. There had been a flood in the city a couple weeks before, and people still had stuff out on their lawns, and we stopped a few times and stole/broke stuff including a TV right on the middle of the road. Once when we were driving with no one on the road G just randomly started swerving ALL OVER the road, it looked like he meant to do it and knew what he was doing but we just kept going and I thought we were going off the road for sure before we stopped eventually. To this day I don't know if he meant to do it or not but it scared the shit out of me.</p><p>Around 9:00 am we went back to A's house because J was living there and we knew his dad would be gone and not ask questions, but A wasn't home. J put on some chicken fingers to eat, and it was then I realized how hungry I was and hadn't ate in probably 36 hours. I wasn't even high at this point really, just down but could still feel the E in me. We talked about the night while the food cooked and during our conversation I realized just how crazy of a journey I just had and J told me a lot that made me understand it more. When the food was cooked, I couldn't eat me. But right then A came home and ate both mine and J's food, neither of us could eat still. At around 10, me and J laid down to sleep, it was still a half hour or more before I finally crashed.</p><p>That's not even the end though. At noon, less than 2 hours after I fell asleep from that crazy night, my friends J and B (different ones than the others) and B's brother came and woke me up!!! J called then before we fell asleep and said to come get us later. J was dead asleep but they got me up. We went and smoked some weed, I was SOOOO sketched out. After smoking a few bowls I could feel the E again too and was better, but still couldn't comprehend the rest of the world. They went to play basketball and I just watched, then we went to B and his brothers house where the 3 guys helped his parents carry a well outside they had to move, while I watched.</p><p>When we were driving in the car, I couldn't even hold me head up. It was constantly just hanging down and I could barely open my eyes. I couldn't talk either, my voice was so low and groggy. After a while we went back to A's house, where we smoked more weed which lifted me up again and I could slightly feel the E again, and it kept me up. It was around 3:30 now and I called home to get picked up. I got picked up at 4, and offered to drive home. I drove while my grandpa slept in the passenger seat, near the end of the drive I was sooo tired again. It was good to get home and in my bed for the 16 hour sleep I had after that.</p><p>After I began to talk to people what I did after the experience, they either had already heard the story or were just shocked when I told them. And I found out that green cherries were some of the best E ever around this area. It's a year later and I've done a lot of E since, but those are still the best I have taken to date, and there's been nothing like them since, and there is a lot of good bombers that come through here. My experience became somewhat of a big story around here, people I hadn't even met before would tell me they heard about it. I've had a lot of people tell me how crazy I am or how much they respect that. I didn't even have a clue while it was happening how crazy it was, but I now know I will never be where I was that day ever again.</p>",
 "year": "2004",
 "id": "49807",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-06-16T07:00:00.000Z",
 "views": "5655",
 "dose": {}
}
