{
 "id": 4982,
 "title": "First Dance and a Low Dose",
 "date": {
  "submission": "2007-08-10T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Raedon",
  "gender": "Male",
  "weight": "172 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I guess it was about two years ago or so when I first tried 2C-I. A friend had ordered some when it was first available at where ever you get such things. Out of the 8 times I danced with 2C-I the first time was the lowest dose. 6mg orally and was more a test of threshold effects. I also did not eat after lunch and never felt the nausea I hear about.",
  "The set and setting was a snowy night and just two old friends. I was feeling really happy that night mostly because it was Friday and therefore the longest period of time before having to go back to work. Besides the cup of morning Coffee I had not ingested any mind altering substance in months so I was quite in tune with any change in my being.",
  "We took the 6mg of powder in OJ around 9:00pm then sat and watched Fear and Loathing, a theme that has become a staple of almost all my T+0 turn on's sense 2001.",
  "Around 9:40 I started to feel stimulated. Like I had just done some Methyphenidate and a pill of Dex at the same time, though my pulse didn't go up.",
  "By 10:00pm the decision was made to use all the energy we were sitting on and the TV was shut down, apartment temps where adjusted, toys put away. The dance of the paranoid stoner was complete and we headed out into the snow. It was 33f out but this was at the end of a LONG winter of -10 degrees so it felt like spring. During the walk I noticed a slight change in my vision, ever so slight, light seemed more intense and colors were shifted a few degrees down on the visible light scale.",
  "At 10:50 we arrived at a park. All sounds were mute from the snow; a silence that I have never heard before, the sound of heavy snow. We were talking quite freely and a joke was always funny. I felt quite open about my thoughts. At that time in my life I had a lot of walls put up, bad job (boss actually), bad girlfriend, out of shape. We talked openly about our problems and it was not just talking, it was strong therapy. It's very clear now that there is a huge therapeutic use for 2C-I at lower doses. Something that I'm sure will get buried until the end of the drug war.",
  "The cold started to hit the bone around midnight and we walked back to the appartment. I remember seeing an old evergreen tree covered in ice. It had a battle wound from a lightning strike sometime in the past. I found it's new form beautiful and strong.",
  "The energy and flow of thoughts/light vision change lasted until 2:00am and we found it was impossible to sleep. So we started Fear and Lothing over; and then Spaceballs! 'I knew it, I'm sorrounded by Assholes! Keep firing Assholes!'",
  "For a low dose test much was learned from the threshold of 2C-I and I feel I am a better man from the first use. Just to finish off this first impression. 2C-I at twice this dose moved it into the realm of set and setting, and another report. ;)"
 ],
 "erowid": {
  "id": "30901",
  "citation": " Raedon. \"First Dance and a Low Dose: experience with 2C-I (ID 30901)\". Erowid.org. Aug 10, 2007. erowid.org/exp/30901",
  "substance": "2C-I",
  "views": "5123"
 }
}
