{
 "title": "Resistance Was My Problem",
 "author": "MM",
 "citation": " MM. \"Resistance Was My Problem: experience with Salvia divinorum (ID 4986)\". Erowid.org. Jan 10, 2002. erowid.org/exp/4986",
 "substance": "Salvia divinorum",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 leaf",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "report": "<p>\nOn prior occasions when I smoked salvia, I noticed some effect - mildly distorted field of vision (for a few minutes), a mild body high, and increased sensory perception for the rest of the evening.  Last night, I decided to imbibe yet again, this time with Oaxacan-grown salvia ordered via mail.</p><p>I was in a mostly darkened room with mellow music (Aphex Twin's selected Ambient Works disc and some Bela Fleck/Mike Marshall tunes) and a friend to act as a sitter (which I recommend!). </p><p>I packed one leaf into a water pipe, and took a hit.  I had read that one should hold in the smoke as long as possible, so I did.  I exhaled, and suddenly it felt as if my mind had been completely freed - it felt as though I had been living with some cap or boundary surrounding my mind, and it was gone.  My mind was open - more open than I have ever felt it.  I took a second hit around 45 seconds later, and the initial feelings intensified, accompanied by some feelings of uncertainty, and a mild distortion of the visual field.  Around 45 seconds later, I took the third and final hit - this is the one that really did it.</p><p>As I exhaled, I focused on my computer tower - I could clearly see the 'Dell' emblem; quickly everything else became blurry, and rushed past either side of me in a very strange space-travel like way.....</p><p>At this point I decided to close my eyes, and sit back in my chair.  I focused on the music, and instantly became very aware of a very strong body high - almost as if someone or something was pulling me to the left (this seems to be a semi-common experience with salvia from my understanding).</p><p>I'm not exactly sure how to describe what happened next.  I went very deep inside myself - very deep.  All sorts of images from my past and present life were rushing into my field of vision (keep in mind eyes are closed), and I became a bit frightened.  This continued; all of a sudden, it was revealed to me that resistance was my problem - it was almost as if a voice told me to stop resisting that which I could not change or control. </p><p>Then it was gone.  I opened my eyes - no more body high, no more visual distortion.  But what I was left with was incredible - I felt GREAT - very relaxed and full of incredibly heightened sensory perception. Colors were more beautiful, music sounded better, and I could truly understand everything being said by those around me.  All in all, it was very intense, and very profound, possibly due to the fact that the whole experience occurred in about a 4 minute period of time.</p><p>Salvia is an amazing plant.  I would say be prepared for a very intense experience, and use a sitter.  Go into the experience in a relaxed state and clear frame of mind, and don't expect anything.  The effects can be subtle at first, and it can be difficult to fully let go and have the salvia experience.  Small groups with no outside stimuli are best.</p>",
 "year": "2001",
 "id": "4986",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-10T08:00:00.000Z",
 "views": "11308"
}
