{
 "id": 4991,
 "title": "So Far It Isn't Worth It",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.0",
    "unit": "g"
   },
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I have had a few experience with chronic before but now I wanted to try blowing yayo.  Tonight was the second time I have blown yayo.  The first time I blew lines was last weekend and it didnt do much to me, same effects as the ones I had tonight which I will list. Both times I did a brush then blew the lines then lick the empty sac and desk clean (1g each time). ",
  "The effects that I felt were good for the brush/licking the coke.  It made my mouth and tongue feel warm, soft and kinda tingly, this hit me within 1 min of licking it and didnt last more then 3 or 4 min.  This was very good, coke brushes are very fun.",
  "Then I blew the lines and my effects were increased heart rate, kinda shaky or jittery (I keep bouncing my leg up and down, I couldnt stop moving if I tried), then a little bit later my jaw adjusted to kinda hurt, I was just moving it around a lot and I guess it got pretty sore, even now I cant stop my legs from shaking or my jaw from moving around.  I was a little more focused and concentrated but for how much coke it those effects arent what I wanted. ",
  "I felt no signs of euphoria either time.  I didnt get depressed, I just like was neutral... nothing mentally was really different... but I am pretty sure I felt all the physical effects.  I hadnt finished my gram quite yet so I decided to snort it double time to see if I was taking it to slow, now I got a new effect, I was slightly numb and warm all over, my spine kinda feels stiff too.  One effect that I havent seen any mention is that I can't take deep breaths, I figure this is because of my high heart rate. ",
  "Quick summary:",
  "Too expensive for the lack of good effects",
  "I can get the same effects I experienced by snorting some Adderall or Ritalin and vicodin and oxycodone for about 1/10 the price cost of the yayo."
 ],
 "erowid": {
  "id": "30923",
  "citation": " Anonymous. \"So Far It Isn't Worth It: experience with Cocaine (ID 30923)\". Erowid.org. Jun 25, 2007. erowid.org/exp/30923",
  "substance": "Cocaine",
  "views": "3480"
 }
}
