{
 "title": "Accepting the Yin-Yang",
 "author": "Chino",
 "citation": " Chino. \"Accepting the Yin-Yang: experience with 2C-I (ID 49920)\". Erowid.org. Mar 6, 2008. erowid.org/exp/49920",
 "substance": "2C-I",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-I"
  ]
 ],
 "report": "<p>CHINOS TRIP REPORT</p><p>ok i will try to make this as easy to read as possible....</p><p>-took 25mg mixed with vodka at 9:00pm, lasted until 7:00am</p><p>-im pretty experienced when it comes to psychedelics, done many things in high doses, in combinations, and this drug is amazing, and totally surprised me.</p><p>-felt like what a MX-missle SHOULD feel like, but far better, the high was so clean and pure feeling</p><p>-complete sensory overload, but i did not feel overwhelmed at all, i was completely in control of the high, and could sober myself up at will instantly if need be.</p><p>-ALL SENSES were fucking AMAZING!!!</p><p>~SIGHT-hallucinations that easily rivaled lsd. everything. closed eye visuals that simply blew my mind. colors extremely intensified. testures more pronounced, light and shadows falling on objects... it was like i was living in a painting for the whole trip.</p><p>~AUDIO-i could completely enjoy the silence, the sound of pouring a cup of orange juice or flushing a toilet were orgasmic! haha. listened to complex electronic music, analyzing all of the different patterns and layers. music appreciation at an all time high, never felt it so strongly with any other drug.</p><p>~SMELL-when i was outside at the lake with my friends, smells were intesified (if i wanted them to be, if i paid attention to them) and the smell of pine and eucalyptus were incredible, the smell of hot soup and food when we got back home was amazing too.</p><p>~TASTE-eating is so much fun, chewing the different textures, the different flavors in your mouth, god, so good.</p><p>~TOUCH- a body high that is different from ecstasy, but in my opinion, better. EVERYTHING, felt good, any type of movement felt amazing, i did about an hour of intense cardio at the lake, running, dancing, stretching, shadow boxing, pushups and acrobatics, i couldnt stop moving for the longest time while i was enjoying this aspect of the drug. when we got back, i had my friend PUNCH AND KICK me pretty damn hard, and even that felt good. the whole boundary between pleasure and pain was blended together.</p><p>~INSIGHT-with alot of psychedelics, I think I get some sort of realization, or some kind of philosophical understanding of the universe... with this, i would say that one thing i learned to appreciate even more than before, is the beauty of all states of mind. i took a long time and just cryed and sobbed for everything that has ever gotten me depressed in the past and present. i got incredibly angry and yelled at the tops of my lungs, punched the ground and flexed every muscle in my body with anger and fury. i laughed for hours and hours with my friends about nothing and everything. and it was great. im glad that i appreciate all states of mind, every emotion is equally important and necessary. i already knew this to a good degree, but this trip really solidified that for me, and im glad.</p><p>i also had conversations with my friends for a good 4 hours, just talking and talking and talking with an instrumental in the background, freestyleing, singing, wordplay, diving into the realm of words and communication.</p><p>we also drew for a good hour or so while listening to some music and eating food, and that was extremely fun.</p><p>of course i like doing drugs like these, but i try to make it a habit to learn as much as i can from these trips, and incorporate that into my daily life. nobody should have to be high on drugs to appreciate life, but i think its my responsiblity to myself to shatter my perception of reality every once and a while</p><p>A++ WILL TRIP AGAIN</p>",
 "year": "2006",
 "id": "49920",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-06T08:00:00.000Z",
 "views": "2607",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-I"
  }
 ]
}
