{
 "title": "Time Whirlpool",
 "author": "DJ Maux",
 "citation": " DJ Maux. \"Time Whirlpool: experience with LSD (ID 49927)\". Erowid.org. May 4, 2006. erowid.org/exp/49927",
 "substance": "LSD",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "1997",
   "49927",
   "Male",
   "",
   "Not Given",
   "May 4, 2006",
   "3838",
   " "
  ]
 ],
 "report": "<p>Well I had wanted to LSD for many years but at no avail until I was 17 when I got some trips called snowflakes.</p><p>There was 3 of in the group (a 4th friend who had a trip was to meet us later) and at one of my friends houses we all took a trip each.</p><p>We kept it under our toungs for about 15 mins and then proceeded out to a forest/river area nearby to chill out with a few beers after about an hour we found the conversation level rose quite a lot and we seem to laugh a little more than normal but I was sure that they wernt gonna work. I mean they are only little bits of paper after all arnt they?</p><p>So 2 of us took another one to see what would happen..Shortly after it started raining which we were all mad about I was saying things like...darn its wet! we're in hole and the nights ruined but for some reason it was really funny!! As time went on everything just got funnier..The whole situation just seemed ridiculous. Us..a bunch of apes...in this forest...tripping our balls off on paper.</p><p>Well after the 2 hour mark we stopped in the middle of a cobbled passage way with a dim errie orange light in the middle. To our right was the main road and to our left was back to forest well the 3 of us stood around debating what to do. I said we had to meet our friend near the main road my other friend said we should wait or maybe go left the problem was as soon as we got serious about what to do we would burst out into laughter..</p><p>One of us would tell the other two to be quiet as he would atempt to explain what we should do..but as soon at he would get anywhere we would laugh histericly. It was like as the LSD kicked in, our mental ages dropped and dropped and an hour later we were still there deciding what to do....It was like we were stuck in a group repetitve thought of what to do.</p><p>We would keep going over the same ideas and laughing...it was like our brain power was being reduced. I would say something like</p><p>'Right ok so we wil go right and we gotta meet X'</p><p>and a friend would say</p><p>'no we cant becuase we have to go back to forest'</p><p>and I would agree....</p><p>then id say 'No but we gotta go right and we have to meet X'</p><p>and the same left....right...left...right thing went on and on in a big loop until finally our 4th friend turned up.</p><p>YES! we shouted...our scout leader!!! We danced around him hoping he would take us out of the loop conversation but he got dragged into it as well it was like none of us could just stay where we were...we couldnt settle.</p><p>It was like we had to do something but we didnt quite know what.... Any how after a bit we all dicided to stay put and 2 of us smoked a joint at the 3 hour mark which short term seemed to do nothing Now here comes up the part that makes my trip way outta the ordinary and more powerful an experience that most people have had. All four of decided to go right out to the main road.</p><p>When we did we came to a roundabout with a bright light in the middle as I started to walk round the light I started to spin round in what was like a circle and all my friends spiraled around me as i walked around the light It was like the bigest whack ever.. it was what i now call a time circle</p><p>Basicly as I walked round the light time seem to change to slower/ faster this would happen for a few seconds and then I would come back to normal then 2 mins later another circle would happen.</p><p>Well this really freaked me out and I started getting nervous and a little paranoid from my fiends who seem to be laughing at me a litttle it took me 20 mins just to try and get everyone off the dangerous road back into the safty of the forest...</p><p>Well when we back in the forest we all lay down in the grass to chill out (night time by this point) and I was still freaked out. When I closed my eyes I could feel and almost see the tall grass erriely leaning over my face and my friends who were still laughing really freaked me out. It was like instead of me finding everything funny I thought they were all laughing at me as if I had fallen into somesort of evil trap by taking the LSD. </p><p>Their laughter seemed to echo in my head and I was sure they were laughing at me. Shortly later I walked off with my friend down this path and time started to really distort and skip like a scratched CD. One minuite I would be somewhere on the path and in a split second I would be 10 metres further down the path. I believe this to be because the is no exxternal time. Time is all in the mind meaning the universe outside of your mind is non-linier. Jumping in time can be scary...It makes me feel all alone</p><p>As we were walking my friend reminded my of the movie called werewolf where some kids were walking along a path...</p><p>They were safe on the path but if they went off the path the werewolf got them. shortly after I was mubbling things like wheres safety? wheres safety? saftys on the path...If I stay on path I will be safe...If I go off the path the werewolf will get me. Well that was a mistake for a start...Basicly I limited my safty to the path I was walking along.</p><p>Very shortly after things started to turn into 2D and when I was walking along I was tring to climb through what was infront of me as if it were a painting... Then the wierd bit.  When ever I would run off the path I would run into circles of time. I would run off the path for a short time but would be gone in my head for hours and hours. It was like everything around me broke down into pieces in a big spiral as I ran off the path. It was like everything split into 2 then 4 then 8 then 16 then 32 etc. as I ran away from the path. When everything was in 32 pieces time would run 32 times slower than normal for me. Then hours or even days later after reaching numbers like 4096,I would run back out out of this circle/spiral faster and faster back to the path and ask how long I was gone. Just a few seconds they would say but for me it was a lot longer.</p><p>Then I started running into deep circles.....It was like being sucked in by a time cyclone of the mind...Like going down the plug hole in your mind...deeper and deeper</p><p>Trying to find the path or something?</p><p>At one point I ran into this circle and started to run out of it I think having seen the path and I started to shout IM ON THE PATH TO LSD! Then id get futher out the circle and I would feel this buzz then id run out faster and faster and this buzz of sheer euphoria would grow and grow until the high was like feeling all the love / exctacy in the world. I had found the path! It was like there was this path that I had to find and when I found it I would blow up with euphoria.</p><p>It would go higher and higher....It was like time was speeding up as I would run out of the circle... It was like some how on lsd I was runing in and out of time and getting extream emotions...like my soul was exploding with energy...Like I was running towards everything...GOD...safty...it was the biggest YES ever.</p><p>But after that I lost the path again and didnt know what the path was. Some time later in the night when the time circles stopped I suddenly thought shit ive got to pay the money for the acid to guy i got it off (I already had had done but I had to meet him earlier to pay him and paying him had been on my mind all night)</p><p>Suddenly I was walking down some road and he appeared as clear as ever infront of me. his hair...his eyes....everything about him was 100% acurate it was as is he was there....he said to me 'got the money?'</p><p>I got this money out (that i didnt even have) and gave it him Thing was this happen about 20 times, over and over again I kept paying this money.</p><p>Finaly that must of stoped but then the circle thing came back with a real temper.</p><p>I would run in circles again but this time there was something dark and nasty in the middle. A big black circle in the middle of everything. It was like there was a hole in everything and I kept being sucked into it. </p><p>Id be sucked faster and faster into this multi dimensional circle and my fear levels rose and rose as I got closer...</p><p>Id be pulled more and more and then this black bat would spiral down and the closer it got the more scared I got.</p><p>As the black bat was very near me I was feeling what could be described as all the fear on the planet...Absolute hell or infinite fear was meant to be at the centre.</p><p>Imagine the universal opposite of extream love/exctacy. Where you have lost the path.</p><p>I was running into (but never reaching) infinite fear...I was running from safty...perhaps I had strayed from the path again.</p><p>I was mubling things like I gotta find the time keepers......where are the timekeepers?</p><p>Then towards the end I was being torn betweed dark and light..</p><p>It was like I had to find the answer to everything. I had to  choose between dark or light being the answer to everything and my decision speed would go faster and faster until I would be making 100000 decisions a second.</p><p>Eventually what was like 3 months of psychological torture of being trapped in my own head later I came round....</p><p>I still to this day think that I tapped into the ability to experience infinite emotion on LSD. Those time circles could bring infinite fear or infinite euphoria they were like cylones of emotion...Any how heres the point. IN the middle of some circles it was like I didnt even exist but I had the answer to everything...but as I would come back out of the circles I would lose the idea of what was at the end of it.</p><p>It was like I got some sort of infinite joke at the end of it and I felt fine when I knew the joke but if id lose the joke I would be scared out of my mind.</p><p>I have looked back on my trip and am thankful for the knowledge it had brought me. I now realise we are all gods and the joke is that we are infinitly powerful and on the path to heaven/nirvana.</p>"
}
