{
 "title": "Home Study On Detection Times",
 "author": "Rather Not",
 "citation": " Rather Not. \"Home Study On Detection Times: experience with Cannabis & Drug Testing (ID 49940)\". Erowid.org. Jul 25, 2009. erowid.org/exp/49940",
 "substance": "Cannabis & Drug Testing",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Informal home study on detection times (because I now work for a government contractor): I recently had to quit regular use of weed due to working for the communist facist's we call our government.  Due to my inability to completely quit I decided to test our testers.  Phase one is to determine what my personal detection times are.  I have used common over the counter drug test kits available at the local drug store.  What I have determined is the following: After having not smoked other than one or two hits off of a pipe on Friday night (very potent weed-did the trick) I have consistently tested clean by Sunday evening of the same weekend.  So far I have performed this ritual 3 times.</p><p>My next course of action is to investigate the use of synthetic urine.  Since I am paranoid wondering if they can detect fake urine, I am planning on ordering a couple of samples and submitting them to legimate drug testing labs personally to see what their response is.  I will post a follow-up with my results.  We all need to share information to beat this nonsense being dumped on responsible pot smokers.</p><p>Physical info:</p><p>180 lb serious mountain bike racer, triathelete...</p><p>Approx. body fat% 10% (depending on time of year)</p><p>Healthy (I hope) non-smoker</p><p>Light drinker</p>",
 "year": "2005",
 "id": "49940",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-07-25T07:00:00.000Z",
 "views": "5157",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
