{
 "title": "Onset Less Than 1 Hour",
 "author": "TheOtherSide",
 "citation": " TheOtherSide. \"Onset Less Than 1 Hour: experience with 2C-T-7 & Cannabis (ID 4995)\". Erowid.org. Jan 5, 2002. erowid.org/exp/4995",
 "substance": "2C-T-7 & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "85 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>The night before I was having trouble sleeping so I decided to take two extra strenght sleeping pills.  Each pill contained 50mg Diphendydramine.  It said to take one pill but I needed sleep.  The pills didn't work very well because I was up in less than 8 hours.  Actually I could still feel them trying to work.  I didn't have to work that day so I decided to take some 2C-T-7.</p><p>8:00am: Ingested 85mg on an empty stomach.</p><p>8:48am: Knock knock!  At first I thought it was the sleeping pills or maybe just me but two or three minutes later it hit me head on.  What was going on?</p><p>9:00am: Nausea comes on rather strong and forces me to the bathroom. By this time I was at a +++. My thoughs were: 'Oh shit!'  'Could I somehow weighed it wrong?' When I take 2ct7 oraly it always takes at least three hours for the first hint it's even gona do anything. If I'm triping this hard already, I don't know what I'm gona do in two more hours.</p><p>9:30am: No more nausea. Now at at ++++. I feel a somewhat unconfortable and a bit edgy. I smoke some good herb and it seems to help.</p><p>10:00am: The trip seems to have leveled off now. Feel much better and even have a smile on my face. Visuals are as always, as intense as they could get (on any drug). At this time I decide to go visit with some friends.</p><p>12:00pm: I seem to be coming down now.  It hit me so fast and is leaving the same way.</p><p>1:00pm: I'm now at a +. This was a bit dissapointing because every other high dose 2ct7 experience lasted at least 10 hours. There was a warm afterglow for the next few hours.</p><p>At first I thought it was the sleeping pills that were responsable for the fast onset but now I think that might be wrong.  I'm writing this report because a friend also had and experience like mine.  For him it was more like 20 minutes rather than an hour for me.  I asked him if he took any sleeping pills or other drugs prior and he said no.  Like my experience, the begining of his was also very nasty.</p><p>It really makes me think twice about the safety of this drug.  Most drugs work the same every time.  This one seems to work different.  My dosage had always been 75mg but the time prior to this one, 75mg barely gave any noticeable effects.  I've given people 30mg of the same stuff and had them tell me it was way too much.  For me anything lower than 60mg just makes me sleepy.  If anyone has had a similar experience please email me so we might be able to figure something out.</p><p>tos-</p><p>bornpagan_1@webtv.net</p>",
 "year": "2001",
 "id": "4995",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-05T08:00:00.000Z",
 "views": "10809",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "85 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 ]
}
