{
 "title": "The Trees Move Like Peacocks",
 "author": "Mushrooms",
 "citation": " Mushrooms. \"The Trees Move Like Peacocks: experience with Mushrooms (ID 49971)\". Erowid.org. May 7, 2007. erowid.org/exp/49971",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "report": "<p>Me and my friends have always talked about taking shrooms, but were never able to get out hands on them. We have experimented with many other drugs, but the closest thing I did to a halucinoenic before mushrooms was butane, which resulted in short 2 minute hallucinations.</p><p>One weekend my friend from queens came over, and we made it final that we had to try shrooms before he left. Our second day of trying to get them we were succesful and were joined by two of my friends from town. I took 1/8 an ounce, my friend M took 1/8, and my friend from queens L and other friend J split and 1/8. I ate the 1/8 by just popping the several caps and stems in my mouth, and grinding them in my mouth and swallowing chasing this with gulps of soda. My other friends ate theres after shoving all the peices onto donuts. I had no idea what to expect but I was ready for anything.</p><p>At this time we were outside of a dunkin donuts and heard that you should be indoors for your first time especially if it is nighttime. We got a friend of ours to pick us up and bring us to her house. We hung out there and it was about 30 minutes after we took the mushrooms and none of us were really feeling anything except me. I felt a little wierd and giggly. I stared at a totally normal lamp on her table and was laughing.</p><p>We decided that we needed a better environment, and after talking to a few more friends who were getting high and drinking got the girl to drive us to their house. This is when I had my first visuals. I heard that you get closed eye visuals first so I decided to try this out. I closed my eyes and at first I saw nothing, but gradualy clams started showing up and opening and closing. They were not too clear, more of images of light, but they resembled clams. As soon as I opened my eyes a car past us and the trail from its headlight seemed like it lasted forever. That was the last weird feeling I had until I stepped out of the car. My body no longer felt like it belonged to me. I felt my feet sinking into the ground as I walked up the kids driveway whos house we were going to.</p><p>We walked in and there was 3 kids there. They were all high and drunk, and were asking us all questions about how we felt, but it was really not a big deal and we told them we were all fine and that nothing was hapening. As I sat on the chair I started getting really happy and feeling like there could be no other place I wanted to be but that chair. I even started rubing my leg against the chair for it felt really nice. I was wearing silky silver pants that night, and now every time I looked at them it seemed like they were reflecting a spectrum of light. I could individually find every single color of the rainbow on my pants, and now to think about it on almost every object I looked at.</p><p>Now is when I started bugging out. It is about an hour and a half into the trip and I look at an arrangement of black and white paintings the kid had on his wall. Every time I looked away and back at them the painting completely changed. I remember specifically in one of them there was a perfectly normal goat, but as I looked closer I saw that its beard was growing as I looked at it. This freaked me out and I went into a laughing fit. I could not stop laughing for an hour at least and this set my friends off into laughing fits. The other kids around us that were not under the influence of shrooms started getting mad because I guess they werent haviung as much fun and could not relate to us. I had not a care in the world. The paintings were now moving, and their frames were constantly getting bigger and smaller. So far me and M were the most under the influence. He was getting a kick out of the fact that no matter how hard I tried I could not stop laughing and he was laughing at that. By this time I had a huge wad of tissues I had collected being held by one hand under my nose because I was laughing so hard my nose was running.</p><p>My other 2 friend J and L from queens were not getting as high just yet, for they each took only 1/16. I looked at L's face and he looked sad I guess because he was not experiencing what me and M were. This emotion made his face warp to my perception and it looked as if 'he got punched down' is what my friends said I kept saying. It was as if his chin was melting on one side of his face and the other was perfectly fine. By this time the host was getting upset that we were having such a good time, and were asking us every 5 minutes when we were leaving. I really did not want to leave because I freaking loved that seat. The only time i took to get up was to get more tissues for my laugh.</p><p>We tried to watch The 40 year old virgin, but that did not work out so well. All I remember from that is some lady who looked like a devilbird, and a hindu guy yelling 'nigger' at a black guy. We then got kicked out, and out of my anger for the hosts and people who were sleeping there that were kicking me out of my comfortable chair they started looking like zombies and I wanted to get out. As soon as we left I was sooo happy. I just wanted to run and jump  around. My energy level was amazing and so was that of my friends. Me and M decided to run down a hilly street and it was amazing. The street seemed much wider than usual, as if 5 cars could fit in it. When we ran back up the hill we met back up with L and J and for the first time they looked as high as us also jumping with joy.</p><p>We started running down the streets posed in funny positions looking somewhat like savages who do not know how to walk correctly. This was very funny to me and I was laughing the whole time. When we got the my street we started running at a faster pace and jumping up and down clapping our feet. The feeling was sensational. Nothing could get me upset.</p><p>We then entered the large park behind my house and went straight to the playground to sit in the hexagon on the BigToy that we usualy smoke our blunts in. As we sat down and started to look at the world around us alot of things were reallly out of the ordinary. The first thing I noticed was that the ends of trees were not normal, and were melting down and swaying alot more than usual. I still could not make out what they resembled. At this time I noticed that none of us could talk normally whatsoever. To form a full normal sentence was unkown to us. We spoke in bursts of words that would normally make no sense but at the time seemed like the only thing worth saying.</p><p>Me and M then slid down 2 slides next to eachother backwards so that everything seemed upside down. When we got to the bottom and layed there we saw a very intense vision. The branches of the trees seemed to be more like roots coming out of the clouds, which at the time looked like a pink fog. It looked very crazy because the roots kept changing and growing and it looked like we were at the top of everything. Now I finally noticed what the ends of the trees looked like and it was like peacock tail feathers. When I noticed this I could not help myself from saying the word peackocks. I was so joyed that I figured out what the trees were that I kept saying 'peackocks!!!!' and so did my friends. It was in the middle of the winter, and was very cold out and we came up with the statement that 'The trees move like peackocks that keep me warm'. This was our shelter against the cold. There was one more rememberable hallucination I had before me and L took the trip inside my house and M and J left, and that was of purple waterfall like forcefeilds coming out of the trees. At one point these came so close to me I crawled away thinking they would touch me.</p><p>Now it was time for all of us to go our seperate ways because the trees no longer helped us against the cold and it was getting towards 2 am. The walk to my house was very hard because I kept trying to tame my laughter which had not stopped much since the laugh attack I had at the kids house before. When we walked up to my front door I knew my parents were at least in their room in bed because the lights were off, but I was not sure if they were sleeping and did not want to test it by being loud. So while laughin I stated that we should be quiet and then stupidly added 'The key goes in the keyhole' to : and he replied 'Yes thats what it does' and I could not stop laughing. We quicklly rushed to my room and as I entered I went into shock.</p><p>I knew we left the room a mess when we left, but it seemed like there was piles of random stuff all over the place and that my wall had been half torn down. One thing caught my attention right away. On a small table I have in my room there were two plates that I knew we were eating dumplings from before. On them now was something that very closely resembled straight up animal guts. I stood there staring at it for about 10 minutes and asked L if he saw what I was seeing and he looked at it like he was about to puke so I assumed it was a yes.</p><p>I really had no idea what to do I did not want to put this in my sink. I should have thought whatever it was I didnt make it appear, but at the time I was scared my mom would be like 'what the fuck, whered you get animal guts from'. No matter how hard I tried to make myself envision something else all I saw was animal guts. I finally brought myself to bringing the two plates to my kitchen. To my surprise the sink was full, but not just up to the top, it was stacked 3 times higher then it could possibly go. I then went to put the plates down on the counter, but every time I got them close enoght to put them down something would majically appear, for example a bottle of honey. I finally set them down on the counter without looking.</p><p>As I came back into my room I finally had everything cleaned up, but was still peaking out on these shrooms. It was about 215 am and I felt as if the night could last forever and I did not want it to end. With the animal guts gone I regained my feeling of nothing being able to upset me. I got online, and loved talking to people even though nothing I said made any sense except to J who was also online, and my friend A who I talked to on the phone for about an hour of the trip. My friend J reccomended a song (Theivery Corporation - sexelevatormuzic) and I reccoment it to anyone doing any sort of hallucenojenic drugs. Me and L listened to it on loop for a good 3 hours. I also noticed that my desktop on the computer was ever changing in the way everything was setup and looked. This freaked me out because at first I thought L changed all my settings. Also my computer is right next to the window, and the blinds on the window looked like a big metal door always changing colors. Me and L also wrote a 'book' called 'super book' which was all of our memorable thought written down in notepad.</p><p>As I started coming down I felt really weird because I could finally think normally and say something to L normally. I layed down in my bed and laughed to myself thinking about what just hapened.</p><p>Overall it was a great experience and I very much do reccomend mushrooms to first time halluconajenic(probably mispelled that 5 diff ways this whole time) users. I also ate it on an empty stomach which was probably why I had the quickest and most intense effects.</p>",
 "year": "2005",
 "id": "49971",
 "gender": "Male",
 "timestamp": "2007-05-07T07:00:00.000Z",
 "views": "2706",
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
