{
 "title": "Ouch",
 "author": "Andrew",
 "citation": " Andrew. \"Ouch: experience with DXM & Diphenhydrinate (ID 49974)\". Erowid.org. Mar 23, 2008. erowid.org/exp/49974",
 "substance": "DXM & Diphenhydrinate",
 "bodyweight": "125 lb",
 "report": "<p>Yesterday was the fourth time this week. I ended up in the hospitol because of a minor dose of 7 15mlg tablets. After ingestion I had a fine hi until my tongue started getting really tongue tied. I left my friends house and trying to walk home was very hard! My left foot would always tuck in its toes and I would step on them, it hurt like hell. It took like 10 minutes just to cover one block! When I got home my head started turning in one direction, and it would bend my neck big time! It hurt so badly that I had 911 called.</p><p>After some questions I told them what I took, becuz they promised no trouble would come of this. Once I was placed in a room at the hospitol they shot me up with benedryl. I asked them how long it would take for it to take effect. They said now and I felt drowsy and somewhat trippy and more stoned. My neck finally after 2 hours of agonizing pain relaxed! What a relief! I was hallucinating a little from the combination of benedryl and dxm. Just colors and random shit every once in awhile would pop out. I felt great. I dosed off a few times and awoke to a docter who wanted me to drink 'charcoal' to bind the rest of the dxm and stop my body from absorbing it. It tasted like shit and was black. They drug tested me and found marijuana, but they didnt mind. They just wanted to make sure I wasnt trying to hurt myself, becaus I wasnt.</p><p>The next day(today) the symptoms returned, but I didnt go the hopsitol, I just layed in the car in a weird posisition to straighten my head, and finally the symptoms disappated after ingesting 4 tablets of benedryl. I took 2 at first and it wasnt quite enough so I took 2 more an hour later but so far everything seems fine! I think Im done with it for good because of this incident.</p>",
 "year": "2005",
 "id": "49974",
 "gender": "Male",
 "timestamp": "2008-03-23T07:00:00.000Z",
 "views": "19894",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "105 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "IV",
   "substance": "Diphenhydramine",
   "form": "(liquid)"
  },
  {
   "time": "",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ]
}
