{
 "title": "Serious Medicine or Poison?",
 "author": "Rakhee",
 "citation": " Rakhee. \"Serious Medicine or Poison?: experience with DOI (ID 49980)\". Erowid.org. May 10, 2006. erowid.org/exp/49980",
 "substance": "DOI",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "1 hit",
  "oral",
  "DOI",
  "(blotter / tab)"
 ],
 "report": "<p>This research chemical was acquired relatively cheaply, and saved until a special sunday. The story goes like this:</p><p>Saturday night: alarm set for 6 am sunday.</p><p>Sunday, 6 AM: consume blotter, return to sleep.</p><p>Sunday, 9 AM: awake. Very definite psychedaelia present. Much writing, thinking about cosmic foundation of reality stuff.</p><p>Sunday, 10 AM: Eat some yoghurt, drink orange juice. Not hungry, but yet hungry.</p><p>The drug has what feels to me to be a heavy body load. Is this the amphetamine push? Jaw clenchy, muscles tense and shakey. Joints feel swollen and painful. Ugh. The power of the drug keeps on coming.</p><p>Sunday, 11 AM: Housemates leave for scheduled stuff. Waiting is. Much thinking, and turmoil.</p><p>Sunday, 12 PM: Housemates return and start cooking asian food. I watch and try to communicate. Things are better.</p><p>Sunday, 1 PM: A good friend calls to say that her lover got arrested last night and thrown in prison, and she doesn't know where he is. Bad vibes. I can't do anything to help her. Synchronicity?</p><p>Sunday, 2 PM: Housemates get in stupid argument. I try to mediate. Can a heavily tripping man mediate two angry people? I guess so, because things work out in a while. Feel emotionally bruised. The sensitivity and ungrounded feeling the drug induces is not so helpful for some things. More synchronicity.</p><p>Sunday, 4 PM: Go walking with housemate in the woods. Much talking, much emotion. Much buried fears come out. Is it good? Is it bad? Will I die young from AIDS? Dirty things, fears are. We resolve to do our best and always be there for each other. I realize that my friend feels just as ungrounded emotionally while not on drugs as I feel on them. I feel like I can see the future, and I tell him he will become a zen master one day. Hmmmmm.</p><p>He is undergoing deep thinking about his relationships and facing hard decisions too. More synchronicity.</p><p>Sunday, 5 PM: Return home. Housemates leave for dinner out. Left to myself, face my dukkha. This is where things REALLY start to get crazy.</p><p>I feel borderline psychotic. I understand suffering. I feel the earth telling me her pain. I cry for the earth and the sky and the silly little men that strut about, pretending they are important and valuable because they can kill anything that disagrees with them. I cry for the native peoples of the world, and lost habitats, and most of all, for the suffering, aching, hungry soul of the conquerer--for he is most pathetic of all, slave to his own pride, fear, and ambition.</p><p>I feel myself taking on the burden of the oppressor. My heritage, as a white male, is that of the oppressor. And I feel all the silent, unappreciated suffering of those who chose to bear the 'white man's burden'--to forcibly 'civilize' everybody different, to sell them opium and alcohol and cigarettes and expensive clothes and pre-packaged bromides to make them weak and forget their own dreams and take up their places on our slave ship rushing ever faster towards the edge of the abyss. I feel the hunger and shame and sadness of it all. My heart bleeds.</p><p>I wrote:</p><p>'upon our shoulders</p><p>empires were built</p><p>upon our backs</p><p>our ambitions crumbled</p><p>upon the naked breast of our women and children</p><p>fell the harsh lash of our will</p><p>we are</p><p>men of the world'</p><p>And I wrote:</p><p>'Man the destroyer</p><p>the conquerer: Listen</p><p>Did you know?</p><p>They fear you, yes--</p><p>but more than that</p><p>they pity you.</p><p>Can you stand to know it?'</p><p>...At this point, I think it's fair to say that the trip was roaring along at a +4 (life-changing experience), but it got even stronger.</p><p>Recently, I have been facing a great many fears of mine in order to grow spiritually. This is a time of growth and change not only for me, but also for most of my friends (synchronicity). This all came to a head. I felt myself nailed to the cross alongside Jesus, suffering with him for all sentient beings. I experienced christ-love from His point of view. It was a wordless experience. After a moment to absorb that, the focus then shifted back to me.</p><p>I felt myself in the court of God's judgement, the eyes of all living beings focussed on me. This was it. No waiting for death, it was happening NOW! All my self was laid bare, and for a moment, I felt the sword of judgement hovering over me......and the verdict was pronounced.</p><p>YES!</p><p>God saw me through and through, for all that I was, and his judgement was Yes.</p><p>Then he told me why.</p><p>He 'said' (actually, it just came into my mind), that No Being is Complete in Itself. This kind of 'Perfection' is something that only God, who makes up all things, can be. My imperfections and illusions were part of me, and he loved those too. This is what is meant by Divine Grace. By knowing my imperfection and weakness, loving truth above all lies, and seeking God's judgement in spite of my fear, I had allowed God's light to shine from my soul.</p><p>Basically, God said that any who know their incompleteness and still seek to approach him are worthy. This act of faith in God's mercy is what saves us. God also implied that the terrible, fearful, damning aspect of his judgement is what is percieved by those who flee from it and take refuge in lies and self-deception. In this way, his light of judgement is the light of discernment. Like buddhist guardian deities, it appears terrifying to those who hate or fear the truth, but manifests as love and acceptance to those who can love it. Heaven and hell are not two different places, they are two different attitudes towards the same unstoppable force of God energy.</p><p>I do not call myself christian, but lately I find myself using these words because they seem to work well for the concepts involved. In any case, I never experienced anything like this before. If I was christian, I would say that I have been born again. 5+ ? Other insights followed, in rapid fire fashion. I feel initiated into the mystery of the shaman's world, the world of true adulthood. Oh, my god.</p><p>Sunday, 7 PM. My housemates return. Much talking. They bring delicious pecan pie. I drink more orange juice and eat bananas.</p><p>Sunday, 10 PM. Call friends, assemble notes. More talking. Fractals, nature of reality, Free Will as true manifestation of consciousness, and thus of God. Nature of the fall, and dualism. Possible origins of the Fall: We are all still eating the fruit of the knowledge of good and evil. We ate it to understand God and get closer to Him. As we continue to choose Good over Evil, we become more Free, and as Free Will is God's manifestation in us, we bring more God into ourselves. Thus, we understand God by bringing Him into us through Will and Love. God allowed us to fall because it would bring us closer to Him, through all our suffering. In the end, we would be with God because it was our choice.</p><p>Monday, 2 AM. Can't sleep. Body hurts. Fucking drug. CEV's don't stop moving. Feel paranoid, hearing every noise, footstep, creaking of boards in the appartment. Images of SWAT teams and thuggish cops trashing my home, arresting me, and beating me up. Drug use is thoughtcrime. And sadly, it could happen. But try not to think that while tripping.</p><p>Monday, 4 AM. Get off the phone with friend.</p><p>Monday, 6 AM. Housemate leaves for work. Ugh.</p><p>I fall asleep briefly.</p><p>Monday, 10 AM. I wake up. I feel tired. Very, very tired. Psychedaelia seems over. Hmmm....I'll have to think about all the crazy stuff that happened.</p><p>Monday, Tuesday, etc.  I wonder, was it all real? What did it all mean? I am tired, worn out, and still in my suffering. There is no magic pill to make the pain and boredom go away. I will choose to believe that this was a real peak experience, and like all peak experiences, is like an iceberg. The greatest part of enlightenment is the work that goes into actually implementing the dream, walking the path that we saw briefly. I promise to myself, to keep my chin up, and keep walking my path, with heart.</p>",
 "year": "2006",
 "id": "49980",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-10T07:00:00.000Z",
 "views": "17971",
 "dose": {}
}
