{
 "title": "Mini Mushroom Trip",
 "author": "DirtyDavis",
 "citation": " DirtyDavis. \"Mini Mushroom Trip: experience with Salvia divinorum (20x extract) (ID 49984)\". Erowid.org. May 2, 2008. erowid.org/exp/49984",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "140 lb",
 "report": "<p>I am a somewhat experienced user. I've toyed around with mushrooms, DXM, opium, morning glory, and of course mj. About a year and a half ago I heard about Salvia and began researching. I decided to try the regular leaf one day and experienced little results; colors were slightly brighter, and pressure behind my eyes barely distorted images. The harsh smoke burned from a piece. So I tried it a week later from a bong and got the same results plus a little headache. In each case I'd have to smoke at least 2 bowls to notice an effect. The effects weren't worth it so stopped trying.</p><p>A week ago I began to hear more stories from Saliva extract. I researched the drug again and convinced myself to give it one more shot. So last week I went to a local HeadShop and asked for the strongest extract they had. To my surprise they had up to 30x. I wanted to buy it but only had enough $$ for a gram of 20x.</p><p>Earlier today I had the perfect chance to give it one last try, expecting little to no results again. From what I read one hit was sufficient from 20x Salvia. So I went to my garage and packed up a small one-hitter to start experimenting. I lit it up and took one monsterous hit holding in for as long as I could. The smoke was harsh but bareable. Within 15 seconds I could already feel the effects coming on strong. My vision began to blur and my head felt like it was floating. I exhaled right then scared of what was to come. I was not prepared at all.</p><p>The onset is very rapid. 45 seconds in I was tripping hard. I had peaked to almost that of a very nice mushroom trip in under a minute. Although an experienced shroomer this was very scary to me. My body didn't have time to gradually adjust to the distortions like with other hallucinagins. It's a lot for my brain to comprehend at once.</p><p>I decided it would be safest if I went back to my room. I've learned that with any hallucinagin I need a 'safe zone' where I'm firmiliar with your surroundings and can get a grasp on reality. So I walked up hill on a balance beem through skinny hallways to my room. My own house seemed foreign to me. The wall colors switched with the carpet colors and I became extremely confused. When I finally made it to my room it seemed much smaller. Walls shrunk in and I couldn't stop my vision from vertically pulsing. I sat down on my bed an immidiately leaned to the side. It felt like my whole house was now on a steep tilt. The flowers on my oriental carpet, which are amazing when tripping on shrooms, turned into dots and were imprinted on everything I looked at.</p><p>The visuals were too intense so I closed my eyes to find that my mind was just as tweaked. I couldn't remember anything I had to do that day, or anything I did earlier. Did I have plans? Was there anyone else home? What is going on? My mind kept racing in circles. The only thing that kept me sane was knowing that it wouldn't last more than 20 min. I rode out the trip laying back on my bed, unable to get comfortable. As the effects diminished and I returned to reality, I looked at the clock. It had been just over a 1/2 hr, but it seemed like only 5 minutes had past. Time flew by. All the effects were gone after 45 min or so.</p><p>I am now convinced of Salvia's  power. I will most likely try this again, possibly 2 hits this time now that I know it's full effects.</p>",
 "year": "2006",
 "id": "49984",
 "gender": "Male",
 "timestamp": "2008-05-02T07:00:00.000Z",
 "views": "1948",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
