{
 "title": "A Vivid Imagination Helps",
 "author": "Gamemaster",
 "citation": " Gamemaster. \"A Vivid Imagination Helps: experience with Chamomile & Various (ID 49985)\". Erowid.org. Jun 21, 2007. erowid.org/exp/49985",
 "substance": "Chamomile & Various",
 "bodyweight": "73 kg",
 "report": "<p>This experience report is not gonna be long. I simply want to explain a somewhat weird experience I had last night, after having consumed two cups of herbal 'goodnight tea'.</p><p>ingredients in each teabag:</p><p>camomile (33%), spearmint, blueberry leaves, orange blossoms, lime flowers, lemon grass, passionflower leaves (2%), rosebuds, rose hips.</p><p>It was midnight, and I consumed two cups, meaning a total of two teabags, in about 20 minutes. Shortly, after about 15 minutes, I started to feel drowsy and sleepy. It was like I felt different. In a slightly different state. Like an ULTRA mild high. Thoughts flowed a bit more easily, and I almost felt like I was experiencing a mild onset of a shroom trip. I suddenly realised that I had been watching a boring TV show about DNA for the last 15 minutes.</p><p>After this (about 1 AM), I went to bed. As I was falling asleep, I suddenly felt a tingling feeling in my body, as I was drifting away, half awake, half asleep. This feeling got so strong that I had to wake up and have a sip of water before I returned to sleep.</p><p>This time I fell asleep very quickly, and I had a very intense dream. It was neither a good nor bad dream, but it was very vivid. However, I did not become lucid in the dream.</p><p>My conclusion is that this experience may merely have been a product of my imagination, but it also may have been an actual effect.</p><p>Note: I have in general a very vivid imagination.</p>",
 "year": "2006",
 "id": "49985",
 "gender": "Male",
 "timestamp": "2007-06-21T07:00:00.000Z",
 "views": "23960",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Chamomile",
   "form": "(tea)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Various",
   "form": "(tea)"
  }
 ]
}
