{
 "id": 5,
 "title": "Slow Down",
 "date": {
  "submission": "2005-07-12T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "eerie_mystikal",
  "gender": "Male",
  "weight": "225 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tsp",
   "administration": "oral",
   "substance": "Wormwood",
   "form": "(tea)"
  },
  {
   "time": "0:00",
   "amount": "1 tsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(tea)"
  },
  {
   "time": "0:35",
   "amount": "270 mg",
   "administration": "smoked",
   "substance": "Kava",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "About three days ago I had purchased a 200 gram back of wormwood, with the hopes of brewing some absinthe. At the same time, I also purchased 60 kava soft-gel tablets with 30% kava lactones. The following day, I woke up at 10:30 and felt a strong desire to test the wormwood by making a tea. I don't know why, but that's just the way I felt. So at 10:15, I opened a bag of mint tea and added 2 tsp of wormwood, and 1 tsp of nutmeg for flavour. I then boiled this in a kettle containing ~2 cups of water for 15-20 minutes. After this I allowed the tea to steep for an additional 10 minutes. During this time, I emptied out 6-150 mg capsules of Kava at 30% kavalactones, which gave me roughly 270 mg of kavalactones. This gunk was then placed between 2 pieces of wax paper and put into the freezer. By then, my tea was ready so I poured it into the glass I had ready. I started drinking it at about 10:45, and slowly sipped it until 11:20.",
  "The tea was slightly bitter, but I added some honey, which went lovely with the mint and nutmeg. All in all, not too bad. Half way through drinking the tea, I started to feel slightly sedated, and found laying down on my couch extremely comfortable. By the time I was done, I was fully relaxed and didn't have a care in the world. Then I remembered the kava in the fridge, so I gathered all of my will power and got up, then walked to the freezer. After taking out the gunk, I couldn't decide how to take it, but then an excellent idea hit me. I went downstairs (which took quite long because I was moving incredibly slow) and grabbed my hookah and Lebanese molasses tobacco, which one of my Lebanese friends had given to me for my birthday. I mixed the kava and tobacco together in the large bowl, filled the hookah with water, and lit up a special coal that burns on top.",
  "I prefer doing any smoking this way (definitely hashish) because the coal on top acts like a vaporiser would, and the water cools the smoke. The kava had an interesting flavor, which strongly overpowered the apple flavoured tobacco. It was very natural and earthy tasting, which is the only way I can describe it. Well, if I was really mellow before, then after a half hour of smoking, I was almost in a haze. Everything I did was drastically slowed down, and I felt lazy, relaxed, yet not too tired. I would have these funny ideas pop into my head and giggle over them for some time. Anything involving concentration lost my interest, and I would go through periods of absolutely no thought, to vivid ideas and clear thought. This lasted about 1   2 hours and was then followed by the best sleep I ever had, with lucid dreams and virtually no interruptions. I found this to be very pleasant and will definitely try it again sometime."
 ],
 "erowid": {
  "id": "10001",
  "citation": " eerie_mystikal. \"Slow Down: experience with Wormwood, Nutmeg & Kava (ID 10001)\". Erowid.org. Jul 12, 2005. erowid.org/exp/10001",
  "substance": "Wormwood, Nutmeg & Kava",
  "views": "27223"
 }
}
