{
 "title": "Altering the Dream State",
 "author": "Raedon",
 "citation": " Raedon. \"Altering the Dream State: experience with Mirtazapine (Remeron) (ID 50027)\". Erowid.org. Jun 11, 2006. erowid.org/exp/50027",
 "substance": "Mirtazapine (Remeron)",
 "bodyweight": "180 lb",
 "report": [
  "<p>To start a little about myself is in order.  I am quite bi-polar and have discounted every SSRI as complete trash for my depression.  In fact, in 1989 I tried to kill myself after 4 months on Prozac.  Not that I wanted to die, I just didn't care to live.",
  "This last year in 2005 I was prescribed Mirtazapine and it has changed my life.  I'm not depressed though I can still have that emotion like when my dog died. In my opinion, a Bi-polar person can understand depression on a level beyond depression and I tell people it's like the non-smoker trying to understand why it is hard to quit. This isn't about depression though. Mirtazapine has some interesting side effects.",
  "The second night I took it I went from being in bed to rupturing the plane between awake and full on lucid dream completely conscious.  My ears were ringing like a DMT trip for about 30 seconds and BAM I was lucid and creating a dreamscape as I flew out my window in euphoria.",
  "This only happened the first few nights but I could stop taking the Mirtazapine for a week and get the same results (though I fell back into my bi-polar depression at the same time.)",
  "I don't know what it is but Mirtazapine has also changed the nature of my dreams on a nightly basis. As a depressed man I often had dreams of horrible things. My dead father would torment me.  Kids I knew in High School would chase me threw nightmares filled with wrecked cars and tornadoes, drug busts for giant mushrooms and women laughing.  Every dream I remembered had some element of nightmare to it.  Now my dreams are of me being the 'movie star' of sorts. Women hated me in dreams for 20 years but now I regularly have sexual dreams where I fulfill several women who come back for more.</p>"
 ],
 "year": "2005",
 "id": "50027",
 "gender": "Male",
 "views": "17505",
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Mirtazapine",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2006-06-11T07:00:00.000Z"
}
