{
 "title": "From Anxious/Crazy to Mellow/Sated",
 "author": "Naka",
 "citation": " Naka. \"From Anxious/Crazy to Mellow/Sated: experience with MDMA (Ecstasy) (ID 50037)\". Erowid.org. Oct 15, 2007. erowid.org/exp/50037",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "130 lb",
 "header": [
  "DOSE: T+ 0:00",
  "0.5 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 1:15",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 2:15",
  "0.5 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>My boyfriend came home from the club at around 1AM with ten green pills. I had previously expressed interest in wanting to try X for the first time. I was convinced that x was going to be similar to an acid 'trip' but with more euphoria or something. I couldn't have been more wrong.</p><p>I am 30 years old and have BiPolar II disorder. I have been on and off ssri drugs for seven years. I have always been an intense, fearful, anxiety-ridden, nutjob with major self-esteem issues. I've spent my whole life working through this.</p><p>1:15 AM: When I took the first dose, it was a half of a pill out of fear of the unknown. My BF took a whole one and suggested we go lie down in bed for awhile.</p><p>1:25 AM: I started to become aware of the fact that I was feeling very calm and mellow- not intoxicated at all. This was pleasant, but instead of becoming exitable or manic, I was for once, satisfied to just shut up and enjoy.</p><p>2 AM: After awhile of talking about theoretical physics and just sort of bonding, we began to crave music. I got out my iPod and went thru my mp3s but nothing seemed fitting.  I have a lot of EBM and industrial on there. Eventually, I just gave up and let my BF put on some of his music. Trance. Not the kind of stuff I'm usually into but in this case, it was really just nice. I am usually a music Nazi who takes control of the playlist for the night but I was feeling very pliable and agreeable and quiet. I wanted to *listen* for once. I wanted to open up and receive instead of control or get stressed out about details.</p><p>2:30 AM: I began to crave more 'feeling' and since I was sure 1/2 a dose was too weak by now, I felt ready to take a whole one now. The BF also took another whole and a half. I began to feel very much like my BF and I were connected without my having to run my mouth or influence the bonding experience whatsoever. I was pleased to just be quiet and watch and listen. I felt that he could leave the house and walk down the street and we would still be in the same room somehow. I felt very secure and loved and had no need to question or doubt this. At this point I felt free to tune out and listen to my headphone while he did the same. Just being in the same room with him was enough and I didn't feel obligated to be 'entertaining' or to attract attention to myself at all.</p><p>3:30 AM I took the other half of his pill and he took another whole. I wanted to keep the feeling going. We decided to lie back in bed and talk for awhile. We made love and it was very slow and just lovely. I had the sensation of being almost virginal in my openess to accept the experience without the intense rush to achieve orgasm. It just felt nice to feel him inside of me. I began to truly comprehend the concept of sex being a vehicle for expression of love.</p><p>We came together. It was as if we'd made the decision to do so and then just executed that plan simply and purely. It was beautiful and extremely pleasurable without being lustful or too intense. Afterwards, we lie in bed for what felt like hours, just holding each other and kissing. This was an unusual sort of post-coital cuddling, in that I didn't feel the typical desire to have my own greedy need for affection sated, rather, I wanted only to make *him* feel good.</p><p>5:00 AM: I was ready to fall asleep. I drifted off to the sound of my BF speaking to me in a soft voice. My BF said that these were a little on the weak side and that my next roll would probably be better.</p><p>AFTERWARD: The next day, I felt refreshed spiritually and emotionally. I felt as though burdens had been lifted from me and I could see and respond to things clearly and calmly. This continued over the course of the two days after the roll. I felt as though I had been lifted into the state of euphoria and was being gently placed back down onto my feet. There was no big 'crash' per se. just a feeling of going back to normal and a mild disappointment at that fact. I should note here that I still take prescribed SSRI drugs daily for depression.</p><p>The experience was pleasant and not harsh at all the way an acid trip is. There's just no comparison. I feel that the experience was truly therapeutic in a way that is permanent and indescribable. I *finally* comprehend what it means to 'mellow out,' and I now feel capable of doing so in 'the real world' when I start to become frustrated, anxious or manic. I have been able to apply this newfound comprehension on a few occasions already in my real life.</p>",
 "year": "2006",
 "id": "50037",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-10-15T07:00:00.000Z",
 "views": "4742",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 1:15",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 2:15",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
