{
 "title": "Anti-Sickness Hell",
 "author": "Anonymous",
 "citation": " Anonymous. \"Anti-Sickness Hell: experience with Cyclizine (ID 50040)\". Erowid.org. Jun 19, 2007. erowid.org/exp/50040",
 "substance": "Cyclizine",
 "bodyweight": "8 kg",
 "report": "<p>I was recently rushed to hospital with suspected Meningitis.  I had a viral infection with all the same symptoms so they kept me in for a few days under obs. Im 22, eat healthily, dont drink smoke or do drugs, and generally Im really fit and strong I go gym regularly, and to be this ill was very concerning for the doctors. </p><p>Anyway, after a few days on a drip my temperature returned to normal and they said providing I could walk around ok, and not vomit I cold go home.  The doctor came round with my pain relief and although I was desperate to get out of there I had begun to feel sick and didn't want to swallow the tablets incase I was, my mum said she'd ask them to give me an anti-sickness jab first, so I'd keep my pain relief down and could then go home.  The fluids had been disconnected but the canular tube was still in my arm so they flushed it through with a saline solution then syringed in the Cyclizine.</p><p>Instantly my whole body stiffened, the pain that ran up my arm ways excruciating and I couldnt breathe.  I could see the fear on my mums face as she screamed for the doctor to come back. I was trying to say that I thought there must've been a mistake and I'd been given the wrong drug, there's no way this could be the same anti-sickness drug administered to me the day before surely? My heart rate went from 72bpm to 145bpm in just a few seconds, I was aware of the doctors around me but the funky pattern on the curtain was swirling in and out like looking through a kaleidoscope and my jaw was unbelievably clenching like I'd done cocaine!</p><p>Every time I tried to speak I sounded like I had Cerebral Palsy, slurred and incoherent.  What the hell was happening to me, I was so scared, my body felt weighed down like lead and I couldn't control anything.  Hearing myself talk like that and my weird vision and my heart feeling like it was gonna rip through my chest was absolutely horrifying.  I was trying not to cry because I couldnt breathe as it was! I could hear the doctor saying, 'It's ok, just try not to panic, concentrate on taking deep breaths' whilst hooking me into the heart monitor and putting more fluids into my arm.</p><p>My eyes were rolling backwards and I felt like this is it, this is what dying actually feels like! I wanted to close my eyes but it took every bit of strength I possess to keep awake.  I honestly believe if I'd let my eyes shut, I'd never have opened them again.  Eventually my heart rate resumed to normal and I could breathe.  The experience frightened me more than anything in my whole life and I'd never take another anti-sickness drug again if my life depended on it. </p><p>Apparently two doctors checked I'd been given the correct drug and dose, and yet I had the same the day before and was fine.  They told me it's just one of those unexplainable medical mysteries, but I'm not satisfied with that.  It's two days since the bad reaction to Cyclizine, and I'm home now and still feel weird. Every time I try to sleep I quickly open my eyes suddenly remembering the feeling of the room spinning and the strange kaleidoscope vision. I still have a headache and feel sick, I'm shaky and weak and worried because this is so not me!! Maybe it is physiological but that drug messed me up in a big way and I just wanna feel normal and well again!</p>",
 "year": "2006",
 "id": "50040",
 "gender": "Female",
 "timestamp": "2007-06-19T07:00:00.000Z",
 "views": "9682",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "IV",
   "substance": "Pharms - Cyclizine",
   "form": "(liquid)"
  }
 ]
}
