{
 "id": 5006,
 "title": "The Real Reason It's Illegal",
 "date": {
  "submission": "2000-10-03T07:00:00.000Z",
  "experience": "1997"
 },
 "author": {
  "name": "Bear",
  "gender": "Male",
  "weight": "110 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 ml",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>Well, Here's the background...",
  "I was a low-paid cook and was interested in really cheap ways to get interestingly loaded on the cheap, and be able to buy from my local Chef's Warehouse. Ultra clean nitrous... ... and 70% alcohol by volume (140 proof) bottles of Chartreuse concentrate for 2/3 the price of the watered down stuff. Real Chartreuse too. And all tax deductible in the name of recipe 'experimentation'. ",
  "Anyway, I was at the local folk market in Glebe (Sydney, Australia) where I was cooking at a nearby cybercafe.",
  "...Anyway, there's a stand selling 'legal highs'. Mostly they're crap (do your research before you spend money... Erowid rules!). One of the items on offer is organic wormwood. $7 Australian a bag... can't remember the weight but it was far more than I needed to make one batch of the supposedly sinful slippery green 'sinthe.",
  " I was spurred to do this by reading a book called 'Bigger Secrets' by William Poundstone. In it he reveals the most likely recipe for the famous 'Oysters Rockefeller' (apologies to the purists). One of the ingredients when the recipe was first developed in 1899 by Jules Alciatore, of Antoine's in New Orleans was Absinthe.",
  "Turns out that Absinthe has been known in New Orleans since 1916 for causing 'Shocking Behaviour'. Posession of Absinthe in a commercial establishment risks serious fines and license investigations. Specifically, it was the wormwood in absinthe that was outlawed, as it was held to be the 'effective ingredient'.",
  "A replacement, called Herbsaint, was soon developed that met the laws by having a similar taste and quality but omitting the illegal wormwood. This has been what Antoine's has used in place of Absinthe in their green oysters since 1916... and believe me, they're fussy....",
  "So if you buy Absinthe in New Orleans, be prepared to be served Herbsaint. Any bar owner/manager who actually had absinthe on the premises would not serve it to just anyone off the street...",
  "Anyway, I researched a recipe for absinthe using wormwood (not easy without the internet... potentially humanity's greatest learning and unifying tool... it's NOT just a marketing tool!).",
  "I steeped about 2-3 tablespoons of wormwood root chips in a 375 ml bottle of Gin in a cool, dark place for about 2 months. The big day came and I strained the evil-smelling brew with fine cheesecloth. The smell was indescribable. No, I mean it, I'm not going to even try.",
  "There was only one thing to do. I waited for the next full moon and lit some massive beeswax candles for atmosphere in my cramped garret room in inner-city Redfern.",
  "The moment arrived. I plonked a couple of caster sugar cubes in a tea strainer over a chilled, thick-walled 150 ml lowball tumbler. I gently inverted 50ml of the 'sinthe and 100ml of chilled spring water with a generous handful of solid, diamond-clear fist-sized ice cubes in a shaker, then slowly poured the decoction through the glistening cubes. They melted resonably well, though not so well as I had thought.",
  "I lifted the glass and eyed the still-clear fluid. Oh well, I never really took to Ouzo either. Na Zdrowie.",
  "The shot went down smooth and I kept my pharynx closed just in case. Then as I began to breathe 5 or 10 seconds later the taste hit.",
  "It was the bitterest thing I have EVER tasted. I mean it took a physical effort to choke down even the smallest amount, it was that foul. I could have drunk autopsy runoff with less effort. Hell, for an alcoholic, would be to be trapped for eternity with a million bottles of direct-extract absinthe... full of alcohol but tasting like the bitterest beer times one thousand... undrinkable.",
  "I soldiered through a total of 200mls, diluted as above. I felt drunk and a little buzzy, but no psychoactive acivity. The convulsive heaving as my autonomous reflexes fought my every conscious effort to drink it was interesting... absinthe's 'Shocking Behaviour' is most likely hair-trigger vomit reflexes. I mean it. My experiment with absinthe was one of only two times in my whole life I've ever thrown away alcohol. I mean, I even kept and consumed the 'Green Death', a jelly I made with the aforementioned 140 proof Chartreuse concentrate and lime jelly crystals (tip for would be alcoholic jelly makers: use double the crystals but the same amount of boiling water, wait till cooler than body temperature, add about half again as much of the 70% alcohol concentrate. Cool as quickly as possible without freezing.) And the Green Death was like a divine curse on the mortal foolish enough to try to tame it. Ick.",
  "But absinthe? You can keep it. For pure indulgence, try sucking on a phat bud that's been cooked gently in isopropyl alcohol 70%, butter and maple syrup for 15 mins in a pressure cooker. Not much active ingredient but wow, what a taste.",
  " But that's a story for another time. I'd like to close by saying that plant psychoactives are not evil, unlike those that seek to perpetuate political power by cracking down on nature's most beneficial plants. They are the real evil.",
  "Bear",
  "Formerly of Sydney, Australia",
  "Chef- Raconteur- Radical</p>"
 ],
 "erowid": {
  "id": "3097",
  "citation": " Bear. \"The Real Reason It's Illegal: experience with Absinthe (ID 3097)\". Erowid.org. Oct 3, 2000. erowid.org/exp/3097",
  "substance": "Absinthe",
  "views": "65582"
 }
}
