{
 "title": "Responsible use of Ecstasy",
 "author": "Bront",
 "citation": " Bront. \"Responsible use of Ecstasy: experience with Ecstasy & Fluoxetine (ID 5011)\". Erowid.org. Feb 6, 2001. erowid.org/exp/5011",
 "substance": "Ecstasy & Fluoxetine",
 "bodyweight": "105 kg",
 "header": [
  "DOSE: T+ 0:00",
  " tablets",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 4:00",
  "30 mg",
  "oral",
  "Pharms - Fluoxetine",
  "(pill / tablet)"
 ],
 "report": "<p>I really cant understand some of the other reports, knowing as I do the neuropharmacology of MDMA fairly well. Our serotonin (5-HT) cells do contain a finite amount of the substance and (unlike dopamine) the cells are fairly slow to regenerate the substance. Therefore munching 20 pills in a session (as I have known some people do) simply cannot continue to give you the 'E-rush' as this is from serotonin.  Sure you will get some feeling, but this is a dopamine effect.  Why not take something else?</p><p>Similarly people who claim that they can take pills every day for days on end and never lose effect are (merrily indeed!) most likely deluding themselves.  The human body has incredibly effective control mechanisms to bring everything back toward 'the norm'. It DOESN'T LIKE being too happy! Even if we had limitless supplies of serotonin to dump into our synapses the receptor cells would rapidly downnumber (spontaneously decrease to give reduced effect). </p><p>I say all this because E is an incredible psychoactive drug, and I feel has so much to give to mankind. I worry that people who are misinformed or simply unaware of its limitations will trat it without the respect it undoubtably needs.  This in turn leads to the tragic cases of death, the grim tales of which are so beloved of our Political masters and the blinkered media.</p><p>About my experiences; ceratinly they have changed over time, but I often feel this is very much due to the batch I am using.  Although I test them crudely for +ve MDMA, I'm sure a lot of the pills I have had recently have been cut, as I have had some mild hallucinations and weak 'ups'.</p><p>Hangovers have never been a problem for me nor my partner. We generally take 2-4 pills in a night in 1/2 pill increments.  The next day we generally get up fairly early, and still feel very empathic and cheery. Certainly we feel a bit woozy, and major league chores tend to be put aside in favour of long walks, music or kite flying, but that is the mood we're in!  Even the days after tend to be OK, even in my job which is seriously high intensity.  Occasionally my temper has been a bit short on the past six months, but this does not seem related to taking a pill and I hope & suspect it is due to a crap 6 months @ work. We shall see.</p><p>Also we take 20-40mg of fluoxetine (Prozac) 4 hours after our first pill.  Whilst it doesn't seem to have a noticable effect on come-down (especially as we dont really get one), I am convinced of it's neuroprotective effects (along with lots of Ribena & 1000u Vit.E).</p><p>I really do feel that E is a force for good in this increasingly black world, but it is up to all of us who use it to do so responsibly and in doing so rob the bastards who survive on the tobacco-alcohol monopoly of the hammer with which to beat us. Also we can all have some truly amazing times while everyone else is stuck on Planet Earth!!</p>",
 "year": "2001",
 "id": "5011",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-02-06T08:00:00.000Z",
 "views": "9084",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 4:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(pill / tablet)"
  }
 }
}
