{
 "id": 5020,
 "title": "Laced Marijuana?",
 "date": {
  "submission": "2000-10-29T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dude",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I got a 20 bag from this guy I didn't know.  The next day my friend and I, who have been smoking pot for years, decided to get high.  I didn't have a lot of pot left, so I made a gravity bong and I gravitied a bowl the size of the end of my pinkie, and he did about the same, a little less.  It turns out about 15 minuts later we walked up to the store, and I felt way different.  It wasn't like a weed high, it was way more intense.  I felt so high.  We sat down and my mind felt like I was totally disconnected from reality.  Everything was so bright and fake.  I went inside to get away from everyone and I sat down.  I heard someone whistling and it was like my hearing was superhuman.  I just concentrated on this guy whistling.  Every sound echoed in my ear and stood out.  I laid my head down and closed my eyes.  I could see these patterns moving in my head.  I went to the bathroom and my eyes were dilated and I kept hearing these strange echoes.  I tapped my foot on the ground and it felt like I was connected with the ground. ",
  "For the next 3 hours I was going up and peaking.  I was getting higher and higher.  I heard thunder that wasn't there, I thought people were following me.  The only thing comforting to me was to be by myself.  I heard voices that weren't there, it sounded like they were mumbling.  I went home and went to bed at 10:00, 5 hours after smoking it, I was still high, but not like before.  I woke up the next morning and felt weird, like something was still in me.  Also, I woke up at 8am and had massive energy.  I heard a knock at the door and it was my friend, but when I first saw him I said whoa shit, cause he looked all weird and his face was small.  I am convinced the weed was laced with pcp and my advice is, if you think it is, just get away from everybody and be alone with nature and you'll be fine."
 ],
 "erowid": {
  "id": "3102",
  "citation": " Dude. \"Laced Marijuana?: experience with Cannabis (ID 3102)\". Erowid.org. Oct 29, 2000. erowid.org/exp/3102",
  "substance": "Cannabis",
  "views": "17305"
 }
}
