{
 "title": "LSD Is Everything I've Heard It Is",
 "author": "BuddhaIsaG",
 "citation": " BuddhaIsaG. \"LSD Is Everything I've Heard It Is: experience with LSD (ID 50271)\". Erowid.org. Mar 15, 2006. erowid.org/exp/50271",
 "substance": "LSD",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "oral",
  "LSD"
 ],
 "report": "<p>I had been trying to get LSD for a very long time where I live. Even though its a college town, its hard to find acid. I've done mushrooms many times, roughly 20. I've taken 2c-i twice, as well as 2c-e. The trip I am reporting about is my third LSD experience. My first being 5 or 6 days prior to my third. I love psychedelics, so I had to buy as much acid as I could, WHILE I could.</p><p>I watched my friend drop the LSD onto 2 sugar cubes. 1 hit on each cube. I ate the acid 2 days later, around 2pm. 30-45 minutes after taking the acid, I had a wonderful body high. My face was somewhat numb which was awesome. My body felt very strange. Similar to mushrooms, but different. The first visual change was color getting very bright along with tracers. I would look at my friends face and it would melt right in front me of. Now when I say melt, it was like his face was liquid and it was moving around. I was watching TV, and I remember something popping out like it was in 3D. We went over to my friend B's girlfriends house. I had never met her or been to her house, so it was strange when I got there. Her room was in the basement of her parents house, but we go in through the back, the ceiling was about 7 ft, if even that. I walk in and look up, I couldnt tell if the ceiling was really that low, or if it was just me tripping, so I reach up and touch it to make sure. The walls of her room are pink, which made everything else sort of pink. By this time everything im looking at is melting and im just sitting in this chair laughing my ass off because its so fucking crazy and weird.</p><p>My friend A let me use his iPod. He put it on some crazy trance/house music, and I just went outside, and sat down turned up the volume all the way, and looked at all these trees and shit in her back yard. I was looking at the trees and I could see the branches growing and moving, like the tree had a mind of its own and it was trying to grab something. I couldnt stop looking at the iPod screen. The letters in the words would grow and shrink and the spaces between the letters and the words would expand and shrink. I was so amazed by this. I saw kaleidescope patterns almost everywhere. Evrything was surrounded by a rainbow colored aura. It was pretty much like a prism. I felt completely out of reality. Never once was I scared, I didnt have a bad trip. I was having so much fun trying to comprehend my visual field. That, and the weird body high that I had was fucking amazing. I ended up driving my car even though I was tripping. My friend A is a pretty hefty guy. Bout 250 maybe im not sure. Anyway, he was in the passenger seat,and as I was driving, I could FEEL his body weight. I could feel the car leaning to the right side, like it was sinking. I melted through my seatbelt a couple of times. It felt like I wasnt even in the car a lot of the time.</p><p>LSD is an amazing substance. Its very strong and very intense. Psychedelics are something I will never stop doing. Psilocybin and LSD have changed my life in a wonderful way.</p>",
 "year": "2006",
 "id": "50271",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-03-15T08:00:00.000Z",
 "views": "4119",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD"
  }
 }
}
