{
 "id": 5027,
 "title": "Pleasantly Empty of Fear",
 "date": {
  "submission": "2013-07-15T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "sunyata",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Cannabis - Hash",
   "form": ""
  },
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "DMT",
   "form": ""
  }
 ],
 "report": [
  "Noticed that a question of wether or not dmt and mdma mix well went unanswered,and since I've tried it...... Yes,they do mix. I am not too experienced with either of the substances but I've had my share of other psychedelics.",
  "On newyearseve 2003/4 I was at a friends house(good vibe,lots of people on different substances,primarily ecstasy and/or alcohol) where I ate two pills of ecstasy at around 20.00.The onset was relaxing even though I'm not normally comfortable about being around a lot of people,but I had made prior arrangements to smoke DMT with my friend and was succeeding in my attempt to be at peace with my surroundings.I'm not really sure when I smoked the DMT,but anyway......",
  "My friend held the lighter while I inhaled and removed the pipe when I was done.I don't really remember too much of what happened directly after that, except a colourful 'image' I can't really describe,an electronical sound(blib-blip),and being surrounded by some energyfield that felt liquid. When I 'awoke' to reality again I made a baby-like sound that I could see entering my friends head,who started laughing,thus sending it back at me.The sound looked like a liquid golden substance, though I still retained 'normal' hearing. I could not stop making this sound,uttering it was pure joy and my friend coudn't stop laughing.After that I was 'in Kansas again' and felt pleasently empty of any fear,remorse,hate etc.etc. I've heard some say that DMT can be frightening, but it wasn't to me.It did, however, remove all the effects of the substances indulged in before the session,ecstasy,alcohol and black hash.I think it might be an easy way out of a bad trip(if there are such things that are bad), but only if one can wield it,and I guess yuo'll know if you can. Happy newyear!"
 ],
 "erowid": {
  "id": "31038",
  "citation": " sunyata. \"Pleasantly Empty of Fear: experience with MDMA (Ecstasy) & DMT (ID 31038)\". Erowid.org. Jul 15, 2013. erowid.org/exp/31038",
  "substance": "MDMA (Ecstasy) & DMT",
  "views": "604"
 }
}
