{
 "title": "Forest Trip",
 "author": "Bryce",
 "citation": " Bryce. \"Forest Trip: experience with Mushrooms (ID 50302)\". Erowid.org. Sep 12, 2007. erowid.org/exp/50302",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>Report of my first trip on Pscilocybin mushrooms:</p><p>Weight: 135</p><p>Age on trip date: 19</p><p>Psychedelic backround: DXM, LSA, Marijuana, Salvia</p><p>I think that to fully understand a trip report, one should shed light on thier past. I grew up in the country side in pure nature. I had neighbores, but essentially I played in the woods with my best friends; building forts, fishing, making rafts, and exploring the woods. I went to school, I was a rather quite kid, and rather wierd, but I had alot of good friends. People seemed to like my strange sense of humor. After gradeschool I attended an all boys boarding highschool. This was not as bad as it might sound. Of course it was a dying pain not to see many females, but the friends I made, and the cultures I got to explore through international students was worth all 4 years.</p><p>I have pretty high anxiety which seems to get worse all the time. I don't know where this anxiety came from. I always was a little nervous in my highschool days when I would ask a girl out at the amusement park where I worked. Maybe the anxiety came from not being social with girls through most of my teens, and maybe it keeps getting worse because I smoke weed. Hopefully it will get better, for I have slowed down my weed smoking. Anyway, on to the trip report.</p><p>Summer. Warm weather. Blue skies. What better than a state park to trip on mushrooms. I was with my friend B who was also going to dose mushrooms with me, but less. We arrived at the state park late afternoon. It was perfect. There was a beautifull lake, blue skies, acres of woods, and a nice breeze. I could see people swimming over in the lake, fishermen in boats, and on the shore, families picnicing, and couples walking dogs. It was certainly a pleasant summer day, one of those days where I feel so much gratitude for being alive and able to be around such beauty.</p><p>We had never hiked at this park before so we got a park map, and picked a hiking path. I think we had really made a bad choice on picking our path, considering it was rather hot outside. As soon as I walked 10 feet onto the path, I knew it was going to get hot. We seemed to have picked a swampy area. Alot of humidity hung in the area. We eventually hiked somewhat out of the swampy hot area and found a nice hill with decent air flow.</p><p>We had brought along a bookbag with orange juice, chocolate, toilet paper and our mushrooms. Before we ate our golden teachers, we hung lenghts of toilet paper around the woods so we could get back to the path. That may seem like its a little wack, but it certainly helped us later.</p><p>We sat down in some leaves, since we couldn't find any mossy area. I was dosing 7 grams, and my friend was dosing 3.5 grams. I had two big mushrooms. Fat, dry, and plump. I tried eating mine with orange juice, it wasn't so bad. I also tried one with chocolate. If your sensative to bad tastes, I suggest eating them with chocolate, even thought I don't think they taste that bad anyway. We finished eating them and layed back with some psy trance on our headphones. I was so so eager to trip. I felt like it was christmas morning and I was waiting for my dad to get out of bed so my brother and I could finally open our preasants. The moments after the ingestion and before the trip came on, seemed so long. Just waiting there, not knowing what would happen, but knowing that I wanted to experience it.</p><p>Subtle effects came to me. I wasn't sure if I was tripping or not though. I watched a small plant next to me, and it seemed to breathe with energy. It was so alive and thriving. The sun light through the trees seemed brighter, but I wasn't sure if I was tripping. I stood up with B and there it certainly was. This is when I pretty much knew I was in for a ride. I saw before my eyes a tree melting. I asked B if he was tripping, he said he felt or saw nothing yet. I guess it was the difference betweeen our doses.</p><p>We decided to split up and explore a small area of the woods. I walked around and looked at beautiful nature. I saw a tree that looked like gandalf from lord of the rings, and I saw a daddy long legs on a tree. It was beautiful. It's blue legs were shinnig in the sun, and it lay so still on a tree as if it was enjoying its life so much.</p><p>I found B and we decided to get out of the woods. It was getting really hot. I beleive the shrooms had raised my body temperature. I drank some orange juice and we headed back, and for some reason I dumped out the rest of the orange juice. On the way back it was very strange. Before we got back onto the path we had to walk a small distance through the pure woods. I was walking past trees and it was as if between every two trees, there was a different looking forest. Every two trees were like a gate to another similar, but different looking forest.</p><p>We made it to the path, and I was so eager to leave the woods and get into an open area, I seemed clostraphobic or something. After my second trip I beleive that mushrooms make me clostraphobic. I walked a fast pace down the path back through the swamp and to the main park area. B seemed so calm, enjoying his walk, enjoying nature. He seemed like a free spirit. Maybe the music was making me jumpy, I don't know what it was. I should have just taken my headphones off, I think I picked a little too intense psy for tripping 7 grams.</p><p>I got out to the park area first and B was still walking behind me, so I continued to find a bench for us to sit on. On the way to find the bench I walked passed a mother and her children, I was laughing, smirking, and I couldn't stop it, but what was funny? Did she know I was tripping, I bet she can see my dialated pupils, o she knows, hahehehe, wait no, don't laugh, she will know! I made it past and found a table and waited for barry. It seemed that barry was having the same trip as me. He walked over to the picnic table with a big grin on his face, and we tried to sort out things. There was a decent amount of people around. People walking dogs, fishing, and hiking.</p><p>We decided we had to get away from people, so we walked down the park a little and turned off onto a hiking path. This seemed a little bit more open to wind, but still the humidity was horrible in the woods. We walked off the path and sat down on the ground. This is when the trip took a turn for the worst. I was pretty calm and was watching my hand. I was gripping a tree and it was as if my hand was growing to the tree. When I would look at my hand, there would be alot of pulsating bumps on it, as if some kind of worms were crawling through my skin, though it wasn't scary, it was interesting to watch.</p><p>I kept getting hotter and hotter, it was so humid. I beleived I was dehydrating and I had dumped out the orange juice. I took off my shirt and wanted to take my pants off, it just seemed like they were supposed to come off, but B was there so I didn't, plus I was in a state park. I wanted so bad to feel air flow, I was so hot. B was also freaking me out, he was calm. Calm like the wind, and enjoying his trip it seemed. He would walk around the woods and look at trees and such. For some reason it freaked me out. I just wanted him to sit down. I asked him to do so, and he did. I ranted about dehydration, so he decided he would go get me some water. What a journey to ask somone tripping 3.5 grams. Go get some water for your dying dehydrating friend.</p><p>I stayed back in the woods and waited. It was not dark, but it was thick woods and there was not so much light. Hell let loose on my mind. At first my ego was bothering me, I couldn't understand why I had some voice always talking to me in my head. Why couldn't I function purley on instinct, why do we have an ego? Explosions of demon faces around me. I was sitting in a demon fractul. Everything around me was a demon face. Every twig, leaf, tree, blade of grass, every 3 sticks that lay on each other, every 4 trees that stood next to each other, everything. It was horrid, and when I shut my eyes, only exotic pink patterns twisting and spinning very fast.</p><p>I couldn't take it, I couldn't understand it, I wanted it to stop. I was so scared that I beleive I even came in my pants (a little). I began to pray to God, and asked him to be with me in my time of need. I prayed alot, and it seemed to ease the pain. The demon fractul stopped and I could think again. I made a plan and I did it. I put on my undershirt, and leaving behind my favorite shirt I marched out of the woods. I was only about 10 feet into the woods, and still I had the hardest time finding my way back to the hiking path.</p><p>I strut out of the woods feeling absolutley wonderful. I found B on the path comming back to find me, and he had water. He said that the water pump didn't work, so he had to get lake water. I was okay with this since it's clean water, people swim in the lake. I drank alot of water while B went to get his cd player he had left in the woods, he also got my shirt for me.</p><p>I walked out of the woods while barry was still getting his cd player. I sat down at a picnic table right infront of the resevoir/lake. I was in a total state of peace. I watched a man and his wife in a boat. I could hear them talking. The man was suggesting to what I think was his wife, that they should get a house somewhere on a lake and take the boat out more often. I thought that was wonderful. I felt great, it was like I had just climbed out of a hellish rat nest into a beautiful serene world. I sat in total peace. B came and sat next to me. He had 3 sets of eyes and 2 mouths.</p><p>We sat and talked about things and at the same time watching the beautiful sunset over the lake. Absolutley magnificent. The clouds, there was easter island faces in them, and the rocks on the edge of the lake, they had demon faces on them. It made sense though. Good always prevails, the demon faces were where they belong, on the ground where we can walk all over them. While watching the sunset heat lightning flashed and echoed through the sky. Ribbits from frogs would become interetwined with the speach of a family by the docks, and become one sound wave. My own voice seemed slow and was distorted. It was one of the most beautifull moments in my life.</p><p>As it got dark I got sadder and sadder, I wish I could have watched that sunset forever. It eventually got dark and we decided to walk over to my car. Light colored rainbow pixels, and audio hallucination/distortion as I walk with B to the car. It's so dark and I can barley see where I am going because the pixels.</p><p>We eventually made it to the car and I was totally devistated that the sun went away. I was going mad again, I wanted to see the sun again, I wanted to be out of the dark. I was looping and looping. My mind was on the fritz. A million thoughts that are unexplainable, but I want to tell someone and it doesn't make sense. Another billion thoughts that make sense, but at the same time they don't. I understand it all, but it won't make sense. My mind was on overload. I could take it no longer and against the will of B I decided to try and drive to my mom's house.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>Keep in mind that I'm tripping hard, this is the last peak of my trip. I start the car and back it up. Wow, that seemed harder than it should have been. I pull out of the state park and drive. It's not too hard to drive, I am accurate, but also I see slightly double. I keep on the road rather well. We drive down the road around 7 miles and I realise that there is no way we will make it home and if I don't pull over I will end up making a very bad mistake that could result in the loss of life. I pull over at a golf course and we sit in the parking lot.</p><p>My mental state was driving me mad. I wanted to turn myself in, I wanted somone to knock me out, just to make it stop. Rather, I make my way to the vending machine and B and I have a bottle of water. The golf course has no fence, so we go and lay down on the fairway. There was fireworks that night in the distance, and what a treat it was. It was much like the heat lightining, the light fronm the fireworks would echo through the sky. Still I am expieriencing mind loop and audio distorion, but I'm at peace. We sit and let the drug wear off, then I drove us to my house.</p><p>What an experience. We were lucky that day in the state park. We were unprepared, and made some bad choices, but came out ontop, and I'm thankfull for that. Somone once told me that if I use psychedelic drugs, that there is no turning back. I will experience and discover things that I never knew possible. This is true. What I discovered is unexplainable. Some sort of energy, or maybe to define it, 'the essense of life'. In a sense I think that's what I did discover.</p><p>I took mushrooms with a mind set that I would see fairies and talk to gnomes and that such. It's possible that's for sure, but I wouldn't expect it. Mushrooms I would say, are totally different than what most people expect. Alot of my friends sum them up as, cool colors, and hallucinations. Not at all my friends, not even close.</p>",
 "year": "2005",
 "id": "50302",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-09-12T07:00:00.000Z",
 "views": "4874",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
