{
 "title": "Joints - Another Perspective",
 "author": "glossolalia",
 "citation": " glossolalia. \"Joints - Another Perspective: experience with Salvia divinorum (5x extract) (ID 50357)\". Erowid.org. Apr 19, 2007. erowid.org/exp/50357",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "174 lb",
 "header": [
  [
   "DOSE:",
   "2 joints/cigs",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "report": "<p>I first tried Salvia about six years ago, in tincture form and got some interesting experiences. I drifted away from that side of my life and didn't experiment again until recently, when I came into the possession of some 5x and some 10x enhanced leaf.</p><p>Naturally, I checked the available literature and tried smoking it in a pipe. This met with limited success. Although there were definite effects, they were weak and very short-lasting. The shortness of the effect was not entirely unexpected, but the low strength was - mild OEVs and the tiniest hint of psychedelic thought patterns. The tincture had much greater effect.</p><p>After a few experiments - the 5x having almost no effect, I decided to try something else. Although entirely aware from the various salvia FAQs that joints are supposed to be much less effective than pipes/bongs, I figured an experiment couldn't hurt. So I rolled a couple of cigrarettes from the 5x (using a small amount of rolling tobacco for structure). I'd estimate I used no more than a bowl worth of Salvia, perhaps a little more. The difference in effect was remarkable. This was a spur of the moment thing and I was expecting little effect. I was to be surprised.</p><p>The effects slowly came on during the smoking of the two cigarettes (which I chained, one after the other - although they probably contained less actual tobacco than one normal hand-rolled cigarette), but didn't reach a peak for at least another twenty minutes. This correlates with my experience of sublingually absorbed Salvia. This suggests to me that (for me) Salvia works better absorbed over the course of several minutes, rather than a large dose in a shorter time. I suspect that some others who report minimal or disappointing effects from bong/pipe smoked salvia may find that, contrary to the established wisdom, smoking it in joints is more effective.</p><p>The visual effects, both open and closed eyes, were fairly impressive. With eyes open I experienced some significant distortion of space, and intensified colour. There was the certain swirliness that I've come to associate with Salvia. Looking in a mirror was interesting - my reflection was very distorted and morphed as I watched. Later, looking at clouds in the night sky, I found they stuttered instead of moving smoothly.</p><p>The usual Salvia body-effect was evident although relatively subtle. Thoughts came clearly and were full of meditative interest.</p><p>Around an hour and a half after smoking it, I began to approach baseline again. It might be noted that these times are similar to those reported for sublingual absorbtion. Although I wouldn't claim that it would work for everyone, joints should not be ruled out as a method of ingestion for those wishing to experiement with Salvia, especially those who get minimal effect from bongs/pipes, those unsatisfied with the short duration that quick ingestion methods provide, and those who get good effect from tinctures but find it too expensive.</p>",
 "year": "2006",
 "id": "50357",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-19T07:00:00.000Z",
 "views": "4190"
}
