{
 "title": "Trippy Dippy Stuff",
 "author": "GemSmith",
 "citation": " GemSmith. \"Trippy Dippy Stuff: experience with Zolpidem (Ambien) (ID 50368)\". Erowid.org. Mar 27, 2008. erowid.org/exp/50368",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "135 lb",
 "report": "<p>I have been prescribed Ambien for about a year or two now (to treat the poor sleep associated with narcolepsy), but am only now coming to terms with the effects. When it was prescribed to me, I was only told that it would help me sleep better and that it was unlikely to be addictive, but no side-effects were mentioned. I have been taking Modafinil (Provigil) for narcolepsy every time I have been on Ambien.</p><p>The very first time I took it was frightening. I had had some experience with high doses of mushrooms but these visuals weren't even close to them. I saw the lines of my room slither around, and my room was filled with people talking to me. I didn't take the pill again for a long time.</p><p>I recently began taking it again after I found out that people take it recreationally. The visuals are far more intense for me than those with acid, they are like what I thought acid would be like. Often I don't remember my actions. I see people around me and converse with them, and I have seen objects in my room mutute into creatures that talk to me and to each other. Sometimes I can get frightened, and I always spend at least an hour wandering around the place and engaging with people and objects before falling asleep. The sleepiness usually remains with me for a day afterwards. The visuals are very very intense, and some of my friends who have taken it have reported similar effects, although not as intense. Ambien is by no means a gentle sleep-aid, for some it has no side effects, but the vast majority of those I know who have taken it have reported at least some alteration to their perception of reality.</p>",
 "year": "2005",
 "id": "50368",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-03-27T07:00:00.000Z",
 "views": "16219",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 }
}
