{
 "id": 5037,
 "title": "Learning Experience",
 "date": {
  "submission": "2013-07-15T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "A",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 buttons",
   "administration": "oral",
   "substance": "Peyote",
   "form": "fresh"
  },
  {
   "time": "0:30",
   "amount": "3 buttons",
   "administration": "oral",
   "substance": "Peyote",
   "form": "fresh"
  }
 ],
 "report": [
  "This passed January, one of my friends (we'll call him Q) My friend Q took a trip down to Mexico with a couple of his other friends. There he met up with some guy who was willing to take them to the desert to pick some peyote. The guy told them alot about peyote, he told them to never think of anything as bad because if you did, it would make the trip bad.",
  "Well anyway, Q got back from his trip January 16th around 3 oclock in the afternoon. He came straight up to my house to let me know he had gotten some peyote and wanted to know if I wanted to try it with him next week. He said his parents would be out of town so we could do it at his house with no chance of getting caught. I had never done peyote before but I had read quite a bit about it and it sounded like a fun thing to do, so I said that I would and that I'd see him next week.",
  "On saturday we were sitting in his basement on his computer when he asked if I wanted to do it now. I was still a little nervous about doing it but I said alright and we ate about 4 buttons.  It was pretty bad tasting but not as horrible as I expected it to be.",
  "We ate the first 4 at about 10 oclock and waited about half an hour then ate 3 more buttons. Still nothing was happening, My stomache hurt a little bit but I didnt feel like I had to throw up.",
  "About 15 minutes later I noticed when I closed my eyes that colorful patterns were flying around and I would see certain pictures.  Q was pretty bad at this point, but he said he was feeling very good.",
  "I wasnt noticing anything too different, colors were alot brighter, the carpet and walls were sparkling, but thats about it. 2-5 minutes later I was sitting in the chair and all the sudden everything I looked at was moving sparkling and I felt like I was connecting with things alot better than I usually was.",
  "My friend was talking to me and told me to go look in the mirror and that there would be something funny. So I went in the bathroom and looked in the mirror and noticed nothing funny. I asked him 'whats so funny' and he said 'look at your eyes' I am so glad he pointed that out. My pupils were probably the size of a quarter, no joke. They were huge, It kinda scared me at first but then I realized that his were huge to so I calmed down.",
  "I went up stairs to go get a drink of koolaid. As I walked around the corner and walked towards his front door I noticed bubbles were floating around infront of the door and it kind of scared me, I wondered if someone was in the house blowing bubbles, which seemed alot scarier at the time than when I think about it now. I asked Q to come upstairs and look and he said there were no bubbles and to calm down, so I went in the kitchen got a drink and went back downstairs.",
  "It was semi hard to walk, not really if I didnt think about it, but if I thought it was hard to walk all the sudden I would forget how and just sit down and crawl.  Walking felt really heavy like I had something really heavy on my feet. I went to the couch and sat down and asked him to put The Doors record on. So he got up and looked at me and said 'WHAT!' I looked back at him and repeated myself. Then he just went over and put it on.. Hmm.",
  "Now it was about 2 hours after we had eaten it and still everything was very different. We were listening to Led Zeppelin IV now and staring up at the ceiling. As I sat there I felt like I understood things that I had never understood before. Things were so clear now, like I knew everything. ",
  "My friend said he was feeling kind of sick so he went in the bathroom.  He seemed to be gone for about 2 hours, I had forgoten all about him and was sitting on the couch with my eyes closed seeing wonderful pictures and designs. Finally I realized that Q was still in the bathroom so I got up and knocked on the door. That was a task. I had absolutely no strenghth at all. Moving my arms back and forth to knock seemed like it took forever to do. He said come in and I walked in and he was just sitting on the floor looking into the mirror and whispering to himself.  He said he was okay though, he said he just threw up a little then sat down because looking at himself was interesting.",
  "I asked him how come he was in there so long and he said hed only been in there for about 5-10 minutes. I disagreed and said hed been gone for a very long time. He asked how long I thought and I told him about 2-3 hours. He asked my why the music was still playing and then I realized he was right.",
  "We ended up going to bed around 5 in the morning, the peyote was almost gone now, light was brighter still but no more pictures or hallucinations. In the morning Q woke up first and woke me up. He said he was hungry so we went upstairs and had a bowl of cereal.",
  "While eating we talked about the things that happened that night. Both of us thought we had a better feel for our lives now, almost like we could feel all our feelings inside better, and how we felt so relaxed.",
  "Anyway I did peyote 4 days ago, and had another good trip."
 ],
 "erowid": {
  "id": "31066",
  "citation": " A. \"Learning Experience: experience with Peyote (Lophophora williamsii) (ID 31066)\". Erowid.org. Jul 15, 2013. erowid.org/exp/31066",
  "substance": "Peyote (Lophophora williamsii)",
  "views": "967"
 }
}
