{
 "id": 5038,
 "title": "Steady Dose of Alternate Dimensions",
 "date": {
  "submission": "2007-04-30T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Sem",
  "gender": "Male",
  "weight": "185 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>Mid Feb. 2004 was my last experience with Salvia to date. I tend to gravitate towards my 1/4 ounce I bought off a Hawaiian supplier in 2001 every 6 months or so. That equates to roughly 6 times I've smoked it. I now have enough left for one more trip, as I've given away a few leaves here and there to people who were interested in trying it. I've read reports that say the active psychedelic (or whatever it is) ingredient dies off over time due to oxidation. I've kept the leaves in a glass jar, in a wooden box. It seems to have all the potency of when I first opened the package in 2001.",
  "Each experience with Salvia is very similar to many other trip reports that I have read, well, not as a whole, but certain elements. Things like breaking through a 'membrane' while sitting staring throught a wall at the splendor or just unknown. But even 1 leaf can spin me right out into a detached state, just by holding the smoke in my lungs longer.",
  "Spinning seems to be a good adjective for what happens, as each time, there seems to be a rushing and spinning sensation early on, and the last trip, off of 1 leaf, I had the feeling of my breathing stopping, but when I think about it, I just couldn't swallow, which shows an auto action towards disconnecting from auto physical functions, but our bodies do maintain, just like higher levels of Yoga meditation. I've never even come close to reaching these plains with yoga, but what I've read, it seems remarkably close.",
  "Ok, so the spinning aspect, one time it involved seeing my Teeth, filling up the room, then spiralling into infiinty. This last time I smoked,  I had the unique, but familiar feeling of a tearing sensation, and some very intersting audio colour distortions which always accompany the trip. Then I watched my body, but I did not see me. It looked like a maztec style, or very geometric shape of a man, come out of me, from my right side, and spiral, counter clockwise, into a madlebot, but not like one. Very hard to describe but they did get smaller, and it was animated..walking..away..spinning..shrinking. My hyphothesis on that is my ego, or my 'self', disconnecting with every moment, leaving... it's the past..disappearing in front of me, which I'm aware of normally, but not in a visual state such as this.",
  "I'm an artist, and I've been working on interpretations of various experiences.. it seems very hard to come up with something similar experience, but I hope to finish something, and I shall share the art with this web site. I think alot of brazilian/maztec/ancient cultures of south america, mexico, ect, have very good interpretations, even if they were not on salvia, possibly other psychedelics. This last time, I was also testing my ability to control what was happening, but it's fruitless. It just seems to make things harsh, and kinda out of control, so I gotta just give in.",
  "I have much faith in this being a substance to help with many disturbances that may occur around someone's own energy field, as I feel it opens up the dimension to see what it could be that's there. But I also believe that you must approach it with caution, and patience. I've never done more than 2 leaves within a time span of 2 hours, as I don't feel I've needed to. I have a fairly clean system, and I'm very senstive to many things, and I've noticed people who drink too much  alcohol, or smoke cigarettes, never even have any connection with salvia when they smoke it.  This is a powerful plant given to us by nature, and we must respect it. Patience is a virtue, because in Salvia 'time' there is no 'time'.</p>"
 ],
 "erowid": {
  "id": "31072",
  "citation": " Sem. \"Steady Dose of Alternate Dimensions: experience with Salvia divinorum (leaves) (ID 31072)\". Erowid.org. Apr 30, 2007. erowid.org/exp/31072",
  "substance": "Salvia divinorum (leaves)",
  "views": "3718"
 }
}
