{
 "title": "Summary and Notes",
 "author": "neilios",
 "citation": " neilios. \"Summary and Notes: experience with 2-Aminoindan (ID 50392)\". Erowid.org. Feb 26, 2007. erowid.org/exp/50392",
 "substance": "2-Aminoindan",
 "bodyweight": "70 kg",
 "header": [
  "DOSE:",
  " repeated",
  "insufflated",
  "2-Aminoindan",
  "(powder / crystals)",
  "",
  "60 mg",
  "oral",
  "2-Aminoindan",
  "(powder / crystals)"
 ],
 "report": "<p>A brief background of the subject (me); I am male, 21 and about 11 stone, prior experience with a wide range of psychoactives.</p><p>2-AI:</p><p> This substance initially appealed to me due to its legality and ease of purchase (UK). The first few times I used this substance was for exams (as had to cram, it was not planned but a spur of the moment thing!). I stayed up all night insufflating amounts (eyeballed) of around 10-20 mgs, in total around 90 mgs were insufflate, and also around 60 mg was bombed after insufflations (just before the exam!). Overall conclusions drawn from this was that 2-AI gave me a mild simulating effect whereby I did not feel tired from a whole night of staying up, I found it slightly improved my concentration and also dilated my pupils slightly. Euphoria at this level was extremely minimal if present at all. The day after slight stomach discomfort was noted as well as diminished appetite and a slightly strung out feeling remained (although this could well be due to no sleep). In a nutshell though, I wrote lots and lots in the exam (more than I could have done with no substances, although the quality of the writing may of questionable quality!).</p><p>Following these exam shenanigans I tested 2-AI more thoroughly with various measures and generally larger doses, I offer the following personal conclusions:</p><p>If bombing (what I think are) large doses (100-300mg) or insufflating large doses (80-180mg) (this BURNS and after doing this a lot my nose felt slightly damaged, am a regular cocaine user and do not get that feeling from cocaine) 2-AI seems to give me a RAMPED UP effect, whereby I feel increased energy and slight euphoria, quite wired. Although it seems not to make me more talkative (in fact it seems to mute me slightly) I also felt a slight increase in confidence with it (if this does not seem paradoxical).</p><p>When drinking alcohol after these doses an increased tolerance to alcohols intoxicating effects seems to prevail. Pupil dilation is present but is not as much as for MDMA or many other chemicals. Quite severe dry mouth also seems to be a side effect.</p><p>In terms of negative effects not many were noted. Although it is easier to stay awake after 2-AI, sleep is relatively easy for me. Slight stomach discomfort was present a few times. In terms of an actual comedown I did not really ever seem to have one (like experienced from MDMA or amphetamine), it just kind of trails off and does not leave me too spangled, I tended to feel a little tired the day after use.</p><p>2-AI does seem to have a slightly addictive profile, after using it daily for around 3-4 days it seemed to get easier and easier to re-dose, and I found my self moving to it slightly unconsciously, I do have quite an addictive personality though. However this was very mild addiction if compared to cocaine for instance, and I find that even cocaine isnt too bad to kick after a short week of prolonged use. Simultaneously tolerance seemed to increase over prolonged use, and if insufflating this cant be good for my nose.</p><p>My overall conclusion on 2-AI is that its not really worthwhile (bombed or snorted). Although its easy to get, the euphoria from it is quite minimal, it only provides a little ramp up, and doesnt keep me there that long (I would estimate plateau to last around 3-4 hours (bombed) and 2ish hours (Insufflated), and about 30-50 minutes to effect if bombed, and around 10 minutes if snorted). Snorting it also seems very damaging to my nose (and I snort many things!), and seems to give a slightly stronger effect than bombing. Unmentioned before it also seems to have a slightly dark dopaminergic quality to it. After prolonged use a slightly strong sense of underlying paranoia emerged, not as much so as for prolonged amphetamine or cocaine use, but it was still there, and dark as I said (you were out to get me!), and a slightly depressive state was present (although this may have been unconnected).</p><p>So, for me experimentation is over, without much desire to repeat. Worth trying once for the adventurous but I would say its not worth getting one's hopes too high for. Mind you thats just my opinion and sunk boat, it might float yours  :)</p>",
 "year": "2006",
 "id": "50392",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-02-26T08:00:00.000Z",
 "views": "18179",
 "dose": {}
}
