{
 "id": 5045,
 "title": "1st Time 2C-T-7 Experience",
 "date": {
  "submission": "2000-10-10T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 98
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "After receiving my 250mg 2c-t-7 in the mail, I dissolved it in 100ml everclear, mixed it well, and then measured 2ml and evaporated it in a beaker.  I used a slurpee spoon from 7-11 to scrape out the powder, it worked ok but there was still a decent amount of powder left stuck to the side of the beaker, it was just so thinly distributed and stuck to the sides of the glass that i couldn't get it out... So I would estimate my dose to be very slightly less than 5mg (I weigh about 215 lbs for reference).",
  "The setting of this drip is in my college dorm room and the surrounding area.  My basic mindset was hoping for a new kind of experience perhaps, and just general curiosity, and great anticipation of what was to come cuased by waiting oh so long to get the little packet of white powder...",
  "I get out my razor blades and mirror.  I cut it into two piles, and snort one pile at 12:07pm.  Within a few minutes I can feel a subtle change in my consciousness, a kind of giddy feeling with rushes around my stomach and legs.",
  "At 12:19 I snort the other pile, as well as all the little bits of powder on the mirror and still in the beaker.",
  "By 12:30 I definitely feel the effects, I feel energetic and am having muscle tremors, my pupils are slightly dilated, and visually things are just barely wavering out of the corner of my eyes.  I put on some sunglasses, go outside, and look at the grass...  if I zone out enough, it breathes quite completely, as does any other surface.  My jaw is clenching slightly.  I don't really feel nauseas at all, maybe a little 'butterflies in the stomach' feeling though.",
  "At about 1pm, I figure that this is about as strong as its going to get, and it's not very intesnse, but definitely nice... no visuals to speak of unless i concentrate on them really hard in a dimly lit area.  I go to my dorm's dining hall and grab some food, it tastes good and I have a good appetite.  After lunch, I go out by a river near my dorm and smoke a little pot, I soon become quite fucked up...  jaw clenching a lot, visuals seem to have decreased though, but I feel a lot more confused and trippy I guess.",
  "I go back to my room, put on some headphones.  Damn, music is fantastic, listening to the song 'space oddity' by David Bowie sends me into one of the most amazing states of ecstasy i've ever experienced, cold rushes of energy flow over my whole body while subtle, colorless, but intricate geometric patterns morph behind my closed eyes.  Looking at bathroom tile, carpet, or walls for a while brings colorless but very real animated shapes dancing across them.  Time dilation is quite strong, at about 2:15 I feel like I have been going for at least 4 hours when it was in actuallity just under 2 hours.  I listen to music and zone out in a tripping/stoned mindspace for a while, I don't feel many mental effects from 2c-t-7, unlike from say LSD, but they are there only subtle.",
  "Overall the experience was euphoric and relatively calm, although it seemed to have a speedy edge to it that could get bad at higher doses...",
  "I will try 2c-t-7 again, however at a much higher dosage."
 ],
 "erowid": {
  "id": "3109",
  "citation": " Anonymous. \"1st Time 2C-T-7 Experience: experience with 2C-T-7 (ID 3109)\". Erowid.org. Oct 10, 2000. erowid.org/exp/3109",
  "substance": "2C-T-7",
  "views": "18164"
 }
}
