{
 "title": "Panic Attack and Evil Thoughts",
 "author": "Lee",
 "citation": " Lee. \"Panic Attack and Evil Thoughts: experience with Cannabis (ID 50453)\". Erowid.org. Sep 7, 2006. erowid.org/exp/50453",
 "substance": "Cannabis",
 "bodyweight": "110 lb",
 "report": "<p>I've been smoking pot regularly for about 5 years, since I was 15 years old. In the beginning, I got 'sketched out' and extremely paranoid very easily. The first time I got high was like a nightmare in terms of not being able to function or grasp reality. Obviously, I got used to smoking and haven't had problems like that since, until now.</p><p>Two weeks ago I went to a friend's apartment to drink and smoke a little. Nothing was wrong with the environment: I was friends with everyone and felt totally at ease. I was actually really excited to just chill out and relax after a long day, so I was definitely in a decent mood. I packed my friend's bong and took a pretty big hit, it hurt my throat for a while and my chest felt like it was burning. This has happened to me before, especially when smoking a bong, so I didn't really think anything of it. I started drinking a beer and waited for the bong to come back to me. Before that could even happen, about five minutes later, I started to feel really high. At this point nothing scary was happening, I just felt really stoned for only one hit. I decided to pass out on the next hit and just chill.</p><p>During the next 20-30 minutes, I gradually started to feel progressively different in a bad way. My heart was beating extremely fast, and the palpitations made my whole body vibrate. I eventually started to feel so out of it, barely able to function. At this point I was still talking to people and seemed normal to everyone else, but inside I knew this wasn't a normal high. The next half hour was absolute hell: I felt like I couldn't function, couldn't talk, couldn't listen to people speak. All I could do was focus on one thing, like an object and just stare and be in my own world. The heart palpitations were really scary, and I just felt so out of it, like I wasn't even there. Every time someone would say something to me, their words would seem really fuzzy and I wouldn't be able to comprehend. I also started to get freaked out that no one else was as high as me and I started to get really self-conscious. At this point my friends started to notice that something was weird with me, but they just kept saying that I looked so high. Eventually I couldn't take it anymore, I just felt so anxious and panicky like I was going to have a heart attack. I left to go lay down in my friend's room.</p><p>Once I laid down, everything felt like it was spinning, and I felt like I was being transported to a different reality. Reality to me was in my head, a field of thoughts that were coming at me so fast I couldn't even process them. A lot of the thoughts were evil; I actually can't really remember specific thoughts, because at the time I recall saying to myself, 'Never think these things again, you'll go insane if you think about this.' Basically I think I was thinking about how the world is meaningless as is our existence, depressing thoughts like that. I also thought I was going insane at one point and that I would be in that state forever.</p><p>It felt really good to lie down, because I also felt extreme fatigue. It was a little hard to breathe too, I had to gasp for air at some points. My body just felt completely dragged and lifeless. A few times I tried to sit up but felt even more fucked up and freaked out, so I just laid back down. The whole time I was freaking out about the situation in general: I had only taken one hit, so I wasn't expecting anything like this to happen, I just didn't know what to make of it. I kept telling myself that I have to get up and be normal but every time I tried I would still feel messed up to the point where I couldn't even walk into the other room, let alone speak to people. The whole time the heart palpitations kept getting worse; I seriously thought I was going to have a heart attack and die. Actually, I felt like I was dying the entire time.</p><p>Weird thoughts kept going through my head- at first I thought it was a panic attack and that I would need to go to the hospital to get tranquilized. Then I thought that maybe I had diabetes and needed sugar or else I would die. I actually considered asking my friend to take me to the hospital, but like I said, I couldn't move or speak. After about a half hour of this torture, I felt decent enough to get up and try to act normal. I felt wiped out and extremely tired, but joined my friends in the other room. Acting normal was probably the hardest thing to do at this time, but I didn't want to freak anyone out and I also thought that if I acted normal, I would feel normal. I actually did feel a little better in time, I could at least smoke a cigarette and form a few sentences. Finally, my friend was leaving and drove me home. I immediately got into my bed and passed the fuck out really early, at like 10 p.m. The next day I felt a little disorientated, but the hell was over.</p><p>I really don't understand why this happened to me. Like I said, I've been smoking regularly for years and nothing like this has ever happened to me. If I had to sum up the experience, I would say that I literally felt like I was dying and that I wasn't on this earth but in my head. It's hard to explain, and nothing like this has happened to me since, but it definitely freaked me out. After this happened, I went onto a website to see if anyone else has had this happen, and I guess panic attacks on pot are a lot more common than I thought. I just don't understand why it happened that particular night when nothing else was off at all. It definitely scared me, and I'll never forget it, but I smoked two days later and have been smoking since, and I've been fine.</p>",
 "year": "2006",
 "id": "50453",
 "gender": "Female",
 "timestamp": "2006-09-07T07:00:00.000Z",
 "views": "5090",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ]
}
