{
 "title": "La vision de l'eternite",
 "author": "Alligator_427",
 "citation": " Alligator_427. \"La vision de l'eternite: experience with Amanita muscaria (ID 50464)\". Erowid.org. Apr 21, 2008. erowid.org/exp/50464",
 "substance": "Amanita muscaria",
 "bodyweight": "62 kg",
 "header": [
  "DOSE:",
  "10 g",
  "oral",
  "Amanitas - A. muscaria",
  "(dried)"
 ],
 "report": "<p>L'exprience que j'ai vcu est limite descriptible par des mots tellement c'tait profond et intense.</p><p>* 16h30, j'avale 10 grammes d'amanites Sibrien secs.</p><p>* 17h30, je ne suis pas vraiment moi mme, moi qui pensait que a ne me ferait rien comme l'autre fois, je me trompait. J'ai un gros coup de fatigue et de lgre naus, je m'endor sur le canap d'un sommeil trs profond.</p><p>* Heure inconnue, probablement entre 19h et 19h30, je me rveille bien que je ne me souvienne pas m'tre rveill.</p><p>Je n'en suis pas trs conscient mais je suis dans une transe trs profonde, mes motions marchent au ralenti et mme ne marche plus du tout, je bloque sur une de ces motions. Impossible de me souvenir sur quoi je bloquait mais c'tait rellement important car a m'a mis dans un tat de panique total.</p><p>Je ne sais pour quelle raison (enfin, je ne sais plus), je fonce vers la douche, retire mes fringues et prend une douche glaciale. L'eau est froide, je tremble mais ce qui me traverse la tte est avant tout primordiale, je bloque sur cette motions, comme si mon me tait elle mme dans le doute, des penses me traverse l'esprit et j'en arrive  une conclusion : 'c'est vrai' dis-je  haute voix (je vous le rappelle, je ne sais plus de quoi il s'agissait) ... et l, d'un seul coup, j'avais atteint une vrit et je devait  tout prix y rester sinon j'allais me perdre alors je rptait 'c'est vrai' pour me focaliser sur ce point infime dans une imensit aussi grande que l'univers.</p><p>La suite est trop personnelle mais je me souviens de 1 point:</p><p>Mes motions tait trs mthodiquement guid par quelque chose de trs haut, peut-tre par l'univers lui mme. Chaque fois que je trouvais l'nygme  chaque motion sur laquelle je bloquais, j'avais l'impression de grimper d'un niveau de conscience. J'en suis mme arriv  avoir piti de dieu tellement le monde tait moche et comme de la piti resulte l'amour, j'ai pens trs fort  la personne que j'aime le plus dans ce monde, je n'avais qu'un but (une seule raison d'tre) l'appeller et lui dire que je l'aime, j'ai eu normment de mal  faire fonctionner ce tlphone et au final a ne rpondait pas (j'ai du mettre 1/2 heure  russir  appuyer sur 3 touches). Il faut savoir que mes motions tait multipli par 10 ou par 100, c'tait soit je faisait a, soit je sautais par la fenetre, si vous prfrez, ce sont ces motions qui me guidaient dans mes actes. La peur de mourrir, la peur de rester dans cet tat toute ma vie, voil ce qui me motivait.</p><p>J'ai ensuite eu des rvlations trs prcise sur la vie, sur l'univers mais j'oubliais tout la seconde plus tard. J'tais dans un tat d'introspection vraiment trs profond et trs intense.  J'avais l'impression que tout le monde tait pass par l, et que mon tat tait naturel, je ne pensais pas du tout tre sous l'influence de l'amanite!</p><p>Je sortais de ma douche compltement gel, je tremblais, je n'avais qu'une ide en tte, il me faut de la chaleur alors je fonce dans la salle de bain, retourne mes affaires mais ne trouve rien d'assez chaud... surtout que j'tais en train de retourner la poubelle  linge sale. L'ide me traverse, je ne trouverais jamais rien d'assez chaud pour me couvrir (j'avais juste sur moi un t-shirt tremp), les motions se succdaient en s'acclrant, parfois je cernais la vrit (il y a forcment un truc chez moi qui me tiendra chaud) mais le doute recouvrait tout  l'instant d'aprs. Une vision me montrant aujourd'hui que toute vrit telle qu'elle soit  son propre doute.</p><p>Plus je voyais cette vrit, et plus je VOYAIS loin. Je n'ai connue aucune introspection aussi profonde que celle-ci.</p><p>Finallement, je dcide d'aller sous la couette et d'enfiler un pull qui traine. Tout d'un coup, je pu laisser s'envoler ces vagues d'motions fortes et je pouvais voir ( travers l'esprit) l'univers de ma propre vie. C'est comme si l'univers de la pense tait une spirale et que mes penses partaient de l'extrieur de cette spirale. Et moi, je ne suis que le spectateur de ma vie et je ressens toutes les motions. Plus le temps avanait, plus les penses avanaient et se rapprochaient du centre... et plus j'avais chaud. En l'espace de quelques secondes, j'avais revcu mes dernires trente minutes</p><p>Aprs cette vision sur l'ternit, je revint dans mon tat normal et n'eut pas trop de mal  m'endormir vers 22h30... ou 20h30 je ne sais plus.</p><p>Ce ft une exprience terrifiante car j'ai fini par penser que nous n'existions pas, que ma vie n'tait qu'un rve, un rve qui prenait fin et qui ne continuerait plus.</p><p>Le lendemain, j'avais la pche, je vais sortir et voir du monde, je suis heureux.</p>",
 "year": "2005",
 "id": "50464",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-04-21T07:00:00.000Z",
 "views": "17772",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  }
 }
}
