{
 "id": 5046,
 "title": "Journies to New Countries",
 "date": {
  "submission": "2007-12-01T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Candyflipper",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>Me and three friends arrived in Quebec City around 9:30 PM. We checked into our hotel, which was two blocks from Old Quebec. We decided to go and get some pizza at a local pizza place. While there, I noticed someone rolling a joint in the bathroom and asked the man, who spoke little English if he had and weed to sell. He sold me a little under 10 grams of very good marijuana for 40 dolars canadian. We went back to the hotel where he then got ahold of one of his friends who had ecstacy. I purchased 4 rolls off of her for 60 dollars canadian. They were double stacked crescent moons. We had brought through about 7 20mg bags of 5-MeO-DMT through the border with us. We decided to hold off on the fun until the next night.",
  "At around 5:30 I ate one hit of the MDMA, and snorted about another 1/4 of a second one. Immediately after we smoked a couple fat joints. We waited about 45 minutes, when the ecstacy had started to kick in. I then ate another 1/4 of an Ebomb and snorted another half. I washed this down with a few hauls off of a bottle of Sex on the Beach. We waited about 15 minutes, and at this point, the ecstacy was really starting to kick in. I was starting to feel a great lightening in my body, and was considerably relaxed in the mind. We sat down for a minute and smoked a blunt and made a DMT pipe for each one of us. When the blunt was done, we placed about 10mg of DMT in each pipe. Each one of us immediately took a hit at the same time, and were able to inhale all the smoke and vapors with out letting any escape.",
  "I held my hit in for about 8 seconds, and then exhaled. I was standing next to the bed and started to sit down. I immediately noticed the DMT hit to kick in before I could even sit down. I felt my entire body feel extremely light, as if I was on the moon or something and it wouldn't take any effort to lift up a limb. But, I was a little to involved with the sensations in my body to even want to move a little bit. Within about 30 seconds of this feeling I started to get some visuals. Every time a friend moved I had some insane tracers. As I looked at the walls in the hotel room, the patterns seemed to be swirling around. The wall paper almost appeared to have the qualities of a flowing ocean. It appeared to be swooshing about. Throughout this whole period I was lying on the bed. I remained in this state for about 20 minutes.",
  "Finally, the body buzz of the DMT went down a little bit. I sat up, still getting the hallucinations, and lit a joint. We passed this around until the joint was roached. I was still hallucinating very much. The entire experience with the MDMA and the 5-MeO-DMT felt very much like I had eaten an 1/8 of really good mushrooms. The entire tripping state, which is definitely what I would call it due to the fact that for a period I was tripping way harder than I was rolling, lasted about 30 to 45 minutes. As soon as it wore away I felt like I was coming down from the ecstacy, so I had another 1/2 of one in a safety stash. I snorted this, and within ten minutes began to roll really very hard once again.",
  "We smoked another joint, and then left the hotel room. The entire time that were in the hotel room was about 2 and a half hours, but it felt only like it had taken us a half hour to do and experience everything. Not counting the time distortion, I had no negative mental effects from the drugs. I never felt like I was going to die as some DMT users report. My mind was fully alert and in touch with everything that was goin on around me. We walked around Old Quebec for about 2 hours, stopping at bars and enjoying the scenery. The entire time I felt like I was floating about the city, not even walking or moving my legs at all. My mind was completely free of all troubles. The entire time I was just thinking about how in sinc I felt with everyone that I was around.",
  "After we had done this, we went back to the hotel. We drank a bunch of beer, and over a period of an hour, we had about 4 10mg hits of DMT each. Each one got me more and more lifted. At this point I was still rolling from the ecstacy. I immediately felt the psycilicybin like qualities once again. Patterns began to swirl, the walls got bubble, like they were the liquid in a hot cauldron. My friend did a light show like thing to the beat of some techno that we had with all the lights off. Immediately my vision was filled with the tracer of the light he was using. When I closed my eyes, there were significant closed eye visuals in which I felt like I was looking through a kaleidoscope, only it was rotating at an extremely fast speed, for the shapes were getting tracers on them. We smoked two more joints between us and our girlfriends went to sleep. My friend and I decided to stay up a nd drink a little, since we'de have to get up at 10:00 in the morning to leave the hotel and wouldn't be able to drink on the way back. We set up shotglasses and prepeared to do as much of an hour of power as we could with the 3 40oz of 9% canadian beer we had. We started at 4:18 AM. At 4:24, my friend chugged a subway cup foll of the beer. We continued the game to 4:28, where he chugged another subway cup of beer. I continued drinking until around 4:35. I was pretty buzzed from the alcohol at this point, but noticed no feeling left of the DMT, and only a minor E buzz. Me and my friend smoked another joint. I took a shower, and then we both went to sleep around 5:30. I felt asleep quite easily, but was woken up in 4 hours in order to try to clean up the room. We left Quebec after this to return to Maine, still very much buzzed and equally jello-brained with our thoughts.",
  "I had done DMT and ecstacy on seperate but numerous occasions before, however I had not done ecstacy without psycilicybin or mescaline in about 5 months. The MDMA enhanced the DMT and the DMT enhanced the MDMA. I would probably never do DMT again unless I had ecstacy with it because the experience was so much different than the normal 5-MeO-DMT trip. It lasted longer, was more intense, and had for more of a true hallucinagenic trip to it. I felt in control of my mind and body and did not feel scared or overburdened at all. The entire experience was very enjoyable and uplifting on the mind.</p>"
 ],
 "erowid": {
  "id": "31093",
  "citation": " Candyflipper. \"Journies to New Countries: experience with 5-MeO-DMT, MDMA, Cannabis & Alcohol (ID 31093)\". Erowid.org. Dec 1, 2007. erowid.org/exp/31093",
  "substance": "5-MeO-DMT, MDMA, Cannabis & Alcohol",
  "views": "3459"
 }
}
