{
 "title": "Moon Alley",
 "author": "Brendn",
 "citation": " Brendn. \"Moon Alley: experience with Dreams (ID 50499)\". Erowid.org. May 4, 2006. erowid.org/exp/50499",
 "substance": "Dreams",
 "bodyweight": "",
 "report": "<p>My dreams are what some say Lucid, then again they're not. Just like i'm in complete control half the time the other half completley out of control but this dream stuck out like nothing else. I was sobor and usually dream quite intense when on a drunk or stoned but this time around was different.</p><p>The dream..</p><p>I was at a place intensely hanging out with my old buddies like I can't describe how never-ending and real life like that part was until I was walking down my old back-alley in another part of the city, (that back alley was kind of a hilly slope going down towards my house and my neighbours, the top end of the uphill I could go straight into fields or left or right onto streets the bottom was a oneway left out to the main road)</p><p>So I remember walking down the hill and feeling very mystical as if I had a certain power over any of the creatures or magic shit that might be lurking down the road behind trash cans and trees and yards, almost like a mushrooms trip and looking back as I was going down the alley was grey.... everything that was sky was grey. and for a moment it felt as if I could go one of two ways like there was a being calling me to the left through a fence (not a being like God but rather like an elf or sum shit) Or I could go through the right fence just a feeling it was and then I looked down and vividly just before my old place, found a weird blob shaped mirror it was smoooth and gave back a funny reflection. Before reaching the Garage of my old house I turned around and started backtracking and then running into 4 or 5 Painter things like where I put the canvas to stand it upright... Grabbing one and heading backdown....</p>",
 "year": "2006",
 "id": "50499",
 "gender": "Not Specified",
 "timestamp": "2006-05-04T07:00:00.000Z",
 "views": "3020",
 "dose": {}
}
