{
 "id": 5051,
 "title": "Mushrooms Stole My Soul",
 "date": {
  "submission": "2007-03-03T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ol' stoner",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.7 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0:15",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "Diazepam",
   "form": "pill/tablet"
  },
  {
   "time": "0:30",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "cookie/food"
  },
  {
   "time": "1:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0:00",
   "amount": "400 mg",
   "administration": "",
   "substance": "Caffeine"
  }
 ],
 "report": [
  "For some time before this trip I am about to explain, I had been quite unsatisfied with my life and I felt that I needed a new outlook on things.  In the past I had done some experimentation with mushrooms and had been very satisfied with the effects and had great respect for this fungus.  While I did enjoy the previous trips, the after effects where very harsh.  For several days after both my previous trips I was unable to look at the world as I had before. The trip itself was almost too much even though I only consumed no more than 2.5g.",
  "Even though I wanted an extremely powerful trip this time, I didn't want the experience to be negative, so having used valium before and noticed its powerful calming effects, I decided to get ahold of some of it for this trip.",
  "I decided beforehand to take 400mg of caffiene and a weed cookie to intesify the trip even more.  I wanted to use the caffiene so that I would be highly alert during the duration of the experience.",
  "The entire day I mentally calmed myself and prepared myself for the trip. I mixed the shrooms in some delicious applesauce and consumed the mixture around 11:00pm. At about 11:15 I split a 5mg valium in half and took one of the halfs. I sat around wathing TV for another 15 minutes before I consumed the weed cookie, which contained about 1g of commercial weed, at 11:30.",
  "I continued to watch TV until about 11:45 when I noticed that everything felt and looked just a little bit off.  I wasn't quite sure whether it was the valium, the mushrooms or both that where beggining to kick in.  But either way I put on my jacket and took my CD player with the Requiem for a Dream soundtrack and went outside to take a walk.",
  "When I got outside I could definitely tell the shrooms had kicked in but it seemed as though the valium had greatly stunted the full effects of the fungi. I was greatly dissapointed, so at about 12:00 I took out my bubbler and proceded to smoke a bowl of some incredibly powerful kind bud that I had bought a few weeks earlier.  Even after I had finished the bowl I still couldn't feel the full effects of the shrooms, so decided to sit in the back of my truck and listen to the Requiem for a Dream soundtrack.",
  "As soon as the first note of the CD sounded I was rocketed into the full effects of the mushrooms.  The clouds became the most wonderful things I had ever witnessed, and I remember realizing that I was in for an incredibly intense trip. While I sat in the bed of my truck the trees began to take on faces and bodies, and I saw occasional flashes in my peripheral vision. Everything took on an extra layer of colored patterns, and the sky turned a bright blue even though it was in the middle of the night.",
  "About 15-20min after these hallucinations began(I'm not quite sure about the time but I remember noticing that I was several tracks into my CD) I felt as though the mushrooms were taking my soul, my ego, and my very own indentity. A very small part of myelf screamed at me to fight the mushrooms and keep my soul, but thanks to the valium most of me didn't care that I was losing my very own identity.  As I lost my soul the music rushed in to fill the void where my soul and ego had once resided.  Once I had fully lost my ego, I suffered from total amnesia.  I didn't know who I was, what my name was, where I was, and who my friends and family were.",
  "This continued for at least an 1 and a half hours.  During this time it became incredibly cold, it must have been 20 degrees, but I didn't care, there was no 'I' to care.  After that 1 1/2 hours I began to regain my indentity and I realized that I was beginning to freeze.  The instinct of self preservation took over and amazingly I was able to make it back inside my house and into my bed.",
  "The next thing that I remember is that it is 4:00 in the morning and I am laying in bed trying to figure out who the hell I am. Very slowly I began to peice things together and retake my ego. During this entire time that I rebuilt my indentity, I felt an overwhelming sense of dread and depression as if I had the lost the most valuable thing in the world but didn't quite know what it was.",
  "I didn't sleep at all that night, I stayed trying to remember who I was.  The next day I did some deep personal soul searching to try and really figure what my newfound life was for and what I should do with it.",
  "This trip accomplished exactly what I had hoped it would: It gave me a new sense of purpose in life and a completely new outlook on the world.  For those who are seeking the same thing, I whole heartedly suggest taking the same path as I did."
 ],
 "erowid": {
  "id": "31107",
  "citation": " Ol' stoner. \"Mushrooms Stole My Soul: experience with Mushrooms (P. cubensis), Diazepam, Cannabis & Caffiene (ID 31107)\". Erowid.org. Mar 3, 2007. erowid.org/exp/31107",
  "substance": "Mushrooms (P. cubensis), Diazepam, Cannabis & Caffiene",
  "views": "4203"
 }
}
