{
 "title": "True to Thai",
 "author": "Teehee",
 "citation": " Teehee. \"True to Thai: experience with Kratom (ID 50529)\". Erowid.org. Mar 31, 2006. erowid.org/exp/50529",
 "substance": "Kratom",
 "bodyweight": "175 lb",
 "report": [
  "<p>Several people at work use this.  It truly works like the Thai-worker shpeel.  This experience was not my first use of Kratom.   This was a limited dose with no prescription meds., CS, or alcohol in my system.  The dose may have been more like 2.25 to 3g.  I'm just providing my maximum approximation so Kratom's strength will not be grossly misinterpreted.",
  "A gentleman at work gave me some Kratom Powder.  He did it in a way one would if it were Cocaine or any other CS.  He was giddy as if he had some of Escobar's and no one else did.  I had already tried it and loved it.  I drank shortly afterward and feel this experience is more appropriate for submission:",
  "I sat in the seat of my truck turning on the football game I had missed the first half of.  I threw the amount of Kratom he had given me back (down the hatch) and chased it with about 10oz. luke warm water.",
  "I had an hour and a half drive ahead of me.  I'm normally not one to listen to sports on radio unless a playoff but I listened today. ",
  "After 15-20 minutes a feeling that I've felt before came over me.  It was Kratom.  It wat similar to a Tramadol feeling but much more intense.  I was extremely focused and more capable of multi-tasking.  The feeling comfortably spread throughout my entire body.  There was nothing bad about it. ",
  "I heard every play and envisioned it while shifting gears in my under powered truck.  I have never been so focused on a radio telecast before in my life.  Granted it was a good game but, I didn't find that out until late in the 3rd quarter.  It did not diminish my driving ability one bit.  It definitely enhanced it.  I had already worked 12 hours and am faced w/a lengthy drive home and I love it.",
  "I can understand how this would be a good alternative for alcoholics, drug attics, and ADHD sufferers.  It does make me feel focused and fantastic with no ill side effects or any other drug present.  I wasn't in a bad mood but Kratom put me in a better one.  However I do know that just like anything else, too much of a good thing can and usually will be bad.</p>"
 ],
 "year": "2005",
 "id": "50529",
 "gender": "Male",
 "views": "18918",
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2006-03-31T08:00:00.000Z"
}
