{
 "title": "The Cannabis Catalyst",
 "author": "Willzyx",
 "citation": " Willzyx. \"The Cannabis Catalyst: experience with Mushrooms  & Cannabis (ID 50537)\". Erowid.org. Jan 31, 2008. erowid.org/exp/50537",
 "substance": "Mushrooms  & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  "DOSE: T+ 0:00",
  "2.4 g",
  "oral",
  "Mushrooms",
  "(dried)",
  " T+ 3:30",
  "0.2 g",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>After much research, I decided that I would give mushrooms a try. The only previous drug experience I had was with alcohol, marijuana, and opium. I had recently become interested in psychedelics after I had witnessed a few friends' experiences with mushrooms and LSD. My friends, whom I trust with my life, and whom I feel know my personality very well told me that I would throughly enjoy the mushroom experience. A few people suggested eating a half-eighth for the first time while others suggested a full eighth. Eventually, me and my two co-trippers ('A' was a mushroom veteran, and 'J' was a fellow newbie) decided to purchase a quarter and split it three ways. I was told to eat very little during the course of the day because this would prevent much nausea after ingestion. I also heard that vitamin C was beneficial to the trip's effects so the only thing I ate all day was a large quantity of tangerines and oranges.</p><p>Once we weighed the mushrooms quantity out into 2.3g, 2.3g and 2.4g, we each took our portions, balled them up and started chewing. I personally love the taste of all kinds of mushrooms as it is one of my favorite foods so the taste did not bother. I was simply reminded of a portabella that was far past it's prime, something that did not phase me. I chewed the combination of caps and stems for a good 10 minutes and held the mush in between my gums and my lip for another five before swallowing. 'A' on the other hand detests the taste so he was quicker to swallow his supplement. J chewed his portion for 10 minutes as well, and employed the same 'dip' method as I did. The mushrooms were swallowed at 7:00 pm. A informed me that it would be an hour before anything would start happening to us, which was good since we had to drive 20 minutes to pick up his hookah (I left the driving duties to A), and I had to pick up a few six packs since I had invited some non-tripping friends over my place.</p><p>T + 0:30 - I'm starting to feel an anxiousness from deep within. Perhaps it's just my mind playing tricks on me since I am rather excited for the upcoming trip, and I am with my two good friends. I ask if either of them feel the same way and they agree. We get to the house to pick up the hookah and as I step out of the car I start to feel slightly off-balanced and nauseous as if I am stepping out of car for the first time in 5 hours. I could best describe the feeling as being slightly buzzed after a few beers. My anticipation and joy grows as I remember numerous experiences mentioning that nausea is a good thing.</p><p>Once the hookah is secure in the car, we drive to the six pack shop five minutes away. As I get out of the car, my balance is more distorted then before. As I walk from the parking lot to the store, I feel as if I'm almost being pushed towards the store. Again, I have experienced this effect before when slightly drunk. I purchase the beer without any problems and get back into the car. We start heading to my house which is 15 minutes away. Everything that A & J are talking about seem exceedingly humorous to me for no apparent reason (other than the 2.4 grams of mushrooms residing in my stomach) I start laughing quite loudly and A and J join in. It has dawned to all of us that is going to be a great night of hanging out doing what we all enjoy most. Sitting outside, smoking hookah, and listening to music.</p><p>T+1:00 - We arrive at my house at 8:00. I step out of the car and notice that my balance has gone back to normal and my nausea had subsided. I also notice that everything in my neighborhood seems much crisper as if I were wearing prescription glasses which I do not. I ask A and J if they are experiencing the same thing but they notice no apparent change in visual clarity. When we get inside I completely forget that we have to prep the hookah for setup and I start walking around my house for no apparent reason.</p><p>Every time A or J asks me to do something I start to do it but get sidetracked immediately after. For example, J asked me for a sweatshirt so I went to my room to get it and as soon as I get there I forget why I came. I sit down to play with Itunes and it's not until J yells to me 5 minutes later that I remember his request. I give him the sweatshirt and tell him I'm getting horribly sidetracked trying to accomplish basic tasks. He laughs in agreement as he confesses he just remembered A asked him to help clean the hookah and he's been playing with my terrier instead.</p><p>After a half hour of cleaning the hookah (something that should take 5 min) we head out to the backyard. My friend K shows up just as we are setting up which is perfect since he has the speakers for the Ipod. After setting up shop, I realize that my back porch is very cramped and that 2 more people are on their way. I decide that we must move everything into the center of the yard. I am starting to feel increasing frustrated because every time we sit down to chill and smoke, something has to be done, whether it be to get an extension cord, extra chairs, etc...</p><p>T+1:45 - I'm still not really feeling any different then before. My two other friends show up and join us in the yard. After 15 minutes of hookah smokiing, I begin to feel different. I am expecting to see magnificent things appear in the yard, but instead, a wave of euphoric relaxation rolls over me. I realize this is the first time I have chilled out with friends around hookah all semester, and it's long overdue.</p><p>T+2:00 - It is only after my friend asks me if I'm cold that I realize I am in shorts and a t-shirt and barefoot, while everyone else is bundled due to the fact it was around 35 degrees out. I'm pretty confused as to why I'm not cold but just shrug it off. I let my dog into the backyard and I run about with him. It has rained all day so the ground has a marshy feeling to it and feels great. I start to see interesting textures in barks of trees and bldes of grass. Folds in the bark expand and contract but only slightly. I inform A and J but they are not seeing anything of the sort. It truly feels wonderful to be alive and out in the yard breathing in the crisp February air. Though the visuals do not persist, I feel more and more euphoric and am convinced things will be picking up any second now. After 15 minutes the euphoria fades and the yard becomes cold, dark, and wet, and I no longer have much desire for it. I am confused why this is happening. I trun to A and J to ask how they feel, and they respond they both are pretty beat and their initial feelings have faded away. A says the mushrooms were probably premature and would not be effecting us anymore. I become quite disapointed because the feeling of escalating joy came to an abrupt halt and now everything seems back to normal.</p><p>T+3:30  After watching some of The Last Samurai, I tell my guests I am tired and want to retire to bed. One friend asks me if I would like to smoke a nightcap chillum with him and I oblige thinking at least I can get stoned without being disapointed. I take four decent hits and hold them in for 15 seconds. I got back inside as everyone leaves to get the trash to put out. I decide to walk my dog so I leash him up and head outside. As soon as I get to the bottom of the driveway BAM!! Everything starts wobbling in and out. I am an experiened marijuana smoker and I could assure this was no effect from just being high.</p><p>I look to my left and all the trees and houses appear as if printed on on 2-d sheet of paper in front of me. And this sheet of paper is folding in and out. I look to the right and the same thing is happening. But straight ahead, I can perceive the normal depth. As I start walking, the wobbling subdues, but I start to hear noises. If you have ever been at a theme park waiting in line to go on a roller coaster and hear people yelling as they fly by on the ride, this is what I meant. This kinda bugged me out so I decided to head back in.</p><p>T+4:00  I checked my eyes in the mirror and the pupils were completely bugging out. I laughed to myself as I imagined myself as a giant 6 foot fire ant. I went into my room, to put on my Steely Dan collection on random and lay down. As I layed down, I noticed the walls breathing slightly in and out. I was very excited about this because my friends told me this was a common occurrence when on shrooms. I called J and A to tell them to smoke immediately. J said he had smoked 2 bongs and felt nothing except for the marijuana high. A said he would smoke and call me later. I layed in my bed unwilling to move because the walls and ceiling were so intriguing. My bedsheets have a pattern of green dots on them and after a few minutes of laying down, the pattern started to spread to the floor and walls of the room. I layed there in amazement. The pattern was not as predominant as the original but had almost a sun-spots effect on the walls and ceiling. The sunspots then started forming snowflakes approx. 6 inches in diameter and rotating counter clockwise.</p><p>I have no idea for how long this went on but it seemed like an eternity because I was so transfixed on the phenomenom. It was probably more like 10 minutes. Steely Dan's Kid Charlemange and King of the World never sounded so beautiful before. It almost seemed as if the music had to be playing for the snowflakes to spin. I closed my eyes and was greeted by some wonderful visuals of rainbow spirographs waving up and down, cutting against the black background. As the spriographs cut through the background, violet and yellow liquids emerged joining the spirographs' color pattern.</p><p>I looked at the clock for the frist time and realized it was 2 am (I layed down around 11). Soon after I noticed the time everything came to halt, and I became really tired. I called A and he said he smoked a J an hour ago and was seeing all kind of things as well. Lying there trying to fall asleep I realized that the chillum was the first time I had smoked herb in about 2 weeks, so it's effects were pretty apparent. I also realized I had eaten nothing all day except for oranges so this could have contributed to the trip as well. At any rate, it was a very enjoyable experience that I hope I could share with friends instead of alone in the future.</p>",
 "year": "2006",
 "id": "50537",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-31T08:00:00.000Z",
 "views": "3660",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2.4 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "1": {
   "time": " T+ 3:30",
   "amount": "0.2 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
