{
 "title": "Defying Reality: The Spiral",
 "author": "Hopeland",
 "citation": " Hopeland. \"Defying Reality: The Spiral: experience with LSD & Cannabis (ID 50583)\". Erowid.org. Aug 14, 2007. erowid.org/exp/50583",
 "substance": "LSD & Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>Setting:  My apartment, all companions on this trip were well prepared for the trip, spending the previous week getting pumped for tripping, feeling good about life, and allowing every other complication to leave our minds. This was my second experience with LSD.  My first was 1.5 hits and it took 2 hours for me to start tripping, so this experience, while vaguely familiar was much stronger.</p><p>Four friends, A, C, R, and Q, and I were tripping.  Hits were administered around 1:00 pm.  A was on a lower dose than everyone, 4 hits.  C, his first trip, was also on 6.  R and Q were on 8 hits.  The dosage had been doubled without the knowledge of all but one who was tripping.  When I found out, I realized that subconsciously I had known already, and was very happy about the chance for this experience as was everyone else.</p><p>I took my hits and went to take a shower before the trip had truly started.  Before I was able to finish my shower, I felt the initial body sensations.  It took around 10-15 minutes to start tripping. The come up was very enjoyable, yet insane.  Within 20 minutes, I had surpassed my previous trip.  The intensity of the visuals was quite dramatic.  The walls were breathing in their usual fashion, the trip film had appeared over everything, making things appear wet and dripping, and the ceiling was flowing with complex patterns, some lines chasing and coursing around the ceiling, some parts of the ceiling completely loosing place with reality and seeming to expand into the universe.</p><p>I passed through ego loss relatively easily, I have always found it easy to let go and experience what there was to experience. C, as far as I knew passed through easily, and R and Q had no adjustment problems either.  A had slight difficulty.  It may have been seeing the complete change of reality from a more normal perception, but A was scared for some time.  Though he also passed ego loss eventually, he never felt completely comfortable on the trip, but he enjoyed it.  Time left at this point, by our best estimates we imagined 4 hours had gone by, but only 45 minutes had and it seemed like 4 days.  My fellow trippers and I talked and laughed for quite some time.  C had very little to say at this point, he forgot he was tripping many times throughout the trip.</p><p>After what I estimate was an hour of tripping, I came across the most horrifying experience.  I was smoking bud with my friends.  Then, for no true reason, my mind shifted into a private reality.  I could see what was happening, but in the back of my head a reality started to unfold, half overlaying what was happening half a completely separate existence.  In this existence, I saw my fellow trippers wielding knives, stabbing each other, killing each other.  I couldn't tell the others, I believed that if I did, somehow what I was seeing would come into reality.</p><p>I had the strong urge to talk to someone not tripping, to ease my mind.  I left my companions and went to prepare for my journey to find my sane friend, to talk.  I was freaking out and the others were concerned for me. A came in, we talked and I told him what I had been experiencing.  This eased my mind, and as with conversations on acid, the topic changed easily.  I was out of this bad experience, back to enjoyable reality shifting.</p><p>Throughout this trip, we experienced many hallucinations, and amazing closed and open-eyed visuals.  Throughout this time, I locked onto something I came to call the 'spiral.'  It began when I was sitting on the floor, leaning against a wall.  Down my back ran a pure feeling of delight.  I closed my eyes and saw an amazing spiraling vortex.  This felt amazing, but I didnt think of continuing with this, I continued on to other experiences.</p><p>Eventually, I was standing against a wall.  The feeling ran down my spine again, this time stronger.  It felt like amazing energy was escaping through every joint in my back, this feeling spread all over my body, almost orgasmic pure ecstasy of feeling.  I felt a fluid motion coming over my limbs, causing me to start moving with this feeling.  I closed my eyes and embraced this feeling.  With my eyes closed, I once again saw the spiral, this time more vivid, more intense.  I realized that this spiral was surrounding me, my limbs and head had melted into the spiral, torso faded into the spiral, my spine aligning with the motion of the spiral.</p><p>I decided to allow the spiral to carry me, I allowed my limbs to flow with the motions, and soon had some control over the spiral itself.  It was amazing, the others were watching me in this, in my head I knew they were thinking I had lost myself, and no longer knew what was happening.  I explained to them what I had experience.  No one else felt what I had and mostly blew it off.  Throughout the rest of the trip I continued to come back to this spiral.</p><p>I found a second place where the spiral existed, and found other places that caused nothing or negative feelings.  I found the first location to be my favorite.  The trip continued and years seemed to pass, Q threw up chips from overeating, a very frightening thing, though passed quickly as Q showed no signs of agitation and even said that it was amazing to feel.</p><p>After around 10 hours, R found the spiral.  He had discovered it at the second place I had found it, the exact same place.  He described to me the same sensations I had experienced.  I had him try the other places I had tried, and he came to the same conclusions about each spot.  The only difference that was described by him was his ability to see the spiral with his eyes opened; I believe this was because of the higher dose he took.  It seems amazing to me that he, on his own accord, had found the same experience I had.  I watched him find it as he was smoking a cigarette, and I knew what he was seeing.</p><p>This trip was my best and worst.  The good defiantly overpowered the bad though.  At points in the trip I saw the words people were speaking flowing in front of me, other times I saw a grid appear over everything and geometric reasoning seemed to take over, and at other moments I forgot reality and embraced what was happening.  Time became nonexistent, and perception became completely nonlinear.  On subsequent trips, I tried to find the same spiral but have since not been able to; although I have never taken a dose over 4 hits since, but hopefully soon will.</p>",
 "year": "2005",
 "id": "50583",
 "gender": "Male",
 "timestamp": "2007-08-14T07:00:00.000Z",
 "views": "4078",
 "dose": [
  {
   "time": "0",
   "amount": "6 drops",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
