{
 "title": "The Dream",
 "author": "Pridarth",
 "citation": " Pridarth. \"The Dream: experience with LSD & MDMA (Ecstasy) (ID 50620)\". Erowid.org. May 12, 2008. erowid.org/exp/50620",
 "substance": "LSD & MDMA (Ecstasy)",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  "",
  " ",
  "oral",
  "MDMA",
  "(powder / crystals)"
 ],
 "report": "<p>I'd known all week that I was going to take acid.  It would be only my second time.  I really enjoyed my first trip, and was looking forward very much so to my next time.</p><p>I started out the night by meeting some friends at a bar, and later we went to a party at a friend's house.  I got completely wasted on rum and pot, but by the time we decided to start walking to the next house (and party) I was starting to sober up a bit.  My friend (I'll call him E) warned me that the acid was really powerful, and to not take both of my hits at once.  Me, in my infinite wisdom, essentially said 'Fuck you, E!' and took both of them on our trip to the second party.  I held the tabs (my first time was liquid on sugar cubes, this time it was unmarked blotter paper) under my tongue for a couple minutes before swallowing.  The walking helped bring it on rather quickly, undoubtedly the residues of rum and pot in my system helped as well.</p><p>I remember getting to the apartment, but later during my trip I completely forgot about it.  I started tripping heavily when we got there, but at first it didn't feel much different from my first time.  I talked with some people, had trouble keeping my thoughts in order, was fascinated by lights, and danced to music.  Music was pretty darn trippy my first time on acid, but this time it seemed to get under my skin and I couldn't help but dance to it.  My memory kind of blanks in and out for the next six to eight hours or so.  Sometimes I remembered that I was on acid, other times I forgot entirely, and it was like this state of mind was normal.</p><p>During times when I remembered, I wasn't scared at all.  I have one memory of briefly wondering if I'd permanently fucked my mind over, and this would never end, but I banished that thought.  I went from wanting to be around lots of people, to needing a bit of quiet, but still not wanting to be completely alone.  At one point I realised that most of the people there were on acid as well, and I remember this being shocking to me -- realising that they were almost as messed up as I was.</p><p>The times I didn't remember, I wasn't scared.  It was just, weird.  I find it so hard to describe now.  At one point I was sitting in a spare bedroom with two friends, one of whom was sober, and I found even simple movements very hard to co-ordinate.  I managed to smoke a cigarette, and ash in the ashtray, but these took great effort.  Apparently I was chainsmoking, although I don't really remember that.  At one point a friend and I were talking about random things -- and being that I didn't know I was on acid, I didn't know she was too.  So the conversation was rather disjointed, and jumped around a lot -- at one point I realised this, and asked why we were talking about such things in such a way.</p><p>My sense of time was completely thrown off.  Some things seemed to take forever, others flew by.  I'd lay down for a minute and I'd be there, staring at the wall, for half an hour, even though I thought it was a few moments.  Or I'd lay down for a few moments, but I'd think it was hours and when I sat up I'd have no memory of what happened before.  It's like I was awake, but dreaming, really.  The best way I can describe it is similar to how I dream.</p><p>At one point some of my friends were pretty concerned, and the party host gave me some pure MDMA to try to help calm down the visuals.  He only has powdered form, and I've never railed anything in my life, so my acid-befuddled mind decided to eat it (thank god for a large bottle of water nearby.)  I have no recollection if they helped 'calm down the visuals' or not, because it wasn't really visuals that were messing with me -- no hallucinations of things trying to eat me, no hand of God descending from the sky, nothing.  Don't get me wrong, I was having visual hallucinations, I even had tunnel vision at one point, but I've never really hallucinated things that weren't there, unless it's colours.</p><p>After six or eight hours or so, I came down enough to look after myself.  I was still high for another six hours, however, with feelings of euphoria, lovely kalidaiscopes of colour, and a kind of synesthasea with the music (combination of music causing colours/patterns to form in my vision, along with my body to move in certain ways.)  I had interesting conversations with people about drugs, Earth, sex, music, and random other topics, but less disjointed than before -- I could keep better track of my thoughts.</p><p>All in all, I wouldn't call it a bad trip, but I definetly couldn't take care of myself for a while there, and I didn't even remember who I was.  I really think language drastically fails in describing what I was experiencing for those six/eight hours.  I think the only reason why I wasn't scared the times I forgot, was because it just seemed normal.  In that way dreams have of being totally weird to your waking mind, but when you're dreaming them everything seems perfectly normal.</p><p>I learned some pretty interesting things about myself in the 'second half' of my trip, via discussion with others.  It's like I had to rebuild my mind on my own from a period of insanity, like how you slowly become aware after waking up from a vivid dream.  I'm hoping that the next time I do acid, I'll not be so stupid and only take little bits gradually, and hopefully I can achieve something similar to the second half of my last trip.</p>",
 "year": "2006",
 "id": "50620",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-05-12T07:00:00.000Z",
 "views": "5536",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  }
 }
}
