{
 "id": 5062,
 "title": "Blazing with Joy",
 "date": {
  "submission": "2001-12-18T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Bear",
  "weight": 125
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0:15",
   "amount": "0.5 hits",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:35",
   "amount": "0.5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "I'm not much of a partygoer. A couch, a TV, a bong and thou... Bear I am named, and bear I am.",
  "I'd had acid a few times before, noting massive quality disparities from one batch to the next, and E's about three times... and was disappointed every time. (E in Australia (Sydney) is massively expensive and hence it's not safe to buy from anyone you don't know/trust).",
  "Well, the changeover from 1999 to 2000 was here at last. I never thought it would happen. I always thought I'd die first. I didn't. How could I enrich the experience?  Pot was a must. A quick phone call secured a quart of hairy red bud from a trusted source. It was perfect- dry but sticky, dense and smelling fresh and resinous.",
  "I happened to find an envelope in my posession which contained two tabs of cut-my-balls-off-if-it's-not-amazing quality Eccy. Nestled next to that were two anonymous blotters. Yes, they had something printed on them, and no, I (for some reason) can't remember what it was. A shame, as it turns out.  The tab was yellow, with sparse light pink and blue speckles. It had the image of a fish skeleton pressed into it. It looked like the graphic for the band Fishbone. I guess the beautiful visual appeal of the tab made me remember those details.",
  "The setting was my first outdoor dance party, New Year's, 1999. Held in a remote location outside Sydney, the evening was spent locked away from the outside world. No media beatups. No up-to-the-second soundbites that swarm the consciousness like confetti before a fan... no way of knowing if the world was dying about us as we visited a unique pinprick in time.",
  "As an outdoor party, lots of different people were there... ferals, ravers, speed queens and (unfortunately) mindlessly pissed Irish backpackers. Each to their own...",
  "I think I represented an unsettling element. I was all in black- jeans, combat boots, a t-shirt making a reference to 'hippie crap' and most unfortunately, a long oilskin raincoat... in miltary cam. I can only say that it was the only rain-stopping garment in my life at the time, apart from yellow vinyl rainpants, and no way was I gonna wear them. Then I went around helping people and being as friendly and open as possible. Helping city kids pitch tents, sharing stories and introductions... the atmosphere was great and I was making a conscious effort to wordlessly remind people not to judge books by covers.",
  "The dance arena by day was awful. I mean the site was good but it looked seriously undersupplied for lights and so on. I was wrong. I don't know what time the music started but it was about 15 minutes after the sun set. People started dancing. My companion of the time (entire identity blotted from memory due to respect for privacy) and I decided to make a start on the chems.",
  "The blots were first, having been conveniently presliced into quarters. Two quarters each. Half an E crushed between teeth (tasting of pepper) about 15 minutes after washed down with gatorade. This was followed by another quart of the blot about 20 mins later. What can I say? I fear few chems and I knew these were seriously guaranteed.",
  "I first felt the urge to dance about 15 minutes after the last blot hit. Not a mad compulsion, just a need to feel active and alive in the cool, moist night air. No pollution, no stale air-conditioner smell, no painful sounds reverbing off walls because talentless losers think volume equals DJ talent. The air felt like pure sex on my lungs after months in the big city.",
  "I found my rhythm in the dance. I saw that the place was transformed by night. Two arenas, one fast and fun, and one cool and trippy. The trees stood like sentinels about us, holding us protectively as we revelled. Light played across their impassive faces and they swallowed our echo. Energy seemed to explode from within us and rush outwards. I saw the feng shui, the dragon tracks, and we were all blazing with a positive light that rushed out to heal the land about us...",
  "Wow. Good acid. Really good acid. I remember it clear as day. My tactile sense was goig mad with sensitivity. My vision was exploding with rippling three dimensional waves of unreality, like cartoon laid over photograph for a split second behind the waves' passage. I was tripping and in style.",
  "The thought made me smile. Time was unimportant. That thought got me smiling too. The next thing I know, it felt like the top of my head unscrewed- I swear, that is exactly how it felt- and a wave of love and joy exploded through me from the centre of my body outwards.  The combination was wonderful. I think that the acid had sensitised me to the E, and not a moment too soon.",
  "My soul danced naked and alone in a cool night breeze, while the sensation of connection with the clumsy meat of my corporeal body grew fainter as the music took a hold of my reality. I felt free, unbelieveably free, and positive energy blazed within my soul and consumed me. Every experience, every motion, every remote bit of sensory input, was bliss.   I felt remotely connected to my body, but not beholden to it. It was having it's own fun. I was elsewhere.",
  "After however long- it's hard to judge time when so affected- a screen that had been showing trippy visuals all night started a countdown from 500...",
  "On and on the mad dance wound. I remember slipping on some soggy ground and stumbling into a guy next to me and laughing with joy as I babbled apologies. He turned away with a smile...",
  "The time closed upon us. People around me were moving in a syncopation of harmony to the beat of the music and the air around me crackled with light and colour. Little red glowing wrist bands flashed and danced. Headboppers for the 90's rave crowd I guess, but still cool to watch when every sensory input is pure pleasure.",
  "It arrived not with a bang but a laugh. The countdown ended and the film cut to a news braodcast from a well- known global news empire. The reporter announced the arrival of the new year had been witnessed in Sydney, Australia, by the ATM's dispensing $20 and $50 notes at random into the streets. Please remember that at the time, my judgement might have been somewhat impaired, but with no outside evidence I thought that it was true. I mean, the station logo was there!",
  "I smelled a rat when the report went on to state that there were reports of aliens landing near isolated bodies of partying people in the countryside... followed by an animation of aliens cascading down the screen. Then the screen went back to psychedelics, and it all came back in a joyous rush. The dancing took my soul again...",
  "My companion sliced me from the crowd, having tired of dancing.  We sat near the floor, holding each other and sharing the closeness of the moment. I felt There was no reality besides herself and I. The joy in feel was still with me and I swear I could feel the waves of our bodyheat where they met in the air about us. We sat until dawn, watching the psychedelic tent, before heading back for a quick sleep.",
  "We slept for a couple of hours and woke up to a warm, sunny day. Spliffs were engineered and a place was taken up in the warm sunshiny shade under a gumtree facing the trippy tent. Said spliffs were shared with neighbours, especially a couple next to us who used a pad and pastels to sketch as we mellowed. I gently massaged my companion's back and shoulders for about an hour, marvelling at how acute and pleasurable tactile sensation still was. I felt calm, joyous and whole. My demons had left me alone with myself and my chosen companions for a while.",
  "The rest of the day was spent coming down. The acid left occasional jangly bursts of unreality. Bud helped. Love was made- far off the beaten track too- and lo, it was good. Mind-unwindingly good. Bear in mind that I'm only talking about my own side of the experience...",
  "Was it good? The only negative aspect as far as I'm concerned is those damn shimmers of acid-effect that kept recurring for a few days. The rest was pure joy, a cleansing and uplifting experience. I won't say that it's resolved any of my life's deeper fundamental problems, but for one night, I got to feel that everything was perfect and that joy and love suffused me like sunfire.",
  "I lost the black film canister with the remaining half-trip in it but after the event, that's not such a bad thing: drugs like this are a very, very rare indulgence for me and taking more would sully the memories I already had. (Except for the sacred herb- the healer- which calms the spirit after the storm of crude, synthetic chemicals. That's a common sacrament around my neck of the woods.)"
 ],
 "erowid": {
  "id": "3114",
  "citation": " Bear. \"Blazing with Joy: experience with LSD & MDMA (ID 3114)\". Erowid.org. Dec 18, 2001. erowid.org/exp/3114",
  "substance": "LSD & MDMA",
  "views": "8353"
 }
}
