{
 "title": "More Lucid than Awake",
 "author": "Pickles",
 "citation": " Pickles. \"More Lucid than Awake: experience with Dreams (ID 50623)\". Erowid.org. Apr 21, 2006. erowid.org/exp/50623",
 "substance": "Dreams",
 "bodyweight": "",
 "header": [],
 "report": "<p>The most lucid and vivid dreaming I have ever done happened one month after my sixteenth or so Psilocibin cubensis trip, and one day before I tried salvia for the first time. Previous to this, my only lucid dreams had been from ingesting mushrooms or the devil's weed (datura)and falling asleep directly after. </p><p>The first part of the dream, I was walking through my friends dorm hallways, and I remember wondering how I had gotten there, because I could recall perfectly having gone to sleep in my own bed moments before.  It hit me:  Of course this is a dream! I didn't dare think it out loud, because I knew from previous times that thinking that realization would end the dream.  I suddenly appeared outside on the sidewalk, and remembered I wanted to look at my hands.  glancing down at them quickly and back up to the sidewalk every time it seemed like the scene would change helped keep me aware.  I started to look at other things, like bushes, a fire hydrant, and when I tried to look at a car, I lost focus and fell into a different dream.  I may have tried to take in too much scenery at once. </p><p>The next dream surprised me, because I was still lucid.  It was the first time I could maintain focus for such an extraordinarily long time, and another first was maintaining awareness while changing dreams.  A tall, pale mexican woman, completely nude, with very dark hair was lounging in space some distance from me.  My hands at this point were very distorted and I had a devil of a time keeping in  mind that I needed to glance at them.  The womans face was not distinguishable, or else it kept changing.  She was emanating waves of colorful energy that seemed to be blowing me farther away, and after a while I had to let the scene go. </p><p>The next one was comparably impressive.  A giant redwood or pine tree loomed in front of me, glowing an almost painfully bright shade of the most vivid green I have ever seen.  Like creosote or limes.  It faded a darker sky blue as I looked further away from the center. I wanted to climb it.  As I started to intend that, I was suddenly standing at its base.  It was monstrously huge.  I could not have walked around the trunk in less than ten seconds, as if time or distance had any bearing on this unfathomable mysterious thing.  I pulled myself up, hand over hand in front of my eyes so that I could follow this to its end.  there was no top of the tree, only me climbing, the scene fading to fog, and me waking up.  A perfect precursor to my salvia experience.</p>",
 "year": "2006",
 "id": "50623",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2006-04-21T07:00:00.000Z",
 "views": "3583",
 "dose": []
}
