{
 "title": "A Fainting Spell",
 "author": "Anon",
 "citation": " Anon. \"A Fainting Spell: experience with Mushrooms - P. cubensis & Cannabis (ID 50686)\". Erowid.org. Apr 28, 2007. erowid.org/exp/50686",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "52 kg",
 "report": "<p>I am 21 and have been taking hallucinogens for 3 years, experimenting with LSA, LSD and shrooms. Each trip I had was experienced with my boyfriend, we started at the same time - before meeting him neither of us had tried hallucinogens</p><p>I have always been very mentally prepared for each experience. If I was starting to go down a bad path, I have always been able to pull myself out of it; one experience caused  me  to forget who I was, even my name, that time I also had mo memory of ever taking any drug. But I never got freaked out, or lost control. I have also lost all intelligent thought, and been stupefied for hours  thinking that I was never going to be able to regain normal thought. Each bad moment I have had teaches me something,  I value what I learn and turn the bad feeling into something positive.</p><p>However, one experience I have had I have not been able to understand. My boyfriend and I decided to each take 20 grams of fresh mushrooms each  a relatively low amount for us both at that time. He was living in halls of residence, we took them in his room during the day, we were both well rested. It was a positive light trip, we spent most of the time in each others arms enjoying the atmosphere.</p><p>But about 6 hours into the trip, when the visuals where diminishing and we were both regaining proper coherent thought. By boyfriend rolled a spliff, we hade to move to his bathroom to smoke it  these Nazi halls had really sensitive smoke detectors in all the bedrooms. But that was never really a problem, he was lucky enough to have a really spacious bathroom, and it was a familiar space to smoke in. Now, I have to make one thing clear, in those days I smoked weed nearly every day, I had a very high tolerance. And the spliff my boyfriend had rolled was not strong.  We always smoke weed when the effects of the hallucinogen start to diminish.  This time, after two or three tokes I started to feel a little nauseous  A little like the whity feeling you get when you first start smoking weed, and you had one toke too many.</p><p> As the sensation increased I felt the strongest need to drink water that I have ever had in my life. I leaned over to the sink and started drinking mouthfuls of it with my hands, I didnt get much down before I realized that I wanted to lie down. I told my boyfriend that I felt dizzy, although the feeling  I had could not really be categorized by dizzy. I stood up slowly and started towards the door. I never made it. I blacked out. According to my boyfriend I was only out for about 30 seconds. I dont remember falling down, I remember the feeling of the doorframe trapping my fingers as I went down. But I only felt a tightness, no pain.</p><p> I woke up on the bathroom floor, with a sore head from banging it on the wall. The fingers on my left hand hurt from getting trapped between the door and its frame. The weird thing is, is that during my blackout I had a vivid and very real hallucination that I was back in bed with cuddeling boyfriend, the duration of this scene seemed very much longer than  the 30 seconds that I was out.</p><p>I have not heard of people blacking out like this during tripping. Prior to this I had never fainted or lost consciousness. The only thing that I could see as the cause would have been the spliff, but thats strange as nothing was done differently on that trip.</p><p> Im really interested if anyone could cast some light on to the situation, anyone had similar experiences?</p><p>It did not discourage me from phsycodelics. I have since tripped many more times and have never experienced anything similar.</p>",
 "year": "2006",
 "id": "50686",
 "gender": "Female",
 "timestamp": "2007-04-28T07:00:00.000Z",
 "views": "6269",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "20 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(fresh)"
  },
  "1": {
   "time": " T+ 6:00",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
