{
 "title": "AMT Thoughts",
 "author": "FlowGnome",
 "citation": " FlowGnome. \"AMT Thoughts: experience with AMT (ID 5071)\". Erowid.org. Feb 9, 2001. erowid.org/exp/5071",
 "substance": "AMT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "AMT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Having tried AMT several times at varying dosages, I thought I would write a little about the effects.  I believe this substance has a great potential when done with close friends, moreso than MDMA, as it opens up the emotions while providing extreme clarity at the same time.  The problem I have found with MDMA is that you either open up entirely, spill your guts about everything even if it is totally inappropriate, and generally talk everyone silly, or you try to watch yourself and keep it under some level of control and end up not saying much at all.  The conversation on MDMA almost always turns to love and deep emotion.</p><p>AMT on the other hand provides a similar feeling of contentedness, and exposed emotions, but it is much easier to realize what should be said and what shouldn't.  There is not as much urgency to conversation because the short term memory is still very much intact, and it is possible to have a normal if more meaningful conversation without worries.  I also find that the bonds formed (or broken) while on AMT seem more permanent and real, whereas friendships formed or strengthened on ecstasy can leave one questioning how real they are later.  Painful memories were easy to bring to the surface and work with without affecting the quality of the trip.</p><p>Over the dose range tested from 45mg to 130mg, the ecstasy-like feelings did not vary much, maxing out at around 66mg.  The visuals on the other hand became stronger and stronger at higher dosages, along with the amphetamine-like body load and muscle tension.  Even at 130mg the body load was not annoying.  The visuals are quite unlike those from other substances that have comparable visual strength (2C-T-7, LSD), taking much more realistic forms and having a sharpness that is unlike the strong patterns of 2C-T-7 or the flowing melting visuals of LSD.  The visuals were not very distracting, and could be ignored, although this was not something that I would have wanted to do.</p><p>The general word for this stuff is 'content'.  Any music sounds better, even music I don't normally like, and it is a great joy to dance on.  I would seemingly be happy with whatever I was doing when the effects began to take hold.  Sitting down and talking was just as much fun as energetic dancing.  This is also unlike MDMA for me, where in many situations just wanting to be doing something else brings me down quite a bit.  It is generally very relaxing, with none of the edginess of high dose acid or any dose 2C-T-7.  The only downside is the tiredness about 12 hours into the trip, but this can be taken care of with sleep at that point as the primary effects have usually subsided by then.</p><p>As for tolerance, none was noted for AMT by itself, although a cross tolerance with LSD was noted when AMT was done 48 hours after a high dose LSD trip, but this only seemed to affect the visuals.  No combinations have yet been tested, but I believe it would go well with low dose LSD as kind of a visual booster.</p><p>All in all, I would say AMT is definitely up towards the top of my list.  It is much cheaper than MDMA and at least to me provides preferable effects.</p>",
 "year": "2001",
 "id": "5071",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-02-09T08:00:00.000Z",
 "views": "15721",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "AMT",
   "form": "(powder / crystals)"
  }
 ]
}
