{
 "title": "Gleeful Fear",
 "author": "J.Lost",
 "citation": " J.Lost. \"Gleeful Fear: experience with MDMA (Ecstasy) (ID 50734)\". Erowid.org. May 12, 2008. erowid.org/exp/50734",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "138 lb",
 "header": [
  [
   "DOSE:",
   "1.5 tablets",
   "oral",
   "MDMA",
   "(ground / crushed)",
   "",
   "0.5 tablets",
   "insufflated",
   "MDMA",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>Well, here is where I learned more about myself than ever before. I had tried acid (1.5 blotter) 2 months prior to this experience and loved absolutely everything about it. I also discovered that often on psycodelic drugs (acid/mush/mescaline) my mind creates images that are designed to frighten me. However it seems that anytime these frightening images would appear it would just only take me deeper into the most blissful parts of the different drugs it has happened on. Occasionally I would delve deep into these scary euphorias, but if it ever became overwhelming I could simply turn on a few lights and everything would return to normal. I think I also may react much more to shadows than light.</p><p>I had obtained 4 pills from my girlfriend who had left them for me and my most unique friend ever. We weren't sexual with each other at all but we would always make it clear that we were the same person in different bodies. We loved each other like birth brothers. He will henceforth be known as CG. We had each dropped a 1.5 parachute and snorted a .5 of blue ferrari pills. Dosing more than one blue ferrari always causes hallucinations for me. I had turned off all the lights for this occasion and had more than 80 tea lights all set up to light the huge apartment (which I didn't deserve). It was absolutely perfect.</p><p>The trip was very normal until about 2.5 hours in. Normal meaning my usual feelings on a strong pill. Being with a best friend helps too of course. We had spent the night just shooting the breeze, listening to music, watching the i-tunes visualizer naked, wrapped only in blankets. A very wonderful time.</p><p>The amazing part of the trip lasted from 2.5 hours in to 4 hours after that. I have a bad habit when I'm on ecstasy. I love to sit in the bath. I of course make the water very hot but I open the window and stand up to cool off very frequently. CG and I decided to hit the bath. My apartment at the time had an enormous bath tub. We sat in the tub together as if it were totally normal smoking our cigarettes and talking about our respective love lives. When all of a sudden I looked towards CG. Half his face was shaded. As I stared into the dark half of his face it all of a sudden leaped towards me and started to morph into some huge purple monster/demon face. I started laughing histerically despite my fear. CG started asking me what was the matter. I threw myself towards him and hugged him so I could no longer see his face and told him simply that 'He was a monster'.</p><p>I don't think I had ever felt so good. The experience sent my heart rate through the roof (a+++). I for some reason still trusted this monster faced man and kindly asked him to turn the lights on. When he did everything went straight to a normal E feeling again. I became intrigued by this bath tub experience and found that in the correct darkness I could achieve it as often as I pleased. Eventually (3.75 hours in) I was frightening myself again to go even deeper into this glee and stared into CGs eyes the same thing happened, but this time for him and me. We leapt apart from each other and quickly turned on all the lights in the apartment and spent the remaining time of our trip jamming on the guitar (me) and the bongo (CG) with the best E feeling I've ever had. Even better than my first trip.</p><p>The come down was barely noticable. At least for me though. At the time I had been living with my girlfriend and so her constant presence always kept me glad. I find that a good way to keep myself feeling good after a trip is to spend a great deal of time with the people I love.</p>",
 "year": "2005",
 "id": "50734",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-05-12T07:00:00.000Z",
 "views": "4757"
}
