{
 "title": "Sparkles, Glitter and Pastels",
 "author": "Anony 5000",
 "citation": " Anony 5000. \"Sparkles, Glitter and Pastels: experience with 4-Acetoxy-DiPT (ID 50758)\". Erowid.org. May 7, 2006. erowid.org/exp/50758",
 "substance": "4-Acetoxy-DiPT",
 "bodyweight": "160 lb",
 "report": "<p>Material - 4-AcO-DiPT/Ipracetin, 24mg gelcap</p><p>Setting - My apartment mostly.</p><p>Purpose - Entertainment and exploration.</p><p>Background - A drug user for less than a year, am 21 now. I have done a whole host of substances, legal and otherwise. Previous psychedelic experience includes ethocin, miprocin, DMT, 2c-i, LSD, salvia, and HBWR seeds.</p><p>+0 - Got home from work and measured out 20mg of ipracetin, and into a gelcap and then my tummy it went. I had wanted to plug to material, but found that it was insoluble in water (and I didn't want to use a gelatin capsule rectally because it caused some gastric problems before). I have work again in the morning, so I'm hoping that the ipracetin won't last much more than 6 hours. I taste a little too, out of curiousity, and find that it's absolutely awful and bitter.</p><p>+0:15 - I start to worry that 20mg will not be enough, and ingest another 4mg.</p><p>+0:20 - Subtle alerts. I watch some TV, then play some games.</p><p>+0:40 - Some minor visual disturbances. My mind seems a little bit offset. +1</p><p>+1:00 - Is this going to develop much further? I still seem to be hovering around a +1/+2. Body load does seem to have increased a bit, as does stimulation. Hallucinations are light, color enhancement and some halos.</p><p>+1:30 - I go outside to my porch and take a seat; it's nighttime and the view is now surreal. I seem to have quickly and unknowingly jumped to a +3 (reminds me of coming up on 2c-i a bit, but much faster). Planes fly by and leave trails of sparkles descending towards the Earth (when I hear people refer to this substance as having a sparkle, I didn't realize it was actually literal).. The trees swirl and warp when I defocus a bit. Sound also seems to be enhanced beyond what I've gotten with the other tryptamines I've tried. People's voices seem to be impossible to decode and understand, though; a neighbour is talking on his cellphone on an adjacent porch and I can't make out a word of what he's saying.</p><p>It gets a bit hazy from here; I was absolutely smashed, worse so than on a couple hits of acid. Thought loops become a problem; I get up to do things, forget what I'm doing, then go back to where I came from and realize what I originally got up for and start doing it again. At some point after being outside for a while I went back in. I noted some numbness in my hands, something that worried me some (I guess this indicates hyper/hypotension? My pulse was way up most of the time).</p><p>I do recall watching a replay of Sonic the Hedgehog 2. The color enhancement was very nice.. The visuals aren't extremely imposing like miprocin, but not much like ethocin either...it more reminds me of LSD. More amazing, though, was the euphoria experienced while watching the game and hearing the soundtrack. I felt as if I was on a strong dose of MDMA, but with a clearer head; everything sounded absolutely beautiful. I felt as if I'd never stop smiling.</p><p>After Sonic I turned the TV on and watched some live concert thing on TV (Bruce Springsteen, maybe? I dunno). The lyrical stuff put me off some, but during the sax and guitar solos I was ecstatic. Definite semblance to MDMA.</p><p>The CEVs are pretty unique.. More random and mazelike than ethocin or miprocin, less weblike than I'd get with LSD. There also seems to be a lot of white, and sometimes a big flashing ball of white fractals. The color enhancement seems to be pastel, like miprocin. There's a lot of changing colors (on walls and rooms and such).</p><p>Most of the rest of this time is spent wandering around in the apartment in thought loops, playing videogames, or sitting out on the porch watching the sky and trees. This stuff also seems superstimulating; I'd like to try dancing on it. It is probably the most recreational indole I've tried.</p><p>+6:00 - I'm still tripping hard, which mostly irritates me now, as I need to go to bed and then get up soon. I try to sleep, but to no avail. I munch some antihistimines and Valerian root and cross my fingers. The CEVs are still coming strong. I have the usual panic when something gets beyond my control during a trip, and talk to some people online about it; they calm me down some. One of the people is my longtime ex, and I expected him to be very upset with me... Instead he seemed to want to help me through this and much as possible, because he seemed to be realizing the only real way to get me to learn lessons about responsibility was to let me screw up some, and tonight I realize I had... Tripping is something best reserved for the weekends. We talk about our relationship some in depth, and I apologize for a lot of the mistakes I'd made. He says not to worry so much about it all, and to get some rest.</p><p>+10:00 - Still tripping some. Sleep is impossible, I'm still stimulated some, though the sleep aids are wreaking some havoc and pulling me down. I feel like I should be dozing off, but something just won't let me. I end up staying up all night and working one of the worst morning shifts ever. Ugh.</p><p>Conclusion: This is great material! Good duration, granted the setting was different... Overall I had a great time, though. The body load does worry me slightly... I did have a lot of tremors, sensations of hot/cold, racing heart, and numb fingers. At times this dose seemed slightly overwhelming, but overall I felt pretty able to deal with it. Between ethocin and this I'd have a hard time deciding which would win... Ipracetin would probably be good for a night out, while I'd prefer ethocin for a night in.</p>",
 "year": "2005",
 "id": "50758",
 "gender": "Female",
 "timestamp": "2006-05-07T07:00:00.000Z",
 "views": "8459",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "(capsule)"
  },
  {
   "time": " T+ 0:15",
   "amount": "4.0 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "(capsule)"
  }
 ]
}
