{
 "title": "Lost In the Om",
 "author": "Lkj",
 "citation": " Lkj. \"Lost In the Om: experience with Meditation (ID 50751)\". Erowid.org. May 4, 2006. erowid.org/exp/50751",
 "substance": "Meditation",
 "bodyweight": "",
 "header": [],
 "report": "</p>I took a meditation class last semester as a way to 'get to know myself.'  I read Hesse's Siddhartha and was feeling spiritually dead next to the main character of that book.  I was a regular smoker of cannabis and sometimes tapped into a higher spiritual mindset while high, but I had never really had a revelation of sorts.</p><p>The classes usually started with breathing exercises and then ended with meditation sessions, lasting from about 20-45 minutes.  For the breathing exercises we would start with our knees bent and our hands together and then slowly extend our body and arms upward, spread them apart, and bring the body and arms back down again, breathing in while moving upward, breathing out while releasing again.</p><p>One day, our teacher (a master of zen mediation at the local buddhist temple) said we were going to do something different that day, a sort of audio-sensory meditation.  In a normal sitting, we would start out by chanting the Om three different times and then we would meditate in silence.  This time, after he finished the third 'Om' he continued to chant it.</p><p>At first, the entire group was in unison.  Everyone chanting 'Om' with the same intensity, the same volume, the same timing.  After a minute or two, as everyone fell into the rhythm of their own meditations, the 'Om's began and ended at different intervals; they were spoken at different volumes and different durations.  And yet, every different 'Om' blended into the same Om.  It is very hard to describe the overwhelming spirituality of this chant, but it gave me the best meditation I have ever had in my life. </p><p>We meditated and chanted for about 30 minutes.  And yet, for me in those 30 minutes time did not exist.  I had thought about the illusion of time and felt that it did not exist before but never had I felt this while completely free of psychotropic drugs.  That meditation session was forever but it was also that moment only.  They turned out to be the same.  The past, present and future blended together to form the eternal Now.  I saw with remarkable clarity the interconnectedness of everything.  I was one with everybody in the room, everybody walking around on the streets outside.  The Om with its ever-changing intensities and intervals while remaining one fluid chant let me see this more clearly than I ever had before.</p><p>The sitting ended and I picked up my bag and walked home, but I was a changed person.  I cannot describe for everyone what meditation can do for them because it is an intensely personal thing which can only be understood in the context of one person's mind and experiences, but I can say that meditation on a clear mind is an amazing experience.</p>",
 "year": "2005",
 "id": "50751",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2006-05-04T07:00:00.000Z",
 "views": "6926"
}
