{
 "title": "A Little Overwhelmed",
 "author": "Anony5000",
 "citation": " Anony5000. \"A Little Overwhelmed: experience with 4-HO-MiPT (ID 50761)\". Erowid.org. Jul 3, 2006. erowid.org/exp/50761",
 "substance": "4-HO-MiPT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "23 mg",
   "oral",
   "4-HO-MiPT",
   "(capsule)"
  ]
 ],
 "report": "<p>Setting - My apartment.</p><p>Purpose - Entertainment and exploration.</p><p>0hr - Consume gelcap. My partners (two of them) also consume gelcaps; 20 mg each for both of them.</p><p>+0:30 - We are feeling this already, but not too strongly. We have a feeling this is going to be strong. We start walking to a local movie theater to see a short documentary.</p><p>+1:00 - OEVs start. Definite +1, starting to approach +2. We arrive at the movie theater and buy tickets; I can't stop laughing as I approach the clerk. Movie starts in about 20 minutes, we wait in a line.</p><p>+1:10 - One of my partners leaves the line, and we follow. He says, 'I'm not sure if I can do this. This is strong already.' We talk him down, smoke some cigarettes, then go back inside.</p><p>+1:20 - Movie starts. I am at a +2. Lots of muscle tension, a little bit of tremors.</p><p>+1:40 - I hit +3; this material is very visual, more so than any I'd done before. The OEVs are intense. I find it difficult to look at the screen; when I feel able to, I can only focus on small parts that begin to morph into complex patterns. Comprehending the film is near impossible at this time. I hold my one partner's hand and try to relax.</p><p>+2:20 - The movie ends, we walk out of the theater. It is dusk now. Visually this is difficult to deal with, and I feel very scatterbrained. Auditory hallucinations are light. Visual and tactile hallucinations very strong; the ground in melting and morphing, colors of buildings are constantly changing, as well as the sky. My one friend seems to be hit about as hard as I was, though the other said he was fucked up but wasn't getting any visuals for the most part. We head back to the apartment.</p><p>+2:30 - I chill with two sober friends in an adjacent room and leave my tripping friends to myself; they are very experienced and know what they are doing. I chat for a while, and they say I seem to be doing well. I am a little paranoid, but it's not too bad.</p><p>+3:30 - I go hang out with my trip partners now. We listen to some music and find that anything with a dark texture is far too much to deal with in this state. I start playing with a switchblade I had been carrying around that day. My one partner (a very experienced LSD user) takes the knife from me and puts it somewhere safe. We all relax and watch some comedy shows (Sealab 2021 is too funny).</p><p>+4:30 - Experienced partner gets a phone call and departs for about an hour to discuss things. I relax with other partner and watch more TV. Still tripping very hard, lots of impressive OEVs.</p><p>+5:30 - My away partner returns and we all talk and listen to some music. I get the feeling something is very wrong; negativity starts to brood in me.</p><p>+6:00 - I isolate myself from the other two in my bedroom. I curl up in the corner of the room and tear empty cigarette packs and paper apart. I am in a very bad state of mind, very violent.</p><p>+6:45 - My partner comes to check on me now. He sees I'm not doing okay and tries to console me. Unfortunately, my mood is pretty hopeless at this time. He heads out to hang out with our other partner again and tells me to shout if I need anything. I still feel very violent. I am falling down to a +2 about now.</p><p>+7:00 - I go upstairs and try to hang out with my friends again. I ask for the knife back, I really want to cut things up; my friend, intelligently, denies my request. I go out for a pack of cigarettes.</p><p>+8:00 - Still tripping, mood is improving a little. I hang out with my partners and try not to think about negative things. Falling to a +1.</p><p>+9:00 - Back to a +1, the miprocin is on its way out. I am doing better.</p><p>+10:00 - Still a bit sketchy, but mostly well. I go to bed with my one partner (the one who tried to help me when I broke down earlier), cuddling with him. I start crying and talk to him about some things that have been happening recently. I apologize a lot for falling apart during the trip; him, a very experienced user, suggests I take a break from psychedelics for a while until I can resolve some issues that are going on in my life. I agree. We go to bed, sleep is fine.</p><p>I had thought this dose would be okay, as I usually seem very comfortable with high doses, but this material took me for a ride. It was very visual and intense for me and my one partner, but my very experienced partner said he wasn't getting very many visuals at all and that he was dealing with it fine. I would like to repeat maybe, but not for a long time -- I think a psychedelic hiatus, as had been suggested, is a very good idea for now.</p>",
 "year": "2005",
 "id": "50761",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-07-03T07:00:00.000Z",
 "views": "16481"
}
