{
 "id": 5081,
 "title": "A Drive Through the Cornfield!",
 "date": {
  "submission": "2004-07-27T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "TripleB",
  "gender": "Male",
  "weight": "240 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  },
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DiPT"
  },
  {
   "time": " T+ 5:00",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": "2 lines",
   "administration": "insufflated",
   "substance": "Cocaine"
  },
  {
   "time": "0",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "5-MeO-AMT"
  },
  {
   "time": "0",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  },
  {
   "time": " T+ 8:00",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": " T+ 11:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "<p>Ok. I have 24 milligrams Foxy Methoxy (5-MeO-DiPT) measured with mg scale in gel cap, 2 lines of cocaine, About 500 mg's of 5-MeO-AMT measured with mg scale in gel cap,  and a half ounce of good pot. I took a road trip to my college I attended last year to visit some friends for the weekend and brought some fun. Times are not accurate but used as a timetable throughout the story. This entire experience lasts over a period of 24 solid hours.",
  "10 A.M. We go to my car and wake n bake with a full pipe and smoke a cigarette. K says she wants to start the day early and suggests we go up to her room and take the clear, crystally, horrid tasting foxy methoxy. Ok, so I take the gel cap apart and I decided I wanted to insufflate it. ITS THE WORST TASTE IN THE BACK OF YOUR THROAT EVER. K takes hers apart and dips her finger in some water and puts it on her tongue. She also complained of its horrid taste and it almost makes her vomit, but she didnt. It takes about 15 minutes for me before I felt it come on. I get an amazing feeling in my body and curl up in the bed with K and feel each other over. Definitely in a great state of mind at this time.The feeling of touch is wonderful, with very light visuals, like taking very weak lsd. This feeling of Euphoria lasts until about 3 PM.",
  "3 PM. I walk down to my friends Js apartment, and find about 8 buddies from my previous year of school. We all smoke roughly 2 huge steamroller bongs of pot per person, and C wants to do coke! Sure, why not. I break out 2 lines for me and 2 for him, and we insufflate, which starts to feel good in about 20 minutes. No longer feeling the effects of the foxy from earlier, the cocaine hits smoothly and I drink some shortly after. C decides he wants to trip with me. I make 2 6mg doses and we take them by dipping our fingers in water and placing on the tongue. It doesnt taste half as bad as the foxy, but still a bitter, metallicy taste that isnt satisfying. I washed it down with about 2 beers and wasnt feeling that great about the alcohol, so I stopped.",
  "I started to hand out doses of 5-MeO-AMT out to everyone to take for later on, since they didnt want to trip quite yet. 4 people will trip on a 3 mg dose, 2 on roughly 1.5-2 mg doses, and 2 on a 6 mg dose. I know from experience this stuff takes forever to come on, so I decide to walk around campus for awhile. I meet up with K and some of her friends, and hand out 6 more 6 mg doses. This is where I meet W and T, apparently 2 well known people on campus known for their insane senses of humor. They decide to freebase it, and claim the effects wore off roughly 10 minutes later, though it was a pleasant 10 minutes. Afterwords they both take a 6 mg dose by oral ingestion since thats where they know theyll trip for a long time.",
  "5 PM. Wow. 5-MeO-AMT is going to pack a punch very soon! I have taken this drug a number of times and was expecting pretty much the same. 12 hours of visual tripping, the body feeling for about 16 hours. I usually take 10 mgs of this, but I can already tell this is going to hit harder. Me, W, and T wanted to drive to Ts house to retrieve a most gas mask bong that they have told me stories about. We start to drive, and it starts to get dark. I am starting to trip balls and driving is very difficult. If you can help it, FIND SOMEONE SOBER TO DRIVE YOUR CAR!",
  "6PM It is the beginning of winter, there is ice on the ground and we decide to take half hour drive to this kids town. I put in a Cannibal Corpse cd, which was NOT a good idea but felt I should give it a try since I never listened to death metal on drugs. Anyway we get there and everything is moving. I have a perma-grin and we are going in Ts house to smoke a bong with a 50 year old man and talk to Ts mother. THIS IS INSANE. We walk outside to an old shed. We are in the middle of nowhere in some backwoods town smoking a bong with a 50 year old man in a shed, with a kerosene powered heater that sounds like a long loud death metal growl, and he wants me to give him 2 doses of this shit! Everything is warping and crazy ideas are filling my head. There is a slight feeling of nausea that is noticeable but not overpowering. We leave this house at about 8 PM and drive back. This is where the fun begins!",
  "8:15PM We are driving back, and we all start to trip like crazy. The roads look like they are going straight but there are actually curves everywhere. I drove straight into a cornfield after skidding on some ice and did a donut in the field, with about a foot of snow on the ground! We all thought the road went straight! I did not panic, and successfully pulled back on the road and we continued on our way.",
  "9 PM We smoke 2 bongs out of the gas mask and I go over to Js apartment again, now with 8 fully intoxicated friends. Some are playing playstation, others sitting in a dark room with Pink Floyd (which is where I went), and some actually playing beer pong. That didnt interest me, Floyd did. I chilled and continued to peak, jamming out to Dark Side of the Moon. I hit a wonderful ++++ with Tracers and Shadows moved all about and all feelings of nausea were gone. Amazing scenes filled my brain, and I was at the middle of the continuous peak you have while on this drug.  I wandered from room to room smoking bowl after bowl after bowl, and was utterly blasted at this point. I just had laid down and closed by eyes waving my hands about for at least an hour.",
  "10 PM. Put on some Infected Mushroom and it feels good! I get into it, my mood is raised drastically after the Floyd marathon, and I go for a walk. I decide I really want to play beer pong with C, so we take the table. Him and I are tripping the hardest, since we had both been on the drug since 3 PM and the rest had just taken it around 8PM or so. Everyone thinks they can beat us, so they step up to play. Needless to say, we were quite intoxicated by the drug and still won 7 games in a row! C and I decide to smoke a bowl as a celebration. He takes in the hit... and trouble appears. He puts his arms up in a crucifix type position, looks up, and projectile vomits all over the ceiling! I quickly went to the next room over since I thought he had exploded, or thats what it had looked like to me. After finding out he was fine, I just walked away and went in the other room.",
  "11:30 PM. So a lot has happened so far, but it is NOT over. More and more people are coming into the house, about 15 or so. Everyone from the school wants to drink so they start to run around and party. This annoys me, but Im too fd up to go anywhere right now. Midnight hits and it was about that time something happened that every party goer fears. THE POLICE SHOWED UP. Apparently the neighbor called them for a noise complaint. This is definitely not good, so everybody turns the music down and some find hiding places, some sit in the hallway, but no one answers the door. They knock harder and harder, again and again, and still no one answers. This is horrible. There are lots of underagers at this party, half the people are on insanely powerful psychedelics, and there are drugs everywhere. We stayed silent for about an hour. It seemed as though the cops had left and stopped patrolling the house, which was a godsend. 1 guy calls to have someone drive by the house and check for cops, and take some people back to campus. This happens until about 2 AM when finally the original 9 are back in the house, and staying for good.",
  "2 AM We all smoke a bowl and Im starting to feel great again. The pot kicked the buzzkill from the cops right out of me and I hit a +++ again. The CEVs are quite vibrant and I notice the color enhancement again in the room. Once again the Music has completely chilled me out, and I wander off in my own little world.",
  "3 AM -10 PM. Between the hours of 3 and 10 we all watched dvds of The Family Guy and The Simpsons. I fall asleep a few times while watching, until I decide to go to another room and just pass out. Its been a looooong day and one Ill never forget.",
  "Most of the people who took 5-MeO-AMT experienced harsh nausea which caused them to vomit, but after the first purge they felt fine for the rest of the night. Also a side effect was the diarrhea claimed by 3 of the 9 at the apartment. I woke up the next day feeling totally drained and just sat around all day, but the following I was back to normal. I think that the Foxy I had taken earlier in the day helped amplify the 5-MeO-AMT, causing the strongest trip I had ever had on the substance, even though I have taken larger doses previously. This is good to know, since most research chemicals do not take well to others. We smoked an awful lot of marijuana which wasnt needed, but eventually was used as a boredom killer. The combination of all 4 substances went well together, allowing for a very wonderful and exciting day. I do not at ALL recommend operating any sort of machinery while on 5-MeO-AMT, or any drug. It is one of the most powerful substances I have abused and I respect its power, now that I have seen the true side of it. THANKS FOR READIN!</p>"
 ],
 "erowid": {
  "id": "31210",
  "citation": " TripleB. \"A Drive Through the Cornfield!: experience with Cannabis, 5-MeO-DiPT, Cocaine & 5-MeO-AMT (ID 31210)\". Erowid.org. Jul 27, 2004. erowid.org/exp/31210",
  "substance": "Cannabis, 5-MeO-DiPT, Cocaine & 5-MeO-AMT",
  "views": "13827"
 }
}
