{
 "title": "Shroomed Religion on a Saturday Night",
 "author": "Phritz",
 "citation": " Phritz. \"Shroomed Religion on a Saturday Night: experience with Mushrooms (P. subaeruginosa) (ID 509)\". Erowid.org. Sep 13, 2000. erowid.org/exp/509",
 "substance": "Mushrooms (P. subaeruginosa)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms - P. subaeruginosa"
  ]
 ],
 "footer": [
  [
   "2000",
   "509",
   "Not Specified",
   "",
   "Not Given",
   "Sep 13, 2000",
   "9262",
   " "
  ]
 ],
 "report": "<p>\nI had taken shrooms twice before, and only really felt quite stoned, never really a real trip. This time, I got my hand on a considerable amount of these ultra potent Psilocybe subaeruginosa shrooms that had been circulating around campus. I had heard a lot of people talking about the intensely bad trips this shit had given them, but I decided to take as much as humanly possible anyway. . . the night before was our cross-dressing ball, and I had gotten really drunk and spent two or three hours throwing up, so I was still feeling pretty weak by the time we got around to taking the caps, around 7:00 on saturday night.  The shrooms hit me within about ten minutes, which is in my experience extraordinarily fast, and I was on a completely different plane of reality in about half an hour.  About five or six of us crawled into a tiny, dark room and started entertaining ourselves by playing with pens, laughing hysterically, and trying to talk to a person made out of a pile of clothes. After this, the religious experience began.</p><p>It began when a few of my friends went out into our common area and all just started resting on each other. Everyone became increasingly relaxed and mellow, and big smiles appeared on everyones faces.  I felt it necessary to write one of my friends an email about this philosophy that we were developing:\r</p><p>It's not a question of finding the drugs. that is in fact irrelevant. This way of thinking about things. It's not important. The irrelevance of such things as the things can be trippy if we let them be. That's all we need to remember. things can be trippy if we let them be. All we need to remember is that consequences are not necessarily the products of their corresponding actions, and we needn't worry about them in any case. It doesn't matter. . .it can be done later. Society has attatched a negative stigma to statements like this, but this is in fact the very thing wrong with society. These fundamental thoughts are hard to deal with. It requires first the thought that man cannot himself understang everything, being a product of everything. we cannot study the nature of this everything. . .the universe, if you will. It is here. </p><p>Study is pointless. This conclusion has amazingly profound consequences. Science is bullshit. It doesn't matter. We can study ourselves, and only ourselves. Look inward, because that really is all that exists. External reality doesn't. We ex[perience it, but we are in the final analysis a product of it, and so it pointless to bother dealing with it. Oh shit I think I'm going to puke but it doesn't really matter. The puke is there. It could be in my stomach, or fucking all over the place. It doesn't matter. It exists. This is my theory of religion with respect to vomit:.I'll probably die just in a few years anyway, but that entirely without importance. I'll be part of what I came out of. THIS IS FUCKING IMPORTANT. But its ok. I think i can handle this. holy shit when you see this.. . . .... .wheeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee. But treat as you like. Do NOT fucking delete it cause I want a fucking profound-ass copy.</p><p></p><p>This way of feeling permeated everything.  I went outside, and me and my friends all lay on top of each other, maybe about eight of us or so, and we collectively attained a level that I truly believe that siddhartha gautama described as 'nirvana.' I had absolutely no sense of my self.  I was as much the people that I was lying on and holding hands with as I was myself.  I looked at a table, and became a table.  I looked at Jessica, and became jessica.  I was completely happy, completely content. Everything was simple.  I did not care about anything in the material world.</p><p>Of course, right now (the next day), while I can describe what happenned, I can't really comprehend it. While I know I was in a state of self-less bliss, I no longer remember what it felt like.  The feeling of loss is quite painful, and I've been spending quite a long time trying to figure out what to do with my life. I'm not sure anymore if I'm going to stay in college.  I might just start walking and see where I end up. But I'm sure that this experience was for the best.  These shrooms showed me a goal, showed me a way of thinking that I think I could attain again without drugs, through belief and prayer. . . Or maybe I'm overanalyzing. But I really do believe it's possible these drugs have changed my life for the better.</p><p>PS: Don't do dramamine. It is the embodiment of evil.</p>"
}
