{
 "title": "Comfortably Numb",
 "author": "Nicole",
 "citation": " Nicole. \"Comfortably Numb: experience with Propoxyphene (ID 50935)\". Erowid.org. Apr 10, 2007. erowid.org/exp/50935",
 "substance": "Propoxyphene",
 "bodyweight": "140 lb",
 "report": "<p>4:20 Ingested four darvocets, which have 100 mg of propxyphene and 325 mg of acetaminophen per pill. This is my first time experiencing with Darvocets, so I was going to start with 4 only, but figured what the hell and at</p><p>4:30 took my fifth.</p><p>5:00 no notable symptoms, really. Chatting on the internet.</p><p>5:20 definitely starting to feel it. Warm sensation throughout my entire body, very very pleasant. Flushed face. Light headed. Itchy, but it feels nice to scratch.</p><p>5:30 Noticing a bitter, metallic taste in my mouth. Drank some orange juice. The taste is still there. Not too unpleasant. I can't really smell anything...</p><p>5:48 tried to eat something, but nausea is kicking in. Drank water.</p><p>6:00 I am very content with just sitting on my bed, doing nothing. Life feels good. I keep nodding my head and smiling. It just feels good to be alive. I have no desire for more pills right now. Peaking.</p><p>7:00 Still feeling dizzy, warm. I am typically a very anxious person, but on these guys, I don't feel restless at all, or fidgety. My problems seem easy to face, and I can truly relax for the first time in a long time.</p><p>8:00 Peaceful, everything is at peace. Not as intense anymore, but still strong effects.</p><p>Over all, great experience, looking forward to doing it again</p>",
 "year": "2006",
 "id": "50935",
 "gender": "Female",
 "timestamp": "2007-04-10T07:00:00.000Z",
 "views": "33572",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Pharms - Propoxyphene",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:10",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Propoxyphene",
   "form": "(pill / tablet)"
  }
 }
}
