{
 "id": 5098,
 "title": "Rubik Cube",
 "date": {
  "submission": "2007-06-06T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "That Guy",
  "gender": "Male",
  "weight": 90
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "22.5",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  },
  {
   "time": "0:57",
   "amount": {
    "number": "7.5",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  },
  {
   "time": "2:00",
   "amount": {
    "number": "2",
    "unit": "bowls"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "3:00",
   "amount": {
    "number": "2",
    "unit": "bowls"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Ive recently been experimenting with quite a few drugs, including DXM, opium, and all sorts of different colored pharmaceuticals, but my most recent drug is hydrocodone. Now the other night I took 15mgs and smoked about a half gram of some really good pot, which I tend to mix it with all of the drugs I do. This high started off slow but really got to me soon. It in fact hit me incredibly hard. The paranoia was unfortunately really bad as I was overwhelmed by the experience and didnt relax as much as I should have. After about an hour and a half I was tripping more than I think I ever have in my life. Not having found much on the Internet about this drug I started to freak out and get scared. In an attempt to bring myself back into reality I put in some stand up comedy that I have, since listening to someone talk generally brings me back. Soon my trip started to level off and I was able to enjoy myself listening to some good music and making an attempt at playing some video games.",
  "Well though this first attempt didnt go as well as I had hoped, I decided to make a second attempt. Now you have to understand that I prepare my surroundings before I start to trip on anything, so as not to have to worry about anything. So I went downstairs and fixed myself some food, then grabbed something to drink. When Im high I generally like actual solid food so regular munchies just dont cut it for me. I wrapped the food up and put it in the fridge so I would just have to turn on the microwave when I wanted it, I took the drink back upstairs and set a few cans of coke on my desk next to my computer.",
  "I set my alarm clock to go off when I want to go to bed so that I dont accidentally stay awake all night and I set up a black light in my room. On my computer I set up a play list of the most relaxing music that I have mixed in with some stand up comedy to bring me back every once in a while. I took 4 lortab-7.5 and sat back waiting for it to kick in down in the living room, once I started to feel some effects I came upstairs and began to write this log. So I will be writing this whole thing while Im on my trip here goes",
  "10:30  I broke in half three pills of lortab-7.5 and downed them with a glass of water, I also downed two caffeine pills. It shouldnt make any difference but I thought it a good idea to note, then headed downstairs and watched some TV with my bro.",
  "11:05  From here on out this whole thing is being typed as it happens so you may have to bear with me. I am feeling some effects of calmness and a sort of lifting of my",
  "spirit, I want to call someone and talk but Ill wait until later to do that.",
  "11:18  I think I am going to go take another pill, but I will give it another few minutes. Ive been finishing up some schoolwork. It may make me sound weird to be doing",
  "that but I should finish it before I really start tripping, I may be a druggie but Im",
  "a druggie with good grades.",
  "11:27  I just downed that the fourth pill putting my amount at 30mg. I have something in my eye but down really care that much so Ill get it out in a little while. Now",
  "nearly an hour later I feel incredibly relaxed and I think Im just going to chill for",
  "another 30 or so minutes before I hit up a bowl or two of some bud.",
  "11:35  I just finished my Rubiks cube in 3 minutes and 15 seconds, that may sound",
  "impressive but its really slow for me, I must try again 1:38 thats much better.",
  "11:57  I dont know what happened but I think Im not reacting the same way.",
  "12:12  I am now headed to go smoke a few bowls but first I will have to create a pipe",
  "out of a coke-can since I recently shattered my glass piece. Ill be back shortly.",
  "12:42  Ok so that took me a little longer then I thought it would. I just smoked 2 bowls in my bath room. I turned on the fan to get rid of the smell and sprayed it with",
  "Lysol. Im high as shit. I can barely think right now, I have a feel of relaxation and also kind of high strung. Im hearing movement in the house but I think that its just the house settling. That took me 5 minutes to write, its now 12:47.",
  "1:05  Ok Ive really leveled out now, I think that the hydro is now flattening out to.",
  "The weed has taken full affect and I am feeling damn good. I can hear the game that my brother is playing in the room next door, I can feel everything but nothing feels at all in pain, and my thoughts are really scattered yet clear at the same time.",
  "1:29  Ok Ive been really high for about the past hour I believe that the hydrocodone is completely wore off but thats ok, I still have a few more bowls of weed that Im",
  "going to smoke in a minute. Reflecting back the feeling that I had were very cool,",
  "much like the last time except not as long and a lot less paranoia. I just went to get",
  "something to eat, bagels.",
  "2:05  Ok I just got back from smoking a second time, I smoked two more bowls in my",
  "Bathroom. I came back and now I have the most relaxed feeling that I have ever",
  "had in my life. Its insane. I think I am having the hydrocodone after effects added",
  "together with weed. I am feeling a little bit drowsy. I think I would have to say",
  "that one of the greatest bands in the world is Radiohead, right behind Pink Floyd.",
  "2:14  Ok Im really tired now and I need to sleep so Im playing dark side of the moon",
  "and going to bed, looking back, this has been a great high but I believe that the",
  "best part was the part where the after effects of the hydro were in effect and I was",
  "really high, but the other part was nice too."
 ],
 "erowid": {
  "id": "31280",
  "citation": " That Guy. \"Rubik Cube: experience with Hydrocodone, Caffeine & Cannibus (ID 31280)\". Erowid.org. Jun 6, 2007. erowid.org/exp/31280",
  "substance": "Hydrocodone, Caffeine & Cannibus",
  "views": "21713"
 }
}
