{
 "title": "Pushing Open the Curtains",
 "author": "OpenLife",
 "citation": " OpenLife. \"Pushing Open the Curtains: experience with Mushrooms & Nitrous Oxide (ID 50985)\". Erowid.org. Aug 23, 2008. erowid.org/exp/50985",
 "substance": "Mushrooms & Nitrous Oxide",
 "bodyweight": "198 lb",
 "header": [
  "DOSE: T+ 0:00",
  "3.4 g",
  "oral",
  "Mushrooms",
  "(dried)",
  " T+ 5:30",
  " ",
  "inhaled",
  "Nitrous Oxide",
  "(gas)"
 ],
 "report": "<p>The setup was simple enough:</p><p>12:30</p><p>Tony (who was throughout the endeavor an amazing companion and friend) brought the mushrooms downstairs, and we prepared sandwiches (Peanut Butter Mushroom and Jelly) with 3 grams of mushrooms in it, keeping a half gram out to soak in our mouths after the sandwiches. About twenty minutes afterwards, we both felt strong feelings of anxiety, and wanted to act: Tony wanted to find somewhere he could dance, while I suggested we go out in the hallway.</p><p>1:00</p><p>It was then that we established the elevator plan. We dragged two chairs into the elevator and each got ourselves occupied. We were both feeling 'high', but were definitely not tripping, and Tony complained of not having visuals. Precisely then, the elevator began to pulse, and I entered my first vision. From the walls of the elevator emerged a forest, and I was acutely aware of an observer above us, whom I knew was not a part of my 'normal' world.  My mind took this, and I began to dictate something, as if being guided by some outside force. I realized that my 'self' is but a collection of varying perceptions and associations.</p><p>1:30</p><p>Coming in and out of light trips, Tony and I fought an epic battle against the number 1. 7 was our vanguard, while 3 was the silence before the fight. It was then that the figure of R opened the doors to the room, and sent us into giggle fits. By this point, Tony had finished selling his fish, and I was busy contemplating the nature of the earing I had found, which became very dear to me.</p><p>2:00</p><p>Tony and I separated for the first time since the ingestion, though he gave me his hat for security. I found myself quite cold, and so had gone to get a sweatshirt. After using the bathroom, I stood looking at my face in the mirror for what seemed like ages, when I realized that Tony was still in the elevator! I rushed back and found him on the floor, apparently in rapture.</p><p>2:30</p><p>We exited onto the 5th level, looking for the Sky. We were trapped between multiple satan spawn, and the gauntlet of heaven, but could only move so quickly down the long path. Time bent and twisted, and my companion and I spent many weeks along the tormented path. Along the way, I became very close with the earing, and with my new friend, the cellphone, which danced in my hand. Tony had found the pillow, and was clutching it close when, suddenly, I lost him.</p><p>???</p><p>Everything unfolded. I found myself able to move in an infinite number of 'directions'. Earing became a small woman in my hand, who spoke to me and told me that our universe only exists so we can communicate with others. Then she fell asleep, and I cradled her next to my heart. Cellphone had transformed into a small black dog, and curled up at my feet, which were now formless geometric transforms, stretching towards infinity. If I had a mouth, I would have smiled, but instead I allowed the void to be filled with a small, humming, and, suddenly, was entertained by a chorus of joyous voices singing to me the praises of creation.</p><p>???30</p><p>I began to come down, but had the slight vision that I had been possessed by Judas Iscariot. Tony had been regurgitated by the black dog, which melted into my stomach, and began to tell me that he sought the Garden of Eden. Suddenly, eyes were blinded by glorious light as L descended into my field of view, her beauty and glory resolute. Tony and I continued our struggle towards the Sky, and I had to abandon Earing for a short while. She smiled and said she would be okay, despite her diminutive stature. We then entered the temple of  the sky.</p><p>6:00</p><p>We found ourselves in Skye's room, Tony's close friend and associate. Tony had come seeking nitrous. The nitrous COMPLETELY killed the trips. Murdered them and ripped their beauteous visions from my retinas. Earing lost her humanity and became inanimate once again. Tony and I spent time coming down and enjoying the scenery until I left him, a long with pillow, on the floor outside his room. Hat, my long time companion, was cast off as symbolism.</p><p>I returned to my room and had a long conversation with my shadow on complex quantum mechanics involving cats. Then I rested for a short while, eyes open, hands behind me head, and typed this experience. I am still riding the come down.</p>",
 "year": "2006",
 "id": "50985",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-08-23T07:00:00.000Z",
 "views": "3084",
 "dose": {}
}
