{
 "title": "The High Road Isn't Paved",
 "author": "Mobilize",
 "citation": " Mobilize. \"The High Road Isn't Paved: experience with LSD & Cannabis (ID 50994)\". Erowid.org. Jul 20, 2007. erowid.org/exp/50994",
 "substance": "LSD & Cannabis",
 "bodyweight": "185 lb",
 "header": [
  "DOSE:",
  "1 hit",
  "oral",
  "LSD",
  "(blotter / tab)",
  "",
  "2 hits",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>It was my first dance with a synthetic psychedelic. I stared at the small, questionable perforation in front of me, wrapped tightly in foil, where it remained for an occasion such as today. As I slipped the blotter onto my tongue, I began preparations for the night.</p><p>Still absorbing the effects of the LSD, I ran downstairs to begin filling up a gallon of water. The paper in my mouth was drenched, and I waited for what seemed like five or six minutes for it to dissipate. I told a few close friends to come by if they felt so inclined, and as I waited, I began to feel a bit of a shift. I've taken psilocybin before, but this was different. The LSD seemed to stabilize itself far more quickly than the varying degrees one feels when on mushrooms; The drug also showed signs of a longer trip, and although a bit tired, I could tell sleep would be out of the question for countless hours.</p><p>It was at this point that I received a phone call from some friends of mine. They entered my room and proposed that I take vitamin C, which supposedly enhances colors, and visuals by proxy. Without fully understanding the make or meaning of the encapsulated vitamin, I took it, and could have sworn it was boring a hole in my tongue. In retrospect, obviously the acidic qualities of the pill were irritating my tongue, but I wasn't sure what I wanted. As time passed, I realized I wasn't sure what I needed. Do I want water? Am I thirsty? Is my mouth dry? Is my stomach full? Too much or too little?</p><p>My guests wanted to give my bong, The Smoking Barrel, 2.5 feet of uninhibited contraband, a test drive. As I pulled the bong from my room, I began to question whether I should smoke. In the past, when I had smoked on psychedelics, it seemed to intensify the trip, yet at the same time it somehow took a bit of the edge off. The bong went around the room, and finally after everyone had passed the glass, it was my turn. I took it not only once, but on its second time around as well. It was time to play the waiting game. Suddenly, nothing looked familiar. All previous memories seemed insignificant, almost non-existent.</p><p>'Oh man, I've been HERE before'.</p><p>I could answer simple questions in my own mind, such as my friends' names, and who everyone was and their place in my circle, but only if I decided to fixate myself on the answer. I grounded myself and walked to the other side of my room, where I proceeded to flip a quarter. I swear I flipped it three times before I finally saw that it wasn't a double headed coin, and at this point, I decided it may be time to stop standing at a fork in the road.</p><p>It seemed like the best possible time to make a phone call and help make a decision as to what to make of the bounty on my plate. It was settled that the best possible decision was to go outside. Each tree, plant or star seemed to be the physical expression of its mathematical algorithm, as if somehow, programmed into reality. It was blistering cold, and all I could think was, 'This is the worst mistake that could turn into the best decision I've ever made'.</p><p>Once I melded into ego-death, I lost everything, including my identity, my mind, and my old set of eyes. What I gained is questionable. It's a shame, I had the answers, and I understood the questions, because I was one with a core singularity of sorts. I'd like to explain, but first I need you to strap on your boots, because the high road isn't paved. The sound of the natural world around me seemed to reverberate with an odd electronic sound and sensation. Since I had experienced ego death, I was walking around in this dark, cold abyss, with the innocence of a lost child.</p><p>Two mindsets were fighting over control of my mind. One fundamental idea was, that I was a human being with 18 years of memories and experiences that had consumed a psychedelic substance. Obviously this part of my mind seemed to be undergoing renovations. As I now saw it, the psychedelic seemed to be a mnemonic device placed within reality to wake me up, but not me in the ego sense, me as a nameless singularity.</p><p>My feet felt as if they were magnetized, as the concrete seemed to pull me at its own discretion. I began to think of my previous trips, and I realized, that fundamentally, returning to center was the rationalization of the journey. A single word needn't be uttered or written, and in retrospect, the experience is always pivotal to mental, emotional, and spiritual faculties. Just as I had said this to myself, I looked up, to find myself standing in front of my house, with the door open and the lights on. The sun was beginning to come up. I entered my home, locked the door behind me, and as I entered my room, I 'fell asleep', only to fall asleep.</p>",
 "year": "2006",
 "id": "50994",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-20T07:00:00.000Z",
 "views": "3799",
 "dose": {}
}
