{
 "title": "Exactly How it Feels",
 "author": "Osiris",
 "citation": " Osiris. \"Exactly How it Feels: experience with Kratom & Cannabis (ID 50990)\". Erowid.org. Jul 21, 2006. erowid.org/exp/50990",
 "substance": "Kratom & Cannabis",
 "bodyweight": "210 lb",
 "report": "<p>Previous Experiences: Marijuana, GHB, LSD, MDMA, MDA, 5-MEO-DIPT, Cocaine, Mushrooms, Valium, Salvia</p><p>Firstly, let me tell you that Kratom is absolutely the real deal.  Secondly, let me tell you that it clearly has mental addictive potential, and this is obvious after the first time using it.  I wanted more... it feels a lot like Cocaine in this respect (not in physical effects, just the type of addiction it seems to be), only with Kratom, it is more possible to reach contentment in my opinion. We purchased the 3X extract and filled gelcaps with it. By measuring the number of gelcaps we could fit 1 gram in, we were able to determine the dosage of each gelcap. This turned out, in our case, to be 750 mg in each. We filled the large end of the gelcap to the top and pressed it down to make certain that they were all as close to the same dosage as possible. We took 7 each. Rather than give a long detailed report, I'll just describe exactly how it feels to me.</p><p>+ :10 - :20</p><p>I feel a slight energy boost with some dizziness and difficulty focusing. This drug appears to work in phases.  At this stage, one may think that the trip could be disorienting and possibly not entirely enjoyable, but hang in there! Time is greatly distorted and I have no capacity to keep track. I vaporize some high quality marijuana. Shortly after this, the high changes, but not entirely due to mary jane.</p><p>+ :25 - :30</p><p>The experience morphs into a more euphoric high at this point and I begin to notice colors enhanced slightly, some movement in vision and a high that feels like taking a vicodin (hydrocodone) and a very slight trippy edge... maybe like a tiny amount of GHB thrown in there as well.  The high is much more peripheral than hydrocodone though, which makes it have that slight GHB edge to it.  Music is enhanced... there is clarity and flow to it like on GHB.</p><p>+:30 - :1:30</p><p>Euphoric feelings come in waves, somewhat like MDMA but not as pronounced.  At this stage, I'm vaporizing more pot every 20 minutes or so to enhance the high.  The synergy is incredible.  I don't think I would take Kratom without THC.  I also think it would be absolutely awsome to do this with a significant other. I recommend low lighting, and a focus on comfort, like you would prepare for MDMA. I think it would probably be very nice (if one didn't take too much and pass out) to eat some pot food with this.  This pretty much feels exactly like it would feel to blend the feelings of a 1/5 dose of GHB, a 1/5 dose of MDMA, pot and 1 hydrocodone tablet.  Sociability is enhanced.  Math is impossible so make sure you have your dosages figured out ahead of time. Drinking takes some of the magic away.  I had a beer during this time and the trippiness was taken out of the experience. While I didn't notice any incompatibilities with alcohol, it does add to the body high and cause some loss of insight (return to normalcy).</p><p>+1:30 - +3:00</p><p>This is the comedown phase.  The MDMA feeling goes away and at this point it pretty much feels like the comedown from just pot and hydrocodone, though there is an afterglow effect that feels like the day after doing a small amount of MDMA. This phase is characterized by a slight visual distortion, and euphoric body high that persists for hours, enhanced by consuming more weed.</p><p>Conclusion: Kratom is a very enjoyable drug. It's mellow enough to be used on any night of the week, but I can see how it would be draining if taken continuously. It's seems like it would be a lot like GHB in its use patterns.  I can see it being an excellent way to come off of other drugs such as MDMA, when one reaches baseline.  It's an antidepressant as well. My instincts tell me that it is wise to only use this drug once every couple weeks at the most to avoid getting addicted.</p>",
 "year": "2006",
 "id": "50990",
 "gender": "Male",
 "timestamp": "2006-07-21T07:00:00.000Z",
 "views": "30507",
 "dose": [
  {
   "time": "0",
   "amount": "5.25 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(gel tab)"
  },
  {
   "time": " T+ 0:20",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 0:40",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 1:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 0:00",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": " T+ 1:20",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 1:40",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
