{
 "title": "Underwhelming But Enjoyable",
 "author": "TJ",
 "citation": " TJ. \"Underwhelming But Enjoyable: experience with Salvia divinorum (6x extract) (ID 51013)\". Erowid.org. Sep 22, 2008. erowid.org/exp/51013",
 "substance": "Salvia divinorum (6x extract)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)",
   "",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)",
   "",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)",
   "",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)"
  ]
 ],
 "report": "<p>I purchased 1.1 grams of 6x Salvia divinorum extract from an online seller.  Cost was about $7.  Didn't get to smoke it as soon as I had hoped, but several weeks later, finally got a chance to.  I had been interested in trying salvia simply to experience something new - curiosity of where else my mind could go.  I had read many reports here, and from a few friends, so I had certain expectations.  Here's the details of my first experience.</p><p>Started off with some gin and juice (just barely got a buzz) and some candles and good music.  Friends came over, and I loaded a bowl of salvia, the extract is real leaf with extracted salvinorin concentrate 'infused' in it, as best as I understand.  Smoked the small bowl (.1g?) in a chillum.   The smoke was hotter and harsher than anything I had ever hit before, but I learned that part of that had to do with the pipe we used.  Some of my friends also mentioned how harsh the smoke was, but it was still manageable.  It burns quickly - I took several quick hits and held as long as I could, which wasn't long due to my reaction to the smoke.  I passed the pipe, and my friend smoked a bowl.</p><p>At this point, a slow high came over me, not a quick rush, as I had read about.  A pleasant feeling (relaxed, slightly disoriented, content, aware) crept in.  The best way to describe is to say that it was as if I had smoked marijuana several hours ago and had the lingering effects.   I was slightly surprised/dismayed that I wasn't having a stronger reaction.  No reality-melting yet.  My friends seemed to be reacting similarly, but it may have been stronger for some of them.</p><p>This state was maintained even after smoking my 2nd and 3rd bowls.  After the 3rd or 4th, the bag had been finished, and the feelings got a little bit stronger.  I noticed loss of my sense of time - a song would begin playing, and then when I later heard the end of it, I felt as if an hour had passed.  Visual hallucinations were very minimal and subtle.  Every object in my field of vision at one point seemed to be a brick in a wall, maybe because we were listening to pink floyd.  This was subtle and didn't last long.  I seemed to be able to control whether or not I was all out 'hallucinating' or just slightly 'high-ish'.  With marijuana, I seem to have no control over how high I am, but on this trip with salvia, I seemed to be in control of myself and in control of how much I wanted to hallucinate.  As my friends got up to leave, I was again surprised that only a few minutes had passed, not a few hours.  I snapped out of hallucinating and showed them out the door.</p><p>I then returned to the couch and settled in.  I closed my eyes and let myself go.  I found that darker was better, because there was more for me to see when I could see nothing at all.  I kept my eyes closed and began to see and sense things.  The entire time, I was aware that there was nothing in front of me but black, and yet I was sensing colors, shapes, and patterns.  I didn't actually see them, but I imagined them and sensed that they were right there in front of me.  Very enjoyable, as they danced and changed along with the music.  I felt that even with my eyes closed, my field of vision was too small.  I was frustrated that my [black] field of vision was so narrow - I wanted to be able to see the nothingness which seemed so colorful all around me, not just directly in front of me.  I wanted to know more, understand more, have broader vision.  I appreciated that the salvia was helping me to expand my understanding, while making me want to expand it even more.</p><p>Occasionally (every few minutes, which felt like every few hours), I would open my eyes and vaguely see the apartment, and I went back to feeling 'just high-ish' rather than hallucinating.  When I closed my eyes again, new shapes and colors would 'form'.  Everything but the colors seemed to melt away.  It was just me, sliding through the waving shapes - no couch, no floor, no apartment.  30 minutes later I got up and got in bed.  Getting up and walking brought back almost to normal feeling, although I felt somewhat weightless.  Laying down in bed brought on a new wave of light hallucinations, and at some point I must have fallen asleep.   No effects were noticed whatsoever the next morning.</p><p>BOTTOM LINE</p><p>smoked .4g  of 6x extract in a chillum</p><p>noticed 2 levels - high-ish, and hallucinating</p><p>   began as high-ish, progressed to hallucinating</p><p>   I controlled the mindset I was in, partly by closing my eyes</p><p>   hallucinating was subtle, controllable, not overwhelming</p><p>   Pleasant feeling, colors, shapes, slight change in 'reality'</p><p>   Minimal loss of motor skills</p><p>   fleeting sense of time and location</p><p>time from smoking, to falling asleep (still feeling it) = 1.5hrs?</p><p>From my expectations of this drug, I was underwhelmed - BUT it was very enjoyable nonetheless.  Just not as intense as what I was expecting.  I will definitely try salvia again.  Although I would be happy repeating this experience, next time I will try a stronger extract, or I will smoke more, to try to have a more intense response to it.</p><p>Salvia pros:</p><p>  legal</p><p>  cheap</p><p>  good hallucinations</p><p>  in control</p><p>  no 'hangover'</p><p>cons:</p><p>  not intense (reality didn't melt)</p><p>  harsh smoke</p>",
 "year": "2006",
 "id": "51013",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-22T07:00:00.000Z",
 "views": "4073",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 6x)"
  }
 ]
}
