{
 "id": 5101,
 "title": "Very Potent Stuff!",
 "date": {
  "submission": "2004-07-25T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "The Chief",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol"
  },
  {
   "time": "0",
   "amount": "T+ 1:00",
   "administration": "",
   "substance": "oral"
  },
  {
   "time": "2C-I",
   "amount": "(powder / crystals)",
   "administration": "T+ 2:00",
   "substance": "repeated"
  }
 ],
 "report": [
  "WTF just happened?",
  "Im an experienced user and have done pretty much everything except acid, only because I cant find it where I live.",
  "I had ordered a bunch of 2C-I over the internet last week.  I was in the process of planning a big day with my friends in the next day or so.  I was heeding the warnings about how strong this stuff could be and to be careful.  My friends and I were going to use the liquid measuring technique and figure out all the proper dosing as responsibly as we could.  I was getting a little frustrated because I had no idea what to expect.  Everyone kept asking me what it is like and I could only tell them its supposed to be like MDMA and LSD, or so I heard. ",
  "A couple of days ago after I got the 2C-I in the mail, a friend and I were investigating it.  We opened the bottle and put a very small amount on the table to see what it looked like.  We then brushed it off the table back into the bottle.  My friend used his finger to collect all the white dust left on the table (barely enough to see, like chalkboard dust) and then proceeded to wipe it on his gums.  I was amazed to hear the next day he experienced very mild affects which he couldnt describe from doing that.  Hardly anything to brag about, but it was incredible he got something he could register from the amount he did.",
  "12:00AM:  Im at my townhouse drinking with my roommates.  I dont have a scale or any way to measure the 2C-I accurately so I have to wait.  I figure what could hurt if I just took a little of the powder?  Just to test it, see what I get. I put a small amount on the tip of my pinky and lick it off.",
  "1:00AM:  Im pretty drunk by now and Im starting to feel the 2C-I kick in.  My heart is beating faster and Im experiencing feelings reminiscent of ecstasy.  It is rather similar to the wave that begins to increase in strength that you feel when your roll is approaching.",
  "2:00AM:  Very messed up.  It only took an hour to start, and by this time I cant believe that Im this messed up off of the incredibly small amount I took.  Im not incoherent, and can function without problem. I just cant believe how strong the 2C-I is.  Im starting to smoke cannabis every now and then to see if it cant calm my system down a little.",
  "3:00AM: I had been trying to figure out what I was experiencing.  By now Im feeling very tired like I want to go to bed.  My skin is flushed like it gets with ecstasy, but not to the point of a heightened feeling of touch.  Colors seemed to appear more vibrant, and I was having trouble with perception of distance.  My wall looked like it was a lot closer than it was.  No tripping, no dancing lights, no pink elephants.  The only thing I could really notice was the flushed feeling.",
  "4:00AM:  Im starting to come down and not exactly satisfied with the experience.  I wonder if the alcohol had anything to do with it.  I wish I had had more of a trip.  Im happy that it did something, and that Im not dead.  At least I know I wasnt shipped baking powder.  I think maybe my environment wasnt stimulating or I might not have done enough.  Then again I have no idea how much I really did.  Ill have to try it again with my friends this weekend and use the liquid measuring technique."
 ],
 "erowid": {
  "id": "31286",
  "citation": " The Chief. \"Very Potent Stuff!: experience with 2C-I, Alcohol  & Cannabis (ID 31286)\". Erowid.org. Jul 25, 2004. erowid.org/exp/31286",
  "substance": "2C-I, Alcohol  & Cannabis",
  "views": "6399"
 }
}
