{
 "id": 5110,
 "title": "Absolutely Nothing, Disappointing",
 "date": {
  "submission": "2006-10-13T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "disapointed",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  },
  {
   "time": "0:15",
   "amount": "4 caps",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(tea)"
  },
  {
   "time": "2:45",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "Well, I have been reading up on  Amanitas - A. muscaria  for a while. Finally ordered an ounce. I have taken Acid, never shrooms of any sort. So I ordered an ounce of 'grade a' I had a friend come over that is very familiar with regular shrooms that you pick off manure. He made the tea.",
  "Here is the timeline.",
  "7:30pm he let the water boil. Soon as is began to boil he cut the temp. back until it was no longer boiling and dropped in the shrooms.",
  "7:45 we smoke a few bowls of salvia 5x extract. Felt the regular weighed down for a few minutes. put me ina  better mood for the rest of the nite",
  "8:00pm We decided to drink it. I ate the 2 smaller caps and the one larger cap. he at a med cap. and we share the drink",
  "8:15 we finished our drink. It didnt taste that bad",
  "8:30 we went our seperate ways for the night. we supposed to meet up in an hour or so.",
  "9:00 still fell normall other than the SLIGHT effect from salvia. no so much as an effect. just in a better mood. went to Wal-Mart got some vitamin C pills and Orange Juice. Took the vitamin C pills.",
  "10:00 Still no nausia no NOTHING. Smoke some more salvia 5x at a friends house.",
  "OTher than boring you with my boring night, I will end this saying. I ended up going to sleep out of boredom. My friend felt nothing either. We are going to boil the rest of the ounce tonite. and report back. hopefully i will be able to tell you about a mind blowing trip tomorrow. Or.. I will just get some Acid and take a couple hits"
 ],
 "erowid": {
  "id": "31309",
  "citation": " disapointed. \"Absolutely Nothing, Disappointing: experience with  Amanitas - A. muscaria & Salvia divinorum (5x extract) (ID 31309)\". Erowid.org. Oct 13, 2006. erowid.org/exp/31309",
  "substance": " Amanitas - A. muscaria & Salvia divinorum (5x extract)",
  "views": "6283"
 }
}
