{
 "title": "Occasional Abuse",
 "author": "Singer/Songwriter",
 "citation": " Singer/Songwriter. \"Occasional Abuse: experience with Methylphenidate & Alcohol (ID 51124)\". Erowid.org. Sep 6, 2007. erowid.org/exp/51124",
 "substance": "Methylphenidate & Alcohol",
 "bodyweight": "215 lb",
 "report": "<p>I used to take Ritalin while in college, as a part of an ADHD management rubric.  It was discovered when I was a college freshman that I had moderate inattentiveness and apathy associated with attention deficit-hyperactivity disorder.  As a result, my doctor prescribed (3) doses of 20 miligrams Methylphenidate (ritalin) a day.  Using the drug incresed my ability to concentrate for prolonged periods of time in the areas of listening, reading, and studying.  I usually avoided the use of ritalin during midnight term paper-writing sessions, becasue the drug tends to minimize  creative output, turning a writer into a literalist, and a linear blockhead. </p><p>However, when taking the drug ritalin, I never enjoyed the side effects.  The effects of decreased appetite, and moderate weight loss are mostly manageable, as are the effects of jaw-clenching, and muscle twitches. However, I often found the ritalin-induced insomnia, anxiety, the occasional states of mild to moderate paranoia, as well as auditory-tactile hallucinations troubling (to myself, as well as to my roommates). </p><p>I took the drug ritalin more or less inconsistently throughout my college years, mostly because of the anxiety and the insomnia, but also because of the frequent medical checkups required.  Ritalin is a controlled substance, and so every three prescripton refills, I would have to have a doctor's checkup to determine whether the drug was still 'working' for me.  Often, the doctor would not like my blood pressure reading, muscle twitches, etc., and so he would fuck with my prescription, or temporarily switch me to Wellbutrin (a mild anti-depressant), which I found to have no discernable effect in managing my learning disabilty.  Also, I hated these visits, because I have never enjoyed being bare-assed on a paper-covered examination table.   </p><p>Anyway, to get to the meat of my experience report; I should say that ritalin is good for studying, and fairly decent for partying.  I always had a good time with it, but I always found myself with the typical Ritalin-induced insomnia, which didn't matter as much on the weekends.  Although I generally took a workmanlike approach to my ritalin use (for work and not play), I did use the drug a few times for partying.  I always had plenty of dudes begging me to sell them a few pills for crushing and insufflating, but I usually didn't sell it to anyone, because I have never been one for giving out pharms to others indiscriminantly.  I can never be sure of what will happen, and I certainly do not want to be held responsible for the adverse occurring. </p><p>When I took ritalin for partying, it was always after having had several drinks (beers or whiskeys were what I drank a lot of).  Generally, I would take the drug at 3X my single dosage amount.  Twenty milagrams was my perscription dose, hence, I would take 60 miligrams for partying.  I took the drug for partying because I am generally a shy, introverted type, but ritalin and other stimulants seem to bring me out of my shell a bit.  Plus, the drug allows me to stay up later so I could party longer, and drink more        booze cocktails than normal.  This was a bonus.</p><p>In using Ritalin, I don't get a coke or meth-like rush, but rather, I get a more moderate zap in concentration, and elevation of mood.  I am much more talkative and fidgety than usual.  If I use ritalin in a party environment, I will be more likely to become animated, adamant, and excited about things going on around me.  I have to be careful not to trap others in one-sided conversations, becuase I get the impression when amped on Ritalin that I am the most insightful, clever, and wry conversationalist out there.  In reality, although I may feel 'smarter', I may simply just be blabbing about crap.      </p><p>Here is the ritalin 'party ride', as a brief schedule of events which I generally experience.  I have put it in terms of insufflating the drug, becuase it acts quicker this way, and it is how most recreational Ritalin use is done.</p><p>T+ three to five minutes:  I will feel a jump in alertness, an upswing in mood, perhaps some mild to moderate euphoria.  Physically, I might sweat, my stomach may flutter, and I may feel some mild nausea (especially on an empty stomach).  Most alarmingly, I may feel some chest palpitations. This should pass soon.  This is a pretty transitory state.</p><p>T+ fifteen to twenty minutes:  The 'rush' will have mostly passed, but I will start to really get into conversations, or pointed activities such as games, or the progression of trying to angle towards having fucksex with someone.  I will be fidgety in the feet or legs and hands, and may experience some tingling of the extremities or genitals, and have some palm sweat.  Having a few beers takes the edge off this effect.</p><p>T+ forty minutes - 2.5 hours:  This is the meat of the ritalin high, and is the time when I feel that I am 'in the groove' with the substance.  I will be past the main jitters, but will still have an intensified alertness.  I will have mellowed socially a bit, but still will be more conversational than usual.  In some cases, I will be an absolute chatterbox.  I drink alot of water, since I start to get a little dry mouth. I consciously try to relax my jaw if I remember, otherwise my teeth and jaw may hurt a bit the next day.  When I feel the alertness tapering off, I may take a bit more ritalin, although I will probably not feel as much of a rush, but fidgeting and a knotted stomach will return in full force.</p>",
 "year": "2006",
 "id": "51124",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-09-06T07:00:00.000Z",
 "views": "20657",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": "60 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  }
 }
}
