{
 "title": "Analytic Workout",
 "author": "Marty Graw",
 "citation": " Marty Graw. \"Analytic Workout: experience with 2C-I (ID 51153)\". Erowid.org. Jul 12, 2006. erowid.org/exp/51153",
 "substance": "2C-I",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-I",
   "(capsule)",
   "",
   "0.3 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>My first experience with psychedelics came on a Friday night in late winter, one of the first days of the year that really blasts me with muddy decay and ground smells. The feeling this evoked added to the anticipation and excitement that built in the hours before the trip.</p><p>I took 20 milligrams of Epitaph, as my buddy, WW, had heard it (2c-i) called. I arrived at his dorm room around 8:15 p.m. after having downed the capsule a half hour before. We kicked things off with a medium-sized bowl of grass accompanied by the Beach Boys Pet Sounds. WW had done 2C-I several times before, but he would not be tripping that night. However, he kept saying that he was getting a great contact-buzz the whole time I was tripping.</p><p>I might have smoked more grass during the trip than I needed, as I would not feel any noticeable effects from the Epitaph till well into the second hour. Its effects on me were incredibly subtle. 2c-i is not one to take me for a ride  it requires a heavy dose of effort on my part. Otherwise I might find myself a little too clear-headed. I even managed to hold my own fairly well in a heated game of Super Smash Brothers.</p><p>In fact, I probably wasted a fair amount of the trip waiting for the drug to take over my mind. This was a mistake. I cannot overstate 2c-is subtlety. However, later in the night I was really having a good time analyzing and contemplating  music, our conversation, art, everything  my mind eventually kicked into a higher gear when I finally allowed myself to do this.</p><p>Its a fun ride with a decent body buzz, and our conversation was many-levels deep and extremely intimate.</p><p>All in all I found the experience to be very happy and sociable. The conversation was excellent, and the body buzz was pleasant. My experience taught me to wait on the grass with psychedelic trips until I can clearly notice the onset (if not holding off altogether  or at least till the comedown). No negatives to speak of besides feeling pretty exhausted for almost 48 hours afterwards.</p><p>For me 2C-I put out as much as I put into it - the more effort the better the trip.</p>",
 "year": "2006",
 "id": "51153",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-12T07:00:00.000Z",
 "views": "2982"
}
