{
 "title": "Extreme Abdominal Pain",
 "author": "PB",
 "citation": " PB. \"Extreme Abdominal Pain: experience with Kratom (ID 51161)\". Erowid.org. Mar 17, 2007. erowid.org/exp/51161",
 "substance": "Kratom",
 "bodyweight": "75 kg",
 "report": "<p>I have been using Kratom for a few months, about once a week on average, with both the resin and powder extracts forms. The effects have generally been a warm pleasant inebriation, with nice tingling sensations and waves of pleasure travelling through the body.  There is considerable nausea at higher doses, so these can only be enjoyed lying down. </p><p>Music is enjoyable, as long as its very slow.  With the resin extract, I have experienced a mild psychedelic effect, waking dreams is a good description, just ideas and mental images flashing past randomly, no real sensory disturbances.  Before a couple of weeks ago, the only negative after effects for me were a hangover the following day consisting of a mild to moderate headache and lethargy, although sometimes I felt quite energised the next day. </p><p>There is also a tendency to feel depressed for a couple of days, with a slight feeling of unreality, and quite severe constipation for a couple of days.  I haven't used on a constant basis, so this is just from single doses.  However things turned nasty a couple of weeks ago, when after using Kratom powder ('Super fine powder' it was called, I have seen it on various websites) the night before, I was woken by considerable pain radiating from the upper abdomen.  This steadily worsened after getting up, and I was forced to spend the rest of the day lying in severe pain. </p><p>Consuming food/drink or Gaviscon/antacids made this worse, and the pain would run in cycles of intensity, lasting about 15mins.  At the worst times, I would just be writhing in agony, unable to speak or do anything.  As the day progressed, a feverish sensation came on, accompanied by chills, and generally feeling very ill.  My urine was very dark and difficult to pass.  This continued into the night, with the pain eventually subsiding. </p><p>After a bit of sleep, I felt a lot better the following day, although feeling feverish and ill, with mild abdominal pain still.  Wasn't back to normal till the next evening.  Any doubts I had that this was caused by Kratom were silenced when I foolishly did some more Kratom two weeks later, with EXACTLY the same after effects, plus the added feeling of being a total moron for inflicting this on myself.  Whether this was a contaminated batch of Kratom or something inherent to Kratom powders I don't know.  The powder seemed hydrophobic and difficult to mix with anything; I can imagine it not doing any favours at all for the digestive system. It is worrying that there doesn't seem to be any real information on Kratom's toxic effects, either short or long term, except for vague anecdotal accounts, especially now this stuff is so readily available.  Most of the vendors seem to be covering themselves, with the old 'not for human consumption' line, so they are obviously not too concerned about what is in these 'extracts'.</p>",
 "year": "2006",
 "id": "51161",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-17T07:00:00.000Z",
 "views": "15165",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(powder / crystals)"
  }
 }
}
