{
 "title": "Easy Eating as a Hobby",
 "author": "Gaius",
 "citation": " Gaius. \"Easy Eating as a Hobby: experience with Blue Lotus (ID 51178)\". Erowid.org. Jun 23, 2006. erowid.org/exp/51178",
 "substance": "Blue Lotus",
 "bodyweight": "160 lb",
 "report": "<p>If you've read The Odyssey, you may recall the instance when Odysseus and his crew stumble upon an island of 'lotus-eaters' somewhere off the Egyptian mainland. Odysseus quickly repairs from the locale, fearing that his men may be induced into the consumption of loti to his detriment - a complacent and lethargic crew is no crew at all.</p><p>This passage is from the 2nd oldest text in the Western canon (if we assume the Iliad to be the first). We may thus assume that man has been subject to the allure of this flower - which rises with the dawn and sinks at gloaming - since time immemorial.</p><p>I have never had occasion to eat the actual flower, white or blue, (though there are some in my backyard pond) - I have taken recourse in a variety of high quality prepared extracts (15x and 25x Blue and White Lotus resins) which range in form from a finely granulated brown substrate (reminiscent of good heroin) to a black and viscous tar like substance.</p><p>Though supposedly highly soluble in alcohol, I have not had great success at dissolving these resins in wine. Even the powdered 25x extract tends to clump - I have found it better simply to take it orally, generally from between .1 to .5 grams.</p><p>The taste is not pleasing - it might be described as bitter, much as unsweetened chocolate - but is distinctly floral, and seems to be anesthetic on the tongue. It is not at all a chore to take in this manner, and I have never been rewarded with an unkind experience (i.e., nausea, etc.)</p><p>The effects tend to come on within 15 or 20 minutes. Taken alone these include some slight analgesia (though no flushing, as with true narcotics), a bit of dissociation, euphoria, and an overall looseness and flowing quality - the mind is not affected, but the body is entirely relaxed.</p><p>With wine the effects are greatly enhanced. The alcohol brings a warm flushing to the skin, and the subjective experience can only be compared with the lower opiates - codeine, hydrocodone - it is intensely pleasurable but not on the order of cocaine (which stimulates the delusion of absolute power).</p><p>This being said, lotus is NOT entirely like morphine. It's much subtler. The euphoria isn't orgasmic; I just become (to borrow a phrase) 'comfortably numb.'</p><p>With weed the effects are even better. Here the subjective experience is almost narcotic, and I generally find myself sitting in a chair in the most transcendent reverie; all motivation is sapped from me and it is enough simply to perceive. Things like the rays of light cast from candles in a dark room seem to take on depth, texture, weight. A single ray will appear as a cobweb; that is, it seems tangible, capturable.</p><p>This general looseness, relaxation, sedation - these things last for a period of hours. 3 drinks is enough to bring on a strong response. Almost inevitably, though, I slip into sleep - deep and sometimes lucid.</p><p>The next morning may be described as a period of afterglow, and I have never experienced negative side effects besides a general complacency in attitude: I feel like doing nothing other than being.</p><p>This profile of effects is, of course, highly desirable. And here is the demon of the lotus (it is a demon that most drugs are liable to possess): I want more. If I have a supply it is very tempting to use it; even if I tell myself 'not today,' I'm subject to give in- how can it be avoided?</p><p>And thus the conundrum of the lotus-eaters: is it better to be on or off, for if we chose to be on we risk what Odysseus was unwilling to gamble: subservience to the drug.</p><p>I cannot say, in finishing, that I have experienced withdrawals from the lotus- only the strong desire to consume more.</p>",
 "year": "2006",
 "id": "51178",
 "gender": "Male",
 "timestamp": "2006-06-23T07:00:00.000Z",
 "views": "22780",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(tar / resin)"
  }
 }
}
