{
 "id": 5118,
 "title": "Cognitive Run-Ons",
 "date": {
  "submission": "2004-04-02T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "dopeman422",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "16 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>[Log]",
  "It is 7:45 PM, and Abe Lincoln, Jimi Hendrix, and Quasimodo just dropped 16 mg, 20 mg, and 16 mg of 2C-I. Hendrix is a hardhead for every phenethylamine we've tried thus far, so whether or not he'll trip tonight is still questionable. Ghandi is present as a sober observer. I'll keep you posted as long as I'm here and capable.",
  "7:58 PM - Jimi Hendrix reports first alert, but then remarks that it can't possibly be so. Abe thinks he is gradually turning on, but at this point, it is likely placebo, so he continues to roll his Bugler Jewish Gold cigarettes, awaiting real effects.",
  "8:08 PM - everyone reports feeling different, and Abe's pupils are somewhat dilated. Abe feels hints of that silly grin he can't get off of his face. good signs =).",
  "8:23 PM - Abe feels hot, leg shaking, energy, but has perfectly normal heart rate. Color afterimages persist for a few milliseconds beyond what they should, and Quasimodo leaves an almost imperceptibly thin dark spot behind him in the bright hallway. Abe is at a definite +1.",
  "8:52 PM - bodily sensations are odd and not completely comfortable, remarked upon by all members of the group. Afterimages are electric, and everything of solid color in the peripheral vision flashes.",
  "9:36 PM - Initial discomfort has faded. I had something to tell you all when i sat down here, but now it is gone, and therefore I shall ramble. The screen and items behind it, including keys on the keyboard, are at odd depths, somehow in flux, yet they never change position in my vision.",
  "10:33 PM - My mind wants to frame hypotheses about *everything*. I don't mean *everything* in the all-inclusive, holistic sense, but that everything I see, think, and feel has a very fundamental profundity that it takes great lengths of time to explain in all of its complexity, within my own mind. And yet, at the end of all the explanation, it turns out to be something that's like 'of course!'. and yet, it's so complex...",
  "[Summary]",
  "After I stopped writing, much of the evening is a blur. Abe spent a lot of time looking at art on the computer, analyzing the visual activity present. Colors appeared to bleed into one another, and if a particular color was focused on, it would 'pop out'.",
  "At one point, the group left the dormitory so Ghandi (who was completely sober) could pick up Joan of Arc at her place of employment. Outside, there was a sense that, as always, they were in their own world, and interaction between their world and consensus reality was impossible. The biting cold was noted but was somehow not bothersome. In the car, Abe knew, intellectually, that the roads were fucked and that he was in realistic danger but could not bring himself to worry about it, even as the car fishtailed. The snow was beautiful, as if tiny shards of stained glass of all different colors were mixed in.",
  "When the group returned, Jimi Hendrix and Abe discussed hypotheses and the fact that the drug caused the number of hypotheses framed to increase dramatically. This effect was not present, however, in Quasimodo, who is also not normally an analytical person. This compound, it was decided, probably along with many other psychedelics, would make a good tool for exploring the neurochemistry of personality.",
  "I really wish that the post Hendrix wrote had not been accidentally deleted, as it perfectly explained, in one spectacular run-on sentence, the mode of thinking they were in. Cognitive branching was increased, as with most psychedelics, but 2C-I also had a peculiar quality to it. It's as if, in normal waking consciousness, a conclusion was come to and stated in verbal thought, but on 2C-I, the thoughts leading up to it were stated thus as well. This lead to a feeling of question and answer being one, perfectly self-contained.",
  "During the comedown, there was some significant conversation, the kind potentiated by psychedelics and good friends. Personal issues that were affecting Hendrix and Quasi were discussed and analyzed. Abe was easily brought into an empathic mode, but he feels that the drug probably didn't have anything to do with it.",
  "Some marijuana was smoked by Abe and Quasi while coming down in order to coerce them into sleep. This tactic was inneffective for Abe, for when he closed his eyes afterwards, the CEVs were spectacular. odd-colored ribbons and surfaces in constant motion twisted on his eyelids. If a thought came into his head or attention was paid to a sound, the source was vividly visualized.",
  "The next day, Abe awoke feeling slightly off and with a headache, but Quasi and Hendrix felt unaltered, except that they had not slept very much. Since then, Abe has noticed a VERY interesting perk. Over break, Abe tore open his repaired hernia, and until he took 2C-I, it bothered him to the point that he could not find a comfortable position, even while reclining. As bizarre as it may sound, his hernia has felt absolutely fine since he tripped. Abe has been considering that, perhaps, a major component of the pain from his hernia was a psychosomatic manifestation of some concurrent family and spiritual crises. The hernia itself, however, remains, though it seems to have shrunk, and hernias are not supposed to do that. To say that 2C-I is an effective treatment for hernias is a stretch, but the effect is strange indeed.",
  "All in all, a good trip. Abe is quite open to the idea of a repeat experiment to determine which effects are consistent and which are incidental, but will probably not seek to obtain more.</p>"
 ],
 "erowid": {
  "id": "31327",
  "citation": " dopeman422. \"Cognitive Run-Ons: experience with 2C-I & Cannabis (ID 31327)\". Erowid.org. Apr 2, 2004. erowid.org/exp/31327",
  "substance": "2C-I & Cannabis",
  "views": "13438"
 }
}
