{
 "title": "Nothing But Unpleasant",
 "author": "Killum",
 "citation": " Killum. \"Nothing But Unpleasant: experience with 2C-T-4 (ID 51209)\". Erowid.org. Jul 11, 2006. erowid.org/exp/51209",
 "substance": "2C-T-4",
 "bodyweight": "65 kg",
 "header": [
  "DOSE: T+ 0:00",
  "20 mg",
  "oral",
  "2C-T-4",
  "(pill / tablet)",
  " T+ 2:00",
  "20 mg",
  "oral",
  "2C-T-4",
  "(pill / tablet)",
  " T+ 3:00",
  "10 mg",
  "oral",
  "2C-T-4",
  "(pill / tablet)",
  " T+ 3:45",
  "20 mg",
  "oral",
  "2C-T-4",
  "(pill / tablet)"
 ],
 "report": "<p>[Erowid Note: 70 mgs of 2C-T-4 is a high dose]</p><p>The time of ingesting the pills are not precise due to that everything melted together and I had no precepsion of time.</p><p>Previous experiences: I've been smoking weed for about 3 years. I've also tried codeine, GBL, ephedrine, salvia and perhaps something else I've forgotten.</p><p>This was my first time with a research chemical. This event occurred at the age of 17, by myself on Christmas eve.</p><p>It all begins with my receiving a bag of 20 10mg pills from an online store here in Sweden. Purchased for about $70. At first I thought I'd been ripped off because the pills were microdots (like LSD microdots), with a slight bitter smell. Wrote to a friend of mine by the internet who said that that's the way they should look. About 21:30 I ingest the first pill, the setting is in my room at my mothers house. I wasn't nervous at all, I never am when taking drugs. I always rush into taking the drugs, not thinking of the consequences.</p><p>T +0:00 I swallow two 10mg pills and I begin the long waiting for the pills to kick in. The pills has a kind of chemical taste to them. I've read it takes up to 3 hours for the 2C-T-4 to kick in.</p><p>T +2:00 After two hours, I still don't feel shit. Been sitting by the computer through the whole time, waiting for the drugs to kick in. During this time I might have had a slight feeling of happiness. It might have been the drug but it might also been due to the fact that I've been listening to Bob Marley on my computer. By now, the happy feeling has turned into rage. What the heck? I'm thinking to myself, why isn't anything happening? I've probably been ripped off. At this time I'm so mad that I take two more pills. The total dose is now 40mg.</p><p>T +3:00 Still nothing! Now I'm sure I've been ripped off! In pure desperation I swallow another pill, the total dose now comes to 50mg. In an attempt to forget my anger I begin to watch Lock, stock & Two smoking barrels.</p><p>T +3:45 Been watching about half of the movie and I'm now shaking of anger with the thought that I've been ripped off. The thought that I might be immune or something strikes me too. Oh what the heck, since it ain't working I'll swallow another two pills. The total dose is now 70mg.</p><p>T +4:00 The time passes by and now I'm 100% sure that I've been ripped off. No one can convince me of the opposite. When a fat greek guy in the movie lights a cigarette I feel the need to take one too. I fetch the pack and leave the house. As I'm standing there, in my backyard smoking, I am hit by a weird feeling. It cannot be explained. It's just plainly a weird feeling. I finish probably the best smoke in my life and head in again to face the movie.</p><p>T +4:30 It's the end of the movie and peoples faces in the movie is shifting between green and red, but just slightly and kind of weak. (This also occurred for a friend of mine when he tried 2C-T-4 for the first time) Also they seem to be buzzing, kind of shaking. Cool, now something's about to happen, I think to myself. Also, my stomach is upset, I've been running back and forth between the toilet and the movie a couple of times.</p><p>T +4:45 The movie ends, I close my winamp and I start telling my friends on MSN what I've been experiencing. On one of my frequent visits to the bathroom my eyes catches a necklace hanging on a handle, it seems to be swinging back and forth. I laugh a little bit at the necklace. Through-out all my visits to the bathroom it doesnt hit me that I could check myself out in the mirror to see if my pupils are dilated.</p><p>T +5:30 The trip is going hard on me now, I'm not seeing any significant OEV besides certain things swinging back and forth. I feel very uncomfortable, no matter how I sit I can't sit in a way that feels good. Got no sense what-so-ever about time and space, that feeling is so strong I sometimes feel I don't now where to go and what to do. My visits to the bathroom have now become even more frequent, which of course ruins my journey. I don't now what to do, I get confused and goes out to the front yard for a smoke. The light hitting the ground from the streetlight seem to rise from underneath the ground, hard to explain. Everything is kind of buzzing, like when Im very drunk. I'm walking back and forth over the yard, extremely confused. I think I can hear the neighbours playing music. I get mad and wonder why I can't join them if they got a party, now I head inside again. When I step inside again it hits me that I can check myself out in the mirror. Standing in front of the mirror I can see that I my eyes are fully black, no sign of the blue-ish color I used to have. Also, my face is warping like I see in the alien-movies. I find this very funny and starts to make funny sounds, laughing to myself. This is the only time in my journey I have fun by the way..</p><p>T +6:00 I'm located at the computer once again, only one guy is online and as I get a response from him I call him up on my cellphone. I'm like 'Whats up maaaaan?', 'Nothing, just sitting by the computer.' he answers. I also asks him if he can take a drive and meet me outside my house, but of course he didn't want to. After that, I don't remember much of the conversation besides that I all I could say was Uhhhh, Ahhh and Yeaaaaa. We say goodbye and I hang up.</p><p>T +6:15 Time to try going to sleep. I put some trance/house music on, hit the lights and goes to bed. Damn, I've never been this uncomfortable in my whole life! All I see when I close my eyes is very, very strong CEVs. It appears in all kinds of shapes and colors, it all melts together with the music and I have no idea of how long I laid there and hallucinated. I didn't even have an idea of how my position was, upside down, in or out. From time to time things got real scary. I finally pull myself together and stumbles up to turn the music off. Now I could go to sleep.</p><p>I wake up with no idea of how long I've slept. I can still feel the effects of the drug as I stumble downstairs. I've never been this worn-out both mentally and phsycially in my entire life.</p><p>Conclusion: If all 'psychedelic' drugs are the same, I don't want to experiment with them anymore. Someday, sure, I'll try mushrooms or LSD but not in a near future, that's for sure. I believe I've got real high tolerance to 2C-T-4 because the following day I ate 2-3 pills and didn't feel shit. The day after that I ate about 70mgs again and that trip didn't come near the intensity of my first. The come up is to long on RCs for my taste and I don't like the experience at all. I guess I'm not a psychedelic guy.</p>",
 "year": "2005",
 "id": "51209",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-11T07:00:00.000Z",
 "views": "8708",
 "dose": {}
}
