{
 "title": "Everything's Just GOOD",
 "author": "poisonedboy",
 "citation": " poisonedboy. \"Everything's Just GOOD: experience with Morphine, Cannabis & Alcohol (ID 5120)\". Erowid.org. Oct 27, 2001. erowid.org/exp/5120",
 "substance": "Morphine, Cannabis & Alcohol",
 "bodyweight": "195 lb",
 "header": [
  "DOSE: T+ 0:00",
  "60 mg",
  "oral",
  "Morphine",
  "(pill / tablet)",
  " T+ 1:30",
  "15 mg",
  "insufflated",
  "Morphine",
  "(ground / crushed)",
  " T+ 2:00",
  "0.5 bowls",
  "smoked",
  "Cannabis",
  "",
  "",
  "2 glasses",
  "oral",
  "Alcohol",
  "(liquid)"
 ],
 "report": "<p>It was about 2PM on a Saturday when I recieved a message from my friend that he had my morphine (he had just got a new supply), he was going to give me 60mg for some computer favours i had done him a couple weeks prior.  I'd done it once before from pills he gave me and was eagerly looking forward to this time.  So I went over to his house and picked up the pills; 6 of them, 10mg each, quick acting.  That evening, I decided it was time to take the pills.  The original plan was to crush and snort 3 of them, and tkae the other three orally, but upon trying to crush them, they were much to hard to crush, so i just took them all orally.</p><p>Immediately after ingesting them I felt a little bit of a wave of relaxation, after about 5 minutes I had become increasingly spaced out, so i moved to the couch and lay there watching TV for an hour.  After an hour, things were relaxed, but not the 'great' feeling that i remembered, i felt flashes of it, but nothing groundbreaking, i just felt really spaced out.</p><p>So I decided to message the friend who gave me the morph and told him about how I couldn't snort the pills he gave me, and I asked him if he would snort me a line of MSContin, another brand morphine pill that he had which could be crushed easier, he said that it would be no problem.  So I went over to his house and he had almost prepared the lines of MSContin.  He rolled up a $20 bill and we proceeded to snort through it, it was very very easy to snort, no odd sensation at all.</p><p>After about 5 seconds after each line the effect could be felt.  At this point the goodness that I had felt on previous trips had returned, absolutely everything seemed marvelous.  My only worry was driving home in my doped up state.  We then went upstairs and smoked some pot, my friend was reluctant to smoke pot, because he had a karate test the next day, but it didn't take much to convince him.</p><p>After the pot, things got even more mellow, the goodness of the morphine had a new depth after smoking it, it was now more a resonanting force that was swelling through my body rather than a mood, the physical aspect of the morph was multiplied many times by the pot, I felt waves of it running through my legs, and then crawling up the rest of my body to my arms.</p><p>After a while I decided it was time to go home, because i told my father I was only going to be gone for a little while.  So I hopped in my car and was on my way home, I decided to stop at a gas station and get some snacks, I bought a packaged milkshake and a bag of chips.  Upon arriving home, my father had set up the slide projector, he wanted to show me pictures of my childhood, normally this would have sounded like a ridiculous idea, but on morph, it sounded great, my dad offered me some whiskey, so i mixed it with my milkshake and drank it as we watched the slides.</p><p>I was having such a great time looking at all the slides, it was like everything was perfect, not a care in the world, but i was still able to function completely normally, the whiskey made me feel even more sedated, in a very good way.  After watching reel after reel (I honestly didn't want it to stop) of slides, my dad informed me that he was out of slides to show me.  So i went upstairs and watched some TV until there was nothing left on to watch, and then I surrendered to sleep.</p><p>Overall, it made a great night, morphine is certainally a good drug if you want to have a genuinely good sentimental time ONCE IN A WHILE.  Mixing it with pot and a touch of booze certainally adds to the experience, I don't think I'll have any access to any morph in the near future, so this experience will be well cherished.</p>",
 "year": "2001",
 "id": "5120",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-10-27T07:00:00.000Z",
 "views": "70614",
 "dose": {}
}
