{
 "title": "Amazing... and Scary Even for a Psychonaut",
 "author": "LightSeeker",
 "citation": " LightSeeker. \"Amazing... and Scary Even for a Psychonaut: experience with Banisteriopsis caapi & Mimosa hostilis (ID 51211)\". Erowid.org. May 15, 2006. erowid.org/exp/51211",
 "substance": "Banisteriopsis caapi & Mimosa hostilis",
 "bodyweight": "185 lb",
 "report": "<p>On friday night I ingested caapi and viridis... nice, not very visual but comforting, soothing, and warm.  saturday night I thought I'd repeat and try to experience more... be careful of what you ask! </p><p>This time I used mimosa instead of chacruna, and the combination of built up mao inhibitors and mimosa really, really kicked my ass. </p><p>An hour in I almost took some kratom as I thought nothing was going to happen.  I was mildly sick, so I threw up and BAM! From 0 to 100 in about 1/2 second.  I was caught in this loop of not being good/bad, positive/negative, not anything... and didn't know how to get out.  This subsided, but I was uncomfortable in my own skin.  I would say I've done up to 2000 mics of LSD before (20-25 drops of liquid) and 8-12 hits of paper several times.  Visually the ayahuasca was like being on over 1000 mics of LSD.. at least.  This was accompanied by a strange trance/dream state that scared me... I was so high for a while I didn't know if I was asleep, awake, in a trance or what.  I laid down, got up, and repeated this about 50 times. </p><p>I would say be REALLY careful of the dose.... had I not previously had much experience with tripping it could have been really bad (like 911 really bad).  Two hours in and it didn't matter if my eyes were open or closed, the visuals were the same.  Imagine LSD patterns times 10, plus starting to see shit that just wasn't there.  Couldn't read a clock, really really felt close to insanity.  I kept telling myself, 'it comes in waves, it'll be okay'.. 3 hours in an boy was I wrong.  I could not BELIEVE how high I was... and frankly wanted it to stop.  I will say I did learn a lot about myself, but I should NOT do this recreationally, NOT do this with anyone but friends/ shamans, and NOT do this as a first experience. </p><p>At the 3 hour mark patterns were starting to coalesce into solid objects, spirits, etc.  And the colors from the patterns were unbelievably vivid.  More so are the mental effects.. the visuals weren't so hard to deal with (although incredibly intense), but the mental stuff was... these 'reality loops', insanity, etc. </p><p>4-5 hours.. left as fast as it came.  Literally within an hour am down to almost baseline.. unlike the slow return from LSD.  I may do this again, being VERY careful of the dose (not doing multiple days again, and NOT 12-15 g of mimosa.. TOOO much with that much caapi). </p><p>An incredible, life changing experience, but do be very careful and respectful.</p>",
 "year": "2006",
 "id": "51211",
 "gender": "Male",
 "timestamp": "2006-05-15T07:00:00.000Z",
 "views": "13778",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Banisteriopsis caapi"
  },
  {
   "time": " T+ 0:00",
   "administration": "oral",
   "substance": "Psychotria viridis"
  },
  {
   "time": " T+ 24:00",
   "amount": "40 g",
   "administration": "oral",
   "substance": "Banisteriopsis caapi"
  },
  {
   "time": " T+ 24:00",
   "amount": "12 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora"
  }
 ]
}
