{
 "id": 5126,
 "title": "Cartoon Weirdness",
 "date": {
  "submission": "2007-11-14T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Caligula",
  "gender": "Male",
  "weight": "300 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "I had tried salvia a few times before, in small doses, with no effect whatsoever.  I was tempted to give up entirely, chalking the interest in the drug to some sort of mass hysteria, but lately, even my close friends have been strongly recommending the drug to me.  Since I trust these people, I decided to give salvia a final go, with much greater success.",
  "The trip was pretty much on a whim.  I recently recieved a small promotional amount of 5x extract from an online retailer, and while I was sitting outside smoking cigarettes, I asked my girlfriend and my friend Jess if they'd like to try it.  Dope fiends that they are, they said they would.  The sample was probably about a gram, and initially, I packed about a fifth of it.  I went first, but I had a hard time holding the hit for thirty seconds, and the effects were very mild but noticeable.  Patterns on the ground outside were slowly creeping toward me, and there was definitely some time distortion, or rather the sensation of being in slow motion, but oddly enough, it seemed as though it only affected certain areas. I would look one way, and everything would be moving much slower than usual, I could look the other way, and things would appear normal, and when I looked back the first way, things were still slow.",
  "Anyway, we all passed and filled the pipe a few times, trying to hold it, and maybe the fifth time around, I passed the pipe onto Jess and began staring at the area between Jess and my girlfriend, which appeared to be in something of a butterfly pattern, moving in a way that might be described as a flipbook animation jerkily zooming in, with reverberations appearing around it.  When I noticed this, and I noticed that any conventional perception of the area I was looking at had disappeared, I shouted my battle cry ('I am SO on drugs') and fell back laughing.  When I fell back, I perceived it as falling into an orange checkerboard universe, which was enveloping me entirely.  I found this relatively threatening, and I feared getting trapped in this motion, so I got up.  When I did get up, I felt as though the trajectory of my head was premapped in the air.  Very strange.",
  "With great effort, I tryed to control the giggles, and explained that I felt like I was in a fairy tale.  This interaction was incredibly taxing, but Jess agreed with me.  This shared perception was the most exciting thing I had ever experienced.  I immediately stood up, also with a great expenditure of effort, and clawed at the air, fully expecting to tear away the fabric of reality and reveal the cartoon wonderland beyond.  Unfortunately, this didn't work, but when I stood up and approached the fence nearby, I did get a very cartoony feeling.  All of this took maybe 2 or 3 minutes, and while very intense, faded very quickly after the revelation that I couldn't rend the fabric of the universe. ",
  "When I came back from the fence, my girlfriend, who didn't get anything from the salvia, seemed angrier than she had ever been.  It was as though her bad vibrations shot directly from her to me, penetrating my soul, or something equally cliche.  Her unhappiness had a very strong resonance in me, and I decidedly did not like it.  I told her about this, and she asserted that I was imagining it, and that she would go inside so that she didn't interfere with the trip, which was selfless, but also useless, as I just felt guilt.  This faded quickly, however, and for the next few minutes, I had a feeling of general weirdness, but certainly nothing like what had happened before.  Within 10 minutes, there was nothing remaining but a slight dizziness, and a feeling of awe lingering from the first few minutes.",
  "Salvia is incredibly badass, and definitely deserves more experimentation."
 ],
 "erowid": {
  "id": "31344",
  "citation": " Caligula. \"Cartoon Weirdness: experience with Salvia divinorum (5x extract) (ID 31344)\". Erowid.org. Nov 14, 2007. erowid.org/exp/31344",
  "substance": "Salvia divinorum (5x extract)",
  "views": "2951"
 }
}
