{
 "title": "Hardcore Sniffing",
 "author": "Zoop",
 "citation": " Zoop. \"Hardcore Sniffing: experience with Zaleplon (Sonata) (ID 51263)\". Erowid.org. May 26, 2006. erowid.org/exp/51263",
 "substance": "Zaleplon (Sonata)",
 "bodyweight": "82 kg",
 "report": "<p>My experiences with zaleplon began in 1999, when the drug first came out on the U.S. market as a treatment for insomnia, and I happened to work in a pharmacy.  I read that it had a very very fast onset of action and very short half-life - only 1 hour.  From what I knew about drug action and pharmacokinetics (the science of how drugs are absorbed, distributed in the body, metabolized and excreted), drugs with very fast onset of action are typically good candidates for snorting, simply put. </p><p>So, I took out two 10mg capsules of Sonata, and placed the contents of these two capsules on a piece of glass. The capsules are PERFECT for insufflation, because they are only half-full.  There is only a small amount of material needed to ingest in this manner, which is ideal.  Two small piles of white powder, one quick snuff of one pile into each nostril, and within 30 seconds, a rush of a sedative feeling, and my field of vision is covered over in tiny pixellated green and red dots.  Flat surfaces take on an iridescent sheen, and people's faces seem strange. There is a pronounced, but mild, hallucinogenic effect combined with a definite sedative-hypnotic-type buzz factor, similar to the feeling from Valium, Xanax, Klonipin, or any other 'benzo' (although it should be pointed out that Sonata is technically NOT a benzodiazepine).  What is so pleasurable about using Sonata in this way is that the onset is almost instantaneous, which makes it totally different from those other sedatives.</p><p>Also, like I said before, the duration of action is only one hour at the longest, could be as short as 30 minutes in some people.  Tolerance developed, for me, after a couple of months using Sonata habitually in this fashion (up to about five times a day at the most, back in 2000), so I sometimes would snort 3 capsules, but I usually only did two, like I started with.  The drug can cause profound, but temporary, amnesia, so I have to be aware of that and I have to be careful to write down what I did while on it if it's important to remember anything!  I used Sonata like this on-and-off from 2000 until 2005. </p><p>I have decided that the amnesia is too much for me to tolerate anymore and I have made a decision to discontinue the use of this drug; I no longer work in a drugstore either, so it is easy to stop. I would have to go through a lot of trouble to get it, like go to a doctor and complain of insomnia, tell him I had Sonata in the past and it worked really well.</p>",
 "year": "",
 "id": "51263",
 "gender": "Male",
 "timestamp": "2006-05-26T07:00:00.000Z",
 "views": "14633",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Pharms - Zaleplon",
   "form": "(powder / crystals)"
  }
 ]
}
