{
 "title": "Changing My View on Arts",
 "author": "Anjovis",
 "citation": " Anjovis. \"Changing My View on Arts: experience with 2C-E (ID 51296)\". Erowid.org. Mar 20, 2006. erowid.org/exp/51296",
 "substance": "2C-E",
 "bodyweight": "86 kg",
 "report": [
  "<p>Around 2pm, me 42mg of 2c-e and my friend M 46mg of 2c-e, both swallowed in a capsule.",
  "After t+1.30 trip starts. Relatively smooth come up, I felt just stretching, not much nausea nor other negative symptoms. We had a small walk in nearby woods, light excercise took care of the small anxiety that developed in the beginning. Now we are back at my home, my family is visiting my wife's parents for the week so we have no hurry anywhere. I place some ambient music to playlist and we lie down to listen after just a very small visit to bong. I feel cold and I shiver constantly, but it doesn't bother. Right now we listen to William Basinski - The River. I never knew anything could give experiences like this. The echoing sounds create kaleidoscopic looping patterns inside my head in seconds. These patterns are not just mere visuals, they consist of entire universes of meanings, as if stories of other lives.",
  "The true trip starts. I snap out from deeper journey to put more blankets over myself a few times during the album, but fall back every time in a few seconds. I remember opening my eyes and watching the ceiling for a few seconds. It was a sea of patterns, ever changing, undulating back and forth. Real life seemed like a dream then and the new world created by the music was the real place with its diamond shaped patterns. I seem to touch something mystical, something which seems like a well guarded secret that only listeners of this album with the right state of mind can achieve. This truth is ineffable, like a very clever trick revealed to me. I travel through places, but I cannot describe them anymore. There are a few moments where I wonder if this is too much, as if those tricks that I had the chance to see for the first time were just too complicated and surprising for me to handle. But those overly intense moments pass and again I am no longer aware of routine reality.",
  "Soon the album is over and I wake up to real world. I am slightly stunned. Ending of the music seemed like slowly closing a door to that other side, full of those revelations. I take some fruit salad and we continue to sink into another album, Propeller Island - The Garden. This also gives me extraordinary hallucinations, mystical states and ever changing, emotionally charged vivid thoughts and visionary patterns. This album was much smoother and brought me back from the deeps sometimes during the album, but nevertheless I am again amazed from tip to toes.",
  "Those two out-of-this-world trips took a lot of energy and we end up just listening to more easy type of music, like Namlook, Steve Roach, Robert Rich and other classical ambient. The plateau ended around 7pm (t+5h) and long, slow and smooth transition back to normal consciousness begun. We smoked a good deal of weed and visited some friends during the landing period. I got some more weed from my friend R, the hippie. By midnight I was relatively free from effects of 2c-e, but really heavily stoned. I missed my bus and had to walk some 15km back home.",
  "Later, after many trips and countless new journeys with the help of music, I know now that those tricks, revelations and visions had always been there inside those albums. Those tricks were hidden inside the sounds, but I simply needed an aid to find them. Now I can find them always, although much weaker than on that sunny summer day that I heard them for the first time. Psychedelics make me sensitive to all kind of information, patterns and subtle meanings that those sounds create. Normally I just never pay attention, they are too subtle. The very sensitive state of mind that these psychoactive drugs put me into, forces me to hear properly, to pay attention to details. It is this very phenomenon that I think is essentially what tripping, or psychedelic state of mind, is about.",
  "I seek out patterns from all input I happen to have, my brain runs overclocked for those few hours, tuned in for all the signals that happen to pass my consciousness, were they in the form of sounds, images, tastes, touches or just my own brain feeding my some memories. There is some mighty machinery somewhere in my gray brain matter to do that pattern matching, it is trivial to see after even one psychedelic experience. Matching patterns, those tricks and revelations that I might find, can be so complicated that expressing them verbally to people in the ordinary realm of consciousness is simply impossible. That classical philosophical question whether we can verbally explain everything that we think is easily solved by psychedelic experience, at least in practical considerations.",
  "When I look back and try to write even one of my many encounters with the world of psychedelics (like the one above), I realize the deed is too vast to fulfill in one lifetime. Sadly too, this task cannot be split into parts, expressing one single thought is one undividable task. Even with all the resources in the world I couldn't make it easier to accomplish, there is no help from recruiting a hundred secretaries to write the text for me.",
  "Even worse, if someone had had that exactly same experience, how would I know it? Unless he could express it completely, which was seemingly impossible for a single lifetime, how could I ever know we had the same experience? In this light, psychedelic experience begins to look quite lonely path, those experiences are forever trapped inside my mind and I can only shed some small blinks of light into those huge monuments of thoughts. But perhaps there is a solution to this. Tuning in and seeking out signals of the experience from another person in this highly sensitive state of mind. Then I could understand subtle expressions of meanings multitudes faster than in normal life, thus perhaps making the impossible task of expressing psychedelic experience possible. Slight grin on a face can turn into dramatic story of betrayal, seduction, heroic deeds and cowardly escapes in a fraction of a second, faint waving metallic sound can be quickly seen as a cosmic tale of birth of stars, death of galaxies and everything that happened in between. Is it that I can pack more certain type of information in less space if I can use the help of psychedelics to unpack them? I personally believe so, this was the experience that convinced me about it.",
  "Next thing is to find out what type of information could be packed, what kind of expressions can I pick up on psychedelics and what not.</p>"
 ],
 "year": "2004",
 "id": "51296",
 "gender": "Male",
 "views": "13235",
 "dose": [
  {
   "time": "0",
   "amount": "42 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2006-03-20T08:00:00.000Z"
}
