{
 "title": "Two Days Without Sleep, Without Problems",
 "author": "nothingisreal",
 "citation": " nothingisreal. \"Two Days Without Sleep, Without Problems: experience with Modafinil & Paroxetine (ID 51302)\". Erowid.org. May 1, 2006. erowid.org/exp/51302",
 "substance": "Modafinil & Paroxetine",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "Modafinil",
   "(pill / tablet)",
   " T+ 12:00",
   "100 mg",
   "oral",
   "Modafinil",
   "(pill / tablet)",
   " T+ 16:00",
   "30 mg",
   "oral",
   "Pharms - Paroxetine",
   "(pill / tablet)",
   " T+ 19:00",
   "100 mg",
   "oral",
   "Modafinil",
   "(pill / tablet)",
   " T+ 36:00",
   "30 mg",
   "oral",
   "Pharms - Paroxetine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Dosage summary:</p><p>T+00:00 - 100 mg Modafinil</p><p>T+12:00 - 100 mg Modafinil</p><p>T+16:00 -  30 mg Paroxetine</p><p>T+19:00 - 100 mg Modafinil</p><p>T+36:00 -  30 mg Paroxetine</p><p>I recently obtained Modafinil to test its efficacy in treating daytime somnolence, possibly caused or exacerbated by my 30 mg/day use of Paroxetine.  I've heard that some people use Modafinil to stay awake at night, so I decided to try it for that purpose first.</p><p>I've lately been going to bed around 17:00, so at 15:00 I took one 100 mg tablet of Modafinil.  As I expected from reading others' testimonials, at this dose I didn't perceive any effects except for lack of any desire to go to bed.  There was no euphoria, tachycardia, or hyperactivity such as that one experiences with methylphenidate (Ritalin) or ephedrine, nor the nervousness and jitteriness that comes with too much caffeine.  My appetite was normal.</p><p>I was able to continue working at my computer without feeling sleepy until around 03:00, at which time I took another 100 mg.  By 10:00, I was beginning to lose my ability to concentrate, so I took a final 100 mg and switched from mental work (mostly reading, writing, and programming) to light physical labour (household chores).  After a few hours of this, I was simply too tired to continue and went to bed.</p><p>I slept lightly for between two and three hours before being rudely awakened by some incredibly loud music and singing from the apartment next door.  With this racket I found it impossible to go back to sleep and went downstairs to talk with my roommates.  To my surprise, I found that I wasn't groggy at all, but completely refreshed and alert (after so little sleep!), so I changed back into my clothes and was able to work another ten or twelve hours without any urge to go back to sleep.  When I finally did go to bed, I sleep soundly for about ten hours and awoke refreshed but with a mild headache (easily treated with some paracetamol).</p><p>Overall, I was impressed with Modafinil's effects.  At the doses I tested, it didn't have any recreational potential, but was useful for staying awake and alert for long periods.</p>",
 "year": "2006",
 "id": "51302",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-01T07:00:00.000Z",
 "views": "23068",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  }
 ]
}
