{
 "id": 5134,
 "title": "Revelations At Church Camp",
 "date": {
  "submission": "2005-07-17T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "blue",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "This report might sound a little funny, as it is both the best experience that I've ever had, and it was on drugs at church camp.  In August of 2003, I was preparing to leave for a week-long church camp in the central Sawtooth Mountains in Idaho.  I really wanted to bring some pot with me, but for some reason nobody I knew had anything but mushrooms that had just come in from Seattle.  This was fine and dandy with me, since they are my drug of choice. ",
  "I had to pay $40 for a half a quarter ounce, which seemed a little steep to me, but I wanted to get messed up at camp.  Interestingly enough I went to pick up my bag of mushrooms in my old elementary school parkinglot. The caps were surprisingly small, and a beatuful golden color.  In the times I have experienced psilocybin before, it was with Psilocybe Cubensis, so I was a little bit suspicious of the way these blue meanies looked.  The smell is unmistakeable, however and I was happy to have these in my possesion.",
  "The next morning, I left for Ketchum, Idaho highly anticipating seeing old friends and tripping balls.  The day finally came when I had planned to drop the magic mushrooms, and I could barely wait.  On this day we traditionally take a trip to Red Fish Lake for the day, and have milkshakes at a restraunt on the way back.  During 'Quiet Time' I ingested the wonderful chemical, and it was time to go to the lodge and make our sandwiches.  I'm really glad that I ate my mushrooms when I did because I was sober while doing things requiring motor skills. ",
  "Shortly after making my sandwich, I was talking to my friends Scott and Bunko (both of whom were present for my munching of the blue), and they said that my pupils were huge.  I knew this as I was starting to feel the most screwed up I've ever been.  The camp director Manny, came up and talked to me, and I freaked out.  I told him I forgot my swimsuit, so I went back to my cabin but picked up my had in a terribly worthless attempt to hide my messed up eyes.  I made a quick trip to the bathroom, which turned into a long one because it's really trippy to pee on mushrooms when you think about what's going on in your body.  This, paired with my extended look in the mirror because of the difference in my appearance took 3-5 minutes. ",
  "We all loaded up in the bus and I was really tripped out by the shape of the ceiling.  Usually on trips like these with all my friend, I am talkative and sociable, but I found myself secluded and looking out the window in silence.  The driver could have taken me anywhere in the world and I'd never have known it.  The winding mountain roads, surrounded by trees made it imposible for me to judge our direction.  The prospect of coming over a mountain and seeing a brand new valley filled me with an undescribable joy.  I found myself able to also envision what these valleys had looked like millions of years ago, with water replacing the grassy meadows.  I tried to see the dinosaurs that would have been present but I was unable to.",
  "When I closed my eyes, it was like I was on some sort of ride.  There were really colorfull dance floors totally abandoned, but with tiles of many different colors, and some I had never seen before!  I saw colors that are not possible to make in a normal state.  As I flew forward though dance floor after dance floor, I could see in the distance my friend Scott's face.  When I got closer to it, I could see his mouth was open.  My velocity seemed to increase and I opened my eyes right as I was about to be engulfed in his mouth. ",
  "We arrived at the lake after God knows how long, I had noth the slightest clue.",
  "We unloaded and went to the benches by the beach for some lunch.  I found myself not hungry at all, and sitting across from my youth director from my church.  This proved to be a problem, because she striked up conversation with me about choir, and I answered one question.  When I heard my own voice, it sounded so incredibly different that it usually does, I was unable to answer the three questions that followed.",
  "She was sitting right across from me, and yet I ignored her.  We walked down to the beach and I regretted not actually retrieving my swimsuit.  The clarity of the water was so beautiful with the sun reflecting off of it, so I just had to get it.  I took off my shoes and socks and rolled my pants up as high as they would go.  I didn't realize how ridiculous one looks with his pants rolled up to his upper thigh, but I thought nothing of it.  My two companions and I waded out as far as we could go (they were without swimsuits as well) when a group of girls that I knew well showed up with a camera to photograph my pants.  They thought that I was doing it to be funny, which was fine with me, so I allowed them to take a picture.  When back on shore we played the cardgame Bullshit, which I found very interesting and very easy.  I could completely tell when someone was lying about their cards, and for some reason the game actually made sense to me.  I tripped out looking at the mountains and other surroundings until it was time to go.",
  "I don't remember the ride back, up until we arrived at the gas station where we got our milkshakes.  When I got mine it was all melted because I was in the bathroom tripping out to my reflection once again.  When I ate my M&M milkshake, it was extremely good, until I bit into something strange and moist.  I exclaimed loudly, 'What the fuck?' only to find that I had bitten into a cherry.  I felt a little bit stupid, but like before...didn't care.",
  "Like I said, this was the best experience of my life.  I didn't do much of anything that day, but the mushrooms made it unreal.  I highly recommend the eating of magic mushrooms as long as you are sure of the species and are in a safe environment.  I've done hallucenogenic mushrooms four times with no adverse effects, and I think everyone should have the right to such experimentation if they so choose."
 ],
 "erowid": {
  "id": "31367",
  "citation": " blue. \"Revelations At Church Camp: experience with Psilocybe Azurenscens (ID 31367)\". Erowid.org. Jul 17, 2005. erowid.org/exp/31367",
  "substance": "Psilocybe Azurenscens",
  "views": "4819"
 }
}
