{
 "title": "Dating an Addict",
 "author": "Pseudonym",
 "citation": " Pseudonym. \"Dating an Addict: experience with Cocaine (ID 51363)\". Erowid.org. May 28, 2008. erowid.org/exp/51363",
 "substance": "Cocaine",
 "bodyweight": "130 lb",
 "report": "<p>My boyfriend, whom I will call Matt, has been using cocaine recreationally since he was 17.  He will be 23 six days from today, and still uses cocaine.  When we first started dating, I had never tried cocaine. I had tried my fair share of other drugs: opium, mushrooms, ecstasy, mali (MDMA), LSD--in other words, I was not closed-minded to or unexperienced in the use of drugs recreationally.  Also, I'm a pothead through-and-through--I love weed and see nothing wrong with smoking multiple times daily.  This is certainly not being mentioned because I am proud of the drugs I have taken, but to establish a sort-of 'credit' with readers, perhaps to express just how open-minded I really am when it comes to substances, perhaps, too, to reiterate just how different cocaine is in comparison to the drugs I just named.</p><p>But back to my story...damned ADD...</p><p>In addition to Matt, most of my friends used cocaine recreationally, too, so I had been exposed to it more times than I could ever begin to count.  Knowing it's high addictivity rate, I decided I should probably limit my addictions to one (that being pot) and steer clear of the stuff.  Dating a user is different than partying with users, and, as often happens to young, impressionable girls, my curiosity eventually got the best of me.  It was a special occasion (OU/Texas weekend) and I was drunk, so when my roommate offered me a line, I took her up on it.</p><p>This is not, however, a testimonial of my experience with the drug, which I found to be disappointing and ultimately very depressing after the initial, short-lived high.  I'm sure I don't need to go into the physical/psychological effects of blow, as you can find these traits on just about any other post.  It should also be noted that this was, of course, not my first-and-last time to use cocaine, as I had originally planned.</p><p>My boyfriend was extremely disappointed when he 'found out' I had tried it (I use quotes because he and I did a line together my first night of doing it and he didn't remember the next day until I told him).  After that I noticed a peculiar change in myself--instead of the nonchalance I practiced in dealing with his frequent and heavy usage (at times he would blow a gram in less than an hour), I responded with hostility.  If he was doing it, I wanted to do it out of spite, or so I thought.  So I did, anytime I had the chance.</p><p>Once I noticed this pattern developing, I knew I had to get smart.  I confessed to Matt that I had been using more than he was aware of, partially out of spite and partially because of an addiction I didn't know I was feeding.  For our New Years resolution, we resolved to stop.</p><p>It doesn't take a genius to figure out that for me, it was a piece of cake.  After about a month of being clean, I stopped thinking about it, even when I was pissed drunk.  Matt, however, began to find creative ways to continue using without my knowing.  Lying about where he was going, sneaking out after I fell asleep and defending his strange behavior as though it were his religion became frequent occurrences.  Any idiot could see what was going on, and being the patient person I am, I offered my help.  He had expressed his desire to quit to the point of tears so many times before, and to this day I believe that his desire is sincere.  But such is the nature of the beast--as much as he may want to stop, his addiction is uncontrollable.  From my position, to try to stop him is quite impossible.  Only the conductor can stop the train--not the person lying on the tracks.</p><p>Of all the drugs I have ever tried, this is the ONLY ONE I seriously regret.  I regret it so much now that I can't even hang out with my friends who still use it.  Matt loved me more than this drug, but his addiction was too much for either of us to handle.  I would do ANYTHING to be able to free him from it, and I will always love him for the wonderful person he is--he is just unfortunate enough to fall victim to this drug.  It pains me so much to write about this that even as I type these words, my eyes water and that damned lump in my throat returns.</p><p>When I broke up with Matt, he was devastated.  He criticized me, told me how much he needs me to get through his addiction, and cried more than I have ever seen a man cry.  But the emotional weight I was carrying from his addiction-driven lies and such was finally too much.</p><p>Skipping back, there is one thing that Matt told me while we were together, after he 'found out' I had tried blow, that really hit home to me.  I hope I have conveyed to you the seriousness of Matt's addiction and how it caused him (and me) to lose a very close, personal relationship.  Matt and I were arguing about my right to do cocaine, and I was spitting out all the predictable lines one would expect to hear.  'You do it all the time,' I argued, 'don't be hypocritical.  Besides, I only did it once.'  With remorse in his tone and tears welling up in his eyes, he replied, 'yeah, I tried it once, too.'</p>",
 "year": "2006",
 "id": "51363",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-05-28T07:00:00.000Z",
 "views": "6184",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "",
   "substance": "Cocaine"
  }
 }
}
