{
 "title": "The Rundown",
 "author": "The Flop",
 "citation": " The Flop. \"The Rundown: experience with Tramadol  (ID 51375)\". Erowid.org. Jan 17, 2008. erowid.org/exp/51375",
 "substance": "Tramadol ",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Pharms - Tramadol",
   "(liquid)"
  ]
 ],
 "report": "<p>Time is 5:30pm and I am home from work.  This is my first experience with Tramadol HCl.  The decision is made that 150mg of Tramadol HCl powder will be dissolved in 8oz. of cool water.  Tramadol HCl is a very soluble compound.  The Tramadol solution was consumed quickly in a few gulps on an empty stomach.  Taste is rather neutral with a slight bitter-plastic taste.  Nothing near the horrible taste of some tryptamines I have had before. </p><p>T+0:00(5:30pm)</p><p>No effects.  I wash the glass out with a little extra water to ensure I swallow the complete 150mg Tramadol HCl.</p><p>T+0:12 </p><p>No effects.  Simply sitting on my couch and reading a book.  Decision is made to write my observations on a paper notebook rather than type out on the computer.  Nothing felt at all when walking around my apartment.</p><p>T+0:27 </p><p>No effects.  Absolutely nothing felt, even with walking.  For a few moments I forget about taking any drug at all. Coordination is the same; thinking is the same; vision is the same.</p><p>T+0:45</p><p>No effects.  Typically with some drugs I feel threshold effects by now.  Decided to stop reading my book and start cleaning my apartment. </p><p>T+0:55 </p><p>Slight feeling of nausea felt in the back of the throat.  No effects other than this.  Could be threshold effects.</p><p>T+0:57 </p><p>As soon as I get up to walk I feel the first tinges of what I would call a drugged Jello-feeling.  Onset begins here I would say.  Feeling a little bit slow in movements.  Feeling a bit sick with nausea, but not bad at all.  Not good or bad feeling at this point, total opinion is neutral.</p><p>T+1:05 </p><p>Nausea fades away.  Effects feel like they are building.  Mentally I am still the same, but might be a bit slower in thinking.  Coordination feeling a little like dextromethorphan at a 1st plateau level, but no mental stimulating effects like dextromethorphan. </p><p>T+1:15 </p><p>Effects slowly building.  Overall Jello-feeling is not good or bad.  Coordination dulled like dextromethorphan at 1st plateau or after 2-3 alcoholic drinks.  Unsure socially if I could interact the same because of the feeling of slowness in my mind.  Slow feeling is all in the head with most of the Jello feeling in the shoulders.  Other than this nothing huge along the physical end or mental end.  I am definitely feeling the effects and would best describe it as an inebriated body.  </p><p>T+1:40 </p><p>Effects continue to build from the last time report.  A generalized chilled-out feeling has consumed me.  Feeling is rather pleasant however not terrific.  Find myself occasionally sitting down and thinking while doing nothing for spans of time.  Definitely mind sedating.  Thoughts are becoming slower.  Body feel is similar to that of the bumbling 1st plateau dextromethorphan feeling.  Experience is enjoyable so far but not very productive.  Note the time gap from the last report as an indication of slowing thoughts and general decrease motivation.  If I wanted to I could move around to do stuff without much trouble, but do I really want to?   </p><p>T+2:00 </p><p>Effects feel that they are no longer building. I would say that a peak may be reached, but hard to tell until later.  Internal dialogue appears to be limited which comes as a good thing because my mind tends to be overactive.   General sedated feeling.  Slight uncomfortable feeling in the shoulders but it is more of a rounder discomfort rather than sharp and edgy feeling in the shoulders that dextromethorphan provides.  Feeling a touch of nausea so I eat a few crackers with water.</p><p>T+2:31 </p><p>Effects are the same as 2:00 so I probably have peaked.  Little bouts of nausea pop up here and there which make what would be a good experience into something that is only neutral.  Mind is fairly clear but is simply slower, but not so much slow that I lose my train of thought.  Overall good and I hope the length of the drug lasts long enough so that I get to a point where I forget I have taken a drug.  Sitting down and doing nothings feels like I am wasting time so I get up and clean some more.  Feel an urge to keep on the move but not very fast, but simply on the move. </p><p>T+6:00 </p><p>Effects have maintained fairly strong until about 5th-6th hour.  General feeling at 2:31 was maintained during this duration.  Overall a good experience.  However quick sudden movements or a lot of walking around produced a nausea feeling that almost caused me to vomit my crackers.  Not really a dizziness but just the result of too much head movement for the brain to process.  Keep activity movement to a low level to prevent nausea.  A friend called on the phone about an hour ago and the conversation came as tiresome to me.  Got a lot of cleaning done in my apartment while not feeling bored.</p><p>The ability to socialize over the phone was not very good. Sleep was great and woke up the next morning refreshed and ready to meet the day.</p>",
 "year": "2006",
 "id": "51375",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-17T08:00:00.000Z",
 "views": "60161"
}
