{
 "title": "Rolling With A Man In A Dress",
 "author": "itsgot2bme",
 "citation": " itsgot2bme. \"Rolling With A Man In A Dress: experience with MDMA (Ecstasy), Amphetamines, Ketamine & Cannabis (ID 51380)\". Erowid.org. Apr 18, 2007. erowid.org/exp/51380",
 "substance": "MDMA (Ecstasy), Amphetamines, Ketamine & Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>This is a report on my first time rolling, and I wrote it still cracked out from the weekend.  The white powder is a mix of amphetamines and ketamine. Its written as I felt I experienced it.</p><p>Orange crystals lay piled on the edge of her knife as it rest below my nose. 'Breath in.' Burning. Tingling. Flowing. Sensations run. Through my nose, my throat, my lungs(?). Each new breath feels more foreign. Blood surges and my arms fall like rocks to my sides. 'I need to lay down,' His voice distant as it drips from his lips. In suit I follow him to the bed, touching his skin with a new found amazement in it. Something was so smooth about it... so touchable. I don't know how long we lay there, but suddenly I wasn't heavy anymore. I felt I'd grown wings and my eyes were finally open, all my senses released to their intended strength. To touch the one I loved was like making love to him... each caress warming me. A rush of blood flooded up my neck, gushing with the sound of a faucet turned on high. My heart was beating but I couldn't feel it. All I could see was the people around me... all so new to me, yet so perfect in their own way. Bump. Bump. Oranges... I realized the need of the soul for human contact and allowed myself my need. My mind flew faster as I talked with them, shared my life with them... and they shared their own with me. My sympathy was boundless as they told me of their troubles, and my happiness swelled as they spoke of their triumphs. There was nothing that could bring me down.</p><p>Stop.</p><p>-Breath.</p><p>-Inhale-</p><p>Round two. White powder, softer than before. The burning felt soothing to my nose as it ached for more. My eyes suddenly opened wider as a child-like wonderment came over me, everything was as if I'd just seen, tasted, touched it for the first time. And I started to wonder if maybe I never had. If maybe I'd never lived before this moment, before tonight. The rush of my epiphany only fanned my need, and ability, to find awe in everything around me. An old tatter blanket felt like my childhood manifested. The aged edges with their worn in tenderness and silk reminded me of memories I'd long forgotten and lost as soon as they came. I realized how fickle memory was, taking moments of beauty out of context and making them ugly rude and obscene. I vowed to never let these moments fade, immobilize them before they float away like dreams... Nemo's painting's swirled around me, coming to life and touching me with their twisted beauty. I was there in their land of make-believe hope, immersed in spinning colors of a 3-d light show just for me.</p><p>Stop.</p><p>-Breath</p><p>Next round. Knife out, bump ready. Soft powder once more, my new found friend and a bottle of vodka too strong for words. Abstract things make perfect sense. A man in a dress. Liquid up the nose. Bodies move to the music. My own voice sings out in unison but I can't hear it's tone. Time ebbs and flows as I come to rest upon the couch beside the blue swirled glass bowl with it's long tube and dark sliding hole. The smell of herbs burning brings me back to ancient times. Remedies aiding the sick from broken bones to shattered minds, making each whole again.</p><p>Light-</p><p>Breath.</p><p>                                                                                                    Pull-</p><p>                                                                                                                                      Inhale.</p><p>Gurgling sounds like the fountain of youth, making me young once more. Splashing in it as each new breath pulls in magic. Senses, higher than I've ever been before.   Conversations last for hours, feel like days of insignificant moments. I realize how small we really are. Hot breath meets skin, skin like butter to my fingers as my heart opens up wide. Movement, hearts race, -release.</p><p>As sleep falls upon</p><p>eyes wide shut</p><p>and memories fade away.</p>",
 "year": "2005",
 "id": "51380",
 "gender": "Female",
 "timestamp": "2007-04-18T07:00:00.000Z",
 "views": "17479",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "250 mg",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": "",
   "amount": "1 bump",
   "administration": "insufflated",
   "substance": "Various",
   "form": "(powder / crystals)"
  },
  {
   "time": "",
   "amount": "1 bump",
   "administration": "insufflated",
   "substance": "Various",
   "form": "(powder / crystals)"
  }
 ]
}
