{
 "id": 5138,
 "title": "Of Particular Light - Revelatory",
 "date": {
  "submission": "2006-08-16T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Joebro",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 ug",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "amount": "0.2 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I was prompted to submit this report after reading of an experience which seemed similar in some respects, pertaining to the fractal patterns.",
  "I had obtained a tab of LSD from a friend of a flatmate, and I was able to choose from which part of the sheet my tab would be cut.",
  "The picture printed on the sheet was of a Dali painting, 'Torero Alucinogeno', or 'Hallucinogenic Bullfighters', and the sheet seemed to have been unevenly scored, so that a lot of the squares were of an uneven size. Thus I chose one of the largest available squares, which happened to coincide with the part of the picture where a uniform field of flies disappears into perspective. This was the first time I had taken LSD from this batch, although I had taken acid from other manufacturers on 6 other occasions.",
  "I should note that I had been smoking hydroponic skunk fairly regularly (1g per day average), and I could feel the effects of the various cannabinoids near constantly, although I had not smoked that day.",
  "I put the tab under my tongue, and sat on the front porch of my flat, talking with two other flatmates for about 20 minutes, until I decided I would like to go for a skate. I'm careful to avoid planning out a night using psychedelics, I like to be free to follow ideas as they come to me. I retrieved my camera bag (I've found that it's best to keep things like keys, change, stash, lighter etc all together, and my ABC is to Always Bear a Camera!) and skateboard and skated off down the road.",
  "I found immediately that my balance was slightly better than normal, and I could adjust my weight distribution very exactly, close enough to almost ride on the back two wheels (a manual). This may not sound amazing, but I skate only for travel and adrenaline, and I skate very basically, one foot on the board all the time, and the other pushes now and again. I enjoyed the ride until I got into the inner city, and the smell of cars became stronger. There were drifts of fast food wrappers everywhere, and I knew that I had to keep moving and get past the city centre, as I felt rising disgust at the drunken hordes, shambling animals looking for food/a fight/a root. Each to their own, I thought as I dodged a drifting Coke cup.",
  "I threw my skateboard over the Botanic Gardens fence, and immediately regretted making so much noise. I jumped the fence and wandered slowly towards the trees, marvelling at their size and complexity, and the strength of their frames.",
  "I began to notice more and more hallucinations very soon, some of the trees appeared to me as groups of bearded dog-like creatures, leaning down towards me. I found concrete to be too harsh on my bare feet (I had stashed my skateboard and shoes safely, as I had done in the past) and I moved from the path to the grass of the archery lawn. As I walked between the two rows of tall trees I felt coldness lapping at my feet, and I became convinced that I was walking in two inches of water. I looked at my feet for a minute, and they seemed to be covered in darkness up to the ankles. I had to put my hands down into the shadow to realise that it was only shadow, not water.",
  "I kept moving through the gardens, without direction, idly observing the forms and hallucinations, until I realised that I hadn't had a drink all day, and I was becoming somewhat dehydrated. I started searching in vain for a drinking fountain, slowly getting more and more agitated when one wasn't right around the corner. I felt worried, as some part of me knew that there were at least six drinking fountains spread throughout this half of the gardens (which span about 10 acres), and yet I couldn't find one!",
  "I began to feel despair, and sat down. Then I noticed a light far away, and felt compelled to walk towards it. It was very dark, but I could see better as I walked onwards, until I started to recognise parts of the gardens I had been through earlier. I skirted the archery lawn and continued towards the light.",
  "I stopped some distance from the light, and looked around. As my eyes adjusted and chased away the retinal ghosting I realised that I could hear water running . . . I looked to my right and saw a drinking fountain, continually running. Christchurch is built on a series of artesian wells, and if you dig and hit a spring the cleanest water in the world flows continually out.",
  "I knelt down by the stone fountain and drank deeply.",
  "From there I moved to a small hill in the centre of a ring of very tall pine trees, and lay between a two large oblong plates set in the ground, one white, one black. I took off my bag and prepared a small pipe of weed. As I smoked it I felt a bubble expanding in my lungs, pressing upon my throat, sliding into my head.",
  "The bubble grew, spreading through my limbs, and slowly through my brain. It seemed to stop, completely filling me with gentle pressure, until I felt what seemed like a drop of water on the very top of my head. It was almost like there was suddenly a hole on my 7th chakra, and what had just filled my body was flowing out, running over my skin, spreading to envelope the grass, trees and bushes until it was an even field which was still a part of me.",
  "I lay back, and watched the stars slowly circle and the trees sway. After a time it seemed as though the trees were fractal generations, a single line splitting and multiplying until it merges with the air, taking air and water and spreading to continue the formula. The stars also seemed to be carefully arranged in patterns spelling out the flow of gravity and expansion. I was still hallucinating myriad faces in the clouds, and they started to become larger and talk more actively, smiling and communicating with each other, although I was unclear as to what they were saying. They seemed to merge until there was just one face, as large as one a few feet away from me. She (I'm very sure that the face was feminine) laughed once, before I looked too closely in wonder and the clouds were clouds again.",
  "Many other visions came to me during that time, many of which I can't recount with language written or spoken. However, one thing that really stood out was a the feeling that light was hitting me with energy that I could perceive as groups of particles. I could see the grain of light, except on sources of light or direct reflections where it blended into the image. I felt at the time that this was more than a visual illusion, as I know that the human eye is sensitive enough to register single photons.",
  "Particles moving in waves, the theory actually meant something!",
  "My photography has since come a long way, I can now explore optical oddities and tools with a greater understanding of the underlying physics. This experience and the mental exploration over the next few days gave me insight into things I would otherwise have never found. I'm now studying for a degree in Physics, and I hope to follow on with String theory study."
 ],
 "erowid": {
  "id": "31388",
  "citation": " Joebro. \"Of Particular Light - Revelatory: experience with LSD & Cannabis (ID 31388)\". Erowid.org. Aug 16, 2006. erowid.org/exp/31388",
  "substance": "LSD & Cannabis",
  "views": "3616"
 }
}
