{
 "title": "Downward Spiral",
 "author": "Ambien/Stilnox",
 "citation": " Ambien/Stilnox. \"Downward Spiral: experience with Zolpidem (Ambien) (ID 51396)\". Erowid.org. Jan 26, 2008. erowid.org/exp/51396",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "86 kg",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Pharms - Zolpidem",
   "(daily)"
  ]
 ],
 "report": "<p>Theres a lot of different opinions and rumours circulating the internet nowadays regarding newly developed sleep meds and if they can be used long term, short term, if the have any side effects or are liable to cause tolerance.  Now many of the drugs are extremely beneficial and a godsend to the people who use them, enabling them to improve their lives considerably.  However I do believe that some side effects, tolerance and withdrawel symptoms have been left out and not known widely by the public.  All I can do is tell you my story and have you decide for yourself.  My aim here is simply to describe my long term experience with one particular drug, Zolpidem (Ambien/Stilnox/Stilnoct)</p><p>I was 24, male, Australian, in an office job, great girlfriend and no real worries accept the usual money stresses.  I became run down and was diganosed with clinical depression.  It was no real shock as my mother, sister, uncles and grandparents all have depression.  I was put on Effexor XR starting at 75mg, eventually leading to 450mg, which is what I am on today.  My depression was fine and under control but sleeping was difficult.  The doctor suggested a different antidepressant but I declined seeing as the effexor was working wonders.  I then asked the doctor about Ambien (stilnox) as a friend had recommended it to me.  He obligingly gave me a prescription for it without giving me any further details on the drug.</p><p>The 1st night I started on 10mg (1xtab), on an empty stomach, and in about 20mins I felt slight euphoria, it became hard to walk and keep my balance.  I remember watching Home Improvement on tv and the picture got fuzzier and fuzzier, like a bad reception.  I walked into the kitchen and the benches felt like they were moving up and down.  My girlfriend put me to bed and slept fine.  I awoke feeling very refreshed after only 6hrs sleep.</p><p>This routine continued for a few months, seeming all fine.  However I got into a routine of taking 10mg then playing on the computer waiting for the euphoria and actually enjoying it, it was a wonderful feeling.  I would then hop into bed and have a great sleep.  Every night I would have bouts of amenesia where my girlfriend claims I had done things which I never remember.  I seemed to gain confidence and loose all inhibitions to anything.  My girlfriend would ask me private and confidential questions and I would answer them with ease.  We soon dubbed it 'truth serum'</p><p>She became worried one night when under an Ambien 'haze' I lit a candle and was trying to burn the wood floor we have.  I was not worried at all apparently and do not remember anything.  However the next morning 2 large scorch marks had appeared on the floor.  I would call friends at 2am and ring relatives overseas while under its influence, never remembering the next day what I did or said.  It was quite scary.</p><p>Things continued for several months and no real strange things happened.  I did start to feel much more tired during the day and my sinus's seemed to ache all the time.  I was late to find out this was because of the ambien.  4 months into the drug and I had developed a tolerance.  1 1/2 tabs before bed, then 2, then within 7 months I was taking 5 at night just to get the same feeling of being knocked out.  My sleeping became worse, awakening 3-4 times a night and urination became difficult.  If I awoke early at 6am I would take another 4 pills to help me sleep until I woke for work at 10am.  I was on an obvious downward spiral and all this time I was becoming more tired and irritable. Buying the meds online eventually to supplement my craving, ordering from many overseas pharmacies 100 pills at a time.  I developed daytime anxiety/irritability and had small panic attacks quite often.</p><p>Within 11 months of constantly taking Ambien I stopped cold turkey.  Not out of choice but because we ran out and had no more RX to gain some more.  I'd like to stress that I did have extreme withdrawel symptoms that made me feel like I was really dying, including extreme anxiety, agitation, unstable emotions (fits of crying over no reason), extreme body trembles, hot and cold sweats, feeling of dread, extreme diarrhea, and many more symptoms.  Now I'd just like to point out that</p><p>the anxiety experienced throughout this withdrawel was unbelievably diabolical.  I have had panic attacks before but this was 100x that.  My whole heart and stomach felt like it was being pushed out of my ribcage from the surges of adrenalin.  It's totally undescribeable but something I never EVER want to experience ever again.</p><p>Needless to say I could not handle these feelings on my own and sought help from my doctor who gave me diazepam to control the anxiety.  It took me 3 weeks to totally recover and yet I STILL crave Ambien and I have been off it for 6mths.  Just recently as a one off I had some late nights and decided to try Ambien one more time (stupidly).  I went behind my girlfriend's back and took 4 tabs prior to bed.  Within 2mins I was under its 'haze' and I do not remember anything further.  I was later to find out the next morning that my girlfriend had discovered me taking another 8 tablets !! (thats 13 in total) when she confiscated the box from me.  She said I became agitated towards her and demanded the box back (all of this I don't remember) then finally she called my mother at 2am to drive over and help me calm down.  Eventually my mother left and I got up and defecated myself all over the floor in our bedroom.  My wonderful girlfriend helped me get back to bed.  I found this out in the morning.  I was so embarrassed and ashamed. </p><p>6mths and I still get cravings but I look at my girlfriend and my family and think, what if I had done something to hurt them that night?  or myself?  I could not live with it.  I realised that I will never ever take it again as I love my girlfriend so much and could never put her through that again.</p><p>In summary, my brief story above proves, to me at least, that tolerance and withdrawel symptoms to Ambien DO in fact exist but are not well know throughout the public and health care environment.</p>",
 "year": "2005",
 "id": "51396",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-26T08:00:00.000Z",
 "views": "28844",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(daily)"
  }
 ]
}
