{
 "title": "Mild Social Lubricant Effects",
 "author": "420Ally",
 "citation": " 420Ally. \"Mild Social Lubricant Effects: experience with IAP (ID 51405)\". Erowid.org. Mar 27, 2006. erowid.org/exp/51405",
 "substance": "IAP",
 "bodyweight": "190 lb",
 "header": [
  "DOSE: T+ 0:00",
  "10 mg",
  "insufflated",
  "IAP",
  "(powder / crystals)",
  " T+ 1:00",
  "10 mg",
  "insufflated",
  "IAP",
  "(powder / crystals)",
  " T+ 0:00",
  " ",
  "oral",
  "Pharms - Buspirone",
  ""
 ],
 "report": "<p>I started very low compared to oral doses because known issues with some of the 2c drugs and insufflation. I had to visually split a 20mg dose. My goal is actually to assess IAP as a potential ADD med because of reading other reports that TV and such were 'more engrossing' after taking low doses of IAP and that at higher doses some aspects of social interaction might be enhanced.</p><p>T = 4min, on going mild burning of the sinus membrains but not bad compared to the sharp bite of MDA or the 'psychedelic fire ants' of 2cb. sinuses are a little runny but more cleared up compared to before T = 0. a bit sneezy but was sneezy before so hard to say if it is related.</p><p>T = 10min, slight somatic sensations consisting of tingle, nothing too obvious. burning starting to abate/drain. very slight but noticeable mood elevation.  content.</p><p>T = 15min, burning almost completely gone, very transitory period of BP spike and heart palpitation at about T = 12min but already gone. I *can* feel it now but still rather mild and nice. still feelings of contentment, serenity. wondering when I should plan on bumping the second half of the dose. thinking about T = 1hr. still growing in effect tho so we will see then.</p><p>T = 25min distinctly hit somekind of psychoactive threshold. I feel and sense it in my head and thoughts.</p><p>T = 40min, head and body shift not dissimilar to other low dose phen drugs. still mild, not unlike ritalin but much less euphoric/giddy.</p><p>T = 1hr, some effects still noticeable but primary rush is over. slight body buzz. Time to bump it up but 10 mg.</p><p>T = 1h5min, more burning but less noticeable this time, clear sinuses. this stuff as a distinct 'new car' smell. yuck. swallowing the gel cap it came in. I just spent the last hour happily reading a science article. so far giving low doses a thumbs up for ADD treatment effectiveness. I can't say insufflation is fun with this drug. sneezy again. much drainage.</p><p>T = 1h30min, burning all gone. feel very centered, focused and relaxed but with slight neck tension. happy, serene, glowing. not particularly stimulated. slightly floaty and tingly. rather similar to ritalin but yeah not as giddy/euphoric. over all good head space.</p><p>I have a telephone interview later today for an article I am writing for some mag. This feels like things should go well. Just what I was looking for, the mild social lubricant effects of low dose phen drugs. :)</p><p>I donno if the buspar I take had any obvious impact but figured I would mention it just in case.</p><p>Over all I feel great.</p><p>Ally</p>",
 "year": "2006",
 "id": "51405",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-03-27T08:00:00.000Z",
 "views": "13510",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "IAP",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "IAP",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Buspirone",
   "form": ""
  }
 }
}
