{
 "id": 5146,
 "title": "Why On Earth? What's the Point",
 "date": {
  "submission": "2004-03-02T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kamel",
  "gender": "Male",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": "2500 ml",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  },
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-I"
  }
 ],
 "report": [
  "Either it was a circumstantial cause, or perhaps the substance just sucked. (Id not eaten for 12 hours, consumed about 3,5L 5,9vol% beer and two Es)  When the E started to wear off a bit, we tried out 2C-I. Concerning time between stages, I refer to previous reporters whove made an excellent effort in describing them. ",
  "So, the experience-part:",
  "While moving (me/head), the world tended to seem slightly elastic. Perspectives etc went a bit out of phase. Colors got slightly  intensified, probably in due to the sensation of very  bright light and occasional extra-sharp contours, pulsating back and forth. At some occasions I got the impression of sources of light moving, since shadows on items tended to 'wander' and alter (like in those nature-films when they speed up the sun-  movement over the sky, and all shadows move really quick). At one occasion, while walking to a door, I got the impression of the distance to the door actually increase as I move toward it, in the elastic fashion described above.  And occasionally time stopped. ",
  "Thats a short description of the mental state at about 2-3 hours after consumtion. Despite aannoying nausia now and then, it was a bit fun, until new effects took place. Somewere at 2-2,5h an ant farm, or seven, started marching  in my body. 5h after consumtion, they finally started to rest,  but during that time... there were really NO way to not feel in utter discomfort. No point in walking, that feverish and  tinkling/crawling sensation in the body just made me want  to lay down and rest. That on the other hand was also impossible, since it was as as comfortable as when I am  really sick and been in bed for ages. However I turn, I just have to turn and turn back and forth, desperately searching for that one comfortable pose and spot that would ease the extreme discomfort. But it doesnt happen. Comfy pose and spot has gone into ninja-mode and is NOwhere to be found. (I actually burst into occasional laughter, when thinking  of the fact that there cant be any real way of how one could ever feel so... wrong. It was just too much. Fortunately, I managed to see the humorous aspects in the situation)",
  "Unfortunately, my partner in crime did not have such luck,  even though I tried to make up strategies for how wed  get through the remaining hours of agony. He wore the face of someone experiencing the odd feeling of a large and  unwanted item, rectally inserted (and thats not an  exaggeration). When I told him we had five hours to go,  he gave me kind of the same look that hed probably make if I were to kick him in the groin.",
  "Three minutes later, I found myself amused,  since Id expected 45 minutes to have past. I started to  mentally prepare for the forever lasting agony, and asked my friend to guess how long we had left on the trip. He looked at me with what I interpreted was a 'dunno' gaze. Then I told him we still had five hours to go, and 'he made the face of a drowning man that spots a glass of water' (Terry Pratchett). Fortunately for me, my lesser fortunate friend seemed incapable of engaging in any agony-distracting strategies. His very funny way of crawling about in the sofa, occasionally 'hiding' in a corner, on his back waving limbs or wrapped up in a blanket, was rather amusing and distractive. Fortunately, again but for both of us this time, most of  the 'under-skin-crawlers' lay off after little past 5h after consumtion. I had about one hours sleep, when I  finally could lay still, then I went up another 12 hours.  And I wont ever hook a maggot for fishing. I dont hate maggots, I know have theyd feel, and they dont deserve it."
 ],
 "erowid": {
  "id": "31400",
  "citation": " Kamel. \"Why On Earth? What's the Point: experience with 2C-I, Ecstasy & Alcohol (ID 31400)\". Erowid.org. Mar 2, 2004. erowid.org/exp/31400",
  "substance": "2C-I, Ecstasy & Alcohol",
  "views": "11122"
 }
}
