{
 "id": 5148,
 "title": "Insanity",
 "date": {
  "submission": "2007-06-08T07:00:00.000Z"
 },
 "author": {
  "name": "Shawna Rose Nixon",
  "gender": "Female",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Paroxetine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Quetiapine",
   "form": "daily"
  }
 ],
 "report": [
  "I want my story to be heard, as I want the stories of all mental patients to be heard.",
  "In the fall of 1995(August, I believe), when I was a freshwoman in highschool, I started taking Paxil.  I weighed 154 lbs.  I was depressed, and it worked for me.  That, among other things like love and art, brought me out.  I stabalized at 20 mg a month or two after taking it.  I still went through rough patches (I gained 20 lbs.), but I did okay.  I felt like me.  Then I went to college, and life was wonderful, but challenging (down to 165 lbs.). ",
  "Things started to get bad the tail end of Softmore year of college, Spring 2001.  I had gotten lice and shaved my head (I had long hair that I'd promised myself I'd never cut) and I stopped taking Paxil because I hated being tied to drugs and got fed up with the HMO doctors not being avialable. ",
  "Junior year, Fall 2001, I moved off campus into a really depressing living situation.  Classes were really difficult, and I started getting panic attacks and insomnia.  I wondered if I was going crazy, like two of my female relatives both had - in their twenties, no less.  I was 20/21 at the time.  Just as bad, I had a friend that I had a messed up relationship with, and she was the one I hung out with the most.  Maybe we needed each other, in some twisted way.  I was also so anxious that I lost 10 lbs. in about 2 weeks, going from 165 to 155 lbs.",
  "Things were hellish, and then, suddenly, they got wonderful.  Christmas break came, I started taking Paxil again, and I started seeing a new shrink.  Those changes helped give me the courage to get out of my bad living situation, and back on campus, which I loved.  Once there, I was so happy, and I met my bestfriend/ boyfriend Robbie, and I was so happy.  And so happy.  And so happy.  And so happy... For two weeks straight. ",
  "In other words, I had a 'manic episode.'  I was aware of cheerfuly driving myself into the ground.  I was also terrified of dying, and went to the emergency room twice.  I was anxious.  My Dad said all I needed was to relax and get a good night's sleep, but I couldn't.  Not after what I had just been through.  That fall I had been dragging and kicking and puching myself through life.  I couldn't just let go... ",
  "I was also on Paxil, which was helping to keep me in happy land.  At least, that's what I intuitively felt, and I now know you're not supposed to give Paxil to manic people.  But instead of just taking me off Paxil, the doctors decided to put me on something else _in addition_(That kinda pissed me off, and made me feel not listened to). ",
  "That something was Saroquel, 2.5 miligrams if I remember correctly.  That did not go over well.  I went from manic to delusional in a heartbeat.  Really bad.  I had been somewhat delusional before, but that Saroquel, in trying to get me to sleep, just turned off my rational brain.  I can remember telling my Mom something like 'It feels like I'm dreaming.'  And then It made me flashback to a nightmare I'd had when I was a little kid.  There was an evil lady I had to run away from... suffice to say, it didn't go over well with my Mom.  Or the police.",
  "Things haven't really gotten that much better."
 ],
 "erowid": {
  "id": "31405",
  "citation": " Shawna Rose Nixon. \"Insanity: experience with Paroxetine (Paxil) & Quetiapine (Seroquel) (ID 31405)\". Erowid.org. Jun 8, 2007. erowid.org/exp/31405",
  "substance": "Paroxetine (Paxil) & Quetiapine (Seroquel)",
  "views": "15124"
 }
}
