{
 "title": "Freeze Frame",
 "author": "NeverCould",
 "citation": " NeverCould. \"Freeze Frame: experience with Ketamine, Opium, Cannabis & Alcohol (ID 51560)\". Erowid.org. Dec 1, 2006. erowid.org/exp/51560",
 "substance": "Ketamine, Opium, Cannabis & Alcohol",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "0.1 g",
  "insufflated",
  "Ketamine",
  "(powder / crystals)",
  "",
  "0.5 g",
  "smoked",
  "Opium",
  "(tar / resin)",
  "",
  "1.0 g",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  "8 glasses",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)"
 ],
 "report": "<p>This was my first time using Ketamine, and maybe my last. I began my day by waking up at 5:00 PM, it was spring break. I love spring break so I do my best to make it memorable every year, this year I decided to stay at school with some friends and party for as long as my money would last. By 6:30 we had set up a game of Beirut and were drinking. I played 3 games of ten cup with a partner, drinking 1.5 beers every game. By the time we had finished playing Id had at least eight beers. I had just gotten some opium the day before, it was quality goods. It was a big black 4.5 gram bead, hard and sweet smelling. I had to thoroughly melt it to break pieces off. Throughout playing Beirut we smoked a half gram of opium and a gram of good weed. It was 9:00 PM when we left my room to go to another dorm. As we walked outside it was snowing, being drunk and pretty high made meandering in the snow extremely pleasant. I felt extremely relaxed, not minding the fact that it was 5 degrees out.</p><p>We reached my friends dorm room and sat on the couch. I hadnt planned on snorting the K that night, I really didnt have any plans for it, I just knew I would use it sometime over spring break. I had .1 grams of the coarse white powder, which I was told would hurt my nose like hell. My plans for the K changed on account of me being so inebriated, so I broke out my friends pane of glass. I poured out the K and started cutting it with a razor. It cut up into about two fairly decent lines. I proceeded to snort the two lines one after the other and my nose immediately started to burn. Tears came to my eyes, I looked at the clock, it was 10:15.</p><p>I never really announced that I was using K that night, though my friends knew I had some in my possession. I went and joined my friends, who seemingly had missed me snort the K, or maybe they had thought it was some coke, either way no one mentioned anything. As I sat there I noticed that the pain in my nose quickly subsided, giving way to a feeling like I had just inhaled some nitrous oxide. It had the same effects on my hearing, distorting everything and making it sound distant and slightly mechanical.</p><p>The K was extremely powerful, I could barely talk and had no intentions of walking anywhere. As I looked around he room at my friends I noticed that my vision had trouble keeping up with what my eyes were actually focused on, there seemed to be at least a 4 second lag. This lag felt worse than the spins when youre too drunk, I felt sick to my stomach. I had a feeling I was going to vomit so I pushed myself up and onto my feet. I could barely feel my legs beneath me, it was as if they were asleep, but somehow to my surprise I still managed to exit the room, bracing myself on the couch on the way out.</p><p>I made it outside and the fresh air eased my stomach a little. I stumbled toward a railing so I could wedge my numb legs beneath me and stand leaning back against the handrail. I managed to get my cigarettes out and a lighter. I stood there smoking for about 10 minutes, trying to talk some sense into myself and deciding what to do. There were very few people on campus for the break, so seeing anyone I didnt know was always surprising. But as I stood there an overwhelming sense of paranoia took hold, I knew I must look like a mess, and if I tried to talk to anybody I would fail miserably, especially if it was a security guard. Anyone could tell I was absolutely trashed, even dangerously so, and I couldnt afford going to a hospital and possibly ending my college career. As a group of students passed by the fear hit again, I quickly decided I would attempt the walk to my room, which was about 50 yard outside and up a flight of stairs.</p><p>I steadied myself using the railing and then, letting go, used all the momentum I had to carry me inside. I weaved down the path, amazed at how I was actually walking. I couldnt feel myself physically walking, I couldnt feel the ground beneath my feet, I just had faith that it would be there. I managed to not fall on the way to my room, which was surprising, though I relied on the wall a lot to keep my balance. I made my way to my bed, pushing a desk covered in empty beer cans and cups out of the way. I sat down involuntarily and placed my head in my hands, I couldnt even feel my face. All this time, throughout my walk back to the room and now back in the room the vision lag had gotten worse. It was as if every 7 seconds or so my vision would focus on one moment and freeze. A series of photographs, it appeared to me, were being flashed in front of me, freeze frames of actual reality despite my attempts to focus my eyes. Mentally I was almost all there, the drunkenness and the opium still clouded my mind, but other than that I could think fine. I had to keep reminding myself to breathe slowly and deeply, it felt as if my lungs were two times too small.</p><p>After about five minutes on the bed I felt sick again, this time I knew it was coming and grabbed the trashcan, which luckily didnt require me getting up. I vomited until I was just having dry heaves. I felt lucky that I couldnt feel my body, it seemed like it would have been painful otherwise. I remember feeling intense feelings of impending death, I was truly terrified that I had ODd because Id mixed too many/much drugs. Once I finished with the trashcan I lied down, attempting to stay awake but knowing it was no use. I turned on my side and breathed deeply and was out, I remember seeing the big green numbers on my clock reading 10:50 and that was it. The next thing I remember is waking up with an incredibly dry mouth, worst dry-mouth Ive ever had. I had only slept for about 45 minutes but felt 10 times better. I fell back asleep for another 30 minutes, and awoke with chapped lips and the same dry-mouth. I got some water and was feeling much better, at which point I decided to smoke a bowl and go to sleep for the night.</p><p>The overall experience felt like an out of body experience. I knew how I was acting, but between the lack of feeling in my body and the freeze frame vision I had very little control over how my body moved. I could only watch my legs move beneath me and hope that they would take me to the right place. I would never mix ketamine with anything besides weed, especially not alcohol, that was an ignorant decision on my part. I couldve truly been in danger and was way too inebriated to find help for myself, nor was I willing to get caught. However, if I got a chance to try K again by itself it could be a lot of fun, I think it was just the combination that really messed me up.</p>",
 "year": "2006",
 "id": "51560",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-12-01T08:00:00.000Z",
 "views": "7620",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.1 g",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Opium",
   "form": "(tar / resin)"
  },
  "2": {
   "time": "",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": "",
   "amount": "8 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
