{
 "title": "Love Everybody",
 "author": "Kaos",
 "citation": " Kaos. \"Love Everybody: experience with Ecstasy (ID 516)\". Erowid.org. Sep 8, 2000. erowid.org/exp/516",
 "substance": "Ecstasy",
 "bodyweight": "135 lb",
 "report": "<p>I had just made up with a close friend of mine.  I'm not talking about one of those oh it lasts a week, or even just a month thing... I'm talking about a 5-6 month estrangement.  And I had just 'turned my life around' coming off of a near suicide depression.  Well, she wanted me to try Ecstasy with her for the first time for New Years.  We ended up going to this club to get it, because our dealer was going to be there.  She, I'll call her Nikki, convinced me to buy one for that night too.  So for the steep price of $50, I got two hits of ecstasy.  We ate one of the pink triangles, and saved one for new years.  It wasn't setting in, and we had already smoked enough pot that we were so messed up it didn't matter anyways.  We met up with a friend, and he asked us what we were on.  Being funny, we said nothing.  And then with big puppy dog eyes, asked him if he would give us anything for free.  He handed us two pills of ecstasy!  We both swallowed away... it was 2 for my first time!  About an hour after swallowing the first pill, and 15 minutes after the second, it set in!</p><p>I needed to squeeze something, and my jaw started clenching, but the warmest, most wonderful feeling in my whole entire life came over me.  I sat in a big heap of people - there were four of us, nikki, me, the guy who gave us the free pill, and another friend of ours who had recently 'hated me'.  We just sat and clutched each other, massaging each other's hands and rubbing each other's backs while silmultaneously hugging.  Don't ask me how we did it - sober, I couldn't remember. </p><p>IT was an insane night.  I could barely speak, I felt so warm and wonderful.  This immense feeling took over me, a feeling that wanted to bond and love everybody.  I wanted to talk the night away!  And I danced and danced and danced!</p><p>Since it was my first time, and it was 2 pills, the feelings didn't go away for about 24 hours.  The plateu lasted forever, and the 'coming down' happy bubble period, as I call it, always lasts the next day as well.  But it hasn't lasted as long as it did the first time, nor as strong.  Then again, I haven't done 2 pills together since :)</p>",
 "year": "2000",
 "id": "516",
 "timestamp": "2000-09-08T07:00:00.000Z",
 "views": "8482",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
