{
 "title": "First time on the Horse",
 "author": "Crackpipe",
 "citation": " Crackpipe. \"First time on the Horse: experience with Heroin (ID 5160)\". Erowid.org. Feb 21, 2001. erowid.org/exp/5160",
 "substance": "Heroin",
 "bodyweight": "175 lb",
 "report": [
  "<p>This experience really happened out of nowhere. My friend was having a party at his house and he asked me if I could get some coke to liven up the place.  I went over to my dealer's place where we smoked some weed and I had a few beers. I was then offered heroin instead of the usual cocaine. I had wanted to try heroin, so I couldn't see a better moment than this. I bought a $30, bag which is .05g. Anyway, I cut a thin line about an inch long, and I snorted. I decided to go back to the party. As I was leaving (5 min. after taking the line), I started feeling my eyes closing and I felt sleepy and happy inside.",
  "When I got back to the party I had trouble walking and all I wanted to do was sit down and relax. My eyes were closed half-way and I didn't feel like talking to anyone or doing anything. I didn't feel tired, I just felt comfortable sitting there, even though the party was raging. When I finally tried to walk, right away I felt like throwing up. I went into the bathroom and laid down on the floor. At that moment I felt so at peace and relaxed, like the bathroom floor was the nicest place in the house and I had it all to myself (45 min. after taking the line).",
  "After an hour, I went into a dream state where I would be talking to someone and I would open my eyes and there would be no one there. Friends would come in and talk to me but I had trouble recognizing them and I could not carry on a conversation. After 2 hours of lying on the bathroom floor, I felt I had the strength to get up and go see what my friends were doing, but I soon discovered that walking around made feel very sick. I finally fell asleep at 4am. The high lasted four hours or more.",
  "If you're going to try heroin, I suggest a quiet place where you can lie down and listen to music. That's what I wanted, but I got a bathroom floor instead.</p>"
 ],
 "year": "2001",
 "id": "5160",
 "gender": "Male",
 "views": "76892",
 "dose": [
  {
   "time": "0",
   "amount": "0.03 g",
   "administration": "insufflated",
   "substance": "Heroin",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2001-02-21T08:00:00.000Z"
}
