{
 "id": 5162,
 "title": "A Valentine's Night to Remember",
 "date": {
  "submission": "2004-03-05T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "J",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "amount": {
    "number": "1.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": {
    "number": "1.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "The night in mention actually began around 4:30pm when a small box arrived for me in the post.  It was Valentines Day, February 14th, the official holiday of Love.  In a yellow, padded envelope I found a small box wrapped as a birthday present.  The box contained another wrapped item.  I unraveled paper for what seemed like an hour until I was left a quarter ounce of psilocybin mushrooms in my hand.   The best part is my birthday isnt until October!",
  "So at 4:35pm I began ingesting approx. one gram of the mushrooms.  Now, I had eaten minimal breakfast and no lunch because I was expecting the sacred delivery.  I was in a wonderful frame of mind, as I had spent the pristine Southern California day with my beautiful girlfriend and roommate, P.  We did some shopping, shared breakfast, and took care of some general errands together.  In general, it had been a great day. ",
  "P was taking a nap in the late afternoon sun, so after I eat the sacrament, I went for a walk.  Within fifteen minutes my energy was vibrating at a greater frequency.  I walked to a comfortable, well decorated, but not trendy caf.  The plan was to replace a hand painted latte mug of Ps I had broken while doing dishes.  So I entered the caf and began gazing at the hand painted pastels of French mugs and the blue and white porcelain of Japanese pottery with an already enhanced vision field.  The last shelf contained the vibrant earth tones of Mexican pottery next to small shelf of dolls and figures in the theme of the Los Dias De Los Muertos holiday.  The Caf was a fun and interesting place to be, but at that point I knew things were going to quickly intensify when some of the Mexican dolls began to smile with me.",
  "I had been warned the mushrooms were particularly potent which is why I began with such a small amount.  At this early stage I was extremely impressed.  The ascension had a body feel I can best describe as MDMA-like without the chemical push and associated jaw clenching.  Mentally I felt completely clear and my mood was rising to a joyous level.  P and I had prepared for this trip earlier in the week by discussing what we hoped to learn from our experiences.  For me, tripping is about something artistic and very spiritual.  As for my beloved P, whose aunt is very sick with cancer, she wanted some resolution on what Ill refer to as Gods plan. ",
  "When I returned to the apartment P was still sleeping and I was already beginning to peak on the small amount I had eaten earlier.  I laid across our bed and stared at the ceiling which was breathing slightly and I felt as if I was floating on a cloud.  At this point I had to laugh deeply and loudly, as I felt a smile that started in my soul.  I laid a little while longer (From this point time became very difficult to reference) and eventually decided to try and wake P because I felt I was in need of a little human contact and communication, plus I wanted to tell her about the package we received.  I went to the couch and laid down with her.  Shortly after that she woke.  We entered into a detailed and exciting conversation about our relationship, our spirituality, and our past experiences.  I kept thinking I should tell her but found myself so wrapped up in our dialogue that it became difficult.  Eventually turned out to be 3 hours and I finally spilled the beans to her delight and my relief. ",
  "This was Ps second experience with psychedelics so I gave a brief talk about taking it slowly and being patient with the mushrooms.  I proceeded to empty the bag in a small bowl I intended to leave out all night for our enjoyment.  P eats what I guess to be somewhere in between 1 and 2 grams, and I also eat some more, approx. 2 grams.  She informed me of the wretched taste and I agreed because these things were nasty!  I never thought mushrooms tasted bad before this night.  Anyway, I put five CDs in the changer (everything from Digweed to Cat Stevens) and lit a bunch of candles because it was time to delve a little deeper. ",
  "One thing we both immediately noticed was a slightly uncomfortable body chill so we got our down comforter and laid on our couch very close to each other.  The next few hours were pure magic and bliss.  Colors, enhanced appreciation of music, laughter, and deep conversation into the use of such materials to achieve a higher state of consciousness.  The next peak for me was pretty intense.  For awhile I found it difficult to communicate verbally and I envisioned myself sitting on our quilt as it floated through a land of love and beauty.  At some point a bowl of fine So Cal bud was smoked which sent us both into an even more trippy yet very relaxed state of mind.  Again I found it difficult to bring my thoughts together in sentences, as did P, even though words werent really needed any more.",
  "After a few more hours P somehow fell asleep.  I went to the computer and eat another gram.  I read Mushroom Healing Quote by Maria Sabina and as read I came to realize I was truly a blessed individual to have such a beautiful experience in my life and thats why I chose to write this report.  To hope, that in some way I can convey this point to anyone who takes the time to read this:  Even though the world can be cruel and bitter place there is amazing beauty out there, just open your heart and it will come to you.  Also, I write this to give something back to our culture at-large.  A culture that has taught me so much about myself and about the universe as a whole.  Thank you so much for reading this.  Peace and Love. \tJ"
 ],
 "erowid": {
  "id": "31460",
  "citation": " J. \"A Valentine's Night to Remember: experience with Mushrooms & Cannabis (ID 31460)\". Erowid.org. Mar 5, 2004. erowid.org/exp/31460",
  "substance": "Mushrooms & Cannabis",
  "views": "13434"
 }
}
