{
 "title": "Near Death, but near Nirvana",
 "author": "Twiggy",
 "citation": " Twiggy. \"Near Death, but near Nirvana: experience with Morning Glory (ID 51639)\". Erowid.org. Dec 31, 2006. erowid.org/exp/51639",
 "substance": "Morning Glory",
 "bodyweight": "112 lb",
 "header": [
  "DOSE:",
  "500 seeds",
  "oral",
  "Morning Glory"
 ],
 "report": "<p>I have done morning glory seeds(MGS) three times before, the first time finding they were real with 150 seeds (feeling only stoned), the second time find they were powerful with 250 seeds (having CEVs) and the third time finding nothing with no approximate dose but no effects either. </p><p>I told my friend about them and he said he wanted to try them.  I hadn't taken them in a while so I went to a store and bought 15 1.5 gram packs of MGS.  I told him a good fun dose that isn't too dangerous is about 250 seeds or 5 packs, so he took those.  I took 10 packs or 500 seeds because I wanted to be trippin' balls. </p><p>We started taking the seeds at 7:00 P.M. so we could be inconspicuous.  It took about 45 minutes to get them all down.  We had no way to grind them up and just chewed them.  In fifteen minutes we were both laughing hysterically.  He got on the computer and started talking on the phone as I laid on the bed and watched spiraling clowns in CEV.  I was going on and on about how much I hated clowns but was fun to watch them anyway. </p><p>We went to the bathroom and saw how dilated our pupils were.  I started getting OEVs and my face was going in and out of proportion. </p><p>I sat on the sink and laughed hysterically at the wavy walls.  My friend sat in the tub and I fell down in the corner laughing at him.  We migrated back to my room and sat on the bed.  He asked me if there was any way to stop the trip.  I said no.  Then he ran in the bathroom and puked 6 times as soon as I got there.</p><p>He started freaking out and was telling me he was about to die and to tell everyone he loved them and to go get my mom.  I started calming him down and I refused to go get my mom and said it would be alright.  He said he felt much better and that he was really happy after the seeds were out of his body.  We went back to my room and talked about our happiness and Nirvana.  I was peaking at that moment and saw the walls melting and waving.  This was about at 11.  He fell asleep and I was still tripping but wanted to sleep. </p><p>I went downstairs with a sleeping bag and fell asleep at about 12.</p><p>I am glad nobody got hurt.  It went well after the rough experience.</p>",
 "year": "2006",
 "id": "51639",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-12-31T08:00:00.000Z",
 "views": "3137",
 "dose": {}
}
