{
 "title": "A Crappy Experience",
 "author": "A Merry Prankster",
 "citation": " A Merry Prankster. \"A Crappy Experience: experience with Chlordiazepoxide (Librium) (ID 51637)\". Erowid.org. May 4, 2006. erowid.org/exp/51637",
 "substance": "Chlordiazepoxide (Librium)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "Pharms - Chlordiazepoxide",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I have been taking ~0.75mg Xanax twice daily for about 2.5 years now, it helps alot with my general and social anxiety.  My dodctor suggested switching to Librium as it is longer acting with less 'addiction' potential.  This morning I woke up and everything felt like a normal day, mentally and otherwise.  I got up to do my normal routine but instead of taking my 0.75mg Xanax as I have been up until yesterday I took 25mg Librium. </p><p>About a half an hour later I started feeling a growing anxiety and tension.  I was uncertain whether this was because Librium takes longer to kick in or because that Librium dose was not equivalent to the Xanax dose.   (After looking it up I found that 25mg Librium is equal to 0.5mg Xanax, but the doses are close enough that the level of anxiety I was experiencing seems unusual to just be due to the minor discrepency in dosage.)  Another thing to note is that I often forget to take my Xanax *exactly* on time and depending on the day I might not feel 'withdrawal' effects for up to 1.5-5 hours later.  So it seems unlikely to me that the anxiety I was feeling could be due entirely to missing my Xanax dose and I was pondering whether it was possible that the anxiety was a direct effect of the Librium, as unlikely as that seems. </p><p>As the day went on the anxiety and tension increased and I also started feeling jittery and dysphoric.  Things just kept getting worse as I started feeling irritable, mild anger, and overall loss of interest in doing anything.  This all went on for about three hours until I decided I had enough and took 0.5mg Xanax, that was about 20min ago and I have yet to be sure if it has any effect, so far the only difference I feel now versus prior to taking the Xanax is mild exhaustion, which could just be a result of the axniety. </p><p>Which of the effects I experienced were a direct result of the Librium and which were a result of the absence of my daily Xanax dose I will never be able to determine for sure.  What I know for sure about Librium is that it is NOT a substitute for Xanax.  I therefore hypothesize that different benzodiazepines can vary widely in their subjective effects, despite them often being lumped together and seen as very similar in activity with the only difference being onset and length of action.  (My experience with Klonopin further substantiates this hypothesis as Klonopin induced a heavy depression after several months of taking it, an effect I have never had with Xanax.)  As I wrap up this report I should note that the 0.5mg Xanax taken ~30min ago seems to be calming me down and lifting my mood so I will stick to my Xanax and forget Librium as it seems useless for me.</p>",
 "year": "2006",
 "id": "51637",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-04T07:00:00.000Z",
 "views": "23348"
}
