{
 "title": "The Worst Night of My Life",
 "author": "Never Again",
 "citation": " Never Again. \"The Worst Night of My Life: experience with Syrian Rue (ID 51681)\". Erowid.org. Oct 6, 2007. erowid.org/exp/51681",
 "substance": "Syrian Rue",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "2 tsp",
   "oral",
   "Syrian Rue",
   "(tea)"
  ]
 ],
 "report": "<p>I had read a number of ayahuasca experiences on this site, and was excited to try a combination of Syrian Rue and Mimosa. I am pretty sure that what I experienced this night was an overdose of the Syrian Rue, but there were other factors I will mention that might have caused or contributed to my reaction. First of all, I had prepared the Rue three weeks earlier, as I had planned on doing it on a weekend but was interrupted and never got the chance. I had read that two teaspoons of the seeds was equivalent to about three grams, so I measured this out and boiled/simmered it in four cups of water for an hour. This was when I was interrupted, so I turned off the heat, and the mixture sat there for the rest of the day.</p><p>When I returned I strained the liquid into a water bottle. Im not sure if this should have been refrigerated because when I went to drink the stuff last night, the sediment at the bottom had turned into moldy looking, gooey globs. I should have just thrown it out, but I didnt have time to prepare more, so I filtered the liquid into a glass. I then began to prepare about 5g of Mimosa powder by simmering it in water for an hour. After it had cooked for thirty minutes, I started to drink the Rue tea. It took me about fifteen minutes to finish it, taking it like shots and chasing with water. The taste was horrible and very bitter. I should also mention that I did not adhere to the diet and fasting before taking an MAOI. I had had pancakes for breakfast and a turkey sandwich at lunch, and did not eat anything past 2pm, figuring that five hours would be enough time to fast before drinking the tea. I drank the Syrian Rue tea at 7pm, and heres my experience:</p><p>T+ 25min: I was feeling very dreamy and floaty, similar to being stoned. My body, especially my mouth and throat, felt numb. Overall I felt very nice, and had it stayed at this point I would have been happy.</p><p>T+ 30min: Feelings began intensifying at a very, very uncomfortable rate. I started feeling extremely dizzy and my body was tingling all over. At this point the dizziness reminded me of when I have gotten really sick from drinking too much alcohol. I began feeling nauseous, and realizing that I definitely did not want to take the Mimosa, I turned the stove off and headed into the bathroom. Walking was very difficult because everything was spinning. I was unable to move in a straight line and walked with my body in a funny, sideways-bent kind of way.</p><p>T+ 45min: Although I didnt think it would be possible, my dizziness began to get even worse. Whenever I moved my head everything spun in streaks with trails, which intensified the nausea. As time progressed, the nausea became unbearable, I cant even begin to describe how awful it was. This is the worst, most sick that I have ever felt in my life. I began violently shaking all over and suddenly was aware that my heart was beating very, very fast. At one point when I looked in the mirror I could see it shaking the front of my shirt. I had brought my phone into the bathroom with me in case I needed to call 911, and noticed extreme time distortion with minutes passing like hours.</p><p>I began to throw up and continued to do so every time I tried to move. This continued for another three hours. I had left the television on in the other room, and the sound from it was very distorted. Later when I turned it off, I still heard voices and music as well as an annoying buzzing sound as though it were still on. During this time in the bathroom I felt sure that I was very close to death. I tried to keep myself from getting further upset because I didnt think that my heart would be able to hold out. Whenever I focused on anything it would form the face of the devil laughing at me, so I tried to keep my eyes closed. I had many CEVs that I do not remember that clearly, but mostly were of patterns and intense colors. I felt very tired and started to pass out from the dizziness several times, but forced myself to stay awake because I was afraid I would die if I went to sleep.</p><p>T+ 4 hours: I managed to stumble into my bedroom and lay down. Everything was still spinning very badly and I was very cold and shaking. At this point my roommate arrived, and I explained my situation. Although I hate people seeing me when Im sick, I was glad they were there as they checked in on me a few times during the night. I continued to throw up every fifteen to thirty minutes. The time in between puking I closed my eyes and tried to fall asleep but could not, and had very intense CEVs that were almost like dreams. I would see where I had been lying in the bathroom so clearly that I would think that I was still there, and was surprised when I opened my eyes to find that I was in my bed. I could also see myself lying there on the ground. Once when my eyes were open, I vividly remember seeing a cartoon bear playing a drum dancing and marching across my blanket.</p><p>T+ 6 hours: Although I was still sick every thirty minutes, I was finally coming down and was able to fall asleep in between puking sessions. The shaking and dizziness werent as bad, but came back each time before I got sick. I was able to drink some water and tried to eat a few crackers to help the nausea.</p><p>T+ 7 hours: I was sick for the last time, and went to take a shower to try to warm up. This helped a lot and made me feel better. I went back to bed and fell asleep after about an hour. I woke up four hours later and knew it was over. It took me another hour to fall back asleep, and I woke up the next day feeling hungover and tired. </p><p>Im not sure what to attribute this awful experience to, but it seemed very similar to an account I read about a Rue overdose. If you are planning on taking Syrian Rue, please do a ton of research about dosage and follow the diet restrictions before. I have definitely learned my lesson and plan on never touching the stuff again.</p>",
 "year": "2006",
 "id": "51681",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-10-06T07:00:00.000Z",
 "views": "15781",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 tsp",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(tea)"
  }
 ]
}
