{
 "id": 5169,
 "title": "Grilled Cheese",
 "date": {
  "submission": "2007-02-13T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "AircraftGlue",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "I wanted to 'break thru' to Salvia space, in a definate hurry, high expectations.  I started while sitting up on a futon that was laid flat on the floor of a well lit room with everything cleared off the floor; wasn't sure if I was gonna thrash around or not.  Bright lighting is a bad idea but this didn't become obvious til later.",
  "My previous experience with Salvia consisted of two 1/2 oz tinctures.  Took 3 dropperfuls, swished for 3 min, repeated three times.  Interesting trip, very mild, pleasant, no 'edge' to the trip and no anxiety whatsoever.  No loss of ego (I always knew who I was and how I got here) and no 'morphing' effects.  The trip kinda tugged me to the right and had a slightly spinning sensation but no visuals whatsoever.  Lasted about 30min, smooth ride up and nice come down with a feather soft landing.  After an hour the effects were completely gone.  Kinda like riding down a kiddy slide at a playground.  I was like, 'cool!' but I wanted to break thru to Salvia space very badly after this.",
  "Anyway, one pinch of 10x Salvia, smoked in an aluminimum pipe.  Pulled in a big puff of smoke, and boom, I was gone.  I don't even remember inhaling the smoke.  Unlike the tincture, this was more like a rocket propelled Wile E. Coyote style rollercoster spiraling downward at supersonic speeds with no tracks into a black abyss.  And I mean that in the nicest way.  Nothing like the tincture trip.  Panic, anxiety, and no @!#%*^ idea how the #%!# I got here were my first recollections as the trip started.",
  "Reality distorted, that is, the world was rotating violently to the right (the fouton, floor, gravity...) and I was trying to stay level and was rotating/twisting/leaning left.  I had the lights on so my mind was taking visual input and making them fit the sensations I was feeling.  The ground/futon was trying to wrap me up and peel away up and to the right much the same way you would flip the page of a book.  I'm desperately trying, with primal instinct, to grab hold and turn left against the rotating feeling with no success.  Real deep down sick to my stomach panic starts to set in.  Anxiety turns to fear of being swept away to the unknown.  I don't want to go.  The world/futon/floor is wrapping around me tighter, I grab the edge of the futon/floor that's trying to wrap around me harder and harder when I realize I'm crushing the lighter in the my right hand.",
  "Why is there a lighter in my hand?  I don't smoke.  Yes I did.  Yeah, I was asking myself questions and I heard myself say the answers from behind me.  Memory starts to return, I know who I am again, anxiety is going away after I remember how I got here, which is via smoking extract, panic goes away after I realize I'm tripping.  Nice lighter, good lighter, I'm gonna frame that lighter for grounding me back to reality.",
  "The world is still rotating.  I stand up.  The world is still rotating and I'm not sure how I'm able to balance myself while standing up.  My feet turn leftward, my shoulders turn rightward, but they both point foward.  The rotation is an intense tactile sensation.  Now it's fun cause I know what the heck is going on.  Then I tripped (ha!) over the lamp cord.",
  "Oh god...",
  "I can't tell if I'm standing or sitting or laying down.  The world is still spinning but no longer trying to crush me because there's nothing THERE to crush me.  I feel like I'm turning into one of those dorito spiral chip things.  I can't see anything and my imagination is filling in for my eyes.  The things I see don't make sense but I see them.  Circles made up of right angles, cubes with no corners, spheres made up of line segments, a 20yr old Raquel Welch sitting on my... ok, that's what I wanted to see anyway but I didn't get that visual (hey, I tried).",
  "Visual objects were black on black; can't say I could draw them, but I could 'feel' them in the space around me with such intensity that I thought I could 'see' them.  I can feel the lamp cord wrapping itself around my arms. I know I have an arm, I just don't know if it's to my left, right, above, below, in front, or behind me.  It's 'there' but I can't tell where it attaches to my body.  It's a seriously weird feeling.",
  "Ha, I found the outlet with my other hand.  Not sure where that's at either.  I figure the Salvia must be wearing off because my right hand with the power cord found the left hand which was over the outlet.  The rotating effects was slowing down and I managed to plug in the lamp.  Reality 'hissed' into existance.  Kinda like a black smothering fog fading away leaving the real world behind.  Reality has a glistening non-color aura.  Colors are either brighter, duller, or have more of something that I can't describe.",
  "I look at the wall clock, it's been 4 minutes.  It's been a very intense 4 minutes.",
  "Coordination takes some effort but isn't too bad.  I'm soaked in sweat but the room isn't overly warm.  I want a glass of water.  Very strange since I'm a heavy MtDew drinker.",
  "20min after I started and the rotating sensation is completely gone.  There's still some body coordination issues but they disappeared after 40-45minutes.  One hour afterwards I'm back to baseline.  A little tired from the body load and a lot thirsty from the profuse sweating from the trip.",
  "My setting was brightly lit and my mind did it's best to make the visual input fit the tactile sensations.  This led me to belive the world was rotating and trying to crush me which didn't help with the panic and anxiety.  The crushing feeling wasn't present in the darkness but the rotation was.",
  "Next trip will be naked, in front of the AC, and in the dark while getting a blowjob from my girlfriend.  Heck, if it's gonna intensify skin sensation, I'm gonna pick the sensation :)",
  "----",
  "Addendum:",
  "2nd trip in a brightly lit room was wild in a good way.  Smoked while laying down, turn my head to the side, and...",
  "Remember how airplane glue would 'melt' the plastic on model airplanes?  And if you pulled the pieces apart while the glue was setting the plastic would get all stringy?  My arms became plastic parts and were getting stringy as they were pulled away from my body (that rotating feeling was back).  It felt like all of reality was attached to me via airplane glue and was being pull away and the 'strings' of reality I could feel under, over, and thru my skin.",
  "Funny thing though, I could see that the world wasn't stretching my arms.  But I could 'feel' it so intensely I could visualize it and was overlaying the visualized imagery on top of what I was seeing.  So there's my elbow right in my line of sight, I feel it moving away but I don't see it move.  The disagreement in senses is odd, amusing, and definately a fun sensation.  If I don't like what I feel, I look at something else."
 ],
 "erowid": {
  "id": "31488",
  "citation": " AircraftGlue. \"Grilled Cheese: experience with Salvia divinorum (10x - extract) (ID 31488)\". Erowid.org. Feb 13, 2007. erowid.org/exp/31488",
  "substance": "Salvia divinorum (10x - extract)",
  "views": "12486"
 }
}
