{
 "title": "The Upside Of Surgery",
 "author": "Tattered and Torn",
 "citation": " Tattered and Torn. \"The Upside Of Surgery: experience with Midazolam, Fentanyl, Morphine & Oxycodone (with Acetaminophen) (ID 51737)\". Erowid.org. Jul 23, 2007. erowid.org/exp/51737",
 "substance": "Midazolam, Fentanyl, Morphine & Oxycodone (with Acetaminophen)",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "IV",
   "Pharms - Midazolam",
   "(liquid)",
   "",
   " ",
   "inhaled",
   "Unknown",
   "(gas)",
   "",
   "100 ug",
   "IV",
   "Pharms - Fentanyl",
   "(liquid)",
   "",
   "16 mg",
   "IV",
   "Morphine",
   "(liquid)",
   "",
   "10 mg",
   "oral",
   "Pharms - Oxycodone",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I had surgery two days ago on my lower back to remove an infected and painful cyst, and being my first time under the knife, I was quite anxious. The nurse first administered 10 MG of Versed into my IV to reduce the post-operative jitters. I am quite phobic of needles, but as I watched the liquid slide through my IV and into my arm, I felt a rush of calm sweep over my body.</p><p>The IV suddenly didn't seem as frightening as it had a few minutes ago, and I found myself becoming less squeamish about the tubes running into my hand. My head began to feel less cluttered with thoughts of incisions and horrible pain, and instead I drifted into a peaceful feeling of relaxation as I was wheeled back to the operating room.</p><p>I was told to breathe in an unknown gas, obviously anesthetic, and promptly went under the influence of unconciousness as the procedure began.</p><p>The next thing I remember is picking my head up from the pillow and wincing is horrible pain. I examined my surroundings and realized I was in the recovery room; that horrible pain was my freshly opened back, now covered in dressing and stitches. A nurse noticed my waking, as well as my complaints of the pain. They figured this wasn't unusual, and quickly adminstered 100 u/g of Fentanyl into my IV, in the same port as the Versed.</p><p>I didn't experience any rush of relief as I had for my anxiety, but a cool, soothing chill ran down my arm as the powerful Fentanyl entered my veins. I had used Fentanyl before in transdermal patch form, and was quite aware of its analgesic powers.</p><p>I waited for a few rough minutes before I felt the familiar easing up of the opiate's effects, yet the pain was still persistent, which was very surprising to me. The nurse had me wait another few minutes to give the Fentanyl some time, but the relief seemed to stop at a certain point, and they decided to administer 16 MG of Morphine in a gradual drip form.</p><p>I consumed some ginger ale and watched television as the Morphine made its way into my IV, and this time, the rush of relief was much more intense. The Fentanyl's effects were still coming on as the Morphine took effect, and my body seemed to drift apart from itself as the bite of pain took a backseat to my rush. My fingers actually went numb over time, and my skin felt loose and liquid, as if my body were made of water. Everything seemed so clear to my mind, which was now drifting in and out of a light, peaceful sleep.</p><p>I dosed on and off in a dreamy state for the duration of the drip, which was another twenty five minutes. At this point I was returned to my waiting friend, who was my driver, and given two Percocet tablets while I arranged for release. I swallowed them both with a cup of water, filled out my papers and was wheeled outside, where I walked myself to my friend's vehicle.</p><p>The Fentanyl had likely set in full effect by now, but the Morphine was still producing the occasional rush, which felt like a warm surge of heat running through my veins. My body felt like a cloud, as if I could very well drift right out of my seat. I had no sensation of connectivity between my body parts, and often misjudged distances when performing activities with my hands, such as adjusting the radio or opening the car door. I'm not sure when the Percocet took effect due to the other two more potent opiates, but by the time I returned home I retired to my bed.</p><p>I didn't come down until the next morning, and fully realized the positive side of a painful surgery.</p>",
 "year": "2006",
 "id": "51737",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-23T07:00:00.000Z",
 "views": "24459",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "IV",
   "substance": "Pharms - Midazolam",
   "form": "(liquid)"
  }
 ]
}
