{
 "title": "I Can 'C' the Potential",
 "author": "q-tip",
 "citation": " q-tip. \"I Can 'C' the Potential: experience with 2C-T-7 (ID 5176)\". Erowid.org. Jan 5, 2002. erowid.org/exp/5176",
 "substance": "2C-T-7",
 "bodyweight": "120 lb",
 "report": "<p>I received my 125mg. of 2C-T-7 from my buddy the previous Thursday night, but held off on using it because I wanted to trip at the museum with a friend on Saturday, but she fell ill and couldnt make the journey. So as I sat at home Monday night curious as hell as to what this chemical would do to me, I decided to give it a whirl, I notified my cousin I would be taking the T7, so if I call him in a craze, he would know whats going on.</p><p>6:45 pm. - ~7mg. 2c-t-7 insulfated, mixed in 1:2 with confectioners sugar, hoped it would ease the burn that I have heard so much about. Didnt work, my whole face felt like it was scorched with a flamethrower. My right nostril felt like there were 1000 suns burning inside of it, I just wanted to rip it off. Then came the waterworks, I couldnt stop the tears.  This lasted for about 10 minutes.  I put some Vicks Vapo rub in and under my nose and it began to feel better, got some juice and drank vigorously, the pain slowly went away.</p><p>7:15 pm.  Im lying down on my couch watching Seinfeld, and I feel a rush of relaxation come over me, I just smiled and slouched further back into the cushions.</p><p>7:45 pm. Nothing special seems to be happening as of now, colors seem to be a little more vibrant and warm, and I feel very euphoric, but Im looking for some visuals, so I decide to bump ~2mg. more. No pain this time, thank god.</p><p>8:00 pm. I decide to hop into bed and listen to some music.  I turn all the lights off except for a candle next to my bed and throw on some Bjork.  Im in a very happy place at this point, very euphoric, I close my eyes and begin to see interesting visuals, not quite true CEVs like I have experienced with 5-MeO-DiPT, but sort of closed eye thought/visuals, very weird. I would begin to think of something and it would come alive inside my head. The music I was listening to was very outworldly and brought about many interesting thoughts into my head. The most vivid one I remember is when I began to think about a water snake, and it all of a sudden came alive inside my head and began to slither around, and then just bolted out at me and showed its enormous fangs to me, but to my surprise I was not scared at all.  I just lay there and smiled.</p><p>8:30 pm. I decide to check around for OEVs, so I head downstairs where my sister and two dogs are, I go lay down on the kitchen floor with my older dog Daphne, and I look into her eyes, we just sat there looking at each other for about 5 minutes, it was quite serene.  So I go into the den and she follows and hops up on the couch with me and lays her head down on my chest, she stayed there for ten minutes just looking at me with her little puppy dog eyes. This was an interesting experience since she can rarely stay still on the couch with me for more than 5 minutes at a time, its as if there was a special connection.</p><p>8:50 pm. I head back up stairs and throw on the matrix.  I watch the first 30 minutes or so, and I seemed to understand what The Matrix actually is, considering this movie is one of my favorites and I have seen it 10 or more times, it was a little weird actually getting a different message from it.</p><p>9:30 pm. I head into the bathroom to take a leak, as I walk past the mirror I smile, I remember how the mirror always seems to be my favorite trip toy, so I quickly relieve myself and head to the mirror, I stare at my face, and after about 20 seconds my faces begins to swirl around and move in and out, the colors of my face and my surrounding are very vivid and warm, lots of oranges and light reds. I look away and look back at the mirror, but I am disappointed that I have to concentrate so hard to get visuals.</p><p>9:45 pm. Back to my bedroom, the trip seems to do be almost dead I assume, but I still feel very warm and cozy inside. I hop online and talk to some friends and respond to some e-mails. I notice every once in a while the computer screen seems to grow and shrink in size, and my room seems to take short little breaths every once in a while. My room is painted sunshine yellow, so everything has a very warm aura to it.</p><p>10:30 pm. My buddy J calls to see how Im doing as my trip is basically dead. We talk for about an hour, I head back to my room and hop into bed and watch letterman, he is extremely funny tonight for some reason, Im sure the T7 helped.</p><p>Afterthoughts  I think that this was too low of a dose for me, but I also think that I may have eaten too much before I tripped, I had a big salad at like 5:30 pm. Next time I am going to try 20mg. orally with an empty stomach. I could tell that this chemical has much potential, the body feeling that it gives off is extraordinary, and the hues and auras of color it gives off and compliments is fantastic. I was hoping for more OEVs, but we cant all be happy! The following morning I had a big fat headache, I took some ibuprofen and it went away by the time I got to work.</p>",
 "year": "2001",
 "id": "5176",
 "gender": "Male",
 "timestamp": "2002-01-05T08:00:00.000Z",
 "views": "9047",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "7.0 mg",
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "2.0 mg",
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 }
}
