{
 "id": 5176,
 "title": "Locked and Loaded",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Haze EM",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(daily)"
  },
  {
   "time": " T+ 0:00",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "amount": "2600 mg",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "2275 mg",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "262.5 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "[Erowid Note: this person took 4875 mgs of acetaminophen (paracetamol) which can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams/4000 mgs (this estimate is from emedicine.com, more on acetaminophen can be found through your favorite search engine). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.]",
  "Some background info:  I've been smoking weed for about 3 years, everyday for about 1 . Sometimes I drink but for me getting drunk isn't nearly as fun as smoking. I've also experimented with mushrooms, amphetamines, opiates and dxm.",
  "Now, my story. I found a large bottle in my mom's room containing 180 pills called Ultracet. I went to the internet and found out that each pill contained 37.5 mg of Tramadol. I also read a few experience reports about it. Most people seemed to take around 200 mg and I'm a big guy so at 4:00, I took 8 pills for a total of 300 mg of Tramadol. I also took a quick swig of wine but that didn't seem to do anything so I laid down on my bed to wait.",
  "Almost an hour later I didn't really feel anything so me being me, I took almost a double dose. At 5:00, I took 7 more pills for a total of 15 pills and 562.5 mg of Tramadol. Then, it started to kick in a few minutes before 5:30. I guess I just didn't wait long enough for the first dose to kick in because it was coming on pretty strong. It reminded me a great deal of an opiate high, though not as intense as OxyContin or something like that. My whole body was comfortable. It felt really good laying in my bed. My girlfriend called a little later and it really felt good to talk to her. We talked for awhile about anything and everything. I was in the best mood, nothing could get me mad.",
  "At 7:30 the Tramadol was still going strong. I curled up on the couch under a huge blanket and watched tv. My whole body felt relaxed and I didn't have a care in the world. The house could've caught fire and I probably wouldn't have noticed. My thoughts were only good ones.",
  "By 10:30 the effects were pretty much gone. It sucked but I was really glad to have been able to experience this drug. It gives a great high similar to opiates even though it isn't one. I took a lot though (especially for my first time) and the only reason I didn't get sick was probably because of my size (6'3, 220 lbs.)"
 ],
 "erowid": {
  "id": "31502",
  "citation": " Haze EM. \"Locked and Loaded: experience with Tramadol (Ultracet) (ID 31502)\". Erowid.org. Jun 25, 2007. erowid.org/exp/31502",
  "substance": "Tramadol (Ultracet)",
  "views": "31467"
 }
}
