{
 "title": "Digital Love & the Electric Candyland",
 "author": "Teenageangst",
 "citation": " Teenageangst. \"Digital Love & the Electric Candyland: experience with DOC (ID 51766)\". Erowid.org. Jul 5, 2006. erowid.org/exp/51766",
 "substance": "DOC",
 "bodyweight": "100 kg",
 "report": "<p>Well, I'm from Sweden, so my english may not be so good here and there, but I'll try to do my best on writing a report about DOC that will do my experience some justice and maybe help anyone considering taking it. </p><p>To start with, I am a ninteen year old male living in Sweden. My previous drug experiences include cannabis, ecstasy, speed, LSD and opiates (painkillers and poppys). I'm a rather mentally unstable person and I tend to have rather wild moodswings witch of course affects my experiences. Anyways, to the story.</p><p>I have a friend we'll call 'c' who I introduced to lsd a couple of months ago. And when he some time ago got hold on some doc I guess he just felt he had to 'return the favour' I guess. And I'm really glad he did. :P</p><p>Well, the day the package arrived was a good day. I was unusualy happy and it was picture perfect weather and just a fine day for any drug. The place where I was gonna do the most of the tripping was my room in the basement. Cozy and with minimal risks of beeing disturbed.</p><p>Well, at around three in the noon on a half-full stomach I swallowed the stuff. It was mixed out with distilled water in small tubes for better packaging. The taste was slightly chemical, but not awful. </p><p>Ten minutes later I was defenitly feeling a sort of tingeling sensation going through my body and I was starting to feel energized. this feeling got slightly stronger as time ticked away, and maybe an hour later I was starting to feel off baseline. I was sitting at my computer when it started to hit. I felt feelings of euphoria that simply took my breath away and I was totaly wired, as if on some really good speed. The following two or three hours were filled with bliss, energy and some really fucked up talking on msn. My boyfriend did some E at the same time and we were so full of love and happyness. At some point, I don't really know when, som acid-like feeling started to creep in. That feeling of not beeing in kansas anymore, ya know? (or maybe you don't, and then you should find out. :P) Colours seemd clearer and bursts of colours where everywhere. But at the same time it didn't feel as... Uhm... Overwhelming as lsd. I could still focus and did not get as 'lost' as on acid. It was more like a floating feeling all around me. But at some times, yet still I couldn't focus at all.</p><p>Round 1900 I needed to buy more cigaretes and my grandmother drove me to the store. The drive went just smooth and so did the shopping except from som clumsyness. I had decided to walk home and it was awesome. No paranoia just some anxiousness about falling on the icy streets. By this time I was totally in candyland.</p><p>The beauty of the Swedish winter is breathtaking, even without these kind of drugs. But this just blew me away. All the colours where enhanced to the max, and gave it all a rather rather nightmare before christmas-like look because the sun had almost set. The real beauty was that I wasn't scared at all. It's probably one of the best walks I've ever made (except from one time when I got lost in the woods on acid, haha).</p><p>anyways, when I came home I got back to the computer where my mood swung to some sort of melancholy. But it was okey, it was so beautiful, I listen to The exploding boy by The Cure over and over again and marveled over how much I love some of my friends. And at the same time that I was so deeply sad I couldn't help being totaly totaly joyfull. Like a little girl sort of. O_o</p><p>After some more totally insane conversations I laid down in my bed for a while, round eleven or so. And for some insane reason tried to masturbate. It was... Uhm.. Interesting. I don't know how detailed I should be but uhm, it was so, so weird. And it didn't go rather well. So I got back by the computer sometime round 01:00. By this time my brain was really exhausted and I knew it wasn't going to be over yet, so I guessed I just pinched together hard. And went back to bed. Well there I was having deep and rather angsty thoughts for several hours combined with some rather cute OEV's, but nothing extraordinary. It was almost more then I could stand, but not as bad as it can be on lsd.</p><p>Most of the thoughts revolved round my behaviour etc etc etc. It gave me many questions, but no answers. And the thing that irritated me the most was that it was the same old mindfucked thoughts I always get.</p><p>Well, round eight or nine in the morning I got some sleep. And the day after had a rather nice afterglow to it.</p><p>Well. DOC is fun. Fun as HELL even. But I wouldn't do it alone. Just because I could get so goddamn bored. It's a party drug, definitly. I almost want to stretch as far as saying that for me it's the perfect party hybrid between LSD, extasy and speed. And I will definitly do it again as much as I can, haha.</p><p>Well, hope someone will find this useful anyways.</p>",
 "year": "2006",
 "id": "51766",
 "gender": "Male",
 "timestamp": "2006-07-05T07:00:00.000Z",
 "views": "8152",
 "dose": [
  {
   "time": "0",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "DOC",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ]
}
