{
 "title": "Relaxation, But No High",
 "author": "Poppies",
 "citation": " Poppies. \"Relaxation, But No High: experience with Poppies - California (ID 51774)\". Erowid.org. Jan 21, 2010. erowid.org/exp/51774",
 "substance": "Poppies - California",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "5 flowers",
   "oral",
   "Poppies - California",
   "(tea)"
  ]
 ],
 "report": "<p>After reading a book on legal highs, I was trying to decide witch substance to try first. The easiest to get would be the California poppies, seeing that I live in California. I was thinking of possible places to obtain these poppies, and decided rather then go purchase seeds or already grown flowers, I would go scout the neighborhood for houses that have the poppies growing in their garden or lawn. After walking three or four blocks, I found a house with an abundance of the yellow-orange flowers. I picked four or five plants, stem and all but decided to stop as I didn't want to ruin these people's garden and I didn't know how much it would take to cause any effect.</p><p>After letting them dry in my sock drawer for 3 days, I decided it was time to try em' out. I crushed them up (flower pedals and leaves, no stems) and then took a green tea bag, and filled the bag with the little dry poppies, green tea and all. I put the tea bag in boiling hot water at around 4:15 PM, covered the container, and let it seep. At around 11:00 PM I decided to drink the now cold liquid. I drank all I had, about one cup, in about 30 seconds. Five minutes later, I found myself zoning out, similar, but MUCH milder to when I first start to feel cannabis after smoking. Then I had a mild euphoria like experience, which lasted about 15 minutes. I then started to feel drowsy, and very comfortable and relaxed. This was similar to coming down from marijuana, but I felt much less heavy and tired, and I was extremely relaxed.</p><p>I then decided I was going to go to bed now at 12:00, something I never do because I'm never tired and have trouble sleeping. I had the most relaxing and refreshing sleep I've had in a long time(filled with dreams too, because of such a deep sleep), waking up around 10:00 AM. I even forgot the last few minutes before I went to bed, like what album I decided to listen to, and what television show I was watching before I went to sleep, which is probably because the tea made me so relaxed and tired.</p><p>I will definitely be doing this again, maybe regularly to help with my occasional insomnia. If I've had a rough day at work or school and want to relax but don't have any weed, I think California Poppy tea would take the edge off.</p>",
 "year": "2006",
 "id": "51774",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-21T08:00:00.000Z",
 "views": "9967",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 flowers",
   "administration": "oral",
   "substance": "Poppies - California",
   "form": "(tea)"
  }
 ]
}
