{
 "title": "Waves of Pleasure Through my Nervous System",
 "author": "M",
 "citation": " M. \"Waves of Pleasure Through my Nervous System: experience with Nutmeg (ground) (ID 51784)\". Erowid.org. Mar 17, 2007. erowid.org/exp/51784",
 "substance": "Nutmeg (ground)",
 "bodyweight": "90 kg",
 "report": "<p>I was browsing the internet and I found some pages on Nutmeg. Could it really get you high? It seemed really strange but I decided that I one day would try it out.</p><p>Not having done any drugs except for alcohol and a quite intimidating closeness to a number of inhalants, I had no idea what to expect from the nutmeg, except from what I'd read. I had been talking about doing this for 6 months, so my expectations were really high. Planned to eat the stuff at 15.00 to match it with dinner later that night (eating with my dad, I didn't wanna be stoned and trippy when conversating with him).</p><p>15.00</p><p>T+0h</p><p>Grinded the nutmeg with a fine grater. Two dried up nuts ended up in about 2 tablespoons. I came to the conclusion that the WEIGHT of the stuff is more important than the volume. The nuts had weighed about 10 g in nut form and it was pretty similar after they were ground. This could be because they were old. It might be different with new nuts.</p><p>Took about 10 minutes to grind them, I was left with two small parts that I couldn't grind because I'd rip my fingertips if I tried. Started ingesting the powder. Used a technique where I put some of it on a small spoon, threw it into my mouth, on the tongue, drank a big gulp of water and just tilted the head back to get it down. The texture reminded me of eating some kind of tree. And the taste. It doesn't kill you, but I'm not very eager to put nutmeg in my recipes in a near future.</p><p>I immediately started getting nutmeg burps and if I got the taste in my mouth, I'd just kill it off with some orange juice. I think sour things are good to neutralize the bitterness of the nuts. Planned on drinking a big glass of water (4 dl) at least once an hour during the whole trip since I'd read alot about the redeyes and cottonmouth (and the hangover!) I'd started drinking large amounts of water when I woke up that morning, to get a head start.</p><p>15.30</p><p>T+30min</p><p>Nothing (of course) but nutmeg burps. Although, I felt a slight lightheadedness, but I 100% give my expectations the blame. Not that it was a placebo effect, but rather high expectations of what could be a wonderful night.</p><p>16.30</p><p>T+1h 30min</p><p>Something IS different. Don't know what though. Reading a magazine and listening to some music. When I got up to get some water, I suddenly felt some kind of lightheadedness. Is this placebo? It couldn't be kicking in already, could it? A slight stomachache and mild headache. Should be cured by the water.</p><p>17.30</p><p>T+2h 30min</p><p>Settled down and realized the lightheadedness must've been caused by something else. Right now I feel as if nothing is going to happen. Thoughts of eating more or perhaps trying something else runs through my head. Just started to feel some light cottonmouth. Downed another glass of water. The headache is not going away.</p><p>18.00</p><p>T+3h</p><p>Nausea. Is that lightheadedness I feel? Again?</p><p>19.00</p><p>T+4h</p><p>I had really counted on the buzz coming at this point, but still all I feel is a slight lightheadedness. Close to how I am after a few beers. I've started giving stupid answers to the most of what my dad talks about. He's still not done with the dinner so perhaps this is the best thing that could happen. Really hope it'll come on harder soon. Still, I feel it rising.</p><p>20.00</p><p>T+5h</p><p>The good things have started. Mild closed-eye visuals. Was listening to pretty tripped out music (Mikael Ramel) and when I closed my eyes, I saw memories from all my life coming back to me. I could control them pretty easily. If one sound or note in the music reminded me of something I had experienced, I'd immediately see the picture memory I've got from that moment. The interesting thing though, was that, sometimes when I remember something this way, the picture would surround me. I'd be there, in 3D. This time it was like watching super-8 movies. I literally had a</p><p>projector inside my head, and I was sitting on a chair inside of it (my head), watching the screen. Later, a drum solo became a doll that danced perfectly to the groove.</p><p>Had dinner, and got quite a severe stomachache. This could be for other reasons though. Just experiencing some shakings from coldness. My fingers especially have grown cold suddenly. Hmm? I've started saying more and more stupid things to mom and dad (stupid, like trying to act normally when you're drunk) and I'm getting harder to form sentences and keep talking without forgetting what I wanna say. Also, I can</p><p>listen to people for a long while and suddenly realize that my mind is somewhere else and I have no idea what they've talked about.</p><p>Going over to a friend's now. Therefore, all below times are approximate.</p><p>20.30</p><p>T+5h 30min</p><p>Trying to tell my friend something concerning a DVD or something like that, and for some reason, I CAN'T stop laughing! I was laughing so much that I started getting tears in my eyes. I really tried to fight it, because I saw a strange look in my pal's eyes. I didn't want alot of questions and having to tell them my high came from a NUT!</p><p>Was able to calm down but I felt as if I was a real bad conversator, although I was very open and social. Started drinking LOTS of water. Approx. 2 liters from 20.30 to 22.00. Started to get a severe cottonmouth.</p><p>21.00</p><p>T+6h</p><p>I suddenly realize that I've thought of something completely else than the current conversation in the room. As if I was ripped out of some kind of dream and back into reality. Cottonmouth worse.</p><p>22.00</p><p>T+7h</p><p>Now I was really sure. This was some good shit. This dose was pretty close to perfect for me (definitely perfect for the beginner). A stomachache came on quite hard though. I wouldn't blame only nutmeg, since I'm a lactose intolerant and have</p><p>stomachaches on a regular basis. A wonderful tingling in my muscles and bones. Still growing. Cut down on the water. Perhaps 1 liter during the next two hours. Cottonmouth worse than ever. First observation of something red in my eyes.</p><p>23.00</p><p>T+8h</p><p>Realizes I've passed the first part of the trip, where I was very social and energetic. I think I almost started irritating my mates by the constant talking about nothing. Now I started to land on some sort of high plateau of comfortness. The plane softly touching the ground, and the captain telling me 'You may stay here for a</p><p>long while'.</p><p>24.00</p><p>T+9</p><p>Now I'm in a very nice place. The nutmeg sends kicks of wellbeing through my nerves. Fills me with great joy. Sounds starting to act weird, like they're cubic or metallic. I've experienced this every time I've done butane and nitrous, and this is much milder. I love it anyway, since it makes music sound very exciting.</p><p>01.00</p><p>T+10h</p><p>Starting to feel a bit tired. Head home from the friends. This is where the times are more accurate again.</p><p>01.30</p><p>T+10h 30min</p><p>Getting enormous injections of wellbeing from, what it seems, my own muscles. It's like pulses of bright light flowing though my nervous system, filling me up with some beautiful feeling. Sounds start turning slightly inside out. Some sound hallucinations from outside my headphones. Numbness in the whole body, especially the face. Very pleasant. Getting hungry.</p><p>01.45</p><p>T+10h 45min</p><p>Perhaps peanutbutter on your sandwich and cottonmouth isn't the best combinations. Stomachache is very severe when standing up. Sitting is also combined with pain. Lying down seems to be the best solution. It somehow feels as if every single impression, every little movement in your nervous system leaves a beautiful white</p><p>fog after it, like the stunt airpilots leave. If I encourage these mild visuals, they start showing with open eyes, so that they show more of the stuff I wanna see. Starting to feel that every sense is connected to the others in an amazing way. The music intertwines with the visuals, the sensation in my whole body fluctuates perfectly with everything else.</p><p>02.00</p><p>T+11h</p><p>Going to bedroom to listen to music and meditate as long as I can keep awake. I know I'll leave this place when I wake up tomorrow, so I wanna enjoy it as long as I can. Cottonmouth easing down, drinking much less water.</p><p>02.20</p><p>T+11h 20min</p><p>Falls asleep.</p><p>10.30</p><p>T+19h 30min</p><p>Wakes up several times during the night from extreme dry mouth. Eventually wakes up for good at 10.30. Feels as if only 50% of my brain works. Cottonmouth is still there but I seem to have white eyes. Never experienced any red eyes during the whole trip. Must've been the water. Eats some and stomachache returns.</p><p>12.00</p><p>T+21h</p><p>Feels like when an alcohol hangover turns into a mellow day. I CAN do stuff if I want to, but I rather don't. Stomachache and headache gone. The only thing that keeps bugging me is this goddam cottonmouth!</p><p>17.00</p><p>T+26h</p><p>Still feeling that horrible cottonmouth, otherwise I'm pretty close to normal.</p><p>02.00</p><p>T+36h</p><p>Still experiencing some cottonouth, otherwise, I'm back on my normal level.</p><p>I seemed to hit just below my perfect dosage on the first try. The next time I'll increase it to say 14-15 grams to explore the trip. My evening was filled with social life and moviewatching, so I could never really sit down and explore my own head and all the things going on inside of it. I wish I'd spent more time doing that, since I found all the effects of the nutmeg pleasurable and, even better, easily controlled. I never felt scared or even unpleasant, but if I would've, I think I quite easily had been able to change that. The mild visuals that grew stronger as the evening passed were probably the most enjoyable thing, together with the sense of well-being that washed over me.</p><p>I drank enormous amounts of water. My throat was actually irritated from having to wash down that much. The fact that I drank all the time and also (naturally) had to get the water out again was irritating. I couldn't really relax when I kept thinking about drinking and having to go fill up the glass. Although, when the cottonmouth was at it's strongest, I couldn't got 30 secs without having a sip, so there wasn't much choice. Also, my stomachaches kept reminding me of the normal world, something that made it harder to really relax. I'm happy the cottonmouth and the stomachache were the only side effect I ever experienced. It's also the only thing speaking against ever doing nutmeg again. But I found it so pleasurable I'll most definitely go buy fresh nuts from the store and increase the dosage sligthly.</p><p>Hope this guide and the tips I tried to include will help you</p><p>Happy Tripping</p><p>/M</p>",
 "year": "2005",
 "id": "51784",
 "gender": "Male",
 "timestamp": "2007-03-17T07:00:00.000Z",
 "views": "16550",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 }
}
