{
 "title": "It's Like Floating Down a River",
 "author": "CheesyPouf",
 "citation": " CheesyPouf. \"It's Like Floating Down a River: experience with Nitrous Oxide (ID 5182)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5182",
 "substance": "Nitrous Oxide",
 "bodyweight": "120 lb",
 "report": "<p>I went to the dentist to get a filling replaced.  I have a big needle phobia, so I asked the dentist if nitrous was a possibility (I also was interested in the nitrous experience itself).  He put the mask over my face and told me that I'd smell a slight chemical fragrance but that it was nothing to worry about.</p><p>I started to feel very dreamy, like I was floating somewhere near the ceiling.  The dentist told me that I would start to feel very warm and content, that it's just like floating in a raft down a river on a warm summer day.  'It's just like being...' and then he didn't say anything else.  I wanted to say, 'Stoned, doc?' but I couldn't make my lips move.</p><p>I didn't care.  I was so calm and in a very dreamlike state.  I didn't notice the dentist giving me the novocain at all, I was so euphoric.  I could feel the pressure of him removing and replacing my filling but I couldn't really FEEL it.  At this point I was lucid enough to think to myself, 'God, I wish I could be like this forever,' and then realized that I'd just asked the powers that be if I could please stay in the dentist's chair having my teeth drilled for all eternity.</p><p>The thought of this was so ludicrous that I began to laugh softly to myself.  Or so I thought-- apparently the friend who had driven me to the dentist could hear me giggling maniacally all the way in the waiting room.</p><p>When it was all over, the hygienist gave me straight oxygen, which brought me down quickly and gently.  I was still very euphoric and light when I left the office, though that effect wore off quickly.</p>",
 "year": "2000",
 "id": "5182",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-01-11T08:00:00.000Z",
 "views": "13766",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 }
}
