{
 "title": "My Night Under the Crushing Mattress",
 "author": "Yango Wango",
 "citation": " Yango Wango. \"My Night Under the Crushing Mattress: experience with Cacti - T. peruvianus (Peruvian Torch) (ID 51839)\". Erowid.org. Oct 6, 2007. erowid.org/exp/51839",
 "substance": "Cacti - T. peruvianus (Peruvian Torch)",
 "bodyweight": "180 lb",
 "report": "<p>So the other night I had my first ever mescaline experience from using a little over two ounces of Peruvian torch. Let me just say that this was perhaps one of the most powerful hallucinogenic spiritual experiences of my life.</p><p>First off I placed an offering of cactus sludge and the Kraft dinner I made. Weird, maybe even inappropriate, offering I know but it made sense throughout the course of the journey I cannot explain it though. Then I turned to eat the sludge. The sludge was disgusting looking and at first going down it had a texture sort of like applesauce but with a rather unpleasant but not completely unbearable taste. I finished one glass waited an hour and made up another slowly eating this over the next couple of hours. For awhile nothing much was happening then slowly, slowly I could feel something was different just a little odd. I felt a little sick. My body felt different I felt quite tense a little bit uncomfortable. This went on for sometime I smoked some cannabis it helped my body feel a little bit better but didn't do much. My thoughts were now very weird and werent functioning the same way as before. My thoughts didn't really matter though I wasn't thinking about much at all just blank thoughts.</p><p>I went upstairs. I started eating the sludge at about six pm, it was now about 10pm. I went on the computer in my room and surfed the net for awhile I definitely felt a bit altered but nothing too profound. My mom came in to say goodnight I couldn't stop grinning and when she asked what I thought was so funny I couldn't help but grin more it was one of the hugest grins of of my life I began to laugh she looked confused and asked again what was so funny. I just laughed and said oh nothing. She looked at me and said it's been so long since I have seen you laugh. She seemed confused but sort of happy.</p><p>I went downstairs I was feeling like I was floating I started thinking about my life and the energy that flows around us all the energy that connects situations together. I started to think about how certain choices I have made have caused other things to happen. How my negative energy can affect someone and there decisions and vice versa. I now believe in karma. I walked into the bathroom and look in the mirror. I am hallucinating a little the visuals were a little like LSD or mushrooms but at the same time much different they didn't feel like hallucinations and really at this point they had little importance to me.</p><p>I walked from the bathroom to the room across that had recently been used for a slumber party by my younger sister and her friends so there were two mattresses lying on top of each other. The one on top being quite a heavy mattress. I got in between them and laid there in darkness with the force of the mattress on top of me. My body still feels quite tense at this point and I am in quite a bizarre state of mind. Reality is definitely now completely shifted into the mescaline realm that seems like it is just reality. I start to visualize the mattress as being the negative evil dark forces of the world. I feel it crushing me. The mattress feels alive it feels like it is a snake. It becomes a snake I am fighting against the force of the mattress that are crushing me. I experience thoughts of being crushed to death of people drowning in the blackness of what it would be like to be completely helpless against natural forces and of how weak we actually are and how easy it would be to be blindsided and killed in one swift second. I feel almost like I am dying being crushed to death by these forces I can feel it.</p><p>The snake is at the same time evil and at the same time my father. I don't think my father is an evil person so this becomes quite confusing. I feel for one brief second that this force has loosened up I take this chance and punch it as hard as I can in quick succession with both fists very fast and forceful. Tossing the mattress up and halfway off. The force slumps against me weaker now and all of a sudden the realization comes to me you just killed a man. You just killed your own father. I realize how easy it would be in one quick mistake how easy it would be to kill someone and the remorse that would so quickly follow. I feel remorse strongly.</p><p>I lay there now the mattress half on top of me now not nearly as powerful as it had been the force is still there but it is not crushing me with evil anymore I don't even know if it is evil anymore or even was in the first place. I lay there thinking more about how negative forces effect everything and how positive forces can be just as powerful. I start to think about how powerful this plant is how it is a teacher and what I am learning has been learned before by many people. I feel like it is a guru it is a form of guru that has revealed itself to me through this plant in this way.</p><p>I still feel the tension in my body and know it won't go away until I sleep I realize I always carry this tension with me and perhaps this night I have lifted just a little and started the path to remove all the negative energy and turn it into positive energy. There is kind of weird smell coming from me something I have smelt before but can't place. I feel so weird I feel like I am a young man on the shamanic path with no teacher or tradition that I will have to work extra hard on this energy because of that. That I have been chosen to heal since the beginning but can't begin yet because there is still so much for me to learn and so much energy I must work with and so much in my life I much work out.</p><p>I stop to pet the dog Jet. She has been living with us now since she was a pup 12 years ago. She is old now and has a lot of trouble walking up the stairs her hearing is bad and she is tired. I pet her and I tell her how proud I am of her how strong she has been and how strong she still is. How she has accomplished much in her life and brought happiness to me and the rest of my family. We love her and she loves us. I recognize her as being a dog. I recognize how beautiful that is and the strength power and abilities she has that I will never have or never experience. As a human I am no better then she we are just different. In a moment in her younger days she could easily have killed me she is stronger then me faster then me and deadlier then me. But we are equal and both a part of everything. We both have our place. Just like everything on this earth has its place. Wonderful. I feel true love from her and I love her deeply. I feel that love that we share.</p><p>It is now about 5 am I go up to bed but I doubt I will sleep I ponder these thoughts for a long time and continue on thinking in bed until at least 4pm that evening. I may have drifted off for a few minutes here and there but I can't really tell my thoughts are almost non-existent by the end like my mind is once again blank. I feel different I am not tripping anymore but was I really ever tripping? It doesn't matter at all. The hallucinations carry so little importance though there was some it just doesn't matter compared to the rest of the experience. I finally sleep that night with some very unusual dreams and wake up feeling refreshed. Still feeling the effects of change throughout the whole day and right up to this moment now. I have just typed up what I can explain. There was much more going on in my mind and many more thoughts and more importantly emotions that I can't explain. It was very unusual and it taught me a lot. Today I buried the small amount of remaining sludge in the front yard as an offering of thanks. The path is now just a little clearer thank you great cactus teacher for showing me this way. Treat this plant with great respect it deserves it.</p>",
 "year": "2006",
 "id": "51839",
 "gender": "Male",
 "timestamp": "2007-10-06T07:00:00.000Z",
 "views": "9897",
 "dose": [
  {
   "time": "0",
   "amount": "60 g",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "(plant material)"
  }
 ]
}
