{
 "title": "First Day on New Meds",
 "author": "Adderall",
 "citation": " Adderall. \"First Day on New Meds: experience with Amphetamines (Adderall) & Cannabis (ID 51833)\". Erowid.org. Nov 13, 2009. erowid.org/exp/51833",
 "substance": "Amphetamines (Adderall) & Cannabis",
 "bodyweight": "180 lb",
 "report": "<p>Hello, I'm 15 and live in Wisconsin.  I'm familiar with different drugs (weed, perspriction drugs, OTC drugs, alcohol, ect ect) and saw Adderall as something I wanted to try.  I have a couple of friends that tell me how when they got put on Adderall for ADD their grades go way up because of the drug.  My grades suck, so I thought I'd go get tested for ADD.  I did, and they said I have a pretty bad case ('yeah, yeah, I can't pay attention, what ever, give me the drugs!').  The appointment was at 8 am, so I popped two on my way back to school.</p><p>10 am</p><p>3rd hour rolls around I start feeling it, this is study hall so I was sitting with my friends and I kept telling them I felt funny.  The feeling and mindset I got from Adderall was like no other drug I have ever had before.  I felt a bit off, nothing really great nor bad.</p><p>Noon</p><p>Lunch rolls around, and I got to the front of the school with my friend, A., I told A. that I took 2 this morning and was really feeling funny and weird.  He told me that he had tried Adderall before and asked me if I felt, 'speedy'.  And that's the best way I can describe it.  It's like on the inside I feel really speedy and anxious, but on the outside I feel kinda slow, relaxed, and calm and while all this is happening they're fighting each other.  We rolled into wendy's and I found it kinda hard to order.  I didn't even eat the meal because the Adderall made all my appetite go away.  Me and A. went back out to our friend's car and had a ciggerate.  I have to admit, the ciggerate was the best I have ever had in my life, I felt euphoric, and I knew the Adderall had something to do with it.</p><p>2:30 pm</p><p>15 minutes or so into 10th hour (last hour, Geometery).  I felt as if the Adderall was peaking because it was hard to ignore it.  for the first 10 minutes of class, I didn't move an inch and just stared blankly at the teacher as she lectured.  I wanted to move, but I just felt like I couldn't and I had to just sit still.  My friend in the back started laughing at me because he knew I popped Adderall and that was why I wasn't moving (I told him during study hall).  My teacher told me I should get out a notebook and take some notes, I usually don't.  But, this time, I felt like I had a surge of anxiety and I HAD to take notes.  I can't really explain it.  I just had to get that notebook out and pay attention.  My teacher was impressed because I actually took some notes, and got the homework done with the last couple of minutes of class (keep in mind, this is something that NEVER happens).</p><p>4 pm</p><p>School was out so I went to my friends house to smoke some weed.  I brought over my bong and shortly after his mom left, we packed one and started rippin' it.  I felt the pot impact me and I felt very giggley.  I have heard rumors that when mixing adderall and pot, you start tweaking (paranoia, extreme anxiety) very badly.  I felt nothing but positive things and I knew for sure that the Adderall was making the high sky rocket.  We were baked for the rest of the night and were having a great time.  This was the same night we were planning on buying quite a bit of LSD (10 blotters and 7 gels).  In anticipation for the Acid mixed with a euphoric high, the speediness of the adderall, and the spinning from a ciggerate, I felt on top of the world. I could barley stand up or keep my eyes open.  Sadly, the Acid deal never went through so we just smoked for the rest of the night, and everything went fine.</p><p>I think Adderall is a sweet drug.  It gives me a 'speedy', funny feeling all day, and is quite relaxing at times.  The good side effect of this drug, is it forces me to do something.  The Adderall does help me do my homework and such, but I have to let it.  On Adderall, if I have nothing to do, I'll just focus and concentrate hard on doing nothing.  If I tell myself that I should do some homework or something, the Adderall will take over and force me to focus on just that.  Because I'm just focusing on that, it's not boring or anything, just a feeling of accomplishment when it's over.</p><p>Adderall is a pretty sweet drug, and I'm glad I have it.  I enjoyed smoking pot and ciggerates when on it, they made the day 10 times better.  I look forward to upping the dose some time on the weekend when I have some time alone, maybe snort 3 or 4...</p>",
 "year": "2006",
 "id": "51833",
 "gender": "Male",
 "timestamp": "2009-11-13T08:00:00.000Z",
 "views": "6577",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 7:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
