{
 "id": 5185,
 "title": "Very Dissapointed",
 "date": {
  "submission": "2004-03-05T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "X",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "325",
    "grams": 0.325
   },
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "About a week ago I have been reading numerous reports on this site about all sorts of drugs, then started reading specifically on household drugs. I found out that you could trip on Diphenhydramine (Benadryl). So I thought I would try. I read about 10 reports on this, so I had in mind what was going to happen.",
  "Last night at about 8:30 I took 13 benadryl pills. at about 9:10 I found it a bit more difficult to read and understand what I was reading.",
  "I started playing my guitar at about 9:30 and things started to jump, out of the corner of my eye, not very often, it would happen every 5 minutes and only like 3 times. I read that you start talking to people that aren't even there, that never happened to me. I read a report where he only had 250mg, and he talked to people. But I know it is different for everyone.",
  "I decided to lay down in my bed at about 10:15. at 10:30 Jay leno came on so I watched that. I was already kinda disapointed cuz it had been 2 hours, and nothing major had happened. Around oh 10:45 I remember falling asleep numerous times, only like 5 seconds, but it seemed forever. I remember falling asleep and waking up out of a dream it seemed like. (the only 'hallucination' I ever got) I woke up to the sound of bubbles like coming out of the ocean. And that was it. After that I was very alert for some reason and didnt fall back asleep.",
  "I went to bed around 12. Still nothing had happened. woke up about 1 am with MAJOR cotton mouth. I remembered I had a glass of water sitting next to my bed so I reached down to get it to check if there was anything left and it spilt all over me. So at first I thought this was a hallucination and I was excited. Then I realized that it wasnt going away and I had to clean it up. Then I remember talking over my guitar that was at the end of my bed, I also thought that was a hallucination, but no it wasn't. Went to bed and woke up at 7AM, then went to school.",
  "I felt very sick at school with cotton mouth and the taste of those pills. It was Horrible, I was very dissapointed. it is 7:30 Pm, and I STILL have cotton mouth and feel sick. From my experience that was the dumbest thing I have ever done, and recomend it to anyone who wants to feel sick for an entire day."
 ],
 "erowid": {
  "id": "31524",
  "citation": " X. \"Very Dissapointed: experience with Diphenhydramine (ID 31524)\". Erowid.org. Mar 5, 2004. erowid.org/exp/31524",
  "substance": "Diphenhydramine",
  "views": "19722"
 }
}
