{
 "title": "The Thinking Session on the Hill",
 "author": "Someguy",
 "citation": " Someguy. \"The Thinking Session on the Hill: experience with 2C-I & MDMA (Ecstasy) (ID 51867)\". Erowid.org. Jun 25, 2007. erowid.org/exp/51867",
 "substance": "2C-I & MDMA (Ecstasy)",
 "bodyweight": "175 lb",
 "report": "<p>I recently went to a music festival and there I thought would be a good time to let go because of spring break and have an even better time at this rave. over the course of 8 hours I had 1 blue dollar (ecstasy) 3 hours into the rave. And then an hour later had a blue crown (ecstacy). Later on I meet some people that were selling 2C-I. I had ever heard of it before. they told me it was a lot like acid, but I had never had that either.</p><p>I have done mushrooms twice before which is the only hallucinogen that I have done. I opened the capsule and poured the powder on my tongue to ingest it for faster effects. After 45 minutes I started to have fairly intense hallucinations. I sat on a hill watching the stages in the distance with their lasers and lights. I would see spin offs and flares of fire coming from the lasers. When trying to use my phone the screen looks like water drops were falling on water so I was very difficult to use my phone. When I would be dancing the people's faces around me were constantly changing and it was hard to make out anyones face no matter how close they were. Sometimes I would even see extra faces right next to someone as if I was seeing their face in double vision.</p><p>I had many different visual hallucinations which were pretty intense but were not scary or disturbing. They were pretty fun hallucinations actually. Sometimes I had to look very hard at my friends faces to see who they were (maybe it was because of the darkness). After dancing I sat back down on the hill and had a thinking session with some of my friends just like someone on acid would have. the mental high go fairly intense after about 5 hours and started to make me fairly paranoid. But the paranoia lasted less then an hour. All in all 2C-I was a good trip.</p>",
 "year": "2006",
 "id": "51867",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "5329",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": "20 mg",
   "substance": "oral"
  }
 }
}
