{
 "title": "Two Nights, One Overworked Brain",
 "author": "Pike",
 "citation": " Pike. \"Two Nights, One Overworked Brain: experience with MDMA (Ecstasy), Mushrooms, Cocaine & Cannabis (ID 51892)\". Erowid.org. Jul 9, 2008. erowid.org/exp/51892",
 "substance": "MDMA (Ecstasy), Mushrooms, Cocaine & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 1:45",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 3:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 4:10",
   "1 hit",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 4:10",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 4:30",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " T+ 5:30",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 21:00",
   "1 line",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " T+ 22:00",
   "1 line",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " T+ 24:00",
   "1 line",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "51892",
   "Male",
   "",
   "Not Given",
   "Jul 9, 2008",
   "7981",
   " "
  ]
 ],
 "report": "<p>Forward: Over the past few months I have used what most would consider entirely too much MDMA. Although for the three weeks before this experience I had not ingested any, I believe the dosages encountered herein are evident of serotonin depletion, and I would recommend highly that others not duplicate my choices. Before the experience I had previously never ingested mushrooms, and only on one instance insufflated cocaine, in quantity less than .5 grams.</p><p>Friday, 8:30 PM: My friends and I are all gathered at my apartment, getting ready to head out to the show. The mood is positive, and I am still debating whether I will be taking any chemicals throughout the evening. I decide that Ill wait and see how the vibe is at the rave before committing to rolling for the evening.</p><p>10:00 PM: Were all inside hanging out  the general mood is good, and I decide that Ill take a few.</p><p>10:30 PM: I take two pills, and continue dancing and drinking water.</p><p>11:20 PM: I rapidly realize that I am beginning to come up, and have a seat against a wall in the downstairs room. Within five minutes I am rolling balls, and wander aimlessly before running into some of my friends. The music is amazing, the lights look incredible, and I have a seat while two guys trade off giving me a lightshow  I zone out and watch the lights go by.</p><p>12:15 AM: I take another pill, and continue dancing, enjoying myself all the more. My memory of this portion of this evening is exceedingly poor. I recall few frames, mostly of talking with my girlfriend. A friend (who I will herein refer to as Kyle) that I met up with at the party invites us to his house for an afterparty, and offers to give us a ride.</p><p>1:30 AM: I get another two pills, and take only one, saving the other for later. Kyle says he wants to leave soon, and we begin to round people up.</p><p>2:15 AM: We leave the party and all pile into Kyles car. Theres 7 people, two doors, and 4 and a half legitimate seats. We go to leave, and sitting with my girlfriend on my lap, along with three other people, packed into the back we take off. On rights I had been thinking that it would be miserably packed, but as we got on the freeway and Kyle put on 4 Strings Take Me Away I found myself in a state of complete bliss. Nothing in the world was wrong, the moment was perfect, and I wished to myself that I could live in it forever.</p><p>2:40 AM: We arrive at Kyles house, I walk around and say hi to all my friends. One of Kyles roommates passes me a loaded pipe and I take a nice hit. I feel marginally mellowed out, but still positively out of my head. I take my fifth, and what I had planned to be my last, pill. We hang out and I continue socializing, before heading into Kyles room to chill out with my closer friends in attendance.</p><p>3:00 AM: Kyle asks me to get a plastic bag out from his closet, and I hand it to him  He opens it and pulls out what he says is about half an eighth of mushrooms. I take what he hands me, and he and various other guests eat some too.</p><p>3:30 AM: At the behest of one of Kyles roommates, many of the people at the house leave for another house. We all load up, a more sober person jumping behind the wheel. By the time were halfway to our destination, Im hallucinating. Having never taken mushrooms before, much less hippy flipped, I had no idea what to expect. I found myself very lethargic and confused. Confused, however, may not be the proper word, as it implies panic or desperation  my state of mind was quite the opposite: I had very little idea what was going on, but I couldnt care less. Sinking into the backseat of the car I looked at the people seated next to me, watched other cars and the trees go by, I felt like I was melting into one extremely pleasant blob of human gelatin.</p><p>4:00 AM: We arrive at the other house, and another of my friends is there. He offers me another pill, which I really shouldnt have taken, but was too high at that point to make any sort of sound judgment. I sit down on a couch and just chill. </p><p>4:XX AM: Im really too messed up to function at this point. For some reason we decide to go back to Kyles house, but the people who drove Kyles car here had already left. Another of our friends drives us back and I enjoy another blissful car ride</p><p>5:30 AM: Sitting back at Kyles place, I sit and lose myself on the couch. Its like an amazing roll, with pretty visuals, and without the capacity to follow events or conversation enough to become irritated or annoying by anything. </p><p>We hang out for several more hours and enjoy ourselves. I come down from both the MDMA and mushrooms at some point, and feel exhausted, but am unable to sleep. I cuddle with my girlfriend, and talk with my friend in Kyles living room while everyone else has basically passed out. Although Im physically spent and ed over as we say, I feel entirely content. We sing along to sublime, and have a generally killer time.</p><p>Saturday 2:30 PM: Not having slept yet, I get a ride back to my apartment with another friend at the party. We drop my girlfriend off, I go home and pass out. My friend who had planned to be over that afternoon (who I will refer to here as Aaron) calls and says hell be late. I get some sleep.</p><p>5:30 PM: I wake up and hang out with some friends who had crashed at my place the night before. We all chill out  I dont feel nearly as bad as I had anticipated, most likely due to the quality of the pills compared to previous experiences where I had taken a comparable number of pills containing high quantities of methamphetamine.</p><p>7:30 PM: Aaron arrives, and unexpectedly has brought with him an 8 ball of coke. All my other friends had stepped out for a few minutes, and we cut ourselves two generous lines to start the night off. I feel great, and we talk some. Our friends return. We hang out for a bit, and cut some more lines.</p><p>8:30 PM: Aaron and I head over to my friends place to pick up some more stuff, we get a 10 strip, and another 2 grams of cocaine. We take a line while were there.</p><p>10:00 PM: We get back to my place and the acid disappears into all my other friends mouths. Aaron and I continue, and I start to feel a little bit sick to my stomach, but not too bad.</p><p>10:30PM: We take another line, and after the initial effects wear off I dont feel so good at all. I make my way to the bathroom, and think I might purge. I manage to keep it down, and have a seat on the edge of my bathtub. I sit down and start sweating profusely, and Aaron checks my pulse: 110. I take a few minutes to settle myself and everything is fine. I decide that Ill sit out for an hour.</p><p>11:30PM: My stomach doesnt feel 100% yet, but its no longer the same sensation as before. Feeling more like I did coming down off my previous experience with cocaine, I decide to go for some more. I have no problems and again feel great.</p><p>---</p><p>The rest of my night passed with little event besides more blow and lots of euphoria. At about 5AM we finish off the last of the snow and chill out, waiting for what we presume will be an awful comedown. </p><p>At about 6 when I can finally feel all of my face again, things are definitely unpleasant. I feel miserable and cracked out, and its 2:30 in the afternoon before I can finally get to sleep.</p>"
}
