{
 "title": "Do Not Try This at Home",
 "author": "Mr_BlockOfCheese",
 "citation": " Mr_BlockOfCheese. \"Do Not Try This at Home: experience with Calamus (ID 51908)\". Erowid.org. Mar 7, 2007. erowid.org/exp/51908",
 "substance": "Calamus",
 "bodyweight": "195 lb",
 "report": "<p>Let me start off by saying this has been by far the worst drug experience of my life, which is the main reason I decided to post; I wouldn't wish this experience on my worst enemy. If this is the only part of my posting you read, please know that having experienced Calamus I'd honestly rather eat someone else's vomit than ever try this again.</p><p>Having heard of the stimulant/relaxant and hallucinogenic effects, my roommate and I ordered some Calamus root off the Internet. Last night at about 10:00 we each ate 6 inches of the root. This was extremely difficult to do, as Calamus root tastes absolutely foul. The first bite tasted like rotting mint which wasn't so bad, but this was followed by a heat (like you would get from ginger) and a taste like a mix between the rotting mint and rotting pine needles. It was awful, so we poured honey garlic sauce on it which helped a little, but not much.</p><p>We'd heard it takes between 2 and 4 hours to work, so we sat back to wait. By 1:30 when it still hadn't worked we decided just to go to bed, pretty disappointed that nothing happened.</p><p>I woke up at 6:45 and I knew I was going vomit, and I knew it was because of the Calamus root. It tasted terribly similar to how it had going down, which made me even more nauseous. After emptying my stomach I tried going back to sleep, but alas this was not possible. Within 10 minutes I was back in the bathroom heaving my guts again. It is now 9:15 and I've vomited 10 times since waking, and I'm 100% sure I'm not done yet.</p><p>The only thing I've ever experienced that was worse than this was the time I got food poisoning from McDonald's and was up all night vomiting, unable even to keep down water.</p>",
 "year": "2006",
 "id": "51908",
 "gender": "Male",
 "timestamp": "2007-03-07T08:00:00.000Z",
 "views": "10765",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6 in",
   "administration": "oral",
   "substance": "Calamus",
   "form": "(roots)"
  }
 ]
}
