{
 "id": 5190,
 "title": "My Insane Trip to the Hospital",
 "date": {
  "submission": "2008-03-25T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Robotussin",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1050",
    "grams": 1.05
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "capsule"
  }
 ],
 "report": [
  "I had recently just found robotussins new 8 hour gel caps at my local supermarket. I had the brilliant idea to try these out instead of drinking the usal horrid tasting delsym. My first mistake was thinking that I should take a dose the same size as I would with delsym not thinking that delsym is a suspended release formula. So I went and bought 4 bottles of robotussin cough gells and I went with one of my friends to the football game on the we took a detour and I decided to take the 70 pills. We took our time getting to the game. Thank god because just as we arrived in my high school's parking lot the trip hit me like a ton of bricks.",
  "It was the most intense feeling of euphoria I had ever experienced. I convinced my friend to drive me to a party because I was way too messed up to walk around the game without getting caught. On the way to the party I puked out the window for about 5 minutes. When I got to the party it was as if I was in another world. I walked up to the wrong door and stood there for five or ten minutes before the noticed I wasn't coming in and someone came and got me. Then my dad called me because I wasn't at my friends house where I was supposed to spend the night. I tried to reason with my dad for about an hour on the phone and then somehow he found out where I was before I realized it he was there.",
  "I had to go with him home and he noticed how messed up I was when I got home my mom and dad called poison control and told them what I had taken. Then my parents took me to the emergency room where the forced me to drink two 8 ounce glasses of liquid charcoal. I was given something to lower my blood pressure and my heart rate because I was at rest with a heart rate of 150bpm. I stayed the night having one of the most intense trips ever."
 ],
 "erowid": {
  "id": "31538",
  "citation": " Robotussin. \"My Insane Trip to the Hospital: experience with DXM (ID 31538)\". Erowid.org. Mar 25, 2008. erowid.org/exp/31538",
  "substance": "DXM",
  "views": "12306"
 }
}
