{
 "title": "Psychedelic Sex",
 "author": "El Calico Loco",
 "citation": " El Calico Loco. \"Psychedelic Sex: experience with 2C-I & 2C-C (ID 51905)\". Erowid.org. Jul 15, 2006. erowid.org/exp/51905",
 "substance": "2C-I & 2C-C",
 "bodyweight": "180 lb",
 "report": "<p>I had read good things about the combination of 2C-I and 2C-C. I took 20mg of the former and 30mg of the latter on a mostly empty stomach at 19:30. I took a precautionary dramamine along with it.</p><p>The combination began to take effect within an hour. I invited my girl to take a shower with me.</p><p>The water was wonderful. Touching the girl was wonderful. We must have been in there for half an hour. It had really kicked in by the time we got out; I was seeing tracers and watching the walls melt and blur.</p><p>We headed for the bedroom. I turned off all the lights, turned on the heater (the humming and red glow were amazing), and locked the cats out. Violator played in the other room.</p><p>I won't go into pornographic detail - suffice to say that it was the most intense sexual experience of my life. Faces and bodies morphed and blurred. I could go forever, and then go again. Orgasms were like a warm wave across my entire body. I truly let go, more than I ever thought possible. The sensuality of 2C-I combined with the eroticism of 2C-C for a powerful experience.</p><p>It was good for the girl, too.</p><p>I lay there for some time afterwards, just enjoying the movement of the lights across the ceiling.</p><p>I decided to take a bath to clean up. 'More water,' said the girl, amused. It was wonderful, as usual. Wavy lines and morphing faucets. The light from the television in the bedroom became a cool strobe effect.</p><p>This combination was stronger than either had been alone. It felt great to sit perfectly still and stare into space. I hated news and shows with laugh tracks. I liked cartoons. I loved the channel with the Doppler radar and robot voices.</p><p>I didn't feel like talking, especially after she'd had a few beers. Drunk people aren't much fun when Im tripping. I grinned and told her she talked too much. She rolled her eyes at my altered state of consciousness.</p><p>The girl fell asleep. I wandered over to the computer.</p><p>The images were three-dimensional. I felt like they were going to jump out of the screen. I must have spent half an hour just staring at one picture of the girl. It morphed and changed, but lost none of it's 3D quality.</p><p>I felt sadness. Imagine if this picture was all I had. Imagine if she was gone; I could look at her forever, but could never touch her again. Never hear her bawdy laughter.</p><p>I wandered around the apartment. The fluorescent light pouring under the front door from the hallway outside was electric blue. My cats were dangerous little predators. The blinds on the window were beautiful. The humming from various electrical appliances was alien and exciting.</p><p>I could almost feel when the 2C-C wore off, but the remainder of the 2C-I experience was still colored by it. It was stronger than it had been on its own.</p><p>I had trouble falling asleep, but not as much as I'd had with 2C-I alone. I felt good the next day, but not as good as I'd felt with a stronger dose of 2C-C. I caught glimpses of tracers, from time to time, until late in the evening.</p>",
 "year": "2006",
 "id": "51905",
 "gender": "Male",
 "timestamp": "2006-07-15T07:00:00.000Z",
 "views": "11483",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-C",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ]
}
