{
 "title": "Delayed Reaction",
 "author": "StavinChain",
 "citation": " StavinChain. \"Delayed Reaction: experience with DXM (ID 51910)\". Erowid.org. Jun 14, 2009. erowid.org/exp/51910",
 "substance": "DXM",
 "bodyweight": "300 lb",
 "report": "<p>I can't call myself an overexperienced psychonaut, but I have had my share of interesting experiences, mostly with the opioid family.  Several months ago, I thought I would experiment with DXM, and have enjoyed the periods spent in its company.  Most of these have been solo jaunts in the privacy of my own home.</p><p>On a recent junket to a large city, I decided (since I was not driving) that I would explore the interactions between myself, DXM, and the people I would encounter in a mall.  As usual for myself, I decided to start small: a good solid first plateau dose.  At 1 in the afternoon, I slurped down the syrup.  I then walked into the mall and started a round of shopping with my g/f.</p><p>Around 2, I glanced at my watch and thought, well, I'm an hour-onset case at best, so anytime now.  Very watchful for any of the signs, the next hour passed, and nothing.  3:15.  3:30.  3:45.  Not even the slightest cue that anything was going on.  At 4:00, while browsing a going-out-of-business jewelry store, I decided that I might as well forget it--something had gone wrong and the Dex had not been processed correctly.</p><p>At 4:25 we walked into the Eddie Bauer store and began talking to a saleslady.  I was, as always, very chatty, and before long the saleslady and I were talking about everything under the sun while my girlfriend picked out clothes.  Then, at exactly 4:30, WHAM!  In the middle of a sentence about cruise ships, my solid first-plateau dose kicked me in the proverbial hiney.  I had been watching and waiting for any signes of onset, and there were none--just transported directly into the first plateau . . . Three-And-A-Half Hours after ingestion!  For the next two hours, the mall was so much more fun and friendly.  Then, almost as sudden as the onset, I was back in the real world at almost precisely 6:30.</p><p>I have never had DXM take 3.5 hours to come on, nor have I ever felt it arrive at full force immediately.  Looking back, I wonder if perhaps the food I had had for lunch (somewhat greasy) contributed to the delayed onset, or if it was simply that my already being 'in motion' kept me from recognizing the early signs (doubtful, since I was being very careful to watch for them).  Just wanted to share this insight with anyone who might be thinking of taking an extra dose when effects are delayed; don't count Robo out in the first several hours, no matter how it seems!</p>",
 "year": "2006",
 "id": "51910",
 "gender": "Male",
 "timestamp": "2009-06-14T07:00:00.000Z",
 "views": "3803",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "270 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 }
}
