{
 "title": "Just Experimenting",
 "author": "Pdawg",
 "citation": " Pdawg. \"Just Experimenting: experience with Chloroform & Hydrocodone (ID 51938)\". Erowid.org. Apr 8, 2007. erowid.org/exp/51938",
 "substance": "Chloroform & Hydrocodone",
 "bodyweight": "220 lb",
 "report": [
  "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "I work in a pharmacy and have been taking small amounts of pills for experimenting for some time now. I noticed one day a number of large bottles on the top shelf in the back counter area of the pharmacy. A bottle of Chloroform caught my eye. I remember in movies how the characters use chloroform to render their targets or victims unconscious. I have always wanted to try an anesthetic on myself and this was my opportunity. I decided to take a negligible amount from the bottle, since it was barley ever used.",
  "Later that night, some friends came over to my place. We snorted some Vicodin sat back and relaxed. I feel I may have built up a tolerance to the drug, but I still felt sedated and content. My friends left an hour later and I was alone. I researched Chloroform a bit little before trying it. I have no prior experience of huffing any kind of ether, paint thinner, etc. So I was in the dark on how to administer the drug to myself. I decided that the best way would be to soak a small rag in the chloroform and place the rag into a paper bag. At 12:10 am, I took my first deep breath from the bag. The chloroform had a surprisingly sweet taste. The taste eventually turned into a rubber cement odor/taste after the second inhalation. I did three consecutive breaths from the bag and sat back.",
  "My mind suddenly became cloudy. I looked around and chuckled a few times. I felt light as a feather but then I couldn't move. I needed to take more I thought. After two more large breaths I sat back again. This time My vision began to change from a bright white to a dark black. I took two more breaths. I cannot recall my actions after that. My brother told me that he saw me dancing around for a minute or two then pass out. I felt like I slept the whole night. After I came to, it was only 12: 22am.",
  "I woke up clearheaded and refreshed. A common side effect of chloroform in severe or mild headaches but the Tylenol in the Vicodin probably helped me in avoiding one. I would recommend chloroform and will use it again. My advice is to use it in a safe and comfortable environment. I ran around, passed out, and felt great for twelve minutes. Maybe I should try a larger amount with just a rag? I assume only a high dose of chloroform will cause unconsciousness but I am not willing to accept the risk of full anesthesia.</p>"
 ],
 "year": "2006",
 "id": "51938",
 "gender": "Male",
 "views": "17629",
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "insufflated",
   "substance": "Hydrocodone",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "10 ml",
   "administration": "inhaled",
   "substance": "Chloroform",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2007-04-08T07:00:00.000Z"
}
