{
 "title": "Temporal Distortion",
 "author": "Deepthought",
 "citation": " Deepthought. \"Temporal Distortion: experience with Diazepam (Valium) (ID 51965)\". Erowid.org. Jan 3, 2008. erowid.org/exp/51965",
 "substance": "Diazepam (Valium)",
 "bodyweight": "185 lb",
 "report": "<p>I was able to acquire some 10 mg tabs of generic valium, and over the course of a week took a few hundred milligrams. I had taken valium once before, but the dosage was too low for my body weight, so I never really felt much effect.</p><p>The first day I got the tabs, I took about 50 mg, and got a little drowzy and very relaxed. I did also smoke some pot, so it was tough to truly differentiate which effects were from what drug I took. Over the next few days, I took dosages ranging from 10 mg/day to 60 mg/day. By the end of the week I physically felt fine, but my ability to recall time, especially day of the week was strongly impaired. I recall being with some friends and having no recollection of what day of the week it was, I kept on thinking it was a Saturday, when in actuallity, it was Monday, and this happened for several days thereafter, even when I was I had not consumed any diazepam.</p><p>This inability to recall the day of the week lasted for 3-4 days and was very annoying. I am a student, so during this time I was studying/taking my exams (I never took the diazepam while taking any exams). I found that it did not, in fact, impair my ability to learn, and perform well on the exams; I actually did about the same as I always do. The only strange side-effect was this temporal distortion, which finally wore off.</p><p>Since I am a scientist, I plan on performming tests, on myself, and if I continue to have these strange side-effects, I will report them here.</p>",
 "year": "2006",
 "id": "51965",
 "gender": "Male",
 "timestamp": "2008-01-03T08:00:00.000Z",
 "views": "20345",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(daily)"
  }
 }
}
