{
 "title": "5-MeO-AMT Meltdown",
 "author": "Connisuer",
 "citation": " Connisuer. \"5-MeO-AMT Meltdown: experience with 5-MeO-AMT (ID 51963)\". Erowid.org. Dec 11, 2006. erowid.org/exp/51963",
 "substance": "5-MeO-AMT",
 "bodyweight": "165 lb",
 "report": "<p>This is a crazy crazy experience first off.</p><p>11:00 PM:  Went to the bar with a buddy and proceeded to drink three pitchers while waiting for another friend to get to houston with the capsules.</p><p>11:45 PM:  Drove to freinds house and picked up some strawberry kush. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>3:00 AM:  Friend finally arrives with substance. Me him and a third friend pop the capsules immediately one each.</p><p>3:20 AM:  Can feel a slight anticipation and the glow is getting there.</p><p>3:40 AM:  The trip has deffinently started. There is slight waving and a little patterning.</p><p>4:00 AM:  We wind up on a golf course in a neighborhood. Trip is really begining to kick now. trees are bending. its all over happiness while running. Experiencing extreme auditory distortions. things beggining to change colors. We start making art in the sand dunes which include a big heart with the letters lsd inside and death 2 bush. We really wanted to give those rich assholes a surprise.</p><p>4:30 AM:  Trip was getting way to intense to be running around a golf course in peoples open backyards so we leave.</p><p>5:00 AM:  The throwing up begins commencing after 2 hours of holding the naseua down. My friend leans out his car door and throws up. I still hold it down and so does my buddy callo.</p><p>5:20 AM:  End up at callos to drop him off. Matt runs to get a drink from callo. I begin to feel like puking. open the truck door and fall out lay there and look at the stars change colors then puke while laying on my back (not good).</p><p>5:30 AM:  8:00 drive around tripping.</p><p>8:30 AM:  Get a call from callo. Hes having a really bad trip. Thinks hes gonna die. Get to his house in hes not in good shape so me and my buddy try to help him out. We start freaking out so we call two fellow hallucinogen enthusiasts to come help. Were to fucked up to at this point in time. Shit is swirling together colors are changing in the span of half seconds.</p><p>9:00 AM:  Callo is in bed sleeping. were out tripping in the conservatory. We gave two caps to the fellow enthusiasts and they join this wild experience.</p><p>12:00 PM:  Callo finally snaps back at 12 and comes and joins the trip. Realizes hes not gonna die an all around happy time.</p><p>3:00 PM:  Me and callo get ready to go to work both as waiters. Not a good idea for we are still in the grasps of a trip a hard one and a completely diffrent one.</p><p>5:00 PM:  Get to work and completely having a happy trip. Inspired by listening to the beatels. all day work then go home and finally get some sleep.</p><p>10:41 PM:  Silence golden silence and music from the likes of omar a rodriquez lopez then sleep.</p><p>It was fun but I would not do it again. I puked a  total of 6 times allthough it really was more potent then lsd. like I said it was way to much throwing up and bad body feeling also a nice migrane.</p>",
 "year": "2006",
 "id": "51963",
 "gender": "Male",
 "timestamp": "2006-12-11T08:00:00.000Z",
 "views": "7453",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "6 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 4:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "(capsule)"
  }
 }
}
