{
 "id": 52,
 "title": "The Challange",
 "date": {
  "submission": "2013-06-03T07:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Morninggloryseed",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "14 mg",
   "administration": "IM",
   "substance": "2C-C",
   "form": "(liquid)"
  }
 ],
 "report": [
  "3/25/13",
  "Last night I took a challenge dosage of 2C-C. What was the challenge? In 2004 or so, when I was first becoming a daily narcotic user, I unwittingly discovered I could not take psychedelics anymore without also taking a full dosage of opiate-type drug alongside if I wanted to actually enjoy the trip, or I would suffer extreme withdrawal.",
  "So three weeks post ibogaine I decided to challenge the idea I would need opiates to trip by taking the very same psychedelic that all those years ago brought on this notion of tripping with opiates. In 2004, 16mg or so 2C-C (orally) brought on intense withdrawal, requiring oxycodone to relieve it.",
  "To make a long story short, the dose of 2C-C I took (14mg via IM injection) last night did not produce any withdrawal symptoms. When it came on I had to excuse myself, the lights and music were overpowering. I took a shower and meditated, then came out and enjoyed social interactions.",
  "The trip itself was powerful and mentally cleansing. Insanely visual. Nothing like the primary colored visuals I got ibogaine recently. These powerful '2C-like' visual changes were neon-like, everything moving at high speed like a strobe like illuminating dancers. Insane long-lasting visuals from sensory information; I was in the dark and a lighter I flashed light up an area I needed to see for a few seconds after I extinguished the flame! ",
  "The full effects from the IM shot lasted the expected 3 hr, but absent was the 2-3hr come-up of oral administration. The come-up was very intense and I felt it within a minute or two or removing the syringe. Not for the novice, but it was easy to handle when I went to the shower and took away the annoying sensory information (the movie playing in the room). It is different from eating it, and this is not a replacement for the 'intense relaxation' of oral 2C-C...however efficient it may be.",
  "Indeed it seemed I havent tripped in ages like that, maybe tripping with a brain dulled by opiates for a decade made for some stale tripping, because I calculated 14mg to be on the low-side. For those not repulsed my a 'muscle shot', this is a valid and efficient method of taking 2C-C. Maybe 7-10mg next time for social interactions.",
  "I was at a STRONG +++ and I love 2C-C."
 ],
 "erowid": {
  "id": "100383",
  "citation": " Morninggloryseed. \"The Challange: experience with 2C-C (ID 100383)\". Erowid.org. Jun 3, 2013. erowid.org/exp/100383",
  "substance": "2C-C",
  "views": "2003"
 }
}
