{
 "id": 520,
 "title": "Overboard",
 "date": {
  "submission": "2001-12-06T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "moonbeam",
  "gender": "Female",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Diazepam"
  },
  {
   "time": "0",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "DXM"
  }
 ],
 "report": [
  "I had an interesting experience with DXM a few weeks ago.",
  "To give a little background; I'v done pretty extensive eperimentation with psychedelics over the past four years.  I've tried just about all that's out there drug-wise, but the psychedelics were always my drug of choice... I felt that they gave me insight into the world around me and into myself.  Unfortunately I experienced a couple of bad trips on LSD which really shook me and made me very aprehensive about taking my experimentation any further.  I have taken LSD, mushrooms, and ecstasy since the incidents, but very less often and in smaller quantities than before.  So on to my story...",
  "I've heard a lot about DXM, as a member of the rave community most information I received was negative.  Nearly a year ago I purchased some pills which I assumed to be ecstasy, but which turned out, to my dismay, to be DXM.  I kept them, all three, I'm not sure why.  So a few weeks ago I guess I had a breakdown of sorts. ",
  "I'd started the night drinking a few beers with friends.  When I came home after the bar closed I decided to take some valium.  Unfortunately, because of my drunken state I took several... things become blurry at this point.  Somwhere over the course of the evening I found the DXM I had stashed in my drawer and took all of it.  I was embarking on quite a binge.  The experience after this was quite remarkable.  The rest of the night is severely fragmented... at some point I fell asleep.  When I awoke early the next morning I was the star player in the most intense and bewildering trip I've ever experienced.  If not for the excessive amount of sedative in my body I'm sure I would have completely lost it.  I felt as though I were thouroughly drunk, walking was near impossible.  The visuals I was experiencing were very fluid; everything seemed to be melting in and out of itself.  Also, every now and then it seemed that I was looking at the world in freeze frame!  It was as though I was trapped in a surrealist painting (think Salvador Dali) and I was skating around on jello.  The most peculiar part of the experience was that I thought it was utterly hysterical!  A friend stopped by and was alarmed at my condition.  She was so concerned about my well being, but all I could do was laugh at her.  My depth perception was so distorted that I couldn't pick up my cigarette after setting it in the ashtray... not for the life of me!  My friend thought that I had completely lost it.  But, after a good nights sleep I was fine and left with some very interesting memories.",
  "I'm not sure how interesting this will be to all of you... I guess I'll just say DXM is VERY intense and disorienting as well as potentially dangerous.  In fact, considering the amounts of drugs I consumed, I am pretty lucky to be okay after my experience.  I just urge people to be carefull with this one...."
 ],
 "erowid": {
  "id": "11085",
  "citation": " moonbeam. \"Overboard: experience with Alcohol, Diazepam (Valium) & DXM (ID 11085)\". Erowid.org. Dec 6, 2001. erowid.org/exp/11085",
  "substance": "Alcohol, Diazepam (Valium) & DXM",
  "views": "9685"
 }
}
