{
 "title": "Mildly Psychedelic",
 "author": "BlueAries",
 "citation": " BlueAries. \"Mildly Psychedelic: experience with Valerian, Alcohol & Cannabis (ID 52121)\". Erowid.org. Jul 21, 2008. erowid.org/exp/52121",
 "substance": "Valerian, Alcohol & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  "DOSE:",
  "4.0 g",
  "oral",
  "Valerian",
  "(capsule)",
  "",
  "1 glass",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  "",
  "1 cig.",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  "1 cup",
  "oral",
  "Valerian",
  "(tea)"
 ],
 "report": "<p>I have read bits about Valerian being called a psychedelic.  Originally I thought it was just an herbal sleep aid, a mild tranqualizer.  It does work, for some at least.  My mother religiously enjoys her cup of Valerian tea most nights before she goes to bed, I stick to the standardized capsules of ground root material, 250mg each, at 0.8% valerenic acids.  I'm a bit of an herbal geek, and yes Valerian actually does bind to the same receptor sites in your brain as do benzodiazepines, and kava kava too I think, just more so than Valerian.  Somewhere I also read that with higher doses of Valerian slight lines can be seen in the visual field, mild perceptual distortions can occur, this and that, whatnot.  Sounded interesting to play with, certainly safe enough.</p><p>Today was nothing out of the ordinary - I wasn't at work making espresso for stingy people so I decided to relax as any sane 22 year old might in a similar situation.  I slept in pretty late, and once awake and out of the house spent the afternoon driving around my county looking for some San Pedro growing wild to take a specimen. Unfortunately all I could find was prickly pear growing in peoples' yards.  Oh well. </p><p>So there I was at the dinner table earlier this evening with my parents, having just finished my big bowl of soup and a really good salad.  My mom starts preparing her cup of Valerian tea, and I decide to get my bottle of Valerian caps.  I'd like to describe the entertaining look on my parents' faces as I consumed a good portion of my bottle of herbs right there, at the moment I'm just a little too lazy.  Over the course of about ten minutes I swallowed 12 Valerian caps, 250mg each, and washed them down with a beer. </p><p>About an hour later I began to see very slight visual trails very similar to the onset of a psilocybin trip.  The edges of our kitchen counter would glide against the wood floor, streak oh so slightly as to say, welcome to Valerian Land.  It has peaked at this point - three hours later.  I recently ran upstairs to the bathroom to relieve myself, and while standing over that toilet, I kept gazing through the glass into the shower.  The tiles on the wall were actually breathing, just rippling slowly, like someone had poked their finger into that vertical membrane of liquid.  The glass its self warbled a little bit too.  Walking back down to my room everything visually felt fuzzy - like I was in the middle of a big ball of my cat's hair sliding through the house.</p><p>Now as I type this I feel a very content sensation of serenity, with my own cup of Valerian tea now, I think I will go lie down soon.  I actually don't feel sleepy, just like sleep would be effortless.  This evening I consumed a total of 4 grams of standardized Valerian root, 0.8% valerenic acids.  Things certainly are moving slightly, and the best I can compare it to is the onset of or a mild dose of psilocybin.  Actually I almost feel like I'm tripping mildly.  Cool.  Thought is certainly lubricated as well. </p><p>A side note, I take a stack of supplements every morning which may or may not have had an effect on this experience.  It consists of:  3000mg DLPA, 1500mg L-Tyrosine, 300mg Alpha-GPC, 10mg Vinpocetine, 100mg vitamin B6, 300mg L-Arginine, GTF Chromium probiotic mix, not sure of everything in it, and sometimes coffee, but not today.</p>",
 "year": "2006",
 "id": "52121",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-07-21T07:00:00.000Z",
 "views": "49251",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "2": {
   "time": "",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": "",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(tea)"
  }
 }
}
