{
 "title": "Words Hardly Suffice",
 "author": "Mr. Kite",
 "citation": " Mr. Kite. \"Words Hardly Suffice: experience with Oxycodone (Percocet) (ID 52133)\". Erowid.org. Jul 21, 2008. erowid.org/exp/52133",
 "substance": "Oxycodone (Percocet)",
 "bodyweight": "140 lb",
 "report": "<p>Exact Date of Experience: March 21, 2006</p><p>I have never 'popped pills' prior to this experience with Oxycodone. That being said, it goes without saying that I was a little more than anxious when I was preparing the pills. A friend (who has experience with Oxy) said 'It wont kill you, just snort them already!' while I chopped the last pill into a fine powder. Despite these unbelievably comforting words I still felt very edgy.</p><p>3:00pm  3:10 (0 hour)  Two and a half 10/325 Percocet pills (Watson 932) were crushed and consumed orally within a fifteen minute time gap. (Thats approximately 25mg Oxycodone and 812.5mg Acetaminophen.)</p><p>3:50 (+ 40m)  I worried that the dosage might have been too little for anything to happen. Ironically, just as I began to dread the waste of some good pills the euphoria set in.</p><p>4:20 (+ 1hr 10m)  A very pleasant sensation engulfed my entire being. My mind was clear and my body was soothed. Strangely, I feel motivated to write, so I begin work on a research paper on Franz Kafka. All goes remarkably well; I have written a page or so in a short time!</p><p>5:00 (+1hr 50min)  I am still feeling great; though walking has become a chore. By now I am unable to do much work on the paper so I begin to talk to some friends. I feel more confident than usual, being very open to distant acquaintances. I remember the experience quite vividly, as it was a sensation I had never felt before. Within a short time, I begin to feel the itching sensation. It is not irritating or bothersome, it is almost as though it is there as a mechanism to further the fuzzy feeling present on the skin.</p><p>5:30 (+2hr 20min) - The high is not overpowering, possibly due to the dosage, but the effects are still moving and seem to come in waves. In retrospect, I consider the peak to have occurred at this time. A strong contentedness is the best way to describe the sensation. Friends have compared it from 'a three hour hug' to 'sinking in a leather recliner.' For me, it was like being wrapped in a warm blanket. The neat part about this high is the lack of optical impairment. I perceive things in detail, though by now my eyes have shunned bright lights. Drunk with placatory exuberance, I remember speaking to a female friend on the phone  who had nothing of importance to say, really  and being in tears simply at the sound of her voice. On a side note: it was somewhat difficult urinating. </p><p>6:00 (+2hr 50min)  The first negative effects creep in: a light sickness along with overpowering exhaustion. I feel like I might have to vomit so I decide to lie down. At first I try watching television, but the light and motion only seem to bring about more nausea. I decide to turn off the TV and wrap myself in a blanket. With the warm, embracing sensation still present, I begin to forget about the stomach pain and focus on how brilliantly comfortable the bed is. I suppose I can draw a comparison to the sickness in that it is very much like acute motion sickness. Not so much disabling, but irksome nonetheless.</p><p>6:30 (+3hr 20min)  The nausea and disorientation subside after a short rest in bed. By now I succumb to the fatigue and nap. None of the sensations return after I awake.</p><p>Conclusion: I think 25mg was the perfect amount to take, looking back. I probably would have become too sick to enjoy the experience by the end had I taken any more. I did not crave the drug the next day, though I did have diarrhea that may or may not have been as a result of the drug.</p>",
 "year": "2006",
 "id": "52133",
 "gender": "Male",
 "timestamp": "2008-07-21T07:00:00.000Z",
 "views": "83471",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  }
 }
}
