{
 "title": "Wherein I Became God of all I Perceived",
 "author": "Jitterbug",
 "citation": " Jitterbug. \"Wherein I Became God of all I Perceived: experience with LSD (ID 52130)\". Erowid.org. Sep 14, 2008. erowid.org/exp/52130",
 "substance": "LSD",
 "bodyweight": "185 lb",
 "report": "<p>I think back to the last trip. I've thought about it during work, at the slow times.</p><p>I remember. real vivid. it was my third encounter with Lucy, and my second two hit trip, at a party with good friends.</p><p>I dropped my doses as soon as they came to me. a grin spread across my face when as my mouth slowly started to taste metallic.</p><p>the second hour or two was a rush of good music and visuals. the light patterns, the buzz, the body buzz, the feeling of unity in the room, all those fun acid party grooves. the kids, trippers all, had a set of glowsticks, a fog machine, spinny fan lights that created patterns while spinning, a computer with wacked out visualizations, and some high powered lasers. visuals were proivded en masse.</p><p>if you haven't tried it, a cool thing to do is to get one of those spinning color globes, and setting it on the ground next to a fog machine. kick the fog machine on, and you have a wonderland of lights.</p><p>my friends say I trip like they wish they could, that I'm a 'classic trippy kid'.</p><p>I guess I'm lucky.</p><p>the trip came about then, as I sat in the sitting area of the living room. the disassociation of reality, the feeling that nothing is as it should be, but lucy's sweet demeanor calms me and assures me that all is fine - I'm simply creating reality again. for the record, I love that my head does what it does, whatever it's doing when I trip. me seems so complex and large.</p><p>I start laughing like a loon, as I do whenever acid kicks in. because, yanno, I'm god again. being god is awesome, by the way.</p><p>I came to myself staring into infinity in the mirror. I was using my nose as a point of rotation, looking through all edges of the mirror as I kept my eyes as close to the mirror as possible. this is about when the party concluded that I was tripping balls.</p><p>I found myself sitting on the stair landing, next to the inside corner of the wall. I had arms on the wall as if I was holding onto it for dear life. my friend walked by me, presumably on the way to the bathroom. she simply smiled and encouraged me to become one with the wall - which is what I was doing, not that I had noticed, being too concerned with trying to find the inside of the wall with my eyes.</p><p>the real mindtrip came later. it started when I sat down on the stairs, staring into the mirror again. I'd done it when I first started getting patterns. the world shimmered, much like one of those rotating billboards mid-spin - the world around me flipped. all around me seemed as if it had been changed, if just slightly - the wallpaper differed, the shag carpet was of different length, the paintings and pictures had swapped. mind that EVERYTHING was different, if just slightly. colors, shadows, lighting, tint. I stood up, feeling entirely alone in the house - it seemed like no music was going, lighting was minimal.</p><p>the house seemed empty, a little dark. I stepped off the stairs, onto the ground, walked past the door, to the piano - behind the couch. as soon as I stepped in, I noticed a large swarm? - I guess - of energy sitting in the living area where all my friends were. the room was humid, actually. I could see a jungle-like fog all around, low to the ground, brushing against the ceiling, coating the walls slightly, hovering in air, obscuring the room.</p><p>when I moved towards the sitting area, a large prehistoric looking insect buzzed towards me. all round, it was probably basketball sized. it was a very odd looking creature. it moved gracefully, much like a butterfly, but looked like a hornet. flew the same way, it just didn't have a stinger, so the lower part of it's body hung down a little more, so it came across as very non-threatening. looked like a dinosaur though. reallly cool stuff.</p><p>the entire time I'm walking around, by the way, I have the ODDEST FEELING that I'm actually sitting down in a comfy chair- like, that's the part of my body telling me it's currently sitting down - my back feels like I'm sitting back in a chair, slightly leaned over. my legs feel like they're sitting in a chair, coming down, my shoes pushed into the carpet, as my forearms feel like they are being pressed against my legs. my shoulders are pressing down on my arms, and my head is leaned over.</p><p>however, my eyes are telling me I'm standing in this nearly empty and very different room. I can nearly see myself in third person as I see through the first person, and I'm in the room. but again, I'm feeling like I'm sitting down, surrounded by a buzz of happiness.</p><p>I felt as though I were really two people, experiencing the sensory input from the me who was walking around the room, but I got the physical, aural and emotional sensory input from a me I felt was in another room, sitting down. occasionally, the feeling of a hand draped around my shoulder was there, even once a feeling of someone playing with my hair.</p><p>I'll just let you believe that walking around with these feelings is an odd experience. moving your knee forward to walk while your body tells you that you're sitting stationary with an elbow resting on your knee is an experience in and of itself.</p><p>by the way, I'm currently having flashbacks visually. I like describing trip stuff, it makes me get visuals.</p><p>anywho, I feel like my head is moving, like I'm laughing softly about something. I can hear this noise around my head, like other people are laughing. happy talk. it was pleasant.</p><p>but I'm walking over to the couches. I step near the back of the first couch, look down into the corner where the fog machine was, and the energy in that part of the room backs away, and in it's place is a set of friends, who are sitting, having conversation as if at any point of the night. I joined in, then stepped past the couch, the foggy energy had gone, and everyone was in their place again. I felt like I had stepped into a part of the party.</p><p>which is actually much like my second trip, on memory. in that trip, I spent the entire deep trip part of the trip moving from one time in the party to the next, finding that turning my head caused the room to rearrange itself as if time had elapsed. people had changed subjects, switched places, changed what they were doing, all in the space of time of me turning my head.</p><p>this only happened once this trip, though. I joined a conversation at the table before retreating back to the stairs. I think it was when another tripping girl passed me to use the bathroom - just as she had when I first sat down - that I opened my eyes, and was back to the place before the change in 'part'.</p><p>the rest was standard trippy stuff, barring me having part of a  'bad trip'. it happened when people decided to take a car ride. I wasn't allowed to go, for lack of space in the car. so I was left alone at an unfamiliar house. I wandered into the backyard where I watched the sky melt as I chain smoked a few cigarettes. this was when the sky was still dark, the moon lighting the sky and clouds, providing a feast for the eyes.</p><p>suddenly, I distinctly heard a cop car flash it's siren, as they do when they pull up and want to suprise people. as my attention came back to earth, I looked to the house - I was some ten or fifteen feet from the backdoor, and the front of the house was GLOWING with the combined hues of floodlights and police flashers.</p><p>a look behind me, where there was a fence, reveals that there is now a large downtown-urban building there. I was reminded of my time in Oakland, California, the building was of a similar design to ones I had lived near downtown there. there was a row of them, and I was next to an alley.</p><p>mind you that I was attending a party in the midwest, the suburbs. there is no building taller then a few stories for miles. I wasn't aware of this at the time.</p><p>on one side, I had the house. I could see inside, shadows in the windows, the careful, practiced movements of a SWAT Team, waking up passed out kids.</p><p>on the other? an alley with a soft glow at the end of it. the glow had no color, it seemed to be every pleasing color at once. I moved towards it, determined to make my way home arrest-free, despite not knowing quite where home was. I happened to have my coat on, which contained my wallet, cell phone, watch, camera, lighter, pipe, the rest of my pot, and my cigarettes. I was set.</p><p>and then I walked to the nearest intersection, hoping to find a street name I recognized. I found myself at an intersection, and the world got a LOT darker. it was much like one of those comics where the person in distress walks to the intersection and can't see past it. in this case, only the intersection was lit, none of the rest of the world seemed to be.</p><p>the street signs were no help. each time I looked at one, it's name seemed liquid - never settling. one minute redwood, the next birch, for example. turning back to find the alley I'd come from, I found myself looking back at a row of suburban homes. the alley I'd come from was gone, the looming apartment buildings gone. I dropped to my knees, realizing that I needed help, that I'd never get home in this state, and that I was utterly alone.</p><p>I got up, deciding to smoke a cigarette while I tried to settle down. I heard my name called, and I turned my head. a friend was there, and the same pleasant glow was around him. I turned, and as if a light switch had been flipped, the world around me brightened. the streets became defined, the signs regained focus, and the world beyond the intersection became lit again.</p><p>I was lead back to the house. I apologized for any inconvenience I'd caused. we walked through the yard of one house, jumped a fence, and we were back in the backyard of the house the party was at. as I'd felt deep down, there were no cops. just friends that came back from their car ride. I'd just freaked. they asked why I felt the need to jump the fence, but I hadn't remembered doing so - just walking down the alley next to the now-vanished apartment building. I was hugged, held, and calmed down. I didn't try to explain what I'd been through, because I wasn't then ready. I was in no mind to remember what I'd thought happened.</p><p>eventually, as we listened to Mindless Self Indulgence, I came down, and was driven home. I walked up to mcdonalds, had some chicken nuggets and a cherry coke, then walked home and passed out.</p><p>good stuff.</p>",
 "year": "2006",
 "id": "52130",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-14T07:00:00.000Z",
 "views": "3854",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD"
  }
 }
}
