{
 "id": 5214,
 "title": "Nutmeg is Boring",
 "date": {
  "submission": "2001-12-22T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "DKLL",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 Tbsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Buying the stuff was easy. Any health food store should have it. The place we went to didn't have any in stock at that time, so they said they'd get some for the next day. We bought some neat-o flavored teas at the same time just to make the experience that much more pleasant. When we came back to get the nutmeg, it was in little pouches with maybe an ounce each. We decided to do one dose per bag. It was $1.99 each. Not bad for what is suppossed to be a 56 hour high. The woman at the store started asking what we needed so much nutmeg for, and she believed us when we said we were making 'An insane huge batch of eggnog. For, like, a hundred people.' Then we started giggling as we left the store.",
  "11:00 AM: Dose taken. 3 tablespoons and a bit. Goes down easy with a sip of water. It doesn't taste nearly as bad as people think it does. It's not pleasant, but not a problem. Water is necessary. Just put maybe half a teaspoon's worth in your mouth and gush it around with a sip of water and swallow. Quite simple.",
  "11:30 AM: We decided to write out this timeline for the benefit of other weirdos like us trying this thing. No effect yet. We'll just have to wait it out. Hey, let's go play some pool.",
  "1:40 PM: After some hearty lasagna for lunch, we played some more pool. Gradually I'm starting to feel kinda stoned, but it could be psychosomatic, so I'll just wait and see if I start hallucinating. My friend was having difficulty communicating coherently with the fellows he was playing pool with, but that is not at all uncommon. 'I have six balls left. The six, seven, nine and ten.' 'Last time I checked, that was four balls.' 'Oh right.' So we're feeling sort of relaxed here.",
  "2:45 PM: Definitely feeling lightheaded. Quite relaxed. Still waiting for some more interesting feelings to start.",
  "5:40 PM: Still basically nothing. I'm starting to think we should have gotten fresher nutmeg or maybe 'Nutmeg' is just a codeword people use on the internet to embarass people like me. But some have claimed it takes quite a long time to do anything, so I'll just be patient.",
  "8:00 PM: I'm pretty strongly convinced that nothing of interest is going to happen tonight due to the nutmeg. No matter, I'll go out and get hammered.",
  "12:30 AM: Well, the cops came and shut down the party i was going to 5 minutes after I got there, so looks like I'm gonna be sober tonight. boo urnz. This shit fucking sucks.  The stoned, pot-like buzz has worn off completely, and I doubt that any closed eye hallucinations are going to happen.  Fuck you nutmeg.",
  "EPILOGUE:",
  "All in all, the nutmeg was pretty weak.  We were ever so slighty stoned for about 5 or 6 hours.  No hallucinations, no stomach cramps, no hangover.  I think it was shitty for 2 reasons.  First off, we didn't take as much as we should have.  I think our tablespoons should have been more heaping.  Secondly, our nutmeg had been purchased, pre-ground, on Tuesday (we dosed on Saturday). That means that the shit was lying around in the store, ground up, for at least a couple of days, (not to mention in our room for 5 days).  By the time we dosed, it had probably lost a fair bit of potency.  Oh well, we might try it again some weekend, but for now I'll stick to some real drugs."
 ],
 "erowid": {
  "id": "3161",
  "citation": " DKLL. \"Nutmeg is Boring: experience with Nutmeg (ID 3161)\". Erowid.org. Dec 22, 2001. erowid.org/exp/3161",
  "substance": "Nutmeg",
  "views": "6274"
 }
}
