{
 "title": "Thought I'd Made It, But Was Wrong",
 "author": "Eye",
 "citation": " Eye. \"Thought I'd Made It, But Was Wrong: experience with Cannabis (ID 5215)\". Erowid.org. Mar 4, 2001. erowid.org/exp/5215",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "report": "<p>First tried weed my last year of college, and believed after my first experience, which had been amazing, cathartic, and joyful, that life was going to be good thereafter.  Prior to that first time smoking weed, the only other drug I'd used was alcohol.  I decided to try weed on a whim, out of an almost self-destructive lack of care for the possible consequences, which at the time I imagined could be dire. </p><p>That first experience was by far the best one.  I broke through several emotional barriers, or rather the weed forced me through them kicking and screaming.  I emerged from the experience feeling renewed, free, happy, curious about the world, and confident that I could never backslide into the depression that had been home for most of my life.  Gradually, I did forget how to think in those ways that felt good, I did re-settle into my old ways.  I have given up on achieving happiness through anything but hard self-analysis and conscious behavioral changes. </p><p>Incidentally, the repressed pain that I thought I had exorcised that one night, I later had to exorcise for real, while sober.  It is as Lawrence LeShan wrote about psychedelic drugs:  they transported me to the mountaintop for a brief stay, but to be able to live there, I have to make the trek on foot.  What has been of lasting benefit is the memory of how good life can feel, when one's heart is well.  Without that knowledge, I wouldn't know to try to change. </p><p>Peace to you all.</p>",
 "year": "2000",
 "id": "5215",
 "gender": "Male",
 "timestamp": "2001-03-04T08:00:00.000Z",
 "views": "37228",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
