{
 "id": 5220,
 "title": "A Trip Like Never Before",
 "date": {
  "submission": "2008-02-29T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Butch",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "oral",
   "substance": "2C-I",
   "form": "capsule"
  }
 ],
 "report": [
  "THe day began as usual with my bestfriend calling me at around 11:30 am. He told me that the 'stuff' had arrived and would be here in about an hour. The stuff of course was 2-Ci and the trip will be one that I will never forget.",
  "I ate a small breakfast because I was told by my two buyers that it was best to be done on an empty or nearly empty stomach. Anyway I got to my friend's an hour later and watched tv until the 'providers' showed up. Into his house arrrived our dealer 'nemo' ,our friend 'bright eyes' and their two girlfriends. The two guys (nemo and bright eyes) and done 2-CI before, but me, my bestfriend, and the two girls were all virgins to its intoxicating effects.",
  "We took our geltablets around 1:30, and waited for the effects to take us on. I played monopoly until my concentration was unable to handle it and had to give up. we watched some more tv until about 3:00. When the two girls started to freak out and laugh uncontrolablly, we knew it was time to get out of there. Now I was feeling a little nausea and gitty at the time, which is how I usually feel with pot or any other type of substance. So we left my friends house to take a walk in the woods.",
  "So far everything seemed pretty normal. I was unable to control my laughter, and the sight of shiny or interesting things kept me entertained for way longer then they should have. We walked through the woods and up to a cemetary where there was a huge grass field.",
  "There nemo took us and sat us down. He told us that everything would start to feel 'real' and that a lot of things would become more interesting as we peaked. So I walked down to the edge of the field and found some paintballs that were sitting on the ground. I picked up a red one and stared at it for at least five minutes. The colors played with my mind and the soft textures played with my skin. I became one with the paint ball. I held it in my hand for awhile until I was told to 'let it go' Everything that day seemed to shout 'let it go'. After talking to the guys for a little bit I was told that it is best to find yourself in this high, so I did.",
  "I departed from my friends telling them to find me later. I went and sat in the field completley alone. The next thing that happened was amazing. I watched as the trees seemed to melt into the ground and the world rose up over them. I didn't think this was happening so I closed my eyes and looked at a different set of trees. The same thing happened and I decided to just go with it. I could feel my hair blowing across my face and it felt wonderful. In fact everything felt wondreful. I looked at the shadows at the trees and thought that they were receeding with the setting sun. However when i looked again they were in the same spot in which they began.",
  "This went on for about 10 min. Finally I decided to make the shadows do something. They soon molded into a dragon and kept on shapshifting. i stuck my finger out and moved the designs around into a different pattern. It was the most amazing thing i had ever witnessed. Up until that point I had only smoked pot, and it did not compare. With pot I felt stupid, with 2-Ci i felt like I had found the meaning to life. So with my new found knowledge and new found intoxicant I went home, and had some dinner.",
  "Food never tasted so good in my life. I could savor everything and love every morsel I took into my mouth. The whole experience left me with an appreciation for nature, food, and basically anything that looked or felt cool. In one retrospective everything felt movie-esque, but woulnd't look or feel the same if seen on the big screen."
 ],
 "erowid": {
  "id": "31625",
  "citation": " Butch. \"A Trip Like Never Before: experience with 2C-I (ID 31625)\". Erowid.org. Feb 29, 2008. erowid.org/exp/31625",
  "substance": "2C-I",
  "views": "2776"
 }
}
