{
 "title": "Severe Abuse",
 "author": "Mdmaxtc",
 "citation": " Mdmaxtc. \"Severe Abuse: experience with Clonazepam (Rivotril) (ID 52228)\". Erowid.org. May 9, 2008. erowid.org/exp/52228",
 "substance": "Clonazepam (Rivotril)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Pharms - Clonazepam",
   "(daily)"
  ]
 ],
 "report": "<p>When in my freshmen year of college I found a way to obtain many benzodiazepines for .20$ a mg, I began to obtain very large quantities of rivotril (1000-1500MG) on a weekly basis. After about a year of this, I had become addicted and was taking large quantities, the largest I have ever heard of. By the end of my use I was up to 20MG-30MG a day. When I finally went to a rehabilitation centre, my doctor did not initially believe me.</p><p>I initially was taking doses of 1-2MG for desired affects. As this went on for years, my doses increased to 20-30MG. These doses were unheard of by anyone I have ever experienced. With the large doses came extremely harsh side effects. I had a feeling of my extremities 'going to sleep' at almost all times, severe problems sleeping, agitation at all times.</p><p>At the first doses I noticed a great loss of inhibition, drowsiness, muscle relaxation, increased aggitation and anger especialy when combined with alcohol, prolonged sleep periods. The effects were almost identical to alprazolam/xanax except the increased anger and agitation. Many of my friends noticed this as one of the more undesireable affects of the drug. I have also experienced and increase in prolonged affects, such as depressed feelings for 24-48 hours.</p><p>Detoxing and life after this large abuse are difficult. I have very poor circulation and the same loss of feeling in the extremities when my heart rate is increased.</p><p>I felt it was important to share this experience as I feel it is very unique and a good information source for people who feel benzos are a safer alternative to other drugs, as I thought. I feel long-term negative results of this prolonged and large addiction to a benzodiazepines.</p>",
 "year": "2003",
 "id": "52228",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-05-09T07:00:00.000Z",
 "views": "18692",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(daily)"
  }
 ]
}
