{
 "title": "First Dance with the Lady in the White Dress",
 "author": "JayBone",
 "citation": " JayBone. \"First Dance with the Lady in the White Dress: experience with Cocaine & Cannabis (ID 52224)\". Erowid.org. Oct 2, 2007. erowid.org/exp/52224",
 "substance": "Cocaine & Cannabis",
 "bodyweight": "180 lb",
 "report": "<p>For the preceding year or so I had been very fascinated w/ cocaine.  After seeing movies like 'Blow' and 'scarface' I was interested in the rush those people seemed to be feeling.  For the previous few weeks a couple of my close friends began dabbling in cocaine.</p><p>On friday in spanish class, my friend M told me that she wanted to try to score some coke this weekend, and I told her I could try to hook it up.  M had never done the drug before so we agreed to both try it for our first time together.  Saturday night I was smoking a joint with some friends at a park near our homes, and M drove up with her friend K.  M and I began talking about trying to get our hands on some coke, and my friend T told us he could get it.  T had done coke for the first time a few days prior and really liked it.  He called a friend of his and we bought a gram. </p><p>That night I snuck out with M and T, we went to a friends house where K and some guys we didn't know were hanging out.  We broke up the coke and cut a few lines.  T did the first while we all numbed up.  I did the second, and was surprised at how easy it went in.  I could feel my throat and nose tingling, and bordering on numbness.  After everyone else did a line I decided to cut just one more.  I blew another line and was still not feeling the 'rush' that I was seeking.  I went outside for a cigarette and this was when I really started to feel the cocaine's affects, but I was still not impressed. I told myself that coke was not worth it and that I did not want to do any more. </p><p>As I came back downstairs M was cutting a few more lines and she offered me one.  As much as I did not see the point in doing one more, I felt compelled to snort just one more.  I snorted it, and a few minutes later I started to feel pretty pumped up.  After we all chilled and talked for a while, I found myself sitting next to the table where the remainder of the coke was sitting.  Without even thinking about it I began cutting another line and snorting it.  After this fourth line I began to feel really high.  I was more affectionate but at the same time indifferent.  I felt like there was nothing that could get me down. </p><p>After finishing off the bag, we decided to head over to a friends house whose parents were away, because some of our friends were staying the night.  As I walked into the house I saw my good friend A and another friend A2.  A, being an experienced coke user, was interested in hearing how I liked the new experience, and how much I did.  I don't remember much of this conversation, because I was too concerned over whether the house we were at had a trampoline or not.  I sat down at a table with A, T, A2, M, and K where A was rolling a blunt, and we were passing a bowl around the table.  Once the pot kicked in I really started to feel the extreme effects of the coke.</p><p>As we proceeded to spark the blunt in the kitchen, I began to feel very drowzy, and had the strong urge to do another line.  This feeling mixed with the weed high was more enjoyable than I would expect a coke comedown to be.  I almost felt drunk or like I was on DXM.  A, A2 and I began cracking jokes on one drunk jackass from another town who had been pissing us off all night.  We were tricking him into saying things that made him sound like he was interested in same sex relations, and moreover began blatantly insulting him to his face.  I remember finding this insanely funny and everyone cracking up over the reactions of this dipshit.</p><p>After deciding that we couldn't bare having this kid around anymore, we drove him to his brothers appartment, and drove back to the house we were at before, where A was rolling a joint.  We smoked the joint and I began to feel very stoned.  I felt like I had been up for days smoking pot, almost like I would never sleep again.  The ever present urge to do another line was really starting to get to me, and I began to realize how people got addicted. </p><p>Around 4:45 AM I decided I needed to go home and try to chill out.   I came home and layed down, taking in all my mixed feelings about the night.  I was not even that impressed with coke, but at the same time had the urge to do more.  I tried to sleep but ended up laying in bed and pacing around my room until 6:30 when I finally crashed out.  I slept until about 9:45 and felt burned out when I woke up.  I smoked a few bowls with friends that day but the burned out coke feeling was still present.  Now it is about 5:45, and I feel very drowsy.</p><p>Basically the only way to sum this experience up would be with the wise words of Rick James,  'Cocaine is a hell of a drug'</p>",
 "year": "2006",
 "id": "52224",
 "gender": "Male",
 "timestamp": "2007-10-02T07:00:00.000Z",
 "views": "11980",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "250 mg",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "3.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
