{
 "title": "Oh No! Not U Again",
 "author": "No Fear",
 "citation": " No Fear. \"Oh No! Not U Again: experience with Cocaine (ID 5224)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5224",
 "substance": "Cocaine",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "insufflated",
  "Cocaine",
  "(powder / crystals)"
 ],
 "report": "<p>I tried coke for the first time about mid 1999. There was a group of us going clubbing and someone got some, knowing it was coming had given some of us non users(at the time!) a buzz just from anticipation. We had been smoking grass on and off for years, but this was something different, something just that little bit naughty. Anyway we tried it, got this amazing feeling, like really being alive, every one of my senses felt like I was using them for the first time. Totally amazing. Didn't do any for a while and then it gradually became more regular. Now although we all say we are giving it(again!!) We say we will only have it for special occasions, but soon anything gets called an occasion.</p><p>Once I know one of use has some I can't resist trying to have a bit of it, I tell myself I will not have any, but I just cant help myself. This little voice in my head says 'Go on, you can handle it!, just one line, you will be fine!!', but as you know once the first line is snorted you can't stop until its all gone and you can't get any more (and you will try every source possible to get some more). You know how you are going to feel when you are on it (amazing) and you you how you will feel as you come off it (wishing you hadn't had it), but that doesn't really matter because you tell yourself its the last time, next time you will say no!</p><p>But next time you tell yourself the same thing. Its not that its bad, well we can all think of worse things than a line of coke (if we put our minds to it!), its that you know you will never really kick it completely, that voice will always be there, when you least expect it, it will say to you ' get a line of coke down you and you know your confidence is going to be 200% and you can do anything!' You can tell from the rambling that I am on it while I'm typing this, its amazing stuff, and I have had so many amazing thoughts tonight I just wish I could have the same amazing thoughts without the coke.</p><p>So the big question is..... which is the real me? The one who is clean of drugs and has a responsible job and gets things done, or the one on the coke with his mind travelling at 1000 miles an hour having the most amazing thoughts and ideas but is pretty well out of it. You decide, I can't. I like both. I don't know why I am typing this, but its good to talk, even though it's a one way conversation. Thanks for listening.</p>",
 "year": "2001",
 "id": "5224",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-11T08:00:00.000Z",
 "views": "14513",
 "dose": {}
}
