{
 "title": "Sex and Sudoku",
 "author": "Woodentop",
 "citation": " Woodentop. \"Sex and Sudoku: experience with Salvia divinorum (10x extract) (ID 52255)\". Erowid.org. Oct 27, 2006. erowid.org/exp/52255",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "smoked",
  "Salvia divinorum",
  "(extract - 10x)"
 ],
 "report": "<p>Having recently attained my half century, I made an educated decision to revisit one recreational substance from my younger days (Cannabis). Fortunately, I am able to travel frequently to Europe, and so can enjoy this substance in a legal setting. Three things I like about Cannabis are (1) it is relatively safe, (2) the experience is pleasant, and (3) it has the same rejuvenating effect on me as Viagra, possibly with less risk. On the negative side, I feel terrible the next morning, and cannot get rid of the smell.</p><p>However, I live (mostly) in the US, and my 'partner', who is in her 20s, is not able to travel with me. Therefore, I have been looking for a legal alternative for use here.</p><p>My research on Salvia was limited entirely to online websites, which provided a wealth of information, and reported a range of experiences from 'no effect' to 'nightmare trip'. I decided that smoking fortified leaves was the best option, and got 1 gm of '10X' flaked leaves in a purple container from a local pipe store, together with an ordinary glass pipe and a butane 'torch' type cigar lighter. The entire kit cost less than $50, and promised about ten smokes.</p><p>I heeded the 'horror stories' reported online, and asked my friend to be a sober 'sitter' for my first experience. She arrived from work at midnight completely exhausted, but set about her task with enthusiasm. In at least one report, it had been suggested that the smoker may try to lurch around the room, and risk injury. Weighing only 95 lbs, she suggested a delightful method of ensuring that I remained safe if this were to happen, and took her position as 'sitter' literally, as she started to engage in our more regular nocturnal activities. Needless to say, I was in a superb mood at that time, though slightly apprehensive about the effects of the Salvia Divinorum.</p><p>She then filled the pipe with about one tenth of the contents of the box of 1 gram 10X fortified leaves, held the pipe to my mouth and ignited the leaves with the searing flame from the butane lighter. I took a deep hit, and she encouraged me to hold it in for a few seconds. I exhaled a large cloud of smoke. Then she gave me the pipe again, but I started to cough as I took the second hit, and exhaled almost immediately.</p><p>My face must have conveyed nothing, because she said 'You're feeling nothing, aren't you?' I was in fact feeling more wonderful than I had ever felt before in my life. It took me a few seconds to summon the words to tell her so. I 'heard' an amused giggle in my mind, and watched my friend's already beautiful skin change in texture to that of a china doll. I also felt a slight 'twisting' sensation, which I had heard reported before, but I simply asked my friend to adjust her position slightly, and the feeling was replaced by one of tremendous warmth and comfort. I realised that while most of my body was feeling limp, another part of me was feeling even better than it did on Cannabis, and to cap it all, I felt the most incredible sense of 'oneness' with my friend.</p><p>I also sensed the presence of an old man, who had giggled earlier. He said nothing, but I sensed that he was giving my mind the gift of his experience. I felt as though my friend and I had been transported to a place of peace, tranquility and blissful happiness, where everything was exactly as it should be, and yet I also knew I was safe in bed with my friend there to take care of me. At that time, the most amazing feeling of gratitude to my friend came over me, and I knew that I would willingly do ANYTHING for her. (What I was able to do for her happened no less than three times in the space of ten minutes.)</p><p>By this time, I was already 'coming down' from my experience. I was a little dizzy, and could not stop smiling! I thanked my friend for everything she had done, and told her that she was the only person I could have trusted to help me if anything had gone wrong. I then shared my experiences with her, and she reacted by saying 'When can we do this again?' ... to which I immediately answered 'This is so special that we should only do this very occasionally.'</p><p>I did not feel like sleeping after this, and got 'the munchies'. After a bowl of corn flakes, I felt sated (although my stomach was very slightly unsettled), and decided to perform a mental test upon myself: I reached for a book of Sudoku puzzles. I found myself rattling through a 'medium' grade puzzle at much my normal rate, when suddenly I heard the old man's voice: 'Are you gaining anything from doing these puzzles?' he said. I then put the puzzle down and fell asleep.</p><p>In the morning, I felt a little tired, but this was consistent with only getting five hours' sleep. At breakfast time, I reached for the newspaper and its Sudoku puzzle, and discovered that, try as I might, I did not have the patience to finish it. I also felt slightly 'hung over', although the feeling was not as bad as I have normally experienced from either Cannabis or alcohol.</p><p>It is nothing like Cannabis. For me, it seems to have opened (and maybe shut) one or two doors in my mind; this makes me cautious about its re-use. When I smoke Cannabis, I want to do so again the next day: with Salvia, I have no hint of an addictive feeling; however, the 'trip' was so fabulous that I will certainly try it again.</p>",
 "year": "2006",
 "id": "52255",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-10-27T07:00:00.000Z",
 "views": "7204",
 "dose": {}
}
