{
 "title": "A Good Withdrawal Treatment",
 "author": "Handsome Rob",
 "citation": " Handsome Rob. \"A Good Withdrawal Treatment: experience with Tramadol (ID 52274)\". Erowid.org. Jun 27, 2007. erowid.org/exp/52274",
 "substance": "Tramadol",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "SSRIs",
  "(daily)",
  "",
  " repeated",
  "oral",
  "Pharms - Tramadol",
  "(daily)"
 ],
 "report": "<p>[Erowid Warning: There are case reports of people having bad reactions when mixing tramadol with SSRIs. This may include potentially life-threatening adverse reactions such as serotonin syndrome. See Tramadol Health Concerns]</p><p>I have always been into drugs of all sorts.  For the last year and a half or so I have been using oxycontin quite heavily on a daily basis.  I started off with about 20mg doses and currently have been doing 80-240mg, depending on my funds and availability.  I have tried quitting a few times with little success (11 days clean is my record).  I get pretty ill after about 18 hours without a dose. </p><p>About two months ago I sprained my ankle pretty bad at work and having an oxycontin abuse treatment referral on my medical history I was not able to get a script for anything but Motrin or naproxen.  After two days in pretty severe pain my doctor gave in and gave me a script for sixty 50mg tramadol tablets.  This was just in time because a I could not find any oxy's for the last day and a half.  I got my script and immediately popped 4 pills (200mg). </p><p>After about 10 minutes I popped another 3 (150mg), just from being dope sick and impatient.  Within about 25 minutes the damndest thing happened, I felt great.  There was no high or euphoria but my aches and pains were gone, the sweats had subsided and my energy was coming back.  I couldn't believe how great these were for opiate withdrawal.  I never got any sort of high from these things.</p><p>For two weeks now I have been oxy clean and have tramadol to thank.  I'm not too worried about kicking tramadol because it is so much weaker and easier to ween off of. </p><p>Warning-I do take an SSRI and at higher doses (600mg+), I have gotten light headed and sort of flush, almost like taking poppers.</p>",
 "year": "2006",
 "id": "52274",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-27T07:00:00.000Z",
 "views": "15430",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "SSRIs",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(daily)"
  }
 }
}
