{
 "id": 5229,
 "title": "A Bad Idea",
 "date": {
  "submission": "2007-01-12T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "DevilDoc",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(seeds)"
  },
  {
   "time": " T+ 0:00",
   "amount": "4 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  },
  {
   "time": " T+ 0:30",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(seeds)"
  },
  {
   "time": " T+ 0:30",
   "amount": "4 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  },
  {
   "time": " T+ 0:30",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "5-MeO-DPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I promised myself I would never submit a post-post-trip report (one long after the trip itself), but after reading the post Admenuem about an experience with Syrian Rue, Mushrooms & 5-MeO-DMT, I had to submit this.",
  "About two years ago I had in my possession Syrian Rue, HBWR seeds & 5-MeO-DPT. I had tried 5g Syrian Rue and 25mg 5-meo-dpt on a prior occasion with little to no effects, and also the HBWR with no appreciable effects at all. So on one lonesome Saturday night, at about 9pm, I decided (for no reason at all) to try all three together. I ground up 10g Serian Rue and 8 HBWR seeds. I divided both into 2 equal parts, and put them into capsules. I also put 25mg 5-meo-dpt into its own cap. I downed the equivalent of 5g Syrian Rue and 4 HBWR seeds on an empty stomach, and the rest (another 5g Syrian Rue, 4 HBWR seeds, and 25mg 5-meo-dpt) 30 minutes later. I waited and about 15 minutes after the second ingestion I started to feel 'something'.",
  "It came on in subtle waves at first, but within 30 min of starting to feel the effects (1 1/4 hours after swallowing the first capsule) I knew something was horribly wrong. Now I have had my share of experiences before - everything ranging from weed, alcohol, DXM and Nitrous to mushrooms, tryptamines, phens and the mother of all entheogens... Salvia. And yes, I do consider Salvia to be, in my opinion, the most extreme drug, regardless of its legal availability here in the states. This, while not as extreme as Salvia, was the most profound experience of my life... if only I could remember it.",
  "MY salvia experiences were the most important of my life, but this experience was the most profound. If only I had retained memory of it, it probably would have been infinitely important. What I do remember is weird and enticing, but the physical and post-trip consequences sucked!",
  "I came to, who knows when, lying on my bed making 'WHAAA, WHAAA, WHAAA, WHAAA' sounds, with my head spinning out of control, and I remember making those sounds for at least a minute (who knows how long I made them while out of it), and then it hit me - almost literally. I felt as though I got hit in the head as I made, what seemed then, as the most important realization of all time... the meaning of life. I won't go into the thought, as it was subjective and most probably not a valid conclusion (not to mention that I don't remember it at all, such a shame). But I can still feel how important the realization felt to me.",
  "Next thing I know it's the next morning, and I'm still in bed. My room is in shambles - almost like there was a wild animal set loose on it while I was asleep. Just about all my furniture is turned over, and anything else out in the open was broken or strewn about. Oh, and I guess at some point my body decided to purge the poisons, and to this day there is a HUGE dark brown stain that remains (that glows in the dark under blacklite).",
  "This was an entirely unpleasant experience, which would have all been worth while, had I retained memories of what was going through my head. I would not recommend anyone try this combination without a trip sitter, and probably with lower dosages of the drugs involved.",
  "Take care and have fun!"
 ],
 "erowid": {
  "id": "31655",
  "citation": " DevilDoc. \"A Bad Idea: experience with H.B. Woodrose, Syrian Rue & 5-MeO-DPT (ID 31655)\". Erowid.org. Jan 12, 2007. erowid.org/exp/31655",
  "substance": "H.B. Woodrose, Syrian Rue & 5-MeO-DPT",
  "views": "15962"
 }
}
