{
 "title": "Similar to DXM",
 "author": "The Baron",
 "citation": " The Baron. \"Similar to DXM: experience with Dimenhydrinate (Dramamine) (ID 523)\". Erowid.org. Jul 31, 2000. erowid.org/exp/523",
 "substance": "Dimenhydrinate (Dramamine)",
 "bodyweight": "140 lb",
 "report": "<p>After reading all about dimenhydrinate on the web, I thought it sounded like fun so, me and a friend tried it out the other day.  I recently robotripped for the first time, and thought it was fun, so I figured I should try the dramamine.  We both ate 12 motion sickness pills with 50 mg dimenhydrinate each, then smoked a bowl.  It seemed like just after we were don smoking, the pills kicked in.  Everything started to feel funny, and I was very tired.  We ate a couple caffeine pills to stay awake.</p><p>Now I was really fucked up.  Everything was moving, sort of like a weak acid trip, and I kept hearing voices in the distance.  I dont know if I was just hearing shit, or if there were really people talking far away and my perceptions were just increased.  I noticed with the visuals, I could almost see the watery fluid in my eye moving around, and I would see faint 'strings' in the air.</p><p>It was very hard to concentrate.  My friend and I would talk, and forget what we were talking about right in the middle of the conversation.  We had a sober person with us who would help remind us of what we were talking about.</p><p>I was only really fucked up like this though for a few hours.  The trip lasted somewhat longer, but after about 2-3 hours I was able to talk like a normal person and the visual and auditory hallucinations had lessened.  I found it very easy to fall asleep that night and woke up the next morning feeling fine.  I think the next time I'd like to mix it with cough syrup and see how that is.</p>",
 "year": "2000",
 "id": "523",
 "timestamp": "2000-07-31T07:00:00.000Z",
 "views": "15717",
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ]
}
