{
 "title": "Eyes of a Stranger",
 "author": "D. Dubrini",
 "citation": " D. Dubrini. \"Eyes of a Stranger: experience with 2C-I (ID 52300)\". Erowid.org. Mar 6, 2008. erowid.org/exp/52300",
 "substance": "2C-I",
 "bodyweight": "175 lb",
 "report": [
  "<p>Saturday morning.",
  "I begin my day by walking to the video store to rent a video.  Upon returning home I go into the small black sunglass pouch on my Ikea shelving unit and retrieve a gel capsule containing what is apparently 25 mg of 2-ci, which I dont believe to be pharmaceutical grade and is likely cut.",
  "I set my stopwatch so I can keep an accurate timeframe throughout the experience.  After waiting an hour and a half, I decide that the 2-ci was either fake, or too small a dose to have any effect on me. ",
  "I turn on the video I rented specifically for this occasion, which is a sci-fi cartoon called Titan A.E.  Half way through the movie I realize I am having minimal introspective analytical thoughts, which I right off as nothing, coincidental, or a placebo effect.  I also realize I am doing a great deal of stretching and flexing, which is synonymous with past psychedelic experiences, but still doesnt propel me past the stage of  am I high?  Halfway through the movie I start to roll around and move to a precarious position on the floor.  I keep seeing bits of the movie around the television set, in my peripheral vision. ",
  "I still dont believe I am feeling the effects of 2-ci and keep telling myself it is either the hangover from the previous night, or psychosomatic. Finally the movie ends and I am in a weird mood.  I proceed to my room and check the stopwatch, which is still going and is at four and half hours past when I originally swallowed the capsule.  I sit down at my desk and look at the wood grain only to be astounded.  The grain is moving around in traditional psychedelic fashion.  In fact, everything is moving.  The more I look at the wood grain on the table, the more I fall into its trance.  The grain transforms into multiple images and characters.",
  "I think to myself how can this be? It has been over 4 hours and I am just beginning to peak right now.  I look around the room, becoming transfixed on my guitar.  It grows and shrinks and warps. ",
  "*I must note that the effects were mostly visual and did not include very deep thoughts or body sensations.",
  "I go into the bathroom and take a shower, meticulously cleaning each part of body and Spend a good five minutes brushing my teeth.  As I emerge from the bathroom I am feeling pretty good and I am utterly dumbfounded as to how I can be getting higher, five hours after ingestion. ",
  "I receive a phone call and have a hard time talking.  I get dressed and go up stairs.  I look at my mom and can hardly contain my laughter.  Her eyes look so strange.  She looks animated, almost like another kind of being.  Her eyes look wide and very pronounced.  This is the highlight of my trip.  I cant shake the image of my moms eyes. I return downstairs. ",
  "Music is sounding pretty good and I start to dance around my room.  I just feel like being active.  I practice doing handstands and do a pretty good job.  Now I am feeling great.  I learn to control the images I am seeing on my desk an  If I concentrate I can see whatever I want.  My sociability has increased so I go out with friends.  I cant stop laughing.  All night I laugh so hard I have other people laughing.",
  "*The amount of 2-ci I ingested was probably just over a threshold dose.  My visuals were not strong but definitely there.  Many of the effects were very similar to past psychedelics like psilocybin and LSD.  I have also done a threshold dose of San Pedro cactus (mescaline and other alkaloids), which is a psychedelic phenethylamine, but can draw no comparison.  Although 2-ci is describes as a short-acting psychedelic, I must say that this is the longest onset and high I have ever had and I consider myself very experienced. ",
  "All in all, it was an interesting experience.  It was fun but lacked a lot of the amazing thoughts and sensations produced by other psychedelics.  A higher dose might change that.   Throughout the experience there was little to no anxiety.  Remember that this is a research chemical with little to no research on long-term effects on the human body and brain.  So be safe, be careful and have fun.</p>"
 ],
 "year": "2007",
 "id": "52300",
 "gender": "Male",
 "views": "2885",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  }
 ],
 "submissionDate": "2008-03-06T08:00:00.000Z"
}
