{
 "id": 5231,
 "title": "The Hippie-Flip",
 "date": {
  "submission": "2004-03-09T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "mikey",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "tablet"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "1:00",
   "amount": {
    "number": "2.8",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "plant material"
  }
 ],
 "report": [
  "The Hippie-Flip",
  "Setting: Friday night and a close friend's house whose parents are gone for the weekend. Have had one tablet of MDMA in my possesion for over a month, waiting for the perfect opportunity to try it. I've never done E before, but have tripped hallucinogens many times. I've ingested numerous susbtances (over 25 on erowid's site) pretty much had done everything except for shoot up or roll E. Well, instead of trying the E by itself for the first time, as i should have known to do considering all my experience, i decided the day of this experience to combine shrooms with it and 'hippie-flip' because they just happened to come around that day. This is my trip...",
  "T=9:15PM- One tablet of MDMA(white, circular, gas pump imprint) ingested orally.",
  "T+0:20- Initial effects(possibly placebo)... Including elevated heart-rate, feeling of being 'lifted' as comparable to an amphetamine high such as ritalin or adderall. Enjoying a generaly good mood, I was very psyched for the night.",
  "T+:1:05- Effects do not seem to be increasing in intensity as predicted... 2.8 grams of P.cubensis mushrooms(1.9 grams cap) ingested orally.",
  "T+1:35- Driving home from picking up a pack of c.lights, the road begins to widen, hearing sensitivity increases, initial visuals (size, shape, and placement distortions) take effect. It's a good thing im only a block from the house....",
  "T+1:40- Attempt to play beruit (beer pong) for the first time... Fail miserably, table is swaying too much to even be able to concentrate on the task at hand. Noticing how odd people and things around me look and act, really startting to fall into a hard trip. My two friends who ingested 3 hits of acid each about 45 before are beginning to trip as well. The other 7 kids in the house are all just starting to get drunk... and the insanity begins...",
  "T+2:00- Complete loss of control. Overlaying patterns of previous visions are constantly coming and going. Flowers/plants on wallpaper are growing out of the walls, everything is morphing, swaying, and changing to no end, including my own body. Inability to read a clock, can't concentrate on anything long enough to remember what it was i was thinking about. Feelings of indecisiveness,paranoia, love, and a close togetherness between everyone are coming and going. Must lay down, upset stomach wont go away, temporary solution is to lay on couch, switching sides when need be. People are now running from room to room,very drunk and loud, no one has ANY IDEA what's going on but that's because nothing really is going on except for everyone being drunk and wild. VERY wierd feelings present,strong emotional thoughts about love and relationships are in my head. Kissing my girlfriend seems so new to me, even though weve been together for more than a year. Everything around me is still morphing, growing, and swaying uncontrollably. These unrealistic visions are really starting to get to me. Wondering when this is going to end... Keep reminding myself that this is only temporary and that its just my mind exaggerating things...",
  "T+?:??- It's probly around 1AM, open eye visuals are still very present. Laying in a bed with my girlfriend beside me (by the way, this experience was so overwhelming that sex was absolutely the last thing on my mind, Not even a feasable option at this point). Start thinkin about my family and everything bad in my life that you shouldnt be thinking about while tripping, and have an emotional breakdown. Crying uncontrollably for about 5 minutes. Feeling like i might be starting to come back to reality, feel as if I have a bit more control. Then, laying on the bed, lights cast by headlights of cars driving by filter through the window and onto the walls, sooo realistic but no cars were driving by.... When I look out the window to make sure that there really wasnt any cars driving by, a red glow is being emmited from the sky. THE SKY IS RED.",
  "T+5:30- Finally able to socialize normally again, hold a steady conversation. Still a bit off balance, things still tend to sway and will usually morph or go fuzzy if i stare at something.  For the most part my trip is over... Still experiencing odd emotional feelings from the e. Feeling very tired but unable to fall asleep (my mind was too disturbed from what it had just gone through).",
  "T+7:00- Finally able to fall asleep for two hours. 7AM comes around and I'm on my way to New York City for the day!"
 ],
 "erowid": {
  "id": "31666",
  "citation": " mikey. \"The Hippie-Flip: experience with Mushrooms and MDMA (ID 31666)\". Erowid.org. Mar 9, 2004. erowid.org/exp/31666",
  "substance": "Mushrooms and MDMA",
  "views": "34373"
 }
}
