{
 "title": "I Shall Call You Larry",
 "author": "Mike",
 "citation": " Mike. \"I Shall Call You Larry: experience with Mushrooms (ID 52334)\". Erowid.org. Sep 2, 2008. erowid.org/exp/52334",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>This is an account of my first mushroom experience, which I had back in February 2006. My friend Josh and I had been searching for mushrooms for awhile, but no one had been able to come through, until one day, when one of our dealer friends had a supply. It was about 8:30 when we met the dealer outside to get them, and we ate them at about 9:00. Josh had done research, and said it was best to chew for long periods of time, so we chewed them for about 10 minutes. So, each of us had about half of an eighter of mushrooms swimming around in our mouths for about 10 minutes. Before I even swallowed, I could feel something oddly different about me, nothing too potent, but still, an altered sensation. Josh and I, through mouthfuls of fungus, agreed to swallow.</p><p>The taste isn't nearly as bad as anyone claims it is. Sure, it's not good, but still, it isn't bad by any means. Swallowing it kind of gagged me, but not so badly as one would think. We swallowed down the mushrooms, and turned on the computer. We had music playing along with a visualization on the media player, and the music was highly enjoyable. The visualizations on the media player were quite amusing, constantly moving and playing with my eyes. We went into my room, feeling a considerable buzz, while it was only 30 minutes since we had eaten the mushrooms. This contradicts with other experience reports I've read, where people say it takes about an hour for any significant difference. It was night, and we decided to walk around my neighborhood and enjoy the sights.</p><p>This is when the mushrooms started to kick in quite a bit more. The colors of the night sky and the street lights looked so deep, so beautiful and comforting. We brought along with us a Swisher Sweet Outlaw cigar, which we had decided to share. Unlike many other drugs, tobacco doesn't seem to increase the experience, but it was pleasant to taste and to inhale. Josh seemed to 'lose his mind' earlier than I did. We were walking, and Josh suddenly started to tap my chest, a curious look in his eye. I asked why he was doing this, and his response was quite amusing to me. He said, 'I can move so freely in the air and do whatever I want, but you're so...solid, and it's weird how I can't go through you when the air is so simple to move through.' I laughed, noticing that humorous things were funnier than normal.</p><p>We walked a bit more, lighting the cigar as we stood in the middle of the road, probably looking suspicious as hell to the people in the houses around us. As we walked, people would be coming up to their cars and starting them up just as soon as we were walking by, which caused us to jump with slight fright. Still, the whole time was fun. My first visual hallucination came as we were nearing the end of a street. I saw a circle of soft lavender light rising from the ground. I walked towards it, but it disappeared once I got too close.</p><p>As we were walking, the feeling of the ground underneath us was odd. The way the pressure on our feet felt was entirely different from normal. It felt as though we were walking on stilts, both in the way stepping felt on our feet and for the reason that it felt as though we were ten feet tall. As we walked and enjoyed our cigar, I looked down, and a stick laying on the ground next to my feet caught my eye. I didn't know why, but I felt some sort of bond to that stick. I picked it up. Josh, only then realizing I had stopped walking, came back and looked at me, running my hands over this stick. I looked directly at it.</p><p>'I shall call you Larry,' I said to the stick. I pocketed it, and we went on. When we finally came back inside of my house, the lights were on, which I immediately noticed, because they had been turned off when we left. Josh was also confused.</p><p>'Dude, did we leave all the fucking lights on?' he asked loudly. I shushed him, because around that moment, I noticed that my mother was awake and was watching us from the kitchen. She looked at us as she approached.</p><p>'What's going on?' she asked in an accusing voice. For a split-second, I thought she knew we had eaten the mushrooms, but realized that would be impossible. I asked what she was talking about, and she asked why Josh was still here. I had forgotten that he was supposed to go home that night. I told her his parents couldn't give him a ride, so he had to stay the night here. She sat me down while Josh kind of sat in the background and talked to me in length about how her and her boyfriend had been arguing lately, and that he was in a bad mood. Normally, this would either make me angry or sad, but the mushrooms made me stoic to her problems. The mushrooms had hit their peak as we had come in, so I actually enjoyed the talk, because I hadn't payed much attention, and the whole time the floor was breathing and it felt like the chair I was sitting in felt as though it was shooting forward like a rollercoaster.</p><p>Josh and I retreated to my room and turned on some video games. I have a Super Nintendo, which was quite fun as we were shrooming. We played Super Mario World, laughing at all of the obscure drug references, such as the mushrooms. One thing the mushrooms did was made the video game seem extremely easy. I was never touched by an enemy, and got through levels before I thought I was even halfway done. Donkey Kong Country was exactly the same, except even better. We noticed how all the characters appeared to be on a greenscreen in relation with the background, and the game was intensely fast-paced. I played the hardest level in the game and beat it before I knew</p><p>One thing that I really liked about the mushrooms was the way they made speech flow endlessly from Josh and I. We had deep talks, discussing religion, philosophy, and a myriad of other things. I had a bit of a personal revelation, realizing that it truly made me happier to give than to receive. Also, I was able to flex my vocabulary much more. I was able to fit larger words into my conversations so seamlessly. On every drug I've ever done, there's a small portion of my brain which always remains normal in it's functioning, the 'observer' portion, if you will. Well, during this, the observer portion of my head noticed that I could be mistaken for a professer of some sort, or at least if no one could see how I look.</p><p>The night ended with us smoking more cigars and cigarettes and watching a James Bond movie (Goldeneye, for the curious). I had such a great time that night, even though the dose wasn't high enough for any major hallucinating. I've done mushrooms once again since then, and it was a more powerful dose. I love mushrooms; they are my favorite drug. I would recommend them to anyone who wants to have the best time as humanly possible. I have yet to have a high enough dose to be put into another dimension, but I look forward to whenever that day will come. Despite what people may say, mushrooms are not, by any means, a 'hard' drug. It is a beautiful experience, not too intense to handle, but not weak by any means.</p>",
 "year": "2006",
 "id": "52334",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-02T07:00:00.000Z",
 "views": "2799"
}
