{
 "id": 5239,
 "title": "Celestial Magnifence In Paradise",
 "date": {
  "submission": "2008-05-29T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Pills",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "360 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:00",
   "amount": "360 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]",
  "I have used DXM before but only around 500 mg at the most. It all began at my friend D's house. We smoked a few bowls of cronic, and enjoyed our buzz. I remembered that I bought these coricidin Pills from my friend Smiles. I had about 50 of them. I gave 25 to me and 25 to my friend. I downed the first 12, and we turned on Cheech and Chong: Up In Smoke. I began to feel the normal effects; Drunkness, Wavy Vision when I move my head back and forth, a warm feeling, a pleasent buzz. I began rising and rising until I was at my plateau on 360 MG. I felt so great, I began to wonder about life and its mysteries.",
  "After about an hour I downed another 12 (360 MG More). I swear it only took about 20 min. when I started feeling it come on. I just kept rising and flying. I felt so good, when I found myself in my bathroom. I thought it was a celestial magnificence in paradise. A Heaven I can call home. Everything was so beautiful. I saw vivid colors, and lights seemed to shine more. I thought of a god, and how much he loves me. I closed my eyes and saw god, he was wearing a light purple robe with angels around him, playin trumpets. He reached out his hand, and I opened my eyes, feeling an intense happiness, that actually felt like I was on MDMA! I never have felt an intense happiness that great on dxm until now! I started coming down but it was still simply amazing! I tripped out all day, listening to techno music, preferabaly DJ Mystik, who's the greatest. It finally wore all off and I smoked a few bowls, then went to bed.",
  "I awoke the next day, feeling proud of myself and this world. I felt like a million bucks. I talked to my friend N asking about his trip and he said he only took 4 more pills after the 12, so he said he remembered me bowing down in the bathroom saying something about Paper Towels, strangely enough I don't remember anything about paper towels, haha. Cause of that trip, I feel less depressed and my life is great."
 ],
 "erowid": {
  "id": "31692",
  "citation": " Pills. \"Celestial Magnifence In Paradise: experience with DXM with CPM (ID 31692)\". Erowid.org. May 29, 2008. erowid.org/exp/31692",
  "substance": "DXM with CPM",
  "views": "9553"
 }
}
