{
 "title": "The Observed Becomes The Observer",
 "author": "Beaker",
 "citation": " Beaker. \"The Observed Becomes The Observer: experience with LSD (ID 5239)\". Erowid.org. Jan 12, 2002. erowid.org/exp/5239",
 "substance": "LSD",
 "bodyweight": "170 lb",
 "report": "<p>I recently had a chance to find myself switching roles in an experience I had had on LSD.  I had some younger friends over, who were relatively inexperienced on LSD.  Only two others were on LSD, the other three were just drinking for various reasons.  We had acquired the LSD from a reputable source that evening in liquid form dropped onto sugar cubes.  The two novices took a double dose there and then another an hour later after returning to my house, which I like to think of as a good chill space.  I took one double dose about the time they took their second.  I set up a series of music that I knew would be enjoyable and mind bending, particularly in the acid head space (Orbital, Banco de Gaia, etc).</p><p>The LSD was very clean and high quality.  It snuck up behind us slowly and then wacked us over the head, sucking our brains into the spirals that wouldn't stop for the rest of the evening.  When I felt mine come on, I just let myself go.  Being slightly off timing of the other two, I settled more into an observer state than trapped into their spirals (tho that would ensue later).  I found it quite humorous to see them trapped in the mindset that we (and they to each other) were 'fucking with them'.  It was funny to me because I remember one trip I had where, even being somewhat experienced on LSD, I felt like the people I was tripping with (whom I had only known through online communications) were messing with me and we were all messing with each other.  In that case as with this, it was never anything malicious or disturbing, but was well summarized in the quote 'Ok, who's fucking with me, is it you or me?'</p><p>It just made me realize that one shouldn't always try and define or explain the acid head space.  It often leaves one confused.  I enjoyed just observing and letting myself go.  Having come to many interesting understandings in Aikido recently about spirals, shapes, energy flow, and the like, I was able to fit these same thoughts and identify with the same concepts affecting the flow of the LSD space.  The ever elusive point (singularities are a bitch, always gotta remain on the tangent), circular thought patterns, infintite spirals (they're the same whether they are spinning in or out), movement of body, mind, and energy, etc.  It was difficult to explain or put them in a rigid framework, so I just let myself experience them as they came and manifest them in whatever form may be at the time, whether it was dance, thought, manipulation of others (like I said, there wasn't neccessarily any fucking with others, often it just seemed like it, but that doesnt mean it didn't happen, cause it's fun when you get it right), or Aikido shapes/forms. </p><p>It was just interesting to see the same strugglings that I have been through, evidenced in these two, and to provide the chill space where one could just deal with it. I'm not trying to sound like an elitist bastard (albeit I am one), but I take the lessons from LSD to my heart, and they do help me integrate my reality and how I interact with it.  My presence of mind is greatly aided by a dissolution of self and the reconstruction of intent and structure. It was refreshing to see where I had come from, and where my mind and self have developed since then.  Not to say it's not possible for me to get caught in the same spirals, they're always there.  It was just fun to play the observer.</p><p>Meep,</p><p>Beaker</p>",
 "year": "2001",
 "id": "5239",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-12T08:00:00.000Z",
 "views": "5644",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 }
}
