{
 "title": "DXM School Trippin'",
 "author": "Greenjello",
 "citation": " Greenjello. \"DXM School Trippin': experience with DXM & Cannabis (ID 524)\". Erowid.org. Sep 10, 2000. erowid.org/exp/524",
 "substance": "DXM & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "420 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "524",
   "Not Specified",
   "",
   "Not Given",
   "Sep 10, 2000",
   "182714",
   " "
  ]
 ],
 "report": "<p>\nI believe, in Junior High I had my first DXM trip by taking too many cough medicine pills.  This trip report covers my first intentional DXM trip.</p><p>It all started Sunday morning at about 4:00 a.m.  Being an insomniac, I had tried to go to sleep the night before, without success.  I decided I was going to go to school without any sleep, Id done it before and I was going to do it again.  I started to smoke some weed, only a few pinches from my one-hitter and continued to do so, slowly, until about 7:30.  For the past few months, Id been reading about DXM and decided I was going to try it that day.  </p><p>At about 8:00 I left for school (class didnt start until 8:45) and went to a nearby drugstore and picked up a bottle of Vicks 44 Cough Formula (the Vicks equivalent of Robitussin Maximum Cough), drank it quickly right before school.  During my first period class, Im not sure if I felt the effects of the DXM, but I definitely felt something (it couldve been the weed).  It was a nice head buzz.  By second period, I was feeling very tired from the night before and I could really feel the effects of the DXM.  During 2nd period, one of our state senators visited our school and we were having a lycaeum in the auditorium so we could ask him questions.</p><p>Walking into the school auditorium, I had my first hallucination.  It was partially visible, but the sound was more distinct.  It was very dark, only a few smaller spotlights lighting the stage.  As I walked along the wall I heard a hollow Whooshing sound and out of the corner of my eye I saw a long tunnel.  I jumped and turned to look at it and it was gone.  I found a seat in the third to the last row and the lycaeum began.</p><p>By this time, the full effects of the DXM had kicked in.  I sat there and listened, but I couldnt concentrate on what he was saying.  I put my head between my hands and sat there for a minute.  When I looked up, it looked as if I was still looking at the carpet, like the carpet had attached itself to my vision and it slowly went back down to the floor, out of my vision (as if it had slowly melted back to the floor, its quite hard to explain).  Later, the senator picked up the microphone stand to move it out of his way and it looked like his shadow wasnt making the same movements as him.  I watched this for a long time and asked someone sitting by me if they saw anything different, and of course, they didnt.  Throughout the rest of the Lycaeum, I saw several light distortions, a common effect of DXM.  </p><p>I left the lycaeum and went to my 4th period class, which was a study hall in the computer lab (the lycaeum took up two periods).  I just sat there and let my mind wander.  It was a very strange experience.  I remember asking myself questions about anything, mostly life in general, and looking for answers.  Then, I looked up and there was a classmate who had a shirt that read Play and pictured a person hitting a baseball, nothing else.  Im not sure if that is what his shirt had really said, but at the time, that is how I had read it.  I stared at that picture which seemed like hours, but after looking at the clock, it was only about 2 or 3 minutes.  After staring at it, I snapped to attention and I suddenly knew EVERYTHING.  Not that I was thinking any more clearer, or had even really figured anything out, but every question I asked myself, I had an answer for.  I had a false sense of enlightenment and I loved it.  Looking back, the answers were totally unrelated, but they satisfied my curiosity for the time being.</p><p>After that, I started coming down from the trip.  Throughout the rest of the day I had several small visual distortions.</p><p>That night I slept 16 hours and I felt a small hangover from the DXM.  It wasnt a headache, but I felt completely drained of energy and still had the heavy feeling from the day before. </p><p>I would recommend DXM to anyone whos looking for a legal high.  Just get the background information before you try it.</p>"
}
