{
 "title": "A Very Uncomfortable Ride",
 "author": "Gman",
 "citation": " Gman. \"A Very Uncomfortable Ride: experience with Datura Inoxia Seeds & Benadryl (ID 52431)\". Erowid.org. Jun 30, 2010. erowid.org/exp/52431",
 "substance": "Datura Inoxia Seeds & Benadryl",
 "bodyweight": "160 lb",
 "report": "<p>I am writing this report the day after having ingested Datura Inoxia (meteloides, angel's trumpet) seeds with Diphenhydramine (Benadryl).</p><p>My Background and Body</p><p>----------------------</p><p>17 year old student.</p><p>160 lbs.</p><p>6'0' tall.</p><p>Athletic .</p><p>Diagnosed with Asthma & Depression.</p><p>Had a full stomach during ingestion.</p><p>My Daily Medications</p><p>--------------------</p><p>Prozac (20mg) daily.</p><p>Mental State prior to Ingestion</p><p>-------------------------------</p><p>Calm, relaxed, normal. At home,</p><p>family was there watching a movie.</p><p>Preparation & Ingestion</p><p>-----------------------</p><p>I first put the seeds into a small glass bowl with a small amount of hot water. This technique coaxes the seeds to expand and become softer for chewing. After waiting for a minute, I added pure lime juice (about 6 drops) in order to further weaken the shells of the seeds. After mixing in the lime juice, I vigorously crushed the seeds with a metal spoon and poured them into a cup of orange juice, stirred, and then swallowed all at once.</p><p>About 30 minutes later I decided to ingest another anti-cholingergic chemical called Diphenhydramine (Benadryl). I swallowed 9 pills, 25mg each, (that's 225mg).</p><p>Experience Report</p><p>-----------------</p><p>1-2 Hours after ingestion...</p><p>Felt nothing for the first hour, then I got a tingling sensation in my fingers and toes, vision got slightly blurred and objects had very suddle light trails. Walking got a bit more difficult after this first hour.</p><p>2-3 Hours after ingestion...</p><p>It was a school night so I went to sleep, felt light headed, a bit nauseous, pretty tired.</p><p>3-8 Hours after ingestion...</p><p>Slept through the night without any real memorable dreams. Woke up at one point and was hot, my legs felt restless and my skin was a bit itchy. Some noticeable cottonmouth occurred and I felt a bit weak.</p><p>Next day at school...</p><p>Woke up and took a shower, my arms felt like they were a foot longer than normal, imagine your eyes being located near the back of your skull for a wider angle POV. Felt much lighter weight than normal. Anxiety set in and I felt really stupid for having taken these drugs last night. Driving to school felt very strange, the slightest bit of acceleration in my car felt like going down very fast in a rollercoaster, made me giggle because of the tickling in my stomach. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  Still very dry everywhere on my body. Cottonmouth lasted until the end of the school day.</p><p>I got a bit of a feeling like I was going to vomit during my second class of the day and drove home for about 30 minutes, did not throwup, and urinating made me feel quite a bit better. I went back to school for the end of the 3rd class in my day. Still felt rather weak and very tired, as well as having cottonmouth.</p><p>For the rest of the day, my hand eye coordination improved over the hours until by the time school was out I felt pretty much normal again. There weren't really any hallucinations besides some very minor light flashes and almost invisible wavy patterns in my vision that would go away quickly.</p><p>Conclusion</p><p>----------</p><p>It wasn't fun, it was very uncomfortable, there weren't really any hallucinations, and it brought on a lot of anxiety. I wouldn't recommend this plant to anyone, it's very strong, but very dangerous too.</p>",
 "year": "2006",
 "id": "52431",
 "gender": "Male",
 "timestamp": "2010-06-30T07:00:00.000Z",
 "views": "10708",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  },
  {
   "time": " T+ 0:00",
   "amount": "15 seeds",
   "administration": "oral",
   "substance": "Datura",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 0:30",
   "amount": "225 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ]
}
