{
 "title": "K-Hole Is a Brief Psychic Death (But Not Bad)",
 "author": "aj",
 "citation": " aj. \"K-Hole Is a Brief Psychic Death (But Not Bad): experience with Ketamine (ID 52432)\". Erowid.org. Oct 15, 2010. erowid.org/exp/52432",
 "substance": "Ketamine",
 "bodyweight": "214 lb",
 "header": [
  "DOSE:",
  " ",
  "insufflated",
  "Ketamine",
  "(powder / crystals)"
 ],
 "report": "<p>[Erowid Note: The author of this report listed 'Ketamine & MDMA' as substances but does not specify any ingestion of MDMA so this is being considered a ketamine-only report.]</p><p>I've had a lot of experience with Ketamine.  So, I wanted to pass on one of my 1st, then give a few tips to those who want to keep the experience alive.</p><p>1.) I was at a dance.  I had access to a 500mg bottle of pure ketaset powder - it's very fine.  I passed the bottle around and everyone took a rolled up bill and sniffed lightly at the powder in the bottle, or poured it onto a piece of paper and snorted a line.</p><p>2.) When everyone was done, I stuck the bill into the bottle and snorted whatever was left.  This turned out to be a LOT. [Reported Dose: '250 mg']</p><p>3.) The left side of my head felt like it was hit with a hammer, then turned numb.  Within 1 minute I was unsure of my own personal proportions or where I was in the room.  Within 3 minutes I had to sit against the wall.</p><p>4.) The entire dance floor emptied.  I died.  I completely lost my body and was Utterly unable to monitor my breathing, motor responses or anything else.  I thought to myself - 'so, this is the afterlife?'</p><p>5.) Slowly faces swam into view and I could feel myself breathing.  My friends girlfriend was in front of me.  She helped me to my feet.  It took about another 45 minutes to fully recover use of my limbs. </p><p>6.) End result:  I had been out for 35 minutes.  The high lasted for about 2 hours.  She hadn't called an ambulance for 3 reasons.  1, I was breathing normally and my pulse was fine.  2, someone had said no one ever died from Ketamine, and 3. I wasn't showing any signs of physical distress.</p><p>Everything I've read or heard about K indicates that no one is going to actually die from it.  I believe this since I've heard absolutely no rumors, stories, or any other reason to think it's a physically dangerous substance. [Erowid Note: High doses of ketamine can depress respiration, which can increase the risk of breathing-relating accidents (asphyxiation, suffocation, drowning).]  But, the K-Hole is a brief psychic death.</p><p>The experience of being dead was so utterly overwhelming that I managed my doses carefully after that.  But, in smaller amounts, K is an excellent experience.  However, my body builds a tolerance very quickly.  The difference between being incoherent and actually going into the K-hole is very large.  So, just satisfy yourself with being incoherent.</p><p>I don't take it more than once ever 3-4 weeks or I'll stop getting anything out of it.  Also, taken by itself, everyone [that I know] agrees that it's a very brittle and alien experience.  Mixing it up with other club drugs and we enjoy it more.</p><p>Best to you all.</p><p>aj</p>",
 "year": "2004",
 "id": "52432",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-10-15T07:00:00.000Z",
 "views": "4204",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  }
 }
}
