{
 "title": "Mitigates The Side Effects",
 "author": "Rig",
 "citation": " Rig. \"Mitigates The Side Effects: experience with Cocaine & Cannabis (ID 52465)\". Erowid.org. Jun 14, 2007. erowid.org/exp/52465",
 "substance": "Cocaine & Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "2 lines",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   "",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Last night was the first time I've ever tried Coke.  I wasn't planning on it, a friend of mine just had some and I said screw it.  The first line didn't do anything, I felt basically normal.  We smoked a blunt (about half an 8th) shortly after the first line, then I snorted the other line.  About an hour after this we smoked another blunt. The feeling was strange, The coke nulled some of the pot's effects, such as the dry mouth, munchies and sleepiness.  I've never tried coke so the pot may have nullified some of the coke's effects too, but I don't have a prior experience to relate it to.  Anyway, I felt an extreme euphoria, there's really no other way to describe it.  Everything was just right with the world.  I tried driving, and I was swerving a little bit, but once I concentrated I could drive fine, at least I thought so.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>The next day I felt really tired and lazy, even more than I normally would after smoking pot.  I smoked some more weed the next day and started craving more coke, but nothing extreme.  I think if I had done more coke the night before I would've wanted more the day after.  I didn't feel depressed despite the cravings, if anything I was happier and more laidback.  Overall, I'd say coke can be good, but in moderation.</p>",
 "year": "2006",
 "id": "52465",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-14T07:00:00.000Z",
 "views": "5478",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 lines",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ]
}
