{
 "title": "Screaming Voices",
 "author": "cremedebrocolli",
 "citation": " cremedebrocolli. \"Screaming Voices: experience with Belladonna (ID 52478)\". Erowid.org. Apr 26, 2006. erowid.org/exp/52478",
 "substance": "Belladonna",
 "bodyweight": "100 kg",
 "header": [
  "DOSE:",
  "5 ",
  "oral",
  "Alcohol",
  "(liquid)",
  "",
  "2 berries",
  "ocular",
  "Belladonna",
  "(fresh)"
 ],
 "report": "<p>It has only been 6 days since my first (and last) belladonna experience. Having read up extensively on this plant I was quite excited to find a large bush of deadly nightshade at a local park and as I grabbed a twig to examine the purple berries I squeezed the contents into my eye. It immediately began to sting; I licked my finger (stupid idea) and rubbed furiously at my eyeball. Before walking to the park, I had drunk around about 5 standard drinks so I was pleasantly inebriated as I walked home after the incident with the berries.</p><p>(00.15 mins after absorption)</p><p>As I walked home, I began to feel very very drunk, my head felt extremely heavy and I was stumbling quite badly. However I continued to drink when I got home.</p><p>(00.30 mins after absorption)</p><p>My head is now extremely heavy; feel drunker than Ive ever been before. Hallucinating very badly, I saw myself, my own body and walked around myself and screamed at myself. Kicked at myself (which was actually a wall) then became disinterested as my phone was ringing. I answered and it was my friend. I told him via lots of screaming that I had eaten magic mushrooms and I felt funny. Then another friend rang and I felt out of control and I told her I had taken heroin.</p><p>(00.50 mins after absorption)</p><p>A dog ran out in front of me, it was my old dog, which had long since passed away. For some reason I thought this was real, it seemed so real. My head was full of static noise as I followed my dead dog down to the park where I had originally taken the deadly nightshade into my eye. As I walked my legs would fall out from under me causing me to go crashing into the road, but my dog would always wait for me.</p><p>(Approx an hour and half after absorption)</p><p>When I reached the park I was hallucinating widely (although it still seemed normal). Ive taken a lot of hallucinogens (LSD, mescaline, DMT etc. quite a few times) but these visions were nothing like them, for one they were a change of the entire scenery and to me they seemed real.</p><p>There was lightning all around me, the sky was ripped apart and clouds sweeping by quickly, they were tinged with red. All around me (its 8.00 pm) the normally deserted park is filled with people; horrible gray shadows with back holes for eyes, there are thousands of them. The trees are dripping with blood and the ground is littered with body parts. These people are laughing at me, but I can only hear them in my head, they scream at me, horrible things about the universe coming to an end. I remember grabbing my head and screaming.</p><p>(Approx two hours after absorption)</p><p>nb. This account is from my friends who found me; at this point I no longer have a recollection of what happened.</p><p>I was found at the park, screaming in some unknown language at the top of my voice, I was deliberately hurling myself towards the ground, into trees and walls and attempting to throw myself into the river. They called the ambulance who then called the cops. They spent at least half an hour trying to settle me down but I was too confused and violent. The police handcuffed me and tried to hold me down but I threw them off. The ambulance officers shot me up six times with a sedative, which finally brought me down.</p><p>I spent 3 days in an induced coma and five days in intensive care, this is where I woke up having no idea what had happened or who I was.</p><p>The Australian doctors had never seen a case of belladonna/atropine poisoning before and decided that an opiate derivative and general anesthetic was a good treatment.</p><p>Belladonna was a descent into absolute madness; to this day my vision has not recovered (blurry and unable to focus), of all the drugs Ive used belladonna was the strongest and most terrifying. I would never recommend this plant to anyone who doesnt want to wipe themselves out to the point of dying. It wasnt trippy, enlightening and fun. It was the most horrific experience Ive ever had before.</p><p>There are far better (and safer) alternatives to this plant  belladonna, I wouldn't risk it.</p>",
 "year": "2006",
 "id": "52478",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-26T07:00:00.000Z",
 "views": "46258",
 "dose": {}
}
