{
 "title": "The Magical Mystery Tour",
 "author": "Mo0o0o0o0se",
 "citation": " Mo0o0o0o0se. \"The Magical Mystery Tour: experience with Mushrooms, Cannabis & Nitrous Oxide (ID 52488)\". Erowid.org. Oct 6, 2007. erowid.org/exp/52488",
 "substance": "Mushrooms, Cannabis & Nitrous Oxide",
 "bodyweight": "70 kg",
 "report": [
  "<p>I've been considering adding this experience for quite awhile now. It's interesting reading about everyone else's trips so I thought why not. I'm Canadian but have been living in New Zealand for the last few years. At the time of my first time doing magic mushrooms (this report) I was in the midst of a very troubling break up with my long term girlfriend. I had been smoking pot quite a bit around then and had decided to try something new.",
  "My friend Nathan had been saying for quite awhile that he could obtain magic mushrooms from one of his friends. Weeks went by with no result so I was starting to doubt him. Then one night I got a text saying he had them and wanted to try them the next night. So, the next night him and my friend Shaun headed over to my place. They had both tried mushrooms before but Shaun was staying sober to watch over both of us. My parents were in bed upstairs, so this was a very risky operation.",
  "We started by boiling up the mushrooms for 10 minutes then putting it in Milo (hot chocolate). I slowly sipped at the cup, not really knowing what the expect. The Milo hid the taste of the mushies very well, but there was still a distinctive aftertaste of mushroom. We didn't have anything to do so we headed down the road to some partially constructed houses to smoke some pot and do nitrous hits before the mushies kicked in. My neighborhood was still being constructed at this time, so we had naturally smoked weed basically everyday in all these houses. We found a suitable house and sat down at T+20. Shaun started by cracking open a nos canister. I remember the distinctive sound of the canister being opened, then an ill feeling in my stomach. I asked them if this was normal and they said yes, but I still felt quite ill and wanted to walk back to my place. Then the mushies hit in while we were deciding whether or not to head back. I saw the balloon Shaun was holding had a big smiley face on it and I started cracking up. He quickly took his hit and we headed outside, since me and Nathan were starting to feel it.",
  "As soon as I went outside I knew something was different. Vivid colours started projecting themselves on the outside of my vision, starting with green, then purple, red and so on. At this point it was T+30. My friends walked along the sidewalk but I walked across a narrow strip of grass, looking down the whole time. Suddenly I stopped, but the grass kept moving. I imagined I was on an esclator up my hill, getting a free ride home. I told Nathan and he just cracked up laughing, at which point we both fell in to hysterics. We headed up the hill again after our laughing fit subsided. We started walking and then the streetlights started morphing in to birds flapping their wings. I couldn't control myself and started rolling on the ground laughing. This set of taking a few steps, tripping out then laughing continued for half an hour until we reached my house. Shaun found all this quite amusing, as I know I would have.",
  "At T+1 hour we reached my house. It is down a dark driveway with a single light outside. My house itself is more of a piece of artwork than a house, with weird angles and walls jutting off it to nowhere. I managed to arrange myself somewhat, since my parents were in bed. I unlocked the door with ease and headed inside with friends in tow. The purple and white walls of my house were so much more vivid, as were the lights that were on. We went into my living room and I proceeded to put on Pink Floyd's The Wall. We had seen this before but decided it would be a much different experince on hallucinogenics. As soon as I sat down in my leather couch I had this amnazingly warm feeling about me, like an electric blanket covering me. I suddenly started to mold in to the couch. I couldn't help but describe this to my friends. Then everything went square. I mean everything 90 degree angles, even my friends faces and a balloon Shaun had blown up. All the colours were very vivid and kept changing. I remembered The Wall was on and started watching it, but had this feeling. Everything around the TV was square and multi coloured, yet the movie was as if you were watching it sober.",
  "At T+1.30 we turned the movie off and Nathan insisted on drawing. He kept asking for paper and crayons but I couldn't get any because I was molded to the couch. He started to yell at us and get shitty about not having them, but I just didn't seem to care, telling him to shut up and enjoy the trip. I didn't feel agigated at all, even though I was nearly yelling back at him. I had totally forgotten at this point that my parents were upstairs. Anyways, Nathan headed to the next room on his own little journey while me and Shaun talked about drugs. Nathan soon came back and apologized, at which point Shaun said he had to leave. This was at T+2.00, at which point me and Nathan retired to my rec room. We sat on my couch with the lights on low, talking about our trip, the colours, the thoughts in our heads. I can remember only being able to concentrate on one thought for maybe 10 seconds, then switching to another, always talking out loud.",
  "At T+2.45 I turned out the lights and lay back, watching the stars out my window. They appeared normal and I thought I was coming down. This is when I experienced the weirdest part of my trip. I sat up and I thought the lights were back on, since they were dimly glowing. I looked up at the corner of my room and there was my soul hanging like a cloud of smoke. It was intensely gray and black, slowly shimmering. I realized straight away it was my soul and did not feel frightened by it. I went to get a rum and coke and upon my return everything seemed normal again. Nathan was coming down as well and we decided to head out to his car to get stoned and have some nitrous. I finished my drink by T+3.15 and we headed out.",
  "When we got in to his car I felt absolutely worn out. I had little energy left. We both smoked a few cones and had 2 hits of nitrous each. The pot mellowed me out and made me absolutely sleepy, so I headed back in, Nathan insisting on driving home (not a good idea, never do it!). [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  I went inside and cleaned up before heading to my room. I took my clothes off yet I still felt warm, as if they were still on, even though it was a cold night. I had a very good night and fell asleep by T+4.30.",
  "The next morning I woke up and felt even more tired than when I fell asleep. However, I had a very warm, happy buzz about me. This lasted for another week. I felt my break up with my girlfriend didn't matter and only my personal happiness mattered. This was the only time I have tried hallucinogenics, however I am very tempted to do them again, especially acid.</p>"
 ],
 "year": "2004",
 "id": "52488",
 "gender": "Male",
 "views": "2537",
 "dose": [
  {
   "time": "0",
   "amount": "3 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  },
  {
   "time": " T+ 3:15",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 3:15",
   "amount": "2 carts.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "submissionDate": "2007-10-06T07:00:00.000Z"
}
