{
 "title": "My Study Binge",
 "author": "Botch",
 "citation": " Botch. \"My Study Binge: experience with Amphetamines (Adderall) (ID 52499)\". Erowid.org. Sep 4, 2007. erowid.org/exp/52499",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "220 lb",
 "report": "<p>This report describes my weeklong Adderall/studying binge during finals week and may contain some information useful for those who are may do something similar.</p><p>First some background:</p><p>I am an engineering student in a smallish university. I consider myself to be very math/science smart, just to give you an idea I entered college with 16 credits: Physics (Newtonian and Electromagnetism), Computer Science, Calculus, and some liberal arts credits; I also got an 800 in the math section of the SATs. Unfortunately my ability to quickly 'get' these kinds of subjects has caused me to develop some bad study habits. Usually I either dont study or I will cram before tests (for like an hour tops) with great success but then do marginal on finals, cramming for a final doesnt work so well. I am very experienced with drugs, I won't list off the drugs, I have tried virtually all popular drugs, but have not used anything other than weed, alcohol and painkillers more than 10 times.</p><p>So, anyways, I decided to take a new approach to finals this semester. I had recently come across a very good Adderall hookup. Lots of 30mg tablets. I bought probably 15-20 during the course of finals. I started with 30 mg dose to do a lengthy math assignment before finals, probably Thursday night. I was able to pound through the assignment in 3 hours with no breaks. This was the rare kind of assignment that would ruin me because of my irresponsibility, but my seemingly endless concentration allowed me to get it, plus it was fun, though I kinda enjoy math anyways.</p><p>Starting at a 30 mg dose was a very bad idea, it caused my tolerance to go up much faster than if I had started at 10 or 5 mgs, which is still an effective dose. Also the comedowns were pretty bad. After taking that much I could never sleep, even after 10+ hours after dosing. People suggest smoking MJ to help sleep, I found this to be totally ineffective, it definitely improves the come-down, but I just have racing thoughts. What is effective is alcohol.</p><p>Anyways I dosed the next day to study, and I would dose in the morning before finals. I would use half of a pill before tests so I wouldnt be tired. Pretty soon I was dosing in the middle of the day to keep the come down from happening, this was maybe Tuesday or Wednesday. Around this time I had to take 37.5mg to get the desired effects for studying, eventually I got up to 45 mg. By Wednesday or Thursday I was having trouble focusing my eyes on distant objects due to sleep deprivation. The rest of the week proceeded like this until the day I had to come down, after finals. The final comedown was pretty bad and I didnt sleep that night. I was only able to sleep for about an hour the next day around 2pm, but it was hard to get to sleep.  By this time I felt very different and after I slept I felt weird for a day or two but later felt normal.</p><p>In total I only was able to even fall asleep two nights from Friday to Thursday. I think by the end that the sleep deprivation might have been affecting my test taking abilities, but not too much. I definitely was able to study a lot more and could study 6+ hours a day, where as usually I can't stand studying for more than a couple of hours. I did much better than usual on my finals by the way.</p><p>One final note: This experience caused me to feel a way that I really did not like, and I do not plan on repeating this again.</p>",
 "year": "2005",
 "id": "52499",
 "gender": "Male",
 "timestamp": "2007-09-04T07:00:00.000Z",
 "views": "11688",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 }
}
