{
 "title": "Witnessed a Trip",
 "author": "Libra",
 "citation": " Libra. \"Witnessed a Trip: experience with Datura (ID 52496)\". Erowid.org. Jun 19, 2007. erowid.org/exp/52496",
 "substance": "Datura",
 "bodyweight": "126 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2006",
   "52496",
   "Male",
   "",
   "Not Given",
   "Jun 19, 2007",
   "8498",
   " "
  ]
 ],
 "report": "<p>This report is not about me, but about a 16-year-old patient I took care of in an intensive care unit.</p><p>History that I obtained from the patient's family started with the boy's father coming home from work and seeing his son sitting on the couch watching a TV that wasn't on and talking to a friend that wasn't there.</p><p>Dad said 'What the hell are you doing, **** isn't even here!'  At this point his son looked around the room and had what his father said was his last moment of clarity.  He said 'Dad, I'm really fucked up.'  Dad figured that the boy had taken LSD and sent the boy to his room to trip.  Dad found a pot on the stove that had some burnt material in and the pot had boiled dry and was smoking.</p><p>Within 15 minutes of getting home, the father heard his son screaming at the top of his lungs 'like a girl' and then the sound of breaking glass as the boy slammed his computer chair into his window.  At some point, Dad decides that this isn't your regular bad trip and drives the boy to our hospital.</p><p>When he came in, his heart rate was 178.  We pushed drugs to slow his heart rate down.  His pupils were dilated to 7mm.  He was screaming and thrashing around.  We had to call in 4 of our security officers to do a use of force and place the boy in four point restraints, where a patient is strapped to a bed by their wrists and ankles.  The patient was writhing so hard on the bed that he was arching his back and coming up off the bed.  It was an awful lot like the scene from the Exorcist.  Everyone panics and we can't give the patient something to safely sedate him until you have some idea what he's on.</p><p>His father called in the family and a friend of the patient, who had some idea what the boy had taken.  He told us that his friend had read about 'gypsum weed' on the internet and had made a tea out of it to get high.  Due to the nature of the plant and how he took it, it is impossible for us to say how much he took.</p><p>There was really nothing we could do for this boy to help him while he was in the ICU.  These hallucinations are not like the ones users get on LSD or other drugs.  They cannot differentiate between the trip and the reality.  They have completely over ridden THE brain's bullshit filters.  </p><p>When the boy awoke on the 3rd day of his stay with us, his family had been through turmoil, and he was unable to walk or eat for another 2 days.  At discharge, his total bill was over $140,000 for the skilled care that he had required.  He was embarrassed, physically and mentally weakened, and had mandatory chemical dependency treatment (and a severe chewing out by his Dad) to look forward to.</p><p>I can say I'll probably always be able to recognize a Datura patient if I ever see another one.</p>"
}
