{
 "id": 5250,
 "title": "Another Day in my Life",
 "date": {
  "submission": "2007-11-14T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "BIGDaddyachmed69",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "475 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "capsule"
  },
  {
   "time": "4:00",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "Alprazolam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I'm 17, in my senior year of high school and suffer from depression, GAD, OCD, and social anxiety. It got to the point where I could no longer pay attention in class, my OCD comes along with a lot of mental rituals. So now I get tutored at home and am on Paxil, Lamictal and Zyprexa. These are not substances that I abuse, nor do they interact with Benadryl as far as I know. I've been abusing OTC drugs for about 2-3 months, I've tried basically everything. Last summer I abused Vivarin, Alcohol and the prescription medications Xanax, Klonopin and Ambien. I even tried Tylenol once or twice, thinking it had Codeine in it, maybe I should have read the label. Recently, it's been Tussin and Benadryl primarily. I tried Dramamine last week. The experience is equivalent to Benadryl as far as I'm concerned, maybe a little less cotton month. Two weeks ago I was hospitalized after I chugged an 8 oz. bottle of Robotussin, and now have to go to groups three to four times a week. I was clean for about a week and a half, and then got the brilliant idea to start up again.",
  "I was staying at my dad's place, and I told him I was going for a walk. I had to leave my wallet with my mom, but snatched 20 bucks from her purse. I've swiped bottles of liquor from grandparents and uncle, and feel terrible about it, but I can't say I won't do it again, because I'm an addict. So, I bought Dramamine, some Benadryl and Robitussin. I took them one by one every night, and last night I was down to 19 liqui-gels of Dye-Free Benadryl. I had initially decided to swallow only 17 of them, but then decided to go ahead and take the other two.",
  "It kicked in about an hour later, as I noticed the lines on the wall that seem to quiver. I also began to mildly hallucinate, seeing flashes of imagery before my eyes. It didn't matter whether they were open or closed. Watching TV, nothing spectacular happened. I looked back at the doors to my closet, and there seemed to be blotches of color somewhere between red and pink. I went downstairs to the bathroom, and saw the quivering lines in the toilet bowl. The side-effects were a pain in the ass to deal with, as they always are. Not being able to burp and making swallowing difficult. As I got up to wash my hands, I heard my mom call for me, or so I thought. I was suspicious that it was probably the Benadryl, so I went upstairs and asked. She hadn't called my name. I went back to my bedroom and continued to hear voices, they would sometimes come from outside of my room, but they were mostly in my head. I would respond to them in my head, I don't recall actually vocalizing. The voices ranged from a girl friend of me, my family, people I had talked to on the phone the previous day.",
  "It was impossible to located objects, it took me literally minutes to find the remote controls for my TV. It was also difficult to turn my lamp on, which I decided to place right next to my bed for convenience. I went to talk to my mom a couple of times, and would instantly forget what I was talking about. She picked up on it, and was debating as to whether or not I had taken anything. This afternoon I just told her I was sick. On the way back to my room it was dark and I saw blotches of colors once again, and loudly bumped into things. The voices continued for another 2 hours, or so, the patterns had begun to fade.",
  "I took 3 mg of Xanax along with some supplements around the 4 hour mark, and watched TV. After about another hour, I decided that I was going to walk to the drug store today and pick up some more shit before my mom got up. I ended up falling asleep. I took my walk in the late morning, disoriented since I had no recollection of falling asleep. I purchased 2 containers of Robitussin cough-gels and another package of Benadryl. I'm planning on doing the DXM tonight, along with 2 liqui-gels as I usually due to prevent an allergic reaction.",
  "One day I'll stop. I'm determined to. I guess it's just not my time. I don't know. God has given me many chances to redeem myself, and I still haven't learned my lesson. Everyone should be aware of the dangers of these meds. They're not something to fuck around with. I wish I had never started. I've got a long road ahead of me."
 ],
 "erowid": {
  "id": "31727",
  "citation": " BIGDaddyachmed69. \"Another Day in my Life: experience with Diphenhydramine & Alprazolam (Xanax) (ID 31727)\". Erowid.org. Nov 14, 2007. erowid.org/exp/31727",
  "substance": "Diphenhydramine & Alprazolam (Xanax)",
  "views": "13183"
 }
}
