{
 "title": "Becoming a Factory",
 "author": "KingSpade",
 "citation": " KingSpade. \"Becoming a Factory: experience with Salvia divinorum (5x Extract) (ID 52513)\". Erowid.org. Sep 28, 2008. erowid.org/exp/52513",
 "substance": "Salvia divinorum (5x Extract)",
 "bodyweight": "150 lb",
 "report": "<p>It was 3:00 PM today when I loaded up my bowl with the salvia 6x extract I had received on this fine 420 holiday. I took in a hit and held it until my exhale revealed no smoke. As I laid back I began to feel a little weird, looking around my dimly lit room. This was not going to be enough! This is what I had heard in my head. I quickly loaded up another hit, thinking I didn't have much time. I breathe in the harsh smoke, setting down my pipe as I lay back on my bed.</p><p>I can't really say how the trip started, my memory is weak of the whole event. Before I knew it though, I was part of an extremely complex system of gears, like I was in some kind of bizarre factory. I found my hands straight up in the air as if I was turning a large gear, when I realized what I was doing I was shocked! Still, I kept turning the gears, as I WAS a gear and there was nothing I could do to stop my hands from taking part in this! My room was looking extremely crazy, and as I glanced to my ceiling fan something odd happened.</p><p>It was like my legs were really long and liquefied and were running up into my dimmed light of the fan. I couldn't really tell if my legs were flowing up into the fan or if they were pouring down from the fan, maybe a combination of both. I was hearing alot of voices, like alot of people screaming, but one voice stood out from the others. It was kind of a higher voice, coming from behind me to the right, and it was saying 'He doesn't even know what he's doing!!' over and over again. 'Oh yes I do,' I thought to myself. 'I just smoked some salvia!' is the next thing that finally popped into my head. I jumped up and shut the lights off, stumbled/floated across my room and pulled the blinds shut. I then laid back down to attempt a 'break through'.</p><p>As I laid, my vision went back a little bit and viewed my body as a whole. I was in complete blackness and my body had a thick white outline to it. I was trying so hard to let go, and the further I let go, my body would begin turning from the white to green, filling in radiantly. The green was a weird energy/spirit and I was doing by best to let it overcome me. I remember the voice continuing to speak to me but I found it hard to remember exactly what it was saying. Unfortunately I do not think I achieved my 'break through' as my body never got completely covered with the 'green' and I suddenly came off my trip.</p><p>Overall it was a very interesting experience that I enjoyed. I plan on attempting to get back to this 'multiverse' very soon!</p>",
 "year": "2006",
 "id": "52513",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-28T07:00:00.000Z",
 "views": "2533",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 6x)"
  }
 }
}
