{
 "id": 5253,
 "title": "A Bend in Time",
 "date": {
  "submission": "2007-11-14T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Killthinking",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  },
  {
   "time": " T+ 0:10",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "<p>I decided to pick up the salvia the day after I discovered a local shop that carried it.  I purchased 1 gram of 10x extract for 35$ which came with a page of back round information and instruction on salvia which I found respectful of the suppliers rather than selling it as a pot alternative.  I eyed the bag of dark crushed leaf, suspicious of its potency or power.  Me and my companion who I will refer to as G drove down to the waterfront and walked out onto a small peninsula and sat next to a welcoming tree on a large rock.  The peninsula looked across the iced over, snow covered lake as the sun began to set.  It was a beautiful, mostly private (with the exception of the occasional dog walker), calm and safe environment.",
  "I packed a small amount of marijuana into my small hand pipe, to ensure the crushed leaf would not be sucked through the bowl, and poured a bowl full of the leaves from their small baggie.  I took the first hit holding the lighter above the herb as to burn it its hottest and held a lungful of smoke for about 15 seconds.  Then G proceeded to take a hit before passing the pipe back to me where I mimicked once more what I just explained.  I slid the pipe into my pocket and said Dude, wow.",
  "G didnt respond.  Which seemed appropriate and I let the silence engulf me as I just sat.  My heart had been pounding prior to my hit but I now felt comforted.  Things felt slower and comforting.  I didnt realize what exactly was happening until about 3 minutes later when I began to babble to G about this time bend concept.  I explained to him that I was in a bend in time.  I could visualize it in my head as a half circle being morphed and bended or melted.  I felt as though after I took the hit time was slowed down or just bent.  It sounds like useless babble even to me now, yet, during the experience I could grasp this concept very well and it seemed obvious to me that I was in a bend in time.",
  "I tried to close my eyes and I began to visualize my body splitting into two separate pieces yet; I was more fascinated by the natural patterns and designs around me.  I did not feel out of control at anytime like I have experienced many times with mushrooms.  I felt very calm and comforted by something intangible.  G was not as satisfied with his hit and suggested that I pack another bowl.",
  "I packed a bowl in the same way I stated earlier and aloud G to take the first hit this time.  I was more aware of the affects as they came over me this time.  Many people have described heaviness or pull downward with this drug; yet, I experienced an instant lightness and clarity.  It did not seem appropriate to be chatty while in the experience and I felt as though I connected most with it while being silent and listing and the few people who walked by did distract me from my concentration.  I began to notice a pattern in old dried moss or algae on the rocks near my feat.  I saw thousands of tiny crystals all within many flower shaped blotches of this dead fungi.  I tried to explain this to G by mumbling look at that rock I rambled about not judging the rock and excepting it, and that you could see its natural beauty once you just excepted what it had to offer you.",
  "This also was not something I successfully expressed in words.  All words seemed clumsy to me and I could not express the thoughts I was having logically through speech yet they were very clear to me. Its hard to gauge the actual extent of the experience and how long it lasted because the comedown seemed very gradual and I believe that the herb is capable of much more than this and I may have only reached threshold effects.  I am very interested in exploring deeper levels of a salvia trip and seeing where the plant plans on taking me.  All together I would say this drug has been pleasant and calm and I did not experience anything unpleasant.</p>"
 ],
 "erowid": {
  "id": "31742",
  "citation": " Killthinking. \"A Bend in Time: experience with Salvia divinorum (10x extract) & Cannabis (ID 31742)\". Erowid.org. Nov 14, 2007. erowid.org/exp/31742",
  "substance": "Salvia divinorum (10x extract) & Cannabis",
  "views": "2364"
 }
}
