{
 "title": "High School Drug Test",
 "author": "Lea",
 "citation": " Lea. \"High School Drug Test: experience with Cannabis & Various (ID 52541)\". Erowid.org. Oct 31, 2006. erowid.org/exp/52541",
 "substance": "Cannabis & Various",
 "bodyweight": "117 lb",
 "report": "<p>I had recently been caught with marijuana again at my school, this being my second offense, at our school once you are caught twice with anything you have to begin a drug testing program and start a drug group class thing. You may think Im a total idiot for getting caught twice but, this wasnt my fault. When I was high at school or had brought a stash in my car, I would hide my keys in the spare tire on the back of my Jeep. I drove my friend to school that day and she had taken my car during 5th period without asking with 3 others. After school when I approached where my car was supposed to be parked, I believed to be stolen, considering jeeps are the number one stolen car to be stripped etc. There is a cop at our school, I was telling him what had happened and given the description of my car, when behold it pulls to its spot, cop gets all happy about a possible bust and immediatley searches my car and it just went to shit.</p><p>The driver had morphine on him too which didnt help the situtation.</p><p>Anyways, even though I wasnt supposed to smoke, I did, quite a few times. Before this had happened I was a daily smoker of marijuana. Over spring break I popped various pills like valium, flexiral, morphine, and snorted MDMA powder. My first test was on April 16, a wedsday and I had smoked on saturday, the day before that, two days before that, and the first week I probably smoked 4 times.</p><p>So, to try and have clean urine, all I did was drink cranberry grape juice lite and A LOT of water. I also worked out, as in running a little over 3 miles, working out on the stationary bike, and some weights. Just a little bit of weights. Anything aerobic to work up a sweat. Im also a surfer so I had gone surfing 4 times between the time I last smoked and I test. Vitamin C pills also help because they help regulate my metabolism. I smoked the day after my test because it was my favorite holiday, 4/20, and I plan on doing the same routine, surfing, water, and cranberry juice. Cranberry juice does help clean out my system. The test was positive for Marijuana but the THC level was not high enough to be considered me recently having smoked. Eating healthy also helps, a lot of vegitables and fiber to help promote metabolism.</p>",
 "year": "2006",
 "id": "52541",
 "gender": "Female",
 "timestamp": "2006-10-31T08:00:00.000Z",
 "views": "7820",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
