{
 "title": "Getting Acquainted",
 "author": "Tim",
 "citation": " Tim. \"Getting Acquainted: experience with Kratom (ID 52589)\". Erowid.org. May 5, 2006. erowid.org/exp/52589",
 "substance": "Kratom",
 "bodyweight": "55 kg",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Kratom",
  "(tea)"
 ],
 "report": "<p>This is about my first encounter, in 2004, with the magic of Kratom.</p><p>Before I begin, I need to state that I'm not sure about the exact dose I took, because the form in which it was presented to me was not leaf, but more a plaque of a soft, solid, black substance (kind of like liquorice). I assume this meant it was more concentrated than regular kratom leaves, but I don't know how much more. All I'm sure of is that I drank a tea which was made of 5 grams of this substance. Now, on with the experience.</p><p>It was in the autumn of my experimenting days, the end of puberty. I had spent my highschool years under the influence of alcohol, cannabis and some shrooms. As college was approaching and I had less time of my hands, the time for experimenting seemed to come to an end. Starting a relationship with a girl  who wasn't exactly into that sort of thing (and who I am still glad to be seeing, to this day) didn't really help, either. No biggie, though, I seem to be doing alright.</p><p>In the holiday following the final exams of highschool, me and my brother had been experimenting with absinthe and several herbs acquired at the local 'smartshop' (in the Netherlands, this is where you buy magic mushrooms). None of them really worked, but up to then, kratom had evaded our attention. After learning about it, obviously, it was next on our list. My brother bought a few bags of leaves, and after trying to smoke the leaves in a bong a few times with no effect, we decided to let it cool for a while. That is, until my brother came across 10 grams of the black substance in a plastic bag.</p><p>One evening, when the time felt right...nah, now I'm just bullsh*tting you, we just didn't have anything to do, me and my brother decided to try the kratom. We boiled some water and let the kratom dissolve in it (which was a really convenient feature of this black form). The first sip of tea was awful, so we thought it would be a good idea to let it cool and make kratom lemonade. After adding more water and a whole lot of syrup, the taste was finally acceptable. However, it meant we had to drink quite a lot of it to feel some effect, which I later regretted. While waiting for the stuff to take effect to I went to my room to chat with some friends online and play a videogame.</p><p>Based on what we had read about it, we expected the kratom to be tranquilizing with no psychedelic effects. Just sedation. I returned to my brother's room later and we weren't experiencing anything significant. Well, not him, at least. I was not sedated, but about to puke.</p><p>So I asked my brother if he wanted to take a little walk. He agreed, but he didn't seem to be aware of my motivation, so I didn't wait for him and ran outside. I projectile vomited just once and strangely, my nausea was gone immediately, as quick as it had come up earlier. We started our walk and I felt better, but walking felt like too much of an effort, so we made it a short one and went back home. After chilling out a while in my brother's room, I went to bed. I turned on my lavalamp and put on Media Luna by Deep Forest. I couldn't have picked a better song for the moment. Watching blobs of lava go up and down on a slow beat was simply hypnotising.</p><p>I don't remember really going to bed, but I know I slept like a baby and I vaguely remember dreaming some intense dreams. If only I could remember any of them. I woke up with a fluffy feeling in my head, which wasn't unpleasant, but a bit distracting at times.</p><p>I can see why this drug isn't really popular, as nausea would be the reason I will pass next time I get a chance to use kratom. But I can also see the addictive side, as it is a simple, no nonsense feel-good drug. The dreamy part of the high was unexpected, but it can never be the reason I'd use kratom, as all dreams I had that night have vanished from my memory.</p>",
 "year": "2004",
 "id": "52589",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-05T07:00:00.000Z",
 "views": "6998",
 "dose": {}
}
