{
 "id": 5264,
 "title": "Sweet, Sweet Dreams",
 "date": {
  "submission": "2004-03-12T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Circla",
  "gender": "Female",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(extract)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Hops",
   "form": "(extract)"
  }
 ],
 "report": [
  "I suffer from severe sleep deprivation and depression in long periods, the current one starting in January and still going on. Recently the lack of sleep has started to affect my health, but I have found little help from traditional sources, exercise, herbal tea. Even prescribed sleeping pills didn't help, quite the contrary.",
  "Recently I rummaged through my drawers and came across a bottle of valerian and hops extract and decided to give it a go. I knew from previous experience how disgusting the mixture tasted, and also that I'd need quite a dosage to send me to sleepy-land. I poured myself about 0,5 dl (1/4 cup, I think) of water and ran a generous amount of the stinky substance into it. I had a bottle of water at hand to chase the stuff down (20-40 drops/4-5 tablespoons), as the extract tastes like rotten grass and worse. I did this couple of hours before I went to bed, because valerian usually takes its time before I feel the effect. Once in bed, I fell asleep almost instantly (in half an hour) and woke up only once during the night. Needless to say, it felt good to sleep through the whole night once in a while. I had sweet, hazy dreams, which were luminous and generally nice. I woke groggily up before 6am (had to go to school) and felt like sleeping 'til noon.",
  "After noon I had the strangest feeling of being a bit high, like I had smoked a small amount of cannabis. I had an urge to grin and smile all the time, and I wanted to talk a lot. I also felt very weary and lazy in a good way, and my limbs felt light and bit wavery. I had a very interesting time on my afternoon classes."
 ],
 "erowid": {
  "id": "31789",
  "citation": " Circla. \"Sweet, Sweet Dreams: experience with Valerian & Hops (extract) (ID 31789)\". Erowid.org. Mar 12, 2004. erowid.org/exp/31789",
  "substance": "Valerian & Hops (extract)",
  "views": "35612"
 }
}
