{
 "id": 5266,
 "title": "Happcodone",
 "date": {
  "submission": "2007-01-07T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Nor-T",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:57",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:20",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>Midnight: Just took 6 5mg/325mg oxycodone pills with a glass of water. My last meal was at 11:00AM.  My mood isn't to great actually because I couldn't go to a party I wanted to go to and I know my friends are there having fun. But hey theres always gonna be more parties.",
  "12:10AM:  I don't feel any on-set of the drug yet but I've gotten myself over not being able to go to the party because now my focus is the Oxy I took not something that makes me upset.",
  "12:25AM:  I'm coming up now, General mood lift, body high and warmth. My mental part of high has yet to take effect. I'm already begginning to feel the pleaseant itchyness.",
  "12:34AM:  Mental high is here, I feel much happier and have no care in the world.  I should of mentioned this in the beginning but I got my wisdom teeth removed and that is why I got the oxycodone.  But anyways I feel much warmer very comfortable and almost glad I couldn't go to the party.",
  "12:46AM:  I'm pretty messed up at this point and am nearing the peak.  I feel more itchy but it don't bother me.  I still feel warm and the body high is going great.  My girlfriend called and might be coming over in a little bit, I look very forward to seeing her. She doesn't know I'm on Oxy yet but is OK with drugs so I don't think she'll mind.",
  "12:57AM:  I'm peaking and took 2 more 5mg pills to keep the peak longer.  I'm finding it much harder to focus.  I usally like music on oxy but for some reason it just don't seem appealing.  I think if I smoked some Cannabis it would make the high better.",
  "1:20AM: I packed a bowl of Pot and began smoking no new effects yet.",
  "1:35AM:  I'm very messed up. This combination multiples of each other by at least 10X. I'm having minor OEV's but No CEV's.  The body high is intense. My mental part cannot comprehend or carry out normal tasks without trouble. I feel very warm and thristy.",
  "2:05AM: Tiredness has set in and hard.  I still feel great but I know I will pass out soon on my bed on on the couch.",
  "Conclusion:",
  "The only part of the high that really suprised me was how long it actually took to kick on without eating 13 hours before I took them.  I will definately save the rest of my oxycodone script and use it in the next month or so for this same great experience.</p>"
 ],
 "erowid": {
  "id": "31790",
  "citation": " Nor-T. \"Happcodone: experience with Oxycodone & Cannabis (ID 31790)\". Erowid.org. Jan 7, 2007. erowid.org/exp/31790",
  "substance": "Oxycodone & Cannabis",
  "views": "38320"
 }
}
