{
 "id": 527,
 "title": "Hello",
 "date": {
  "submission": "2007-03-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Squidgy Black",
  "gender": "Male",
  "weight": 53
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "inhaled",
   "substance": "Inhalants"
  }
 ],
 "report": [
  "[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "This is one of the wierdest experiences of my life, this happened just yesterday and it still freaks me out. Ok, me and my friend (D) were at one of our friends houses and we were bored so, we decided to go over the store and Huff some Butane. We went to the store and bout a can. Now, I'm not too experienced with phsycoactive substances and although I have smoked some pot ocasionally this was the first time I actually huffed enough to actually pass out.",
  "My friend (D) decided to leave it although he inhaled some and I had the can for the rest of the night, I started taking long inhalations through the middle of my teeth till I started feeling dissconnected from everything, my body felt light and I felt giddy. This was perfectly normal so I kept on huffing. 10 minutes later my head started to spin and I couldn't understand anything which anyone was saying, it was a heated conversation and both of them were shouting at each other, so I just shut up.",
  "I looked down to the ground and then I passed out, the wierd thing is, I didn't know when I passed out and no one noticed, I just remember looking at the ground and then for wat seemed like minutes later looking at my friend deeply in the eyes. I started freaking out and then realized that every time I moved my head the whole image seemed to blur and movements would trail into blackness, I was seing double and whoever talked to me sounded as though they were behind me.",
  "My friend saw me and came up to me and tried to see if I was really as bad as I looked, he asked me where I was and who she was and I answered after seconds of hesitation. Then, something strange happened again, her eyes suddenly seemed to move round her head and stop to stare at me, I said 'hello' sheepishly as it seemed the only thing to say and the echo was amazing. My hello seemed to bounce of ten walls before coming right back to my ear ten times louder than I actually said it! And by now the 'WHOA WHOA WHOA WHOA' sound which was in the back of my head started to increase a lot, and the trails seemed to move into a spiral in the middle of my head. I was too dazed and weak to actually think properly but it was a pretty wierd experience."
 ],
 "erowid": {
  "id": "11115",
  "citation": " Squidgy Black. \"Hello: experience with Inhalants (Butane) (ID 11115)\". Erowid.org. Mar 15, 2007. erowid.org/exp/11115",
  "substance": "Inhalants (Butane)",
  "views": "8836"
 }
}
