{
 "title": "At Its Best",
 "author": "Greenboy?",
 "citation": " Greenboy?. \"At Its Best: experience with Hydrocodone with Acetaminophen (Vicodin/Lortab), Hydroxyzine (Atarax), Amitriptyline (Elavil) & Ondansetron (Zofran) (ID 52729)\". Erowid.org. Aug 1, 2010. erowid.org/exp/52729",
 "substance": "Hydrocodone with Acetaminophen (Vicodin/Lortab), Hydroxyzine (Atarax), Amitriptyline (Elavil) & Ondansetron (Zofran)",
 "bodyweight": "155 lb",
 "report": "<p>Info: I've used my share of drugs like opiates, from codeine (very weak), to morphine, heroin, & Fentanyl I.V. (very strong). Depressants like valium, ativan, and xanax. I've also used soma a muscle relaxer, weed, cocaine, ketamine, and XTC or E before. I'm very healthy and Ive never had any problems with addiction. Im a very experienced drug user. Ive used drugs since my early teens.</p><p>Okay so I fractured my right arm a few days ago, and Im in severe pain so I go to the E.R., it took 5 hours to just get a room. Finally the doctor did some exams (x-rays) and prescribes some 5mg-500mg hydrocodone for moderate to severe pain. She told me to take 1 to 2 tabs or 5mg to 10mg & 500mg-1000mg of Tylenol. I had some Tylenol with codeine lying around and used that instead for pain and saved the hydrocodone for later, man did I make a good decision!</p><p>Remember I was using codeine for a week straight before this so I probably developed a tolerance to it; codeine and hydrocodone are very similar substances. Okay I decide not to eat for 8 hours and not to take any pills. I grabbed 4 1/2 hydrocodone pills and break them in halves and swallow it with 3 ounces of water, which makes the effects last longer and it makes it easier on the stomach.</p><p>Time: 5-12mins: I start to feel relaxed and a little dizzy.</p><p>Time: 12-25mins: I started to feel more relaxed, dizzy, and have a very, very mild nausea. I felt great, mild euphoria and lightheadedness.</p><p>Time: 25-50mins: Moderate Euphoria, very relaxed, lightheadedness, and I started to talk to my dad, which I never do. I felt like if I loved everybody felt a good, strong high and felt that I was on top of the world. I though that it was about to peak and I was right, and I didnt want this to stop, it felt GREAT!</p><p>Time: 50-75mins: It has peaked!!! Man I felt awesome, Strong euphoria or high, now Im kind of itchy and I felt like if I breathe less but nothing major. It felt like a heroin high with the xtc hug everyone and morphines since of well being and pots relaxing effect. I took some atarax 75mg for the itching because it was getting a little worse, some amitriptyline 25mg for anxiety, that way the high will last a bit longer and some zofran 8mg because I didnt want to puke while my parents were around.</p><p>Time: 75-100mins: I was still high the itching got a bit better. I still felt some nausea but I didnt puke. I felt great right now just those small discomforts. I went to my room and put on some relaxing music, it lets me enjoy the high better. I felt like chatting but I just wanted to stay were I was and enjoy everything.</p><p>Time: 100-150mins: Im starting to sweat and get dizzier my high is coming down; it was not as strong as before but still potent and very enjoyable. My itching finally stopped and I no longer felt nauseous. I still felt great just a little sleepier than before, probably the atarax & the amitriptyline made me sleepier. I felt like if I loved everyone.</p><p>Time 150-200mins: The high was still there, but now its moderate and I still felt sleepy. I still felt dizzy so I lied down. Now instead of feeling high I felt more relaxed than high.</p><p>Time 200-250mins: The high is hardly there, what a bomber Im starting to feel a little itchy again I think the dizziness and the lightheadedness stopped, but the relaxed feeling wont go away until tomorrow morning when I take a shower.</p><p>Time: 250-300mins: The high, dizziness, lightheadedness, nausea, itching, are all gone the only thing left was a little relaxed It was a great experience not the best, but a good one. I think I couldve had a better one if I hadnt taken the codeine for a straight week before.</p><p>Comparisons: Hydrocodones high is like a mix of heroin, E, morphine and weed. Like a heroins strong high, Es love everyone sensation, morphines well being, and pots relaxation and lightheadedness.</p>",
 "year": "2006",
 "id": "52729",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-08-01T07:00:00.000Z",
 "views": "18058",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "22.5 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "2250 mg",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 0:50",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Pharms - Hydroxyzine",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": " T+ 0:50",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pharms - Amitriptyline",
   "form": "(pill / tablet)"
  },
  "4": {
   "time": " T+ 0:50",
   "amount": "8 mg",
   "administration": "oral",
   "substance": "Pharmaceuticals",
   "form": "(pill / tablet)"
  }
 }
}
