{
 "title": "DiPT Distortion",
 "author": "EuFiHel",
 "citation": " EuFiHel. \"DiPT Distortion: experience with DiPT (and cannabis) (ID 5278)\". Erowid.org. Feb 27, 2001. erowid.org/exp/5278",
 "substance": "DiPT (and cannabis)",
 "bodyweight": "74 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "DiPT",
   "(powder / crystals)",
   " T+ 6:00",
   " ",
   "oral",
   "Cannabis - Hash",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>After a week of my experience with AMT I decided to try DiPT. I had taken 5-MeO-DiPT before (the first experiment with 5-MeO-DiPT can be read from here, under the title 'The Hillbilly Brother of LSD') and I was prepared for somewhat same kind of experience.</p><p>I paid 100 marks ($17) for 100 mg DiPT capsule. It seemed to be so much when compared to the 5-MeO-DiPT doses that I have had (usually 20 mg). I took the capsule orally, which was about an hour later that I had taken my vitamins. I was prepared (once again) for quite quick effect. But the effect didn't come so fast. After an hour I had the usual 'tryptamine buzz' which can be explained as a stimulation around and in the spine and the top of the spine. Although, I was prepared for a massive auditory hallucinations, I didn't get what I expected. Music didn't sound strange (although, some people may think psychedelic trance as a strange music). It didn't sound like tapes that someone had been pulling (like the music sound when I was experimenting with 5-MeO-DiPT). All and all, the auditory disortion was quite mild, like the whole experience. For me, the substance didn't 'open' any philosophical questions at the time. Maybe it was the set and setting.</p><p>The experience lasted for 8 hours. After 6 hours had gone by, I decided to eat some cannabis to boost the DiPT effects. I made the cannabis (hashish) to a fine powder and mixed it to a fruit tea with sugar and milk in it. It tasted quite good, suprisingly. After 2 hours (I don't know why it takes so long for me to be turned on and tuned in) I felt the effect caused by cannabis. It boosted the tryptamine effect just a bit, making me feel quite happy. I was actually giggling in my bed at the time. At the same time I was trying to watch a movie from the monitor, but my eyes felt tensed and I didn't enjoy watching the movie. I turned my computer off and went to sleep saying 'good night' to my roommate and giggling myself to sleep.</p><p>At the next day, I felt superb. Stimulated and truly great. All and all, I must say that DiPT felt like much more mild than 5-MeO-DiPT when it comes to hallucinations. Of course, it may be the cause of the set and setting, but although they play an important role, they don't count that much when the surroundings are more or less the same than before.</p><p>Anyways, it was a good experience all and all. Nice, but not superb.</p>",
 "year": "2001",
 "id": "5278",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-02-27T08:00:00.000Z",
 "views": "15705"
}
