{
 "title": "A Journey Lead by Love and Fueled by Hate",
 "author": "Valkor",
 "citation": " Valkor. \"A Journey Lead by Love and Fueled by Hate: experience with DXM (ID 52786)\". Erowid.org. May 2, 2006. erowid.org/exp/52786",
 "substance": "DXM",
 "bodyweight": "230 lb",
 "report": "<p>It was a boring Saturday night, more boring than usual. Earlier that day, several people contacted me and told me that (in essence) they'd call me with details of various parties to check out.</p><p>8PM Rolled around and nobody called. So I called around, with nobody answering. Not happy with the situation (it's Saturday, I gotta party!!!), I decided to try a higher-than-average dose of DXM (Dextromethorphan).</p><p>Making the quick run up to a local 24/7 pharmacy, I procured two 4oz bottles of a brand name maximum strength cough syrup. It tasted a little less sweet and a lot thinner than standard Robotussin.</p><p>Back at my apartment, with several DJ mix sets lined up of mostly psytrance and hard trance, I proceeded to do my best at chugging the aweful syrup of hell.</p><p>Half of the first bottle was in me, and I was already getting rather severe stomach pains. The thought seriously occured to me that I should stop and abort the trip. But no! I was determined to go where my mind has not gone before! Whilest chugging, I was chatting on IRC and going over a few other experience reports on DXM and read that eating something with carbohydrates helped with the pains.</p><p>Quickly, I took a ritual of: *chug* *drink* *eat a Combo* *drink* *gag*.</p><p>It worked well, but the pains started getting worse a few chugs into the 2nd bottle. Not wanting to blow chunks, and knowing that I've taken more DXM than I have in the past (previous experiences were at just a single bottle's worth or less), I called it quits. At this point, I was already on my way up. (1 & 1/4 of two 4OZ bottles, 354mg+88mg=442mg)</p><p>I said goodbye to those on IRC and headed over to my ill-prepared trip area (some call this, 'the living room'). I turned up the music a tad and laid on the couch, checking out the groovey and ever-increasing mesh overlays of closed-eyed visuals.</p><p>That was pretty cool and all, but that's not why I do drugs.</p><p>Thoroughly fucked at this point (an hour since I finished chugging, since a single hour-long mix had already played through), I got up and pulled out a futon mattress to the floor infront of the stereo and snagged a pillow from somewhere. I grabbed everything I needed; my bottle of water, a lighter, and muh smokes.</p><p>I flipped through the MP3 CD of mixes until I found a known-good track while smoking a cigarette. The smoke seemed to not exist. Although, what happened immediately after smoking one was definately real.</p><p>My world started vibrating. Rapidly. A lot like when I first started smoking cigarettes, and why I got hooked. Mind you, I smoke at least a pack a day, so there's no reason at all for nicotine to be affecting me that way still.</p><p>I laid down as soon as I extinguished the cigarette and chugged more water. Mind you, I was still vibrating. What happened next, is as follows:</p><p>--</p><p>The music didn't speed up.</p><p>It only intensified.</p><p>A thousandfold.</p><p>The beats came louder, the voices shrilled higher.</p><p>The symbols clashed and the synths yearned for more power.</p><p>A pyramid of corridors zoomed past.</p><p>A deep dark tunnel of pleasure and hell.</p><p>With a purpose. A plan.</p><p>Order.</p><p>Chaos.</p><p>A journey, lead by love and fueled by hate.</p><p>A jungle. No, mountains. No, clouds!</p><p>Soon enough, there was no Earth.</p><p>If there was, it was a speck of dim light against a dimmer background.</p><p>Clouds of energy spoke.</p><p>Of why.</p><p>The music reached it's climax, only distantly aware of my consciousness.</p><p>I fell down. The universe was rising.</p><p>The same.</p><p>Vibrant vibrating energy. It pushed me forward.</p><p>To a sea of the unknown.</p><p>'Do you really want to know?'</p><p>'No.'</p><p>The vibrations slowed. Barely.</p><p>Flashes of light, pure white and red.</p><p>A homing beacon.</p><p>Not to myself.</p><p>To others.</p><p>To beings long past.</p><p>To beings not yet.</p><p>Earth again. Home again.</p><p>Small. Nothing.</p><p>Nowhere.</p><p>God couldn't imagine this.</p><p>Humans created it.</p><p>--</p><p>That's the best I can describe things. Never once was I afraid or thought I was going to die, or any of the other crap that people often report happening. I was happy. I was at peace. With myself, and the world. That doesn't happen often with me, even with drugs.</p><p>That experience had taken another full hour (one whole mix set), and I was coming down quickly. I ran over to my computer to type the above up, and realized just how discombobulated my mind was. The desk was swaying more than it usualy does, the monitor was doing barrel rolls, and I've seen drunks type better than I was that night.</p><p>I smoked another cigarette. The vibrating came back. This is *REALLY* weird, I thought to myself. I've never experienced anything like it, and I've never read of it happening to anyone else. I was smoking my usual brand of Camel Lights, and it was the same pack from earlier that day, so they couldn't have been altered or suffering from some kind of factory defect.</p><p>For the next 3 hours, each cigarette would cause it to happen. It would last for maybe 10 minutes after smoking one, coming on about 2/3rds the way through the smoke. Very strange.</p><p>Typicaly, at this point, I would go to sleep. As soon as the mental haze wore off, I'd go pass out. But not this time. I decided to stay up and enjoy my almost-drunken state, which I did through the use of a few art websites and more inane ramblings and bad typing over IRC.</p><p>It was a whole lot like being drunk, but again, without the mental haze and the double vision, and, well, everything that makes being drunk suck so much. Very enjoyable, as far as this long-time pot head is concerned. Unlike previous experiences, I didn't wake up with the slightest hint of a hangover despite being forced to only obtain 4 hours of sleep (woken up by someone), nor did I feel even the slightest bit depressed the next day.</p><p>There's one huge reason why I think I had a great experience with DXM, and that's the fact that I took things slow when I was dosing, which also helped considerably to spread out the actual timeline to a full 10 hours.</p><p>I really wish there was more I could add, but I'll be honest, there isn't. I would like to note that I didnt' get the itchies nearly as bad as I usualy do with DXM. Everything about this trip was very atypical for me...</p><p>Happy tripping everyone! Stay safe!</p>",
 "year": "2006",
 "id": "52786",
 "gender": "Male",
 "timestamp": "2006-05-02T07:00:00.000Z",
 "views": "30642",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "442 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  {
   "time": "",
   "amount": " joints/cigs",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(plant material)"
  }
 ]
}
