{
 "title": "Colors Galore",
 "author": "M*F",
 "citation": " M*F. \"Colors Galore: experience with Salvia divinorum (ID 5279)\". Erowid.org. Jan 12, 2002. erowid.org/exp/5279",
 "substance": "Salvia divinorum",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "smoked",
  "Salvia divinorum",
  "(leaves)"
 ],
 "report": "<p>I sent off for a 1/2 an ounce of dried salvia leaf and was very happy to recieve my order in a couple of days.  I had to wait for the right time to do it, but it came.  It was about 11 o'clock at night and I filled up my water bong with some kiwi soda stuff, and took my first long hit, nearly passing out from holding it in too long.  Well, I didn't feel much, and packed another bowl, and took another long hit.  As I was holding it in, I felt like I was being lifted off the ground.  There was a hard tug upwards.  I put my bong away. </p><p>I walked around and felt really high, I would turn around a little and it felt like I was flung around, I was really off balance. </p><p>I went to lie down on my bed, feeling really good, and closed my eyes.  First off I didn't see much, but then I started seeing what looked like little joints, of very small fibers underneath a microscope.  They were rich in color, saturated in blue, then red, green, yellow, orange.  It was very asthetically pleasing, but I was kind of dissapointed.  Not for long...</p><p>All of a sudden, there was a flash of color and a multicolored, dimensional tarantula appeared, it then dissolved into dozens of smaller spiders that then turned into a liquid and started twirling around.  Then there were many patterns, and I saw palm trees, and fire, everything was in beautiful fluxuating color.  I loved it. </p><p>There was a huge flash, like lightning, I don't know if it really was or if it was the salvia.  I then drifted off into sleep. </p><p>This was a very goog experience of salvia, I highly reccomend it, and I will pursue learning about the plant and using it.</p>",
 "year": "2001",
 "id": "5279",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-12T08:00:00.000Z",
 "views": "5840",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 }
}
