{
 "id": 5280,
 "title": "Broken Walls Don't Stop Floods",
 "date": {
  "submission": "2007-02-13T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zimmie",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "LSD"
  }
 ],
 "report": [
  "A lot of repressed memories and dark parts of the past are somewhere in my head, always there, projecting all that evil shit that I couldn't deal with and tried locking away. Denial is a tool we all use, if it's blaming others for things you did, if it's irrational rage at the world, or just being pissed off at your girlfriend that dumped you for not thinking about her at all. My weekly sessions with my psychologist should have taught me that the barrier between the things we lock away and day to day life help us cope with reality.",
  "So when I bought a shitload of LSD, I should have thought about that. A triple dose, just to check out if this stuff is for real, and I was propelled into a beautiful daytime trip, enjoying relaxing music, seeing the beauty of nature and just having a great time hallucinating. I opted not to smoke marijuana to 'enhance' the trip, favoring a more lucid route.",
  "The next day, I had smoked some weed prior to going to my psychologist, 20 hours after the end of the trip - and a bit of that state of mind came back. I was more open than I usually allow myself, as we both probed into the sides of my psyche I don't like. I decided not to change a subject as I usually do when introspection starts becoming a painful ordeal.",
  "Upon leaving the psychologist, the barrier between all the bad emotions pent up in my subconciousness and my day to day life was broken, not shattered, but enough to see that there is a flood of darkness and pain inside myself. Driving back home, I was feeling a mixture of rage and pain aimed to it's source for a change. For the next three days, I was in a hard and lonely place, my spiritual pains starting to manifest physically. Until I went to a party, took another dose of the acid and danced like there's no tomorrow.",
  "Again, after I woke up, I saw that the wall skillfully built around my past was broken down again. I am now swamped with self loathing and hatred, I am having trouble with day to day tasks that never bothered me before, feeling more detached, less REAL. Identity slowly fading to a sum of all the crap in my past, and dealing with it is no easy task.",
  "The opening of the gates to the subconciousness is not something to be taken lightly - my trips were spectacularly enjoyable, but left a vulnerability that was not there before. Accelerating the progress of my healing in a way, helping me see with what I need to cope with, is one way you can look at it, as my psychologist has commented since that facing the parts that you don't like in your mind is the first important step to correcting the problem. Knowledge of not being psychologically stable at the moment of taking this drug was there. Other than that, the set and setting were perfect. The quality of the LSD is top notch, with the highest purity I have tried ever. There is no body load whatsoever, no loops, no muddled thought and no confusion but rather a spiritual experience.",
  "But the other way to look at what LSD did to me is much simpler. I was psychologically not fit to take a deep psychedelic substance, and took it anyways, something that fitted perfectly with my need to escape from reality. I have since been on the border of breaking down. Lack of energy, zoning out, overcomplicating everything simple in order to excuse myself from doing it, self loathing, hatred aimed towards everything, fear of others, fear of myself, and most of all, a hollowness that can be felt throughout my soul.",
  "I broke down a wall, but I wasn't prepared for what's on the other side.  I just wanted to escape. I escaped from a dark room and find myself in a dungeon."
 ],
 "erowid": {
  "id": "31853",
  "citation": " Zimmie. \"Broken Walls Don't Stop Floods: experience with LSD (ID 31853)\". Erowid.org. Feb 13, 2007. erowid.org/exp/31853",
  "substance": "LSD",
  "views": "13756"
 }
}
