{
 "title": "Insignificant First Experience",
 "author": "Sir Paul",
 "citation": " Sir Paul. \"Insignificant First Experience: experience with 2C-T-7 (ID 5281)\". Erowid.org. Jan 5, 2002. erowid.org/exp/5281",
 "substance": "2C-T-7",
 "bodyweight": "60 kg",
 "report": [
  "<p>A month ago I purchased a supply of 0.5 grams of 2c-t-7 from an online retailer. Although I have read extensively on the subject, I had never before taken a psychedelic drug (or any recreational drug except Cannabis, for that matter). The reason the supply remained untouched for this relatively long period of time is that I wanted to save it for the proper occasion, meaning a situation optimal in set and setting, with the right mood, good company and familiar location. Finally the time arrived: I phoned my friend V and asked her if she was willing to share the compound. Sure, she said. An arrangement was made to meet at my place at 9PM, which was optimal as my father, the only person I share the house with, was on a trip and, being Monday, it wasnt expected for him to return before Friday.",
  "V arrived; we talked a little, and proceeded to ingest the chemical. Expectedly, measurement was a problem. By then, I only knew about the method of diluting the powder in Vodka, but I didnt have an eyedropper. My best solution, then, was to divide the number of milligrams by the dose I was going to use in this and my next trips, 35mg (admittedly an arbitrary number). The number 14.3 was obtained, and this was rounded down to 14 (making each dose just a little stronger). The task was, then, to divide the substance into 14 equal parts. For that I used a ruler, and spread the crystals along it in a 14 cm line. My friend, who had taken cocaine on many occasions, was keener on this than me. The task, however, proved more difficult than what I had originally expected, both because of the obvious impossibility of having exact equal parts, and because of the fact that a little but not altogether irrelevant portion the powder tended to remain on the handling materials (ruler, table, card, etc.). Anyway, finally we set aside two doses, diluted them in a small glass of Coke and drank it.",
  "I remembered having read at Erowid or the Lycaeum that the drug took 2 hours to make itself manifest. In spite of that, I noticed that my partner started to report seeing visuals just at T+0:30! I was suspicious, both for the aforementioned information and because I wasnt noticing anything at all. She continued reporting perceptual distortions, and eventually (around T+2) isolated herself to experience this more fully. By that time, I was becoming a little anxious, since I couldnt discern any clear distortion, whether physical or mental, so I decided to visit Erowids 2c-t-7s effects page and there I read that the onset was between 1 and 2.5 hours. I returned to the living room, and proceeded to focus my attention in different things to see if alterations were perceived. Nothing happened. I began to reprimand myself for not having done the necessary preparations for this session. I had planned to do a Yoga session, some meditation, and read suitable material to obtain an ideal frame of mind - but I didnt, and I was getting slightly angry because of that.",
  "Finally I opted to follow a solution that I knew was strongly discouraged by all the available literature: taking an extra dose. Naturally, I wasnt going to go through all the burden of measuring again, so I just took a very little spoon and took what I considered to be 10mg (I had used that spoon before, to take my dose, so I calculated a third of the original size). Of course, this wasnt wise, especially since it was my first experience psychedelic experience, and overdosing, being completely unprepared to handle it, was an imminent danger. Moreover, in doing that I was ruining the possibility of making further measurements, since I now had a very vague idea of the total weight of my 2c-t-7 supply. But to my mind, all this was worth it: I wanted to maximize the intensity of my first experience, which, according to the majority of the testimonies, is always remembered as a very distinctive occasion.",
  "I went back to the couch and tried to relax and listen to the music (until then I had tried Bjrk, some trance, and assorted rock/pop music). I was going to change the CD, but the song Was it all worth it, from Queens The Miracle just began. Having being a Queen fan during my youth, but having then moved to other musical styles, I was taken by surprise by this composition, which I had never before listened with the attention I was devoting to it now. It is a true gem among Queens repertoire; under its influence, I had my first glimpse at the effects of psychedelics. It was certainly a very mild sensation, but it was definitely there. Afterwards I went to my room, where V was laying. I grabbed my portable CD player, put Astral Projections Another World, and reclined to explore some distant realities. I had some interesting escapist feelings (the same feelings that this kind of music gives you, only a little more accentuated), but very few visuals. I then sat on the floor, and started navigating through the pages of Floating 3D, a Stereogram book I had in my library, and which I thought would be a good be a nice companion to the mild psychedelic trip I was having. Indeed it was! The music began to synch with the images, and the tridimensionality of them fused with the trance melodies.",
  "After a while, I wanted to be alone, so I went to the adjacent room, closed the doors, turned off the lights, and allowed the music to guide my mind. Here the effects intensified. Now I was sure that I was not in a normal frame of mind. The 3D images gave place to some visuals. I started taking my clothes off, and then began doing some Hatha Yoga Asanas (always with the headphones on). This felt great! The combination of darkness, trance music (this record especially) and yogic exercise proved most suitable for the occasion. I strongly recommend this (incidentally, if you are interested in beginning practising Yoga, I emphatically advocate the perusal of Hewitts excellent The Complete Yoga Book).",
  "I remained like that for what seemed like an hour. Actually the duration was 30 minutes; I noticed this when I left the room and met V, who showed me the clock: T+5. By that time, I seemed to be tripping as strongly as, even more strongly than, her. This doesnt mean a lot by itself: she showed virtually no symptoms of a psychedelic experience, while I was just mildly experiencing them. The effects each of us had, anyway, were quite different: she could see distortions in almost anything (walls breathing, objects altering their shape, etc.) while I could only see visuals with my eyes closes, and they were never very strong. As regards the emotional (as opposed to perceptual) alterations, I noticed a feeling which was extremely difficult to describe, both because the relatively low intensity of it (and hence its lack of precise definition) and due to the fact that emotions are, by their very essence, an elusive subject. The sensation was slightly pleasant, but very different from, and less valuable that, the introspective, calm, oceanic or intellectual detachment I had originally expected in this kind of trip.",
  "The next two or three hours elapsed in a similar vein. Now I asked myself why hadnt I used the opportunity to explore with different kinds of stimuli (music, textures, art books, etc) or even analysing what I was experiencing, but at the time I felt I had discovered the perfect combination, and continued listening to the same record in the same, dark room. One thing I did concentrate on was on time distortion. The subject had always fascinated me, and I wanted to see whether I could experience something similar to -although, under the by know accepted mild trip, not as intense as- the astonishing reports one could find in the LSD or Mescaline literature. What I felt was more space, a higher amount of instants between each second. It was as if, between each beat, I could navigate freely through the physical (although, paradoxically, not very visual) realities the music was creating. But, once again, this wasnt a very strong sensation.",
  "At T+7 I thought the effects were beginning to diminish, and I began a long conversation with V. We were emotionally open but, alas, we were often like that without the ingestion of a substance! We talked about personal things, things I judge not to be very interesting to the potential readers of this page. We stayed like that until T+9. At that time each of us decided to go to bed. The effects, in my case at least, were not completely gone  but they lacked the necessary intensity to make the prolongation of our sleepless night a worthwhile cause.",
  "In conclusion: my first 2c-t-7 trip was in the verge of being a disappointment. I didnt experience any particularly unusual perceptual or emotional effects. It didnt have the spiritual implications I was hoping to feel, either.",
  "Im glad, however, because the knowledge here obtained will enable to create a second experience that will hopefully attain some of the values I was seeking in the first one. In practical terms, this means preparing the session through reading psychedelic or spiritual literature two or three days prior to the trip (like Masters The Psychedelic Experience, Huxleys Moksha or Learys version of the Tibetan book of the dead); fasting for more than one day, doing Yoga, meditating, and tripping alone. Most important, it would mean not ingesting the compound unless Im completely sure of being in the right mood.</p>"
 ],
 "year": "2001",
 "id": "5281",
 "gender": "Male",
 "views": "16613",
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 2:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2002-01-05T08:00:00.000Z"
}
