{
 "id": 5282,
 "title": "Induced a Seizure",
 "date": {
  "submission": "2006-09-01T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kris",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Lithium",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "LSD"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "DXM",
   "form": "liquid"
  }
 ],
 "report": [
  "It was after finishing my exams, I was getting ready for Christmas vacation, was tired from studying but very relaxed and happy to have the chance to trip.  I had a cold, I'd been taking over the counter cough syrup (Nyquil and Dayquil) which had apparently elevated my Lithium levels (I didn't know there were certain over the counter drugs I was not supposed to take with Lithium).  I took two hits of LSD that within 5 minutes it led to grand mal seizures that put me in the ICU for 3 days. ",
  "I personally don't remember the majority of the event, I remember taking the acid, feeling like something was wrong (anxious, a helicopter like booming noise) I thought it was my first 'bad trip' but luckily I didn't isolate myself but instead quickly went to a group of friends in a nearby dorm room.  I sat back on their couch, tried to relax, things quickly swirled into unintelligible nonsense, noises sounded like the Charlie Brown teacher, and that's all I remember. ",
  "I've been told I stopped responding, fell off the couch, and starting seizing uncontrollably.  I'm not sure how long the seizures lasted but from the ambulance report I was still having them all the way to the hospital and in the ER.  I was given a spinal tap, cat scan, EKG, various drugs to stop the seizures, and admitted to the ICU where I stayed for 3 days.  I remember bits and pieces from the ICU, and bits and pieces of the week following my release from the hospital.  I had a lot of bruises, trouble walking, a very swollen chewed up tongue and was quite a mental and physical wreck for the next month, though conveniently it's not well remembered. ",
  "Within 6 weeks of the event I was mostly recovered taking classes at my college again, going to work, etc. though I was physically sore (bruises healing, hard to walk) for about 12 weeks total.  It was diagnosed as a drug overdose in the reports from LSD though I think it was more the combination of LSD and elevated Lithium levels (dehydration goes with elevated levels as well as the possible reactivity with the LSD), and fatigue that lead to the seizures. ",
  "I have now (3 years later) been cleared as perfectly fine, though I do have some voltage asymmetry on EEGs it's nothing out of the ordinary.  As the neurologist said 'I have a very healthy brain.'  A month after the seizures I stopped taking the Lithium and have not taken any kind of prescription psychologically related drug.  I am fully functional academically, socially, etc. without the use of antipsychotic drugs (Lithium).  It turns out the prescription for Lithium in the first place was a misdiagnosis and a mistake on the part of the Doctor.  Needless to say, I have not done any sort of illegal drug since that event."
 ],
 "erowid": {
  "id": "31861",
  "citation": " Kris. \"Induced a Seizure: experience with LSD & Lithium (ID 31861)\". Erowid.org. Sep 1, 2006. erowid.org/exp/31861",
  "substance": "LSD & Lithium",
  "views": "12029"
 }
}
