{
 "title": "Weird and Shocking",
 "author": "Twiztid_13",
 "citation": " Twiztid_13. \"Weird and Shocking: experience with MDMA (Ecstasy) & Zolpidem (Ambien) (ID 52825)\". Erowid.org. Apr 30, 2008. erowid.org/exp/52825",
 "substance": "MDMA (Ecstasy) & Zolpidem (Ambien)",
 "bodyweight": "158 lb",
 "report": "<p>This was the most weirdest and shocking expierence I have ever had. I got a couple x pills from a friend. We both done them around 6 in the afternoon. I took one at first then the other two around 9. They were really good pills.</p><p>Well I had got some ambien from another friend, I have never takin them before. So I pop one 10mg pill around 12am. About 15 mins later I felt really relaxed. I started to hallucinate a little, but this seemed like it was normal cuz I wasn't getting freaked out or paranoid at all. I could pull the walls to me and let them go, like they were on a string. I have a fake plant in my living room and it kept moving like there was wind blowing.</p><p>I then got really sleepy and went to bed, well I thought I did. My girlfriend told me that I got up and was crawling on the walls like a crab. This really freaked me out when she told me this the next morning. She said that I cooked two pots of noodles and poured them in the garbage. She also said I had the front and back door to the house open with all the lights on and went and got her outta bed and told her there was twenty people in our front yard.</p><p>I got up the next morning and felt fine and normal, but after she told me what I had done, I was shocked. I was really curious if it was just the ambien, so I took 1/4 of a pill a couple nights later without any other drug, and it was like a normal sleeping pill. That is the craziest trip I have ever had, but I don't think I wanna do it again.</p>",
 "year": "2006",
 "id": "52825",
 "gender": "Male",
 "timestamp": "2008-04-30T07:00:00.000Z",
 "views": "8585",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 3:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 6:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 }
}
