{
 "title": "The Sun is the Same in a Relative Way",
 "author": "Erock",
 "citation": " Erock. \"The Sun is the Same in a Relative Way: experience with Mushrooms (ID 52835)\". Erowid.org. Oct 3, 2007. erowid.org/exp/52835",
 "substance": "Mushrooms",
 "bodyweight": "165 lb",
 "report": "<p>I am a college student, fairly experienced with drugs. While I enjoy pleasure drugs much more than psychedelic ones, I do enjoy tripping. This was my third trip on shrooms, and I have done them more times since then.</p><p>It was a Sunday night and I had just returned to my college after a weekend at home. It was snowing that night, and it was very beautiful. I figured my state of mind was pretty normal, although I had been going through a bit of anxiety and depression, which always happens when I go home. I had been doing pretty poorly in school and felt like I was letting my parents down. Also, three days earlier I had gone on a bit of a coke binge, but I was over any after-effects of that, and had only smoked since then. Anyway, though, I was feeling happy to be back at school and around my friends again, and was looking forward to a night of drinking. However, when I came back, one of my friends was tripping. I still planned on drinking, but then some more of my friends decided to trip, so I decided to take my mushies. While I hadn't planned on taking them, I was really excited to be doing them that night.</p><p>I had only done mushrooms twice before this, once at my house and once at school. My trip at home was incredible, yet not very emotional or introspective. My trip at school was barely saved from disaster. I took them with no regard to set and setting, and ended up terrified for about 15 minutes trying to find a room to go to. I eventually found a friends room and tripped with him, and enjoyed a very, very euphoric trip while watching an Incubus DVD. I had read a lot about trips being connected, and this night I really wanted to recreate my first trip. Knowing that I like to be alone while I come up, I decided to take them in my room and be alone for the first hour. I planned on meeting up with my friends after I started tripping. Ya right.</p><p>I went to my drawer and took out my shrooms, or as I should say, shroom. It was one large mushroom, weighing out to 3.8g. I chewed it up really well and held it in my mouth for a while so that it could be absorbed faster. Then I decided to lay in my bed with the lights off and wait. Now, from my experience, shutting the lights off is the best way to trip on mushrooms. Too much light ends up distracting me, and without the visual distraction I am able to focus inwardly, which, I think, is the greatest asset of mushrooms. Before I lay down in my bed, I decided to put Pink Floyd's Dark Side of the Moon on. Clichd, but I thought, 'Hey Pink Floyd is trippy, and I am going to be tripping, sooo.' Well, on mushrooms, you really don't need any help being trippy, and I am sure that the dark atmosphere of the music had a huge effect on my trip. I have later learned that happier, lighter music is sometimes better, although Dark Side of the Moon did create some interesting experiences.</p><p>About 20 minutes after ingestion I started noticing the typical effects: halos around light, brighter colors, breathing walls, water-like surfaces. I noticed my mind wandering, and I abandoned logical thought as thoughts began to race. I was starting to feel the music. The guitar solos in 'Money' and 'Time' put me in an extremely euphoric state of mind. I got under my covers and started to gnaw on my blanket. It was at this point that I figured that I wasn't going to be meeting up with my friends. I restarted Dark Side of the Moon a few times, feeling progressively more and more high each time. Walking became a chore. The third time would be the last time I restarted it.</p><p>Soon I began to trip pretty hard. I saw Mick Jagger and apologized for listening to some of the 90s music I listened to. I promised him I would listen to more blues. I saw literally hundreds of faces in the room. Any light turned into a face, yet all the faces were the same, all of which changed every few minutes. They looked 2 dimensional and oscillated in the air, like they were cutouts hanging from a string. Then my roommate's computer cords and TV began to grow into a thick, dark green garden. Bugs began to fly around it, and somehow I began seeing beams of light in the dark room. I looked at the small light coming from his PS2, and, for some reason, thought that this light was going to be very important tonight.</p><p>I don't remember exactly when it happened, but it happened quickly, very quickly. I began thinking of every person I knew, and the complexity of life overcame me. I couldn't understand how I could know so many people, so many faces. Who were they? I was confused as to why people had different faces, when, in fact, everyone is the same. It was now that I began to feel like I was preparing for something. Then, BAM! All of a sudden, I was in a trance.</p><p>For the next few hours I was totally (let me repeat: totally) unresponsive to any outside stimulus. I know I didn't fall asleep, because I would occasionally see something in the room, but I was in a trance. My thoughts were racing faster than anything I have ever experienced. Every memory I ever had flooded my brain. I saw literally every memory I ever had: I saw the beautiful mountains of Norway that I had hiked some summers back. I saw my earliest childhood memory of a girl from my neighborhood drying out all my markers. I saw myself winning my high school soccer championship. Literally every memory.</p><p>Then, all of a sudden, the music stopped. My memories, at once flooding my brain, stopped. Now, my brain filled the void by racing through totally random thoughts. Thoughts that were in no way connected, I just became confused. Why was I thinking this fast? Interestingly, this was the first and only time that I forgot that I had taken any drugs. Then, with these racing thoughts in the background, I began thinking very logically (or at least I thought at the time). I told myself that I had somehow made a terrible mistake in my life, and now I was in an eternity of hell. I don't remember how my body felt, but I thought that hell must be an eternity of these rushing, random thoughts. As I came to this conclusion, I began to accept it. I told myself, if I am going to be here forever, I might as well get used to it.</p><p>Still in the trance, and still under the impression that I had taken no drugs, I thought that I had taken it too far. My life, I had pushed myself too far, and now I was in a hospital bed with my parents looking over me, disappointed. I looked again though, and it wasn't disappointment, but love. I had made a terrible mistake, but they still loved me. Then I realized that even if they seemed unhappy with me, they still loved me greatly. It was in this trance that I told myself that I could never kill myself or anyone else, because we all love each other too much.</p><p>That's when I got very scared. Maybe I really had died. I saw the sadness on my parents faces and said to myself: I am not dead, and I am going to prove it to myself. It was then that I got myself partially out of this trance. I looked to my clock and saw some numbers. As anyone that has done mushrooms can attest, time is absolutely meaningless on mushrooms. 2:57? What does that mean? I remembered, only momentarily, though, that I was on mushrooms.</p><p>Thoughts were still racing through my mind, but I pushed these to the background, and decided to make some tests for myself to prove I was alive. I began to breath slowely and regularly, hearing and feeling my breaths. Test passed. Then I decided to count. This was a particularly interesting experience, because I would hear and see all my random thoughts, yet through that I would count. One, two, three, up until 16. Why 16, I don't know, but the whole time I was counting I couldn't help but think, 'Aren't their more numbers?' Between 1 and 10 seemed infinite, even if I only counted 10 numbers. Either way, test passed. My final test was to bring my head up and look at the light. I looked up and saw my roommate's PS2. It was at this point that I knew that I was alive, and I relaxed a bit.</p><p>As I was coming out of this trance (yet still not really aware of my surroundings) some of my friends knocked on my door, but I just yelled out to come back later. They laughed, as I probably would have. They didn't understand. As I came out I got up and walked around my room. I went outside for a cigarette and then smoked a little weed and laid in my bed, utterly exhausted. I had died and felt reborn. I almost felt on a higher level than everyone else, and still feel that I got more out of mushrooms than any of my friends.</p><p>Looking back on this now, it's tough to classify this trip, as all mushroom trips are. In many ways it was the most unique and moving experience I ever had. After talking with more experienced friends about it, they explained that I underwent a process called ego death and rebirth and said it had happened to them before and was very common. And, yet, I still felt like they just didn't understand and that my experience was indeed unique. To this day, I still feel like that experience was something special, even after taking mushrooms again.</p><p>It was after this experience that I finally began to respect mushrooms as more than a drug. You don't just 'get high' on mushrooms. They are too perfect. Everything from my trip seemed to mesh perfectly. That is not to say that it was totally enjoyable during the trip. I literally thought I had died. I was in (im?)mortal fear for not just my life, but my soul. I saw death, and I didn't like it. My rebirth, also was in no way euphoric or liberating. I felt lucky to make it out, and incredibly thankful. I finally saw how frail this thing we call reality and life really is.</p><p>Yet even though it was a terrifying experience at times, I have always been glad I had it. You can go into a mushroom trip and want to achieve something. I just wanted to hear some trippy music and then go hang out with my friends. Yet, once I took them, they reduced me to mt most primal being.</p>",
 "year": "2006",
 "id": "52835",
 "gender": "Male",
 "timestamp": "2007-10-03T07:00:00.000Z",
 "views": "2751",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3.8 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
