{
 "title": "Bliss and Amoebas",
 "author": "Rev. Tryptafeind",
 "citation": " Rev. Tryptafeind. \"Bliss and Amoebas: experience with Morning Glory & Salvia divinorum (ID 52832)\". Erowid.org. Mar 5, 2009. erowid.org/exp/52832",
 "substance": "Morning Glory & Salvia divinorum",
 "bodyweight": "147 lb",
 "header": [
  [
   "DOSE:",
   "305 ",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "report": "<p>I didn't take any drugs the day before this so I wouldn't have any chemical interference.  I have ingested/smoked/insuffalated many psychedelics including 2C-I, 2C-E, MDMA, MDA, Salvia, 5-meo-dmt, Psilocin, mescaline, LSD, and many others.  I have had one other attempt at Morning Glory's but i got the wrong type so they made me even sicker. </p><p>About the seeds.  The seeds were from a large online vendor.  They were untreated and 100% viable to grow.  I had 305 seeds total.  I ingested them on a half full stomach.  I ingested them slowly to ease any of the nasuea that i might have experienced (never did feel nasuea, just a clean body high:))</p><p>After ingesting seeds I took a hit of salvia.  20 X extract, very nice hit.  All i really remember about it was a spot being opened up in the room i was in.  Like a window of clarity.  I distinctly remember thinking how beautifal that spot was.  I was calling that spot the sun for some reason.  I think it had something to do with my reading about how the morning glory seeds were supposed to be the semen of the sun god in aztec culture.  But during my trip that spot was the sun, my surrondings slowly became the rainforest. but it was over before it could begin.  I felt a need to ponder this trip so I went to lay down and think.</p><p>1 hour later I awake to feeling a slight mood boost and sensing a brightness of something beginnning.  I woke up right in time for the come-up.  My enviroment wasn't to freindly for someone who was on a new psychedelic.  I decided a bike ride wouldn't be to difficult at this point in my trip.  I took another hit of Salvia before I left and nestled myself into the arms of the sun-god to observe my surrondings through his eyes.  It was really mellow and relaxing. </p><p>When i came out of it I decided it was time to go so I said my farewells and grabbed my bike.  This bike ride was one of pure beauty, I live in Alaska so the quality of the nature is really good.  I rode a trail the entire 4.5 miles home.  It was relaxing and gave me time to think about the effects of this wonderful seed.  I felt as though i had known this feeling however slightly more harsh.  I had reached a point of personal bliss i had never felt with acid.  or any other chemical for that matter, aside from mescaline and psilocin.  I loved the nature around me in a way i have never before.  I felt the tree's around me, my immediate surrondings shaped my mood.  I was nearly home.  I pulled off the trail and through the park when low and behold there was two cops.  I felt a little rush of paranoia until i noticed them taking a man into custody.  Thank God i probably would have gotten mugged for my bike. </p><p>I made my way down the road until i got to my street.  I arrived at home in less than half an hour. Not bad for tripping.  The rest of my night was consumed with staring at the ceiling and watching it morph from Amoebas to chemical structures of many of my favorite molecules to a sea of flowing cottage cheese.  When i went to bed i had many closed eye visuals, the most memorable was when i saw myself standing at the mirror and then it went to through my eyes vision and my reflection turned into a dinosaur and i turned into a dinosuar and started marching around the jungle.  It was the best closed eye imagery i have ever had. </p><p>By far morning glory seeds were better than any acid i have found in alaska, So i think i will work more with them, possibly in combonation with mescaline.  However i have felt a little drifty ever since, like my brains a little foggy.</p>",
 "year": "2006",
 "id": "52832",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-03-05T08:00:00.000Z",
 "views": "2681"
}
