{
 "title": "April Skies",
 "author": "April",
 "citation": " April. \"April Skies: experience with Cocaine, Mushrooms & MDMA (Ecstasy) (ID 52846)\". Erowid.org. Oct 3, 2008. erowid.org/exp/52846",
 "substance": "Cocaine, Mushrooms & MDMA (Ecstasy)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   "",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   " ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   "",
   "1 capsl",
   "oral",
   "MDMA",
   "(capsule)"
  ]
 ],
 "report": "<p>Although I should be writing two college papers right now, the wastebasket full of tissues and the pseudoephedrine medication Im taking is making me want to write a story for recreational drug users like me.</p><p>My college had a weekend of drug-friendly partying around four days ago.  This party lasted for 3 days and during that time, I had taken about 7 various drugs with no bad side effects.</p><p>On the third day of partying, my limit had been reached.  I am a tall, skinny girl and had been blowing cocaine from morning until night for three long, blurry days. On that third day, I had just finished off about 0.5 grams of cocaine and then took shrooms around 9pm.  Normally, shrooms induce pleasing visuals and a feeling of intense happiness, but that was not the case on that Saturday.  It might have been the coke, it might have been the type of mushroom, but I had the worst trip of my life.  To sum it up, there was a massive amount of emotional babbling and I spent a good hour deciding whether or not I should laugh hysterically or cry.  To make it better (being the smart, overachieving student I am), I did more coke.  and then I took a capsule containing 1 and 1/4 of a normal dose of MDMA.</p><p>Oh, how the lights were brighter, how the night sky shrouded me in its warm blanket, my body as perfect as a porcelain doll. My friends and I walked to a ballroom playing hip hop and the occasional electronica and I danced until I couldn't feel anymore.  I danced until the beats stopped making sense and my legs disappeared from my senses. I left the room and lay down nearby.  In an euphoric state, I came in and out of consciousness like I was laying on top of the incoming tides of the ocean.  Everything felt perfect, but someone was telling me I was overstimulated.  I swam the waves until 3 in the morning and eventually walked back to my room  and I didn't even get to have sex with my beloved on e.</p><p>My point is, you can be young and crazy but careful with the stimulants.  Cocaine is beautiful on its own.  ecstasy is like an orgasm for your entire body on its own.  Mixing the two just resulted in frying my serotonin neurotransmitters and I ended up somewhere thinking everything is wonderful while collapsed on the floor with worried friends watching over me until I regained full consciousness and floated back to my room.</p>",
 "year": "2006",
 "id": "52846",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-10-03T07:00:00.000Z",
 "views": "5607"
}
