{
 "title": "Long-Term Use Helpful and Relatively Safe",
 "author": "Mom and Friend",
 "citation": " Mom and Friend. \"Long-Term Use Helpful and Relatively Safe: experience with Codeine (ID 52841)\". Erowid.org. Jan 5, 2008. erowid.org/exp/52841",
 "substance": "Codeine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Codeine",
   "(daily)"
  ]
 ],
 "report": "<p>After a long-ago youth spent in researching and enjoying mind-enhancing substances, I'm now a solid citizen - a middle-aged parent of two small children, happily married, gainfully employed, and not even drinking alcohol, let alone drugging for fun. But many years of rheumatoid arthritis and now osteoarthritis make most days rather painful if I wish to do anything silly like walk or work. NSAIDs like ibuprofen make gastric and duodenal ulcers and acetaminophen doesn't work, which leaves ... opiates. I have the wonderful good fortune to have a physician who is not afraid of prescribing long-term and in sufficient strength to get the job done, so I take 120 mg every 3-4 hours around the clock - and I am able to enjoy my life. There's no high, just pain relief and the serenity that comes from knowing I'll be able to care for my family and do my jobs.</p><p>I have to pay attention to the gastrointestinal effects of opiates long-term, and I take docusate calcium 240 mg three or four times a day along with a fiber-based supplement, and all is well on the loo.</p><p>Thank heaven medical practice is finally realizing that chronic pain can indeed be treated with chronic opiates, without turning the patient into an 'addict' or a zombie. If I were to find myself without codeine for 72 hours or so, I'd feel like I have the bad flu, but that's all, and I've survived worse. In fact, sometimes I do without just to judge my baseline without, to make sure I'm dosing myself appropriately.</p>",
 "year": "2006",
 "id": "52841",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-01-05T08:00:00.000Z",
 "views": "11049"
}
