{
 "title": "Ominous",
 "author": "Mokothar",
 "citation": " Mokothar. \"Ominous: experience with Ether (ID 52871)\". Erowid.org. Oct 7, 2007. erowid.org/exp/52871",
 "substance": "Ether",
 "bodyweight": "74 kg",
 "header": [
  [
   "DOSE:",
   " repeated",
   "inhaled",
   "Ether",
   "(liquid)"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>My first experiences with ether date back some time now, I've decided to write down some of them so maybe others can benefit a little from them.</p><p>It started when I was cleaning up some paint spots, ether was one of the solvents I tried. It came in a glass, amber bottle of 100 ml, medical grade diethyl ether. My mom had bought that bottle some time back, I never gave it much thought before, and neither directly afterwards. A short amount of time after that, several days, there had been some trouble, and I was feeling horrible, so I decided to go looking for that vial of solvent again.</p><p>I started by inhaling directly from the bottle, but this wasn't effective due to a lack of experience. Afraid to waste too much, I turned to dowsing a couple of cotton pads in ether, and huffing from them. It worked like a charm. This first time, I was struck by euforia as I rapidly started to feel drunk. I was sitting under the back porch, outside at that point, and I wanted to go back indoors. I was woozy, but I managed, typing however was nearly impossible.</p><p>Later, I noticed that a new bottle of ether had appeared in the medicine cabinet. A poured some of it into an amber vial I had lying around. I started occasionally huffing from the bottle, nostril covering the opening. This was working incredibly, but I noticed my supply starting to run short, I was going to have to find a hookup for my own. Yes I was developing a dependancy, fast.</p><p>I gathered the courage and went to the local pharmacy to buy a bottle of my own. I had withdrawn 20 Euro's from an ATM earlier. It turned out I only needed 2, and I didn't have to answer any questions either, in and out in five minutes, four of which I spent in line. God bless Belgium. I came home with a 100 ml plastic vial full of volatile goodyness.</p><p>My 'huffing technique' had improved considerably at that point. I poured small amount of either in a seperate bottle. Like this, I was sure I wouldn't huff too much (I couldn't always stop when I was already far gone), and not too much could evaporate if I passed out and left the bottle open. I huffed by placing a nostril over the bottle opening, inhaling half a lungful of vapour, followed but the rest of my lung capacity of air. Drunk does describe the high, but it's different. My mind stayed far more lucid then when drunk, and I could notice my motor skills and coordination orientation degrading rapidly. I would start to go numb after about ten minutes, and I was simply in another place after twenty.</p><p>Keeping volumes measured, I would huff about 5 to 10 ml to get 'high', but that's seriously high. I still do this every so often, 7ml is a nice dose for a night, about 30 minutes of severe intoxication, and up to an hour of euforia. Done before I went to sleep. Everything feels nice, I feel happy the way only chemistry can make me happy.</p><p>The only side effects I ever really noticed stomach aces about 16 hours after a hit, these soon ceased.</p><p>My predicament may be a bit ominous upon reflection, I can get pharmaceutical grade ether around my corner OTC, a hit costs me less than twenty cents. I try to control how much I huff and when I huff, and it's going fine now, but in the beginning, I could simply feel how a habit was forming. But I think I'm fine, for now. Maybe it's not ominous, maybe I'm living a heaven on earth, and I just haven't noticed yet.</p>",
 "year": "2006",
 "id": "52871",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-07T07:00:00.000Z",
 "views": "13966"
}
