{
 "title": "Laughter",
 "author": "ABIDAN",
 "citation": " ABIDAN. \"Laughter: experience with Salvia divinorum (10x extract) (ID 52870)\". Erowid.org. Oct 7, 2007. erowid.org/exp/52870",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>Intense and Ecstatic Hystaria: The hardest Ive ever ever ever laughedever.</p><p>Tooling along the main drag, as Johnny Depp would say.  There I was with one of my friends roommates, Al, who I tagged along with to meet up with some of his friends.  One of which was said to have copious amounts of some 10x Salvia.  Sweet.  Count me in.  I had never done this sort of disassociative drug before, and was very excited to see what all the fuss was about.  I had no cash, so this meant I sadly had to mooch myself a little test taste of this curious drug.</p><p>I was a freshman in college at the time.  I was right in the middle of my first (and hopefully last) marijuana binges lasting about a year and a few months.  This meant that I HAD to smoke at the very least once a day.  I became broke about three months into the school year from buying so much pot.  At this point I should have been dealing to keep up with my habit but I turned down all my opportunities in fear of getting caught.  Who knows, I might still be in school right now but there would be a higher chance of going to jail later in life.  My grades were shit any way.  I say this from a kid who graduated from one of the better high school in the Silicon Valley, California with a 3.2 GPA.  Not bad, but not excellent, either.  Any way, my habit consisted mooching off whichever friend could smoke me out on any given day.  Usually I managed quite well, averaging one to four smoke outs a day.  I hate to admit it, but my addiction I thought I could keep under control turned me into a big mooch (scum of the earth).  Needless to say, I was on the prowl for some fine green tonight, but what I found was something crazier and more fun altogether.</p><p>It was a Saturday night of a weekend in Santa Barbaras University town of Isla Vista.  Its one of the most notorious party schools of the west coast these days, with more people living per square mile than some parts of New York.  Here in this devilish region, every decent party on the main strip harbors at least two kegs of fine beer/ale for public consumption.  This main strip is about 3/4s a mile to a mile long, and packed with your hardcore University partiers, not to mention staggeringly drunk hot chicks, ripe for the picking.  So there I was, high tailing it to some random party to meet up with some guy with Salvia who was also with some other friends.  My dorm room was about 6-8 city blocks from here so it was, as usual, quite a journey, especially with a few beers under the belt so early in the evening.</p><p>The time reads about 10:30pm. Al and I have made contact with the group of friends, at this random party.  The house is about two stories high, and the ground floor balcony overlooking the ocean was packed to the brim with people so tight they looked like match sticks from wall to wall.  I searched for a keg and cup, but the second keg had been dry already for a while before our arrival.  Drat I thought.  It seemed as if my hoorah for the night would consist of one little taste of a disassociative and a beer buzz.  Another beer buzz night in SB, except for the Salvia that I thought would only be a little trip.  I was looking for something that would put me to sleep in the early am, a long lasting drug, and I had heard Salvia only last a few minutes.  Disappointment settled in, but little did I know Id be in for a ride tonight soon enough.</p><p>None-the-less, I trotted up stairs in this unfamiliar house after my beer quest, and found my friends.  This house was foreign to all of us.  Youre always there with somebody who knows somebody who knows someone at these shindigs.  As, I ascended up the staircase, I arrived at the second level of the house where my friends were all seated on the couch, which looked like the place everybody would be smoking the Salvia.  The guy with a half-ounce bag of this stuff was seated on the far right of the couch if I were standing in front of him.  From left to right was the guy, and then on the couch were two girls, and then Al.  With one spot open on the left, I sat down and made myself comfortable.  The only people that smoked were me, and the guy who had the shit.  Allens punk bitch-ass passed on a hit and the guy packed me two bowls.  I didnt really want to be smoking it alone, but then Id have a sober caretaker.  Fair trade I thought.</p><p>The guy then said to me, Ok Im going to pack you two bowls.  Just torch it all in one hit as quick as you can and hold it in.  Then Ill pack you another one.</p><p>Damn!!! I exclaimed in my head.  This guy was trying to fuck me up.  He was right though.  It was only 10x Salvia that was said to be less strong.  In addition I had my good buddy Al, who has a gift of calming me down in bad trips when Im on the brink of insanity.  He does things such as sit me down at his computer and play funny-ass videos or visuals and shit of the like.  Here goes nothing I thought (and in my head I was screaming, YEEEEHHHAAAWWW!!!)  I was giddy as a schoolboy on the first day of summer.  This was my first psychoactive trip except for weed.  This was the real deal.  I put the Sherlock pipe to my mouth.  It was packed to the brim with 10x.  I leaned outward from the couch so now everybody sitting down was in view.  I muttered to the guy on the end, So, yeahIm not going to be able to torch this in one hit man.</p><p>Its all good man just hit that shit, he replied.</p><p>Without a second thought, I put the lighter flame to the pipe.  Chick, Chick!  Fwauom!  I sucked in the stale tasting herband choked on it.  Three hits dusted the bowl, and as soon as I handed it back to the guy, it came right back to me packed with the same size bowl.  Ohshit I thought.  I could already feel the relaxation of the herb and probably some tar already being processed into my blood.</p><p>Go go go go go, the guy persuaded me.  You gotta hit it fast man!</p><p>Shit, I thought, no use in wasting time.  Chick, Chick!  I torched the bowl in another three hits, sat back for a moment.  I felt slightly funny, sat back in my spot on the couch, waited a few more seconds, and thenZang!!!</p><p>The shit hit me like a ton of bricks from a twelve-story building.  Bam!  Uncontrollable laughter came over me like a fucking mad man.  I hadnt laughed this hard sinceshit, since I dont know when but it was intense.  I glance over to the four people on the couch to my left, and they were all fanned out, leaning outward off the couch so I could see every face sitting next to me.  Dumbfounded they observed my insanity like a bunch of tourists at the city zoo, and eventually my laughter leaked over the couch and we all had a good laugh at me.</p><p>This party was packed!!!  No beer left to be drunk, and there were still people walking around in front of my view, taking a smirking glance at me as they passed by, which was spinning as if I had just gotten of a merry-go-round.  As my view spun around, my laughter continued and I tried to repress it to a low giggle.  At this point I could focus in on my spinning periphery, and if felt like from this point on that I was the star in a movie that was the NOW.  Everything that happened was as if it was, should have been, and always will be.  Of course, that makes shit for sense, but I tell you, it was funny as hell.  It was like being the in the center floor of a circus.  Every little sound and sight was hilarious.  I didnt get many visuals although everything was spinning.  It was more of a mental trip.  People next to me on the couch were asking me questions, but it was like I couldnt hear them, or the words didnt make any sense.  I was like there was a concrete communication wall between reality and I, and I was looking outside from within a glass marble.  My vision bowed outward and concaved while swirling around. All I could do was sit there and laugh while every body starred at me.</p><p>I felt a little uncomfortable for a split second because I was having such a dubious time and I didnt want to frighten anybody because I didnt really remember what I was actually doing there, I just remember I went there to smoke, but the thought evaporated quickly and I realized everyone was having a good time anyway, especially while laughing at me.  These symptoms persisted for another 10-15 minutes or so, during this time, Al got up and guided me downstairs and back out on to the street.  All the while I was thanking the guy for the sample, or maybe I wasnt.  I dont have any concrete recollection of it, but Im sure he knew I was thankful by the way I belligerently conducted myself on the way down stairs.</p><p>The main strip was now packed.  It was about 11:00-11:30pm or so and I was bumping into people left and right.  Now Im usually an anxious, depressed, and borderline timid person, but these social pressures dissolved completely during my trip and I felt quite good and very friendly.  People ran up to me from my dorm I hadnt known very well (for a few months) and got right in my face to say hello, and I responded with a burst of joyous laughter, and no communicative words and zero anxiety (which usually is present for me in social situations).  Im sure these people got one hellouva kick out of this, and Al was laughing his ass off while simultaneously trying to explain what the fuck was I was on.  I was still staring in this movie and having a grand ol time.</p><p>Everything was extremely surreal.  It was the perfect first dosage because I was gone enough to party and keep in some contact with reality which is nice because you dont want to find your self getting cuffed by one of these IV Nazis (AKA Isla Visa Cops) while stumbling around, only later to find yourself sobering up in a drunk tank next to some piss drunk college degenerate.  Also Im a little shy in big crowds and have Id say, I was having a fantastic outing.</p><p>In about ten minutes time after being out of the party, Al informed me that he had attained a good deal of this salvia from his friend because he hadnt done any and wanted to try it in the comfort of his dorm.  This was awesome because it meant that we would be able to smoke this stuff out of his roommates water pipe.  And this was no ordinary water pipe, it was a Roor.  A Germen made, glass on glass carb to down stem connection, with a standard flask shaped base.  Not the best, but close to it.  I dont know how the hell we made it back to the dorm.  All I remember is one moment Im on a crowded street swimming though a sea of drunkards, and the next moment Im watching Family guy with Al with a freshly packed bong load of some Salvia sitting in front of me.  What a good dream this was I thought.</p><p>I found these next few bowls to be a bit less extreme even though we used a more efficient smoking utensil, were in privacy, and was in a more comfortable setting.  I had roughly the same trip, only it was accompanied by nausea (because we smoked so much) and the trip was a bit less euphoric (probably because I had built a tolerance over the past hour).  I did, however, see family characters walking around outside of the screen for a moment, which is a common trip in dissacosiatives.  I also slept very well that night, as I felt heavy from smoking so much, feeling like I had smoke five cigarettes in a row.</p>",
 "year": "2005",
 "id": "52870",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-07T07:00:00.000Z",
 "views": "2430"
}
