{
 "title": "A Bit More than I had Expected",
 "author": "TypicalHonorsStudent",
 "citation": " TypicalHonorsStudent. \"A Bit More than I had Expected: experience with 2C-E (ID 52872)\". Erowid.org. Jan 15, 2007. erowid.org/exp/52872",
 "substance": "2C-E",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "15 mg",
  "oral",
  "2C-E",
  "(capsule)",
  "",
  "1 repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>I consider myself to be a somewhat experienced psychonaut, Ive done mushrooms a handful of times, acid, E, and dabbled in the usual uppers/downers etc.  I also smoke a lot of pot.  I have a fairly clean mental state most of the time, which is obviously an essential component to any trip.</p><p>Setting:  I had just gotten off of work, and myself and two friends decided to each take one capsule containing 15 mg of 2C-E which I had acquired by chance some weeks prior.  It was just the three of us and my friends cat, and since it was friday night and we had no obligations for the next 24 hours, we decided that it was time.</p><p>Dosed about 11 P.M. (Which in retrospect probably wasnt brilliant) and the effects became very noticiable.  We had been watching House of Flying Daggers and just smoking weed waiting to come up.  Another key to his whole evening was the fact that we were watching the movies and later music videos with a projector that casts the picture on the wall.  It was awesome.</p><p>But anyhow, the scene at the time had been in the woods, and I started to notice what could be described as minor mushrooms-like visuals - the trees were ebbing and flowing and seemed to be growing across the walls.  At that moment, I closed my eyes.  the closed-eye visuals were absolutely amazing.</p><p>The night itself was not too eventful, although I have to say that the intensity of this drug surprised me a bit.  I had never done any of the so-called 'research chemicals' before, and so I didnt really know what to expect.  It has an extremely stimulant-like effect to it (my friends and I were very 'anxious' if you will, but more in the 'I need something to do' than in the 'freaking out' way), and the major effects lasted for about 6 hours after dose.  The open eye visuals were very 'shroom-ish' but I didnt have nearly as much 'head-trip' as I usually do on a mushrooms trip.  This may be because of the totally different nature of the drug, although I can definitely see how taking a higher dose could create one hell of a trip.</p><p>Final note:  It seemed to me that smoking marijuana while on this drug tended to increase the overall effect thru some type of synergy.  I generally use marijuana while on hallucinogens to take the 'edge' and anxiety off of them (because im not a huge fan of uppers) and I would say that it definitely did this, but it seemed that everytime we smoked a bowl the visuals and the general level of fucked up increased considerably.</p><p>So, in summation...this drug was freakin sweet at this dose.  just enough to get amazing open and closed eye visuals, but not terribly intense in the sense that I still had a clear idea what was going on for the entire night.  I was jittery/antsy because this is certainly a stimulant (so dose early unless you plan on being up all night, because I experienced 8-10 hours before sleep was even feasbile), and watch the marijuana intake because it might make you trip harder.  My two friends (one a skinny ass white kid and another a tiny asian girl) had I think significantly stronger trips, but they both handled themselves quite well, save for some uncontrollable giggling fits.  All in all, this was a worthwhile experience, and if I ever get my hands on this again, I could see it being an amazing rave drug.</p><p>Remember:  Its all about frame of mind, so try it for your first time in a comfortable place, because a high dose in a bad environment could cause this drug to spiral to a nasty place.</p>",
 "year": "2006",
 "id": "52872",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-15T08:00:00.000Z",
 "views": "3407",
 "dose": {}
}
