{
 "title": "The Lucid Dream",
 "author": "Nicole",
 "citation": " Nicole. \"The Lucid Dream: experience with Tryptophan - 5-HTP (ID 52888)\". Erowid.org. Jun 23, 2007. erowid.org/exp/52888",
 "substance": "Tryptophan - 5-HTP",
 "bodyweight": "120 lb",
 "report": "<p>Useless Information:</p><p>My boyfriend had been feeling rather depressed lately. He was generally quite stressed out (financial and emotional stuff on his mind), he was lacking much of an appetite, and, night by night, becoming more of an insomniac. His irregular sleep patterns were making him more and more uncomfortable during the days' waking hours, however he's not one to take sleep-aids. His mom recommended 5-HTP, which she had apparently been taking for quite some time now (with St. Johns' Wort as a 'natural' alternative to anti-depressants), mentioning that 5-HTP made her quite drowsy. He bought a bottle of 80 / 50mg tablets at a local health food store, took them for (no more than) 3 days, and decided to discontinue use.</p><p>The Experiences:</p><p>I was bored one day and decided to take 300mgs (on an empty stomach), just to see how what this stuff could do. I have previously experimented with shrooms, LSD, crack, pre-cook, opiates, speed, MDMA, MDA,  crystal  meth... As well as some legal highs.</p><p>So, about 30 - 40 minutes after ingesting the pills, I noticed that I began to feel kind of 'off'. That's really the only way to describe it- I wasn't 'high', but I definitely wasn't thinking like myself. I had a barely-there euphoria, and a rather 'space-out' feeling. It was as if I had a cloud over my mind... I had to think about certain tasks, which I shouldn't have had to think about. I was thinking quite slowly. I was talking quite quickly. Sometimes, I would blurt out things before I could think about what I was saying, mixing up words(For Example: I would think 'Cats are cute' but I would say 'Cute cats are'). I was also stuttering, somewhat, which I normally do not. The experience in itself was not really all that interesting.</p><p>A couple days later, I upped the dosage to 500mg, on an empty stomach as well. Same effects as before, a little more pronounced. Severe nausea set in not long after I began feeling the initial effects come on. I vomited; it didn't make me feel any better. I hate vomiting. Grossest bodily function ever. Eww..</p><p>After Effects:</p><p>Interestingly enough, although the immediate effects of 5-HTP kinda suck, there was an excellent effect on my quality of sleep, and dreams. I have had previous lucid dreams, though, none quite so realistic as the ones I had during the nights after taking 5-HTP. I can remember being awakened while still in my dream. Usually, soon after this happens, I become a little excited and wake myself up, accidently of course. During this one particular dream, I was awake in a nightmare. Everything was still going on around me, and I could not (seem to) 'control' anything. I became scared and uncomfortable, and began yelling at myself to 'wake up'. I could not wake up! I was literally trapped in this dream... I won't really go into further details regarding the dream itself, but really, it was quite intense. I have also woken up in sleep paralysis after each time in which I took 5-HTP. Not very comfortable!</p>",
 "year": "2006",
 "id": "52888",
 "gender": "Female",
 "timestamp": "2007-06-23T07:00:00.000Z",
 "views": "12317",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP",
   "form": "(pill / tablet)"
  }
 }
}
