{
 "title": "Too Much, Too Far",
 "author": "d_cat18",
 "citation": " d_cat18. \"Too Much, Too Far: experience with LSD, Marijuana (ID 52893)\". Erowid.org. Sep 18, 2008. erowid.org/exp/52893",
 "substance": "LSD, Marijuana",
 "bodyweight": "200 lb",
 "header": [
  "DOSE:",
  "5 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  "",
  "1 cig.",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>This experience happened 2 years ago and was an experience that opened my mind to the actual power of psychedelics. At the time of this experience I was heavily into the use of chemicals and very careless on the use of them. I had knowledge of the proper dosages and an idea of the use of set and setting but I never followed them. LSD was a drug I was very familiar with at the time and had experienced many great times on it, this eventually led to an understanding that I could handle very high doses of this drug.</p><p>\tNow this understanding followed a sequence of events that eventually led to me obtaining 7 hits of LSD from a friend (B) for doing some school work for him. I sold 2 hits to my other friend M who was also present at this time. The trade took place at my house in my bedroom which is in the basement around noon on a school day. I took the remaining 5 hits almost imediately after the transaction and then we decided to go over to our friend P's house because my parents could have showed up at any time.</p><p>\tWe left my house and walked to P's house because it was a short distance away. When we got there we went into his basement and just sat around watching him play PS2. At this time it was probably about 30 minutes after I took the LSD and I was starting to feel shivers and cold just like I always did coming on LSD. The shift from shivers to hallucinating a nice amount happened rapidly within 15 minutes. I was feeling like I was on about 2-3 hits of LSD (actual doseage is not known but from experience I'd say each hit was around 80-100 micrograms/hit) and I was enjoying it. We started to get bored so B, M, and I decided to goto our friend J's house on the opposite side of the city.</p><p>\tThe only way for us to get there was by bus. By the time we were off the bus and walking to his house it was 1 1/2 hrs. approx since I took the LSD. Now I was feeling really good with great visuals and intense body feelings I had never seen or felt before. We were now at J's house and we had smoked a blunt and do I ever regret it. We were now in J's basement and listing to music. The music was drum and bass a very bad mistake considering I dont like the music. The visual were very intense and the music made them worse so I stated we go outside. We did. It was very snowy out and bright because of it, this caused me to trip out more. Now I stated lets go back inside and we did. We went in and this is when the experience got scary, M, B, and J all turned into these cartoon characters to which my amazement stayed that way.</p><p>\tBy this time in the experience I had lost track of time completely, minutes felt like hours and seconds like minutes but I would say this was anywhere between 2 and 4 hrs into the experience. The cartoon characters remained and I was so far away from my own house and the comfort of my own bed that everything seemed wrong. I had completely lost the ability to communicate with others, the concept of what was real and what was not was lost and this whole new world seemed so scary. I wanted to tell my friends what was happening and try to get help but every time I tried I couldnt get passed the first or second word. They had came to the conclusion I needed to go for a walk and since B had to goto the bank anyways it was a good plan. For me this was hell.</p><p>\tThe walk to the bank I can hardly remember but when we were there it was just as horrible as back at J's house. The bank was in a plaza with people coming in and out of it and that is what was horrible. Everyone looked so differnt and monsterous and I was very frightened but couldnt do anything about it, I was so far away from home I couldnt walk and even if I tried I would have gotten lost. Also I could not talk so there was no way of communicating to anyone that I wanted to go home. So I followed everyone back to J's house.</p><p>\tProbably anywhere between 5-6 hrs. into the experience we were back in J's basement and listing to the horrid music again where the most frightening experience in my life happened, there was a voice talking to me in my head. This voice was trying to convice me to kill my friends because they were evil cartoon characters and if I did I would be happier. I couldnt tell my friends about it because I couldnt talk so I continued to sit there listening. There was a huge arguement going on in my head on if I should do it or not and I dont even know how long this lasted. It got to the point of where I literally went upstairs to grab a knife to do it but I freaked out and decided I would not do it and call my father. This was a huge task in itself because I still couldnt talk, I called and luckily I was near my dentist so I just repeated dentist until he knew I was talking about getting me at the dentist. At this point I did not care if my parents knew I was high on LSD I just wanted to go home and wait for it to end.</p><p>\tMy dad was on his way but it was not over, I had to walk from J's to the dentist by myself, at night, on 5 hits. There was this feeling inside me and it was hurting and I was so lost that I dont know how I made it to the dentist I just remember fighting with the voice in my head. I got into the car when I found him and by now it had to be at least 7-8 hrs into the trip and I was feeling the full effects of the LSD still. The car ride home was the only good part of my trip because it felt like a video game until the end part where the voice convinced me my dad was drunk and it actually looked like we were driving on the wrong side of the road. I pulled the steering wheel over to try and get us over in the right lane and caused us to hit the curb. My father flipped but didnt do much about it.</p><p>\tWhen I got home I put on the TV and sat there for hours waiting for the drug to come down. Some of those hours were spent fighting with the voice but eventually he went away. The pain inside of me went away almost instantly when I got home so I wasnt feeling all that bad anymore. It was around 12am when I noticed I was able to talk, think, and perform quite normally again so I decided I would smoke a small bowl and goto sleep and that is what I did. The next day I woke up and felt fine.</p><p>\tAfter this experience I didnt touch a chemical for about 2 months, then I started using MDMA again. I didnt even think about LSD for a good 8 months when I finally got the courage to try it again. The one main thing this experience tought me was to watch your set and setting. The whole time I was on the LSD it was because of where I was, who I was with, and what we were doing that caused me to think about what I did leading to the bad experience. From that day forward every time I used a mind altering substance I made sure everything around me is right and me, myself was ready for the experience.</p>",
 "year": "2004",
 "id": "52893",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-18T07:00:00.000Z",
 "views": "5212",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": "",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
