{
 "title": "Advice for Rolling",
 "author": "Wise One",
 "citation": " Wise One. \"Advice for Rolling: experience with Ecstasy (ID 529)\". Erowid.org. Sep 13, 2000. erowid.org/exp/529",
 "substance": "Ecstasy",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I have one word of advice for X users, and that is to ONLY DO THIS DRUG with people you trust!  I tried X for the first time 2 weeks ago, and although it was an amazing experience, I can see how it would be potentially dangerous if I was not around reliable people who had rolled before.  For the first half hour or so, I felt none of the drug's effects.  But when I hit the 45 minute mark, I was completely gone.  My entire body felt warm and fuzzy, and I kept running my hands over my arms just to feel the sensation.  This lasted for about 10 minutes when the full effects hit, and I freaked out.  It got way too strong; I started sweating, pacing back and forth, and was convinced that I was dying.  I thought, 'I got a bad pill, I'm going to OD on this shit.' I was so out of it I thought I was about to break into millions of pieces and go flying into space.  I didn't even remember that I'd taken anything, and when people tried to explain that it was the drug, I could only hear them through what sounded like a huge tunnel. </p><p>If great friends wouldn't have been around to take care of me, I'd seriously have dialed 911 or (worse yet) my dad in a panic.  Also, while the touchy-feely sensation is definitely one of the ups of X, getting overly physical with someone could have it negatives in the morning.  Again, I'm glad I was with people who were keeping an eye on me and knew what to expect.  So everyone out there, have a good roll, but BE SAFE!!!!</p>",
 "year": "2000",
 "id": "529",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-09-13T07:00:00.000Z",
 "views": "11464",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
