{
 "title": "Threshold Sleep",
 "author": "Komrade",
 "citation": " Komrade. \"Threshold Sleep: experience with Datura stramonium (ID 5291)\". Erowid.org. Feb 22, 2001. erowid.org/exp/5291",
 "substance": "Datura stramonium",
 "bodyweight": "135 lb",
 "report": "<p>Had some time to experiment with Datura that's been kicking around for a few weeks.</p><p>Boiled a cup of water with 1.5 teaspoons of dried datura leaves for a few minutes.  Poured off the amber liquid and added milk and honey.  Tasted not too bad... (11:30pm)</p><p>At T+1:00 or so my heart is beating noticeably stronger, though not much faster.  I notice my vision is a little tweaky and decide to head over to my room.  My balance is basically gone, my weight feels concentrated about my shoulders and I feel really tippy.  I jostle my doorframe on the way into my room, I must look really disoriented to an outsider, though my head seems relatively 'clear'.  I listen to a bit of music and then fall asleep.</p><p>As soon as I close my eyes, I drift off to a dreamstate.  My dreaming seems vivid and intense, though I remember none of it, though I can remember the sensation of a lot going on.</p><p>I wake up the next day at about noon.  I feel perfectly normal, though my pupils are still considerably dilated.  I make some cereal for breakfast and go to read the newspaper, when, I realize I have forgotten about one of the noted side-effects of anti-cholinergics.  My focus is pushed back to about 2 feet from my face!  I feel like an old man, everything is perfectly clear until it starts to get too close, I have to hold the paper at arm's length to be able to read any of the text.  Thankfuly, I am extremely short sighted (-5.0 diopter) and I find that by taking off my glasses I can see detail close to me, but that everything else is blurry (as usual).  Thus, I spent the day continually removing and replacing my glasses.  I could read again by about midningt and my vision was baseline by about 3am. (T+27hours!)</p><p>This was obviously a threshold dose for psychoactive effects and though I'm curious to explore datura further I can't say that I will.  Losing vision for days on end (as I've heard reported) is not an attractive side effect...that and some of these trips are damned scary....</p>",
 "year": "2001",
 "id": "5291",
 "gender": "Male",
 "timestamp": "2001-02-22T08:00:00.000Z",
 "views": "49119",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.5 tsp",
   "administration": "oral",
   "substance": "Datura",
   "form": "(leaves)"
  }
 }
}
