{
 "id": 5291,
 "title": "A Series of Salvia Experiences",
 "date": {
  "submission": "2001-12-16T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zirdo",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 ],
 "report": [
  "I have been using Salvia quite often over the last year.  I think it's a bautiful and interesting teacher.  I have seen Salvia convince people to never to take psychedelics again... and I've seen it completely turn people on.",
  "After much research, I went to the local health food store (big mistake-- see my Kava experience report!), and bought about half a pound of what they claimed was Salvia Divinorum.  After several smokings of rather large amounts of plant material I came to realize that this was NOT salvia, but simply the normal sage herb!",
  "Then I acquired some normal Salvia, and tried Salvia+Cannibas+Datura... only minus the Datura.  I listened to Beethoven's 9th and just let my mind go... spectacular.  I felt as though my brain was being sucked back into my backside... right in time with the music!  I began to see my body as a series of structures... weapons, buildings etc etc.  Until finally (a full 30 minutes later), I came out of the trance.  WOW!  It did help me in my life as well... because of some of the mental scenarios it created (I was not allowed to actively think, 0nly watch), showed how I was being stupid in my normal life.",
  "The rest of that batch was wasted on friends who smoked it until they got a mild giddy feeling... they had no idea what the full effects of Salvia could really be.",
  "Finally, I purchased a gram of Salvia 10x and my friend T & I smoked all of it in one night in his car at like midnight.  We were both struck with not only a huge giddiness, but also with bizarre visions (him of disneyworld & me of a giant fish).",
  "I finally ordered more Salvia 5x a couple months later and proceeded to let all my friends experiment with it.  It created a huge rush for people to acquire it, which wasn't really a good thing since it caused some very negative experiences in some people.  For example, my friend G got up and stumbled around the room... completely unconscious of where he was.  This same friend would eventually buy Salvia himself and smoke it to help him sleep.  This resulted in a total trainwreck.",
  "Another friend, who has given up on acid & mushrooms because he doesn't like the way they strip reality of all its sugar coating took Salvia and saw the whole world as a huge lie.  He had a panic attack... and has every time since that he tried Salvia.  Another trainwreck.",
  "This never happens to me.  I have never lost control on Salvia, and I believe I never will.  I believe this is both because I respect the plant and because I have no underlying fear of what I might see.  'Always look on the bright side of life', right?",
  "Finally, my two most powerful Salvia exercises:  In April I smoked a few hits of 5x and suddenly was confronted by a massive firebird in front of me.  It did nothing but emanate power.  I was dumbfounded, simply could not think of anything in front of this awe-inspiring being.  I still don't know the significance, but I know it's there.",
  "The last great Salvia experience i had was home alone, late at night practicing some uhm... auto-erotic stimulation and delaying orgasm until a moment after Salvia ingestion.",
  "I was immediately catapulted into my own genetic lifestream where an innervoice answered many of my most troubling questions.  It reiterated who I was and why I was the way I was.  Since then my Salvia experiences have been nearly nonexistent.  Every time I've tried I've had minimal results... I miss it, but at the same time I am glad I don't have to face the power it sometimes held.  It can be overwhelming, but I think if I learn to go with it will not get out of control.",
  "I will continue to buy 5x extract not the standard leaf or the 10x extract.  I have tried 10x as well & all my experiences were far inferior to my 5x experiences."
 ],
 "erowid": {
  "id": "3189",
  "citation": " Zirdo. \"A Series of Salvia Experiences: experience with Salvia divinorum (5x extract) (ID 3189)\". Erowid.org. Dec 16, 2001. erowid.org/exp/3189",
  "substance": "Salvia divinorum (5x extract)",
  "views": "6120"
 }
}
