{
 "title": "Not Bad",
 "author": "High Canadien",
 "citation": " High Canadien. \"Not Bad: experience with Mandrake (ID 52951)\". Erowid.org. Oct 24, 2006. erowid.org/exp/52951",
 "substance": "Mandrake",
 "bodyweight": "158 lb",
 "header": [
  "DOSE: T+ 0:00",
  " ",
  "oral",
  "Mandrake",
  "(tea)",
  " T+ 0:00",
  " ",
  "oral",
  "Lobelia spp.",
  "(tea)",
  " T+ 0:45",
  " ",
  "oral",
  "Mandrake",
  "(tea)"
 ],
 "report": "<p>[Erowid Warning: All parts of the Mandrake plant contain hyoscyamine and scopolamine and can easily cause death by respiratory paralysis.]</p><p>I ordered mandrake root from an online herb and spice store about a month ago due to the fact that I read in a text book that mandrake root had small halucinagetic effects. (Since I was young I have always had an interest in reseaching the effects and characteristics of different drugs.) So one night after having it in my room for about a week I desided to try it. I was alone and since I had nothing to do and it was late I figured I would give it a try. First I put the peices of mandrake root into a tea bag with some lobilia which is another herb, and some sugar. After heating it up I drank the whole glass then quickly made another one with the same amount of substance.</p><p>0.00: Nothing yet just have a weird taste in my mouth</p><p>0.15: I feel slightly different but nothing that is really noticeable.</p><p>0:30: Went to get something to eat from the local store. When I went outside I noticed that the street lights and sky seemed a little (very little) different.</p><p>0.45: After eating I watched tv. Felt very little. Almost nothing</p><p>After an hour of taking the first two doses I desided to try just putting the mandrake root in a glass with no tea bag or sugar or lobelia. I mix a very potent glass of hot water and mandrake and let it brew.</p><p>Second dose:</p><p>0.00: Feel hot from the drink</p><p>0:15: Starting to feel mild euphoria so I lay down.</p><p>0:30: I am watching my light in my room which seems to be getting brighter and darker as I look at it. Its sort of going in repetitions.</p><p>0:35: I put on some Doors and listen to the music, I start to feel energetic and euphoric. A couple of minutes later I stand up and start moving to the music.</p><p>0.45: I am dancing to the music and I am having a great time. It is 2.00 o-clock in the morning yet I have lots of energy. I also notice that when I close my eyes I can vividly see lights and sparkles, you know those things you see when you squint really hard. I also have an extreamly vivid imagination. I start to sing the music.</p><p>1:00: I make a second glass of the mandrake tea and drink it down fast. Some of the hot water spills on me but I am too distracted to really feel it. I also want to keep my eyes closed and continued to listen to the music.</p><p>1.15: Now I am really feeling the music. I am singing with the Doors CD and I am actually feeling like I am Jim Morrison. I do all the movements and lyrics and really feel like I am singing in a concert. My eyes have been closed for more then 20 min now and I can picture the theater.</p><p>1:30 I continue to sing until my friends come home and knock on my door, opening my eyes and bringing me back to my room. I go to the door and tell them what I have been doing.</p><p>1:40: When they go back to their room I put the music back on and finish the CD. When the last song comes on The End I am so into it I can feel my body tingling and my singing is going perfectly in tune with the music. I love it.</p><p>2.00. I turn off the music and come to see the my CD player light seems to be moving, its growing bigger and smaller as I move my head back and forth. This is so cool I cant belive it. I watch this for about two min and go to bed.</p><p>The next morning I woke up with a bad taste in my mouth. I look at the clock and see it 1.00 in the afternoon. 30-50 grams Mandrake put me in a delusional state of happiness and illusions, and then put me in a deep deep sleep. Overall it was good and I would definatly try it again.</p>",
 "year": "2006",
 "id": "52951",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-10-24T07:00:00.000Z",
 "views": "25136",
 "dose": {}
}
