{
 "id": 5297,
 "title": "Rainbow Road",
 "date": {
  "submission": "2004-07-14T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Jhonbus",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "14 ml",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "(liquid)"
  }
 ],
 "report": [
  "C had obtained 500mg of 2C-T-2 and had split it into two halves by eye, leaving (approximately) 250mg for this experiment.  The 2C-T-2 was dissolved in 250ml of de-ionised water giving a solution of about 1mg/ml, which now had to be calibrated by bioassay... :)",
  "T= 0:00",
  "C takes 18mL and I take 14 as it's my first time with this compound and the strength of the solution could be off by as much as 25%. The taste is mildly bitter, but really not too bad.",
  "T= 0:30",
  "The first effects become apparent. +/-",
  "T= 0:40",
  "Feels very similar to 2C-I. a 1+ now. Getting 'waves' of effect, characterized by body rushes similar to MDMA, but smoother and less intense.",
  "T= 0:50",
  "Visual effects such as increased colour intensity and breathing of surfaces noticed. A 1.5+ Slight mouth watering and nausea.",
  "T= 1:25",
  "Effects have been increasing in waves, nausea fading in and out but now seems to have gone. A bit of muscle tension around the shoulders so I take some magnesium.",
  "T= 1:45",
  "My level seems to be a fair bit lower than C's so I take a supplement of 1.5mL.",
  "T= 2:00",
  "We decide to go for a walk in the park. I begin to feel the supplement.",
  "T= 2:10",
  "Definitely more visuals now, mostly very intense colour, and cycling of colours through green, brown and red. Everything has taken on a somewhat greenish hue. Thought processes surprisingly normal. C's level was higher than mine, he was getting visuals intense enough to distract him from walking. He says, 'If I were this tripped out on acid, I'd pretty much be incapacitated.'  The narrow and twisting pathways in the park are very interesting. All the fallen pine needles and moss on the path create a brilliant 'rainbow road' effect.",
  "T= 2:30",
  "Not getting any higher now. Plateau lasts maybe a couple of hours and then a slow and pleasant decline to normalcy. Will definitely repeat again, at a slightly higher dosage, perhaps 16mL to start. We suspect the solution we made contains slightly more than 1mg/ml."
 ],
 "erowid": {
  "id": "31908",
  "citation": " Jhonbus. \"Rainbow Road: experience with 2C-T-2 (ID 31908)\". Erowid.org. Jul 14, 2004. erowid.org/exp/31908",
  "substance": "2C-T-2",
  "views": "8096"
 }
}
