{
 "id": 5298,
 "title": "July 4th",
 "date": {
  "submission": "2000-10-23T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "KingoBK",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "months after my first time 'rolling' I have had much time to recollect on the very enlightning experience I went through. so I felt I should share this great experience with fellow ears.",
  "it was july 3rd, the day before celebrating out independance. I was left with the horrible burned of entertaining myself with an open house. my fellow friends and I decided to throw a pre-4th of july party due to conflicting schedules. we were all regular drug users and of course needed to pick our 'treat' of choice. usually the theme is that of LSD, shrooms, or all out beerfests, but this time E was our helper of choice. I had never rolled before but was a casual tripper on LSD and shrooms and thought I had an idea what to expect, I could never concieve how great these little pills were. plans did not fall into place as hoped, it was all set to pop at roughly 10:00 p.m. to get a full night in and some sleep due to the fact I had to work the next day. this plan slowly but surely went off track until two of my friends were knocking on my door at 2:30 in the morning with a handfull of pills to keep us all entertained. I took my pill and began to prepare for the experience at hand, I comfortably sat on a chair outside atempting to ready myself.",
  "After a long prior bad LSD trip where I went catatonic for 6 hours, I occasionaly suffer from 'dead' trips, where I trip but my head gets so consumed with thoughts it spoils it to feeling like a zombie with the visuals to match. because of this I knew that this time before you trip or roll can be crucial because your vibe and emotions can affect the experience at hand.",
  "after 30-40 minutes I walked inside and as I stood up I felt so light and my body felt so good it could have been glowing. the E was kicking in and any worry in my head had left with the passing breeze, I found a comfy seat inside and sat with my friends and started casual conversations. every word rolled out my mouth with such ease as every thought felt as though it was the most beautiful thing in the world. my head felt so clear, my fears of a 'dead' roll were nowhere in sight. I felt like a giant smile and the E truly had me, I felt as though I had very deeply connected with parts of myself I had not seen in a while if they were ever there before. I talked with my friends about anything that came to mind, from simple trivial events of the day before to long life plans of the future.this experience felt like a huge breath of fresh air, any troubles that were in my head were gone. I could either talk them out or I could solve them myself. ",
  "I listened to some very soothing trance music with beats that matched my emotions, every single beat felt like they were orchestrated to me personally, to the point that a song  heard that night gives me goosebumps anytime I hear it. as the night wore on I moved from place to place, experiencing every room for what it was worth. slowly night progressed into morning, the lighter it got I felt the last kicks of the E as it we began to split our paths. I didn't feel the usual come-down depression that is such a common tale, in fact even as I knew the roll was over I felt great. with a new look on life from the events that transpired before. the evening was so theraputic in ways I could not explain, I walked through the passing days with a glow upon my shoulders. the experience was more then I knew, I could understand why people love these magic pills, and after a night of of never ending joy. I truly understand why they call it ecstasy."
 ],
 "erowid": {
  "id": "3191",
  "citation": " KingoBK. \"July 4th: experience with Ecstasy (ID 3191)\". Erowid.org. Oct 23, 2000. erowid.org/exp/3191",
  "substance": "Ecstasy",
  "views": "7131"
 }
}
