{
 "id": 5300,
 "title": "Very Like Acid and Extremely Tranquil",
 "date": {
  "submission": "2004-03-16T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zantago",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-C"
  },
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-I"
  }
 ],
 "report": [
  "20 mg 2C-C + 20 mg 2C-I",
  "Taken in pill form hit hard in about 40 min. It was described 'I felt like I had taken 6 hits of acid'. I had take 2C-C before as much as 60 mg over a 6 hour time frame. It made me content to sit and stare at a wall. Had very little psychedelic effects. 2C-I was very speedy and reminded me of ecstasy a little was very speedy and I could not sit still long enough to enjoy the visualizations. The combination of the two was a very Acid like and extremely tranquil. The combination was nick named 'Halo'.",
  "The main difference between Halo (2C-I + 2C-C) and acid is that time seems to move at a normal rate and normal thought and conversation were possible.",
  "Over all every one I know that tried the combination described it as a 'great trip'. 2C-C seems to be a good mood enhancer, and makes a bad trip almost impossible.",
  "The first dose always seems to hit very hard. After my body has adjusted to the chemicals a second dose not hit hard at all. It seems to blend in to increase the trip without the unconformable 'hit a brick wall' feeling I get when the first dose kicks in.",
  "2C-C by itself seemed to make time move faster, or me react a lot slower. I discourage any kind of activity the requires fast reaction time."
 ],
 "erowid": {
  "id": "31919",
  "citation": " Zantago. \"Very Like Acid and Extremely Tranquil: experience with 2C-C + 2C-I (ID 31919)\". Erowid.org. Mar 16, 2004. erowid.org/exp/31919",
  "substance": "2C-C + 2C-I",
  "views": "13674"
 }
}
