{
 "title": "Nice Evening",
 "author": "Luke",
 "citation": " Luke. \"Nice Evening: experience with Kratom (ID 53000)\". Erowid.org. Jun 2, 2008. erowid.org/exp/53000",
 "substance": "Kratom",
 "bodyweight": "90 kg",
 "report": "<p>It was a saturday night, and my package came in the day before: 5 bags of 10 grams of kratom powder :D  I went over to a friend's house and first ate a light meal. More friends arrived so I was with six friends. None of us ever had experience with opiates before, so we didn't know what to expect.</p><p>We boiled some water and put 5 grams of kratom into each of the seven cups. We just poured the water in the cups and let it sit for a while.</p><p>time: 21:00</p><p>We decided to start drinking the tea after 10 mins. after making it. It tastes very bitter, so its a good idea to have a glass of water or fruit juice on the side.</p><p>time: 21:15</p><p>We all started to feel something. A light relaxing buzz and some loss of balance.</p><p>time: 21:45</p><p>The coming up was really nice and it's doing its work now! It really took like 30 minutes to reach peak effects.  At this point we also decided to roll 2 joints with just tabacco and kratom powder. We tried to smoke the joints and it did have some effect, but it burned very badly. I guess the powder is too 'compact' to burn well.</p><p>time: 22:00</p><p>We had 15 grams of kratom left, so 4 of us (including me) decided to make some more tea. We took about 2-3 grams this time.</p><p>After we made the tea we rolled some marajuana joints and smoked them. I must say this was a very good idea! I think these substances combine perfectly!</p><p>time: 22:30</p><p>My god! The kratom buzz is really strong now! I sometimes close my eyes and have nice CEV's and it also feels like I'm not breathing at all. It really feels like the ultimate relaxation.</p><p>time: 0:00 The kratom is still running strong. A bit less intense then an hour ago but still very nice!</p><p>time: 2:00 At this point I'm not really back to normal again, but most of the effects are gone.</p><p>time: 3:30 Went to bed and had a very nice sleep!</p><p>Conclusion:</p><p>Very nice substance! Had a very nice experience, but the kratom is not exactly cheap. I might repeat this a few times, but I think 15 grams of shrooms is a better way to spend my money :D</p><p>I must add that some of us did experience some nausea, and it's a very bad idea to eat or drink alcohol in combination with kratom.</p>",
 "year": "2006",
 "id": "53000",
 "gender": "Male",
 "timestamp": "2008-06-02T07:00:00.000Z",
 "views": "6850",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Kratom",
   "form": ""
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": ""
  },
  "3": {
   "time": "",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  },
  "4": {
   "time": "",
   "amount": " joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
