{
 "id": 5301,
 "title": "Being Christ",
 "date": {
  "submission": "2008-03-25T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Toadstool",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I have used DXM probably five or six times for recreational/spiritual purposes.  I usually used it at the third platuea and at a dose of 600-900 mg.  I haven't used DXM for a very long time, because I could tell it was taking me out of reality in my every day life. ",
  "Lately I have been using nicotine and have really developed a habit.  I have read that DXM may limit self administration of tobacco, heronin, etc. and that it is supposed to soften withdraw symptoms, so I decided that I wanted to stop using the tobacco products and that I would use DXM to give me a little help.",
  "I bought one four ounce bottle of maximum strength cough syrup and down half(~150mg).  About an hour later I felt a soft little buzz.  I hadn't had any tobacco products that day and it was about 8 pm so I expected to have a head ache, and be irritable, but instead I was very calm, numb and very slightly in the dextroverse.",
  "I went to bed about three hours later and had the most amazing experience of my life.  As soon as I fell to sleep my eyes opened and I started floating off my bed.  I was having an out of body experience, something I had never experienced from even high dosess of DXM, but then again I can never goto sleep while on DXM either.  While floating above my bed I felt vibrations rush through my body and I was thrust, with my arms spread and legs handing, against my bedroom wall.  While I am not a christian, this was definitely a very christ like experience.  After hanging on the wall forever the world slowly turned to black.  I then started falling in the blackness;  I was falling into hell.  I fell forver, then I woke again, still in my dream, and alive.  I felt like I had been crucified and had risen from the dead.",
  "I have never had an OBE in my life, and this definitely influenced by the DXM.  I am not going to let my DXM induced psychosis run away with me and say this has any particular meaning, because I know DXM can make you make connections that aren't there."
 ],
 "erowid": {
  "id": "31920",
  "citation": " Toadstool. \"Being Christ: experience with DXM & OBE (ID 31920)\". Erowid.org. Mar 25, 2008. erowid.org/exp/31920",
  "substance": "DXM & OBE",
  "views": "13245"
 }
}
