{
 "title": "Xanadu",
 "author": "Ease",
 "citation": " Ease. \"Xanadu: experience with LSD & Sertaline (Zoloft) (ID 53045)\". Erowid.org. Sep 30, 2008. erowid.org/exp/53045",
 "substance": "LSD & Sertaline (Zoloft)",
 "bodyweight": "160 lb",
 "report": "<p>Set: happiness, gradually descending depression for the last 3 months.</p><p>Setting: my bedroom.</p><p>To give an introduction, this experience occured on the 26th of December, and I had returned home from boarding school around the 15th, and until this point had not been home since the first days of September.  The euphoria of this change alone was extremely important.  I had started using drugs around a year before this point, marijuana mostly but I dabbled in many painkillers/sedatives and salvia moderately at one point, the dysphoria and seeming insanity of which I found very interesting.  I had been sober for three and a half months until I returned home for break.  I was taking 25 milligrams of zoloft daily, and had been doing so for around the last year.</p><p>Earlier in the day, a few friends whom I had not seen in a long time stopped by, friends that I have had since fifth and sixth grade.  They had recently started getting more and more into drugs, and my friend J. mentioned that they were purchasing acid that day, for 10 dollars a hit, and asked if I'd like to pitch in.  I was more than down, and began to try to understand the experience I was up for merely hours away.  My friends left, and I spent the rest of the day messing around with my brother, watching tv, things of that nature. </p><p>My friends came back around 9:00, including my friend C, a man I rarely ever get to see but wish I could spend more time with.  They brought the acid in, all of the hits, and stashed it in my freezer wrapped in tin foil.  We found some scissors shortly and cut the strip into four hits, mine being the biggest.  My friend c, having much experience with psychedelics and knowing this was my first time, wanted me to experience as much of a wild ride as possible.  My friend J was going to take two hits, and my friend N one.  We played some music, hung out, played some pool, generally enjoyed each others company.  I took my hit around 9:30.</p><p>When we went back to get the other three hits from my garage as they were leaving, J discovered one hit was missing.  Chaos ensued, all four of us were down on our hands and knees looking everywhere for the hit that disappeared.  I made some joke about four known drug addicts on our hands and knees, surely a criminal scene.  It didn't really help to lighten the mood, my friends J and K were quite on edge at this point.  Finally, J and K agreed to each take one hit, the hit that was lost was technically K's.  They took their hits around 9:45.  They left shortly thereafter.</p><p>I saw them out, and went and talked to my dad for a few minutes about a guitar pedal, and how it manipulates sound.  This was about 30 minutes into the trip.  I was coming up at this point, and noticed a slight differentiation in my consciousness, and I was extremely paranoid that my dad would see the paper under my tongue.  I handled it cooly though, said goodnight to my parents and went upstairs where my brother and I live.  I hung out in my room for a few minutes, and then recalled a national geographic.  I went through a stage in which I read mad national geographics just about every night while I smoked marijuana, I gained some important knowledge.  The one in particular I wished to find was all about human evolution and anthropology.  It came out sometime around 1990, after scientists had discovered Lucy, australopethicus afarensis.  The cover had her skull in holographic form.</p><p>I was in the study trying to find the book when my brother came in and started talking to me.  I shot the shit with him for a couple minutes, and was getting a little frustrated at not being able to find the book.  This was 45 minutes in.  At this time the paranoia had dissipated, and I felt slightly inebriated.  I felt like my vision was glowing to some extent and My limbs felt loose.  As I left the room, I did a flying tackle on my brother while mumbling something strange.  He had seen me under the influence to suspect something, but I don't think he actually knew I was intoxicated.  We laughed and I retreated to my room, national geographic in hand.  At this time I made the music selection for the night.  Jimi Hendrix- Are you experienced?, Pavement- crooked rain, Pavement- Slanted and Enchanted, Captain Beefheart- Trout Mask Replica, and Flaming Lips- Yoshimi Battles the Pink Robots.  I was wearing this pair of blue converse that I had meticulously spray painted Neon Green about a year and a half earlier.</p><p>Around an hour in, I sat down on my couch with Hendrix playing and decided to call my man W.  I had talked to him earlier and he knew the condition I would be in later that night.  As I called him I believe he was smoking in his bathtub.  When I stared at the shoe braced upon my leg, It started to look as if I was wearing the wrong shoe on my left foot.  The green on my shoe looked deeper and brighter than ever.  After this I called a girl who I had not talked to in a long time.  It was very comical at the time to talk to her, because of how intoxicated I was becoming as well as how randomly I had called her.  I remember saying bizarre things which isn't unusual for me even when sober, and she kept repeating to me 'You're on drugs, man, you're on drugs.'  I found this all very funny at the time.  I had a nervous kind of energy, and was pacing around my room while talking on the phone.</p><p>I hung up after a while, and at around 11:00 went into the bathroom to look at myself in the mirror.  I have always thought the advice 'never look into the mirror on hallucinogenics' is not pushing the experience as far as possible, not making it as intense as it can be.  I looked into the mirror, and began to notice things.  It seemed like my descending into the trip had been like a downward spiral into insanity, very measurably spiraling.  I noticed and understood this with grit and fascination.  This was quite different from marijuana, which at least when smoked, sends me from 0 to 60 in short time.  One second I notice I am sober the next I am noticeably intoxicated.  On LSD, I was slightly more intoxicated than I was the moment before every time I noticed, until I peaked and began coming down.</p><p>Hendrix was not doing it for me on the stereo.  The only song that really connected other than purple haze was in fact 'are you experienced.'  that CD ended and crooked rain came on.  At around 11:30, I felt like I was truly peaking.  My vision and consciousness seemed slanted, and there was a metallic twinge to my emotion.  Music sounded good, but not as good as it did to me on marijuana.  I have also come to believe that I experience more psychedelic symptoms from marijuana than does the common man; I have experienced mild synesthezia, medium hallucination, and am always multiple times as intoxicated as almost anyone I smoke with.</p><p>I never visibly hallucinated during this trip.  I began thinking more about cyclical/spiraling nature of things, particularly war and weaponry, and how essentially man has always been fighting over the same thing, power in its many forms.  The conflict has just taken many different shapes throughout history.  I was tripping at about the same point for about an hour, listening to different music.  I called my friends J and K, and was astonished to find out they were tripping hard.  Both of them had taken a walk from my friend K's house to the elementary school K went to and were trying to grok the signifigance of this.  They were hallucinating madly, and were surprised to find out I wasn't hallucinating, considering I had taken more than they.</p><p>I continued observing the downward spiral nature of my thoughts, and noticing this pattern in everything.  I remember feeling like I was really young again at one point, and growing in age.  Reading Stanislov Grof's theories on the death and rebirth cycle shed light on this process.  I spent much time in front of the mirror.  Even though I was not hallucinating, the pictures in my minds eye were distorted.  If I looked at my face long enough, it looked like my facial features were just stuck on the blank peach colored canvas that is my face.  As my face often appears when I am high, it seemed like the different sections of my face were coming together to meet as one.  I also had a mohawk at this time, and that made everything stranger.  I had this strange feeling the entire trip of deja vu, like I had been here before.  I normally write much on any drug, but I only wrote one sentence the whole night: 'It was like I'd seen acid happen to me a thousand times before it ever actually did.'</p><p>Coming down was chill, but the trip was nowhere near as intense as I'd hoped.  I love crazy intense experience, and at times the trip was wild, but I was far too in control of the experience for it to fulfill my hopes.  Twice when I was coming down my steps in the dark I could see out of my back glass door to the building down on the road near my house with lights solely on the top of it.  It looked like the top was covered in fog, like there was a fog machine up there.  It was a beautiful sight.  The thing that interested me is that both of my friends took less than I did and had much more of a hallucinatory experience.  I think the reason for this is that it takes more to get me uncomfortable than they, which has something to do with the intensity of the experience.  As well, the buildup of daily zoloft probably influenced the trip to an extent.  I would say I tripped relatively hard, but had next to no visual hallucinations.  The slanting and metallic nature of my consciousness sticks out to me most.  All in all, the trip was enjoyable, but I wish to take more next time.  Tripping alone is an experience.</p>",
 "year": "2005",
 "id": "53045",
 "gender": "Male",
 "timestamp": "2008-09-30T07:00:00.000Z",
 "views": "7062",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": "1 hit",
   "administration": "sublingual",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
