{
 "title": "Happiness and Then a Seizure",
 "author": "Anonymous",
 "citation": " Anonymous. \"Happiness and Then a Seizure: experience with Mushrooms  (ID 53055)\". Erowid.org. Jun 15, 2007. erowid.org/exp/53055",
 "substance": "Mushrooms ",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "3.0 g",
  "oral",
  "Mushrooms",
  "(dried)",
  "",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>I was excited to once again enter the world of tripping. This was my second time on shrooms. Me and two other people were more than prepared for this trip. This was my boyfriends first time tripping. I smiled and comported his nerves as he gazed at a mushroom that was to make him loose all control of himself. We all dipped our shrooms in some peanut butter to lessen the vial taste, and 'chowed down', the trip started out a little shaky for my boyfriend:</p><p>I'm not used to this kind of high</p><p>Honey I'm freaking out a little</p><p>He soon calmed down and gently let the feeling take over his body. The next three hours were nothing but laughter and amazement. My boyfriend began to weep with laughter as he explained that hes not being mean, but our other friend really looked like a frog. This was the peak of the trip.</p><p>As we all came down, we all felt a feeling of peacefulness, and love, remembering things like how nice it was to be little and to cuddle in our mothers arms. As we came down, we decided to smoke some MJ to ease back down and then hit up the local gas station for some beverages. But as we leave I have a feeling that I need to sit down, I immediately stop and sit at my kitchen table. I look at my boyfriend and said, I think somethings wrong' but nothing came out of my mouth. The next thing I see is both of their faces in a slight terror and I ask, What happened?' As I regained myself, I heard my boyfriend say, honey you had a seizure.</p>",
 "year": "2006",
 "id": "53055",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-06-15T07:00:00.000Z",
 "views": "2745",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
