{
 "title": "Combinatory Effects of Hallucinogens and Nitrous",
 "author": "Educated",
 "citation": " Educated. \"Combinatory Effects of Hallucinogens and Nitrous: experience with Nitrous Oxide & LSD (ID 5306)\". Erowid.org. Jan 12, 2002. erowid.org/exp/5306",
 "substance": "Nitrous Oxide & LSD",
 "bodyweight": "200 lb",
 "header": [
  "DOSE: T+ 0:00",
  "1 hit",
  "oral",
  "LSD",
  "(blotter / tab)",
  " T+ 1:59",
  " ",
  "inhaled",
  "Nitrous Oxide",
  "(gas)"
 ],
 "report": "<p>The usage of nitrous oxide with miscellaneous hallucinogens brings about an experience so markedly different in terms of intensity and meaning. Nitrous appears to be some type of catylist, launching the user to level of experience not readily attainable using LSD, Psylocybin, mdma by themselves. My suspicion is the react similarly to the way the harmine/harmaline MAOI's work allowing oral ingestion of DMT to produce the desired effects or increasing the potency of Psylocybin. There are several other synergystic situations in the Psychedelic fields where 1+1=3.</p><p>I have had many experiences using Nitrous but here is one of those that has stuck with me quite vividly. I had taken 1 hit of very strong, clean blotter acid before going to a party. About the time I was peaking, a couple friends and I went into a darker room where there was a large screen projection and some electronic musicians doing a live PA. PC's, keyboards, etc... The environment(always being important) was very relaxed and comfortable. Most of those in the room were tripping.</p><p>There was a tank in the corner of the room so I decided to get a balloon. I sat down next to my friend who was preparing to roll some smoke and hit the nitrous. What happened next took me 2 years to articulate. As the nitrous set in the room seemed to close in all around me. The music and pleasant atmosphere warded off any feelings of hesitation and so I allowed the flow to continue. As the room coalesced inside of me it burst through the other side (sort of inside out) into a sphere of full color, pulsating geometric designs in perfect time with the music. I was at the center of this sphere, I was the sphere, the music was the sphere, expanding infinately in all directions.</p><p>In that instant I had the most important epiphony I feel one can have. In that instant I crossed over, opened the door that our psyche uses as a protection mechanism that keeps us from connecting to where we came from. In that instant the words 'I know what its all about' came into my head. In that instant I was part of the eternal matrix that IS the TRUE reality. Where one knows all that has been, all that is, and all that will be. I know what YOUR great great great grandfather's best friend had for breakfast on his 3rd birthday! In that instant I realized the level of conectedness of everything that has ever been. The Psychedelic 60's coined a phrase: 'I am one with the universe' What we fail to understand is that we are!</p><p>Nirvana, Moksha, Heaven, Spiritworld...whatever you want to call it....if you are looking for a slingshot into where we come from, nitrous and halucinogens have the capacity to show it to you provided you are prepared to experience 'undiluted awe' I dont reccomend this for the novice!</p>",
 "year": "2001",
 "id": "5306",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-12T08:00:00.000Z",
 "views": "12811",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": " T+ 1:59",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 }
}
