{
 "title": "The Other Side",
 "author": "Mr. Anabaraxas",
 "citation": " Mr. Anabaraxas. \"The Other Side: experience with DXM & Salvia divinorum (leaves) (ID 53086)\". Erowid.org. Dec 9, 2008. erowid.org/exp/53086",
 "substance": "DXM & Salvia divinorum (leaves)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "750 mg",
   "oral",
   "DXM",
   "(capsule)",
   " T+ 2:30",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "report": "<p>I've been doing only legal drugs, and not too frequently.  Tried DXM and some salvia leaf I got by mail.  I know everyone doesn't, but I trip hard on just a couple hits of salvia leaf.  About a week ago I had done 750mg of DXM in gelcaps, and about 2 1/2 hours into it, as I was getting near the point of immobility, the idea came to me that maybe some salvia would be fun right about now.  Luckily I keep my pipe near to where I was sitting.</p><p>I remember raising the pipe to my lips a 2nd time.  I remember holding in my breath.  Somehow I became a rolling sea, which the person I had been was just a pattern on, which was torn apart as the wave crashed and broke and reassembled into new forms.  One of the last things that resembled my normal thought was 'I can't possibly have survived that'.  I don't think I really cared.</p><p>For a couple hours, I was a solid ocean of disassembling and reassembling forms.  I became rolling hills and a mauve sky, train tracks atop a building in a city, the deck of a ship and a procession of people, a molecule in an oscillating membrane fervently desiring to rise and fall in time, and many other things, some so alien I can't describe them.  Some were very large and some were very small.  Distance is just a quality like color or shape.  Time is just the rising and falling of waves, the movement of patterns on the surface.  Many of them had thoughts and identities within them which I became in part, people with complete lives and memories which I could remember, hopes and fears and dreams which were temporarily my own.</p><p>Then the ocean would move and the realities would be ripped apart and changed into something new.  I could *feel* this.  Parts of me would come apart at the seams, all over the place, and rotate, and slide along like a carpet of writhing nanomachines, turning and grinding and seething with life, flowing into a new facsimile of reality, which would stabilize and again seem like all the world for a while.</p><p>It was alien to anything else I've ever experienced.  I don't think many people would enjoy this.  I'm writing because I searched for a report on this combination and didn't find any.  I thought it was pretty interesting, and maybe someone else would too.  Of course anyone else might experience something totally different.</p>",
 "year": "2006",
 "id": "53086",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-12-09T08:00:00.000Z",
 "views": "4136",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "750 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  }
 ]
}
