{
 "id": 5311,
 "title": "Swimming in Eternal Warmth",
 "date": {
  "submission": "2006-03-17T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lex",
  "gender": "Female",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  },
  {
   "time": "1:00",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  },
  {
   "time": "1:00",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "6:15",
   "amount": {
    "unit": "shots",
    "quantity": "6"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  }
 ],
 "report": [
  "I've been a genuine stoner for about four years now, since I was around thirteen years old. Up to a certain point in time, my experiences never really exceeded the usual, fairly intense body highs and other amusing inebriations when I got blazed, but I recently decided to mix it up a bit. ",
  "It was Saturday night and I was ready to do cocaine for the fourth time. The previous times I did cocaine werent very big doses  maybe a few decent lines each time, probably cut to hell with things like fucking rat poison, but Clinton told me what we were dealing with this time, so I was pretty confident I was going to get the full effect (this was some 100% pure, uncut shit, Im telling youIve never had anything quite like it).   But anyway like I was saying, it was Saturday night, around 7 oclock and Clinton came to pick me up. My parents trust him too so it was always incredibly easy for me to get away with just about anything. As we were sitting in the car, Clinton introduced me to Gary, who I found extremely attractive at the time. We sat and chewed the fat for a while and then Gary pulled out the gram of yay just to give us a look. ",
  "We got to his apartment and made our way upstairs and into his bedroom. The three of us sat on the ugly couch-like bed, me in the middle. Gary pulled out the gram of the gram of yay and I suddenly felt excited; I was ready for a great time. He slightly stuck my finger in the baggie and told me to rub it on my gums just to get a taste for itI was told in the past that this was an incredibly stupid thing to do, but I did it anyway. Clinton turned on some Pink Floyd as Gary started to make three lines on his convenient glass side table. Gary told me to go first so I rolled my dollar and snorted the fat line. It went up so easily and I instantly felt that cold, numbing feeling deep in my nostril. As they did their lines, Gary told me to help myself to another, so I snorted two more, waited a couple minutes and then did another.",
  "My entire nasal passages were completely numb and it felt like all of the blood running through my veins suddenly rushed into my brain. The cold numbing feeling had slid down my throat each time the cocaine flew up, causing me to kind of choke. Within seconds more feelings began to overcome me. I was confused and anxious for a minute, but then everything started falling into place. Words, thoughts, answers, questions were swarming through my mind and with every spoken word, I uncontrollably analyzed what it might have meant (for example, at one point Clinton had something totally irrelevant like did you get that painting from Wal-Mart? and I sat there trying to figure out if there was a specific reason why he had asked such a question.) Along with this perpetual confusion, I felt I had to accomplish something quick because I was completely superior and invincible beyond comprehension. I couldnt control the intensity of my breathing, or the speed of my heartbeat or the constant movement of my entire body. My insides became freezing but my face was hot and sweaty. Time rapidly passed and we did another line. Everything increased and intensified  my senses, these feelingsbut something was different this time, I loved the two other people in the room, I loved the beautifully soft pillow I was grasping, everything was just fantastic and I really did believe I was capable of anything at that very moment.",
  "It felt like ten minutes had passed when actually about an hour had passed. It was only about 8:30 and we still had more coke, among other things. What happened next was just, bazaar. Gary pulled out a package of balloons of all things and I started laughing. Then he brought out these metal tube-like cartridges and Clinton said ohhhthis shit and started laughing. Gary told me to watch as he took one of the cartridges and put it in another metal object. Then he took a balloon and wrapped the opening around the little nozzle as if he was going to fill it up with helium or something. He twisted a little switch and the balloon filled. Gary put the balloon to his mouth and inhaled the gas but then blew it back into the balloon and then inhaled again. He did this about five more times until there was a crazed expression on his face. It looked like Gary was going through some kind of frenzy, it was absolutely hilarious. Clinton set up a balloon and then handed it to me.",
  "Inhaling even the first time was utterly insaneit was cool and smooth in my head like a misty fog. I began to fall very fast, yet subconsciously I knew I was still sittingbut it didnt matter. I kept inhaling and exhaling until it felt like I was suffocating and then all of my senses were sensitive and heightened. I heard a loud screeching noise, like metal slamming and sliding against metal. Everything was flashing and I couldnt see anyone anymore. It was like staring into a buzzing TV set. The whole experience was so amusing that I started laughing, uncontrollably. Clinton and Gary were talking fast and asking questions but I did not understand or care. This one-minute high sadly began to weaken and gently fade into a nice tranquil feeling.",
  "I sat there for a bit, in my confusing state of mind  part of me wanting to be relaxed and peaceful, while the completely spun part of me wanted to get up and jump around. But I just sat, my body still uncontrollably quivering. Gary put his arm around my waist and told me to calm down but obviously he wasnt as spun as I was because there was no way of controlling this hyper craze. Clinton got up and started pacing and then went outside for a cigarette. Gary got up and turned the lights to a dim and said, Hell be gone for a while. Gary came really close to me and started feeling me up and we started making out. A few minutes of this and he was right on top of me. Normally I would have gone for it, Ive always been a pretty promiscuous girl but this time I had absolutely no sex drive what so ever. I was only interested in doing more drugs, bouncing off the walls and accomplishing the physically impossible, so I said maybe later. He was a good guy, got off of me and then pulled out a baggie filled with weed, looked like a gram, of the hairiest marijuana Ive ever seen. It was so hairy, it was more orange than green. I took it out and gawked at all of the beautiful crystals and hairs. It was so dense and sticky, I was in awe. Clinton came back in and we immediately started to blaze. We smoked everythingmy weed, his weedit was fabulous.",
  "It was a horrible series of feelingsfollowed by the incredibly wonderful feelingsI guess it was some skunk, hash, chronic of all chronic shit, (which was also being combined with my current highs) but whatever it was, it was fucking powerful and overwhelming. The first hit was incredible; I thought I was going to die form the wonderful burning in my throat. But I could handle it at the time, so I took hit after hit off of the marvelous bowl. After a while my perception of reality became too confusing to bear, so I had to just turn off my mind. I stood up without having any recollection of doing so and looked around at the rooms contents. My breathing got very heavy and then turned into short, almost gasping breaths. I heard Clinton in some far away land saying things like Lex?? Are you okay? Dude what the fuck is wrong with her man My body was spinning and spinning in some anomalous universeI could no longer see or hear anything and reality was totally distorted. I couldnt even think and if I tried to escape the inebriation, it felt as though a wave of suffocation overcame me. My brain was buzzing and literally felt like my insides were being fried.",
  "I couldnt tell if I was truly in pain, or if I was just having some weird, uncontrollable, mind boggling high. The pain and suffocating went on for a while and it felt like I was trapped in the universe, like there was no way I could ever escape for all of eternity. But I did escape, or eventually kind of wore out of it. When I did, my eyes opened to Clinton and Gary standing over me and they looked terrified. I was so stoned and now that I was out of the bad trip, I had that glorious body high, where the earth sucks me into the ground and things like sound waves and visions seem to massage meexcept this high was more intense then ever. They pulled me up from the ground (later they told me I had fallen flat on my back) and we sat on the couch/bed, laughing our asses off at things like the word boom. Everything was just so amusing because of the fact that we were three people sitting in a room doing absolutely nothingbut secretly we had the key of having a good time and no one else in the world didit was only us and nature who shared the truth of this superior feeling.",
  "I looked at the clock and to my utter shock; it was one in the morning. I wasnt tired at all, and neither was Clinton or Gary. We did the rest of the coke within a half an hour and the whole pattern repeated.",
  "Around 1:45 I pulled out the booze. Clinton didnt want any, but eventually took a couple shots anyway. I had about six shots and Gary guzzled the rest, throwing it all up later.",
  "My sex drive skyrocketed. Not only did I now want to have sex with Gary, but also I wouldnt have minded getting it on with Clinton either. My entire body tingled with sloppy happiness and my insides were warm and cozy. Gary started to run his fingers through my hair and every time he did, the warm sensation increased, flowing into my heart and blood and I could almost visualize what was happening inside of my bodyit was subtly orgasmic. Clinton wanted to go for a drive but I just wanted to swim in my eternal warmth, on Garys lap. So Clinton left, and it was just Gary and I.",
  "Yes, we did end up having sex, and dont worry, Ill spare the details. But I will say that it was a wonderful experience. I had this immense energy because of the cocaine and at the same time, I felt like I melted into him, which caused the orgasm to last for what seemed like hours.",
  "So this was my experience, along with the excruciating headache, which followed in the morning."
 ],
 "erowid": {
  "id": "31943",
  "citation": " Lex. \"Swimming in Eternal Warmth: experience with Cocaine, Nitrous Oxide, Cannabis & Alcohol (ID 31943)\". Erowid.org. Mar 17, 2006. erowid.org/exp/31943",
  "substance": "Cocaine, Nitrous Oxide, Cannabis & Alcohol",
  "views": "9290"
 }
}
