{
 "id": 5313,
 "title": "Rachael Head Trip",
 "date": {
  "submission": "2005-09-16T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "LaetaRachael",
  "gender": "Female",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Background:",
  "I have never really used any illegal drugs, though I have always been open to the idea of them, especially psycadellics. I recently moved in with two new roommates. One of which has been very expirenced with drugs, and mostly smokes pot now (We'll call her E) , and the other who has an avid intrest in drugs and has informed me throughly about them (we'll call him T) . ( He is who actually supplied the 2C-I.)  Since moving in I have only tried Pot 3 or 4 times, and I didnt really like it.",
  "The Night:",
  "The Boys (T and E's boyfriend who will be refered to as N) took 25mg's and E and I took 20mg's. This started at about 9pm and we ran to the store to get popsicles and other things we thought we might want for the rest of the night. after we returned home T was the first of us to start seeing visuals. and slowly E and N followed suit. An hour later I still was not seeing anything, they would say stuff to me like 'YOU mean you really cant see this?' I was starting to get frustrated that my first drug expirence turned out to be a bust. I asked for a little more so my dose would be the same as T and N's. I had also eaten a big meal right before our trip. So T agreed to give me some more.",
  "We measured out 5mg's and I took that. We were all in one collective room and I was getting more and more frustrated by not being able to see anything or feel anything. If I closed my eyes and concentrated I could see colors and different things and my body felt all tinglely but as soon as I opened my eyes, it was gone. I eventually went to my room to be alone. I took out my contacts out of frustration, I thought that they were hindering me from being able to see the visuals I expected to see. Soon after that I decided to write.",
  "I had the lights on and there was no visual distortion in my handwriting and grammer to speak of. When I turned the lights off however the lines got bigger and not as straight but still very legable. I just laid in my bed and wrote. Here is some samples of what I wrote.---'My thoughts are moving a lot faster than my pen, but my pen doesnt forget what I've decided to write.'----'I think I might have figured out how eye sight works, it's just layers of light on top of each other. They lay flat on top of each other, some touch, but only some. Every thing is pretty mathamatical and functional, Logic is how things are obtained and lost. I wish I could write with the lights off, but the layers are dark versions of color and the shapes cant be differed from each other as easily.",
  "When I explain things, they become more complicated.' This theroy of how eyesight works, I used the rest of the night to see things. (Like I said before I took out my contacts, and so I was pretty much blind to anything far away, but while I was tripping I could figure out the time on clocks or other things similar to that just by using the therory above.)",
  "I didnt ever set down my pen, even after the other 3 came into my room to check on me, I still worte, I could write and socialize at the same time. At one point T asked me, 'if someone asked you the effects these drugs had on you what would you say?' I told him that I would say that it heightens your senses and gives you a clarity of thought. I contimplated the Universe and our place in it. I came up with therories and different Ideas of How we should exsist. I decided that we are all Light. That there is no Right or wrong, good or bad, negative or positive.",
  "My trip lasted well into the next day, I still had clear thoughts and I was still figureing things out at 10 o' clock the next morning. ",
  "The come down was was almost as frustrating as the come up.I found myself jittery and I could not do the one thing in the world I relaly wanted to do, Sleep. I, at one point even felt like cleaning my whole room just to get rid of some of the energy I had. I did, however, start to see things. I saw glitter in the sky and I also saw the frost one my popsicle move, and weave in and out of itself. After a shower and concentrating on my breathing I fell asleep about 1 o' clock in the afternoon the next day. ",
  "When I was asked what I learned, I answered, 'Nothingness is Perfection, Acceptence is Key.' (this was when I was still tripping)"
 ],
 "erowid": {
  "id": "31946",
  "citation": " LaetaRachael. \"Rachael Head Trip: experience with 2C-I (ID 31946)\". Erowid.org. Sep 16, 2005. erowid.org/exp/31946",
  "substance": "2C-I",
  "views": "6274"
 }
}
