{
 "title": "The Stargasm",
 "author": "CaBear",
 "citation": " CaBear. \"The Stargasm: experience with 2C-I & Piperazines - BZP (ID 53173)\". Erowid.org. Aug 17, 2006. erowid.org/exp/53173",
 "substance": "2C-I & Piperazines - BZP",
 "bodyweight": "300 lb",
 "report": "<p>I am not extremely experienced with psychedelics, but was always fascinated with their potential. I have ordered several Research Chemicals for the purpose of trying to find a good combination.</p><p>I have obtained 2C-I and BZP and mixed 15 mg of 2C-I with 100 mg of BZP. Gel caps were taken at 5:30 pm.</p><p>T+0:15 - Start feeling a little different. Feels like a slight buzz, warmth, improved mood</p><p>T+1:00 - The effects are increasing and are very similar to MDMA onset, but more speedy and pleasant.</p><p>T+1:30 - Absolutely amazing! Music sounds absolutely heavenly. The beat generates waves of pleasure and euphoria that echo across the entire body. I must say... the E pills I tried before don't even come close the level of euphoria and stimulation on this combo. I am chatting online and having an absolute blast.</p><p>I have noticed that communication with people online is much more pleasant than talking with my friends in a room. I am being very cordial and sweet to people I am talking to. At the same time the sense of humor, the way I phrase my sentences is very elaborate and creative.</p><p>T+2:15 - I am peaking with Euphoria. I retired to my room to see how it will feel to masturbate. It is interesting that I wasn't feeling very sexual per say, and did not want to have a sexual experience with a person, but rather by myself. So, it is hard to masturbate, as I have some major shrinkage, but it is still fully functional. I will cut the details out. I have tried pot, meth, MDMA, mushrooms and salvia.</p><p>My favorite orgasm came from Salvia+Cannabis and Meth... as I call them 'rolling echo orgasms'. MDMA is somewhat similar to those as well. Yet with this combination it was different. The pleasure was not as intense but it felt more like an explosion of star... there is a silent and bright flash and then I see the explosion of the matter reaching out from the center with increasing noise. That's the best way I can describe the orgasm. I jerked off 2 more times that day and the effects were similar.</p><p>T+3:30 - T:+8:00 - Now that is the best time! Interestingly, the mind high comes a bit later... I feel almost just like MDMA, being full of love, appreciation, goodness and warmth - empathy just flows! Perhaps this the actually the best part, as body high is lessened and now there is more focus on the body.</p><p>T+12:00 (5:30) I am finally ready to sleep. I still feel the effects. The comedown is very gradual and slow... and I start missing all the excitement.</p><p>Overall:</p><p>I think this combination of 2C-I and BZP is absolutely fantastic. I didn't feel any side effects at all, and the comedown was similar to MDMA but not as intense. One thing that I must say was a little bit interesting, is that there is much more control over my mind while on this combo. I can distract myself from euphoria by simply focusing on something. Overall, I was absolutely blown away with this.</p>",
 "year": "2006",
 "id": "53173",
 "gender": "Male",
 "timestamp": "2006-08-17T07:00:00.000Z",
 "views": "10476",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Piperazines - BZP",
   "form": "(capsule)"
  }
 ]
}
