{
 "id": 5320,
 "title": "Homework Helper",
 "date": {
  "submission": "2004-11-12T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "J.H.C.",
  "gender": "Female",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  },
  {
   "time": "7:00",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "10:00",
   "amount": "0.25 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": ""
  }
 ],
 "report": [
  "Yesterday while I was with a friend of mine, she asked me if I had any painkillers (I usually do b/c I have sciatica).  Seeing as I only had 3 Vicodins left that I didn't want to part with, I gave her a handful of Tylenol 3's instead.  To pay me back she gave me 4 200 mg. Provigils.",
  "She said they would keep me awake and alert, and as I have been anxious to try Adderall or some other stimulant (however Provigil and amphetamines aren't the same at all except for their ability to keep you awake) I figured why not?  The next day as I was getting ready for work around 2:00, I broke one of the provigils in half and swallowed it with water.",
  "A couple hours went by and I felt nothing. Around 5:00 when my boss left the University (I work at my school) I started working on some homework.  As I was working I noticed I hadn't stopped moving my pen for an hour straight.  This is highly unusual for me as I have a very short attention span when it comes to homework.  I'll at least take a break to rub my temples and I didn't even do that.  I kept working on my homework until I left and concentration came very easy to me. ",
  "I didn't really feel stimulated, and my apetite was still normal.  Later on in the evening I came home and throughout the night proceeded to smoke 3 bongs of cannabis from about 9:00pm to 12:00am.  There was no difference felt when smoking.  From other reports I knew I might have a hard time falling asleep and my boyfriend's snoring wouldn't help any, so around 1 a.m. I popped a xanax and fell right to sleep.  I did wake up however around 3 a.m. and had a hard time falling back asleep.",
  "In my opinion there is no recreational value whatsoever at the dose I took for this drug but it really helped me get my homework done.  I'll be saving the rest for finals."
 ],
 "erowid": {
  "id": "31963",
  "citation": " J.H.C.. \"Homework Helper: experience with Modafinil (Provigil), Cannabis, Alprazolam (Xanax) (ID 31963)\". Erowid.org. Nov 12, 2004. erowid.org/exp/31963",
  "substance": "Modafinil (Provigil), Cannabis, Alprazolam (Xanax)",
  "views": "26094"
 }
}
