{
 "title": "Scary but I Liked It",
 "author": "Lachdannan",
 "citation": " Lachdannan. \"Scary but I Liked It: experience with 5-MeO-DMT (ID 53200)\". Erowid.org. May 1, 2009. erowid.org/exp/53200",
 "substance": "5-MeO-DMT",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "smoked",
   "5-MeO-DMT"
  ]
 ],
 "report": "<p>Before I even get started I would like to note that I shouldn't have taken this much EVER.</p><p>9:45 pm: Me and friend 'A' came across a 100mg bag of 5-meo-DMT that was given to us to pay off a debt, we reluctantly accept. We call a friend who had done it before, he said just start at about 3mg and work your way up untill your comfortable.</p><p>10:10 pm: we arrive at our home and decide that it is time to try some, being as it was both myne and a's first time we decided that we would smoke it at the same time. Remembering what our friend had said we load up 20 mg.</p><p>10:13pm I take my hit first. I held the lighter far away from the tinfoil because it was cheap, so it took a little bit to melt, very soon after a stream of white smoke arose and I inhaled it for about 6 seconds and then held my breath for about 30 seconds, it was 10:15 by the time this process was all done, my friend finishes it.</p><p>10:17 pm: I felt very strange and kept forgetting to breathe, me and A kept relaying this message back and forth to each other 'remember to breath' I felt weak and almost bubbly but aside from that and the lightheadedness I wasnt feeling anything. It was time for more.</p><p>10:18 pm: I measured out about the same ammount and smoked it all. I then stared at the clock, I kept hearing a strange buzzing but it was just background noise at this point I completely focused on the clock. I stared at the clock, it felt like its hands were taking too long to move, I then was kicked in the face by an EXTREME rushing sensation that was almost too much to handle, falling backward and hitting my head on my cold floor I was gasping for breath, I would breath deep and hard but it seemed like I still wasnt getting air, but I knew I had to keep beathing because A wouldn't shut up about it, I was getting pissed off at this point because he kept laughing, I looked back at the clock and it read 10:21 then I stared laughing while gasping, I somehow found humor in this almost scary specticle as well.</p><p>10:21 still..: I felt like my breathing had become semi normal, I was able to take full breaths that were satisfying, then I would laugh/choke them out, I still felt the rushing but was pretty sure that I was going to die at this point so I didnt really care. I turned my head to the side to vomit but then I decided not to because I didnt want to go out hendrix style, I felt like I was going to several times after that but stoped myself each time laughing insanely each time afterward.</p><p>10:25: The rushing was almost completely gone by this point, and I had become very comfortable with the entire experience all together, I no longer felt like I was going to die, I felt VERY happy, I could breath normaly at this point so I decide to get up.</p><p>(a short time later A knocked the clock down while he was stumbling around looking for his cigaretes, so I no longer was able to document my experience by time.)</p><p>Upon getting up I felt very free and euphoric, (I hope thats how to spell it) my movements felt like they were effort free actions, the same as if you had just huffed nitrous, and I felt very happy for a short time after.</p><p>All together I like the experince and wanted to do it again, like right then, so we put a small pile more on but we didnt feel the effects of it.</p><p>I found a clock and it read 10:45 and I still felt happy but not like I did before, so i figure I triped for about half an hour.</p><p>I would like to note that after all is said and done, I would never do that again. I dont like coming as close to death as I suspect I did, by the looks of it I took too much, but thats how I roll.  ONCE AGAIN I would like to state not to ever use that much, I was very high and tripping out so I more likely than not under exzagerated this shit, I almost died and I think many other people might if they took the same amount.</p>",
 "year": "2006",
 "id": "53200",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-05-01T07:00:00.000Z",
 "views": "4411"
}
