{
 "title": "I Don't Remember, But My Friends Saved Me",
 "author": "Sereina",
 "citation": " Sereina. \"I Don't Remember, But My Friends Saved Me: experience with GHB & Alcohol - Beer (ID 53212)\". Erowid.org. Mar 19, 2007. erowid.org/exp/53212",
 "substance": "GHB & Alcohol - Beer",
 "bodyweight": "115 lb",
 "report": "<p>I am a 23 year old female and I live in Berlin, Germany. I had began my friday night drinking with my boyfriend and some of his co-workers. We arrived at the party at about 3am or so. I was sitting out in the garden at the party and saw some guy drinking something from a syringe. I spoke with him briefly and learned it was GHB and he had just purchased it. My boyfriend thought I was asking the guy for some, but I wasn't interested in taking it...although I have always been curious about it. I had no idea what it was or what it did to people. I knew it as the date rape drug though.</p><p>I had been constantly drinking beer and sharing them so I probably had four large beers in about 3-4 hours or so. the hospital did not test my blood! they assumed that the info given to them by the guy who said it was MDMA or extacy, was correct, but i know it was not! i have never ever had someting even remotely close to that happen to me! i know it was GHB because GHB was at the party, the guy who gave it to me said i could sleep it off (like most ghb cases) and like i said MDMA does not come in liquid form.</p><p>Upset that my boyfriend thought I had been asking for some, I stormed back into the party and danced. I saw an acquaintance and asked him how he was feeling. He said he was flying and so I asked him to get me some of what he took. He said it was pure MDMA. I have taken pure MDMA many times in a powder form and found it to be a great experience every time. I have never had a bad experience with it. He asked someone for me and then told me it would cost 3.50. I had no money so the guy agreed to give it to me for free (I'm glad at least I didn't have to pay for what was coming...although I'm paying for it now) they gave me a small shot glass with a clear liquid. I would compare the amount to a soda cap full, a very small amount! It tasted horrible and I washed it down with beer. After 5 min I felt loose and was dancing freely with my arms raised, but it became too much. I was dizzy so I went out to the garden and tried to puke. I could not hold myself up and laid down, curled up in a ball. My boyfriend came and asked me if I took GHB and I laughed like a lunatic and slurred that I was ok, then completely lost consciousness. I remember nothing of what ensued after that.</p><p>I woke up in the hospital. I had no idea how I had gotten there. I was alone and nobody spoke english. I puked on the floor and yelled out Where am I? Where is my purse? (I hate loosing things) I was experiencing extreme spasms of (what seemed to me as) pleasure. So much it flowed through my entire body and I moaned each time. Now I have no idea if that feeling was from the GHB or the stuff they were flushing through my veins to clean me out. I knew my hand felt funny but I could not move and was laying on it. I later realized I had an IV in it! From what my friends tell me after I passed out, I began foaming at the mouth and had spit running all over my cheeks. I was dead weight and my breathing was shallow. They put me into the fetal position, held my tongue so I didn't choke on it. They took off my shoes and put ice on my feet and head (yeah, they had no idea what to do and when they didn't find ice right away they put cold meat on my head!) I'm sure I'd be embarassed if I could remember the experience, it all happened in front of a party full of people. The guy who actually provided it for me laughed and said I would be fine in 2 hours. Finally they decided to call the ambulance (it took all of 20 min from the time I took it till the time I was being carted off in an ambulance.)</p><p>The ambulance came into the garden (again everyone at the party watching!) and checked me. It's really hard to imagine myself passed out and being put on a stretcher in front of a party of my peers. The paramedics did not want to hear what my friends had to say and threatened to leave if everyone did not back off. When I woke in the hospital, one of the staff asked what was up with me and the nurse told him I had taken EXTACY! The hospital did not test my blood, they assumed that the info given to them by the guy who said it was MDMA or extacy, was correct, but i know it was not. So I guess they never got the information right (all anyone knew about me was my name), mainly due to the guy who had hooked it up for me who STILL insists that it was MDMA and just a different form than he had taken (powder vs. Liquid, too bad it doesn't come in liquid form! I am just an inexperienced partier!) He tried to say I had a bad reaction because I am thin and may have eaten a banana that day...what BS! I have never ever had something even remotely close to that happen to me! i know it was GHB because GHB was at the party, the guy who gave it to me said I could sleep it off (like most ghb cases) and like I said MDMA does not come in liquid form.</p><p>I don't understand why they call GHB liquid extacy anyways because it is NOTHING like extacy!  At first I was a bit upset that they had called the ambulance, but nobody in Berlin really has a car so it was the logical choice. I didn't take it all too seriously after because I knew nothing about GHB and I did not remember the scary experience, but after looking up GHB deaths on the internet I am sure that I probably would have died and my friends saved my life by calling the ambulance. I was fine after sleeping half the day and went out to dinner and had a normal weekend (I quickly became some sort of celebrity after this, arg.). I was freaking out about the medical bill because I know just an ambulance ride in the states can cost a grand and I have no insurance, but when I got the bill a week later it was only 136 Euros for everything, so cheap! I learned from this that you should always comfirm what the hell your taking before you take it (seems obvious, huh?) and that GHB is a stupid pointless dangerous poison! I don't think anybody needs it. There are way better, funner and safer drugs out there.</p>",
 "year": "2006",
 "id": "53212",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-03-19T07:00:00.000Z",
 "views": "14176",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": "1 cap",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 }
}
