{
 "title": "Thinking Mushrooms Taking Meds",
 "author": "MKR",
 "citation": " MKR. \"Thinking Mushrooms Taking Meds: experience with Mushroom - P. cyanescens, Syrian Rue, Lithium & Lamotrigine (ID 53215)\". Erowid.org. Feb 28, 2008. erowid.org/exp/53215",
 "substance": "Mushroom - P. cyanescens, Syrian Rue, Lithium & Lamotrigine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Syrian Rue",
   "(capsule)",
   " T+ 0:40",
   "1.0 g",
   "oral",
   "Mushrooms - P. cyanescens",
   "",
   " T+ 0:00",
   "150 mg",
   "oral",
   "Pharms - Lamotrigine ",
   "(daily)",
   " T+ 0:00",
   "600 mg",
   "oral",
   "Pharms - Lithium",
   "(daily)"
  ]
 ],
 "report": "<p>The whole reason I want to share this experience is to offer more information about mushroom use for people on Lithium (I take 300mg lithium 2x daily). AND Syrian Rue use for people on mushrooms</p><p>(T = time in [hr:min]</p><p>T 0:0.  I ground 2grams of Syrian Rue seeds to a fine powder. Powder was packed into gel-caps and swallowed.</p><p>T 0:40.  1gram Cyanescen mushrooms were chewed and swallowed.</p><p>T 1:30.  Mushroom trip begins coming on this is normal timing for me.</p><p>T 1:30  3:30.  I experienced what I consider Normal effects (what I experience on mushrooms without Syrian rue).</p><p>T 5:30+. Typical effects of mushrooms are continuing to get stronger and have been doing so for the last 4+ hours. To me, the effects are normal BUT the continuing increase in strength is not, I usually reach a plateau ~3hrs from start of effects.</p><p>T 7:00. My coordination is greatly impaired. I walk and move my hands with about as much accuracy as I do when I am very drunk. *Mushrooms do not normally affect my coordination or ability to walk strait.</p><p>*At this point, which is now at least 5-6+ hours into the trip, I recognized I would normally be coming down off the trip back to baseline.</p><p>T: 8:00. I am experiencing audio hallucinations and strong distortions in sound. This has never occurred before and is a unique experience to this trip. Sounds including my own voice, echoed indefinitely.</p><p>...(Very strong visuals as well)...</p><p>T: 9:30. My speech becomes incoherent and I talk with little understanding of what I am trying to say I became detached and oblivious, my behavior was repetitive. To put it best I became Zombie like.</p><p>*After this I black out, I was still walking around and bumping into things, but I have absolutely No Memory after ~T: 9:30. (I know this from my two honest/reliable roommates)</p><p>T ~10:45.  I am awakened by paramedics. I pop back into consciousness to find a handful of paramedics circled around me holding my arms and legs down. This was terrifying. I was disoriented and had no idea why they were in my living room. I had had a seizure and my roommates called 911 because they were scared.</p><p>To spare you the details, it has been a little over a year since this happened and I still have a fear of having another seizure. The anxiety associated with this fear is difficult. What more can I say?</p><p>I have had no seizures before or after this experience. I have never tried Syrian Rue with mushrooms before or after this experience. I Have taken significantly larger quantities of mushrooms without Syrian Rue. What I gained from this experience was a fear of having a seizure, a fear of going to the hospital and embarrassing myself if I eat mushrooms, and a profound respect for Syrian Rue.</p>",
 "year": "2005",
 "id": "53215",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-02-28T08:00:00.000Z",
 "views": "12290"
}
