{
 "title": "Ridin' Spinnaz",
 "author": "On",
 "citation": " On. \"Ridin' Spinnaz: experience with Salvia divinorum (10x extract) (ID 53222)\". Erowid.org. May 31, 2006. erowid.org/exp/53222",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "175 lb",
 "report": "<p>Backround info first, trip report second-</p><p>I have a lot of experience with salvia, but I still consider myself inexperienced.  Ive been smoking it off and on for four years, and usually with generous doses of extract.  What makes me write this report is one set of similarities I see between a lot of my friends trips and my own trips and other trip reports. </p><p>I believe that the human mind exists as a sort of point in space, and there are several different directions that salvia trips can take from that point.  Imagine an XYZ co-ordinate plane with the human mind as 0,0,0.  Each trip could be seen as a ray from 0,0,0 landing on a different coordinate.</p><p>Anyway, one common trip, probably the one that Ive experienced the most and one I hear about from my friends and see here online, is the trip of a spinning sensation.  In my early days of smoking this would be a confusing ordeal filled with a jumble of shapes and sensations and all sorts of things that left me dazed and bewildered.</p><p>Over time as I smoked, ideas came to me out of the trip that helped make the voyage clearer and more lucid.  The first and most important revelation was that the confusion and jumble of shapes and voices I heard were my own thoughts.  I realized that I couldnt go into a salvia trip with my brain scattered all to hell like it usually is.  So I started meditating.  Really all Id do was sit and try and relax a little, calm myself down, before the trip. </p><p>After that I could see during my salvia trips.  I saw I was in a sort of a cavern, with irregular projections on all sides.  All I could see was a glimpse of this though, and I didnt really care - at the time I was more concerned with speaking to the voices or entities I would perceive (Ive since come to believe that they are my own thoughts and desires, disembodied by the salvia experience.)</p><p>My next revelation came during another trip.  All these revelations by the way, came from when I would dramatically increase the dosage and black out for a portion of the trip.  Anyway, after this blackout I found myself very comfortable, as opposed to the usual uncomfortable sensations of salvia. I looked down to my legs, to find myself sitting cross-legged, or Indian style.  The way my legs looked was so cool, and I was struck with a sense of rightness.  This was impressive to me because Ive never been able to sit cross-legged, Ive got long legs or funky knees or something and its never been comfortable for me before in my life. </p><p>By combining my pseudomeditation with this new posture I was able to radically change the nature of my salvia trips.  By clearing my mind I was able to see, and by sitting cross legged (and eventually holding my hands in either the Buddhist meditation loop thingy or together in the Christian prayer method) I was able to remain firmly planted in whatever realm salvia chose to blow me. </p><p>Here is a trip report:</p><p>.3g 10x salvia</p><p>175lb male, 20 years old</p><p>I pack the bowl of my acrylic bong full of 10x extract, sit cross legged, and try and calm my mind.</p><p>Using a torch style lighter, I smoke the whole bowl and clear the bong in one big hit.  Part of my ritual is smoking and clearing the whole bong in one hit.</p><p>00:00:00</p><p>The smoke enters my lungs.  I like the taste and never have a problem holding it as long as I want.  I close my eyes.</p><p>00:00:15</p><p>I notice that my mind has cleared of noise type thoughts, all that remains is me the internal observer.  If I, the observer, try to think from here on out, the experience is a bust.  If calm, I cant notice any change at all from my day to day awareness.  For all I can tell, I am stone sober sitting down calmly with my eyes closed.  (From experience with friends timing me, I know that if I try and open my eyes and interact from about the 15-20 second point my vision is messed up and I see a million thin layers on everything and I stumble around etc.)</p><p>00:00:45-00:04:00</p><p>This is where the experience really begins.  I still feel sober, but the static in my minds eye resolves into the cave.  In one sense, everything is totally open and I see in 360 degrees, but in another sense I am looking slightly forward, and my perception is focused on a wall of the rotating tunnel/cave.  If I am looking directly at the wall, I see with crystal clear vision, a million iterations of my face that make up the walls of the cave.  Depending on how often Ive been tripping, there may be half bodies of mine sticking out, rotating and writhing. </p><p>The faces and the bodies seem to be the different masks I take on in life, all the different things in my brain, my universe, that arent me.  All I really am is the silent, impartial observer.  Everything other than that grain of sand, that atom, is illusion, a face on the wall of the spinning cave.</p><p>Now as this is happening I am floating further down the cave/tunnel.  Sometimes there are runes that I float through, and from the end of the tunnel a light is emanating.  When I try and look at the light, I only focus more intently on the wall of the cave.  As I let go, and just flow, my vision moves further and further ahead, taking in more and more, until Ive let go of myself, let the internal observer dissolve, and then I behold the ball of white light at the end of the tunnel.  It is the sun and it is God.</p><p>I had to let go of the root of my being to perceive the light.  To me this is like dying to see myself from a different perspective.  I had to stop looking and realize that I was already there, every rune I passed through on the tunnel was the same as the sun at the end. </p><p>And with this vision the revolving walls resolve into the sun, which is only a dot, and the picture zooms out as I open my eyes, and the whole everyday world is revolving too, and I see that I am just a small fleck of dust in the world, the cosmos. </p><p>I see parallels here with the Buddhist/Hindu concept of the Wheel of Samsara, because that is exactly what the trip resolves into, myself a speck of dust, burning for a brief instant.  I believe that is what it means to be caught in the flow of time, to burn and be consumed.  And in some ways, that is the most beautiful thing imaginable, a cosmic dance, but to me, at this time in my life, it fills me with sorrow.</p><p>00:04:00</p><p>Ive never had a trip last longer than four minutes.  After I open my eyes and the world resolves, everything looks fresh and beautiful, yet cheap and fake at the same time.  The view of the beach out my window is spectacular and beautiful, intricate and complex, continually evolving and totally alive while at the same time it is no more than the TV-windows in the movie Total Recall. </p><p>Afterwards I feel a charge and a power almost exactly like the post-rush heroin high.  I see a lot of parallels between salvia and heroin, it seems almost as if the rush could be slowed down it might be the same as a salvia trip.  Unlike heroin, the afterglow is also burdened by a sadness as complete as the euphoria.  I find the afterglow perfect for attending a party and getting totally obliterated.  The feeling is somewhat infectious.  As an alternative I write some poems or draw a picture. </p><p>This is one direction Ive been able to ride the salvia high in, but there are others with equal depth I mess around with too.  Thankfully, theyre not deep in the same way.</p><p>I would say peace but instead Ill say Keep it Real </p><p>God knows its clich, but at least it isnt absurd. </p><p>Peace!</p>",
 "year": "2006",
 "id": "53222",
 "gender": "Male",
 "timestamp": "2006-05-31T07:00:00.000Z",
 "views": "13655",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "333 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
