{
 "title": "A Look in a Book",
 "author": "Cooked County",
 "citation": " Cooked County. \"A Look in a Book: experience with MDMA (Ecstacy) (ID 53229)\". Erowid.org. Oct 15, 2008. erowid.org/exp/53229",
 "substance": "MDMA (Ecstacy)",
 "bodyweight": "110 lb",
 "report": "<p>At the age of thirteen I was naturally curious and had began the teenage stage of experimentation. However at this time I was still very unaware and oblivious to the more hardcore drugs. My drug use had just consisted of smoking pot a few times, drinking alcahol on accasion, and a few pharmichuticals here and there.</p><p>I began to gradually sneak into my older brothers room were I had found a large bag of marijuana, I would guess it was roughly a quarter pound. I had discovered this when cracking into a safe he had in his room I had started taking appropriate amounts of weed from him and attempted making pipes from pens, I was mostly inhaling plastic, then I moved on to tinfoil. After smoking some weed correctly this time after using a chillum I had found in his safe, considering no one was home I began to ransack the room, and to explore to see what else he had hidden in his drug abundant room.</p><p>He had a tall book shelf, and in the shelf he had many books neatly assorted I started opening the books because I had once found a hit of acid hidden in one of the pages, that I did not take by the way.  Any way I found a small rolled up bag inside a large old book about Vietnam, the bag contained about two dozen ecstacy pills, white plain ones, purple pyrimids, and ones with a buddha figure on it. I really had no idea what they were, I knew they were not regular pharmachuticals, I knew it would alter my realization but I did not know it was ecstacy. I actually thought it was acid, keep in mind I was only 13.</p><p>I decided to take one of them the purple pyrimid, it was about 9:00 when I took it. I had forgotten I had even taken the pill and had just gone on doing normal activities like video games and t.v.. Usually x takes about 30 mins to kick in, it must have been hours until I felt the effects, this may have been due to the fact that I was not expecting it since I practically forgot and that I did not know what to expect. I remember watching tv on the couch next to my dad I had fallen asleep. I woke up with the best sensation ever I was feeling simply all around fantastic my whole body felt so great it is difficult to describe correctly, I told my dad I was going to bed. I was really high on a drug I had never taken before but I was not frantic and my father had no idea about everything, we just wished each other good nite and I went upstairs to my room with an uncontrollable smile.</p><p>I could not stop smiling, I had the feeling in my stomach similar to being pushed back and for the quickly on a swing, butterflies, that tickled my stomach in a pleasurable way, I felt light, I had the urge to jiggle and move my body in rythm, it felt great, just moving felt incredibally good, I was having a great time in my room by myself. I was so fucked up I punched myself in the face and began to laugh as if it was comical. Closing and opening my hands seemed enjoyable, I would pick up objects and they would feel and seem differently, I looked at everything differently, but I didn't have a specific mindframe.</p><p>I had the best body high, almost feverish but yet blissful, I felt that I could talk very fast and I had about one million thoughts in my head at once but somehow was able to ponder them one by one. It was like a concert, a speech, and array of different voices in my head all intertwining together. Laying in my bed I was like a worm constantly thrashing around in my bed, every time I would stand I would smile and become overwelmed with uncomprhendible yet welcoming feelings, every step I took to the bathroom was like a new revelation of feeling.</p><p>I drank some water and I was sweating pretty bad, my face was very red and I remember thinking that I resembled the devil, but yet it did not freak me out, I was greatly intoxicated yet somewhat in control I dreched my pillow with cold water to lower my temperature. I began to hillucinate, it may be rare but I saw a cartoonish alian looking figure in the bottom corner of my television, it was green and had a cowboy style hat on with bloodred eyes, I am positive this was a hillucination because I was watching the credits to a documentary and it was definantly not apart of the movie. my whole body was so sensative and I almost felt a constant orgasmic feeling, I did not sleep that whole night, and the next day I went back to that book, and guess what I did.</p>",
 "year": "2000",
 "id": "53229",
 "gender": "Male",
 "timestamp": "2008-10-15T07:00:00.000Z",
 "views": "4642",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
