{
 "title": "Pre-Meditive Calmative",
 "author": "Velmwend",
 "citation": " Velmwend. \"Pre-Meditive Calmative: experience with Calea zacatechichi (ID 53257)\". Erowid.org. May 21, 2006. erowid.org/exp/53257",
 "substance": "Calea zacatechichi",
 "bodyweight": "130 lb",
 "report": "<p>Unaware of the standard dose I packed a two-skin cigarette with roughly 1-5g of Calea zacatechichi and smoked it shortly before retiring to bed. Although bitter, the smoking experience isn't entirely distasteful, but the lingering after-taste is. There were no obvious mental or physical effects following the smoke.</p><p>After rinsing my mouth with peppermint I retired to bed and began to meditate. Almost immediately I realised that my mind was clear, almost thoughtless and decluttered. It was a pleasing effect and greatly aided my meditation.</p><p>The main reason I decided to try Calea zacatechichi was for the hypnagogic imagery. I wasn't dissapointed, I fell into a delightful wave of hypnagogics before passing into unconsiousness.</p><p>This morning I awoke and felt as if I'd been asleep for days. I was aware that I'd experienced a very heavy, restful sleep but, strangely enough, I do remember waking a few times during the night, something I don't normally do.</p><p>As for dreams, my memory was very foggy, I could remember fragments of dreams, but nothing unusual, vivid or striking. In fact, the only dream I DO remember with any clarity was that the pop singer Madonna had decided to launch her own clothes range! :)</p><p>To summarise: a very subtle, mind-clearing herb, useful aid for me in trance or meditation. Hypnagogics were increased.</p><p>I intend to continue experimenting nightly.</p>",
 "year": "2006",
 "id": "53257",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-21T07:00:00.000Z",
 "views": "11240",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": "(dried)"
  }
 }
}
