{
 "id": 5326,
 "title": "Clouds Growing Off of Rocks",
 "date": {
  "submission": "2013-07-17T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "LooseScrew",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Well it all started when a room mate down the hall from me, well call him 'F', had a friend who was coming up for the weekend.  I had, at this time, only tried mushrooms once and had a bad trip because I was unaware of the intesity I was going to experience.  When I heard that F's friend had this stuff called 5-MeO-AMT I decided to give the psychadelic journey another chance.",
  "He came over at approx. 10pm and we ingested the chemical immediately.  Not knowing what me nad my room mate were getting ourselves into, we sat in our room talking and waiting for the substance to come on.",
  "The first symptoms were the gut wrenching feeling where all you can do is puke and do nothing about it becuase there is no way to hold it down.  The rest of the trip went as so:",
  "+1:00 - I have mild visuals and a strange feeling in my body",
  "+3:00 - I start to hear some voices in my head and try to brush them off b/c stuff like that really freaks me out.  I try to enter conversation with people who aren't tripping but it doesn't work too well.  People look like they have hair growing off of their faces, sort of like cat hair.",
  "+5:00 - From this point to the 12th hour or so I was tripping my BALLS OFF.  IT was fun at tiimes, and crappy at others.  Conversations were completely non-linear.  I had headaches and stomaches that came and went.  I saw the most incredible visuals so as clouds growing off of rocks and watching graphitti twist and turn.  No concept of time at all... All I can do is laugh at it.",
  "+15:00 - I would really like to get off of this drug at this point.  I kept asking F's friend if I would ever come down and he was getting annoyed becuase he had to keep reasuring me I would be OK.",
  "+24:00 - Couldn't eat the whole day and my mind feels completely warped from the drug.  It is 10:00pm the next day and I try to get sleep by closing my eyes and refusing to open them.",
  "Some how I got to sleep and woke up at 6:00am the next morning.  After feeling completely better and no longer tripping, I woke up my room mate and we went NUTS!  We cleaned our room, went to breakfast, did homework before classes...",
  "All in all I can say I would NEVER do this drug again, but I do feel it was a good experience.  The only thing I regret, which I read from another report, is the feeling of instant depression that I get sometimes.  I don't know if it was caused by this, the massive amounts of marijuana I used to smoke, or the E and 2C-E that I have experimented with, but I am pretty sure it could be due to the 5 methoxy only becuase the trip really started getting me to look into things more and I think it has been screwing with my head ever since then."
 ],
 "erowid": {
  "id": "31980",
  "citation": " LooseScrew. \"Clouds Growing Off of Rocks: experience with 5-MeO-AMT (ID 31980)\". Erowid.org. Jul 17, 2013. erowid.org/exp/31980",
  "substance": "5-MeO-AMT",
  "views": "441"
 }
}
