{
 "id": 5327,
 "title": "Vibes From The Other Side",
 "date": {
  "submission": "2007-06-11T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Brokenmachine",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "At one point, I've heard about Salvia from a high times artical or from a herb shop. I don't remember where I first learned about this powerful substance. My experience with Salvia is unexplainable. I picked up 1 Gram of 5x Salvia. I then loaded half of that gram into my 'Sneak a Toke' pipe, with a brand new screen. I read that Salvia has to be heated up nice and hot, to a point where it is vaporized. I also read that the user builds a tolerance within seconds. So I was determined to do this right the first time. Well, I succeeded.",
  "I sat behind my computer, fired up my bowl with a torch lighter.. And at first pulled on it real slowly to make certain that I vaporized every bit of the Salvia, the inhaled and held the hit for 30+ seconds.  Things started feeling strange, but not what I expected. So less than 5sec later, I poured the rest of the Salvia (1/2 Gram - 5x) into my pipe, and fired it up. Thats when it hit me. It hit me so fast and so hard. I was trying to push the smoke out of my lungs as fast as possible. I felt like I just committed suicide on accident.",
  "From my finger tips, moving up my arms, I felt like my existance was being erased. I can feel myself fighting it as it reached the rest of my body. At that point I felt like I was being torn apart backwards inside of me. Space and Time speeded up as I saw my entire life flash before my eyes before a BIG BANG occured. I felt like I traveled back to a time before I was born, in a place where I felt as I was on a assembly line. And there was God standing over me, constructing my soul. There someone else there too, Satan perhaps? I don't know.",
  "Time shifted again, though I felt as I was in the future, after the time of my death. It felt like storm weather was coming thru, though I could not see clouds or anything. I started hearing cries and screams, when I looked in the direction of all the chaos. I could see people running. They were objects shaped like people but with a deep orange glow, almost the color of fire. I looked to see what they were running from, and I saw a giant hill with this oil liquid looking black stuff coming down it. This liquid had tenticals that was grabbing out and snatching people and pulling them down into the earth. During this same time I heard a evil wicked voice of a female laughing and saying 'You can run, you can't get away, I'm going to get you, I'm going to get you. Hahahah'.",
  "I was so full of fear so I started running away from this black mass. I didn't get away. It grabbed me and then the trip shifted again. I felt like I was in a small dark box like a cage. I was cold and wet, and the air smelled like kerosene. I looked out in one direction, and saw a small bit of light, but It wasn't light. I can't explain it. And there it was again, that evil wicked womans voice telling me with a evil laugh, 'You will never get out of here. No one will ever find you, Your mine.' At that point all light went away and it was total darkness. I curled up into a ball and started crying. Then out of no where, I hear my moms voice say 'Get up honey, get up now. Hurry!' So, I stood up and ran blindly into the darkness. Brown light started to appear. Then a flash.",
  "I was 4 years old and running to my moms bedroom to hop in bed with her because I was scared and crying. As soon as I jumped in the bed and hid under the covers, she hugged me and said 'Shhhhh'. Within a milisecond I was warm, dry, safe. Within the next milisecond, reality fased back in and I was sitting back at my desk, in front of my computer. The peak of the trip was over. I had a strong headache, and too much to think about. I know other events happend during this trip, though this was all I could remember clearly. Would I use this again? Probably not. Would I worry about getting addicted to this? NO NO NO, not possible."
 ],
 "erowid": {
  "id": "31983",
  "citation": " Brokenmachine. \"Vibes From The Other Side: experience with Salvia divinorum (5x extract) (ID 31983)\". Erowid.org. Jun 11, 2007. erowid.org/exp/31983",
  "substance": "Salvia divinorum (5x extract)",
  "views": "2934"
 }
}
