{
 "title": "Faking A Piss Test - Cheap & Easy",
 "author": "Farmer Jones",
 "citation": " Farmer Jones. \"Faking A Piss Test - Cheap & Easy: experience with Drug Testing (ID 53289)\". Erowid.org. Jun 29, 2007. erowid.org/exp/53289",
 "substance": "Drug Testing",
 "bodyweight": "",
 "header": [],
 "report": "</p>MAKING THE CLEAN-PISS CONTAINER:</p><p>Faking a scheduled piss test using someone else's clean urine is not hard (or expensive) to do.  For my purposes, I made a simple squeeze container with a temperature gauge on the side, strapped it under my crotch, and heated it using hand-warmers.  To do this, you need the following simple supplies:</p><p>1. a temperature gauge sticker for a reptile cage - these range from 75 degrees F to 105 degrees F - available at any pet store for about $3.00</p><p>2. a 3-oz fluid squeeze bottle - I used a ReNu contact lens fluid container</p><p>3. a few of those open-air handwarmers - they stay warm for about 7 hours - I got a pack at a sporting goods store priced at 6 for $3.00</p><p>PRACTICE USING IT:</p><p>So here's the procedure.  Stick the temperature gauge on the side of the bottle.  Piss in it and find out how many handwarmers you'll need to maintain the temperature (for a long period of time) between 91 and 97 degree fahrenheit (they test the temperature when you are piss-tested).  I used 2 handwarmers, one on each side, strapped on with some rubber bands.  Now figure out how to strap it under your crotch securely so you can walk around normally, either with tape or by wearing snug briefs.  Finally, practice 'pissing' with it - make sure the hole in the container is wide enough to simulate genuine pissing sounds.  Get good at pissing with it.  Then rinse it out well.</p><p>PREPARING FOR THE TEST:</p><p>On the day of the test, get your clean-piss supplier to fill the container as close as possible to the time of your piss test (urine goes bad after 18 hours or so).  Attach the hand-warmers to maintain temperature.  Strap the clean-piss bottle under your crotch and go to your piss-test.  Before you walk in, check to make sure the temperature is around 95 (it may heat up while under your crotch).</p><p>AT THE DRUG TEST:</p><p>First off, be confident - this is easier than you might imagine.  When you go in, they'll probably ask you to take all the stuff out of your pockets, or change into a gown - no big deal.  They probably won't watch you so closely that you can't pull this off.  If they try to watch you closely, tell them you're piss-shy and can't urinate with someone watching/listening - demonstrate  for them by trying to piss and failing.  Eventually they'll have to leave you alone.  Simply 'piss' the contents of the bottle into the cup and turn it in.  Smile, because you've just beaten 'the man.'</p><p>A BACKUP PLAN?:</p><p>I did a bit of extra research, if you want a backup plan, you can dilute your own urine by drinking a ton of water the day of (take a multivitamin pill so your urine still appears yellow), and take 4 aspirin a couple hours prior to 'screen' the analysis (Jeff Nightbyrd says it improves your chance of testing negative).  I did this as well, but didn't have a chance to see if it works because the 'concealed bottle o' clean piss' method worked easily.</p>",
 "year": "2006",
 "id": "53289",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-06-29T07:00:00.000Z",
 "views": "50873"
}
