{
 "title": "Study Buddy",
 "author": "Jspeedy",
 "citation": " Jspeedy. \"Study Buddy: experience with Amphetamines (Adderall) & Cannabis (ID 53304)\". Erowid.org. Oct 6, 2007. erowid.org/exp/53304",
 "substance": "Amphetamines (Adderall) & Cannabis",
 "bodyweight": "130 lb",
 "report": "<p>Now, let me say something, my alias isn't Jspeedy because Im a speed freak, in fact I've only touched any amps twice in my life.</p><p>Well for awhile I had wanted to get a couple of 20 mg adderall from a friend. After a week, I was finally able to get some and that day was earlier today. I've had experience once with methylphenidate-Ritalin, in the form of 5 mg pills. I liked those, they made me stay wide awake in school and focus everything in on class work. The only problem I found with methylphenidate was that it's out of my system within half the time of dextro-amphetamine, my guesstimate would be 4-6 hours half life. I ended up crashing before the day was even over, not fun. Coming off of an amphetamine is a very uncomfortable feeling. Mentally I feel worn out, like I havent slept in awhile, almost like staying up for a day or two, not being able to sleep. I didn't worry about sleep when I took Ritalin, because by the time I was coming down, it was the end of the day so I could simply go home and rest.</p><p>So once I got home with the 40 mgs of adderall, I used the restroom, went in my room, and shut the door. Prepping for insuffulation, I crushed each individual pill using a metal bottle cap, worked very well. I railed one pill and my nostril burnt for about 5 minutes later, perhaps it wasn't fine enough of a powder, though I was sure there werent big chunks in the pile, no signs of bleeding.</p><p>Allowing the chemical to take hold, I sat back at my desk and chilled out looking on the forum I frequent. About a minute or two later, I taste the drip so I retrieve some water from my bathroom to clear my palate after each glob of mucus disgusts my tongue. Effects begin to take effect gradually as 5 minutes pass. Once 10 minutes have passed, I feel more alert, and I'm focusing in on every detail around me. Once my nostril is done burning, I shoot half of the other pill in the latter nostril, and then eat the other half. This was around 4:10 PM when all of the adderall was in me.</p><p>Around 6 or so PM, after forcing myself to finish my plate at dinner and having a good chat with my parents, I go smoke a bowl of weed and that adds a great effect. I'm a chronic marijuana smoker, I smoke at least twice a day on an average day. At first when I was getting used to the adderall, even though I felt no signs of euphoria, I didn't have an urge to smoke. I decided to see what adderall and sweet leaf would be like. It took me almost 3 minutes to finish a gram or so of mids, usually I take 5 to 10 minutes, but this time the smoke heating my throat didnt bother me, and I was able to maintain sucking it down. As I walked back to my room, I felt the two drugs fuse.</p><p>After smoking weed I'll feel lethargic and unmotivated. Well the adderall filled those two spaces and the feeling was quite unique. The familiar stoned feeling filled my head, but I didnt feel like sitting at my desk playing video games as I usually do whilst stoned, instead I studied for my final exams I have to take later this week. After chilling out studying and talking to people on my computer, I picked up my bass to see if I could possibly play faster with more precision. Was I right? Damn straight. I spent an hour and a half doing nothing but playing my bass, just practicing whatever songs I perform with my band and playing some tunes by Red Hot Chili Peppers.</p><p>After practicing some bass, I took a shower which really gave me more energy, the warm water felt relaxing, washing my hair was fun, lathering my hair is usually a mundane thing to me, but the adderall made me appreciate the feeling more. Now, I'm hear finishing up my trip report. I had always thought of making a report but was too lazy. Adderall = no lazy.</p><p>I can defiantly see the addiction potential in dextro-amphetamine. Adderall is different than Ritalin, a lot. Adderall wires me longer, about double the duration of methylphenidate. People may say they get high off of adderall, that didn't occur for me. I felt no significant euphoria at all like I subtly did with Ritalin. A sense of well being was defiantly imminent, as since I dosed (over 7 hours later) I have felt more social and more open to speaking. Adderall makes me talkative. It's controllable, but I don't want to fight it. Having a deep talk with a friend makes time fly while under the influence. I now understand how people could grow an addiction in the way it makes me much more motivated to work or study. As I pointed out, I didn't notice or anticipate any euphoria, though some people claim they do achieve a euphoric state similar to cocaine at higher doses.</p><p>Hours have passed since dosing, and I'm still alert and focused, in fact if it werent for adderall there would be no way I could have done this at 11:20 PM. I would recommend adderall for anyone looking to really hit the books and cram for a final, or get a term paper done. Pretty much anything you can think of which requires mental problem solving or even physical activity can be enhanced with adderall. I can see myself possibly taking it before a show to improve my playing, but I would use it sparingly as amphetamines are just plain bad on your heart. Although I usually hate writing, I'm pretty good with words, once the thought of me writing a report came to mind, I decided to spend an hour writing a good experience. Here I am now, about to take some of my prescribed ambien to help me get to sleep.</p>",
 "year": "2006",
 "id": "53304",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-06T07:00:00.000Z",
 "views": "32280",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": " T+ 0:10",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(ground / crushed)"
  },
  "2": {
   "time": " T+ 0:10",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": " T+ 2:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
