{
 "title": "Blue and White pills",
 "author": "Desktop phychonaut",
 "citation": " Desktop phychonaut. \"Blue and White pills: experience with Diazepam (Valium) & Codeine (ID 53318)\". Erowid.org. Jan 1, 2008. erowid.org/exp/53318",
 "substance": "Diazepam (Valium) & Codeine",
 "bodyweight": "200 lb",
 "report": "<p>At 9pm I was at my computer doing nothing so I decided to experiment by mixing drugs.</p><p>I took:</p><p>2x 10mg blue valium (diazepam) pill</p><p>6x white 60mg codeine phosphate pills</p><p>5x white co-codamol OTC pills 8/500</p><p>So all together it was 400mg of codeine and 20mg of valium and 2.5g of paracetamol. Prior to mixing these drugs I looked up on the internet that they have interactions but in hospitals they mix valium with morphine so I ignored that. The mindset I was in at the time was calm but bored I had not eaten for 4 hours so my stomach was basically empty.</p><p>So I then took the hand full of pills with a pint of water and sat there and waited.</p><p>40 minutes later and I was listening to SOAD at the time I started to feel the warmth and mild euphoria set in with a slight itchiness. I was in a very blissful warm euphoric state witch nothing could harm me. Probably the affect of the valium amplifying the codeine.</p><p>The whole experience lasted about 3 and a half hours with the only side affect being mild itchiness and a dry mouth. At about 1am I went to sleep had very strange but nice dreams and I awoke at about 11am I had a mild hangover feeling with a very dry mouth I also had urinary retention but I just ran the tap and that went away. So my conclusion is that it was a very good experience using only drugs I got from the internet and the doctors. It was a very nice high witch definitely is worth it for the mild side affects in the morning.</p>",
 "year": "2006",
 "id": "53318",
 "gender": "Male",
 "timestamp": "2008-01-01T08:00:00.000Z",
 "views": "13650",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  }
 ]
}
