{
 "title": "US Army Testing Notes",
 "author": "Dv",
 "citation": " Dv. \"US Army Testing Notes: experience with Drug Testing (ID 53339)\". Erowid.org. May 24, 2006. erowid.org/exp/53339",
 "substance": "Drug Testing",
 "bodyweight": "",
 "report": "<p>Having only been in the military for 8 months, I don't have too much information, but I'll do the best that I can.</p><p>I was stationed in America During this time, UAs were being done approximately four times a month, around once a week (on Thursdays). I never paid enough attention during my one UA (when coming back from Exodus leave [Christmas], everyone does a UA) to know what kind of test it actually was, or what company did the test. The selection</p><p>process seemed random for who had to do a UA. I know of one soldier who was tested EVERY TIME they did a UA until he left. He got tested on the day he left too.But as previously stated, some people (like myself) were only tested in the 100% UA.</p><p>During my UA, I was watched by a Noncommissioned Officer. They made me drop your pants and underwear to your ankles, and then turn to the half-left or half-right so they can see that you're actually urinating in the cup. I was patted down and asked to empty my pockets before giving my sample.</p><p>As for more information on punishments for failing a drug test, here's a few tidbits that I know from personal experience:</p><p>1. If a solider test positive for cocaine, then their chapter paperwork (to discharge them from the Army) starts AUTOMATICALLY. No ifs, ands, or buts about it, they're on the road to being kicked out.</p><p>2. I've heard of cases where soldiers appealed to their chain of command to try and stay in, and this has sometimes worked. One soldier that I was stationed with had tested positive for cocaine, and while he still had to go through the motions of the chapter, he is staying in, but he is forced to reclass from his current MOS (25F). He can now only hold a job that does not require a security clearance, as he lost his.</p><p>3. At the very least (based on our brigade policy), a soldier will receive a Field Grade Article 15, which consists of 45 days extra duty, 45 days restriction, loss of 1/2 pay for 2 months (~$640 a month), and possible loss of rank.</p><p>I enlisted in September of 2005. I was screened at MEPS. I was never tested during Basic Training.</p><p>All this information is based on a training environment. I have VERY little information about permanent duty station policies. I have heard from a fellow soldier who was stationed in Germany that they do 100% tests every week, since Amsterdam is so close by and such. I've also heard that the standard at a permanent duty station is either everyone is getting tested, or 10% of everyone is getting tested. It does not matter what rank or position one holds, no one is exempt from testing.</p>",
 "year": "2006",
 "id": "53339",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-24T07:00:00.000Z",
 "views": "14607",
 "dose": {}
}
