{
 "title": "Interesting But Rather Unpleasant",
 "author": "Oliver",
 "citation": " Oliver. \"Interesting But Rather Unpleasant: experience with Datura (ID 53350)\". Erowid.org. Oct 5, 2007. erowid.org/exp/53350",
 "substance": "Datura",
 "bodyweight": "10.5 kg",
 "header": [
  [
   "DOSE:",
   "2 flowers",
   "oral",
   "Datura",
   "(tea)",
   "",
   "2 leaves",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "report": "<p>T - 0:00 - Consumed tea consisting of 2 flowers and 2 leaves (Datura inoxa and Datura metel).</p><p>T - 0:10 - Feel anxious.</p><p>T - 0:20 - Feel slightly stoned. Similar to small dose of cannabis.</p><p>T - 0:25 - Quite dizzy and tired. Focusing is difficult. Movements are exaggerated. A 5 degree rotation of my head feels like 45 degrees. The cannabis like buzz is transforming into something unfamiliar.</p><p>T - 0:30 - Mild sedation with an intense drawn out rush. Struggling to keep eyes open. Feel peaceful enough to just be.</p><p>T - 0:40 - Sat in meditation for 10 minutes. Reality doesnt feel right.</p><p>T - 0:42 - Balance slightly off. Floating and sinking at the same time.</p><p>T - 0:45 - Mouth very dry. Strong heartbeat.</p><p>T - 0:55 - Body feels extremely drunk. No euphoria or disassociation.</p><p>T - 1:00 - Eyes bloodshot and pupils dilated.</p><p>T - 1:05 - Desperately need to lay down.</p><p>T- 1:08 - Get in bed. I get up every 30 minutes to use the toilet.</p><p>T - 3:00 - Im walking in the countryside with my dog. I try to call her name but cant speak. Within a split second Im home watching television with the remote control in my hand. I keep trying to change channel but cant focus on the buttons.</p><p>T- 3:01 - Remote control vanishes and I realise Im sat up in bed arm outstretched pressing my empty palm. Then I realize Im not even watching television. I dont have a TV in my room.</p><p>T- 3:15 - I must have been sleeping for a while. My dreams are more real than reality.</p><p>T- 3:16 - Eyes shaking from side to side. Feel too ill to relax. Exhausted but cant keep still. I wander from bedroom to bathroom 7 or 8 times then sit on the edge of my bed.</p><p>T- 3:17- Mouth ridiculously dry. I have water but swallowing is too painful.</p><p>T- 3:18 - A girl is standing in my doorway waving at me. A small child appears next to her. I approach to see if they are real but they disappear when I get close.</p><p>T- 3:19 - I step back and the girls reappear. I notice a snake behind my stereo, worms in my bed and spiders on my door. The floor is covered with food. I reach for some but it disappears. My dog multiplies. I can see 3 of her.</p><p>T- 3:20- Turn lights on to make some notes. All the hallucinations disappear when the lights come on but everything now has rainbow trails like HPPD.</p><p>T- 6:00 - Ive been watching people gather in my hallway for 3 hours.</p><p>T-6:15- Fall asleep (3:30am). Very lucid dreaming. This was the most enjoyable part of the experience because the unpleasant physical effects were left behind. The dreaming state was clearer than the waking state. I occasionally wake up next to a porcelain head then realize its actually my pillow.</p><p>T- 13:15- Panic attack (10:30am). I calm down when I realize where I am.</p><p>T- 17:00- Motor control back to normal.</p><p>T- 21:00- Vision back to normal. Eyes no longer dilated. Overall an interesting but rather unpleasant experience.</p>",
 "year": "2006",
 "id": "53350",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-05T07:00:00.000Z",
 "views": "4747"
}
