{
 "id": 5339,
 "title": "Session 5: Giving Birth to a New Age",
 "date": {
  "submission": "2004-03-29T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Catling",
  "gender": "Female",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "ml",
    "quantity": "80"
   },
   "administration": "oral",
   "substance": "Ayahuasca",
   "form": "tea"
  }
 ],
 "report": [
  "Session 5:",
  "Dosage:  80ml",
  "Physical Effects:  Light diarrhea, intense intestinal and stomach cramps, lethargy during the peak, energy after.",
  "Themes:",
  "Exhibitionism, curtains, giving birth to the new age",
  "I was in a great deal of physical discomfort on the ride up.  Mostly stomach and intestinal cramps.  When I ran to the bathroom, the diarrhea was light.  As always, as I was returning from the bathroom, the full effects kicked in.  I became very disoriented, partially because I had lost my glasses near my mattress, partially because it was dark and I was pretty high.",
  "I tried to crawl into someone else's bed and she sat up and then got up and led me back to my bed, taking my physically by the hand.  At this point there were gossamer curtains hanging from the ceiling and I kept getting enmeshed in them, tangled and confused, very disoriented.  Without her help I might not have found my bed.  The curtains were beautiful - they seemed to be made out of translucent natural objects; bugs wings, butterfly wings, flower petals, leaves, cobwebs.  When I finally made it through them and onto my bed, full onset hit me.",
  "At that point, it felt like everyone in the room was staring at me.  It was a horrible feeling, the stares were not friendly, they were very focused and intent, and impatient.  'What is it doing?'  Is the sense I got.  I got the sense that there was something important that everyone was waiting for me to do and I was too stupid to figure it out, so they were all staring in irritation and derision.",
  "'Come on, Catling!' I felt rather than heard.  And then I realized that someone nearby was weeping copiously, was weeping.  I felt a kinship with that weeping, at that moment I realized how much I am still, at 31, a hurt child.  At this point I lifted out of my body and saw that everyone in the group had also done so.  We were standing in a field and I realized they were impatient because they thought I was going to miss this and it was important, and I had a role to play.  The entire world was holding its breath and something was happening, all over the planet everyone was standing outside, staring at the sky.",
  "I realized that we were all giving birth to something, to a new age that could heal the planet and each other.  And I realized that I needed to sing its birth song, that I had to help everyone sing this being into existence.  I began to sing, mostly worldlessly and the new age began to take the shape of a young star, a nebula, a swirling many armed ball of light in the sky that was being spun out of the purest energy and love in the universe, it was being spun out of our souls, our hearts, out of divinity somewhere out there beyond us.  Everything melted into radiant golden, rainbow light, I was laughing and crying in pure joy and in the pain of giving birth and we were all connected to each other and to the new world we were creating together."
 ],
 "erowid": {
  "id": "32017",
  "citation": " Catling. \"Session 5: Giving Birth to a New Age: experience with Ayahuasca (ID 32017)\". Erowid.org. Mar 29, 2004. erowid.org/exp/32017",
  "substance": "Ayahuasca",
  "views": "6289"
 }
}
