{
 "id": 5344,
 "title": "Worst Drug Experience I've Had",
 "date": {
  "submission": "2007-11-15T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SNK",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "900"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "15"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I never thought of caffiene as a dangerous drug until this experience. It all started one morning before school when my friend and I pulled into a local gas station for fuel. As he was filling up the tank, I walked in the store and decided to buy a pack of caffiene pills, 200 mg each. I walked out of the store and thought to myself 'Hell, it's caffiene. This could be fun!' and popped two and a half capsules for a total of 500 mg. We got to school and everything started out normal until a few hours into the day. I began to feel jittery and couldn't keep still. It felt like the high I get off adderal. I was full of energy and my mind raced a mile a minute. It wasn't an unpleasent feeling. I walked into my third block class (AP Modern Euro History) and found that we had a test to take. It seemed easier than usual, and while my handwriting was sloppy, my mind found answers to all the questions quickly. The rest of the day past uneventfully. The jittery feeling remained until I went to sleep that night.",
  "The next morning, I woke up and took two more caffiene pills for a total of 900 mg. I figured that the other pills had worn off and it was safe. At this time, I had no knowledge of what a caffiene overdose was, and even though I am a recreational drug user, I never really thought of caffiene as a 'drug'. About ten minutes later, I walked to a local park to meet up with two friends and smoke some marijuana. We sat on a bridge in the park and passed around a joint, once that was killed, we light up another. After that was done, everything seemed normal to me for the first few minutes. I was high and we were joking around laughing and talking about nothing. What happened next was easily the worst drug experience of my life.",
  "I don't remember most of this, so it is going on what my friends told me. Shortly after smoking, my speech became slurred and I collapsed on the ground. When I didn't get back up, they knew something was wrong. One of my friends picked me up and said they were going to call an ambulance. I had no clue what was going on. I faded in and out for the next ten minutes, then got back up to me feet and fell over again, blacking out for a second time. My friends, too scared to leave me there to call an ambulance stayed with me. I managed to blurt out that I had taken caffiene pills. My vision was altered quite a bit. Everything seemed bright and blurry.",
  "I got up and drank some water. My motion was very strange. I felt my body moving behind itself like a delayed reaction. I would feel myself move my arm, but then it felt like it would rewind and do it again. I managed to walk to a park bench and sit down. Both of my friends were very worried and didn't understand what happened. One of them came to the conclusion that it was a caffiene overdose. He asked me how much I had taken, and when I told him, he said that's exactly what happened. For the next twenty minutes I sat on the bench and drank water. Eventually I felt more normal. For the rest of the day, I had a pounding headache from hitting my head when I fell, my vision was still blurred, and my motion was messed up. My vision and motion weren't nearly as bad as after when it happened, but still were not normal. The next day, I woke up feeling fine."
 ],
 "erowid": {
  "id": "32039",
  "citation": " SNK. \"Worst Drug Experience I've Had: experience with Caffeine & Cannibus (ID 32039)\". Erowid.org. Nov 15, 2007. erowid.org/exp/32039",
  "substance": "Caffeine & Cannibus",
  "views": "14218"
 }
}
