{
 "title": "Visions of Terror",
 "author": "Shpongleyez",
 "citation": " Shpongleyez. \"Visions of Terror: experience with Mushrooms - P. Cubensis & Cannabis (ID 53450)\". Erowid.org. Nov 9, 2008. erowid.org/exp/53450",
 "substance": "Mushrooms - P. Cubensis & Cannabis",
 "bodyweight": "150 lb",
 "report": "<p>Being an enthusiest of the psychodelic experience, I feel obligated to elaborate on a series of events that left me completely and utterly 'Shpongled.'  What I mean by this, is that during the aftermath of the trip while my friends were attempting to ask me what had happened to me, I was at a complete loss of words, and could only respond with the classic explanation that all explorers of the psychotropic world are often forced to use: 'I dont know...'</p><p>Before I delve into this profound and terrifying trip, there is something that needs to be explained in order to clarify the revalation I had.  About a year ago, during the same month (October) and at the same house, with the same group of people, I had smoked some Salvia Divinorum, as well as about $60 worth of weed, between four people.  This was about as high as I have ever been, and at a point of almost 'uncomfortable highness.'  Reality was nearly gone, the memories of that night are similar to a night of a drinking binge.  I smoked so much reefer that I passed out on a futon in the basement of my friends house.  When I woke up however, I remember I was looking at a specific painting on the wall, and had that unique feeling of the after effects of a severe marijuana session.  To this day, I still remember the position, feeling, and view of when I woke up from that night.</p><p>As the sun set on the night of our trip, the atmosphere was ironically tranquil.  The calm before the storm, I guess you could say.  I pulled out my large sack of dried cubensis mushrooms that I had secured earlier that day.  The dealer who sold them to me, a friend since grade school, advised me that these mushrooms were perticularly potent, and not to be taken lightly.  He advised me to take half an 8th (2g,) and I proceeded to ask him what would happen if one were to take an 8th and a half.  His eyes widened, and he looked around and lifted up his hands and murmured a 'PSSSHHH.'</p><p>We placed the potent close capped mushrooms on a warm pizza we had just taken out of the oven.  With The Doors playing ominously in the background, we sat down and proceeded to eat the sacrement. </p><p>T+20 min.  Although this was only my second mushroom trip, I had an ok knowledge of how long a mushroom trip takes to come on.  My first trip, an experience all itself, the mushrooms took a grand total of two hours to come fully on.  However this time, the significant appearence of objects and the vividness of light and colors that I have come to associate with psilocybin was quickly coming on, probably due to the fact that I had nothing to eat all day.  I finished the mushroom pizza with a glass of orange juice. The first hour was positive, fun, and only contained a hint of the bad vibe that would soon dominate my trip.  After the course of an hour, we moved into my friend's room. </p><p>This is where the bad vibes really started to become apparent.  I was laying on the bed, observing a buddha that I had descerned in the ceiling.  My friend, lets call him Charlie, was feeling the effects of the mushrooms, however was not exhibiting the layed back, mushroomed attitude that one usually exhibits when they are tripping.  No, not Charlie.  He proceeded to scream about something I couldent understand, and threw cards everywhere.  The vibes he was giving off frightened me so deeply that I couldent even gather up the energy to say stop.  My friend Andy and I went into the basement of the house, and proceeded to try and trip in peace there.  Sitting on the couch, trying to forget about the terrible experience I had just witnessed, Charlie came running downstairs, and once again put me in a state of sheer terror. </p><p>T+ 1 hour.  This was too much for my bemushroomed mind, and caused me to stand up.  I felt like I weighed 50000 pounds, and that my mind was functioning slowly.  The only solution to this problem, I though, was to try to sleep it off.   I TRYED to sleep on mushrooms, but I did not experience sleep.  No, I experienced something far more profound.  As Dr. Hunter S. Thompson puts it, 'a pure, introspective nightmare.'  I took off my pants, and my shirt, and told my friends 'I cant think, I need sleep!'  Realizing that I had lost it, my friends left me.  The next hour I have no recollection of.</p><p>T+ 2 hours.  Charlie came downstairs to check to see if I had emerged out of my fugue yet.  I had not.  I asked him to turn the TV on and put in a movie because I was physically unable to.  Little did I know, that with Charlie's altered state of mind, he chose a random movie, and put it in the DVD player.  He quickly pushed play, and left me.  Once he was gone and doing whatever he was doing upstairs, only then I realized that he had indeed chosen the most unsuitable movie for a mushroom trip.  Platoon. </p><p>T+ 2 hours+30 min.  I had to turn away from the TV screen.  Vietnam was too much for me.  I layed stomach down on the futon, with a heavy blanket over my head.  I feel into a deep, terrifying mushroom trance, with the sounds of 40 cal machine guns in the background.  What happened to me I cannot fully convey in words.  I was neither asleep, nor awake.  I had visions of geometric shapes, heard sounds, saw patterns, all of which chilled me to the bone with a profoundly horrendous vibe to them.  Supposedly, some friends of ours dropped by the house to say whats up.  Only later did I find out that a few of my other friends came down to visit me.  When I asked them what I was doing, they said that I was babbling incoherently, talking about things such as 'CHEMISTRY!!!' or 'TRIANGLES!!!'  I have no recollection of any person ever visiting me during my trance.</p><p>T+ 6 hours. All in a shamanic, closed eye, half sleep, trance-like state.  The trip had gone horribly awry.  I was stuck in a demonic shamanistic trance state that I had no way out of.  Before I 'snapped out of' the trip, I can remember seeing a huge, menacing triangle, with three circles inside it, all spinning, spinning, spinning.  Then the spheres broke off, and what I was left with was a triangle that transformed into a sort of gateway.  The outline of the triangle was profound, and it was in front of a vast dark blue psychedelic background.  The triangle was no longer solid, and was reduced to only a glowing, neon-like outline.  However, my being was sent catapulted through the demonic triangle.  Its outlines multiplied, and my psyche was flying through them.  I felt a burning sensation on my forehead, and came the conclusion that I was litteraly going through these psychedelic triangles, and the burning on my forehead was the triangles getting absorbed into my consciousness.</p><p>I was going faster and faster through the triangles, and soon I was going so fast that my mind could no longer bear it.  It seemed that the triangles were blurred, and that all that was left of my soul was trapped in this hyperspace-like void of devilish triangles.  Suddenly, my being came to the large, dominant triangle with the three spheres spinning inside it.  there was a white hot burning sensation in my forehead now, and I could no longer take it.  There was a blinding flash, and I returned to consciousness.</p><p>As I opened my eyes, I realized that I was lying on my back, the opposite position of when I first attempted to 'sleep.'  I was looking at a familiar painting in my friend's basement, and had that mushroom comedown feeling of numbness, similar to that of a massive stone-over.  The whole situation seemed strikingly familiar.  I thought about the strange feeling of de-javu I was experiencing, and then all of the sudden, it hit me.  I had been asleep for a year.  Not literally sleeping for a year, but DREAMING for a year.</p><p>I was fully convinced that I was waking up from that night a year ago when I smoked so much weed that I passed out.  The thought boggled me, however I was completely convinced.  By now, my mind was sufficiently dumbed down by the mushrooms that thinking on this revalation didnt do much good.  All I could do was sit there and think '...what the fuck...,' because there was no doubt in my mind that the entire year, school, my friends, everything I had done, was a dream.  I thought about this a little closer and realized that in the dream, the substance that had 'woken me up' was the mushrooms.  I was completely mind-fucked.</p><p>I slowly walked upstairs, and found my friends calmly sitting in the living room.  By now my mind had repaired itself from my terribly profound trance, and I was able to realize that what I had taken for completely true, was in fact, a mushroom delusion.  My friends were taken aback by my sudden enterance, and my boggled appearence.  They asked me what had happened, and could only respond with the classic explanation that all explorers of the psychotropic world are often forced to use: '...I dont know...'</p>",
 "year": "2005",
 "id": "53450",
 "gender": "Male",
 "timestamp": "2008-11-09T08:00:00.000Z",
 "views": "18722",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
