{
 "id": 5345,
 "title": "Bad Batch of Mushrooms",
 "date": {
  "submission": "2001-12-23T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Infernal Machine",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "Well, you would imagine my excitement when a friend of mine comes over with an ounce of dried mushrooms. I had eaten shrooms twice before and found that I liked the trip. I didn't have any cash on me, so he said he would set aside 1/8 ounce for me. He left to go hawk his fungus.",
  "A few days later, my friend found me and fronted me the mushrooms, as I still had no money. I had grown (with limited results) mushrooms before and was very familiar with what they looked like. But these mushrooms were kind of odd looking. Something just didn't look right about them. I like to be safe with things like this, so I decided to wait and hear what other people thought about them.",
  "And then I heard their stories. Actually, the first place I heard it was from my brother, who actually told me that I shouldn't eat them. It turns out that everyone who ate them (these were people who had eaten shrooms many times previously) got very nauseous and vomited violently for about 3 hours. One person shat their pants. And another kept hearing a very malevolent voice repeating the phrase 'death before dawn'. He looked outside, and seeing that the sun was about to come up, ran outside and drove to the hospital. He then had his stomach pumped.",
  "Everyone who ate them recommended that I not eat them. So I didn't, and I gave them back to my friend. Thankfully, he understood. No one was really angry with him, but they did use it to antagonize him for a while.",
  "I think someone probably saw some clusters of mushrooms growing somewhere and misidentified them.  I am certainly a better person from having taken hallucinogens, but things like this are some of the sources of the populus's aversion to them.  It pays to be cautious."
 ],
 "erowid": {
  "id": "3204",
  "citation": " Infernal Machine. \"Bad Batch of Mushrooms: experience with Mushrooms (ID 3204)\". Erowid.org. Dec 23, 2001. erowid.org/exp/3204",
  "substance": "Mushrooms",
  "views": "30049"
 }
}
