{
 "title": "2006: An Opiate Odyssey",
 "author": "Anonymous",
 "citation": " Anonymous. \"2006: An Opiate Odyssey: experience with Hydrocodone & Acetaminophen (ID 53460)\". Erowid.org. Oct 19, 2008. erowid.org/exp/53460",
 "substance": "Hydrocodone & Acetaminophen",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Hydrocodone",
   "(liquid)"
  ]
 ],
 "report": "<p>Dose:   25mg   Oral  Hydrocodon    (Extracted Liquid)</p><p>\t5mg    Oral  Hydrocodon    (Pill/Tablet)      T+30 Minutes</p><p>\t500mg  Oral  Acetaminophen (Pill/Tablet)      T+30 Minutes</p><p>Body Weight: 175 lbs.</p><p>This is my first, and only experiance with opiates. It was a good one, and I'll probably try opiates again. However, with that being said, I don't plan on getting addicted to them any time soon, so I'll probably leave some space in between experiances to avoid addiction.</p><p>9:30 PM: Started the process of extracting the Hydrocodon from the M357 pills.</p><p>10:30 PM: Finished extracting the Hydrocodon from the M357 pills.</p><p>11:00 PM: Dosed about 25 mg in liquid form.</p><p>11:21 PM: Mental capacities lower than average. Body is warmer. Thoughts are cloudy, but concentrated. Uper back/shoulder ache that I had at dosing is gone.</p><p>11:30 PM: Took one more pill that hadn't been crushed up.</p><p>11:32 PM: Wow, this stuff is incredible. No negative side effects yet, hopefully there won't be any. I'm going to have to be careful and only do this rarely though, because I've heard coming down sucks... and I really don't want to be addicted to anything. Actually, I refuse to acknowledge addiction exists.</p><p>11:40 PM: Just finished watching Robot Chicken. A little funnier than normal, if possible. Warm feeling has increased.</p><p>11:55 PM: Eyelids are heavy, but I'm not tired. In a pretty good mood, nothing AMAZING, yet. But I don't think I've peeked quite yet.</p><p>11:58 PM: It's started to pour. I can hear the rain hitting our metal roofing, and for some reason the sound is much more relaxing than it normally is. Worries are non-existent, and if it wasn't so late I'd probably be playing guitar.</p><p>12:15 AM: I feel sort of like I'm coming down, but I'm not sure...</p><p>12:27 AM: I was wrong. Incredible waves of euphoria. Intense. Slight nausea when walking. Light ring around my vision with eyes closed. Less evident with eyes open. Vision is slightly blurry.</p><p>1:05 AM: On the downward slope now. Very relaxed. Had a snack, but eating brought on some nausea. I'm going to go grab a soda. Watching Kill Bill Vol 2. on some random channel I didn't know we had. No commercials!</p><p>1:37 AM: This stuff definitely comes on in waves, or maybe it's just the extra pill I took. However, I'm thinking it's more of a wave thing. Much higher than I was at 12:27 or 1:05. Still watching Kill Bill. My brother turned off all the lights so it's completely dark. Very calm, serene feeling. Hard time concentrating... I want to stop writing and go back to spacing out.</p><p>2:15 AM: Movie is over, still high as a kite. Truly an incredible experience. I wish I was less tired, but sleep is calling to me, and I think it might even be blissful. More in the morning.</p><p>11:09 AM: Woke up, no headache. Poor taste in my mouth, but probably from something I ate before going to bed. My eyes have a hard time focusing on some things, but I'm sure that'll go away, and might even be related to just having woke up. Overall a positive experience. I can see why this would be addictive, but as I've always done, I will practice moderation and I doubt this will be a problem. I'd highly recommend this to anyone who is responsible in their drug usage.</p><p>I use use the cold water filtration extraction method to remove the Hydrocodon from the pills, leaving the crapy Acetaminophen behind, because as A. It can cause liver damage. B. It's extremely easy to do, and C. I think it makes the trip much more clean and clear, and reduces the negative effects.</p>",
 "year": "2006",
 "id": "53460",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-10-19T07:00:00.000Z",
 "views": "42577",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(liquid)"
  }
 ]
}
