{
 "title": "Collapsing Thoughts",
 "author": "Emanon",
 "citation": " Emanon. \"Collapsing Thoughts: experience with Salvia divinorum (10x extract) & Cannabis (ID 53484)\". Erowid.org. Oct 24, 2008. erowid.org/exp/53484",
 "substance": "Salvia divinorum (10x extract) & Cannabis",
 "bodyweight": "140 lb",
 "report": "<p>I'll begin my report by stating that I had never experienced any other drug substance besides marijuana and was unsure of what to expect.  This was my third attempted use of salvia, however the first two times was in no comparison to my latest use.  With the first two tries, I only felt effects similar to marijuana but slightly stronger (laughing, mellow feeling, slightly disoriented) I was very conscious of where I was and what had happened.  Perhaps holding the smoke in for a much longer time had a much more profound effect this last time, but I definitely had a far different experience.</p><p>I was in a peaceful state of mind with no anxiety causing problems at the time. I had a little help from a small amount of marijuana smoked before the salvia.  I asked a friend to videotape the experience for later reference, which I'm glad I did because the tape revealed a much different sequence of events than my mind suggested.  I'll start with the events that my mind led me to believe happened.</p><p>I remember walking into the room with a chair in one hand and a bong in the other then directly after smoking I fell to the floor and fell a prickling sensation starting in my throat, moving to my lungs, then eventually covering my entire body.  I felt as if I was either falling over or standing up, but I saw my friend walk up to me and grab me by the arm and say 'It's ok, it's ok.  It's over, just come with me.'  I realized in an instance that I was involved in some conspiracy and began feeling extremely paranoid, afraid, confused, and angry all at once somehow.  I had a brief notion to attack my friend, but upon thought I gave in because my life was over and it didn't matter.  I had lived my entire life with no meaning or substance to it, I had thoughts of doing everything I ever loved or enjoyed, and how they were gone forever.  This brought brief moments of depression but I realized that since it didn't matter, I should focus on what's going on now and what's about to happen.</p><p>As soon as my friend led me to the door of his room I realized I was on the floor again, then thought after thought raced through my mind at such a rapid pace I began to sweat profusely, though my body temperature felt normal.  I could see the texture of the room made of small chain links that were all connected to make up the fabric of existence and everything physical.  I felt like I was boxed in a small area in which there was no escape and felt very fearful.  I assumed that I had died and I suddenly realized that my existence was not important, and I felt as though I was being led outside of my body, out of the room, and into a location in the universe where I could see and know everything.</p><p>I actively imagined each thought that came into my head and each thought would collapse into itself, which I could actually visualize.  The best way I could describe it would be a picture of a picture of a picture (etc.) with a box in the picture.  The box would fold inward, then the picture would fold in the same way as the box, and so on with each of my passing thoughts.  I felt scared that I could not maintain any thought and began to think about memory itself, why does it exist?  How does it exist? I began to question things in my mind about existence and the universe.  While I was lost inside my head, I felt as though I was being guided by something I could not see or explain.</p><p>At one point I recalled being back in the room, I could see the light on above me and was pouring a thick plastic substance that coated the room and kept me from moving, so I didn't even try.  I would slip in and out of the room by falling through the floor.  The time when I was in the room I felt like I was being pulled down and I could feel gravity getting stronger and stronger.  I began to realize that I heard a buzzing sound and recognized it as a small fan my friend has near his computer.  I felt relieved that I had recognized something 'real' and felt glad that I was returning to what I perceived as being the current day, time, and place.</p><p>He walked in the room and he asked me if I was ok, and my reply apparently was 'Put on some cool music please, it doesn't have to be trippy'.  He put on some rap music that he knew I liked and I began to feel good, and I could actively imagine the music coming out of the speakers in layers that changed with each sound. I was given quite a shock when my friend's dog came in and his mom was following the dog to bring it into another room.  I wasn't panicked by the sight of either of these because I knew my friend's mom very well and could feel like I could relate to someone else that was 'grounded in the real world'.  I was beginning to come out and could recall to my friend some of my experiences but I was still very disoriented.  I'm pretty sure the marijuana prolonged and distorted the experience.  The entire trip lasted about 30-45 minutes but it seemed like a blink in time.</p><p>Upon review of the video, I kneeled next to the chair so I could smoke and be close to the floor in the event the effects would stagger me (which I have witnessed first hand from the same friend).  I leaned back against the far wall, said 'Whoa', then lie there for a few seconds.  In a very rapid motion, I leaned up and sprang to my feet saying 'Whoa dude' and knocked over the chair in my haste.  My friend rose to his feet and my eyes and face show an expression of fear, anxiety, and confusion.  He walked over to me and said 'It's ok, it'll be over in a moment'.  He encouraged me to sit down and I quickly said 'NO'.  After a moment of standing I slowly sat down and asked my friend who sat next to me 'I know you right?', and he replied 'Yes'.  Soon after that his dog scratched at the door and barked some and I pointed to the door and said 'He', and then my friend said 'It's the dog, would you like me to make him stop?', I replied 'Yes'.  He left the room for a while (maybe 20-30 mins) to calm the dog and allow me to ride my high. Nothing much happened on video after that, only a very long period of motionlessness.</p><p>My overall opinion of the experience was a feeling of spirituality and ominous thought, even though I don't consider myself a religous person.  I had the feeling that I knew what it was like to die when I was aware and conscious. I could only relate the feeling of immediate change from aware and thoughtful to a feeling of spiraling oblivion and lack of existence to the moment that a person dies.  I also felt disconnected and a little meaningless afterward as I recalled my journey and thoughts. I'm not sure if the overall experienced could be classified as good/bad, but my friend and I share the thought of it being a somewhat evil presence since the essence and substance of life was greatly belittled and made to feel pointless. Some things I've gathered are that external stimuli (lights, noises, people) do have an effect on how I experience the effects.</p>",
 "year": "2006",
 "id": "53484",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-10-24T07:00:00.000Z",
 "views": "2878",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
