{
 "title": "The Creators",
 "author": "Kamik",
 "citation": " Kamik. \"The Creators: experience with Syrian Rue & Mimosa hostilis (ID 53489)\". Erowid.org. Jun 22, 2006. erowid.org/exp/53489",
 "substance": "Syrian Rue & Mimosa hostilis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "Syrian Rue",
   "(extract)",
   "",
   "3 capsls",
   "oral",
   "Mimosa tenuiflora",
   "(extract)"
  ]
 ],
 "report": "</p>This is the first Ayahuasca experience my girlfriend and I had and I am sure you will find it interesting.</p><p>First of all let me apologize for any mistakes I may have since English is not my first language.</p><p>Background:</p><p>My girlfriend has never tried any other drug before (apart from alcohol and tobacco). Me, on the other hand have tried and used a few: tobacco, alcohol, marihuana, hash, MDMA, cocaine & mushrooms. I also tried a trip once but it was a dodgy one, so it doesnt count.</p><p>It has been now over two years a quitted everything, including tobacco. But for the last year I have been really interested on natural entheogens and plants / herbs in general. I have read and learned quite a lot.</p><p>Now, since the first time I read about DMT, and soon afterwards, Ayahuasca I realized this wasnt a new way to get high, or something to do when I am bored or have no plans  No. There were beings communicating, passing on messages, healing, giving spiritual advice. I am amazed this hasnt been on the news all around the world! Anyway, I had to investigate. I read and learned and then read more.</p><p>I eventually managed to get some DMT which by the way we tried in countries where it still is legal, so no laws where broken.</p><p>In my first experience I saw a beautiful set of colours melting around, the typical jet sound in my ears briefly and happiness. A great experience but no encounter or breakthrough.</p><p>My girlfriend also tried. Because she has no experience smoking from pipes and bongs couldnt get a big enough hit, but she felt something. But something happened that got me thinking. She closed her eyes and told me she could se a boat, with colour lights around it. Straight away came to my mind the Brazilian religious group called the Barquinha ('little boat') who also drink Ayahuasca as a sacrament, and their religion was founded on a vision of a boat of light.</p><p>Then I thought it must had been a coincidence, and it may had</p><p>Our second experience was  not. The DMT quality wasnt good enough for its effects to be noticed. Disappointing.</p><p>I would also like to point out before this time we tried Salvia Divinorum. I tried the leaf and extract. The extract was very interesting but the leaf didnt do much.</p><p>My girlfriend tried the leaf and when closing her eyes she could see things going on.</p><p>I am sure that you all have realized where I was going to with all of these: my girlfriend is somehow quite sensitive to these substances.</p><p>The alchemy:</p><p>A bit upset of not getting where I wanted, moved onto Ayahuasca. I prepared it on capsule form. Syrian rue boiled thrice and then boiled down to powder. The same for Mimosa Hostilis, except the evaporation of water was done in a microwave.</p><p>So we both had a capsule of Syrian Rue extract equivalent to 2.5 grams of the seeds, and 45 minutes later my girlfriend had 1 capsule of Mimosa Hostilis extract and me 1.5. These equal to 2.5 grams for my girlfriend and 3.75 for me, and had been calculated to be a threshold dose at 0.25mg/Kg DMT with a 0.57% estimated concentration in the MHRB.</p><p>T+ 0:30</p><p>We were feeling nothing more that a bit drowsy and heavy from the Rue, and I bit of disappointment because I new the effects should had being kicking in.</p><p>T + 1:00</p><p>I started feeling a bit more clear minded and awake. Some vision and colour enhancement, but nothing major.</p><p>I decided to have another half capsule equivalent to 1.25 grams of MHRB. So now all added up to 5 grams.</p><p>My girlfriend had bad stomach so she excused herself for a while (no vomiting).</p><p>When she came back I started seen the room a bit more cartoon-like DMT fashion. So I thought something could still happen. And it did, but not to me.</p><p>The experience:</p><p>My girlfriend started saying she was feeling a bit weird. She had never felt like that before, and she came to lay down with me. When she close her eyes she said: Hey, they are coming for me. From then on she was for about 2.5 hours communicating telepathically and asked me to be patience, she would tell me everything at the end. And I will tell you now.</p><p>The first thing she saw was a pair of eyes, alien like that took her through a set of tunnels. At some point during her traveling she became a colour, orange. This was a fairly quick thing and she was there, with whom she called The Creators. They had their own agenda with my girlfriend and kept saying something like we havent got much time and we have to make good use of it. Thats why my girlfriend asked me to be patience and wait. All the time they were very nice and caring of her, never wanting to disturb or shock her. They never even showed themselves to avoid these state of shock, which they told her would interrupt the communication. And they even managed to get rid of her stomach ace.</p><p>They showed her many things, from the creation of The Earth, what we do here, to the death process and personal things about my girlfriend and us as a couple.</p><p>Somehow, all of these where questions that my girlfriend had been asking herself for a while and then it was all answered.</p><p>The Creators, according to what she was told, are very old. Older than Earth, and they created it. They are a very evolved specie trying to find their origins, trying to find their past. They placed us here to understand, and apparently they dont feel happy that we have to go through all of these for that purpose, but it seems that was their only choice. There is other test planets like ours. With different life forms, which were not shown to my girlfriend may be to avoid a shock (she gets scared easily).</p><p>They said they are impressed how quickly we have evolved (technologically I suppose).</p><p>They showed her a huge bomb explosion (Hiroshima?) and said they didnt understand why that happened. Sort of there was no point whatsoever. They actually said they had to intervene with the effects of the bomb, even though they could risk the natural evolution process they were studying. Apparently it would have destroyed most of the planet, and they said we had created so many things they didnt want to see them go.</p><p>Then they got into the personal side, which understandably I will not get into.</p><p>They also told her she would die very old and was offered to see her own death, but refused.</p><p>She also was shown how the communication with them worked at brain level! They even showed her the part of the brain that was in charge of translating. Apparently we all have the ability of doing it, but we cannot reach this part of our brain during normal states of consciousness and is only through some drugs or meditation that we can achieve this, even though they mention that some people can do it normally and other people, like my girlfriend can get to this state easier than most of us do.</p><p>Conclusion:</p><p>In fact, if I think about it, most of the breakthroughs with Ayahuasca and / or mushrooms happen when the individual is totally tripping, at least to my understanding. My girlfriend had a total breakthrough experience that lasted 2.5 hours, where she could just close her eyes and she would be there and she didnt see even the minor visual disturbance going on, whether OEV or CEV. It was a pure telepathic communication with these entities. I was and am so amazed I had to share it with you all</p><p>Me on the other hand didnt feel anything. Ended up taking a third capsule (7.5g MHRB all together) and not even some cool colours. On the other hand my girlfriend was told my energy had helped the communication. That her and me have a sort of mental connection going on And they did answer questions that I asked her for them. They said she didnt have to ask them again, they could hear me.</p><p>A truly amazing experience. Shame I couldnt see anything, but I would have not done anyway. I am sure I microwaved the Mimosa Hostilis for too long and vaporized most of the DMT. Or my experience was been channeled through my girlfriend, who knows</p><p>One last message I would like to pass on, which is my own ~personal interpretation~ of what they told her:</p><p>Having this experience is great. They will welcome me, they will be happy to see me and try to help me as much as they can, but once the do, I have to get on with my life. There is no point coming back to them every weekend / month for a bit of the old chitchat. Life is a path that I have to walk by our-selves, and no drug, experience, encounter or whatever will do that for me.</p><p>Our best wishes to you all.</p>",
 "year": "2006",
 "id": "53489",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2006-06-22T07:00:00.000Z",
 "views": "9509"
}
