{
 "title": "A Night of Fear and Claustrophobia",
 "author": "Audrey",
 "citation": " Audrey. \"A Night of Fear and Claustrophobia: experience with Datura (ID 53490)\". Erowid.org. Aug 23, 2006. erowid.org/exp/53490",
 "substance": "Datura",
 "bodyweight": "195 lb",
 "report": "<p>I went to a friends house and everyone decided it would be fun to drink 'hells bells tea'. It was about 10 o'clock at night and we had just finished eating our supper when the tea was finished boiling. We each grabbed a mug full of the yellowish liquid (there were 4 drinking the stuff including myself, and one sober babysitter)added some honey and began to sip at the hot water.</p><p>I was the first to feel the tea's affects. It took about twenty minutes for me to feel the drug starting to take over my senses. First thing that happened was loss of concentration. I couldnt stay still for the life of me. I was incapable of focusing at all. Then my eye lids became heavy and while the whites of my eyes became BEAT RED. I couldn't walk without the support of a wall or someone helping me walk. I began to feel nauseous so I laid down on my friends couch for about 15 minutes. When I still felt nausea taking over I decided to go to the bathroom (I thought maybe if I vomited it out I'd be fine). I wasn't.</p><p>I started to feel really ill. I could barely move and I kept thinking I had to urinate. I would be standing up from going pee and as soon as my pants were up I'd get the urge to sit down and pee again.. I must have done this many times and been in the bathroom for a while because my friend came and knocked on the door to see if I was alright. I told him I didn't know and left the bathroom.</p><p>The three other guys that drank the tea were in the room howling something fierce. They were laughing cause they couldnt stand and falling over each other like it was the thing to do. I wanted so badly to be having fun like them but it wasnt going to happen! Everytime I would attempt to go to them, everytime I tried to move the nausea would increase and I'd be stuck where I was.</p><p>At around 12:45 that night I had finally had enough and was starting to get a little freaked out. I told my sober friend that I needed to go home and ride it out cause I wasn't doing to hot so he took me home. I got home and he had to help me out of his car. And after stumbling to the front door I didn't have the strength to even find my house keys. I banged on the door for what seemed like an eternity and my mom answered the door. She asked me what was wrong and I told her I was messed up and I didn't know how to stop it so she made me go to the emergency room with her. We went to the emergency room, I was admitted and hooked up to an e.k.g. machine, had an I.v. stuckin my arm, oxygen in my nose, and they even did an m.r.I. on me. all of my vitals were normal but I was hallucinating very badly.</p><p>I kept thinking I had a cigarette in my hand and everytime I went to take a drag it was gone. More than once I looked around for the ciggarette thinking I had dropped it. My mom had to remind me that I was in a hospital bed and that there was no smoking there. Then I saw a bird, or I thought I saw a bird, and my mom again had to inform me of where I was at. I saw a lady bug crawling on my bed and tried to catch it with no success. I was also talking to me mom like she was one of my friends, which would not have been so bad if I wasn't actually talking about my mother. After I had said my piece she told me 'Audrey. I am your mother'! All I could say was 'YOU ARE!? No way! How funny'!</p><p>The whole time I was in the hospital I kept trying to leave. I wanted to get up and move. I was restless and annoyed at the fact that I was stuck there. I kept trying to take my I.v. out of my arm. My mother, one female nurse, and two male nurses had difficulty holding me down in my bed. I just wanted to leave. Then when I was taken to get the M.R.I. I kept trying to climb out of the machine.. My mom had to practically lay on me for them to complete the tests.</p><p>I was finally released from the hospital at 6 am. I don't remember most of the night. The things I remember are like far away dreams. Apparently I put my underwear on my head and was trying to take my blouse off as my mom and I left the emergency room. I dont remember being released from the hospital.. I dont remember leaving my friends house and coming home. I dont remember the drive to the hospital or getting admitted. I dont remember how I got from the hospital to my house. I dont remember more than half of what happened to me last night.</p><p>It's now been close to 24 hours since I first drank the 'hells bells tea' and I'm still seeing random hallucinations. The most prominent visual is words shaking, or waving when I concentrate on reading them. I'm having difficulty writing this experience report right now. Other than that I feel like I have a mild hangover. Slight head ache.. upset stomach.. and cotton mouth.</p><p>I've never had a bad drug experience before this one and I will never touch this evil plant ever again.</p>",
 "year": "2006",
 "id": "53490",
 "gender": "Female",
 "timestamp": "2006-08-23T07:00:00.000Z",
 "views": "11221",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "4 flowers",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 ]
}
