{
 "id": 535,
 "title": "The Angry Shroom",
 "date": {
  "submission": "2004-06-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jiko",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "plant material",
   "specific": "P. cyanescens"
  },
  {
   "time": "2:30",
   "amount": {
    "number": "1",
    "unit": "bowl"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Magical mushrooms are not something to play around with. Only when a user is experienced should he or she attempt a higher dose or level. Today, I ignored that rule and offered my friend (who had never done it before) to take 7 grams of cyanescens with me, splitting it equally between us. I, being an experienced user, could handle this dose, yet my friend would have some trouble. Psilocybe cyanescens are extremely potent (not as potent as azurenscens, but quite more than cubes), and it is definitely not something you give to a first timer, especially at a high dose of 3.5 grams.",
  "1:30 PM: The shrooms were ingested in a forest clearing behind my house, which is appropriately called 'Mushroom Hill'. I could not sense my friends thoughts exactly, he seemed to be calm and sure of himself. Those are the most important things before tripping, I believe.",
  "2:00 PM: After moving away from Mushroom Hill, we approach the store close to my house. Things start kicking in, my vision becomes blurred and my mind starts opening the pathway to that magical shroom world.",
  "2:05 PM: Enter store, the trip is still getting ready to start. The colorful, candy like colors begin to form in the produce section of store. After 'geeking out' for a few minutes, we leave.",
  "2:10 PM: After returning to mushroom hill, we go to our fort and sit down. The whole woods were vibrating and swirling in circles. At times it looked like the forest was building a barricade so we could not escape. I was having a wonderful time, and it appeared my friend did as well. I felt like my thoughts jumped from my head and to the ground, then the tree. I could think anywhere I wanted to.",
  "3:00 PM: Things started to get weird in the forest, as we were surrounded by millions of branches, so we decided to get to a more open space. After leaving the forest we traveled the candy coated land of my neighborhood and went to my house, and went straight to my room to avoid the parents.",
  "3:30 PM: Its felt like hours now. Pink Floyd is turned on, my incense jar is lit. The windows are closed so a big cloud of smoke starts to form in the middle of my room. We find ourselves staring at the wonderful textures formed in the smoke. After looking dumb for a half an hour, we return to the outside to smoke a bowl.",
  "4:00 PM: Outside, my friend said, 'Man, this has become disappointing now'. Big mistake. Never make fun of the shroom EVER. When I was about to smoke a bowl, I felt that the peak of the trip was over, so it was ok to end it with weed. After smoking a bowl (GOOD WEED), I felt that the trip was brought back into full power, with the weed buzz over it, totally changing it. Things became really...I mean really slow. Walking in a straight line was hardly a possibility, but we walked home.",
  "4:30 PM: At home we chill in the room...look at the incense. Then its time to go. My mom takes us to the garage and we follow behind her. All of the sudden, my friend gives me a look as he falls to the ground. He starts shaking a little bit then gets up. He falls again. As I'm going down to pick him up, he turns into a little blob and slips through my fingers. 'Man GET UP GET UP' I say to him. My mom was only 10 feet in front of us...miraculously...she didn't see anything up to that point. He got up and then suddenly went limp in my arms again, and fell down. I put him in the car, and went in after. How my mom did not see any of this go on...I have no idea. I thank whoever is up there in blessing me with street-retarded parents.",
  "4:35 PM: In the car, my friend starts mumbling things like 'Oh I've never felt like this before' and the like. My mom becomes concerned and asks what's going on. I say we drank too much eggnog...she believed me. again...i thank whoever is up there. While my mom was driving, I seriously thought I was in a space car. Crazy sounds were playing in my ear, we were going hyperdrive through the scariest part of space. Throughout the car ride I tap my friend to find out if he's ok. He has a worried look on his face, but finds the strength to act normal for the rest of the time.",
  "5:00 PM: I return home with my mom. For the next hour, I was incredibly freaked out. Nothing this sketchy happened in my life. I doubt many people have had a closer call than that. I felt like my face became stretched over a new face. I was incredibly cold, shivering. I sit in my couch and I am 1000 miles away from my 1000 mile tall TV that is towering before me in its pale blue light. The room was falling apart, then rebuilding itself. During this period of deep thought, I thought a great deal about the color spectrum. Have you ever heard of a darker shade of white? A lighter shade of black? These immediately become gray, even a half a shade darker/lighter. Then...perhaps black and white is the most limited color known to man. Why are they the most dominant?",
  "6:00 PM: My friend calls me, and everything is ok. We talk about why he started going crazy back there, and we come to the conclusion that...simply it was way too much for a person that has never tripped before. Really folks, be careful with shrooms. I felt like shit today because I really ruined a friend's good time. Will he ever touch shrooms again? I dunno. I could hear in his voice that he regretted ever calling the trip weak or 'disappointing'. He will know in the future to never, ever, make fun of the shroom again.",
  "Tripping is not really fun with someone who's never done it before, there's more responibility on my part, and if I fuck up, I've really fucked up. I left alot of the info about what I saw or felt in the trip out of this report, because I was focussing on the harsh reaction that occured near the end.",
  "Make friends with the shroom, my friend, because if you aren't friends with it, its your enemy. And when your in the Shroom world, the last thing you want it to become is your enemy. It will beat your ass into oblivion."
 ],
 "erowid": {
  "id": "11141",
  "citation": " Jiko. \"The Angry Shroom: experience with Psilocybe cyanescens (ID 11141)\". Erowid.org. Jun 15, 2004. erowid.org/exp/11141",
  "substance": "Psilocybe cyanescens",
  "views": "9006"
 }
}
