{
 "id": 5356,
 "title": "Intense Focus, Slight Euphoria",
 "date": {
  "submission": "2004-03-22T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Wilhelm S.",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "oral",
   "substance": "IAP",
   "form": "(capsule)"
  },
  {
   "time": "1:30",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "IAP",
   "form": ""
  },
  {
   "time": "4:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "IAP",
   "form": ""
  }
 ],
 "report": [
  "Managed to get some IAP. Setting was pretty good - went out to party with some friends. Had some internal issues to work out.",
  "t.0:00 - Took 35mg in a gelcap, carefully weighed out.",
  "t.0:15 - First alerts -- I was on an empty stomach.",
  "t.1:00 - Slight euphoric rush. Sort of like a small % of an mdma rush.",
  "t.1:30 - Dosage bumped by 10mg.",
  "t.2:00 - First get a chance to catagorize my mindset. _really_ awake! Head feels light. This is nice. Sort of like mdma without the rolling empathy vibes.",
  "t.4:00 - Dosage bumped by 10mg.",
  "t.5:00 - Plenty of energy for dancing -- but I don't have to. Not an uncomfortable energy. Feels like it's impossible to be bored. I test this by staring at the wall for a few minutes. I'm not bored! Not sure where my head is -- it's like my capacity to be bored has been turned off.",
  "t.8:00 - Finally coming down slightly but I had a few hours left in me. Decide to take a sleeping pill to allow sleep.",
  "Notes: This lasts a long time. Be prepared. It's also no substitute for mdma -- but might be a great tool for writing, etc, anything that required some intense concentration. This is not a plain old amphetamine. There is some great introspective healing inside of it -- but that's harder to capture in a trip report."
 ],
 "erowid": {
  "id": "32070",
  "citation": " Wilhelm S.. \"Intense Focus, Slight Euphoria: experience with IAP (ID 32070)\". Erowid.org. Mar 22, 2004. erowid.org/exp/32070",
  "substance": "IAP",
  "views": "14109"
 }
}
