{
 "title": "Mother Nature and the Baseball Field",
 "author": "Mushrooms",
 "citation": " Mushrooms. \"Mother Nature and the Baseball Field: experience with Mushrooms & Cannabis (ID 53577)\". Erowid.org. Nov 26, 2008. erowid.org/exp/53577",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "53577",
   "Female",
   "",
   "Not Given",
   "Nov 26, 2008",
   "3371",
   " "
  ]
 ],
 "report": "<p>This was my first time tripping. I went to my house on a Friday after school with four other friends, and we proceeded to eat 2.5 grams of very good mushrooms each. It was a pretty rainy day, but it was quite warm so we didnt have any problem with spending our trip outside. One of the other kids and I smoked a bowl out of my bubbler before we started tripping. We went back into my room after that and all of us except for one of us started tripping. We hung out in my room for about half an hour before heading out into the woods. While in my room, I was feeling very high with the mix of the weed and the mushrooms starting to kick in. I lay on my floor with music playing and stared at the posters in my room changing. My friends did similar things. </p><p>We then proceeded to head out into the woods. There is a big ravine in the woods behind my house, so we just started walking down that all feeling very good. We walked for about five minutes before we came upon a patch of ferns. My friends all stayed up the hill a little bit and looked at it, but I went down into them and lay down. I was in a complete euphoria at that point. The trees were dancing around me, and the ferns around me were the most beautiful things I had ever seen. I was the happiest Id ever been in my life. After that, one of the high points of my trip and maybe even my life happened. Mother nature appeared in front of me. It started out where I just saw feet, and she grew up like a plant until there was a full old woman in front of me, of which Id never seen before. After becoming a full person, she stayed for about five minutes before shrinking down again the same way that she had come up. I lay in the ferns for a little while longer before my friends and I decided to keep on moving. </p><p>We moved sloppily through the woods for an undetermined amount of time. The whole time, the trees were dancing around me, and the rain was coming down too. Everything was extremely beautiful. We followed a trail until we came to a fence. We were all tripping pretty hard, and we had some trouble going over the fence. We walked along the fence until we came to a tree that was leaning up against the fence. One of my friends went over first, and he shouted out that he was the king of the world once he got to the top. He then jumped down. I was the next to try. I climbed up the tree to the top of the fence, and as soon as I got the to the top, I too felt like the king of the world. Right after I got to the top of the fence, one of my friends told me that there was a hole in the fence. I also started to feel very scared. I thought that I was very high up, and that I would die if I were to jump down. I then climbed back down the tree, and went through the hole. </p><p>After going over the fence, we had gone from a green part of the forest to a brown part of the forest. Everything changed very dramatically. The mood became more mellow, and even a little bit scary. I wanted to go back to the green part, where everything was happy. I then saw a patch of green ahead of us, so we went to see what was there. When we got there, it turned out to be a baseball field. It was in a pretty private part of town, so we decided to spend our trip there. The first thing that I did was lay in the wet grass. I lay there for a long time. The trees around the field were all moving, and the clouds were swirling. It then became very intense, but still very fun. The clouds were swirling fast overhead, and the grass was changing too. I started yelling out of joy at the top of my lungs. This went on for a long time, before I decided to go into the dugout to get out of the rain. </p><p>We stayed in the dugout for a long time. We spent the whole time yelling and talking about crazy stuff. Then, one kid completely lost his bearings. He kept on thinking that it was time for class, and that we all had to go to school. His trip had gone bad. We all tried to make him feel better, but we couldnt. Eventually, we all went home to our own houses, but had to make a stop at my house first. </p><p>During the walk back to my house, I was still tripping pretty hard. When I got home, I went inside, and had an intense desire to be alone. At that point, one of the kids went into my house, and started vandalizing stuff. He took a dish towel covered with grapes, pulled it out, and the grapes went everywhere. He then ran around my house throwing grapes all over the place. I eventually kicked him out of the house, and I was finally alone. I went up to m room while still tripping. The posters in my room became three dimensional, and moved around. Also, the walls of my room started shifting around. They would blend together until the angles were all messed up, and the room would look small before the walls would expand out again and my room would look larger than it really was. Finally, the mushrooms wore off, and I fell asleep. </p><p>If there is one important lesson that I realized, it is that home is safe for me. I was feeling a little weird before I got home, and as soon as I stepped through my door, everything was okay. I now know that whenever I feel unsafe, I can always just come home.</p>"
}
