{
 "title": "Now I Respect True Power",
 "author": "Dreg",
 "citation": " Dreg. \"Now I Respect True Power: experience with 4-HO-MiPT (ID 53587)\". Erowid.org. Jul 11, 2006. erowid.org/exp/53587",
 "substance": "4-HO-MiPT",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "26 mg",
   "oral",
   "4-HO-MiPT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I started the night at my friend's house, roughly 11 o'clock and immediately gobbled down the paper napkin that bundled the off white powder inside (took on a full stomach. I had a friend who I was with at the time, none of them taking any drug or ever even seen someone on a psychedelic). Ten minutes in, I began to feel the energy-like body high. We decided to go play soccer in the freezing cold rain, probably not the smartest idea. After about 10 minutes we decided to go wash off with the hose, since we had mud on us. I was very social during the onset, and was able to move easily, it was actually quite enjoyable.</p><p>As we got to the house the soccer ball was lying on the ground and I began to watch it deflate and inflate over a 4 minute period. Roughly thirty minutes in I felt a new level of intensity come on, not only to my body but my mind and between the next 10 minutes became a blur, but I do remember going down to the basement on a very wavy ground. At this point I remember being escorted to a car where a couple of my friends were who wanted to see me 'fucked up'. They put the heat on since I was shivering out of control. The warmth felt good and patterning along the roof of the car began to form. The patterns resembled big blood vessels running throughout the car and the taco bell rappers were tumbling between the seats. They took a couple of pictures of me, but I didn't really pay attention to them.</p><p>Talking began to become quite hard as I was escorted back into the house my friend #1 began yelling at me. He started to grow bright red horns and raised black eyebrows with glowing eyes. It was very terrifying. My Asian friend #2 came over to help me with the situation as I was cowering in fear. I found myself in a white room and my friend #2 seemed very extraterrestrial. I told him that he seemed like a beautiful angel but I wasn't quite sure if I was speaking English. I would also like to note that the colors at this point were extremely vibrant, the multicolored rug I was on began to form into a color whorl pool that I was standing on and the ceiling began to open and show sky. All this happened in about 10 minutes as well, it seemed like a couple hours. The auditory hallucinations began to confuse me as everyone's voice overlapped and played roughly 2-3 times like a skipping record. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I got back into the car and drove down the street to taco bell. The water on the road made every side of the street reflect, which caused great confusion The peak so far was not pleasant but after about 40 minutes of having my ego completely destroyed and the overwhelming body high made it seem as if I was going to throw up at any moment, it ended. The visuals faded quite rapidly, as I drank water the whole way through and went to the bathroom about every 20 minutes. After about 2 hours the peak was gone and the rest of mild patterning and waving faded in the next 2 hours as well. The body high did not leave until later that night and I slept a total of 20 minutes. I am still up right now without sleep in 24 hours.</p><p>I did not respect this substance enough and thought I could get away with these horrid conditions. On a more positive note, I would not trade the trip for another one. The complete ego loss was very insightful and the visuals were extremely stimulating.</p>",
 "year": "2006",
 "id": "53587",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-11T07:00:00.000Z",
 "views": "8308",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "26 mg",
   "administration": "oral",
   "substance": "4-HO-MiPT",
   "form": "(powder / crystals)"
  }
 ]
}
