{
 "title": "A Learning Experience for My Mind and Soul",
 "author": "Apfrommsp",
 "citation": " Apfrommsp. \"A Learning Experience for My Mind and Soul: experience with Mushrooms & Cannabis (ID 53593)\". Erowid.org. Oct 30, 2008. erowid.org/exp/53593",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "170 lb",
 "report": "<p>It started out in the middle of April in Minnesota, my friend, who I will call S, told be and his brother, who I will call N, that he had come across some chocolates with Psilocybe Cubensis Mushrooms in them. Having not dabbled in any other substance before besides: Marijuana, my daily dosage of Adderall, many painkillers, Salvia Divinorum, and Alcohol, I was quite intrigued. I went online and did some research on it and weighed the pros and cons and decided that my reason to do them was not simply to trip, but to get personal insight. The next day we drove out to our source and bought ourselves two chocolate bars of it, each bar containing about 1/16 of a gram. I decided not to do them until I felt I was in a perfect mood from the moment I woke up.</p><p>The day came, I felt perfect when I woke up and decided not to take my Adderall, for I wanted nothing to possibly interfere with the mushrooms. I also was on an empty stomach to combat possible puking. My friend M, who was my trip sitter, came and picked my friend N and myself up and we decided to go out in the woods for a day to experience the journey, I came equipped with my iPod to listen to in case I felt that I wanted to be in my own world and a pipe loaded with marijuana, plus another bud for another bowl if needed. We made our way in to the heavily forested area known only as 'The Bog', the area was covered with trees that were in bloom and there were quite a few bogs in the area hence the name.</p><p>When we found an area that was comfortable and had a good log to sit on we ingested our chocolates, they tasted good inside these chocolates and melted in my mouth. After we consumed them we sat around and spoke with each other about normal things just talked and were waiting in anticipation, my friend M, who had prior experience with this substance, told me 'You will never forget this.' He was right. About 40 minutes had passed and all of the sudden in the middle of a conversation I laughed at nothing that was funny at all N said 'Dude, what is so funny?' I could not respond, all I did was laugh, I was crying because of the laughter.</p><p>After the laughter had subsided, about an hour after ingestion, I decided to look at my hands and lines in my hands and fingers were moving and I started to see the trees around me bend unnaturally. I went to be by my lonesome down a path, I put my iPod on and listened to 'Strawberry Fields Forever' and 'Lucy in the Sky with Diamonds'. I felt a lot of meaning come from Strawberry Fields, it's words were trying to tell me something, the line 'It's getting hard to be someone but it all works out.' gave me personal insight. It told me to be myself no matter how hard it may be and how much people do not like it. I realized that there was no point in trying to please others with fakeness, it was a revelation.</p><p>Another 45 minutes had passed and it kept getting more intense, everything was moving and movement was slow, watching my feet while walking seemed like it took days for just one step. I walked over to N, by then it had already been 2 hour and 15 minutes since  we started, it took me thirty minutes to walk to him, just down a hill by a bog. We smoked a bowl of some good nugget, this made the experience blow up. Everything was moving and was moving slow, we stared at the bog and it looked like it had a tide, yellow particles emerged and moved around clockwise, I stared at this and just sat in thought. I thought about everything, my problems with my father, my demeanor, my choice of friends. It was all becoming clear, I had the urge to make mends with my father and wanted to be the bigger man by ending our conflict.</p><p>Time had passed, we were coming down at about 4 hours, we decided to walk to the car, on our way out of the bog we smoked another bowl, this took us back to the peak it seemed. Movement became slow, M yelled to us 'Come on guys' those words echoed in my mind and it seemed like he was running while we were just walking though we had just been moving very slowly. It took about 30 minutes to get to the car, when we got to it we decided to get some food. We went to Buffalo Wild Wings, being in a crowded place brought out my paranoia, my trip was coming down a lot by the time we got there it was about 5 hours after ingestion. I thought everyone in the place knew, and that we were going to get caught by some non existent force. We ate and the trip was pretty much over.</p><p>As the day went on I had a feeling of tranquility and peace in my mind. I called my father and we have been speaking since. My realizations have improved my quality of life, now I do not try to be someone different, I am who I am. That is because a simple substance and a simple line, 'It's getting hard to be someone but it all works out.'.</p><p>This substance was a great learning experience and I am very appreciative for the chance to experience it.</p>",
 "year": "2006",
 "id": "53593",
 "gender": "Male",
 "timestamp": "2008-10-30T07:00:00.000Z",
 "views": "2434",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(cookie / food)"
  },
  "1": {
   "time": " T+ 2:15",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 4:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
