{
 "title": "Could Have Been Incredible!",
 "author": "Human",
 "citation": " Human. \"Could Have Been Incredible!: experience with Salvia divinorum (ID 5360)\". Erowid.org. Jan 13, 2002. erowid.org/exp/5360",
 "substance": "Salvia divinorum",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "6 shots",
   "oral",
   "Salvia divinorum",
   "(liquid)"
  ]
 ],
 "report": "<p>February, 2001.</p><p>In my living room.</p><p>2 Others Present</p><p>This was my first time with salvia. I had been looking forward to it for a couple days (it had been delivered on the way), and wasn't really expecting anything (I try to not expect anything because nothing turns out as I'd expected). I had waited quietly for my friends to trip; it being my house, I wasn't sure what might happen. They pretty much just laid there quietly for about 25 minutes or so. They had been back for about 10 minutes, and said they didn't really feel much from it. I obviously still wanted to try it.</p><p>My turn!</p><p>So, I took 3 doses of this pure liquid extract a friend had gotten ahold of. With this extract, you hold the liquid in your mouth for about 7 minutes to absorb it through your mouth (it won't absorb through your stomach), then spit it out. I waited for 7 minutes, took 3 more, and spit that out 7 minutes later. I was already feeling it at this point.</p><p>I closed my eyes, layed down on the couch, started listening to the music we had playing (trance), and drifted out of my living room. It seemed like I was getting layers upon layers of colored 'stuff' getting thrown around in front of me, just floating out somewhere. Oranges, yellows, bright whites, blues, greens; all of them seemed shiny and vibrant, rippling and 'sloshing?' over me. It was pretty amazing...</p><p>My doorbell rang. I snapped back to the couch, and looked around. Neither of the others were doing anything about the doorbell, so I answered it through the intercom.</p><p>Some lady was asking if my house was [some address that it wasn't]</p><p>I told her what address my house was. She left.</p><p>WOW! That sucked! I dropped back onto the couch, laying down again. Almost immediatly I was back out, somewhere with no intercoms or people asking for addresses. I got the feeling that layers of color were being flung over me again, but this time it seemed that other people or beings were giving me this color, layer by layer. I did not see these Others, but it sure felt like they were there. Looking back, I think it was probably the friends that my conscious knew were still there, back in my living room. I also noticed that when I closed my eyes a bit harder, the entire hallucination would morph into something seemingly a lot larger, MORE colerful, and MORE 'engulfing?'</p><p>The others in my living room started talking. I snapped back to the couch, opening my eyes and looking at them. They were talking about thier trip.</p><p>Thier words kept tearing my 'dream' apart, sucking me backinto my living room.</p><p>The rest of the trip (Probably 10 more minutes) was not nearly as cool. They kept talking, talking, talking, pulling me back to reality with every word.</p><p>I enjoyed the liquid extract. Apperantly it lasts a lot longer than smoking it does(my trip was about 30 minutes, and my friends were gone for about 25 minutes. After-effects were there for a couple more hours. Smoking pot afterwards was pretty cool as well).</p><p>Next time I will make sure nobody is going to start talking during my trip. Every time a word was said, it would punch a hole in my hallucinations, and drag me back to my couch. The music was amazing, but people just talking loudly was terrible.</p><p>I would also recommend turning off lights so people won't be ringing your doorbell.</p><p>Overall, I enjoyed it a lot and will want to give it another shot, probably more doses, less people, and less noise.</p><p>-=M=-</p>",
 "year": "2001",
 "id": "5360",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-13T08:00:00.000Z",
 "views": "6715",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6 shots",
   "administration": "oral",
   "substance": "Salvia divinorum",
   "form": "(liquid)"
  }
 ]
}
