{
 "id": 5361,
 "title": "Very Nice, Don't Go Overboard",
 "date": {
  "submission": "2004-03-22T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Goddog",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "14 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  }
 ],
 "report": [
  "I just recently got some Kratom from one of the few reputable Kratom sites that doesn't charge a ridiculous amount.  I got an ounce for $15  with shipping.  Dosage seemed to range from 5g of tea from dry leaves on upwards to as much as 50 grams.  So I made the entire ounce into tea, adding lemon, boiling, straining, adding more watter and lemon.  I did this three times, and boiled down the final amount to 550ml.  A friend and I each started out drinking 200ml.  This produced good effect.  It reminded me ALOT of GHB, in the sort of energy, sociabalizing effects.  The air had a very thick feel to it like a +1 psychedelic, or a little bit of weed (which I haven't smoke for a year, so there aren't any residual effects).  We decided to drink the remainder and the positive effects continued until about the 3 hour mark. At this point, my friend noticed nausea and went home to get something to eat. ",
  "At about 3 and a half hours after initial consumption, I had a stomach ache and lingering nausea, but not intense enough to cause vomiting.  I went to bed after an hour or so of stomach discomfort and mental confusion, much like taking a little too much GHB. ",
  "Looking back, I think that the initial 200ml should have been the stopping point.  This is already probably around 10g of dried material.  I would say that this dose would be very pleasant without any of the downsides.  Though I would like to try again at a lower dose, and make sure that the negative aspects noticed were from over-consumption and not simply from 'coming down'. ",
  "Overall the most potent, enjoyable effect (not taking into account the later discomfort), obtained to date from a legally available herb.  The only stronger one would be Salvia, which is not always pleasant.",
  "Thanks."
 ],
 "erowid": {
  "id": "32093",
  "citation": " Goddog. \"Very Nice, Don't Go Overboard: experience with Kratom (ID 32093)\". Erowid.org. Mar 22, 2004. erowid.org/exp/32093",
  "substance": "Kratom",
  "views": "13437"
 }
}
