{
 "id": 5365,
 "title": "Etherial Slow Motion",
 "date": {
  "submission": "2007-11-15T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cubbi",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "ml",
    "quantity": "1500"
   },
   "administration": "inhaled",
   "substance": "Ether",
   "form": "liquid"
  }
 ],
 "report": [
  "[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "I was alone and bored and I am not sure why, but I decided to inhale diethyl ether out of curiosity. I always found its smell to be pleasant and attractive. So I simply opened a 3-liter bottle and sniffed it cautiosly. It was about 3pm. In about half an hour I was inhaling it aggressively. I would stick my nose into the bottle, breath in as fast as I could what was probably 90% ether, experience a mild darkness/dizziness/sound wave, exhale in the air and repeat. This continued for at least two hours.",
  "Twice I had to stop and vomit in a sink, but it actually felt pleasant to do so. Somehow a desire formed in my mind to keep inhaling it until I pass out - after all it was used to put people to sleep for operations, wasn't it? I reached that goal, after another sharp inhale the 'moment' of darkness ended with me on the floor unsure how I got there. The now irrational brain chose not to stop and continue breathing ether straight out of the bottle for another hour or so, until I finally stopped.",
  "The liquid in the bottle was 1.5 liters down. About halfway through this something happened to my personal flow of time. My conscious mind was registering events that happened around me and my own actions 10-15 seconds after they would actually occur. Someone called the lab and I had to interrupt to answer the phone. My answers were correct, but I the words registered in my mind way after they were spoken. I put the phone down and later I realized that I did that. I breath more ether and then I realize that I just did that even though I was planning to stop.",
  "At about midnight, when I walked into subway on my way home, everyone moved away from me and left on the next stop, because of the extreme smell of ether which I did not feel. Only in the morning I realized that my room stinks from the smell I brought with me. Strangely enough, the feeling of delayed time stayed with me throughout the entire next day, shortened to only 2-5 seconds, but definitely there. It felt as if my everyday actions, responces in conversations, and pretty much all that I do were done without any actual attention from my conscience. A very unusual mind experience which I don't feel a desire to repeat. It's a little insecure not being able to consciously control my words.",
  "After that day, the smell of ether for me changed, from pleasant to repulsive. It's been over four years and I still can't stand it. Now that I think of it, I had tried inhaling ether before that at least once, but I only had 20-50ml of it, and didn't get that far. And the smell of it remained attractive. Until this extreme attempt. Overall, the experience left an unpleasant memory and I don't want to repeat it."
 ],
 "erowid": {
  "id": "32106",
  "citation": " Cubbi. \"Etherial Slow Motion: experience with Diethyl Ether (ID 32106)\". Erowid.org. Nov 15, 2007. erowid.org/exp/32106",
  "substance": "Diethyl Ether",
  "views": "11513"
 }
}
