{
 "title": "Acid Test",
 "author": "First Timer",
 "citation": " First Timer. \"Acid Test: experience with Methamphetamine & Unknown (Sold as Ecstasy) (ID 53718)\". Erowid.org. Oct 5, 2007. erowid.org/exp/53718",
 "substance": "Methamphetamine & Unknown (Sold as Ecstasy)",
 "bodyweight": "58 kg",
 "report": "<p>Location: SE Asia</p><p>Im finally going to try out this ice that Ive been keeping since Christmas (its June now). Ive been worried about staying up for days, an awful comedown, and stuff like that. Im still a bit worried about it, but I think it should be fine. I have only tried a tiny puff or two before, when I got the stuff, and it has been sitting in my stash box stored in its sealed straw since then. I havent been able to get a proper pipe either, I had the instructions for a homemade one, but I couldnt find the vital glass cylinder for it. So, Im gonna chase it on foil. Not ideal from what I gather online, but it works.</p><p>Before I open the straw, I can see some crystals as well as more powdery stuff, Im supposing it is crushed crystals. The colour is white/translucent, with a little yellow tinges here and there. I dont know how much is in there, but it fills just over 1cm of the flattened straw. As a rough estimate, based on previous experience with powdered amphetamine sulphate (hereafter, speed), I would reckon it could do two or three decent lines, so a *very* rough estimate would be 150mg (I understand that others will have different size lines, etc., but this makes sense to me :). I have smoothed out a piece of foil, made a tube with a banknote wrapped in a cigarette paper. Im going to use my previous experience of smoking heroin to smoke it.</p><p>T+ 00.00</p><p>OK. I tapped it a bit and one crystal about the size of a whopping salt crystal dropped out. A crystal should be pure, so Im gonna go for this one :) OK, a couple of puffs done. As described online, the crystal started melting into a clear liquid. It seems more difficult than smack to chase, the white smoke wifts off and the drop doesnt slide in the same way. Im gonna wait five minutes and see if I feel an effect. At moments like this there is always the auto-high of excitement that can fool me a bit.</p><p>T+ 00.09</p><p>OK. Nothing really. Though my heart is beating a bit faster and I feel a bit of thumping in my head. Here goes for more. 6 puffs no rush. Another couple, I got one good one, I can taste it a bit, doesnt taste of much really.</p><p>T+ 00.18</p><p>More heart beats and cottony head. Gonna finish the crystal. Its sliding a bit, got some more good puffs. Actually the taste reminds me vaguely of smack, but maybe its just the foil :) Smoking shiny side up by the way, Im never sure which side is good. </p><p>T+ 00.26</p><p>Now the crystal is finished. Just went to look at my pupils which seem normal. My dick is the usual (humongous, of course) size. I reckon the environmental cues are not ideal, Im at home with boring TV, normally I only like to do stimulants when Im out clubbing or something. At this point I would go and dance and try to bring on the feelings. Im going to put on Club 54 which should be appropriate. I am feeling something though, slight tightening of the jaws, heart still going, undertones of euphoria, feeling a bit fidgety and thoughts zipping a bit more. Lets leave it for 30 minutes and see. If its as strong as people seem to say, this crystal should keep me going for at least a couple of hours. I reckon for a rush, a proper pipe might have delivered most of that crystal in one go. Its also my first real experience with it, and I find that to know a drug properly more than once is necessary.</p><p>Later tonight Im going to pop a Blue Toyota, actually its more of a turquoise colour, with a Toyota symbol on it. Its this pill that is nothing like E/MDMA really  although its sold as such. It's effect is the closest to LSD that Ive had in years. Very clean too. Up in an hour, peaking in about two, drops very suddenly about five hours after. Im wondering whether the ice will cut into the psychedelia somewhat. Well see.</p><p>Hmm one effect of the ice is that I can feel myself in a big writing mood. I suppose the fact that theres no poor soul around to suffer my renowned wind-baggedness, which stimulants only make worse, means that I have to write in here.</p><p>Yes, definitely having an effect, tight throat (annoying, I often get a sore throat, actually more like a cramped throat), swallowing/gulping and a slightly dry mouth. Im gonna have a soy milk. Keep the beer for later :) Typical! :) I feel the need to go for a walk now  gonna go and get smokes and chewing gum.</p><p>T+01.37</p><p>Well  my manliness is showing the effects :) The amphetamine is doing its usual. The reason why I like and dont like amphetamine is that on the one hand it doesnt fuck with my head which can be good if I just want to get perked up and have fun. On the other hand, it always leaves me with a desire for something to give me an extra kick, which is why we used to neck speed and then go out and get pissed. I could drink loads and get the euphoric feeling of alcohol without the debilitation, I can smoke fat joints and dream and be able to get off the couch. So now Im feeling like, either smoke some more or satisfy the urge with a shot of whiskey. Going for the whiskey right now, Glenmorangie Single Malt,  nice stuff, though its a Sherry Cask version, I always find this type a touch too sweet.</p><p>T+ 01.55</p><p>Definitely feel it running down a bit now. Gonna smoke a bit more, another little rock a bit smaller, gonna try and get it down in one go. Ahhh that feels a lot better! I think that after the first smoke I am primed now, still wish I had a pipe but that did give a little rush. I suppose its firing off those dopamine/serotonin synapses now (or whatever they are). One thing that is different from speed (though its been awhile), is that I am feeling a bit horny, in the E style. Although the balls are a bit tight, there is a tingling on the edge of the balls and top of the dick. Time definitely passes quicker, actually it seems like I dont notice the time much until the higher buzz wears off.</p><p>T+ 03.09</p><p>Here goes for some more, my partner A arrived back home with a bottle of wine in her and well see how it goes. This time there is a bit more than last time, smaller crystals and dust.</p><p>T+ 03.30</p><p>Just dropped a bit more than one Blue Toyota.</p><p>Ice: T+ 04.05 Pill: T+ 00.35</p><p>A took a pill, the same one. I wont say much more about her for the moment, it was a bad idea taking the pill on the wine, and in spite of taking some ice, once it came up she went to bed and eventually went to sleep/lay tripping. Im coming up. We just started watching Fear and loathing in Las Vegas. Its really well done in its portrayal of him tripping when he arrives in Las Vegas.</p><p>Its always the peripheral vision that dissolves and weaves, visually and mentally I can clear a spot in front of me, but it feels tenuous. And now Im watching a film about two crazy fuckers tripping incoherently, Im tripping and the DVD is jumping and making weird sounds. Man, like its on purpose. Freaky. Panasonic hifi systems suck, we keep on having problems with it. I think its the player not the DVDs. Once its been playing for an hour or more the same jumpy, pixellated, useless crap.</p><p>Ice: T+ 04.47 Pill: T+01.28</p><p>Having total trip by now. Visuals of the boiled candy type, art nouveaux translucent panels. Accompanied by the shaky insides. Gotta put music on. Its some pasty easy listening stuff. A is in the bedroom, Im a bit worried (shes now T+1h basically, just coming on strong). But shes fine. Its getting to the point where I either abandon myself to the slidy world and revel in the beauty, or try (illogically) to get out of it. Any control, such as writing, hinders the flow of sensations. I feel kind of horny, but you dont want to see the state of my dick now :( :) shriveled, squashed in itself. Like a raw chipolata.  I want to go and cuddle her. I tried but failed, she is lost in a world.</p><p>These pills are very nice in that I can lie down and close my eyes and drift in a total dreamworld. Similar to my world when Im nicely stoned, the flying where I can control the direction of my dreams, but not the content that surprises nicely and entertains majestically. This is a lot stronger than the dope flight, but qualitatively similar. Very meditative. I just tried getting into a qi-qong position that I havent done for years. And I just slip into it and I can feel the energy flowing, taichi, chi qong, feng shui  there is energy all round us and we can try to harness it, or be part of it. The latter is better.</p><p>When I see the floor in the kitchen swelling I know that it can become scary if my mind goes that way  it is a projection of my feelings. At this point I started having a number of insights into my personal psychology that I dont wish to share here. Suffice to say that they made sense, and looking back I also feel that the ice was helping to keep me somewhat focused, as the trip was pretty strong.</p><p>OK  Ive managed to divert attention from myself there. I feel like trying the mediatation/qi qong thing again, but am scared about where it could take me. So Im avoiding it by writing this, even making mistakes keeps me at the keyboard so I have to be part of it now. My goodness Im having a totally mystical hippy chakra-type experience. By standing in positions, say standing with my hands joined like a typical Krishna, I can feel the energies flowing through me. [more personal stuff follows]</p><p>Ice: T+ 05.49 Pill: T+ 02.30</p><p>Wow! Heavy shit but I love these pills man. Theyre so clean and psychedelic and taking you out there but never totally out of control. I feel the visuals are less now, definitely not intruding as before, but requiring a little relaxation to let them work. Still well in the trip though. Slight squeezing at the back of the head, and the stomach is cramping slightly. Will make a little warm toddy :) And consider making tea or something. A will be getting the same soon I guess.</p><p>Ice: T+ 06.16 Pill: T+03.01</p><p>Definitely feeling a drop now. Also getting some anxiety, I dunno if its the ice wearing off or the pill or what. Might also be something to do with the fact that I am sitting down, I get the feeling like if I was up and doing some running or something I would feel better. Or dancing of course, which would be the usual: go and face the wall, or better, the speakers, and dance to forget the unhappy feelings.</p><p>Ice: T+ 06.48 Pill: T+ 03.33</p><p>Right on cue As having stomach cramps and rushes to the toilet. Thats something about these Toyotas, they must be very pure or something as the effect is very consistent, she took the pill one hour after me and is having cramps one hour after me.</p><p>Ice: T+ 07.41 Pill: T+ 03.26</p><p>Pretty much over now, though there are still some nicish bits left but As not taking it too well and Im feeling a bit guilty for her.</p><p>Ice: T+ 08.45 (not counting the pill any more, times are approximate from here on)</p><p>After hesitating a bit I smoked some more, a similar amount to before. No particular rush or anything, and it is a hassle to smoke on foil. I still feel awake, and it is different from speed where by this time I would be feeling very cranky, and rushing up and down. This ride is a lot smoother I must say. I reckon I have not taken very large quantities: the straw is barely touched. Its a pity, I really just wanted to finish it off or something so that I wont have it hanging around any more. But I dont see myself smoking it all, no way Jose. I am checking online and there are the usual stories of being up for days, and not eating or drinking for days etc. I have had some breakfast, I didnt really feel like eating, I could feel my stomach was empty (growling) rather than feeling hungry. So I had some toast and tea and no doubt am better off for it. I made some fruit juice and when I drink it, it tastes of ice. Which, in a revision from earlier, Ive now decided that it has a classic bitterish/flat speed taste, only not so strong.</p><p>T+ 11.00</p><p>Hmmm reading online. Most people describe how they try or buy a bit, then get hooked into a cycle of going back for more. Some keep going for days until they have to stop because of their physical and mental state (dehydrated, paranoia, etc.), so it seems like its not like you take a bit and cant sleep for days, but that you start taking it and then cant stop yourself. Which is bit what is happening to me, as I am already planning to smoke some more. My excuse is that I cant go to bed now, so I need something to keep me awake until I sleep in the early evening. I guess the acid test will be when I reach the point of OK, now I can allow myself to get sleepy, if I then start thinking of reasons to take more, Im in a potentially dangerous loop. But I cant afford not to get a good nights rest, as Ill need tomorrow (Sunday) to do a relaxation/no drug day, before I go back to work on Monday. Basically, well see how my addictive instincts respond to the closure point. One thing is though, Ive never been such a fan of stimulants for stimulants sake. And the idea of being up for days masturbating my brain until it starts dissolving does not appeal to me at all.</p><p>T+12.15</p><p>Smoked some more. Not a lot, but I can feel that the effect is less than at first, so I think there is a certain amount of tolerance already. I then went and raked the garden, made breakfast, tidied up the bedroom, watered the plants, tidied up stuff in the garden. A woke up feeling rough, but seemed amused at my offer: If theres anything you want doing around the house, nows the time.</p><p>11.30 (been tweaking for more than 12 hours now  got the times wrong somewhere)</p><p>Just smoked some more. I reckon that I have smoked 1/3 of the straw now. I can definitely feel fatigue setting in. I take a quick break to make myself vitamin drink with re-hydration salts. The energy from each smoke lasts less time each time, Im also getting an occasional cramp in my foot. Also getting a little rushy, by which I mean theres a tendency to get a sudden down, mentally speaking. Just a feeling of unhappiness and anxiety for no particular reason. The way to deal with it is to recognise it as chemical, shunt it to the side, and do something to keep occupied.</p><p>After the above entry I stopped keeping a log.  Now I am safe in a lovely hotel room, we had planned a little weekend break thing. Here is a summary of the day since above, times and other details remain approximate.</p><p>c. T+ 12.30: I notice the tolerance has built rapidly, reduced space between doses and reduced effect even with higher doses.</p><p>c. 14.00 T+ 14.30 We eat Japanese lunch, usually we like sashimi but this time we both dont like the idea. We eat sparingly, about one and a half portions rather than a usual meal. I have a beer, which is nice, meth seems to all drugs in idiosyncratic manners. Though I am sleep deprived I am not feeling it, but my brain is surely running low on whatever necessary things that are recharged when I sleep.</p><p>By the way, a precursor to the acid test on habit forming happened as we left the house, A checked whether I was bringing the stash and I asked everything?, she said yes and I used this as an excuse to bring the ice, which in theory I was not meant to smoke at the hotel, though rationalisation helps desire by reminding that it didnt mean we had to smoke there.</p><p>c. 16.30 T+ 16.00 We arrive and check in. Great suite, a present from good friends. The rooms are scattered around the luxuriantly landscaped gardens, one story chalets with four rooms at each level. Four-poster bed, kitchenette, all the usual in a tastefully decorated room.</p><p>c.17.00 T+ 16.30 We smoke some more. Then we decide to finish it all off, and cane it in about an hour, then smoke a joint (grass) and go to the pool and have a nice time.</p><p>c. T+ 18.30 We get back to the room, smoke some more grass and have some great sex, though I am having difficulties getting to orgasm (she has no problem though :). There is a lot of pleasure, but I cant quite get there. Eventually I do, and it is good.</p><p>c. T+ 20.00 We eat room service, then get into bed and watch a movie on the computer. By this time I am getting pretty scatter-brained, forgetting what Im doing and talking in half sentences. Sleep deprivation sets in I suppose.</p><p>c. T+ 25.00 We go to sleep. One thing I was reminded of was how when I am at the tail end of amphetamine-type trips, I can stay up quite easily, but actually with a bit of effort I can also sleep. The trick is to make up my mind that I want to sleep, and purposefully stop my mind wandering into thoughts that might keep me awake.</p><p>Ive never been a super fan of amphetamines, they are more like an accompaniment to what to me are more rewarding drugs such as psychedelics. Ice ended up seeming like cigarettes in a way, I keep taking it because it helps me feel more normal (i.e. it staves off unpleasant withdrawals), but the effect in itself is not vastly rewarding. Having said that, I did feel a definite increased ability to concentrate and just get things done as soon as I decided I wanted to do it, and I can see how it would help someone needing to do work. However, remember: whatever goes up, comes down, and although the come-down wasnt as bad as some speed come-downs Ive had, I was very tired for two days after that, in spite of sleeping, eating and drinking as much as possible. The day after I was very dehydrated, and kept on drinking water all the time. Monday at work was pretty flaky, and I struggled to get through the day.</p><p>Thats it.</p>",
 "year": "2006",
 "id": "53718",
 "gender": "Male",
 "timestamp": "2007-10-05T07:00:00.000Z",
 "views": "16302",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 3:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Unknown",
   "form": "(pill / tablet)"
  }
 ]
}
