{
 "title": "A Completely New Reality",
 "author": "Crazy J",
 "citation": " Crazy J. \"A Completely New Reality: experience with MDMA (Ecstacy) (ID 53722)\". Erowid.org. Dec 3, 2008. erowid.org/exp/53722",
 "substance": "MDMA (Ecstacy)",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "MDMA",
  "(powder / crystals)",
  "",
  " repeated",
  "insufflated",
  "MDMA",
  "(powder / crystals)",
  "",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)",
  "",
  " repeated",
  "insufflated",
  "MDMA",
  "(powder / crystals)"
 ],
 "report": "<p>I was in las Vegas for a music festival.  I had never done E before, but I had been eating/blowing Mali all day.  At the time, I had no idea the normal dosage, so I was pretty much doing it like coke.  When my bag was out, someone handed me an E pill.  It started as the classic first roll experience as far as I've heard.  The music was incredible.  Someone gave me a backrub while listening to arcade fire, someone gave me glowsticks at the Widespread Panic show, I've never been happier.</p><p>There's a few blank spots in my mind, but I know I ended up back at my hotel room and someone handed me another bag of Mali and told me he was a licensed massage therapist who had studied for years in India and to blow the bag and I'd get a massage.  After walking for days, the massage probably would've felt wonderful, but on top of the drugs, I figured out why they call it Ecstacy. </p><p>We hit the town and suddenly I started to trip balls.  I've done a lot of acid, done some mescaline, eaten some crazy shrooms, and never tripped this hard in my life.  All the trees became people with their faces painted gold with crazy costumes on.  I honestly didn't know the difference between reality and my hallucinations.  My cigarette smoke became solid people that I would have to ask someone I knew was real if they were real or not.  The entire time, it didn't bother me.  Even though I didn't know the people I was hanging out with, I knew they had tripped before and didn't think I was crazy.  I still had never been happier.  I remember asking one person if he had a book written on his arm in strange heiroglyphics, when I realized everyone had those strange patterns all over them, I apologized to him and explained I had eaten a lot of drugs and was hallucinating.</p><p>I also remember walking down one road and saying 'We can't go down this street, it's too shady.'  I was told there was no one on the street but us.  I tried to ignore the tree people, but peered hard at all the people lining the streets in benches, none of them happy, all staring into space, waiting for something.  As we passed them they would vanish in my peripheral vision.  That was the only time I got a little freaked out.</p><p>I've never heard of anyone having these visions just from E.  I know the shit we were getting was good and didn't have anything else in it. [Erowid Note: While it may be that the substance described is purely MDMA, Ecstasy tablets are notoriously impure or misrepresented, often containing chemicals other than those they are presumed to contain.]    Everyone I was with had the same stuff, but they had all rolled before and didn't hallucinate like I did.</p>",
 "year": "2005",
 "id": "53722",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-12-03T08:00:00.000Z",
 "views": "6595",
 "dose": {}
}
