{
 "title": "Tickets for the Art Show",
 "author": "Axel",
 "citation": " Axel. \"Tickets for the Art Show: experience with LSD (or DOC?) & Cannabis (ID 53766)\". Erowid.org. Jan 3, 2008. erowid.org/exp/53766",
 "substance": "LSD (or DOC?) & Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   " T+ 2:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   " T+ 0:00",
   " repeated",
   "smoked",
   "Cannabis - Hash",
   "(plant material)"
  ]
 ],
 "report": "</p>[Erowid Note: This report is marked as an LSD report, but readers should be aware there are aspects of it that suggest the identification is speculative. The 'bitter taste', long onset of effect and duration of effect are more in line with  some of the longer-lasting psychedelic phenethylamines. DOC is a likely candidate.]</p><p>Ah... to describe the totally indescribable.</p><p>At long fucking last, high school was over. After 13 long years of going through the motions associated with the lackluster American education system, I was finally, FINALLY free. The night that ensued was easily the most mind bending experience of my life. Matty, Brad, John, and I had tickets to the Moe. show that night, and I couldnt have been more ecstatic to end an early chapter of my life by going to see one of my favorite bands play live. Little did I know how just ecstatic that night would leave me.</p><p>Checked my messages on the way out of Spring-Ford... Brad.</p><p>'Hey man. Before we head up to philly, I'm stopping by the art show.' I was utterly confused, until, 'My uncle 'cid has some paintings in it, should be pretty amazing, man, its like, 5 bucks a ticket, but I dunno, you might need two of 'em to get in. Hit me up when you leave school so I can pick you up a few if you want them.'</p><p>Ah! It was like that. The dread LSD had finally found an entry point into my life, and I was more than eager to let it in. I had quite a bit of experience with potent psychedelic drugs up until that point, Mushrooms, Salvia, MDMA, DiPT. So I figured, why the hell not, its nothing I havent experienced before. God, was I wrong. No quarter of shrooms or hit of salvia could have EVER prepared me for what I was to experience that night. Every aspect of the whole trip was nothing less than mindblowing, and I couldnt have been more grateful.</p><p>As soon as I got into Brad's car around 2:30pm, I ate my first tab. It was a little bitter and caused me to clench my jaw a bit. Johnny and Brad both popped one as well. The car ride up was filled with mass anticipation and an overall sense of foreboding uncertainty. I mulled life over in my brain again and again, and I had the faint feeling that I was about to have the best night of my life. Around 4:30 we were sitting in his car in the pier parking lot puffing some hash, and I was starting to feel cheated. Two hours and NOTHING. I was beginning to understand why I might have needed more than one ticket for THIS show. So I threw Brad another five and plopped another piece of the tye dyed paper on my tongue. So did Johnny.</p><p>Knock on the window, event staff. He says we have to leave the parking lot,  and its fucking pouring outside, and the concert doesn't start until six. So we get out and walk up and down Penns landing for a little while. Time is distorted, the walking seems to go on forever. Finally, tab one is kicking in. The rotating Dave and Buster's sign seems so surreal, flowing puddles of water on the sidewalks appear as ice patches. I cant help but be reminded of 'ice nine' from Kurt Vonnegut's Cats Cradle, so I make a game out of avoiding them.</p><p>I feel like a child, equipped with a sense of wonder and disbelief that I have never experienced before, and it's totally amazing. We walk and walk and walk and never stop. 2 blocks feels like miles. Finally we're back at the gate and the rain's done, so we go in. Some guy with a clipboard comes up to me and asks me if Im registered to vote. I laugh and tell him no. He seems so funny. So I register to vote just 'cause I'm on acid. We go around the fence and stand right in front of the stage. I keep seeing people's faces in a new light. Everyone has a uniform quality to their features, almost rat-like in appearance.</p><p>The band playing is called 'The Breakfast' and their riffs are ripped straight outta Zeppelin, but despite the lack of originality, they couldn't have sounded more... interesting. When their set is over, the North Mississippi All Stars take the stage. I never heard of them before, but after that set, they were destined to become one of my favorite bands of the modern day. The singer comes out with a broomstick attached to a cigar box with two strings on it, which, somehow makes one of the most amazing musical sounds I have ever experienced. It's like an atonal dobro and the pitch and tone stretches from low to high so fluidly and beautifully. its warped. I grab Matty's shoulder and scream out my excitement. 'Do you fucking SEE that!? its a FUCKING CIGAR BOX, MAN!!! INCREDIBLE!!'</p><p>'It's not just that man,' he says, 'its Andy.' I look at the guy again and lo and behold, it fucking IS Andy. My best friend who had moved away two years before. Every aspect of the guy's features, his facial expressions, his hair, clothes, and especially his aviator sunglasses, IS my lost friend. The rafters of the stage are rotating and shrinking and caving in and the music is so... different. It's backwards, forwards, fast and slow at the same time. Its perfect. Pitches drop and rise, tempos cease to exist. Theres no form or structure, no rhyme or reason. I cant help but laugh at the sheer intensity of it all.</p><p>The drummer looks like a little kid, with giant drumsticks like those Chong had at the end of 'Up in Smoke' as the drummer of Alice Bowie. Wonderous, simply wonderous. At times, its almost overwhelming. They jam so long that my mind takes frequent stops to try and catch up. Suddenly everything is just slowed down, mouths dont match up with voices, fingers run across guitar necks but the sound that comes out is just simply unrelated... then, bang... back to normal. Every time a song ends, I snap partially back into reality. I can speak again, control my thoughts and actions. The music is taking me to another level of sensory perception, sensory overload it would seem.</p><p>Between bands, some old guy comes up and starts talking to us. I pull out my wallet and look at my ID. 'Checking yourself out, huh?' he asks me. 'I guess so. I just feel like looking at it.'</p><p>'Yeah, sometimes ya just need to check yourself. Find out if you really know who you are. Do you? Do you know who you really are, I mean REALLY?', he asks. I know hes fucking with me because he knows I'm on acid, but it makes total sense. Thats just what I'm doing.</p><p>Moe. finally takes the stage. The ensuing two sets are an absolute blur of sensory stimulation. The light show encompasses the whole venue, the whole sky. The music slows down and speeds up at will. I can only make out a few songs. I know I hear Kids, Plane Crash, maybe I heard Not Coming Down and Akimbo but Im not totally sure, Nebraska, Crab Eyes, they're all there in my head but Im not sure if they played them at all.</p><p>Rob's bass swirls and glows in a way that natural wood shouldn't. His body and his bass are one. He's a cartoon character and his face stretches and distorts. Suddenly he's like a garbled image on a tv screen. Static, wavy, and off-color. I look over at Al, who, at this point, is none other than Dr.  Hunter S. Thompson with a guitar in his hand. I can hardly take it. I guess I make some kind of noise after Plane crash, and Matty looks over and asks me 'Intense, huh?' I jokingly tell him that it might just be too intense, and we both laugh.</p><p>Toward the end of Moe.'s second set, sound, sight, smell, touch and taste all become one singular sense. Everything that I am sensing is part of one giant indescribable FEELING. The lights are tye dyed, striped and amoebic in nature, stretching and moving, bending to my will. Bass booms in my head, stretches my eardrums outward and my brain trembles in my skull. I feel almost like I'm going to die from sheer elation, right then and there, or that for some reason, I never existed as a human being to begin with. Like I'm some kind of entity comprised of antimatter, standing outside my own body. Moe. plays Bruce Springsteen's born to run, which is the most pleasantly unexpected thing to ever happen, and I hate that song.</p><p>Finally the show ends and we shuffle towards the gate. Matty says we are going to his sister's apartment to smoke some weed. We get there and it's the most incredibly strange place I've ever been to. The hallway of the building is ancient with those kind of stairs that twist at the bottom. It feels like Ive never seen anything like them before. When we get inside her apartment, I finally enter a state of complete clarity and cohereance. I can control my thoughts and actions like never before.</p><p>Her curtains are fluttering in the absence of wind, and I cant decide whether they are blue or green or yellow. They're all three at the same time. The TV cabinet glows in technicolor, multifaceted hues that I never knew existed. On the screen is The Village. Characters stretch and warp. Their hair stands on end and then almost pops off out of the screen and into the room. The bare trees of the forest are complex geometric patterns, three dimensional and unbelievably brilliant and colorful. There are two cats sitting on the spiral staircase to the second floor. Their eyes shine crazily, brilliantly. They start chasing each other all over the room and I follow them everywhere with my eyes.</p><p>We talk and talk about the craziest things. Everything that is said is incomprehensible and just so interesting. I ask Matty about the movie. I want to understand it, know the concept of it, the plot. He explains that, since the 1600's the 'elders' of the depicted society had kept everyone in constant fear of 'monsters' in the woods, going so far as to sacrifice animals and scatter the carcasses around, and to wear horribly detailed costumes to scare the villagers into never venturing outside of town, and thus, allowing them to continue on as a technologically inept colonial society. Eventually a girl leaves in order to get medicine for her brother, who is violently ill. She finds herself at a gigantic wall and climbs over, only to find that it is the year 2004 on the other side. After he explains it, I stop watching. The storyline seems too mindblowing, too incomprehensible, to actually watch. I suddenly get cold and grab a blanket. Then, two seconds later, we leave. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>In the car, I feel like Im perfectly normal again, until we hit the tunnel to route 76. As soon as we enter it, it stretches to an immeasurable length and everything looks like a racing video game. Like Need for speed underground. The car itself stretches and proceeds to extend outside of the confines of space and time. Spaces between cars are also immeasurable and I keep asking Brad how he drives on this drug. He tells me 'experience', and I'm forced to believe him just so that I dont get too scared.</p><p>When I get home, I go directly to my room and turn on the TV, and watch camp lazlo, which is, on this particular occasion, the BEST cartoon I've ever seen. The storylines are simple to follow and I like that, because I can totally understand them. I look at my posters. The Beatles' faces twist and distort. My poster of a cat hanging from a rope with the caption 'Oh Shit!' is unbelievably amazing. The cat keeps decaying away like a rotting carcass before my eyes, but it isnt scary, its just beautiful for some reason. The Grateful Dead stare down at me from their arm in arm circle (that picture from 1967 where they're all standing in a circle looking downward at the camera), and their eyes, particularly Jerry's, are like those of animals. I think to myself 'they're on acid, too... right there in that picture... they were the KINGs of this drug...' and smile inside.</p><p>The already distorted Alice Cooper Group poster on the adjacent wall distorts and melts even more, becoming even more colorful and bright, and all my drawings take on a new life. I cannot sleep because every time I close my eyes I'm overwhelmed with that singular sensation again, touch sight sound smell and taste are all one again, so I just sit up and enjoy the last of my trip. At 11 AM I decide to go to my friend Colin's house, but Im unsure of driving. Sure enough, its an experience. I have no depth perception or sense of speed, and my speedometer is so unreadable that I can barely comprehend it. Almost 24 hours after eating acid and Im still far gone, and beginning to wonder if Ill ever come back.</p><p>I get to Colin's and we smoke a bit of pot, and all of a sudden, things are 'normal' again. Or as normal as I can perceive them to be. I begin to accept that I've entered a new reality and that I must adjust to it accordingly. I start to get tired and go back home to sleep, which takes 2 hours of catatonic laying down to finally arrive. I wake up 4 hours later and its all over.</p><p>WHAT A FUCKIN EXPERIENCE!!</p>",
 "year": "2006",
 "id": "53766",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-03T08:00:00.000Z",
 "views": "23561"
}
