{
 "id": 5379,
 "title": "Mix Between a Baby Talking and a Bird",
 "date": {
  "submission": "2009-11-07T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jayke",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": " Dexmethylphenidate",
   "form": "pill/tablet"
  },
  {
   "time": "5:00",
   "amount": "15 mg",
   "administration": "oral",
   "substance": " Dexmethylphenidate",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Focalin induces euphoria and causes me to be absorbed and enthralled with something as simple as talking to a friend online, or listening to music.  But when I took too much within one day it was fairly frightening and painful.",
  "As of the past year or so I've been a big fan of Atterall, and I find it being my favorate drug as of yet.  But just this week my friend introduced me to these little yellow 5mg pills called Focalin, which he has prescribed to him for his severe ADD.  He told me if I liked atterall that I may like these, if per se they work on me, because he's given them out before and his friends said they didn't nothing to them.  Well, since he doesn't usually take them he gave me a handful of them, I put them in my little pill-piano on my desk when I got home.",
  "I had never taken any other sort of ADD medication besides atterall, not even ridalin, and I decided to look up what exactly Focalin was, and found that it was like ridalin but stronger, so I was a bit anxious to try some.  I took two 5mg pills, and waited for the effects.  Usually pills kick in for me pretty quick, and I noticed myself becoming a bit energetic and euphoric, much like on atterall.  The effects only lasted a mere hour, and I got a bit tired afterward.",
  "This morning, after I woke up, I took four 5mg pills (20mg) and it was fantastic.  I felt like I was on atterall.  I felt highly euphoric, and found myself very easily absorbed in things, and very conversive.  I talked to a friend online for an hour straight.  My hair felt like it was tingling, and I found myself completely enthralled with everything I was doing, and it made my concentration level soar.  Sadly, the peak only lasted about two hours tops, and after that I got a bit depressed, but only because I wanted it to last longer.  I noticed the drug wearing off because I was starting to get bored, and my euphoria was slipping.  The effects I felt afterwards were increased energy, and some tingling in my fingers and scalp.",
  "I waited five hours and took another 15mg, and didn't really notice anything happening.  After about 20 minutes I started to feel really warm, and my face became red, and my forehead was burning up.  My body started to feel a bit numb, almost elevated, and I started to feel out of body and I started to panic a bit.  I quickly looked up the symptoms of overdose and I had only a handful of them, and they weren't extreme.  I'm still feeling the effects as I type this.  Behind my left shoulder keeps twitching, and my bicep and inside elbow of my left arm are tight and feel a bit painful.  I was in the bathroom taking a dump and I heard outside the bathroom door what sounded like a mix between a baby talking and a bird.  I then realized it was the dog next door barking, but the drug affected my auditory functioning.  I find myself seeing small blips of light out of the corner of my eyes, and things shifting, and I am lightly going in and out of consciousness."
 ],
 "erowid": {
  "id": "32144",
  "citation": " Jayke. \"Mix Between a Baby Talking and a Bird: experience with Dexmethylphenidate (Focalin) (ID 32144)\". Erowid.org. Nov 7, 2009. erowid.org/exp/32144",
  "substance": "Dexmethylphenidate (Focalin)",
  "views": "21759"
 }
}
