{
 "id": 5380,
 "title": "Sonata Sonnet",
 "date": {
  "submission": "2007-06-22T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Guilford",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Zaleplon",
   "form": "capsule"
  }
 ],
 "report": [
  "I put this on record as an interesting substance to be treated with caution. As a life-long insomniac I've tried various pharmaceuticals, always with limited success. Any sleep medications, I've found, have only short term value. I tried Sonata for the first time in November of 2003, and swallowed one 10m mg. capsule at bedtime, about 11 PM. I woke up, predictably, for me, at about four the next morning, clear headed, and lay in bed until six when I had to get up. The next night I did two capsules with more or less similar results. I concluded I had wasted about $150.00 on my 30 capsule supply.",
  "On an impulse, on the third night, I emptied three capsules of their powder onto a clean surface and snorted it. There was no unpleasant sinus reaction. Soon a euphoric feeling, not unlike alcohol, permeated me. This was pretty nice. A clean feeling without the alcohol fullness. It was not bedtime, and after a couple hours the feeling had left. I went to bed with the help of a 10 mg. Xanax. The next night I snorted three Sonata early in the evening, and when the feeling began to taper off I repeated the dose. The effects were mildly hallucinogenic, with a visual rippling effect, a sense of well-being, and an odd calm. I repeated these evening experiments until the 30 pills were gone, and thought no more about the drug for a few months.",
  "Since then, I have ordered amounts of Sonata on several occasions. Health insurance or not, it is quite expensive. I've found that larger and more frequent snorting causes clumsiness, loss of spacial awareness, and, on occasion, dramatic hallucinations. A weasel-like beast with hypnotic eyes hiding under my couch turned out to be an umbrella. Sitting at my keyboard, writing, I had the sense, at the periphery of my vision, that I was on a Caribbean beach, in bright sunlight. Actually, it was winter in a northern state. I have looked at things that I have written under Sonata's influence and been very distressed by the complete loss of fluency and coherence. I have never consumed alcohol during these experience and believe that to do so would be dangerous.",
  "I have concluded my experiments with this substance. Its medical value is nil, its abuse potential extreme. And, as I have said, for a 'mild' sleeping pill, it is quite expensive, with no available generic version. It exerts an attraction, and, for a short while, takes an effort of will to abandon. But my partner does not like the glassy-eyed, clumsy, and dim-witted effect it has on me, and has discouraged my usage of it. Correctly, I guess. That's my experience. Take it for what it's worth."
 ],
 "erowid": {
  "id": "32146",
  "citation": " Guilford. \"Sonata Sonnet: experience with Zaleplon (ID 32146)\". Erowid.org. Jun 22, 2007. erowid.org/exp/32146",
  "substance": "Zaleplon",
  "views": "10702"
 }
}
