{
 "id": 5381,
 "title": "Lasting Coricidin Problems",
 "date": {
  "submission": "2001-12-23T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TJ",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "32 tablets",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "substance": "Acetaminophen"
  }
 ],
 "report": [
  "Last week I endured the most unbelievable experience of my life.  I decided to go all out and get really fucked up.  A few weeks before I had taken these pills at a party and I enjoyed them very much.  But I wanted to see what they could really do by going to the extreme two boxes of them instead of one. At the time I had no idea what I was getting myself into.  The first time I took 16 and yes, it was very crazy, but nothing compared to my next trip.",
  "It all started by me and my friends sitting around with nothing to do, and we had just spent the last of our money on a bag, which we had smoked hours earlier.  So we were trying to think of a cheap way to get high without doing the normal, e.g. huffing gas, glade, or other household materials.  And I convinced all my friends that if we could get some coricidin cough and cold pills I could guarantee them all that it would be the most crazy trip they had ever been on. So we went to a local grocery store and my friend M stole 6 boxes of them.  We got back to my house and distributed to boxes out to everyone.  The two girls there didnt want to take 16 so they both took 8 leaving 16 extra.  So I decided to take the extra 16 pills, not really know what would be different from my first trip and not really thinking about there being a difference.",
  "I took the pills and within minutes my stomach was starting to hurt.  I threw up about 20 minutes after taking them and the second after I was done puking I fell back, or atleast it felt like I fell back and I was gone.  I mean I was completely out of it.  Everything I had ever known, cared about, or even thought about were gone.  I felt like all my actions were opposite of what I was trying to do. I tried to walk forward and I would walk backward. I tried to close my eyes but I still saw images.  This really started to scare me. Though I had no sense of who or what I was, I was in a mind state of complete paranoia. I felt like everything was wrong, and it was gonna stay this way forever.  fter about 2 hours of this madness I could finally stabalize myself enough to walk to my bedroom.  I payed no attention to anyone else, I really dont remember even seeing anyone in the room. When I walked, I felt like I was off-balance. Like I was walking on a ball the was spinning under my feet. I got to my bed and layed down.  Right when I layed down I start to fall and this feeling last about 5 minutes until I exploded into a million peices.  Then I was sucked back into my regular form and I was sitting in the audience of a television show and I was watching myself as the actor. I tried to yell but I couldnt move. I was froze. From then on I dont really remember much except, if I was to fall asleep I would just wake up feeling even more weird then before. I finally did fall asleep and the whole next day I was weirded out. I didn't get visuals but I didnt feel like a human being.",
  "I dont know if I will ever do them again, and I do not recommend taking this amount to anyone. I know it sounds awesome but it was the biggest drain on my mind I have ever felt.  I still dont feel mentally stable. I dont really have emotions any more.  I do not recommend these pills to anyone."
 ],
 "erowid": {
  "id": "3215",
  "citation": " TJ. \"Lasting Coricidin Problems: experience with Acetaminophen & Chlorpheniramine (ID 3215)\". Erowid.org. Dec 23, 2001. erowid.org/exp/3215",
  "substance": "Acetaminophen & Chlorpheniramine",
  "views": "20829"
 }
}
