{
 "title": "Intense Augmentation",
 "author": "Phenethyla-Man",
 "citation": " Phenethyla-Man. \"Intense Augmentation: experience with Amphetamines (Adderall) & Tryptophan - 5-HTP (ID 53841)\". Erowid.org. Oct 24, 2006. erowid.org/exp/53841",
 "substance": "Amphetamines (Adderall) & Tryptophan - 5-HTP",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Tryptophan - 5-HTP",
   "(daily)",
   "",
   "60 mg",
   "oral",
   "Amphetamines",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2006",
   "53841",
   "Male",
   "",
   "Not Given",
   "Oct 24, 2006",
   "36797",
   " "
  ]
 ],
 "report": "<p>Background</p><p>Age: 17</p><p>Race: Caucasian</p><p>Previous experience with psychoactives: Extensive marijuana use (At one point, several times daily for several months), frequent and often high-dose use of amphetamine, usually Adderall (100mg+ dosages, crushed to prevent time-release, sometimes going on 3-7 day 'runs'), dabbling with opiates (Few, scattered run-ins with hydrocodone), and occasional use of OTC products such as DXM and diphenhydramine.</p><p>I've read a few scattered experience reports on 5-HydroxyTryptoPhan (5-HTP) and its interaction with various amphetamines, mostly MDMA. However, with only one exception that I can recall, the 5-HTP was taken in large doses (400mg+) shortly before ingesting the drug. Many of those experiences were negative, with many rollers/speeders vomiting or having a mentally difficult time.</p><p>However, 5-HTP still intrigued me, since its purported ability to kick-start the brain's production of serotonin would theoretically improve the experience of some phenethylamines. I wondered if perhaps massive pre-loading shortly before ingestion was not the best route.</p><p>About three weeks ago, I was confronted by my parents with weekly drug testing. Making the best of a bad situation, I abstained from amphetamine use (In addition to all other drugs), hoping to remove my tolerance and to experiment with 5-HTP. I bought ninety 50mg capsules of 5-HTP and started taking three per day.</p><p>After just a few days of taking the supplement, I noticed signs of increased levels of neurotransmitters, assuming serotonin. My mood, which had until then been heavily depressive for about a week, became significantly elevated, and my social life and performance and work improved. Also, a persistent, annoying twitching of the muscles around my left eye faded, and had soon nearly vanished. I also noted increased energy and motivation. I must consider that the effects may have been placebo, because I had anticipated, should the 5-HTP do anything, results somewhat like that. I doubt the placebo theory, though, simply because in my previous experiences, I could not even induce placebo effects, nor have I ever been able to 'Catch the high' simply by being with intoxicated people.</p><p>Those effects continued unabated for several weeks. I judged that I had given the 5-HTP enough time to work, and that I could test its effects on amphetamine. One night, immediately after the weekly urine test, I went into my room. I ground up the contents two 30mg Adderall XR capsules, and ate the powder with the aid of a few sips of water.</p><p>The effects were slow to come on, taking nearly half an hour to present themselves at all, and a full hour to reach the peak. I was for a few minutes worried that I would experience the dampening of effects reported by MDMA users who had pre-loaded with 5-HTP. That worry was replaced in due time by a genuine speeding experience. My senses, mood, energy, intelligence, and appreciation of music were all highly elevated, and my inattention and appetite were equally suppressed. That is all normal. What was not normal was the level of the positive and negative effects. This 60 milligram dose felt as powerful as a dose of 120mgs that I had once taken after a similar period of abstinence. That powerful feeling was this time accompanied by no jaw clenching, few and easily-controlled obsessive behaviors, and little abnormal jaw movement while talking. The experience was qualitatively far 'cleaner' than all previous speeds, save only for my first time.</p><p>The peak was abnormally long, nearly five hours, and the come-down was far more gradual than usual. Consequently, coming down was much easier to handle, and I experienced no cravings to re-dose. I did experience some jaw activity (clenching, bruxism), but they were minimal and are usually heightened on my come-downs. The post-speed experience, usually manifested by temporary alternating hypomania and depression, was nonexistent. The day after and even the day after that, I felt normal, even in spite of an *unexplained* lack of sleep.</p>"
}
