{
 "id": 5385,
 "title": "WAY Too Much",
 "date": {
  "submission": "2004-06-07T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "prime",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25"
   },
   "administration": "insufflated",
   "substance": "2C-T-21",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25"
   },
   "administration": "oral",
   "substance": "2C-T-21",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I received what I thought was a single dose of 2C-I. Not having experienced a 2C chemcial before, I was very eager to try it out. So I divided the powder in half and insufflated one pile and put the other in some tissue and ingested it orally.",
  "What I didn't realize was that I had just taken 50mg of 2C-T-21. The experience wasn't overly frightening at all, though the trip had a dark feel to it. The body load was intense and my heart raced very fast. I tried my best to stay calm and ride it out. I had very intense visuals and sound hallucinations. The whole trip was VERY clear. I felt a sense of well being and conversation was intriguing. Objects had a digital overlay on them and all objects would ripple and shift endlessly. I became very restless and agitated as the day wore on. The trip started at 10am in the morning and continued for the majority of the day. That night colors were still very vivid and sound was deep and echoing. I slept restlessly and had very realistic nightmares. The next day colors were still vivid and sound isn't quite right.",
  "This is the 2nd night since the dose and I still have these symptoms. I have no clue what permenant damage I have done, but let this be a warning to all: measure your own dose! Do not trust anyone's measurement but yours when using research chemicals."
 ],
 "erowid": {
  "id": "32162",
  "citation": " prime. \"WAY Too Much: experience with 2C-T-21 (ID 32162)\". Erowid.org. Jun 7, 2004. erowid.org/exp/32162",
  "substance": "2C-T-21",
  "views": "12636"
 }
}
