{
 "title": "Profoundly Altered",
 "author": "JohnnyMarbles",
 "citation": " JohnnyMarbles. \"Profoundly Altered: experience with Cannabis (ID 53850)\". Erowid.org. Mar 30, 2008. erowid.org/exp/53850",
 "substance": "Cannabis",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  "1.0 g",
  "oral",
  "Cannabis",
  "(tea)"
 ],
 "report": "<p>Just a few weeks ago, I decided to have a little 'going away' bakeout for my cousin (let's call him S), as he was moving back home. We got a little over an 1/8 (I'd say 4.5 grams). We proceeded to kick off the evening with countless bowl and bong hits, and we were fairly stoned when we had the bright idea to make cannabis tea. I had read and heard about it, never experienced it first hand. As a fairly experienced drug user (smoke weed daily, shrooms, DXM, painkillers, plenty of alcohol), I can honestly say that the tea has a different, more profound effect.</p><p>We began by boiling water and putting approx. a gram of weed in each cup. We mixed evaporated milk in the pot when it began to boil (lipids absorb more THC). When the white concoction was boiling well, we poured it directly on the bud in the cup. I stirred vigorously, and took a taste sip. Tastes just like you would imagine. I mixed ground cinammon, plenty of sugar, and some more milk. I stirred continously for about 10 minutes, and took a sip. Not bad! I made S a cup, and we proceeded back downstairs and drank our tea within 5 minutes.</p><p>After a good solid 15 minutes of listening to music and waiting to come up, I decided to pack a bowl in the meantime. When I stood up to find my piece, I realized I was profoundly altered, but in a clearheaded way (kinda like smoking good headies). No paranoia, heavy feelings. Very euphoric,  kind of trippy, but didn't muddle your mind. It's very different than smoking, and it's definetly worth a shot. As for S, well, he passed out about 10 minutes after peaking on the tea. It's damn potent.</p>",
 "year": "2006",
 "id": "53850",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-30T07:00:00.000Z",
 "views": "6840",
 "dose": {}
}
