{
 "title": "Trying It Out",
 "author": "Leo",
 "citation": " Leo. \"Trying It Out: experience with Leonotis Leonurus (ID 53889)\". Erowid.org. May 30, 2008. erowid.org/exp/53889",
 "substance": "Leonotis Leonurus",
 "bodyweight": "72 kg",
 "report": "<p>I recently bought a load of legal herbs that I had always wanted to try out from an online retailer. The most promising herb in the package was Leonotis leonurus, lion's ear, of which I had about 20g of dried flowers.</p><p>With my girlfriend as co-experimentor I first tried drinking a tea of the flowers while watching 'Sleepy Hollow'. We simply put the flowers into a cup, poured hot water over them, and let it steep for about ten minutes. I didn't actually think this would produces any effects, and I was right. To alleviate the bitter taste, which I attribute to bad storage, we put in some honey. I can't exactly remember the dosage, but it was about twice as much herb as you'd find in a typical tea bag. As I had suspected this produced no discernible effects.</p><p>So, a few weeks later, we went up to a hill near where I live. There's a huge tree there, and you can see all the surrounding small cities. We had previously rolled up two joints of the flowers and starting smoking the first joint. After finishing the first up, we immediately lighted the second one. The smoke was bitter tasting, but not very harsh. I felt a bit different, which probably was mainly due to the fact that I was very quiet and attentive in order to find out whether I felt anything. I felt no effects strong enough to eliminate placebo as the cause. My visual field maybe seemed a bit different and I had the intuition that I would feel an effect if I smoked a lot more. My girlfriend was fascinated by a waving blade of grass and laughed a lot, but this was possibly due to our relaxed 'trying-out-new-drugs' state of mind. According to herself she didn't feel a thing.</p><p>As many people have reported noticeable effects when smoking leonotis, I think that I haven't smoked enough or maybe my leonotis is just not very potent.</p>",
 "year": "2006",
 "id": "53889",
 "gender": "Male",
 "timestamp": "2008-05-30T07:00:00.000Z",
 "views": "31114",
 "dose": [
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Leonotis leonurus",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Leonotis leonurus",
   "form": "(flowers)"
  }
 ]
}
