{
 "title": "Good Vibrations",
 "author": "Ownthink",
 "citation": " Ownthink. \"Good Vibrations: experience with Cyclobenzaprine (ID 53891)\". Erowid.org. Jun 16, 2006. erowid.org/exp/53891",
 "substance": "Cyclobenzaprine",
 "bodyweight": "220 lb",
 "report": [
  "<p>Since yesterday was my last day of school, I was really bored. So, I called up a friend and asked him if he had some Vicodin or anything else for me. I was half joking when I said this because I didn't really expect him to come over. Well, about an hour later, the guy shows up at my house with 50mg of Cyclobenzaprine and 2 very large tablets of Vicodin.",
  "We dicked around for a while, and I finally told him I didn't have any money for the Vicodin. He told me it was all good, he would save them for later when I got some cash, so he gave me three 10mg tabs of Cyclobenzaprine and said something to the effect of 'Two of these will make you really relaxed and sleepy.' He told me he had previously took 3 of them and could not even walk straight and all he could do was just sleep. Well, since he is about 350 pounds, I figured this must be good shit.",
  "So, I bag the 30mg of Cyclobenzaprine, and as soon as he leaves I go straight to the web to look it up, although I had no idea what it was named, but the appearance and number on the tabs.",
  "So, after looking this shit up, I see it's a muscle relaxant, sedative, etc.",
  "I decide to down all 3 of them. Now, I had just eaten a burger, fries, and some fucking ice cream, so this was on a full stomach.",
  "I took them at 8:26 PM.",
  "T+0:05: No effect. This lasted until about 9:15 or 9:30, at which point they started to kick in. I was at a friends house and just sat there staring at the wall, unable to do anything else, almost like a trance. I fall over on the suddenly very comfortable carpet and begin to drool and stare into the wall. My entire body feels numb.",
  "I go to another buddies house after this (about 20 minutes after I first fell on the floor and went numb), and we tried to do some stuff, but I just kept saying how tired I was and how numb I felt.",
  "We went to sleep pretty early (a few hours after I had taken them) and it was the best sleep of my life. Even when I was forcefully awoken, my entire body was just one huge numb being, staring at whatever was in front of me.",
  "I will definitely do this shit again sometime soon. Especially if I want to relax a bit.</p>"
 ],
 "year": "2006",
 "id": "53891",
 "gender": "Male",
 "views": "72386",
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Cyclobenzaprine",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2006-06-16T07:00:00.000Z"
}
