{
 "title": "Revelations",
 "author": "greg woodhead",
 "citation": " greg woodhead. \"Revelations: experience with LSD (ID 5390)\". Erowid.org. Jan 14, 2002. erowid.org/exp/5390",
 "substance": "LSD",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "LSD",
  "(blotter / tab)"
 ],
 "report": "<p>While recovering from a drunken haze from the night before, I was reluctant to try acid again on a sunday night with school the next day, but I thought oh well forget it, and I dropped around 11pm. Stuck in a house full of people tripping, tweaking, rolling, drunk, high and generally burnt out on recreational drug use, I began to feel the effects around 11:45.</p><p>I began to feel really relaxed and just wanted to be outside. I didn't know why but something was drawing me towards the porch.  As I sat there on the couch, I looked towards the clouds as if they had something to say, but they only revealed a small church on top of a hill that I had never noticed before. Suddenly the whole situation clicked.</p><p>I first realized my revelation when I saw the light emitting from the church bell at the top of the steeple and how the light faded between the church and our apartment (like 2 miles away). I began to ponder this symbol and it jogged my memory like nothing ever had before. Thinking of my ex girlfriend who had been in town recently, I realized that she was an 'angel' from the church, and was saving us (everyone at the party) from the depths of hell, and no one knew it. To me, hell was our 'friend's' apartment which is coincidentally where we get most of our hard drugs from. Everything fit together, our whole apartment complex was on a downward slant towards hell, and the only way out was for the 'angel' to rescue us.</p><p>I immediately reported my revelation to my good friends and they thought it was truly remarkable. We then proceeded to go inside and listen to some music with the lights off. Being the biggest led zeppelin fan ever, I requested something off the boxed set and ended up listening to the entire cd. I seemed to understand everything robert plant was saying (misty mountain hop) and really started listening to what each and every word meant. That is when I closed my eyes to see if I was actually tripping out....And boy was I. I started seeing a kalidescope of rainbow colors with robert plant's head on a tv in the center, revolving around an orange sun flashing yellow and white. This was way too much for me to take in so I shifted back over to the music.  I couldn't believe it; stairway to heaven. The whole revelation was crystal clear to me now. My ex, aka the 'angel' was buying us a stairway to heaven, and was guiding us down the road into the promised land.</p><p>I began to flip out. I thought something was really weird about this, like it was the truth, and there was no way to convince me otherwise. Earlier in the night, we retrieved a psychedelic flower from someone else's apartment and brought it upstairs to the one we were at. It seemed as if the flower was changing colors with the music, and everyone realized it at the same time. It seemed like god was communicating with me through the flower and was telling us the revelation which I had just experienced. This entire event occured while I was peaking. I looked at the flower and it morphed into a fish-like mailbox which I translated as the mouth of god. I figured of course he would have a fish, after all, all live evolved from the sea. It seemed that the flower was actually something owned by god since it possessed colorful symbolic beauty and was communicating to us through stairway to heaven.  I was peaking and decided I was really freaking out, so I made my way back to the porch (2am).</p><p>While out there, I nursed my gallon of water and began to ponder once more. But this time, I felt like all I had just taken in had made me so much more intelligent, that I could hear everything going on inside. Everyone kept saying 'Greg is totally fucked up' and 'is Greg ok?' This was not okay with me. Why couldn't everyone just chill and keep to themselves? I didn't know. But the eerie thing was that I could hear every conversation before it happened and I interpreted it before it even came to someone's mouth. I talked to my good friend and told him I couldn't take this environment and decided to walk home. I lay in the bed, but to my surprise I could still hear every conversation at the apartment a block away. I could hear every single person laughing at the whole situation, what they were saying about me, and what they were going to do.</p><p>It was like I was on a different plane of reality. I immediately tried to communicate through esp. I visualized everyone sitting around in a group forum, and I was the only one talking. I tried to contact my friend Melissa, and as I contacted her, her body started to materialize in my sheets (still peaking). I could see parts of her and I could feel her legs rising up in my covers. Then about five minutes later, she actually walked in the door.</p><p>For the rest of the night, I was communicating psychically with what I thought was our whole group of friends, but was really only Melissa. I thought everyone could hear me, and since I had the revelation, what I was saying was totally obviously true. Melissa thought I was weird, but for some reason (she was rolling) she could hear and understand what I was talking about and relate to me. It made the whole experience worthwhile to share it with someone who understands. Then I went to sleep and woke up a different man.</p><p>-Greg</p>",
 "year": "2001",
 "id": "5390",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-14T08:00:00.000Z",
 "views": "6529",
 "dose": {}
}
