{
 "title": "A Refreshing Experience",
 "author": "Broken",
 "citation": " Broken. \"A Refreshing Experience: experience with MDMA (ID 53931)\". Erowid.org. Nov 26, 2008. erowid.org/exp/53931",
 "substance": "MDMA",
 "bodyweight": "175 lb",
 "report": "<p>Apart from the MDMA which I consumed at about 1:15 AM, I had been smoking a steady stream of marijuana since about 7. I have IBS and am on 100mg tabs of Amitriptyline every night (Amitriptyline is Elavil, a tricyclic antidepressant. The effects of MDMA with tricyclics has not been extensively researched, so I wanted to post this as an account of my experience.</p><p>After taking the pill, my first instinct was to take a shower. It felt great, but I wasn't really feeling the pill yet by the time I was done (about 20 minutes). I dried off, threw some clothes on, grabbed my trusty MP3 player, tossed on my boots, and walked out into the late spring night.</p><p>It felt great to be walking, like it took no energy at all, or maybe like I just had plenty of energy to spare. I don't get out much, so normally I get sore before long. The 'pain' in my hips that was slowly rising after a few hours of walking actually felt kind of good. This could have been some sort of interaction with the amitriptyline, as another use for it is a low to medium strength pain killer and CNS depressant.</p><p>I walked down by the old lighthouse near the Yacht club and walked out almost all the way. There was what I believe to be a skunk that I noticed scurrying away ahead of me. It didn't bother me, and I kept walking. After a while, I saw the small dark figure coming back toward me, and it kind of freaked me out. Instead of let it get to me, I just turned around and walked back toward the bike path.</p><p>Whenever I encountered a single pedestrian (there was a festival going on so there are drunks out for most of the night), I was OK, but I got nervous around multiple strangers. It felt like they knew, even though I knew they didn't.</p><p>I was expecting the usual sensory craziness associated with shrooms and other psychoactives, but instead of feeling fucked up, I felt great!</p><p>I walked all the way around downtown, eventually purely in the interest of finding something to drink. I found nothing, but it didn't bother me until I was about 3 blocks from home. I felt dehydrated, my throat was dry, and I felt like if I did anything else without drinking something I would throw up, or maybe collapse. The feeling did not worsen, and I got home and let the dogs out with no problem.</p><p>As I had a thin layer of sweat covering my body, I grabbed a cold Mountain Dew and cranked the central air. I then sat down here at about 4:45 to start writing this. I am most assuredly still under the influence of all three drugs ingested (one being the amitriptyline which doesn't seem to affect me in the 'fun' way anymore). I think if anything the CNS depressant effects enhanced the MDMA high and they combined for a great experience.</p><p>I feel the overwhelming urge to go pet the dogs now, so I will end this log. Thanks!</p>",
 "year": "2006",
 "id": "53931",
 "gender": "Male",
 "timestamp": "2008-11-26T08:00:00.000Z",
 "views": "21181",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Amitriptyline",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
