{
 "title": "Back in time to childhood",
 "author": "Unsigned Char",
 "citation": " Unsigned Char. \"Back in time to childhood: experience with Salvia Divinorum (ID 53934)\". Erowid.org. Nov 26, 2008. erowid.org/exp/53934",
 "substance": "Salvia Divinorum",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "3 leaves",
  "smoked",
  "Salvia divinorum",
  "(plant material)"
 ],
 "report": "<p>I used 3 small dried leaves produced by my cuttings in the past months, I hand powdered them and placed in the bowl of a water bong.</p><p>To not waste Salvia material (which for me is a scarce commodity) I previously trained myself use the bong by smoking catnip, coleus, mugwort and salvia officinalis (none of them have psychoactive effects anyway). I learned to inspire clean air thru the nostrils just one istant before throat and lungs start to 'burn'. This is how I avoid coughing and thus wasting the precious smoke.</p><p>Well, so I hold the flame on the bowl and inspire the white smoke that comes up thru the pipe. I count 20 seconds, exhale and flame again. At the second inhalation, I start to feel the effects. A sense of vertigo, physically impaired, so I put aside the bong and lay in the couch with eyes closed in total relaxation.</p><p>I feel a presence of people arriving. Knowing that the trip is about to begin, I ask them to 'take me to a beautiful place'. Usually they arrive marching right to left in my experiences, but this time they marched in circle around me. My eye-closed reality start to melt into a dream, and I am placed in front of a scene from my childhood. They reply 'no, we won't'. Then I ask, 'ok but let X (a friend of mine) come with us' and they reply 'no, he's not coming with us'. So I decided to stop asking things and accept what would happen. Salvia effects increase, vision becomes more vivid and I feel a strong sense of deja-vu, of understanding and of being at home. The deja-vu also includes a feeling a strong love for my parents and my brother which I feel they are someway beside me. Everything has the taste of a dream but I still feel I am awake. The dreamlike scene visually joins with reality morphing dynamically with it but showing definite borders. If I focus on external things (noises or even my own sweating) I loose the vision so I remain perfectly still and eyes closed barely like in the act of visualizing. This I think is the secret when using a such small dose.</p><p>The feeling of understanding breaks my mentally created dualisms and everything seems to be true and false at the same time. Meaningless words start to have meaning, and I create new words by joining together other words. Knowing that they would go after salvia experiece, I try to remember one of those words in the attempt to carry it with me into reality. But I forget them, and now I am only able to remember the words '14' and 'fabbisogno' (which now are of course meaningless).</p><p>Salvia 'presence' is still revolving around me but slowly. Other peoples from my childhood (relatives and friends) alternates and march around me but I never manage to see them, I just feel their presence.</p><p>When one turn around me is completed, the effect of salvia start to fade and the 'presence' change its motion: it turns into an endless road and then fades out completely.</p><p>I stay eyes closed for some time and then resume back normal activity. No hangover or whatever.</p><p>A great experience for me. It was like jumping back in the past. Amazingly, all our past it's still there, in our minds.</p>",
 "year": "2006",
 "id": "53934",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-11-26T08:00:00.000Z",
 "views": "3753",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(plant material)"
  }
 }
}
