{
 "title": "Vivid Dreams, More Energized",
 "author": "NorCaliPotHead",
 "citation": " NorCaliPotHead. \"Vivid Dreams, More Energized: experience with Remeron (Mirtazapine) & Cannabis (ID 53983)\". Erowid.org. Nov 5, 2008. erowid.org/exp/53983",
 "substance": "Remeron (Mirtazapine) & Cannabis",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  "50 mg",
  "oral",
  "Pharms - Mirtazapine",
  "(daily)",
  "",
  " ",
  "",
  "Cannabis",
  ""
 ],
 "report": "<p>I am 17 years old and have been using drugs for a couple years now: marijuana, acid, mushrooms, MDMA, LSA, cocaine, codiene, DXM, salvia, various prescription drugs etc.</p><p>I smoke pot more than anything else. I was recently diagnosed as 'Depressed' and I have found my over all mood to be better during weeks that I smoke more pot, this is including things like my grades being better during months of heavy use. I have stopped most drug use except for the occasional trip or special party. (I do not consider marijuana to be a drug in the causual sense)</p><p>My psychiatrist perscribed me Remeron 3 weeks ago. I take 50 mg every night, which is a mid level dose for treating depression. A strange side effect of Remeron is that it causes increase in apetite, which is helpful for me because i was losing weight due to low grade nausea that was never explained by my doctors. It was dismissed as chemical imbalance, somthing to do with my neuron receptors.</p><p>I find that the medication causes very vivid dreams every night resulting (at least for me) in a very relaxed deep sleep. I wake up much more energized, at least after the groggyness fades with a warm shower.</p><p>The interaction of Remeron with marijuana is an interesting one. My high tends to be much trippier in the visual sense and tends to last longer than a normal high. When ever i smoke high quality bud or hash, i tend to get beautiful closed eye visuals and some mild open eye hallucinations. The only down side is that I usually fall asleep within 30 min.</p><p>My mood is at an all time high. The medication seems to affect ones contentment with everything in general as well. It is easy now for me to turn down a drug or even some delicious dessert, I feel more in tune with my body than ever before.</p>",
 "year": "2006",
 "id": "53983",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-11-05T08:00:00.000Z",
 "views": "15505",
 "dose": {}
}
