{
 "title": "Street Racing at 5 Miles an Hour",
 "author": "Comfortably Numb",
 "citation": " Comfortably Numb. \"Street Racing at 5 Miles an Hour: experience with Mushrooms & Cannabis (ID 53982)\". Erowid.org. Dec 10, 2008. erowid.org/exp/53982",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "135 lb",
 "report": "<p>A close and more experienced friend of mine told me he was going to get acid for the weekend. I asked him for a hookup and he simply asked me to do it with him and stay overnight. Of course I agreed. I was incredebly anxious because before then, cannabis was my only experiance with hallucinogens of any type. I was so nervous that by the time he called me and told me what he got I was very relieved. He said he got something better for us: shrooms, which I had wanted to try for a while. I was ecstatic.</p><p>I went down to his place at about 6 in the evening with just a blanket and some decent weed I had. He had an 8th that we split. We put them in peanut butter sandwiches to cover the taste that I found to not be that horrible, compared to what he had said. We played videogames for maybe 15 minutes and I thought I saw some wall-breathing, but it was just my eager imagination. 'Want to go to the mall?' he said, and I said hells yeah. It seemed the perfect place for a 'Fear and Loathing'-like scenario. On the way he exclaimed that it had just hit him, and that the lights on the highway, among other things, were 'just amazing'. I still felt nothing.</p><p>By the time we made it to the mall, a creeping anxiety came upon me. As we approached some people I knew, I felt my conversational skills start to fade. I saw alot of people I knew but couldnt really communicate with any of them. My friend, lets call him Z, is starting to freak me out a bit with the extensive Thompsan vocabulary and frantic attitude. I just wanted him to settle down and stop being obnoxious, so I thought my friend cannabis would do the trick. At this point, I was feeling like I just had a caffeine overdose. My blue slushie seemed to be the most important thing ever, and tasted godly. However, I was dissapointed that it was only having this strange stimulant effect on me. 'Is this all?' I thought. This is tripping? It was about 8 then.</p><p>On the tense ride to the abandoned Toys R` Us parking lot[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] , strange, none-hallucination things started happening. It was like being high without the blurryness and apathy. Weezer on the stereo was the most beautiful thing I had ever heard. Even though our conversation was minimal at this point, we felt as if we were embarking on a divine experiance for our friendship. We were cool with everything, except I was nervous about his driving, though it really wasnt that bad. It was a cold yet snowless January night in a harsh world, but we were the only ones that knew and understood what was going on around us. There was a distaste towards the people we saw, but only because we knew they would never understand where our minds were at that moment.</p><p>We pulled in and made quick work of the smoking. My bowl packing consisted of just taking one giant bud and shoving it into my glass piece. It did smoke well though. We saved the rest of the bowl for later and started the journey back. 'We have to smoke a cigar!' I exclamed, as it seemed imperitive. 'Yes, it is indeed a necessity' he replied. We went into the one Sunoco where they sold tobacco illegally to underage kids and looked at our options. After deciding it wasnt a Grape night, he decided that Pineapple tobacco was the way to go. I thought he was a genius.</p><p>The weed had definetely launched me into tripping mode by then. I was seeing things in my mind that seemed unreal. Some point at a stoplight we started to really go nuts. Everything was amazing, everything felt great. We were invincible. 'Dude, your head just went into another dimension' he said after my body felt like a geometric shape and I started making hand gestures. 'I know' I said, as we were totally connected. We pulled in to a Subway parking lot for him to go in and look to see if his guy was working. While I was in the parked car, I had my first true visual. I stared intently at a plant that was illuminated in the darkness. Before my eyes, it appeared to grow larger into a beautiful marijuana plant. The leaves turned into a geomotric bloom that covered most of my field of vision. I was awestruck and speechless by the time he returned.</p><p>I dont remeber anything till we got back to his neighborhood. We pulled into the parking lot of a manufacturing company warehouse near his home. We sparked up the weed and the cigar. It was a grand cigar, and I can still smell it today. Many hallucinations involving that, the garage door in front of us, and the wood pallets surrounding the car. There was a desert scene in front of me, with palm trees and grasses blowing in the wind, and the shadow of Panzer tank, all on the garage door. Such a strange assortment of things came into my vision. Faraway lands and large creatures lumbering around the parked car. The pineapple entranced my sense of smell and taste and we knew we were in another tripping balls.</p><p>Around 10 we went down the back alleys to his house at about 5 miles per hour (seriously), but we were as excited as if we were street racing. The change of pace led us to realize that, wow, we were really rocking it from just half an eight of shrooms and a few hits of weed each. The walk to his building was covered in more plants that seemed to grow in the dark before my eyes into huge vines. Up his steep steps into his apartment we went to meet his mom at the top. She suspected nothing, all he had to say was that I 'smoked cigars like a chimney' which I had.</p><p>We watched teleision, which made no sense at all to my jumbled mind, and then tried to sleep. This was uncomfortal, but not without lots of closed-eye visuals of strange color patters and psychedelic vortexes.</p><p>The next morning I felt refresehed and happy, as did Z. I have yet to have a more memorable and enjoyable experiance on any psychedelic since this one. It was truly a great one.</p>",
 "year": "2005",
 "id": "53982",
 "gender": "Male",
 "timestamp": "2008-12-10T08:00:00.000Z",
 "views": "3372",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 3:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(plant material)"
  }
 }
}
