{
 "title": "Definitely a Keeper",
 "author": "Acablabs",
 "citation": " Acablabs. \"Definitely a Keeper: experience with Sceletium toruosum (Kanna) & Cannabis (ID 53997)\". Erowid.org. May 30, 2007. erowid.org/exp/53997",
 "substance": "Sceletium toruosum (Kanna) & Cannabis",
 "bodyweight": "110 kg",
 "header": [
  "DOSE: T+ 0:00",
  "2 lines",
  "insufflated",
  "Sceletium tortuosum",
  "(powder / crystals)",
  " T+ 0:45",
  "1 line",
  "insufflated",
  "Sceletium tortuosum",
  "(powder / crystals)",
  " T+ 0:00",
  "1 bowl",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>I recieved 28 grams of Pharmaceutical grade Kanna in the mail from a well known vendor. Seeing the less-than-enthusiastic reports I read on kanna, I figured  this needed submission</p><p>About me: Chronic user of cannabis, plus experiences with too many things to bother naming. Fairly good health.</p><p>Mood and Mindset: With Girlfriend and her brother, happy and excited (for getting to try a whole new array of legal products).</p><p>I busted out my trusty coffee grinder and scale, and began powdering .5 grams of the milled and chunky mixture of shredded brown and yellow bits. Realising the harder bits would never powder, I simply scraped what powder crusted/clumped/collected in the corners (much in the same way a cannabis addict does when out of pot). I I repeated grinding and scraping untill no more brown clumpy powder would build up. I got about .3g of material.</p><p>We split this into 9 small lines. I sure was surprised at how potent it was. The first line didnt burn or hurt very much, a little discomfort, but for snorting plant matter, not bad. Wasn't sure if effect was placebo, so I tried another one. We all experienced the same effect, and almost instantaneous (10 seconds to a minute) 'rush' or 'wave' of euphoria go over the body. followed quickly by sweaty palms, and then strong relaxation, slight sedation.</p><p>After a third line (over 45 minutes or so) I didnt really feel like I needed anymore, it was almost like just parts of being stoned. I have to note, I sat on my ass the whole time and couldn't have been happier doing anything else. Very relaxing, great stuff. Smoked a pipebowl of marijuana, synergised well, kind of overpowered kanna a little, but it was major couchlock from pot that didn't really give you couchlock. Kanna is a keeper.</p>",
 "year": "2006",
 "id": "53997",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-30T07:00:00.000Z",
 "views": "25526",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2 lines",
   "administration": "insufflated",
   "substance": "Sceletium tortuosum",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 0:45",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Sceletium tortuosum",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
