{
 "title": "My First Third Eye Squeegee",
 "author": "Delysid",
 "citation": " Delysid. \"My First Third Eye Squeegee: experience with LSD (ID 54017)\". Erowid.org. May 26, 2007. erowid.org/exp/54017",
 "substance": "LSD",
 "bodyweight": "185 lb",
 "report": [
  "<p>Time Taken: aprox. 9:00AM",
  "First Noticeable Effects Occured At: 10:15AM",
  "Durration: Somewhere between 12 and 14 hrs. (difficult to gague)",
  "Fellow Pilgrim: 'Entheogen'",
  "Set: Excited, Nervous",
  "Setting: My Home and surrounding area",
  "SUMMARY--",
  "You can call me Delysid.  I am in my early twenties.  Up until the experience which I'm about to divulge, I was, in my own opinion, fairly inexperienced with drugs of any sort.  Of course, like most Americans, I had consumed large amounts of caffine over my lifetime.  I had smoked pot in high school, but due to the group I smoked with, never got much enjoyment out of it.  I had consumed alcohol in small amounts up until just months before the experience when I started drinking heavily habitually, but still not quite to the extreme of alcoholism.  I had always had an interest in 'drugs'.  Even as a child I used to love reading in first aid books and encyclopedias about the effects of all types of substances, illicit or not.  But it was the weeks I finally read the cult science fiction calssic 'The Illuminatus! Trilogy' that I first considered trying psychedelics.",
  "My thoughts mostly focused toward acid, although I had heard some interesting stories of mescaline, a substance I still hope to explore.  I discussed it with the friend I knew to be most interested in the subject, who I shall refer to as 'Entheogen'.  She and I agreed that since we were both so interested in LSD we might as well just try it and get it over with.  Actually, we were MUCH more excited than I make it sound.  In the subsequent weeks we used her contacts to get ahold of a few hits, and then finding a time to actually do it.  During this time, I almost chickened out, but thanks to Entheogen I followed through on what would be one of the most amazing experiences of my entire life.",
  "We had four hits, one for each of us that day, and two which Entheogen and our friend 'Leary' would take the next weekend.  And so, at 9AM, we put the tiny squares of paper on our tongues and prepared ourselves for the best day of our respective lives.  For a while nothing happened, and like anyone inexperienced with psychedelics, we worried nothing would EVER happen.  In a little over an hour however, as music played in the background, we both, almost simultaneously, began to feel an incredible rush of euphoria and expectation.",
  "I have to confess, I was in literal awe.  I had never up until this point been so blown away by the purity of a feeling.  The joy my religious upbringing had promised and failed to supply was being poured out by the barrelfull.  And the feeling of expectation was almost unbareable, however our attitudes didn't match this.  We didn't care if nothing else happened because the euphoria was far beyond what we'd been experienced with.",
  "Along with this euphoria and expectation, was the amazing change in the sound of any and all music.  Music was celestail, the music of gods.  In fact for weeks after I mounred the loss of those angelic ears, to hear what I still consider the true nature of music.  But all this was only a small part of what occured that day.  During the first hour, while still in a fully euphoric state, I experienced my first, shall we say, 'Acid Epiphany'.  The music we were listening to was happy and upbeat and, feeling the music as I did, I realized how numb we become to the power of music.  I dable myself and I enjoy nearly any type of music.  But seeing how commonplace music ISN'T made me wonder why we take it for granted so much.",
  "Entheogen is very interested in the video and flash work that Larry Carlson does.  So inevitably, we ended up watching one of his long works.  I must be quite candid and say that she had shown me his stuff before, and the sad truth is, it quite literally creeped me out to no end.  I found it interesting, but also very unnerving on a kind of subconcious level.  I was nervous about watching any of his stuff, because I feared it would turn into one of those bad trips.  But oddly enough, it was simply facinating to me.  This brought about Acid Epiphany #2.  It was a great counterpoint to Epiphany #1: We don't always have to be effected by things.  It's somtimes good to hold your head above water and just look down calmly.  I must note here that I constantly think in contradictions anyway.  I believe, to quote F. Scott Fitzgerald 'The test of a first-rate intelligence is the abilty to hold two opposed ideas in mind at the same time and still retain the ability to function.'.",
  "I of course shared these first two Epihpanies with Entheogen.  I kept #3 to myself... and I'm not entirely sure it should be called an Epiphany, but I guess it depends on your point of view.  At some point in the early stages, I looked at Entheogen and just wanted her sexually.  There are many personal reasons that this is complicated, but I won't go into them.  Suffice it to say that it was not an option, nor did I entirely want it to be.",
  "This lead to a questioning of sexuality in general and an essential, and quite overwhelming distaste for what I saw as a 'mascualine predatory sexual mode' in which my body wanted to do something no matter the consequences.  It felt animal and not human, hormonal rather than reasoned or even emotional to be more precice.  I went mentally into an intense psychological and philisophical thought process of just what it means to be a reasoning animal.  I felt intense shame.  I decided to get some fresh air.  I told Entheogen I'd be back.  She asked if I was okay.  I told her I was fine and I'd tell her if it was going bad at any point.",
  "When I went outside, the light, the colors of the world were beyond anything I'd ever seen.  I took it in with utter joy.  I could NOT experience this alone and could NOT let Entheogen miss this.  I ran in to get her.",
  "When we got outside, she was not quite as impresed.  I imagine I was having a slightly more visual experience than she.  But she wanted to go for a walk.  I of course, being the more nervous of the two of us, was worried about this concept.  But being so joyous at my new eyes, I had to oblige.  I said we should go to the end of my neighborhood and back.  I put my hand on my cheek as we walked and it seemed that I could feel EVERYTHING about my cheek.  On the way back, we passed a bush with purple flowers.  She picked one for each of us.  I twirled mine between my fingers until we got back to the house.  But a feeling was growing as I twirled it and finally in front of the house I pinpointed the nature of it.  I could sware I felt the life of the thing.  It felt like an insect squirming between my fingers.  I had to drop it.",
  "Back home, we tried to call some friends.  We weren't able to get ahold of anyone.  Finally, I was convinced to go for another walk.  I wanted to set a boundry again, but Entheogen said:",
  "'Let's just walk until we feel like stoping.'",
  "I had the desire to explore the universe, so I fianlly let go my inhibitions and agreed.  Our first stop along the way was at the nearby let's call it a 'low-price superstore', the kind of place where you can get groceries, clothing, household supplies, small electronics, or even get your car serivced in minor ways.  Anyhow, the second most humorous part of the whole day was as we were walking up and I was looking at a family standing outside. I am never normally one to think this, but their baby was UGLY.  When we got inside, I told Entheogen and of course we spent a rediculous amount of time just inside the side entrance laughing hesterically.",
  "We each made our way then to our respective restrooms.  The men's of course, had no line, while there was a long one in the women's.  I had to wait by the restrooms for Entheogen.  I heard a lot of random noises coming from inside and even at one point got so nervous as to call her cell phone.  She was fine of course.",
  "As I waited and watched the throngs of customers, I realized something about my sight.  I remembered seeing like this before, or at least thought I did.  I felt, and of course will never be able to confirm, that I had been given the eyes of my childhood back, seeing everything clearly and with wonder.  But I was more perceptive of the people.  I saw sadness in people that broke my heart.  One woman in particular, gaunt and pale, and the man she was with just had the look of a complete jerk.",
  "When she got out we spent time exploring the store.  We finally got a call back from our friend 'Lavinia' when leaving, but we weren't really able to talk very well at this point.  We had a much easier time understanding each other than making others understand us.  It should be noted that while my visual experience was possibly more pronounced, I did not seem as effected in the area of speach.  I spoke with a bit more clarity than Entheogen throughout.  We went on to visit our friend Leary at his place of employment, a fast food joint.  Here Entheogen wished we had a floating camera to follow us and chronicle the day.  But she also explained that she felt like a camera herself, and I understood her to mean that she seemed to be taking the world in like one, an observer recording the universe.  I've seen this sentiment in other experience reports actually.",
  "When we left, we walked by a small bank of sand left by a construction crew and pretended, for just a moment to be at the beach.  This is lighthearted play, and I point it out beacuse it must be said that it is not a typical activity that I engage in.  I have fun, but in my own weird ways.  But I was able to just play like a child.  It felt beautiful.  We were then headed back home.  We sat for a while on a sidealk, facing a dead end street.  A man far at the end was walking toward us.  I have never come to realize so strongly as I did in that moment, how much we disconect ourselves from other people.  I watched him walk all the way toward us and finally past us, and until he was close, he almost didn't seem real.  This made me mildly sad.  We drew a bit with chalk rocks on the concrete, and this made Entheogen want to get back and paint.  So we started back on the road.",
  "As we walked, a bag blew by.  Entheogen is fond of the movie American Beauty, and if you don't know, the is something in it about a plastic bag blowing in the wind being beautiful.  She saw the beauty in the plastic bag, but felt stupid saying it.  Once I had coxed her into explianing, I told her this:",
  "'It's not stupid at all.  The general concesus of people who saw that movie thought that idea was great, so if they think you are stupid for actually seeing that beauty in REALITY, they they are hypocrites.'",
  "We stoped again at a stone and metal fince.  Some one the metal greating was missing and we sat there on the stone looking at a very pretty man-made pond.  I had my final Epiphany of the day as we discussed my reasons for taking this trip.  I had previously told Entheogen that I was going to do this for what I'd consider spiritual reasons.  I grew up religious and had renounced pretty much anything even vaugely supernatural within this last few years.  But I professed to believe that the 'spiritual' and 'natural' were two sides of the same coin.",
  "Now, as I was right around the end of my peak, I realized that this theory had to be right.  Exlpain it as god or call it the universe, do whatever you like.  Terms don't matter, we're all talking about the same thing.  I'm not saying everyone's right.  More like everyone's about the same amount wrong, so there is no reason to worry.  We will catch tinny little glimpses of whatever we are 'really' dealing with and that's all we need, even the biggest glimpse we'll get is ultimately tiny and that's okay.  Some of us will seek and others will be happy with what they have.  That's fine.  People, including me, will continue to argue and fight about what they believe to be true.  It's okay.  It's fine.  It's all alright.  This was of course, a very comforting revelation.  It's okay.  And I realized that this was the moment I'd searched for all my life.",
  "We went and sat by the pond.  Now is the MOST humorous part of the day.  We sat for a while and suddenly and old man comes walking up.  I assume he's going to tell us we are on private property and we'd better go.  But no he informs Entheogen who's feet are in the water that there are aligators in this pond.  Entheogen believes he's joking.  He says no, there really are aligators in there.  I tell her after he walks away that we should go.  We pick up and leave.  My assumption is still that he was trying to get rid of us, but I think he was trying to be polite about it.  Still, to two people at the end of the peak of their first acid trip this was quite strange and quite funny.",
  "One last funny moment was when we passed the flower bush again.  Entheogen was picking some to paint and I was telling her what I'd felt before.  She kept feeling them trying to feel it with no luck.  I saw man mowing his lawn.  I told her we should go.  She thought I was being dumb, then I uttered the line that would become a classic: '[Entheogen], we are sitting here FEELING FLOWERS!  It may not seem weird to you, but trust me, it's weird.'  From there on out it was mostly these funny typse of moments as I was coming down.",
  "AFTER-EFFECTS--",
  "While the day was quite amazing, I have to say that some of the after-effecs were somewhat difficult to deal with.  Once I was finally alone, I was a bit frightened of everything, just mildly, and, as is often the case I'm told, I could not sleep at all.  I was severely depressed the next day, which I am told is less typical, and have never read of in my studies, only one person I know claims to experience this after-effect, but I presume this was just my reaction to the 'normal' world after seeing things in such a beautiful light.  I have suffered from clinical depression, so this might be a factor.  (SIDE NOTE: I want it to be clear that I have not been on medication for that condition for a while and wasn't at any time near that of the trip.)",
  "Although I'm not convinced they were true flashbacks, I consistently, for weeks afterward, could sware occasionally that I was seeing something in my peripheral vision and turned to find nothing there.  This became more common after the subsequent experiences I had with a dissociative called DXM, though they subsided after I stoped using anything for a while.  But those are stories I'll come back to tell later.</p>"
 ],
 "year": "2006",
 "id": "54017",
 "gender": "Male",
 "views": "6068",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "submissionDate": "2007-05-26T07:00:00.000Z"
}
