{
 "id": 5404,
 "title": "Euphoric Insanity",
 "date": {
  "submission": "2004-03-26T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Justin",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "PCP",
   "form": ""
  }
 ],
 "report": [
  "I paid for two joints from a friend, he said that I would get very fucked up. So I went home and went to my room and prepared to smoke them. Each one of them was about four inches long. I had a normal state of mind before I smoked the weed & dust, but that was about to change. I lit the joint and the familiar scent of the relaxing smell of cannabis entered my nostils, followed by a potent, chemical smell. I smoked both of the joints, one right after the other. I noticed the regular lightheadedness and relaxation from the weed, but it was accompanied by a numbness throughout the body.",
  "I sat there, severely stoned and then started to trip. I began to think I was in a different demension that looked identical to the one I had been in before. Sounds from the outside sounded as if they were coming from far off. I also felt like I wasn't a part of anything around me. I looked under my bed and stared at crumbs of crackers that had been crushed. The light from the outside changed from regular sunlight to silver as I looked at the cracker crumbs. I had the impression that I was a supreme being, and I would push the crumbs of crackers back farther under the bed away from the light to punish them. I sat there for a little while and then I put on some music, which sounded better than before. All of the sudden it looked like I was under water. I had the impression that there was a community on top of my stereo, and when my headphones played a more intense music, I would bob my head forward to send the music towards the community to punish them. When my headphones played a more mellow sounding music, I would bob my head forward to the community to soothe them.",
  "All of the sudden I saw pictures of maggots squirming on the ground, even though I saw them in the air, (very weird.) I kept on thinking monsters were going to jump out at me from my closet, but I didn't care, I felt invincible. After that I just relaxed until my high wore off. All in all this was a mind blowing experience and I still get mild flashbacks to this day. But I love PCP, and I love weed. I would suggest PCP to anyone wanting to experience an intense trip. It's an awesome drug."
 ],
 "erowid": {
  "id": "32225",
  "citation": " Justin. \"Euphoric Insanity: experience with PCP & Cannabis (ID 32225)\". Erowid.org. Mar 26, 2004. erowid.org/exp/32225",
  "substance": "PCP & Cannabis",
  "views": "33742"
 }
}
