{
 "title": "Too High, Too Hot, Too Fast",
 "author": "Sienna",
 "citation": " Sienna. \"Too High, Too Hot, Too Fast: experience with MDMA (Ecstasy), Tryptophan - 5-HTP & Supplements (Niacin, DMAE, Ginkgo biloba & Other) (ID 54058)\". Erowid.org. Oct 7, 2007. erowid.org/exp/54058",
 "substance": "MDMA (Ecstasy), Tryptophan - 5-HTP & Supplements (Niacin, DMAE, Ginkgo biloba & Other)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Vitamins / Supplements",
   "(daily)",
   "",
   " ",
   "oral",
   "Tryptophan - 5-HTP",
   "(daily)",
   "",
   "1 capsl",
   "oral",
   "MDMA",
   "(capsule)"
  ]
 ],
 "report": "<p>I took the same dose as usual, from the exact same supplier but had a completely different experience. I belive I discovered a potentially potent (but potentially dangerous) combination -- MDMA plus the brain vitamin supplement Think Clearly (from Super Nutrition) which I had taken earlier that day and have been taking for about two months on a daily basis. This supplement contains a very high dose of Niacin (100mg), DMAE(100mg), Gingko (60mg) and B vitamins. I had also been taking 5HTP (100 mg) and Estrotone (a female hormone balancer, containing Ginger, Black Cohosh, Vitex and Schizandria) on a daily basis.</p><p>The MDMA came on extremely fast -- less than 15 minutes after I swallowed the pill. And this was even with food in my stomach, a shot of wheatgrass juice and a vegan coconut pie. I started dancing to Sound Tribe Sector Nine and within the next 30 minutes, the visuals were outstanding and the bass was moving through every blood vessel in my body, as if I was completely merged with the beat. The experience was very psychedelic and much more visual than MDMA usually is for me. Everything was distinct, clear, bright, intensely colorful, metallic and futuristic, with a technological sheen as if everything I was looking at was filmed in a holographic HDTV format, almost as if it was all digitized. It was similar to a low dose of LSD, visually, with closed eye visuals. The lasers and lights were enhanced and streaming. Intellectually I was on fire too, and wanted to talk constantly with ideas, connections and interrelated thoughts and visions appearing in a flow. The experience was visual, emotional and mental rather than body-centered, sensual and tactile.</p><p>Suddenly I got very hot, extremely hot. It was as if a column of fire rose from my heart chakra, up the center core of my body, through my throat and to the crown of my head. I started to get dizzy and fell to the ground, almost fainting.  The crowd rapidly cleared a wide circle of space around me, and I felt the air cooling a bit. This was the first time I've ever overheated on E. In fact, the last time I did it, a week before, I was shivering and cold most of the time, not hot.</p><p>My dance partner helped me over to the side of the room, where I started crying: 'Water, water, give me water!' I was grabbing half-drunk bottles off the bar, and from other people who were handing them to me. I stopped panicking, and realized that my panic would intensify the effect, and I suddenly remembered that I was wearing a heavy velvet hat, and took it off, starting to cool.</p><p>Then I went outside into the cold night air, and felt the core of fire start to descend from my head, back into my heart, and then finally, I was enveloped in the cool night air. My trip continued vividly, very accelerated, for the rest of the night until 10 am, 12 hours later, when I was finally able to sleep for a few hours. During this time I wandered the festival, and everyone seemed to be someone I already knew, or had seen before in a past life. There was a great feeling of being plugged into a grid that interlinked everyone else who had ever taken E, as if we were now networked in a vast neural web. I took notes during the experience and felt that my writing had an unusual level of clarity and brilliance, though sadly, the next day, my handwriting was almost indecipherable because I was writing too fast.</p><p>I continued feeling extremely calm, peaceful, serene, elevated and at one with the world for the next two days, but the hangover and a severe headache hit very hard on day three, probably because I didn't drink enough water or eat much for several days as I was at a festival. My immune system felt overwhelmed and I lost a lot of weight during the experience, it really burned a lot of caloric energy. I continued feeling extremely optimistic, empathetic, open and hopeful for the future of the world for the rest of the week, but took high doses of vitamin C, B vitamins and 5HTP to restore my brain, which was feeling quite fried after the experience. </p><p>The next day, I ran into an old timer, A_____, from the 60s who was present at the summer of love. I told him what happened and A______ said that it was definitely the Niacin that caused my reaction. He said that Niacin in high doses can really accelerate the blood flow to the brain and it's potentially dangerous. I think that maybe lower doses of Niacin, however, could intensify E in a very pleasant way. Or perhaps if someone weighed a lot more than me they would have a different reaction. It would be interesting to hear the experiences of others who have mixed Niacin or Gingko with MDMA and see what happened to them. For me, it was a pleasant and exhilirating near death experience, too high, too hot, too fast.</p>",
 "year": "2006",
 "id": "54058",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-10-07T07:00:00.000Z",
 "views": "20376",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": "(daily)"
  }
 ]
}
