{
 "title": "The Group that Trips Together, Stays Together",
 "author": "Imightbewrong",
 "citation": " Imightbewrong. \"The Group that Trips Together, Stays Together: experience with Mushrooms (ID 54070)\". Erowid.org. Jun 20, 2007. erowid.org/exp/54070",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Alcohol",
  "(liquid)",
  "",
  " ",
  "oral",
  "Mushrooms",
  ""
 ],
 "report": "<p>This was my first time ever doing mushrooms. My drug experience is semi-frequent marijuana use (once every 4 or 5 days), drinking on occasion, one time use of DXM (small dosage) and one time use of salvia (had no effect on me).</p><p>It was one of my friend's eighteenth birthday. We decided to go to a bar, have a few drinks, have a good time. (me and my friends are all 18). There are 8 of us in total. We go to one bar, I have a beer, and 2 rum and cokes. However, I drink them slowly enough that I am by no means drunk, but shortly after my last drink I feel a bit tipsy. The bar is a bit dull so we decide to head to another bar. At this bar I have another 2 rum and cokes, again, I am a bit tipsy but definitely not drunk.</p><p>After about an hour, it is now about midnight, we decide to head out. 2 of the guys (the ones who werent drinking) head home and it is now down to 6 guys, including myself. We decide to attempt to track down some weed but no one really has money, when one of my friends mentions he has about 20 grams of mushrooms in a bag in his room. In this group I am the only one who has never tripped on the drug before, so I am immediately reluctant, especially since it is now after midnight and I am slightly inebriated. However, as soon as the guy emerges from his house, everyone starts eating them quite quickly, so I decide ill just eat a bit, and one of my friends hands me a stem which he approximates is about 1-1.5 grams. I eat it quickly, outside the guy's house, plugging my nose because I really didn't like the taste.</p><p>We decide to go down to a convenience store a grab some pop to wash down the taste. The guy with the mushrooms, who is already starting to feel the affects (he has eaten about 4.5 grams) decides to stay outside, and I stay with him. At this point, I decide to eat a bit more, and I eat about another gram. After the rest of the guys emerge, we head up to a school playground near by to start to ride the trip a bit. At first I feel nothing, but I have a slight feeling of excitement as we come close, and I find myself much more talkative then usual, as I am normally a fairly quiet guy.</p><p>When we arrive at the playground, I start to notice I feel very hyper and high strung, but not in a bad way. I begin to play around, and some of the guys are starting to feel the effects quite strongly. As I go to urinate on a nearby tree, I got a strong sense of well being, enough that I yelled to one of the guys thanking him for convincing me to eat the mushrooms, because I felt awesome.</p><p>After I finished, I walked back towards the play ground. As doing this, the mushrooms kicked in fully. This was about 12:40 am. The first thing I felt was that my entire left arm, shoulder to finger tips, felt like it had become enlarged and became slightly numb, and a few seconds after this, my legs starting to feel long and rubbery, and I was overcome with a slight sinking sensation as I walked. The ground I was walking on also seemed to curve inwards towards me slightly, and I felt like I was going in slow motion for a few moments. It was not a negative feeling, but I was slightly bothered by the feeling in my left arm, but clutching it close to my body seemed to remedy this quite well. After alerting the others that the drug had kicked in for me, we stood around for a few minutes on the playground.</p><p>The first hallucinations began when looking at the sky, it was a cloudy, summer evening, but there were many stars visible in-between the holes in the clouds. I noticed that I could easily discern distances between objects in the sky, it was very clear to me that the clouds were much closer to me then the stars, and I could tell which stars were close and which were far away. When sober, I cannot easily discern that the clouds are closer then the stars, the sky seems to be a singular distance away. I was fascinated by this, and I began to notice the stars seemed to shake and waver a bit. I began walking through the playground. I am a big music buff and I wondered what music was like on this drug. The album in my Discman was Radioheads Kid A. I found most of the songs to be frightening and too intense for my liking on the drug, but the song 'kid a' was very soothing and fit well with my mood. This is strange, because it is one of the oddest songs on the album, probably the one I find most difficult to grasp.</p><p>After about half an hour at the park, I was feeling great. I was very loose, laughing a lot, just having a good time with my friends enjoying this ride. I was very very hyper and was constantly yelling things that popped into my head at random times.. Strange behavior for me because most of the time I am quite mild mannered. We arrived at a basketball court, with three nets, one directly in front, one directly to the left, and one directly to the right. The nets were not that high, but they seemed large and important, like they had some very powerful meaning or purpose. I commented on this to a friend, and he also agreed, we felt like there was some sense of importantness to these nets. However, upon closer inspection, they seemed tainted and dirty, and at this point I discovered that on the drug I was very open to suggestion. At any point in the night if something described something in a certain way, I would begin to interpret it in a similar fashion. I started to notice that I constantly felt like I was being pulled in various directions, predominantly to my left, and I began to feel like there was an assigned path for me to walk on, and I often found myself having to spin around in circles a few times mid stride because of this pulling sensation. I began to almost visualize a stretched shadow created from my body, pointed in the direction I felt pulled to walk in.</p><p>We walked around in a disorganized gang. We were all in our own neighbourhood, in areas we were very familiar with, so no one felt lost at any point. However we moved very slowly because for some reason we constantly felt the need to lie on the ground, or stop and sit down. We would laugh hysterically for seemingly no reason, and everyone seemed to be having a good time. I was still having little to no hallucinations at this point, (some distant objects seemed out of focus at moments, but after closer inspection they would return to normal) mostly just a strange feeling of hyperactivity and over talkativeness. I found myself constantly talking to myself when I wasnt speaking to others, either in my own head or out loud. I have a lot of trouble remembering what some of my thoughts were at this time, but I think most of them pertained to how I was feeling and whether or not I was enjoying myself. It was about 1:00 am at this point.</p><p>We soon reached a park area with a large hill (prime tobaganning area in the winter). It had a bench on the top that many people sat down on. There was some tall grass at the top of the hill that me and 2 of the other guys began walking through, it looked very cloud like and dreamy under the moonlight. We discussed how we were feeling, and I said I was enjoying myself. One of my friends lay down in the grass, which created a circle of tall grass outlining him, and the image looked like a casket to me, however I did not interpret this negatively. I bent down to touch the grass, which looked and felt very surreal, and I was greatly amused by this.</p><p>We were all yelling very loudly ( a few of the guys were verrrry high, birthday boy ate what we approximate to be about 6 grams, also quite drunk) and we notice the lights go on in a house. Instantly we all run down the hill and down on to what happens to be my street.</p><p>At this point we are all now at the peak of our trips, and things start to get very weird. We walked down one street, a street that I walk down frequently, it takes about 8 minutes, but like before, everyone is constantly turning around, stopping to look at things, randomly sitting on the curb or lying down on the street, laughing hysterically and yelling loudly. Because of this, it takes us what I would have to approximate was about an hour and a half to get down this street. Because of this, we soon get separated by about a block, in parties of 2 or 3, and the ones moving at the front would constantly have to run back, only to find the other sitting on the curb laughing.</p><p>I have trouble remembering all the details at this point, but I was hallucinating quite strongly. The street beneath seemed to curve in once again, but much stronger, and my hands and fingers seemed long and skinny. I lay down on the street laughing, and I noticed as I looked to the left, that the street seemed to be slowly rising upwards, and I felt like I was sinking into the asphalt.</p><p>At about 3:30 am, the sun begins coming up. For some reason, I was terrified of the sun coming up and did not want to be outdoors. Since I was only minutes from my house, I suggest we all head home and everyone agrees. We all go separate directions in groups of 2, and me and the friend I was with begin to walk to my house.</p><p>On the way there we discuss what we should do now, and whether its safe for my friend to come inside. We decide that in our state it definitely isnt, so my friend says something about this being the end of a long journey, and leaves. There was a strange sense of finality in what he said, and I felt like I had reached the end of a long, tiring experience. I was about to enter my house through the garage. But I decided to first sit down on my lawn, and I laughed for no reason, while sitting on my lawn, for about 10 minutes, before realizing what I was doing and going inside.</p><p>At this point, things got a bit ugly. It was about 3:45 am. When I got in the house, it was very dark, and I was immediately struck with a feeling of fear and uneasiness at this. I also had an overwhelming sense of guilt when I thought about my sleeping family, and I began to wish I had never taken the drug at all. Keep in mind, I was still in an intense hyper activity mode, and I could not stop talking to myself in my head.</p><p>As I was walking up the stairs, very slowly as to not wake someone up, I would constantly stop and wonder whether the things I had been saying to myself had been said out loud or I was saying them in my head as I intended. I got into my room, which is very messy, and I really didnt like how I felt when I was in there. At this point I had very little hallucinations still, but my body felt very strange. I decided to have a shower.</p><p>While in the shower, things became weird. I felt like I was in some sort of demented hospital, and everything took on a sickly green tint. I began to experience some auditory hallucinations, and I would constantly hear a deep thunderous laughter that changed pitched. This made me very uneasy. I quickly got out, at this point getting a glance of my own reflection, and I have never found myself so unattractive in all my life, I could barely stand to look at myself, I felt I looked diseased and malnourished. I also noticed my pupils were extremely dilated.</p><p>I crawled into my bed, leaving the light off this time. The sun was already coming up so there was enough light coming through my window to see clearly. As I got into bed, I began to hallucinate more strongly. Everything in the room seemed to be shifting, and I would see cartoon-like mouths moving in and out of my peripheral vision. The walls seemed to have almost a bandana pattern, and soon it seemed everything I looked at had a strange, exotic, bandana-like pattern over it, it seemed like it was behind my eyes. I was hearing constant chattering voices in my head, a few commonly repeated phrases were 'it started like an album piece and ended like a nightmare' and 'I believe this is the only option now'. My body seemed to flash in and out of numbness at various points, and anytime I closed my eyes I would see ghastly, or maniacal faces, which when I opened my eyes, would fall apart and move into shadows in my room.</p><p>No matter how hard I tried, I could not even relax, let alone sleep. Minutes moved by like hours, and no matter what I did, I was in a constant dialogue with myself. I eventually  sat up in bed, very disconcerted, still hallucinating, at this point I was seeing curved, artistic arms fading in and out of my vision. I was very jittery and could not stop fidgeting and moving about. I had a very strong desire to talk to my girlfriend, and attempted to phone her but completely forgot her phone number, which greatly agitated me. The night continued like this, in waves, until 745 am, when I finally calmed down enough to sleep.</p><p>Conclusion: I found it to be extremely enjoyable, but during silence and when left alone I became too engrossed in my own thoughts which caused a negative, slow moving experience.</p>",
 "year": "2006",
 "id": "54070",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-20T07:00:00.000Z",
 "views": "2526",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": ""
  }
 }
}
