{
 "title": "Wasted a Year",
 "author": "None",
 "citation": " None. \"Wasted a Year: experience with DXM with CPM (ID 54080)\". Erowid.org. Jan 18, 2008. erowid.org/exp/54080",
 "substance": "DXM with CPM",
 "bodyweight": "103 lb",
 "report": "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.] </p><p>Trippen on tripple'c, well that's an understatment for me. I lived for it. It was all I could think about. It took me to a place where I could hide from the insanity that took over my life each day. It gave me love, at least for a while, until it had complete controle over me. It was almost like I was codependant wih a drug. I know that must sound lame but it's beyond true. I could'nt see all the damage it was doing to me, the way I hurt the ones around me that cared.</p><p>My 9th grade year it got so bad that I had to use everyday. I would stock up after school so that the next morning I could go totallty trashed. Eventually I could'nt just take 6 or 12 or even 16, I was taking 32 pills and still be making it threw the day...like without dying. I did spend most of my day in the girls bathroom throwing up pink shit. It tore apart my body. I could'nt even eat normal, it burned when ever I ate. When I wasn't throwing up at school I was curled up in the corner.</p><p>And I did'nt see any thing wrong with this, I thought it was life. It didn't bother me cuz I could'nt see it. I could'nt see that I was pale and bone thin. My eyes were yellow and it was like the color was gone from my eyes. I'm 17 now and a senior in high school. My friends now tell me that when they saw me before I just looked like the life was drawn out from me. I was addicted.</p><p>When my family found out they sent me to rehab for 15 months and I have been clean since. I sometimes wish I could do tripple'c again but I know I would'nt be able to stop.</p>",
 "year": "2002",
 "id": "54080",
 "gender": "Female",
 "timestamp": "2008-01-18T08:00:00.000Z",
 "views": "8983",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "DXM",
   "form": "(daily)"
  }
 }
}
