{
 "title": "The Inner Adventure",
 "author": "Revolvmg",
 "citation": " Revolvmg. \"The Inner Adventure: experience with H.B. Woodrose & Coffee (ID 54091)\". Erowid.org. Sep 16, 2009. erowid.org/exp/54091",
 "substance": "H.B. Woodrose & Coffee",
 "bodyweight": "163 lb",
 "report": "<p>Previous experience: Loads of alcohol & cannabis</p><p>The very first time I took HBWR seeds, I wanted to avoid the nausea.</p><p>I didn't eat for 6-7 hours. I removed the light-brownish husks with</p><p>nails and a knife. I chew 4 seeds for 15 minutes and then I spitted</p><p>everything out. It didn't work so well. In one particular moment I</p><p>felt like I was totally numb and later on I felt like I was going</p><p>to fell asleep. I also smoked some hashish because I didn't really</p><p>believe the seeds we're working. And while I was doing this I drank</p><p>couple of beers. I usually drink & smoke alot, but this time I was</p><p>so tired after all this shit I just wanted to get some sleep. I</p><p>can't truly tell if I was intoxicated by the seeds or not.</p><p>The next morning, I prepared for the nausea. First I removed once</p><p>again carefully the light-brownish husks from the seeds. Then I</p><p>ground up 6 seeds in 3 different cups, each holding 2 seeds.</p><p>I boiled some mineral water, let it cool down to 60 celsius and</p><p>added that into every cup. I waited for 2-3 hours for the mixtures</p><p>to cool down into room temperature. I also didn't eat anything for</p><p>4 hours. Just 10 minutes before I started to ingest the actual</p><p>mixture, I ate a teaspoonfull of ginger. Some people claim it</p><p>helps avoiding the nausea. The taste of ginger is not so pleasant.</p><p>It burns all the way down my throat and into my stomach.</p><p>After the 'ginger hell' I drank 2 cups of my mixture, so I had</p><p>ingested total of 4 seeds. After 15-20 minutes, I started to feel</p><p>light-headed. I had to resist the vomiting. Ginger was still burning</p><p>and the seeds really did make me wanna throw up. I knew I had to.</p><p>Still, I resisted. It was quite difficult to relax or to walk, I</p><p>felt like I was a bit drunk and I wanted to vomit. I decided to wait</p><p>for 60 minutes, and then I would throw up if I had to. Right after</p><p>this I realized, I could control my feelings quite well. I could</p><p>sing along with some piece of music and forget the urge for vomiting.</p><p>I believed I could control these kind of feelings, I believed it was</p><p>all in my head. I carefully chose good songs to make me feel better.</p><p>And it did. I also did some things I really like, playing guitar,</p><p>singing & such. All these things made me feel even better. Then</p><p>suddenly, I remembered last night, and I recalled I had feelings</p><p>quite like this, and I enjoyed it.</p><p>The only downside, besides the urge for vomiting, was the feeling</p><p>of drowsyness... I even made some coffee just to keep me awake.</p><p>Then I wanted to drink the last cup of 2 seeds mixture I made earlier.</p><p>I drank it and went to see my friend. I still felt like I was only a bit</p><p>drunk. When I reached my friends residence, we watched a video and smoked</p><p>some cannabis. I told my friend what I had done and he didn't seem to care,</p><p>I felt like I had no-one to tell this.</p><p>Then, from out of nowhere, appeared a new world in front of me.</p><p>I started to realize things from a totally new perspective.</p><p>I knew I had to leave immediately. The information that kept</p><p>coming from things I did there was too much. I told my friend</p><p>I couldn't concentrate for what we we're doing because I was</p><p>somewhere else, doing something else. And then I left.</p><p>When I was walking back home, I saw a group of people who were</p><p>sitting in a bar nearby. They all arose and left the bar as soon</p><p>as I walked by. At first, I thought to myself, am I that horrible?</p><p>Then I realized they split up because they were going somewhere else.</p><p>It was the relief of my life. And as I continued walking back home,</p><p>I saw some elderly people as well, they looked at me and I swear,</p><p>I knew exactly what they were thinking. So I reacted differently,</p><p>and I saw how it affected them. I believed I could control this</p><p>situation. It was all just a matter of understanding gestures.</p><p>And those gestures had always been there for me. But only now, I could</p><p>understand those gestures so well that I could control the situation.</p><p>I was quite polite and I enjoyed it. And it made me feel good too.</p><p>When I got back home, I saw my entire life like a book. It was all</p><p>there. I just never realized it, because it didn't have any meaning.</p><p>By looking any object I own, I saw where it had come from, why it</p><p>was there, why I liked it and why I chose to keep it. I remembered</p><p>all the things it had been through, where was it made, who had played</p><p>with it and so on... In my everyday life, I pass by many things</p><p>I have gathered throughout my years of existence like it didn't</p><p>mean anything to me. Well it does. I just never stop there to</p><p>see and understand the meaning of it all. But this time I could see.</p><p>I was so overwhelmingly happy of all the objects I had received from</p><p>thousands of different sources it made me smile. It made me cherish</p><p>life itself.</p><p>Then I got an another idea. I wanted to record a video of myself</p><p>thinking these kinds of things. In case I would forget how happy I was.</p><p>It was a difficult task. I had to remind myself of what I was doing</p><p>for every 5 seconds. I just saw the camera and I remembered every little</p><p>recording the camera had ever recorded and every little detail of the</p><p>camera made me remember where it was damaged and so on... When I finally</p><p>managed to assemble it, I started recording. It was impossible to speak</p><p>those things which were inside my head. It was all too much. When I</p><p>opened my mouth and said something, my mouth froze and I was left</p><p>speechless, dreaming. Every sentence I started, ended prematurely as</p><p>my mind drifted away with the memories I encountered everywhere I gazed</p><p>upon. This is when I decided not to record anymore.</p><p>I went to my bed to lie down and enjoy. I have no idea how long I was</p><p>there, since time had no meaning at all. Or at least, I didn't care.</p><p>The rest of my trip I embraced life and tried to focus my thoughts</p><p>to gain understanding of life. And I did understand. The trip</p><p>was over in about 6 hours or so, and I started to feel the after</p><p>effects. I called my friend to come see me and apologized why</p><p>I was so rude earlier. He said he understanded why I did it, and</p><p>I understanded it too. We smoked some pot, watched some videos and</p><p>had a great time. Afterwards we just fell asleep.</p><p>Conclusion:</p><p>At the first time, I didn't take enough seeds and my technique was</p><p>totally incorrect. The next time I drank the seed mixtures I was</p><p>successful and had just the right amount. I had some slight visuals</p><p>too, not worth mentioning though. The inner adventure I had was so</p><p>much more. I still feel happy about my journey, and I believe my</p><p>journey was successful because my timing was right. My life was so</p><p>perfect at the time it reflected my trip very pleasantly. Also I would</p><p>like to point out the side-effects I had, the terrible nausea at first</p><p>and the hangover which included 'foggy' mind, thirst and numb legs.</p><p>Still, it was the price to pay and I will certainly do this again.</p>",
 "year": "2006",
 "id": "54091",
 "gender": "Male",
 "timestamp": "2009-09-16T07:00:00.000Z",
 "views": "2632",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tsp",
   "administration": "oral",
   "substance": "Ginger"
  },
  {
   "time": "",
   "amount": " T+ 0:00",
   "administration": "2 cups",
   "substance": "oral"
  },
  {
   "time": "H.B. Woodrose",
   "amount": "(tea)",
   "administration": " T+ 1:00",
   "substance": "2 cups"
  },
  {
   "time": "oral",
   "amount": "Coffee",
   "administration": "(liquid)",
   "substance": " T+ 1:00"
  },
  {
   "time": "1 cup",
   "amount": "oral",
   "administration": "H.B. Woodrose",
   "substance": "(tea)"
  }
 ]
}
