{
 "title": "Reaching New Heights",
 "author": "RobMan",
 "citation": " RobMan. \"Reaching New Heights: experience with Nitrous Oxide (ID 54101)\". Erowid.org. Feb 21, 2010. erowid.org/exp/54101",
 "substance": "Nitrous Oxide",
 "bodyweight": "165 lb",
 "report": "<p>For all uses so far, setting was good and mood was up. My reason for trying was the fact that it is easily available and the reports I read on the internet make it out to be a mostly positive experience.</p><p>I have recently been dabbling with whippits. They are my favorite 'fun' drug. Better than weed now. We used a cracker to open up a whip cream charger into a balloon. I exhaled all the way and then took the balloon and inhaled its contents. I could not get the whole balloon, but I think that's ok. I inhaled/exhaled about 5 times and then took a breath and tried another 5 times. The best description of what happened to me is that everything was vibrating. Especially myself. There was definitely an auditory hallucination comeing from nitrous. It sounded like a helicoptor, or (more easily described in person) - waw waw waw waw waw waw</p><p>My whole body goes a bit numb, especially my mouth and upper lip. I want to laugh and its a genuine laugh. It's the mysterious laughter that comes from salvia. The nitrous just makes me feel good. It's almost like an entire body orgasm. Because the skin is lightly numbed, touching my face and the broad parts of my body feels good. It looks hilarious to other people which in turn propels me in to more laughter.</p><p>The most intense portion of the 'trip' was 20 seconds. After that it tapered off for maybe a minute and then one more minute of a slight feeling. There was a little bit of an after-glow but it was not very significant.</p><p>The other thing I can vouch for is the addictiveness. I know why they call it hippie crack. Left to my own devices I could see myself becoming a fiend. However, I have tried to train myself not to become addictive in nature. Bottomline -- this stuff was fun.</p><p>My only worries is the notorious black oily substance inside the bulbs. I have thought of a few ideas that might go into the works that would possible clean the air. One is a screen over the cracker end and the other is a nitrous bong. If I ever do make the nitrous bong I will be sure to post it.</p><p>Side-effects</p><p>----------</p><p>Not many. I am noticing a slight pain in my eyes, but nothing serious and might not be from the nitrous. I also feel kind of dumb. Sluggish and without the feeling of being 'sharp.' Aside from that I have not really felt anything that noticable. For the record however, I have only done about 8 total and from 2 different brands.</p><p>Side-effects II (added before submitted)</p><p>--------</p><p>After doing just two, but each time not taking any oxygen during the huffing I was left</p><p>with an uncomfortable hangover. I had eaten just before the whiptrip and I was feeling</p><p>nauseous as well. This usually does not occur when I take a breath of air half way through my balloon.</p><p>I have also noticed that sometimes after a few whippits my vision is filled with sparks. Theyare pretty interesting. Very tiny sparks all over the place and relatively quick. This is not while I'm on nitrous, but even up to 10 minutes later. At first I was even able to mistake this spars as real, but half knowing that I was imagining it.</p><p>Cheap brand = dirtier gas</p>",
 "year": "2006",
 "id": "54101",
 "gender": "Male",
 "timestamp": "2010-02-21T08:00:00.000Z",
 "views": "5931",
 "dose": [
  {
   "time": "0",
   "amount": "1 cart.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ]
}
