{
 "id": 5414,
 "title": "Nightpass",
 "date": {
  "submission": "2007-11-15T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Wooda",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "amount": "8 hits",
   "administration": "IV",
   "substance": "LSD",
   "form": "gel tab"
  },
  {
   "time": "0",
   "amount": "80 mg",
   "administration": "IV",
   "substance": "Pharms - Oxycodone",
   "form": "ground / crushed"
  }
 ],
 "report": [
  "I will relay the details of my experience in full detail. Think twice before trying to replicate as my methods are not the safest to use. At the time these things occurred I was ill and in fact hospitalized. Not after, but during and in fact this is the motivation I felt at the time to try this trip, simply put I wanted to step out of the hospital, but had total bedrest ordered. With location explained I would like to add that I was in a private room and had been there for some time. I was perhaps a little bored with my current surroundings, and also very interested in the effects of LSD on the mind in regard to dealing with a lack of new thoughts or ideas. I thought that if I could maybe think more period that perhaps positive thought needed for healing would be an incidental. Which it was.",
  "I decided to do this on a weekend during a 11pm-7am shift with a nurse and aid taking care of me that I knew and for the most part trusted, I did not want to freak in front of those that I would have to worry about calling the doctor or an ambulance or charting that I was acting weird since if all went well I would indeed be acting very strange. I thought of telling them ahead of time, but decided against that and began to plan. One week after I decided to do this with skeleton crew in place I began to take my medicine.",
  "I had wanted to try IV LSD after hearing stories from a friend that was living in San Fran during the drugs first day's administering it through injection in an IV catheter  that he and many friends left in for this and other substances. I began by taking 8 Gel panes of LSD said to be at 125ug per and placed them in a clean glass vial with 3ml of sterile water and stopped the top with my finger and mixed until all the gel had settled out. I then placed a clean cotton ball in the vial and drew through it to filter out any solids that might be left over from the mixing (i.e. gelatin.) Having drawn out over 90% of my initial 3ml of water I was satisfied and moved on to my Oxycodone.\r[[Erowid Note: IV injection of crushed pills/tablets can be very dangerous due to unknown binders and fillers present in the tablets.]",
  "For this I crushed an 80mg Oxycontin tablet and placed in a small glass vial with 2ml of sterile water and mixed with a sterile cotton swab then drew the liquid out through the swab and with a satisfactory amount recovered from my 2ml I set it aside. I then took three 10mg Valium orally and set back and waited for them to kick in. At the time I did this I was on several other medications, and a few may have influenced my results. Here is a quick list of the dailys, Oxycodone 80mg twice daily, Valium 20mg every 4 hours, Protonix 40 mg daily, Vit-C 500 mg daily, multivitamin, IV Ancef 1g daily, Oral Levaquin 500mg twice daily, detrol 2mg daily, Oral promethazine 75mg 4 times daily.",
  "Well with the background layed here I go: After the nurse came around and took vital signs (11:30pm) I asked for some privacy and had her close the door to my room. I then layed out all my supplies (the LSD solution, and Oxycodone, and sterile water for a flush through my IV) and prepared myself. After swabbing the IV port with alcohol I inserted the LSD and began to slowly inject it. The response was almost immediate, I had a rapid increase in heart rate as well as blood pressure which I was prepared for, per the advice of my friend which is what the IV oxycodone was for. I injected about half of the Oxy and felt much more comfortable.",
  "At this time it had only been about ten minutes and already my perception was radically different, things began to simply change and I had indeed stepped out. I for the first time began to have completely uncontrolled thoughts and then these thoughts began to manifest themselves all around me. It was very crazy, and the sweat was like a flood I hit the call light and had the aid open the window. With the window open the sounds of the night came in and sounded almost musical, I decided that I needed to focus and tried to meditate, but I was way too conscious of everything to blend and was at a steady run, much different than other methods of use with LSD. It seemed that I was were I was going in only 10-15 mins and felt as if it would last forever. With the confusion I decided TV would be interesting and started to watch several hours went by and at around 4:30am I felt my madness slip away, and thought everything was back to normal.",
  "I was wrong. My visual perception was very actively creating things that were, well not there, but my mind knew them to be false and they leave only to be replaced. The exception was the television I later spoke to my brother and talked about a program with him and described events that in fact had not been there. Very strange to imagine that you are in touch with reality and in fact not even close. After about 13hours me and my body reunited.",
  "I have to admit I was surprised at the difference between this and say simple oral ingestion, but not negatively. Outside of the uncomfortable heart rate increase I felt the mentally this was much more rewarding than oral experiences, however I will not change to this mode of use since I am talking of a resting pulse hovering around 200 beat per min, far too high for comfort and I am sure high enough to cause serious damage. I will never regret this as a trial and still look back and smile."
 ],
 "erowid": {
  "id": "32258",
  "citation": " Wooda. \"Nightpass: experience with LSD, Oxycodone & Valium (ID 32258)\". Erowid.org. Nov 15, 2007. erowid.org/exp/32258",
  "substance": "LSD, Oxycodone & Valium",
  "views": "17601"
 }
}
