{
 "title": "Cat Drips Out",
 "author": "Calgary",
 "citation": " Calgary. \"Cat Drips Out: experience with Catnip & Mugwort (ID 54168)\". Erowid.org. May 8, 2008. erowid.org/exp/54168",
 "substance": "Catnip & Mugwort",
 "bodyweight": "",
 "report": [
  "<p>I was looking for another form of smoking as I had to give up normal ciggies for the sake of my girlfriend and for my health, my girlfriend said for my to try catnip, so I went to a expo and they was selling catnip, so I bought the bag and I seen a bag of mugwort as well and I wanted to see what else herbs could do for me and in the sense of sleeping. So I brought a bag of that to.",
  "So that night I got 2 big pinches of catnip and one pinch of mugwort put it into a bowl and cut it up, mixed it and put it into to a water pipe to be smoked. Within the hour I had smoked the entire bowl of catnip and mugwort. It was very different to what normal ciggies feels like when smoked. I had hot boxed my room and the smell of the smoke that was in my room must of drawn the cat to where I was sitting on the bed. She rolled around and did playful kitten things and went to sleep next to me.",
  "15 minutes after the 1st bowl, I had the same mixture again and hoped on the computer talk for a while and I noticed that I was making more mistakes than normal and that my eyes were lagging. It like when you move a camera really fast and the pictures cant keep up with the camera.",
  "The cat moved of the bed to meow at the door to be let out, so I got up and the feeling was like I had too much to drink. So I let her out and went back to my bed where I put my head to the pillow and I went to sleep and had the most strangest dream where I can control what was happening. The next morning I woke up to fine the I could still remember the dream.</p>"
 ],
 "year": "2006",
 "id": "54168",
 "views": "12377",
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Various",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2008-05-08T07:00:00.000Z"
}
