{
 "title": "Low Dose 2C-T-7 as MDMA Alternative",
 "author": "Gandolf",
 "citation": " Gandolf. \"Low Dose 2C-T-7 as MDMA Alternative: experience with 2C-T-7 + GHB (ID 5419)\". Erowid.org. Jan 5, 2002. erowid.org/exp/5419",
 "substance": "2C-T-7 + GHB",
 "bodyweight": "185 lb",
 "header": [
  "DOSE: T+ 0:00",
  "10 mg",
  "oral",
  "2C-T-7",
  "(powder / crystals)",
  " T+ 4:00",
  "1 hit",
  "oral",
  "GHB",
  "(liquid)"
 ],
 "report": "<p>Over the last year, I've grown increasingly dissatisfied with MDMA, not because of any diminishing returns in terms of effects, but because of the potential for neurotoxicity, of the outrageous street price (US$ 20-30/dose !!! I mean please!), and because of the  transient depressive states two days after rolling. So I've been looking for an alternative to use when I go out dancing. 5-Meo-Dipt is hit or miss for me, sometimes I feel great, other times cranky, anxious, and nauseous... GHB is fun, but doesn't pack enough of a punch for an all niter. Pot gets me too paranoid, and I feel foggy the next day. Etc, etc, etc...</p><p>Enter 2c-t-7. I have tried this substance at psychedelic doses of 15-25mg, and generally enjoyed it, but would not try it out in public. The other night, I decided to experiment with a small dose in the context of a clubbing event. I went with a friend who was not doing psychedelics, and felt comfortable that he could assist me out of the club and back home should something unpredictable have happened.</p><p>I dropped at 11pm, and we arrived at the club at 12:30. My friend had smuggled a couple of doses of GHB in his shoe, but I was very at ease when the bouncer searched my pockets for drugs... little did he know that I had already consumed a substance that would be coming on in about a half hour, and hopefully last through the night. When I emptied my pockets, I felt like saying 'look Ma! no drugs' ;)</p><p>Anyway, the 2c-t-7 hit about 1 am, very very subtly, just in time for the visiting DJ's much anticipated appearance. I did not get any visuals, just a slowly increasing calm euphoria that seemed to build in my chest. This was very mild, and I could easily ignore it. When I focused on it, the music unfolded beautiful emotional currents of energy throughout my body. This was not the ecstatic flooding of MDMA, just a gentle, friendly push; enough to carry me through the evening with a content smile on my face. At about 3am, my friend gave me a bottle of water, winking at me rather obviously... and so, the GHB shifted my happy state to a flirtatious one.</p><p>We left the club about 5 am. I let my dancing companion drive me home, as I admired the scintillating lights of the city across the bay. Everything seemed perfect. My body felt very alive and happy. I was calm and lucid, and reflected on how the dancing had very much helped me through some emotional and physical blockages. I got home and easily fell asleep around 7am.</p><p>After this experience, I will seriously look at 2c-t-7, not just as a strong psychedelic, but also, at smaller doses, as a gentle yet powerful alternative to MDMA.</p>",
 "year": "2001",
 "id": "5419",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-05T08:00:00.000Z",
 "views": "25106",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 4:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 }
}
