{
 "id": 5421,
 "title": "Wrathfulness of the Vine Serpent",
 "date": {
  "submission": "2007-07-23T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Mr_Gubjet",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 joints/cigs",
   "administration": "smoked",
   "substance": "Passion Flower",
   "form": "(flowers)"
  },
  {
   "time": "3:00",
   "amount": "70 seeds",
   "administration": "oral",
   "substance": "Turbina corymbosa",
   "form": "(seeds)"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Last night I had a wrathful experience with the Virgin seeds.",
  "3 hours before I ate the Virgin seeds I smoke a spliff filled with passion flower blooms. The passion flower made me very tired. Weird kind of tracers. So I smoked some doja to cancel out the strange effects of passion flower.",
  "Ok here it starts with my wrathful yet highly spiritual experience starts:",
  "I put 70+ fresh seeds in honey. Chewed them down. I felt the Vine Serpent enter me as soon as I swallowed. My heart was beating. Feelings very one with the universe this day. I felt the divine.",
  "My room mate wanted me do to a shamanistic work on her. She was on her Moon blood also. I did healing with my magic rock I use for pre-shaman work. I cleaned her and she asked to take all negative vibes of her. I did this very well. After this work I felt very drained, I used a lot of power on healing. I lay there on the couch. Just completely wiped from my healing work.",
  "Time is almost at a stand still as I can feel the wrathfulness of the Virgin seeds creeping up on I. I start to feeling very odd. Very spiritual state nevertheless. I felt my Ego fading away into the cosmos. I was afraid as it was so powerful. I was coming up still its only been 10-20 minutes. I say to myself 'I think I took to much'. I try to make myself vomit all the negative vibes that came out after healing.",
  "Everything was %100 wrathful at this point. I said to myself 'I feel like im going to die'. I can't even put it into words. Just that feeling of void. I tried to make myself throw up but coludnt. I tell my room-mate what I have taken, she puts me in a hot shower to make it run through my system faster. The hot then cold shower made everything grounded.",
  "I came out feeling very rough. I start seeing things wave and grow. I feel very still and my mind isn't racing around like with most entheogens. I lay down on the ground with a blanket in fetal pose. I just laid there for a long time. Thinking about the universe. How it has no start and no end. Like when you look at two mirrors facing each other and see a refection of you to infinity. I was blown away by this. I moan and roll around on the floor. I look up at the stucco ceiling and see south american temples and jungles everywhere. I lay there with my eyes close with beautiful CEVs I can't recall.",
  "After laying there for 2 hours, I decided to have some Ganja. It was fun by no mean. But a great lesson and experience. I felt something with I, and just more then the Vine Serpent. I felt like God was showing me the wrathfulness of Deity. I felt like I was sinking into the ground. My mind was very clear with no human clutter of any-kind. Thinking of time vs eternity. How they contradict each other. I smoke a little bit more. Feeling as my Ego was almost %100 not there.",
  "I wake up my room-mate to go to bed. So I smoke some more (mind you I've hardly had any). This was not trippy at all. This was the wrathful part of Deity for sure. I look up at the stucco and see many Mayan temples with people on the top of them. I wasn't tripping in any form or way. I felt I was in a super natural world. Everything was waving and pulsing. I didnt have much visions, but the ones I did had powerful meaning. This was not a psychedelic experience but an entheogenic one. I was totally in a almost non-Ego state.",
  "I lay down in my bed with the lights off. Everything looks so surreal and like a piece of art with the lights off. Everything is waving in purple, blue, red. Everything feels like a vivid dream. I felt highly at wrathful bliss. I feel at peace. I go into a strange delirium type of sleep. The virgin seeds don't have a speedy type of experience at all.",
  "I lay there in a strange delirium for 5 hours. I woke up at 9 am, drank some coffee and ate some rice. The after glow is very nice. The vine serpent is still with me at this moment even after the psychoactive effects goes away. In the day before my experience I was reading this book called 'Where God lives'. It talked about children who had NDEs (Near death experience). I think I got a small taste of what it is like to die. I think I was near that threshold of ego death. All in all the experience was like death and rebirth."
 ],
 "erowid": {
  "id": "32281",
  "citation": " Mr_Gubjet. \"Wrathfulness of the Vine Serpent: experience with Turbina corymbosa, Passion Flower & Cannabis (ID 32281)\". Erowid.org. Jul 23, 2007. erowid.org/exp/32281",
  "substance": "Turbina corymbosa, Passion Flower & Cannabis",
  "views": "15293"
 }
}
