{
 "title": "The Ghost of Christmas Past",
 "author": "Jake",
 "citation": " Jake. \"The Ghost of Christmas Past: experience with Salvia divinorum (20x extract) (ID 54230)\". Erowid.org. Dec 13, 2008. erowid.org/exp/54230",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "180 lb",
 "report": "<p>It was Christmas day. I was at my Dad's apartment. He had bought the salvia extract with me a few days earlier as a Christmas present. My Dad and I smoke weed together all the time, so this wasn't strange.</p><p>I decided to go first. I sat back on his couch, sprinkled some in a bowl, took a deep hit, and held it in. I became extremely light-headed and felt as though I was being pushed backwards down a long tunnel. I said, 'I feel like I'm gonna passssss ouuuuuttt.' Actually I heard myself saying it, but I didn't feel like I was actively participating in saying it. Then, I blacked out for a second.</p><p>When I came to, I looked up at my dad who was standing directly in front of me. Suddenly everything in the room flipped sideways as it all blended together. I felt as though I was floating above never-ending rows of bookcases. I also saw some kind of humanoid insect creature that was floating with me, I think it was my dad. The most frightening thing about all this is that it all felt extremely familiar. It felt as though I had been in this strange universe my whole life. I felt as if there was no escape.</p><p>After the bookshelf incident, I think I closed my eyes and then looked up again, because suddenly I was back in my dad's apartment and he was still standing in front of me. But not for long, before I could gather my thoughts, the pattern on his sweatshirt spread across my whole field of vision. I could still sort of make out objects, but everything was covered in the same pattern. This also felt extremely Deja Vu'ish. It was so frightening, I went still.</p><p>Though I don't remember it, I believe this was the point where I started to say said 'No, I don't want to go baaaack' I trailed off at the end, and evidently, I did go back. The next thing I remember was my dad sitting next to me trying to calm me down. He said I looked more frightened than anyone he's seen in his life. Pale, shaky, sweaty, the works. I felt so cold and empty inside. I had absolutely no idea how long I had been gone. It felt like both an eternity and just a minute. For the record it was about six minutes.</p><p>I started crying, I'm not afraid to admit it. It wasn't a hard cry, it was a weak whimpering cry. I felt like I had been to hell and back. I had perspired so much that I was freezing cold, I had to take a shower. After the shower I got in my dad's bed and just tried to calm my nerves. I still felt so empty inside. I called my mom and sister and let them know I was OK, even though they had no reason to believe otherwise. I guess that telling them I was alright was reciprocal. It took about an hour to fully recover, but I still felt frazzled for a few hours. The trauma had fully worn off by the time I went to a friend's Christmas party that night.</p>",
 "year": "2005",
 "id": "54230",
 "gender": "Male",
 "timestamp": "2008-12-13T08:00:00.000Z",
 "views": "7019",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
