{
 "id": 5426,
 "title": "The Best Way to Ingest",
 "date": {
  "submission": "2007-01-10T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Platinum",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.7 mg",
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I recieved 500 mgs of 5-meo-amt. This chemical is very tiny and the dose is extremely small. What I did was take a visine bottle and count out how many drops came out. I wasn't crazy about putting the stuff in a large amount of alchohal because I can't fathom drinking milliliters of grain alchohal. 375 drops came out of the visine which was perfect. I then rinsed the bottle out and put a little less than 500 mgs in (some was stuck in the bottle).",
  "Then I added the 153 proof liquor to the mark where the drops ended. The 5-meo-amt is very soluable in alchohal. It dissolved almost instantly. I shook it anyway, and let it sit for a few hours. The chem was still dissolved. I shook it, and dropped 2 drops on my toungue. The chem was tasteless and absorbed right on my tongue. I think the alchohal might have numbed the taste and made for easy absorbtion.",
  "Within 20 min I felt something, but I couldn't pin point it. I had no nasuea during the trip, which was mild and only about 7 hrs long. I had mild trails, color enhancement, and minor patterning. I ate 4-aco-det the night before so I probally exhausted my tolerance. I will wait a week and try 5 drops. I am currently storing the solution in my freezer, and it hasn't froze. I am still nervous about freezing it, but I figure it should preserve it for a long time considering 500 mgs of 5-meo-amt is not something you can use up in a week."
 ],
 "erowid": {
  "id": "32292",
  "citation": " Platinum. \"The Best Way to Ingest: experience with 5-MeO-AMT (ID 32292)\". Erowid.org. Jan 10, 2007. erowid.org/exp/32292",
  "substance": "5-MeO-AMT",
  "views": "6995"
 }
}
