{
 "title": "The Velvet Void.",
 "author": "Cw.",
 "citation": " Cw.. \"The Velvet Void.: experience with LSD & Meditation (ID 54288)\". Erowid.org. Apr 4, 2007. erowid.org/exp/54288",
 "substance": "LSD & Meditation",
 "bodyweight": "76 kg",
 "report": "<p>With last night still fresh in my mind I set down to write this report. Sprawled across the table are a series of my notes and diagrams that desperately tried to express what I had experienced.</p><p>The night had been several weeks coming and considering the hectic events of that evening its a wonder things didnt go astray. The man who Id planned to trip with fell ill after visiting some friends, but kindly agreed to sleep nearby in case I needed anything. This was agreeable for me because Id played with the idea of taking LSD alone for some time, but never found a safe opportunity. It turns out that being by myself for long periods turned my experience inwards, to much greater effect!</p><p>Id had some internal anguish recently, and so had been practicing meditation. However I always found a sticking point, some kind of impassable veil where energy would just build up and frustrate me.</p><p>While coming up I drew pictures, did some light breathing exercises and listened to Pink Floyd. I was so comfortable, as time progressed I felt a brilliant uprising of love in my heart which I documented in full on my notepad. Then, as I felt like I was under full influence of the drug, I got into an upright cross-legged position and started to meditate. I used the mantra 'om (for the inhale) ah (for holding the breath) and hum (for the exhale)' which helped to focus my mind.</p><p>Some 10 minutes of meditation later I felt a strange sensation. My entire body had become numb, I knew it was there but I was unattached. Slowly where I was started to drift away from where my central nervous system seemed to tell me my body was. I was floating back and to the right. At first I was terrified, then relaxed, re-focussed on the breath and continued. As I floated further away, my mind started unravelling exponentially until it filled what seemed to be all of space.</p><p>My mind was clear of all distraction, I was perfectly focussed. My entire essence was akin to softly rippling white velvet. I was no longer in the room, there was no up or down. I existed purely to be embraced by this nothingness. It was such a wholesome, inviting, peaceful place I didn't want to leave. I heard people talking, but continued to revel for a while before I slowly brought myself back.</p><p>That was what I was looking for! Absolute peace from absolute nothingness. After sharing my discovery with my friend he encouraged me to continue and see if I could simply 'slip back'. As soon as I started to focus my mind, I was almost immediately back. It was there all along but I wasn't able to notice it before.</p><p>The music playing was Jean Michel Jarre's Oxygene. I enveloped myself in this nothingness again when suddenly my body felt something strange. My index and middle finger (resting on my forehead) seemed to be sinking inside. I felt the energy running through me like a circuit and my hand went further and further into my head until it was entirely inside, in my brain. My entire body was coursing with energy, the nothingness velvet was furiously pure and empty.</p><p>After spending a while in this state, I brought myself back again to talk about it.</p><p>I was able to replicate this a few times, the sensation was incredible, though I was only able to do so in a concentrated meditative state.</p><p>The rest of the trip was spent reading, listening to music and meditating. I still couldnt believe what Id experienced. In the morning I was filled with an incredible sense of wholeness. I sat out on the lawn and greeted the first rays of sunlight until it was beaming full in the sky.</p><p>Next time, Im determined to delve even deeper into the possibilities provided by meditation in the midst of an acid trip.</p>",
 "year": "2006",
 "id": "54288",
 "gender": "Male",
 "timestamp": "2007-04-04T07:00:00.000Z",
 "views": "5822",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
