{
 "id": 5432,
 "title": "Elephant in a Pipe",
 "date": {
  "submission": "2004-03-29T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Jamshyd",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "My experiences with 5-MeO-DMT are all negative and I am now convinced that this compound, to me at least, is garbage. Here is a summary of experiences, each spaced at least one week apart.",
  "My first attempt was with 10 mg vapourized in a lightbulb, and took it all in 1 hit. I later discovered that I didnt vapourize it completely, so I probably only inhaled 5 mg. My heart raced and there was a very sharp tinnitus coupled with a disgusting feeling of pressure on the head.",
  "My second attempt I added 10 mg to the residue that was in the lightbulb from last time, totalling approx. 15mg. I made sure it was all vapourized this time. I took it in 2 hits. By the time I took the second hit I was actually in pain I could only call it spiritual pain. All the symptoms from the first time here present, much strongest, plus the pressure was all over my body, and it felt like I was going to implode at anytime. In other words, it felt like I was sinking to the bottom of the ocean at a very high speed. This applies to a sensation of suffocation too. I will also note, and this is very important, that I felt this took no more than 10 mins when in reality it actually lasted 30 mins, which in my opinion is a blessing (and unique, since most psychedelics seem to stretch time).",
  "For my third attempt I tried rectal administration. I took a solution of 20 mg. After about 20 mins, I suddenly went into a headspace not unlike a 1st plateau DXM trip. It lasted about 20 minutes and quickly faded away. There was only at one point a slight rippling with eyes open. With eyes closed, there where very inactive and faint visuals. And of course, there was the signature 5-MeO-DMT tinnitus. But not much of the discomfort. This experience was useless to me. I might add that I suspect there is probably MAO activity in the rectum, however not nearly as strong as that in the stomach, since I DID get some effects, but they where nowhere near as strong as what people describe 20 mg insuffated.",
  "My fourth attempt was with insufflation. I divided 10 mg into 4 equal (visually) lines so as to avoid any pain. I took the first two, one in each nostril. There was a very slight peppery sensation but nothing that I couldnt handle. About 10 mins later, I was at a +, the burning subsided, and took the other two lines in a similar manner to the first two. Within the next 10 mins I was up to a definite +++ which surprised me. This lasted for about an hour (!). It was somewhat psychedelic mentally, and there was very slight rippling sometimes and a bit of colour effects. The CEVs where much like the third time. There was a slight body load with some nausea. This route could be promising (read below), but I can achieve much better states of mind with much less hassle using other compounds.",
  "For my fifth attempt, I decided to give smoking one last chance. I put 20 mg in my lightbulb and vapourized it completely. I took it all in 4 hits. This was identical to my second try only ten times worse. I will note that there where absolutely no psychedelic effects in any of my smoked attempts, only a feeling of general yuckiness. Again, this felt like 10 mins when it actually lasted 40 mins. After that went away I decided that this compound is totally useless for me and I will not consider trying it again via this route.",
  "I have 20 mg left of this material. I will, at some point, attempt to insufflate this whole amount in a similar manner to my fourth attempt, and see where that goes. This probably wont be soon, though.",
  "I will also note that after EVERY try, there was a consistent set of after effects, most of which I actually enjoy. It leaves me in a good mood for the rest of the day. In fact, it is pretty euphoric for about an hour after the comedown with a marked light-headedness. For the next two days, childhood memories seem to flash randomly and very vividly. This is probably THE most special effect this compound has on me. Is it worth it though? Not a bit :). I will also add that there is always a horrible headache at the back of the head the day after."
 ],
 "erowid": {
  "id": "32312",
  "citation": " Jamshyd. \"Elephant in a Pipe: experience with 5-MeO-DMT (ID 32312)\". Erowid.org. Mar 29, 2004. erowid.org/exp/32312",
  "substance": "5-MeO-DMT",
  "views": "13409"
 }
}
