{
 "title": "Dangers of the So-Called 'Safe Drug'",
 "author": "Bridgeta",
 "citation": " Bridgeta. \"Dangers of the So-Called 'Safe Drug': experience with Nitrous Oxide (ID 5435)\". Erowid.org. Apr 1, 2001. erowid.org/exp/5435",
 "substance": "Nitrous Oxide",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "6 carts.",
  "inhaled",
  "Nitrous Oxide"
 ],
 "report": "<p>Last year, a few friends and I scored an awesome summertime job at an old-fashioned ice cream parlor.  We had applied because of the many prospective benefits the job offered - working with friends, getting tips, and of course free ice cream.  Once we began working, however, we discovered an additional advantage that we hadn't counted on - whipped cream cans.  LOTS of whipped cream cans.  I had never tried nitrous before - it had always seemed kind of childish to me compared to acid or shrooms.  But my friend Tina reassured me that the high would only last a few</p><p>seconds, and after hearing her talk about the effects, I agreed to try it.</p><p>So after closing that first night, Tina and I each snuck a full can into the bathroom, and huffed together. At first I felt nothing, and I started to cross my eyes at Tina to tell her how stupid I thought we were being - and then it hit me.  Tingling, numbing sensations shot up and down my entire body, and I was hit by an incredible rush of the most intense euphoria I've ever experienced.  My vision began to blur, and black dots danced madly before my eyes.  The intensity quickly peaked, at which point my vision went completely black and my body completely numb.  The rush then subsided as quickly as it had come - it truly had only lasted ten or fifteen seconds.  The euphoria lasted an additional fifteen minutes or so (we couldn't stop laughing as we were cleaning up).  I instantly loved it, but was worried about killing off my brain cells.  But Tina claimed that nitrous was a 'safe drug', because it supposedly didn't last long enough to cause any damage. </p><p>So we decided to share our experience with our other friends, and the whipped  cream spread like an epidemic.  Before long, almost everybody who worked there (mostly high school kids like us) was huffing nitrous all the time. The dangers began when we discovered that we could put two cans in our mouth and huff them both at the same time.  This was extremely fun, but we didn't do it very often because we were afraid that the boss would notice how many cans were missing.  So most of the time we settled for one can each per night. One night, however, our boss was exhausted and went home early, leaving me and Tina, our co-worker Rebecca, and our manager Kevin to close up the store.  Kevin went outside to take a cigarette</p><p>break, and Tina took four cans of whipped cream out of the fridge - two for me and two for her (Rebecca is straight-edge, but she's open-minded and doesn't care if we do things in front of her).  I had a really bad headache that day, so I told Tina that I didn't want to huff.  At first she looked disappointed, but then she grinned and said, 'Well, I'll just do some cans</p><p>for both of you guys!'  and took out two more cans. </p><p>That's when things got really scary.  Rebecca and I watched as Tina lined up all six cans on the counter, and proceeded to huff them two by two.  As she finished off the last two, she smiled up at us and started to say something.  All of a sudden, her face went ashen, and she started shaking violently.  Rebecca and I were both alarmed, and kept asking her if she was okay, and she fell to the floor, her entire body going still.  It wasn't exactly like she had passed out - she was just sitting down on the floor, huddled up in a ball, and not moving, her eyes wide and horrified, staring at nothing. I panicked and didn't know what to do, so I just stood there looking down at her, scared to death that she was going to faint and maybe die.  Her eyes suddenly closed, and her lips started to turn bright blue.  At this point, Rebecca ran to the phone and started to dial 911, but before she did, I saw Tina's eyes open and her body relax.  I helped her stand up, but she was incredibly shaken, and had to hold onto the counter to keep herself upright. </p><p>Later Tina told us that things had just gotten way too intense, and that she'd had a sudden and unexpected out-of-body experience, but she wouldn't say anything more about it.  From my perspective, she had simply collapsed and stopped breathing.  Tina didn't touch another can for the remainder of the summer.  I still occasionally would with other friends, but never more than one at a time, and never without remembering the sickening image of Tina's bright blue, suffocating lips.  Please, if you're going to do nitrous (or any other substance for that matter), be careful.  Yes, it can be fun - but as we've all heard, too much of a good thing can be disastrous.  No drug is 'safe' in excess, or if it's taken to an extreme.  Your body and your mind have limits - obey them!  Peace and happy trippin.</p>",
 "year": "2000",
 "id": "5435",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-04-01T08:00:00.000Z",
 "views": "48611",
 "dose": {}
}
