{
 "title": "Positive First Time",
 "author": "Scuba",
 "citation": " Scuba. \"Positive First Time: experience with MDMA (Ecstasy) (ID 54362)\". Erowid.org. Sep 16, 2007. erowid.org/exp/54362",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "192 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 2:30",
   "0.5 tablets",
   "insufflated",
   "MDMA",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>One night, after a day of songwriting, my fellow guitarist/songwriter decided we should do some ectsasy and stay up later than our normal pattern so as to enhance productivity.</p><p>I feel it is important to note that I am a habitual marijuana smoker and that my behavior/experience on said drug seems to divert from the norm, that is I tend to have improved focus and mental energy rather than the 'zoned-out' descriptions people normally report. It may have something to do with being diagnosed ADHD as a youngster and using pharmacological amphetamines for a period of 10 years. So, when I use cocaine or similat drugs I tend to feel relaxed and content, however not to the point that I don't crave more once the peak of those highs are over.</p><p>That being said, remember I'm just one dude and the votes are still being counted when it comes to MDMA experiences. There is, also, in my neck of the woods, commonly reported that doses of ecstasy are laced, cut, etc. with cocaine to 'enhance' the high. Assholes! I'll mix my own cocktail, thank you. Too many bakers, not enough fruitcakes, as Jimmy Buffett once lyricised.</p><p>And now the main course, boys & girls. We each ingested one tablet, chased with 12-16 fl. oz. of water shortly after the midnight hour. We had been drinking beer earlier in the day, but enough time had elapsed that we'd passed the alcohol thru our systems. We also had not been 'pounding' the brews, as is customary in the ruralia I occupy, so the fatigue factor was minimal before starting the ecstasy trip. Onset occurred within 45 minutes of ingestion, which is about the same time it takes for me to metabolize other ingested drugs, with the exclusion of alcohol.</p><p>Firstly, I noticed a feeling of slowness, not drowsy but rather of experiencing every second in greater detail. 'Enhanced perceptive focus' may be more accurate.  A definite 'headrush' became present and lasted throughout the trip. Concentration, patience and dexterial fluidity were greatly enhanced. After playing for eight hours already, my hands were pretty limber. I felt as though I could tackle any Randy Rhoads or Steve Vai solo! Take the dexterity note with a grain of salt. I wouldn't try juggling knives or playing baseball on this. The focus and contentment reminded me of cocaine, but as those sensations lasted longer and were definitely unique to any stimulant use I have done, I surmised that the pills were the genuine article, though we didn't test them. </p><p>As I was learning completely new material my friend had written, the high I describe was quite useful. I was able to retain much better and learn quicker than I usually do. The empathic effect of the drug was not noticable in an interpersonal maner, but I was surprised how easy it was to expand and modify various riffs with an uncommon ease. Mind you, the music we were working on is a sort of progressive metal, and not simple stuff.</p><p>I noticed a 'bada-bing' quality of lights. My visual field was far more sensitive that have experienced before. Body wise, I felt sensitive to movement in a way that made me remark, 'How the hell do people dance their asses off at raves on this?' I was far more content to be sitting down.  That may have something to do with the activity at hand, but the peacefulness of the high made the very idea of any rapid movement or contraction of large muscle groups seem unpleasant.</p><p>I have heard that ecstasy increases sensitivity of nerve endings, thereby enhancing the pleasure of the tactile senses, but I didn't really notice that. I did feel a little shaky in my muscles and joints, I felt keenly aware of my insides, like at the end of anaerobic/aerobic activity. This reminded me to keep pace with fluids.  On that note, ecstasy does raise body temperature, and feverish effects were felt i.e. jaw-shaking (ever been in shock before? Kind of like that without the need to be in extreme physical pain). Some may find this unpleasant or distracting to the point where they are unable to focus on the positive effects, but I liked it, no apologies.</p><p>Two and-a-half hours later, we cut a third pill and divided it between the two of us and snorted it. Wow!! Headrush cubed!! Very intense slowing effect, feverish/shocklike sensations increased and, oh yeah, the drip(!) We practiced on the high for about 4-5 hours, but by 5:30-6a.m., I just crashed. New experience for me. Hit a mental wall. Conversation and guitar-playing were out of the question.  So we watched some Dragonball Z and 'came down' as is our custom when ending a bender. I don't know what it is about that damn show, but at the end of a hallucogenic trip or when running out of powders, it really helps me have a 'safe landing.' I can't dig DBZ sober, even though I have many friends who adore it.</p><p>Got a nice 7-8 hours of sleep. I awoke feeling sore, akin to lactic acid buildup in the muscles and probably aftereffects of dehydration and fever. Mentally, I was a little cloudy but not spaced out like shrooms or DXM or other pharmaceuticals.  I was warned about feeling a drop in seratonin levels for the next couple days, and I have had severe depression in the past so I was worried about 'the hangover' but, I felt fine. </p><p>About depression I have to add a small pschedellic success story. The first time I did mushrooms I had the classic apocalypse trip, just damned awful, but, by choice or design, I have not experienced any 'clinical' depression since (about 14 months). It's been easier for me to optimistic and I've been more caring towards the people in my life. Maybe that's the residue of seeing the end of the world through a picture window, but that experince was totally a spiritual shot-in-the arm. I abandonned agnosticism on the spot, pretty much!  </p><p>Final notes on MDMA: I found to be pleasant, useful and not as harsh or mind-bending as I was perpared for. I'd do it again in a heartbeat!</p>",
 "year": "2006",
 "id": "54362",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-09-16T07:00:00.000Z",
 "views": "5708",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
