{
 "title": "Negative High",
 "author": "SacredSilverHaze",
 "citation": " SacredSilverHaze. \"Negative High: experience with Cannabis (ID 54378)\". Erowid.org. Oct 7, 2007. erowid.org/exp/54378",
 "substance": "Cannabis",
 "bodyweight": "145 lb",
 "report": "<p>I'm going to tell about my experience smoking cannabis last night (July 5th, 2006) because nothing like it has happened to me before that I can remember. Anyway, a little background. For a span of about 5 years I was a pretty dedicated smoker. All my friends were potheads and I was too. Every day I would hook up with at least one friend and if I didn't have a bag, they did, and we'd smoke up through most of the day. Most of the time it was purely recreational. I didn't think there was anything wrong with smoking every day and still don't as I'm pretty much a kind of 'do whatever you feel like' person. But in the past couple years I've barely smoked at all except very occasionally. I don't know if I just grew disinterested or what but it's rare anymore.</p><p>My dad rolled me a joint last time I saw him (a few days ago) of what he said was really good stuff, no paranoia just a great high, etc. so last night I decided to check it out. I smoked about 75% of the joint he gave me and within minutes started to feel the familiar mild head buzz coming on. Within about 5-10 minutes I was full on stoned. I was so high that my equilibrium was way off and when I walked, I kept feeling like I would stumble. Everything I did was impaired in some way. I thought 'Wow, this IS good stuff.' I decided to just put on some music and try to zone out for a while since doing anything else was pretty much out of the question for now.</p><p>I put on Camel's 'Mirage' album and was blown away by the genius of the music and production, considering that it was especially impressive for (I think) 1974. Then I listened to their Moonmadness album. But while I was listening I started thinking too hard about stuff. It had nothing to do with the music, it just happens sometimes because I tend to overanalyze things occasionally. It's a blessing and a curse. Anyway for some reason, all the negativity I have inside came to the surface and I was surprised how much negativity I had been harboring. I think of myself as a pretty laid back positive person, so I was taken aback by my own bad vibes here. Really I was plain shocked and pretty depressed about it.</p><p>I started really dogging myself out in my mind, and being really critical and cynical about everything in my life, the people, the things they do and say, especially me. Every single thing in life that crossed my mind was criticized by this sickening sarcastic voice in my head and I didn't know if it was my own inner voice or something else. I thought 'This can't be me thinking these things, I am way too relaxed.' Mostly I hated myself and felt like the only reason people must keep me around is because I'm so retarded that it is really amusing to them. I noticed a pattern of becoming friends with people for periods of a year, sometimes maybe more, and then they fade. I felt totally isolated from everyone I know.</p><p>Then I thought, maybe it's not that I'm just their entertainment, maybe they fade because I have a million walls up and won't let anyone really get to know me. That was a revelation and it hit me super hard because I knew it was closer to the truth. I know that I hide in myself and don't really let people see who I really am all the way. No one would have any reason to hate me, one of the few things I'm proud of is that I treat everyone with respect and pretty much let them be who they are. Except myself I guess.</p><p>During it all I was thinking 'Where is all this negativity coming from and why can't I make it go away????' It was really frustrating because every time I tried to distract myself, it didn't work. The negativity kept coming back and it got to points at times where I was nearly having anxiety attacks. I should have phoned a friend or something because I know I would have been proven wrong just by talking to a friend, and even while this was going on I knew it was just weird paranoia and issues surfacing that I need to deal with, but the thoughts were so exaggerated and I was so lost in it that I couldn't do anything but wrestle with it half-heartedly while at the same time trying to ignore it.</p><p>I should note I've also suspected for a while that I may have a sort of allergy to cannabis because I sometimes get bad headaches and my throat sort of closes off somewhat making it difficult to breathe, talk, or drink water. Maybe that was a factor too. Maybe those are normal effects though, I guess I should do some research and find out. Anyway I finally just figured it was a very negative high, a totally wasted buzz that by this point was beyond salvaging so I went to sleep.</p><p>Both good and bad came out of this experience. It was almost like a real bad trip in some ways because my ego has never been so shattered. I wasn't just humbled, I was humiliated to even be who I am. That was a terrible feeling, but the good thing is that I did end up considering some legitimate issues that I need to work on in order to be more at ease with myself and with the idea of other people knowing me better. My mind is already working out solutions to the problems I was forced to consider last night. It was definitely a learning experience.</p>",
 "year": "2006",
 "id": "54378",
 "gender": "Male",
 "timestamp": "2007-10-07T07:00:00.000Z",
 "views": "3741",
 "dose": [
  {
   "time": "0",
   "amount": "0.75 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
