{
 "title": "I Winged the Dose",
 "author": "Wes",
 "citation": " Wes. \"I Winged the Dose: experience with Brugmansia (ID 54395)\". Erowid.org. Sep 4, 2006. erowid.org/exp/54395",
 "substance": "Brugmansia",
 "bodyweight": "120 lb",
 "report": "<p>It all started out with me looking this plant online when I found out it was a drug  I decided to try it.</p><p>When it was dry, I went to my friends house with it but it never said the dose, so I winged it. I took about 4 grams of and put it between some gram crackers. In about 15 minutes I started to feel really different kind of like I was becoming drunk. But the day just kept getting weirder. Then me and my 3 miscellaneous friends went out to smoke some ganja. We had to walk to a field to smoke and it started to get hard to walk in a straight line. And when we finally did get to the corn field I was unable to pack a bowl so I asked my friend to pack it, and when he did he gave it to me. But when I did hold it I wasnt able to hit it.</p><p>So I just went with it and it got a little weirder. The next thing I remember I was it was dark out and I stood up above the corn and I saw 3 cops walking towards me and at the time I thought I was still with my friends but I was alone talking to the cops but I was still talking to my friends who werent there. So the cops new that I wasnt normal. They noticed that there was mud in my mouth and I had no idea where it came from. Later I found out I was passed out face down in the mud.</p><p>So the cops took me to their cop car but before they took me out of the field I said 'wait arent we gonna take this we can't forget it'? They said 'take what'? and I said the corn. So immediately after that they took me straight to their car and we waited there for an ambulance because they seemed worried. I guess because every time I would look away I would forget they were there and I would start talking to my friends who were long since gone. And when the ambulance came they started to drive me to the hospital while I was in the ambulance strapped down to a stretcher I kept trying to get out of it and I kept unbuckling it during this the police officer that was in the back with me was having a hard time keeping me from moving and trying to unbuckle it he must have told me to stop trying to get out about 10 times before we got to the hospital.</p><p>When I was in the hospital it got even weirder. They put me in my own room and left me for a few minutes. When the nurse came back in she found me talking to nothing, but in my mind I was talking to some one who was right next to me. So they hooked me up to an I v and started drawing blood which took them forever because I was unable to sit still and cooperate.</p><p>After a while of talking to random objects in the room the nurse guided my mom and uncle into the room along with my brother his and his two friends. They saw me dazed and confused and laughed so for some reason I started to laugh. at the time I thought I was completely normal and all I told them was I was smoking weed out in the corn field they found me in. But they noticed I wasnt acting high but I was hallucinating. My uncle suggested I was out in the field eating mushrooms but I never told them what I was on. so they ended up making me piss in a cup and the only thing that showed up was THC because Brugmansia isnt illegal they dont have tests for it so I passed for being really really high.</p><p>I was in the hospital for a few hours and the whole time I was hallucinating. I also remember sitting in the stretcher in the room and being thirsty, and I looked down in my lap and there was a cold refreshing drink I thought thats weird but ok. I went to grab the drink and as soon as my hand touched it, it disappeared. when it did I said my drink and my uncle thought I was asking for a drink so he went to get me one and when he was gone I just kept rambling on about my drink disappearing in my lap. But the nurse just ignored me  (through out this whole trip all of the authority figures seemed pretty nice to me).</p><p>A little while later another nurse wanted to see if my 'motor skills' were working alright. so she took me out into the hall and started to test me I did good on everything until she told me to walk to the wall then walk back, and of course I didnt walk very straight but she said I was making progress so they decided to let me go home. Now the only thing I still cant recall is what happened in between the time we went out in the corn field to smoke and when the cops picked me up and apparently the cops told me I was eating dirt which I remember it being in my mouth but not how it got there. This was the first time I took Brugmansia, so as I said before I didnt know the dose so I 'winged it'.</p>",
 "year": "2006",
 "id": "54395",
 "gender": "Male",
 "timestamp": "2006-09-04T07:00:00.000Z",
 "views": "11722",
 "dose": [
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(dried)"
  }
 ]
}
