{
 "id": 544,
 "title": "Becoming Human",
 "date": {
  "submission": "2001-12-12T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Neural Neutralizer",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Salvia divinorum"
  }
 ],
 "report": [
  "This is a present-tense description of one of my most interesting salvia trips that I wrote down while the memory of the experience was still fresh in my head:",
  "'As Im holding the smoke in my lungs I already know something strange is happening and a moment after I put the bong down (after holding it for about 20 seconds) Im a different being in a different world.  There is a feeling of nostalgia, but instead of regressing to a childhood memory its like regressing to a previous life on another planet.  Im not observing this world from the perspective of a tourist, but living in it as an inhabitant.  My body is arranged in a lever moving in an arc along an axis that has formed at my waist.  A succession of beings fold into me along this axis in geometrically impossible ways.  They come from various dimensions, including the three spatial dimensions, but also what seem like completely new dimensions, related though distinctly different from spatial ones.  Im connected to these beings directly via thought, and I enjoy the sensation of them folding into me.  With each fold, I experience a unique world of myself in conjunction with another set of beings.  As I move across these planes, I get an impression of my real life.  I feel incomprehensibly astonished that my normal existence could be my home, rather than the one Im experiencing.  It becomes evident that I will be forced to fold into my girlfriend (whos actually at the other side of the room) but I dont want to leave the home that Im in.  I question who exists in my world.  It seems totally bizarre that there could be exactly one other female in my world.  I have an idea that this being is female but Im actually perplexed as to what a female is, since the other beings around me are not divided into male/female.  As the trip comes to and end I become struck by the particular characteristics of my own reality, given the myriad of possibilities for conscious existence.'"
 ],
 "erowid": {
  "id": "11200",
  "citation": " Neural Neutralizer. \"Becoming Human: experience with Salvia divinorum (ID 11200)\". Erowid.org. Dec 12, 2001. erowid.org/exp/11200",
  "substance": "Salvia divinorum",
  "views": "5970"
 }
}
