{
 "title": "I Thought I Was Ready",
 "author": "V",
 "citation": " V. \"I Thought I Was Ready: experience with Mushrooms (ID 54418)\". Erowid.org. Dec 27, 2006. erowid.org/exp/54418",
 "substance": "Mushrooms",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  "0.125 oz",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>Me and my sister managed to get a hold of a little less than a fourth of magic mushrooms for the both of us. It was the first time for me shrooming and it was the second time for her. We thought they had everything completely prepared. I am a pretty experienced drug user with ecstasy, meth, coke, weed, and other pills under my belt. I felt as though I was ready to take on the hallucinogens. I knew the way to come out of a bad trip was 'simply' to convince myself that she was having a good one.</p><p>Me and my sister both ate a little less than an 1/8 of shrooms at about 3:30 pm. Our friend, an experienced shroom user, told us it would be wiser to take them during the daytime so that you could see the transition from day to night and also to go to sleep earlier.</p><p>Me and my sister chewed them plain and chased them with orange juice. At the time, all that was going through my mind was to just get the best and most intense possible high for what I paid for. And oh my, I did.</p><p>We were sitting and watching our sober friend play video games and just ten minutes later, I looked outside and noticed that it was intensely bright, almost so bright it was hard to look at. I kept looking at it every two minutes or so and it got even brighter. I also noticed an intense amount of anticipation and energy building up inside her body, much like reaching a peak on ecstasy. My sister said she felt the same way, and pupils were also dilated.</p><p>I needed to go pee so I went to the bathroom and the lights in the bathroom kept getting dimmer and lighter and dimmer. Objects were shaky. Swim felt intensely energetic and happy and determined that this feeling was exactly like peaking on ecstasy, though it didnt feel good to touch furniture or anything like it does on ecstasy.</p><p>I went back to the room with the sober friend and sister and sat on a chair. I discussed and laughed intensely with her sister about how they were basically peaking on ecstasy at 4 in the afternoon. The laughter was extremely intense and loud and probably annoyed the sober friend immensely.</p><p>After just a couple minutes I looked up at the ceiling. The ceiling was actually rippling. It was waving in and out like an ocean. Very intense to look at and I was completely infatuated with looking at it. I told my sister to look at it and she did and was in awe. We were having a blast looking at the ceiling. Then, I looked outside and the colors were so immaculate and intense. Waves of colors were shooting in and out of palm trees, it looked like a cartoon, it was unlike anything I had ever seen in my entire life.</p><p>We began to laugh uncontrollably at basically nothing at all, maybe just laughing at the ridiculousness of everything. I was laying down on the ground and I looked at my armand then bamthings werent okay anymore.</p><p>My arm looked purple. I began to be able to see all the veins and blood in my arm and it looked like my arm was decaying at a rapid pace. It freaked me out even though I knew it was just the shrooms that were making my arm like that, even though I knew it was just the chemical that I put into my body to play tricks on my mind. But somehow even I was freaked out by this. I stopped looking at my arm and told the sober friend and sister what happened and that things were definitely not okay anymore. I told them that it was way too intense. Things were getting way too intense because I could not trust my eyes anymore when I looked at my own body and thats what freaked me out. I went to the bathroom, Ive heard that a bad shroom trip can be ended by throwing up, so I did. However, I later learned from the experienced mushroom friend that throwing up can intensify it because it goes through your system again or something. Great. Anyway, I threw up and then I looked at myself in the mirror for a split second. I started getting uglier and uglier, and fatter and fatter and I felt like no one would want me, and I didnt want anyone to see me like this. And then that little grain of rationality in me told me that it was the shrooms and to not take the image literally so I quickly turned away and ran out where the sober friend and sister were.</p><p>The sister was sitting outside. It was raining (we have summer monsoons in Tucson, AZ that can actually be quite beautiful). The colors were fantastic, this I agreed with. In and out were flashes of bright green and bright purple and it was amazing, unlike anything I had ever experienced. I noticed that once things inside the house got to be too intense, all I had to do is look outside and look at nature and how gorgeous it was. Now I understood why people do shrooms when theyre in nature as opposed to when they are in their homes - objects play tricks on you, things are not what they seem and that will fuck with you.</p><p>I was outside with my sister and sober friend and my sober friend asked me if I was okay. I replied, No, its just way too intense and then bam, it wasnt okay anymore. Ive realized when it comes to shrooms, when you admit something out loud, like, Its too intense, I want to stop, then your trip will be soo much worse. And vice versa, if you say out loud, This is amazing, it will be even more amazing. However, being on shrooms at the time I did not make this connection because I was definitely convinced I was having a bad trip even though nothing that bad had happened.</p><p>The sober friend has experience with shrooms and told me to just stop thinking about it and to just enjoy. Easier said than done but I tried. We looked at our dog and it started shedding, over and over again. She was shedding pounds of hair off and it was hilarious. I began to laugh again and everything was okay for the moment. Until the rain turned into basically a hail storm. It made me extremely sad that we could not be outside anymore. I was basically scared of the house, but I knew we had to go back inside.</p><p>The sober friend and I started watching TV while my sister went back into her room. The news was on and something wasnt exactly right with the newscaster. He was talking in sequences- chunks of dialogue and it was extremely choppy and not right. It was extremely odd. Then he started talking backwards - which made sense at the time but now Im thinking to myself, How does one talk backwards? But at the time it made perfect sense yet none at all that this man was actually talking backwards. They showed some footage of Korean missiles and I began to laugh uncontrollably. It seemed completely hilarious to me that people would actually take the time to build missiles to fire at another country. And then they showed footage of American president George W. Bush, which made me laugh even more uncontrollably. He was so ridiculous that I had to burst out in laughter that seemed to last for hours. I went back to my sisters room to tell her to come out to the living room to watch this with me because it was just so fucking hilarious that I knew she would have to watch it too. She wouldnt come out of her room, she just kept saying, Hang on hang on, which upset me greatly at the time. Why wouldnt she come out? Did she really want me to shroom by myself or something? It pissed me off.</p><p>The sober friend and I were waiting at the dining table for my sister to come out and join us. She finally did and she looked very, very bad, like something was extremely wrong, and she told me that she knew now why I said it was too intense and that she wasnt okay anymore now either. And then bam, I wasnt okay either. Everything had turned to shit and my trip turned horribly wrong. I started crying uncontrollably, it didnt seem right unless I cried, I had to cry. She started crying too. The sober friend didnt know what to do other than to tell us everything was okay and that we were just on drugs and everything would be completely normal again in a few hours. I was hysterical, I was crying and everything was moving, and everything was in waves, everything was out to get me.</p><p>And then I looked outside and noticed the beauty of my backyard. The trees. The flowers were fantastic. I just stared and stared for what seemed like hours. It was so gorgeous. I was okay again. And then I asked my sober friend how much time had passed and he said only three hours. Only three hours? Oh god, this was going to last at least 3 more? I couldnt handle that and I started to get extremely depressed again.</p><p>I started to feel extremely bad for the sober friend. It must have sucked so bad for him to be sitting there just staring at us while we were freaking out on magic mushrooms. It must have sucked for him to have to babysit us while we were shrooming and he was doing nothing at all. I felt so bad and so terrible that this happened. He was talking on the phone with his sister and I heard him say, Sorry I cant leave them here, theyre shrooming and then that made me feel even worse. Like he had this stupid obligation to stay here so that we didnt freak out more than we already were. But then he said that his sister was coming over and that made me really happy. I was so excited that another sober person was coming over. Another reminder of what I was to return to once this stupid shroom trip was over with. Another wave of finally being okay again came over me as I looked outside at the beautiful trees dripping with water from the rain earlier.</p><p>His sister then came with her three year old daughter. I was then not okay anymore because I didnt want her daughter to see me like this, see me psyched out of my mind on shrooms. I felt so bad that she had to see me like this. But once she smiled at me a wave of euphoria came over me and I was okay again. Just looking at her I was okay once again. The sober friend went outside to help his sister change a tire on her car. I was so sad that he was going but then we were able to spend one on one time with the little girl and part of me was so upset that she had to see me like this but part of me was so glad that she was here with us. She started playing with chess pieces and started counting them: One, two, three The counting seemed amazing and so weird but yet it made so much sense that this little girl, whose thoughts are so pure and so organic, could make this simple sentences and do this little puzzles in her mind that were just so extensive and complex to me. It was so crazy and I had to just stare at her. I was looking at my sister and I could tell that she was thinking the exact same thing and I was. She was rocking back and fourth just looking at this little girl. She looked really psycho and I thought that I must look psycho too, so then I looked outside and just stared at the pretty colors.</p><p>Her mom finally took her away because the tire was finally changed. I was sad that she had to go. The sober friend told her to give me a hug and she did, and it was the most amazing hug anyone had ever given me and it made me feel amazing that she didnt even care/know I was shrooming and just gave me the purest hug she could. She went to give my sister a hug but my sister was just rocking back and fourth and was unable to give her a hug, which made me sad. But at least I could give her a hug. Which led me to believe that just maybe I was on my way down from shrooms.</p><p>She left. I looked at my sister. She started to get dark undereye circles and began to get older and older until she was decaying. I said I couldnt look at her anymore because it made me freak out so I looked outside.</p><p>Finally, I dont know how much time had elapsed, but I was able to move from the dining room out into the room with the TV so that I could do a normal sober person activity: play Donkey Kong on Super Nintendo (its basically my favorite video game). My sister was unable to play it because she was still even more messed up than I was, just staring outside. I played pretty well for being on shrooms and this pleased me immensely.</p><p>The sober friend left and other sober friend came over - the really experienced mushroom user. I was able to tell him what had happened and why I freaked out and that I was okay now, but I got waves of being okay and waves of not being okay. And he said it was completely normal and I handled it pretty well. I was able to have the rationality to look away from something if it was unpleasing. My sister was still unable to talk. I felt bad for her but I knew she would be in my place soon enough.</p><p>We realized we were extremely hungry and my sister was now able to express that to us. He drove us to jack in the box to get curly fries. We went through the drive thru and I couldnt hear the woman correctly when she said, $4.30 I got 4 dollars out but I was scrounging for the right amount of change. I looked up and I saw her staring at me and an intense wave of paranoia shot through my body. I heard my friend say, Its OK, because he knew exactly what was happening inside my mind. I was able to calm myself down and give her the right amount of money.</p><p>We went back to my house and another friend came over. Him and the other friend played chess while me and my sister watched. They kept telling us that us girls took the shrooms like champs and that not many girls are able to calm themselves down on shrooms. That made me feel really good. The aftermath of the shrooms was still lingering. The lights were really bright still but I was at a rational state of mind, I was just extremely drained. They left and I said thank you for coming, it made all the difference in the world and then retreated to my room to go to sleep. It was difficult to not toss and turn so I took a sleeping aid pill and was fine, woke up the next morning feeling well rested.</p><p>I wouldnt call my trip a bad one because nothing really all that bad happened to me. I didnt scratch at my skin and I didnt murder anyone or anything but it was just an uncomfortable inconsistency of being okay and then not okay again. It taught me a lot of things though. It was amazing, its something I may do again in the future, but maybe a little less than I took the first time. I would also like to be more surrounded with nature.</p>",
 "year": "2006",
 "id": "54418",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-12-27T08:00:00.000Z",
 "views": "3142",
 "dose": {}
}
