{
 "title": "Drinking with Friends",
 "author": "Ben",
 "citation": " Ben. \"Drinking with Friends: experience with Alcohol (ID 54474)\". Erowid.org. Dec 5, 2007. erowid.org/exp/54474",
 "substance": "Alcohol",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "90 ml",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "report": "<p>0:00h  I ingested 90mL of 40% alcohol for the first time on an empty stomach with some friends.</p><p>~0:05h  There is a warm feeling in my throat, face, and stomach due to the dilation of capillaries and the irritating effects of the alcohol. There is also a mild sense of well being, nothing major at this point.</p><p>~0:10h  The effects are apparent now, I am dizzy, red in the face, euphoric, and am noticing a loss of inhibition.</p><p>~0:30h  We decide to go for a walk, walking is not difficult but my balance is off, my vision has become blurry and it is hard to focus. I notice I am a lot more social than I would be otherwise I am also in a lot less control of my person, I like my inhibitions.</p><p>~1:00h  The effects are mostly the same at this point, it is pleasurable, there is a pleasant feeling throughout my body but I am not able to let go of the feeling that I am not in control, I suppose if you where to drink enough this feeling would go away and you wouldnt care, but I dont find that to be a desirable effect.</p><p>~2:00h  I am slowly regaining control, the experience has not been overly intense, but I was able to get a feel for the drug, and can extrapolate what a higher dosage would be like, I dont think I will be trying more anytime soon.</p><p>~4:00h  Baseline.</p><p>Aftereffects  I feel fine today, there was no hangover but I didnt expect one from the amount I ingested. Alcohol is a very interesting substance, it is a depressant and yet most people dont even consider it to be a drug. Although I found my experience enjoyable I did not like the loss of inhibitions associated with it, anything that can make you lose control like that scares me.</p>",
 "year": "2003",
 "id": "54474",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-05T08:00:00.000Z",
 "views": "36832"
}
