{
 "title": "A Feeling I Dearly Miss",
 "author": "KC",
 "citation": " KC. \"A Feeling I Dearly Miss: experience with Lorazepam (Ativan) & Hydrocodone (Vicodin/Lortab) (ID 54491)\". Erowid.org. Aug 1, 2010. erowid.org/exp/54491",
 "substance": "Lorazepam (Ativan) & Hydrocodone (Vicodin/Lortab)",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "0.5 tablets",
  "oral",
  "Pharms - Lorazepam",
  "(pill / tablet)",
  "",
  "1 tablet",
  "oral",
  "Hydrocodone",
  "(pill / tablet)"
 ],
 "report": "<p>In October of 2005, I had a severe, agonizing physical problem in which I would rather keep classified. My mom called the Doctor and asked what medication I would be able to take to help get rid of the pain I was in. The doctor said to give me one half of Lorazepam and one whole Hydrocodone. My mom got in the medicine cabinet and took out a Hydrocodone and halved one Lorazepam (she was prescribed both medications by the way) and as she placed the two pills on the table. I was nervous-I had never taken a mind altering prescription before. When I finally took them, I awaited for what would lie ahead. I laid down on the couch and watched tv, waiting for the effects to kick in.</p><p>In about 45 minutes, I started feeling an exquisite calm wash over me like a wave. My otherwise excessively hyperactive self was finally tranquil-something I had rarely ever felt before. I lay there feeling so glad that I was able to take this medication-I felt purely, unadulterated happiness. My parents offered dinner to me, but I kindly refused and chose to stay on the couch in my own little world. I saw the cat laying by the fireplace and slipped off of the couch, resting on my stomach and pushing myself with my feet across the room with a huge smile on my face. Everything was so wonderful! My parents watched me move around on the floor and started laughing a little bit and I attempted at laughing back, but it came out as a mumble. I finally got to the cat at the fireplace and laid beside her and petting her. I wasnt feeling anything but happiness. The medication started getting stronger at about an hour, and I was perfectly content with sitting by the warm fireplace and stroking the cat.</p><p>In about an hour and a half, I was starting to feel a little sick. I ran into the bathroom and threw up twice. Afterwards, I wanted to lay down. I had horrible stomach pains and I started thinking 'Where's that feeling?!' because I no longer felt that supreme happiness I so loved. I threw up again all over the carpet and my parents ran in to get me a cool cloth and wipe my face and clean the carpet. I felt like total and complete shit. My parents decided to go to bed and they set up a comfortable pallet on the floor for me to lay. Getting up and moving took so much energy and effort for me. I finally laid down and tried to sleep past the stomach pains. I woke up, choking and threw up again at about midnight-4 hours into the duration of the medication's effects. Two more times I threw up and fell back asleep, only to wake up again and feel those horrid stomach pains once more. I felt a sence of loss-I wanted that happiness again. I wanted to take another pill and feel good, but I knew I couldnt. When I woke up the next morning, I was a bit drowzy but I felt ok.</p><p>Ever since then, I have still craved the Lorazepam and Hydrocodone, even to this day. When I look past the sickness and throwing up, I finally realized that I found a new feeling that I have never felt until then-100% pure contentment, something I dearly miss.</p>",
 "year": "2005",
 "id": "54491",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2010-08-01T07:00:00.000Z",
 "views": "38912",
 "dose": {}
}
