{
 "title": "T3 and Me",
 "author": "CodieneGal",
 "citation": " CodieneGal. \"T3 and Me: experience with Codeine (Tylenol 3) (ID 5455)\". Erowid.org. Jan 16, 2002. erowid.org/exp/5455",
 "substance": "Codeine (Tylenol 3)",
 "bodyweight": "133 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Codeine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>It upsets me to read of so many misusing codiene and, as a result, having either mediocre or unpleasant experiences.  Codiene is a nifty substance but patience is required to obtain the full effect. Like so many things in life, what you put in is what you get out.  The following is the sum of many experiences with codiene.  It is my experience only.</p><p>Codine works best for me when I take it with a little bit of food in my stomach.  I found dosing on a completely empty stomach increases queasiness and light headedness.  The onsets of effects are delayed only slightly.  I'm not a heavy gal so a dose of between 4-6 T3s (120 -180 mg) works best for me.  I don't bother with extractions.  The cold water method of the famous Codiene FAQ entails losing too much codiene for the sake of reducing the aceteminophen content. </p><p>Also, OTC codiene in Canada is a thing of the past.  Codeine is now a scheduled narcotic and unobtainable without a prescription.  [Erowid Note: As of May 2002, products containing low amounts of Codeine per dosage unit, are still available over the counter.  In particular we know that Tylenol I's, with 8mg Codeine per tablet, are still available OTC in Canada.]  I blame ever-increasing drug paranoia in this once reasonable land.  If you're taking large doses infrequently, or small doses slightly more frequently, and know that you are not hypersensitive to aceteminophen, than you need not worry about ingesting too much aceteminophen.  Then again, I'm not a doctor.  Do your own research and respect your liver.</p><p>The effects of Codiene are subtle.  My most enjoyable experiences have been in environments free of distraction.  I avoid the TV, loud jarring music, large groups of people, and bar scenes.  To maximise the body buzz I like lying in my recliner, feet up, eyes closed.  The euphoria can be quite intense and quietly orgasmic.  My skin heats up (comfortably) and I'm aware of million little pricking sensations at the ends of my peripheral nerves.  The euphoria doesn't arrive in a rush like coke or IV opiates but rather comes on slowly, in delicious waves.  Reading or talking to good friends is also fun on codiene.</p><p>Codiene is not, in my experience, a drug for mental exploration.    Emotionally, Codiene causes the cares of the world to recede in importance.  It brings on sense of well-being.  Snotty prohibitionists call this a 'false' sense of well-being but it feels real enough to me.  I find it to be an end of day drug, or a lazy day drug.  Sleep after using is intensely rewarding and rich.  Expect happy dreams.</p>",
 "year": "2001",
 "id": "5455",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-01-16T08:00:00.000Z",
 "views": "45910",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(pill / tablet)"
  }
 ]
}
