{
 "title": "This Room is Better",
 "author": "Kow",
 "citation": " Kow. \"This Room is Better: experience with Mushrooms & Opium (ID 54563)\". Erowid.org. Feb 13, 2009. erowid.org/exp/54563",
 "substance": "Mushrooms & Opium",
 "bodyweight": "141 lb",
 "report": "<p>I was forunate enough to have my first experience in mind exploration on shrooms. I had only experimented with drugs for half a year before I had this experience, but due to my peers I had no trouble experimenting with plenty of different kinds of drug (LSD, MDMA, opium, MDA, cannibus, DXM, cocaine, tramadol, oxycontin, hydrocodeine, amphetamine, and nitrous). I had tried LSD a week or two before I shroomed. It was fairly low grade and it was a single hit. So needless to say I didn't have the proper impression of the power of psychedelic drugs.</p><p>Around 9 my friends E., J., and I eat our shrooms. They have fairly fat stems and small caps. Another friend of mine, N., takes two hits of acid. After about half an hour I begin to see slight breathing in the walls and the ceiling begins to ripple. Grateful dead is playing in the background and it's fairly comforting despite the cold, anxious feelings that are flashing through me.</p><p>10... A euphoria begins to flow through me. My emotions become more powerful and rapidly change. My friend J. has his head bent down and appears to be overwhelmed by his feelings. My friend E. is sitting on the couch next to J. and we ask J. if hes alright. Time is slowing down. Past this point I lost track of time.</p><p>The music playing now sounds as if its falling apart and sounds like it is playing through water. Other friends of mine come in and enjoy talking with us in our strange state of mind. N. is fascinated by a pillows design. J. and E. race towards a solitary room to relax in. I misinterpreted the commotion of them racing. I thought that J. was having a bad trip and was rushing off to confine himself. This scene continuously went through my mind through out the whole trip. I try walking across the room to the couch. I imagine walking on the moon feels similar. I finally sit on the couch. Perception is greatly altered. I look at myself and appear to be about a foot tall. But everybody around me seemed the size of giants. E. came back at some point and is laying on the floor holding the speaker next to his head. I retreat back to my original couch/bed and watch the scene around me. A few girls I didn't really know came in with alcohol. They appear very fake to me, almost plastic like. N. is nowhere to be seen. I close my eyes and become amazed at the distinct shapes and colors. Emotions are rapidly changing. Euphoria is strong. E., J., and N. are all gone now. Nobody left to communicate with. They wouldn't understand.</p><p>Time: Unknown. I lay low on the mountain sized sheets. It is easy to focus on a single stringe. It feels like days since I've seen the fellow trippers. Everybody in the room seems to have unpleasant vibes. I bury my face in my knees. I have no control of what surrounds me or my emotions. I keep seeing J. rush to the room and wonder if he is having a bad trip. I begin to wonder what its like to have a bad trip. My mind throws me into a panic. Emotions begin to snowball into a powerful feeling of dispair. There's no getting out of this trip. But what's this?! Its N.! He asks how I'm doing and I respond with I don't know. He asks if I want to go in the room that J. and E. are at. I of course take him up on the suggestion.</p><p>The vibes of this room were a great improvement. J. and E. cheerfully greeted me and the four of us began to talk. Whether it made sense of not none of us really know. I had an overwhelming feeling of acceptance to what everybody was saying. We talked about cocaine, our experience thus far, and god knows what. We all had the similar feeling that we could not relate to everybody else outside of the room we were in. I noticed the same feeling occurred with all my experiences tripping after this point. A knock is at the door and several people bust in. The sounds outside the room overwhelm the once peaceful atmosphere. After a short struggle the door was shut and peace came back. We used a giant R2D2 to barricade the door.</p><p>Eventually we came down from the trip listening to Amon Duul and absorbing the strange energy. Opium and cigarettes were great for calming the body down. Everybody was worn out and it was decided to try to rest. This is at about 2. While the rest of us tried to rest N. remained awake from the acid and listened to music.</p><p>The next day I felt great. I felt a connection to everybody I tripped with and felt at peace with myself.</p>",
 "year": "2006",
 "id": "54563",
 "gender": "Male",
 "timestamp": "2009-02-13T08:00:00.000Z",
 "views": "3430",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 5:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Opium",
   "form": "(tar / resin)"
  }
 ]
}
