{
 "title": "Vasoconstriction Reversed",
 "author": "Liquid Gold",
 "citation": " Liquid Gold. \"Vasoconstriction Reversed: experience with Inhalants - Nitrites & Methylphenidate (ID 54569)\". Erowid.org. Dec 2, 2007. erowid.org/exp/54569",
 "substance": "Inhalants - Nitrites & Methylphenidate",
 "bodyweight": "16 kg",
 "report": "<p>So I go to the two local 'head shops' as I like to call them, they sell legal highs from salvia, amanita muscaria, lettuce/hemp mixes and various herbal tablets that are supposed to mimic the effects of ecstasy and other drugs. I bought a 10ml bottle of liquid gold iso-butyl nitrite and tested it later in the day. Up to this point I have regularly done 20-40mg of methylphenidate in thick lines daily for over a year. The first two times I used the popper's I got a really banging headache and could hear my blood pulsing in my head. After these times I became fine with popper's, a warmth is felt rushing all over my body and the short rush of oxygen reaching the brain lasts a minute or two.</p><p>I proceeded to test out why my first experiences were so bad. I took my usual dose of ritalin for a week then tried the popper's again, and again the intense pressure was felt leaving a headache. so I stopped taking the ritalin for a week and then did the poppers and had a great experience. I conclude that the vasodilatation or increased oxygen in my brain from popper's had countered the constriction of blood supply to my brain from regular methylphenidate use. now I only wonder what the hell using ritalin does to the supply of blood and markedly oxygen supplied to the brain and the obvious negative effects I feel this could present.</p>",
 "year": "2006",
 "id": "54569",
 "gender": "Male",
 "timestamp": "2007-12-02T08:00:00.000Z",
 "views": "11721",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Inhalants - Nitrites",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  }
 ]
}
