{
 "title": "Fond Memories",
 "author": "Empster",
 "citation": " Empster. \"Fond Memories: experience with Inhalants: Duster (ID 546)\". Erowid.org. Sep 13, 2000. erowid.org/exp/546",
 "substance": "Inhalants: Duster",
 "bodyweight": "165 lb",
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I have worked in computer shops...tech work..for quite a long time now..and it's a common thing to keep a case or 2 of this stuff on hand. </p><p>When i first started using it, I would get a somewhat nitrous-like experience...distorted sounds, little visuals (i'll let it be known i've not done much nitrous, just a few balloons at concerts etc., so I may not be relating this very well).</p><p>OOOH BOY did things start to change.  I mean, I've done shrooms, lsd, all that, but OOOOH BOY</p><p>The first sign was a tightening around the temples..and my eyeglasses would seem to move further from my point of view. Things would start to look familiar, but VERY different.</p><p>Soon I met ZEB..a quick little 4' mischevious dude, always just running around a corner, and with a devilish laugh that i can still hear.  How did i know his name?  These creatures, they tend to repeat words or phrases in an echoey sort of manner.  Zebzebzebzebzeb..etc.  I remember chasing him around the small office several laps (thank god nobody was there), before saying to myself..ITS NOT REAL.  is it?</p><p>He never meant harm, but I swear he wanted to drive me crazy.</p><p>Keep in mind, it wasn't during every session that i would trip this hard, but it came in spurts, usually while i was alone, with some sort of background sounds, tv, radio, other voices.</p><p>There were others:</p><p>Blah : somewhat of an ogre, dimwitted but scary, liked to sing along with van halen</p><p>Little green fairies:  when they spoke i was overcome with a sense of joy, peace.  very sentimental to me.  they lived among the empty cans.</p><p>The little old lady:  wanted a beer, so did i, but it was working time ;(</p><p>The seductress:  always came up behind me..humming softly, soothingly, while I sat or stood facing a wall.  When her mouth came close to my ear and her arms encircled me was the best, and as the buzz wore off she would slip away.  Never got a good look, but long hair, very slight, loving.</p><p>I could go on forever here</p><p>The sunbeam forcefield, shocked me when i tried to cross it.</p><p>Occasional fear of just having swallowed metal shavings</p><p>Time frame of buzz : not long, 30sec to maybe 2.5 min..but intense(duh)</p><p>I would really love to hear from anyone with a similar experience, I don't do this any longer for fear of damage, but it is really a fond memory..I do not regret it in any way.</p><p>This was true hallucination to me, not distortion of reality, but the real thing. </p><p>Had a major trip listening to 'my woman from tokyo' during the funky solo part..tick tock tick tock, everything started moving like a pendulum, too sweet.</p>",
 "year": "2000",
 "id": "546",
 "gender": "Male",
 "timestamp": "2000-09-13T07:00:00.000Z",
 "views": "21815",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 }
}
