{
 "id": 5460,
 "title": "Flashback Two Years Later",
 "date": {
  "submission": "2004-03-31T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tommy The Cat",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "I started taking LSD on 1999 and I used to consume it in blotter form every weekend (found that LSD tolerance was almost 7 days on my organism) till 2000. That was a whole year of LSD consumption almost every weekend. I started with doses of 1 blotter and after that year and a half my latest doses were about 5-6 blotters. I can say I never had a bad trip, and I decided to quit acid when the nasty after effects no longer had a positive relationship with the good effects.",
  "On those days I read a lot of information about flashback experiences but never really believed in them.",
  "After that acid marathon I got a magor depression that lasted aprox 6 months where I was heavily medicated with a lot of antidepresants like fluoxetine, prozac, haloperidol and mutabon D. Then I recovered and started living a normal life without drug consumption except tobacco.",
  "After 2 years of my last acid trip, while on vacation in a very nice wilderness place I was sitting on a rock and then I experienced a clear acid high. I was looking at a very steep hill and suddently it started moving in nice patterns, exactly as one sees patterns while on acid. It wasn't something uncomfortable. In fact it was really pleasant and there was absolutely no trace of the nasty anxiousness after effects common to LSD. It lasted aproximately 2 minutes and I enjoyed it very much.",
  "After that experience I never had any other flashback. But if they came again I'm sure I will enjoy them every much!"
 ],
 "erowid": {
  "id": "32420",
  "citation": " Tommy The Cat. \"Flashback Two Years Later: experience with LSD (ID 32420)\". Erowid.org. Mar 31, 2004. erowid.org/exp/32420",
  "substance": "LSD",
  "views": "8337"
 }
}
