{
 "title": "Moving, Melting, Breathing",
 "author": "Aesar",
 "citation": " Aesar. \"Moving, Melting, Breathing: experience with Mushrooms (ID 54648)\". Erowid.org. Mar 25, 2009. erowid.org/exp/54648",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "report": "<p>This report is to be of my second experience with 'Magic Mushrooms'.</p><p>In background, I am a college student, and I have only been experimenting with drugs for a year and a half. I have done mushrooms in specific once before, and it was not a pleasant experience. That time was the same dosage as this one. It was in my own house and generally ended up as a negative psychological trip in which I was convinced I was a terrible person, terrified, and I wanted to die.</p><p>This trip was to be different.</p><p>I had been assigned the task of house-sitting for a family friend. She was decently well-off and had a well-sized house in the middle of a not-so-nice area, which was mostly surrounded by cheap row-homes. That nonwithstanding, the house was gorgeous, certainly better than mine. It was well furnished with comfortable furniture and plants everywhere. Anyway, upon learning I was meant to be taking care of the house for a few days, I went to see it and somewhere in that process I said to myself 'this would be a lovely place to do those leftover mushrooms I have'. My significant other and I had an eighth between us we decided to split.</p><p>The day we decided to do this I went out for breakfast feeling very nervous and anxious to have a repeat of last time's bad trip. Upon returning to the house I made a nice playlist on my laptop with happy, relaxing music. We went to the kitchen and drank the mushroom tea we had prepared, frozen, and thawed out 2 days prior. I drank a full mug of tea, it tasted ok, albeit a bit swampy. I also ate about half a spoonful of the 'mush', and gave the rest to my SO, because I was very nervous and wanted to have a controlled trip.</p><p>After ingesting the tea, my SO and I walked to a nearby park, because I had been hoping that a nature-like environment would be good for coming up. The effects came on VERY quickly, I felt a slight 'whooshiness' as I crossed the street into the park not 200 feet after exiting the house. This feeling built up gradually. I was still extremely anxious and uncomfortable, and we sat on a bench while I shook my leg an anticipation and tried my best to enjoy myself. I tried to joke about things going on in the park but it didn't really seem to help.</p><p>I decided I would rather come up in the house, after all, so we began to walk back through the park in the direction of the house. I asked my SO 'was the pavement always curved like that?' and he said 'yes'. I remembered it being that way but not this much, it seemed very significant at the time. By the time I stumbled into the house I was definitely feeling the effects. I went to the sitting room and layed on the massive leather couch on my back and stared up at the ceiling. I slowed my breathing, I was very nervous but this didn't seem too bad. My laptop and its pre-made playlist lay unused on the floor. The TV was still playing some black-and-white comedy but I payed it no heed. Upon looking up I noticed that the walls had begun to breathe a little and the lines around the edges of the windows had begun to ripple. The lights above my head were waving too, and the colors seemed more intense than usual.</p><p>Somehow, the fuse chose a wonderful time to blow, plunging the room into quiet and darkness. This didn't disturb me, and I told the SO that we should go to the other room. I layed back on that couch and relaxed. The effects were getting stronger. Then I looked at his face. Last time I had done mushrooms, that point where it went bad was the point when I looked at his face and saw extra sort of orafices and such forming in symmetric designs. I didn't really care what I saw, but seeing distortions in the faces of others deeply disturbs me. Seeing that again was my greatest fear coming into the trip. However, I was not afraid, I just looked at him in a dull sort of curiosity, and looked away.</p><p>I felt the strong urge to be alone. I told my SO I was going upstairs. I went up into the master bedroom, where no lights were on, and I layed on the end of the bed on my stomach. I felt like I was melting and I let myself wrap my arms around the side of the bed. I was relaxed now. The mushrooms intensified my self-talk, my thoughts were composed of what I should be thinking, and I was doing an exceptional job of keeping myself relaxed and levelheaded for the trip. This was the peak of the trip. Beside the bed and under me was a plastic bag. I had noticed it before tripping but it looked so different now. It appeared to me to have two faces, and to move slightly. Everything in the room looked so alive. The radio and its buttons shifted and morphed, and the face stared at me.</p><p>The bicycle leaning against the wall did not appear to me to be a bicycle. I stared at it, and I said to myself that it looked more like a dog, and the mere thought of it being a bicycle seemed completely absurd. A pair of jeans atop the radiator was melting all over it, and the bars of the radiator were wagging. I layed my head to the side, and unfocused my eyes a bit, just thinking. Slowly, my field of vision was clouded by a large, transparent neon persian blanket, which rose from the floor, and tried to wrap itself around me. Behind it, the closet was turning black and brown and black again. My blurred arm turned into a mountain range. My SO came in the room, and he layed his hands on my back and began to give me a backrub. He was melting into me, and I was melting into the bed, all of us like wax.</p><p>I decided I wanted to go back to the park, so I sat up, found my sandals, and we left. Every tree had a face, everything seemed so friendly. I smiled at everything. I held his hand and we walked together. We left the park and walked for a very long time, until the road ended. I was sober again. We decided to walk back to the house.</p><p>We opened the door and walked back into the kitchen when the second wave came on. I went to the bathroom and it seemed very small and when I emerged I asked him 'Did the house always slant like this'? He laughed and said no, and I realised that it definitely wasn't over yet. I felt a strong urge to leave the house again so we got our shoes on again and headed out, a different direction this time.</p><p>Just like my first mushroom trip, the cars outside looked severely different. While walking on the right side of the street, they all seemed like they had been made of putty, and had had their fronts smudged to the right (my left). Every car was like this. I was so fascinated with it that I kept wanting to walk around each car and touch it, but it was a bad neighborhood and I'd probably get shot.</p><p>We walked four miles, until I was almost sober again. Before stopping in, we went to the park again, and sat around the fountain in the dark and held hands. It was beautiful. When we finally got to the house my feet were practically bleeding from the sandals hurting them. But I was happier than I'd ever been. I felt a oneness with everything. I loved everyone and everything. I was at peace more than I have ever been in my entire life.</p><p>This experience not only was better than my last mushroom trip, it was one of the best days I have ever spent in my life. I do not regret it.</p>",
 "year": "2006",
 "id": "54648",
 "gender": "Female",
 "timestamp": "2009-03-25T07:00:00.000Z",
 "views": "2961",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  }
 ]
}
