{
 "id": 5466,
 "title": "It Isn't Worth the Trouble",
 "date": {
  "submission": "2007-11-16T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Seraph",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "21 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "I am someone who is relatively experienced with psychoactives and other mind altering substances. I decided one weekend that I would try it out because none of my friends had the guts and we wanted to know what it was like. I had procured a 63 gram package of ground nutmeg, and was planning on mixing it with liquid to cut the taste. That was a mistake. It only brings out the awful taste that is already hard to handle. I ended up tossing it in my mouth as it is, swallowing, and having a chaser of root beer. It sucks, but it's the least painful way. I tried mixing it with root beer and the results were horrible. It all rose to the surface in a bubbly mush which made it hard to handle. The taste was amplified greatly, and it ruined the drink.",
  "It can get pretty sedative and nice at times, but there were no hallucinogenic qualities in any of my 3 experiences (all at quite high doses). The biggest problems have yet to come. For the next week, my gastro-intestinal tract was working it's ass off to get this crap out of my system, and serious cramping can be a problem. Gas is also very prominent, and occurs often (the infamous 'megers are awful). Nutmeg burps are bad too, and usually occur during the experience.",
  "The timing went something like this:",
  "8:00 PM: 21 grams (a third of a 63 gram package bye eye) of nutmeg ingested",
  "9:00 PM: Waiting for results. Numerous unpleasant burps occur.",
  "9:30 PM: I think it starts to kick in a bit, but it may be a placebo type effect.",
  "10:00 PM: I finally feel something for sure, it is a drunk like feeling, with less motor skill impairment and more perception alteration.",
  "11:00 PM: Sedation and more 'mental' impairment occur (mental = perception or thought processes).",
  "12:00 PM: More effects come on, and though I dont actually see anything, there are very slight hallucinogenic effects like streaming lights and/or shadows in the corners of eyes.",
  "1:00 PM: Sedative effects are so strong I fall asleep (luckily in my bed).",
  "The next week: Bad side-effects ranging from horrible gas to stomache pain to light sensitivity (yes, light sensitivity). There are others, but too many to list."
 ],
 "erowid": {
  "id": "32430",
  "citation": " Seraph. \"It Isn't Worth the Trouble: experience with Nutmeg (ID 32430)\". Erowid.org. Nov 16, 2007. erowid.org/exp/32430",
  "substance": "Nutmeg",
  "views": "4301"
 }
}
