{
 "title": "A Horrible Day At Work",
 "author": "Jay-Tee-En",
 "citation": " Jay-Tee-En. \"A Horrible Day At Work: experience with Caffeine (Coffee) & Cannabis (ID 54661)\". Erowid.org. Apr 17, 2010. erowid.org/exp/54661",
 "substance": "Caffeine (Coffee) & Cannabis",
 "bodyweight": "136 lb",
 "header": [
  [
   "DOSE:",
   "2 cups",
   "oral",
   "Coffee",
   "(liquid)",
   "",
   " ",
   "oral",
   "Coffee",
   "(plant material)",
   "",
   " ",
   "",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I work at a coffee shop as a barista, and I get a free pound of coffee beans a week. And since I can get all the free coffee I ever want from work (brewed from their high-quality brewers, not my Mr. Coffee), I rarely ever use up my beans. Until one day I discovered how good coffee beans really taste. Well, I started out having 2 or 3 a day, then each day having more and more, until I was chewing and chewing away on coffee beans all day (50+).</p><p>Well, 3 days ago I suffered a bad headache in the morning (I had to work this day). Seeing as I thought it was dehydration at first, I drank alot of water, and that doing no good, my boss told me that warm drinks open up the blood vessels, and may help with a headache (2 Advils had done nothing). I am also mildly addicted to caffeine. So I go and have more coffee, thinking it may be a headache from lack of caffeine, and I ate some more beans as well. Things go down hill from here.</p><p>I am dizzy, lightheaded, everything is disassociated from everything else, I have a bad headache and nausea. It was a quiet day and when my boss left, I went to the back room and layed down on the floor to try and get some rest. I couldn't sleep for anything (the 100 degree heat and lying on a tile floor didn't help any), and I just rested for 40 minutes, until 5 minutes before I could leave. When I got up (because a customer had walked in) I still felt dizzy and more nauseated then ever. While talking to the customer, I almost threw up 3 times. My jaw muscles clenched together and I was salivating heavily, feeling weak all over and extremely dizzy, with some sharp stomache pains.</p><p>I managed to not throw up and after leaving work and getting home to my air conditioned house I felt better. I am also a musician, and I had a concert to play in 2 hours, so I thought I would get some sleep. I layed down but couldn't sleep (and I had gotten about 4 hours of sleep the previous night). So before the concert I drank a coke to wake me up, and smoked a small amount of marijuana to calm me down. I managed to play the concert, but I was feeling so dizzy and confused that I could not even walk straight, much less play guitar very well. My head was in pain, not as bad as earlier in the day, but nothing pleasant. I went home afterwards and spent a long time trying to fall asleep, and finally I fell asleep.</p><p>After some internet research the next day, I figured out that I may have overdosed on caffeine. I also met a strange man (that ordered a bottled drink, during the absolute worst part of the day in which I almost threw up) who gave me his email adress on paper, and was telling me some really strange things (I gave him my 'non-used' email just so he would shut up). When another co-worker walked in and I was talking to this man, I got a strange look from my co-worker. I never found the paper with his email address either, which I clearly remember putting in my pocket. He was telling me about an event to go to the next morning, and when I googled it the next day, it turned out to be in Arkansas (I live in Minnesota). I have never heard of people experiencing complete realistic hallucinations from a caffeine overdose, but it made me wonder about that. It more than likely was coincidental, but I thought it was worth mentioning.</p>",
 "year": "2006",
 "id": "54661",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-04-17T07:00:00.000Z",
 "views": "11912",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 cups",
   "administration": "oral",
   "substance": "Coffee",
   "form": "(liquid)"
  }
 ]
}
