{
 "title": "A Small Test Dose for a Recreational User",
 "author": "Pharmer",
 "citation": " Pharmer. \"A Small Test Dose for a Recreational User: experience with Buprenorphine with Naloxone (Suboxone) (ID 54687)\". Erowid.org. Oct 11, 2010. erowid.org/exp/54687",
 "substance": "Buprenorphine with Naloxone (Suboxone)",
 "bodyweight": "140 lb",
 "report": "<p>Quite a few reports on buprenorphine most of them involve puking. I'm trying to avoid that if possible. Ive never puked from an opiate before and dont want to start now.</p><p>Experienced opiate user, but no tolerance I do random drugs every couple weeks. 30mg oxy or 40mg hydrocodne is the most I'd take in a night.</p><p>Somewhere between 0.4mg-0.6mg suboxone taken sublingually. (An 8mg divided into 4 pieces, one piece divided in half once, and one of those divided in half again.)</p><p>0:01 - Watching jeopardy.</p><p>0:50 - Slightly dizzy, could be placebo effect or being tired from the soccer. About to take a shower.</p><p>1:10  Out of the shower and feeling normal. I realized the dizziness was from staring at my computer for too long.</p><p>1:40  Light buzz kicked in, feels kinda like the start of an oxy high. Bout to head out to blockbuster and publix.</p><p>2:00-4:00  Light buzz continues, never actually gets me that high.</p><p>4:00+ I feel pretty baseline. I'm guessing some must have flaked off when I cut the pill so I ended up taking close to 0.4mg which seems like a pretty small dose. The only problem that I had with my stomach while I was on it was some sharp pains that felt like hunger pangs. This was probably due to the fact that it was around 12am and I had last eaten at about 3pm.</p><p>Next time I do it I'll double the dose and see how that works out.</p>",
 "year": "2006",
 "id": "54687",
 "gender": "Male",
 "timestamp": "2010-10-11T07:00:00.000Z",
 "views": "10589",
 "dose": [
  {
   "time": "DOSE:",
   "amount": ".4 mg",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": "(pill / tablet)"
  }
 ]
}
