{
 "title": "IV Phen Explosion",
 "author": "scheduled",
 "citation": " scheduled. \"IV Phen Explosion: experience with 2C-I (IV) (ID 54705)\". Erowid.org. Jul 28, 2006. erowid.org/exp/54705",
 "substance": "2C-I (IV)",
 "bodyweight": "200 lb",
 "report": "<p>'Just shot about 7.5mg..the rush was incredible I must say. Quite profound euphoria, bursting with visuals. It wasnt the easiest iv..had to push the plunger rather slow. I am tripping face right now. Beautiful patterning, headspace, phenelthylamine euphoria.</p><p>On the comeup I felt a little naseous, kinda of reminiscent of a smoked 5-meo-dmt comeup. I feel fucking incredible right now.</p><p>Thanks to everyone involved.'</p><p>Thats what I wrote while under its effects. Ill try to give a more detailed report here.</p><p>Although I believe I used too much water (it took a long time to push that plunger down) I still felt the effects almost instantly. I closed my eyes for a couple seconds, unaware that when I opened them I would have some of the most intense visuals I've ever had. There was beautiful persian rug patterning on my wall, floor, pretty much everywhere. They were so complex and morphing quite intensely. Unfortunately, during about the first ten seconds, I had a strong feeling of nausea and the comeup was almost too intense. Luckily this subsided rather quickly.</p><p>I ventured outside for a cigarette, taking note of the visuals as I kind of stumbled down the stairs. It almost felt like I slid down them. It was daylight, and as such I didnt expect the visuals to be nearly as intense as inside, but I was wrong (I normally dont get very impressive visuals outside during the day, not sure if this is common).</p><p>I looked up at the tree in the front of my house and it seemed to sway quite signifcantly, almost looked like it was going to fall. I inhaled my cigarette and watched the cherry flicker and dance. When I dropped my hand away from my mouth and exhaled the smoke, I noticed elaborate morphing/coloring in the smoke, and my hand left quite a trail which lingered much longer than I thought it would.</p><p>It was about this point that I fully realized how hard I was tripping. My driveway's cracks were glowing/darkening/expanding/contracting in full daylight! I was amazed. I walked back inside, stopping in the bathroom to examine my pupils, which were of course my whole eye. I stood looking at my reflection for a while (I seem to do this on just about every psychadelic) pondering who knows what. Myself, what I wanted, what I was doing to try to obtain it, etc. All the while the mirror and my image seemed to be warping and zooming in and out.</p><p>Thats most of what I remember. There was of course more visuals and more contemplation, but above is what I remember most vividly. I find it very hard to write a psychadelic trip report than say a cocaine or opiate experience, partly because its so damn hard to explain. This is my first one.</p><p>Also, apparently I didnt take certain steps that I should have to iv a phen.</p>",
 "year": "2006",
 "id": "54705",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-28T07:00:00.000Z",
 "views": "5070",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "7.5 mg",
   "administration": "IV",
   "substance": "2C-I"
  },
  "1": {
   "time": "",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  }
 }
}
