{
 "id": 5470,
 "title": "I Could See the Wind Blow",
 "date": {
  "submission": "2005-11-15T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "tay",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Ok it was the night before thanksgiving.  I was sittin at home and it was around 8pm and I was pretty bored.  My friend, j gets online and is like dude I scored some shrooms so I was like sweet wana trip tonite? He said sure and told me to come on over.  Well, I grab my bowl, cd's, and my guitars and amp and head on over to his house.  It was about 8:30 by this point and the plan was to chill a while at his house, wait for his parents to pass out, then eat some shrooms.  Well at about 10:30 the moment had arrived to dose.  I went ahead and rolled a fatass j and got some grape koolaid and started eatin my shrooms.  I dont really remember how many I ate, I know it was 4 grams though, cause j told me he had bought 8 grams from a friend and he had split it up nice and evenly so we'd both have about the same amount. We stood around the island in his kitchen and started eatin the shrooms.  By 10:40 they were all gone and the bag was in the trash can.  We turned on some music and I laid down on his couch downstairs waitin for something to happen.",
  "After about 20mins of layin there I decided to go smoke the j I had rolled earlier on.  We went out on the back porch with our acoustics and I proceeded to smoke the joint to my head since j was getting drug tested at the time.  As soon as I finished to joint I laid down on my back and looked up at this tree that was kind of leaning over his porch.  The first thing I noticed was that I could count every single branch on the tree and that every branch had kind of a blueish reddish aura around it. This is cool I though.  J noticed the same thing.  After marvelling over this for about 10mins or so I decided it was time for a shroom jam session.  I grabbed my acoustic and so did j and we proceeded to play the same two notes for the next 30mins just laughing at each other and making the comment that it sounded so cool and that we should record it.  We never got around to recording it, but looking back on it it wasnt that great, it was literally two notes, not chords being played.  Anyways, we went back inside and grabbed our electrics and started jamming. ",
  "The only thing I can say is wow, I thought marijuana made music seem more... Powerful! The shrooms made the music sound galactic to us.  I could literally see the music comin out of the speakers.  I knew what I was going to play next and I knew where to go and I knew how it would sound and it was just amazing.  We did this for about an hour then I laid on the couch and listened to the wall by pink floyd.  This is where my trip went wrong!",
  "I noticed that the wall was changing colors at first.  Like from pink to red to green to blue according to the sound of the music.  It was cool at first, but then I got extremely scared for some reason started freakin out kinda.  Not literally, but my mind was being pulled in 1000 different directions at once and I couldnt make sense of anything.  J was trying to talk to me but all I could do was sit there and look at him.  I couldnt understand him or answer I just stared at him wondering what the fuck he was doing.  I remember him shaking his head and laughing and walking away and going to the computer and me stayin on the couch trippin out.",
  "I guess about 30 minutes had passed when my cell rang.  It was my dad! All I could do was mumble and say goodbye to him. He definently knew I was fucked cause j kept yelling the walls are breathing.  About 10mins after I talked to my dad, my stepmom called.  O no I thought, here we go again.  I answered and sat down at the kitchen table and proceeded to watch the nobs on the oven change shapes and pop out at me and twist for I guess about 20mins while she talked to me.  All I remember is saying yes a few times and mumbling something and hanging up.. The oven was so cool. ",
  "After I got off the phone I wondered where j was.  I turn around and he was laying on the ground moaning he was going to die or something.  I tried to get him out of this state but he wasnt listening to me so I just left him.  I guess this kinda freaked me out cause I started to have a bad trip as well.  I laid on the couch and looked at the other couch across the room.  The patterns changed into the grim reaper.  I screamed and ran upstairs to his room as fast as I could.  After 10 mins of wondering why I ran up the stairs, I calmly went back downstairs.  I found j back at the computer wondering what had been happening for the last hour.  I told him and he kinda laughed and suggested we go upstairs to his room.  I went up to his room and immediately looked at his bob marley poster. In the poster bob's dreadlocks were flowing forward in front of bob.  I immediately saw them change into snakes coming out of his head and ran and jumped under the covers of j's bed.  He laughed at me and turned off the lights on made himself a bed on the floor since I had no intentions whatsoever of getting off his bed near those damn snakes.  He turned off the lights and I freaked.  All I did was lay in bed lost in my thought twisting and turning and moaning for an hour strait. ",
  "I remember looking up several times at these glow in the dark stars he has on his ceiling and I couldnt seem to see them quite right, they were constantly spinning and I was getting sick from looking at them.  I couldnt take it any more and turned on the tv.  Damnit I cant focus on the tv either! I screamed and at this point I freaked out again.  I thought I was going to die and that I wouldnt make it to the morning.  Then I turned around and saw this grateful dead poster.  The sun was rising on this field of giant sunflowers with terrapins walking around lookin at the sun.. Immediately the george harrison song 'here comes the sun' came to my mind.  I looked at the poster and sang the song to myself and realized that I was going to make it thru the nite, that the poster was a sign and the fact that I had immediately began singing the song",
  "Here comes the sun' right after I saw it the sun in the picture.  This comforted me greatly, and I soon fell asleep. It was about 4am",
  "At 730 the next morning my cell phone rang and it was my mom, telling me to get home to get ready to go to my grandmas.  I grabbed my cd's and my guitar, hopped in my car, and smoked the whole way home. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] (remember, I only smoked 1 j cause I totally forgot I had bud with me)  on the way home I was still tripping somewhat.  Trees were bending and I thought I could see the wind blowing every now and then.. Actually see it.  I was tired and in a bad mood for the rest of the day, which I guess was caused by the fact that I had a bad trip and that I had been up almost all damn nite and woken up early as hell, but Im glad that I did it cause its definently my favorite and most memorable trip Ive ever had."
 ],
 "erowid": {
  "id": "32453",
  "citation": " tay. \"I Could See the Wind Blow: experience with Mushrooms & Cannabis (ID 32453)\". Erowid.org. Nov 15, 2005. erowid.org/exp/32453",
  "substance": "Mushrooms & Cannabis",
  "views": "3882"
 }
}
