{
 "id": 5473,
 "title": "Cosmic Breathing",
 "date": {
  "submission": "2004-04-21T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Treefingers",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "7.0",
    "unit": "mg"
   },
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I got my hands on a small amount of the powerful entheogen known as 5-MeO-DMT.",
  "I was nervous about trying it, for a while I had incredibly intense dreams in which I would smoke the crystals and then immediately wake up. Quite similar to the common falling phenomenon in dreams. The powerful chemical intimidated me. I knew that it would be more intense than probably any experience I would ever have.",
  "Tiermos and I decided to try it. We made a makeshift spoon out of foil, and freebased it, using a pen tube to inhale the white smoke.",
  "My first experience did not propel me into the void that I knew was possible with 5-MeO-DMT, instead in seemed to launch me into the peak of an extremely intense acid trip within a minute. The incredible speed and strength of the drug were nearly too much to handle. Visuals were present, but not very noticeable. Everything seemed different, it was hard to explain. It was like I was in an entirely different room, but I still recognized everything. It was a completely alien space to me. The 5-MeO-DMT also seemed to intensify everything. For a long time all I could say was, its just way too intense, I dont really know whats going on, everything is so intense. After a few minutes this initial peak subsided leaving me with a nice and comfortably trippy afterglow.",
  "I was determined to go farther, so I loaded up a slightly larger amount and again inhaled the smoke. This time I knew I got more, but I also knew that I didnt get the breakthrough dose I was after. The trip again seemed to rush up on me. I felt a warm glow on the top of my skull and I felt that my awareness was slowly leaking through the top of it. I knew I was close.",
  "A third and final time I loaded the foil spoon and proceeded to take a rather large hit. This time I knew Id had enough. I managed to take a sip of water and utter, this is it, before I lay down on the ground and felt the power of 5-MeO-DMT.",
  "I lay with my arm over my eyes, my typical position for laying on my back. The buzzing intensity was stronger this time. I let 5-MeO-DMTs power take over me, as I knew it would be useless to fight it. I felt my arm melt into my mind. I then felt my mind melt into the ground. Somewhere I could hear music playing, somewhere I could hear Tiermos breathing, but it was all becoming fainter.",
  "I saw an image of my face, and I felt myself disperse in front of me. I could see my body, broken down to its elementary particles and blasted to the farthest reaches of the universe. I saw Muse in front of my eyes, and I felt her bodys particles break down and follow those of my own.",
  "And then there was nothing. I was the universe, my eyes were that of the cosmic consciousness. When I breathed, it was the universe breathing with me. There were no words to explain the experience, but somehow I knew that I had been there before, the first time I had done LSD. There was no feeling or seeing there was only being, but I knew that my being no longer existed. I was a part of that incredible paradox of which everything and nothing is created.",
  "The whole experience felt as though my entire soul was shot out into space and my awareness suddenly encompassed the entire universe. The only thing I could do was breathe. It felt as though my breath was giving the universe new life.",
  "After a few minutes I was back. I opened my eyes and attempted to speak of my incredible experience with Tiermos, but quickly realized that I wasnt close enough to baseline to talk. I proceeded to curl up into a fetal position, feeling my awareness creep back into its humble home.",
  "Suddenly I was down, there was no longer the lingering trippy feeling that I got on the first two attempts. And while I has experienced slight nausea the first couple times, there was none during my breakthrough experience.",
  "This was an awesome experience, and I knew that I wouldnt be doing it again for a long time. There was nothing scary about it, in fact it was entirely positive, I just felt that it needed to be respected, and I would gain the most from it if I used it in very moderate doses, perhaps no more than twice a year."
 ],
 "erowid": {
  "id": "32462",
  "citation": " Treefingers. \"Cosmic Breathing: experience with 5-MeO-DMT (ID 32462)\". Erowid.org. Apr 21, 2004. erowid.org/exp/32462",
  "substance": "5-MeO-DMT",
  "views": "8339"
 }
}
