{
 "title": "For Severe Depression",
 "author": "Alphawoman",
 "citation": " Alphawoman. \"For Severe Depression: experience with GBL (ID 54756)\". Erowid.org. Oct 11, 2009. erowid.org/exp/54756",
 "substance": "GBL",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "GBL",
   "(liquid)"
  ]
 ],
 "report": "<p>Summary: Unnerved by my increasing thoughts of suicide because of chronic, severe major depression that was not responding to any legitimate meds (tried 16 in all--Prosac was the only one that ever worked, but it wore off after a few years), I very carefully and slowly tried GBL.</p><p>First night: 1 ml, waited a few hours, another 1ml a few hours later--measured with a dropper. Slight mellowing effect, pleasant.</p><p>Second-fifth day: 2 ml, 4-5 hour wait, 2 ml again. 2ml is definitely the right doseage for me! Whoa. Euphoric feeling that got me out of myself. Some unpleasant side effects, though.</p><p>Cons (over a week time period): I'll tell you, it's a little scary to be drinking a solvent. I could only get myself to do it out of my desperation. It tastes like a solvent-yuck. Don't ever drop the drops straight into your throat! Felt like bleach going down. Put 1ml in at least 8 oz of juice. Felt intellectually foggy, little bit of a weird headache, some really bad nausea at one point. Sweaty skin and some restlessness as the chemical was wearing off. In the mornings I would have some stinging, shock-like sensations on the skin that weren't even quite unpleasant, just very freaky. Didn't sleep well despite all I had heard of it's great sleep-promoting effect.</p><p>Pros: I am glad I did it and will do it again if I get that immobilized by my depression again. It gave me a wonderful outlook, I was able to get out of bed, interact with people. I actually enjoyed being awake! I haven't felt sexual in probably five years and I was actually wanting to have sex. It produced euphoria for me, just like I had heard it would, but it was kind of a heavy handed euphoria. My brain felt a little fried afterwards. Honestly, I didn't like it as much as I like Prozac's effects, but it did spring me out of my depression.</p>",
 "year": "2006",
 "id": "54756",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-10-11T07:00:00.000Z",
 "views": "6876"
}
