{
 "title": "Shadows Seem Richer",
 "author": "Autowid",
 "citation": " Autowid. \"Shadows Seem Richer: experience with Absinthe (ID 54795)\". Erowid.org. Mar 25, 2008. erowid.org/exp/54795",
 "substance": "Absinthe",
 "bodyweight": "166 lb",
 "report": "<p>All starts off with a trip to Czech republic. I am use to pot,shrooms,chemicals,and such. I've heard Absinthe makes you 'trip' out but never thought it was true. Hate to break it to you all but it doesn't make you trip. Anyways, I bring back some good Absinthe (Absinthe King of Spirit's) and almost get busted through customs for it. In the united states its not FDA approved for consumption. After all the trouble with customs I hold on to it for a few weeks until I could drink it with some friends. Doing some research I decided to do the sugar cubes and shot class method.</p><p>Some Sunday night (7-23-06) I finally got to fully try absinthe. It started with the melting of a sugar cup on a spoon over an open flame then followed by dumping that into a shot glass and drinking it down. I had five of those shots. Pretty nasty tasting stuff, and most my friends didn't like it. I did notice effects almost right after taking the shots, mostly a mild/not crazy alcohol buzz. I decided to drink more.</p><p>I poured a Absinthe on the rocks and drank most of it down. I then had a second glass which followed nicely. I then sat back and waited for effects. Someone told me that I was always wrong when it came to trying new things, and that I should try them before giving rants about them not working. I thought about that. I did also notice that shadows seemed richer and that talking and convo's where smooth.</p><p>All in all Absinthe doesn't make me trip. It makes me mellow, and almost high.</p>",
 "year": "2006",
 "id": "54795",
 "gender": "Female",
 "timestamp": "2008-03-25T07:00:00.000Z",
 "views": "8481",
 "dose": [
  {
   "time": "0",
   "amount": "5 shots",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ]
}
