{
 "title": "Hysterical Laughter and Loud Music",
 "author": "Tripic Frog",
 "citation": " Tripic Frog. \"Hysterical Laughter and Loud Music: experience with Mushrooms (ID 54829)\". Erowid.org. Mar 25, 2009. erowid.org/exp/54829",
 "substance": "Mushrooms",
 "bodyweight": "120 lb",
 "report": "<p>It was summer vacation, and the weather was perfect. Me and my buddy P decided we should try some of the shrooms that had been going around. It was the first time either of us had tripped or done anything besides drink or smoke (mj, that is). The shrooms were white and bruised blue and it was mostly stems, a few caps. The stems, though, were really thick and I have since never seen any like it. We ate them as soon as we got them, driving back to my house (10 min. away). It was about ten o'clock by the time we got home.</p><p>Times are approximate:</p><p>T+10...I feel like I just drank too much coffee. P doesn't feel anything yet.</p><p>T+15...I think about walking around to settle myself down, so I tell P I'm going to go over to the porch light. I start to feel light-headed and light-weight throughout my body.  I try to remember something I read about walking around at the onset of a trip, but my mind is taking a passenger seat to this feeling in my guts.</p><p>T+20...I'm in an elevator going up very fast, but I can still move around. Suddenly I hear myself repeatedly saying, 'Ohhh man...Ohhh man...You don't even know... Ohh man...Wait till you feel this...' I am almost out of breath trying to convey this nonsense to him. P is hysterical at this. He's actually on the ground laughing, while I continue to feel more and more light-headed. P's fit of laughter would be the theme of the night.</p><p>T+25...My awareness of things is getting hazy, and I begin to feel sick. I lay down on the grass with my face up. It is partially overcast, and there are many clouds out. One right above me begins to take the shape of a buffalo head. This effect made me feel like I had to puke. So I did. It felt surprisingly great. Not like puking off alcohol. This had a relieving feeling, and it calmed me down a little bit. I then turned and noticed P talking to our friend N. He must have just gotten there while I was puking. I walked over there, and remember having a conversation about the remaining gram me and P didn't eat out of our quarter bag. It seems weird to me now thinking about how we left just that little bit in the bag, but I am kind of glad in retrospect. N and our other friends were just about to eat their shrooms at Z's appartment, but they wanted a little more. P mostly does the talking.</p><p>T+30-40...N is gone, though I don't remember him leaving. Me and P decide to wander around my backyard. Luckily, we have a cornfield behind my house. But first, we had to find our way to the path that leads to it. So we start to walk along the edge of the cornfield/backyard boundary, which has about a ten-foot wide strip of tall brush. We were very reluctant to go through that brush, so we decide to move along the edge of the cornfield into my neighboors yard. While we do this, some strange animal begins making noise like a chipmunk. High, squeeking sounds are coming from several directions. P hears them as well. We are somewhat amused by this, but also a little freaked out. Eventually we walk about a hundred feet along the edge of this ongoing brush, and decide we better just jump through it.</p><p>T+50...After this moment, I am not aware of the times of anything. I remember walking into the cornfield, and because it was the middle of summer, the corn wasn't tall. This allowed us to wander around aimlessly, drifting apart and staring at the stars. P laid down for awhile, and I followed soon after when I got sick of tilting my head straight up. I remember the stars were out more than earlier, which made for a pleasant experience. After some time, one of us got up and yelled to the other, and we decided to talk about what we were seeing. It was hilarious to try and speak to each other.</p><p>Eventually we calmed down and decided to walk back to my car and listen to some music. First, though, we had a few very important tasks to perform: To find the cd, eject the current cd in the cd player, and put the correct one in. I know it sounds ridiculous, but that was one of the most confusing things I have ever attempted. As soon as we got into the car, we were beginning to go a little crazy. We would both just drift off for a second (or minute), then begin laughing in fits like I've never experienced before. Just insane. I still laugh thinking about how funny everything was. I don't remember even really talking at that point, just laughing.</p><p>Eventually one of us reminded the other one what we were trying to accomplish. The mere bringing up of this idea of putting in the cd and how we had forgotten sent us into another hysterical fit of laughter. At one point P turned on the radio on accident and turned the tune knob wantonly to a static radio station. We stopped laughing and just listened for like ten minutes. Finally one of us managed to hit the eject button on the cd player. I don't know what happened to that cd, but when we tried to put the correct cd in (Tool-Aenema), we kept fumbling it. I don't know how it ever got in. We dropped it several times, laughing continuously. When the cd made its way into the player finally, we both just totally zoned out.</p><p>I remember thinking of my mind as a mushroom, and seeing tons and tons of little mushrooms bubbling in my mind, and I could hear their bubbling and feel it in some weird way. Then I was aware of a giant mushroom as being my central focus point of my mind, and two-sides of rushing, bubbling mushrooms moving in circles, one side on the right and one on the left. This was the a pleasant sensation and I focused on it for a while. I was experiencing many emotions, though, and it was hard to focus on anything for more than a few seconds. It was somewhat frustrating, but I always had the music to go back to. The drums were exploding and I couldn't understand the singing, but it was comforting compared to the new feelings I had of being mentally pulled in different directions nearly simultaneously. P always seemed to be either staring off, or would set off some automatic laughter inside me by simply moving a certain way. He responded pretty much the same to anything I did. I was surprised how unexhausting it was though, and how energized I felt.</p><p>After White Pony, P put in Deftones-White Pony. This seemed to make the trip more mellow. My confusing thoughts began to wear down, and after the cd ended, we decided to go into my house and look at some of the weird posters I have. The one that caught P's eye the most was my Sublime one. He stared at it for quite some time. We eventually went back to listen to music in the car. I don't remember what we played during this point. I think it might have been Incubus-Morning View. I was still tripping, but my reality had come back to me a bit.</p><p>P left at around 4 in the morning, feeling paranoid about not being home in the morning when his parents wake up. He lived just down the road, so the drive wasn't long. The next day he told me it felt like a video game, but that it wasn't very hard. I went inside, still feeling weird. I put some music on really low, and I thought that it sounded wrong because I had just been used to the music so loud. This left me a little unrelaxed, and it took a while before I could finally get to sleep. MJ and Bob Marley works like a charm for relaxing in such restless states.</p><p>The next day I felt fine. A little cloudy in the head, but I didn't mind the feeling one bit.</p>",
 "year": "2003",
 "id": "54829",
 "gender": "Male",
 "timestamp": "2009-03-25T07:00:00.000Z",
 "views": "3039",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
