{
 "id": 5482,
 "title": "Mixing Sleep Aids",
 "date": {
  "submission": "2007-01-01T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kutch",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "insufflated",
   "substance": "Alprazolam",
   "form": "ground/crushed"
  },
  {
   "time": "0:15",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "insufflated",
   "substance": "Alprazolam",
   "form": "ground/crushed"
  },
  {
   "time": "0:25",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "insufflated",
   "substance": "Alprazolam",
   "form": "ground/crushed"
  },
  {
   "time": "0:35",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "insufflated",
   "substance": "Alprazolam",
   "form": "ground/crushed"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "mg",
    "quantity": "5.0",
    "grams": 0.005
   },
   "administration": "insufflated",
   "substance": "Zaleplon",
   "form": "ground/crushed"
  },
  {
   "time": "1:15",
   "amount": {
    "unit": "mg",
    "quantity": "5.0",
    "grams": 0.005
   },
   "administration": "insufflated",
   "substance": "Zaleplon",
   "form": "ground/crushed"
  },
  {
   "time": "2:30",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "insufflated",
   "substance": "Alprazolam",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Before I begin the log, here's a little intrduction. I saw my family doctor for insomnia, and I had to try a bunch of homeopathis remedies (i.e. valerian root), but they didnt help. He gave me a bottle of Sonata and a business card for a local Psychiatrist who happens to be my brother's-friend'-dad, so I am worried about trying to get pills I dont 'NEED' from him because that could get back to my family. He basically provided me a few options, most were benzo's.",
  "The two that appealed to me the most were Valium and XanaX because I had heard of and done them before, I opted for the Xanax and he gave me a month supply of Xanax Extended Release. I tried it once and it made me late for school because it lasts for 12 hours. I went back to the doctor and got a 1 month supply of regular 1mg Generic Xanax, with a refill. I took it before bed and it worked awesome.",
  "Anyways, I have excess because I dont use them on weekends and school holidays. In this particular situaion, I had the last 4 of my bottle, and decided to try snorting them.",
  "------------------------------------------------------------------",
  "BEGIN LOG:",
  "12:30 AM",
  "- Crushed one (1) 1mg pill (not a bar) of generic alprazolam with an razor, on top of a mirror. Formed two thin lines with a library card, and snorted each with a rolled up dollar bill. It left a funny burn in my nose, and nothing's happened yet.",
  "12:45 AM",
  "- Repeated process. After snorting this set of rails, the onset of a normal 1mg dosage occurs. Conclusion thus far: Snorting 2 mg in 15 minutes produces the same effect as waiting 30 minutes for an orally consumed 1mg pill. (keep in mind the tolerance factor though)",
  "12:55",
  "-Repeated initial process of snorting 1 mg pill. Now we're talkin! At this point I have snorted 3mg, but I feel like I've taken about 5mg an hour or so earlier.",
  "1:05",
  "- Snorted the last pill (now totalling 4mg, the equalivent of 2 'bars') and I sort of dissapointed. I have the weird burn feeling you get from snorting, and moderate Xanax effects, I am considering absorbing some sonota through my tounge to make this worthiwle.",
  "1:20",
  "- Xanax in full effect, about to find and open up a 5mg capsule of sonota.",
  "1:30",
  "- Opened up o 5mg capsule of sonota, formed one long line, and snorted it all at once. It makes a much better rail than the Xanax because it's already a fine powder, and it tastes like flour, so it doesnt burn. MY guess is that the sonota will simply add to the Xanax high because it is a sleep aid. If it doesn't, however, I'll pop open another cap.",
  "1:45",
  "- Opened another Sonata and snorted it. None of the 10mg of sonota has seemed to affect me yet but It most likely is but my current drowsiness from the Xanax is just overpowering it. Right now I'm examing a Xanax XR pill,trying to figure out how to use it.",
  "2:15",
  "- Really I only feel like I'm on a couple milligrams of xanax, but the effects came on faster than they would have if I had eaten 4 pills earlier.",
  "2:45",
  "- The 'middle' part, is here. I have the Xanax high with added drowsiness from the Sonota. I anticipate that this high will last for quite a while",
  "3:00",
  "- I went ahead and snorted an Extended Release Xanax, I'm hoping that becasue it was snorted, it won't time-release.",
  "------------------------------------------------------------------",
  "--------------------------NEXT DAY--------------------------------",
  "------------------------------------------------------------------",
  "I cannot recall what time I actually fell asleep, but I awoke at 9:30 (against my own will) with no negative effects or a 'hangover'. I was extremely groggy though, but that was only because I went to bed late and woke up early.",
  "My final conclusion is that If you snort Xanax, you will almost instantly feel what you would usually feel if you had swallowed the pill whole 30 minutes prior."
 ],
 "erowid": {
  "id": "32495",
  "citation": " Kutch. \"Mixing Sleep Aids: experience with Alprazolam  &  Zaleplon (ID 32495)\". Erowid.org. Jan 1, 2007. erowid.org/exp/32495",
  "substance": "Alprazolam  &  Zaleplon",
  "views": "22609"
 }
}
