{
 "id": 5485,
 "title": "Inconclusive: Mild Relaxation",
 "date": {
  "submission": "2004-04-03T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Tyrvald",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Damiana",
   "form": "(tea)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Damiana",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharmaceuticals",
   "form": "(daily)"
  }
 ],
 "report": [
  "I've been out of cannabis for over a month, having only smoked a single bowl with a friend over a week ago.  This isn't great for me, as I'm a medical user, mostly for migraines and depression.  So because of a lack of pot, i've slowly gone back to my old headachy, easily bored self.",
  "I decided to order some herbs I've never used from a nice online Pagan shop.  One of these included a bag of Damania, which I had never before used.",
  "It was around midnight and I had been doing some research on the herbs I got, largely online and in The Complete Guide to Herbal Medicines (which I had just picked up for a few bucks at b&n), trying to decide how to go about experimental medical and spiritual use.",
  "I made a cup of tea, with a base of Republic of Tea's Chamomile Lemon and some extra valerian, along with good amount of that damania and some honey.  I also smoked bowl after bowl of straight damania, which was pretty easy to smoke, but left my throat sore (especially the next day).",
  "I hardly noticed any effect, and the relaxation I felt, was probably from the valerian and the music I was listening to.  I kept smoking the stuff until my throat had put up with enough.",
  "The first time I smoked pot I didn't realize I was high (just thought it was a good party), so my apparently lacking results are inconclusive.",
  "My experience with damania has been fairly disappointing, but some time I'll try it again, without the valerian root, and see if it gets me anywhere.",
  "Notes:",
  "At the time, I had been taking prescription medications such as Zyrtec, Prozac, Effexor and Strattera.  All were doctor prescribed of course."
 ],
 "erowid": {
  "id": "32501",
  "citation": " Tyrvald. \"Inconclusive: Mild Relaxation: experience with Damiana (ID 32501)\". Erowid.org. Apr 3, 2004. erowid.org/exp/32501",
  "substance": "Damiana",
  "views": "41184"
 }
}
