{
 "id": 5487,
 "title": "An Adverse Reaction",
 "date": {
  "submission": "2004-04-03T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "goober",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Pharms - Divalproex",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>Back in May of 01, some buddies and I got tickets to go to the Tom Petty concert. Being teenagers, we decide that no concert is complete without a fat sack of weed. Later on that day (the day before the concert) we get an ounce and a half, and go over to someone's apartment. Through the night, things got progressively stranger and stranger. After about six or eight bowls, I was feeling extremely disoriented and it just wasn't the usual high. Something was different about how I moved, how things sounded, how things looked. I came to the conclusion that I was just experiencing some hallucinations. 'Maybe it's just trippy weed' I thought. The night progressed, and we proceeded to smoke every way you can think of, and by about one am, I was sitting on the floor indian style, unable to move my arms, legs or head. I then realized that I was watching all this from the corner.",
  "While I'm watching myself sit helpless, I look towards a wall at this blacklight poster that has stopped glowing. Two human-like figures that were entirely grey (think person made out of paint) came out of the wall and walked over to where I was sitting, one of them grabbed my skull while the other one proceeded to cut it open. Once they opened my skull I watched them take out my brain and insert wires into the base of my skull and move me around on the floor like a snake. After several seconds of this, I woke up, lying on the floor, twitching. I don't really know what happened, but my friends say I was having a seizure. Thing is, I'm not epileptic. I was, however, taking a medication that is used in the treatment of various things, including epilepsy. I have since then stopped taking that med, and it has never happened again.</p>"
 ],
 "erowid": {
  "id": "32505",
  "citation": " goober. \"An Adverse Reaction: experience with Cannabis & Divalproex (Depakote) (ID 32505)\". Erowid.org. Apr 3, 2004. erowid.org/exp/32505",
  "substance": "Cannabis & Divalproex (Depakote)",
  "views": "14008"
 }
}
