{
 "title": "Distraction and Fractions",
 "author": "Air Combat",
 "citation": " Air Combat. \"Distraction and Fractions: experience with 4-HO-MiPT (ID 54917)\". Erowid.org. Aug 9, 2006. erowid.org/exp/54917",
 "substance": "4-HO-MiPT",
 "bodyweight": "220 lb",
 "report": "<p>Well, I got about 100 mg from a friend and he told me it needs to be broken down in alcohol. So me and my buddy waited for some peach schnapps in out basement. As soon as it arrived (with the second friend) I added it to just over a shot of it. I let it sit, shaking it slightly now and then to help it break down. We split it up into three tiny shots and drank it.</p><p>It took nearly an hour to kick in, but when it did, the three of us were reduced to simpering, laughing idiots. My buddy pissed his pants at least twice over the 6 or so hours it lasted.</p><p>I had less experience with powerful psychoactives than they did, so I was heavily debilitated. We went out for a walk and by the time we came back, I was lying on the floor staring around. It was pretty much a sterotypical 'Jimi Hendrix' acid trip. Everything was actually changing colours, going from purple to blue to orange and all that. We were listening to Phish on the stereo and the sounds was heavily warping (sounded much like a phase shifter). The whole thing was thoroughly enjoyable, as we couldn't stop laughing, but at some points I was a little scared that it wouldn't stop. The trip went on and on and we stayed up pretty much all night.</p><p>My buddy was in the washroom, trying to defecate, and he called out to me when I went to check on him, 'How do I take a shit?' and then we both burst into laughter. I later had the same problem as you are so easily distracted by the visuals that it is hard to get things done.</p><p>Overall it was an awesome experience.</p>",
 "year": "2006",
 "id": "54917",
 "gender": "Male",
 "timestamp": "2006-08-09T07:00:00.000Z",
 "views": "8272",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "4-HO-MiPT",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ]
}
