{
 "title": "The World Without Flaws",
 "author": "Starch&Carbohydrates",
 "citation": " Starch&Carbohydrates. \"The World Without Flaws: experience with MDMA (Ecstasy) (ID 54929)\". Erowid.org. Apr 4, 2009. erowid.org/exp/54929",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 0:30",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Ecstasy has always been a weak spot for me, I never turn down a pill.  I have rolled on multiple occasions, mostly with my long-term boyfriend. When we are under the influence of MDMA together, we tend to open up to many of our problems and things get resolved, and stay resolved after our trip.  The particular experience I would like to write about, however, is the first time I consumed ecstasy with a group of friends. </p><p>My background with other drugs is fairly brief, but in the half-year I've been involved with chemicals, I've tried quite a few substances and know my way around the more common uppers, downers, hallucinogens, and in-betweens.</p><p>4:30 PM</p><p>I'm driving to meet my friends when I drop my first pill.  Note: I'm aware that it won't hit me for another half-hour or so, I was not planning on driving as it hit me, as that sudden change in my mindset could potentially be dangerous while on the road.  At this point, all I'm thinking about is whether or not my friends will enjoy the night.  One other friend of mine, we'll call him Samuel, is planning on dropping a pill, but besides that, they will all be sober.  I worry also about another of my friends whom we'll call Michael, he's on probation and receives lie-detector tests, thus he will probably end up getting in trouble for being with people who are high.</p><p>5:00 PM</p><p>I pick up Michael and another friend whom we'll call Don from their house.  Both are very excited, I'd say as excited as I am, even though they won't be dropping any e-bombs.  We drive to a park by a lake that we've designated as our meeting spot.  My ecstasy is starting to kick in, so I drop my second pill with 2 vitamin C tablets.  The rap music we have playing sounds amazing to my ecstasy-infused ears, but my mindset is still pretty sober.  Usually, it hits me harder, but I had a full stomach and had just done ecstasy the night before.</p><p>5:30 PM</p><p>Finally, Sam and another friend whom we will call Lauren arrive.  Michael, Don, and I are standing outside my car, I'm half-dancing to the music, trying desperately to get the ecstasy to kick in.  It obviously hasn't yet though, as I'm somewhat cold towards Lauren, I don't particularly like this girl while I'm sober.</p><p>6:15 PM</p><p>I'm driving everyone to a park nearby.  We all like to trip in parks, the sunshine and fresh air always make for good experiences.  The ecstasy is really kicking in, it's difficult to drive not because of my altered state of mind but because my legs are fuzzy and twitchy.  I almost orgasm from the vibrations of the car as I drive. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>6:30 PM</p><p>As soon as we get to the park, Michael hurts himself.  His collarbone was already fractured, so he was in a lot of pain.  The ecstasy enhances the compulsion to take care of him in a doting, maternal sort of way.  He lays his head in my lap, and I talk him through it... although, looking back, talking probably didn't do much of anything for him.  </p><p>7:00 PM</p><p>After chilling out at this park for awhile, Samuel asks me if we can go talk alone for a few minutes.  This was his first time taking ecstasy, however he wasn't feeling much because he only took one pill and he weighs at least 170 lbs.  He sat there on the bench and couldn't exactly come up with something to say.  Finally, he said 'I'm scared to say anything, because all these things I want to say are so emotional and meaningful, and I never let myself say things like that'.  Though he was a first time user, he still caught on to the dangers of ecstasy.  It's too easy to say something you'll regret.</p><p>8:00 PM</p><p>I'm still rolling really hard.  I drive everyone to a lake nearby, because Lauren wants to go swimming.  Throughout the evening, I had really enjoyed this girl.  The thing that stuck out to me the most was that she put on my red lipstick.  Now, NONE of my girlfriends wear red lipstick, it's my trademark.  And so when Lauren put it on, I was absolutely overwhelmed by a feeling of sisterhood.  We were the only girls among a group of boys, and we were also the youngest ones of the group.  This tripped me out for a long time, and I decided that no matter what I would always treat Lauren like a sister.</p><p>9:00 PM</p><p>We drive back to our designated meeting spot to hang out for a few hours before Samuel and I crash.  Everyone is extremely happy.  This night has made me strongly believe in the existence of 'contact-highs', for if I had walked into the group without knowing we weren't all rolling, I would have sworn up and down that each one of us had taken ecstasy. </p><p>10:00 PM</p><p>I'm still rolling a little, so I decide to go swimming.  The lake would normally be too dirty for my taste, but the water felt phenomenal.  It was one of those spiritual epiphany sort of moments, swimming in my underwear alone at night, I felt as though I had all I needed.  Of course, sober, I know I could not be happy for eternity swimming in a lake in my underwear, but at the moment it felt completely right.</p><p>12:00 PM</p><p>I drive myself home.  I'm beginning to crash now.  With most ecstasy, I find that I can sleep for a few hours if I lay down before I completely crash. So, after playing around on the computer, I fall asleep and wake up to cigarettes and ice water (the only thing I can manage to put in my stomach after taking E), and watch happy movies as to avoid the nasty depression I often fall into after a night's worth of ecstasy.</p><p>All in all, taking ecstasy with friends for me was completely different than all my other experiences with the drug.  Taking it alone is introspective mostly, and taking it with a loved one is completely emotional.  Dropping E with friends seemed to be a happy medium, and was certainly worth experiencing.</p>",
 "year": "2006",
 "id": "54929",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-04-04T07:00:00.000Z",
 "views": "4274"
}
