{
 "title": "Suicidal Trip",
 "author": "Anonymous",
 "citation": " Anonymous. \"Suicidal Trip: experience with Diphenhydramine (ID 54967)\". Erowid.org. Jun 15, 2007. erowid.org/exp/54967",
 "substance": "Diphenhydramine",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "53 tablets",
  "oral",
  "Diphenhydramine",
  "(pill / tablet)"
 ],
 "report": "<p>[Erowid Note: 53 pills of diphenhydramine is considered an extremely high dose, see Diphenhydramine Dose Chart]</p><p>This was my first and only suicide attempt, as well as my first and only hallucination experience. I had been fighting with my parents for a few days, and on this night I had come back home. My parents had found out that I had been taking Ecstasy, so I was in a lot of trouble in the morning (I came back home around 10:30 and they were in bed). This added to my already depressed and suicidal mental state finally pushed me over the edge.</p><p>I had thought about several ways to do it: injecting air, poisoning, dropping an electric device in the bath. But I was scared of the possible pain. So I thought that if I OD'd on sleeping pills, I would just go to sleep and not wake up. Apparently I'm not always right. I took the pack of Benadryl, as well as a few more diphenhydramine sleeping pills that I found. I took about 6 pills, and while I was waiting for those to make me sleepy, I opened the rest of the pills. When the first 6 made me sleepy, I took the rest of them all at the same time. It took three handfuls to get all the pills down.</p><p>After that, it gets a little hazy. I remember walking around my house as if I was extremely drunk. My body just wouldn't cooperate with what I wanted to do. I was walking into walls, stumbling, and almost falling over. This woke my Dad up, who saw me in this state. I was aware of the fact that I was having such a hard time walking, but it didn't register that the reason was because I was so fucked up. So my parents called 911. While we were waiting on the paramedics, my parents got me dressed and sat me in the living room. I don't remember at what point the paramedics and police got there, but I do remember that they were in the living room talking to my parents. Nothing that was happening struck me as out of the ordinary. Every time I would try to get up out of the chair, they would tell me just to sit down and relax.</p><p>I don't remember being put on the stretcher, but I do remember laying on it while being put in the ambulance. It didn't register that it was an ambulance I was being put into, I was just being put into some vehicle. I remember that I thought the ambulance was infested with ants, and the little bastards kept biting me. Even though we were at my house, I thought we were at my friend A's house (this is where I would always go to do drugs). I continued to believe that I was at A's house for the remainder of the trip.</p><p>When we got to the ER, there were several people there with me. I remember my Aunt L, my Mom, and the Nurse, but the only person that I didn't think was someone else was my Aunt. I thought that my mom was one of my friends who was wearing a mask that looked like my mom, and I stared at her for a few minutes completely confused by this. They asked me if I knew who she was and I said 'It looks like Mom... but it can't be.' When the nurse came in and gave me the charcoal drink, I thought she was my friend Cameron, who is always drinking, so I thought that the charcoal drink was alcoholic. When I tried it and didn't like it, I asked 'Does anyone else want this? But they told me to drink it, and I didn't argue.</p><p>After I drank the world's worst drink, the nurse gave me a pink bucket. I thought 'What is that for?', and about a minute later, I was very glad I had that bucket, because I vomited charcoal all in it. Then I handed the bucket to my Aunt like nothing happened.</p><p>After I drank the charcoal, they finally let me have some water. I had such bad dry mouth that I could hardly talk. It seemed like every time I drank water, my mouth just absorbed it like a sponge, and was instantly dry again.</p><p>The trip lasted through the next day in some aspects. I was having auditory hallucinations the next day, I was having paranoid thoughts, I was thinking things were happening that really weren't, and it still didn't hit me that I was in a hospital. I remember waking up hearing someone knocking at the front door of the house I thought I was at. They were yelling that they were the police and that they had an arrest warrant. I woke my mom up (in reality) and told her that the cops were at the door and that someone better go answer it before they kicked the door in. I was really worried that they were going to kick the door open (they said they were going to, and I couldn't distinguish reality from fiction). Needless to say, no one got up to answer the door.</p><p>For the rest of the second day, I slept a lot, and continued thinking things were happening that weren't, or not making sense out of things that really did happen.</p><p>It was the third day that my mind really became rooted in reality again. But I was still having some problems, mainly with conversations. By this time, I had told my mom what I did, so they had a psychiatrist come in to talk to me. He would ask me questions, and I wanted to answer them, but while I was answering the questions, I would lose track of what I was saying, then forget the question. I would be answering the question, and in the middle of the sentence, my train of thought would just vanish and I wouldn't be able to finish the sentence. It was very frustrating, because I knew what I wanted to say up until I was in the middle of saying it.</p><p>It was very hard to pee, because Benadryl dries me out real bad, and I couldn't hardly eat anything except the three or four bites that I forced down to get out of the ICU.</p><p>When I finally did get out of the ICU, they asked me to go to the psych ward for a few days, which I agreed to. That was pretty much the end of my experience, except that I had a really dry cough for about a week after that.</p>",
 "year": "2006",
 "id": "54967",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-15T07:00:00.000Z",
 "views": "19100",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "53 tablets",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 }
}
