{
 "title": "Dissolving the Mind",
 "author": "Prometheus",
 "citation": " Prometheus. \"Dissolving the Mind: experience with GBL & Ketamine (ID 54984)\". Erowid.org. Sep 4, 2006. erowid.org/exp/54984",
 "substance": "GBL & Ketamine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5.0 mg",
   "oral",
   "Pharms - Selegeline",
   "",
   " T+ 4:30",
   "2.5 mg",
   "oral",
   "Pharms - Selegeline",
   "",
   " T+ 6:00",
   "2.0 g",
   "oral",
   "GBL",
   "(liquid)",
   " T+ 6:30",
   "70 mg",
   "IM",
   "Ketamine",
   ""
  ]
 ],
 "report": "<p>I had been having a pretty uneventful day reading and working in my lab at the med school.  When the evening rolled around, I felt a powerful desire to go into an altered state of consciousness.  But how?  I had some ketamine, GBL, and an assortment of research chemical tryptamines and phenethylamines.  I was not in the mood for a long trip, so I was left with only two options: ketamine and GBL. </p><p>I decided to take some GBL first, so that I would be calm while administering the ketamine as an IM injection.  I'd never injected myself before, but I had a friend give me an IM injection of ketamine once, and I decided from that experience that the IM method is vastly superior to insufflation (no revolting taste dripping down my throat, which I think prevents me from having an OOBE because my body is in an unpleasant, nauseous state).</p><p>Once I felt sufficiently relaxed from the GBL (metabolized to GHB), I decided to embark upon my ketamine adventure.  I pulled up half a milliliter into the syringe and poked it into the meaty muscle on the top of my thigh, then injected the 50mg.  Easy, no pain whatsoever!  Before the effects began, I decided that I would need a higher dose to induce an OOBE, so I pulled another .2mL (20mg) into the syringe and spiked my other thigh in the same spot.</p><p>By this point, I was beginning to feel the effects coming on, so I put on a brand new CD that turned out to be perfect dissociation music, Tripswitch Circuit Breaker.  I like to hear completely new music when I trip because if I listen to familiar music there is a sense of continuity of self:  I know this music, I love this music!  The problem is that when I do ketamine, I dont want to be aware of my individual self, for the self obstructs any attempt to achieve true boundlessness, universal consciousness, or the oceanic experience.</p><p>Very soon after I laid down in bed, I felt myself break apart into individual molecules, then individual atoms, then subatomic particles, and I dissolved into the universe.  Most of the trip was so ineffable that to attempt to put it into words would be impossible without resorting to outlandish metaphors that really would not convey in any real sense what I experienced.</p><p>At one point, however, I experienced the consciousness of one of the baby mice that I have to kill as part of my research.  I was writhing about on my back, and I saw an enormous creature approach me and insert a gigantic needle into my peritoneal cavity and inject who-knows-what.  I felt wronged, but the giant looked down upon me benevolently and thanked me for my martyrdom.  He radiated love as he apologized for my suffering, and this eased my discomfort enough that I could fall asleep.  I awoke back in my own human body, and thought that it would be nice if my supervisor could have that experience.  He seems so callous about sacrificing animals for science, even monkeys, our phylogenetic brethren.</p><p>The experience continued in waves: I would fall away from attachment to my self, then return, and so on and so forth.  I had been hoping to experience synesthesia with the music and to have a true Out-Of-Body-Experience, but neither of these occurred during my trip, to my disappointment.</p><p>In retrospect, the trip was not very interesting, and I doubt I would repeat it.  Perhaps the GBL dulled the trip.  I havent done enough ketamine to make a decent comparison between pure K versus K + G versus K + Deprenyl versus all three.</p>",
 "year": "2006",
 "id": "54984",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-09-04T07:00:00.000Z",
 "views": "10298",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Pharms - Selegeline",
   "form": ""
  }
 ]
}
