{
 "title": "I Couldnt Even Buy It Yet",
 "author": "This_Sucks",
 "citation": " This_Sucks. \"I Couldnt Even Buy It Yet: experience with Alcohol (ID 54989)\". Erowid.org. Sep 24, 2008. erowid.org/exp/54989",
 "substance": "Alcohol",
 "bodyweight": "190 lb",
 "report": "<p>When I was 17 me and my friends started drinking regularly. I dont mean just drinking, we got smashed everynight of the week. This lasted for about a month until most of my friends started getting tired of it everynight so they cut back to once or twice a week, but that wasnt the case for me and my friend Joe.</p><p>We both loved drinking and when we didnt, we'd sit there and just keep saying back-and-forth, 'why didnt we drink tonite'. Just made the night horrible, bUt this was a rare occasion since we loved it so much and couldnt get enough. We'd binge (like drink from wake to sleep) for like 3-4 days, then stick to only at nights for a week, then binge again. This wasnt a problem during summer since parents are at work and we didnt have to get up early, but then school started and we couldnt stop.</p><p>First 3 days of school we didn't drink, but it was so unnerving to not be drunk at night that I couldnt even sleep without sneaking downstairs for a rum and coke, or atleast a few shots. If I didn't have a drink I'd either not sleep at all or wake up every ten minutes in a cold sweat.</p><p>I imagine it was the same for him cause he called me after the third day back to school and said something like, 'hows about we go pick up a 12 pack for old times sake?' (old times sake, like it had been years since our last drink) I picked him up and it turned into two 12packs. The next day we realized it wasnt that bad going to school hungover so we did the same thing the next night, and the next night, etc.</p><p>It started getting real bad though when Id drive him to school (he went to a different school) and we'd kill a 12 on the way. That's when the parents started taking notice. I got grounded for a month for getting caught drunk in school. Didnt really make a difference, instead of going to drink with Joe, Id sit at home and watch tv and drink myself. When I got out, it started right back up.</p><p>My dad kicked me out two days after my 18th birthday. I lived with Joe for about 7 weeks, then he turned 18 and his dad kicked us out. Living on our own we didnt even go home at night, we'd just drink and drink and drink, until we passed out. Then the cops would find us sleeping on someone's lawn or in the park and we'd sit in jail for the night. We were arrested for underage drinking/drunk in public four times in the same month, not to mention a number of other times.</p><p>I'm only 18 and I've been attending court ordered AA meetings everyday for the past month and a half and take all sorts of meds to help with the cravings. (same for joe) My parents are letting us live at their house now that we're in the program, Joe's dad said he'd kill him if he ever came around so he wont even ask to return home. We still have a drink every now an then, but only like one or two drinks, havent gotten smashed since the meetings started. It's been 2 weeks since my last drink and i'm pretty proud. I haven't lasted that long in a while. Still cant find a job though because of all the drinking arrests and because my schedule is limited due to the meetings, they wont say thats the reason but I know it is.</p>",
 "year": "2006",
 "id": "54989",
 "gender": "Male",
 "timestamp": "2008-09-24T07:00:00.000Z",
 "views": "6966",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(daily)"
  }
 ]
}
