{
 "id": 5500,
 "title": "A Taste of the Chase",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "203"
 },
 "author": {
  "name": "Stash",
  "gender": "Male",
  "weight": "65 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Heroin"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "repeated",
   "substance": "smoked"
  }
 ],
 "report": [
  "I am Australian born Vietnamese. I started smoking weed when I was 15yrs old, got addicted and was influenced by friends to start selling heroin to support my lavish lifestyle & Marijuana habits. Dope had small profit, unless I bought big, and moved it super-fast. And I never had enough capital to buy a pound of weed, let alone good weed in that quantity.  Yet Heroin was given to me in large quantities (1ounce) on loan, under condition I paid back half of what I made to suppliers. Like any good product, it basically sold itself, I just needed to know where and how.",
  "It didn't take long before I tried snorting it, then smoking it, and eventually wacking it. Combined with weed it gave me whole body rushes, & out of this world experiences. At first it caused me to vomit & collapse to sleep, I couldn't keep my eyes open as everything seemed to bright. Once I got a tolerance to it, nobody knew I was on anything, I could live a somewhat normal life.",
  "When I turned 18, I bought my 1st car, paid for in cash. And quickly found myself involved in the 'in' crowd. I'd deal all day till the early evening, switch off my phone, then gamble and go to clubs all night. Picking up wasn't a problem, when I had a huge cash flow, and an expensive sports car. (hangers-on was a problem)",
  "Anyway, sex on a moderate dose was simply fantastic. I could do it hard 'n' fast for 3-5hours without ejaculating. And throughout I felt as though I was having orgasms regardless. Women would be too satisfied, that they would insist we stopped as it became to painful for them.",
  "That is what really caused me to relapse after I finally got out of the game. Sex never was as good or fun as it was on heroin. And I could truly never satisfy a woman the way I used to. And especially as my ex-girlfriend's would expect the same from me when I was clean. It messed with my self-esteem, as I used to have a super-penis, now a normal penis.",
  "So every time I was with a chick, I'd use again. And sex got frequent, so using did also.",
  "Heroin isn't really a great feeling, it just extremely addictive. What goes up, must come down. All good things must come to an end. Heroin cost me 6-7yrs of my life, the only woman I ever loved, most of my friends, 2yrs imprisonment, 5 near death overdoses along with my families trust and respect (which still hasn't full been rebuilt, 2 years later).",
  "Was it worth it? Hell no! Once is too much. Because with Heroin, once is never enough."
 ],
 "erowid": {
  "id": "32546",
  "citation": " Stash. \"A Taste of the Chase: experience with Heroin (ID 32546)\". Erowid.org. Jun 25, 2007. erowid.org/exp/32546",
  "substance": "Heroin",
  "views": "7293"
 }
}
