{
 "title": "The Bobbing Head",
 "author": "Yurt",
 "citation": " Yurt. \"The Bobbing Head: experience with Hydromorphone (Dilaudid) (ID 55005)\". Erowid.org. Jul 31, 2006. erowid.org/exp/55005",
 "substance": "Hydromorphone (Dilaudid)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "2.0 mg",
   "IV",
   "Hydromorphone"
  ]
 ],
 "report": "<p>I was 18 years old, slightly bored and slightly interested in opiates. I tried codeine cough syrup for a bad cough I had about a year prior and it caused the most wonderful sleep a person could ask for, since then I had kept my eyes out for any opiates that might cross my path. When I heard I could get some Dilaudid I decided I should go for it and snatched those motherfuckers up.</p><p>In the next few days I researched Dilaudid and found that they were pretty much worthless when taken orally, so I either needed to snort it or bang it.</p><p>I sat down at my desk and cut up one of the small round pills, I was surprised how much powder was actually compacted into that. Prior to snorting it, I rinsed my nose out with a homemade saline solution (added a teaspoon or two of salt to a glass of water and inhaled through my nose) to increase absorbability, I heard it works and it couldn't hurt right?</p><p>I snorted the line all at once and sat back to enjoy the effects which came on rather quick. I decided to do one more and so I did. I felt warm, at peace, some euphoria, and itching, general opiate effects, but nothing to write home about even though this was supposedly one of the greatest pharmaceutical opiate available. After getting a taste for Dilaudid I decided the only real way to ingest it efficiently, and to get the very best effects from it would be to bang it.</p><p>And so I started looking up how to inject drugs intravenously, it was a new and interesting subject, I had never even considered IVing any drug and here I was researching how to do it. Growing up in a white collar community in the suburbs I was incredibly ignorant about the entire process, and I actually felt dirty thinking about it. I learned to put these thoughts aside because they were unfounded and were just created from the general publics own unfounded reasons to dislike intravenous drug use. I always say any drug can be used safely and there was nothing inherently wrong with putting a drug in my veins, it happens at hospitals all the time and everyone trusts them... mostly.</p><p>I went out to get supplies, needles, sterile cotton balls, rubbing alcohol, bottom of a soda can. None of these were tough to get and so late one night I decided to get to work.</p><p>I started boiling water because I didn't get any distilled water, not a necessary step, but I wanted to be as safe as possible. As the water was boiling I sterilized the soda can and washed up with anti-bacterial soap. I then crushed up the pill and put it into the newly sterilized soda can bottom which had the bottom pointing upwards. I then went downstairs, filled the needle up with the water which I had let cool and let it cover the powder.</p><p>As I waited for it to dissolve completely I looked around for something I could use for a tourniquet and came up with a sock, it wasn't great but it worked well enough. I dropped some cotton into the mixture and then placed the needle in the cotton and pulled back on the plunger, filling the needle with Dilaudid and air. I flicked the needle and ended up getting all the air out. Then I was ready for the hard part...</p><p>I tied the tourniquet around my left bicep, making the vein I wanted to shoot in more defined. I tried to steady the needle parallel to my arm to get the needle in good, but I was shaking so much, it made things difficult, the research didn't prepare me for actually piercing my vein with a needle... I was scared.</p><p>I managed to calm myself and get it in there. Jab. No vein. Jab. Pull back on the plunger, fuck the needle came out. Jab. This hurts and isn't working. Jab. How do addicts get high? I needed to re-collect myself, I set the needle down, not expecting it to be this hard. I tightened the tourniquet and really focused.</p><p>Jab. Pull back on plunger, the barrel slowly lets dark red blood in, I've hit the vein. I take a breath, and inject the drug into my vein.</p><p>I sit back in my chair, still really nervous and just as I remove the needle I am overcome, I'm hit, I'm destroyed by the most intense feeling of warmth/bliss/euphoria anyone could ever experience. I feel like I was so close to pure bliss without going overboard that if I had done the slightest bit more I would have actually been overcome with these feelings and would have had to throw up and pass out not necessarily from nausea but I just wouldn't have known how else to react. My head was bobbing back and forth as if recovering from each wave of warmth that hit me.</p><p>A tremendous grin comes across my face as I type to my friend on AIM how it went.</p><p>Me: !@)*@#@ HAHAHAHAAHA REOMRHF HAHAHA WOW FUCK AHAHA</p><p>Him: What? wtf, what happened are you all right?</p><p>Me: Yes, I'm perfect, that was incredible holy fuck.</p><p>I know I will never be able to come close to that feeling again, I felt on top of the world for about 5 minutes, the thing about Dilaudid is it's short lasting, it didn't end there, but that rush, I can't top it. Some say it's better than heroin, I haven't tried H but I can't imagine it being better than what I experienced.</p><p>It felt like huge waves of warmth were attempting to drown my body, I was just getting hit and hit again with these wonderful feelings. Things finally started to slow down, and it was a more calm opiate feeling, I went to check my pupils and could barely find them.</p><p>I went downstairs to get some water and sit around, after putting away all my paraphernalia of course. I watched TV for a bit sipping on water and started to nod off, once I recognized this I made my way to my bed and passed out.</p><p>The next day I couldn't keep my mind off Dilaudid, I wanted to bang it again but knew that would be a bad idea. I thought about that rush a lot for a few months, but eventually it subsided and my urges were gone completely.</p>",
 "year": "2005",
 "id": "55005",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-07-31T07:00:00.000Z",
 "views": "56170",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2.0 mg",
   "administration": "IV",
   "substance": "Hydromorphone"
  }
 ]
}
