{
 "title": "Rolling Inside, Tripping Outside",
 "author": "Sopris",
 "citation": " Sopris. \"Rolling Inside, Tripping Outside: experience with AMT & Nitrous Oxide (ID 55040)\". Erowid.org. Feb 5, 2008. erowid.org/exp/55040",
 "substance": "AMT & Nitrous Oxide",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "oral",
   "AMT",
   "(capsule)",
   " T+ 2:45",
   "7.5 mg",
   "oral",
   "AMT",
   "",
   " T+ 3:15",
   "1 repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "report": "<p>I have had quite a few experiences with this drug back when it was widley available on the internet in 2002-2003. My experiences with this drug have always been extremely positive and mellow, with great visuals, so I was excited to once again after 3 years get a chance to take this tryptamine.</p><p>T + 00:00: Me and J both take 1 capsule, which we estimate contains about 30 mg AMT (the gram was distriubted into rougly 30 equal sized capsules).</p><p>T + 01:00: nothing yet, not even nausea.</p><p>T + 02:00: nausea not too bad.  At this point we make a decision to go to the head shop and buy some 2 boxes of nitrous.  This involved driving, not normally a good idea right before you come up but there still isn't much going on. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>T +2:30: On the drive home, I am experiencing major tunnel vision.  The visual aspect of the trip is starting to come on.  Luckily the head shop is about 2 miles from the house so got home safe.</p><p>T +2:45: I drink a cup of water which is estimated to have between 5-10 mg of AMT.  The smell is awful but all I taste is water and it goes down easy.</p><p>T +3:00: We put on G-force and I continue to get lost in the music. I feel very similar to taking ecstasy but with decent visuals.</p><p>T +3:15: we take some nitrous.  Woah.  An intense rush creeps over me that can only be called bliss.  The visual element is now more striking than LSD.</p><p>We continued to take nitrous and everyone lead to an intense, beautiful rush.  Almost like cocaine or something.  When we would go out on the porch, the visual element would become insane.  While my hallucinations on this drug could easily be blinked away and were not overwhelming, allowing my eyes to blur seems to lead to insane visual patterns and images.  Years ago when we used to take the substance, we had a Dali book that was perfect for this drug.  Every page would look like a movie - the image will literally transform, melt, turn 3-d, but never become overwhelming and generally wont leave the page of the book... The sky looks gorgeous.</p><p>It seems to me this drug feels like E with visuals when I am inside in a dark area, while more trippy with beautful visuals when I am outside with lots of ambient light. </p><p>I am happy to have redisovered this substance.</p>",
 "year": "2006",
 "id": "55040",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-02-05T08:00:00.000Z",
 "views": "5645"
}
