{
 "id": 551,
 "title": "Heart Rate Shot Up",
 "date": {
  "submission": "2005-09-14T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "LrgSmplDgrm",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "I had always been interested in Ritalin and Adderall as recreational drugs but had never had the oppertunity to try them. I had put together a decent sized salvia expedition of around 5 people and we had all been smoking a good amount of marijuana. I snorted around 20mg of Adderall in a few large bumps and immediately had to get a glass of water. In the future I will not be snorting this substance, it sticks, it has a sharp feeling on the nostril and is extremely unpleasant. I then took some more pot to smooth out the feelings in my nose, I soon began to feel strange, but I couldn't decide if it was the Adderall or the bong rips.",
  "The salvia was packed and I took first rip. Burn it hot, hold it in, big rips, doing it the right way. However, there was no water in the pipe and I got the salvia bong rip of a lifetime. After this I hit another salvia bong and layed back for a few moments to collect my thoughts and lungs. What happened next was an intangible experience somewhere between spooky and euphoric. I fell into the world of salvia rapidly, and I found myself in a vision, where half the world was nature and thought, and the other half was human interaction. I spent my time wondering in between the worlds for a moment or two but quickly snapped back to reality. My heart rate was asinine, I figured it to be nearing 200 after the salvia rips and adderall. I was in no condition to call for help and my group of friend was used to my 'spacing out' after large hits of anything. I felt trapped, helpless and without any type of plan if my heart rate had continued to rise. Luckily I soon found myself back down to earth, with a normal heart rate, temperature and respiration. My friends said I was visibly flushed, dead silent and breathing hard for roughly 20minutes.",
  "The Adderall/Salvia experience was worth it, and it definitely is an interesting drug combination. But at a great expense, this trip took its toll on my body, I'm still feeling it days later. Sleeping was also an ordeal, which comprised of my sitting upright for 5hrs, remembering nothing of it other than the fact that I didn't sleep. Remember the physical effects of drug combo's when considering them, I ignored them and payed a small but significant price."
 ],
 "erowid": {
  "id": "11232",
  "citation": " LrgSmplDgrm. \"Heart Rate Shot Up: experience with Cannabis, Amphetamines (Adderall) & Salvia divinorum (ID 11232)\". Erowid.org. Sep 14, 2005. erowid.org/exp/11232",
  "substance": "Cannabis, Amphetamines (Adderall) & Salvia divinorum",
  "views": "10887"
 }
}
