{
 "title": "Not For the Weak",
 "author": "LoKi007",
 "citation": " LoKi007. \"Not For the Weak: experience with Dimenhydrinate (ID 551)\". Erowid.org. Sep 9, 2000. erowid.org/exp/551",
 "substance": "Dimenhydrinate",
 "bodyweight": "185 lb",
 "report": "<p>OK I have done a wide variety of drugs (coke, shrooms, lsd, salvia, peyote, dxm, pot, pcp, E etc...) but this takes the cake.  I took 8 pills of dimenhydrinate originally and then 20 minutes later decided what the fuck and took 2 more.  This was at my dorm and was done for no paticular reason other then to try it out. About ten minutes after taking the 2 extras i started to feel very strange.  It was very much like acid but different in an unexplainable way.  I became very tired and made a pot of coffee.  This was when I noticed I was real stupid.  I made the coffee but forgot to put the coffee in.  I didn't realize this until the whole pot was brewed.  I was also having alot of trouble walking and keeping my balance.</p><p>About an hour into the trip objects took on a new light and started to breathe as they do on shrooms.  Then I felt an incredible urge to take a piss which was to be an urge i would have throughout the entire night.  While in the bathroom things just went nuts.  First there was a shadow of a person on the wall that wasn't mine and it began to move.  I thought, cool.  Then everything began to fade in and out of vision and white dots that appeared to explode were on everything in site.  After about ten minutes of being stuck in the bathroom i became terrified and ran out.  I was also extremely cold and decided to grab a blanket which i took to my living room.  I then hung out with my roomates who thought I 'looked' insane at the time.  Not a single thing in my vision would stay put.  Everything swirled and kind of blinked in a way.  I decided after about 30 minutes of staring blankly at the tv I would take a little nap.  I went to bed, which was no problem even with coffee in me and woke up with out an alarm 20 minutes later when my roomate checked to see if I was still breathing.  I have no recollection of alot of the night after this point but I was entirely too fucked up.  Nothing has ever left me in the condition i was in.  I also had my first auditory hallucination ever.  I was listening to Lucy in the Sky (Beatles) and all the sudden it was in tongues.  I knew it wasn't right and i got close to the speaker and it just kept going until the next verse.  I could not believe my own ears.  I then after this proceeded to go to bed figuring i have had enough of it. </p><p>When i woke up 6 hours later i was still tripping and had to go to class.  This was very interesting.  The whole day I went in and out of the trip each time the the trip was shorter and spread out longer fromeach other.  I must say this is the strongest drug i have ever done and i just cannot believe it is legal.  I would not recommend this to anyone unless you are very good at handling strong trips.  The trip has not entirely worn off yet so i cannot say what the duration is but i can say it is way too intense for about 6 hours.  And also be prepared to become an idiot for a while if you plan on doing this.  I had alot of trouble keeping my thoughts going and had alot of trouble communicating with other people.</p>",
 "year": "2000",
 "id": "551",
 "timestamp": "2000-09-09T07:00:00.000Z",
 "views": "14035",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 }
}
