{
 "title": "Nice Report Card! Let's Celebrate!",
 "author": "DamnTangy",
 "citation": " DamnTangy. \"Nice Report Card! Let's Celebrate!: experience with Cannabis (ID 5510)\". Erowid.org. Jan 16, 2002. erowid.org/exp/5510",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>To me, marijuana should be used to enhance happiness.  I had recieved my report card and for the first time in my high school career, I was actually on the honor roll.  To celebrate this joyous occasion I purchased a 1/4oz of nugs, go figure.</p><p>I showed up at my friend's house with pipe in hand around 9 pm.  We climbed the stairs up to her room (the attic), lit some incense and got the party started.  We lounged on the couches and we just kept smoking like chimneys, pipe after pipe, joint after joint.</p><p>The first few puffs had gotten me pretty high and smoking more made my mind soar to new heights.  We were listening to Dark Side of the Moon over and over again.  The music was so enriching and thick I felt like I could have tasted it as the noise flowed from the speakers.  As I laid on the floor it felt as if someone was pulling me backwards through water.  I was suffering from severe cotton mouth, so I walked downstairs to get a drink.  The air was so much cleaner and crisp.  Entering the attic, it was as if I had been engulfed in a rich sweet white haze.  It was like a dream sequence on TV, everything was so clouded yet intense.</p><p>Continuing our smoke-a-thon, my friend's brother walks into the attic and asks to join us.  The three of us were laughing, reminiscing, pondering the meaning of life, our words just bumped into each other as one giant incoherent mess.  My friend and her brother were discussing memories of each other as children. Talk about a way to bring two family members together.</p><p>I knew we had smoked ourselves into oblivion once we were all rolling around on the floor mumbling to ourselves.  It was about 2am when we all drifted off to slumber land.  When I woke around 10am, I felt like I had just completed a whole lifetime of movement in a single night.  I just laid on the floor, lit a morning bowl, and reflected on my life as the sunlight streamed through the windows onto the floor.</p>",
 "year": "2001",
 "id": "5510",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-01-16T08:00:00.000Z",
 "views": "12599",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
