{
 "title": "I Discovered the Meaning of My Life",
 "author": "DialToneZ",
 "citation": " DialToneZ. \"I Discovered the Meaning of My Life: experience with DXM (ID 5512)\". Erowid.org. Jan 17, 2002. erowid.org/exp/5512",
 "substance": "DXM",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "500 mg",
  "oral",
  "DXM",
  "(powder / crystals)",
  "",
  "400 mg",
  "oral",
  "DXM",
  "(powder / crystals)"
 ],
 "report": "<p>Last weekend I went camping with a few friends and decided to dex. When we arrived, there was of course whiskey and pot. After we we set up camp, we each took a 500mg DXM cap. Then we crammed 8 people in a tiny car and drove forever back into town and went to the Waffle House. Everyone else was drunk and stoned and we were beginning to trip. We made it out of there without having the cops called on us and went back to the camping spot.</p><p>We were tripping pretty hard by that time (nature has a great effect on psychedelics) and I was staring into the fire and everything else, including the loud drunks, just disappeared. They were of no importance. I began to communicate with the fire. I know this sounds very wierd, but psychedelics are just wierd...Anyway, I sensed the Spirit of that fire (not the Spirit of the Element, but that specific fire, which was dying down) as a fading, wise, old, and lonely man. It revealed to me that I would become all powerful if I gained the power of 4 Elements: Fire, Water, Land, and Air, and that I would have to do this by communicating or battling the Spirit of the Element.</p><p>It did not tell me this verbally..but through thoughts and feelings..it's very hard to explain. I respected the fire, and I could tell it had respect for me, and thought of me as a pupil, as Yoda felt toward Skywalker. It gave me it's power and fulfilled 1 of the 4 Elements I was to attain. All of this was very convincing and extremely strange. This was not a high dose either, but being in nature increased the wierdness. (I imagine the pot and alcohol did too...) We redosed later that night with about 400mg. I had the feeling of being in several places at once (sitting on the ice chest, in the chair, in the tent, etc) and I'd be like 'How the fuck did I get here?'</p><p>The next day, I still felt pretty damn wierd and I had a battle with the water that was funny, but a battle nonetheless.</p><p>The water came very close to winning, but I received the reward of its power. I have 2 Elements left to attain which will probably take me a while (yes, I still believe this even after the trip..call me crazy..whatever), but it is my goal and I will become all powerful. :) The battle I fear the most is with Air. I *really* do not want to confront it. Hopefully I can gain it's power without a fight. I know all this sounds very crazy..but I believe it.</p>",
 "year": "2001",
 "id": "5512",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-17T08:00:00.000Z",
 "views": "24042",
 "dose": {}
}
