{
 "id": 5514,
 "title": "New Respect for Entactogens",
 "date": {
  "submission": "2004-05-19T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "sepulfreak",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablet",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "3"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Mindset: Good mood, slightly tired. ",
  "Method of Dosing: Oral, Pill.",
  "Trip Dose and Duration: One pill, chemical analysis of a few of the same pills tested positive for MDA. ",
  "Medications: None.",
  "I have used MDMA before three times, though it was three years ago, and I never really saw it for what it is, or even understood it because of my love for traditional psychedelics.  It was quite a change, and I was expecting it to cause a trip, but with more of a feeling of comfort in the body and mind.  I never got any visuals, though I did feel awesome.  It never changed me like Peyote, Psilocybe mushrooms, Morning Glory, LSD, and such has.",
  "Well, I was on Pill Reports reading about a certain pill that plenty of people seemed to think were awesome on Thursday March 25th.  On Friday, I was in Wallmart and I ran into my friend J who said he rolled for the first time last night.  I wasnt too excited, but I asked him how he liked it.  He said he loved it, but I still wasnt interested because of my prior experience with entactogens.  I asked what was on the pill, and he described the exact pill I was reading about on Pill Reports that was around the area where I live.  My girlfriend was with me, and so we decided to give it a try.  I couldnt remember whether the pill was said to contain MDMA or MDA, but everyone said they felt very clean and very strong.  Many said they would never take more than two of the pills.  I proceeded to purchase two of them, and me, my girlfriend A, J, and another friend P went to his house where I was going to make them some Poppy seed tea, as they wanted to try it after I reported a few successful experiences to them.  Ps cousin came down as well. ",
  "Me and A swallowed the pills at exactly 11PM, right before we got back to Ps.  I started making the tea for them, and I explained to them the process of making it in case I started rolling really hard and couldnt pay attention to what I was doing.  After about 20 minutes, I felt a little strangeness, but no euphoria yet.  I walked outside after making two cups of tea, and now Ps cousin wanted to try the tea.  I walked outside off of the porch where A and Ps cousin were sitting, and it was then that I noticed the euphoria coming on.  It was mild, but every wave was getting more intense.  I walked back inside, and P was finishing up his tea, and he commented on how dilated my pupils were, and he said I looked like I was rolling.  As soon as he mentioned the word rolling, that set it off.  A wave of euphoria shot up through me, and my heart started beating faster.  I felt a stimulation that led me outside.  I didnt want to be in a closed in space.  I asked A if she was feeling it yet, and she said she was unsure.  I told her to get up and walk with me into the yard, as I know sitting down can keep you from experiencing some of the effects. ",
  "She started walking, and it hit her.  I started noticing something strange in that I was somewhat antisocial.  I mean, I enjoyed being around others, and I felt the connection, empathy, love, emotion, and everything, but I just wasnt wanting to express it in conversation.  I felt it all within me very strong though.  I sort of wanted to just experience it, and let it flow through me.  I sat with A in my car for a couple minutes, and we hugged and kissed, which felt awesome, but something didnt feel exactly like the Ecstasy I knew a few years ago.",
  "Once A got back to the seat where she was sitting, I walked out into the yard.  I started to notice that I was preoccupied, looking at the sky and lights, much like I was staring into visions induced by mushrooms.  I closed my eyes, and it seemed as though all of the emotion that was flowing within me was expressing itself in closed eye visuals.  It was as if I was seeing love and passion.  I opened my eyes, and just as well, there were visuals in the sky.  I was amazed, and I walked up to J.  I looked at him and said, this isnt MDMA, its MDA.  Every description of effects Ive ever read about MDA was running through me.  I was rolling so hard that my eyes kept rolling in the back of my head in pure Ecstasy.  As I opened them, my eyes twitched with Nystagmus.  When they twitched, the lights softened as if they were bright fireflies in the midst of a misty summer night.  There was a comforting blurry vision as well as the visuals that softly entered my visual field.  I was, as many people that are into Ecstasy would say, blowing up.  I have never rolled that hard, and I was tripping on top of that.   ",
  "I tried to think of what could make the experience better, and the only thing I could think of was Cannabis.  I went downstairs and took three large hits of high grade Cannabis, and I walked back inside.  This intensified the visuals so much that I couldnt concentrate on anything.  I stared off of Ps porch into hallucinogenic space for nearly half an hour.  I felt beyond awesome.  The twitching of my eyes continued and the visuals flickered about.  I was still rolling my eyes in the back of my head, and I was having a true, inner experience.  There was movement about the air and I had what I can only describe as closed-eye movies.  Though there was generally less connection, empathy, and social enhancement than with MDMA, the sheer euphoria was far more intense.  This was what I vaguely pictured MDMA to be like when I first tried it.  With my use of Methylone, I started to realize some of the things that drew me away from these types of entactogens.  There was something feminine that I found about them. ",
  "I came up with alot of theory that I wont get into here, but I found the reasons that I leaned more towards traditional psychedelics, though I did still like the entactogens.  Now I knew why.  MDA lacked most of that feminine aspect as well.  The inner feeling was indescribable.  It wasnt just physical, it was spiritual.",
  "I started thinking about alot of things that had been bothering me within the past few months.  I started realizing that I was growing a hatred towards different aspects of life itself, and that the hatred was directed at the wrong source.  All the while I should have been hating the true evil of the world, I was blaming our society, government, and culture for many things that were distressing me.  The MDA seemed to point me in the right direction, and help me understand that these underlying evils need to be pointed out, and lived against instead of lashing out against the government and society.  I started thinking about communism, and its bleeding into America.  People dont even realize it.  But with all the realizations, all I could really do is reaffirm my faith in God.  It is the only place I find peace of mind.  I believe the MDA pointed me to it. ",
  "It was 4AM when I got back to As house where I was staying, and I was still rolling a little, and I was definitely still tripping.  I had a swift crash, but I didnt get any negative thoughts or anything.  I just felt physically drained.  I believe I didnt experience a harsh come-down because of the life changing experience I had.  Though I felt very drained the following day, I was filled with new ideas and beliefs about things for a week after.  I have had plenty of life changing experiences on traditional psychedelics, but this was my first for entactogens.  I still favor natural psychedelics, and I always will, but Ive now seen the power that entactogens can offer.  I will say this though, I definitely favor MDA over MDMA.  One of my friends told me of someone that tried MDA back in the day, and said they called it Cub Scouts of America, or Coke, Smack, and Acid because it gave you the strong euphoria and stimulation of Cocaine, but it gave you the intense euphoric body feelings of Heroin, and it made you trip.  Though this is a stretch, I can understand where he got that from.  MDA has a special place in my heart, and I now understand the unique psychedelic effect that entactogens offer.",
  "I went back on Pill Reports and these pills were tested to be MDA.  I also talked to someone that is experienced in chemistry, and they said there was around 100mgs of MDA and no other testible material other than filler in the pills.  The pills were alot thicker than most Ecstasy pills Ive ever seen."
 ],
 "erowid": {
  "id": "32592",
  "citation": " sepulfreak. \"New Respect for Entactogens: experience with Ecstasy (MDA) (ID 32592)\". Erowid.org. May 19, 2004. erowid.org/exp/32592",
  "substance": "Ecstasy (MDA)",
  "views": "12266"
 }
}
