{
 "title": "Can You Hear That Music?",
 "author": "Tim Z",
 "citation": " Tim Z. \"Can You Hear That Music?: experience with Cannabis (ID 55209)\". Erowid.org. May 15, 2009. erowid.org/exp/55209",
 "substance": "Cannabis",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "4 bowls",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Prior to the float trip I went on, I purchased an ounce of mid-grade marijuana and brought it with me. It had been a year since I last smoked, so I knew that the effects would hit me hard. The result I got was far beyond anything that I had ever experienced.</p><p>It was night-time and our campsite was right next to the river. We all had lawn chairs set up in a circle around a propane lantern. I started up some weed and was passing it around to a couple other people. During the time that we smoked, we were talking and cracking jokes and just having fun. Everyone else was finished smoking so I finished off two more bowls by myself. Elapsed time: about thirty minutes.</p><p>After I was done, I got up and went back to my tent. My girlfriend walked out of the tent to go toward the bathroom building, so I followed her. We stopped outside the building and sat on a grassy hill and began talking. The only effects I began to feel at this point were dizziness and relaxation, but things grew heavier. During our conversation, my mind lost everything that was going on in a split-second and I had to go back and retrace the events to get myself back into real-time. That was a very tough thing to do. She started to get confused at things I was saying because they were just a bunch of jumbled words, but they made perfect sense to me. I then started with the hallucinations.</p><p>My vision turned itself and confused the crap out of me. The only way I've found to explain this was that I wasn't looking down to look at the ground. If I wanted to look at the ground, I had to look to my right because that's where it was to me. A light was reflecting off of my girlfriend's hair (which she had up at the time) and when I noticed that, she immediately turned into a princess because I thought her hair was a crown of some sort. As soon as I saw the crown, I began to see her in a full princess costume. Things she was saying were becoming jumbled to me and I couldn't exactly understand her when she spoke, but my mind independently processed everything and I understood it somehow.</p><p>Auditory hallucinations followed. Thinking back on it, I was hearing this stuff throughout the whole time we were sitting on the hill, but it took me until the end of the conversation to actually acknowledge that I was hearing it. In my right ear, I could hear some sort of gospel reggae music, if such a genre exists. It was very vivid and very loud in my ear and sort of calmed me down. I asked my girlfriend if she could hear the music and she just looked at me bewildered and said, 'What the hell are you talking about?' Then in my left ear, I was hearing some sort of a conversation. My mind was independently conversing with itself. It became hard to focus on what my girlfriend and I were talking about because I was trying to figure out what was being said in my left ear. When I focused on it, it seemed to me like it was something that I had said before, but I wasn't sure. It kept going on and on without my help and it became quite interesting to listen to.</p><p>The mental conversation ended, though, when my girlfriend decided that she was too tired and wanted to go back to the tent. Walking back was one of the hardest things I think I've ever done. My legs were like lead and it seemed very hard to lift them. That, and I was still horribly dizzy. When we finally made it back, I laid down and became very paranoid because I didn't know what was real and what was just going on in my head. The other people that we were with at the campsite were up and yelling stuff and playing their music very loud. Or at least it seemed that way to me. I would randomly hear screams and loud ambient noises and I wasn't sure if any of that noise was audible to anyone else. I eventually tuned it out somehow and went to sleep.</p><p>The next day I had a hangover of sorts, though I never had experienced one from weed. That day was when we did the canoeing down the river for about 16 miles. After that, we packed up our stuff and left. I was the one driving and it was a three-hour trip. I just felt completely out of it the whole day, but I also was very contemplative and I seemed more in touch with reality and calmer with everything happening around me. I was sort of at peace.</p><p>The effects I felt during this experience were far more elaborate and crazy than any other time that I have been high. This tops the last high that I had when I was running around my house with a baseball bat because I thought that someone was in my house. That night, I also saw the Trix bunny in the calendar hanging on my wall and I got into a yelling match with it for about fifteen minutes. But that experience is a whole different story.</p>",
 "year": "2006",
 "id": "55209",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-05-15T07:00:00.000Z",
 "views": "3684",
 "dose": {}
}
