{
 "title": "Hippy Gin and Juice",
 "author": "Catfish Rivers",
 "citation": " Catfish Rivers. \"Hippy Gin and Juice: experience with 1,4-Butanediol (ID 5521)\". Erowid.org. Jul 12, 2001. erowid.org/exp/5521",
 "substance": "1,4-Butanediol",
 "bodyweight": "255 lb",
 "report": "<p>After much trial and error, usually accompanied by an overwhelming sensation of riding a psychedelic tilt-a-whirl, like being too drunk, but a bit more lucid (so you can think about how stupid it was to drink a second helping), I have arrived at 5ml of 1,4B stirred into an 8 oz. glass of citrus juice as the right mix. Grapefruit juice works well. Citrus juices hide the subtle oily solvent flavor well. My friends and I refer to 1,4B as 'Hippy Gin,' and the mixer as 'Hippy Gin and Juice.' I have read claims that grapefruit juice potentiates the action of certain drugs, namely DXM and caffeine, but I am not aware of any such interaction here. Indeed, in trials with cola instead of citrus, no subjective differences were noted. Indeed...</p><p>I weigh 255 lbs, so I'm assuming skinnier folk would use a bit less. At this level, I feel a good sense of well being and intoxication. I become very chatty with my family members, talking about little things that I normally would not have the mental energy to entertain. Usually, it leads to very positive conversations, more candid somehow. And I can tell that my opnenness surely rubs off on them because these chats grow quite lively on both ends, much the opposite of our mostly functional (where's the remote?) conversations while in Sobersville. This is especially revitalizing for a family that has centered much of its life around the t.v guide and the internet (we'd benefit much more by sitting around a rotting stump, counting mold spores form, I'm sure of it  ).</p><p>I find that at this level I am relaxed and open, usually accompanied by a pleasant euphoria and eventually a sleepy feeling. Comparisons can be made to a good Kava brew experience. My body is generally relaxed and tension free. At times, this relaxation is laced with subtle erotic vibrations. Walking usually feels fluid and energized as well.  This has proven a great tool to wind down a psychedelic experience as well, often times synergizing with the after effects of a trip in an interesting way. Great tool to take the edge off of any psychic tension while tripping. 5meo-dipt blends very well IMHO. Or sometimes I use it to settle myself to meditate with a clearer mind. I find it useful as an alcohol substitute (DON'T BE A DUMMY, DO NOT MIX WITH ALCOHOL!) to fit in at a party and get drunk-like without losing my mental edge.</p><p>One slighlty negative effect, is that I notice a tightening sensation on my throat. It's not as scarey as it sounds though. It's not like I'm being strangled by 4rth dimensional reptialian overlords or anything. Plus, this is easily fixed by drinking some water. I do have to wonder why my throat does seem to close up a bit after using this stuff, however. All in all, if used wisely(i.e., know your body/amount, don't drive, and don't use it everyday--I'm sure this could lead to addictive behavior patterns) I feel this is a useful ally to the psychonaut.</p><p>Start low when determining your dosage. In one experience, where I foolishly eyeballed the amount, and drank it relatively quick, I grew rather confused and was overtaken by a wincing desire/need to vomit. I was in a state of delusion somewhat akin to that of a high fever. Let's just say that Pay Sayjack gave that wheel one helluva final spin...I was on the telephone and the other party politely excused herself when she noted that my voice had grown noticably altered. The confusion apparent on the other end. I wasn't even aware of the call ending, I kept jabbering for several minutes between sighs and gurgles. I was 100% FDA approved bonkers. This was dangerous as I was alone in my house and could've passed out and choked on my own vomit. Bad bad bad. I did pass out eventually, but not before I expelled an ungodly amount of karmic reflux. Usually after vomitting however, I am quickly back in action. No real hangover to speak of. 1,4 Butanediol doesn't seem to irritate my stomach lining the way booze does.</p><p>And one final tidbit of advice: space your sipping of the mixer out. I find that if I drink it in a few quick gulps, the effects are harsher and more toxic feeling. Slow sips seem to give the kidnies an easier time of spawning the Good Happy Beings (GHB gnomes that arise from 1,4B in your body). It's easy to remember...Spaced out sips = Spaced out bliss. Be safe.</p>",
 "year": "2001",
 "id": "5521",
 "gender": "Male",
 "timestamp": "2001-07-12T07:00:00.000Z",
 "views": "19128",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "(liquid)"
  }
 }
}
