{
 "id": 5522,
 "title": "I Should Be Wearing A Crown",
 "date": {
  "submission": "2001-12-23T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Special_K",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I just got home from school and was excited because I just bought 1.25 grams of tweak.  This would be my 2nd time smoking it, but this time I had much more and could really enjoy it.  I ran to the kithen and prepared some foil into a little cup and chipped a little speck off of the rock and set it in the center, I got a straw out of my drawer and got ready.  I lit the lighter and held it under, I heard a hissing and saw the meth turn immedietly to liquid, then I began to inhale and saw the white smoke dissapear up the straw.  I held it in my lungs as long as possible and blew out a big white cloud.  I did this maybe 7-8 more times and when I was done I noticed that I was moving so fast and making sure everything I did was perfect.  I ran around looking for something to clean and started fixing up my room, then I called a few people and just talked with them about crap, constantly saying nice things about them.  Then I realised I had a test tomorrow and preceded to copy the entire chapter of my History book onto a notecard that the teacher said we could use on the test, the writing was so small, in perfect lines and written so well it looked like computer type from far away.",
  "I wondered what more would be like so I got another sheet of foil and loaded a rock the size of a dime on there.  I exhaled and lit under the foil and began to inhale, I noticed a lot of smoke going up the straw and I pulled away because I inhaled too much smoke and it hurt.  I layed back for about 45 seconds and held the smoke in..then put the straw up to my lips and blew out a thick white stream of smoke.  I felt so much better than before, I finished that rock off in about 5 min but the only thing I could think of was taking more out of the bag, I said this would be the last time and picked off another rock and preceded to smoke that.  I felt like such a champion, that I should be wearing a crown.  I couldn't really tell the difference between this and a coke high. I ran laps around my house jumping up and down and yelling out how good I felt.  I ran outside and jogged around the block, when I got home I was exhausted but my mind was still racing.  The only thought was doing more..this is when I could see how dangerous this was, even though I was still spun, all I wanted was to do more and get higher and higher..",
  "Just be careful, this can be a wonderful drug if you use it carefully and only ocasinally treat yourself to this delicate drug :)"
 ],
 "erowid": {
  "id": "3264",
  "citation": " Special_K. \"I Should Be Wearing A Crown: experience with Methamphetamine (ID 3264)\". Erowid.org. Dec 23, 2001. erowid.org/exp/3264",
  "substance": "Methamphetamine",
  "views": "25649"
 }
}
