{
 "id": 5523,
 "title": "A Small Taste of Greatness",
 "date": {
  "submission": "2007-11-17T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Mad Mike",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  {
   "time": "0",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "I read alot about Salvia before I tried to use it, was quite interested in it, so obviously I bought some. I got a half ounce of regular Salvia Divinorum dried leaf. I smoked 2 bowls back to back and chewed and absorbed a couple stems with a little leaf attached, I began to feel a slight body buzz. About 5 mins. later, I smoked one more bowl, then the effects began to take hold. Still no impressive display of this inward thinking and hallucinations, time travel, and wormholes, Ive read so much about. I was begining to have my doubts if I would get any more than the body buzz I was having. It was quite pleasant though, not like cannabis at all. A sense of pressure on the left side of my body, and a subconscious twisting of my torso, keeping my right side forward a bit. Very comfortable all the same.",
  "So, as I was taking another hit off my third bowl I took an extremely deep hit, I choked and coughed as I exhaled. As I coughed, things took on a whole new perspective. The walls flexed as if my cough blew them outward, a half smoked extinguished cigarette in my ash tray curled around looking like a macaroni, at this time I decided I had better get inside before I start wandering around the neigborhood. The walls were still flexed out as if making way for me as headed to my room. I realized my left leg felt as if it was bending in a rubbery way as I walked down the hall. I got in my room and put on some low music, laid in my bed and listened to the song, feeling an almost outside of myself view of my surroundings and my life in general.",
  "As I lay there feeling as if all of my questions and ponderings were answered and made complete sense, yet I have come away with no real answers, just the feeling at the time that all was put in it's place. I closed my eyes and saw a formation of WWII British Bombers, it was as if looking at photo negatives. The song I was listening to was about the tragic bombing of Dresden, I was not realizing what song I was hearing until I saw this, so I had been inadvertently paying attention to the music the whole time I was seemingly sorting out the mysteries of life in my mind.",
  "I was feeling as if sinking into my mattress, if you have seen the movie trainspotting, all I can think of to compare the feeling is when the main character OD's on dope and he sinks into the carpet. Poor association, I know. One things I notice about Salvia is that as soon as I start to hallucinate or think I see something, I want to focus on this hallucination, and by focusing on it is gone and over with, so maybe if I just ignore what is happening to an extent maybe I will get more from it in the end.",
  "I had a mild body buzz lasted for another hour but all else had ended. I have come away wanting much more from this, I believe I may get a better effect, if I chew it instead. Being a smoker, I think my lungs don't absorb the smoke as well as a non-smoker. Next time I will prepare my mouth with some mouthwash and a toothbrush to open my pores to better absorbtion of the leaf. Hopefully this will get me to where I want to be, or maybe I need some extract to do the trick, I guess it's a learning experience, I'm upping the dosage next time for sure though. Overall, I needed more, but I guess some people need very little to achieve great effects, I am not one of them unfortunately. Still it was a pleasant experience and should be tried to understand it. I feel and realize the profound importance of this plant, I think if I can reach a more immersed experience I will appreciate it much more. I had a small taste of Salvia's great purpose."
 ],
 "erowid": {
  "id": "32658",
  "citation": " Mad Mike. \"A Small Taste of Greatness: experience with Salvia divinorum (leaves) (ID 32658)\". Erowid.org. Nov 17, 2007. erowid.org/exp/32658",
  "substance": "Salvia divinorum (leaves)",
  "views": "2577"
 }
}
