{
 "title": "A Capsule in Outta Space",
 "author": "DelphicOracle",
 "citation": " DelphicOracle. \"A Capsule in Outta Space: experience with Salvia divinorum (10x extract) & Amanitas (ID 55235)\". Erowid.org. May 15, 2009. erowid.org/exp/55235",
 "substance": "Salvia divinorum (10x extract) & Amanitas",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Amanitas",
  "(plant material)",
  "",
  " ",
  "smoked",
  "Salvia divinorum",
  "(extract - 10x)"
 ],
 "report": "<p>I went down to my local headshop and purchased 1g of salvia divinorum 10x extract and 12.5g of fly agaric mushroom. I started eating the shrooms about 7.00pm and steadily kept eating till bout 10.00pm. By 11.00pm I could still feel nothing from the shrooms apart from the odd stomach cramp and a light headache. By 12.00am there was still nothing so I decided that they werent gonna work and went down the shop to get a curry. It was a struggle but I managed to get most of it down. By this time my stomach cramps and headache had died down (I think the food hit the spot). I had a bath and got ready for bed.</p><p>By this time I wasnt keeping track of the time so I dont know what time I took the 1st hit of salvia. I prepared my little gold pipe and cleaned it thoroughly. I filled it up to the brim. My lungs were nice and prepared as I had been smoking cannabis most of the day. Now, heres where Ill say, Ive done a lot of mushrooms in my short time on this earth so I ate them fly agaric half knowing what to expect, BUT, this salvia divinorum is unlike anything I have ever done before.</p><p>I took my first puff on the pipe, pulling on it slowly till my lungs were full. I held it in for about 30 secs then exhaled. As soon as the last trace of smoke had left my mouth I knew I was in for one hell of a ride. (I wanna add here that while writing this Ive just barfed. looked like the shrooms). Anyways, I exhaled and felt it straight away. It was like there was some sort of vortex behind me, maybe in the wall, that was pulling me back into it. I leaned back in my chair, eyes closed and I could feel it getting even more intense. My head arms and shoulders were being pulled. I tried to put the pipe down but everything seemed like it was being dragged into this vortex and I just kept sliding it across my desk so I decided to keep a tight hold of it. I leaned back again closing my eyes still, the ride getting even more intense. I remember saying, (or I may have been thinking it Im not too sure) 'Jesus Christ' Jesus Christ'. Not in a holy context but in a context of 'Blood hell whats goin on!?'. I also remember saying/thinking 'Im coming, wait there and Ill come with you'.</p><p>I opened my eyes and sat up normal. The feeling of being pulled was still there although now the room was spinning from under and to the right of me in an anticlockwise direction. It felt like I was in some kind of tumbler or wheel going round. My room got considerably smaller and I could see dark timber frames around my walls and ceiling like an old cottage type house. All my windows were open and my curtains were dancing about in the wind. I had the feeling that there was another window behind me (which there isnt) and when I looked out the real window to the left of where I was sitting, I could see star clusters in all different colours as if my room were a vessel floating through space. I had a very strong feeling that I wasnt entirely in my own room, or I was, but I was seeing it in a different reality or plane and this space belonged to some other entity. I didnt feel threatened though or feel as if I was intruding in any way, more like I was invited.</p><p>Im not sure how much time had passed but I was slowly creeping back to reality. While I was in this state/place it seemed completely normal. I didnt know I was trippin/ smoked anything, I didnt know anything had changed. Its only when I started coming round I realised that THIS was normal and Id been trippin the whole time. Still slightly buzzin and excited by what Id seen, I went to have another hit of the pipe, but decided this time I would lay down on the bed. So I sat down on the edge of the bed with pipe in hand.</p><p>Now my friends, this is where it gets realy fucked up. I dont know if I smoked that pipe or not but the next thing I PHYSICALY REMEMBER doing is running for my bedroom door shouting 'No this aint right, Im goin to get my mum and dad!' Now, what had happened, from where I was sitting on the edge of the bed, something suddenly snapped and it was like I woke up and I was standing over my computer monitor looking down at the screen. The screen and everything else around me was all melting downwards and the music that was playing from the computer had turned to a low pitched drone that was descending as my visuals were melting. As the computer screen was melting it was starting to form a picture. While all this was going on I felt the very strong presence of 3 or 4 entities standing behind me telling me and making me watch what was unfolding before my eyes. I wasnt scared. I didnt have a feeling of paranoia or dread but I was very confused. Once again I didnt know I had smoked salvia. I thought nothing, this is normal. Despite all my efforts to get away or even turn my head away I was transfixed on this computer screen and melting low drone that accompanied it.</p><p>The picture that formed on the screen was my house as if you were looking at it from the other side of the street. The picture was concentrated on my house and two neighbours either side and there seemed to be some sort of black rectangular void that was emmitting blue bolts of lightening hovering over and through my house. It was at this point that I snapped out of it and shouted 'No, thats not my street, this is my house!' then ran for the door. Thing is, I dont know if I was sitting on the edge of the bed the whole time and that whole episode happened in my head, or if I actualy stood over the computer looking at the screen.</p><p>Once I had got to the door and started to turn the lock I started to realise that I had smoked salvia. Its a weird feeling when you start to come around because things suddenly look fermiliar again. I was saying to myself 'Hang on, thats my-'. It suddenly dawned on me that I was just about to go runnin to my parents at about 2.00am, probably wouldve been shouting about alternate realities and a void in our house or something! Anyways, still in a mild state of confusion I relocked my door and lay down on the bed burying my head deep in the pillows.</p><p>The last thing I saw before I lay my head in the pillows was the usual perspective of looking up from my bed. Ceiling, wall, top of my bed (headboard) and the tops of my guitars that were leaning against the side of the bed. The outline of this vision stayed in my head once I was buried in the pillows. Then I started melting into the bed, or more like, me and the bed were one and we were melting through the floor. We didnt end up in the next room downstairs though. Beyond the floor was nothing. Just a black void. I remember thinking about Alice in wonderland and the rabbit hole. I thought here we go, Im off down the rabbit hole. Then everything turned a brown colour and the outline of my last vision started oozing a brown goo which was running down and into this void all around me.</p><p>I could feel some kind of entities (not sure how many but was definately more than one) trying to pull me deeper down. I was going deeper down but I didnt want to. I kept asking if I could go up. I said at one point, 'Can I come up there with you?' I dont know who I was referring to as 'you'. At this point just above my head near my right shoulder I could feel the prescence of these little brown creatures only best described as the creatures in the alien films, the baby aliens that burst out of your chest, thats what they looked like and they were giving out an evil cackle, almost laughing at me I thought. I could also see the same sort of creatures lashing out at me from the blackness of the void on my left side. It seemed like they were trying to say something to me but kept getting retracted back so they couldnt finish what they were trying to say. Once again I wasnt scared or felt dread or paranoia. I didnt realy see these entities as evil but I was trying to reach a higher source, what that was I dont know.</p><p>Eventualy I sat up and started looking all about my room. I was back to reality, in a way, but I could still see this stuff goin on mentaly, in my head. I was still havin slight rushes and still a slight sensation of being pulled. I sat back in my chair and had some hard tokes of a joint contemplating what Id just witnessed.</p><p>About 20-30 mins later I went to bed still slightly buzzing, all that crazy shit still rolling around in my head. I fell asleep almost straight away and had planned on a night of lucid dreaming. All wouldve been well if them bastard neighbours of mine didnt start D.I.Y'in at 8.00 in the morning, drilling and hammering. Anyways I woke with no recolection of any dreams I had. Sitting here writing this though, thinking about them creatures that appeared from the void fills me with a fear that I cant explain. I cant quite decipher the showing me of my house from across the street either.</p><p>All in all it was an interesting and eye opening experience and I would definately try it again, maybe in higher doses.</p>",
 "year": "2006",
 "id": "55235",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-05-15T07:00:00.000Z",
 "views": "2771",
 "dose": {}
}
