{
 "title": "I Saw the End of Existence",
 "author": "Dope",
 "citation": " Dope. \"I Saw the End of Existence: experience with Ether (ID 55245)\". Erowid.org. Mar 27, 2008. erowid.org/exp/55245",
 "substance": "Ether",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "inhaled",
   "Ether",
   "(liquid)"
  ]
 ],
 "report": "<p>[Erowid Warning: The water extraction method is ineffective in separating diethyl ether from the volatile hydrocarbon liquids/gases in starter fluid. Our understanding of the literature is that there is no such thing as safe use of volatile hydrocarbon gases: their psychoactive effects are inseparable from nerve and organ damage.]</p><p>Last month I decided to huff some ether. I'd done it once, and kinda freaked out. I was told that I tried to jump out of my friend's car on the highway, but I don't remember doing that. I thought since I knew what to expect I would be able to control myself. wrong. This time I had one of my friends watch me to make sure I didn't have a repeat of the last time I did it.</p><p>I extracted some ether from starter fluid, put it on a rag, and started huffing. immediatly my mind started going in circles. I felt as if everything happened in a pattern. I realized that this was exactly what I felt like the last time I did it, but I just kept going. I felt as if I was going insane, I couldn't make sense of anything. At one point I thought my arm had turned into a box, that I was trapped inside. I was trying to get out of it but I couldn't. I heard a voice laughing at me because I couldn't escape. My friend told me that as I was 'trying to get out'. I was waving my arms around and screaming.</p><p>Well, the box disappeared, along with the right side of my body, and then I saw all of existence coming to an end right in front of me. I was coming to a point where everything, including myself, would be gone. Needless to say I was scared shitless. Imagine being pulled up the hill of a roller coaster, looking over the first drop, and seeing the track end right at the ground. For the first time in my life I felt what it was like to know that I was about to die. But right when I thought all was over, I was reborn. I snapped back into reality with best feeling I've ever had. Everything was new and beautiful.</p><p>I've been sober since.</p>",
 "year": "2006",
 "id": "55245",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2008-03-27T07:00:00.000Z",
 "views": "12562",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Ether",
   "form": "(liquid)"
  }
 ]
}
