{
 "title": "A No Brainer",
 "author": "Lad75014",
 "citation": " Lad75014. \"A No Brainer: experience with BZP & TFMPP (ID 55247)\". Erowid.org. Dec 6, 2006. erowid.org/exp/55247",
 "substance": "BZP & TFMPP",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "140 mg",
   "oral",
   "Piperazines - BZP",
   "(pill / tablet)",
   "",
   "60 mg",
   "oral",
   "Piperazines - TFMPP",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>After trying a blend of BZP/TFMPP + guarana + 5HTP + White willow bark + Kava, I am discovering the effects of so-called legal E.  For a first experience, I decided to not go to public places, in case anything went wrong. I am all sorted out with molecules that can temper any overwhelming effects of dopaminergic excitation and serotonine depletion (alprazolam, codeine, mirtazapine, olanzapine and zolpidem).</p><p>It is T+2, most effects of E are definitely here: alertness, heat/cold waves, inhibition, need to reach other people (but out of need, no love here), euphoria, enhanced skin stimuli, and ... bowel movements.  The only one lacking is the feeling of complete empathy towards the whole world.  I wish I was in a rave party though, as my senses are very alert and my mind willing to enjoy trippy techno music. </p><p>I am enjoying all this while watching a fantastic HBO series:'Rome'. I feel drama to a level I have traditionally felt with E or its cousins.  But I can not help but try to share the experience with an online audience, where I have discovered the world of recreational drugs & plants. Hey, that probably means empathy is kicking in too!!!</p><p>My usually slow heart is pounding. My fingers are flying over my keyboard.</p><p>I am definetely going to try this with my usual drug companion later. I believe I will have a great time roaming the streets of Paris with him in that state.</p><p>I am now going to try some music, as peak is probably coming. Madonna sounds great and makes my mood even more elevated. Classics work!  Darker music is making me wind down. I am clearly sensitive to outside stimulations. Hence, we are not talking about solitary trip here, instead environment influence gets enhanced.</p><p>It is now T+3: I am feeling moody: too much of this, not enough of that...</p><p>Unlike most previous description I read on the web, I do not feel nauseous at all, though. It is true that problems of that kind rarely happen to me even on the worst drug combinations.</p><p>It is now T+4, and effects are wearing off slightly. Unfortunately I can not take a second hit. Tomorrow is another work day. Boring, but I need to show up at my best... we'll see how that goes.  I still feel a good vibe and want to listen to most of my favorite tunes.</p><p>It is now T+5 and I am back to normal. No unwanted side effects besides the usual (mild) teeth clenching, and desperation over the fact that it is already over!  It seems I will not need other drugs to finish off my evening, besides some zolpidem to force me to sleep.</p><p>Overall, it has been a very pleasant experience. Soon to be renewed. Not to be left in the hands of first timers with CNS stimulants alone, as they may not be in control.  But for users with eperience of amphetamines of any kind, it's a no brainer.</p><p>Enjoy!</p>",
 "year": "2006",
 "id": "55247",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-12-06T08:00:00.000Z",
 "views": "12792",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "140 mg",
   "administration": "oral",
   "substance": "Piperazines - BZP",
   "form": "(pill / tablet)"
  }
 ]
}
