{
 "title": "The Trees Are Speaking",
 "author": "Caveman",
 "citation": " Caveman. \"The Trees Are Speaking: experience with 2C-I, LSD & Ecstasy (ID 55255)\". Erowid.org. Oct 31, 2008. erowid.org/exp/55255",
 "substance": "2C-I, LSD & Ecstasy",
 "bodyweight": "179 lb",
 "report": "<p>I have been doing LSD almost monthly since I moved to Austin in February. The LSD I got there was amazing. 1 hit had me in logic spirals that would loop over a period of an hour, then repeat hourly until my trip ceased. It was amazingly potent. In one case, I remembered driving to a retail store because the setting created by my apartment bored me. Along the way, crayons began drawing everything that came into my field of vision - the road, street lights, signs. Anything that I saw was first 'drawn' by these crayons, which were vertical beams that traced around everything. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>When I went back to Dallas, I took a few of these hits with me. The Saturday I got back I decided to haunt a Nightclub I had frequented when I lived in Dallas. It was a rave-setting and when I got there, all my best friends were there. I distributed the liquid-on-sweettart hits to my friends asking nothing but the base compensation I had invested into the LSD. One of my friends told me he didn't have money, but had a bartering chip, some new research chemical called 2C-I. I had never heard of it, save for passing reference in conversation. I knew absolutely nothing about it, but was in an experimental, and somewhat wreckless mood.</p><p>I traded some of the 2C-I for acid, and bought an ecstasy tab. I took my remaining three hits of this wonderful acid, took the 2C-I pill, and swallowed the X.</p><p>The one thing I have known since I began doing acid is that Cannabis (having psychedelic properties of it's own) intensifies any kind of psychotropic experience. That being said, I always had at least 10 - 20 grams of regular schwag onhand to add to the experience.</p><p>My friend (who I will call K) and I found a deserted corner of the club and lit up at least 4 bowls before almost being discovered by the establishment's staff, and decided to return to the fray. Soon after, my roll hit me. I felt the euphoric, anti-gravitational effects of the ecstasy, and sat down. The heavy techno music only intensified my out-of-head state of mind. I had completely forgotten about the acid, and 2C-I, which is the best way to go about doing acid.</p><p>Apparently, as an experiment, the club owner was allowing train-traffic to traverse through his club because one hit me dead on. I blacked out for a good few seconds on the couch, then managed to stand up. K was only on LSD and asked me if I was alright. I couldn't even manage the basics of human communication and simply looked at him with a dazed look. He and one of my good friends who was also a security guard led me to the bathroom where I vomitted.</p><p>They led me back to a couch, where I handed over my car-keys to K. An hour or so later, the club closed and we all left to go to a friend's place. At one point, I swear on everything I hold with any value, that I saw a stop-sign speaking conspiriatorily to a fire-hydrant, only to stand upright when it realized our vehicle was approaching. Upon arriving, I had to be led once again, into the apartment. Along the way, the sidewalk was lined with robed people who taunted me with their voices. I was starting to have a bad trip and I never have bad trips. When I got inside, everything was moving in amazing ways I only had ever dreamt of a trip more lucid and whole than anything that had ever happened to me. Non-existant people walked in and out of the room, and said things to me I was too confused to reply to.</p><p>When the initial blast of the trip had subsided, I made my way onto the balcony of the apartment. Looking into the sky, I saw my reflection and suddenly felt as though I was trapped in a giant drop of water. One the ground in front of me, three armadillos rolled down a hill, and unrolled in front of me. They gave off an angry aura so I ran inside. When I did, my field of vision moved to the side with the floor-to-ceiling blinds and a black void was behind them, but when I stepped through everything righted itself, then turned upside down. I fell onto a chair and sat there for at least another hour.</p><p>The last significant event of the trip happened when I went outside and my friend K and I climbed a tree. From the tree we tripped out on how the building was patterning, and rearranging. We were in the tree for at least fifteen minutes before we realized it was a mesquite tree with thorns. We escaped with our lives however. The rest of a night is a blur (as if the rest wasn't?) that I cannot remember. I just know I slept near on 20 hours, and when I woke up, I only had that groggy acid-hangover.</p><p>It was inexplicably intense, but a good experience overall. One of my best trips.</p>",
 "year": "2006",
 "id": "55255",
 "gender": "Male",
 "timestamp": "2008-10-31T07:00:00.000Z",
 "views": "3740",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  {
   "time": "",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD"
  },
  {
   "time": "",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
