{
 "title": "Out of World Experience",
 "author": "Slayer420",
 "citation": " Slayer420. \"Out of World Experience: experience with Salvia divinorum (20x extract) (ID 55265)\". Erowid.org. Mar 6, 2009. erowid.org/exp/55265",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "220 lb",
 "report": "<p>I was first introduced to Salvia 3 years ago. While I have almost always used a sitter, lately it's become increasingly hard to find someone who isn't stupid and can sit quiet for 10-15 minutes.. I've smoked Salvia extract many times with sitters, and everything was fine. So I decided it was time I could do it alone.</p><p>The only successful way I have ever used Salvia is in a bong, putting the Salvia by itself on a screen with use of a butane lighter. 1 hit was the usual. So the night I decided to go without a sitter, I took my hit as usual. It was around 1:30 A.M. As I held in the hit, the first effects started taking place. I always feel a bit dazed and lightheaded. Then the crushing feeling sets it. Its like a huge weight is dropped on top of me and I cannot move. Its something Ive gotten used to. As I blew out the hit, consciousness blinked.</p><p>I was at work, sitting at my desk talking with my co-workers that I usually talked with. I dont remember what we were exactly saying, but it was the normal everyday chitchat. Things looked a little strange, but it was a good representation of the office and my co-workers. While we were talking, the walls and floors disappeared. All that was left was a black void, yet all the people and their desks were still there. Then the desks started changing position and turned into a cone shape, where I was at the top looking down at all of them. Despite the immense change, everyone kept acting like nothing happened. Then I faded back into my living room.</p><p>Foolishly I decided that was not enough and I needed to take another hit. I dumped out half of the Salvia I had left because I was still a bit shaky from the last time. I loaded it up finally and took the hit. I only held it in for about 30 seconds before the blink came again, and the last conscious act I did was blow out the hit.</p><p>I realized I was looking down at the ground from a height of about 60 feet. I was on a planet much like Earth, but different. There were no different shades of color, only basic colors themselves. It looked animated, but very real. I noticed then that there were enormous legs and feet underneath me. They were not a part of me, I was a part of it.</p><p>It was like my vision had become a camera, and it panned out from the being I was in. For anyone who has seen the music video for Another Brick in the Wall by Pink Floyd, the masks the children wear are exactly what these beings faces looked like. They were children as well, approximately 100 feet tall. I felt a great sense of evil in them. Each wore a gray, plaid uniform. After getting sight of the creatures, it was like the one I was in healed a wound in her stomach. Everything was black, and I was inside of her. She had no organs but there were people filling her. I would describe my position as her stomach. She started running back to the school and the sense of evil I felt grew. I kept hearing voices saying they were glad I had become a part of them.</p><p>Then I decided Id had enough and I needed to try to pull myself out. My vision was flashing between the dim outlines of bodies on the creatures inside and a vision of her and others like her running on the outside. Somehow I managed to force my physical body off of the couch, and felt a massive tearing in the back of my brain. It was as if I ripped myself out of her, and I felt sharp pains in the back of my head. My whole body was tingling and covered in goose bumps. All the while the voices were telling me I was being very bad. They said what I was doing was hurting and killing them. I ran to the bathroom and starting throwing water on my face to try to calm down. It is very true tolerance lowers with usage. I checked the clock and it was 2 A.M. I was out for 20 minutes on the second trip.</p><p>I have since smoked Salvia, even without a sitter. But I havent taken more than 1 hit.</p>",
 "year": "2006",
 "id": "55265",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-03-06T08:00:00.000Z",
 "views": "3233",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
