{
 "id": 5527,
 "title": "A New Twist on Partying on School Nights",
 "date": {
  "submission": "2007-02-11T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dana",
  "gender": "Female",
  "weight": 49
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:10",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:30",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I started 'using drugs' when I was thirteen; a friend introduced me to pot and I loved it, and have smoked it on a pretty regular basis ever since, despite the fact that after a while it's not all that fun anymore, it's just something to do. I've also popped a lot of pills and done PCP twice ... I've adopted a sort of 'try anything once' theory on life but I've always seen cocaine as a heavier drug that should only be used with caution and only after you're sure you're willing to risk getting addicted.",
  "However, one night, my friend Jenn asked me if I knew anyone who did coke because she had a hook-up that night. I looked at her, surprised, and asked if she did coke. 'Only when it's easy to get in town,' she told me, 'which isn't that often - not often enough to get addicted anyway.' Pulse jittering with excitement about the opportunity to try a new drug, I asked her to take me to the nearest ATM and told her to buy me some as well; I had decided I'd try it with her and her friends.",
  "She dropped me off at my house for an hour, so I spent that time doing online research about the drug. I read a lot of experiences here on Erowid and realized that it wasn't going to be anything like PCP - on PCP I get really scared and violent and am completely out of control - that kept me from doing 'hard' drugs for the longest time until I finally sat down and realized that every drug is going to be completely different and that I shouldn't let bad trips on PCP turn me away from everything completely. By the time Jenn picked me up from my house (8 PM on a Wednesday night), I was excited and also confident that I could come home at 10 without my mom knowing anything at all.",
  "The experience itself was kinda weird. We went over to Jenn's house; her dad was out of town until Saturday afternoon and it was a nice, relaxing atmosphere. Three of Jenn's friends were already over there watching Futurama and the two who would be doing coke seemed pretty excited too. Jenn's friend Nicole was the only one who had really done it more than a few times, so she cut it up and took a few seconds to explain to me what it would be like since it was my first time. Then she laid out two lines, one for both Jenn and I. Slightly nervous and also a little nostalgic (remembering who I was before I'd ever touched drugs - wondering if I would change even more and hopung I wouldn't get addicted), I took the rolled up $10 and snorted my line. It was easier than I thought it would be - it didn't burn like it had when we used to snort Ritalin, presumably because Nicole did a lot better job with a playing card than we had done with a butter knife...",
  "After doing the first line, I felt suddenly disconnected. I had been coming down from smoking a few bowls of marijuana earlier, but without warning, the lethargy I had been feeling disappeared. I got a major sort of head rush and floated on it for a minute or so ... then it plateaued and I was just happy and had a million things to say. I had a bitter taste in the back of my throat so I got up and got a grape soda; walking felt funny, like I was both heavy and weightless at the same time. I didn't notice too much when I was just sitting there though; in that sense it was a lot like Ritalin or diet pills (I used to take them because I thought it would be an easy way to lose ten pounds, not for the abuse potential, but I still loved the effects I felt from them).",
  "Maybe ten minutes after I snorted the first line, I did another. This time the instant high wasn't as incredible - it was a little shorter and not as intense. I plateaued again and it was much like before - I had a little more energy and my nose and back of my throat were completely numb, which is a really weird feeling. We sat around and talked for a little while ... Nicole told me that this was far from the best cocaine she'd ever had (I guess it was more bitter than usual because the dealer had cut it with something funny and it also wasn't as strong) but I was pretty content with life.",
  "We decided to go smoke a few bowls of weed after the rush of cocaine had started to wear off (probably 20-30 min later). Nicole wouldn't because she said she hates mixing drugs, she likes a pure high - but the rest of us decided to anyway. By this point I wasn't feeling much besides a high much like one from caffeine. Everything was still enjoyable and I could still feel a buzz but nothing major. After smoking two bowls of 'chronic,' I was high again, but nothing much remained of the cocaine high besides that slight empowered, energetic feeling. I smoked a cigarette, which felt pretty good, and we all just sat around until it was time for me to go home.",
  "I laid in bed that night and thought for a while about what I had done. I didn't feel like I was a different person because I had tried coke, and I decided it definitely wasn't something I was going to brag about. All in all, it was a pretty good experience though - nothing earth-shattering but something I would do again if given the opportunity. It happened three weeks ago, and I haven't felt a real craving to do coke again - no more than I've felt cravings for other drugs anyway. Sometimes I'm sitting around not really doing anything and I think to myself, 'I really want to get high right now' but it's never been me saying, 'I really want to do coke again,' it's just that coke has now been added to the list of drugs I'd definitely do again. I don't know when I'm going to do it next - shrooms are next on my list of things to try - but I am looking forward to it ... I'll probably do more than two lines next time because I want to see what the almost-delirious highs everyone talks about are like; I also probably won't smoke weed afterward because it just brought me down. I had a good time though, and I really think cocaine is a great drug if you only use it every once in a while. "
 ],
 "erowid": {
  "id": "32677",
  "citation": " Dana. \"A New Twist on Partying on School Nights: experience with Cocaine & Cannabis (ID 32677)\". Erowid.org. Feb 11, 2007. erowid.org/exp/32677",
  "substance": "Cocaine & Cannabis",
  "views": "10830"
 }
}
