{
 "title": "First Time, I'm Dying",
 "author": "Jen",
 "citation": " Jen. \"First Time, I'm Dying: experience with Mushrooms (ID 55285)\". Erowid.org. Mar 6, 2009. erowid.org/exp/55285",
 "substance": "Mushrooms",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  "4.5 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>This is the story of the first time I ever tried mushrooms.</p><p>It was a highly anticipated December day, I had been wanting to try mushrooms for over a year and everything was finally coming together. It was set for me to try them in a comfortable setting with one very close friend (who we'll call Pam) where we would not be interrupted. On my good friends suggestion we decided to eat them with cheesewiz on toast, I'm not normally a cheesewiz fan but the rubbery taste covered up mostly all of the taste of the mushrooms. Pam took a good look at the mushrooms and told me that while she usually gets very high off of 2-2  she doubted the credibility of my source and suggested that we eat approx. 4.</p><p>They started kicking in after about 20 minutes, the visuals were calm and entertaining at first. Pam's face looked more animated, my surroundings started growing and shrinking rhythmically, and everything had gathered a reddish/greenish tint. We put in the care bears movie and laughed hysterically through the previews but turned the movie off after that because we couldnt handle it, we tried to put on a pink floyd album but by this point were to high to figure out how to work the dvd player. Pam started feeling queasy so we sat in the bathroom to try and wait out the nausea, but she puked.</p><p>When we left the bathroom was when things started rolling down hill. The visuals had grown more intense, things were growing and shrinking at such a fast rate that I found it difficult to stand, dark forest green patterns were spiraling on the walls and my settings had become very menacing. my mindset had warped itself in complete circles and I was confused by my surroundings, by my being, by Pam. Words were jumbling themselves in my head in such a way that made language and speaking almost too much for me to handle. I was terrified of nothing and bewildered by everything. Pam and I both fell to the floor, all we were saying for what seemed like hours was I have no idea whats going on I felt continuing nausea but was unable to puke. I started crying because the confusion was just to much for me and the trip was far beyond what I had expected. A frightened Pam asked me if I was feeling ok because my breathing was kind of funny, and we came to the ridiculous conclusion that we were dying.</p><p>Now most people landed in a situation like this are educated in the drug enough to know what to do and how to wait it out. We however were convinced that we were dying and needed medical attention. After what Pam tells me was hours of sobbing (my memory is quite fuzzy with the whole experience) Pam called an ambulance. As soon as the medics arrived the feelings of anxiety faded. They humoured us for a bit, having us breath from the oxygen mask and calming us down. I remember saying something along the lines of be strait with me, how long do I have and Pam offering the medics a bowl after we realized that we were not dying. The medical staff was very friendly, they asked us lots of questions about the drugs but did not question us on our sources. The rest of the trip was a blast, the ride in the ambulance was fun, and they let us sit in wheelchairs at the hospital. Once I realized that I wasnt dying the visuals stopped being menacing and became entertaining once again. The wait in the doctors office took very long so we entertained ourselves by playing with the surgical gloves, our doctor was a hilarious, thickly accented Asian man who was also very interested in the effects of the mushrooms.</p><p>The trip landed us a $170 ambulance fee each, and because I was underage at the time I was forced to explain to my mother why she received this bill.</p><p>For a while after that my mushroom trips all began with feelings of anxiety and paranoid ideas that Im dying, but once I wait them out they have all been pleasurable trips. If I had advice for a first timer it would be, 'The trip will be something completely different then you have ever experienced and it can be one of the most amazing experiences you will ever have, but it can go wrong, and the best thing to do is catch it at the start, calm down, remember the feeling doesnt last forever, itll be over in a few hours, enjoy it while you can or youll regret not enjoying it later. Fresh air helps too, I find that being cramped indoors can trigger bad trips for me.'</p>",
 "year": "2005",
 "id": "55285",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-03-06T08:00:00.000Z",
 "views": "4700",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
