{
 "id": 5530,
 "title": "The Enhancer",
 "date": {
  "submission": "2005-11-01T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Oni",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Born Mormon, many morals have been imbedded deep within me, even after being away from the 'religion' for so long. However, in an effort to better judge those who use Marijuana recreationally, I decided I must take a few steps in their shoes, and hesitantly tried cannabis for the first time about a month ago. This report is about Lotus, but in an effort to relate my experiences in a more understandable way, I shall first explain how THC affected me, and compare lotus with that experience.",
  "With one big hit, of what I was told was 'goooood stuuuuuuff Man!' from a nice bong, I was toast. It took about 2 minutes for it to catch up to me, and about another 3 before I was overwhelmed. I remember things only because I wrote some down, and was careful to describe how I felt to my friend, so that he could relay the scene back to me when I was sober.",
  "All in all, I found the experience distastful. I compared it at the time to having the flu. My skin was oversensetive, my vision blurred and strobing, my mind twisted, and memory shot. I was lethargic, and thought I was sweating with fever, though I'm pretty sure now that I wasn't. The night left me with a bad taste for the plant, but I was impressed with its potency, and the overall effects of the drug. Somehow, I was made to recall an old friend's Lotus experience. I was very curious. If something else could be like this, and have more 'enlightening' effects, as he described, I wanted to give it a whirl. Not a few days later, my order was out, and a week from then, my Blue Lotus arrived in the mail. A whole ounce. Beautiful stuff. Wonderfull blues, yellows, greens. I shot myself to my local headshop, and picked up a little pipe, eager to see what happened.",
  "I smoked an entire bowl (though they were small, sloppy hits) of the plant. It was harsh, primarily thanks to a new metal pipe and inexperienced lungs. Nonetheless, I got a good amount in... nothing. Not a darn thing happened.",
  "That night I convinced my girlfriend, who was even less experienced than I, to try as well. We made two mug fulls of tea, each using about 2 grams of his stuff. About 20-30 minutes after consumption, we each smoked a bowl and a half. NEITHER OF US FELT A THING! I was quite upset.",
  "The next day I gave the bag to a pot smoking friend, and wished him the best of luck, telling him to call me if HE felt anything. I'd barely made it around the end of the block when my phone rang. 'Whoa! This stuff's AWESOME!' He mixed it 50/50 with cannabis.",
  "I made the reclaiming of my flowers, as well as a small purchase of the plant I was less interested in, and combined the two 50/50 as well.",
  "Wow. Now I get it. I was stoned after two hits, since I'm a lightweight, and was quite impressed. I was hit in 3 waves. The first happened about 3 minutes after smoking, and was a mild disorientation. My sight changed, my hearing changed, all of my perception was a little... different. About 10 minutes later, the euporia hits. The world is calm, and I am loved. About 10 minutes after that I'm stoned. I don't want to move, I don't want to talk any more than I need to, but thinking is quite pleasant. After about 30-45 minutes the third level wears off, and I'm more able to experience my happy, reflecting state. Another 45 minutes, and that begins to fade. At the end of 4 hours, I'm at baseline.",
  "Sight: With cannabis, I saw the world strobed. My vision was blurred, and I was clumsy, almost as though quite drunk. Lotus took the edge off that, and twisted it around. It was like I had a fly's eyes. Ya know, seeing a million things at once? It was disorienting at first, but once I got used to it, it made sights more pleasant, and intriguing.",
  "Sound: Cannabis left me with muted, muffled sounds, that hurt my ears and brain. Much as I'd imagine a fierce hangover. With Lotus added in, things were crisper, and not quite as overpowering. I have yet to enjoy music with this, but I can't wait.",
  "Thought and memory: With pot, if I'd speak a sentence, by the time I got to the end of it, I'd forgot what the beginning was. I could tell you the schoolbus I rode as a child was yellow, and knew well what yellow was, and could think of 10 items in the room that were yellow, but I had no idea why you brought up the color yellow. With lotus, I know what I'm saying, but what I've finished saying seems, somehow, far less important than what I'm about to say. It keeps me from backtracking in my thoughts. It allows me to be more honest with myself, without worrying about how my thoughts or words coincide with what I've already thought or said. Lies can't build off of lies.",
  "Touch: This is the most impressive thing, though I fear this may just be for me, as none of my friends have reported this. Pot left my skin aching almost, and uncomfortable to wear. Lotus, well, I can only imagine whae E feels like, and think Lotus to be preferable! I could feel every cell in my skin with crystal clarity. My girlfriend dragging her nails on my arm felt like a warm, sensuous fire. Her lighter caress was like sex. Many people have told me sexless intimacy is what you want with lotus. To be near someone, maybe to hold them or be held. Not me. I was a furnace. I managed to stave off this desire until my second time, however, which I'll only explain this part of, because the rest is much the same as the first.",
  "The second time, I convinced my girlfriend to try it with me again. This wasn't tough, I seemed to have so much fun... As we lay in bed, watching half baked, while we were fully baked, she began to touch me again. I had the presence of mind, which never really left, to get off the bed, move behind her, and see how she reacted to touch. Wow... Wow... Have you ever seen a cat in heat? Wow... I dunno if I'd call this an aphrodesiac, I didn't WANT sex... But everything feels SO good, I wanted pleasure.",
  "So, this is my report on Lotus. I've enjoyed it several times now, and it's perfect for a lazy sunday, as another Ereport had mentioned.",
  "OH! My most important advice, I almost forgot. I find Lotus is also a sleep inducer. Not while I'm high, but soon afterwards I feel the tug, that's not the bad part. Lotus won't let me up until I am WELL rested. For me, that's like 16 hours, if I've had a long week, or 6 if I've gotten enough rest throught the week. I've missed an ENTIRE day of work thanks to this. Even if I can manage to get myself awake, good luck getting out of bed, much less functioning. PLAN AHEAD."
 ],
 "erowid": {
  "id": "32697",
  "citation": " Oni. \"The Enhancer: experience with Blue Lotus & Cannabis (ID 32697)\". Erowid.org. Nov 1, 2005. erowid.org/exp/32697",
  "substance": "Blue Lotus & Cannabis",
  "views": "19543"
 }
}
