{
 "title": "Time Travel and Waking From The Reality Dream",
 "author": "Stash",
 "citation": " Stash. \"Time Travel and Waking From The Reality Dream: experience with Mushrooms (P. cubensis) (ID 5531)\". Erowid.org. Nov 15, 2001. erowid.org/exp/5531",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "report": "<p>My second encounter with the Mushroom. My first trip had been a rather frightening success (Level 5: 1st trip, ego death), and it made me hesitant to go back there. While tripping I had sworn never to touch mushrooms again but then reconsidered after an apparently safe return to ordinary reality. I decided that I would give it another chance. If I went into the same over-intense trip, I would reconsider ever taking it again.</p><p>The day arrived and my two friends and I each ingested 3.5 grams (1/8th oz) of Psilocybe cubensis. We were in our college dormitory and it was late afternoon on a gray Saturday. These were the same two friends I had tripped with my first time. Approximately half an hour after eating, the three of us began to feel increasingly nauseous. This was to be expected since we had felt the same way at the start of our first shroom. We hadn't yet learned to dose on an empty stomach. Just like that first time, we chose to smoke some marijuana to settle our upset bellies. Unfortunately we had not prepared for this situation and were out of supply. Furthermore, there were no dealers in our dorm at that time and the only source we could locate was across campus.</p><p>I wasn't experiencing any effects aside from the nausea but decided it would be prudent to let my sober friend drive my car with the three of us shroomers as passengers. As we drove, I found my emotions growing increasingly grouchy, putting me in an agitated mood. This had also accompanied the nauseous feelings my first time. I was irate and thinking only about getting rid of the unsettling sensation in my stomach. Normally I am a positive and patient person; this expression of negativity was an emotion that I rarely, if ever, experience. I questioned whether this mood-alteration was a direct effect of the mushrooms on my psyche or whether it really was just the nausea. Once we made our purchase, I was extremely anxious to get back to our dorm so we could smoke, intent on killing the agony in my gut and clearing the black clouds of my emotions. I even insisted on driving the car myself as we zipped back and up to my fellow tripper's top floor room. As I sat down to smoke I still had yet to feel any psychedelic effects. Swiftly and efficiently, I inhaled one large toke through a glass bong.</p><p>Let me briefly state that I have, in the intervening time since this trip, identified a strong interaction between marijuana and mushrooms when they combine in my system. At the time of this trip, I carried the misconception that pot could only bring on my trip faster (or even keep it mellow). I wasn't aware that one substance could intensify the other.</p><p>Within seconds after inhalation, I felt my body sensations changing rapidly. All nausea was swept away and replaced by deep, sub-sonic vibrations throughout my body but centered on my heart. It was as if my every cell was quickly coming into resonance with my heartbeat, echoing and reverberating back on itself until my whole body sense was saturated with this powerful and sustained vibration. Putting a finger to my neck to check my pulse resulted in the peculiarly unpleasant sensation of an already fast beat accelerating steadily to an impossible oscillation, perhaps 10 pulses per second. These pronounced distortions of my tactile senses could also be described as 'body tracers', as if discrete sensations were lingering in consciousness and overlapping one another in an over-saturated palimpsest. Ten seconds had gone by since exhaling the smoke. The intense body high faded into the background of consciousness as I next experienced an extreme cognitive transformation and corresponding qualitative shift in the nature of reality.</p><p>I stood up and walked down the hallway to my own room and remembered each moment, each sound, each word as it passed into my sensorium like when you're watching a film and it seems vaguely familiar and then you realize, 'Oh yes, I've seen this one before.' To put it simply, a truth was presented to me by direct realization: we reincarnate into the same life repeatedly; I ate mushrooms and for a short time was able to remember all the previous circuits. But this was merely a corollary of a much larger realization.</p><p>Shortly thereafter, my lifetime abruptly ended as I entered...\r</p><p>  I awake from a dream, dazed and mumbling.</p><p>  Time traveling again.</p><p>      Memory obscured by the diaphanous folds of amnesia,</p><p>          holographic fragments give back images of my own body,</p><p>              of friends, lovers, child memories, a family,</p><p>                  a city, government, politics, planet,</p><p>                      a language, culture, technology,</p><p>                         a space-time continuum and laws of physics--</p><p>\t\t  \t        A truth that fell upon me like an asteroid:</p><p>                              an all-encompassing philosophy,</p><p>                              a Unified Field Theory,</p><p>                              a Universal Intelligence,</p><p>                              Brahma--.</p><p>             'The fundamental movement of the Tao is one of returning.'\r</p><p>...a singularity, outside the river of time. A place I remembered being countless times before; a place I would return to countless times again. I have come full circle. Awakening in my cosmic bed from the perfectly convincing dream of reality, Samsara, I recalled the last circuit around on the Wheel of Time when I ate mushrooms for the second time. I remembered everything in what can only be described as infinite deja vu. It was the view from the hub of the Wheel. I could see every point in time and it was all known to me, all familiar. And at the same time, I was not alone.</p><p>At the universal nexus point, time's Grand Central Station, I stood with companions in the cosmic play. Before my eyes was the face of someone I may have once called Alex, when we were clothed in a physical body and human ego. With my eyes locked on his, he said 'I don't know about you, but I'm just *tripping*!' My visual field twirled into a vibrating tunnel of colored light between my face and Alex's. Without hesitation we departed the universe; reality strobes in and out of being. Looking around, I meet the eyes of others inside what Terence McKenna called an 'ecology of souls', a nursery room for extra-universal children. I awakened as one of these, alongside my companions in the game of Time. But this awakening was not seamless. The ape-body could not let go completely as I found myself denying the existential truth that lay, unambiguous and absolutely convincing, before me. For the benefit of my companions I pretended that everything was cool. I pretended I was laughing along with them at the Infinite Joke, that the reality we had just left was nothing more than a dream. I pretended, while inside I screamed. Inside I felt the terror of being handed my own dead body.</p><p>Objectively, I was embedded in a coherent reality: a college dorm room containing the usual objects, large windows looking out on an outdoor quad, dark now after the sunset. Subjectively, two mutually exclusive belief systems fought for control of my mind: the ego continuously affirmed its own existence by recalling one trivial fact after another (I live here. These are my things. I bought that CD yesterday. I wrote that essay last week. I talked to my mother on the phone today. I received an email from my friend today. I know people other than those in this room.) I was trying to prove to myself that the definition of reality I had trusted in twenty minutes ago was still valid now. But this was at odds with the *direct experience of truth* presented before me in the present moment: the reality you believed in was merely an illusion, having no more substance than the image of your face on a mirror; you found the special key that is placed in reality so you can wake up from it; when you wake up, everybody wakes up with you. This last fact was the insurmountable datum without which I could have convinced myself that my brain was merely caught in a deja vu loop. But no matter how many bits of evidence from the past I brought up, I was unable to deny that fact that my tripping friends, now turned cosmic companions, had woken up too and were cheerfully joking about what a long, strange trip it had been. Laughing about the character roles they had played, the plot twists, the ironies and synchronicities. I listened and acted like I was right along with them, reminiscing on the grand illusion, but they could tell that not everything was alright with me. However, my defense mechanism prevented me from acknowledging that something was wrong; it forced me to ignore the situation, pretend it wasn't happening and lie to them verbally. My cosmic companions were compassionate and amused.</p><p>The next few hours were a blur of walking the hallways, staring at my reflection in the bathroom mirror, going up and down the stairs, watching people play Nintendo 64 in the lounge. Towards the end of my trip, when I was coming down, we attempted to play some music. I played the electric guitar, my roommate played the keyboard, and Alex played an acoustic guitar like a bass. We recorded this little jam session and, after bringing our floaty-tripping heads together into to the same world, were able to come together for a few minutes of collaborative music. On the recording I can hear myself occasionally lapsing into moments of private tripping, and other times acting like an asshole and telling people what to do.</p><p>So eventually I reconnected to consensus reality, left in awe of what I had just experienced. It had been yet another look at the same ultimate reality I had seen during my first trip. Again, my fellow trippers hadn't gone through anything even remotely as powerful. Having repeated the same existential crisis, just in a different location, I again came to the conclusion that I had some peculiar sensitivity to psilocybin. While tripping, I had sworn that I would never do this again--it was just *too* intense to ride the crest of a near-death-experience for several straight hours. Of course, I had yet to make the connection between my flip-outs and smoking marijuana while shrooming. I would need one more look at the infinite universe before making the decision not to smoke while tripping. All of my trips since then have numbered among the peak experiences of my life. And, now with hindsight perspective on these super-intense trips to hyperspace, I include them too as pivotal to my own spiritual and intellectual development.</p>",
 "year": "1999",
 "id": "5531",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-11-15T08:00:00.000Z",
 "views": "20872"
}
