{
 "id": 5531,
 "title": "Every Once in a While Is Good for Me",
 "date": {
  "submission": "2004-04-23T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Will",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "The day started off by staying the night at my friends, Lance. I had done my research (like always :D). And had planned a fun and relaxing day so that night would be peaceful and I would have no stress or bad thoughts on my mind. Now Lance had done mushrooms before so he was just doing what he usually does. I had been staying at Lance's house for around 2 days already and was planning to stay for a few more nights because it was a long spring break. We woke up and had breakfast and went back downstairs and started to break up the half oz we had bought earlier. I have been smoking cannabis for a while and always enjoy a good session during the day. After getting our bong out (the little chevy is what we call it) and packing a few bowls. Lance and I were having a great time playing video games. I always love to play my old favorite games when i'm high.",
  "At around 3:00pm Lance's girlfriend came over and was just hanging out with us. She is cool with us smoking up and doing mushrooms but she doesn't do it. Which is nice, I respect her decisions and she respects ours. We decided to leave to go and get the mushrooms from a friend of ours who we trust. We ended up walking quite a ways to meet him and then a little farther to pick up the stuff. We each had decided to do 4gs, Lance had decided that 4gs would be okay for me considering I can handle myself and am in a very good state of mind. After buying them (I payed for Lance's, I owed him one) we walked all the way back to Lance's. By this time it was 7:00pm. We had setup Lance's Xbox in his room and started playing Halo while having another session with the chevy. We had ordered pizza for dinner and were going to cut up the mushrooms and put them in our pizza.",
  "Lance cannot handle the taste of mushrooms and tries everything he can to disguise the taste. I have to admit the taste is horrible but I can tolerate it. We take our mushrooms out seperately and chop them up very small. We take our pizza downstairs and rip off the toppings. Then sprinkle all the cut up mushrooms in with the sauce of the pizza (It took around 2 slices before all of the 4gs of dried 'gold cap' mushrooms had been spread out). Lance's girlfriend had to go home so we said our goodbyes and went downstairs. Lance's room is where we would spend the remainder of our night. Except for the occasional trip to the bathroom. He has a very large bed so we chilled on the bed playing Xbox and decided to eat our mushroom taco pizza. It was now around 9:30pm. I admit at first I was a little scared of doing mushrooms. When it really came down to the point where we were chopping up the mushrooms I had it set in my mind that I was going to bail. The thing that scared me most is that I didn't know if or what I would see when I did it. But I relaxed and decided that if i'm calm and having a good time I will be alright. We both ate our 2 pieces of pizza and he told me to give it a while before it would happen. We were playing Halo for the next 30 minutes or so. I will give a brief timeline of how I felt and what happend.",
  "+T0:30s - Taste is gone from my mouth, wasn't that bad. Can feel my stomach full from the pizza.",
  "+T10:00min - Feel that bit of 'ackwardness'. Kind of feels interesing. No noticeable changes.",
  "+T30:00min - Can feel it coming on, looking around in certain areas kind of makes you go 'wait, what was that?' lol'.",
  "+T1:00hour - Can feel it really coming on now. Not scared at all, can't think about being scared. Having too much fun. Lights take on a blurry shiny tint. Focusing on objects allows them to sway or warp.",
  "+T1:30hour - Lance is really tripping hard and giggling like a mad man (so am I and it feels great to laugh). I am tripping like crazy and don't talk much to him. We had put on some trance and techno on his stereo and were loving it. Some details I don't remember.",
  "+T2:00hour - Both at our peaks I would say. When I look at Lance sitting next to me on the bed his pupils are very dilated and when he moves his head his eyes seem to trail behind him. As if his eyes are to slow for his head. I couldn't stop laughing at that. I needed to use the washroom at the end of the hall. Lance had told me not to look in mirrors while I trip because he said he had a bad experience with them. Being the curious guy that I am, while using the bathroom I look in the bathroom mirror and see myself smiling an evil dark smile. It was very interesting because after I stopped smiling my reflection in the mirror just kept on smiling.",
  "+T3:00hour - Peak has gone I would say and both Lance and I are just relaxing and looking around his (at the time) incredible room. The light on his phone was blinking and it amazed us with it's shining. We rolled a few joints..Which seemed to be the hardest thing to do in the world. But once that was done we smoked 2 of them. It greatly shot the tripping of the mushrooms back up and I couldn't talk to Lance anymore. I was interested in the ceiling. It seemed to swirl with color and I focused really hard and my imagination took over. I was in a land were noone else was..I was wishing then and there that I had a pad of paper and a pencil...If only I could draw the things that come and leave my mind at the time...But I couldn't move.",
  "+T4:00hour - We are starting to die down and relax a bit. I ask Lance if he is still tripping and he tells me yes. But that he can tell it was dieing down. He asked if I was okay and I told him i'm doing great. I'm glad to have a best friend like him because I know i'm okay around him when I do things like this.",
  "+T5:00hour - Sleeping is possible again and it's around 5:00am. Lance drifts off and I lay awake for a little bit thinking about things and how everything went okay. Then I fall asleep.",
  "We both woke up around 11:00am and weren't tired or groggy. Although Lance said he always feels a bit ackward after doing mushrooms...but it's usual. I overall had a great experience with mushrooms and plan to do it, but keep myself paced so that I don't overdue it. Every once in a while is good for me. Remember that this is what happend to me and how my experience went. Everytime is diferrent for me. Know your substance, know your source people :)"
 ],
 "erowid": {
  "id": "32699",
  "citation": " Will. \"Every Once in a While Is Good for Me: experience with Mushrooms & Cannabis (ID 32699)\". Erowid.org. Apr 23, 2004. erowid.org/exp/32699",
  "substance": "Mushrooms & Cannabis",
  "views": "7570"
 }
}
