{
 "title": "More Than a Sedative",
 "author": "The_Contortionist",
 "citation": " The_Contortionist. \"More Than a Sedative: experience with Valerian (ID 55330)\". Erowid.org. Feb 25, 2009. erowid.org/exp/55330",
 "substance": "Valerian",
 "bodyweight": "12 kg",
 "report": [
  "<p>Valerian root has intrigued me for a long time, mostly due to my dislike of over-the-counter sleeping pills. I feel these OTC pills only seem to promote bodily tiredness without affecting mental alertness. It is a perculiar situation to find oneself in when the body is so fatigued that it is impossible to stand up but yet the mind is racing at a mile a minute. This is why valerian is so appealing, it mainly acts as a mental sedative, which is clearly more desirable.",
  "I have taken valerian root as a sleeping aid many times with great success. I usually take either 2 or 3 450mg tablets half an hour before attempting to sleep, and it has always proved effective. I haven't ever noticed any annoying side-effects or had any hangovers the next morning, which is definitely a bonus with a sleeping aid.",
  "More interestingly, however, I experienced a different side to valerian recently. I was deep in thought one day about various anxiolytics (as I suffer from social anxiety) and I realised I had never tried valerian in this context. Intrigued, I decided to experiment. I was about to embark on a 4 hour shift at work, so I took 6 450mg tablets about half an hour beforehand. I'm not sure why I chose this amount, but it made sense at the time. When I arrived at work, I noticed a definite positive effect - I felt almost like I was slightly drunk, but without the nausea and incoordination, just a slight pleasant relaxed state.",
  "I assumed that this was as far as it would go, but I was wrong. After another half an hour, I felt almost euphoric. I was very content with my life and excited about current and future events. I felt a slight tingling sensation all over. I was slightly sedated, but not to the point where it was overpowering. I could easily move and accomplish tasks without any mental clouding. After about 2 hours of this I could feel the effects dwindling so I took the plunge and decided to take another 6 pills. Aside from slightly increasing the sedation, this had no real effect on my euphoria or anxiolysis. I couldn't get back to that original peak.",
  "Now, this may seem like a strange claim, but as a past MDMA user I can accurately compare this experience with the feeling I get from a small dosage of MDMA, perhaps half a pill. So far I haven't read of another experience with valerian that was this good, it seems to have only a mild sedative effect on most people, so I can't help but feel that this was a one-off...a freak experience. If I can repeat it again I would definitely use it as an alcohol replacement.",
  "To conclude, valerian root in doses of 900mg-1350mg is an effective sleep aid, and there is a possibility that doses of 2700mg or more could be used recreationally.</p>"
 ],
 "year": "2006",
 "id": "55330",
 "gender": "Male",
 "views": "28846",
 "dose": [
  {
   "time": "0",
   "amount": "2700 mg",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:00",
   "amount": "2700 mg",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2009-02-25T08:00:00.000Z"
}
