{
 "id": 5534,
 "title": "Complete Confusion",
 "date": {
  "submission": "2004-04-11T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Washington Irving",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 flowers",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I have a lot of Brugmansia in my neigborhood and when I learned it was psychoactive I just had to try it.",
  "At  around 7:00 I made a tea out of two of the flowers I had chopped up with some of the leaves and threw in some lemon juice salt and sugar to make it palatable, then I simmered it in water for about 20 min. I had serious doubts about its effectiveness so I drank all of the liquid and chewed on a little of the boiled plant material but the texture was just too nasty to eat much. Then  I settled down to watch a little TV. Then about fifteen minutes later or so I felt a change. I dont know how to describe it really but definitely a change. So I took this as my cue to get away from my parents and retreat to my bedroom. I laid down and listened to some music enjoying myself as the effects heightened. Then I tried to get up to get some water (the dry mouth is unbearable) but I found when I tried to get up I ran into the wall, or rather fell into the wall. In any case my coordination was totally gone and my muscles felt weak. I also had no depth perception and everything seemed blurry like it had fuzz growing on it.",
  "Once in the bathroom I drank a ton of water and then pissed. I had no upset stomach but I always have had a strong stomach. The image I saw in the mirror was the best part of the bathroom. At the time I had no idea that the Cheshire cat looking feline in the mirror was myself and I was disturbed that I could not pet it (I tried to for quite some time). Back in my bedroom I put on my headphones to listen to more music, but it didnt play, when I looked down at the CD player again it wasnt there. From reading previous reports I always figured things vanished while you were looking at them but for me when the imaginary thing was no longer the center of my attention thats when it disappeared;  this was often a long time. This happened with other apparitions mainly my parents walking into my room and out but I soon knew these were hallucinations because the door never opened when they came in.",
  "I tried to eat dinner but that was pointless as I think I was eating food that wasnt even there and not even doing to good at that. For example I tried to drink a piece of bread I had and then the bread disappeared and where it was was a marker. This too disappeared so I gave up.  Sometime later I fell asleep. In the morning (or rather early afternoon) I had the strangest dream I ever had, where I was thinking words and the words although random would create images. I woke up and the trip was still going but not in the visual way as before but rather just delirium and confusion all day long. When I talked to people they said they had no idea what I was talking about. The way I saw it was I knew what I was talking about and it was frustrating trying to make them understand eventually everybody just started nodding at what I said and that made me feel much better. Two days later I still cant read written words very well and my vision is horrible within a foot of my eyes. I also am having trouble with logical thinking and normal conversation.",
  "When I went to the gym to work out I nearly had a heart attack or at least thats what it felt like. I hadnt figured that my low fever and high heart rate would be a problem. All in all I wouldnt call the experience fun but not bad either. There was no euphoria, no physical pleasure and all in all everything seemed just about the same as it is usually. Much different than acid or shrooms where everything seems different. With Brugmansia I wasnt in another world rather the other world came parading through my own. I will not take Brugmansia again but I would recommend that people use it only once because after that little knowledge can be obtained from the experience.  ",
  "Another thing to note I tried to keep a trip log complete with times:  On Brugmansia this is IMPOSSIBLE. firstly while I still was aware of what was going on and had the log my vision was too bad to read what I had written. I kept losing my pencil and later I kept on losing the log or the pencil or thinking i had the log but was really writting on the carpet. don't even bother with one. I still don't know where mine is."
 ],
 "erowid": {
  "id": "32708",
  "citation": " Washington Irving. \"Complete Confusion: experience with Brugmansia (ID 32708)\". Erowid.org. Apr 11, 2004. erowid.org/exp/32708",
  "substance": "Brugmansia",
  "views": "17888"
 }
}
