{
 "id": 5537,
 "title": "So There Are These Bars...",
 "date": {
  "submission": "2004-04-22T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "jesus",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "750 ml",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(daily)"
  }
 ],
 "report": [
  "This is what I remember",
  "Setting: garage of a house with one other person, house party going on",
  "Set: rather drunk, somewhat stoned.",
  "There were a bunch of other people trying salvia that someone had ordered over the internet, and they said that it was like no other trip they had ever had, and that it lasted 5 to 10 minutes, tops.  An acquaintance offered me some so I decided to give it a try.  We went into the garage and he packed up a bowl... A little straight glass piece as I recall, and I sat down in a low lawn chair and took a deep breath.  Then I took a rather large hit and held it in for about 20 seconds.  As I was exhaling, the trip kicked in.  It seemed like I kept exhaling for a really long time, but not continuously, the same couple of seconds of me exhaling over and over again, like reality was a really scratched CD skipping.  After the smoke dissapated, I became aware of some mildly uncomfortable pressure on the outsides of my legs, holding them in place.  (This turned out to be the contents of my cargo pockets, a set of keys on the left and a phone on the right). ",
  "This pressure manifested into these (indescribable, really) parallel, equally spaced semi-transparent bars that seemed to run from one end of the house to the other.  They were cylindrical in shape and had a diameter of roughly 5 inches.  They kind of shimmered and flowed and I was quite taken aback at first.  The interesting thing about these bars was that no matter how hard I tried, it didn't seem like there was any way for me to push through them.  Standing up took a lot of effort, as it took me about a minute to figure out how to push out of the chair and push against the ground with my legs at the same time.  Once standing, however, with considerable stregnth of will, I managed to push through the first of the bars blocking my way into the house.  Doing this, I almost fell over because at this point the bars were a little above mid-shin level.  Come to think of it, balancing was hard in general, although that might have been partially due to the liquor.  Once I pushed through the first, the rest seemed to dissolve slowly and they offered less and less resistance to my legs. ",
  "I'd say that this was approximately the five-minute mark after the hit I took.  The whole trip came and went so quickly that it was really difficult to decide afterward if it was still acting on me or if I was just drunk and stoned again.  This lasted for about another ten minutes, as I rubbed the outsides of my legs where the bars had pressed.  Upon discussing with other people who tried it that night, many of the experiences were vastly different.  However, a common experience seemed to be a sense of lines, or connection between things in the environment and self.  About forty minutes after completely coming down I passed out pretty soundly to awake the next morning feeling not too terrible.  The whole thing was definitely not like any other psychedelic I had tried before, including DMT, LSD, psilocybin mushrooms, and peyote.  That said, even experienced trippers would be well advised to use a sitter as previous experience doesn't mean much when it comes to dealing with this substance.  I am looking forward to trying this substance again in the future."
 ],
 "erowid": {
  "id": "32729",
  "citation": " jesus. \"So There Are These Bars...: experience with Salvia divinorum (20x extract), Cannabis, Alcohol & Paroxetine (ID 32729)\". Erowid.org. Apr 22, 2004. erowid.org/exp/32729",
  "substance": "Salvia divinorum (20x extract), Cannabis, Alcohol & Paroxetine",
  "views": "7513"
 }
}
