{
 "title": "One Great Day",
 "author": "Dave",
 "citation": " Dave. \"One Great Day: experience with Gabapentin, Cannabis & Alcohol (ID 55372)\". Erowid.org. Apr 9, 2007. erowid.org/exp/55372",
 "substance": "Gabapentin, Cannabis & Alcohol",
 "bodyweight": "130 lb",
 "report": "<p>Backround: I am 15 years old living in the midwest. As far as drugs are concerned, I am not experienced but very open minded. I love to explore my mind and body. So far I have used :Alcohol, Marijuana, Xanax, Vicodin, and Gabapentin. I was in my experimental phase and was willing to give anything a shot at least once.</p><p>Setting: The august summer before my sophmore year in high school.</p><p>I had successfully taken 800mg of Gabapentin previously. After researching and reading reports on the internet, I gave it a shot. I found a great supply of Neurontin throughout my house.</p><p>Trial #1: I had taken 800mg of Gabapentin at about 4:00 pm on a slow day during the summer on a some what empty stomach washed down with some Coke, which I heard helped absorbing them. For the record, all pills were taken in 400mg capsule form labeled Neurontin. So I took them and awaited the onset which I knew would take anywhere from 1-2 hours. I watched T.V. to pass the time. After watching a few shows of Seinfeld, I got up to get a drink because I was really thristy. I got up and experienced a headrush similar to the buzz you would get from being buzzed from alcohol. I got the drink and sat down with no further effects besides a slight body buzz. Although I was a bit energetic, I was quite relaxed as well.</p><p>Trial #2: 800mg of Gabapentin consumed at 11AM on a completely empty stomach washed down with a Coke again. I was still sleepy while taking the pills, so to wake me up I took a shower and went through the normal routine. At around noon I felt the similar effects kick in and the day subsided similar to the previous experience.</p><p>Trial #3: I was dead set on getting better effects from Gabepentin. I researched online and found that overdoses were from those consuming over 8000mg. I decided that 3200mg would be sufficient and prepared myself for the next day consuming 8 400mg capsules on an empty stomach followed by a Coke at 12PM Once again it was a normal onset but seemed to be building up more. I felt the normal buzzed feeling and the body buzz while sitting at home. At this time, my other friends that played football had 2-a-days going on and we wouldn't do much until the evening. The relaxing feeling was overwhelming and I was so happy and content with everything. My head was filled with only positive thoughts, and anything negative that was happening or entering my mind was quickly brushed away to be dealt with later.</p><p>I was beginning to get a bit tired at this point so I grabbed myself a cup of coffee and headed outside at about 2PM. It was a wonderful saturday afternoon, the temperature not too hot, just right. A nice breeze flowing throughout the neighborhood. Everything and anything had a great vibe to it. I then heard the sound of the piano coming from across the street. I remembered my neighbor telling me that her daughter was in the process or learning piano. I sat and drank my coffee while listening to the piano for about 10 minutes. I do not have any musical taste for piano but I couldn't drag myself away from it.</p><p>While listening I saw a glint out of the side of my eye. It was a garden decoration that would spirtal and twirl in the whind and catch the sun on its patterns. I stared at this for another 10 minuntes before deciding to go back inside. I was very content, energetic (probably the coffee), and yet so relaxed. This stayed with me until around 7 o' clock, when my brother came home and tossed me a small amount of weed. My friends weren't doing anything and I was quite bored, so I decided to smoke a bowl out of my bong. Although it didn't hit me directly (never does), it did seemed to be lifted to another level. I followed this session with a cigarette like I always do. I don't usually smoke, but I tend to have a nice cigarette after smoking weed. All the while listening to some good music that I prefer.</p><p>I watched T.V. while the munchies took hold and the high lifted my mind and body to another level. I had an amazing body buzz surging through my body. I was not at all tired and the marijuana only made me happier. I made some food while my friend T called. He told me to meet him at this girls house and that she was having a party, her name is N. At this point I was in the peak of my high and due to the marijuana, the peak of my Gabapentin. So I set off on my bike to her house, a good 10 minute ride.</p><p>I was definitely feeling a bit messed up, but none the less having a great time enjoying the scenery. I arrived at N's house around 8ish while being greeted by what felt like, a million people. After having a good time with my friends and with everyone, I was steered into the direction of the liquor area. Now, I am known for my drinking. I am in no way an alcoholic, but my friends know me for going in saying I'm going to get buzzed and coming out completely hammered. I can hold my alcohol and can 'hang' like no other. So seeing as I am in my 'fucked up' state, I decided that a few shots with some girls wouldn't be bad right? So we had about 4 shots of yager when a friend called me away for a minute.</p><p>I entered a group they were standing in and we joked around for a while. A few of them noted my eyes looked droopy and red. I told them what I had tried and my session before and they all understood. None of them had a problem with drugs anyway. So I continued to enjoy the party and made a good note of it to stay away from the alcohol. I felt really relaxed with the people around me, especially the women. I managed to pick up a few numbers all in the process. I rode home with a friend of mine and turned in happy, yet tired. The next day I woke up refreshed and extremely happy.</p><p>I plan on using Gabapentin a little more in my life, but not exceeding 4000mg ever. It was a great experience especially when accompanied by Marijuana.</p>",
 "year": "2006",
 "id": "55372",
 "gender": "Male",
 "timestamp": "2007-04-09T07:00:00.000Z",
 "views": "30387",
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(capsule)"
  },
  {
   "time": " T+ 0:00",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(capsule)"
  },
  {
   "time": " T+ 0:00",
   "amount": "3200 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(capsule)"
  },
  {
   "time": " T+ 2:00",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Coffee",
   "form": "(liquid)"
  },
  {
   "time": " T+ 7:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 7:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(plant material)"
  },
  {
   "time": " T+ 8:00",
   "amount": "4 shots",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ]
}
