{
 "title": "The World in our Minds",
 "author": "L",
 "citation": " L. \"The World in our Minds: experience with Mushrooms (ID 55385)\". Erowid.org. Jun 16, 2009. erowid.org/exp/55385",
 "substance": "Mushrooms",
 "bodyweight": "125 lb",
 "report": "<p>Let me start with some background information.  Basing off of the time of this trip, I had pretty much smoked weed every day for the past year, and had tried Mushrooms just 2 days before this trip, but had only eaten a half eigth.  That was the only prior tripping experience I had before this.  This time, me and my good friend Jeff both decided we would eat an eigth of mushrooms.</p><p>~The Trip~</p><p>We decided we would play it out like any other night, and our good friend was having an open-house party, so we decided to go there at about 4 or 5 in the afternoon before the party started.  We both immediately went out to the back porch and ate our eigths, chewing them as much as possible, and using orange juice to wash em down because we heard that it made you 'trip more'.  I honestly don't know if this is true or not, but hell, might as well do it I guess.  At this point everyone who was here was on the back porch, and it was only about 7 or 8 people, but gradually more people started showing up, and I decided to go into the other room with my girlfriend.  We went inside and got comfortable in the huge living room on one of the couches.  I was starting to feel a little strange and a little bit sick to my stomache.  I knew it was just because of the mushrooms and I just kept talking to my girlfriend on the couch. </p><p>I don't really know how long it took in total, but more and more people started showing up making the party increase to about 30 or 40 people mostly in the porch and kitchen.  I remained on the couch with my girlfriend, talking to her, but as I looked at the walls and ceiling they began to make a water-like moving motion, and the pictures and a reef on the wall began to circle around, and the music blasting on the radio sounded better than any music I'd ever heard before.  Every once and a while me and my girlfriend would kiss, and as I would close my eyes. colors and shapes seemed to be shooting outwards like nothing I'd ever experienced before.  My girlfriend eventually said 'Wow, you are so high' and I just laughed and said 'How can you tell?' and she just said 'Because I know you'.  Now, I don't know why I remember that specifically, but it really seemed to interest me. </p><p>After a while, Jeff ran into the living room and sat on the couch next to us.  His face was flushed and his pupils were enormous.  He told us how much he was freaking out, then laughed and ran out of the room.  I didn't really think I was freaking out too much, but my girlfriend then said 'I have to leave soon.'  I thought about this and said 'Okay, well if I really have to drive you, lets' go now.'  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]   It was about 10:30, and we stepped outside.  I couldn't walk very well and it felt as if I was walking in high-speed.  The world outside looked different than I had EVER seen it before.  This very familiar area I was looking at was more colorful and detailed than I had ever ever imagined it could be.  Street lights and car lights were surrounded in a circular rainbow and as we walked to the car I just said 'Holy shit, I should not be driving.'  I entered the car and looked around. And again my car looked different than I'd ever seen it.  My girlfriend told me to drive slowly, and to not listen to music while we drove.</p><p>Driving was more fun than driving has ever been, and as dangerous as it was I don't even regret it.  Nothing bad happened, and after I dropped her off I cranked up the volume on the ipod and drove back to the party.  Now I will tell you all: Never fucking drive while tripping.  It's an awful idea and I'll try to avoid it in the future, because I know how bad of an idea it was.  For an example: I reached a stoplight and I started wondering if I was on the wrong side of the road because I really didn't understand how the road worked.  It was all so strange to me, but the light just turned green and I went forward, hoping for the best, and I made it, and just kept going.</p><p>This is when the trip TRULY STARTED.</p><p>When I got back to the party, I tried talking to some people but it just didn't feel right because none of them 'truly understood'.  I needed Jeff.  I ran to the porch and found him.  We both knew exactly what we needed and we ran outside into the streets.  Both of us were barefoot, and we just ran down the main road.  At this point it was about 12 at night and every once and a while a car would come down the main street and we thought a cop might pass so we decided to take a turn onto a random side street. </p><p>Entering this side street was like a fucking portal.  There were no cars, there were no people, no lights on, nothing.  We had entered our own little world.  It felt like the only way to get into this world was to eat an eigth of mushrooms.  In all honesty, we were basically both freaking the fuck out, and we were expressing ourselves in hilarious manners.  We would say things like 'Dude, I just need to tell you like...' and 'It's absolutely amazing .. like.. I've never felt this way and like.. it's just incredible.' Just random shit like that that had no meaning but satisfied our need to express ourselves. </p><p>We walked through puddles, we ran onto peoples yards, we were screaming and laughing, lying down on the street, like animals.  We felt like we were in our own strange little world, inside our minds, and it was both of our minds, our minds were the same and we were the only two who truly understood.  The sky was a combination of red, black, purple, and green, the pavement below us swayed like water and everything had a strong detail like nothing I could ever describe.  We walked down this street for what seemed like forever but decided that the reason we weren't exploring more was because we were afraid of the darkness of the forest, so we decided we would walk through some random yard towards the forest. </p><p>As it turns out, there was just a small line of trees surrounding a large field of mud.  To this day we refer to it as a 'farm'.  We stepped through the trees, and looked out into the field.  It was absolutely enormous, and we both just ran in our own seperate direction.  The sky was completely red and black and we continued just running through the field for what seemed like forever.  We decided that this was the peak of our trip, this was it, we had made it.  This was what we had been looking for ALL of our lives, and we had found it.  We decided that all we would ever need in our lives was mushrooms.  We would just use all of our money on mushrooms and come back into this incredible world and we wouldn't ever need anything else.  We had done what we need in our lives and we wanted to stay there forever.  Now obviously, looking back, this is a ridiculous idea, but that's how we felt. </p><p>We ran across the field and came to the trees again.  We stepped through and arrived at a gas station which was located just down the street from the party.  We decided people at the pary would look down on us (also not true) and that none of them would understand what we did, they were all so naive.  We got into my car (Yeahhh, I know, driving again, I'm an idiot) and drove back to my house.  We sat in the car when we arrived in my drive way and just reflected, in shock and disbelief.  We then entered my house, walls still moving, pupils still massively dilated, and went to bed.</p><p>This was an absolutely incredible journey that we had, and when I look at all the negative posts about mushrooms I just don't understand.  But right now its a month later and as I write this I have another eigth of mushrooms in my car and so does Jeff, so I guess maybe I'll see, but right now mushrooms are my drug of choice.</p>",
 "year": "2006",
 "id": "55385",
 "gender": "Male",
 "timestamp": "2009-06-16T07:00:00.000Z",
 "views": "1989",
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
