{
 "title": "Most Underrated Substance Ever",
 "author": "Skien",
 "citation": " Skien. \"Most Underrated Substance Ever: experience with H.B. Woodrose & Clonazepam (Klonopin) (ID 55416)\". Erowid.org. Jan 20, 2010. erowid.org/exp/55416",
 "substance": "H.B. Woodrose & Clonazepam (Klonopin)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)",
   "",
   "3.5 seeds",
   "sublingual",
   "H.B. Woodrose",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>So after hearing various stories and trip reports from other people and online, I came to the conclusion that it wouldn't turn out to be anything too spectacular. Boy was I wrong.</p><p>My friend and I were planning on just getting together for a few drinks. Just to relax a little after a night of moderately heavy drinking the night prior. Nothing too extravagent. I mean, it was Sunday afterall. Then, we decided to give something else a try. We decided to add a little something else to the overall experience. I've had these HBWR seeds lying around for a few months now and so decided to put them to good use.</p><p>Well, I figured that, from all the stories I've heard on this drug, that it wouldn't be all that intense. Still though, to be on the safe side, we only ingested 3.5 (yes THREE and a half) seeds each. Before hand, we each drank a beer and popped 1 mg of clonazepam to kinda ease the trip, just in case. Then we went and followed the sublingual procedure documented online.</p><p>So we had this seed/water/lime/sugar mix soaking in our mouths for about 15 minutes while watching TV, trying not to laugh and letting it all come out.  Passing a piece of paper and a pen back and forth to communicate.  There was even a bit of a debate on whether to spit or swallow.  After the 15 minutes were up, we swallowed the entire concoction. Afterwards, I slammed back another beer, and drove my moms car back to her place before I ended up getting really intoxicated. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>So at this point, we're walking back to his place from my moms (not too far, about a 20 minute walk). He claims to be coming up, or feeling something. I thought I was at first, but I just chalked it up to placebo. Like I said, I was grossly missinformed of the intensity of LSA. Once it fully kicked in, after about an hour or so (it kicked in much faster for my friend), it was much more intense than I was expecting. I have done many drugs (shrooms, MDMA, heroin, DXM, crack, crystal meth, etc - just to name a few) Yet I actually consider LSA one of the most amazing drugs I've ever taken, and this is saying ALOT coming from me. Ecstacy has been my favorite drug for nearly 5 years. Nothing else has come close. LSA, on the other hand, has actually made it to rivalry status.</p><p>Basically, my fear of hallucinogens (due to my mental condition), was that I figured I was pretty much guaranteed a bad trip. The LSA actually felt a bit like a mix between MDMA and shrooms. The mind fuckingness of shrooms, and the euphoria and body high of MDMA. I also had energy too. It was like the ultimate combination of all the best features of each and every drug. I laid back for a while, just feeling. Simply feeling, enjoying the waves of pleasure as they rolled through my body (kinda like E, but a bit different). I could just sit there, recline, and actually feel it in my face. Pure pleasure. It was overwhelming to say the least.</p><p>Also, there were visual distortions, which I have never seen before (not even from shrooms or DXM or anything). It was amazing. The walls were actually melting. I always thought that was some drug cliche, but it was happening. Everything was slightly distorted. My mental state was a bit disturbed, but in a good way. I felt good, even though I was absolutely mind-fucked. I tried to go for a walk out to this park, by myself. The walk alone was unbelievable. Time seemed to alternate between fast and slow. I could feel every motion in my body. Everything passing by seemed so surreal.</p><p>My depth perception was quite off. I also kept feeling lost, but would soon realize what road I was on, although making that distinction was hard at times. I ended up laying on the grass, just watching cars go by. Feeling very good. At one point, I turned off all the lights, and turned up the music (Mr. Bungle - ABSOLUTELY AMAZING TRIPPING MUSIC). This made for a rather intense experience.</p><p>I am definitely planning on trying it again.</p><p>Also, I recall being warned of leg cramps as a side effect. That really was the only negative side effect I experienced. It was a bit bothersome, but practically negligible in comparison to the overall experience.</p>",
 "year": "2006",
 "id": "55416",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-20T08:00:00.000Z",
 "views": "4476"
}
