{
 "title": "South Park Nuts",
 "author": "Whosit",
 "citation": " Whosit. \"South Park Nuts: experience with DXM (ID 55431)\". Erowid.org. Dec 19, 2007. erowid.org/exp/55431",
 "substance": "DXM",
 "bodyweight": "",
 "report": "<p>I never really 'planned' on doing drugs when I was younger, and when I say young, I mean young like 11. One time I even found some marijuana rolling papers in my DAD'S office, (and my dads a doctor!!) which I threw out!!! The establishment and adults lead you to believe that if you touch drugs, you die or some shit. Any way, one night I was about 12 and I was growing up and I guess learning to think more for myself. I live in some rich white neighborhood and I didnt know shit about drugs, not at all. But I was watching South Park and the kids were drinking cough medicine and getting high and seeing shit and 'writing down the theme song for happy days' and I was all 'cool.' So I told my mom I had a cold and she picked me up some generic brand cough syrup.</p><p>I drank the entire bottle. It didnt even tatse too bad. And I got my little buzz. I was really tired and felt sick at first, but after I took a nap, I felt so....FREE!! So alive, I was listening to Black Sabbath as loud as it went, dancing, feeling light, happy. The room seemed to swirl, I never felt better. It was like when I looked down, I couldnt tell if my legs were 5 feet or five inches long. It was awesome for me at that time, just a fun escape. as I did it more often, the effect became less and less. And its pretty outdated for me now, I mean, I seek something much stronger, that I can really escape and discover with. I dont even consider it a high at all anymore. Whatever, it was fun. Maybe one of the only really nice memories from my young childhood. Everything else in the world sucks but drugs, you know?</p>",
 "year": "2004",
 "id": "55431",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2007-12-19T08:00:00.000Z",
 "views": "7291",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 ",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 }
}
