{
 "title": "A More Refined Speedball",
 "author": "Marz",
 "citation": " Marz. \"A More Refined Speedball: experience with Hydromorphone & MDMA (Ecstasy) (ID 55442)\". Erowid.org. Apr 9, 2007. erowid.org/exp/55442",
 "substance": "Hydromorphone & MDMA (Ecstasy)",
 "bodyweight": "145 lb",
 "report": "<p>I'll make this short as I am simply posting this report since there is scant information on the net about the combination of a strong opiate with a bit of MDMA. </p><p>I have never attempted a speedball, that is opiate+cocaine.  I don't have any love for coke and that sounds a bit dangerous to me!  Anyway, being the scientific experimenter that I am, I decided to go with two much more refined compounds:  Dilaudid (hydromorphone) and MDMA.</p><p>The dilaudid was pure, not a pill.  Precisely 4 mg of this substance was dissolved in a bit of sterile saline and an unmeasured amount of mdma was added (approximately 20 mg, 1/5 of a 100mg dose as judged by the ole eyball).  This solution was injected IV.  Time = 0</p><p>As compared to IV dilaudid, the mixture was a bit heavier in effect.  The rush was not as pleasant, it seemed.  My eyes were hard to keep open and dizziness was noted. </p><p>The rush was accompanied by an interesting tactile sensation.  This was very pronounced, as I had a bit of sunburn on my back from the beach the day before.  This sensation was not overly pleasant, pretty much neutral, and it did not last more than a few seconds.</p><p>The dizziness was quite pronounced when walking around, but this was alleviated by a tiny bong-hit.  Pot usually messes up opiate highs, IMHO, but I wanted to get away from the dizziness and the MDMA made me want to smoke something (no cigarettes around).  The pot helped with the dizziness, Time = 15 minutes.</p><p>I sat down for a moment to collect myself.  My eyes were doing mild jittering, common with E.  Overall, I didnt really feel all that lit up.  I decided to have a bit more dilaudid since the 4mg dose was a light dose for fear of what might happen.  3 mg more dilaudid was injected sub-cutaneously (under the skin).  T=25 min</p><p>The extra dilaudid was exactly what I needed.  The effects picked up dramatically and I felt great.  I felt good enough to CLEAN the kitchen!   Very alert buzz with a little bit of eye jumping, but not too much.  At this point it felt mainly like a dilaudid high, with maybe a bit of stimulation to go along with it.  Movements with my arms and such feel a bit robotic and fine motorskills seemed a bit reduced.  T=1hour </p><p>Was it worth it?  Not really, I guess.  Dilaudid by itself is pretty much the rolls-royce of opiates.    It crosses my eyes badly enough by itself, and it seemed like the MDMA just made this worse.  I can do without eye crossing, personally, so that aspect wasnt too great.  Should I have taken more MDMA?  I dont really know.  The first 15 minutes just felt like intoxication more than a high.  I wont do this again, not really that great.</p><p>----------------------</p><p>On a side note, I did witness a friend of mine eat 150 mg of MDMA after dosing dilaudid about 30 minutes prior.  He said it was fantastic as the MDMA hit, but it didnt last long and he was left feeling drained and plastered to the couch.  This guy doesnt really get the social aspect of MDMA and usually hates the stuff, but the combination took away all the discomfort and left him in a good place.</p>",
 "year": "2006",
 "id": "55442",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-09T07:00:00.000Z",
 "views": "16896",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "4.0 mg",
   "administration": "IV",
   "substance": "Hydromorphone"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "20 mg",
   "administration": "IV",
   "substance": "MDMA"
  },
  "2": {
   "time": " T+ 0:15",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "3": {
   "time": " T+ 0:25",
   "amount": "3.0 mg",
   "administration": "IM",
   "substance": "Hydromorphone"
  }
 }
}
