{
 "title": "One Single Drop",
 "author": "Eltigre",
 "citation": " Eltigre. \"One Single Drop: experience with Fentenyl (ID 55455)\". Erowid.org. Mar 21, 2010. erowid.org/exp/55455",
 "substance": "Fentenyl",
 "bodyweight": "205 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Pharms - Fentanyl",
  "(patch)"
 ],
 "report": "<p>Recently I found a stray 25 mg patch in a chest full of random meds. At first I had no idea what this small little envelope like packaging was... and I almost overlooked it's amazing, powerful, and blissful abilities. Not being able to find much else that I was interested in this drawer full of perscription meds...a few somas, 3mg worth of xanax, a dozen rare but rather useless anti-anxiety pills of which the name escapes me (small green round pills), I decided to get of the computer and see what the internet had to say about this Fentenyl.</p><p>After realizing that this drug was indeed a synthetic opiate, and was EXTREMELY potent... I couldn't wait to get the drug into my body. At this point I did a bit more research to find out the best, safest, and most efficient way to ingest this drug. Taken as perscribed, slapping the patch on your skin and allowing the medicine to slowly seep into your body at a rate of 25 micrograms/hr, I read that the drug was enjoyable yet the effects were long lasting (72 hours or so) as well as slow to arrive. For these two reasons, I disregarded taking the drug in the 'traditional' sense. I then looked on to what seemed to be the best and really only other option, smoking the clear gellatinous liquid.</p><p>The potency of the drug made me weary of exactly how much to smoke, I use opiates semi-regulary... usually just whenever I can get my hands on them and so my tolerance is existent, but by no means high. Upon opening the package, finally getting ready to dive into my euphoric and heaven-like state, I realized just how little of this liquid there is in these patches. I took a razor and cut off just enough of the corner of the patch to allow myself to squeeze the liquid out of the side. The first drop of liquid was placed onto the tip of a cigarette... much like frosting a cake in the way you would dispense it from the patch. Like I said, I was weary of exactly how strong this drug was going to be at first, so I decided to start off with just a generously sized dropplet and continue from there.</p><p>Upon lighting the cigarette, the first drag or two was harsher than normal. This was pleasing to me because this way I knew that I was recieving the smoke. The effect took considerably less than a minute to kick in, just the one drop had delivered me a moderate, and extremely enjoyable opiate high. Not much different than any other opiate, BUT FROM ONE SINGLE DROP!</p><p>I didn't experience any nausea, which I have with other opiates such as oxycontin and other forms of codene, so I decided to try and take some more of this wonderful drug. Not wanting another cigarette so soon after, I resorted to the tin foil, cut up pen cylendar, and lighter method. Simply placing a couple drops of the fluid in the center of the tin foil, placing one end of the empty pen in my mouth and the other very close to the liquid, I find it's best to begin inhaling an instant before lighting the liquid. I try to waste as little as possible. Holding the smoke in for a few seconds, then exhaling the chemical taste, I didn't have to wait long for the second wave of euphoria and bliss to kick in.</p><p>I continued this cycle for about 30 minutes, occasionally, dropping a few drops onto the tin foil until the patch was dry... or so I thought. I had read in one of the reviews that chewing or sucking on the used plastic could deliver more of the substance that would be wasted otherwise, so I decided to put it away for a rainy day. FYI, this was the best decision ever. About a month later I took a plane flight and decided to chew on this patch, I recieved a moderately strong reaction... and it was so pleasing simply because it was a left over piece of plastic.</p><p>All in all, this is the type of stuff you would want to bring back from mexico or something. Extremely potent, small, easily concealable, and just downright delicious!</p>",
 "year": "2006",
 "id": "55455",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-03-21T07:00:00.000Z",
 "views": "11138",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Pharms - Fentanyl",
   "form": "(patch)"
  }
 }
}
