{
 "id": 5546,
 "title": "Only Mild Effects",
 "date": {
  "submission": "2001-12-24T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 nuts",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "1 Tbsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "1 Tbsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 4:00",
   "amount": "1 nuts",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "<p>I have tried nutmeg before, eating spoonfuls of ready ground nutmeg, 2 tablespoonfuls were the most i had taken with no effects except nausea. So figuring I was pretty insensitive to the stuff I had quite a lot more. After not being able to get some marijuana I was due, feeling extremely bored and restless partly probably to do with too much caffeine from lotsa coca cola or caffeine withdrawl symtoms, I decided to try nutmeg again.",
  "At about 11:00 pm I took 3 whole nutmegs and cut each one into 8th's, than over the period of an hour I continued to swallow each 8th with water like a pill.  This is a great way of taking it if you have problems with nausea, I experienced no nausea at any time during my intoxication or when consuming my nutmeg. When I had finished swallowing the pieces my throat was slightly battered but I felt no nausea.  After that I had another teaspoonful of unfreshly ground nutmeg with a glass of water.  When I was drinking the water I started to feel a slight stoned feeling and also a slight pissed feeling. After a while this may have gotten stronger.  Thinking about it now I am not completely sure whether it was just a mild stoney feeling or whether I was so out of it that I didn't realise.",
  "Later I went downstairs, I was definately starting to feel something.  I began to fill 4 gelatin capsules with more unfreshly ground nutmeg, I swallowed each one with water.  I was getting sure symptoms of being stoned and being pissed now but not too strong.  I think I was getting more of the mental/psychological symtoms and not the physical ones.  I was slightly euphoric, and feeling stupor and slight motor impairment which I could control if I desired it so. I was quite distant at one point when I looked in a mirror, I had bloodshot eyes and was smiling lots like when I'm stoned.  I may have had a very, very light tingly warm and also chilly feeling in my body, but that may have been placebo.",
  "At another later time, within the next 4 hours I grated another whole nutmeg in a cheese grater, I ended up with a surprisingly large pile of powdered nutmeg.  I mixed this with hot milk with a bit of melted butter as I heard the psychedelic chemical was fat soluble.  I drank this and went upstairs. Later on I went on a chat thing on the Internet, by then I was shivery and cold slighltly, but I usually feel like that around that time, so I don't know.  I noticed I was talking more than I normally do, saying to people how wasted I was, don't know if that was a symtom.  I also couldn't type properly, I still have that as I only had the stuff last night. I noticed the possibility of slight hallucations, probably nothing.  I was looking at the afterimage of the computer screen, I was looking at other peoples nutmeg experiences.  When I looked away the afterimage was just flashy lines from the short paragraphs across the black screen, this was normal but then I looked at my window and the lines seemed to imprint themselves on the window, so there were diagonal lines going across it.  These stayed there, even after the afterimage had gone.  I also got a fright when a fly flew towards me at one time. Later on I had a bath, I got out the bath at about 6:30 am, time seemed to have passed quickly without me noticing, maybe I fell asleep with my eyes open and didn't realise it.",
  "I went to bed and then to sleep.  In the morning my eyes were still pretty bloodshot and red.  I felt kinda stoned and heavyish.  I had normal dreams and slept well till about half 11 am, but I stayed in bed till about 5:00 pm, but I do that often anyway, the nutmeg helped me relax more though. Now I'm sitting typing this out at about 10:30 pm, I still feel kinda out of it, I am slightly unaware of everything else except what I am doing, I feel warm and relaxed.  My head feels a little heavy and tight, but not bad.  There is a quiet buzzing noise, airy.",
  "All in all, not a bad experience, no particularly unpleasant effects, no nausea, and I could take it(the nutmeg) unlike a lot of other folk. I think I will try smoking it next time, haven't heard more than one experience of that, and he got quite powerful effects didn't he, and I am pretty immune to the stuff so I should get moderate effects and not too much.  I can take the harshness, I've tried worse I think.</p>"
 ],
 "erowid": {
  "id": "3276",
  "citation": " Anonymous. \"Only Mild Effects: experience with Nutmeg (ID 3276)\". Erowid.org. Dec 24, 2001. erowid.org/exp/3276",
  "substance": "Nutmeg",
  "views": "4573"
 }
}
