{
 "id": 5548,
 "title": "Speedy with Music Enhancement",
 "date": {
  "submission": "2007-06-20T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Necro",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "pill / tablet"
  },
  {
   "time": "3:10",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "The other night I found a bottle of the SSRI Zoloft. I found info from various websites what this chemical does to you, how much to take, etc. Normally I dont take Zoloft.",
  "At around 9:50 I took one 50 mg pill of Zoloft. I downed the pill and went out with my mom to do random shit: got lunch, returned some clothes, etc. I noticed around 45 mins to an hour later when we were in the car, I started getting much happier than I was the previous two days. This doesnt mean I was EUPHORIC it just means that I wasnt sad, angry, mad or anything. I got home and I decided this was just a feel of it. at around 1 pm, I downed 4 more pills; I total of 250 mg in all now. Within Id say about an hour I was very JITTERY, which I still am 6 hours later. I had a little difficulty focusing, but then I realized the fun. I closed and my eyes and got some awesome closed eye visuals. I opened them and stared at the window with the sunlight coming in, and I closed them, and I suddenly saw a large bright colored, intertwining square; due to the window panes Im assuming.",
  "It is now 4:30 and I just began to eat something, but suddenly I became struck by a nausea that was VERY aggitating. I went to the bathroom and threw up what I was eating. But now heres the cool part; even though I didnt like throwing up, I didnt hate it. It didnt make me mad, or agitated, nothing really. This feeling of emotionless is kinda cool but very odd. I do feel happy. Not euphoria like I said before, not even a well being, but the previous 2 days had been extremely stressful with SATs, and an incident at a friends house; with the Zoloft it was gone. I dont feel that pressure or weight. Its very peculiar.",
  "Another thing is my body feel. I feel slightly different, in terms of body weight. The way I feel when Im just coming on to a dxm trip. My thoughts are basically the same except very fast. Im guessing that this is some sort of stimulant in one way or another, because my typing is about 2-3 times as fast, and Im doing small things that I normally dont do, such as tap my finger against the desk, or shake my foot.",
  "One last thing that Im noticing is that music is affecting me alot, without my knowing. Ill explain: about to minutes ago I was playing Ott - splitting an atom, which the music, I feel, sounds like an end to something, like a conclusion. Its almost depressing. Well without my knowing it made me slightly unhappy, which I just picked up on. I changed the track to infected mushroom - spiritual trance, to see if I get slightly amped up, and if my Idea of the music affecting me is correct.",
  "9 minutes later: Yes, I was right, it is very powerful, I feel almost immortally strong I think. Im getting slightly nauseas again not sure why. My eyes are immensely dilated, but not blood shot. CEVs are still present and Im getting tracers of bright lights. I feel unbeliveably hyper. I read today that Zoloft stays with you for a few days, but Ill wait it out and see if it wears off. I dont plan on taking Zoloft again. Im feeling SLIGHTLY depressed, Im trying to fend it off and get happy; I dont want to crash like fucking adderal. I feel tired. I want to get to sleep but I dont think its gonna happen for a long time. Im not sure why but I think somehow I hit the peak just now, 7 hours later. my thoughts are different, but not amazing. Im starting to feel lonely but I dont want to be.",
  "Zoloft is very powerful, and very potent. Not something to be fucked around with. I dont perticularly like it because I have that Im gonna be like this for a while' feeling. Well Im gonna go. I hope my report was helpful, but I dont think I can write anymore. I feel like Im about to crash.",
  "Afterword (2 weeks after 'trip'): I had a strong pang of depression because I let bad thoughts get to me but that was soon washed away, after I finished writing. Im not sure if it was after affects or the come down of the trip, but for the next few days I still felt it in my system, fairly strong, but waning every day. Sometime last Friday it was completely gone. I had waaay to much trouble sleeping. Its like a cross between low grade acid and speed. I do and I dont recommend it. It kept me up for 2 days straight and my eyes were dilated to full dilation for 4 days. Very weird body buzz, and easy to get depressed, but very impressive for the CEVs, although no open ones. Its got its downsides, so it wasnt really my thing. Think Ill stick to dxm =)"
 ],
 "erowid": {
  "id": "32766",
  "citation": " Necro. \"Speedy with Music Enhancement: experience with Sertraline (Zoloft) (ID 32766)\". Erowid.org. Jun 20, 2007. erowid.org/exp/32766",
  "substance": "Sertraline (Zoloft)",
  "views": "77228"
 }
}
