{
 "title": "Surreal Comfort, Strange Feelings",
 "author": "Stardustdaydream",
 "citation": " Stardustdaydream. \"Surreal Comfort, Strange Feelings: experience with Hydrocodone (Vicodin) (ID 55491)\". Erowid.org. Feb 8, 2010. erowid.org/exp/55491",
 "substance": "Hydrocodone (Vicodin)",
 "bodyweight": "110 lb",
 "report": "<p>I get really sad about a lot of things, and Im generally avoidant and unhappy. So naturally I was looking for a drug that would make me happy and help me to forget everything that makes me sad. Opiates seemed like the answer. I obtained three generic 5 mg hydrocodone pills from a friend. It was almost time for everyone to leave for their first year of college and my best friend and I had a little falling out, or rather lapse of intimacy, and so I was feeling lower than usual and I decided to pop the pills.</p><p>9pm. I take the three pills with a small glass of water. Id just eaten dinner too, a brownie and some starburst candy. I don't mind throwing up if I have to, so whatever. After about 10 minutes my mother comes up and yells at me about something as usual and that makes me sad and angry and frustrated so after she leaves I turn off all the lights, get my favorite stuffed animal to hug, and lie down in my bed and put on a velvet underground cd and wait for the drug to kick in. Im really tired and nothing's happening so I decide to turn on a dim light and sit down on the floor.</p><p>10. I start to feel it. A heavy, sinking feeling. Warmth and intense physical comfort. It takes a lot of effort to move, and I don't want to anyway. If my house was on fire, Id have to think twice before forcing myself up. I stare at something. Its not important what I stare at cause the feeling of physical numbness and perfect comfort are so absorbing. Im not sure why, but I begin to want to cry. Normally, I cry when Im sad, like anyone, except Im sad a lot more than the average person. While on the drug, though, I don't feel sad. I just want to cry. So I start to think about things that would make me sad, and so would make me cry. I think about how Im alone and I hug my stuffed dog tighter, and I think about my friend too. None of this changes the totally absorbing heaviness and sinking comfort that I am enjoying. I do begin to cry, however. I put on a favorite shoegaze cd and lie down on the floor. I don't really feel sad, at least I don't think that I feel sad, but I cry maybe as a sort of catharsis. I phone my friend and apologize to him, still in tears on the phone. Then close my eyes and enjoy the comfortable numbness.</p><p>Its at least 1120 now. I think Ive stopped sobbing like a baby. I feel like the warmth is beginning to slightly fade so I grab a sweater on the ground next to me and put it on with a fair amount of effort. Now I am still totally lost in the hazy narcotic comfort. my thoughts and dreams fade in and out and into each other and I think about the most bizarre things - I imagine a whole new level in donkey kong country 2 that is perfectly detailed even with an all new animal friend, a squid (Id played the game a few days ago, but still, what the fuck??). I think about my friend's reaction, I think about my own fantasy world in my head. My sense of time is distorted. Everything seems to be going on for so long, when only a small amount of real time has actually passed. I was so totally absorbed by the intense comfort at that point that now when I try to recall just what I was thinking it seems like that was a dream. But I know for a fact that I was not sleeping.</p><p>By 1220 I feel like the comfort has faded enough that it is worth the effort to get up. I am also shivering a lot. The urge to cry faded a long time ago, too. Surprisingly, getting up still takes an immense amount of effort. I stumble as I try to walk. I put on a t rex cd and suddenly I have the urge to dance and sing to metal guru. So I do. And I never dance! I go on the internet and find the computer screen extremely difficult to look at, and any words are difficult to read. After a while of course I start to feel normal though a pleasant sense of sleepiness and comfort stays.</p><p>Now, this was one weird experience. Even now, a day later as I try to make sense of this, it's very hard. I guess that in the end I was so absorbed in intense physical comfort that I became totally numb and oblivious to the outside world that my thoughts and my head became my reality. so the world that I constructed in my head was my sole stimulation and so the emotions it carried were totally realized or at least amplified and that's why I cried and why I danced and why I just sat in that same spot for what seemed like a lifetime but was really a couple of hours.</p><p>Ill do this again. At a higher dosage, too. Maybe Ill even try more potent opiates if I can get my hands on them. It was pleasant and really interesting. Which is a nice contrast to the sadness and boredom that is 'real' life.</p>",
 "year": "2006",
 "id": "55491",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-02-08T08:00:00.000Z",
 "views": "54208",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  }
 }
}
