{
 "title": "It's Been a Long Night... 10 Days Later",
 "author": "Lalasa Lilith",
 "citation": " Lalasa Lilith. \"It's Been a Long Night... 10 Days Later: experience with Methamphetamine (ID 5551)\". Erowid.org. Jan 17, 2002. erowid.org/exp/5551",
 "substance": "Methamphetamine",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  " ",
  "inhaled",
  "Methamphetamine"
 ],
 "report": "<p>The first time that I ever tried crank, I'll admit, I was looking forward to it.  I had gained alot of weight since graduating high school and I knew that one of the side effects of the drug was that you didn't want to eat anything.  Little did I know that my new diet plan had so many other intricacies that I would have to deal with.  I told a friend of mine, who I knew did it fairly regularly, that I wanted to buy some and party with her.  She was hesitant, up to this point all I had ever said was that I wasn't interested in doing drugs... of ANY kind.  I assured her that I knew what I was saying and asked her to hook me up with her contact.  She called him and set up the deal, we bought about $100.00 worth of it.  That was over 2 years ago... and now we are up to buying about $250-300 a week, but with the hook up we get from our contact it ends up being about $500.00 street value.  In the 2 years, not only have we remained customers, but become runners in order to support our habit, so we get a 'discount.'</p><p>I still remember the feeling of first getting amped... it was great.  I was happy and it felt wonderful.  My heart beat was at about 140, I was so talkative (something that I never am or have been when sober) and just, well, happy.  Since she was the one with the experience, she cut it up into a really fine powder and set up these little rows of lines.  She told me that she preferred to do many smaller lines of finely cut powder than one big line of rougher stuff... it hurt less.  Looking back, she was right:  It does hurt less.  That first night, I did probably about 20 lines, each a mm or 2 thick and about 1/2 inch long.  I stayed up all night and most of the next day.  When I came down, I just fell asleep.  When I woke up my entire body hurt and I was STARVING.  But I was hooked already... that feeling of euphoria was something that I didn't want to lose out on. </p><p>We started doing it more and more often, sometimes binging for as many as 10 days once.  Now, we do it weekly, on a schedule, from Wed to Sunday.  I don't get that euphoric feeling anymore... I'm just awake and usually numb.  As for the dosage, from that 20 small lines that kept me up all night and most of the next day, that's what I start with.  Every 6 hours I'll do another 12-16 lines of the same size, assuming that all in my life is going okay.  If it isn't, then I do more to compensate.  Am I dependent on it?  Yes, emotionally I am.  Whenever I have a bad day or feel depressed, my first reaction is to run some lines.  Whenever I come down, I'm depressed for 24-36 hours.  Physically, it's starting to affect me as well.  When I'm down, and I lay on the bed, my body twitches and shakes uncontrollably.  I never sleep well, I have horrible nightmares and toss and turn all night.  Professionally it is destroying my life.  When I first started, I had a job that I liked and did well in where I had been for 3 years.  Now in the last two years I have had at least 6 different jobs... it's hard to get up and go to work after sleeping for 14 hours... especially if I was up for the previous 5 days.</p><p>As I'm typing this I'm thinking about the little white lines that are waiting for me at home.  I've been down since Sunday night.  It's Wednesday and it's time to start again.  My body is exhausted, my eyes have dark circles under them, and once again, I'm on probation for work.  All that matters though is those little white lines on the mirror that will be waiting for me when I get home, and the straw in my roommate's hand, and the smile on her face as she tells me through teared eyes and a runny nose that it is really good shit.</p><p>I should have looked into the details before I snorted those first few lines.  I should have thought a little more about it.  I thought I was strong enough not to get addicted.  I believed that I was only doing it for the weight loss.   Sometimes I still try to convince myself of it, because it so much easier than saying 'Hi, my name is ___ and I'm a drug addict.'</p>",
 "year": "2001",
 "id": "5551",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-01-17T08:00:00.000Z",
 "views": "37548",
 "dose": {}
}
