{
 "title": "Watch Out for That Dope Synergy",
 "author": "Heavydrug Enthuasist",
 "citation": " Heavydrug Enthuasist. \"Watch Out for That Dope Synergy: experience with Heroin, DXM & Cannabis (ID 55537)\". Erowid.org. Sep 25, 2008. erowid.org/exp/55537",
 "substance": "Heroin, DXM & Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>I had heard that there is an extremely powerful synergy between dope and dex, so I had to find out for my self. I have barely seen any trip reports on the dex dope combo so here you go.</p><p>The night started at 10 PM when I started with a fat line of dope, about 10 min later I took 40 cough gels. I felt the dope coming on and soon I was pretty relaxed, after about an hour the dex was fully kicked in. As I lay in my bed I felt so high I the only thing that mattered was that I had dark side of the moon playing on my radio. Most of my focus was on a big peace sign poster in my room as it spun back and forth. When I closed my eyes insane visuals happened as I got sucked into crazy geometric patterns. But after awhile I found my self bored with CEVs so I came out of what I'm sure looked like I was brain dead to realize that the ceiling was doing some pretty crazy shifting (a lot more than usual anyway) and noticed I was nodding a bit.</p><p>Although this was one hell of a buzz I wanted to get higher so I snorted another line of dope. After that I was feeling extremely nauseous so I decided to smoke a bowl of some pretty good green to combat the impending vomit. On the walk over to the 420 friendly part of the house I came unbelievably close to yakking, but I manage to hold it. Right after I took my first hit knew I was about to throw up, so I staggered over to the garbage can, but I didn't make it and threw up all over the carpet, thought to myself fuck it I'll deal with that mess in the mourning. After finishing the bowl I was walking back to my room and as I was going down the stairs all of a sudden the dope kicked in and tumbled down the stairs.</p><p>As I lay on the ground my whole body felt as if it was getting an IV heroin rush, and everything was doing a weird spinning/rotating type thing. The whole time a famous line of floyds just couldn't get out my head 'Think u can tell heaven from hell, blue skies from pain, so u think u can tell,' I'm not sure why seemed so important to figure out, but what does make sence when your out your skull? After about 2 hours of just laying on the ground next to the stairs I realized that if I stayed where I was I would get busted and hence kicked out so I managed to somehow go the 30 feet to my room.</p>",
 "year": "2006",
 "id": "55537",
 "gender": "Male",
 "timestamp": "2008-09-25T07:00:00.000Z",
 "views": "8503",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Heroin",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 0:10",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Heroin",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": " T+ 0:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
