{
 "title": "Linearization of the Dream State",
 "author": "Agkdov",
 "citation": " Agkdov. \"Linearization of the Dream State: experience with Calea zacatechichi (ID 55558)\". Erowid.org. Sep 15, 2006. erowid.org/exp/55558",
 "substance": "Calea zacatechichi",
 "bodyweight": "65 kg",
 "report": [
  "<p>This is a report of my three-day experimentation with Calea zacatechichi, which I found quite rewarding.  I came across this plant browsing online, which got me interested in its reported effects.  I usually recall my dreams quite well but they are most often very strange, which stops me from really going into much detail; so the fact that Calea zacatechichi reportedly helps produce vivid realistic dreams caught my attention.  I ordered 28 grams of calea, which I thought would be a reasonable quantity to begin with, and it was.",
  "Day I:",
  "Around 12:00 am I made a cup of Calea zacatechichi tea, simmering 3.4 grams of material for about 15 minutes.  The tea was a dark copper-tainted brown and smelled really good.  Having been warned of the bitterness by several reports, I added heaps of sugar and a few spoonfuls of honey to the tea.  This did not drown out the bitterness to the extent I had hoped for, and the tea was the worst tasting drink I had ever tasted, but I considered this the price I had to pay for this new experience and drank the tea while watching a movie.",
  "By the end of the cup I felt a light buzz, but it was mostly just a sort of semi-conscious relaxation.",
  "When the movie was finished (T+1h 45m) I went out onto the balcony to smoke a joint, which I had previously rolled, containing 0.5 grams calea.  This confirmed the sensation I had been feeling up to now and I felt quite light-headed and very relaxed.  It also gave me a strong urge to sleep so I complied.",
  "Lying down in my bed in an utterly dark and silent room was very interesting.  Faint little dots of light danced around my eyes, arranging themselves into swirling patterns.  As I relaxed it felt as if I was an integral part of my bed, which was really pleasant.  I definitely dreamed that night but I do not remember much of it.  The images were still quite hazy.",
  "Upon awakening the next day I felt very relaxed, as if I'd had a great nights sleep, which wasn't especially the case.  I attributed the poorness of my dream experience to the fact that I may not have used enough Calea zacatechichi or that I hadn't been using it long enough, so I decided to repeat the experiment the following evening.",
  "Day II:",
  "Towards 12:00 am I made a cup of calea tea, by the same method, using close to 4 grams this time.  Again I drank it while watching a movie and I felt a slightly stronger buzz this time.  I also added a little milk to the tea and it seemed quite a bit less bitter that the previous night, but then again maybe it was because I knew exactly what to expect this time.",
  "By the end of the movie (T+2h) I went out on the balcony and had a calea joint (0.7 grams) which got me lightly stoned in a calea kind of way.  The effects are very hard to describe and I believe they are greatly due to the setting (nighttime, calm and being alone) but the experience is quite pleasant if I get into it.  Personally I do not find that the smoke tastes too bad, its definitely way better than the tea.",
  "Again I lay down in bed and, when I closed my eyes, I sensed swirling patterns of the dotted dim lights all around me.  If I concentrated on them it was as if they were being fed into a sort of vortex that led to my mouth.",
  "That night I had a very vivid and slightly disturbing dream.  Contrary to my usual dreams, it was remarkably linear.  Its contents were slightly less weird than my average dream but the detail was amazing.  At one point in my dream I was skiing; I can clearly remember the mountain landscape in every detail.  During a jump, I could feel the wind rushing by and the adrenaline surge throughout my body.  It was quite a fantastic experience, the way every one of my senses, as well as my mind, felt similar to the waking state.  This also applied to uncomfortable situations in the dream though, which made it slightly more disturbing than my average dream.  I awoke feeling refreshed, but my mind was in a sort of a daze, taking a while to come to grips with the content.  This time I was more than satisfied with the effect and I greatly looked forward to the coming night's 'dream tripping'.",
  "Day III:",
  "I was now quite aware of the potential of this plant and so I wondered what it would be like to increase the dose significantly.  So I prepared a tea like the night before, around 11:00 pm, and drank it while listening to music in my dimly lit room.  This was really pleasant as I could enjoy the music much more with a sort of great mental clarity.  I then rolled two calea joints (0.5 grams each) for later on and proceded to make a second cup of tea (T+1h), this time with only 3 grams of material.",
  "Once more I drank this while watching a movie.  I then headed out to the balcony and smoked both joints (T+2h50m), with a few minutes break in between.  By the end of the second joint I was more than relaxed, quite drowsy and light-headed, and my coordination and stability were slightly affected (although nowhere close to what weed can do to me, which is why I do not believe this to be a serious alternative to weed).  Again, there were patterns as I lay down to sleep and in a semi-sleeping state I could picture myself being a plant.  It felt interesting even though it was a vague sensation.",
  "I don't know why, but the result was another linear dream. This time I had great difficulty recalling much of it.  It could be that raising the dosage was the cause for this, but there are so many other factors that play a role in dreams that this is not a conclusive experiment in my eyes.  I will pursue more experimentation with Calea zacatechichi in the future.",
  "Overall, this plant's effects seem interesting and unique.  The only downside is the taste of the tea, which took a good bit of determination to get past.  But there were no notable side effects or hangover.  I would classify it as relaxing, mildly halucinogenic, and with a noticeable effect on dreaming.</p>"
 ],
 "year": "2006",
 "id": "55558",
 "gender": "Male",
 "views": "22092",
 "dose": [
  {
   "time": "0",
   "amount": "3.4 g",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(tea)"
  },
  {
   "time": " T+ 1:45",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": ""
  },
  {
   "time": " T+ 24:00",
   "amount": "3.4 g",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(tea)"
  },
  {
   "time": " T+ 26:00",
   "amount": "0.7 g",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": ""
  },
  {
   "time": " T+ 47:00",
   "amount": "3.4 g",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(tea)"
  },
  {
   "time": " T+ 48:00",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(tea)"
  },
  {
   "time": " T+ 49:50",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": ""
  }
 ],
 "submissionDate": "2006-09-15T07:00:00.000Z"
}
