{
 "title": "My Psychedelic Weekend",
 "author": "Xorkoth",
 "citation": " Xorkoth. \"My Psychedelic Weekend: experience with LSD, 2C-B & DOC (ID 55565)\". Erowid.org. Aug 25, 2006. erowid.org/exp/55565",
 "substance": "LSD, 2C-B & DOC",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "",
   "15 mg",
   "oral",
   "2C-B",
   "(powder / crystals)",
   "",
   "3.5 mg",
   "oral",
   "DOC",
   "(liquid)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>FRIDAY:</p><p>The night has just switched over into morning.  It's 12:20am on Saturday, basically my Friday night.  I place 4 hits of LSD on my tongue and let them dissolve there.  This LSD is pretty weak, but I know from a previous trial that it's clean.  I originally had been told 80mcgs per hit, but it turns out they are more like 40, or even less. [Erowid Note: Claims of measured microgram dosages for LSD are usually unsupported. Quantitative measurements for LSD are very difficult to do and cannot be done casually. Without further detailed information about how the measurements were derived, it is reasonable to assume that most statements of microgram dosages of LSD on blotter or in microdots are either misinformed or overstated.] I'm also hoping that the time I traveled with them across the country to my hometown didn't cause them to degrade.  I kept them locked in an airtight glass jar, and in room temperature, but unfortunately, they did have to endure 100 degrees Fahrenheit for a few hours, and room temperature is not cold.</p><p>At 12:36 (T+0:16) I feel a very faint, subtle, pleasant first alert.  I wonder if it is placebo at first, and then at around 1:20 (T+1:00) I could feel a definite shift in my energy.  But it was not overpowering at all, not even close.  In fact, it was quite comfortable and tingly, pleasant really.  At this point, I decide to put on some classical piano recordings I had downloaded earlier.  As Chopin's 'Nocturne in E Minor' slowly began, I enjoyed it greatly, but not especially so.  The song is always beautiful.</p><p>Soon, another hour goes by (now it's T+2:00), and little else is happening.  I have some very faint organic morphing and crawling occurring, and colors seem brighter, especially when I go to the bathroom.  The bright lights of the bathroom always seem to draw out a psychedelic state for some reason.  I have a nice little euphoria going, but I really don't feel particularly altered.  I do know for sure that this is LSD, as I can recognize its effects however subtle.  It's just so ridiculously weak!  I think part of this may be due to the fact that my psychedelic tolerance in general has raised significantly since the beginning of this year.  Also of note is that in the past two months, I've come to notice that tripping really doesn't make mke feel nervous much anymore.  Most of the time I get away with pleasant feelings and euphoria, even when I have very powerful trips.  I certainly often speculate that anxiety can help to bring out profound changes in perception, simply due to the unfamiliarity of it. </p><p>In any case, at this point I decide on something I had pondered earlier, which was to ingest some 2C-B to kick this into gear.  I had never tripped on 2C-B before this although I had tried once or twice on the tail end of MDMA.  So I proceed to my stash and scales and weighed out exactly 15mg of 2C-B hydrobromide, and dropped it onto my tongue.  I swished it around with water and held it there for a few minutes, then swallowed.  It was bitter, but not ridiculously so.  However, it burned considerably and left my tongue feeling scalded (although that did fade a few hours later).</p><p>At 3:04 (T+2:46 from the LSD and T+0:34 from the 2C-B), I feel a definite shift in my energy.  The music begins to sound much more 'rounded' and expansive, and my energy in general feels more 'forward'.  I begin to feel like I'm being propelled forward, in fact, while simultaneously experiencing a pleasant body tingling.  By 3:25 (T+3:05 from the LSD and T+0:55 from the 2C-B), there are rainbow coronas surrounding everything, in a very beautiful fashion.  The visuals from 2C-B are really quite astounding, not as full and complex as with 2C-E but more beautiful, not creepy, and almost as intense.  Every textured surface is crawling around, although there isn't a lot of perspective shifting.  I decide at this point to vaporize a few hits of cannabis and go lay down and listen to one of my favorite tripping albums, Shulman's 'In Search of a Meaningful Moment'.  I take about 3 hits and quickly go lay down.</p><p>Immediately, my trip gets thrown into high gear when the beat picks up.  Before long, I realize that my ego is significantly dissolved, much more so than I had expected at any dose of 2C-B from reading reports.  I was falling into several separate places of fantasy, each of which involved me being someone else entirely, from various places in history.  These experiences were not as vivid as real life, they were more like reliving old memories.  The closed-eye visuals began as a wide field of colorful geometric undulations, which soon faded into one separate view for each of my current thought processes.  These views would sometimes be actual scenes corresponding to the memories, and would sometimes be abstract renderings of the concept of infinity in various forms.  The top of my head, directly at the 'soft spot', felt like a focal point, and it felt like the rest of my head and body were split into multiple equivalent segments, each a 'slice' of one of the other people I was experiencing.  It was a very bizarre and rather shocking sensation, and it sometimes took a bit of scrambling to remember who I really was. </p><p>I can't recall all of the people I experienced myself as, but I do recall that the majority of the experiences were of very basic and primitive living conditions, of people who existed as little more than animals.  I felt a wide range of sensations, on only individual 'slices' my body had become, of hunger, pain, fatigue, joy, sorrow, and everything else.  On occasion I opened my eyes briefly, and the world was brightly strobing and undulating.</p><p>I felt and experienced a great deal of conceptual material during the 78 minutes that the song was playing.  I notice that 2C-B provides a good deal of body heat and stimulation, in that phenethylamine way.  It's not as stimulating as 2C-I, but the body heat output is far greater than with any of the other 2Cs.  In fact, I felt hotter on 2C-B than on any other psychedelic I've done.  Colors become unbelievably rich and saturated.  A theme of my philosphical thought process and closed-eye visuals that I noticed overriding everything is of the arrangement of patterns into a larger whole, to form infinity. </p><p>I also continually encountered the concept of infinity contained within every infinitely small particle, the very definition of infinity I suppose.  Most of all, I was constantly being shown about the dichotomy present in everything, the pairing off into extremes.  I got a sense that in some way, all of these dichotomies were the opposition of male and female forces, though at the same time I think that males and females are but one example of this dichotomy. </p><p>The experience felt very paradoxical.  I felt a sensation that was very interesting but hard to explain, that our every action is tied to our every other related action, whether past, present, or future.  I got the sense that my reading of 2C-B reports in the past was somehow linked directly to the experience I was having.  Of course, it was, but I mean this is a unique way - I felt very strongly that the two times were irrelevant.  Basically I was feeling time as an illusion, a continuum, a man-made concept.</p><p>Immediately following the CD, I got up (to let off some excess stimulation) and wrote several things down:</p><p>'I ask: Why is it that the psychedelic experience is invariably centered on such fundamental concepts, such important, such complex, such uniform ones.  This seems to be proof that they've been put here for a reason, to use as tools.  Statistically, why else would we be able to take a random chemical and suddenly perceive infinity if it wasn't in order to allow us to learn something from it?  I mean, seriously.'</p><p>'Imagine following a point as it fractalizes into infinity.  As it reaches the point of either being obsolete or so incomprehensibly vast so as to swallow up everything, there you have the dichotomy, the paradox.  The dual nature in everything, but it is really one and the same, one side balancing out the other in an illusionary dance.  This holds true for anything.'</p><p>At this point (4:41, T+4:21/T+1:49), I'm definitely on the way down already, as expected.  There is a certain sense of dirtiness in my body, a feeling which the LSD alone would not have produced.  I decide to sit down and read some 2C-B reports online to help compare and contrast what I had just experienced and hopefully keep it in mind more solidly.</p><p>At 6:17am, I go downstairs to check out my cat Magna who has been meowing loudly and insistently.  Turns out she just wants some love and attention, so I set about petting her.  While we interacted, I had a unique experience.  I was able to sense her spirit and personality to a much greater degree than ever before, which is saying a lot because I have a LOT of understanding of animals, especially my own.  I felt as if I could sense what she was feeling, as complex emotions.  I felt the noble spirit of her.  I recollected on how we are all the same observer, the universal force of consciousness, at the deepest level. </p><p>For a moment, I saw myself (the human) through the eyes of my little kitty, and I felt intense love and family coming through that, a strong bond.  I also reflected on how, when you treat a living thing with nothing but love, as they all deserve, they react back only with love, except in the case of some heavily emotionally or psychologically wounded humans (or animals I suppose).  What does that say about the nature of existence?</p><p>The rest of the night is spent lounging about, reading report, posting on some message boards, and listening to great music.  I never did end of going to sleep.</p><p>SATURDAY:</p><p>I greet my girlfriend as she wakes up for the day.  We lounge about for a while and I begin to get somewhat tired.  Spontaneously, I decide to ingest 1mg of DOC at noon.  Directly after that, we go to Costco to get some essentials (not food, as I prefer to shop at a healthier place).  As we get there, I feel the warm psychedelic amphetamine buzz begin, but not strong enough to make me anxious in public.  This was going to be a fun shopping trip!</p><p>While inside the store, I feel as if my girlfriend and I are in our own protective bubble.  She begins to obviously catch my vibe (as happens every single time I'm on DOC around her), and we begin analyzing everyone around us and generally having loads of fun investigating the store around us.  We notice parents ignoring their children, ignoring each other, just passing by life, angry, sad, discouraged.  It made me feel glad once again that I'm able to pull myself out of that rut on a day-to-day basis these days, because at one time I was definitely on my way into the same rut.  When someone was rude, walking between us and the store display without even looking at us or saying excuse me or sorry, while simultaneously bumping my girlfriend rather hard in the shoulder, she said, rather loudly, 'You know, excuse me or sorry would have been nice'.  He walked by briskly without looking, joining his wife, I suppose, about 15 feet away.  We hear him muttering to her about what a bitch my girlfriend was, but we just laugh, because we know who the bitch in this situation is, and anyway, what does it matter?  Soon after, we pay for our items and go on home.  Driving was as affected as it would have been on an Adderall or two, which is to say, boosted. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>What follows is a day of the utmost hilarity and contentment, a truly blessed day where we were both able to bask in bliss and just live in the moment.</p><p>Once we get home, I take .5mg more of DOC.  I notice that my vision is slightly wavering but my euphoria has only increased.  It manifests itself as a warm glow in my solar plexus area, or perhaps from my heart.  I've got a big goofy smile all over my face, and my mind is working overtime, coming up with connections between everything I thought about for a moment.  As is customary for my girlfriend, we turn on some TV, switching over the day between E! (ugh), The Food Channel, The Discovery Channel, The Travel Channel, and The Weather Channel (for Storm Stories). </p><p>Although I normally tolerate the TV at best, on DOC I've found it to be great fun and very thought-provoking, sort of like being in bed with the enemy.  It allows me to analyze the state of pop culture and also learn some interesting things when it's turned to the more informational channels, which I enjoy at any time.  I made some kratom, about 7 grams, and drank that, which, on DOC, for some reason adds to the DOC euphoria without really adding an opiate touch to it or bringing it down at all, and lasts damn near the whole time the DOC does, as opposed to its usual 2-3 hours.  It also makes me feel warm and itchy to a much, much greater extent than kratom does alone.</p><p>It would take a very long time to describe my whole day, as it was truly excellent and full of meaning and love and warmth and feelings of incredible happiness.  But let me illustrate a few highlights that jump out at me:</p><p>We were watching the E! channel, my least favorite television of all as I truly believe it has done so much towards dumbing down Americans and making people, especially women and girls, insecure as hell.  Anyone who follows pop culture, whether inadvertently like me or on purpose, will know what I'm about to talk about.  They were talking about Vince Vaughn and Jennifer Aniston, or 'Vaughniston' since they've recently begun combining celebrity couples' names into one.  These are two actors who I enjoy and respect in their movies and TV shows. </p><p>Seriously, it's twisted, this situation.  The media is SO INTO these peoples' lives.  I mean, these poor people!  They'd like to have their personal lives stay private, and they repeatedly request that the media leave them alone, even to the point of denying their relationship.  But the media just WILL NOT do it.  Instead, they make up a pet name for them and every other day or so, invent a new story about how they've found proof that they're getting married (marriage is the new 'in' thing in Hollywood, you know).  Meanwhile these people are denying repeatedly that they are.  It's a brutal and shameful intrusion of privacy and personal space that for some reason your average young American is obsessed with.  It's almost like voyeurism pornography.  It really disgusts me.  I occurs to me that this is probably how people see Americans, and sadly, in large part, they're right.  It's almost funny, but really, it's terrifying more than anything.</p><p>This led into how I was noticing the various people who play a part in the American marketing machine.  Primarily, I was noticing the announcers/'anchors' in E! News.  Some of them are totally oblivious and love it and think it's cool.  Some of them, it became obvious, are fully aware of what it's doing, but they are probably attracted by the money.  But all of them are now trapped into the system.  Even the announcers have become celebrities in their own right, and other pop culture 'news' crews follow them around and report every little insignificant thing that they do.  It truly is a machine, a machine which has gained so much steam that I'm not sure if it'll ever stop.</p><p>At one point, we watched a marathon of the show by Alton Brown on the Food Network, 'Feasting on Asphault'.  This, as opposed to everything on E!, is actually a good show.  It's a series that consists of taping an entire motorcycle road trip across the country, taking only back roads, to investigate the heritage and history of American cuisine and how it was influenced by the evolution of the country and technology.  In small towns, the corporate chains haven't yet taken over so you can actually find countless unique restaurants.  I noticed the very real interactions going on between he and his crew and the people he met along the trip.  Alton Brown is just so passionate about what he does, and he's a really smart guy.  I always learn a lot about food and cooking and history when I watch his shows.  This show really took my breath away.  It's a rare gem.</p><p>I also encountered several absurd statements while watching TV, that, when taken out of context, made me laugh for a long time.  The first one was on a traveling food show (not 'Feasting on Asphault') where they said 'In order to fully appreciate an Irish pub, one must surely have loads of crack on hand.'  Well, they meant 'kraik', an Irish word, but it's pronounced 'crack'.  Well, I thought it was funny.</p><p>Another hilarious and intensely embarrassing segment to watch was ridiculous whether or not it was taken in context.  It was Al Roker's food show, and he was visiting with this attractive woman who was showing him how to make some sort of food.  But, amazingly, he began hitting on her horribly, and it was obviously making her extremely uncomfortable.  He kept using the words 'hot' or 'sexy' in this creepy, creepy voice.  He'd be like 'Watch as this SEXY lady shows us how to make some food.  She's so HOT!  Yeah!'  'Ohh, I'm feeling SEXY now, with this SEXY lady, making her SEXY food!'  She got increasingly uncomfortable and red in the face, and the worse it got, the more he started freaking out and leaping about and leaning in on her. </p><p>I honestly cant believe they aired it, it was very inappropriate.  The climax was when he started leaping around shouting at the top of his lungs 'Spank me!  Spank me!  I feel SEXY!'  Then the scene cut to later on, and he tried to bring it up once more, I think probably embarrassed that he had freaked out like that, and someone off the set warned him not to.  It was tres bizarre.</p><p>Also, all day long, my girlfriend had a massive contact high.  Actually, it was weird, because I gave her kratom as well, and it also lasted all day for her, from 2 until 10, and she described feeling very weird, lightheaded.  I pressed her and she ended up describing the feeling of DOC mixed with kratom, except that she didn't understand it or know what to expect so it freaked her out a little.  This is very weird because kratom does not last that long at all normally.  In addition, she ALWAYS gets a contact high from me on DOC and we always end up having a truly wonderful day when I use it, but apparently this time it was just too much.</p><p>A final stand-out event in the day was perhaps the funniest and strangest of all.  We were watching all this talk about the new 'summer blockbuster', 'Snakes on a Plane'.  Now, we've thought this movie sounded unimaginably stupid from the beginning.  I hypothesized that it's a parody of the Hollywoodized movie, which is basically just special effects.  But part of the parody is marketing it as a serious film.  I wondered out loud why anyone would want to watch it because it looks so lame and uncreative.  Then my phone rang.  Guess what I heard when I picked it up:</p><p>It was Samuel L. Jackson's voice (the main actor in the film), sounding totally natural and unbroken, saying, basically:  'Yo!  Get up off your scrawny behind and get out there and see Snakes on a Plane!  Why you ask?  it's the greatest movie ever made!  It's nonstop action!  So get up, stop messing with those computers, quit smoking that waaaacky tobacky, get in your wannabe sports car, and drive down to the theater!  If you don't, you'll regret it!'  I'm forgetting some of it but unfortunately it was not recorded.</p><p>I was absolutely blown away!  This was a coincidence of the most amazing kind, a direct response to the question I had just asked by the man himself!  Not only that, but the details in it corresponded exactly to me:  I'm skinny, I work with computers, I have a low-end sports car, and I certainly smoke the 'wacky tobacky'.  After feeling confused for a bit, we ended up laughing at that for hours.  I still can't get over how much that made my day.  And it also still confuses me to some extent.  I would assume a friend of mine went to some website or something and had a recording call me (it was definitely a recording).  But if so, how is it that he could have the recording pick out such personal pieces of information and still sound perfectly seamless?  I don't know, but it was hilarious!</p><p>The rest of the day is spent in a beautiful high/afterglow that lasts until I go to sleep, at around 3:30am (Almost 48 hours since I woke up Friday morning).</p><p>SUNDAY:</p><p>I wake up Sunday at about 10am and decide to ingest more DOC, since I was on a roll.  I dose 1.25mg at 11:15, and then another .6mg at 2:15.  Before long I experience slowly shifting colors and textures, a beautiful euphoria, and racing analytical thoughts.  It's going to be another lovely day!  My girlfriend experiences yet another contact high and enjoys it thoroughly.  This will be good towards introducing her to psychedelics, as eventually I can explain to her that she's already somewhat experienced one.  She's quite open to the idea now but is just afraid, and her only experience around people that she knew were tripping was when less experienced people were giving off strange vibes and creeping her out.  Hence, she thinks that they make people creepy and she doesn't want to do them with me because she thinks it'll hurt her perception of me.</p><p>Basically, this day progresses just like Saturday did, only with significantly less profundity and euphoria.  Still, it was a great day that I treasure.</p><p>CONCLUSION:</p><p>I had an awesome psychedelic weekend that I wouldn't trade for anything.  As for 2C-B, I discovered that it's a more profound chemical for me than many people have said it is, and I plan to use it more in the future at higher levels.  Combining it with LSD was really great, and may have added significantly to the depth of the experience.  It has a slightly annoying comedown, unlike most other psychedelics I've tried, but it's easily manageable.</p><p>As for DOC, I've discovered that it's quite useful at low doses as well as at high ones.  I was far from a breakthrough, but the intellectual and physical aspects of the trip remain in full force.  DOC really allows me to 'live in the now' moreso than any other chemical I've tried.  Although I've learned to do this pretty well, I think, in my daily sober life, DOC brings it up to a different level entirely.  I also determined that, while in a way DOC seems to have a reverse tolerance, becoming generally more powerful every time I use it at higher doses, at low doses taken on consecutive days it definitely loses strength, and so I shouldn't take it that often anymore. </p><p>I also found out that it goes really well after another psychedelic experience.  My only real complaint about DOC is that sometimes it seems to impose a certain amount of vasoconstriction, as LSA does, making walking around after sitting for a while painful.  That, and it tends to make me flushed and occasionally itchy.  Interestingly, it combines with kratom to make the opioid plant itchier and longer-lasting by far.</p><p>On a somewhat related note, I also determined that music is love, and love is god.  It's interesting how throughout human history, music has always played a very important role in society.</p>",
 "year": "2006",
 "id": "55565",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-08-25T07:00:00.000Z",
 "views": "21888"
}
