{
 "title": "Instant Brain Boost",
 "author": "brando c",
 "citation": " brando c. \"Instant Brain Boost: experience with Aniracetam (ID 55576)\". Erowid.org. Jan 17, 2007. erowid.org/exp/55576",
 "substance": "Aniracetam",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "3000 mg",
  "oral",
  "Aniracetam",
  "(pill / tablet)"
 ],
 "report": "<p>Aniracetram: I am amazed that I'd not heard of this drug (or this entire class of drugs, the racetams) earlier.  I've been a student in a 'hardcore' discipline of science at two top universities, so I could always use any help focusing on my work.  I was also seriously interested in neuropharm., so how this one escaped my relentless web-browsing about chemicals is a mystery. </p><p>Anyways, a few days ago while bored at work, I was reading online and came across the racetams, a class of drugs whose prototypical member is the water-soluble and relatively impotent piracetam.  After some research, I decided that I would like to taste-test another newer racetam called aniracetam.  I'd read that it has utility in neuropathic pain, anxiety, memory, and cognition, and I could seriously use help in these areas!</p><p>The first day I took 3000mg spaced throughout the day, and noticed that I felt very alert, but not jittery.  At work, where I am usually anxious around my coworkers, I felt social and confident.  The effects seemed contradictory, that I should have an anxiolytic and stimulant effect at the same time.  It was NOT a euphoric effect...it felt more like I had had a great night's sleep and a big cup of strong green tea - I was just on my game in every way.  I noted later in the afternoon, while I was reviewing some scientific literature, that I had more focus than I'd had in a long time.  I was not becoming bored, distracted, or confused.  If I didn't understand a concept, I felt like I could push through until I did. </p><p>That night I had some difficulty sleeping, but it probably only took an extra hour to fall asleep.  I also had sex with my boyfriend and noticed no sexual side-effects, (good or bad). </p><p>On day two, I took the standard 2X750mg dose, and largely noticed the same effects.  I was more productive at work, more focused, and again, more social. </p><p>I've read that aniracetam works by somehow acitivating glutamatergic receptors which are closely coupled to cholinergic receptors.  Similar to some typical Alzheimers drugs, then, aniracetam should increase brain function through its parasympathomimetic effects.  Anyways, I can't prove that theory, but I do believe that its cognition-enhancing effects ARE sunstantial, and I hope there are not serious side-effects or withdrawal. </p><p>Cheers,</p><p>brando</p>",
 "year": "2006",
 "id": "55576",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-17T08:00:00.000Z",
 "views": "34296",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3000 mg",
   "administration": "oral",
   "substance": "Aniracetam",
   "form": "(pill / tablet)"
  }
 }
}
