{
 "title": "Seeing the Other Side",
 "author": "Johnny420",
 "citation": " Johnny420. \"Seeing the Other Side: experience with Heroin & Cannabis (ID 55597)\". Erowid.org. May 4, 2007. erowid.org/exp/55597",
 "substance": "Heroin & Cannabis",
 "bodyweight": "160 lb",
 "report": "<p>[Erowid Note: 1/3 gram of heroin is considered an extremely high dose, see heroin Dose Chart]</p><p>I am almost 20 and have been using heroin intervenously since I was 14. About 2 months ago myself and a few friends rented a hotel to stay the night in and get loaded safely behind closed doors. All of my friends were already high as they had the dope in their possesion the duration of the day and I had just arrived to take my first shot of the day at around 11 p.m.</p><p>I think my first mistake was that I had not tested the potency of the dope before my shot was prepared. My second was that I was distracted and let my friend (who was already high) measure out and cook up my shot. I remember seeing the ball of tar before it was cooked and asking if he thought it was too big and he said no. It looked pretty large even in comparison to my past use.</p><p>I had eaten a pretty potent THC candy very fast (like in one bite) about thirty minutes prior.</p><p>I sat in a chair in the hotel and shot the load. Almost thirty seconds later I felt incredibly strong affects and was instantly light headed. the last thing i remember was looking at my girlfriend sitting over on the bed and uttering, ' that was a fat hit' everything became bright white.</p><p>All of a sudden I was in an unfamailiar suburban yet rustic area walking down a street with unfamiliar people. Everything was a bright yellow-orange like the color of the sky right before dusk in mid afternoon. The people spoke in an unfamiar language. All of their faces and bodies were quite similiar to one another in a very ambigous almost faceless way. I tried to ask them for help but no one responded.</p><p>Before I knew it I was a small child playing in the circle where my family once lived, playing with other children riding bikes and such and before I knew it I was in middle school lost and confused at a school dance. I was living out my memories past, but soon as this accured to me I was waking up in a forrest, alone, shortly after dark. Everything was murky and brown and the moon was full. a looked at the sky throught the canopy of the trees and the murky brown in the sky started getting brighter.</p><p>The shafts of the tall trees became figures around me dressed in navy blue. I looked around and saw a few of my friends standing around me with the men in navy blue. I identified the men were paramedics. Then I realized I was back in the hotel room. I felt an incredibly deep nausea. It had not yet registered that I was just revived from an overdose. The first thought was more like I just nodded of for a few minutes.</p><p>Why are the paramedics here? The first thing I said was, 'I have the right to refuse medical treatment right?' The paramedics completely ignored my delerious question and I heard one ask another 'The narcon worked, didn't it?'(narcon is the narcotics neutralizing drug administered) I looked down and notice that my shirt and shoes had been taken off and felt a terrible chill as hot waves of narcon shot through my now sweat and ice drenched body. Reality hit me. I was closer to death than I'd ever been seconds before. I looked down and was already in a gourney. they wheeled me out to the ambulance and took me to the hospital for assesment and observation.</p><p>I later found out that what I first thought was a 2 minute nod was a thirty minute unconsious ordeal for me and my friends. When a was looking at my friend on the bed before I saw white I had fallen back in my chair and begun to turn blue. My friends realized I had overdosed and called 911 and taken of my shoes and shirt and packed me with ice, as I mentioned when I came to that my body was drenched with sweat and ice. People were slapping my face to try and revive me and dragging my limp unconsious body around the room for thiry minutes before paramedics arrived and I didnt know any of this because I was somewhere else!</p><p>Where I went was neither bad nor good. It was not Pearly gates nor Hellfire and Brimstone. And I was not having a good time there but I was not by any means uncomfortable during my stay. One of my religious friends told me it was probably peratory. Another who is chemically educated told me that it was an induced DMT experience. Whereever I went I had to travel through wormholes in my mind to get there and it was not pleasant coming back to reality with narcon. In fact it was one of the worst feelings Ive ever felt.</p><p>What I leaned: Death is just the worlds strangest trip which some may not understand and you should try to stay in this realm of living conciousness as long as you can. And Never Ever fuck with your veins for recreational drugs unless you are a damn doctor and a chemist!!!!!!!!!!!</p>",
 "year": "2006",
 "id": "55597",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-04T07:00:00.000Z",
 "views": "27006",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 ",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "0.3333 g",
   "administration": "IV",
   "substance": "Heroin",
   "form": "(tar / resin)"
  }
 }
}
