{
 "id": 556,
 "title": "Mildly Euphoric",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Herbguy",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3.4",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Kava",
   "form": "capsule"
  }
 ],
 "report": [
  "I tried a fairly large dose of kava Kava the other night and found it to be surprisingly pleasurable. So here is my little synopsis on the experience:",
  "5:00pm -On an empty stomach I ingested the contents of 8, 425 mg capsules of a store bought Kava supplement. I mixed the kava powder with cold water and a little sugar (the taste really doesn't bother me that much).",
  "5:20 - I began feeling the effects: mild sense of well being, stimulated but relaxed. My mouth is a little numb from the kava.",
  "6:00 - This was probably the high point of the kava experience. I felt mild euphoria: very much at one with the universe, relaxed mind, extremely clear thought process, mild head and body buzz, bodily relaxation, and increased sense awareness. Visual perception was enhanced significantly: objects with sharp contrast and great detail looked exceptionally beautiful. some slight peripheral 'pulsing' as I like to call it. Very mild and natural visual effects. My hearing was also more enhanced...music had more intensity and was more profound...very beautiful",
  "7:00 - 'The plateau' still feeling the effects, very nice! my body feels heavy...walking and bodily activity really enhances the 'buzz'.  I have urinated 2 times since I ingested the kava...definitely irregular. (kava induces urination) Mild stomach discomfort.",
  "8:00 - The obvious effects have waned significantly, and my body is starting to feel very tired. I think this is the after-effect.",
  "9:00 - Definitely more tired than I would be had I not ingested the kava. Still feel mentally relaxed.",
  "Overall, I really liked the experience. It was mild but still obvious. Don't expect to get really blown out of your mind...it isn't like that. It's very mellow but it's still fun",
  "To summarily describe the effects its like a caffeine buzz (without the jitters and the tense feeling) and mild cannabis buzz(not full-blown 'stoned') mixed together...alert but relaxed and added with a very mild hallucinogenic effect.",
  "Next time I think I will up the dose a bit for more intensity!"
 ],
 "erowid": {
  "id": "11243",
  "citation": " Herbguy. \"Mildly Euphoric: experience with Kava (ID 11243)\". Erowid.org. Jun 25, 2007. erowid.org/exp/11243",
  "substance": "Kava",
  "views": "34359"
 }
}
