{
 "title": "The Song Reaches a Crescendo",
 "author": "Okkoto",
 "citation": " Okkoto. \"The Song Reaches a Crescendo: experience with Mushrooms - P. cubensis, Cannabis & Alcohol - Beer (ID 55620)\". Erowid.org. Oct 7, 2007. erowid.org/exp/55620",
 "substance": "Mushrooms - P. cubensis, Cannabis & Alcohol - Beer",
 "bodyweight": "180 lb",
 "report": "<p>2/22/04</p><p>Mushrooms always have a way of suprising me. I can never predict/expect what will happen, and yet they are always beneficial, always exactly what I need. Even the trip prior to this time, which by many accounts was a 'bad' one, was not without its revelations.</p><p>My girlfriend (Nabuca) and I decided to take some mushrooms at her college and hang out in her dorm room. We took them around 2:30pm. We didn't take too much, less than half an 1/8th each, just enough to cover the surface of a hamburger bun. We then headed outside. We first took a walk to the deli so I could pick up some cigarettes. My motor functions decreased by the time we got there. I fumbled for my i.d. when the clerk actually carded me (I'm 22). I got a bottle of water as well and headed off to the art gallery on campus. They were housing a surrealist exhibition until the middle of March. What could be better right? While in the gallery I got the distinct and unpleasant feeling of 'coming up'. Kinda woozie and disoriented. No real pupil dilation, no trails, no melting of objects, no nothing. So just kept waiting and enjoying the art. We walked back to the dorm room as I had a cigarette.</p><p>We sat around for a while and decided we would go out again later as the sun set. We listened to some music and I felt kinda disappointed that the coming up feeling was still present. I wanted to stop getting there and arrive. I decided it was time to smoke pot. It was now close to two hours after we had eaten. I remembered my first time on mushrooms: I waited an hour and nothing really happened. I smoked a joint after that and it was as if pot dropped me of in mushroom land, stuck around for an hour or so and then left me there. It was helpful yet at the same time it was two different things going on at once. This time it turned out to be much more symbiotic.</p><p>I thought to myself, 'Oh well, no trip this time, I guess I'll just get as stoned as possible.' I sat down at the desk that faces the westward window and did just that as the sun hung low in the sky. I decided to throw on some music too. Godspeed you black emeperor's 'storm' was my choice. Suddenly I looked up and things were different. Birds were flying in to view of the window heading towards the sun. A non stop line of birds sailing overhead gracefully toward the west, going perfectly with the soft slow notes of the beginning of the song. I had arrived. I was enjoying this scene very much but Nabuca wanted to go outside and not hang around a weed-stinky room in case some security guard was making rounds.</p><p>We just started walking around campus in no particular direction. Walking over the grass I closed my eyes for a split second and felt as if I was 20 feet tall. Tripping had definately begun. But it was strange. I looked at Nabuca and her pupils were not dilated at all, and nothing around me seemed out of the ordinary. It was all in my head and thoughts, nothing about my body felt weird and no open eyed visuals were present. I decided it was the pot more than the shrooms but it definately was not just pot. We walked around campus and Nabuca took me to a part that I had never been to before and it was actually really beautiful. Few things are cooler than seeing a new place for the first time while I am high. By this time it had gotten a lot colder than before. It was bothering Nabuca and despite my wanderlust I decided to turn back. We walked up to the 5th floor once again and it felt like we were walking upstairs for eternity. I felt really good and was enjoying every second. We got to the room and I had a seat in front of the west window again while Nabuca took out her pastels and sat on the floor.</p><p>I decided to continue the Godspeed song from where we left off and it was incredible. Watching the sun set and night fall all while the song came to it's beautiful crescendo. Non stop strange thoughts as mushroom consciousness really took over. I let go. I said hello to mushrooms. I said 'I don't want my ego anymore. Take over mushroom' and they did. They echoed thoughts from a great revelation on pot that I had at a radiohead concert, about how electricty is god and our strange relationship with electricty. I thought about this again and how humankind and plantkind and god (electricity) have come together to create machine (specifically computer). I felt great optimisim. The possibility of living under a never ending sky, free of brand names and corporate sponsership. The horizon burning orange pink red, the song building, such immense beauty. Mushroom take control.</p><p>Stop thinking and start being. Terrence Mckennas word's in my head 'Language ceases to function and have relevance' and so it did. Connection. Inexplicable. Images, ancient symbols. Eyes welling with tears. The desire to just be safe. The response that I was safe. The song reaches crescendo. Images of non stop growth, palms, trees, ferns, cacti, aloe-type plants, growing and growing and growing. 'There are no endings only beginings' said mushroom. I could hear every single second of every note being played. And as the song died down so did the trip and I felt more and more relaxed. I looked to the sky and saw the fresh crescent moon and was overjoyed that she decided to join me.</p><p>I started talking to Nabuca again and we just had long conversations about different things. The reoccuring question of the trip was 'Lazy or profound?' We decided to walk to the deli and get some beer. On the way we decided to check out this cool bar in the area that we've been meaning to go to. I got some kick ass nachos and a couple of coronas and felt damn fine. More discussions and eventually returning to the dorm for sleep.</p><p>Amazing. I look forward to the next time.</p>",
 "year": "2004",
 "id": "55620",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-07T07:00:00.000Z",
 "views": "3234",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
