{
 "title": "Bad Trip On A Broken Heart",
 "author": "Sugar",
 "citation": " Sugar. \"Bad Trip On A Broken Heart: experience with Mushrooms (ID 5565)\". Erowid.org. Jan 16, 2002. erowid.org/exp/5565",
 "substance": "Mushrooms",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "report": "<p>You should really know the background of my state of mind to understand the physically and emotionally draining trip that I went through. My boyfriend was living in another town and making it quite clear that his other friends were his top priority at the time. I was missing him and the fun we used to have together. I was at school, getting prepared for another boring weekend (as usual) when I heard that 'shrooms were coming into town. I had done 'shrooms several times before, and love the trip, so I decided, 'This will liven up the weekend....' I talked to a friend after school and bought about three grams.</p><p>I decided that I would spend the trip at home, watching some trippy movies. I went to the video store, and en-route I munched on the shrooms. I rented Bram Stroker's Dracula and then drove around and smoked a bowl before going home. When I got there the coming up time was actually kind of pleasant. There was no really big time visuals or even light changes throughout the course of the trip, although, I watched Dracula and tripped out on some of the visuals in the movie, not knowing if they were really there or if I was hallucinating them.</p><p>When the movie was over, I turned on the blacklight, lit some incense, and put in Smashing Pumpkins' latest disk (great tripping material, I might add) and kicked back for a relaxing trip. But then, as I often do when I'm tripping, I started thinking. Only, most of the time my thoughts take me on far away voyages, expanding the horizons of my mind, but this time they were making me terribly uncomfortable and sad. I was thinking about my boyfriend, and how much I missed him. I started thinking how life would never be the same without him, etc....etc.... (You know, totally radical, extreme tripping ideas.) I started looking at all his pictures and reading every letter he had ever written me. I started crying uncontrollably. The music sounded like rain, and I felt as if life was raining down upon me and I cried and cried and cried. I then heard a knock at the door. Having no idea who it could be I took some time to try and compose myself. The music seemed to be blaring and I was trying to wipe my eyes and make myself presentable. By the time I answered the door there was no one there, and that really scared me. The knocking had seemed so loud.</p><p>I was almost terrified, and I started crying uncontrollably again. I thought, 'The only way to end this is to go lay down and sleep it off.' I took off my clothes, slipped under the covers, and tried to drift off to sleep just so the trip would stop. It may seem kind of strange, but I actually had some really light, yet cool, closed eye visuals during this time. I guess I eventually fell to sleep, and woke up the next morning feeling relieved, yet still a little depressed. I came to find out that it was my boyfriend who had been knocking at the door, but I must have taken more time than I realized to answer it, because he had decided to leave, even though he thought that my music was a little too loud for me to be asleep. I was really grateful that he didn't see me like that, because, although we smoked bud and tripped out together all the time, he was kind of protective about me tripping when he's away. He always wants to make sure that there's someone there to take care of me.</p><p>Anyways...I have 'shroomed several more times after this bad experience, and they have been some of the best trips. It was just the wrong time, I was sick, sad, and lonely. I don't let one bad trip ruin 'shrooming for me. There is life after a bad trip.</p>",
 "year": "2000",
 "id": "5565",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-01-16T08:00:00.000Z",
 "views": "11633"
}
