{
 "id": 5568,
 "title": "A Serene and Expansive Plateau",
 "date": {
  "submission": "2004-04-22T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "nowhereman",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(capsule)"
  },
  {
   "time": " T+ 4:30",
   "amount": "12.5 mg",
   "administration": "IM",
   "substance": "DPT",
   "form": "(liquid)"
  },
  {
   "time": " T+ 4:40",
   "amount": "12.5 mg",
   "administration": "IM",
   "substance": "DPT",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>I take no meds, I have no pathological mental problems... Around 10 A.M. I get out of bed in a hurry and swallow the 50 mg capsule of AMT first thing.  By 11:30 the speedy anxiety has set in and I decide I better go rent a video while its still not too difficult.  It ends up being difficult anyway; I cant remember exactly why I thought I could find something decent to watch while tripping while tripping. The titles are sliding around like their floating on liquid, so Im having fun regardless.  I end up with The Borne Identity of all damn things; its not a bad movie per se just not the kind of thing you think to watch while on drugs.  So, having cut my losses, I return home through the typical suburban nightmare that is my hometown to my parents empty house (they are out of town and Im staying there while away from campus for the weekend). N, who has taken 50 mg of AMT at 10 A.M. as well, comes over around 12:30 feeling it just as I am.  My plan is to inject 25 mg of DPT sometime during the peak; N sadly, elects not to do any DPT. ",
  "I have only ever injected DPT intramuscularly; it is by far the most efficient way to use it so long as I want it to last over an hour, plus Ive heard it to be the best, one just needs to get over the baseless (if done responsibly) stigma of injection.  DPT seems to me like it would be the perfect complement to AMT, and I find that the author of A Special Synergy agrees.  The combo ended up far exceeding even my high expectations.  At 2:30P.M., I drop.      ",
  "With shaking hands I empty half the syringe into my upper thigh. After 10 minutes I am satisfied the combo isnt going to melt my brain so I finish the rest and lay back and try to relax as I slip into the DPT fever dream.  I possess, I think, a proclivity for becoming uncoiled during the acceleration of the onset.  I feel like of deck of cards being shuffled, my many faces and values flexing and sliding over one another in preparation for doling out by some dealers indeterminate hand for an indeterminate hand amongst the amassed silvered-masked players in my inner entourage; veiled identities, reflected infinitely in warped mirrors.  Lithely creeping, my selves part company; now superimposed and fading fast, like tigers wandering into grass, they retreat between heartbeats, their steps swallowed and muted in the entwined depths of the undergrowth.",
  "After about 15 minutes the trip levels out onto a serene and expansive plateau.  There could be no more perfect weather for a walk, 70 degrees with a light breeze, the sun, and the height of autumn color.  I leave the house with N and a burgeoning sense of sublime peace and certainty; a feeling unlike any psychedelic has given me.  We are making our way to a nearby park while I silently reflect on just how different DPT is for me.  With many other psychedelics, I get an almost tactile impression of my perceptual mechanisms grinding askew, meeting resistance, of my perceptual programs buzzing in error.  With DPT it is as if the world itself changes and not merely some program, there is a richness and vitality to the experience that is complete in a way I cant imagine my mind to contain.  And now, the AMT is channeling that vitality in an entirely ecstatic direction.",
  "As we walk, sunlight and warm winds curl round our skins, giving the shimmer of white-amber silk.  I can feel tiny currents of air slithering between the fine hairs of my arms.  All is lush and yielding, thoughts slide over mind with the soft lambent of mists over marble. ",
  "An Eastern White Pine seen along the way seems to be a symbol for how I feel; its sparse branches leaving it open for the sun to drench its silver-beige skin, the feathered edges of its trumpet shoots fading into the endless blue brilliance of the October sky.  Synesthesia is pronounced, I hear from the foliage, in lone leaves sheathing and unsheathing from their clusters, and from the grass, in the crossing of blades, the delicate metallic echo of a trillion needles colliding in air.  My saliva possesses a saccharine tinge of water and honey that even my muscles seem to taste.",
  "The rows of houses give way to a small open park and a widening purview.  This new openness reveals the grandeur of the sky, deepens the profundity, and heightens the ecstasy.  There is a sense of a great expansion of space, of thinning walls that",
  "dam(n) the infinite, a translucence infused with indelible pith; and of my veins, pulsing with ichor, my heart its fecund spring. ",
  "Its like a Koala Bear crapped a rainbow in my brain!",
  "We pass the park and continue towards the larger park that is our destination.  Nearing it, I spot its vivid shifting colors; so burning bright I will see them on the backs of my eyelids as I coast toward sleep.  We float over the street that crosses our path. ",
  "Finally we reach the entrance and the park is thankfully largely deserted.  The shade of the forest provides relief I didnt know I desired, I respond with comfort and awe.  Leaves are raining down all around us cutting spiraled trails in warm reds and yellows, some fall through intermittent columns of churning light let through the canopy by the parting breeze, they form white-blue arcs that slip from existence like lesions carved in water.  On the path the walk is effortless, each stride sails by spiders silk, and on the autumn wind the forest aspirates subtle metaphors: soft-edged laconics, slip-swirling like spruce-smoke from the frozen lips of a deity, a gently rolling timbre that drifts the spiraled channels of my auricle divining numinal futures from the quiet sway of the trees. ",
  "We come across a park bench and I sit down to listen to my Discman. I play the theme from Tarkovskys Stalker by Edward Artemeiv and its the perfect track for the moment.  The harmonies of the music are deep, rich, and accompanied by velveteen visions of evolving ethereal patterns: grand violet plumes drown into an evermore-immense sky with great and fearless beauty.  I suspect that the AMT/DPT combo activated new higher perceptual depth tiers (hypothetically speaking tier 1 could be the sense of distance in threading a needle, tier 2 in reading a book, with the highest tiers reserved for that sense of peering into the infinite), allowing for the profound sense of space I felt throughout the trip.",
  "Returning to the house approximately an hour and a half after injection, I lie on the couch and bury my head into a pillow, so much glowing pleasure.  I laugh for a few minutes straight with willful abandon; Ive never felt so sure of the world and the possibility of paradise.  Is this real? It is the most real day Ive ever experienced, its like a series of transcendent moments have been drawn to this time, laced together by artfully braided strings of life-affirming poetry.  I find I can entertain negative thoughts if I choose to, but they are absurd and evaporate into laughter, I thought only pain had such weight.",
  "Over the course of the night I inject ~30mg more DPT, prolonging the DPT/AMT comedown for four or five hours.  I get N to try some too (~15mg), but he doesnt have the same reaction I did (doesnt say much at all), maybe it was too late along in his AMT trip or just simply different brain chemistry as DPT is special for me (most of the DPT reports I've seen do not reflect my experiences with it).  As always with AMT sleep took awhile, I kept seeing those images of trees I mentioned earlier, but it didnt bother me, I was still beaming.  I awoke the next morning with a clear head, bright eyes, and newfound nausea for those who have scheduled AMT, and for all those who would stamp out cognitive freedom for their stagnant order.  Finally, despite what you might expect from my infatuated descriptions of the experience, there was no desire to repeat it in the following days and months because of its lasting impression (it seems the experience is yielding even in its wake); though at some point I would like to return.</p>"
 ],
 "erowid": {
  "id": "32834",
  "citation": " nowhereman. \"A Serene and Expansive Plateau: experience with DPT & AMT (ID 32834)\". Erowid.org. Apr 22, 2004. erowid.org/exp/32834",
  "substance": "DPT & AMT",
  "views": "14562"
 }
}
