{
 "title": "Lilith and the Shadow People",
 "author": "Hyper Jesus",
 "citation": " Hyper Jesus. \"Lilith and the Shadow People: experience with Zolpidem (Ambien) (ID 55689)\". Erowid.org. Jun 25, 2007. erowid.org/exp/55689",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "210 lb",
 "report": "<p>The first time I took Ambien I expected to fall asleep. I did not expect to psychically alter the physical makeup of my ceiling, have a lengthy discussion with a plastic bag, or have my bed turn into a planet inhabited by ants to whom I was a god. Needless to say, I was surprised when all of that happened. After that experience I took Ambien almost every night for a few weeks and tripped hard each time. At the time of the experience I am about to relate, Im sure a good amount of the drug had built up in my system. This may or may not have had an effect.</p><p>Every time before this when I took the drug I was happy to just lie in bed and let it take its course. The trips were always real to me, as in I didnt view them as the effects of a drug. I saw the trips as reality and never thought it strange that the world was so completely different than usual. I would let the experience burn out and then usually fall right to sleep, awaking perfectly sober feeling like a million bucks. This particular experience was different because I walked around out of bed and had brief moments where I knew I was tripping. It was also the last time I was able to trip on Ambien.</p><p>At around 10:00 pm I swallowed two 10mg pills with a glass of water and went to my bed. I lied down, ready for the trip to begin. After maybe ten minutes I decided to throw caution to the wind and swallowed two more pills with a glass of milk. This was more than I had ever done in one night. I ate a few slices of sliced turkey to kill the taste (Ambien has a very bitter taste and dissolves quickly in my mouth into powdery grossness) then got back in bed.</p><p>I was not aware of when the trip began. One second I was lying in bed perfectly sober, the next I was hanging suspended from the edge of an infinitely tall cliff over a gigantic chasm of utter darkness. I was inside a huge sack woven from golden yarn. The sack was being pulled up the side of the cliff slowly by an unseen force, but since the cliff was infinitely tall I knew I would never reach the top. I could see the brown cliff wall through many holes in the sack and I could look down into the darkness beneath me. I was not afraid of the height nor of possibly falling. It was a very pleasant feeling being suspended over nothingness inside a golden bag.</p><p>Then I became aware that a religious figure, Lilith, was in the bag with me. I have great respect for Lilith and the strong feminine nature she represents. I have had dreams before with Lilith involved and so was not surprised to see her with me in the bag. We did not talk, instead she communicated with me telepathically and I spoke to her with a series of guttural coughs. She told me that I could raise the bag or lower it with my mind, so I raised it up and found an entire community of bag-dwellers dangling a few yards above me. I raised the bag to be beside them. There were maybe five or six bags like my own held close together by dew-laden spider webs. I couldnt see the people inside, just their silhouettes. I spoke with them for awhile using the guttural cough language and they spoke to me by inhaling at different rhythms.</p><p>Then the bag went away and I realized it was just my afghan, pulled over my head. I was still lying in bed. Lilith, the bag-dwellers, the cliff, and the dark chasm were all gone. I thought the trip was over so I got up and went to the kitchen. I was thirsty and wanted a soda. Im not sure if this brief moment of reality was due to the ten minutes I spent between doses, but it didnt last long.</p><p>I realized about halfway to the kitchen that I felt really drunk. The room started spinning around and the shapes made by objects in the room started melting into each other. Everything was outlined with rainbows and any lights (digital clock readouts, mainly, since it was night time) left brilliant tracers. It was like taking a low dose of mushrooms, basically, except I didnt think it was strange at all, nor did I find it to be beautiful. It was just perfectly normal.</p><p>Before I got to the kitchen I had to pass a counter where we keep fruit and a few candy jars. I looked at the counter and saw a hundred or so tiny men standing on it all dressed in solid black clothes. They were frantically trying to get the counter to balance itself as it was teetering over a giant fall (the distance between the counter and the floor, for the tiny men, a fatal plunge). Some of the men had already fallen, and some were hanging over the pit, desperately clinging to the edge with their hands. I decided to help the little guys. I pushed the counter away from the pit with all my might, but for some reason my force was reversed and the counter actually bent closer to falling. The room was still spinning around and I kept wobbling on my feet as I pushed at the counter. The little men started yelling at me and cursing me for interfering. I kept pushing the counter but it just kept tilting further towards the fall. I suddenly got the brilliant idea of pulling it, since if pushing it made it fall then pulling it would make it steady out. So, I pulled the counter towards me with all my might and it fell straight down to the floor. All the little men disappeared.</p><p>I then noticed a shadow on the wall was watching me. It looked like a tall man in a large trench coats shadow. I got a strong feeling of paranoia when I saw the Shadowman. I thought he was there to steal my memories. I saw that he had Lilith in his clutches and was pulling her into the wall. I jumped at him to attack him and save Lilith but they vanished into the wall before I could grab them.</p><p>I ran into the kitchen and looked out a window (the next day I realized the window was actually a stained glass ornament hung on the wall) to see Shadowman speed off into the night in an old car. I tried to phase change into a gas to pass through the window but it didnt work. I felt angry and sad that Lilith had been kidnapped.</p><p>I felt a strong need to urinate, so I went to the bathroom. On the way there a womans face appeared out of the wall. The best way to describe her is the Anti-Lilith, or the embodiment of everything Lilith was not. I thought she was ridiculously evil, and I made an angry face at her and yelled at her to go away. She laughed at me and disappeared.</p><p>I dont remember entirely what occurred in the bathroom but I know I spoke to my reflection for a good deal of time on many different, interesting subjects. I think I remember seeing an owl flying around the bathroom ceiling.</p><p>I went back out into the hall and saw Shadowman standing by the door. He vanished immediately. I remembered I had some cigarettes in my car and went out to the apartment parking lot to get them. Before I ventured outside I made absolutely sure I was sober (I wasnt at all) so that no one would suspect anything. This was the second time I had some idea that the experience was not real. I took a flashlight and my car keys. It was easy to find them on a cluttered table.</p><p>I got the cigarettes out of my car. Electric blue manta rays were swimming around my feet as I walked back to the apartment. I tried to find my lighter on the same table I got the flashlight and keys from but this time it was nearly impossible. The entire room was tilting in the opposite direction every time I bent my body at all. Since I was bending over a table and moving around it looking for a tiny lighter, the room was spinning out of control. I finally found the lighter amongst the strange objects littering the table and went outside. I smoked a couple cigarettes while the manta rays swam around. I saw some shadow children standing by a car and shined the flashlight at them. They disappeared into smoke.</p><p>I came back inside feeling sober again and decided to write in my online journal. As I typed I couldnt understand why the letters were able to stay at the top of the page. Why didnt they fall down to the bottom and break? I saw a cars headlights coming through the Venetian blinds, cut into slivers of light, turn into an invading army of barbarians and for a moment I left my body and served as their general before dropping back into myself. In the time spent writing in my journal I had a few of these out of body experiences where I became part of one of my own hallucinations. After a time, I noticed a shadow crawling up my back and looking over my shoulder. It was Lilith, turned into a shadow person, reading what I was writing.</p><p>Here is the unedited entry from my journal that night:\rMy head is fuctioning a lttle below standard right now, /ex, /at thie time, I am wondering whu threr letters don't just fall off the top of the scree. Thimgd kaap changing and monig, Anbieb is q sweetneqqr,,, i keep hearib cakcho nusixm ,plus earklier 'i was suposed t o be a warlord for the dark anues if satan, thrb 'i was otummels diggigng htind. trippired otu likt shit., I saw the shadows cur ving around thr brightylyu lit sportdsaranea but ut was realls hjust a curtain and a gchair. Soneobejustrtold ne to get a cxhuairkrusty the clown comes onto tstage. the stage of my thughst this is a forgotteb bnothuingess befroe it ecvenbeca,e whole. Aduiss5+0n</p><p>Soon after writing that I fell asleep. I woke up in the morning feeling completely sober and like I had just had the best sleep of my life.</p><p>After that experience, every time I took Ambien I almost immediately passed out. I have not since been able to trip on Ambien. I really miss its effects. For awhile there, Ambien was most definitely my favorite drug.</p>",
 "year": "2005",
 "id": "55689",
 "gender": "Male",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "45783",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:10",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 }
}
