{
 "title": "Night of Hell",
 "author": "rocknroll17",
 "citation": " rocknroll17. \"Night of Hell: experience with Lorazapam, Cannabis & Antibiotics (Cipro) (ID 55710)\". Erowid.org. Nov 22, 2006. erowid.org/exp/55710",
 "substance": "Lorazapam, Cannabis & Antibiotics (Cipro)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1.0 mg",
   "oral",
   "Pharms - Lorazepam",
   "(pill / tablet)",
   "",
   "1 hit",
   "oral",
   "Cannabis",
   ""
  ]
 ],
 "report": "<p>I have smoked marijauna for about a year and a half now and have had  mostly positive expieriences it. Recently I had fallen in love with the drug, smoking every day, sometimes several times a day, especially since it was summer vacation. It made me extremly happy and I was at the point when I could handle any situtaion while high. It was bliss.</p><p>About two weeks ago I became very sick and as a result, very depressed because I didn't know what was wrong with me. I started having anxiety attacks because I was so tired of being sick and just wanted it to end, and wanted to get back to my life. So my mom started giving me a lorazapam (1 mg) whenever I would start having anxiety. It worked very well and totally calmed me down. Because I was sick I had stopped smoking pot because it wasn't enjoyable since I felt so bad.</p><p>Then one night after starting antibiotics (Cipro) I started feeling much better so I decided it was time to get high again. I had taken a lorazapam about two hours before and felt good, no stress whatever. I went to bed and took a single large hit of mary jane, blowing it out my window. Since I had quit for a while my tolerance had gone way down, considering it was always low anyway (back in the day one hit would get me stoned for hours). After taking the hit I started to feel really happy and relaxed. Then about ten minutes later I realized I was slipping into a bad trip. I tried to bring myself out of it but I couldn't. It was the worst  feeling immaginable, like I went to hell, only worse. I felt extremely miserable and depressed, and was very tense, full of anxiety. I started shaking and was very cold, and started breathing very fast. I was so scared all I wanted was to wake my mom up and have her comfort me, but I knew that she would be dissapointed and I didn't want her to know about my pot habits, and I certaintly didn't want her to find out this way. So I just lay there, wanting to die on the verge of tears for two hours. Finally I started to come down and fell asleep, and had the worst nightmares imaginable. It was like a sick horror movie in my mind.</p><p>I woke up at 4 A.M. feeling very depressed and scared, and full of guilt for getting high. I tried to fall back asleep but couldn't, so lay in bed tossing and turning and feeling terrible all night until I had to get up for the school the next morning. My mom said i looked terrible so I told her I didn't sleep well,and felt more guilty than ever for not telling her the whole story. In school I didn't want to talk to anyone because I was feeling so anti social. When I got to my first class I started to feel like I was going insane, like  I was loosing control and started to panic. I had so much anxiety. I felt like I needed to run out of the classroom and cry. I thought I was going to end up in and insane asylum. Then after about an hour of sitting there I finally started to feel better. Shortly after I was fine.</p><p>When I got home that day I just wanted to take a nap so I took a small hit of pot to help me fall asleep. I thought it would be fine because I was not on lorazapam, but shortly after the same feeling hit me again.  Not nearly as intense, but enough to ruin my high. Now I feel afraid to get high, which makes me upset because it was my favorite thing to do. All of my friends smoke weed and many of our activities revolve around weed. I hardly ever drink and have quit cigarettes. Moral of the story, be very careful when mixing drugs. Cannabis is bliss until that one fatal trip.</p>",
 "year": "2006",
 "id": "55710",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-11-22T08:00:00.000Z",
 "views": "10140"
}
