{
 "title": "Experiences and Unguided Telepathy",
 "author": "Tantric",
 "citation": " Tantric. \"Experiences and Unguided Telepathy: experience with Dizocilpine (ID 55729)\". Erowid.org. Sep 1, 2006. erowid.org/exp/55729",
 "substance": "Dizocilpine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " repeated",
   "IM",
   "Dizocilpine"
  ]
 ],
 "report": "<p>The first shot of 50g IM had little effect, some tinnitus. I lay down and experienced a definite slowing of the heart, part of K-programming. Some slow strobing OEV visual effects and also CEV, onset in about 25min. Got aroused and took care of it.. ,-) Orgasm is prolonged, unlike DXM which is counterorgastic. Ate some stuff afterwards.. Time dilation, visually like a heavy DXM trip. All effects seemed to be non-existant after about an hour and a half, took some Ambien and went to sleep.</p><p>On the second try I IM'ed 100g. This is still not developing into much. I thought of injecting another 100g and so I did. 'Okay, that's enough for the next four hours or so..' For the most part it just seems very hypnotic - I'm swaying with the music, feeling very light weighted. Typing is difficult. I believe I could stare at the sky and not see the clouds. Will keep you all posted..</p><p>Mk-801 is VERY wicked.. I could only describe this as the 'evil zombie effect' - my body keeps going but the brain isn't there. There are some 'holes' in my memory in the last 24hrs.. I woke up after almost no sleep and went shopping, wrote a list on my hand and now I can't read it, just nonsense.. I later did a 400g dose (IM'ed)- did it do anything..? Or do I just not remember anything from it? I watched a dvd, and couldn't remember if I've ever seen it before. I do NOT like this experience. It's creepy, like jacob's ladder creepy.. I'm looking at the liquid and am seriously considering pouring it out.. I mean, the initial effect was somewhat euphoric, but people with lobotomies are often happy as well.</p><p>Here's a bit I didn't get to mention. When trying to sleep, the ear-ringing became particularly annoying. Unlike other such experiences, it's not 'random', so it was impossible to tune out. In fact, when I focus on it, there are voices. I've had this type of experience before, but the mk-801 version is quite different. For one, the voices have accents, tones and patterns that are clearly not mine.. They all seem to be in English, but then again, I'm tuning out what I don't understand, so I'm not sure what that's worth. Furthermore, the different voices seem to talk about different things, yet all of them are mostly meaningless. Some resemble radio like commentary, some are just repetitive mindless subvocalizations, like people talking to themselves. At one point, the sounds seemed to have some visual component to them, but it was very fuzzy and indistinct, more like an idea than a picture.</p><p>Let me add that this was 100% dysphoric. On the other hand, when I've had this type of experience before on other drugs, the voices were all male and accentless. I actually associate the 'radio in the head' bit with LSD and I never considered it anything but a hallucination - when I've had too much and I want it to stop, in my bedroom in the dark, etc.. This, however, seemed VERY MUCH like telepathy. The ketamine telepathy experience is totally different - it's like being in love so much I just think the same things. The mk-801 is like having a television going in the next room without visuals, so the dialogue doesn't make sense.</p><p>I have pet mice which I communicate with in Ketamine trips - I can at times switch into mouse point-of-view, feel the mouse's mind, and urge my little friend to do this or to do that, and watch it happen.. There is a very strong feeling of love with this - the mouse is my friend, I protect her, love her and vice versa (her name is Flora :-)). Somehow Ketamine increases our bond. DXM psychic experiences however, are always VERY weird and surreal. The only quasi-telepathic experience I've really had, had to do with information transfer between two people both on low doses. I was trying to teach a friend chemistry, and the info was just flooding from mind to mind, like the rest of the world was not there.</p><p>In a few hours' time, he grokked a huge amount of chemistry, that had taken me months to learn. It was odd and overwhelming, but GOOD - there's no way this could happen with a stranger. The mk-801 was like a horror novel phone call from hell.. It was MUCH more distinct and powerful than the pseudo-psi effects of K or DXM, but it was also very WRONG. Ever had the phone ringing and you pick it up and there's no one there, but you listen and listen and there's this whispering and then you slam down the phone.? - Well, imagine that was a radio in your room you couldn't turn it off or get away from. That's what it was like.</p><p>In any case, I'd like to say that mk-801 is definitely NOT recreational.</p><p>There is memory impairment, and significant mental impairment, kinda like valium - it just makes me 'dumb'. For the most part, it seems to be a VERY powerful psi amplifier with almost no recreational value. Also, even the tiniest amount of mk-801 doesn't dissolve very well - there is still visible particulate matter, which might be dust or might be not.. It was dissolved using distilled water, there shouldn't be any impurities, but there are. </p><p>I'm done with this compound.. I did try a 200g sublingual dose, but all I really did was zone out and stare, with a strange heavy feeling in the chest. I'm writing this report under the effect (forgive me for being scatterbrained), but this time I'm aware of the mental impairment and being more careful about typos, at least I hope. I plan on taking ambien to sleep - there is evidence that benzo's reduce the NAN effect.</p><p>The whole purpose of this was that I can't really afford ketamine.. With mk-801 (+), maybe 1mg costs the same as 200mg of Ketamine. I had hoped that maybe 500ug would be an experience, but I'm just not going to go there. Geez, my head is still ringing, weird not rightness!</p>",
 "year": "2004",
 "id": "55729",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2006-09-01T07:00:00.000Z",
 "views": "16129",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "IM",
   "substance": "Dizocilpine"
  }
 ]
}
