{
 "title": "Why I'll Never Take LSD Again",
 "author": "dutchmaster",
 "citation": " dutchmaster. \"Why I'll Never Take LSD Again: experience with LSD (ID 5573)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5573",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "report": "<p>One night I hooked up with some friends to head to a rave.  We had been bored as can be, eating acid all long.  We kept dosing all the way to the party, finally got there and it fucking sucked.  There were like 50 people there, and the music was horrible.  After about an hour of that non-sense in the condition we were in, we decided to leave.  So were chilling in my old mini-van in the parking lot trying to decide what the hell we're gonna do witht he rest of our evening, I had the door open so to let a breeze in.  Before I know it some schmuck in plainclothes and a funny hat comes up to the open door and starts shining his damn flashlight around, asking why we diddn't stay at the party longer.  Needles to say my dumb ass had a small amount of pot in a baggie in the door cubby-hole type thing, that of course, he spotted.  Before I knew it he had drug me ass out the car and was telling me I'd better fess up to anything else I had before he started slashing seats. </p><p>I remained calm, until he asked if that was my satchel in the car (which incedentally had a few hits of LSD on sugar cubes within) once he asked if it was mine, I simply said 'I have the right to remain silent, right?' boom I was in the cruiser.  They found the remainder of the 'vial' that we had been feeding on all day, and I was off to central booking.  Oddly enough, with my permission, they let my friends drive my car home once they were thouroughly searched.  The entire time while booking me in, redneck cops were telling me how I was going to be fucked in the ass for the rest of my days and making other lewd jokes about me being a homo-sexual raver who was going to spend the rest of his life in prison being being raped.  Finally they threw me in a temporary cell with a few other party kids who had fallen into similar situations that evening. I couldn't eat my meals and was in all around shitty times for the next three days, until I got bailed out.  Turns out these idiot cops had left a whole 'nother hundred doses and a bag of my friends pot undiscovered in my automobile. </p><p>I ended up going to court, got off with a fifth degree felony, and am on probation to this day.  Shot the hopes I had of doing a gap year in Switzerland, and now I am stuck in shitty, miserable, small town, USA, just for one night's worth of fuck ups.  In the eternal words of Homer Simpson 'Do-oh!'</p>",
 "year": "2001",
 "id": "5573",
 "gender": "Male",
 "timestamp": "2002-01-18T08:00:00.000Z",
 "views": "16028",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ]
}
