{
 "id": 5575,
 "title": "Horrors Through a Friend's Eyes",
 "date": {
  "submission": "2007-01-16T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SpiritualJourneyer",
  "gender": "Male",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "plant material"
  }
 ],
 "report": [
  "I am writing this as an experience I have had from the outside.  My friend, let's call him Bill, and I had long been interested in exploring the limits of our minds and continuing our journey of the spirit.  Our friend, let's call him John, heard us speaking of the event and wished to be part of it.  We allowed him, assuming he would approach the experience the same way Bill and I had: with respect for the plant, universe, and doing the substance with no fears, only love.  Here is the experience.",
  "Bill and I had purchased a smoking blend that was called Aztec Gold  (which is basically a bunch of inert plants).  It said that it was a salvia enhanced smoke.  The man at the apothecary said the portion of the blend was minute enough that we would only reach S on the 'SALVIA' scale.  I took the bag of blend home, rolled the joints, and waited for the right time to use it.  On a Friday night, John and I went to Bill's house up in the mountains, for Bill and I were nature people and wanted to use the Salvia in a natural setting.  At around midnight, we took our warm clothes, some blankets, and the cigarettes of Aztec Gold down to an overgrown parking lot.  We lay down the blankets on the ground for  soft place to lay.  We then 'warmed-up', meaning that we did our own various things to tap into the Om.",
  "I was the first to feel ready, so while they were quiet, I smoked the first joint.  I didn't feel a great deal after some meditation, so I smoked another.  I ran the course of my experience, which was highly interesting, but not very deep.  My friend Bill then took his turn, and had a basically equivalent experience to mine.  Then came John's turn.  Bill and I determined that he was ready, gave him 1 (one) small joint, and let him be.  He smoked it, sat down immediately, and Bill and I went about our business.  We could notice some heightened senses and paranoia as a result of the smoke, but not much else.  We waited for John to run the course of his trip.",
  "After what seemed to be much longer than what Bill or I had done, we became slightly worried.  We knew the stuff wasn't strong enough for anything that would take that long, so we went to check in on him.  At this point, he began to tell us to leave in a really jittery voice.  Since we could tell that all was not well and that we had agreed to help each other if it looked like the other was scared, we began to comfort him.  I told him to lie down, which he responded to fairly well, but started his sporadic breathing.  I layed next to him, with my head near his, my hand on his chest.  I told him to breathe with me, which he would start to do, but then flip out after a few seconds.",
  "Bill asked him what he could see, and all he seemed to answer was darkness.  Delving to see how bad the problem was, I asked if he knew who we were.  He was able to tell us our names, but could not identify if we were friends or foes, which was startling since I am his best friend.  Feeling scared, he began to shake and shiver, and I had Bill pull the blanket up on him.  He seemed to take well to it.",
  "At this point, I began to try to soothe him.  I told him that he was in his room, I told him to describe what he could, which was very little.  I described it well enough to him that he began to believe that he was in his room, or so he said.  After this, I thought it would suffice for him to just breathe with me, but he suddenly shook, and tried to get up, in a manner that I was fearful he would injure himself.  I gently kept him down, and told him whatever he could see would have to get through me first to hurt him, which Bill seconded.",
  "John, half-yelling, told us not to, and told us to spare ourselves.  Being as gentle as I was able, I had him breathe with us again.  He slowly cooled down, as his trip was coming to a close.  Still highly agitated, I told him that everything was going to be ok after I counted back from ten.  I placed my hand on his chest, and began to repeat it over and over again, 'everything is ok'.  He visibly relaxed, and I moved on to repeating 'you''re going to sleep' and then moved on to 'you're asleep'.  He quickly fell asleep, and all this while,I felt a negative energy flow through him and into my body, specifically my legs.  And this was the end of it.",
  "After John came back to us, he could not remember a thing, only a deep-seated, almost instinctual fear of darkness.  Bill and I talked about this, and realized that it was much more traumatic for the two of us than for him.  And we learned something important: if you're not in touch with yourself, you may well find that a slight change can throw you off.  Half of a dose that gave Bill and me an 'S' experience gave him what we surmised was a combination of 'I' and the second 'A'."
 ],
 "erowid": {
  "id": "32858",
  "citation": " SpiritualJourneyer. \"Horrors Through a Friend's Eyes: experience with Salvia divinorum (blend) (ID 32858)\". Erowid.org. Jan 16, 2007. erowid.org/exp/32858",
  "substance": "Salvia divinorum (blend)",
  "views": "5775"
 }
}
