{
 "title": "Not Worth Going Back To",
 "author": "walking revolution",
 "citation": " walking revolution. \"Not Worth Going Back To: experience with Cocaine (ID 55798)\". Erowid.org. Jan 25, 2009. erowid.org/exp/55798",
 "substance": "Cocaine",
 "bodyweight": "220 lb",
 "report": "<p>It was a very dull and boring saturday night. Me laying on my pillows in my room reading a book. When the phone rings. I answer. Its one my friends and hes waiting in the parking lot outside my house. I figured id be polite and go outside to see him. Even though I didint want to hang out with this particular friend at the time.</p><p>We sit in his truck listening to music. As he is smoking cigarettes and Im refraining for the moment as I am trying to quit. Hours go by. Boredom starts to take its toll. I try and go back into my house but Im called a bitch so I decide to stay......(peer pressure is real). We start talkin and somehow cocaine becomes the topic. And one thing leads to another and boom we have a gram of cocaine and me out alot of money. Two people quickly turns to three when cocaine comes around. We split the gram up and snort what we have. I feel great for about 40 minutes and then start to feel immensely guilty and also the feelings of a coke crash arent helping either.</p><p>I swore myself away from that white devil. But she found her way back somehow. The guilt is so immense Ive fallen into a deep depression....Im still feeling depressed two days later.</p><p>They say relapse occurs on the way to recovery...I went 8 months cold turkey and then this happened....my thoughts are what lead to this.....I started telling myself that it be ok just for a little bit. But it wasnt.....even just for about a half hour</p><p>Cocaine is not cool.</p><p>And is very bad for me.</p><p>Simple as that.</p>",
 "year": "2006",
 "id": "55798",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-01-25T08:00:00.000Z",
 "views": "3746",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.33 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
