{
 "title": "My Last Time with Giraffes",
 "author": "Meghan",
 "citation": " Meghan. \"My Last Time with Giraffes: experience with Datura (ID 55804)\". Erowid.org. Jun 15, 2007. erowid.org/exp/55804",
 "substance": "Datura",
 "bodyweight": "130 lb",
 "report": "<p>The first time I ever took datura, and my only time, was July of 2006. I remember being in the car with my friend her boyfriend and his 2 friends, her boyfriend opened the pod for her and the boy Money opened mine so I could get my seeds out me and her both downed the slimy seeds, and I asked to be driven home just incase the experience would be worse then I was wanting, which it was.</p><p>I remember I was sitting on the computer for an hour but to me only felt like 5 minutes, I tried to go to bed but would wake up in sweats flipping my head twitching after every 3 seconds of laying there, I went into the bathroom and wouldn't stop peeing. I started to crawl on all fours like a dog in a circle continuously for this was the only thing calming me down.</p><p>Then I went back to my bedroom but on the way I fell in the hallway and slammed into my moms bedroom door. My aunt and mom came running out of there rooms asking me what I was on. My aunt yelled at me to lie in bed but instead I got on top and crawled on all fours again, and my mom was worried I had already overdosed, so they decided to drive me to the hospital, but at some point my mom said I went back into the bathroom and my pants were to my ankles and blood was all over my legs because I was on my period</p><p>They said I would stand on the front lawn looking at the headlights saying ooo look at the pretty lights. They drove me to the hospital. I went to the hospital, and they said I was grabbing up the doctors legs, and I swore I dropped something behind the nurses station. I was restrained to the bed, trying to rip out my IV. They had been trying to make me drink charcoal to pump my stomach but I kept spilling it all over myself, so they winded up pumping my stomach twice by putting the tubes down both my nostrils.</p><p>I remember I hated the one nurse and continuously kept trying to punch her in the mouth. My aunt and mom would ask me what I took and I would say where is my cigarettes. I asked my aunt for crack and cocaine for a friend but I dont do that and neither does she. When my mom came, I remember talking to her, and she said something to me, and I thought she was a friend so I would keep blurting out, You sound just like my mother. I thought Chuckie was after me. I saw dead animals piled on top of each other in a corner. I kept thinking I was smoking a cig, then it would disappear. I thought my mom was talking to me through an AIM box, I thought there were twins in my room, snakes, bug, and DR. Seuss looking clocks. I kept jumping out of bed, and security came and asked me to get back in and I would be like, What are you doing in my room? Get out before I punch you in the face!. I kept asking why my grandmother had re arranged her bedroom.</p><p>Hours later, my mom finally got it out of me what I had took, and no one knew what it was so they were all researching it, my heart almost exploded my heart rate was 150, so I got sent to children's hospital. where I kept thinking giraffes were in the lobby and rap music was playing. I tripped out for 2 days, and all I know is I will never do that again. I'm still afraid to go to bed at night thinking my heart will stop, and Im always feeling my chest for a heart beat.</p>",
 "year": "2006",
 "id": "55804",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-06-15T07:00:00.000Z",
 "views": "6081",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Datura",
   "form": "(seeds)"
  }
 }
}
