{
 "title": "The Glory: My Adventures of the Universe",
 "author": "Sparky",
 "citation": " Sparky. \"The Glory: My Adventures of the Universe: experience with Morning Glory & Alcohol (ID 55825)\". Erowid.org. Aug 8, 2009. erowid.org/exp/55825",
 "substance": "Morning Glory & Alcohol",
 "bodyweight": "170 lb",
 "report": "<p>I guess it all started at 7:00PM last night. I just picked up my 1200 heavenly blue morning glory seeds from my friend's house (I bought them on ebay and sent them there) and I was reading the package when I got home and it said, 'All parts of plant and seed are poison'. I really didn't believe that, as the auction said that they were untreated. Just to be sure that they were safe, I decided to take what I believed to be a small dose. I didn't want my friends to unknowingly ingest poison.</p><p>I started taking pinches of seeds and chewing them finely in my mouth. The last time I tried the seeds, I ground them up in a peppermill, but I didn't feel a damn thing. I took what I thought to be about 150 of them in a matter of 30-40 minutes. I didn't plan on tripping, I just figured that if they were toxic, I'd just throw up or something and it'd be all over. I know, that's a pretty risky move, but I just wasn't thinking clearly. I had been drinking earlier that night. I was already pretty confident that I wasn't going to be sleeping anyway. I thought I was taking a light dose, as I took that same dose the first time and felt nothing.  I should also note that I had drank some southern comfort earlier.</p><p>Though I did start get nauseous at around 8:15PM, I knew it was from the morning glories. I read enough stories to know what was in store. It wasn't totally unbearable, just not the most comfortable. Once that subsided at around 9:00PM, I knew the fun was about to begin. I was still at the computer at that time, browsing a few forums and talking on AIM, so I decided to dick around and listen to some music. I kind of felt stoned first, then I started feeling a bit numb and disconnected, but in a good way. My friend came in to use her computer, and I was able to have a perfectly normal conversation with her. I don't think she would have been interested in that kind of thing anyway. I ended up listening to Sonic Youth's Murray Street and Evol albums. I didn't just listen to the music, I was the music. It was coming in both ears, but there was a sphere of nothing in the middle of my head it was just going around. I didn't really understand that, but I felt like I didn't have to.</p><p>So, I went to bed at a little after 10:00PM. I knew that it was just going to get better once I was laying down in the pitch black room, I just didn't know how much better it was going to get. First of all, it didn't feel like my room. It was like I was sleeping in a hotel or at my grandma's. Very strange feeling. I also started to notice that I was hearing noises related to a rainforest. I can't even explain that. Maybe it was just something that was always there, I just never heard it.</p><p>My first experience came out of nowhere. I was laying on my stomach and all of a sudden, it was like I was on one of those exersize balls. Except, this wasn't an exersize ball, it was the Earth. It started expanding and contracting and I just rode the waves. Eventually it just came back down. From there, it starts to get a little hazy, I remember fragments of things here and there.</p><p>Next concrete thing I remember was looking up and seeing some sort of light above. My eyelids started fluttering uncontrollably as I looked up into it (isn't that some sort of LSD thing?) and I started seeing rainbow colored shapes on the edge of my view. Eventually I went up the light and I was in space again. This time I was moving at really fast speed. I left the solar system, galaxy, and even the universe. Outside of the universe was more space. It was like those Ukrainian eggs with one egg inside another, inside another, etc. Eventually, I was able to get out of space. I stuck my head outside of it and I was in a white room with white clouds. I felt like god. Time stood still. Nothing really mattered to me, I could have died right there and I felt that it would be perfectly alright.</p><p>As time went on, this continued. When I finally felt like going to sleep, I just couldn't. My mind was racing. It was like somebody was playing a blank tape in my head. I couldn't NOT think. My mind was racing. My thoughts of the night were, 'Other than birth, this is the most important moment of my life. This is my rebirth, I was a clean slate, now I am something.' These thoughts now are very disturbing to me, but it made total sense last night. I felt like I was becoming something new.</p><p>I woke up this morning and I felt normal, thought I was obviously still pretty tired. I came to realize that what happened in my little LSA world didn't really matter anymore. It was all gone. And that suited me just fine.</p>",
 "year": "2006",
 "id": "55825",
 "gender": "Male",
 "timestamp": "2009-08-08T07:00:00.000Z",
 "views": "5698",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "50 ml",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "",
   "amount": "150 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ]
}
