{
 "title": "A Perfect Initiatory Experience",
 "author": "Lunch",
 "citation": " Lunch. \"A Perfect Initiatory Experience: experience with Mimosa hostilis & Syrian Rue (ID 55830)\". Erowid.org. Sep 15, 2006. erowid.org/exp/55830",
 "substance": "Mimosa hostilis & Syrian Rue",
 "bodyweight": "140 lb",
 "header": [
  "DOSE: T+ 0:00",
  " ",
  "oral",
  "Mimosa tenuiflora",
  "(tea)",
  " T+ 0:00",
  " ",
  "oral",
  "Syrian Rue",
  "(tea)",
  " T+ 3:00",
  " ",
  "oral",
  "Mimosa tenuiflora",
  "(tea)",
  " T+ 3:00",
  " ",
  "oral",
  "Syrian Rue",
  "(tea)",
  " T+ 3:00",
  "1 ",
  "smoked",
  "Tobacco - Cigarettes",
  ""
 ],
 "report": "<p>I had always been fascinated with Ayahuasca, but understandably hesitant about doing it due to the predilection towards having horrific purgative nightmarish life-review trips.  Still, I valued the importance of having such a trip and always knew I would try it someday.  There are many things about myself I needed to confront, and I knew that confronting them head-on would strengthen me and heighten my compassion for life.</p><p>For this first time, I did not have this sort of experience, but I am still awe-stricken as to what happened that night.</p><p>Now, I'm no chemist, and I had never 'brewed' anything before in my life.  However, after doing countless hours of research on the brew, I decided that one of the simplest methods of preparation would be worth the extra effort.  I made the brew with Mimosa Hostilis and Syrian Rue.  This is not 'true' Ayahuasca, since Ayahuasca is actually the Banisteriopsis Caapi vine.  I read mixed reviews as to whether or not the types of plants actually mattered.  Some say that Caapi provides a smoother, more compassionate trip, and posesses some feeling of it being a 'wise old teacher'.  They go on to say that Syrian Rue is emotionless and harsh, and generally brings on a much more intense trip.  I also read other reports saying that there is hardly any difference worth mentioning at all.  In the end, I had already obtained the materials, and as far as I was concerned, I would be taking the steps necessary to orally activate DMT for a ~6-8 hour trip.</p><p>I brewed the stuff, washed it 3 times, and ended up with a brown sludgy liquid as expected.  What I did not expect, however, was the bitterness.  I remember thinking 'Jesus Christ, they ain't lyin' when they say it's bitter!'  It's so bitter that it *almost* tastes sorta good, if one could just tune the taste buds just the right way.  I can see myself getting used to it and greeting it as an old friend, in the same way I feel when drinking Whiskey.</p><p>I had ruminated for days on how I wanted to do this trip - alone, or with a friend.  I was worried about having an awful nightmarish trip, and I really didn't want to have to go through that with anyone but myself.  If I was going to be puking and shitting for 8 hours, I wanted to be alone.  Many people told me that I should definitely have a sitter.  Others told me that Ayahuasca should never be taken without an experienced shaman.  I could see how that would be helpful, but by no means necessary.  Besides, there ain't too many shamans in Philadelphia.</p><p>In the end I made the decision to do it by myself.  I have had numerous high-dose trips in my lonesome, and it's the way I prefer to do it.  I like to spend most of my time meditating on psychedelics, and I rarely enjoy being in a situation where I must socialize.  Engaging in cognitive activities detracts me from the possibility of having an enormously powerful and enlightening inner experience.</p><p>I drank half of the brew.  Choked it down.  Yuck.  15 minutes later, an enormous weight came over me.  I realized there's no turning back, but I was utterly elated that my first brewing experiment was actually having an effect.  I began tripping extremely hard.  I attempted to get into a meditative pose, but it was just too strong.  I felt so incredibly heavy that I ended up on the floor writhing around trying to get used to the physical effects. </p><p>I began entering some heavy trances, and engaged completely in that oh-familiar deep all-pervading point of love and compassion - where the air is so peaceful and still that I could hear a pin drop from miles away.  It felt so good to be in that place again, and it felt like I hadn't been there in so long. </p><p>This carried on for about an hour as I closely monitored my digestive system for issues.  I did not puke, but I forced myself to expel out the other end.  There, sitting on the toilet, I was reminded of the spiritual experience one can have during a purge, and while it wasn't much, I did get a self-satisfying sense of getting rid of something.  It might've just been the simple fact that I had to take a shit.  On drugs.  Regardless, shitting and puking on Ayahuasca seems to be a popular subject among the reports, so I figured I'd give it some attention.</p><p>The trip started wearing down a little, but I had the rest of the dose to drink.  I wasn't sure whether I'd take it or not, but decided to go for it at the last minute.  This was about 3 hours after the initial drink.</p><p>After a few minutes of finishing it off, I began to get a little depressed that I wasn't having the mindblowing experience I had hoped to have.  I went outside to have a cigarette and sat and stared up at the sky.  I wasn't even having any decent hallucinations.  I began to feel like it was a total waste, and I was pathetic for wasting my night on something so trivial.  At the time, things were pretty complicated in my life - just getting out of a long relationship, losing my job, confused confused confused. </p><p>I plunged into a deep depression.  Realizing that I was slipping into a dark place, I called my ex-girlfriend (we are still good friends) told her what was going on, and she was extremely helpful.  I curled up into the corner of the room and talked to her, revealing all my problems and sobbing as the room began turning dark.  The dirty corners of the room began sticking out, the walls turned a drab grey, my cat was irritable and hungry, and everything was just downright depressing.</p><p>I thought about the fact that I was there again, in that hellish psychedelic spot that I've been so many times before, and scorned myself a little for letting it happen.  I couldn't believe just how difficult it could be sometimes to not be able to find the light.  I couldn't look in a single direction without confusion, depression, and sadness. </p><p>I had just about had enough... </p><p>When, suddenly remembering my meditative practices, I began employing some methods to calm me down and regain my center.  I don't know how I got out of it, but what followed was the most incredible and hilarious scene I have ever been a part of.</p><p>Warning - this next part contains elements of my own theories about the nature of time, and questionable future events.</p><p>I began thinking about 2012, and the theories of shifts in consciousness, global ascension to psychic awareness, and pretty much everything one can concieve of all wrapped up in one mysterious eschatological ball of wax.  It occurred to me that all of the pain and sadness and confusion we feel will be of no importance very soon.  Just as it should be with each passing moment, all of that stuff seemed so trivial and petty - not worth the time.</p><p>I entered that deep all-pervading peace-center again, but the magnitude and extension of it seemed to encompass an enormous circumference around my center of being.  And, dare I say, I got a glimpse of global consciousness.  What did that mean to me exactly?  It meant that for one brief moment, I felt the pulse of the earth, the minds of every living sentient being on the planet...  Perhaps for that brief moment, everyone's heart beat at exactly the same time.  Perhaps everyone thought and felt the exact same thing at the exact same time.  Just for that brief fleeting moment.</p><p>And COLOR!  Bright whirring mandalas of perfect harmonious order enveloping the entire planet!  Everything and everyone was in sync.  My cat was no longer irritable - I glanced over at her to find her purring away, as if there was an invisible wind blowing through her fur.  A chorus of chords...  intense soul-shaking energy...  </p><p>I began laughing hysterically.  All alone in my house, cracking up like a loon.  The neighbors probably heard me as I bellowed, bent over in supreme hilarity.</p><p>I called my ex-girlfriend again from this opposite end of the emotional spectrum and we had a laugh about the complete 180 my mood had taken.  This was what I was looking for with Ayahuasca, and I was utterly thrilled that I had found it.  I was worried there for awhile, and I *really* didn't want to go to bed without it.</p><p>Completely astonished and satisfied, I went to bed - the whole experience lasting about 7 hours.  I woke up completely refreshed, rejuvinated, and full of life.  For weeks after the experience I noticed myself in an elevated mood, laughing more often, enjoying life, happy. </p><p>I now truly understand why it is called 'the good medicine'.  While I didn't have the ultimate intense life-review trip I expected to have, I'm extremely happy with what did happen.  I definitely look forward to doing it again - next time with a couple close friends!</p>",
 "year": "2006",
 "id": "55830",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-09-15T07:00:00.000Z",
 "views": "8294",
 "dose": {}
}
