{
 "id": 5585,
 "title": "30 Minutes of Vertigo",
 "date": {
  "submission": "2007-05-09T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shawn",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "4"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 ],
 "report": [
  "One day recently I went into a head shop I frequent to get some incense and I noticed that there was concentrated salvia for sale.  I had tried a smoking blend containing salvia before and the first time I smoked it it felt like a clearer and less turbulent marijuana high.  After that, however, it had little to no effect on me.  I mentioned this to the owner who I am on a familiar basis with and he said that this stuff was very powerful and gave me a free sample, mentioning that environment was everything for this and that it should be quiet and dark or in dim lighting for significant effects to be felt.  When I got some free time I decided to smoke it, so I sat at the desk in my room and took a hit out of a ceramic one hitter my roomate had.  After a few seconds the effects hit me HARD.",
  "I suddenly felt twice as heavy and in a mind state for which there are no accurate comparisons from my experience.  It wasn't quite what I would have called a trip yet though and since that was what I was trying to attain I took three more small hits.  Suddenly I became angry with my dog for absolutely no reason and put him in his kennel to get him out of the way.  His removal from my sight didn't really fix things but that situation was quickly obscured by irritation at inanimate objects in the room.  I felt like several things were in my way even though I had no intention of moving from my chair.  It was as if the room were too small to allow comfortable movement with these objects where they were while the room itself seemed to be the same size as always.",
  "After moving some of those objects around I returned to my chair and fell into a trance which I can best describe as the opposite of lucid dreaming.  That is, I felt as if I had lost my lucidity while I was still conscious.  While in this state I felt as if I was in a large room like a gymnasium and a woman was speaking to me over a loudspeaker.  I can't remember what was said but I remember the distinct impression that she was barking orders at me rather forcefully.  I never got the feeling that this voice was malevolent, rather just kinda pushy.  At one point I asked my self if this was real but that line of logic didn't get far and I continued in the dream completely forgetting that I had just questioned the validity of what I was experiencing.",
  "The next thing that happened was that I began to follow an order from the being who had been speaking to me but this order was not issued to me verbally.  It was more like a sensation of being physically led somewhere along a line.  The line felt like the edge of something, like the edge of reality that led off a drop into another reality.  It was something like the feeling I would get from being on the edge of a precipice though I saw nothing but the room I was in.  I was led along this irregular line out the door of my room and when I got right outside I woke myself up.  My thoughts were something like,'I'm not playing this game any more'.  After I regained control of myself I felt very mentally cloudy and just generally confused although I didn't know what I was confused about.  I remembered thinking the word 'unpleasant' and wanting to write it in the air with my finger.",
  "I just decided the best thing to do would be to go to sleep, which I did, and I woke up about 30 minutes later to my roomate's arrival feeling surprisingly refreshed and perfectly normal.  At no point did I actually get any visuals.  I had about half the bag left and I didn't want it so I decided to give it to my roomate, making sure to mention that environment was important, and he went to his room and smoked it. He then walked out looking very very high and said, 'I think it hit me'.  I suggested that he sit down and space out, reiterating my comments that environment was important, but he just said,'Man I just took 3 hits, I should be ok'.  He then went off to make a sandwich and take a shower so I don't think much happened to him.  His motor skills had obviously been affected however as the area where he made the sandwich looked like a war zone.  There was about a 2 foot radius through which the sandwich's constitutents were spread.",
  "All and all I would rate my experience as bizzare and will not do it again.  It was not all that bad but it just wasn't fun especially since it lacked the elation I feel from psilocybin mushrooms."
 ],
 "erowid": {
  "id": "32893",
  "citation": " Shawn. \"30 Minutes of Vertigo: experience with Salvia divinorum (ID 32893)\". Erowid.org. May 9, 2007. erowid.org/exp/32893",
  "substance": "Salvia divinorum",
  "views": "2678"
 }
}
