{
 "title": "Once I Begin Drinking, I Cannot Stop",
 "author": "Ousdeese",
 "citation": " Ousdeese. \"Once I Begin Drinking, I Cannot Stop: experience with Venlafaxine (Effexor) & Alcohol (ID 55854)\". Erowid.org. Oct 10, 2006. erowid.org/exp/55854",
 "substance": "Venlafaxine (Effexor) & Alcohol",
 "bodyweight": "110 lb",
 "report": "<p>I began taking Effexor under the supervision of my psychiatrist in order to relieve an episode of major depression and also to try to put a handle on my social anxiety. After 2 weeks I reached a dosage of 150 mgs per day, where I have stayed. The Effexor was very effective in relieving my depression - I felt like I was on my way to getting better instantly, as soon as I took the first pill. It however did little for my anxiety, which I still suffer from. I have been a daily marijuana user for some years and I noticed no difference in the effects of smoking while on Effexor. Before taking Effexor, I hardly ever drank, because it was not enjoyable for me - I would drink two drinks and then fall asleep. Drinking did not help me much in covering up my social anxiety.  But on Effexor, drinking became my favorite activity.  On Effexor I can drink all night long  and it is incredibly rewarding. Alcohol in combination with Effexor turns me into a social butterfly with incredible energy. No longer do I pass out after consuming alcohol.</p><p>In fact, drinking in combination with Effexor is so rewarding that I feel that I have become addicted to alcohol. Once I begin drinking, I cannot stop, I feel that I need more and more alcohol. After Ive had a drink, all I can think about is having another one  I feel like I am fiending for it, similar to the feeling I had when I had a problem with cocaine. Although Effexors manufacturer states that Effexor is not contraindicated with alcohol, the manufacturer recommends avoiding alcohol while taking the medication. I could not find any information as to WHY it is recommended that people avoid alcohol, but maybe Effexor contributes to alcoholism in some people. I am submitting this report as a warning to those taking this chemical, especially those who have had problems with addiction in the past. I see in myself a pattern of behavior that is not healthy and difficult to control.</p>",
 "year": "2006",
 "id": "55854",
 "gender": "Female",
 "timestamp": "2006-10-10T07:00:00.000Z",
 "views": "19652",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  }
 ]
}
