{
 "title": "Underneath, It's Never Over",
 "author": "Captain Enon",
 "citation": " Captain Enon. \"Underneath, It's Never Over: experience with Salvia divinorum (5x extract) & Cannabis (ID 55861)\". Erowid.org. Oct 15, 2007. erowid.org/exp/55861",
 "substance": "Salvia divinorum (5x extract) & Cannabis",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Before I write this, I understand what we did was stupid and unprepared. All of this could've easily been avoided with a different atmosphere and a couple minutes of thinking. For that, Im sorry. Take this as you will. To me, its just another perspective at a certain experience.</p><p>Lets smoke this shit!</p><p>Rod was eager to start. Our setting was my sisters bedroom, a home for many illegal activities and mind-expanding experiences. As we laid out, at the foot of her bed, a fuzzy charcoal blanket, each of the five of us chose a side. We were set up against the wall directly in front of us as we walk in, aside a dresser, large window, and her desk a meter or so to our right. J sat closest to the window as he packed a bowl, hunched over the hookah in the center of the blanket. To Js immediate left, with his own back to the computer, sat Rod. Rod supplied us with the Salvia, a certain connoisseur of the drug and the most experienced of the lot. Connor, someone I knew only through Rod and J, sat with his back to the footboard of my sisters bed. Next to him sat me, and on the side closest to the dresser sat my sister.</p><p>My sister, Connor, and Rod had each tried Salvia Divinorum, the latter at multiple times with multiple doses. J, the person I looked up to concerning drugs and drug use, had never done salvia but admitted to using liberal amounts of LSD (wherein he did not react in a positive manner, our first warning sign!), codeine, as well as copious amounts of other illicit things. I was looked upon as the baby, and was generally expected to be the most gone. I brought a pillow with me and made sure other pillows and soft things were available to anyone in need. As it turns out, this was completely unnecessary, but hey, I tried, right?</p><p>With soft electronic music playing on her computer, my sister looked upon all of us, excited for something to happen. Should we take turns? I asked timidly, wary from knowledge I had about the drug and its power, Like, two people go and the other three stay sober until theyre ok? I can sit first, I dont care.</p><p>Nah. Connor and I have done waay more than this. Rod snickered, turning to Connor, Weve done 25x, Im going to be fine the entire way through, dont worry about it. (warning sign number two. were on a roll!)</p><p>Unsure, I looked around, from face to face. There was no opposition to his plan. Shrugging, I leaned back and watched as J took the first hit of the weed-and-salvia mix in his hookah. Expecting something wild to happen, I almost got discouraged as J inhaled from the yellow hose held firmly in his fist, waited, exhaled, and passed it. If anything, he looked soberer. The same reaction was had for the three other guys, so I wasnt worried. I took my hit, passed it to the sister and waited.</p><p>Breathing out her screened window, I felt just a bit high. It was unpleasant, I really wanted a glass of water and a nap, but as the hookah went around a second time, I became eager to experience this thing with four people Im extremely comfortable with.  As I took my hit this time, I felt something. Nobody else in our group was inflicted, they all sat, calmly chatting away. It baffled me. While I felt like lightning bolts shot from my head to my toes, from my shoulders to my stomach, from my chest to my fingertips, they just sat there, occasionally flashing me a smile and laughing about something I wasnt paying attention to. Nevertheless, I leaned back on my pillow and enjoyed the ride.</p><p>Next thing I knew, they were packing a bong with the bitter bits of extract. Rod, as he made the bowl, glanced to me and winked. Im not feeling anything, He admitted. Connor and J agreed, my sister looking on solemnly. As the newbie, they decided I got second hit. I cant, I dont need to. I tried to reason with them, but I gave in easily. With what hit I could manage from the bong, I held it in as long as I could. Turns out, that was a whopping eight seconds, but it worked. Exhaling, I felt as if two of the warmest, softest hands were lying me down. I didnt want to lay down, so I reasoned with the hands and leaned against my pillow, tipped back.</p><p>Suddenly, as if from a suction, as if from a vortex, I felt another invisible force pulling me onto my back. Unwilling to move from my comfortable position, I closed my eyes and tried to fight it off. Instead, I was treated to falling down a blue-and-purple flight of stairs, my hair loose and my body lithe, modestly clothed. It wasnt terrifying at all, I knew at the bottom of the stairs, someone I loved waited there with open arms, a mattress, pillows, a blanket, and a cup of hot chocolate. The feeling of falling was spectacular. As my body fell, I watched before me as my favorite memories played on a stage at the top of the staircase in order of my age.</p><p>A fun time in kindergarten played of me and my former best friend. We were insanely competitive, not only of each other, but competing for the attention of a mutual male friend of ours. So we raced each other, neck-in-neck the entire way around the elementary school. Something about the memory was heartening and emotional, and I watched as Shelby beat me by a hair, but she gave me a full hug at the end. Suddenly I snapped back to my sisters room. She leaned against the dresser, while Rod and Connor sat aside one another, talking. J, in front of me, took his first or second, I dont recall, hit from the bong. Calmly, he exhaled his smoke and set the bong down carefully, looking completely content. Reaching forward, Rod placed the bong behind him, looking off in space.</p><p>For a second, I remember becoming J. It was as if I were in his body, kind of a stranger. It felt weird and I hated it, so I switched back to myself. Snapping his head up, he gave me the oddest expression Ive ever seen. His face was a portrait of terror, mixed with adoration. J snapped his head from me to Rod, then started. Almost as if trying to stand, he moved forward, pushing the hookah out of his way and slamming his upper back, neck, and head into my sisters oak footboard. As we scrambled to make sure he was alright and to contain him, he rolled over and did the same thing. Then, on the ground, on his stomach, he began thrashing about. He sent Rods bong under my sisters bed, a jar we were using as an ashtray across the room, knocked over the hookah and bent its bowl, completely destroyed my sisters gravity bong, sending bits of plastic pitcher and water flying onto the blanket, beat in a printer and managed to hit and bruise each of us.</p><p>The four of us each tried to call out his name, trying to stop him and bring him back into this reality. Looking at his face was absolutely horrible. Only white shown in his eyes, rolled back into that crazed storm of a mind of his. Every effort to stop him was fruitless. Finally, he paused for naught but a second and stood straight up, his face the same look of terror and adoration as before. He ran to the bedroom door, his entire back, from shoulder blades to ankles, soaked in assorted types of bong water. Throwing the door open, J stood just outside it, in the hallway, and waited. Connor and I followed him, reasoning that he had to lie down and get off his feet. Pointing and waving madly at my sisters bedroom, he spurted a line of gibberish and took a step at the wall parallel to the bedroom door. Horrified, Connor asked him to calm down and I took him by the shoulders, leading J into the spacious master bedroom at the end of the hallway, lying him down on the bed.</p><p>At first hesitant, J lay down and I accompanied him, worried as his legs convulsed and eyes scanned the room. More gibberish came from him, every so often using a word I could understand. I kept him lying down, told him to close his eyes, and reflected upon the situation I was in. Had I had time to be terrified, I wouldve been. Fuck, I just smoked salvia for the first time and was treated to this? However, I had a possibly concussed tripping friend to the side of me in some sort of hell. Time was lost quickly. After doing whatever in her room, my sister, Rod and Connor entered the bedroom, successfully freaking J out. They marveled at his manly thrashing-about power, recalling what must have happened fewer than ten minutes ago. It felt like hours ago. J sat up, but I urged him to lie back down.</p><p>Nnnitsat I dont umm nnsat. J said, looking around, worried. Laughing madly, Rod peered at me with a pained expression, mouthing the word sorry. Assessing the damage, my sister took over, walking the rest of us to her room. At that point, I grabbed a towel and tried to get the bed where J lay as dry as possible, Rod helping me. Suddenly aware at the amazing power of salvia, diagonal patterns flickered about the towel, sending waves of nausea through me. Giving up on the bed, we tried drying the bong-watered carpet and masking the smell. The nausea kept with me, making everything from that point on sickeningly uncomfortable and pale green. We relocated to the kitchen, put everything incriminating in Js car and shared a glass of iced tea. The other four found their way back into the foyer of the house. I went to the bathroom downstairs and vomited. Febreeze was applied liberally to the entire house.</p><p>I need to walk around, I need to get around. J mused, trapped in a thought loop. Relocating once more, the five of us stood in a circle at the entrance of my sisters bedroom. Seeming, to me, hardly apologetic, J apologized for the damage he caused. Connor and Rod picked up for me, expressing apologies for such a terrible first trip. Always a lady, I waved off their words, but knew they were right.</p><p>You know that feeling where something happens and you ummm block it out nnnth thats how I feel right now, slurred J, laughing briefly after he said it. Its like the last thirty minutes of my life are just gone.</p><p>You dont remember any of it? My sister asked.</p><p>I, I, I, remember the first hit, then exhaling, then being wet on the bed.</p><p>Well, you fucking freaked out man! Connor chimed in, grinning.</p>",
 "year": "2006",
 "id": "55861",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-10-15T07:00:00.000Z",
 "views": "2539",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ]
}
