{
 "id": 5587,
 "title": "Worst Night of my LIFE!",
 "date": {
  "submission": "2008-01-22T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Weezie938",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "25",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-E",
   "form": "pill/tablet"
  },
  {
   "time": "3:00",
   "amount": {
    "number": "5",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "Worst night of my life!",
  "I will never do it alone again! it was non-intentional for me to do this but thats how i ended up. Took the 25-30 mg pill round 1030 and started having mild visuals at 1200 or so. These kept getting more and more intense as the night progressed. by 1:00 i found myself losing my mind. Couldnt see strait cause everywhere i looked was mass twisting and turning of all shapes and it looked like everything was growing.",
  "I turned on sesame street to try 2 ease my mind, it helped a little bit cause they talked to me like i was a fucking baby and it really truely helped. Soon after watching that and elmos face coming at me and shit the creater of the show came on, he was an ugly fellow and i was back to hell again.",
  "I tried closing my eyes but there was no possible way to hide this trip. I didn't try any other drugs besides a few cigarettes cause i knew it would only make matters worse. Laying on the couch waiting for this all to pass i hear my slidng glass door open in my basement. I didnt have my glasses on or my contacts in so i jumped and freaked out. but i was happy someone was hear to fucking save me. I put on my glasses and it turned out 2 be two of my old best friends taht i hadent seen in like 3 years. They claimed they saw my light on in the basement so they came on over.",
  "As soon as they came they knew immediately i was tripping and i asked for a hug. no i am not gay, but that ment the world to me at the time. I proceeded to describe the drug to my buds and they were obviously clueless on what i was goign threw at the time. WE went outside to go smoke some bud, they said it would make things easier. I proceed to hit this Amsterdam 911 shit and it was unreal. i had 5 hits and that was nuts. I started to shiver uncontrollably and it was 75 degrees out. They said they had to go and i was fine with that cause i felt much much better.",
  "As i was stumbling back to my house my mind felt like it was about to explode. I had a sudden anxiety attack and i had a unmber of these over the next 2 hours. I'm pretty sure the bud had something to with all the following events but i was not sure. my eyes started to go crossed and i couldnt fucking concentrate. after about 20 seconds of this madness it finally settled down a bit. I tried sleeping again and thats when it was totally not cool . I tried listening to the strokes and cream. Unfortunately it was too intense because NOW MY FUCKING HEARING WAS GOING OUTTA WACK. I had the power to speed up the music and slow down the music in my head, it was un-fucking-real. This was not cool so i turned it off.",
  "Then voices came into my head. Wispering that would speed up to what i would compare to putting a tape on play and fastforeward then making it go even faster. I had to keep talking to myself to get the voices out. All i kept hearing was 'jibba-jabba hisa ima' and just crazy non-sense. After 2 hours of this neverending nightmare that felt like 5 days, i was finally able 2 get the voices out of my head and be at what i would call a 'perfect high' I still had a lil messed up hearing but i was still getting strong strong visuals. it was about 4 by then. i stayed up till 6 and hear i am 14 hours later. Alive and well. Here is a lil bit of lyrics that i wrote down when on the drug.",
  "-2c-e-",
  "My mind set on a hella trip.",
  "Read this real fast as i rhyme and rip",
  "'scuse me, ill flash back completely",
  "as i open my mind to the greater being",
  "my fuckin rhymes going",
  "my mind is rigid, tweaked and blowin,",
  "shit my eyes moviing so fast cant see",
  "fucking hella trip n shit completely",
  "it escalades and speeds up rapid",
  "dubd tapes n voice in my head",
  "twisted and split as i cant concentrate",
  "my mind relapses as im far from strait",
  "rescued by my two old best buds",
  "they saw the light, came in and shrugged",
  "couldnt figure me out, not on this night",
  "so they handed me a cig and sparked it right",
  "as the left me, and wished me luck",
  "i ran for my house cause of the demons above",
  "everything before me melted as did my brain",
  "nothing could stop this runaway train",
  "Strait enough now, but i dont know how",
  "a nightmare rebound, thank god, but how."
 ],
 "erowid": {
  "id": "32898",
  "citation": " Weezie938. \"Worst Night of my LIFE!: experience with 2C-E (ID 32898)\". Erowid.org. Jan 22, 2008. erowid.org/exp/32898",
  "substance": "2C-E",
  "views": "4274"
 }
}
