{
 "title": "A CD Changing Trip Through Time",
 "author": "Chad",
 "citation": " Chad. \"A CD Changing Trip Through Time: experience with Salvia Divinorum (ID 55914)\". Erowid.org. Aug 25, 2009. erowid.org/exp/55914",
 "substance": "Salvia Divinorum",
 "bodyweight": "320 lb",
 "header": [
  [
   "DOSE:",
   "0.25 g",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "2006",
   "55914",
   "Male",
   "",
   "Not Given",
   "Aug 25, 2009",
   "2191",
   " "
  ]
 ],
 "report": "<p>Having been exposed to Salvia roughly two months prior to this experience, with results varying from being very relaxed, where each breath taken in seemed to actually push the drugs through my system and cause me to relax physically, until I was able to see something akin to a Pink Floyd laser light show behind my closed eyes when simply smoked, to taking a hit from a water bong and experience what could only be described as a shift in gravity, which ran from the middle of my thumb, outward to the deck that I had seen in my perepherial vision, where I was nervous of moving my thumb around, being scared to fall down.</p><p>This particular night, however, was different.</p><p>Tonight I had decided to relax and go to bed early, and since a majority of my times smoking Salvia had resulted in simply some pretty visualizations and maybe a visit from my Spirit and Reiki guides, I figured it'd be a fine night to just kick back and enjoy the small ride before falling asleep.  Packing about 1/4 of a gram into my water bong, I lit up, and took in a good, solid hit, holding it in my lungs for about 25 seconds.  Letting out the smoke (which certainly did smell like the Spearmint they said it would), I started my second hit, and immediately experienced another 'gravity pivot'.  This time, it was in line with my two front teeth, and straight down the middle of my head.  Knowing that wasn't the most comfortable feeling, I stopped inhaling, and immediately pushed out what I had inhaled, wanting to be calm tonight, not worried about gravity.</p><p>Suddenly I felt my body moving, ripples moving from my toes all the way up my head, as the kitchen in sight before me started to change, flickering.  It moved sideways, and instantly the world pivoted on that 'gravity line' in the middle of my head, and suddenly I felt myself traveling in a very large circle.  Imagine if you would, one of the circular large CD holders, that hold large amounts of CD's in a ring, and that is how it felt.  As if my body were going through the holes of the cd's, and each cd were a moment in time.</p><p>Turning my head to make a vertical cd horizontal, it would pause the sensation of traveling through time for a moment (the shivers were still there, as the rest of my body is still trying to catch up with me, mind you), and I would gaze at a particular moment in time.  My first glimpse was of my grandparents old house in Ohio.  The carpet was the same color, the end table I had set my water bong on had changed into the same potted plant stand that they had in their living room.  It even smelled of the same house.</p><p>Being a bit alarmed, I tilted my head again, and once again, I began to rush through my CD's of time.  Tilting my head once more, I this time experienced a point in my life when I was five years old.  My parents and I were living in Georgia, and as a young child, while my father watched Nascar races on TV, I'd lay down on a big throw pillow on the floor and take a nap near him. Because of the way a 'horizontal cd' was, and how those equaled me staying in a given scene for that moment in time, it was positioned as if I were once again laying down on that throw pillow in that house.  I could even hear the Nascar race on the television.  Everything through my glasses looked like the house from when I was five, yet everything around my glasses (as if you were to push them down and look over the top) appeared as the normal apartment that I'm living in right now.</p><p>Again the sensation of moving through time began, and as I looked up, I could see the bottom half of my body lodged inside of the couch my father was on, as if I were climbing through the couch to travel through this circle of time (later, in retrospect, I had some jeans on the floor, so that must have been where that sensation came from, seeing the bottom half of my body).  It was when this sensation of being about to change times again put me into a panic.  I was suddenly awash in a wave of feeling that maybe if I could somehow change something in this time in my life, things would be different in the future.  After all, the setting was so vivid. I could feel the pillow, hear the race, heard my dad cheering on some car, my mother in the kitchen cooking some lunch...it was all so surreal.</p><p>Knowing that this was indeed too much for me to handle, I tried to calm myself down and come out of this experience, reminding myself over and over it would be short.  Looking up, it was as though my circle of CD's had changed into a long hallway of mirrors, and each row began to tilt back and forth, until my 'normal' kitchen came back into focus.  At this point I realized just what was happening, and reached for the phone.  Calling up my friend, I took several deep breaths, and as I felt the events returning back to normal, began to explain to him what had happened.  During the talk, I was so overwhelmed with emotion, I broke down and began to cry.  Whether it was due to experiencing such a vivid event, or the fact and understanding that I couldn't change anything within it, I still have yet to truly know, yet as I write this again, an hour after the experience, I'm still brought to tears.</p><p>I have learned a very serious lesson with Salvia, and will treat this with a very high amount of respect.</p>"
}
