{
 "title": "Pure Ecstasy",
 "author": "Barbara",
 "citation": " Barbara. \"Pure Ecstasy: experience with MDMA (Ecstasy), Cannabis & Alcohol (ID 55939)\". Erowid.org. Apr 2, 2009. erowid.org/exp/55939",
 "substance": "MDMA (Ecstasy), Cannabis & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "40 oz",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I have never really understood the real instrinsic nature of that word: Ecstasy. It sounds like something so far out of reach -- something unnattainable. Not so! I think ecstasy is more than just a state of being, it's definitely a state of mind and a different level of consciousness. Let me try to explain a little bit more. Here goes...</p><p>On Saturday, myself and Galen got together with some friends that we've made here in Milwaukee. The other couple that we knew introduced us to several people on Saturday. We had a good time, smoked up a bunch, had some to drink, and then went out to a bar to enjoy some music and atmosphere. The band that we thought was supposed to play had already played, so we all sat around behind a restaurant and just kicked it. It was awesome. The night was just getting started though. We had all been talking and one of our awesome friends suggested that we all chip in and buy some Ecstasy. He had mentioned it a few days before, and I never really seriously considered it. I figured that I wouldn't do it, but I made a bold leap and asked him to get me some. Galen decided that he would too and soon there were five of us all chipping in for the little pills. The night was coming to a close at the bar so we all walked to the house of the coolest guy ever (the guy from the first couple I spoke of). Eventually his dealer showed up, he acquired the pills, and before I knew it -- there were five of us taking these little pills with exclaimation points on them.</p><p>We were still smoking it up and had finished drinking (they had bought five 40's and we killed them off quickly) when about fourty-five minutes after taking this pill -- the most amazing thing happened. I felt pure ecstasy. Pure unadaulterated love for these people in this room and for myself! It was really strange. I felt completely comfortable with me again...I felt AMAZING! Everyone was talking so fast...we were all speeding but time felt like it was crawling by. It was awesome. Everyone had something positive and interesting to say and we were all listening to each other, even if carrying our own conversations. It was so cool. It was like everyone was on the exact same spiritual page. I started feelings things about the people there, past lives and such. I could feel and see their auras (which is nothing new, but everyone was indigo). I pointed out that the five of us were all indigo children and everyone freaked out in joyous laughter. It was awesome bonding with them. It was so tribal. We all had a massage circle going on in the soft glow of the candles to the music of TOOL.</p><p>I have never felt so much love in my life!</p><p>I just wanted to hug each person there, for ten minutes each. Each one had something to teach everyone else in the circle and we were all learning from each other. It was so amazing because we were all getting really really hot so they had bought a crate of waterbottles and we were just chugging them. Galen spilled some on the floor but that was alright, in the end, the floor was really wet and so were the five of us. The first friend that I mentioned in all of this was amazing. He was touching all of our foreheads to make sure we weren't too hot -- and I felt this incredible bond with him...like he was the teacher and I the student. It's the same teacher-student bond I feel with Galen. I kept begging him to touch my forehead -- it felt like he was giving me power. He and Galen had so much in common with their energies, it was amazing. Then I realized that everyone in that room all shared something so deep and in common. I still can't put my finger on it -- but it's that something that I do hope will continually bring the five of us back together again and again.</p><p>I love those people. I remember someone saying, 'The true test is if we still like each other this much tomorrow.' Definitely...we definitely do. It was cool -- we were all just speaking so openly and deeply. I felt like I could have told those people anything. I do believe that I told them pretty much everything about me and it felt like everyone was doing the same thing. I also did hallucinate once. They have a large spider (from Halloween) on their wall and I hallucinated it lifting up the wallpaper below it. Kinda weird, but cool as shit. I also hallucinated two pink bears hugging each other. It was amazing!</p><p>Anyway, so that doesn't even scathe the surface of my trip on E! but I hope it sheds a little insight for those who don't understand or who would normally judge this situation. I feel incredible! Amazing! So that is ecstasy...pure unadulterated love, friendship, bonding. It is the most amazing experience I have ever had in my entire life. ENTIRE life.</p>",
 "year": "2006",
 "id": "55939",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-04-02T07:00:00.000Z",
 "views": "4702"
}
