{
 "title": "Watching My Body Lie Breathless",
 "author": "Farfromfine",
 "citation": " Farfromfine. \"Watching My Body Lie Breathless: experience with Inhalants - Freon (ID 55958)\". Erowid.org. Jan 3, 2009. erowid.org/exp/55958",
 "substance": "Inhalants - Freon",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2004",
   "55958",
   "Male",
   "",
   "Not Given",
   "Jan 3, 2009",
   "10570",
   " "
  ]
 ],
 "report": "<p>Earlier this year I had heard that freon gives a wicked buzz and makes you hallucinate. This was just the beginning of my problems.</p><p>My dad works on ac units he has large tanks of freon sitting around all over. After about a month of getting familiar with the gas I knew exactly how much to breath and when I would spend hours in my basement watching people walk by and strange figures dancing around the walls. Later I found that if I put headphones on and listen to 'stoner' music the effects were much more intense and colorful. As I increased the dose of freon it seemed as though I was god and was able travel anywhere and understand anything. Of course I had some bad trips like the house burning down and blood spewing out of my chest, but usually they were amazing and liberating. </p><p>It all ended one day after I wrecked my car. I was upset and just wanted to get away. After about an hour of tripping I decided to just take a big hit and let the lights go out for a while. passing out was common with freon. I took two deep breaths and was out but something was wrong I felt my body slowly dying it was something I never felt before suddenly I was standing in front of my body punching it and holding on to it because it felt as though somebody was pulling me away. The terror lasted forever I really thought I was dead and my 'conscious' self was actually my soul apart from my body. Finally I came too but I couldn't move I couldn't see straight. I just laid on the floor for at least 15 minutes trying to understand what happened. I crawled upstairs to my bed and crashed. The next day I vowed never to do freon again and I haven't.</p>"
}
