{
 "title": "Effective When It Works",
 "author": "Sam",
 "citation": " Sam. \"Effective When It Works: experience with Calea zacatechichi (ID 56008)\". Erowid.org. Oct 18, 2006. erowid.org/exp/56008",
 "substance": "Calea zacatechichi",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Calea zacatechichi",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2006",
   "56008",
   "Male",
   "",
   "Not Given",
   "Oct 18, 2006",
   "7890",
   " "
  ]
 ],
 "report": "<p>On doing a little research on this herb, and currently trying to induce lucid dreams, I decided to buy 3 grams of 10x extract in order to try it out.</p><p>I had tried it one night with a friend, both in the form of a single gel cap, and nothing happened. I tried it again the second night in the form of two gel caps and a bit mixed with some cannabis (very bitter smoke), there was some potentiation of dreams, but not much.</p><p>I think these two attempts were marred by having other chemicals in my system (mescaline, cannabis, harmaline).</p><p>The third attempt I swallowed around a gram straight from the bag. It was bitter stuff, worse than ayahuasca. I chilled for a while listening to music and then went to sleep.</p><p>My dreams that night were very vivid. I was with a uni friend in a town I didn't know, and it all seemed pretty normal and non-dream like. I was at home in the evening and had to collect  algae and pond life for someone, which never got completed and I left with my friend. A tree had fallen down across the road- 1 in 15 chance of that occurring I remarked in my dream. We got into town and were walking down a street when I noticed that whenever his fingers touched anything it would produce a fizzle of electricity. It was this observation that made me realise I was dreaming. I then ran down the street and jumped into the air and began to fly effortlessly. I had to grab my friend ho was unable. Flying is one of my favourite experiences of lucid dreaming, and I'd wanted to do it again for a while.</p><p>I seemed to be able to remember many details of the dream. When I've had a dream I often wake up during the night to log the details of it in a dream journal. This is all in the hope of increasing my dream recall to assist in my attempts at lucid dreaming. I usually remember at least one dream a night, sometimes more, and rarely become lucid (often losing it later in the dream) without meaning to be. I've noticed it is harder to become lucid now than when I was younger. My drams these days are often very vivid, and I think this my have been potentiated by psychedelic use.</p><p>My second lucid dream I failed to write down and can't remember much of now. It involved discussions on ketamine, Banisteriopsis caapi extract and lots more flying.</p><p>I've never had two vivid lucid dreams in a row in the same night. The mood lift that followed this lasted into the next day.</p>"
}
