{
 "title": "Organic Chemistry",
 "author": "Lorax",
 "citation": " Lorax. \"Organic Chemistry: experience with Ether & Cannabis (ID 56002)\". Erowid.org. Dec 4, 2007. erowid.org/exp/56002",
 "substance": "Ether & Cannabis",
 "bodyweight": "150 lb",
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I would consider myself very experienced in almost every area of the drug world.  So it seemed like any typical wednesday, three classes and an organic chem lab.  But, little did I know we would be using a fairly substantial amount of ether in the days lab.  I went with my basic impulses and got my hands on about 40 ml of some lab grade raw ether.  Road the bus home surrounded by about 30 people that could diffently smell the ether seeping out of my back pack.</p><p>Once home I shortly picked up a half sack, and proceded to smoke a good portion of weed for about 2 1/2 hrs.  Then it was time for the ether.  We went into one of my buddies bathroom and dosed the rag with ether.  As I inhaled I felt almost a cooling sensation in my nose and the back of my throat.  The effects werent all that immediate, it took the rag to get back to me about 2 times before I really started feeling it.  It feels like a really downed out kind of drunkness.  I was diffinitely feeling like I was in slow mo, not so much my thoughts, but my body seemed really sluggish.  But the almost euphoric feeling is incredible and I now know why people get into ether binges.  Because after I hit the rag I knew instantly I was going to do all the ether that night.  Just wish I had some more or knew somewhere else to get that shit.</p><p>I would do it again in a heartbeat.</p>",
 "year": "2005",
 "id": "56002",
 "gender": "Male",
 "timestamp": "2007-12-04T08:00:00.000Z",
 "views": "10484",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": "40 ml",
   "administration": "inhaled",
   "substance": "Ether",
   "form": "(liquid)"
  }
 ]
}
