{
 "title": "Spirits All around Me",
 "author": "Anonymous",
 "citation": " Anonymous. \"Spirits All around Me: experience with Diphenhydramine (Benadryl) (ID 56017)\". Erowid.org. Jun 23, 2007. erowid.org/exp/56017",
 "substance": "Diphenhydramine (Benadryl)",
 "bodyweight": "180 lb",
 "report": "<p>I'm searching for  someone to buy me alcohol for 2 hours. I start to realize that I'm not going to get any for the night. I think What would be a good drug! I didnt want to do DXM again because it screwed up my body for days, and I have school in the morning. I decided to get some Benadryl.</p><p>Me and my friend both take 400mg of the pills orally at 11:30 pm.</p><p>We sit around for an hour waiting for the effects to kick in, then we decide to go back to my dorm. I'm checking out websites when I decide that I need some water because my mouth is extremely dry. I stand up, and feel extremely drunk. Its hard to move.</p><p>Around 1:00 I'm listening to music on my computer and looking at my background. I see a little man rapping to the song in my background. This was kinda cool. This was my first hallucination. I look back at my friend who is staring off in the distance, and try to tell him what I saw, but I cannot think well enough to speak. I get a few words out, but not enough to explain what I saw.</p><p>We go outside to smoke a cig. The sprinklers are going in a field right in front of us. I look at the sprinkling water and then I see what looks like spirits. They are invisible, but you can still see them. The move like water. Some of them started coming towards me. They would grab at me. I kept hearing scratching noises. This freaked me out so we went back inside.</p><p>I decided to try to go to sleep. I lay in my bed for hours trying to sleep, but I couldnt. I would open my eyes and see the spirits all over my room. They scared me! I started to pray, because they looked and seemed demonic. They were all coming at me and reaching for me. Itold them to go away, and tried to forget about it and go to sleep.</p><p>After a while I finally went to sleep, and  woke up the next morning felling fine.</p><p>This is a very strong drug. Much stronger than what I would expect. It was pretty cool, but scary.</p>",
 "year": "2006",
 "id": "56017",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-23T07:00:00.000Z",
 "views": "5408",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 }
}
