{
 "title": "Tree of Life, and Living Flame",
 "author": "Naughty Fairies",
 "citation": " Naughty Fairies. \"Tree of Life, and Living Flame: experience with DPT & Alcohol (Wine) (ID 56056)\". Erowid.org. Jan 11, 2007. erowid.org/exp/56056",
 "substance": "DPT & Alcohol (Wine)",
 "bodyweight": "110 lb",
 "report": "<p>Bodyweights: 110 lbs and 140 lbs</p><p>Dose: 35 mg insufflated</p><p>My friend and I decided to try some DPT together. We are completely at ease in each others company and wanted to celebrate her return from what had seemed like a long absence by exploring our souls once we had caught up on news! We were in my tranquil house, undisturbed, at dusk in the summertime. We lit a couple of oil lamps made from a nautilus shell and a giant conch. We hadnt eaten for several hours. We had shared a bottle of wine and a few cigarettes.</p><p>My friend has never tried DPT before, Ive experimented with it orally  some time ago  but snorting it this time significantly intensified the effect (surprise!). We found that the experience utterly defeated our usual impulse to analyse our trips verbally/in writing afterwards. Instead, a record of our conversation at the time might convey something of the nature of the experience.</p><p>About 10-15 mins after insufflation</p><p>C  Im not sure what to make of it, are you? It feels very overwhelming.</p><p>A  I feel as though Im rolling along on waves.</p><p>C  Yes, thats a good description.</p><p>A goes out into garden to pick flowers and returns with lavender, nigella and snapdragons.</p><p>C  How on earth did you manage to coordinate that?!</p><p>A  I dont find it hard to move. Im just adjusting to how this feels.</p><p>C  I cant budge. Im not sure how Im finding this.</p><p>A  No. It doesnt feel threatening in any way, though. Not edgy like 2CE.</p><p>C  No, its very beautiful.</p><p>Some conversation, which feels like an effort</p><p>A  I dont particularly feel like talking, do you?</p><p>C  No, not really.</p><p>Silence</p><p>C  Im not finding it very comfortable. Im not sure I like it  theres a kind of acidic edge to it. And its very acute.</p><p>A  The taste of it in the back of the throat probably doesnt help!.</p><p>C  No.</p><p>C goes to be sick</p><p>A  Are you OK?</p><p>C  Yes, I just physically didnt feel too good. But Im OK. Its very powerful stuff. Very intense.</p><p>A  Yes. Im still working out what kind of space were in. But everything is very altered. It has a sort of hushed quality to it, very still.</p><p>C  Yes.</p><p>[About 45 mins after insufflation]</p><p>A  Strange. Im not being funny but I can feel my chakra points, can you? In my palms. The top of my head. And here, and here and here Its flowing in through my palms.</p><p>C  Yes! Only its not just flowing in there, its the most enormous rush all the way through, upwards.</p><p>C  Oh, thats the most beautiful thing I ever saw. I dont know how to describe it.</p><p>A  Im not getting visuals at all.</p><p>C  I cant believe what Ive been seeing.</p><p>A  Ill try closing my eyes No, nothing. But I feel glowing. Like I am spread out into everything around me.</p><p>C  Im sorry, Im not being much company.</p><p>A  No, I feel the same way, lets not spoil this by trying to describe it. We can compare notes tomorrow.</p><p>C  Yes. This is absolutely amazing.</p><p>A  Isnt it.</p><p>C  What do they call it, that church that uses this as their sacrament?</p><p>A  The Temple of the True Inner Light.</p><p>C  Yes. I cant wait to write about this. But I dont know what to say about it.</p><p>A  There are no words for it, are there?</p><p>C  No. Perhaps its best not to even try.</p><p>A  I hope this really is the nature of things, do you?</p><p>C  How could it not be?</p><p>A  It seems that way, doesnt it.</p><p>C  Yes.</p><p>[A couple of hours later]</p><p>C  Im coming down a bit now, are you? Do you want me to leave you to it for a while? I dont want to spoil it for you.</p><p>A  No, Im happy to talk. But I still feel  weightless. I can feel my body, but its as though its without substance. Im dissolved into all the space around us.</p><p>C  That was a very intense peak, for me, but it seems to be over now. Its gone like this [makes a series of jerky up-and-down gestures with hand].</p><p>A  For me it has been constant and steady, and very calm. Im still there. I feel  like that flame [pointing at the oil lamp]. Like that, exactly.</p><p>C  [Laughs] Say no more! Enjoy it!</p><p>The intense period lasted perhaps a couple of hours, but the sense of tranquillity and joy permeated the entire evening. We mused a little later on the fact that although the set and setting undoubtedly helped to make this a beautiful experience, we could not imagine feeling substantially different even if we had taken the DPT in another kind of environment. We felt there was a very safe and reassuring feel to it. The only snag was the nose burn, and sniffing so much we sounded like a pair of cokeheads.</p><p>For me, none of this was at all visual. When I went out into the garden, for example, to get the hang of the come-up, nothing looked different: it just felt very different. With closed eyes I saw nothing, either  I just felt completely transcendent, for want of a better word. C, on the other hand, was able to see herself at the base of an immense tree, and describes it as best she can like this:</p><p>'The tree was massive, very like some of the ones I saw when I was in the Amazon, overwhelmingly huge and ancient. I was very aware of the texture and smell of its bark, almost as if I were tasting it. I was lying at the base in amongst all the stuff one finds on a jungle floor, soil, leaf litter, undergrowth, insects, staring up the length of the trunk which disappeared off into the distance. There was a blinding light at the top that came rushing down to meet me and as it did I felt like I was being propelled upwards towards it while the tree cradled me in its giant root system.'</p><p>Reflecting on my own previous experiences with other people, and on the individual nature of our own responses to it this evening, we mused that it seems to give you what you most need. A very powerful substance that we look forward to exploring further.</p>",
 "year": "2006",
 "id": "56056",
 "gender": "Female",
 "timestamp": "2007-01-11T08:00:00.000Z",
 "views": "5125",
 "dose": [
  {
   "time": "0",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ]
}
