{
 "title": "Typo",
 "author": "Thabee420",
 "citation": " Thabee420. \"Typo: experience with Clonazepam (Klonopin), Cannabis & Alcohol (ID 56084)\". Erowid.org. Aug 26, 2009. erowid.org/exp/56084",
 "substance": "Clonazepam (Klonopin), Cannabis & Alcohol",
 "bodyweight": "255 lb",
 "header": [
  "DOSE: T+ 0:00",
  ".3 g",
  "smoked",
  "Cannabis",
  "(plant material)",
  " T+ 0:30",
  "2.5 mg",
  "oral",
  "Pharms - Clonazepam",
  "(pill / tablet)",
  " T+ 0:50",
  ".2 g",
  "smoked",
  "Cannabis",
  "(plant material)",
  " T+ 3:50",
  "12 oz",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  " T+ 4:30",
  ".3 g",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>T-0:30</p><p>INGESTED: .3g Marjuana</p><p>Smoked five large bong hits to get me going for the evening, it is exactly 9:00p.m. my time, and I plan on dosing a little before 10:00p.m.  I'm feeling pretty high off of the marijuana.  I plan on taking a shower to refresh myself for the night ahead.</p><p>T-0:15</p><p>Just got out of the shower and I'm feeling very refreshed.  I've still got a nice weed buzz going and my eyes are a little red still.  I'm getting ready to dose here in about fifteen minutes.</p><p>T 0:00</p><p>INGESTED: 2.5mg Klonopin</p><p>Just dosed 2.5mg Klonopin.  I took two 1mg pills, one solid and one broken in half.  I also took an additional half of a 1mg pill.  Not that bad of a pill taste really, kind of a light bitterness in the back of the throat when drinking iced tea.  I've tasted much worse pills.  Getting my usual pre-buzz jitters, especially since it's the first time I've tried this drug.  I have, however, tried a few opiates (Methadose 20mg tablets) and benzos (Valium, Xanax).  I'd like to take the time to tell you a little about myself.  I am nineteen years old and weight approximately 250Lbs, at 5'11'.  I have been smoking marijuana daily for the past seven years of my life.  I experimented with acid when I was fifteen, went on an E binge between 16-17 and then went back to bud.  I occasionally pop Valium, Xanax and Vicodin whenever it is available to me.  When I found out that I could get Klonopin, I jumped at the chance to try a new drug.  I'm going to finish watching this movie which should end in about thirty minutes or so.</p><p>T+0:15</p><p>Just smoked a cigarette and I'm debating as to whether or not I want to hit my bong.  I might as well, since I doubt the affects around going to hit me for a little while.  I ate somewhat of a big dinner about two hours ago and I still feel a little bit of it churning down there.  Yeah, I'm smoking my bowl.</p><p>T+0:20</p><p>INGESTED: .2g Marijuana</p><p>Just took three nice bong-hits with some of my highs.  I figured I'd waste some of the goodness because I plan on getting messed up tonight.  I'm about to kick back, check out a few websites and check back here in a few minutes.</p><p>T+0:30</p><p>Starting to get a few effects.  Most likely from my excellent weed buzz, but the Klonopins might be kicking in.  My head feels a little spaced out, the keys feel a little more difficult to hit and I find myself stopping in mid-thought and then resume as if nothing happened.</p><p>T+0:35</p><p>It is definately kicking in right now, either that or I'm getting a really good placebo effect.  My vision seems a little spacy and it's getting harder to focus on objects, I'm also getting a little bit more tired.  That might just because it's the end of the day and I'm getting naturally tired, I'm not too sure.</p><p>T+0:40</p><p>Just stood up and walked around for a minute or so, time seems to be moving very slowly.  It is difficult walking around the room, I kept wanting to lean on things and at times my legs felt weak.  I'm about to play a video game for a minute or so since I have nothing better to do at the moment.</p><p>T+1:40</p><p>Very strong high, very similar to drinking on marijuana.  The keys are getting very difficult to hit properly.  I kind of like this drug since I haven't smoked a cigarette in over an hour.  That is very unusual to me.  That last hour seems to have flew by.  I just turned on some Led Zeppelin and I'm enjoying some nice calming affects.  At the moment, I have no worries in life (Not that I had any to begin with).  Cigarettes taste a little different right now, usually my full-flaver tastes sweet, but it left a nasty aftertaste when I smoked them this time.  I almost feel like I don't want to smoke this, but I know I'll get irritable and pissed off if I don't.  I'm about to go wander around my house for a few minutes.</p><p>T+1:53</p><p>The effects are definately great.  I had quite a bit of difficulty walking around and I kept finding myself having to prop myself on objects.  My typing is severely decreased, but I don't find myself making too many mistakes.  I plan on looking at my eyes in the mirror here in a little bit.  I'm definately feeling the drowsy affects of this drug.  It almost feels like I just want to turn off all the lights, lay down on my bed and just zone.</p><p>T+2:52</p><p>I've baselined at the peak it seems, my motor skills aren't as bad as they were about forty-five minutes ago, but they're still not great. I plan on drinking a can of Budweiser and smoke a bowl here in a few minutes to bring the buzz back up.  Overall, I am liking this buzz very much, it is a typical Benzo 'downer' buzz, but you feel more high than anything.  It's a great buzz, I highly recommend it.</p><p>T+3:20</p><p>INGESTED: (1) 12Fl. Oz. Budweiser 5.0% Alc/Vol.</p><p>I can feel the buzz start to deplete and I am becoming extremely tired.  The buzz so far has been awesome, I have noticed great increases in my creativity.  I'm also starting to develop a little indigestion/ heartburn, but it's nothing that I haven't dealt with before.  The beer is going down very well, I usually don't drink anything under 7.0%, so it kind of tastes like sweet, carbonated water.  I am thoughouly enjoying it, I'd like to experiment with lower doses of Kolonopin and higher doses of alchohol.  Once I finish this beer I'm going to go take a piss, and pack myself another good-night bowl since I feel that this evening is coming to an end.  I just stood up to grab my cigarettes from my counter and got a whicked head-rush, that definately stepped up my buzz.  I'm still staggering around more than usual.</p><p>T+4:00</p><p>INGESTED: .3g Marijuana</p><p>I finished off the beer and it definately kicked the buzz up just a notch.  I didn't help my indigestion, though.  I plan on taking a few bong rips here in a minute to end my night.  Marijuana seems to make a great ad\\dittion to this experience.</p><p>OVERALL:</p><p>I found that a 2.5mg dose, was more than enough to provoke a very good buzz.  It is now T+5:00 since I dosed and I still have a very strong buzz.  I plan on enjoying myself the rest of the night, listening to Led Zeppelin.</p>",
 "year": "2006",
 "id": "56084",
 "gender": "Male",
 "age": "19",
 "timestamp": "2009-08-26T07:00:00.000Z",
 "views": "18252",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": ".3 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 0:50",
   "amount": ".2 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": " T+ 3:50",
   "amount": "12 oz",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "4": {
   "time": " T+ 4:30",
   "amount": ".3 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
