{
 "id": 5609,
 "title": "Herbal Ecstasy",
 "date": {
  "submission": "2007-09-06T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jackflash",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200",
    "grams": 0.2
   },
   "administration": "oral",
   "substance": "Ephedrine",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": {
    "unit": "glass",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": {
    "unit": "cig.",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200",
    "grams": 0.2
   },
   "administration": "oral",
   "substance": "Ephedrine",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material",
   "specific": "Hash"
  }
 ],
 "report": [
  "During a recent trip to Amsterdam I came across a herb called Ma Huang or Ephedra in 'Smartshops' that sold other products like mushrooms, mescaline and DMT. I was told that these 'supercaps' were the strongest Ephedra containing product and contained 50mg of Ephedrine extract standardized.  I decided to purchase 8 capsules and head on to a coffee shop where I dropped 4 with a beer and a skunky spliff.  I went about my day until about 2 hours I felt a sudden rush of energy, like coming up on E. This lasted for about half an hour and leveled off to a nice speed/coke like high with tingling sensations running from my head to my toes.",
  "A few hours later I dropped the other 4 and went to a dance club, where I danced for hours. On returning to the hotel in which I was staying I could not sleep and spent the entire night smoking weed and hash. I eventually got 2 hours sleep before having to check out the hotel at mid day and felt reasonably O.K. It wasn't till I got outside I realised how bad I felt. The strain these caps put on the heart and its muscles were quite bad and I could not eat the entire day.",
  "These things definitly do work, but just because they are 'herbal' does not mean they are safe to use. I would prefer to drop an 'E' than go through that again. I thought my heart was seriously going to explode."
 ],
 "erowid": {
  "id": "32965",
  "citation": " Jackflash. \"Herbal Ecstasy: experience with Ephedrine, Cannabis & Alcohol (ID 32965)\". Erowid.org. Sep 6, 2007. erowid.org/exp/32965",
  "substance": "Ephedrine, Cannabis & Alcohol",
  "views": "14555"
 }
}
