{
 "id": 5610,
 "title": "Utter Beauty frome Everywhere",
 "date": {
  "submission": "2004-08-16T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Rami",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.0 mg",
   "administration": "rectal",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "7.0 mg",
   "administration": "rectal",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:30",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Location:\t\t\tCoventry Coombe Abbey",
  "Time of Ingestion:\t\t1pm",
  "Dose:\t\t\t\t7mg each 5MEODiPT and 2CB rectally",
  "Set:\t\t\t\trelaxed/positive",
  "Wow!!! Where to begin. Firstly let me say that I was first acquainted with this combination last year and was surprised by the synergy -- very much like 2ct7+bees but with more clarity - a wonderful colourful combination. I had chosen as the setting for this trip the Coombe Abbey near Coventry. The journey was without doubt one of the most visually rich in my life so far from a PEA. Coombe Abbey is a large grand house built on the remains of a Cistercian Abbey set in 450 Acres of beautiful gardens, meadow and woodland that contain many hidden treasures well suited to the attentions of the tripper (including impressive wooden sculptures that peer from trees -- there is even a praying priest carved from a huge redwood still rooted in the ground and a little girl that seems for all the world to be Alice in wonderland).",
  "I have always used 2CB in the low to medium dose range, which for me enhances visual acuity without adding too much distortion. In this state of mind, beauty seems to exude from everywhere. In the gardens, the stone, lichen and moss are iridescent tans, turquoise, brown and green. The maze and topiary in front of the facade of the building are truly stunning as they overlook a large water feature, flanked by willows and flowers, opening to a lake -- proportionally breathtaking. Overlooking the lake is a small sandstone gazebo beside a large tree. The strata of the weathered sandstone is immediately obvious to me and the red colour and rough hewn appearance of the stone is a delight - this type of stone is common in Coventry and will be known by any who come from there. The walls of the old city, although largely absent nowadays, was constructed of this stone. The tree beside the gazebo is a lesson in art and I marvel at the palette necessary to recreate such a masterpiece. Observed together with the house, gardens and lakes as backdrop the tree and gazebo look utterly enchanting - the stuff of fairytales.",
  "In another part of the formal gardens just a short walk from the gazebo is a ring of eight small ancient looking stones, collectively supporting a wrought iron ring which in turn supports an old gnarled climbing plant. The whole thing is only two foot high. Within the stone circle is a smaller circle made of edging stones that together forms a path roughly four feet in diameter that can be circumnavigated. In this state of mind this beautiful feature takes on mystical significance and I spend a short while in contemplation, unable to drag myself away. Each time the sun appears from behind a cloud colour, texture and hue scream for attention as the rays of the sun appear to animate all they touch. The mottled and rusted surface of the iron defies explanation. How can such mundane and trivial objects hold such significance and beauty? Is this how children see? Certainly, as I watch a group of two year olds run themselves giddy around the circular path does it seem that they are enjoying some quality hidden from the eyes of their parents who appear not to give the structure a second look.",
  "In fact this situation appears common as I look around. Everywhere there are adults, preoccupied with other matters, who do not share the wonderment of their offspring - their attention focused not on the present moment but elsewhere, and it shows. I go through fleeting moments of emotion - paranoia that I may be giving just a little too much attention to the mundane, sadness that others around me are missing the joy that I am experiencing and always there's this desire to scream at the top of my voice proclaiming the wonder of all that I am seeing, hearing and feeling in the hope that someone will take heed and question their own judgment on these truly miraculous substances. The sadness I feel that so many of my fellow man are denying themselves the chance to live this experience on the flawed guidance of an ill-informed society is enough to make me weep.",
  "Nearby are ancient trees of every description, yews, oaks and huge redwood conifers that cover a nearby hillock -- standing amongst those giants was again visually spectacular. I sensed every textured inch of the rough fissured bark, which glowed deep red. Moss contrasted the red with a succulent emerald green -- everywhere I looked there was beauty, intense colour and incredibly detailed texture that at times felt like too much information and at times left me physically salivating - It was delicious. The day was broken cloud and sunshine and it looked like the whole world was out for the day. There were hundreds of toddlers about and their antics made me laugh and smile many times. At the peak it just felt so wonderful to be alive and as with so many other trips I again found myself thanking the universe for begetting me. I was highly aware of the now ness of each moment and was entranced by the thought of my trip being forever frozen in time, that the moment I was living being forever immutable in time, the ripples of causal effect (including your reading this) being propagated throughout eternity.",
  "At around 3:30pm the descent started and I began to smoke MJ until around the 5pm mark. I felt physical after effects for about 6 hours but as I write this some 8 hours later I feel greatly relaxed, satisfied and looking forward to the next time"
 ],
 "erowid": {
  "id": "32968",
  "citation": " Rami. \"Utter Beauty frome Everywhere: experience with 5-MeO-DiPT & 2C-B (ID 32968)\". Erowid.org. Aug 16, 2004. erowid.org/exp/32968",
  "substance": "5-MeO-DiPT & 2C-B",
  "views": "16539"
 }
}
