{
 "title": "Nature's Therapy",
 "author": "Inferiosity",
 "citation": " Inferiosity. \"Nature's Therapy: experience with MDMA (Ecstasy) & Cannabis (ID 56123)\". Erowid.org. Mar 30, 2007. erowid.org/exp/56123",
 "substance": "MDMA (Ecstasy) & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "56123",
   "Male",
   "",
   "Not Given",
   "Mar 30, 2007",
   "37660",
   " "
  ]
 ],
 "report": "<p>We were camping in the mountains.  My brother, his girlfriend, and I.  It's always been slightly uncomfortable between me and my brother, due to the childhood we had shared and had not shared.  He was kicked out at 16, and me, 11 years younger, had only home videos to remember him by.</p><p>I was 16.  They picked me up around 3 friday morning, and we spent four hours driving around looking for an open campsite.  All of us being stoners, we decided to stop and toke up.  Curiosity aroused, both of them watched me take a bong rip.  My brother had introduced me to pot 2 years earlier, and since then I had gained much expirience on my own.  Once the pot kicked in, the vibe in the car changed immensely.  Understanding and love flowed between us all, hope driving us to keep looking, four more hours until we settled on a deeply secluded spot away from anyone else.  </p><p>Tired and weary, in the early morning sun we set up the tents and unpacked the car.  The memories are blurry, only the hungover mornings were spent sober, awkward, clear.  </p><p>The second night, after a wonderfully sunny day swimming at the river, with some hesitation, I decided to join my two companions in an Xtasy ride.  We cooked dinner, built the fire, turned on the car stereo (reggae, bob marley), toked up, and dropped the x.  They each had two, while I only took one.  </p><p>I had no clue what I was in for.</p><p>Within 20 minutes, I started feeling exceptionally cold.  My brother let me borrow his jacket, and I scooted very close to fire.  Nature, marley, and the fire washed over us, cradling us, making the world perfect.  The fire was entrancing.  After about 40 minutes, The first wave started to hit.  It was mind-blowingly fucking incredible.  I finally understood.  My eyes had been opened.  </p><p>Love is a feeling unlike any other.  In my life, I had only smelled this feeling, similar to smelling a pizza and having a faint clue as to what it would taste like.  But on X,  I felt   had a whole meal of love.  There is no way of describing it.  </p><p>If I wasn't so stoned, I would have gotten down on the ground, and hugged the earth.  </p><p>My vision was strange.  In retrospect, I realize I couldn't really focus on anything, everything was sort of pixelated, or tunnelled.  I was two people at once as well, one of them completely uninhibited, spouting off my thoughts to my companions, forgetting everything I said a moment later.</p><p>The other was lurking in the back, a bit cautious, tentatively testing this new world with all the memory of sober reality it could.  One startling insight had become real to me.  I understood how deep my lack of self-confidence truly went.  I realized that if I WAS confident, I wouldn't even have questioned the fact.  I would of known it.  There was so much more to it, but it was one of those things that only you can really understand.   </p><p>Maybe an hour of this.  And suddenly, I snapped out of it.  The first wave had fallen back.  I was terrified.  Regretting my descision.  Depressed.  Panicked.  I honestly considered suicide.  This was probably the worst part of the x.</p><p>The second wave started again.  Everything was ok.  It was nothing like the first wave, but that didn't matter, becuase the horrible feelings had stopped.  I could continue my therapeutic journey of love.</p><p>The fire was low on wood around this time, and my brother drove off to get some more.  I remember feeling apprehensive about this, worrying a bit about his driving capabilities, about being left alone with his girlfriend.  </p><p>Time went by, and we struck up idle chatter.  I remember thinking how incredibly stupid she sounded, how incredibly stupid I sounded.  And I realized we must both be feeling the same thing, complete lack of inhibition, careless thoughts, leading to unintelligent speech.  I didn't like feeling stupid.  Memories of Cops television show came, of druggies and how messed up they acted.  Was I one of them?</p><p>Third wave picked up. A sensation of heat was felt deep within my head.  My imagination led me to beleive that I was 'Burning Out' my dopamine receptors, that If somehow I continued to feel the euphoria, the heat would finally destroy the pleasure nodes in my brain and I would be depressed forever.  I realized I had just expirienced the second wave crash, and was immediately satisfied that I wasn't screwed up for life.  The second crash was nothing compared to the first. </p><p>Brother comes back with wood after what seems like hours.  We resume staring at the fire, feeling the reggae.  The X finally left me completely.  I felt dissatisfied.  I asked if they had any more almost instinctively, as if I had no control over my drug use.  Of course they didn't.   I started to realize how addictive this feeling could be, how important it is to do it properly, sleeping before the crash, in the right settings, with the right tools.  </p><p>I can't remember going to sleep that night, all I know is that I woke up in the superheated tent with my feet sticking out the unzipped door.  Mosquitoes had found there way to the inner-top of the tent.  I felt pretty good.  A bit hungover from all the pot use, but that was to be expected.  I didn't get enough sleep due to the sun over-heating my tent, but eventually my companions awoke and we resumed toking the sweeeet weed.</p><p>At the end of the camping trip we never spoke.  We were all sober, changed, awkwardly aware of each other's presence and the expiriences we had shared.  I was still wondering if my brother's girlfriend was as stupid as I found her during the X, as well as sorting through all of my other thoughts.</p>"
}
