{
 "id": 5615,
 "title": "Out of Our Mind",
 "date": {
  "submission": "2005-09-27T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Puffer",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "insufflated",
   "substance": "2C-I",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "2c-I is a hell of a drug. I consider myself rather knowledgable with experimenting with the usual round up of drugs, from acid, E, meth, coke, just about everything, so to try this new drug (new to any of us), was a very exciting time.",
  "Setting: At my friends house in the middle of the woods of New England about 8p.m. Including myself there were 6 of us there, not anywhere expecting what we were in for that night.",
  "8:00pm- Despite reading reports that snorting this substance was not worth it because of the pain, we wanted to make the most out of the 500mg I had purchased. Foolishly we eyed out the amount we would do, about 30mg each, and blew away.",
  "8:15- The burning of our noses has really set in now, it took about 5 minutes for it to start. This burns like hell. At least 5x worse than meth. A small body buzz was starting to come on, which came with a stomach problem, only half of us every felt nauseous though.",
  "8:30- Vision is different, motor and thinking skills are fine, yet burning of noses was still one of the only things we could think about. At this point I threw up, it was mostly the juice I had just been drinking, but also almost a foamy substance (this also happened to me the next time I took 2c-I). This only made me feel better, and encouraged everyone else to do the same.",
  "8:45-The burning was basically gone, lots of visual distortion simmular to what E would be like.",
  "9:15- mc chris is in the cd player, and all of us are out of our mind. We believe that we were totally feeding off the music. While songs were playing, all we could do was laugh uncontrollably, none of us had much control of what we were doing, nor do I remember thinking much during those times. Yet while the songs changed, or it was a skit, we would all just look at each other and ask 'what the hell is going on?' Visuals were like nothing I have ever seen. I guess to best describe it, its like looking at one of the picture books where you have to stare to see the picture, well like that, but with whats in front of you. It was not like this constantly, but other times very cartoonish. Also the trails are incredible. People that are walking seem to be spread out 4x as long as they should be, arms are being swung in circles yet looked like one continuous circle.",
  "10:30- WHAT?! It's only 10:30 and it feels like we have been there for quite some time. We are straight up tripping, still peaking.",
  "11:00- We are down a little, more time that we can actually communicate with each other, but without knowing what is actually going on in our heads, or actually going on. At this point I would consider I was feeling like I had just smoked a lot of salvia. For those who have not tried that, I like to call it the movie feeling, cause I feel like I am a character in a movie that is going on, but not really there. Somehow we smoke a few bowls of weed, and this just brought us right back up.",
  "1:00am- Still tripping pretty well, yet down considerably. We still managed to get lost in my friends yard, which was rather frightening.",
  "4:00- finally down enough to sleep, very easy comedown after a long night.",
  "Overall Feelings and Thoughts: I warn you, be cautious choosing this chemical if you have not tripped before, or are very experienced. Visually I saw more than I ever have on acid, not as much mind bending thought and confusion acid causes though. A tripsitter would be a very good idea. I have done this 4 times since that night, and loved everytime. Back to back use though seems to be a little tolerance build up. My body took it fine, besides throwing up like that, but virtually no hangover, just a little tired. Also I didnt have a scale, and now that I think of it, I had 500mg, with 14 doses used, so thats about 35 mgs."
 ],
 "erowid": {
  "id": "32983",
  "citation": " Puffer. \"Out of Our Mind: experience with 2C-I (ID 32983)\". Erowid.org. Sep 27, 2005. erowid.org/exp/32983",
  "substance": "2C-I",
  "views": "3319"
 }
}
