{
 "title": "First Trial and Impressions",
 "author": "E1evene1even",
 "citation": " E1evene1even. \"First Trial and Impressions: experience with 4-AcO-DMT (ID 56260)\". Erowid.org. Oct 17, 2006. erowid.org/exp/56260",
 "substance": "4-AcO-DMT",
 "bodyweight": "150 lb",
 "report": "<p>Yesterday I had my first trial with this compound. Since 4-AcO-DMT is still very new and first hand accounts are lacking I thought I would post my experience.</p><p>The dosage was in capsule form on a mostly empty stomach and was estimated to be between 8-12mg (measured with an American Weigh DIA-10 milligram scale, not the most accurate in my experience.). I wanted to see how this would compare to a low dose of mushrooms (1-1.5g) and also other RCs like 2C-I and 2C-T-2 in the same dose range. This was my first trip in 2 weeks and my third in the last month.</p><p>Within 30 minutes I was definitely starting to feel it. I felt sedated and decided to lay down for the come-up. I seem to feel the urge to lay down at the beginning of many of my trips so this was not out of the ordinary. The come-up was faster and more intense than I expected and at this point I was somewhat regretting taking the substance (I often have similar thoughts at the start of trips). The visual distortions were similar to mushrooms but seemed a bit more digital if that makes sense with trailing and also digital/glitchy audio hallucinations.</p><p>After lying like this for about 20 minutes, I decided to get up to put some music on. I also noticed mild time distortion at this point. I put on the album Takk by Sigur Ros and listened to this album from track 3 to the finish. I like to listen to this album during trips as I find it helps put me in a positive, introspective mood and the lack of English lyrics allows me to feel the emotions of the vocals, without the actual words having an impact. I found the music to be enhanced and very clear, similar to, but not better than an equivalent low dose of shrooms.</p><p>While tripping on mushrooms I can see complex fractal artwork with 3D-texture morphing from the marks on my kitchen floor. For example I may see dozens of couples embracing (like Hindu Tantric artwork) but this makes up one large picture etc. With 4-AcO-DMT I had a similar effect but it wasnt quite as obvious and this time I saw what seemed to be an image of a demon instead of something more uplifting. The thought came to my mind to try to consciously generate the feeling of love. I think on a very high dose of psilacetin (or anything else for that matter) when I get in any trouble (the ego is threatened, the world is dissolving around me etc) the key is to self-generate positive emotion and I will be fine. Perhaps this is obvious but seemed like an important insight, perhaps in preparation for higher doses.</p><p>Anyway the most remarkable thing about the experience was the brevity of it. In just slightly more than 2.5 hours after ingesting the capsule I was nearly back to baseline! I have noticed this with low dose shrooms recently as well.</p><p>In my opinion, of the RCs Ive tried so far (2C-T-2, 2C-I), psilacetin is the best by far. Better visual and mental effects with the least side effects. I think this is about as close to pure synthetic psilocin/psilocybin as any RC could be. There were subtle differences from mushrooms apparent even at this low dose, but I would expect that if I had pure psilocin/psilocybin it would also be subtly different as well.</p>",
 "year": "2006",
 "id": "56260",
 "gender": "Male",
 "timestamp": "2006-10-17T07:00:00.000Z",
 "views": "21798",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "4-AcO-DMT",
   "form": "(capsule)"
  }
 }
}
