{
 "title": "Crystal Mind",
 "author": "Coltrane",
 "citation": " Coltrane. \"Crystal Mind: experience with Salvia divinorum (ID 5628)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5628",
 "substance": "Salvia divinorum",
 "bodyweight": "130 lb",
 "report": "<p>I smoked Salvia Divinorum today for the fourth time..  the first three</p><p>times I simply got very dizzy and things were funny.  This time I was feeling adventurous so I cleaned out the slide in my bong and took two solid bong hits of the crushed dried leaves.  After halfway into the second hit I heard chirping noises, and felt a presence as if I was certainly not alone, and the noises were little creatures playing and laughing.. </p><p>I then quickly packed another bowl (which was slightly difficult, as if I were drunk) and took three more solid hits and held the last one.  Then I felt as though things were zooming by me..  I thought smiling 'I'm done' and put the bong out in the hall..  As I did so I felt massive hands bending me over at the waist and leaning me toward my bed that I prepared with pillows..  I said (I'm not sure if it was outloud) 'just a sec, just gotta put the bong in the hall, then I'll lay down.'  I did so, truly fighting a resistance, and returning to my bed I felt slammed into it (not painful at all).  I felt intimate with the force and trusted it fully. </p><p>I closed my eyes and immediately there was a beautiful woman.  I sensed that she had been waiting long to meet me and was a little shy, as if she didn't think that it was time to finally meet, but reluctantly took me by the hand smiling.  She took me into some kind of crystal palace that was stunningly complex.  It kept growing all around me, the crystals were</p><p>very much alive.</p><p>Then I became aware of my bed and truly felt the bed lifting and tilting so</p><p>that i was upright facing the wall (the feeling was amazingly real.. imagine laying on a bed and having people behind you lift it.. that's how it felt only I was magnetized to the bed)  I opened my eyes but everything was green and skipping around so I closed them again.  When I did this the bed turned to purple and green gasses and swirled all around me (only I saw this happen to myself from above (looking down on my head).  My body was positioned as someone in a casket.  I remember cherishing the feelings and the experience and I became aware that I should smoke more salvia (up to this point i forgot that i smoked... and even this thought was intertwined with the Woman.. as if I thought 'smoke' and conceptualized 'go see'.. very strange) and the woman became present again and smiled.</p><p>Then, I was flattened out and extened to become a long paper ribbon</p><p>whizzing through space.  I completely felt exactly like the ribbon, I felt my length and thinness and I spooled around myself and could feel myself gliding accross other parts of me through space.  And then I became aware that my father was connected to one end of me and suddenly I had thousands of ends connecting to thousands of other beings.. I could truly feel their presence.</p><p>Then I found myself outside of the growing crystal palace, with the woman</p><p>and man present (I couldn't always see them though).  Then she said something amazing:  'That is your mind.  Isn't it beautiful?'  (note that this is only paraphrase.. she said this without 'speaking') She said and I found that deeply erotic, as if she loved my mind.  I thought 'where is the sadness?'  And she gestured to the lower left of the place which black and pulsing.. above the black was the most beautiful part of the palace and she implied that the sadness gave life to the more beautiful parts of my 'palace.'  This was fascinating and I went through what seemed like an eternity watching the beauty spring from the dark.  This part was the most moving aspect of the trip, I am quite at peace now.  The images of the aqua-glowing-spiraling-growing crystals springing from my sadness was intense and I hope I don't forget this.</p><p>I highly recommend this plant.  It should be noted that it was exquisitely difficult to verbalize what i experienced.  Also, I think I had a good trip because i was not afraid of the physical force pushing me to my bed, and I communicated with it.  This almost gave me a feeling that I had power over the beings - almost.  It was more of a sense of them respecting me, appreciating me. Also, I only shortly lost sense of 'self' or 'ego' when I was the ribbon, but the rest of the time I retained my identity.</p><p>I look forward to more meetings with salvia and I will approach this plant with respect and for the right reasons (not to 'see crazy shit' or for a thrill).</p>",
 "year": "2001",
 "id": "5628",
 "gender": "Male",
 "timestamp": "2002-01-18T08:00:00.000Z",
 "views": "7209",
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ]
}
