{
 "id": 563,
 "title": "Unremarkable with One Peculiarity",
 "date": {
  "submission": "2001-12-26T08:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Samanthe",
  "gender": "Female",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I was given some 2C-T-2 pills by a friend who had been in the Netherlands. Being cautious with new materials, I decided to take 12 mg, and gave Gaichi somewhere around the same dose. I found this material unremarkable, and at times downright annoying. This may have been due to the fact that I took a light dose. The body load was pretty strong, I felt muscle tension and my eyes felt strained. It felt a lot like LSD, but not as juicy or fun. It was really cerebral; Gaichi and I talked about stuff in this really analytical way, but the meanderings felt unsatisfying and empty. I quickly felt like, OK where is this going, are we there yet?",
  "The only interesting thing that happened was this: Gaichi and I spent a lot of the trip (about 3 hours) sitting in bed, talking. I was holding court -- he would get up and leave my room to fetch anything I needed from the kitchen. He left 2 or 3 times for about 5 minutes each time. During the time he left the room and I was alone -- right after he shut the door after him -- I was suddenly awash in really interesting ideas and clear thoughts, and I wanted to share them with him as soon as he returned. When he was in the room with me, I didnt feel the same degree of novelty in my thinking, but hooboy when he left; Boom! A carnival of neat thoughts. I thought that was strange.",
  "I did not find it interesting enough to try again. I'll stick with 2C-B."
 ],
 "erowid": {
  "id": "11254",
  "citation": " Samanthe. \"Unremarkable with One Peculiarity: experience with 2C-T-2 (ID 11254)\". Erowid.org. Dec 26, 2001. erowid.org/exp/11254",
  "substance": "2C-T-2",
  "views": "7757"
 }
}
