{
 "title": "Its True Power",
 "author": "The White Rabbit",
 "citation": " The White Rabbit. \"Its True Power: experience with 2C-T-7 (ID 5631)\". Erowid.org. Mar 12, 2001. erowid.org/exp/5631",
 "substance": "2C-T-7",
 "bodyweight": "220 lb",
 "header": [
  "DOSE:",
  "40 mg",
  "oral",
  "2C-T-7",
  "(powder / crystals)"
 ],
 "report": "<p>This substance is one all parties need to respect regardless of past experience, age, or wisdom.  Last weekend I decided to take 2-ct-7 for the second time hoping for a more prominent response.  I recieved it in a powder form, supposedly weighed out to two doses about 20mgs a piece.  The first time I attempted taking this drug I took the cautious aproach, ingesting a very small amount of the 'blue mystic' powder.  I was disappointed receiving little more then trails and dialated pupils. There were no real visuals, and I was more clear thinking then ever.</p><p>This weekend I got a bit more cocky and paid heavily for it.  An hour after ingesting a moderate portion of my bag I began to feel a relatively intense speedy roll, normally associated with mdma.  I unfortunately don't care for this effect, making it more unpleasant.  Soon came visuals of intense proportions, nothing like I have ever experienced even on 500-600mcgs of LSD.</p><p>This lasted almost 12 hours.  The craziest aspect was the flashing lights and 'black hole' light effects 2-ct-7 produces.  As I walked down my hall to the bathroom it was as if the hallway had been cut into thirds moving asymetrically towards the apparent vanishing point at its end.</p><p>I laughed at its power, but more in shear amazement then in enjoyment. A word to the wise: 2-ct-7 is a powerful psychedelic and can surely be utilized responsibly.  However, it is not a drug for any newbie to psychedelics, and it can test the wits of even the most experienced psychonauts. </p><p>Please be responsible for this crushed me like no other psychedelic I have ever taken.  This warning comes from an individual who has been paid to sit over insane LSD and mushroom trips. 2-ct-7 can be enjoyed assuredly, but responisbility, support, and research should be undertaken before jumping into the colorful cavern it creates.</p><p>The White Rabbit</p>",
 "year": "2001",
 "id": "5631",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-03-12T08:00:00.000Z",
 "views": "11937",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 }
}
