{
 "title": "The Hole Runs Deep",
 "author": "Xiphoidfugu",
 "citation": " Xiphoidfugu. \"The Hole Runs Deep: experience with LSD & Cannabis (ID 56359)\". Erowid.org. Jun 14, 2007. erowid.org/exp/56359",
 "substance": "LSD & Cannabis",
 "bodyweight": "100 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "LSD",
  "",
  " repeated",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>I had been smoking weed for about a year and a half when I decided to try LSD.  I became hooked on it immediately.  I loved the high.  I used frequently, about twice a week, for almost a year.  I realize now that I had many bad trips, but I never realized at the time that it could be the acid doing what it did to me.  I would experience great feelings of anxiety and paranoia.  It even got to the point where I would experience minor hallucinations when I wasn't high.  I talked to a good friend of mine about it and he said he experiences the same thing and told me to just ignore it.  Thank god I didn't listen to him.  I knew I had to quit.</p><p>I quit doing acid and just stuck to weed for a while,  I stuck to weed for a while but realised the feeling weren't going away, even when I wasn't high I felt them.  Time to quit everything.  It was over a year before the feelings went away, it was very gradual.  It was during that year that I learned that any mind altering agent brought these effects on stronger.  I was helping a buddy paint a store and started getting affected by the paint fumes and had to leave him to finnish on his own.</p><p>Finally about 2 and a half years later I was free from these feelings (so I thought)  I decided one day that I was gonna test the waters when someone offered me a joint.  After just a haul or two off the joint and the feelings came rushing back.  I knew then that I would have to stay drug free if I wanted these feelings to be gone for good.  I haven't experienced these feelings since.  Painting and minor toxins no longer bother me, although I've only tested them in short bursts.  I'm not brave enough to test out prolonged exposure.</p><p>It took me a long time to openly admit to other people what I had gone through, for fear of disbelief mainly I guess.  I eventually opened up though and am glad for doing so.  I have to say though, I don't regret any of what I did or what happened to me.  I believe I learned a lot about people, life (morals,etc.) and most importatly myself from all of it.  So again I don't regret it, but I don't recommend it either.</p>",
 "year": "1995",
 "id": "56359",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-14T07:00:00.000Z",
 "views": "13094",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "LSD"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
