{
 "title": "Yohimbe - Use as Directed",
 "author": "Baxter",
 "citation": " Baxter. \"Yohimbe - Use as Directed: experience with Yohimbe (ID 5638)\". Erowid.org. Mar 13, 2001. erowid.org/exp/5638",
 "substance": "Yohimbe",
 "bodyweight": "175 lb",
 "report": [
  "<p> I have taken Yohimbe, on occasion, for about six years. I use it solely for the purpose of staying awake all night (or for several nights) and getting some work done. Yohimbe is great for this kind of thing.",
  "I take one tablet no more frequently then every 13 hours and I try to eat five meals each day that I'm on it. Very important to get all your vitamins, you know.",
  " One of the first times that I used it for prolonged sleep deprivation i had been on it for about 72hrs (lost my appetite after about 36 hours) and was getting pretty high just from deprivation. I drank three ice beers with some friends and woke up early in the morning with vomit all over me and the Lazy-Boy I had been sleeping on. I went to a bed, relived that I had not drowned in my own vomit and woke up with a terribly sore neck.",
  "Muscle soreness, especially in the back and neck, is prevalent after more than a few days in a row of taking Yohimbe. It is just something you must accept if you're a student caught in a bind with tons of work to do or if you're up for days in a row trying ot finish studio work. Yohimbe seems to enhance my creativity. Not remarkably, but noticably.",
  " I have never had a particularly difficult time getting to sleep while on it, either; Yohimbe seems to grant (me at least) free will for the user. However, I have noticed that if I take it for more than three days, on a regular sleep schedule or sleep deprivation, it doesn't matter; When I fall asleep I have a particularly unnerving feeling of falling through the bed. It's kind of weird but also this can transform to an eerie between-sleep-and-wakefulness experience where your mind is awake but the body sleeps. If you don't like that kind of stuff, be cautious.",
  " As for the 'aphrodisiac' effect, I have noticed no discernable difference in sex drive or performance, although I have noticed that it does tend to keep me erect for much longer than usual, so if that's the 'performance enhancement' you're looking for, it's all for you.",
  " My advice for those who wish to try out Yohimbe is:",
  "   * Don't mix with alcohol",
  "   * Buy it in capsules",
  "  * Read the label on the bottle",
  "   * Don't take more than twice the recommended dosage",
  "   * Don't use it just to 'get high'- it is much more useful when properly handled.",
  " Every time I read a negative 'experience report' I see the same pattern: 'I grabbed a bunch of this shit and I used way too much and this is how sick I got; I'm never using this again and I recommend that you don't either!'",
  "Well maybe there are some drugs out there- take heroin for example (to be pretty extreme), on which there should be extra caution observed. Don't take too much! Anything can be unpleasant if you have too much. Sugar, even. Eat a pound or two of sugar and you'll see what I mean.",
  "Just research what you're taking before you decide to take five times the regular dosage or whatever. It's worth it.</p>"
 ],
 "year": "2001",
 "id": "5638",
 "gender": "Male",
 "views": "37305",
 "dose": [
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "(capsule)"
  }
 ],
 "submissionDate": "2001-03-13T08:00:00.000Z"
}
