{
 "title": "LIke a Wellness Tea",
 "author": "Mr.Budz",
 "citation": " Mr.Budz. \"LIke a Wellness Tea: experience with Sassafras & Tea (ID 56394)\". Erowid.org. Jan 31, 2008. erowid.org/exp/56394",
 "substance": "Sassafras & Tea",
 "bodyweight": "160 lb",
 "report": "<p>I recently acquired a couple ounces of sassafras from a local health food store.  The woman at the counter told me the most common use was flavoring homemade root beer, but I had heard that when concentrated it was like a very mild, organic extacy.</p><p>I started by dumping two ounces of the red bark into boiling water.  After about a half hour of boiling, I strained out the bark and boiled off a little more water.  Im left with about a cup of dark, reddish brown liquid.</p><p>I'm a little sick today with nothing to do and ran out of all my keef last night, so I decide to give it a go.  I start brewing my favorite black tea: Darjeeling Mango.  Im pretty sure the caffeine won't detract from the effects, hopefully it will add to them.  After pouring the tea I add my usual one generous spoon of sugar, and then two generous spoons of the sassafras brew.</p><p>T: 0:00- Tastes delicious! Mango with a hint of bitter root beer.</p><p>T: 0:02- bye bye tea, even the chunks didnt taste bad.</p><p>T: 0:06- playing team fortress now feeling slight body high maybe a little more than the caffeine.</p><p>T: 0:15- Game is really fun, feel pretty floaty and nice, calmness spreading throughout me.  Laziness but I also feel clarity.</p><p>T: 0:27 laziness increased a little, some nausea, maybe because I havent eaten anything, gonna go eat.</p><p>T: 0:38 That food tasted almost better that when I'm stoned, and the sun felt great.  Im going to go put on some more black tea.</p><p>T: 0:45 Im feeling sober now, although with a feeling of relaxation and wellbeing.</p><p>In terms of narcotic value the dosage I took was not very effective, at no point did it give me extreme euphoria like I was hoping.  It did have a nice overall feeling, at that dosage it was like a wellness tea.  I feel relaxed and somehow healed.  I hope to get better results with a higher dose, or boiling of the water to make powder. </p><p>Peace and Respect</p>",
 "year": "2006",
 "id": "56394",
 "gender": "Male",
 "timestamp": "2008-01-31T08:00:00.000Z",
 "views": "15238",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Sassafras",
   "form": "(tea)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Tea",
   "form": ""
  }
 ]
}
