{
 "title": "Not Bad at All",
 "author": "Anonymous",
 "citation": " Anonymous. \"Not Bad at All: experience with Catnip (ID 56438)\". Erowid.org. Dec 23, 2008. erowid.org/exp/56438",
 "substance": "Catnip",
 "bodyweight": "160 lb",
 "report": "<p>After being a regular pothead for a good year, and as much as I enjoy it, I knew college wasn't the right place to be doing this as it was definitely messing with my studies. I had read about smoking catnip and other legal highs before many times but thought it wasn't worth it compared to good old weed. Well since I haven't smoked pot in a few weeks and decided to quit at least until the summer starts again, I got curious about some of these 'legal highs'. Catnip seemed the most easily accessible to me since theres a pet supply store right down the street. So I take a trip down there and buy a bag 3/4 oz of catnip for about 2 bucks and a cat toy to make it seem less weird.</p><p>I got home, packed enough in my pipe for a good 3 or 4 hits and smoked away. I felt nothing within the first 2 or 3 minutes but after about 5 minutes I was definitely feeling different. And it was good. I felt super relaxed and very mellowed out. It definitely isn't as intense a high as pot, but it feels really good. It gives me the relaxed feeling of smoking marijuana but without making me a giggling idiot for 3 hours. It felt really nice to just lay down on the couch and think about things for a while. Physically I felt nothing else different except my movement seemed a tiny bit heavier but maybe that was just in my head. Colors seemed slightly more vibrant and while I doubt it had anything to do with the catnip, I felt a slight inclination to play with my cat for 5 minutes or so. It peaked in about 10 minutes and I slowly came down for the next half hour. about 50 minutes after smoking it I think I've come down, and am now writing this.</p><p>Overall, it was a pleasant experience and if you're looking to chill out for an hour or so I definitely recommend it. I also like the fact I can keep it sitting around in my room and no one really questions it.</p>",
 "year": "2006",
 "id": "56438",
 "gender": "Female",
 "timestamp": "2008-12-23T08:00:00.000Z",
 "views": "23029",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "500 mg",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(plant material)"
  }
 ]
}
