{
 "title": "Glimpse Into Nothingness",
 "author": "forgiste",
 "citation": " forgiste. \"Glimpse Into Nothingness: experience with Salvia Divinorum (25x Extract) (ID 56462)\". Erowid.org. May 12, 2009. erowid.org/exp/56462",
 "substance": "Salvia Divinorum (25x Extract)",
 "bodyweight": "180 lb",
 "report": "<p>I had previously tried 40x Salvia, from the internet and from a local shop, and neither one got me much farther than strange repeating patterns and sounds.  Today, however, would prove differently.</p><p>After a little disappointment with 40x, I went back to the same shop and purchased 1 gram of 25x.  After clearing about 2 of my friends hits (he coughed most of it out), I decided to give him some and send him on his way with one of the glass pipes I got for free from the shop.  After he left is when the real nightmare began.</p><p>I used my medium sized red and black water-pipe for this hit.  During all of the other trials, I had neglected to close my eyes, so I vowed to do so this time.  I did the hit, noticing that this 25x was quite a bit more harsh on the throat than the 40x.  I held it for what I think was about 30 seconds, and exhaled, immediately launching me into another world.</p><p>It was similar to the strange noises and patterns I had before, but this time it has a complete stranglehold over me.  During all of my previous trials, the sounds and patterns had always taken on a rather feminine presence, and this experience was no different.  I was shown a new world full of strange patterns that were created as I went along.  In fact, the act of closing my eyes after the hit kept repeating over and over in my mind, with the light cutting off into darkness.  I lost control of my actions and was constricted to my bed by what felt like a very strong gravity.  Memories and visions rushed past my eyes in the darkness, and they kept repeating over and over.  In this world, there were no shapes, rather the definition of a shape was changed to a repeating visual motion.  So everything was made up of repeating motions, and every motion produced a repeating sound.</p><p>It was at this point where I felt as though my very existence, my entire life was just a dream, or a delusion that I was awaking from.  It felt as though I had been dreaming for 18 years and couldn't remember what form I had before I began the dream.  I had totally forgotten what I was.  I knew that I existed, but I couldn't for the life of me remember what my form had been.  I had forgotten what it was to be human.</p><p>Over time, I apparently began to open my eyes, to try and grasp the real world again, to figure out exactly what I was and where i was located.  I remember looking at my hand and flipping it over backwards, but having no idea what this shape was.  After what seemed like a week, I realized that this was a hand, and it was one of the many tools that I used.  I then noticed my leg, and started to remember that my form was of a rather peculiar shape, a shape that I could visualize (the human form) but could not name.  I then began to overcome the trip, and I started feeling as though the human form and every action it performed was simply another 'motion shape' from the world I had just returned from.  I started to realize that I am just a brain, and that my body and all of my surroundings could easily be a figment of my brains imagination.</p><p>Not only had I considered the possibility that this is a dream, I had actually experienced it.  Needless to say, this drug changed my entire idea of the universe and life itself.  This will not be my last trip.  I rather enjoyed that glimpse into nothingness.</p>",
 "year": "2006",
 "id": "56462",
 "gender": "Male",
 "timestamp": "2009-05-12T07:00:00.000Z",
 "views": "2610",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.25 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
