{
 "title": "The Scariest Three Hours of My Life",
 "author": "JR",
 "citation": " JR. \"The Scariest Three Hours of My Life: experience with LSD (ID 5646)\". Erowid.org. Apr 27, 2001. erowid.org/exp/5646",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "report": "<p>About a week after Christmas break, a friend of mine gave me 2 hits of acid left over from New Year's Eve because I had given him some codeine.  I had fried twice before and had done plenty of research on acid so I was somewhat familiar with what I was getting myself into.  My second trip involved me feeling so depressed and lonely that I wanted to kill myself.  I was alone at that time, so I made sure that I would always be around someone for this trip.</p><p>I took the first hit around 6:45 pm that Friday.  After about 45 minutes I felt kind of giddy but I wasn't getting any visuals.  I went with a couple friends to get something to eat.  At this point I noticed that colors were getting brighter.  Knowing that this acid was old, I decided to take the second hit around 8 pm.  I went in another friend's room and listened to Tool.  I love listening to music when I fry.  It feels like I am part of the music and it defines everything I do and think.  I started to get the typical colors forming on walls and peoples' faces starting to look weird.</p><p>I went with my friend to a frat house so he could get drunk for his birthday.  We stayed there for about 3 hours.  I had some cool visuals.  We went back to the dorm around 12:30 am.  When we got inside the dorm I felt like I was in a video game.  Everything looked bright and artificial.  I had auditory hallucinations and all the sounds sounded like they were in surround sound.</p><p>Then I went up to my floor and went to the room next to mine and talked to a few friends who were hanging out.  We started talking about acid and one stupid guy says 'You realize you can get permafry from one hit of acid, right?'  That officially ended my good trip.  After that I started getting scared that I was never going to come down.  I walked to another friend's room who had experience with acid and I knew he would be a good person to talk to. </p><p>I felt terrible.  I was extremely scared.  I thought I was going crazy and would never be sane again.  The worst part was that I coulnd't communicate to others how scared I was.  The knew I was on a bad trip but they didn't know how bad it was.  I went outside with some guy to smoke a cigarette.  He had fried many times, so he tried to calm me down.  He talked about what he liked to do when he was frying.  It helped a little.  I looked over at the snow and it was a pale yellow color and it started running around on the ground.  I felt like I was peaking again.</p><p>I went up to this guy's room.  He gave me a blowpop which was very fun to chew on because of all the tension in my jaw, but I was still scared shitless.  I felt like my heart was going to pound out of my chest.  I asked the guy if I would be able to go to the hospital without getting in trouble with the cops.  I thought about how my life would be if I never came down and how my family and friends would react.  My mind was racing so fast, but it was the same cycle of thoughts over and over.  I could not get my heart to stop pounding.  I was panicking.  I felt like I was living a thousand eternities every second and in every eternity I died and was reborn.  Thats as close as I can get to describing how I felt.  I knew that if I could fall asleep I would hopefully be able to sleep until I had come down.  But every time I closed my eyes I felt like I was sinking into the floor.  That wasn't scary but it was annoying and kept me from sleeping.  I call this the scariest three hours of my life because I have never been as scared as I was between 1 and 4 am that morning.   </p><p>Knowing I wasn't going to sleep I just started walking around.  I had calmed down a little by this point, but I was still kinda scared.  I walked around drinking water and pissing, looking at things on the wall, looking out windows.  The sun came up and I was still walking around.  I went outside and walked around.  Finally around 8 am, I went up to my room and went to sleep. </p><p>I woke up three hours later.  I still felt a little bit of the effects.  I felt like I had died and been born again.  I walked outside and the air tingled on my skin.  The sound of cars driving by was incredible.  Everything felt so fresh and alive.  I still had difficulty thinking straight, but by that night I could think fine again.</p><p>If anything, this experience taught me that maybe acid is not the drug for me.  I like frying and think it is very fun, but I seem to end up having bad experiences.  I naturally have an anxiety-prone mind.  Maybe that has something to do with it.  If I ever drop again, it probably won't be for at least a year, that is if I ever do it again.  Acid is a very powerful drug that really fucks up your mind.  It even has the potential to make permanent changes in someone who takes it.  Anyone considering dropping needs to realize this and know what they are getting themselves into.</p>",
 "year": "2001",
 "id": "5646",
 "gender": "Male",
 "timestamp": "2001-04-27T07:00:00.000Z",
 "views": "9254",
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  }
 ]
}
