{
 "id": 5651,
 "title": "Smoking In Deep Lungfuls",
 "date": {
  "submission": "2009-06-02T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "marcosbj",
  "gender": "Male",
  "weight": 85
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol"
  },
  {
   "time": "0",
   "amount": {
    "number": "4",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Tobacco"
  }
 ],
 "report": [
  "I dont smoke and never will, because:",
  "1) I rather spend my money on Cannabis or save it for Salvia",
  "2) Dont like the smell that much",
  "I actually hate regular cigarretes, such as Malboro or Carlton, so I dont smoke then at all sober, only when I am really drunk, notionless. But I love Straw Cigarretes. Im not sure if they are available in the US but here in Brazil they are quite common. There are some industrialized branches, but the real thing comes from the Brasilian peasants, those who live in the countryside. They roll it themselves (using rolled tobbaco and corn staw) and smoke it while drinking Cachaa (a hard liquor made from sugarcane, the brasilian vodka or sake).",
  "So, since I love the root culture, I like to do as they do, but in a diferent context. Sometimes I drink a couple of beers and some Cachaa. when I feel that I am under the effects of alcohol (but not drunk) I smoke the cigarrete mentioned before (regular cigarretes work as well but smell bad) in 3 or four tokes, then I let it go off. Since I dont smoke and the tobacco in these cigarretes are strong, I feel the nicotine very present. I start feeling light, then dizzy, then I feel as if Im floating. When I feel that Im floating, I walk a litte bit so I feel Im flying. Its really good.",
  "I repeat it a few times during the night and when I dont get strong effects any longer I quit. And keep quited for 3, 4 months, until I have another drinking night.",
  "I really like the feeling. If you have access to strong tobacco cigarretes, try it, but dont smoke too much. Its addictive and the good effects are only there if you smoke a few tokes in big intervals."
 ],
 "erowid": {
  "id": "33109",
  "citation": " marcosbj. \"Smoking In Deep Lungfuls: experience with Tobacco & Alcohol (ID 33109)\". Erowid.org. Jun 2, 2009. erowid.org/exp/33109",
  "substance": "Tobacco & Alcohol",
  "views": "4681"
 }
}
