{
 "title": "Vivid Memories Recounted",
 "author": "Dr. Phil",
 "citation": " Dr. Phil. \"Vivid Memories Recounted: experience with Salvia divinorum (10x extact) (ID 56531)\". Erowid.org. May 15, 2009. erowid.org/exp/56531",
 "substance": "Salvia divinorum (10x extact)",
 "bodyweight": "260 lb",
 "report": "<p>Just this past Saturday I had a profound experience with Salvia Divinorum. Up until this point, as a general rule I had never experimented with psychedelics. Several of my friends had, and encouraged me to try them, I just never felt like I wanted to. Then about a year ago, after prolonged research, I decided to smoke Salvia Divinorum. I planned the trip out very well. My girlfriend at the time, two of my close stoner buddies and I went out in the woods in our town wherein we had found a cave that would serve well as a hideaway.</p><p>So there we sat, it was the moment of truth. One of my friends had decided to go first, so I proceeded to load the bong, handed him the lighter and let him do his thing. He sat still for about 5 minutes, then woke up, and didnt really have much to say about it, besides that it was crazy. At that point, I figured, this cant be that bad, Ill do it. I took two hits, and about halfway through the second one, I had already left the plane. However, our salvia was of 20X strength, and while I saw things, I was really back and forth in consciousness the whole time, so it was hard to remember. I could go on with the story, but thats about all there is. Anyways, back to now.</p><p>My roommate and friends had decided to go to a show downtown, and I had potential plans with an old high school buddy of mine, so I decided to stay in. I had a relatively fair amount of time to kill, and it didnt look like any of my potential psychedelic connections would come through, so I thought to myself, hey, why not experiment with that salvia now? I got my Roor, a gram of Purple Sticky Salvia, 10X strength, and got into bed. I propped myself up on some pillows, and readied the bong. I took a few deep breaths, exhaled, and then fired the bowl. I took an enormous hit. I cleared it, and for precautionary purposes set the bong on the nightstand next to my bed, closed my eyes, and began to count to thirty.</p><p>As I hit 10, and faced forward, all I could remember was, hey, wasnt I just on my bed a second ago?, and then everything exploded. My ego was shattered in an instant. I was no longer aware of my body, of my self, of the real world. It was as if I had opened the doors of perception and been transported to another existence.</p><p>As in my first trip, the world was comprised of four colors: very bold red, green, yellow and white. At one point, a blue appeared, but aside from that, it was solely those four colors. My physical body, had now become a multicolor universe. It was as if I was all the infinite that had ever existed, and every molecule of my body was a tiny version of myself. There were trillions of me, and I could feel every single one. Everyone of them was zipping and unzipping together in patterns, interlocking and moving, constantly. And while my many selves seemed cell-like in conception, I knew in the trip that each of them had their own unique existence, just like I had mine in the world I had left so shortly ago. I understood this because, in the real world, the sober world, the non salvia world, I had a life. I had a unique existence, and the salvia was just revealing to me that there was more. I must reiterate, this was an entirely closed eye trip, and by this point, it was on full blast. It was the most intense experience I have ever had in my life.</p><p>As the trip progressed- which is kind of an inaccurate thing to say, as the trip more ticked like a clock rather than went anywhere- I began to think in ways that I had never thought before, and I began to realize that existence was pointless, meaningless, that we must all be cogs in some giant entity. What follows next is perhaps one of the most profound and frightening things I have ever been a witness to in my life.</p><p>At the very moment I fully realized the implications of my revelation, I saw myself, as a camera would in a movie. The shot was close up of my head, and the expression on my face was the one that you have seen dramatized on television, that face one gets right before they scream that raw, bloodcurdling scream of pure, real fear, and as I screamed, the camera slowly zoomed out to reveal that all my suspicions were true, that I was a tiny cog in a giant, silly, pointless entity, a useless machine, running constantly, accomplishing nothing, on a scale so massive it was as if a camera had zoomed out from my head, to view the entire universe.</p><p>The camera effect stopped, and it was back inside the machine again. I was trying to reveal the secret, but it felt like I was stuck in an infinite loop, and thus I could say nothing to anyone. I was yelling, but no words came out, rather, I came to the new realization that not only was I a tiny cog, but that I was made of tiny cogs, and I could feel them zippering as I moved my mouth, the sounds of the words I was trying to say phonetically swirling over their bodies and as they zippered the sounds combined and formed words. Again, I could feel the words, but not hear them, nor could anything else hear them. I began to become somewhat frightened, and I knew that I had to escape, or the big brothers, the gods controlling me, the universe made of tiny cogs themselves made of tiny cogs, would come after me.</p><p>The trip was wearing off, if only slightly, at this point, and I began to try to open my eyes. After a few minutes of trying, my eyelids came unglued and I rather quickly woke up, feeling somewhat stunned. I realized I was still tripping, with eyes open and body somewhat fully aware. The salvinorin A was still working slightly. I was far from normal, but much closer than I had been minutes ago. I looked at the clock, whose face emitted a few small tracers. It had been a solid 15, perhaps 20 minutes since I fired the bowl. I noticed that the Roor was not present next to the clock on the nightstand,</p><p>The bong- which I will swear up and down until the day that I die that I put on the nightstand- was lying on my bed, a large water stain around the mouth, and some ash spilled out near the bowl end. I picked it up, placed it on the nightstand, and slowly stood up. Uncontrollably, my arm shot out and tried to stick to the closet door. I walked out of my room, my arms shooting out at the walls at somewhat infrequent intervals. I walked out of my door, and across the way to an open door at another apartment.</p><p>Hey, I said to the guy and two girls who were sitting at the table and drinking.</p><p>Hey hey hey hey the guy replied. In reality, he only really said hey once.</p><p>I talked with them for a minute, then walked back to my apartment. As I walked in the door, I fully woke up, the trip was over, and I felt somewhat strange, although not unpleasant. I scraped together some schwag someone left on a plate on the coffee table, and rolled a little joint to calm myself down. I went back across the way to ask the people what I had done, and did I freak them out, and was it all good, and everything did turn out ok.</p><p>What exactly the salvia was trying to tell me, I do not know. I do know that what I did was dangerous and irresponsible, but I could not resist the chance at a pure, sensory isolated salvia trip. I can say that I am ok, although that is not an excuse. However, the experience was important to me, and I would consider it to be an important avenue of research for us as people, the exploration of the dark is the obligation of man. I myself plan on continuing research and observation on salvia use.</p>",
 "year": "2006",
 "id": "56531",
 "gender": "Male",
 "timestamp": "2009-05-15T07:00:00.000Z",
 "views": "8635",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
