{
 "id": 5653,
 "title": "I Wouldn't Mind Feeling Like This Everyday",
 "date": {
  "submission": "2004-06-01T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Oral B",
  "gender": "Male",
  "weight": "164 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-C",
   "form": "(capsule)"
  }
 ],
 "report": [
  "4:25 pm  Took 30 mg of 2C-C in a capsule on a fairly empty stomach. My friend takes the same dose.",
  "5:30 pm  Starting to feel a pleasant disorientation. Extremely light visual hallucinations of textural waves are kicking in.  Hands are a little shaky (usually happens when I trip).  Sounds are becoming much more precise and clean.  Listening to Pink Floyd, and its ear candy.",
  "5:45 pm  We get up and go for a walk. Visuals were becoming moderate inside, but out in the sunlight the visual hallucinations are gone.  However, everything is gorgeous and there is lots of visual depth.  My partner and I both noted that a strange heavy feeling slowly came over us and is now dissipating.  I said It feels like real soon Im gonna have all this energy and want to get up and do fun things, as I hopped up and down. Getting a nice gentle body buzz and a slight increase in energy, but still happy laying in grass.",
  "6:10 pm  We stop by some flowering trees and I watch a ladybug crawl all up and down a branch.  Having simple pleasant thoughts like how humans should not be afraid to experiment in all aspects of life because the human body is so tough.  Still thinking gentle happy thoughts about life and just enjoying the sights and sounds.  Definitely a slight enhancement of the senses, especially when the wind gently caressed my face.",
  "7:13 pm  Everything as far as visual hallucinating is gone.  Still experiencing a bit mental, physical and attention intensity.  Could definitely drive and go about normal day-to-day things.  Still a very pleasant body buzzes and everything has a tweak more visual interest than before.  Still heightened appreciation for audio.  An extremely timid laughy euphoria is still in the back of my head.",
  "7:40 pm  Things are starting to relax.  Still very happy and extremely content with life, but I dont feel like I am on any kind of hallucinogen.  Even though its not intense, I appreciate things, all things, on a heightened level and I feel more aware and in control of my surroundings.  Definitely still enjoyable, especially the vibe nature is giving as the sun sets.",
  "8:10 pm  Hardly any effects as of now. Still a faint happy vibe, next to no body buzz.  Pupils are really dilated and still seeing subtle light tracers.  No come down feeling yet.",
  "8:50 pm  Any sort of trippy sensation is gone.  Visuals are still nice but nothing is moving.  Pupils still dilated quite a bit, so I come back and play with some glow sticks.  Very pleasing to do and watch, but not really feeling-provoking.  I feel as though Ive almost totally come down, but no negative sensations of come down at all.",
  "All in all, I had a fun time with 2C-C. Only a couple moments I could consider intense, but basically it just made everything enjoyable and I became more personable to strangers and friends.  Heightened all senses in some way shape or form, but very mildly.  I wouldnt be afraid to do 35-45 mg."
 ],
 "erowid": {
  "id": "33121",
  "citation": " Oral B. \"I Wouldn't Mind Feeling Like This Everyday: experience with 2C-C (ID 33121)\". Erowid.org. Jun 1, 2004. erowid.org/exp/33121",
  "substance": "2C-C",
  "views": "19989"
 }
}
