{
 "id": 5662,
 "title": "Medicine, Tonic, Stimulant, Psychedelic",
 "date": {
  "submission": "2000-10-15T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Revolution"
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 g",
   "administration": "oral",
   "substance": "Calamus",
   "form": "(roots)"
  }
 ],
 "report": [
  "I have been purchasing dried acorus calamus (sweet flag) root from bulk sections at local herbal apothecaries the past year.  I have found it to have a variety of very useful and interesting properties.  I most often chew the dried rootstalk, and sometimes add it to green or ginseng teas.",
  "The taste is extremely bitter, sometimes having a peppery quality to it.  It is definitely an acquired taste.",
  "As a medicine, I found chewing it to be very effective at alleviating toothache pain where more traditional methods, such as clove oil, were failing.  It also has noticeable calming effects on digestion, much like ginger or peppermint.  Adding strongly-brewed calamus tea to a hot bath with several drops of the essential oil of nutmeg creates a pleasantly warm erotic irritation that can last for a couple of hours.",
  "I have found a small handful of calamus to be particularly effective as a stimulant.  The state is characterized by euphoria and physical energy, and an increased desire to verbalize.  Depending on the individual plant harvested, it can be as strong as ephedra, but lacking the typical negative side effects associated with stimulants.  I imagine it is a healthier alternative to caffeine or ephedra.",
  "I imagine it would take a lot of chewing to have a full-blown, sacred, ecstatic entheogenic experience.  My one experiment: After chewing perhaps 15g of dried root over a period of one hour, I transcended the stimulation phase and broke through to what I can most easily describe as a low-level LSD-like state.  My pupils were dilated and my euphoria heightened so greatly as to induce spontaneous bursts of laughter.  The world took on a very wavy visual quality, and I detected movement out of the corners of my eyes.  Rays and colors from light sources were strongly enhanced.  There is a remarkable lucidity to conscious thought during waking hours, and dreams are vivid, colorful and alive.  I was very happy throughout the trip.  The experience was physically very gentle and concluded within three hours.",
  "I recommend experimentation with calamus if it can be obtained from a reliable source.  Ask your herbalist where it was harvested, and what people who purchase it commonly use it for.  It has myriad beneficial medicinal and psychoactive properties."
 ],
 "erowid": {
  "id": "3314",
  "citation": " Revolution. \"Medicine, Tonic, Stimulant, Psychedelic: experience with Calamus (ID 3314)\". Erowid.org. Oct 15, 2000. erowid.org/exp/3314",
  "substance": "Calamus",
  "views": "31119"
 }
}
