{
 "title": "Black Hole",
 "author": "David",
 "citation": " David. \"Black Hole: experience with Salvia divinorum (10x extract) (ID 56674)\". Erowid.org. Jun 24, 2008. erowid.org/exp/56674",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "77 kg",
 "header": [
  "DOSE:",
  "2 bowls",
  "smoked",
  "Salvia divinorum",
  "(extract - 10x)"
 ],
 "report": "<p>On messenger tonight I have been chatting to an old friend from my raving days back in the mid-nineties. We started reminiscing about old times at the Fridge, Club Uk, The End and how messy we sometimes got. Now after a few times and experiences, I left behind the chemicals and forgot about them apart from the odd cheeky spliff from time to time. Now, about a year ago, one day I stumbled across a website about a legal high I've never heard about. Well legal, I thought to myself, it can't be that bad. I read a few reports from people who had taken it and the method of consumption and thought to myself, well one last time. I thought I was prepared for it, afterall, from what I read, this hallucinogen called Salvia Divinorum only lasts 30 minutes and hell, I've been up for many hours in the days gone by and came out unscathed. I could handle its effects no problem.</p><p>Well, I bought a small amount of this dried form from a head supplies shop, a bong and forgot about it. I went out for a few drinks, arrived home and Adam, a guy who in one of the other flats was arriving home at the same time. I said to him would he like to come in for a nightcap and how I wanted someone with me as I was going to try this new substance. He sat on the sofa. I prepared the bong, took a big toke and cleared the cup. Held down the white smoke for several seconds then exhaled. Nothing happened, so I built up a second cup load and did the same thing. The next thing I remember was lying on the floor and slowly coming round. I don't know if any of you have seen the matrix, when one of the guys says to Neo as he takes the red pill, 'Buckle your seatbelt as Kansas is going bye, bye!', but that is one way to describe what Salvia did to me.</p><p>As I woke from my immediate brief collapse into unconsciousness (apparently I was on the floor for about 30 seconds) I experienced the most intense experience I have ever had and I know I will ever have. The layers of reality were simply stripped away and I truly believed I had done something very silly. I didn't know in this state, how I had come to be in 'the real reality' as it seemed at the time. It was as if I had left the world behind and for eternity I would be in this new world, whose laws, rules were completely alien and I knew nothing about. The first thing that happened was I felt I floated out of my body and was looking down from the ceiling at the flat. The walls and ceiling seemed to be curving inwards and upwards in impossible ways and in new dimensions beyond the Cartesian geometry of what I believe to be true. Adam was saying something, I think laughing at me off my tits, but in this state he appeared to be an all knowing entity of this new domain and I was unsure if he was a friend or foe or simply an entity beyond such concepts laughing at my foolishness to travel to this new dimension.</p><p>The wooden floor was covered in an array of strange geometric intense colours and my fingers, hands and body seemed to be melting, no a wrong word, sinking and becoming one with the floor. A strange voice kept repeating some phrase from perhaps a teacher, nursery rhyme or program from perhaps a deeply repressed memory and the patterns on the floor were swirling to the repetition of this sound/voice. I've forgotton how it went, but something like 'Da dum, da dum, be dum.' I was getting scared, it was impossible to come back to any sort of reality, as this was reality and everything before was but a veil covering the true nature of the universe.</p><p>The next thing that happened was I felt like I was being sucked into a huge black hole or whirlpool in the center of my room which was going to completely crush me. I didn't know what would happen when I was crushed, wherever at this point I would die, I was worried that any second my legs and torso would be crushed as the floor returned to normal, afterall my whole body up to my shoulders had now sunk into it. I thought perhaps I would be crushed to an infinitesimally small particle and would keep being compacted smaller an smaller as the gravity of the black hole in my flat compacted me. This relieved me slightly as I preferred this so long as there was no pain involved and then I could work on a way to travel to another dimension through this black hole. The strange voice repeating the childhood sound was getting louder and louder to the point of a scream and was increasing in tempo as well as volume to the point where it was just white noise and a shrill screeching vibration of sound.</p><p>Things started getting less intense and I came back to reality. After 10 minutes was back to normal as if nothing ever happened. I'm not sure what happens to your mind on this drug. I have read huge amounts on astral projection, OBE, spiritual experiences, shamanic journeys and this kinda confirms what a lot of these writings say. The experience is very personal and internal such as the concept of repressed childhood memories, but by the same time very external and very real as if I have seen something of another mathematical superstring or quantum dimension written about by Einstein or Hawking, impossible to visualise or contemplate but scientifically and algebraically very real. Something very strange indeed happens on this drug.</p>",
 "year": "2005",
 "id": "56674",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-06-24T07:00:00.000Z",
 "views": "3283",
 "dose": {}
}
