{
 "title": "The Year of Dreaming",
 "author": "Mr. Trichocereus",
 "citation": " Mr. Trichocereus. \"The Year of Dreaming: experience with Calea zacatechichi (10x extract) (ID 56742)\". Erowid.org. Mar 12, 2007. erowid.org/exp/56742",
 "substance": "Calea zacatechichi (10x extract)",
 "bodyweight": "",
 "report": "<p>I ordered some Calea 10X extract just to test, and it has lived up to its name. I smoked a little bit the first night I got it, and nothing happened, but the next night I had a dream that seemed to last a week. Strange that it would skip a night like that. The second time I smoked it, nothing happened at all. On a side note, I should mention that it Tastes absolutely horrible. There is nothing in the world that tastes worse than this. It engulfed my entire mouth with bitterness, and made me want to vomit for a good 10 minutes.</p><p>Then I smoked it a third time with a bit higher of a dose than the previous two times. This time it REALLY worked. I literally remember an entire year of events that took place in one night of dreaming.</p><p>For some reason or another, electricity had gone out for a very long period of time. I got the feeling it was from nuclear warfare, or some kind of major natural disaster. I left my life in the city to live on an isolated farm settlement. It was a beautiful place, and many other people I've known throughout my life were also there for some reason. There was still running water, and there was a greenhouse-like building with a battery-powered door, like a garage door, where things from everyone's previous lives were stored.</p><p>I can remember everyone's distinct personalities. There were also a lot of people I had never met there. We lived off the land... there were huge wheat and corn fields all around, as well as some forested areas. I can remember the passage of seasons, and specifically I remember October. I explained to some of the other people there that October was my favourite month because of the cool weather and general feeling of relaxation associated with autumn. I was standing on a hill, near some trees, looking over a huge field of wheat that was blowing in the wind. All of this was in full detail, just like real life, only more clear in certain ways.</p><p>Eventually electricity returned, and I was able to go back to the city. I arrived on a bus, but the bus driver stopped at the wrong place, so I walked to a nearby mall. I can remember going into the different stores, and looking at a huge variety of things in these stores. There was a strange platform you could ride on that would take me to various sections of the mall really quickly. At this point I woke up.</p><p>Wow... what an amazing night of dreaming. I don't know how an entire year can fit into a night like that, but I think I've definitely found something truly amazing in this herb. The relationships I had with people felt totally real. The events that took place felt totally real. Another thing I noticed is that these Calea-induced dreams seem to bring me back to places I've been in past dreams, and sort of integrate my dream world a bit.</p><p>I've barely gone into detail with what happened in this dream, because it would literally take me a year to write it all down. I look forward to my future dreams.</p>",
 "year": "2006",
 "id": "56742",
 "gender": "Not Specified",
 "timestamp": "2007-03-12T07:00:00.000Z",
 "views": "9994",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": "(extract - 10x)"
  }
 }
}
