{
 "title": "Floating Pipe Dreams",
 "author": "J-dub",
 "citation": " J-dub. \"Floating Pipe Dreams: experience with Buprenoprphine & Cannabis (ID 56743)\". Erowid.org. Apr 30, 2008. erowid.org/exp/56743",
 "substance": "Buprenoprphine & Cannabis",
 "bodyweight": "150 lb",
 "report": "<p>I have had several experiences with buprenorphine.  Each one has been pleasant for me, but I have many aquaintances who have had some unpleasant results.  Taken sublingualy, the high is more mild but lasts for a long time, probably 8-10 hours or more.  When snorted, which I do not know if this is the best idea, the high is much more intense but last a shorter amount of time, but not by much, maybe an hour less or so.</p><p>The high is great.  It completely relaxes me and puts me in that kind of dreamy state that I have found with many opiate related substances.  Throughout the duration of the experience I found myself just sitting there on my couch drifting gently in and out of consciousness.  When used in conjunction with cannabis, the body high becomes more intense and puts me in a state of euphoria. The conscious drifting tends to produce colored patterns vivid visuals when I close my eyes and intensify combined with cannabis.  The high is not so intense that I cannot function, I still find myself pretty social around people although the mixture with cannabis makes me kind of goofy and absent minded.</p><p>With each of these experiences I have started out with a 1/2 pill, either snorted or taken sublingualy, usually adding another 1/2 if taken sublingually of the 2 mg pills.  Some of my friends have experienced nautiousness and puked while on this, mostly because of their newness to any opiates.  Some people have also reported still feeling the effects the next day.  I have never really experienced that but personally, I wish I did.</p>",
 "year": "2006",
 "id": "56743",
 "gender": "Male",
 "timestamp": "2008-04-30T07:00:00.000Z",
 "views": "10434",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Pharms - Buprenorphine",
   "form": "(ground / crushed)"
  },
  "2": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
