{
 "title": "The Nightmare of Detox",
 "author": "BB",
 "citation": " BB. \"The Nightmare of Detox: experience with Kratom  (ID 56768)\". Erowid.org. Mar 12, 2007. erowid.org/exp/56768",
 "substance": "Kratom ",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "0.25 cups",
  "oral",
  "Kratom",
  "(daily)"
 ],
 "report": "<p>I am a 22 year old male and college graduate.</p><p>I have decided to share my experience with Kratom (Mitragyna speciosa) use because it has dramatically altered the course of my life.  My story with Kratom begins about 3 years ago, while I was in a detox and rehabilitation program for a morphine habit.  </p><p>I ordered several ounces of kratom leaf prior to entering detox, and it arrived shortly afterward.  After completing treatment with buprenorphine, the physical and emotional symptoms of morphine withdrawal were still nearly unbearable.  Every fiber of my body ached for what seemed like months, though the most painful portion lasted only about 10 days.  I could sleep for no longer than 4 hours at a time, but even this sleep was accompanied by horrendous nightmares of the most uncomfortable sort.  I lost weight, and when I saw myself in the mirror for that first month, I saw an emaciated, drawn, and wide-eyed version of myself that I barely recognized. </p><p>During the course of the detox, around day 3 or 4 post-buprenorphine treatment, my stoicism broke and I made a glass of kratom tea.  I crushed about 5 tablespoons of the dried leaf in my hands and added boiling water and lemon.  The tea was very bitter and astringent.</p><p>Within 30 minutes the tea alleviated all of my symptoms.  I felt like me again.  Normal, in no particular pain, but for the pain of the guilt that I had relapsed.  I flushed the rest of the leaf down the toilet in fear of ruining my detox. </p><p>The following days were still horrific (once the kratom wore off) and withdrawal was no easier. </p><p>After being clean (and tremendously happy) for about 6 months, I purchased more kratom leaf from an online vendor on a very stupid whim.  My addict was still at large.  Just like with morphine, within a week I had used the drug at least 7 times, and I was becoming physically dependent.  Fear of detoxing, concerns over keeping up appearances, and a foolish notion that taking time off from classes would be more trouble than it was worth all kept me from quitting.  Plus I loved how it made me feel - very similar to morphine, but with a weird and uncomfortable blurring of my vision. </p><p>Jump ahead 18 months.  My face looks drawn again.  My moods are erratic, and I never go more than 12 hours without a slug of kratom tea (at ever increasing dosages).  I have lost interest in my work, in my friends, my family, and my hobbies.  Im ashamed and unhealthy but still tell no one.  Anyways I had an epiphany 11 days ago, and I took time off work to return to the same treatment program I attended for morphine. </p><p>Again, I took buprenorphine for initial detox (but this time starting at 10mg/day rather than the 24mg/day I required the first go-around).  I have been off the bupes for 5 days.  I have experienced the same nightmarish symptoms from kratom that I did from morphine.  I might say that the pain and mental anguish has been slightly less intense from kratom withdrawal, but I really must underscore that trying to compare one opiate detox to another is pretty pointless.  Would you rather get in a cage fight with a pissed off lion or a giant fucking gorilla?  Theres no sense in quantifying the pain.  The only differences have been, as I have already said, the amount of buprenorphine that I required initially and, it seems, the duration of the withdrawal symptoms.  They built until day 3 or 4, and are now starting to taper off.</p><p>I dont plan on getting a good nights sleep for at least 3 weeks, and Ill be changing my shirts regularly from excessive perspiration.  I cant wait to be me again.  Im so tired of this walking skeleton.</p>",
 "year": "2006",
 "id": "56768",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-12T07:00:00.000Z",
 "views": "19484",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.25 cups",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(daily)"
  }
 }
}
