{
 "id": 5678,
 "title": "Breathing Crimson",
 "date": {
  "submission": "2006-05-04T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Eribis",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Red Rock"
  }
 ],
 "report": [
  "I'm sitting at home when I get a call from a good fellow asking me if I may be able to rid him of some redrock he has. This intrigues me leading me to hasten over to a place of meeting.",
  "I was skeptical at first of this substance being sold to me as redrock. I hear that redrock is dragons blood incense sold at an inflated price so I bring this up to the good fellow in possession of this beautiful substance, with a grin he replys with a: 'Well, yes my good friend, it IS dragons blood incense but with a hint of magic to it.' Now this leads me to a fit of confusion as I stand asking myself, 'why would he admit that to me? and why is he grinning?' As I was thinking this, he says to me: 'It's mere dragons blood incense used as a base for a synthetic opioid.'",
  "Now this is really interesting to me and we head over to his pad. This good man proceeds to smoke a bit with me. I find this kind of funny; we were chasing the dragon.",
  "I was a little tired from work but was still in a clear mindset. Completely sober beforehand.",
  "I'm sitting in a comfortable velvetine couch in a large suburban house with no worries and a somewhat overdone art film produced by a local college student playing on the large screen television. He places a good bit, I estimate a half gram or so onto a large peice of foil which has been folded as to have 3 layers. An indirect flame is applied under the substance which melts to a surprisingly blood-like color, texture, and consistancy. As the redrock boiled off the vapors were inhaled through a hollow glass tube. It tasted very sweet with a hint of cinnimon and spice in my opinion and gave off a very pleasant odor which soon overcame the room.",
  "After a few large breaths of this substance a very interesting sence and warmth began surrounding me from my thorax and extending to my limbs. It was a very distinct feeling unlike the usual opioid buzz. Not at all like heroin, dissimiler to Vietnamese opium, vaguely similar to Demerols, but overall more reminiscent of Klonopins or a good pirate shot of rum more than anything else. After completing the remainder of the redrock I felt floaty, distant, uninhibited, drunk, and definately unable to drive. This level of depressent activity came as a surprise to me. I was expecting nothing and a mild opioid buzz at the most. Instead though I find myself in a definate depressant nod. A feeling of nothingness surrounds me like a warm blanket and a sence of vauge darkness is present in the back of my head. Similar to the monster in the closet feeling as a kid but without the fright associated with it. Overall this was very pleasant but unnexpected.",
  "The remainder of the night, I stayed at this good fellows house nodding off into daydreams of pleasantness and conversing of meaningless things while watching various mind numbing shows on the television untill I was ready to progress back to my own home back to my own existance."
 ],
 "erowid": {
  "id": "33215",
  "citation": " Eribis. \"Breathing Crimson: experience with Red Rock (ID 33215)\". Erowid.org. May 4, 2006. erowid.org/exp/33215",
  "substance": "Red Rock",
  "views": "6441"
 }
}
