{
 "id": 5680,
 "title": "A Pleasant Stimulant",
 "date": {
  "submission": "2004-07-05T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "scroumf",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-D",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>15mg of 2C-D in a glass of wine, taken with good food and good friends...",
  "(I apologize for the lack of timeline, but I honestly didnt look at the clock all night, and writing a trip report was an afterthought.)",
  "Very slow ride up very pleasant all around.  A companion and I both likened it to MDMA.  It made me very sociable.  It also squelched all the drowsiness that came from all the alcohol I drank (which was impressive considering the quantity of alcohol I had).",
  "I noted increased body heat accompanied by an exquisite body high, very soft, warm and pleasant.  Breathing felt good.",
  "Attention span was fucking shot.  My ability to perform simple tasks such as set up a dreamcast were failed miserably (due to a missing cable, and missing games, so I would have failed regardless of how sober/intoxicated I was), but it took me a while to realize the cable was missing and remember I had lent out my binder of games.",
  "As pleasant as this chemical is, it is by no means a psychedelic (at least not at this dose).  This drug goes in the same category broad category as alcohol/codeine/ghb/methamphetamine/ecstasy (feel good, not mind expanding), no profound revelations were had (and consequently not an ounce of freaking out or paranoia)",
  "I was shocked at the efficacy of this dosage!  My previous trial with 10mg was unimpressive to say the least.  I suppose that is a 50% increase in dose though.  The funny thing was that I felt more composed than I did on 10mg, though Im sure the alcohol had a part in that. It also lasted a notably longer than the 10mg trip.  Even more so than my experience with 10mg, it was apparent that this material was not steady in its effects there were moments of great intensity with a vertigo like sensation around the peak, then it would switch to perfect lucidity, as if I were stone sober, then back again.  This would happen in 10-20 minute intervals.",
  "No enhancements of bright lights or any visuals at all.  I didnt get a chance to check my pupils.",
  "My behaviour was very spontaneous and weird.  Ideas just came to me, bizarre things I wouldnt normally say.",
  "It had an excellent synergy with the alcohol, I feel it allowed me to drink more without getting tired or being clumsy.",
  "As pleasant as this was, I cant help but feel guilty for feeling this good without gaining anything.  I learned nothing from this trip.  I had a superb time, and now have some fond memories of the evening, but I couldnt see wasting time doing this often, especially if Im fucked up tomorrow well see though.",
  "I dont feel guilty after I do a true psychedelic and actually pull something out of it that enriches my life - a new perspective or concept though good memories undeniably enrich your life hmm at any rate as fun as this was, not a regular thing to be doing, unless of course I somehow feel 100% tomorrow, which seems unlikely considering that 10mg didnt leave me 100% AND all the alcohol Ive had tonight.  Well see though.",
  "Epilogue: Was it ever hard to get to sleep!  After I finally fell asleep I slept for 5 whopping hours.  Despite my sub-standard amount of rest, I feel pretty good today.  I am glad I dont have to work though.  Work would give me an idea what % I am.  Now Id have to guess at least 90%+.  The day after that I was back to normal.</p>"
 ],
 "erowid": {
  "id": "33231",
  "citation": " scroumf. \"A Pleasant Stimulant: experience with 2C-D (ID 33231)\". Erowid.org. Jul 5, 2004. erowid.org/exp/33231",
  "substance": "2C-D",
  "views": "17196"
 }
}
