{
 "id": 5681,
 "title": "Don't Mix (Seizure Report)",
 "date": {
  "submission": "2006-10-23T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ronkkrop",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25"
   },
   "administration": "oral",
   "substance": "Quetiapine",
   "form": "pill/tablet"
  },
  {
   "time": "14:20",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Well, let me begin by stating that today is the worst day of my entire life.  I consider myself to be an avid smoker in products of the marijuana variety. ",
  "The mix of seroquel and marijuana happened to come together by accident.  I have problems of anxiety, and I happened to tell my parents about this who later gave me seroquel.  I didn't think at any point that mixing these two would cause anything serious.  Suffice it to say, I was wrong.",
  "I took the seroquel around 2pm, and began to feel exhausted, by 6pm I was asleep.  By chance my roomate and I happened to be both awake at 415am.  So of course we decided to partake in the festivities of 420 :).  We smoked 2 bowls, and then I felt tired once again and decided it might be a good idea to sleep.  I went to my room, and had the funniest sensation that I couldn't understand.  I had no idea what was going on with anything.  It's not that I had no idea where I was, or who I was, it's that I was completely unaware of any of it.  I sat in front of this very computer, and had a bitter taste in my mouth come on rather suddenly, and an onset of confusion.  The next thing I knew, I was on the floor having a seizure.  I managed to cut my face (minimally, thank god), and cause minor trauma to my back.  I can only remember little bits of the seizure, and my roomate had said it lasted well over 5 minutes.  To sum up the medical side of things, my blood work revealed I have a great nutrition.  I also have no family history of seizures.",
  "I re-iterate, this has been single-handedly the worst day of my life, and I have no intention of repeating it.  According to the doctor, I should wait a minimum of 3 weeks before I smoke anything, and I may have a seizure again at any time, without warning, until the seroquel is completely out of my system.",
  "Given this information, I can't see how anybody would want to mix these two."
 ],
 "erowid": {
  "id": "33233",
  "citation": " Ronkkrop. \"Don't Mix (Seizure Report): experience with Quetiapine & Cannabis (ID 33233)\". Erowid.org. Oct 23, 2006. erowid.org/exp/33233",
  "substance": "Quetiapine & Cannabis",
  "views": "16262"
 }
}
