{
 "title": "3 Months of Complete Dissociation",
 "author": "Gavin",
 "citation": " Gavin. \"3 Months of Complete Dissociation: experience with Tiletamine (ID 5696)\". Erowid.org. Apr 10, 2001. erowid.org/exp/5696",
 "substance": "Tiletamine",
 "bodyweight": "140 lb",
 "report": "<p>Due to the fact this chemical is relatively unheard of i will not only include a description of what a normal experience with the drug entails but also a little background and what long term effects it has. </p><p>After becoming employed as a kennel assistant at a vetrinarian clinic i began experimenting with the different chemicals i could obtain through the company.  After using ketamine, PCP, and a few others i stumbled across something called tiletamine (we nicknamed the substance Mr. T).  It is a powdered substance which is mixed with a liquid for IV/IM use in cats and dogs.  It is a dissociative anesthetic that is closely related to ketamine and PCP.  The only main difference i found was the lack of hallucinogenic properties induced by other similar substances.</p><p>I found this drug to me very interesting because depending on the dose you could make it whatever you wanted it to be.  At low doses if you concentrate hard enough you can put your self into a state that is fairly comprable to rolling, while at higher doses it has minor visual distortions such as blurred sight, minor bending, and other interesting perception differences.  At higher doses however you journeyed into a world of nothingness; completely unlike the infamous K-Hole.  There was a complete loss of motor skills and the only way to describe it is like being in a really confusing dream where nothing seems real and everything is hard to comprehend.  For comparison factor it was similar to being EXTREMELY 'ate-up' after large doses of ecstasy.</p><p>Myself and a few of my closest friends became pretty much dependant on this substance and used it on a daily basis (since i was getting it free we were doing about a vial of it per day.  This led to us becoming very strung out, even while not on the drug i still lived in a world of dissociation, this led to much trouble, wrecking my car, loosing my wallet, loosing my keys, and eventually loosing my job. </p><p>Where it really got me into trouble was when me and my friend started using it at school to make our detention time go faster (it made a 2 hour after school detention seem like 5 minuites NO EXAGERATION!!!!!).  So when we were told we had to serve a 1 hour detention before school we figured the best way to do it was to snort a few lines.  But unfortunately we didnt stop at a few lines, we did a whole vial in about an hour (thats roughly 10 grams).  Well after being in a complete daze for most of the day the principal and other autority figures were on to what we were doin.  We were serached, questioned etc. Finally they drug tested us and we failed miserably (it showed up as PCP).  So long story short we got kicked out of school, forced into rehab, and to be really honest im almsot glad.  While Mr. T was an extremely fun substance it was also very addictive and made 3 months of my life nothing more than a blur.  So now this drug is classified as one of the few i will never touch the only others in this class are acid (but thats another story), and heroin.</p><p>Well peace out to anyone who read this, i hope it makes you realize that even fun things have their downsides.</p>",
 "year": "2000",
 "id": "5696",
 "gender": "Male",
 "timestamp": "2001-04-10T07:00:00.000Z",
 "views": "23955",
 "dose": []
}
