{
 "title": "Nothing of Worth",
 "author": "Fm83",
 "citation": " Fm83. \"Nothing of Worth: experience with Anadenanthera colubrina (ID 56968)\". Erowid.org. Jun 14, 2007. erowid.org/exp/56968",
 "substance": "Anadenanthera colubrina",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "4 bowls",
  "smoked",
  "Anadenanthera colubrina",
  "(ground / crushed)",
  "",
  "3 seeds",
  "insufflated",
  "Anadenanthera colubrina",
  "(ground / crushed)"
 ],
 "report": "<p>I prepared the Anadenanthera colubrina as I knew how, by 'cooking' them in a pan until they popped. After they had popped, I peeled off the outside which was more of a pain then I had come to believe, but low and behold, our seeds were ready.</p><p>We opted to smoke them. Mixing baking soda (as limestone paste was not to be found) in a ratio of 3 part Anadenanthera colubrina and 1 part baking soda, we packed the first bowl.</p><p>All we had at the time, was a small glass pipe and standard lighter. Though I feel if we had used a bong and/or torch lighter, we may have had better results.</p><p>I smoked the bowl to myself, with my friend to have his own bowl next. I took large hits and held in the smoke to the best I could. I smoked it slow, as to avoid any nausea that seems to stem from these seeds. That was that.</p><p>The bowl was complete, with my friends waiting for a reaction, but nothing. Nothing more than a strong high, as from smoking good weed. My friend than smoked his bowl, prepared the same way, and the effects were the same, nothing.</p><p>At this point we were quite disappointed, as even though we did feel 'something,' it was nothing like that has been reported. I proceeded to smoke 3 more bowls in quick succession of each other as to maybe derive something more than what we got. Nothing.</p><p>We had a few seeds remaining after this, so we elected friend A to snort some. Broke up 3 seeds and mixed it with baking soda. 1 line down, 2 lines, and then the 3rd. BUT NOTHING!</p><p>At this point I left. We decided our seeds were not fresh and that is what caused this upset. Though we also felt that even if they were 'stale' we should still have gotten much more then we did.</p>",
 "year": "2006",
 "id": "56968",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-14T07:00:00.000Z",
 "views": "8818",
 "dose": {}
}
