{
 "title": "Destressing",
 "author": "TeEb",
 "citation": " TeEb. \"Destressing: experience with Benzodiazepines - Clonazepam (Klonopin) & Lorazepam (Ativan) (ID 56980)\". Erowid.org. May 6, 2008. erowid.org/exp/56980",
 "substance": "Benzodiazepines - Clonazepam (Klonopin) & Lorazepam (Ativan)",
 "bodyweight": "170 lb",
 "report": "<p>Right now I am on 2mg clonazepam and 3mg ativan.  I have a anxiety disorder and these pills are prescribed to me by a doctor.  However every now and again I exceed the recommended dose to get the desired effects of the benzos.</p><p>Relaxation fills my body but I find it hard to concentrate on anything and forget what I am doing easily.  I am easily distracted by anything around me such as the tv, the stereo, my computer, my work that needs to be done for university, cleaning, and forget what I was doing before I started a new task.  I feel relaxed and have no anxiety or stress about anything in the world, even though I have many things to do that should be stressing me out including midterms coming up and papers due for some classes at university.  You would think that forgetting what I am doing would be a pain but it doesn't bother me the least.</p><p>The ativan is much stronger when it comes to treating Anxiety and panic attacks but the clonazepam is very useful in preventing the attacks from happening. The clonazepam does not have the confusing effect that often comes with ativan but does help me to relax and calms me down to the point that I can calm down and look at everything plan it out and get everything done without the stress and anxiety bothering me.</p><p>It's a lifesaver when it comes to panic attacks or coming down off any hard drugs, especially cocaine.  I find that mixing clonazepam and ativan with cocaine helps to vertualy stop the come down from the drug with no negative effects.</p>",
 "year": "2006",
 "id": "56980",
 "gender": "Male",
 "timestamp": "2008-05-06T07:00:00.000Z",
 "views": "24482",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Lorazepam",
   "form": "(pill / tablet)"
  }
 }
}
