{
 "title": "Pieces of Me",
 "author": "Patro39",
 "citation": " Patro39. \"Pieces of Me: experience with Salvia divinorum (10x & 15x extracts) (ID 56999)\". Erowid.org. May 4, 2008. erowid.org/exp/56999",
 "substance": "Salvia divinorum (10x & 15x extracts)",
 "bodyweight": "163 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "56999",
   "Male",
   "",
   "Not Given",
   "May 4, 2008",
   "4532",
   " "
  ]
 ],
 "report": "<p>The first time I did Salvia Divinorum was about 5 years ago (I'm 44 now)</p><p>This was done utilizing a 10X extract from the local head shop. At that time I had done very little research on this subject, only a few stories I had read on the internet. This being said, I did however heed a warning I had read about and had my wife act as a sitter. I meditated for 15-20 minutes, had low music in the background (I think it was Pink Floyd). I was in bed with my wife, sitting up against the headboard with a pillow behind me. I then took 2 hits from a pipe, holding them for maybe 20-30 seconds, exhale and take the final hit. At this point it gets sketchy, but heres what made an impact that is burnt into my memory.</p><p>The next thing I remember is my soul for lack of a better word got pulled from my body from the back of my head into the wall behind the headboard of the bed. This scared the living shit out of me, and Im no new-be in the world of drugs from my younger college days. I then remember looking down at my wife as she was holding me, I guess I would describe it from a 3rd person view, as I was looking down on my body and could see my wife acting frantic, trying to wake me, yet I wasnt there, I was above looking down. I also remember in front and to the right of my field of view was a small, old Indian sitting legs crossed and laughing. I know, this sounds nuts, but this is what I remember. I also remember the feeling of terror when my soul was being pulled through the backside of my head.  The experience was 10-15 minutes in length. </p><p>This experience lasted my curiosity for about 5 years, with NO desire to repeat the process.</p><p>Last week I placed an auction site bid for 2 grams of 15X, one gram of 10X and one gram of 5X respectively for the sum of $10 bucks. It was more of a shits and giggles bid and I won.</p><p>Last night late, while my wife was sleeping, I went into the bathroom to give it another try. This time, no sitter. My justification for this was my education this time around, as Ive done much research on this drug (if it can even be called a drug). I knew that the experience would only last 10-15 minutes and all would return to normal. I had hoped for a pleasant journey into the unknown, an awakening in a sense. Unfortunately this was NOT the case.</p><p>I meditated again for about 20-25 minutes, this time to the tune of an Indian meditation mp3 file that sounded like an Indian chanting something I didnt understand with the beat of some drums. It seemed to be a cool choice for the occasion. Maybe because of the Indian who was involved in my first experience?</p><p>I used the 15X, loaded a home-made pop can pipe with maybe  gram. I took 2 hits holding both as long as I could, and then the nightmare began (I think). It was extremely intense, to say the least, also quite different from the first time. </p><p>Heres what I remember, and keep in mind this was only last night (10/28/06). Incedently, it didnt matter that I knew this experience would only last 10-15 minutes, as anything I thought I knew was out the window at this point.</p><p>This time and for reasons I dont understand, my body became separated (vertically as if I was standing up), but into many pieces. Sliced is a better interpretation of what took place. Id say that there were at least 10 sections of me.  I was fully conscience of each piece and could become each piece, but never more than a piece at a time. It was like the pieces had individual consciences that were indeed me - or a part of me, but I could occupy only one at a time. A good way to describe this would be if I were peeled like a banana.</p><p>As before it scared the crap out of me, but this time it was a real BAD trip. No Indian or any other funny or humorous thing, only the slicing and the inability to put the pieces back together to become and return to me. I also somehow made it out of the bathroom and into bed. I dont remember any of this. When things became normal, for lack of a better word, I was again in the arms of my wife, whom is still not happy with me now, as she had no idea what was going on. It scared the shit out of her, yet she refuses to speak to me about the incident, or what took place from her view. When the effect wore off I told her what I had done and experienced. This however didnt help her mood at the time.</p><p>Heres my interpretation as I see it. Actually, feel it would be a better description of what I took from it. The sections were indeed a part of me. However, I feel that part or parts somehow lived before me, or at another time, as several pieces seemed quite old, yet at the same time were a part of whom I am today or who I am in this life as a whole. I know this is really strange sounding and very difficult to describe, but this is what happened as I recall the experience. Ive also learned to write thing down as I tend to forget the details. </p><p>This was indeed my last experience with Salvia Divinorum. I realize some have had truly inspiring experiences, a true awakening to say the least. This was indeed my reasoning to attempt it again. For I however, I really cant say there was been any real awakening on either experience, the latter especiallyunless this was some form of confirmation that the life I am living in the here and now is but a brief time and when I return to live yet again, I will return with a part of the life in which I am now living, as well as parts of the lives Ive lived before.  And be that as it may, I can find comfort in the belief of this little lesson from far reaching depths of the mysterious experience delivered from the hands of Salvia Divinorum. Real or just in the mind? You be the judge, however I for one cant recommend this to anyone. </p><p>I for one want no more than to live each and every moment to its fullest, and relish in the wonderful things our creator has given us to enjoy while in this brief moment of time.</p>"
}
