{
 "title": "Absinthe in the South of France",
 "author": "Redwood",
 "citation": " Redwood. \"Absinthe in the South of France: experience with Absinthe (ID 5701)\". Erowid.org. Jun 22, 2001. erowid.org/exp/5701",
 "substance": "Absinthe",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1 shot",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "report": "<p>\nI've read several of the descriptions of absinthe experience in the experience vault and saw none that match mine.  I was on vacation in France a few years ago when I was 18.  At this time I was a regular pot smoker and had also tried and enjoyed acid and ecstasy.  The trip was with my family so, alas I could not bring pot with me as my family is not 'enlightened'.  This is to establish my experience with psychoactives.  I had been in London for a week and then I went to the sleepy little french town of Praeux.  The people we were staying with had the chateau of the town, which created an amazing country ambiance. </p><p>One day I go outside and my host, his son and some friends are lounging on the back terrace drinking a cloudy green drink.  I had heard about absinthe and my mind raced as I had heard that it was no longer available in France.  I couldn't help but ask 'whats that your drinking?'  Pierre,  my host explained that when they bought their chateau there was a wine cellar that came with it.  They had found on one of the racks about half a dozen bottles of absinthe produced by Pernod.  He then poured me a shot, filled the rest of the glass with water,  but NO sugar. </p><p>I drank it slowly,  while we all talked about the weather, french politics.  I slowly became aware that I was completely relaxed, things felt more vibrant, but the air felt cooler and I was more aware of the things I was seeing.  I remember walking around for about an hour after that experiencing a feeling of well being, not unlike a small hit of pot.  As I explained earlier I was an experienced drug taker and did not think it felt completely like marijuana.  I just felt like I was in a slightly different more relaxing place.  It ended up being the best time I had in France,  experiencing the simple and extraordinary beauty of the countryside.  I still have not managed to find it again,  but I will always remember the beauty of absinthe.</p>",
 "year": "1997",
 "id": "5701",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-06-22T07:00:00.000Z",
 "views": "21766"
}
