{
 "title": "20 Years Later",
 "author": "aridelros",
 "citation": " aridelros. \"20 Years Later: experience with Transcendental Meditation (ID 57081)\". Erowid.org. Dec 11, 2006. erowid.org/exp/57081",
 "substance": "Transcendental Meditation",
 "bodyweight": "150 lb",
 "header": [],
 "report": "<p>Being the eldest male of five siblings from a divorced parent background, I've had my share of problems. I was about 19-20 at the time I tried Transcendental Meditation, but before this, I was spiralling out of control - mainly from all the college day drugtaking ( downers, alcohol, beer, and the sheer joy of peer pressure ) - but also from failure to face day to day facets of real life problems on even keel. So I basically had two problems  the drugtaking and living in an impenetrable eggshell. The drugtaking was basically an MTV-influenced reward and punishment lifestyle  and the eggshell life prevented me from seeing problems  both good and bad  as they really were. Instead I had warped up all psychological defense and offense mechanisms for dealing with real life situations.</p><p>I decided to try Transcendental Meditation and began saying Ohhhhmmmm 15 minutes a day. Sometimes twice daily. Sometimes more. After about two weeks of this, there was a certain lucidity to my thoughts. Problems could be separated from emotion. And I started smiling more, becoming more calm  for a moment, there was some window of lucidity from all the turbulent and neurotic experiences a shy college boy faced.</p><p>Now I am 43. The TM experience was particularly significant on hindsight because medical findings have documented meditative experiences as bringing a healing dimension to overall well-being. I guess brain circuitry is rewired with meditation, and traffic of brain chemicals called neurotransmitters are manually controlled by the individual for the first time.</p><p>I have used meditation from time to time  but never with the diligence used during those days. I find that controls Ive imposed on myself twenty years ago in a meditative state, still hold today. Two decades ago, Ive ordered myself to be transported into the Alpha level when joining my thumb and two index fingers together (Silva Method of Mind Control )  I find the same still holds true after 20 years. Amazing.</p>",
 "year": "1986",
 "id": "57081",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-12-11T08:00:00.000Z",
 "views": "6981",
 "dose": []
}
