{
 "title": "Beautiful Insanity",
 "author": "Milk",
 "citation": " Milk. \"Beautiful Insanity: experience with Mushrooms & Cannabis (ID 57084)\". Erowid.org. Mar 21, 2008. erowid.org/exp/57084",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>Down the hatch.  The shrooms actually didnt taste that bad, but my friends and I ate some muffins to help get them down anyway.  As soon as we finished, we went outside for a walk, just because it was such a nice day.  After 20 minutes, walking was beginning to feel different, and the 4 of us agreed to go inside.  When we entered the house, the trip of my life began.</p><p>First, some backstory.  My first experience with pot came at the start of my senior year in high school.  Before then I had actually been against drug use, believing the things that my school and the government had been forcing into my brain about the horrible effects of drugs.  My friends had been smoking for much longer, and when I finally tried it I understood why.  Since then my use has increased.  Through the majority of the school year I would smoke just on the weekends while partying, but by the fourth marking period my friends (Ill call them D, N, and A) and I were smoking everyday, usually multiple times a day.</p><p>Over the summer this habit continued, and I began to read up on different drugs and their effects, mainly mushrooms.  I wasnt really looking for them, but when I found out near the end of the summer that D could get the 4 of us a half ounce, I was all for it, as were N and A (N had done shrooms before, sometime in the school year).  D and I left the party we were at, bought the shrooms, came back, and decided that our trip would take place the next day.</p><p>The next morning was beautiful, sunny day, warm temperature, nice breeze.  It was August but the leaves hadnt begun to change color, and since we live in the suburbs there was plenty of nature to marvel at.  I woke up at 9am, drove over to Ns house, and chilled there until about 10:30 when D arrived, baggie in hand.  We weighed out an 1/8 each, and when A got there at 11 we had a nice breakfast of mushrooms and muffins. </p><p>Someone suggested that we go for a walk, so we walked down some street close to Ns house.  N said that when he ate them for the first time they took about an hour to kick in, so we were all under this assumption.  Obviously this was a different type of mushroom, because within 20 minutes I felt strange in some way that I cant explain.  Everyone else must have felt it too, because we all decided to go back to the house.  The visual hallucinations hadnt started yet, but I was feeling a mild body buzz by the time I sat down on a couch in the living room.  Thankfully Ns house has a lot of big windows, so the inside of the house was very bright and vibrant.</p><p>I have an awful sense of time normally, so at this point I had absolutely none.  I looked over at N and his head was buried in a couch cushion.  I looked in front of me at A, who was staring out the window at the backyard.  They were obviously beginning their trips, but I didnt feel anything yet.  I began to feel anxious, but then I looked up at the ceiling and couldnt take my eyes off of it.  Soon enough, the white ceiling was turning different shades of gray and it seemed like it was breathing.  I was getting lethargic and was fascinated with the simple ceiling.  N shot up and said to move around the house, to keep exploring.  After getting up from my position on the couch, I realized that moving would be much more difficult than it sounded.</p><p>For what seemed like hours, I switched constantly between the kitchen and the living room, staring at the patterns made by a fan, the floor, paintings, and other objects.  I first tried to get my friends to see what I was seeing, but I realized that everyone should have his own trip and I let myself sink deeper into mine.  The four of us were laughing a lot and only talking in simple sentences, probably sentences that didnt make any sense.  At one point N opened a door to a small closet that would be just some mundane space under normal circumstances.  When I looked in though, I saw every single object and color in the closet, and for some reason I got extremely emotional as a tear developed in my eye.  I realized that there is so much life in everything, that we dont stop to appreciate the things that we see during the course of a normal day.  It seemed like it would take an infinite time to explore just this closet.  Someone yelled something like ITS SO HARD TO BE IN ROOMS! and we all laughed and completely agreed.  Every new room seemed like an entirely new world, full of countless things to explore.</p><p>D then walked out onto the deck that overlooks the backyard, and yelled for all of us to come out.  I walked out and to my amazement, the grass looked like an ocean, making waves as the wind blew.  All of the bright colors of the outdoors made me so happy just to be outside.  I found happiness in everything I saw.  D, N, and A went back into the house, but I stayed outside just sitting on a step, thinking random thoughts about life and god.  Ideas seemed to be traveling in my brain at light speed, and as N would say later, my mind was in pieces.</p><p>Next, N opened the door to his basement, a part of his house that I had never been in.  Seeing this place was amazing to me, and after exploring the walls and paintings and such, I took a seat at the bottom of the steps, staring up the stairs at a light.  Staring at this light, I finally realized why white is the combination of all colors, as I saw a spectrum of brilliant colors surrounding the white light.  At this point, I began to really love the mushrooms.  A was laying on some steps, staring at the wall or something, D was laying on the floor and staring at the carpet, N was staring at something else, and we were all just screaming OH MY GOD!!!!!! and laughing our heads off for an eternity.  If anyone in their normal mind had walked in on us, we surely would have been checked in to the nearest asylum.</p><p>After my adventure in the basement, I went back outside by myself, laid down on the deck, and this is when I probably hit my peak.  My mind was racing, I was in a state of extreme euphoria, colors were beautiful, everything was perfect.  I rolled around on the deck in different positions, just grunting and unable to formulate words.  I looked at the wood of the deck and once again thought about the size of the world I live in.  With the limitless number of tiny details in a piece of wood on a deck, I realized that well never be able to know everything about everything.  The world is too big a place and everything inside it has too much to know about, most of which probably cant even be figured out by us as humans.  I then switched to the absurdity of life, and considered that since well never know all, that I am just like a piece of wood, tiny and insignificant.  I may be important to myself and those around me, but in the long run I wont even be a memory.  Everyone alive in the past, in the present, and in the future, will eventually be nothing.  The purpose of life is to make something out of nothing, and be happy with what you have.</p><p>Life shall be more fully lived in so far as it has no meaning</p><p>- Albert Camus</p><p>I thought about perspective, and by looking at some garbage men I understood that everyone lives in a different world, made by the individual mind.  Each person is his/her own god, basing their thoughts and feelings off of what they see.  We each see something in a different way, and this is why we are all individual and completely different.  The mind is the greatest tool in the world.</p><p>I went back inside after a lifetime of rolling around and came downstairs to D, N, and A laughing and repeating nonsense to each other.  Disney?  Or Disney not? they kept asking each other.  They had a notebook of drawing paper and a bunch of markers, so making things more colorful seemed like the right thing to do.  I laid down on the floor nowhere near the markers and slowly dragged my body to them.  I still couldnt speak in any language, so I just grunted to my friends (thinking back, I probably could have spoken the whole time, it just seemed like it took so much effort to make any noise) and took some markers and some paper.  I scribbled different patterns on the paper, each one in a different color.  By this time N had gotten up to play some music, a set by Erick Morillo.  Upbeat music is always nice.  The music actually fueled my creativity, I attributed colors to the different songs I heard and I drew what I was hearing.  After a little while of this, we were all starting to come down.  I went upstairs and finally thought to look at the time.  It was only 2pm!!  This 3 hour trip felt like the whole day, and even though it was so short it was everything I wanted and more.</p><p>I went outside to wait with the other three for some girls to show up with weed.  We were all ready to smoke a nice blunt.  They got to the house at around 3, rolled up 2-3g, and we went outside.  By this time it was pretty hot outside and the heat made me feel a little strange, but I had no idea what was about to happen.  I sat down halfway through the blunt because I was getting very tired of standing, and when I stood back up after it finished, my head started to spin.  I was sweating profusely and someone told me I looked pretty pale.  The spinning was getting out of control, so I went inside for some cool air, but this didnt help.  I began feeling extremely nauseous, so I made my way to the bathroom.  Every step I took, I got weaker and weaker and my vision was getting blurrier and blurrier.  A few steps from the bathroom door I felt like the world imploded into my head and I blacked out.</p><p>I regained consciousness a few seconds later on the floor, went into the bathroom, and vomited.  I hovered over the toilet for about 20 minutes, still feeling pretty disoriented, when suddenly I heard the garage opening.  Ns mom was home!  I felt good enough to get to the sink and keep quiet until I heard Ns mom talk to him for a few minutes and then go upstairs.  Luckily, she had no idea I was even there, she just saw D, N, and A and thought they had been smoking, which wasnt a very good thing for her to find out, but was much better than what she could have found.  I snuck out of the bathroom, but as I started to move I started to get dizzy again and N had to help me find my shoes and my keys.  I ran out of the garage, vomited again in the driveway, and ran to Ds car.</p><p>My vision was very blurry and I felt very weak, so I stayed in his car for a few minutes until I felt like I could drive to his house.  I was in absolutely no condition to drive, but I had to get away from Ns house so that he wouldnt get in trouble.  Thankfully, Ds parents werent home and I followed him very slowly to his house, which is a street down from Ns.  Driving was no easy task.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>At Ds I just sat in his basement and cooled down.  Eating helped after taking the trip on an empty stomach.  My vision eventually went back to normal and I started to feel a little better.  N came over and we watched Half-Baked, and for some reason the colors on the TV were much more vibrant than usual, yet everything else in the room was back to normal.  After the movie I went home, still feeling a bit different, and rested there until I completely came down.</p><p>I have no idea what happened at the end of my trip, could have been any combination of the shrooms, the weed, and the heat that just acted in some strange way on my body.  Even though that happened, I still loved the experience, have used mushrooms since then, and plan to use more in the future.</p>",
 "year": "2006",
 "id": "57084",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-21T07:00:00.000Z",
 "views": "2933",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
