{
 "title": "Natural Groove",
 "author": "Greenman",
 "citation": " Greenman. \"Natural Groove: experience with Ayahuasca (ID 57099)\". Erowid.org. May 4, 2008. erowid.org/exp/57099",
 "substance": "Ayahuasca",
 "bodyweight": "93 kg",
 "report": "<p>I rushed into the cab and blurted out the destination. At that point, my three other friends were near a McDonald's drinkin up on some ayahuasca tea. I had to get there quickly if I was to have any. Upon arriving at the locale, I found two of my friends just lying on the ground, smiling stupidly. They had taken the tea roughly 20 mintues before. The third friend, Jo, had some also, but he was more composed. Thats to be expected since Jo is a member of the santo daime sect/cult/religion and has taken it a bunch of times previously. I quickly swigged my share, which was considerably smaller than the others', I suspect.</p><p>We wandered around a bit, and the thing finally started kickin in for me. It wasnt really the hallucinations I expected. I was perfectly capable of coherent speech and thought, and cops would be no problem. However, there was definitely something special about the state I was in. There was a greater connection between ourselves and nature, a feeling of happiness and friendship. The peak for me came when I just layed down on the rough grass. I partially stared at the cloudy sky, part dozed, but always with strange thoughts in my head. Strange in a very, very, very pleasant way. At one point I felt my legs detach and stretch, but after realizing the impossibility of that fact, the feeling quickly subsided. The mellowness of the thing lasted for roughly 2 hours. and no vomiting, either. I believe I had a small portion, so the effects were mellow and it was easy on the stomach.</p><p>Overall, I cant wait till I give ayhuasca tea another try. A very natural groove, I just felt good.</p>",
 "year": "2006",
 "id": "57099",
 "gender": "Male",
 "timestamp": "2008-05-04T07:00:00.000Z",
 "views": "3631",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 cups",
   "administration": "oral",
   "substance": "Ayahuasca",
   "form": "(liquid)"
  }
 }
}
