{
 "id": 5714,
 "title": "First Trip to K-Land",
 "date": {
  "submission": "2007-08-21T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Peter Glam",
  "gender": "Male",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "lines",
    "quantity": "2"
   },
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "0.5",
    "quantity": "0.5"
   },
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Over the years, I've experimented with many drugs: Marijuana, Ecstasy, Cocaine, Acid, Methamphetamine, Inhalants, GHB, DXM, and pills of all sorts, but never got to try the elusive Ketamine. I researched the drug thoroughly and began my search for it.  I gave up months later because nobody could find any. Ketamine had disappeared almost completely from the club scene I was so new to.",
  "Then a friend of mine called me up and said 'Hey, I got a hookup with some K, so I can make a little extra money.'  I thought it was a joke, but when we went to pick it up, the empty Ketamine bottles were on the counter, and the powder was being scraped from the Pyrex.  Fresh from the oven.  We waited until we got home, doing a couple of bumps of meth to hold us over.  My friend weighed out the bags of Ketamine to distribute to friends as a present, and set aside some for us.  I did a line and wasn't sure what exactly I was supposed to expect.  I waited and felt a little strange, and another line was laid out for me.  This one was much bigger than the first, and as soon as I finished it my friend looks at me and says 'Go and wait in the car before you can't walk downstairs.'",
  "I felt like I had jumped into the deep end of a swimming pool.  I went outside and had a nice conversation with my friends dog, picked some violets to decorate my car with and had another line of K.  I felt the distinct sensation that time had altered. Either it had slowed down, or sped up or both, simultaneously.  There was a change in my perception of the world around me.  It felt like a CG sequence in a video game of sorts-not quite real.",
  "My friend came out to the car and took the keys-I wasn't driving anywhere.  I sat enjoying the experience and realized only about 20 minutes had gone by since my first line.  I remember saying how I wanted the universe to reveal its secrets to me.  We stopped at a gas station, and my friend said to me 'I'm going to go in and pay-can you pump the gas?'",
  "'Yes. I can do that. Yes,' I reply, knowing full well that I was incapable of really even moving from my passenger seat.  I go around to the pump and desperately try to figure out how to even operate a gas pump, and convinced myself that if I could figure it out, I would have discovered the meaning of life.  Then I heard a voice from behind the pump.",
  "'How far is it to Knoxville from here?' the voice asked.",
  "'Uhm, about 3 hours, I'd say.'",
  "'How many miles is that?' came the voice's reply.",
  "'I actually have no idea, because I've been to Knoxville maybe once. Wait-who are you?'",
  "The voice revealed itself.  From behind gas pump number 4 stepped a short, middle aged Native American shaman named Sky Hawk.  I thought I had lost my mind.  Sky Hawk told me about his recent trip to Mexico and his drive across the United States.  I couldn't stop wondering where my friend was. It seemed like she'd been inside the gas station for about three years, so I excused myself and went in to look for her.  Sky Hawk soon followed and started talking to the both of us this time. I was relieved to find that my friend (who was sober) could see him also, and that he wasn't an image I'd conjured up in my head.",
  "Sky Hawk asked our names and our birthdays and after we told him he started to tell us things about ourselves and each other that a complete stranger should not know.  I tried to comprehend what he was saying but kept realizing that I didn't know where I was, or even who I was-just that I was K-ed out of my mind and there was a very intuitive shaman telling me my darkest secrets.  He warned us of Mercury's retrograde that started about an hour before we met him and to be careful for the next three weeks. Furthermore, he invited us to his sweatlodge in the mountains of North Carolina.  By the end of the conversation, which lasted about 45 minutes or so, I could feel myself starting to come back to my own body. ",
  "I sobered up completely a few hours later, as we made our way back to my friends house and we spent the rest of the night finishing our half gram bags of K each.  We had only black lights on in the dark room, and I noticed that my friend's face looked completely different every time I looked at her. We started swimming in her room after we decided we were living in a fish tank and then had a dance party where we threw things as hard as we could.  It was our new superpower-'Power-Throwing' is what we called it.",
  "When my bag was close to being finished, I did a large bump and then accepted the fact that I couldn't move.  It became a fact of life that everything seemed to be in a tunnel and in slow-motion.  I was afraid at first, but realized I was fine, and that I hadn't taken too much.  It was very dreamlike and actually very hard to remember."
 ],
 "erowid": {
  "id": "33360",
  "citation": " Peter Glam. \"First Trip to K-Land: experience with Ketamine & Methamphetamine (ID 33360)\". Erowid.org. Aug 21, 2007. erowid.org/exp/33360",
  "substance": "Ketamine & Methamphetamine",
  "views": "4826"
 }
}
