{
 "title": "Falling Into the Gap Again",
 "author": "Paradigmdream",
 "citation": " Paradigmdream. \"Falling Into the Gap Again: experience with Salvia Divinorum (leaves & 5x extract) (ID 57144)\". Erowid.org. Sep 12, 2009. erowid.org/exp/57144",
 "substance": "Salvia Divinorum (leaves & 5x extract)",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "0.5 joints/cigs",
  "smoked",
  "Salvia divinorum",
  "(leaves)",
  "",
  "3 hits",
  "smoked",
  "Salvia divinorum",
  "(extract - 5x)"
 ],
 "report": "<p>I was at my friends house. I'll call him Jesus to hide his real identity. Jesus and I were just hanging out like usual, watching a movie. I had brought over a small bag of 5x Salvia Divinorum extract that I had leftover from previous experimentation. He also had a small bag of Salvia Divinorum leaf (not extract like I had). To start we had rolled up a Salvia leaf joint. I'd say there was maybe a gram of leaf in it, possibly more, I'm not exactly sure though as I didn't roll it and wasn't paying much attention while it was being done. We then went outside for a few minutes to smoke what we had just rolled. When we were finished we hurried back inside since it was freezing outside. We sat down for a few minutes and continued watching Evil Dead 2. I figured that there was no better time than now to attempt a Salvia breakthrough. I picked up my Jesus' water bong and pack the bowl with somewhere between 1/8 and 1/4 of a gram. I didn't weigh it before hand so I'm not 100% sure. I topped it off with a bit of plain Salvia leaf to take a bit of the harshness out of the hit.</p><p>I was now ready to begin. I took my first hit and it made me feel a bit light headed and somewhat disconnected but I was still aware of where I was and there weren't any profound visuals. I remember turning to Jesus and saying something along the lines of 'I feel like I'm in the wrong line at K-mart'. I took another hit and it made the strange feeling of being in the wrong line at K-mart more intense. I also became more light-headed and started having an odd feeling of a very strong force holding me down. The force holding me back was almost like gravity had become doubled. It was hard to get up but I was able to. I said something along the lines of 'I'm almost there. I can feel it. I'm very close' I managed to get up and refill the bowl with the remaining Salvia extract that I had. I'd say it was probably an equal amount to what I had for the previous two hits. So I packed it in and sat back down and took the third hit. I closed my eyes and relaxed while I let the powerful entheogen take me across to the other side. I don't remember exhaling or opening my eyes but I knew that I had crossed over.</p><p>At this point I had become aware that I was in a totally different state of being. Almost as if I had left my body and gone somewhere that I would never be able to go to while inside my body. Gravity had become incredibly strong as I could not lift myself from the bed that I was on. I could feel myself being pulled down into what I want to say was an endless hole. I started to become very scared as I didn't know what was happening. I had completely forgotten that I had smoked Salvia just a few moments ago. I did not know where I was, who I was, who Jesus was or what I was doing in this strange place. I had full ego loss. When I had realized that my body, mind, soul and ego where all seperated, I became even more terified and scared. I didn't have the feeling that I had died, which I have experienced on a number of occasions in the past, but I had the feeling that something was terribly wrong. I felt as though I was somewhere that I was never meant to go. I started to get an overwhelming fear and anxiety that I was stuck here. I wasn't going to return and my body, soul, mind and ego would never reunite with each other...</p><p>But I was ok with that. I accepted it. When I came to that acceptance I started to return to reality. I could feel my mind and soul return to my body and shortly after my ego had returned as well. I was able to recognize where I was and I was able to recognize Jesus once again. For about 10-15 minutes I returned I felt very strange and very upset because I did not know what had happened. After another 5 minutes or so I was completely back to baseline and continued watching Evil Dead 2. I'm not sure exactly how much time had passed while I was in that other world. It felt like I was there for days but I'm sure it was only a few minutes.</p><p>Some people would read this and probably think 'Why would you want to experience something like this?'. Well, from my experiences, ego-loss helps me learn a lot about myself. It's helped me come to realizations of what I have in life and that I should be happy with what I have. I don't do these substances to 'get fucked up and have a good time'. I do them because I want to learn about myself and the world. I enjoy going deep into the depths of my mind, body and soul and discovering my true feelings towards objects, people, locations, anything really. While using these, my feelings are completely unrestricted and without boundries. There is no limit to what I can feel. I may feel happier than I ever have, more sad than I ever have, more scared than I ever had, etc. I may discover feelings that I never realized I had.</p>",
 "year": "2006",
 "id": "57144",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-09-12T07:00:00.000Z",
 "views": "2087",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 joints/cigs",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  },
  "1": {
   "time": "",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
