{
 "title": "Cosmically Jamming",
 "author": "Mike M",
 "citation": " Mike M. \"Cosmically Jamming: experience with Mushrooms, Alcohol & Cannabis (ID 57155)\". Erowid.org. Sep 7, 2009. erowid.org/exp/57155",
 "substance": "Mushrooms, Alcohol & Cannabis",
 "bodyweight": "140 lb",
 "report": "<p>Alright so it goes like this. We (I and three friends) were at a friend of a friends house and there was free beer so naturally I made my way at, I seemed to be the only that was really drinking. There was also a pipe or two going around in circles so I occasionally would toke it up. Later, around 12:00 a.m., I received about 3-4 grams of dryed cybes from a pusher that had made it into town, at first I gave him $25 for a regular sized bag but then after judging on how good these shrooms looked I gave the guy $10 more and I received 2 good sized primordias. In my head the plan was to get a bit faded at this 'party' then go to my friends house and play True Crime: Streets of New York while we trip because for me these shrooms were, judging on the sight, the best shrooms I've ever got a hold of.</p><p>So some how we all got are asses glued to the couches passing a pipe around, then someone suggested we eat the cybes. So easily, I then gave way to peer pressure. I ate half the bag on the couch, then about 15 minutes later I went into the restroom and ate the rest of the bag including the primies I had, while everyone else ate about a half bag. Someone threw on the disc 'Robbin' the Hood' by Sublime and so the trip began.</p><p>As I sat on the couch my mouth started to get tingly and my lips had a bit of numbness going on. This was about 10 minutes after eating the entire stash I had. I then felt very pleasant, euphoric and funny looking but it was all good because everyone else looked funny to me too, like they were having a good time but also strange looking in appearance. I would occasionally burst out in a single laugh due to the silly awkwardness of it all, just sitting there on the couch listening to music. When I started to focus on the music, my eyes were fixed on one thing and I could see everything in my periphials was moving with some kind of rhythm, that is when the 'rhythm' took hold and made things funny.</p><p>I told everyone that everything was going with this rhythm, though they, tripping themselves, simply ignored me which was reasonable. Then things such as glances and mundane sounds started to become a bit too hilarious, to the point where I thought my laughing was becoming annoying. So I tried to keep still and quiet for awhile, but colors were so vivid and sharp and my body felt like it was being tickled by itself so I felt an urge to move around and examine the area. The sequence of events that follows is a bit mixed up, I think due to the memory loss caused by the alcohol.</p><p>Somehow I spaced out and ended up on the couch that was opposite the one I started to trip on, I think I had a mild blackout or something. But either way things were still funny and neat in that certain trippy kind of way. Then I noticed a couple fighting in the kitchen, which had an open view but was in a different room. At the time I thought the guy wanted to fight me for looking at his girlfriends ass or something, I'm some what of a pussy and on top of that I was trippin so I instinctively said to him 'Hey man stop the hate, come on don't hit anyone' but as it turns out in hindsight of my own and my friends accounts they were fighting each other (haha). So I got pissed but at the same time found it f**king hilarious and I marched my ass right out the door and I was ready to walk home in freezing temps with a smile. My friends ran outside, oblivious towards the reason why I stormed off, and stopped to reason with me. I agreed with them to get the hell outta of there before the cops were called. So we got in my friends blazer and jetted off into the night.</p><p>This is also a part I don't remember much though my friends said we went to another friends house and I don't remember that so I'll skip to where I got my consciousness back somewhat, at a trailer of one of the friends I was hanging out with. We arrived at the trailer. Again from a hindsight account my friends said I was acting like a stubborn child kicking and screaming while they tried to drag me from the vehicle, another part I don't remember. So we got inside and someone turned on the television. As being as messed up as I was they put me in a room, which now I find was kind of funny because I don't know why.</p><p>So I sat alone in this room. Still feeling the rhythm, my body was naturally just flowing with the silence I was enveloped by. Though there was nothing in that room to do, I was entertained by the way my mind and body felt. I heard voices, though this may sound crazy, of all different kinds of people none of whom were anyone I knew. Everytime I heard a voice it was positive, uplifting and really humorous to me. Two of these voices that particularly stand out were just very cool sounding, so mellow, earthly and assuring. One said 'nigga you trippin'' and the other said 'should we let him know'. Now I'm am not black so I don't know why I called my self a nigga but I was having funky auras flowing and swaying with the rhythms in my head, this coincided with the movements of my body which was just seated while I jammed my head to the beat I felt. It's so weird everytime I would sigh it felt as though all the weight in the world was lifted off my shoulders, I felt truly relieved and peaceful almost as if I had reached heaven. I guess that's why they call shrooms 'Flesh of the Gods's because I really did feel like I was one with the Divine, whatever 'It' may be.</p><p>I saw very vivid colors, especially when I looked out the window. Though it was night when I looked out the window I really did see the color of an orange sunset, something I've seen before but at the time it wasn't supposed to be there.  Thoughts of two different kinds of animals came to mind, apes and cats. That was the first time in my life I've ever truly felt like an ape, it was so funny I cannot put it into words. Also a house cat with a crown on his head appeared before I fell asleep kinda of weird because a week earlier my friends 12 year old cat had died. Believe me or not I felt that cats presence and it's purring. I know something like that sounds absurd but it is truly what I believe I felt. That purring was comforting and was the thing that put me to sleep right on my friends bed.</p><p>In the morning when I woke up, I forgot where I was and how I got there. It was the best intense trip I've ever had and it was positive. Took me a while to kind of figure out so that's why I typed it up.</p>",
 "year": "2005",
 "id": "57155",
 "gender": "Male",
 "timestamp": "2009-09-07T07:00:00.000Z",
 "views": "2062",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": "",
   "amount": "4 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
