{
 "title": "A Magical Journey",
 "author": "Milton",
 "citation": " Milton. \"A Magical Journey: experience with Mushrooms (ID 5728)\". Erowid.org. Jan 21, 2002. erowid.org/exp/5728",
 "substance": "Mushrooms",
 "bodyweight": "220 lb",
 "report": "<p>I had acquired a quarter of very blue-looking shrooms and decided that me and my friends, who are roomates, were going to trip.  We tripped the night after I was done with classes and just starting spring break.  I was kind of unsure on how to take the shrooms, I didn't just want to eat them plain, because there was some shake in the bag. </p><p>We divided the bag up exactly four ways, although I took the larger pieces of caps.  We each made peanut butter and shroom sandwiches, with lots of cold lipton iced tea.  Immediately after finishing the sandwiches, I rolled a joint of some very high quality commercial pot. </p><p>About an hour later, my stomach was feeling a little sick, but the joint seemed to help curb it.  I felt tremendously stoned.  I think I was the first to start tripping, as I had purposefully not eaten all day.  For the first time in an hour, I stood up and went to refill my Iced tea.  Being a pretty big guy (5'10, 220 lbs,) I was amazed at how light and uncumbursome my body felt. </p><p>The shrooms really started to kick in, and we were all lying on the floor of the apartment.  We decided to put a blacklight in the kitchen, which has black and white checkedred floor.  The combination was really interesting, I remembered. All of us are musicians, and the violin player put on a CD of solo violin music that never sounded so beautiful.  My sister played violin and it was sad to hear the beautiful music.  Later we listened to Shostakovich 5 and it was absolutely redeeming.  The chords seemed so full of energy and I really remeber just melting to the harmonies.  I was lying on the couch at this point, and it really felt good to hold the cushions tight against me.  I started to think of my old girlfriend, and it made me sad to think that she wasn't a part of my life anymore. </p><p>Then the visuals kicked in.  I was content closing my eyes and watching the movies that my mind (and the shrooms) were displaying for me.  Opening my eyes revealed a world more unrealistic than the world my closed eyes showed me.  I saw very round images of red blue and green hued objects.  I felt very, very comfortable with everything.  Then I opened my eyes and noticed that everything was pretty weird.  My cigarettes were burning very quickly and prefectly, and smkoing seemed great and very serene.  I vividly remeber moving my fingers rapidly and not believing that they were leaving trails.  A lit cigarette in a dark room became a chasing ball when I circled it around.  I felt like in the backround, I could hear pouring rain, although it was a clear night out completely.  I started to freak out that a substance could do this to me.  My vision turned Matrix-style 3-D, and things were very mathematically correct for awhile. </p><p>My friends all kind of went to their rooms and lay in bed and I walked home.  I was unnaturally hot and sweaty, it must have been 30 degrees outside.  I had only a fleece pullover on, and it seemed ridiculously hot.  I would have given my kingdom for a ride home, which was only a block away.  Cars scared me and I was a bit paranoid of passing out on the way home.  I felt like curling up and just laying in the street.  What an expreience!  I stayed up for four hours, hoping to get back to reality.  The littlest sounds freaked me out and the odd visuals continued to disturb me.  I was afraid to open my eyes, for I thought I was be so scared.  Going to the bathroom alone was a frightening journey.  I'm not sure if I will do shrooms again, but when I do, I will do it on a much warmer day, and also have people who arent shrooming around to watch us.</p>",
 "year": "2001",
 "id": "5728",
 "gender": "Male",
 "timestamp": "2002-01-21T08:00:00.000Z",
 "views": "55850",
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
