{
 "id": 5728,
 "title": "Flavorless",
 "date": {
  "submission": "2004-07-14T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "NutterButter",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "40",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-D",
   "form": "liquid"
  }
 ],
 "report": [
  "material: 40 mg 2C-D dissolved in warm water and taken orally with vitamins.",
  "body weight: 170 lbs.",
  "date/time of ingestion: may 6th 11pm.",
  "T 00:00 I am at a friend's place and they are drinking. I dose 40mgs and wait. There are 3 people around, white zombie is playing on the stereo, lighting is normal.",
  "T+00:19 first alert. The base of my skull feels a slight pressure.",
  "T+00:27 A subtle clumsiness is observed. Not much more. The music is chaotic but not affecting the come up at all. Starting to feel it in the head now. This is much stronger than 10mgs. Psychedelic effects are present, but no visuals. The head high is noticeable, and not unlike 2c-i.",
  "T+00:35 Still subtle, but I am intoxicated. Fully aware, but feeling removed from things a bit and body high is there but not overly pleasurable. It is not bad though. Eyes very dilated. I am currently talking on a balcony with some friends, conversation is good, I am smiling.",
  "T+00:42 I feel slightly chilly- I cant tell whether its the wind outside or the action of the 2c-d. This also reminds me of 2c-i. The music does nothing for this. I feel like something soft would be good, like this would be good to lay down to, i would recommend a massage and or soft music. The emphasis is on softness.",
  "T+00:44 I am starting to peel away, my nose is running a bit so maybe it IS cold outside. This stuff makes me pee just like other PEAs.",
  "T+00:55 Indescribable puffiness felt between left gum and upper lip. Left forearm feels odd. Opening and closing left hand feels really strange. Like it takes more effort or something. Hot and cold hallucinations of airflow now across my skin.",
  "T+01:02 A few surges of something just passed through my head, and I enjoyed it. A sprinkler out in the lawn started spraying a stream of water and I had NO IDEA what it was- a hissing sound? I was looking in my friends beer glass for the sound. Im not sober. Shadows seem all over the place. I am HIGHLY suggestible right now.",
  "T+01:07 I can see this as being sensual. Sexual. I feel a slow crawling wave every so often. Nice, slow. Not powerful like mdma, but definitely there.",
  "T+01:15 This is not tremendously visual, but I am at ++. It is 12:23 if I continue to peak I may very well approach a +++. I am not opposed to this. I like the lack of body load. I have some chills though.",
  "T+01:30 Im having all sorts of strange ideas about truncations of words and the evolution of language. Sex would be great on this stuff if it were possible.",
  "T+01:50 The time dilation is intense. Getting lost in conversation very easily. There IS pleasure in this. I am in the peak and I am listening to pete steele sing I know youre fucking someone else. The smell of cigarettes is distasteful.",
  "T+02:13 Time dilation..i wasnt terribly introspective before, but now I am starting to become introspective.",
  "T+03:00 I am largely down. I have been entertained for an evening. I would call this benign because it does nothing particularly special, it gets you intoxicated and pleased and thats about it. Its like a crappy feel good B movie- nothing special but for some reason we like it anyway.",
  "T+03:37 residual effects remain, feeling good, very positive.",
  "T+04:30 I am sober and able to drive home.",
  "Summary:",
  "After my 10mg experiment i was expecting much less than what i got tonight. Still, 2C-D does not stand out. I was intoxicated and there was some trippy thinking, but I cant say that any of my senses were enhanced. I don't see much theraputic value at this level, but it would be good for social settings. It doesnt have any unique features like the other 2c-xs, but the body high is very pleasant and I think it would be enhanced if a person was massaged. There were sexual pushes to this material, but it didnt push me in any other directions. there was no noticeable recurrent patterning of thoughts or colors or anything really, I just felt not-sober, with a phenethylamine body high and I smiled a bunch. I was definitely a ++, but in retrospect I don't think i was really all that close to +++. Many of my trips with other materials have promoted detailed trip reports because the trips added emphasis to something or brought something new to my attention. Writing in this kind of detail here would be like writing the details of a trip report on alcohol. There were no new ideas brought out by the material. Did I brainstorm and come up with some inventive things yes, would i attribute it to the drug, no. Again I reiterate, this material got me to a plus two, but lacked any real unique definition, it was like having a few puffs of some terrible high school weed, drinking a couple mixed drinks and then taking a stacker 2.  It was stimulating but stoning at the same time. I enjoyed the experience, but I still agree with shulgin that it lacks its own flavor."
 ],
 "erowid": {
  "id": "33411",
  "citation": " NutterButter. \"Flavorless: experience with 2C-D (ID 33411)\". Erowid.org. Jul 14, 2004. erowid.org/exp/33411",
  "substance": "2C-D",
  "views": "9804"
 }
}
