{
 "title": "Hypnagogic Apathy",
 "author": "Dtdj",
 "citation": " Dtdj. \"Hypnagogic Apathy: experience with Kratom (ID 57300)\". Erowid.org. Jun 25, 2007. erowid.org/exp/57300",
 "substance": "Kratom",
 "bodyweight": "89 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "6 capsls",
   "oral",
   "Kratom",
   " T+ 0:20",
   "6 capsls",
   "oral",
   "Kratom"
  ]
 ],
 "report": "<p>I bought the capsules from my local headshop in the UK (12 for 5), don't know how many g of Kratom powder was contained in each capsule but they were about this big:  (00000000)</p><p>I'd read about the effects of Kratom as a stimulant at low doses, and a dreamy sedative at higher doses. It was my intention, basically, just to relax myself as much as possible to relieve stress.</p><p>I took the first 6 capsules at about midnight, all together. I was pretty sleepy anyway after working out, so I set up some mood lighting in my uni room and chilled on my bed for about 20 mins. After this I got impatient, decided to risk the nausea Id read that I could get, and took the remaining six caps.</p><p>So by 12:20, I'd taken 12 capsules on an empty stomach (3 hrs since I had last eaten)</p><p>Over the next hour, I can only describe the experience as very pleasant. I was just lying in bed listening to chillout music and enjoying it, and every now and then I'd get tingly waves going through my body which felt pretty good/euphoric, but in a very basic, opiate kind of way. I could tell instantly what other people meant when they said that opiates and their derivatives affect them at a more basic level than, say, drugs that act on the serotonin system. I just felt a total absence of pain or anxiety. Very calm, almost apathetic - but in no way incapacitated. I still knew whatever problems I had were still there and needed to be sorted out, but I just didn't really care. My mind was very clear, but this didn't really matter either.</p><p>At about 1:30, I started drifting in and out of sleep. Music was still playing. The experience was similar to how people normally feel when they're drifting off to sleep when theyre very tired (called a hypnagogic state) but prolonged, and intensified. I struggle to remember what they were now but I'm quite sure I had some very interesting, but totally random and meaningless waking dream fragments, like random faces and situations, and scenes from my past. But it's not like 'wow!', if it was then you'd be fully awake and it wouldn't be happening. Think I must have fallen asleep at about 5 AM.</p><p>Kratom is by no means mind blowing. I don't lie in bed quivering with happiness. And I don't have a strong desire to do it again soon. It can't really be compared to cannabis. It just makes me content and free of anxiety - in essence, nothing bothers me. Drifting in and out of sleep in bed can be very pleasurable for short, intermittent periods though. I'd drift off into some weird dream fragment, then get woken again by the music and get a giddy wave of relaxation.</p><p>I find cannabis an awful sleep aid, as Im either having too much fun, or getting paranoid and depressed. I am happy to report that I experienced no nausea whatsoever (although I had an empty stomach).</p><p>P.S. About a year ago, I made some kratom tea from resin. However, I found the taste so very unpleasant, even when mixed with something else, that I got no effects as it took me over an hour to drink down the dose.</p>",
 "year": "2006",
 "id": "57300",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "12590",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "6 capsls",
   "administration": "oral",
   "substance": "Kratom",
   "form": " T+ 0:20"
  }
 ]
}
