{
 "title": "An Alternate, Cartoon Reality",
 "author": "I love shulgin",
 "citation": " I love shulgin. \"An Alternate, Cartoon Reality: experience with Salvia divinorium (15x extract) (ID 57301)\". Erowid.org. Jun 12, 2009. erowid.org/exp/57301",
 "substance": "Salvia divinorium (15x extract)",
 "bodyweight": "75 kg",
 "report": "<p>So finally, after 3 unsuccessful tries, I had a proper salvia experience. The first time I tried I smoked a bowl of leaves out of a pipe, it was horrible. The second and third times I tried with 10x extract out of a bong but didnt feel that much. This time I smoked a tiny amount of 15x extract out of a pipe and my world changed.</p><p>First a bit about my previous drug use and experiences, as well as my mindset on drugs. I am what some may call an amateur psychonaut, I absolutely adore the sacred shrooms and I partake in them on an infrequent basis. I get high a couple of times a week at the moment, I have had everyday marijuana use before and I dont crave it anymore. Getting high is fun, tripping is more important to me. Since moving to a big city near several good clubs, I have also started a somewhat silly pattern of weekend mdma use. Actual mdma when I can get it, I find it totally trippy and different to who knows what in pills. Not being a snob, several amazing nights have been had on pills, including one which I am DAMN SURE from reading reports that was MDA. From reading about the 2C family, I am inspired to continue with my voyages of conciousness expanding and I cannot wait until I have a free house and a tab of acid. That will probably change my life more than anything to date, but anyway onto salvia.</p><p>I took the hit with my best friend sitting me in my uni room, it was eveningish and I took a hit using a normal clipper lighter, the week previously I had lost my amazing and trusted butane lighter, which pains me. I lay back on the bed and felt like I was falling into the mattress somehow. I became aware of a definitely female presence, like an all knowing grandmother somehow watching over me. My hands were waving in the air, and I somehow became taken with moving them in a certain pattern in the air, like I was feeling a rope suspended horizontally over me. I then realized this rope was in fact a rip in reality and if I forced my hands to move down and up I could control its position in the room. I started explaining the effects to my friend and he was like Oh fuck I want some after I assured him I was not scared. My effects passed and he took a hit, he went into his own state which I cannot explain here.</p><p>Maybe 10 minutes after this I took another hit, as I wanted to sink further into the mattress and see what was really going on. I took a more efficient hit this time, and felt the rushing down feeling and sank way into the mattress. I became part of a cartoon machine, lost all knowing that I had taken a drug, I WAS IN THIS MACHINE. The machine was made up of similar people, it WAS reality. We had to oscillate in a specific time, or the pattern of the machine was thrown off and it was bad. Our purpose in life was simply to jerk somehow in a crazy undulating pattern, this was the workings of the machine. If we worked in time then a word was spelt, this word ended with an sI was at the bottom of the massive 3d S shape of people/things. I fucked up basically as explained later and the letters didnt form properly.</p><p>This was a very colourful world, and incredibly intricate. This really unlocked my minds eye. The grandmother type presence was here, and possibly controlling the actions of the machine. So many types of text and language were thrown at me that I cannot remember one specific example. Throughout this my arm movements were part of the hallucination, such as my arm moving controlled the rate of the machine. As my friend was asking if I was ok, I was moving my arms and fucking the machine up basically. I am pretty sure this caused the next step.</p><p>Then reality and all of time stopped, as I realized that the machine was nothing more than a series of counting of children's books, that a mother was counting (the grandmother) as her child was tying up his shoelace. Our entire existence had been nothing more than a tiny speck on the bottom of some kids shoe, and by that I mean my ENTIRE LIFE AND THAT OF THE WHOLE WORLD. I was brought up really religious, and my subconscious threw out some deep questions, like where god fitted into all of this. When reality had stopped and existence ceased, I became aware of my friend once again looking at me and asking if I was ok. We have shroomed together several times, we know what to do in bad situations, of which there had only been one mild one involving him not me, and he was asking standard questions.</p><p>After this, I got up (after 10 minutes in the machine) and stumbled about the room for a bit. I became disgusted by the sweat on my body and on the bedsheets (there was hardly any, I am not a sweaty person). I felt absolutely fucked, like my body was slow. This is not a nice feeling. I felt unclean and after a while went for a shower. I was pretty badly coordinated throughout and felt mentally and physically heavy and disconnected.</p><p>We reflected on this for a while, went for Chinese and went and got high. It was a truly deep and powerful experience I am not going to repeat in a hurry. I way prefer shrooms because they let me see amazing things in what is already there, they dont absolutely slingshot me into a different universe with different basic rules. I am sure acid will appeal to me way more, as I Love the concept of it unleashing my mind to infinity. I am glad I had this experience and I do not feel the need to repeat it.</p>",
 "year": "2006",
 "id": "57301",
 "gender": "Male",
 "timestamp": "2009-06-12T07:00:00.000Z",
 "views": "2891",
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
