{
 "id": 5730,
 "title": "Dirty Body High, Clean Introspection",
 "date": {
  "submission": "2006-11-05T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Boddhisatva",
  "gender": "Male",
  "weight": "177 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I took 20mg at 9pm.  At approx. 10:30, I was stunned by visuals while staring at the wood-paneling on my friend's living room wall.  From that point I had an intense feeling of weight on my body.  I was reluctant to move.  The weighted feeling did not return later.",
  "After leaving my friend's house, I walked to the car, not recognizing exactly the surroundings that should have been familiar.  During the car ride, the air conditioning blowing on my legs creating a confusing signal, I couldn't tell if the air was very hot or very cold.  It felt as if someone rubbed Icey Hot all over my inner thigh.",
  "When I got to my room I laid down on my bed (approx 11:30pm).  My feet felt like they were burning.  A tingling sensation seemed to run down one-side of my body, making me wonder if the drug was affecting only one side of my brain.  I had a strange tingling sensation in my testicles that was prevalent most of the trip (9pm-3am). ",
  "My thoughts seemed especially introspective and profound.  My thoughts flowed very well at times, and other times I would forget my thought mid-sentence, trying to explain it.  Sometimes I would dismiss thoughts as a product of being on a drug; it seemed to me that this was a result of the drug not totally encompassing me.",
  "Overall, I would describe it as a 'dirty' physical high.  I didn't much care for how my body felt most of the night.  The drug was useful for therapeutic development, though, and much mental development was accomplished.  I realized several things about myself and my friends while on this drug.",
  "It should be mentioned that I had someone around me at all times not taking any substances, which was probably very helpful."
 ],
 "erowid": {
  "id": "33423",
  "citation": " Boddhisatva. \"Dirty Body High, Clean Introspection: experience with 2C-T-2 (ID 33423)\". Erowid.org. Nov 5, 2006. erowid.org/exp/33423",
  "substance": "2C-T-2",
  "views": "8437"
 }
}
