{
 "title": "God Never Listens",
 "author": "Kirkus",
 "citation": " Kirkus. \"God Never Listens: experience with Ketamine (ID 57317)\". Erowid.org. Jun 18, 2007. erowid.org/exp/57317",
 "substance": "Ketamine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Alcohol",
   "(liquid)",
   "",
   "30 ml",
   "IV",
   "Ketamine",
   "(liquid)"
  ]
 ],
 "report": "<p>I have always been curious but wary of special K. At Big Cypress (Phish NYE 99) in the everglades, there was a curious guy skipping down the road like a leprechaun asking everyone and their mother if they wanted 'Special K' while simultaneously appearing rather crazed and screaming 'I'm in the biggest K-hole of my life..' It was a little sketch. After seeing that I never thought I would go on a voyage with this drug.</p><p>However, a friend got a medicinal bottle of Ketamine Hydrochloride from a hospital and we decided to try it. This was my first time ever using a needle and intravenously using a drug. My friend administered my dose, which was friggin huge, because he wanted to make sure I got the experience. I did. While both of us are pyschonauts, I haven't taken LSD in a number of years, preferring mushrooms and MDA these days. But, that being said, I wanted to satisfy my curiosity of the needle in the vein experience and the trip of K.</p><p>I put on Phish's 'Lifeboy' as my tripping song, which is a beautiful poignant and personal song to me. The context of my relationship with this song, which is a beautiful lament of the letdowns that come from false interpretations of reality....basically it is an ode to a universe where we all exist with no strings from 'God'--at least the understanding of 'God' one might find at the local church. This song and this trip also coincided with a breakthrough day in my life where I was being put through a proverbial meat-grinder to move far away and attend rehab for....marijuana! What a joke. Basically, to make a long story short, I am gay and finally revealed that to my family whose false interpretations of my life finally broke down the walls of communication to reveal the truth. The K trip I had was a complete and utter focus point of all of the sadness, self-loathing and frustration that was finally being released in my life. It was the most powerful drug experience I have ever had, but also one of the scarier. But it was good. I enjoyed it.</p><p>My friend injected my seriously huge vein with ease and I felt the effects immediately. I remember him asking me how I felt and I sort of slumped sideways on the coach and then was completely overtaken by a cosmic buzzing that came from all directions, in to out, out to in. The full-body experience immediately answered any and all questions I had about the experience of injecting a drug. It was incredible. I felt like the visual component was of the same intensity and coalesced with my body experience, which was frightening because I felt like I was coming to a point of passing out which I thought was death. I love tripping and I always 'die' on a good trip. But this was different. I was aware of the situation, but the intensity of the drug completely overtook me.  As the whole world seemed to compress itself on me the ceiling of the room dropped and I felt very claustrophobic. I was at the point in 'Lifeboy' where Trey is singing 'God never listens to what I say...' and in that instant of the room shrinking, and me exiting life quickly and Phish serenading me with one of the most meaningful songs of my life, I completely broke down in tears, lurched up off the couch and threw my hands on the ceiling.</p><p>I was blind but aware that God had never listened to me because I was so wrought with angst from my sexuality--which has always been at the forefront of my self. I have always known, but for some reason I was able to feel the entirety of my life's emotions surrounding this issue as I was pushing the ceiling from crushing me.</p><p>Right before the trip got extremely intense, probably a minute after injection, my friend walked out of the room. When he did this, the experience I had was of watching all human contact leave me. I felt like I was left to die, an invalid, unable to carry on and therefore at the end of my life process. The feeling was heavy immediate and acutely focused on the sadness and joy of death. I was soaring through the place of existence where fear and hope are the same experience....scared for one second, jubilation the next because you are still alive!</p><p>Which takes me back to the point about LSD--this Ketamine experience was similar to some of the stressful, strongly psychedelic trips that I feel like I 'survived' instead of 'enjoyed.' But when I realized I wasn't dead or dying I was filled with excitement and thanks and praise. I still can't decide if that is what the experience is all about--to just appreciate being alive. Ultimately, the celebration of life is the lasting lesson I hold from drug experiences. We celebrate our personal existence in the midst of all other experience--we fell connected.</p><p>I am all about antennas. I am an antenna. No vacuums, only conduits of energy. The K experience for me was a huge surge of energy through my self antenna. And the experience was extremely pleasurable physically. I rolled my body around and experienced the truth of another brilliant Phish song, Axilla II, when Trey says, 'Never understood what my body was for...that's why I always leave it laying out on the floor.'</p><p>For sure. The K trip is taking my existence into the primordial life-goo that is half-playground, half-church, extremely deep and philosophically challenging. I had always heard of the drug as a dance-friendly club drug, which is totally not my scene or style or anything. I was shocked after my experience because it was so totally dissociative I would never take it outside a place I was extremely physically comfortable. This drug is a powerful mind-opener with a delightful body surge buzz. It doesn't last too long, which is wonderful because of its intensity at high dosages, and it doesn't make me feel bad.</p><p>The one problem with my trip which further escalated my feeling of death, even though I was keenly aware I had injected this drug, was my heart. It was pounding fiercely and I knew it wasn't normal. I had been drinking before and I probably had too much alcohol in my system. The alcohol buzz was completely gone after injection of the K, but I believe the trip and extreme-heart-pounding was heavily exacerbated by the alcohol. I think I was given too high a dose for a first trip on K and first IV use, but I am happy I was given a huge dose because I feel I can talk authoritatively about the experience of the drug.</p><p>I reeled around laughing on the floor when I was convinced I wasn't going to die. It was very physical and my friend and I laid together and talked silliness and giggled and played with our tentacle-arms and gummy toes.</p><p>I think the IV use of this K was probably the most intense way to experience it, and I feel that my experience was of the stronger-variety.</p><p>In a nutshell, through the antenna--the experience was fluffy, woozy, buzzy, full-body totality and felt like it collapsed my mind.</p><p>The sensations of the drug were exactly like many of my intense dreams---especially the ones where my body is fast asleep but my mind is trying to force itself awake and I jolt out of the sleeping-buzzing-deathtrap and wake myself up--I had to jolt myself up to hold the ceiling from falling and started crying and was screaming, 'Gabe!.....crying.......'God never listens! God never listens to what I say' and I was crying and emotionally fused and literally attempting to keep the low ceilings from crushing me and my homosexuality. I felt like the entire room I was in and my experience of holding the roof up was really all inside my head as a metaphor (I mean, everything is a metaphor for everything always, I believe...) for me trying to hold my last stand (i.e. Come Out to family...) to save myself from the crushing weight of inner pain and despair that come from a Southern white gay man brought up in an intensely prideful conservative family, community, etc. I live in Oregon now, God bless me, but the ceiling was the meat-grinder that I had already been dealing with that day.</p><p>I survived the ceiling and fact that 'God never listens...' (which is true in a sense...because of the interpretation of God and whose meanings of it are being referred to or usage overall of the concept of 'Almighty' instead simple of 'All.' But not too get too out there, I basically survived and conquered the rats nest of emotions that riddled me from birth. Today I am out, alive, joyous, appreciate, and single!</p><p>'Lifeboy' has taken on a new position in my heart now too, because I was out on the lifeline, swinging or dangling in the throes of existence.</p><p>I was quite dramatic. All within five minutes I was numbed, crying, holding up the weight of the world so It didn't crush me, and then a nervous joyous fervor that further echoes my antenna-ethic--everything about energy, transition, growth, etc.</p><p>I love Phish, I love life, and I love myself. My experience with Ketamine was far more powerful than I had initially expected but it also brought more revelations and depth than I was expecting. I can't believe this is dance club drug. Gross. That is way off the mark.</p>",
 "year": "2006",
 "id": "57317",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-18T07:00:00.000Z",
 "views": "11020"
}
