{
 "title": "My Epilepsy and THC",
 "author": "Skrtliftr",
 "citation": " Skrtliftr. \"My Epilepsy and THC: experience with Cannabis (ID 57313)\". Erowid.org. Jan 18, 2008. erowid.org/exp/57313",
 "substance": "Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>I'm 29, and an epileptic, currently in the process of getting off my anticonvulsant pills. The first time I tried smoking grass was 5 years ago, when I was 24. I've wanted to try it before, but always feared of the impact I'd have, considering my medical condition. I've always thought I'd wait till I found someone I could do it with - someone who'd be trusted, in case I had a seizure. And then I found someone, who turned out to be my partner for the following 4 and half years.</p><p>We met as neighbors, and it wasn't long till the thought of trying smoking grass with her popped up. At my 2nd time, I got paranoid. I started getting ticks, especially in my legs - which horrified me, since it was a sensation I remembered getting just before I seized up. It was her reaction that helped me get through that - she explained it was the thc, and not the epilepsy.</p><p>Now, 5 years later, I'm still smoking grass regularly, usually on a daily basis.</p><p>Before smoking, I used to get seizures about 3-4 times a year, sometimes more. I've only had one seizure since. It's already been 4 years, seizure-free, and I only have grass to thank for.</p><p>Sometimes I'd forget to take my pills with me, If I wasn't sleeping at home. I started noticing that if I smoked, I'd get less auras, and would be able to get through the night. The more I smoked, the less side-effects I'd get from the epilepsy.</p><p>In according with my doctor's orders, I'm now reducing my monthly dosage of anticonvulsant pills, and will ween off them in about 4 months.</p>",
 "year": "2001",
 "id": "57313",
 "gender": "Female",
 "timestamp": "2008-01-18T08:00:00.000Z",
 "views": "8414",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
