{
 "title": "Another Life",
 "author": "2nd Millenium Hippy",
 "citation": " 2nd Millenium Hippy. \"Another Life: experience with Salvia divinorum (leaves) (ID 57337)\". Erowid.org. Sep 18, 2009. erowid.org/exp/57337",
 "substance": "Salvia divinorum (leaves)",
 "bodyweight": "160 lb",
 "report": "<p>Reading others reports, I feel motivated to relate my experiences. So far I've enjoyed five trips, and have had similar visions every time. I don't normally make any special preperations for a trip, beyond filling the bong. It's just me and the dog in my living room.</p><p>The first time a couple of friends (who introduced me to salvia) also joined me. My friends had just purchased some purple sticky from the mall (man I love living in Canada) and had been forewarned of the dangers. Having had experienced my share of mind-altering substances I was somewhat suspecious when they showed me the dose, the pile was half the size of a penny. 'That much? Shit I only need one lung for that!'</p><p>The first toke was really harsh, tasted like crayon, and really white smoke when exhaled 20 secs later. I knew that some sort of drug was beginning to enter my system almost immeadiately. I must admit I had held doubts that there was ANY active ingredients in the little black leaves.</p><p>The illsions began with the room being 'stretched', like looking through a wide field lens. Then it disappeared altogether and was replaced with the farm I went to as a kid on a school field trip. Somehow, at the urging of the other children, I had trapped myself in some sort of tesseract. My entire life since then had been lived inside this dimension, and now I was trying get out. Dispite the possiblity for panic, I wasn't afraid. In fact I was laughing hysterically at my predicament. It felt as if I was being sqaushed between the pages of a book and if I could only stretch my arms out wide I would again be in the 'real' world. Then it was like I was the spine of a book and the pages represented all the days of my life, but 'that' life was all 'fake' I had never left the farm and in order to 'really' live I had to get to 'the other side'.</p><p>Now the laughter was from the other children. They had actually tricked me into this tesseract, and now, although it was extremely funny, they wanted me to get out. Try as I might I just couldn't 'get up/out'. The pages of my fake life where drawing me in. Suddenly I was on my parents couch from long ago, hearing what sounded like an airport loudspeaker relaying vital information which I couldn't understand, but needed to hear. When I was just starting to get worried REALITY came back. My friends seemed to coalesce right in front of me and the airport loudspeaker morphed into the commercial on TV.</p><p>I was somewhat unnerved for the rest of the evening (is all this REAL?) but the next day I was completely myself.</p><p>Taking salvia solo has proven to have its risks. Returning to reality is something like waking from a particularly active dream, sometimes involuntary arm movements can cause damage, I really liked that bong too :-(.</p><p>Once my first stash was gone I questioned whether or not I would ever do it again. The psycological effect of not beleiving in reality is kinda unsetelling. I question my perceptions all the time, and 'Reality is merely a collective hallucination', so I decided to continue smoking.</p><p>All my other trips have been variations of the same theme. After experimentation I've found that 1g of leaves is enough for about a 45sec to 1min trip. Anything less and there isn't a noticeable effect. Unlike all the other reports I prefer to take one large hoot as opposed to two or three smaller ones.</p>",
 "year": "2006",
 "id": "57337",
 "gender": "Male",
 "timestamp": "2009-09-18T07:00:00.000Z",
 "views": "2448",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 }
}
