{
 "title": "A Friend For Life",
 "author": "Matt O.",
 "citation": " Matt O.. \"A Friend For Life: experience with LSD, Alcohol & Cannabis (ID 5740)\". Erowid.org. Jan 22, 2002. erowid.org/exp/5740",
 "substance": "LSD, Alcohol & Cannabis",
 "bodyweight": "75 kg",
 "report": "<p>From previous experience I now know to take acid in a place were you feel secure, likley to be amoungst friends in a familuar atmosphere.  The experience I'm refering to, I did exactly that and yes, I felt 'at home', secure and excited... The acid I took was labled 'Bart Simpsons' apparently well dipped and quite potent.  This information was provided by the one I purchased the acid from, so the warning was not taken extremley seriously as everyone wants to buy 'potent' acid.  Anyway, I let one and a half tabs dissolve underneath my toungue and waited; filling in the time with the use of weed and beer. </p><p>Slowly the effects crept upon me, but however don't hit all at once, I relised I was wasted when I'd already been wasted for at least half an hour.  The memory of the experience is not as vivd as what I would like, I think that tends to happen when you take the drug though; from what I can remember the first signs were a pulling tension on my upper check bones and an insaciable urge to grin evil looks at the same spot for what I'm not sure regaurding periods of time.  As the night continued the acid released more charges of 'blissful emptiness' which felt incredibly fulfilling in a tripping like way.  On LSD it feels so pleasing to be so wasted, I could almost describe it as being totally plastered from alcohol but without the bad side effects; although I feel a little less orientated and a little more scattered... I almost feel like a shady/dark person while strange thoughts rush through my head(being what I usually wouldn't think).</p><p>I found myself feeling at some stages anxious and at others calm, my mind was all over the place and I wasn't sure what to do with myself.  Sometimes I even felt bored in the beggining but after it kicked in properly I was rushing for hours!  Laughing came freely and often, funnily enough the laughing was at nothing; just uncontrolable fits of laughter for no reason(besides acid of course)</p><p>Definatley the most potent drug I've tried and to this day my favorite, I suggest to people who hav'nt tried it... don't miss out it's an ensured good(or at least extremley wasted) night!</p>",
 "year": "2001",
 "id": "5740",
 "gender": "Male",
 "timestamp": "2002-01-22T08:00:00.000Z",
 "views": "8607",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": "",
   "amount": "8 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "2": {
   "time": "",
   "amount": "3.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(leaves)"
  }
 }
}
