{
 "id": 5742,
 "title": "No Big Deal",
 "date": {
  "submission": "2007-12-17T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Poppy",
  "weight": 102
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "125",
    "grams": 0.125
   },
   "administration": "oral",
   "substance": "Methadone",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "195",
    "grams": 0.195
   },
   "administration": "oral",
   "substance": "Barbiturates",
   "form": "pill/tablet",
   "specific": "Phenobarbital"
  }
 ],
 "report": [
  "About ten minutes ago, (at 10:15 PM) I took 3 65mg tablets of phenobarbital.  One thing that may make my experience different from that of others is that I have been on about 125 mg of methadone for over two years.  I have never taken heroin (though I am a fan of poppy tea) but the methadone is to overcome a proclivity for pain pills, and more than that, one for alcohol.  Methadone completely takes away my desire to drink, and if it weren't for that, I would have dropped it like the bad habit it is years ago before it became an addiction as well.  Frankly, I'd rather be addicted to methadone than alcohol any day.  I'm a much nicer, and more normal person on methadone than alcohol, and I have no desire to drink.  Even if I do think I want a drink, I can maybe drink one or two beers or mixed drinks at the most, and then I just don't want any more, I have had my fill - and I can't get drunk, even if I try.",
  "Occassionally, I get bored, and like to experiment with other things, looking for a nice high, or relaxing interlude.  It is harder to find this since I have been on methadone, and I don't want to make a fatal mistake in what I am mixing with the methadone.  I have such a tolerance to the methadone built up, it feels like I'm really not taking anything at all - I have to remind myself that I do have it 'on board' as well as any other med I might take.",
  "Benzodiazepines take away my anxiety, and never leave me feeling overdosed or comatose, but they don't get me high, either - I am used to them as well.   Given that sidebar, (no pun intended), now I'll write about the drug at hand, phenobarbital:  ",
  "Now that 30 minutes have passed, I am a little anxious, and have had a chest pain or two, which could all be in my head, but I am going to take a couple of asperin, just to be safe. Well, it's 11:30 PM now I'm tired (no big surprise) so I guess I will finish writing about my experience with phenobarb more tomorrow, but so far, it's no big deal.",
  "Well, it's 'tomorrow' but it is only 2:30 AM, and I can honestly say, as far as sleeping medications go, I have had better.  I slept for four hours on the sofa, and woke up with a bit of a headache.  There was no fun 'buzz' or 'high' that accompanied my use of phenobarbital.  I didn't even get the 'body drunk' that other users have written about.  Perhaps my dose was too small, but I know this is a serious drug, so I don't want to risk too much more. I like being here, I just enjoy better highs and seriously doubt phenobarbital is where to find what I'm looking for in that  department.",
  "At this point, I will continue to recommend ambien and halcion (as long as you stay awake through the sleepy effects) for a much more enjoyable time.  I will try a couple more tablets, since I have already started down the phenobarbital path, and would like to finish sleeping the night through.  Should anything fun, or unusual happen, I will publish a postscript to this, but I honestly don't expect it.  Better times can be found with better meds, in my opinion, and if you are looking for more buzz for your buck, phenobarbital is not the medication to spend it on.  I found it to be very disappointing, and even as a sleeping medication, it is weak, in my opinion."
 ],
 "erowid": {
  "id": "35519",
  "citation": " Poppy. \"No Big Deal: experience with Barbiturates - Phenobarbital & Methadone (ID 35519)\". Erowid.org. Dec 17, 2007. erowid.org/exp/35519",
  "substance": "Barbiturates - Phenobarbital & Methadone",
  "views": "29698"
 }
}
