{
 "title": "The Big Trick",
 "author": "Fed",
 "citation": " Fed. \"The Big Trick: experience with DXM, Morning Glory Seeds, Ketamine & Salvia divinorum (ID 5743)\". Erowid.org. Jan 22, 2002. erowid.org/exp/5743",
 "substance": "DXM, Morning Glory Seeds, Ketamine & Salvia divinorum",
 "bodyweight": "200 lb",
 "report": "<p>  I have smoked salvia many times, at least 15 or so. I have always used the 5x extract, and i almost always get the same results. Accept for this time.</p><p> Every time I smoke salvia I have an experience of dejavu, its like a 'salvia-space' that is basically there no matter what setting I actually am in. Its realy hard to put into words what its like, but I can honestly say that salvia is the MOST potent (albeit shortest acting) psychedelic around.</p><p> Given that, I am usually able to keep my mind pretty straight during the trip and so I don't freak out and basically keep in mind that Im just fucked up.  However, the other day, me and two friends were at the one kids house. The kid whose house it was , Ill call him R, and me had drank some of the morning glory extraction we had made as well as snorting about 50  T suggested that me and him smoke some of the salvia I had, R was fucked up from the morning glory and K so he passed. Getting a lighter was an ordeal cause I had ruined mine cooking up the K earlier, but anyways. We took out R's bong (very cool might I add) and I filled the entire slider up with the shaky salvia 5x. I lit it and held the flame to the material. I inhaled a huge hit of the hot (nasty tasting shit) smoke and held it in. As I held it, T took his hit off of what was left. I saw him finish his hit, and then somehow the bowl got blown on R's bed causing a ball of glowing ashes to explode on the covers.  It was after that when I started to lose it. Instantly I was in the salvia space.</p><p> This time was totally different. Perhaps due to the ego dissolving dxm and K, I started believing that the entire world, all things I considered real, were just facades for some big trick to make me think I was real, and now it was all coming apart. I looked around my friends room and thought that everything was really fake and I couldn't believe that I had fallen for it. T was fucked up now too, and he seemed to be in on the game, he kept laughing, which made me freak a little and I think I was trying to say something to him. R was just watching the two of us, and I realized that he was fake too. I kept trying to pick up a sweater that was on my lap to see if I was real or not, but it didn't much work. It felt like I had to proceed through a system of hallways and doors or perception to enter the scene of reality,which I did, but it was a never-ending cycle.</p><p>Thankfully the experience wore off before I went nuts, and me and T talked about what happened. He said that he felt like he was in my head and could tell what I was thinking. The scary part was that what he said was true. After a bit, we decided to smoke some more, and had a more traditional experience.</p><p> Ill never forget what happened that day, it was the most gone my mind has ever been. In the words of T, 'salvia is way to narly for some people, so they don't get it'</p>",
 "year": "2001",
 "id": "5743",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-22T08:00:00.000Z",
 "views": "19161",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "240 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 3:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  },
  "2": {
   "time": " T+ 3:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": "",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
