{
 "title": "There's No Going Back Now...",
 "author": "The Only Steve",
 "citation": " The Only Steve. \"There's No Going Back Now...: experience with Salvia divinorum (20x extract) (ID 57466)\". Erowid.org. Jun 12, 2009. erowid.org/exp/57466",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "155 lb",
 "report": "<p>I have tried Salvia (1x, just dried leaves) a couple of times about 3 years before this experiance. I had closed eye visuals and a body high, but nothing too interesting. A few weeks before this experiance I smoked 5x Salvia in an equal dose (one very large hit, held for as long as I can) but experianced no effect whatsoever. This time we had decided to try again, and a container of 20x Salvia was purchased.</p><p>I sat and began to prepare for my trip which was taking place at a friends house. There were several other people there, friends. I was sitting outside on a patio. A couple of other people had already tripped and confirmed that they felt strong effects. I filled the bowl to the brim, lit the substance with an ordinary lighter, and inhaled deeply. I filled my lungs completely. I held it until after the trip had completely begun, so I'm unsure as to how long it was, but it was about 15 seconds before the trip kicked in. It tasted pretty awful, very bitter.</p><p>When the trip kicked in, I remember being nothing but a yellow face, and I could tell this despite not being able to see myself. I somehow seperated into a second blue face, and I could see from both faces. From each face, I could see part of the other in my peripheral vision. They were facing opposite each other, and were touching on the left side, where an ear might normally be. I was in a blue and yellow patterned world, the inside of a sphere of indefinite size, big enough to hold the faces, but not much bigger. My faces were still connected to each other by the ear area, rotating within this bubble, always facing directly opposite each other. It's difficult to explain how I saw from both faces at the same time, but I could. The world was bright and vibrant, and covered my entire visual field.</p><p>I suddenly had the realization that I had been, and would be spinning in this world forever, and that my life on Earth was only a brief dream I had managed to escape to, before being pulled back into this nameless world, from which I'd never escape again. I felt very great sorrow and terror at the realization that this was eternity, and that I would never experiance anything else ever again. I could not remember who I was in the dream, I just knew I was this dual being, two faces, and that's all I'd ever be. I remember spinning around, wondering why I was only this pair of faces, who would never meet each other. They spun because they were trying to turn and face each other, but they were connected to each other, like blades on a fan. They chanted a strange word to each other, phonetically sounding similar to 'Sashosapojdoh', over and over. I could not control the faces, only see through their eyes. I was terrified.</p><p>Then I remember gaining control over one of the faces, and my vision consolidating into just the eyes of that face, the yellow one. I could still see part of the blue face in my peripheral vision. Suddenly I managed to look slightly to the right, and the wall of the sphere dissolved for a second. Beyond it I could see people standing around me, talking to me. I felt as though they could never help me, and I would soon pass by them and go back to spinning. I did. Then as time passed I managed to force a look to the right, and the wall of the world dissolved again and I could see them, and now hear them over the chanting. They spoke to me, trying to say something, and I tried to communicate with them. I managed to keep from completely falling back into this spinning world, as I forced myself to think of why I was seeing these people and who I was. This angered the blue face, so I became slightly afraid. I remember suddenly remembering who these people were, but I thought I must have gone crazy.</p><p>Then I remembered! I had taken a drug - what was it? Marijuana? Yes, but this was unlike any other marijuana I'd ever had, no wait. Salvia! A wave of relief washed over me as I realised that what was going on wasn't real. I could still see the world, but it began to dissolve more and more. I finally began to speak to my friends, who seemed terrified at my reaction to the drug and my facial expressions. I began to reassure them that I was ok, I was just having a very intense trip, which was still very much in progress, and that I'd be back to normal soon, not to worry about me. They seemed to understand what I was saying, although I found it next to impossible to pronounce even the simplest words correctly.</p><p>Reassuring them was good for me, I reassured myself in this way as well. I told them to stay close, but asked them not to touch me or speak. I began to briefly expirement with the tail end of the trip, closing my eyes and venturing for seconds at a time back into the world I had been in and others, but making sure to open my eyes every now and again to remain oriented to reality. Finally the trip faded, the body high (it felt like tv static, that's the only way I can describe it) subsided.</p><p>I don't consider this a bad trip, it wasn't very scary once I had come down, it was just very intense and caused me to panic right when it started, as I wasn't expecting effects that strong. I did enjoy the trip once I remembered it was a drug, but before that it was very terrifying. This will be my last trip on Salvia, I have no desire to venture further from reality, I was definitely in a completely different dimension. Apparently I did stand up and speak to my friends, asking after moving a bit to go back to the chair, where I was lead, but I don't remember any of that.</p>",
 "year": "2006",
 "id": "57466",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-06-12T07:00:00.000Z",
 "views": "4072",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
