{
 "title": "The Other Place",
 "author": "Lip",
 "citation": " Lip. \"The Other Place: experience with Salvia divinorum (10x extract) & Moclobemide (ID 57479)\". Erowid.org. Aug 24, 2007. erowid.org/exp/57479",
 "substance": "Salvia divinorum (10x extract) & Moclobemide",
 "bodyweight": "75 kg",
 "report": "<p>Background</p><p>Male, mid-twenties, with considerable experience of Cannabis, Psilocybe Mushrooms, HBWR, MDMA and DXM. Id had several mild Salvia experiences, and one moderately powerful experience with 10x. This had been surprisingly pleasant, not only causing hilarious laughter but also intense physical pleasure. I perhaps had a false sense of security over Salvia's power. It was now over a year later and I wanted to try Salvia again, to explore more of what this plant had to offer. My mental state is generally quite anxious and neurotic, and I am prescribed 600mg daily of the reversible MAOI Moclobemide. I had chosen to take the Salvia extract alone but thought I would be safe if I took it in my garage, where I would be less likely to break things or injure myself if I moved around. The only lighting was the orange glow coming in from the street. It was 11.30pm, at the end of a busy day. This report is an attempt to describe what I experienced in chronological order, but I have probably forgotten some parts of the experience.</p><p>The Experience</p><p>I started by testing the water with a small dose, maybe 50mg, which produced the familiar pulsing rush I remembered. The Salvia began to pull me into its depths, but the effect wore off quickly. This little taster made me feel confident I could now handle a more powerful experience, and my initial nervousness seemed to have gone. I reloaded the little metal pipe to about half way, probably about 125mg, and finished the bowl in one, unpleasantly hot, inhalation.</p><p>I lay back on the floor of the garage, holding the smoke in as long as I could. By the time I exhaled, the Salvia was taking hold of me with its strong pulsing rush. The track Blue Room by The Orb was playing through my earphones, and the pulsing rhythm of the music seemed to synergise with the rapidly building effects of the Salvia. A thought suddenly came into my head: Do you think they're happy now? This was disturbing as it did not seem to be my own thought, but a question being put to me from somewhere else. But I knew it referred to certain people in my life, who I realised Id been wanting to please, or to somehow be accepted by. The tone of the question seemed to be somewhat mocking, adding to my unease. The Salvia had immediately revealed subconscious issues, catching me off guard.</p><p>I suddenly realised I was no longer in reality but in some other place, with a menacing feel to it. I was now feeling very uncomfortable, both physically and mentally, and any attempts to ground myself only made my confusion and fear worse. I still vaguely knew I had taken the Salvia, but this knowledge seemed irrelevant in the present context. I felt like I was being held down in some completely separate world, which happened to be my garage, and I realised there were others here as well, and they were finding my state of confusion amusing. At first, this sensation of others was fairly generalised, but I began to feel that there were at least two distinct entities, one female, to my lower right, and one male, behind my head (in hindsight, I realise that these locations corresponded to a bag my head was resting on and a lighter in my hand). There was also a sensation of other entities in the background, and I had the feeling these were other people tripping on Salvia. The entities were all talking, but not in a verbal way. They were neither friendly nor malevolent, but I got the impression they were not happy for me to be here. I had the distinct feeling of being an intruder into something I wasnt supposed to be part of.</p><p>The experience was very much based on the physical plane of existence, most of my perceptions seemed to merge into a generally physical experience. I had now forgotten that I had taken a drug, and I wanted to somehow leave this place. However, one fragment of pre-trip knowledge did manage to break through: Dont worry itll be over soon I thought to myself. Problem was, I had completely forgotten what it was, which just added to my confusion. I got the impression that the entities where suggesting something to me: Why dont you leave. This seemed like a good idea initially, and I thought about trying to get up off the floor and leaving the garage, thinking that was the way to leave. I had just enough reason left to realise that this would be futile, but I must admit, the entities seemed very compelling, and I was very close to getting up and walking around, which was the one thing I had hoped wouldnt happen during the trip.</p><p>I then realised I was listening to music, and that it was shaping the experience in a negative way, so I took off my earphones. Still experiencing severe confusion, I tried to just lie still and relax and let the experience wash over me, but this wasnt effective. I realised I had to somehow participate in, and accept this bizarre world: I couldnt just be a rational observer, as this was effectively the same as fighting the experience. At this point I have the vague recollection of trying to reason somehow with the entities, but my memory of this is poor. Then I remember repeating an affirmation in my head: Its OK, they want you here. This seemed to help focus my mind, and I began to feel more relaxed and at ease. I kept on repeating this mentally over and over again and it become so compelling that I wanted to say it out loud, but I was able to control myself. The experience thereafter began to subside and I was soon more or less back in reality, although quite shaken.</p><p>I got up after a while, a bit unsteady, still experiencing a fairly high degree of mental confusion. I wanted to take a walk, but it was raining hard, so I went inside the house and just paced back and forth for about 15mins, trying to recall and make sense of the experience. There was still a distinct aspect of compulsion to this pacing about, and I found it hard to eventually stop.</p><p>For the rest of the night a feeling of otherness hung over me, a kind of haunted feeling. Blue Room played over and over in my head: I think I will choose something more soothing for future trips. Faces in pictures seemed to be somehow possessed by the Salvia, showing that the Salvia was still warping reality in a subtle and slightly grotesque way. I also had an increasingly bad headache, accompanied by growing nausea, palpitations and weakness, similar to a nicotine overdose, possibly an interaction with the Moclobemide. As I lay in bed trying to get to sleep, I experienced some vivid closed eye visuals, monochromatic but very detailed, including one of a lattice of pointed leaves all interlocking. This is odd since I didnt have any visuals during the trip. I felt anxious and disturbed and couldnt sleep until about 7.30am, with a haunted feeling persisting the next day. Although the peak effects of the drug probably lasted less than 5 minutes, its impact on the psyche obviously takes far longer to be absorbed. Salvia is by far the most powerful and spiritual psychedelic I have experienced, and I have the deepest respect for those who manage to navigate its bizarre universe.</p>",
 "year": "2006",
 "id": "57479",
 "gender": "Male",
 "timestamp": "2007-08-24T07:00:00.000Z",
 "views": "9536",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Moclobemide",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
