{
 "title": "Happy Place",
 "author": "BrainEngineer",
 "citation": " BrainEngineer. \"Happy Place: experience with Lorazepam (Ativan), Kava, Citalopram (Celexa) & Cannabis (ID 57476)\". Erowid.org. Jun 27, 2008. erowid.org/exp/57476",
 "substance": "Lorazepam (Ativan), Kava, Citalopram (Celexa) & Cannabis",
 "bodyweight": "134 lb",
 "report": "<p>I wrote this article because I feel it was a very interesting/unusual combination of drugs. For reference I am 16 years old, 5'5' and 134lbs.  I am a chronic cannabis consumer, and am very familiar with kava products.  I had been taking Celexa now for three days at 5mg a day during the night, after leaving a regimen of Wellbutrin due to, having too many side effects.  I have little experience with other drugs besides salvia divinorum and had never used a benzodiazepine before.</p><p>The reason I was given the Ativan is because I was very afraid of needles and they deemed it the easiest solution to relax me before a blood test.  I went to my doctor a few days ago and I was prescribed one 2mg pill of Ativan for my anxiety about having blood work needing to be done.  I had also brought a bottle of kava kava pills in my pocket incase I ended up needing to use them in conjunction with the medication to relax myself.</p><p>T+0:00 I took the Ativan at 4:05pm with a glass of water.</p><p>T+0:15 3 30% 250mg kava kava pills consumed with another glass of water.  From about here on my memory gets very fuzzy due to the mental affects of the drugs.</p><p>My doctor asked me if I'm in a happy place, I laughed in response and decided to sit in a chair as my legs were starting to feel like jelly.  I take out my Ipod and listen to some music to relax me, Sound enhancement is now at about 6/10.  A nurse walks in and rolls up both my sleeves, she slides both hypodermic needles into my arms and injects me with vaccines or boosters.</p><p>I feel very relaxed and everything begins slowing down and my appearance is similar to a drunken man now, as I stumble with the aid of my mom up some stairs to get an X-ray.  The X-ray is taken and I start to feel slightly euphoric, I am enjoying the high that the 'chill' pills have created.  I hear my name being called for the blood test I drift my way over to the lab, and 3 nurses surround me and strap me to the chair, they kept whispering relax, and said it would be over very quickly, I turn away and before I notice it they have a cotton swab on the arm and Im walking out of the medical center. </p><p>I was then driven to my friends house, and music is now at 7/10.  She drops me off and explains to my friend about the medicine Im on telling him to look after me.  Jack (not his real name) reassures her nothing bad will happen.  Laughing I run up the stairs and fill my friends bubbler with ice water and pack a bowl (.4g) of what was already great tree, we estimate THC content in the plant at about 21% and we then opened his keif catch and sprinkled some into the bowl (We got 21% from doing a solvent extraction, the two samples each were 20% and 22% by weight).</p><p>T+2:00\tI take green hit and by the time I exhale I can feel the cannabis starting to hit me, this is unusual though because my body has what is normally an unusually slow drug metabolism.  We then cashed the bowl with each of us taking another massive hit.  From here on out, most of what I am writing is what my friend later told me happened, my memory was SHOT.</p><p>Jacks dad arrives and picks us up to take us to an organ concert in a church.  Music is now at 9/10 and I am starting to become highly delusional.  We stop at a pizza place and pick up two steak and cheese subs. At this point I am only slightly conscious of my existence on this planet and the REAL tripping starts.  I was now having full open eyed visuals and closed eyed, in addition auditory hallucinations were practically full blown,  and the pitch of peoples voices were strangely altered.  At this point I can no longer speak properly and cant follow a conversation as my memory was limited to about a 3 second span.</p><p>Jack escorts me into the church deciding that sitting with his dad and step mom could be a very bad idea considering the shape I was in.  The only thing I can remember from the church experience was I thought the walls were breaking apart and little animals were jumping around at the end of each of the organs tubes.  I also had an intense visit with the devil, and from there followed a path to heaven.</p><p>(Memory blank)</p><p>Jack and I are now waiting for a bus to bring us to another part of Boston so he can make a sale.  Still delusional I ask Jack some questions about what we were doing and where we were, apparently one being, Were in Harvard square right?</p><p>Yea, why?</p><p>I thought we went to Mexico.</p><p>(Memory blank)</p><p>T+4:30</p><p>We are now at this guys house who jack was dealing to and some of his people are chilling at his house already, a bunch of people roll blunts and I once again pack the bubbler, we all pass tree around and a bunch of the older guys start breaking out some beers.</p><p>(Memory blank)</p><p>Jack brings me back to my place and we smoke some more with another friend and we all fall asleep.  Next morning I had a hangover consisting of still being a bit blazed, tiredness from the Ativan still in my body, and a slight lack of sleep.</p>",
 "year": "2006",
 "id": "57476",
 "gender": "Male",
 "timestamp": "2008-06-27T07:00:00.000Z",
 "views": "19704",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Pharms - Citalopram",
   "form": "(daily)"
  },
  {
   "time": " T+ 0:00",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Lorazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:15",
   "amount": "750 mg",
   "administration": "oral",
   "substance": "Kava",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:00",
   "amount": "200 mg",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 4:30",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
