{
 "title": "Incredible High",
 "author": "B",
 "citation": " B. \"Incredible High: experience with Kratom (ID 57487)\". Erowid.org. Nov 28, 2006. erowid.org/exp/57487",
 "substance": "Kratom",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Kratom",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "57487",
   "Male",
   "",
   "Not Given",
   "Nov 28, 2006",
   "8706",
   " "
  ]
 ],
 "report": "<p>I have tried Kratom on two occasions so far.  I ordered 12 grams of 'Kratom Standardized 15x Extract' from my favorite online vendor. The package said something like 'active at just 1G, strong effects at 2G,' so I decided to go with 1G.</p><p>Experience #1</p><p>Male - age 18</p><p>Height - 6'0'</p><p>Weight - 130 lb</p><p>Dose - not exactly sure. 1 G estimated.</p><p>Preparation:  I had taken some kava extract throughout the day and only noticed slight relaxation and occasionally fell asleep if sitting down.  I emptied out the package on a piece of paper;  made the powder into a rectangle with straight sides and uniform height, divided this in half, in half, in thirds.  Put this one third into a cup, poured a bit of Gatorade (~5 ml) in, drank, chased, repeat, until all powder was ingested.</p><p>[10:00 PM] The powder tastes very bitter.  Imagine eating a bag of tea.  It's not terrible, but certainly not good.  A friend of mine likes the taste.</p><p>[12:00] After playing video games for a while, I start to feel strange.  I get a pack of pineapple cigars.  I'm feeling euphoric and have a blast just talking to people about anything. Very social.</p><p>[2:00]  I sit in a chair for the next five hours.  My body feels incredibly good.  Everything seems perfect.  I have not tried opiates before, but Im guessing this is what they feel like.  I feel simply amazing.</p><p>[5:00]  I smoke another cigar.  The best cigar Ive ever had.  I feel incredible.  It's difficult to explain.  I feel wide awake until about 6:30 when my body gives in to being up for 22 hours.</p><p>Second experience</p><p>Male - age 18</p><p>Height - 6'0'</p><p>Weight - 130 lb</p><p>Dose - 1 gram (I measured out the rest in 1.001-1.003 gram bags.)</p><p>Female - age 17 - 'D'</p><p>Height - 5'7'</p><p>Weight - 105 lbs</p><p>Dose - 1 gram</p><p>This more recent experience was even better and easier to recall because it was shared with my girlfriend, D.</p><p>I pour the powder over cheesecake jello - which is very nasty textured to begin with - and eat it.  Tastes terrible, the texture is awful, but it slides down easily when large amounts are swallowed, so i don't complain.  Then I have a stroke of intelligence and cap it up for D.  No problem for her.</p><p>We watch Fear and Loathing in Las Vegas.  It takes the entire movie about until we really feel the effects.  Euphoria takes over.  Touching, loving feels good.  We put in requiem for a dream, which I have not seen.  It's an interesting movie, and I feel empathy for the characters in it.  </p><p>We go downstairs half way through and have some pizza, the kind with bread, then cheese, then sauce on top.  AMAZING pizza.  I want to emphasize how everything I do when I've taken Kratom is an AMAZING experience.  My mind feels a little dull, but I really enjoy the lucidity.  I tend to separate 'highs' from 'trips', and this is my favorite 'high'.  </p><p>So when we go back upstairs, I sit in a chair and it feels amazing to lie down.  To smile.  To look at D.  Kissing feels like an orgasm.  </p><p>Eventually, two of my friends pick us up and we hang out at J's house.  By this time, Im not feeling the narcotic aspect of Kratom, I feel very very energetic and talk constantly.  Cigarettes are very nice.  I feel entertaining and a sense of well being.  I'm very happy about J's dog.</p><p>Conclusion</p><p>All in all, I'd say that this drug is similar to my experience with 'molly'.  Anyway, Kratom seems to be a very nice drug.</p>"
}
