{
 "id": 5748,
 "title": "Fun in the Yard On the Free Boomers!",
 "date": {
  "submission": "2009-09-13T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Mushrooms",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "7 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "During One summer of the date July 4, i decided to get an Ounce of Shrooms for me an three friends to split. We had all eaten the same amount at around 6:00 pm. One full hour had passed and three of us could not feel nothing... Twenty or ten minutes later the (my?) bedroom started to spin the corners of the walls, which were pointing out far like they were stretched..",
  "I looked down it seemed to be the floor was breething... I would hear someone say something when no one said anything at all.. We then decided to go outside, we started walking around my yard looking at the trees and nature.",
  "I noticed my dad and neighbors were stairing (climbing stairs staring) because we had walked in the same circle around my yard for two or three hours. They (our) feeling was great i had a great body buzz. Another thing to add to this is funny;",
  "I had got a glass of orange juice and was stairing into the glass i was seeing things in my orange juice swimming around my dad and sister were laughing histircle. (Hysterical...)",
  "It Was now like around 9:00pm and my friends wanted to go to the gold star down the street from my house. Once we got there i had started to act weird i did not know what to do. So many thoughts were running through my head, it felt like.",
  "At one time i made my friends listen to me talk about Frankie from the MTV show The Real World. Its like we were all talking but no of us were he(a)reing what each other said. The feeling lasted up untill (intill) 11:00 pm thats when i started to come down. These were the best Shrooms they were dank!",
  "Free Shrooms for everyone!"
 ],
 "erowid": {
  "id": "35536",
  "citation": " Mushrooms. \"Fun in the Yard On the Free Boomers!: experience with Mushrooms (Magic Mushrooms) (ID 35536)\". Erowid.org. Sep 13, 2009. erowid.org/exp/35536",
  "substance": "Mushrooms (Magic Mushrooms)",
  "views": "2477"
 }
}
