{
 "title": "Six-Person Party",
 "author": "Swagman",
 "citation": " Swagman. \"Six-Person Party: experience with Mushrooms (ID 5752)\". Erowid.org. Jan 30, 2002. erowid.org/exp/5752",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "report": "<p>We started taking the shrooms at around 7:30 PM, the culmination of weeks of planning and anticipation. We were a dynamic bunch of people in a strange but comfortable environment, about to embark on a journey that for most of us, would be something we had rarely or never experienced.</p><p>Walt, the owner of the house, had not previously tried the magic mushroom, and his former drug experience had been limited to a few puffs of herb and the standard amount of drinking. I was somewhat worried about him, because I could see he was somewhat worried about himself, along with all the usual anxieties of a teenager throwing a party at his house with the parents away.</p><p>Pete was as experienced as me with the use of psilocybin, although he hadn't experimented with other psychedelics as much. I trusted he would remain one of the most stable members of the group, although I had never tripped with him to such an extreme before. Andrew was an old friend, who although had only turned on to drugs in the recent past, had already seen his share of strange shit. Most of all, I considered him a reliable companion, but I was somewhat concerned for him knowing that mushrooms had often made him quite ill. Bryan was a character whom I didn't know too well, but who seemed to be a good guy judging from my previous experience. He had also not been into drugs for too long, but had apparently established a reputation as a pothead at his school. Being a massive rugby player with a promising career in front of him, I liked having Bryan there in case Phil got out of control, but I only hoped that we wouldn't have to control Bryan.</p><p>Phil was someone I had gone to school with for years, and who seemed most eager out of all of us to experience the trip. When I had first met him he had been the embodiment of hyperactivity, but had settled down over the years until he could pretend that he was entirely normal around most people. Still, the two times that he had tried drugs with me after convincing me he had matured enough to handle them, I had been somewhat disappointed. It had been a long time since then, and I hoped he had changed, but I was slightly more worried about Phil than anyone else. \t</p><p>I hadn't touched the stuff, or any powerful hallucinogen, in around a year, and I was experiencing my own share of anxiety for a number of reasons. Firstly, my mushroom experience had been a mixture of good and bad, the bad stemming mostly from the digestive aspect. I strongly preferred the LSD concept of placing a minuscule piece of paper on my tongue, to swallowing large amounts of vile tasting dried fungus. Also, I had been cast in the role of a guide by my friends, who assumed I possessed some sort of infinite wisdom on the topic of drugs. Sure I had done my share of reading, (most of it by Timothy Leary) but my actual experience was somewhat limited, and the knowledge that I hadn't tried these drugs in so long made me worry if I could maintain control throughout the night. I still felt as prepared as possible, having done a great deal of thinking about the evening, as well as reading some trip reports on the net and getting a good night's slee.</p><p>In our possession was what I had described as, 'a good fucking deal'. Three quarters of an ounce for some seventy dollars (Canadian). It had been divided into six equal piles, none of which amounted to more than one of us should be allowed to handle. I took most of mine and brewed it into tea, my first experience of the kind. This was in the hopes that I would avoid any intestinal trouble. We were running around an hour late, and everyone was in a rush to dose, and I wasn't able to make all the 'ground rules' as clear as I liked.</p><p>Shortly after 8:00 it began to kick in for me, but I was well prepared, expecting a quick onset from the liquid mushrooms. By this time everyone else's trip was also beginning, although three of us had left to grab something from a nearby car. When they came back the energy level shot up, and the physical sensations of the trip became apparent. I began to get nauseous, and an attempt to leave the room in search of Phil and Walt led to me vomiting up everything I had consumed. My error seemed to have been in making the tea too diluted, forcing me to drink two huge cups, and leaving a third unfinished.</p><p>Walt and Phil were found talking on the porch, and Walt eventually came down to the basement to hang around with everyone else, but the disappearance of Phil, and then Walt and Pete who went to find him, triggered a mildly stressful situation as the rest of us hypothesised comical and grim scenarios. Suddenly we were hit with another grave problem. Initially, Walt's 200-CD player had seemed to be a blessing, something we could just stuff with the night's music and not have to worry about again. But a mix CD of Pete's, (who had now left) would not cease playing, and featured parts of a book-on-tape rendition of Fear and Loathing in Las Vegas, read by some absolutely horrible actors who drove us absolutely nuts. In one of those drugged quests that always seem to spring up on strong psychedelics, me and Andrew struggled with the machine for what seemed like an eternity, until we could reassert our dominance over technology and play Andrew's preferred choice of music, my Paul Okenfold album. </p><p>It was around this time, (9:30) that I discovered the other members of the group were all safe upstairs. The trip had had a strong effect on them, but they seemed to be riding it out pretty well. I was still a little queasy but feeling much better. I had the notion that my vomiting had expelled much of the drugs from my system, and I was experiencing the equivalent of at the very most, a 2 gram trip. I was not nearly as disappointed this time however, as when I had previously tried such an amount. Patterns were moving in ways surprisingly familiar to me, (it felt like only a few weeks since I had had my last trip) the lights kept varying intensity, and time ticked by like I would stay high forever. The majority of the sensations were still physical in nature however, and my sense of touch seemed particularly enhanced.</p><p>Briefly, we all got in one room and once again the energy level spiked, slightly overwhelming Phil. Trance blared on a massive surround-sound system, and a minute of joyous dancing reminded me how much I wanted to rave again. Then Phil began demanding more shrooms, saying he wanted it to last longer. I asked him if he was sure, then gave him my last cup of tea, which I was going to flush down the toilet anyway. I saw him a minute later with a mouthful of dried mushrooms from his or someone else's stash, but Phil was happy and in control. However, I knew the tea had not yet kicked in and he was setting himself up for one hell of a ride. In the kitchen where I was getting a glass of water, he confronted me and asked to buy my remaining mushrooms. I refused, and he began to struggle with me to get it out of my hand. In order to avoid a physical escalation which would pit him against us and possibly ruin a few people's night, I relented and handed it over. Me, Walt, and Pete then hounded Phil to give it back, and we eventually got our wish, although Phil had already eaten some and we seemed to have made him visibly depressed. Later I ascertained that this was when the drugs truly began taking hold of him.</p><p>Me and Walt shared our own little quest to find his blanket so that we could stand out on his patio and talk. Eventually we succeeded, and the seemingly unending crawl towards 10:00 PM reached its end. By this time I was coming down some, and felt my communication skills to be mostly unimpaired. We stood there for the better part of an hour, talking about the meaning of life, the bullshit of society, the annoying aspects of school, people who pissed us off and why.</p><p>Then we were interrupted by calls from the house, and found that Phil had totally lost touch with his sense of reality. Later he described the understandable feeling of overload, (we estimated he had had 8 grams) and unending confusion. He was upstairs saying and doing utterly embarrassing things, and had eventually retreated under Walt's bed. He had also broken a CD case and cut himself, and from the sound of things I wanted no part in his trip. Despite my label as 'the responsible one', I feared Phil was still pissed off at me, and I didn't think he wanted to be helped. I was having a great time and only wanted it to continue. Phil also seemed to have infected Pete and Bryan with some sort of primal energy, and the three of them had, as Hunter S. Thompson would have described them, 'degenerated to the level of dumb beasts'. They were running around upstairs talking like horny cavemen. Phil especially seemed to be looking for a wet hole to screw, but eventually me and Walt reassured ourselves that he was no danger to himself or the property, and we went back outside.</p><p>It was clear that Walt was having a good time, and he was glad he had not taken more than around 2 grams. Although I had only gotten to know him in the previous months, he was a great guy to share an intelligent moment with, and kept his wits about him throughout the whole trip. We reflected on how few people knew the true definition of fun, and speculated on the tumbling stock market and the end of civilisation. Eventually we talked about girls, a large source of anxiety for me at the moment.</p><p>I checked up on Andrew once, lying in the downstairs bathroom, but then forgot about him for a long time. When I finally came downstairs with Pete to see him again, I feared I that I had walked into my friend's personal nightmare. I felt downright stupid for leaving him alone. The expression on his face set off a million alarm bells, but when he managed to choke out, 'it all makes sense' through his tears and reassured me that he was alright, I felt a massive load release from my shoulders. I left him there to reflect in peace, because it seemed like that was what he wanted.</p><p>Everyone except Andrew and Phil, who was still under the bed, converged in the living room. We were all coming down now, and were able to look back and share a few words among friends. Soon, Walt's sister came home with some people and Andrew was forced to leave the downstairs and join us. Bryan had apparently had a good time, and I concluded that he was indeed a good individual to have on a trip. Pete had also seemingly smartened up after being exposed to some saner company, and he had written a short paper on why drugs were not for the faint of heart. We bitched a lot about Phil, and I re-evaluated my opinion that he wasn't worth trying drugs with again. Finally I decided that we should never again leave so much around for him to take.</p><p>By around 11:30 he came down and joined us, and his ability to navigate the house and go to the bathroom was seen as a hopeful sign. Tense moments followed, as Phil uttered dozens of obscenities concerning our mothers and teachers with a smile on his face, which I concluded was more of an irrational attempt to provoke us than a revelation of his inner self. We were especially concerned with Phil's numerous calls for Walt's younger sister, who was easily within earshot and clearly seemed the type to panic.</p><p>At around 12:30, me, Andrew, and Pete felt sober and ready to drive home, and the knowledge that Bryan was staying behind to keep an eye on Phil made me feel as if we had succeeded in our efforts to accomplish a great trip without any negative repercussions. What I didn't know is that Walt and Bryan would soon pass out, leaving Phil alone and still wired. He later said he barely avoided totally freaking out, and only regained control early in the morning.</p><p>I drove home in the hopes of finding my brother with some grass, the one thing I needed at the moment. Unfortunately he was gone, but the mushroom vibes were still present, and I wound down the evening in front of the TV. After catching and recording a music video I had been looking for, I called it a night and went to bed around 2:00.</p><p>It was an experience that had more than lived up to my expectations.</p>",
 "year": "2001",
 "id": "5752",
 "gender": "Male",
 "timestamp": "2002-01-30T08:00:00.000Z",
 "views": "6234",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
