{
 "id": 5757,
 "title": "Shared Hallucinations",
 "date": {
  "submission": "2004-07-31T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sean",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 seeds",
   "administration": "oral",
   "substance": "Datura",
   "form": "(seeds)"
  }
 ],
 "report": [
  "I took it along with 3 friends in Israel. It was BY FAR the strangest event in our lives. We ALL saw the same hallucinations (if they were). First, I noticed we had speech imparement. Then the 'rules' of reality changed. They all started getting wander lust. As the girls got up to just 'walk' I would guide them back to our camp spot. The other guy was litterally running around in a circle on the beach making a yin yang in the sand. Then he was crawling on his belly. I felt and overwhelming urge to sleep but I was worried about the girls. I was a bit bored so I started flipping a coin. The fucking coin disappeared in mid air and the three of us all saw it happen (at eye level). I looked around where it could have possibly landed...it was gone. So I repeated. THE SAME THING HAPPENED! The girls started applauding think I was doing a magic trick. I just thought, 'Oh shit...this is going to be one serious trip!'  I tried to smoke my cigareets but I couldn't get them to my mouth.  I would try a couple time and they would disappear.  The girls would clap once again thinking I was doing a magic trick.  I finally had to use my free arm as a sort of guide to get the cigarette to mouth.  Otherwise, the best way i could describe it was as if my head wasn't solid.",
  "It was to be the most freakish night of our lives. I passed out for a half an hour I think. When I woke up, all three of them were gone. I fought the urge to wander and stayed with our stuff. I couldn't read my watch (blurred vision) and I couldn't piss (felt like a burning urinary tract infection). I was thirsty as hell but forced myself to take sips from my canteen (which lke the cig, I had to guide to my mouth).  Now here is the really bizarre part. I saw these 'nature people' everywhere AND they saw me. Some of them communicated with me without speaking. Others scared the shit out of me. They were deformed like burnt people. I thought a mental hospital was allowing their deformed freakish lunatics wander the beach before sunrise before the tourists and regular folks showed up.  Of the two types of beings, I had the impression one was good and the other was malevolent. They could disappear instantly if you looked away.",
  "Throughout the night I was visited PHYSICALLY, IN FRONT OF ME, by my friends. They all had various things to say like, 'Where are the keys to the room?' (we didn't have a room and the conversations and inquiries were totally illogical) etc. When I looked away they would also disappear. In the morning they came back, minus the guy. He came back that next evening. They all reported the smae things. Normal people disappeared and we were in a world of these nature things/people whose pass time was playing hide and seek. Cars were gone and the city streets were empty. We all had conversations with each other and could recall them BUT it appeared we were physically at the other persons location THOUGH WE WERE MILES FROM EACH OTHER. The guy ended up RUNNING DOWN A HIGHWAY that contained no cars (impossible) and sat on a doorstep in a town miles away from the city we were in.",
  "A woman came to the door and recognized him from a picture. She invited him in and introduced herself as his mothers second cousin. HE HAD NO IDEA where she lived, who she was, and where he was. She showed him the picture of her and his mother and his picture that was sent to years before and allowed him to call home. She then drove him back to where we were. We don't know what happened that night except 1) we all had the same hallucinations  2) we all interacted with each other throughout the night (though we were apart) 3) we all believe we visited some other place...dimension..whatever. I'll tell you something... CAUTION...there are totally new rules there and it seems like it can be a dangerous place. Oh yeah, all of our watches had lost about an hour (varied). I wouldn't fuck with this stuff. Maybe 5000 years ago, or when people respected this kind of thing it would be a different story. That time is long gone."
 ],
 "erowid": {
  "id": "35559",
  "citation": " Sean. \"Shared Hallucinations: experience with Datura (ID 35559)\". Erowid.org. Jul 31, 2004. erowid.org/exp/35559",
  "substance": "Datura",
  "views": "14106"
 }
}
