{
 "title": "Takes the Edge off Withdrawal",
 "author": "MIM",
 "citation": " MIM. \"Takes the Edge off Withdrawal: experience with Diazepam & Dihydrocodeine (ID 57579)\". Erowid.org. Nov 11, 2011. erowid.org/exp/57579",
 "substance": "Diazepam & Dihydrocodeine",
 "bodyweight": "150 lb",
 "report": [
  "<p>I recently spent half a year in a foreign country with very lax drug laws. I did not indulge in 'illegal' drugs, because I didn't have to: just about everything a guy like me could possibly want was over the counter, from opiates to benzodiazepines. Of course, the newer, fancier examples of these classes were not available, but at least the good old cornerstone drugs, such as codeine and diazepam (valium), respectively, were. ",
  "A favorite of mine quickly became 60mg extended release dihydrocodeine caplets, marketed as Dicodin LP and went for $10 for a pack of 20, which I would just toss in my mouth and chew. At first a half caplet would be plenty, but after a few weeks, of course, my tolerance went up, and I began taking several pills... usually around 4 or 5. I did not take these all at once, though, due to breathing problems I had developed. A dose high enough to make me fully euphoric would make my breathing quite shallow, so I would build up, redosing by a half pill or a whole pill every 30 minutes or so, until I had reached the desired level of euphoria, blissful warmth, detachment, numbness... you know, all that good opiate stuff. ",
  "Anyway, I did this almost every night before sleeping -- usually putting on a movie (something lighthearted with nice visuals) -- and falling asleep some few hours later.  This was all well and good, but after six months, I was faced with returning to the 'land of the free,' and realized I was either to risk being caught at the border by US customs (or by TSA when reboarding for my connection), so I opted instead to just go ahead and get withdrawal over with.  Plus, I hate the idea of being dependent on something, and figured it was high time to be kicking the habit. ",
  "I had heard diazepam is used pretty widely to ease heroin withdrawal, usually in doses of 30mg. Since my withdrawal would be for a markedly weaker substance, I figured 10mg would probably be sufficient. I obtained a large supply of 10mg diazepam from a pharmacy, and braced myself for the week ahead. ",
  "Before using any valium, however, I went through the withdrawal with no aid for a while. ",
  "First night: fell asleep fine. ",
  "Next day: experienced mild muscle aches and pains, lower motivation than usual, mildly to moderately depressed. ",
  "Second night: muscle aches and pains increased, and sleep was more difficult to acheive due to moderate anxiety. ",
  "Following day: similar to the first, but worse.",
  "Third night: took 10mg valium and read a favorite book. I felt better very quickly.  My tense, aching muscles relaxed and turned from concrete to jelly. I drifted off into a comfortable sleep. ",
  "The next day I felt better than the day before... perhaps due in part to valium's long half life. ",
  "The next night I took 10mg valium as well, and it similarly helped.  After that, though, I found going to sleep easier, and needed no chemical assistance. ",
  "So, in summary, I found that valium, in as small a dose as 10mg, proved extremely helpful in combating opiate withdrawal.</p>"
 ],
 "year": "2006",
 "id": "57579",
 "gender": "Male",
 "views": "9041",
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "120 mg",
   "administration": "oral",
   "substance": "Pharms - Dihydrocodeine",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2011-11-11T08:00:00.000Z"
}
