{
 "title": "Crashing Waves",
 "author": "Csc",
 "citation": " Csc. \"Crashing Waves: experience with Heroin (ID 57576)\". Erowid.org. Jan 1, 2008. erowid.org/exp/57576",
 "substance": "Heroin",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Pharms - Lithium",
   "(daily)",
   "",
   "300 mg",
   "oral",
   "Pharms - Bupropion",
   "(daily)",
   "",
   "10 mg",
   "oral",
   "Pharms - Citalopram",
   "(daily)",
   "",
   "10 mg",
   "oral",
   "Pharms - Aripiprazole",
   "(daily)",
   "",
   "30 mg",
   "oral",
   "Pharms - Buspirone",
   "(daily)",
   "",
   "2 lines",
   "insufflated",
   "Heroin",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "57576",
   "Female",
   "",
   "Not Given",
   "Jan 1, 2008",
   "15781",
   " "
  ]
 ],
 "report": "<p>I've always been fascinated by drugs. The hardest drug I'd done up until recently was E, which I overdosed on a year ago. I'd always told myself I'd never touch Heroin because I knew I'd like it too much. I was right.</p><p>I found out last Sunday that my E dealer had a hook for H. I talked to a friend and we both decided it was time for a little experimentation. We bought $40 worth, which was enough for 4 small 1inch lines. We were told that we should cut the off white powder into 4 and do one line first, wait a bit and then do the second.</p><p>It was 8:30pm when we started, I cut up the lines and we quickly snorted a line a piece. It smelled horrible and the postnasal drip wasn't too fun either, but we managed. It wasnt any worse than doing a line of E and actually barely burned at all, which was surprising.</p><p>We turned all the lights off, put on some mellow music, and relaxed on my bed. About 40 minutes later I began to feel warmer and more relaxed. I dismissed it to be the placebo effect but when I stood up to change the song that was playing I felt like the shore at the beach. My body felt like waves of warmth were crashing coming from my toes up to my head. Amazed, and laughed and sat back down-- sadly my friend didn't feel much other than that which was described above. I, however, felt much better within minutes. I wouldnt really compare it to E, but it did give off that intense feeling that E gives off, only it was much smoother and more subtle. </p><p>My eyes grew heavy, and opening them felt like a struggle. I kept them closed and continued to see images of paintings that I wanted to do. I thought about getting up to paint, but gave up quickly when I realized that it would involve moving. I lay down on my friends lap and as he played with my hair my breathing became shallow and heavy. My body felt like it had melted to the spot I was lying in. I was so happy and content with my life.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] My friend, aggravated, decided to go get some beer. I thought I should tag along, however I wished I hadn't. Driving in the car was too much sensory input. The only time I got the least bit nauseated was in the car and it was only from the intensity of the high. As I sat in the parking lot at 10pm I felt completely separate from myself.</p><p>Once we returned to my dorm, I continued to feel the effects of the Heroin, though they slowly faded. By about midnight I was completely sober and began to itch all over. At first I didnt think much of it until I remembered reading a post online about someone itching and figured it was part of the come down. </p><p>The rest of the night I was in a total state of happiness. I slept great, and woke up a bit achy, as if I had worked out the day before.</p><p>All in all, I love Heroin.</p>"
}
