{
 "title": "Horrible Side Effects",
 "author": "The Tester",
 "citation": " The Tester. \"Horrible Side Effects: experience with Datura (ID 57663)\". Erowid.org. Jul 14, 2009. erowid.org/exp/57663",
 "substance": "Datura",
 "bodyweight": "140 lb",
 "report": "<p>Well, I made my little tea, using around 7 flowers in a pot of water...</p><p>Well, it all went fine for the first couple hours but then all hell broke loose. My girlfriend called me and I kept blacking out on the phone, but when I came to my senses I was saying something about a James Bond movie I just watched... I seriously thought I was in the James bond movie.</p><p>The problem was, my subconscious was talking to my girlfriend and saying some crazy things every time I blacked out. And then my near-sighted vision started going bad. My eyes dilated so large that I could not see anything 2 feet or closer to my face. That means when my girlfriend texted me, I could not read it, and it was a horrible thought. So I hung up with her at 2 and I am dead serious when I say I called her back as soon as I set the phone down because I just wanted to tell her I love her and that I am going to bed. (which I had not done before)</p><p>It took about 5 calls for her to pick up, and when she did, she wondered why I had called her at 5 in the morning. I literally blacked out for 3 hours, without any recollection of what just happened.</p><p>The next day I was out of it all together and my eyes were still dilated. My vision did not improve much for the whole day, which made work very hard. I was tired, and my stomach was extremely upset.</p><p>All of that would have been ok, saying I am an experienced drug user and can cope with the obvious side effects, but the cottonmouth I got from the tea was overwhelming. It was impossible to get rid of, and it lasted all day, seeming to get worse as the day progressed. Once I had another night sleep, I felt better and 2 days after almost all the side effects had dissipated. My vision was still a tad off, and I was extremely worn out.</p><p>Datura is cheap, and is easy to prepare, but it had horrible side effects and made me delerious. Blacking out is not only dangerous, but also very inconvienent depending on one's location. (blacking out here refers to loosing consciousness, or the conscious actions of any movement, this does not mean I couldn't functions, or respond to the outside world, it just means I had absolutely no control of what I was doing, and when I came to my senses, I would hardly remember what happened)</p>",
 "year": "2006",
 "id": "57663",
 "gender": "Male",
 "timestamp": "2009-07-14T07:00:00.000Z",
 "views": "7825",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "7 flowers",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 ]
}
