{
 "title": "A Journey to the Other Side",
 "author": "Tyler S",
 "citation": " Tyler S. \"A Journey to the Other Side: experience with Clonazepam, Diazepam, Zolpidem & Diphenhydramine (ID 57709)\". Erowid.org. Jan 30, 2007. erowid.org/exp/57709",
 "substance": "Clonazepam, Diazepam, Zolpidem & Diphenhydramine",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 tablets",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)",
   " T+ 0:00",
   "4 tablets",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)",
   " T+ 0:45",
   "4 tablets",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)",
   " T+ 0:45",
   "4 tablets",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   " T+ 2:45",
   "14 tablets",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>It was a particularly...auspicious night. My girlfriend and I of 2 and a half years notoriety had broken up perhaps 2 weeks before I inhaled my fathers medicine cabinet. A frequent and experienced drug user, i have (since this night) read both PiHKAL and TiHKAL, and explored the more intelligent side of drug abuse.</p><p>I began the night reading The Way of the Shaman, and my mind, already twisted with grief, turned to the idea of the OSC, of altered states of consciousness.</p><p>Having engaged in spiritual exploration via 5 MeO DMT, Shrooms, LSD, Salvia, etc ad nauseum, i was familiar with this state, and seemingly comfortable in my drug awareness, though I had not yet experienced my 4+.</p><p>So, whilst my parents were away at a play (i was at this time living in the back guest house at my folks house), i stumbled into my parents bathroom. Staring at my haggard reflection, something slipped upstairs, and i flung open the cabinet door. My father, who is already chronically depressed and recently gotten over a severe car wreck, had a veritable cornucopia of pharmaceutical candies.</p><p>I started on 4 Clonazepam and Diazepam, knowing one of the two (diazepam?)  to be a drug Snipers took in the field to steady their aim, so i figured it would do something. 45 minutes later i was still at baseline, and depression was setting in, so back up to the cabinet of dreams to see what else could be found...</p><p>...4 pills each of Clonazepam and Ambien and two hours later i'm lying on my bed with Butcher blasting in my headphones 'writing' in my journal. Looking back at what I penned that night scares the living shit (can i say that?) out of me. A mirror image of the darkside of myself, something i never want to see again. I don't truly recall much else except chewing approx. 14 benadryl tabs in the midst of my angst filled night...</p><p>Feels as though some part of me simply did not want to make it through that night.</p><p>Keep in mind, i'm not a suicidal person - I have studied martial arts for 16 years, read more books and attended more Ashraams and meditation centers I care to mention, yet all the same these drugs pulled this side from me, something perhaps hidden for too long.</p><p>The following morning, still tripping, i called my father to ask him why time was subjective only to me...when he got home to take me to the hospital, I was talking to a woman in a red shirt (this is all I remember of her) next to my pool pump. My father, understandably distressed, took me to the ER, where it was discovered that I had an allergic reaction to Diphenhydramine, the active ingredient in Benadryll.</p><p>A horribly life changing experience, I would hope this to serve as a warning: The world of drugs is a wonderful one, with worlds of potential not perceived by the masses, just be sure to read your warning labels.</p>",
 "year": "2005",
 "id": "57709",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-30T08:00:00.000Z",
 "views": "41763"
}
