{
 "id": 5771,
 "title": "In The Hole",
 "date": {
  "submission": "2001-12-25T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "CrystalSkies",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Methamphetamine"
  }
 ],
 "report": [
  "I have had a problem with drug use since 1997.  I was sent to a harsh rehab program June 20, 1999.  I used a variety of drugs and drank every day but never did crystal until after rehab.",
  "I moved back home in January of this year.  A friend of mine, who I always did drugs with, asked me if I still liked to party.  I asked what she meant and she said she had some tweak.  I had done coke before and loved it but the comedown was hell.  I told her I'd try some and I felt different than I ever did before.  I have had depression problems and this made me so incredibly happy.  I got along better with my parents and accomplished all I needed to.  I was much more confident and social as well.  I have also lost 35 pounds since I started and can't stand it when I gain even 3 back.",
  "At first one little line before school would keep me up till after midnight but now that wouldn't even effect me.  I just finished what I had earlier today and at this moment I'm hoping I will get more before my job interview tomorrow.  It is like medecine, I feel as if I need it to be normal.  I know how horrible it is and have read about all the side effects but I can't seem to ever stop.  I lost all my good friends before I went to rehab but my close friends are still in touch, although since we're in college now they don't suspect like other people do.  I don't get along with my parents at all anymore, It's like my outlook on everything is different or something.  I have 4 credit cards that are all overlimit because I would use them to get cash and buy crystal.  I can't keep a job for more than 2 weeks and have resorted to nude modeling and some pretty nasty shit that I hate doing but I get at least $100 an hour.  I'm doing horrible in school also, I can't seem to focus on anything.  All I care about is staying skinny and getting my shit.  I'm currently over $2500 in the hole and have even wrote checks to myself to deposit because the first hundred is available for withdrawal instantly.  My checking account is even negative! ",
  "My life is just one big roller coaster.  Up, down, up, and down again.  I've lost so much because of this drug, including my self-respect.  I know I'm gonna do some tomorrow and owe my dealer even more money and then worry even more about the mess I've made of myself.  I've spent thousands of dollars on crystal in just 9 months and haven't gained a thing but a better body.  I lost myself in the process and pray that someday I'll have the strength and will-power to get her back. ",
  "Like everyone else who has done crystal, I never thought I would become completely dependent on it.  I can't even stay awake for 5 hours without it!  I hate what I'm doing to my body but can't seem to stop.  I wish I had stopped in the early stages before I got myself into this hell."
 ],
 "erowid": {
  "id": "3560",
  "citation": " CrystalSkies. \"In The Hole: experience with Methamphetamine (ID 3560)\". Erowid.org. Dec 25, 2001. erowid.org/exp/3560",
  "substance": "Methamphetamine",
  "views": "34164"
 }
}
