{
 "title": "Sharp, Fuzzy, Euphoric",
 "author": "Electrovotolato",
 "citation": " Electrovotolato. \"Sharp, Fuzzy, Euphoric: experience with Clonazepam (Klonopin), Alcohol - Beer & Cannabis (ID 57717)\". Erowid.org. Jan 5, 2009. erowid.org/exp/57717",
 "substance": "Clonazepam (Klonopin), Alcohol - Beer & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "40 oz",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " T+ 1:00",
   "1.0 mg",
   "insufflated",
   "Pharms - Clonazepam",
   "(ground / crushed)",
   " T+ 1:30",
   "0.5 mg",
   "insufflated",
   "Pharms - Clonazepam",
   "(ground / crushed)",
   " T+ 2:00",
   "1.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I was in my friends' room at around 10:00 working on a painting while drinking a 40 of Colt 45. They had all snorted several lines of klonopin before I got there, and were acting in a way that could only be described as 'silly.' Stumbling around, laughing giddily at small things, etc. I finished my 40 at around 10:30.</p><p>At 11:00, I asked my friends, given their state, if I would be able to keep working on the painting if I blew some lines as well. They said I'd be fine, and although I was skeptical, I snorted two 0.5mg pills' worth and resumed my work. Within 5 minutes, my body was tingling. As time went on, I found that I thoroughly enjoyed any type of motion - specifically in my legs. I was, for the most part, stationary at a drafting table this whole time.</p><p>After approximately 15 minutes, I decided to take a break to move around the room, and immediately realized that I was far more influenced than I previously thought. I had a slight buzz going from the 40, but aside from that, my mind was fully there. On the other hand, my body was doing its own thing.</p><p>Around 11:30, I crushed up another 0.5mg pill and snorted it. This hit me almost instantly, I was loopy, reveling in a much more intense version of the soma shakes.</p><p>I stopped keeping track of time at this point, but not too long after the last line, we packed a couple bongs and finished them off in short order. My mind was in a warm, fuzzy place, but at the same time I was still thinking very clearly. I was able to buckle down and control my motor skills enough to do more work on the painting, with no mistakes.</p><p>I went to bed at around 1:00 am and enjoyed a blissful sleep. I overslept for my class in the morning, but that was more a product of not caring enough to get up. I didn't feel at all groggy.</p><p>I don't know if I'll be trying klonopin again any time soon, due to its availability and the potential for addiction, but if it comes around once in a while, I certainly wouldn't turn it down.</p>",
 "year": "2006",
 "id": "57717",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-01-05T08:00:00.000Z",
 "views": "39259"
}
