{
 "title": "Started Harsh But Still Amazing",
 "author": "Kandy",
 "citation": " Kandy. \"Started Harsh But Still Amazing: experience with Salvia divinorum (ID 5773)\". Erowid.org. Jan 31, 2002. erowid.org/exp/5773",
 "substance": "Salvia divinorum",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "smoked",
  "Salvia divinorum",
  "(dried)"
 ],
 "report": "<p>Not being big on hallucinogens, I've done DXM one time but that's about it, I was kind of nervous about trying Savia. of course I talked to other people who had done it, I researched it on the computer, and the person who I did it with also filled me in on the effects, my point being to all you people reading this I made sure I knew what I was doing, if you're doing this for the first time you should too. anyway, I took two rather large hits and after about maybe 60 seconds or so I was feeling a little sick and I was sweating a lot. I got scared that I had overdosed or something to that affect and I was screaming to my friends to call me an ambulance, the person who gave me the drug insisted I didn't need one, it was just because this feeling was new to me and that's why I was feeling that way.</p><p>that was nothing, 2 - 3 minutes later I was peaking which was worse, I didn't know where I was, I was hot as hell, I thought I was in a very tiny room and I couldn't breathe. all I remember from that part was my friend, who seemed distant as if not in the room at all, but tells me he was standing right beside me, telling me I was gonna be ok and that I wasn't in a small room I was on my friends couch. well the peak lasted a total of about 25 minutes, but I only remember half of it, I think I fell asleep. when I woke up I was still tripping but not so much, I think I was coming down, I was in a hole looking up at the sky my friend floated past me and everything he said had an echo on it, it was just like a dream.</p><p>the coming down lasted a good 15 minutes and the after effects, just colors and stuff, lasted about 10. I would say once my peak past it was the best feeling in the world, I felt like I was in some fantasy place and it was great. my suggestion to anyone who does it, like I said research, and also I suggest not having a lot of people, I only had 3 and myself. I would definitely do it again if it was offered to me.</p>",
 "year": "2001",
 "id": "5773",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-01-31T08:00:00.000Z",
 "views": "7064",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 }
}
