{
 "title": "Sleepwalking??? Complete Blackout",
 "author": "Unreal",
 "citation": " Unreal. \"Sleepwalking??? Complete Blackout: experience with Zolpidem (Ambien) & Alcohol (ID 57742)\". Erowid.org. Apr 4, 2007. erowid.org/exp/57742",
 "substance": "Zolpidem (Ambien) & Alcohol",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "5 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "",
   "40 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>So I returned home from having some drinks with my girlfriend.   I had 5, maybe 6 beers in me when I arrived home.  Having experienced insomnia as of late, my doctor prescribed ambien to me and instructed me only to take one tablet per night.  Of course on this particular evening I completely ignored my doctor's strict instructions and took 4 tablets and lay down to watch some tv and await the drugs effects.  I remember very little that happened after that other than feeling very very relaxed.</p><p>I awoke in a totally different room than I had started in approximately 8 hours later.  I was fully clothed and sleeping in my bed, facing the wrong direction.  I was rather refreshed but a bit groggy nonetheless. </p><p>As is my routine, I got up, took a shower, etc etc and went out to my car to fetch some coffee.  I was amazed to find my car driven up on my own brick staircase with the tire flat and the other side of the car smashed up with half the bumper missing and the side mirror missing.  So, I proceeded to walk to the local coffeeshop and along the way I found pieces of my car strewn about the neighborhood nearby a crooked street sign. </p><p>I have no memory of going anywhere whatsoever that night and to this day, almost 3 weeks later, cannot recall where I may have been headed or what I was doing.  I cannot say for sure that the alcohol was a factor in this mild disaster or not but I can be sure of this, ambien should be taken very carefully in high doses.  I believe that I must have been in some sort of sleepwalking dream state.  Fortunately, nobody was hurt and the damage to my car was not terribly severe.</p><p>All in all I enjoy ambien and appreciate its sleep inducing effects.  However, I cannot caution enough how dangerous it can be nor can I emphasize enough how fortunate I feel that I didn't wake up in jail that night or god forbid in the hospital.  I really am curious where on god's green earth I was going.  No memory has yet returned.  Be careful, and enjoy!!</p>",
 "year": "2006",
 "id": "57742",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-04T07:00:00.000Z",
 "views": "16160",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ]
}
