{
 "title": "Withdrawal",
 "author": "KS09",
 "citation": " KS09. \"Withdrawal: experience with Quetiapine (Seroquel) (ID 57782)\". Erowid.org. Dec 21, 2008. erowid.org/exp/57782",
 "substance": "Quetiapine (Seroquel)",
 "bodyweight": "285 lb",
 "report": "<p>Just wanted to share an interesting tidbit about the drug Seroquel that has baffled two different doctors. I've been lazily prescribed Seroquel after an even lazier diagnosis of BiPolar Type I Disorder.  I've never agreed with either this diagnosis or the treatment plan.  Because of my disagreement with said treatment plan, in 2005 I decided to stop taking all three of my psychoactive drugs (I was also on Trileptal and Zoloft), all one at a time. </p><p>I started with Zoloft and left it at that for awhile.  Cold turkey, no problem.  I figured any negative side effects were being displaced by the other two.  Then I stopped the Trileptal.  Again, no change.  I was beginning to believe that my theory that doctors prescribe placebo type medications in abundance to normally healthy people was ringing true.  Finally, the Seroquel.  I normally take 100mg of this bastard once a day, always at night since it knocks me out.</p><p>The first night without taking it I lie in bed sweating - tossing and turning all night.  My body was screaming for the drug.  The next day was fine.  I had a lot more energy than was typical and I was less irratible.  The future looked bright, indeed.  That night, when falling to sleep, my hands and fingers started itching.  I looked and there was no rash, just persistent itching.  I thought it odd.  The next day, my hands started itching but now so did my head, and my perineum of all places.  I was in full on junkie scratch mode.  Plus, that nervous energy experienced the first night trying to sleep had returned en force.</p><p>By day four I thought I was going to be fired from my job for really scratching and twitching all day long, it was bad.  So, that night, I took another 100mg Seroquel and laid down and slept the best night of sleep I had had all week long.  And, the next day, no more itching either.</p>",
 "year": "2005",
 "id": "57782",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-12-21T08:00:00.000Z",
 "views": "12388",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "(daily)"
  }
 }
}
