{
 "title": "Bisected Reality",
 "author": "Chris",
 "citation": " Chris. \"Bisected Reality: experience with Salvia divinorum (ID 5778)\". Erowid.org. Jun 20, 2001. erowid.org/exp/5778",
 "substance": "Salvia divinorum",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "report": "<p>\nI had never even heard of this stuff until about 3 days ago. After reading all the experiences on here I decided to give it a try. To my amazement a local shop at the mall carried some (just regular leaves, not the extract). A friend and I took it home, not quite knowing what to expect. We then sat down with a trip sitter watching us and smoked about 3 pipe hits apiece. This gave me a pretty strong marijuana-like buzz, but I wanted to get the full experience, so I immediately followed it with 2 bong hits. After I blew out my second hit, I was beginning to feel disappointed. It had given me a good buzz, but I still was not tripping.</p><p>I was starting to think maybe the stuff at the mall was bunk, when suddenly I realized I had been laughing my ass off for 20 seconds, and I had a 'just woke up from a deep sleep' feeling. At this point I noticed that a perfect plane was dividing my room in half, bisecting my head. It was not really a plane that was visibly there, but I could SENSE it very strongly. Everything on one side of the plane was being pushed in one direction, and everything on the other side was being pushed the other way. I could feel my head splitting in half along the axis of the plane, but it did not hurt, it just made me laugh harder. Within 1-2 minutes this effect faded out and I was left with a strong buzz that went away within about 20 minutes. This stuff is really weird, when it hits you it hits like a freight train, and it comes out of nowhere.... I want to get some extract and go for the higher levels I've read about.</p><p>-Chris</p>",
 "year": "2001",
 "id": "5778",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-06-20T07:00:00.000Z",
 "views": "4800"
}
