{
 "title": "Unexpected Introspection and Lucid Dreaming",
 "author": "Moc",
 "citation": " Moc. \"Unexpected Introspection and Lucid Dreaming: experience with 5-HTP, Caffeine, & Melatonin (ID 57794)\". Erowid.org. Jan 6, 2007. erowid.org/exp/57794",
 "substance": "5-HTP, Caffeine, & Melatonin",
 "bodyweight": "135 lb",
 "header": [
  "DOSE: T+ 0:00",
  "200 mg",
  "oral",
  "Tryptophan - 5-HTP",
  "(capsule)",
  " T+ 0:00",
  "200 mg",
  "oral",
  "Caffeine",
  "(pill / tablet)",
  " T+ 4:00",
  "6.0 mg",
  "sublingual",
  "Melatonin",
  "(gel tab)"
 ],
 "report": "<p>This past autumn has been a strange one for me. After many years of depression, a struggle to find some sort of direction in my life, and an assortment of chemical, spiritual and emotional adventures, I finally seem to have come upon some sort of mental state that feels content, balanced, and most of all 'real' (as opposed to all the dead ends that I've come upon before).</p><p>It being early December now, my semester is coming to an end, and so the stress has risen to a great degree. I have papers to due, exams to study for, and never enough time. And of course while this is going on, I begin to get sick. Everything becomes a drag, but a drag I can't possibly avoid without messing up my academic term, which is not only tied up with my self-esteem but with scholarship money.</p><p>With that all known, dear reader, you can picture my state. Constant shivering, zero attention span, throat filling with fluid, trying to write a coherent paper on epistemology, wishing I could be anywhere but stuck at home on a Friday night. I was almost ready to give up, to go to sleep, as I'd been doing for most of the day, but I knew I had to get something done. So I decided I'd have a look at what sort of pick-me-ups were available in my medicine bag.</p><p>At different times I've taken 5-HTP as a mood enhancer, sometimes for as long as week, but lately I'd been off it, finding it didn't always agree with me in the morning, and seemed to be more effective as a 'now and then' sort of thing. I have a bottle of 100mg capsules. Also in the bag were some caffeine tablets. Caffeine is something I have only recently come to like - and only when I feel it will help me study, as I find it uncomfortable at times (as I do with all stimulants). Coffee is something I don't want to get used to, so the tablets serve my purposes well. Anyway, needing a boost of some sort, I took two of each of the respective chemicals, and went back to my work (this was at about 10 in the evening).</p><p>Soon after taking the concoction I wondered if it would be too much, in my delicate psychological and physiological state. Soon enough I had the answer: yes, it was in many ways 'too much.' I got quite a bit of work done, but most of all my spirits were lifted. No longer was I alone and miserable on a Friday night, I was doing what I loved, right where I wanted to be (living with my parents and brother). I explained my paper to my brother, and he was impressed, something which spurred me on. I also took a brief break and talked with my mother about many things. 'You're feeling better' she remarked, and I agreed, as I sure was.</p><p>The quality of the experience shifted somewhat as the night progressed, but I got a great deal of reading done, and felt prepared for the coming workload.</p><p>I decided to turn into bed at about 1am, but of course there would be no such luck. My body was busy yawning and slowing down, but my mind was very aware.</p><p>I lay in bed and listened to the wind outside, my dog breathing on the floor beside me, my own breath. And I began to remember things which had happened in years past, girlfriends and lost weekends and failures. Some of this was very painful, as I tried to reconstruct the memories and make sense of my actions. I was very frustrated most of the time, crying, tossing and turning. When I'd open my eyes, there was a strange concoction of coloured dots in front of my eyes, as if the darkness was made of blinking pixels - I didn't expect that, but it didn't strike me as being too odd. Except that it didn't go away.</p><p>Regardless of that, my journey into the past continued. I thought it would never end - I just couldn't stop thinking. But gradually I began to accept things that had happened, and I let them go. This is a process which has been a big part of this 'good autumn' as I have been studying the great mystics of the past, and a few from the present, but it has been a while since I had such a dramatic experience.</p><p>At some point there was peace, and I was just breathing, aware but without much thought, my body asleep but my mind in a state of meditation.</p><p>This lasted for a while, but eventually I decided that I had better get some sleep. So I got up in the dark and found my bottle of peppermint flavoured sublingual melatonin tablets. They have also been a help on this semester's journey, providing me with a deeper sleep and more meaningful dreams. I hesitated to take any, just because I thought the caffeine might produce a strange reaction. But I never felt melatonin was anything to worry about, as zopiclone or other synthetic sleep meds I'd tried were, so I took 6mg.</p><p>Soon enough my thoughts began to get less and less clear, and I drifted off into a dreamstate. During the evening I went on a trip to a house on stilts in Japan, visited some of my old schools, talked to friends I have not seen for years, and did so with a lucidity that was unusual to me. Each dream seemed to have an odd sort of 'meaning' to it, but what that was is difficult to put into words. Suffice it to say I felt both at home and a feeling of awe.</p><p>To sum up, I suppose this was not very dramatic when compared to other chemical evenings I've had (the standard list of cannabis, LSD, psilocybin, MDMA, DXM...). What was notable to me was that these 'weaker' chemicals produced quite a profound and much needed night of introspection which seemed to produce a meaningful change in my outlook at a time when it was just what I needed.</p><p>Thanks for reading, friends.</p><p>Namaste.</p><p>-moc</p>",
 "year": "2006",
 "id": "57794",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-01-06T08:00:00.000Z",
 "views": "24461",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP",
   "form": "(capsule)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 4:00",
   "amount": "6.0 mg",
   "administration": "sublingual",
   "substance": "Melatonin",
   "form": "(gel tab)"
  }
 }
}
