{
 "title": "Not a Cure But Best Yet",
 "author": "Flash In the Pan",
 "citation": " Flash In the Pan. \"Not a Cure But Best Yet: experience with Mirtazapine (Remeron) (ID 57816)\". Erowid.org. Jul 21, 2010. erowid.org/exp/57816",
 "substance": "Mirtazapine (Remeron)",
 "bodyweight": "160 lb",
 "report": [
  "<p>I quit smoking pot shortly before I went to graduate school. After three days without pot I started feeling very irritable and started dry heaving in the mornings. I figured it was just withdrawal symptoms. The symptoms never abated and actually got worse within a period of weeks. After a few trips to the campus health clinic, I landed in the psychiatrist's office.",
  "My anger, weight loss, erratic sleeping, and suicidal thoughts added up to more then just pot withdrawal. I was very depressed. I had tried Zoloft and Prozac years before. Zoloft made me feel fake in a very hard to describe way and Prozac gave me terrible stomach cramps. Remeron hasn't produced either of those effects.",
  "I started on a 15 mg dosage and stepped up to a 45 mg over a period of three months. The drug has improved my disposition. It doesnt make me happy but it keeps me from cycling downward. I can break out of thought patterns easier and the worst of the depression has gone away. I no longer fantasize about killing myself. The best way to describe it is that it creates a floor for how low I can feel which is much higher then it was before. Zoloft made me feel like a fake version of myself. Remeron makes me feel like a better version of myself that is still me.",
  "The Remeron has had some other interesting effects:",
  "Munchie-like hunger. My stomach is full but I could still eat another whole pizza.",
  "Strange dreams. I occasionally have difficulty remembering if I dreamed a conversation or if it really happened.",
  "Sleepiness. I can sleep for 14 hours where before 8 or 9 was the maximum.",
  "Ive had to make some adjustments to my lifestyle because of this. To avoid the weight gain associated with the drug Ive had to really watch what I eat and drink. Going to bed hungry every night was hard to get used to. The dreams are pretty much unavoidable. The sleepiness requires that I set an alarm every day. Even on the weekends. Otherwise I will just sleep the day away.",
  "All in all, its a solid drug for depression but Im not certain if it has any recreational value.</p>"
 ],
 "year": "2006",
 "id": "57816",
 "gender": "Male",
 "views": "5461",
 "dose": [
  {
   "time": "0",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "Pharms - Mirtazapine",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2010-07-21T07:00:00.000Z"
}
