{
 "title": "Absolutely Nothing",
 "author": "Ultiman",
 "citation": " Ultiman. \"Absolutely Nothing: experience with DXM (ID 57818)\". Erowid.org. Dec 12, 2007. erowid.org/exp/57818",
 "substance": "DXM",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "DXM",
   "(capsule)",
   " T+ 0:30",
   "300 mg",
   "oral",
   "DXM",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2006",
   "57818",
   "Male",
   "",
   "Not Given",
   "Dec 12, 2007",
   "3188",
   " "
  ]
 ],
 "report": "<p>I really don't understand how this was possible. I have used DXM as a recreational drug a fair amount of times. I usually will dose somewhere between 300-400 mg staying in the 1st and 2nd plateu range. Yesterday I decided that I would up the ante and take 600 mg. </p><p>10:30 PM: Take 300 Mg in 15 mg capsules making a total of 20 capsules</p><p>10:50 PM: Eat a bag of popcorn and some bread</p><p>11:00 PM: Finish my dose with 300 more mg in 15mg capsules bringing my grand total to 40 pills (that's alot of fucking pills!).</p><p>Usually for me it takes somewhere between 1 hour to 2 hours to begin to come up on my trip. At around 12:30 I was expecting to be hit by a very strong trip but nothing happened, so I waited some more time. By 2 AM I was completely dissapointed. Nothing happened, I mean nothing at all. I have dosed many times on 300mg of the same exact robittusin 15 mg capsules and have gotten stoned out of my mind but this time I was completely confused. How can I take double the dose I usually take and nothing happen. I stayed awake watching a movie until 3:30 AM until I just went to sleep. The next morning I woke up with no hangover nothing. </p><p>I would understand maybe if it was my first time doing DXM and maybe my body had some special enzyme that blocked the effects of DXM but I have tripped on DXM well over 30 times. Each time I have done it I feel the effects and have fun. This time though I am just astonished how 600mg can have no effect at all.</p>"
}
