{
 "title": "OCD & Mushrooms",
 "author": "Mad Cyantist",
 "citation": " Mad Cyantist. \"OCD & Mushrooms: experience with Mushrooms (P. cubensis) (ID 5781)\". Erowid.org. Jun 20, 2001. erowid.org/exp/5781",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "230 lb",
 "header": [
  "DOSE:",
  "14 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(fresh)"
 ],
 "report": "<p>Setting: I had been suffering from alcohol-induced insomnia. Anyone who drinks heavily knows what I am talking about. You would think that alcohol would make you sleep, but when you've binged, it produces intolerable insomnia.</p><p>One day while I was an insomniac, my friend J stopped by at 7:00a.m. I was totally caught by surpise. He had a huge grin on his face and a shoe box in his hand. 'What's in the box?' As he opened it, I almost drooled at what I saw. The entire box was full of Grade A Psiloybe Cubensis. He proceeded to allow me to pick out the ones I wanted. Overall, he gave me an ounce for $10, what a deal. He left as soon as he hooked me up.</p><p>My obsessive compulsive personality took over next. I decided to cook up 14g without any type of psychological preperation (biggest mistake you can ever make). After ingesting the entire 14g, I began to feel uncomfortable. About 15 minutes later I was experiencing PROJECTILE VOMITING (although the experience wasn't too bad--I really couldn't feel myself puking). Then some of the most extreme visuals I have ever experienced. I have taken 400mcg of LSD in one dose, and the visuals from the shrooms were far more intense. After an hour, I started to feel like I was literally going to die. My body and mind felt like it was literally possessed by the mushroom.  I felt the entity consume my mind, body, soul. Well, I felt like I was going to die. I could smell the mushroom in my sweat, really.</p><p>Then I started to consume massive quantities of water, and took 3 milk thistle pills. I recommend this to anyone who overdoses on shrooms. Then I decided to exercise. The water and the exercise worked wonders. I fully recovered from this experience but I still regret what I did. If you have OCD (OBSESSIVE COMPULSIVE DISORDER), please consider this report before going on an excursion. God bless.</p>",
 "year": "1999",
 "id": "5781",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-06-20T07:00:00.000Z",
 "views": "7395",
 "dose": {}
}
