{
 "title": "Giving Way to a New Life",
 "author": "R.M.",
 "citation": " R.M.. \"Giving Way to a New Life: experience with MDMA (ID 57835)\". Erowid.org. Sep 4, 2007. erowid.org/exp/57835",
 "substance": "MDMA",
 "bodyweight": "76 kg",
 "report": "<p>Im 27 now and Ive always been a secluded person. Diagnosed with Asperger syndrome (an autism related syndrome) Ive always had great problems connecting with people and feeling empathy for others. The borderline also didnt help and all in all Ive always been a distant and closed down person.</p><p>For over five years now Ive had a close personal friend with whom Ive had a very difficult relationship, mostly because of my distance toward her and her inability to cope. All this together with a few difficult long term relationships have been the prime ingredients for a disturbing life.</p><p>A year and a half ago my last relationship ended and I finally started looking at the great girl that was left, the close personal friend. I began developing great affection towards her but still was hampered by the Asperger and borderline. After a breakup of three months she called and we took a new direction. We started communicating better. She taught me how to look around me and she showed me the things I was depriving myself of. Slowly I started fighting my way out of my disabilities and looking for a way out.</p><p>After six months of this (these things dont happen overnight) she introduced me to MDMA. It changed my life. The borderline had been diminishing for a long time by then and I was quite aware of the limitations Asperger put on me, but the experience of MDMA broke through all of it. Since that day (more than a month ago now) I havent had any borderline experiences. Weve been engaged and were going to live together next summer. Im closer to her than Ive ever been to someone and its nothing more than a dream come true.</p><p>I dont know what exactly it was that the MDMA did with me. I think its best described as connecting my inner world to the world around me, something the Asperger and borderline always made impossible. Its affected my entire life. Ive been on disability for two years, but now Im looking for jobs. And instead of looking for a job where I can sit isolated behind a computer screen for eight hours a day Im searching for something where I can work with people and get out of the office. Its been life changing.</p><p>The experiences itself were difficult. The first two times were relatively short (three hours) and followed by depressed feelings. Since then Ive also had better experiences but I clearly have problems staying in it. What Im trying to say is that its not a miracle drug for me. Although the experience itself is great, its the insight it has given me into my feelings and the feelings of people around me that created the lasting changes. The barriers it breaks down have proven quite permanent for me.</p><p>I still fight for my freedom (because its really nothing more than breaking out of a prison) and Im still, in some ways, a disturbed person. But Ive found a way out.</p><p>I dont know if Im encouraging people in my situation to try this. I know my situation is quite unique in that the combination of Asperger and borderline is quite rare and that Ive been working to get out of it all for quite a while now. But it certainly has shown me things nothing or nobody could have shown me otherwise.</p>",
 "year": "2006",
 "id": "57835",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-09-04T07:00:00.000Z",
 "views": "8369",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "MDMA"
  }
 }
}
