{
 "id": 5784,
 "title": "Diary Of A Nitnaut",
 "date": {
  "submission": "2007-12-18T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "CNB",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "4.0",
    "quantity": "4.0"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "cookie/food"
  }
 ],
 "report": [
  "This weekend past, myself and several friends decided to go to Nitnat lake camping. This is a fairly secluded lake on Vancouver Island in British Columbia. I had purchased some mushroom chocolates about a week before thinking to take them that weekend. The lake was an excellent place to experience a psychedelic experience, clear skies, warm weather, very few negative vibes, untamed wilderness, wind surfers on the lake. I took my chocolates at about 1615, deep down inside I was slightly sketched that they were not going to work.",
  "However, after about 15 minutes when the first pangs of nausea and that feeling of limbo began to strike, I felt a huge relief and euphoria, they were going to work. As I lay in the sun watching the trees and sand I began to feel the effects more profoundly. My first inkling that something very good was up was when I looked at a wine bottle and was shocked to discover that it had somehow become crooked, I looked around and the bottles that surrounded me were all in a similar state of morphing.",
  "45 minutes after first taking them I rolled over onto my stomach and momentarily closed my eyes. I was rather surprised to notice a series of flashing lights disappearing towards a point slightly to the left of the center of my vision. I kept my eyes closed wanting to see more of this. The more I concentrated the vision changed, becoming a pattern similar to that of a leafs underside. The area between each of the veins upon closer inspection seemed to each be a portal to a different vision. I focused first on one with a man standing in the desert, then another of swirling lights.",
  "My focus on the leaf was interrupted by a vision of what appeared to be an angel in the upper right of my visual field. This angel was drawn in the style on the medieval artists, leading me to the thought that perhaps the artists of that time were not just bad at drawing, but had actually seen the same thing as me and were merely recording their trip and contact with what they believed to be angels. This angel slowly morphed into two and they turned onto their sides and became 3 dimensional cut outs, these began gyrating back and forth.",
  "After watching this bizarre spectacle for some time I became aware of a human face occupying the center of my vision, it was a beautiful girl, about 20 years old, with long dark hair, I seemed I was seeing her through a heavily leaded plate glass window, the cracks between the panes of this glass actually turned out to be holes into a far deeper field, as I peered through them I was aware of dazzling lights and flashing stars moving down towards me.",
  "I became aware that I was beginning to get sun burnt and decided to move to another place. Much to my surprise, the strong visuals did not stop when I opened my eyes but merely became embossed on everything I was seeing. They lost their colouring and it appeared as if the world had become 2 dimensional and these visions imprinted onto it. I wandered around the beach, amazed at the experience of exploring a 2 dimensional world. Finally I decided to go to my tent to see what that would be like. Lying on my side I began to notice colourful patterns of arrows sliding back and forth along the mesh in the ceiling. I lay there for about half an hour transfixed by their amazing dance.",
  "Finally I realized that it was time for dinner so walked down the beach amid a series of dancing stars and flashes. At this point I had become used to the concept that I was going to be seeing some very strange things tonight and none of this phased me. Upon arrival at my car I discovered that it had miraculously turned purple (it is usually a hideous brown) and like every other car appeared to be glowing. As dinner cooked I was able to have a fairly intelligent conversation with my fellow campers (all stuck on earth) and became aware that the visual effects were wearing off.  It had been 4 hours since I ingested the chocolates. Gone were the vivid hallucinations, replaced with the odd effect that everything was surrounded by a halo of light.",
  "After dinner we walked through the forest, my visuals were all but gone and had been replaced by a feeling of enormous euphoria and excitement. I was also thinking on a level far clearer than ever before, my mind seemed to be free of the usual encumbrances of personal issues and I was able to appreciate the universe and our tiny part in it. Walking back down the river the beauty of the world over took me and I stood transfixed by an enormous tree, doing a monologue about the how infinitesimally small man actually is in the universe. Upon returning to camp I felt entirely normal except for being exceptionally happy, and philosophical. That night it took a long time to fall asleep because of the huge thoughts that seemed to be playing across my mind. The next morning found me with no ill effects, simply a better understanding of how tiny we are and how beautiful the world is."
 ],
 "erowid": {
  "id": "35652",
  "citation": " CNB. \"Diary Of A Nitnaut: experience with Mushrooms (ID 35652)\". Erowid.org. Dec 18, 2007. erowid.org/exp/35652",
  "substance": "Mushrooms",
  "views": "2254"
 }
}
