{
 "title": "Sooo Terrible",
 "author": "LORD ZZATAN",
 "citation": " LORD ZZATAN. \"Sooo Terrible: experience with Quetiapine (Seroquel) (ID 57841)\". Erowid.org. May 10, 2007. erowid.org/exp/57841",
 "substance": "Quetiapine (Seroquel)",
 "bodyweight": "150 lb",
 "report": "<p>Seroquel is by far the worst drug I have ever ingested, and when I say worst I mean it produced the most terrible feeling ever. I have done various drugs: codeine and promethazine sizzurp, large quantities of reefer, opium, hydrocodone, oxycodone, cocaine, alcohol, nitrous, poppers, salvia . . . anyways, nothing could have prepared me for what I was about to embark upon.</p><p>It was a day like any other, smoked usual amount of weed, chilled and really had no idea I was going to take this. My mom comes home from her friends house with a box of pills, a professional sample of 300mg tablet Seroquel. My mom then tells me her friend who had given these to her said that her cousin took one pill and reported he was overly fucked up. I was not at all alarmed, in fact I thought the person must have just been a low tolerance pussy, so I decided to pop two. About 20 minutes later my mom comes home and I tell her I had taken the pills, she tells me I am stupid and should have only taken half of one of them. I brush this off saying ya right I know what I'm doing. We then go on a drive somewhere, me driving, and pretty much everything seems the same.</p><p>When we get home about 20 minutes later I feel slightly drowsy, but not too much. I then go in my room and smoke a few bowls and go out in the front room and relax. By this time I am really stoned and just enjoying it on the comfy couch, when all of the sudden a wave comes over me and this intense feeling in the center of my brain takes over my entire conciousness. I stand up and boom, another massive rush overwhelms me and I stumble back to the couch. I try to speak but no words come out, so I walk into the kitchen where my mom is cooking dinner. Before I had smoked I was really hungry, but now my hunger was flushed out and all I could feel was the energy moving back and fourth in my brain. Feeling very very restless I walk around the house and try and sit outside, but nothing is calming me, I just seem to be getting higher and higher and higher.</p><p>By now the feeling is so ridiculously overtaking I am freaking out. Not like screaming or anything, but there is just this undescribeable feeling of restlessness and hypertension. The feeling is too overwhelming and I cannot take it. I tell my mom what is happening and she again tells me that I should not have done that. Not knowing what else to do I attempt to throw up the pills, but I cant gag. Still the feeling seems to be escalating higher and higher. I lay down in bed and am immediately aware my breathing is super weighted. I cannot breathe without conciously making an effort to suck the air into my lungs, and at anytime now it feels like I am going to just forget to breathe. It is so bothersome I cannot get to sleep. Laying there for what seems like forever, litterally, my mom checks on me. I can hear and feel her, but when I try and talk, my mouth moves with no words coming out.</p><p>When I wake up the next morning I still feel really faded, but the real feeling is completely gone. I talk to my mom about what happened and she said when I would try and talk nothing would happen, and when I did manage to talk it would come out in complete giberish and slurred slow speech.</p><p>The only way I can truly descibe the terrible feeling with Seroquel is this feeling of not pain but weird restlessness and fucked-up-ness that moved back and fourth infinetly fast in my brain and throughout my entire body. My vision was mostly black, except the center focus point, which was very blurred and 'tingly'. I felt completely detached from everything, like I was just there, nowhere. The entire feeling is so overwhelming I wished I was dead. Seroquel has changed my entire perception on drugs, before it I was fearless and untouchable, after I am left feeling almost afraid of drugs altogether.</p><p>Never ever again will I try Seroquel, and I think I will also not be able to try any new drugs until I completely forget about Seroquel. It has scarred me for a long time, and I wish with all my being I had never tried it. Yet I feel almost glad that I did, just so I would know that I am not unvincible, and living reckless is a life not worth living for me.</p>",
 "year": "2006",
 "id": "57841",
 "gender": "Male",
 "timestamp": "2007-05-10T07:00:00.000Z",
 "views": "54990",
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:20",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
