{
 "title": "Enhancement and Improvement",
 "author": "Pippin",
 "citation": " Pippin. \"Enhancement and Improvement: experience with MDMA (Ecstasy) & Cannabis (ID 57875)\". Erowid.org. Sep 6, 2009. erowid.org/exp/57875",
 "substance": "MDMA (Ecstasy) & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 2:00",
   "2 tablets",
   "insufflated",
   "MDMA",
   "(ground / crushed)",
   " T+ 3:15",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 4:30",
   "2 tablets",
   "oral",
   "MDMA",
   "(ground / crushed)",
   " T+ 4:55",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 8:50",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 9:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 13:15",
   "1 cup",
   "oral",
   "Caffeine",
   "(liquid)",
   " T+ 19:45",
   "1 tablet",
   "oral",
   "Tryptophan - 5-HTP",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>After purchasing a new concert DVD, and it being the last day of classes for the semester, I decided to dip into my little stash and do two pills of E later that evening. Due to the spontaneous nature of the decision, I didn't have time to make my usual preparations, and instead ate heartily two hours before dosing. Otherwise, I prepared for the experience by surrounding myself with friends and listening to good music, setting up the atmosphere for later. Note: I live in a university residence, dorm style.</p><p>9.15: After smoking a moderate amount of pot, I insufflated two ecstasy tablets (grey panda, grey omega). I go and hang out with my friends, figuring out what the plan is for the rest of the evening.</p><p>9.45: Return to my dorm room, beginning to feel that slight familiar lift. Nasal passages are mostly clear, these tabs powdered easily. No hints of negative side effects, mild euphoria only, no physical stimulation yet.</p><p>9.50: Decide out of the blue to play a 20-minute set at a downstairs coffee house. Finish my set just fine and put my guitar away. I head back up to my room to stock up for the rest of the evening. Definitely now feeling a stimulant rush, and pupils are more than normally dilated. No grinding yet. I'm not feeling a cannabis high much anymore at this point, and decide to go back up to my room, clean up while I have the energy, and wait for the next planned event of the evening.</p><p>10.30: Head back outside and smoke a reasonably large amount of cannabis. Am experiencing peak of E high at this point, cannabis brings down the physical symptoms.</p><p>11.20: Move around the residence area, making sure all arrangements are made for a 'field trip' to a special smoking spot at midnight. I bundle up warm as it is well below zero and snowing moderately.</p><p>11.45: Ecstasy high is diminishing, possibly due to cannabis. I decide to administer a 'top-up' and prepare two more pills and 'parachute' them in a cigarette paper.</p><p>12.10(AM): Arrive at special spot, smoke a small amount of cannabis. Other members of my party begin to feel hungry. Second dose of MDMA has not yet affected me yet. I'm slightly hungry, possibly because of all the pot.</p><p>12.30: Order Domino's and wait for it to arrive.</p><p>1.10: Pizza is ready. Second dose of MDMA is starting to present, I am shifting my weight back and forth across my feet and am noticing for the first time a grinding of teeth. (Note: this grinding may have started earlier, and I not noticed it.) I eat one slice of pizza and decide I wasn't hungry after all. We return to residence, and two members of our party decide to go to bed.</p><p>1.50: Back in my room, watching a concert DVD and talking over it.  Teeth grinding is moderately severe at this point, and I have no retainers or other equipment to help. I concentrate slightly more at not grinding and manage to suppress most of the urge. Am euphoric, highly conversational (usually I'm a fairly quiet listener guy, unless I'm performing.)</p><p>2.30: We think the concert ends (in fact it's the intermission) and put on some Drawn Together, and watch it. Grinding is mostly mentally supressed at this point, and I've mostly stopped swaying as well. Mental effects, euphoria and empathy still going strong.</p><p>3.00: To amuse people, I do a magic routine. Once again, this MDMA has strongly enhanced my desire to perform in front of crowds, and is, to my standard, not terribly distracting.</p><p>3.40: Everyone who has not taken MDMA (everyone but me) is starting to get tired. We put on some music and chat for a while. Nervous tics (vibrating leg while sitting, involuntary body motion, grinding) are beginning again, more difficult to control. Euphoria is fading, however talkative-ness and (possibly perceived) empathy are still highly present.</p><p>4.05: Conversation dies, and my companions retire. I roll a small joint (.5g) and go outside to smoke it.</p><p>4.15: Return from smoking to find some new friends wanting a buddy to smoke up with. I suddenly realize that I have lost my room key, eventually finding it in my room, on the floor. We smoke again, and I retire to my room.</p><p>4.35: Still listening to music and browsing the web, I start to feel the mental effects of the E fade. While still highly receptive, I begin to adopt my more normal mannerisms and speech patterns/rates. My pupils, I notice, are still fully dilated.</p><p>4.40: Hear a door slam in the hall, curiously go investigate. There are some fellow residents in the hall (who have no idea I'm on drugs). I engage in normal conversation for a while, and return to my room. I clean up, listen to music, watch some TV and finish the concert DVD.</p><p>6.15 (approx): Sun rises. Still awake and fully physically alert. No longer in the company of others, I allow myself to give into all physical tics (except grinding) to burn some un-necessary energy.</p><p>7.30: Shower, shave and get dressed. No noticeable physical unsteadiness, in full control of myself. Still feel highly energetic.</p><p>8.30: Have a small coffee to ensure I don't randomly pass out, get ready to leave for daily appointments. Still feel compelled to shake right leg and grind teeth. I go out and buy a pack of gum to  get through the day without looking too strange.</p><p>10.25: Go out and get my hair cut, interact normally with people (including those very familiar with me) who notice nothing but a superficial air of tiredness.</p><p>3.00 Purchase a small bottle of 5-HTP supplement and take one pill.</p><p>4.00 Return home, feeling still very small urges for nervous behaviour. Mental state clear, lucid, no signs yet of any depression or odd thought patterns. Write this trip report.</p><p>Although it is of my opinion that the ecstasy used in this experience was of relatively low potency, its effects were pronounced to me. However, any unbiased observers (friends who know I do drugs, but not that I was doing E) later remarked that I had next to no physical symptoms of ecstasy use at all. Of the party of 8 people who were with me most of the night, two were aware that I was on E. Nobody else noticed until it was mentioned.</p><p>Overall, I think this was a well-timed trip, with plenty of excitement. The supplementary doses helped each other out well, and in my opinion the cannabis use extended the mental effects while suppressing physical tics for the duration of the cannabis 'high'. Furthermore, I should be able to even get a good night's sleep.</p><p>End report tally:</p><p>First dose of drugs: approx 7.15 PM (pot)</p><p>Subsequent dosages: 9.15 PM MDMA, 10.30 PM pot, 11.45 MDMA, 12.15 pot, 4.05 pot, 4.20 pot.</p><p>Mental effects terminate: approx 4.30 AM</p><p>Physical effects terminate: not yet fully, estimate 5.00 PM</p><p>Overall experience: A+</p>",
 "year": "2006",
 "id": "57875",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-09-06T07:00:00.000Z",
 "views": "5731",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
