{
 "title": "The Most Intense Psychedelic",
 "author": "Brady",
 "citation": " Brady. \"The Most Intense Psychedelic: experience with Ether (ID 57902)\". Erowid.org. Jul 1, 2009. erowid.org/exp/57902",
 "substance": "Ether",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "inhaled",
   "Ether",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2006",
   "57902",
   "Male",
   "",
   "Not Given",
   "Jul 1, 2009",
   "23158",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>Let me start off by saying I am pretty well experienced drug user, I've done a fair array of psychedelics, but ether is by far the most intense, if done right. </p><p>The first time I ever had an ether trip was when I tried huffing gas back in JH. I had only smoked pot at that time and had no idea the kind of psychedelic effects ether had, nor was I ready for them. I just went out in my garage, which has really loud blinky fluorescent lights, and huffed on the can for a while. At first it was just a tingly body high, then the lights started blinking similar to strobe lights, and the noise became unbearable, as if someone was wailing on a chainsaw inches away from my ear, then it soon turned into one of the worst mindfucks I've ever had. I felt like I had died, and for a split second truly believed in my heart of hearts that I had. It really freaked me out because I had no idea what to expect, and I was paranoid that my parents might catch me. It wasn't a good setting to be in for a strong ether trip. After that I swore the stuff off. </p><p>Then, years later I was turned on to ether by a friend. He made it out of a can of starter fluid, mixed with equal parts water, then poured the water out, leaving supposedly purer ether than straight starter fluid. At this point I didn't know that my gas experience had really been an ether trip, and as you can expect I had a really bad repeat trip. Literally the exact same trip I'd had years before. Again I swore the stuff off. </p><p>Just a few weeks ago, that same buddy of mine asked if I wanted to try ether again. I have in that time experimented with many different types of drugs, and never been touched so deeply or tripped so intense as I had twice before. I figured I'd be more capable to stay calm and in control so I said to myself, fuck it why not give it another try. Boy, was that a good decision.</p><p>We decided to do it at his house, and when we got there his roommate had invited some of our mutual friends over and they were in the living room watching a movie. We all smoked a couple bowls, then we went back into my friends room and each got a rag and started huffing. At first, I felt the same familiar warmth and tinglyness that goes throughout the body after the first few huffs, then the wah's came. The premier state Ether is really reminiscent of a whippit. Then after a few more huffs, the vision becomes blurred, motor skills are greatly impared, walking feels more like coordinated stumbling. I was really not sure if I was feeling it yet, so I got up and attemped to walk out into the living room. </p><p>Yet again, the fluorescent lights in the kitchen, along with the slight hum of a space heater, were wreaking havoc on my senses. I couldn't hear anything other than the roar of the heater, and my eyes told me the lights were flashing at the pace of a slow strobe light. It almost became unbearable, but then I turned and looked at the tv. It was the only thing in the room illuminated enough to stand out from the surroundings, and soon all the other objects the room sort of melded together into hexagonal geometric patterns and started slowly rotating around me. Then I relaxed my eyes, and I realized I could zoom in on objects, and turn my vision into wide screen. At this point I was so amazed at what I was seeing I turned and tried to speak to my friend and tell him how amazing this was, but I couldn't find the words to string into sentences to explain what I felt, and it all just came out in a jumble of Wows, Dudes, and Its Like's. </p><p>I started coming down so I went back in the room to get some more and check on my buddy, who was spaced out on the bed. I started huffing more and was soon flying high again, but instead of getting up and walking around, I just sat there and my mind took over. As I huffed more and more I would start to space out and trip harder and harder. </p><p>Its hard to remember the details of these trips because at that point I'm pretty much fully anesthetized and  not even aware of the outside world. The only way I can describe these trips is to call them circular. Everything feels familiar, as if its happened before. Its almost like a constant state of deja vu. I also sometimes feel as if I understand 'It'. But while high I cant explain 'It', and once sober I don't know what 'It' is. </p><p>We huffed for probably 5 hours straight until the bottle was gone. Coming down off ether was very pleasant, it was a really mild body high, its just a very relaxed state. Immediately afterward, the urge to do more ether was extremely intense. But soon I got over that. I've done more ether since then, and plan on doing more in the future. I really wouldn't suggest doing ether if you have anything to do soon, because it makes my breath reek, I feel stupid for about an hour afterward, and in order to fully experience the power of ether I must huff a lot and let it take me to places I never thought were possible.</p>"
}
