{
 "title": "Helping A Friend Keep His Head",
 "author": "Lazarus",
 "citation": " Lazarus. \"Helping A Friend Keep His Head: experience with LSD (ID 5793)\". Erowid.org. Feb 4, 2002. erowid.org/exp/5793",
 "substance": "LSD",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>This experience happened in the early autumn of 1975.  I had had a bad trip on LSD (4 hits) some months earlier (May).  My brother had some friends over to the house, all of whom had just dropped two hits of acid each.  One of these guys had never done acid before.  And there he was, dropping two hits of purple microdot for his first taste.  Oh well. </p><p>We all were sitting in the living room, on the floor, lounging in couches or recliners, whatever.  One or two folks were beginning to notice some effects, trails and such.  No one getting giggly yet.  Suddenly, the first timer leaps to his feet from where he was sitting against a wall and announces, 'My God!  I'm having a bad trip!'  All eyes in the room focused on ME.  After all, I was the only one here who had not dropped any acid at the time.  I was also the only one who had ever experienced a bad trip before.  I suppose they all looked at me as some kind of authority.   Well, this was no time to disabuse them of such notions.  I remained slumped in the recliner and smiled beatifically at the first timer.  'You're not having a bad trip, man.'  'I'm not?', he replied in bewilderment.  'No, you're having a great trip.  Just sit down, relax and enjoy it.'  God had spoken, or so it may have seemed to this confused first time psychonaut.  'Okay,' he responded, sat down and pasted a big smile on his face.</p><p>The rest of the trip was just fine for all my friends.  They did not remain at the house, but took off for parts unknown about an hour after this incident.  They told me about the experience later.  The key point here is that the first timer, who thought he was having a bad trip, enjoyed himself.  It could have gone otherwise.  If I, or anyone else, had responded to his panicked assertion with sympathy or with concern, we could have fed his belief and reinforced it disastrously.</p><p>I am sure most of those reading these reports do not need to be told this.  It is for those who have only limited experience with psychedelics who may have fortuitously stumbled on these vaults.  Take heed.  Always keep a positive outlook, especially if you are functioning as a guide to someone who is new to the psychedelic experience.</p>",
 "year": "1975",
 "id": "5793",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-04T08:00:00.000Z",
 "views": "9652",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(pill / tablet)"
  }
 ]
}
