{
 "title": "No Memory",
 "author": "Benjeezy",
 "citation": " Benjeezy. \"No Memory: experience with Alprazolam (Xanax) (ID 57939)\". Erowid.org. May 9, 2008. erowid.org/exp/57939",
 "substance": "Alprazolam (Xanax)",
 "bodyweight": "140 lb",
 "report": "<p>Well, I am 17 and in high school when a buddy of mine asked if I wanted to buy 4 of these 1 mg purple pills labeled 'Upjohn 90' and said they were like half-bars (which they are) so I did. For 8 bucks it wasn't a bad deal. I started off by taking two or the equivalent of one xanax 4bar. Now, this is my first time with xanax, but I've experimented with hydrocodone and oxycodone because of post-op on surgeries for my eye.</p><p>Anyways, I started off not feeling anything for about 15 minutes. I then went to a water fountain and took another one. I still wasn't really feeling anything yet either. So, about 10 minutes later I was starting to feel slightly heavy, but nothing worth 8 bucks heavy, so I took the last pill with some water.</p><p>About half an hour later I was in my next class period and the last thing I remember clearly was talking to some buds of mine there and then nothing. From people telling me what I did, apparently I didn't go to lunch, was stumbling and walking around, tripped over a desk and said sorry to the desk, stumbled around in the class after that and told my teacher 'I am Johnny Cash trying to walk the line,' had a banana peel fight in the parking lot with some people, Drove around on the interstate to go to guitar lessons, and came home. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] I didn't remember any of this stuff. At all. I was most definitely in no shape to drive, but I didn't know that and could do nothing about it.</p><p>Overall, in the beginning, it was a mild but enjoyable little euphoria. But I believe I mildly OD'd on it because my skin turned yellow and people were constantly asking if I was drunk. Try taking a bar and seeing where you go, and then go up after about an hour or two. The effects take a while to set in, but it's nice when they do.</p>",
 "year": "2006",
 "id": "57939",
 "gender": "Male",
 "timestamp": "2008-05-09T07:00:00.000Z",
 "views": "47418",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "4.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  }
 ]
}
