{
 "title": "Great For Introspection",
 "author": "Davin",
 "citation": " Davin. \"Great For Introspection: experience with 2C-T-7 (ID 5798)\". Erowid.org. Jan 5, 2002. erowid.org/exp/5798",
 "substance": "2C-T-7",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "40 mg",
  "oral",
  "2C-T-7"
 ],
 "report": "<p>Having tried 2c-t-7 on four other occasions, I decided last night to dose the remaining forty milligrams I had in my fridge.  The last time I had also taken 40 mg and found it to be at just the right level for me.  So I measured it out and drank it down.  The taste was hardly noticed mixed with some oj.  I must also mention that i had been drinking earlier and i find that few beers helps it kick in quicker than normal.</p><p>   After about an hour I felt the slow climb begin and experienced transient nausea untill i reached about t+2 and my vision began to go.  Shadows begin to move across the walls in waves and I begin to get familiar MDMA like body rushes.  Mentally I begin to slowly drift towards a very calm and peaceful mind set.  Everything seems so at peace and I find myself obsorbed in radiating lines of color that expand out across my vision.</p><p>   I throw in some music in the third and fourth hours and it sounds</p><p>wonderful.  Closing my eyes the music effects how the visuals flow and unfold.  The texture of different surfaces also causes changes in color.  My body feels awesome: almost as good as MDMA but more calm and relaxed.  The visuals from this stuff are equal to if not better than those of 400 mcg of good LSD but no mindfuck.</p><p>   Overall the experience lasted around six hours.  Smoking pot</p><p>throughout the trip definately intensifies the visuals.  2C-T-7 is probably one of my favourite drugs and is great for introspection.  I find it's body load to be negligible compared to the benefits.  I would recommend this substance for exploration.</p>",
 "year": "2001",
 "id": "5798",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-05T08:00:00.000Z",
 "views": "5434",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "2C-T-7"
  }
 }
}
