{
 "title": "We Weren't Lost Afterall",
 "author": "WayToApathy",
 "citation": " WayToApathy. \"We Weren't Lost Afterall: experience with Cannabis, Amphetamines (Adderall) & Alcohol (ID 58025)\". Erowid.org. Aug 2, 2009. erowid.org/exp/58025",
 "substance": "Cannabis, Amphetamines (Adderall) & Alcohol",
 "bodyweight": "103.5 lb",
 "header": [
  "DOSE: T+ 0:00",
  "60 mg",
  "oral",
  "Amphetamines",
  "(pill / tablet)",
  " T+ 16:00",
  "100 mg",
  "oral",
  "Pharms - Sertraline",
  "(pill / tablet)",
  " T+ 16:00",
  "150 mg",
  "oral",
  "Pharms - Bupropion",
  "(pill / tablet)",
  " T+ 16:00",
  "30 mg",
  "oral",
  "Amphetamines",
  "(pill / tablet)",
  " T+ 23:40",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)",
  " T+ 28:55",
  "2 shots",
  "oral",
  "Alcohol - Hard",
  "(liquid)",
  " T+ 29:55",
  "4 shots",
  "oral",
  "Alcohol - Hard",
  "(liquid)"
 ],
 "report": "<p>I normally don't do my own stuff because it's much more profitable to sell it.  I'm talking about adderall in this particular instance, two tablets 30mg each.  I had gotten them for a friend and I went to give them to her at around 3:35pm and it turned out that she wasn't at school.  I was slightly upset because I had taken a lot of risks to get them so without really thinking I just dryswallowed them.</p><p>Now you see, I'm perscribed adderall because I am an ADD child.  Therefore my experience with it will not be a really 'high' one, but at high enough doses (I'm perscribed only 30mg) I do get buzzed and really alert.  So I took them and at around 4:30ish I could feel myself becoming more alert and more awake, everything was brighter and happier.  I was also a bit jumpy and jittery.  Anyways, I couldn't get to sleep until around 1am so I just did chemistry homework that I had been putting off.  I woke up at 6:30am or so and couldn't go back to sleep, so I got up and did MORE chemistry homework.  Oh boy!  I could still feel that I was buzzed, but not as much.  Then my mother rememebered that I needed to take my meds and actually stood over me and watched me take them.  They consist of 100mg of zoloft, 150mg of wellbutrin and 30mg of adderall.  In around an hours time I was feeling a bit buzzed again and I felt pretty good.</p><p>Now onto what this is really about, my first marijuana experience.  I went over to my best-friend and cousin's house and we got a call from her friend up the street, she had some chronic marijuana and was wondering if we'd like to go off into the woods and do some with her and a friend for free. Our answer:  Hell yes.  My cousin has done weed many times before, but only got high off her ass once and that was because she took around 4 hits from a rather large bong.  She doesn't particuarly like weed and didn't really want me doing it.  No matter to the fact that we do coke together all the time. So we met up with the two 19 year olds and went off into the woods.  I'll skip over our boring half an hour walk where I managed to get my flats and socks drenched in stream water.</p><p>It was around 2:55pm when we got ready to smoke it.  The two other girls (aka, not my cousin or I) took out two different thinks of weed:  one HUGE container of 'Super Skunk' and then a easter egg full of chronic.  They took out a pipe (it was rather pretty, by the way) and my cousin's friend put some of her chronic in it.  It was right then that they learned it would be my first time and decided that I had to get the first hit.  They seemed really excited, it was quite amusing.  They showed me the hole on the side of the pipe and told me what to do with it and then I put the end up to my lips.  She took out a lighter and caught the top of the bowl.  I inhaled twice, but I didn't know that I had to hold it in my lungs.  Neither hit was any good, I didn't get enough.  The pipe went around the 'circle' in the middle of the woods on a random path and they finished that bowl.  Then the other girl put her stuff in it and I got a pretty good hit out of that.  I held it in and I started to feel a bit dizzy and my vision was losing focus.</p><p>Now here's where it gets good.  The chronic got put in again and I guess I inhaled too deeply because in the middle of it I suddenly felt like my throat had closed up (it started off as a bad trip but got good, don't worry) so I let it all out of my lungs and I couldn't breathe at all.  I wasn't coughing because I couldn't.  It made a weird noise when I tried to breathe in and it felt like my lungs were pushing air out.  My cousin told me to stand up so I did and everyone was really worried and thought that I might have been allergic or something.  Then finally my cousin realized that nothing was wrong, that I was just REALLY high and hallucinating.  I had been breathing normally the whole time.  She realized this after she asked what the world looked like and I answered 'like someone painted over everything and made it bigger'.</p><p>After around ten minutes I finally calmed down and we walked around while I enjoyed everything looking really strangely.  They were all laughing at me because I'd say the most random things, whatever popped into my head.  I'd notice that what I was saying was really stupid and druggie in the middle of it but I was never able to stop myself.</p><p>I remember randomly thinking that we were lost and turning around and saying 'ohhhhhhh....' really pathetically.</p><p>My cousin and I broke off with the other two because we wanted to go eat, even though I wasn't really that hungry (the adderall is a natural appetite suppresent).  We went to CiCi's at around... Oh, I'd say anywhere between 3:30 to 4pm.  I don't really remember much of the car ride there.  When we got inside getting food was amazing, my mouth was really dry and sticking to itself so I got some water too.  My vision was still really messed up and I was enjoying it a lot.  My cousin was a little messed up, like everything was a bit funnier to her, but other than that she has a really high tolerance or something.</p><p>I started saying the strangest things, like I'd whisper 'How loudly am I talking???'  And my cousin laughed at me and joked, 'You're practically screaming!'  I freaked out and she had to tell me that I wasn't really yelling.  Every 5 minutes or so I'd look at the slice of pizza I was eating and say, 'Why am I not eating this fast enough!  I really thought that I would have been done with this piece by now!'  Apparently I get really violent, like, not physically, but, it's hard to explain.  My cousin would joke around and then I'd joke back with 'I'm going to beat your face in with this tray!' or something like, 'I'm going to punch you in the dick!!!'  The last one is actually quite amusing because my cousin is a girl.</p><p>By the time we left CiCi's my vision was correcting itself and everything was pretty normal, but my thought process was fairly skewed.  We couldn't go over to our friend's 'house' yet (she was babysitting 3 12 year olds) so we went over to MY house and sort of hurried upstairs.  We were there until around 6pm and I was just sort of buzzed at this point.</p><p>We got to our friend's 'house' and realized that there was alcohol there.  At around 7:30 my friend and I grabbed a bottle of whiskey and I took two large swigs (aka, two shots) and gave it to her.  She'd never had alcohol before so I just wanted to get her buzzed, especially since she was babysitting.  Shortly after that I made us both some gin and tonic and added a bit of orange juice to hers because she didn't like the taste.  At around 8:30 I had another 3 or 4 shots and she had another one.</p><p>My cousin and I had to leave and by this time my vision was blurred and I was slurring my speech quite a bit.  My cousin was annoyed with me because we were going back to her house (I was sleeping there) and she didn't want us to get caught by her parents or brother. I don't remember much else, I went to sleep at around 9:30pm because I was so tired from the night before.</p><p>I woke up with no hangover whatsoever and I'm still pleasantly buzzed.  In fact in the car with my mother I said some pretty stupid things that I'll attribute either to the pot or the booze.  By the way, I'm 14, 5'2, and 103.5 pounds.  That probably explains why it takes so little to get me blazed!  Not to mention it hasn't been a full twentyfour hours since I smoked it and I'm wondering if I can get some more!</p>",
 "year": "2006",
 "id": "58025",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-08-02T07:00:00.000Z",
 "views": "4682",
 "dose": {}
}
