{
 "title": "A Dead Ringer",
 "author": "Faron A.",
 "citation": " Faron A.. \"A Dead Ringer: experience with 5-MeO-MiPT (ID 58049)\". Erowid.org. Mar 13, 2007. erowid.org/exp/58049",
 "substance": "5-MeO-MiPT",
 "bodyweight": "160 lb",
 "report": [
  "<p>Consumed on the same night two separate doses of 5-MeO MiPT. One at 8:30 and the second, larger one at 11:30, after I fell of the peak of the first trip.",
  "The first (27mg) dose produced an impossible giggle fit followed by most prominent visual distortions in the form of discoloration of objects and the occasional spray of red iridescent glitter. Crescendo rises to a fever pitch and then fades slightly, slowly tapering off to a clear headed euphoria at which point I consumed the 30mg dose.",
  "I was first alerted to the severity of my condition when a stray glance toward my computer visualizer led to the vivid patterns bleeding into the entirety of my vision. Everything I saw for perhaps a minute was overlaid with splashes of vivid color that imitated the visualizer. I proceeded from my bedroom to the den, where I encountered a most beautiful raised pattern all writhing and twisting as if a press of tentacles were knitting breaches in reality beneath the carpet.",
  "I might have been all shruggy shruggy after that with my modest acid experience, if it had not been for the duration and constant intensity of the next 8 hrs. Without the peaks and waves of acid, this drug at high doses can deliver the most steadily intense experience I have ever had. Even now, a full 13hr (16 from the first dose) I am experiencing a shadow of both the euphoria and the visuals. Overall an incredible trip, it left me, finally, with a feeling of awe. This substance is number one for a tripper with acid, 2CI, 2CT2, various anologues, and DMT under my belt. Four thumbstwoone? Its a trip where I should feel confident I wont need to count the thumbs up till a good 11-13 hrs later.</p>"
 ],
 "year": "2006",
 "id": "58049",
 "gender": "Male",
 "views": "11310",
 "dose": [
  {
   "time": "0",
   "amount": "27 mg",
   "administration": "oral",
   "substance": "5-MeO-MIPT"
  }
 ],
 "submissionDate": "2007-03-13T07:00:00.000Z"
}
