{
 "title": "Gone in 10 Seconds",
 "author": "Lucidtrip",
 "citation": " Lucidtrip. \"Gone in 10 Seconds: experience with Salvia divinorum (25x extract) (ID 58061)\". Erowid.org. Nov 16, 2007. erowid.org/exp/58061",
 "substance": "Salvia divinorum (25x extract)",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "150 mg",
  "smoked",
  "Salvia divinorum",
  "(extract)"
 ],
 "report": "<p>Since my two friends and I moved into our apartment during the summer, we have had a series of encounters with Salvia extract on our own accord.  Now likely two months since I have last danced with this mind-bending plant, I feel that I can sufficiently outline the contents of our biggest trip.  I'm shaking just thinking about it.</p><p>The night was young, and it was likely a Friday night.  We'll call my two roommates Tom and Huck, our good friend will be Hunter, our neo-hippie friend will be Sindy, and Huck's girlfriend will be Mary.  Somehow, we never end up really planning for our evenings who's presence is graced with Salvia, but it just ends up happening at someone's suggestion.  On this particular evening, Tom, Huck and I felt no need to splurge on a 45x extract, which we had done twice before, so we instead chose what we calculate to be a 25x extract.  We also felt that because of Salvia's typical reverse-tolerance, we would have a perfectly warped reality with a tamer extract.  Boy were we in for a surprise.</p><p>We all made our way into the apartment living room after rationing out the Salvia into 5 seperate doses, two smaller ones for the girls and 3 for Tom, Huck and myself.  Hunter used to live quite a drug-filled life, but has since cut back to nothing except for heavy sleeping.  We unscrewed the regular ceiling fan lightbulb and put in a blacklight bulb.  And of course, I cued my salvia playlist and started the music visualization.  We chilled our pyrex bong and put a screen into the bowl to make sure that we didn't lose any of the fine salvia.  We in the past had used a small amount of marijuana to act as a screen, but we were out this evening.  We also went into this wondering if we would have the same experiences we had had in the past despite the lack of marijuana.  At the last minute we decided to use our Coke-bottle bong (quite a fun one it is!) and a mini-bong as well.</p><p>Mary and Sindy were up first.  They both were rather inexperienced with Salvia, as they had only done small doses twice before.  Because we were using a stronger extract than they were used to, we gave them what I presume to be approximately 75mg each.  The two girls had the same reaction that we had come to define as the lighter trip reaction, intense laughing and an expression of complete bewilderment.  Sindy may have reached a higher level than Mary, though she came back to grasp her reality just as quickly.  This would be something that Tom, Huck and I would soon lose complete awareness of: our reality.  In order to heighten our experience, the three of us agreed to all smoke our larger portioned bowls at the same time.  This would prove to be the greatest asset to Tom and my experiences in particular.  In order to begin to explain this trip, I will have to switch to a present tense wording.</p><p>Huck and I are sitting on the ground with our legs cross at our very low coffee table.  Tom is perched on the couch in his typical smoking stance.  Tom is armed with the coca-cola bottle bong, Tom has the mini-bong, and I have the pyrex bong.  We all are shaking in anticipation for our joint journey into whatever realities we are about to enter.  I'm especially nervous because my first trip has since been the basis of comparison for all trips within (and without) our household.  It would be an understatement to say that I was completely out of touch with existence as you and I know it.  We strike our lighters and light our bowls.  We will later find out that we cashed our entire 150mg bowls in our one and only hits.  We each slowly count to 30 in our minds, trying desperately not to waste our only salvia by coughing it all out.</p><p>1...2...3.........4..................5........................6...............I can already feel the onsets of the salvia's effects, the feeling of someone pulling me, like gravity is pushing be backwards and forwards and to the sides, but not down...............7...............................8.......???</p><p>I never make it to 10.  What happens in my mind for the next 20-40 seconds is still a complete mystery to me.  It feels as though for this brief lapse of time, I have completely ceased to exist.  No ego, no body, no mind, no memory, nothing.  I don't even remember exhaling the smoke.  The speculators say that both Tom and I begin to lean back and forth and side to side with blank stares on our faces.  Somehow, Huck leaps to his feet (I forgot about him even though he is 6 inches to my right) and lept over a couch and run into his bedroom.  I'm on my feet now, I think.  I don't remember making it to this state.  Suddenly, our coveted soda can pyramid in the windowsill comes crashing town from both sides.  After they tumble to the ground, I feel the cylindrical shape of the cans against my arms and my side.  Tom has also made it to his feet and into the soda can pyramid.  I fall down to the ground and crunch probably a dozen soda cans and lean backwards on our television stand.</p><p>The music playing has altered my perception of time.  Someone has grabbed the film that runs across the spools that dictates my life, and pulled it up.  Every time the guitar notes are pulled sharp, time stands perfectly still.  It's as though someone made this music for me, for this moment.  I can see and feel the music as it bends in the air.  The fear begins to set in, which I have found to last for roughly the first 3-5 minutes of my trips.  This revisited reality (I am dancing on the fringes on my first trip) brings back memories of dread that I can never fully grasp sober.  Merely writing about this is giving me a tingling feeling all along my body.</p><p>The philosophy starts.  I once again can grasp the concepts of death, zero-existence, God, infinity, and forever with ease.  Now the familiarities begin to set in.  The feeling that someone is controlling and dictating every moment of my life is here again.  I am living the mocked reality of my last departure from reality, likely a month before.  Everything feels like it has happened.  This is deja-vu revisited.  Every moment has already been lived 1,000,000 times before by a version of me that lives 5 seconds ahead of me.  Who is dictating everything that happens?  Some sense tells me that this isn't God.  I feel as though I'm marching along the footprints of myself, but only now can I see those fresh footprints. </p><p>I look at Hunter and I feel like he is the one who is acting the role of God.  I peer at Huck, who is collapsed on the couch.  He says exactly what I think and feel.  The connection that he and I share is now established.  These ideas are so far fetched, yet we have them at the same time.  We meet underneath the coffee table.  We have both touched on a new reality we know to be the true reality.  We are a figment of a fat man's imagination.  His dreams.</p><p>Suddenly Sindy is peering down at us.  She hears what we are saying and claims to have been exactly where we are when we was in her gust.  She begins to pry into our isolated world underneath the table.  We both somehow get the words out and tell her that we are sorry, but she cannot be a part of this.  We are on a different world than her.  Tom and I compare her to the Agents in a particular segment of the movie the Animatrix.  When a runner is about to break free from the Matrix by breaking his own world record, and the Agents take the form of the other runners and stretch out their arms to grasp him and pull him back to the Matrix.  This is what Sindy is to us.  She is an Agent to us, sent by the outside world, to pull us back into the boring reality we all call 'life'.</p><p>I have no visual hallucinations on Salvia, ever.  No growing vividness of colors nor a distortion or twisting of objects and patterns around me.  Instead, tonight it feels as though I no longer see with my eyes, but instead with my mind.  The placement of everything is precise, and though I can 'see', it's not through my eyes.  Some exterior (possibly interior I do not know) sense is telling me what is around me without sight, and the image is so vivid that my mind portrays everything around me exactly as it truly is.</p><p>Travis finally comes back into the room.  We forgot that he had left.  Apparently moments into his hit, everything became 'too crazy', at which point he said to everyone 'I GOTTA GET OUTTA HERE!'.  Tragically, this meant that we were not able to bounce our ideas off of him during our gust.  Once Tom and I come back to grip reality as we know it, we decide to take a walk around our old high school in the bitter cold.  We refined every concept and idea that we can remember, though we both know that we likely have already forgotten the deepest parts of our trip.  And though we only drew the connections of our multiple realities to the ideas behind the movie The Matrix after the fact, we will never be able to watch that movie the same way again.</p><p>I have not tried Salvia since this experience, mostly due to the fact that my roommates both have had to move out.  I believe we also are still in the midst of a mental break from the profoundness of our experience.  My friends all now regard me as the 'salvia guru' because of the constant research I do and the profoundness of my trips.  Who knows what distant worlds I'll reach next time?</p>",
 "year": "2006",
 "id": "58061",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-16T08:00:00.000Z",
 "views": "2859",
 "dose": {}
}
