{
 "title": "Adventures",
 "author": "ClapOnCannabis",
 "citation": " ClapOnCannabis. \"Adventures: experience with Seroquel & Various (ID 58107)\". Erowid.org. May 10, 2008. erowid.org/exp/58107",
 "substance": "Seroquel & Various",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Pharms - Quetiapine",
   "",
   " repeated",
   "",
   "Various"
  ]
 ],
 "report": "<p>I was prescribed seroquel for various reasons, but it only really worked as a sleep aid for me. Well, besides the sedation. The feeling is somewhat reminiscent of a benzo sedation. The first night I took 200mg and I woke up the next morning in my brothers room with the tv still on, and my friend was still sleeping in the living room. I didnt remember anything leading up to me watching cartoons in my brothers room while he slept on a sofa, as he sometimes does.</p><p>At school, I had the option to buy some methylphenidate (Concerta) pills as I sometimes do, since I find it to correct all my problems in school. That morning, I had taken a 100mg Seroquel at my house and soon after, when I got to school, I purchased and took the two methylphenidate (Concerta) pills, a total of 72mgs, and proceeded to make an anti drug clip for our film class. All the work had been done when I was out of school, and I was just told what to do throughout it. I was chill from the seroquel, but very stimulated from the concerta. I encounted no problems from the mix.</p><p>I drank twice on seroquel. The first times I had no problems at all. It was a 32 oz. of Olde English. I drank it and walked to the bus, feeling drunk before everyone else. We rode the bus downtown and soon after my buzz wore off. No problems whatsoever. The other time though, I drank about 4 beers, with a few shots of vodka poured in, and basicly ended up peeing on my friends kitchen counter. My bad man. Don't remember it. Not doing that anymore.</p><p>I've also been smoking marijuana throughout this time, and it sometimes produces anxiety for me. I've gotten accustomed to it a little though.</p><p>Overall I would like to stop taking seroquel completely except for knocking me out every night.</p>",
 "year": "2006",
 "id": "58107",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-05-10T07:00:00.000Z",
 "views": "8126",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": ""
  }
 ]
}
