{
 "id": 5810,
 "title": "The Meaning of Life and Suicide",
 "date": {
  "submission": "2007-06-24T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.5 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "Having not done mushrooms in a little while a few of my friends and I decided that another trip was due.  The original list of trippers was quite large, but dwindled after many people had second thoughts.  That left six people with ounce of mushrooms.  I had planned on taking only an eighth of an ounce but I let the moment get to me and ate roughly another gram.",
  "After meditating in a big circle to direct our trip for a while I went upstairs to chat with my other non tripping friends.  T+30 I felt the mushrooms starting to kick in and the excitement began.  Every time I do mushrooms I become very flushed and this time was no exception, however I was becoming hot faster than normal.",
  "Soon my friends kitchen began melting in a fashion.  The surface of the cabinets began sliding down and mixing with the floor which was quite insane.  By now I was very happy and just couldn't stop talking (which is unusual because usually I am quiet).",
  "The sun gradually set and we were going to go wander the open areas surrounding our houses.  Before we left the house I picked up a blue plastic piece of something that I called the 'thing'.  I can't quite describe it any other way than love.  I was in love with this blue plastic thing.  It would bend and change in my hand and I loved squeezing and chewing on it.  Sanity as I exclaimed to one of my friends, had checked out.",
  "Once I stepped outside I noticed that the lights were bright and beautiful as usual.  The overcastted sky changed and rolled with colors.  And shadows would dance in my peripheral.  I was very very euphoric by now and my ego was sent through the roof.  I felt as if there was no one cooler than myself and my other tripping buddies. ",
  "Upon arriving at the park it began raining.  Feeling cold and wet I had this strange urge to break into some random persons house just to talk and chill.  I tried to convince my friends that this was a great idea but was disappointed when they called me a fucking lunatic.  So we began walking back to my friends house and became split up.  By now sanity had completely checked out and I was speaking to myself, hearing and seeing things that just were not there.",
  "When I arrived at the house I found one of my friends holding a very disturbing picture that he had drawn of someone getting shot.  He was bleeding and speaking nonsense.  Supposedly he had attacked one of my sober friends in an attempt to grab his knife.",
  "I became very frightened and left.   ",
  "I began to feel sick as I left, and things were very fucked up to say the least.  I was in a familiar neighborhood however I was very lost.  I had the worst stomach cramp of my life and I felt lost and hopeless.  I was completely emotionally driven there was no logic behind my thoughts.  And they flew through my head at the speed of light.  Everything around me was shifting and changing and I was seeing the world through a kaleidoscope. ",
  "When I closed my eyes I was the universe and the dawn of life.  I understood the meaning of life.  I knew it all.  There was no reason to live.  I wanted to end everything, just shoot myself and stop life because I realized that there ultimately was no point.  Luckily I had no means of killing myself because I am 100% sure that I would have. ",
  "After I somehow found the way back to my friends house everyone was relieved to see me because I had been missing for the last hour or so.  My stomach pain subsided a little after I puked my brains out.",
  "I was lucky that night, I came out of it suicidal but for the most part ok, which is more than I can say for one of my other friends.  (He drove away, hit two cars broke into a house started a fight got the cops called on him, bit an officer and was finally subdued by six cops).  I remember the meaning of life and am happy to have found it.  But I still don't know if it was worth it.  My ego shot up like a rocket and crashed down even harder.  I found the meaning of life and now I know what it is like to want to end my life.  I also saw stuff that only insanity can create."
 ],
 "erowid": {
  "id": "35755",
  "citation": " Anonymous. \"The Meaning of Life and Suicide: experience with Mushrooms (ID 35755)\". Erowid.org. Jun 24, 2007. erowid.org/exp/35755",
  "substance": "Mushrooms",
  "views": "2962"
 }
}
