{
 "title": "It Came to Me in a Dream",
 "author": "CopperBite",
 "citation": " CopperBite. \"It Came to Me in a Dream: experience with Codeine with Acetaminophen & Dreams (ID 58106)\". Erowid.org. Mar 25, 2008. erowid.org/exp/58106",
 "substance": "Codeine with Acetaminophen & Dreams",
 "bodyweight": "175 lb",
 "report": "<p>I had a dream last night the kind where you know you dwell sober, alive, but maybe not so well within. I'd taken 4 solid doses of Tylenol 3's for about 4-5 days before falling asleep last night and I awoke with astonishment when I realised that my dream so vivid, so concious, yet above the power of my own being.</p><p>I was alive and well in my dream where I was running down a long black alley-way, the kind you can see in dark comics, yet there was no buildings on either side of me. As I ran several people joined me, all seemed to be, no in fact were in anguish. I could not put my finger on it within my dream, however when one of my companions in the alley of running was speared by something I remember vividly conciously (or seemingly so) looking up and seeing large treelike apperitions, colorful and so alive raining down from the black void I was under, killing one and leaving the remainder to continue running.</p><p>I then caught a glimpse of a light, a soft yellow glow, I entered it was a room filled with warmth and love there were two beds, opposite of ends to each other, on one my grandma sat on the other I looked but did not stay in the room, I simply touched the bed as to feel it's comfort and left again into the dark void, there I seen again the people running but this time it was almost like large rocks or boulders coming from the darkness and fire where people sat and looked with pain and sorrow. One individual, nameless, gray, cold, and did look at me and I awoke. So frickin worried as to what this could mean. Or rather I spose, What this could be.</p>",
 "year": "2006",
 "id": "58106",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-25T07:00:00.000Z",
 "views": "4026",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 tablets",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(daily)"
  }
 }
}
