{
 "id": 5814,
 "title": "Easy & Euphoric",
 "date": {
  "submission": "2004-08-09T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "psychopharmacologist",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(leaves)"
  }
 ],
 "report": [
  "Material:  6 grams of 'Kratom Premium Powdered Leaf' as called by the vendor. This is supposed to a potent form of the plant, also called 'super kratom'.",
  "Subject: 160 lbs. male.  Recent drug history: 2 beers were consumed about 2 hours prior to kratom consumption. Otherwise, no drug use on this day with the exception of a strong cup of coffee in the morning (12 hours earlier).  Last meal was 4 hours before kratom consumption.  Subject is a near-daily marijuana user, is a light/moderate drinker, a non-tobacco smoker, and daily, moderate coffee user in the mornings.",
  "Method:  About 6 grams of kratom were mixed with 6 ounces of tap water, mixed well with a fork, and drunk.  No heating or filtering were involved.  This form of kratom was stated by the vendor to be intended for those individuals who found the extraction process tedious, so all that is required is mixing with a liquid and drinking.  The cup was filled with water again, and this was drunk to ensure no residual kratom was left on the sides of the cup.",
  "Effect:  After 20 minutes, I began to feel a stong, opiate-like effect.  Very similar to Vikodin or Percacetts, however, less sedating. About 1.5 hours after kratom consumption, skin was itchy, as symptom common to opioid drugs.  This was bearable.  For a short period, perhaps 10 minutes, I felt a little upset to the stomach, 'queezy.'  Again, this is expected of an opioid, and was bearable and transient in this case.",
  "Duration:strong effects for 2 hours, with tapering off for another 2 hours",
  "Comment: This was my third and most pleasant kratom experience.  It was a higher dose than the previous two experiments.  I was in no pain, but I sensed it would be an excellent analgesic.  The active ingredient, mitragynine, has been shown to have analgesic properties comparable to morphine in nonhuman animal models.  I would consider keeping it on hand for those times when a pain killer would be helpful, but a trip to the doctor and prescription would be a burden.  The experience was extremely pleasant and euphoric. However, this herb definitely has abuse potential, like other opioid analgesics, and is to be respected and used with moderation and caution (e.g., dangerous to mix with alcohol)."
 ],
 "erowid": {
  "id": "35770",
  "citation": " psychopharmacologist. \"Easy & Euphoric: experience with Kratom (ID 35770)\". Erowid.org. Aug 9, 2004. erowid.org/exp/35770",
  "substance": "Kratom",
  "views": "160181"
 }
}
