{
 "title": "Happy and Uncoordinated",
 "author": "Rocket",
 "citation": " Rocket. \"Happy and Uncoordinated: experience with Mushrooms - P. cubensis (ID 58150)\". Erowid.org. Sep 8, 2009. erowid.org/exp/58150",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "report": "<p>My first shroom experience:</p><p>Alone at home with a friend who had also never tripped (although we partook in other non-psychedelic drugs occasionally).</p><p>Expectations: I was nervous because I had no idea how potent the batch of dry Cubensis were and while I did do extensive research on what I was about ingest, I knew reading and actual experience were seldom similar. My friend was excited, as he always is about everything in life, and had he not been there, I would likely have delayed the trip until I felt ready. 6g of cracker dry mushrooms were put through a food processor. The output was divided into two 3g piles (measured) and each was mixed into a cup of water.</p><p>Tasted like the smell of fresh Agaricus Bitorquis mushrooms. Not so unpleasant, and I was confused as to how people can hate the taste so much. Note: After my successive shroom experiences, I was starting to REALLY HATE the smell and taste and now try my best to mask it.</p><p>My friend's metabolism is faster than mine, because after only about 15 minutes he says he's starting to feel funny and minutes after that complains about stomach discomfort. I followed suit 10-15 minutes after him.</p><p>Began just by feeling WEIRD. It was subtle, and had I not ingested anything and concentrated on what I was feeling, I wouldn't have noticed it. Something was out of place, but I didn't know what. I felt like a weight was taken off my body maybe? or a little happier? More energetic?</p><p>At 30 minutes I sat on the toilet. I was quite amused with the visuals that I didn't pay much attention to my slight nausea. I first noticed it by staring at the door. It has a wooden texture, and what I focused on looked normal, but around what my focus was on, the texture looked like it was flowing down. Looking at it made it stop though. I played around with this for what seemed like 10 minutes (perhaps my sense of time was fucked though?) and then started staring at my palm. I saw a layer of patterns moving underneath my skin. I couldn't stop it and it wasn't intense, but it was definitely not placebo. The lines on my palm were wiggling around, moving back and forth and pulsating.</p><p>My bathroom was suddenly AMAZING. So many patterns everywhere. My shower curtain was pulsating and had the most beautiful colors I've ever seen. The light was as bright as the sun, and my walk-in closet sized bathroom felt vast and endless. Although a little nervous at what I'd witness, I got up and looked at the mirror. My pupils were dilated and my face looked like it was aging right before my eyes. I looked hilarious. My face was shiny and all my features were exaggerated.</p><p>I washed up and walked out of the bathroom, only to notice that my depth perception and coordination were off. I did not know how far to extend my arm to reach something for example, and while things looked very far away, it only took a step - if that - to get to them. The visual and physical effects aside, mentally I felt fantastic. I felt very clear minded and happy. It was subtle, but it was definitely not how I normally felt. I was VERY talkative and couldn't wipe the smile off my face. I was positive about everything in my life and felt like nothing could ever go wrong, or that if it did, it wasn't the end of the world.</p><p>One thing I want to note: After about 3-4 hours passed, I felt like I was completely sober. I knew I wasn't because I was VERY happy and cheerful, but physically I felt normal.</p><p>I felt extremely emphatic and connected to every living being on Earth. I was eager to go outside but my friend refused claiming it's too cold. This annoyed me greatly, because we were in the basement, and I wanted to see a plant or an animal. I quickly got over it though. Him and I are pretty close friends, usually sharing everything together even when we're sober. We have a weird relationship though. I feel like he is more of a brother than a friend. One thing that was annoying during the 'shroom trip was that we were both trying to talk over each other. Following my experienced friend's advice, I decided we should roll some Tobacco.</p><p>I was shocked at how uncoordinated I was when I was trying to roll the Tobacco. My fingers looked huge compared to the paper, and I kept dropping Tobacco all over the place. It took me what seemed like forever but a alas, what barely resembled a hand-rolled cigarette was smokable, and smoking was very pleasant. I don't normally smoke, but I like a supply in the house.</p><p>I won't go into detail but I had a zillion epiphanies that night, as well as a few interesting visuals I didn't mention (clock melting off the wall, etc). I did not keep track of time but the come-down happened after approximately 6 hours. It was gradual but I quickly recognized reality when I reached it, and boy, was it unpleasant. Colors were dull, things irritated me, I was bored and uninterested. Pretty much back to how I normally was.</p><p>After that night I concluded that 'shrooms were something everybody should experience. One thing I didn't realize until later trips however, is that they are VERY powerful and not every trip is a good one. Set, setting, expectations, physical discomfort and a number of other things have a very significant impact on the experience I will have. A sitter is almost always a good idea. If not physically available, at least s/he should be reachable by phone. This did not occur to me on my first experience but during a bad trip (even on the same dose) I feel confused and really need something to bring me back to reality. Usually I do not know what is real and what isn't.</p>",
 "year": "2006",
 "id": "58150",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-09-08T07:00:00.000Z",
 "views": "2488",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ]
}
