{
 "title": "The Abort",
 "author": "Andy",
 "citation": " Andy. \"The Abort: experience with 4-AcO-DMT & Risperidone (ID 58167)\". Erowid.org. Dec 25, 2006. erowid.org/exp/58167",
 "substance": "4-AcO-DMT & Risperidone",
 "bodyweight": "130 lb",
 "report": "<p>I ordered 1 gram of 4-AcO-DMT off of the internet. I had taken it 3 or 4 times before this experience (over the course of 3 weeks or so). It was a Friday and me and my friend Matt decided to take a 20mg trip. 16 was the highest we had gone before this time.</p><p>I had a supportive set and setting and was ready to go. I weighed out Matts dose first, he dissolved it in a cup of water and drank it down. Then I weighed my dose out. The scale displayed .020g. I decided to weigh it again just to be sure, and it weighed less than it did the first time. I think maybe I forgot to recalibrate? Eight way I put enough on so it was back up to 20mg... I thought it looked big but against my better judgment I mixed and drank it anyway...</p><p>Within 5 minutes I noticed the first signs that it was kicking in. It seemed stronger than I my previous times but I attributed that to the higher dose. At about 10 minutes after ingestion I laid down on my floor. I was tripping balls. I don't have a very good recollection of what happened here, but I know I saw some crazy things. It looked like a trip I might see in a movie. Matt didn't seem to be as floored as I was, and it worried me a little bit.</p><p>After laying there for another good 10 minutes or so with my head laying face down in my folded arms, eyes closed. I heard music begin to play and it seemed so incredibly beautiful. After a few minutes of listening to it I turned around and matt was sitting there playing it. I was shocked, I was sure that it was being played on my computer.</p><p>Around this time I blacked out on the floor. When I came back to (best guess 30 minutes later) I was curled in a ball against my book case. I woke up confused and didn't remember I had taken  anything at all. I kept asking matt 'what did we do? what happened to me?'.. He was tripping pretty hard himself and wasnt giving me any answers that would help me out.</p><p>I started thinking about what might have happened to me. I came to the conclusion that I must have fallen and hit my head on the book case, and it damaged my brain. After I realized this I put my hand on my head and I could feel the wound. I could feel the blood soaked into my (long) hair.</p><p>At this point my friend Jordan comes by, I had invited him earlier but forgot. Jordan has a good head on his shoulders. He doesn't do drugs of any kind but he doesn't mind those who do. I asked Jordan if my head looked okay. He said you look fine. This confused me. How could I be okay? I don't feel normal!! I assumed I must have had a stroke.</p><p>After I confided in my friends that I think I had a stroke, they told me that I didn't. Jordan explained that I took 4-AcO-DMT. And although that sounded familiar, I didn't quite grasp what it was. Eventually he got the idea to pull up a website to refresh my memory. I remembered that I had some risperidone, which is a HT2a antagonist. I'm not sure how I had the clarity of mind to remember that, but its a good thing I did. I told Jordan to get my some, I took 1mg and within 20 minutes I was basically sober.</p><p>I learned a lot from this trip, although it was very scary at times. I'm not the best writer in the world but I wanted other people to gain some insights from it as well.</p>",
 "year": "2006",
 "id": "58167",
 "gender": "Male",
 "timestamp": "2006-12-25T08:00:00.000Z",
 "views": "14513",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "4-AcO-DMT",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Pharms - Risperidone",
   "form": "(pill / tablet)"
  }
 ]
}
