{
 "title": "The Word King",
 "author": "Moldy Flesh",
 "citation": " Moldy Flesh. \"The Word King: experience with Salvia divinorum (10x extract) (ID 58181)\". Erowid.org. Sep 19, 2009. erowid.org/exp/58181",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "130 lb",
 "report": "<p>I bought the salvia extract from a smoke, through a friends' parent whom I lived with. My friend and I had never tried it and read on the package that it was an 'intense 10 minute mushroom high.' We took it home and prepared a pop can to smoke out of, so we didn't get the resin in our pipes. Not knowing what to expect we didn't prepare for anything like what was about to happen. We went onto the back porch to avoid 'tripping' around my friend's 3 younger siblings. After loading 1/2 gram onto the can we began to smoke it as quickly as we could, taking a fast, full hit then passing it between us.</p><p>It kicked in fast for me. While we were still smoking, the can was passed to me as I began to trip. I stood up and threw the can as hard as I could at the wall of the neighbors house. I then stood up and looked around. The scene of alice at the tea party slowly faded over reality until I was entirely in the tea party. I began drinking tea that the mad hatter handed to me. I turned around and saw the door that talks (from alice in wonderland) in the place of the back door that was there. The door yawned as it opened to a pitch black room. quickly a cartoon type white lightning bolt streaked across the room a few feet above my head. An 'electric ghost' leaned out of the bolt and grabbed me into it. For what seemed like 30 seconds I was zipping around at light speed in the bolt of lightning.</p><p>Eventually I was grabbed out of the bolt by a fat yellow cartoon character wearing a globetrotters uniform. He began dribbling my head like a basket ball and running along side the lightning bolt. The black background began to flash like a strobe light.</p><p>After the bolt disappeared, the fat yellow guy threw me into a completely vertical, square puddle of water. The splash sent me back to reality, at least for a minute. While back in reality, I saw that I was standing in my friends room with him, which is the room farthest back in the house, both of us bent over and laughing so hard we were silent. We were drooling and couldn't talk to each other.</p><p>Then I felt a smack on the back of my head. When I turned around I saw what looked like an animated version of the burger king king with blonde long hair and a jewel encrusted sceptor with a 'W' on top. For some reason I knew his name-'the word king'. Without hesitating he reached into my mouth and pulled out the words: the, sleep, to, and walk. The words he 'pulled out of my mouth' I could actually see, they were black and as tall as my mouth.</p><p>After he pulled the words out he waved his sceptor at me which seemed to mean 'goodbye'. I began falling backwards and when I hit the ground I 'woke up' like from a dream. I was standing in the kitchen talking to my girlfriend and all of my friends' siblings were standing around me yelling all sorts of 'what just happened to you?' questions. Ignoring them I walked to my friends' moms' room and tried to ask her what the hell just happened to me. strangely, although I felt fairly normal, every word the word king took from my mouth I couldn't say! This was so strange to me. I tried and tried to say the words, struggling just to say simple sentences. My friends mom suggested I change my clothes and try to be calm for a while. Suddenly I felt cold and I was soaked, completely soaked, with sweat from head to toe. I walked to one of the kids' room and took off all my clothes but my boxers and passed out almost as soon as I layed down on the top bunk of the bunk bed.</p><p>When I woke up my girlfriend was sitting next to me on the bed. I asked what happened, slowly realizing I had all of my words back, and she said, 'You ran inside and your eyes were wide open. You then ran all around the island in the kitchen, jumping through invisible hoops. You stopped and said a random string of words and ran into this room, stopped, and ran out. You ran to (my friend's) room and slammed the door shut. About a minute later you ran into the kid's living room and yelled random sounds at them. Then I called you to me, and you did the same thing at me.' I asked her how long all of this lasted and she replied, '9 minutes, then you came in here and passed out for about 4 hours.'</p><p>That was an insane first time. During most of my trips since then I have managed to have my words taken away by the word king, and my friend described the same type of incidents with the word king before I had mentioned anything to him about the word king. I find that strange.</p>",
 "year": "2006",
 "id": "58181",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-09-19T07:00:00.000Z",
 "views": "1859",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "250 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
