{
 "title": "Reexamination of C3's",
 "author": "DextroBob",
 "citation": " DextroBob. \"Reexamination of C3's: experience with DXM with CPM (ID 58187)\". Erowid.org. Jun 14, 2009. erowid.org/exp/58187",
 "substance": "DXM with CPM",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "DXM"
  ]
 ],
 "footer": [
  [
   "2006",
   "58187",
   "Male",
   "",
   "Not Given",
   "Jun 14, 2009",
   "10301",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]  </p><p>I'd read from almost every site, including Dextroverse and William White that the cough preparation Coricidin Cough and Cold was the absolute least recommended source for Dexxing. Let me start by saying that after having even found discouragement from the likes of Wikipedia.com, I stand corrected. However, I have been a Dextromethorphan guru in my area for almost three years now, and Coricidin is the only thing I've ever maintained a good DXM trip equilibrium. Note also that I am quite a big fella (243 lbs.).</p><p>However, and I do emphasize this, there are ALWAYS loop-holes, even in science. I'm not trying to classify myself above the experts or even modern pharmacology, but C3's are, simply put, an experience completely separate from Robitussin, Zicam, Delsym, or even Robitussin Liquigels. The body high, mixed with the psychedelic intensity has also stronger effects, and a longer trip duration. Not to mention the afterglow (NOT HANGOVER) the morning after is pure heaven. I once did two packages of C3's and had an epiphany that lasted for two straight weeks. The world around me, concepts, imagery, people, communication became vivid and controversial. I felt like I had just been born. Good DXM afterglow is like that, guys. And the higher you go in dosage--with all due respect to gaining proper eperience and 'know your body...'--the more beautiful a DXM trip can be.</p><p>My first trip with Coricidin was one complete package (16 30mg skittles), and the headrush was quite overpowering. I begin to notice that everything's different, then I feel the urge to vomit--some can hold it in, I prefer to go ahead--and WHAM! La-La Land, HERE I COME! The whole trip is usually lasts anywhere from 8-12 hours. </p><p>I suppose what I'm saying is that Coricidin IS horrible on your liver over prolonged exposure with that CPM, and some underweight trippers just can't have a good trip on it. But as for me, I swear by it. That and Zicam, but the robo-itch can become quite a bloody nuisance.</p>"
}
