{
 "id": 5821,
 "title": "Major Repairs",
 "date": {
  "submission": "2005-04-25T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Estilingue",
  "gender": "Male",
  "weight": 58
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "15",
    "grams": 0.015
   },
   "administration": "oral",
   "substance": "2C-I",
   "form": "liquid"
  }
 ],
 "report": [
  "100 mgs of 2C-I was dissolved in 500 drops of 96% ethanol, giving 1 mg of 2C-I per 5 drops.",
  "At 8 pm L & I ingested 15 mgs 2C-I (75 drops) in a small glass of water.",
  "L: Female, 31 years old, 60 kg. Me: Male, 30 years, 58 kg.",
  "Setting: Her apartment, huge comfy couch. Lots of music within reach and a bottle of red wine and sparkling water.",
  "T.00:30 First alert. Energetic and anxious feeling with tension in the chest, cold hands and feet and deeper breathing than usual. No nausea. Sitting still was difficult. Where would this energy take us?",
  "T.01:00 The tension mellowed out over the course of an hour, when true psychedelic awareness began to take over. Generally positive and relaxed, never threatening.",
  "T.02:00 Breathing walls, pronounced tracers and the light in the room was dimming and getting brighter continuously, as if the lamp was swinging. A vibrating halo seemed to surround Ls face and body. Colours were brighter than usual; the African mask in Ls bathroom suddenly appeared to have cubist characteristics. L. reported exactly the same visuals, including a halo around my face.",
  "During the whole trip, which lasted about 7 hours, we almost did not move from the couch. Talking was easy, conceptual thinking and fantasy made listening more difficult. Physically, it took quite some effort to perform simple tasks, such as reaching for the glass of beautifully red wine on the table. Getting up to put a new CD in the player seemed undoable at first, but once we got up from the couch it was not that bad. No low blood pressure dizziness as with mushrooms. Choosing between all those colourful CD covers was more difficult. Physical control was there. Still, we could not understand as to how people could consider 2C-I to be a worthwhile dance or club drug. We were glad to be able to crash in our couch and not to have to deal with people in different mind states. Dancing was out of the question, but it felt very good to talk. Talk about our troubles, hopes and fears.",
  "It was at about T.03.00 that L. said she needed to talk about something she had not told me before. The day before ingesting the 2C-I, L. had asked me if the 2C-I would fuck with her mind, as she was feeling slightly depressed and stressed because her ex-boyfriend was seeing someone else and had made his new girlfriend pregnant. I told her that it definitely could worsen her depressive mood but that we could talk things through if she needed to. She decided she would give it a try.",
  "So, three hours after ingesting the material, fully peaking, L. told me that the reason for her feeling stressed and depressed had not so much to do with the fact that her ex was seeing someone else but rather with his new girlfriend being pregnant. L. started crying and then told me that she had aborted a child from the same man about half a year ago. As soon as she noticed that she was pregnant, she figured that their relationship was not stable and rewarding enough to have a child with him, had an abortion and shortly thereafter broke up. L. is the kind of girl that makes the biggest decisions based on her gut feel. She said that she had not considered how she might feel afterwards and had never shared her true feelings about it, convincing herself that she did the best thing. On 2C-I, she could not keep her feelings to herself anymore. Ever since she had this abortion, she told me, she had this fear deep inside her that she made the wrong decision. That she might have loved the child more than anything else on earth, but that she had it cut away together with a piece of herself and that she would never be able to get it back.",
  "I felt very sorry to see how breakable this woman, who always seemed to me to have a very strong character, actually was. How lonely she felt and how desperately she hoped for having done the right thing. It broke my heart and I had a hard time trying to keep the tears from coming to my eyes.",
  "We talked about this issue for the remaining 3 to 4 hours of the trip, which was quite exhausting emotionally for both of us. At 3 am, when we went to bed, L. said that she felt very relieved to have finally let it all out. As sleeping appeared to be difficult, we both ingested 3 mgs bromazepam.",
  "The next day L. & I felt very relaxed and balanced mentally and quite tired physically. When I met L. again a few weeks later she said that the 2C-I trip had helped her enormously in coming to terms with herself. Her fears and depression had disappeared, although she was still very unhappy with the decision she had had to make. She described the 2C-I experience as having gone through some major repairs.",
  "-----------",
  "As a side note it might be of interest to mention that during 3 days after the 2C-I experience my nicotine dependence was virtually non-existent. I am a heavy user of the Swedish kind of tobacco for oral use (snus) for about 6 years now, having been a cigarette smoker for 10 years before turning to the less harmful snus. Although I did not quit my habit as I did not anticipate this effect from 2C-I, it might be worthwhile to investigate the next time. Whether this could be attributed to the pharmacology of 2C-I alone I do not know, as we had talked extensively about what a ridiculous addiction nicotine dependence actually is during our trip on 2C-I. It might have been a subconscious result of this discussion."
 ],
 "erowid": {
  "id": "35798",
  "citation": " Estilingue. \"Major Repairs: experience with 2C-I (ID 35798)\". Erowid.org. Apr 25, 2005. erowid.org/exp/35798",
  "substance": "2C-I",
  "views": "6787"
 }
}
