{
 "id": 5822,
 "title": "Oh My God?",
 "date": {
  "submission": "2004-12-20T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "xDoSeDx",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 leaves",
   "administration": "oral",
   "substance": "Belladonna",
   "form": "(fresh)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Belladonna",
   "form": "(tea)"
  }
 ],
 "report": [
  "Let me start off by saying I used to trip acid as often as I could. Every summer my friend (same as in this story) would pick pounds of mushrooms and sell 'em like hotcakes, all while eating 20-30 caps a day and loving it. Neither of us had ever tried belladonna before, and my friend knew where a couple grew.. so on to the story...",
  "My friend R took off one night around 2:30-3am and picked handfulls of the plant in someone's yard. We went home and washed them, chopped about 10 leaves up and covered a frozen pizza with it, and split the pizza. It tasted pretty good, so we took the rest and made tea. R was rather enjoying his drinks while I occasionally took a swallow.",
  "I don't remember exactly what all we did, or when it kicked in good, but about 7:30-8am (only guessing by time passed between then and seeing a clock at the hospital) I remember talking to several cops, and a couple paramedics, confused as hell as I had no idea what I did before or when they drove up.. they were just, there. I glanced over and saw R in handcuffs just as confused as me. I was still seeing wicked tracers and people's faces were all switched around, missing eyes, holes through their head.. I was talking to who I thought was a detective but the paramedic walked up and asked what I was saying and who I was talking to.. I look back at him and he wasn't there, he never was. They put R on a stretcher and in restraints, they had me sit with him for the ride. The whole way there I thought I saw the paramedics pull knives out and start cutting away at R. I sat there too stunned to even talk, I still don't know what exactly happened.",
  "The next thing I remember is the hospital.. a nurse pulling my shirt off and sticking me full of IVs, two piss tests later and a blood test, they keep me in solitary with a bunch of needles and a life sign moniter on (those stupid clips hurt). Apparently it took R hours there to even remember who he was, much less his name. I pulled the IVs out and started raising hell untill they let me call someone to come pick me up. From what I hear R was released a few hours later, still having mild psych problems (I don't know for sure though.. haven't seen him yet). Myself, it's been 24 hours since I left the hospital, my eyesight is still shot, I can't even read the computer moniter without glasses. Just 15 minutes ago I was outside smoking a cigarette and I saw a man in a black trench coat walk through my backyard. I pull a double take and there wasn't a damn thing there. The feeling of someone grabbing my shoulder has lessened but it still happens occasionally.",
  "I heard when we were picked up, R was found skipping through the parking lot barefoot chasing butterflies (?) I can't imagine what kind of hell he went through, and I'm glad I don't remember much of the trip. It does things to you that even LSD couldn't touch on. It's not fun, it's not a blast, and it's not a game. I believe we should both be dead, and I consider us extremely lucky. I can't recommend it to anyone, unless your trying to screw yourself over, don't try it."
 ],
 "erowid": {
  "id": "35803",
  "citation": " xDoSeDx. \"Oh My God?: experience with Belladonna (ID 35803)\". Erowid.org. Dec 20, 2004. erowid.org/exp/35803",
  "substance": "Belladonna",
  "views": "24388"
 }
}
