{
 "title": "Figuring Out the Life of a Rug",
 "author": "garry",
 "citation": " garry. \"Figuring Out the Life of a Rug: experience with Mushrooms (ID 58245)\". Erowid.org. Mar 17, 2010. erowid.org/exp/58245",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "2 g",
  "oral",
  "Mushrooms",
  "(tea)"
 ],
 "report": "<p>This was my second time trying shrooms. we chopped up the shrooms and made tea (mint tea, it was very good). the effects came on pretty quick, within 10 mins. we had the lights off, other than a tower with two black and one blue light. we had some Omm, DJ Shadow, and Infected Mushrooms playing (great music for trips by the way). I have trouble getting visuals so i closed my eyes. As a smooth womans voice sang on in the music I saw a beautiful naked woman spiraling upward in the middle of a DNA strand. As she kept spiraling, she slowly turned into my ex-girlfriend, which really freaked me out! My current girlfriend was sitting next to me and in my mind, I thought she knew what I was watching, I thought she was going to be pissed.</p><p>My mind kept telling me I should be back with the other girl. The song switched and the womans voice was gone, taking the naked girl with her. I sat on the couch staring at the rug and found myself wondering what is it like to live the life of a rugof this rug?. I slid myself down to the floor and laid flat on the rug staring at the ceiling. My friends tried to talk to me and I told them to leave me alone, and treat me as if I was the rug. Someone got up from the couch and walked around me to the kitchen. I harshly yelled at them you dont walk around the rug when you need to walk over it! Dont F***ing walk around me. F***ing walk on me! I am the rug! On the way back they walked on me. I was so happy to find out a little more about the life of a rug.</p><p>Then my friend wanted to screw with my mind and he said he thought my arm broke when he stepped on it. Before he finished his words, I felt my bones shifting as they broke apart. I looked to my arm and saw a bump as the bone pushed up on my skin. I sat there telling myself, you are tripping, your arm is not broken, your arm is fine, rugs dont even have arms, I dont have arms and therefore how could it be broken. I laid back and watched the ceiling fan move to the music. I then realized that all day, everyday, with no choice, the rug and the ceiling fan look at each other. I named the fan Garry and began to talk to Garry about his life as a fan. I asked what he thought about the rug and if he thought we were good people. Hours had gone by, by this point and I was beginning to come down. I got up and set up my hookah. I spent the rest of my trip laying on the rug smoking my hookah with my girlfriends friend. I felt so content and so bonded with this girl. I felt as if id known her forever and that we were best friends (which is funny cause I never used to like this girl). All in all, it was a great night.</p>",
 "year": "2006",
 "id": "58245",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-03-17T07:00:00.000Z",
 "views": "2591",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  }
 }
}
