{
 "title": "A World Made of Jelly",
 "author": "BigFresh",
 "citation": " BigFresh. \"A World Made of Jelly: experience with Diphenhydramine (ID 58278)\". Erowid.org. Jul 13, 2009. erowid.org/exp/58278",
 "substance": "Diphenhydramine",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "500 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   " T+ 0:25",
   "1 hit",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "report": "<p>I've been experimenting with just about any drug I can get my hands on for the last few weeks:  Lorazepam, Oxycodone, Hydrocodone, Propoxyphene.  I've been looking for a chemically induced good time, and I've found it with these drugs, but I have most desired to experiment with more hallucinogenic/psychedelic-type drugs.  The chief reason for this is that I've been in an odd funk lately, not depressed exactly, just off.  I feel like I could use a 'reboot' to my brain.  I realize this is potentially dangerous, but I take calculated risks and I am as safe as possible.</p><p>Although I've relentlessly hounded anyone I thought could provide me with a hookup for LSD, Mushrooms, or MDMA, I've been able to acquire any of these drugs.  The only available 'trip' drug has been OTC.  I have entertained the possibility of a DXM trip, but having read a great deal of negative reviews of this drug I've decided to put it off until I'm in a positive humor.  I stumbled upon Diphenhydramine.  I knew that I could get a pot-like, drowsy buzz from 50-75mg of the substance as I often take 2-3 pills when my mild allergies are bothering me.  Checking online I discovered reports of its recreational use and I had little anxiety due to my pleasant low-dose experience with the drug.  There's the set up, here's my experience of one week ago:</p><p>At 10:00pm I took 20 little pink pills. (At $3.87 for a bottle of 100 pills, Diphenhydramine is a cheap date.)  I took them with a large glass of cool water on a mostly empty stomach.  I had eaten roughly four hours earlier.  I had no work the next day and I was in a relatively positive mood, so I figured it was the right time to experiment.</p><p>10:15pm: No noticeable effects as of yet.  I am mildly anxious for the onset but expect to wait as long as an hour.</p><p>10:25pm: No noticeable mental effects yet, but my stomach becomes slightly sour.  I put a little cannabis shake into the bowl of my bong and take a medium size hit. </p><p>10:30pm: The marijuana has settled my stomach nicely and has not colored my mental state.  (I am a daily pot smoker and tolerant regardless.  One hit does little to me.)  I take a shower as is my normal routine after work.</p><p>10:40pm: I've taken a shower, brushed my teeth, and gotten dressed for a fun night out.  It is around this time when I start to feel the effects of the Diphenhydramine.  The closest description I have to the initial onset is that of drunkeness, not at all like the drowzy 'stoned' feeling I get at low doses.  As I walk around my house, I find it difficult to focus.  My gait is slow, steady and deliberate.  I'm not clumsy, but I have the feeling that I would be if I stopped concentrating.  It took a great deal of mental focus to walk straight. </p><p>10:55pm: After numerous text-messages as to where the hell I am, I realize it's time to head to the bar.  It is now that I make a stupid call and decide to drive the short distance to the bar.  It should be noted that I planned on calling for a ride regardless of how I felt, because I'm a responsible drug-user.  I should have arranged for this.  My judgment was clouded to a great degree.  Despite my intoxication, I was absolutely positive that driving could be done with no problem.  This is one effect I've never encountered in a drug before and I was quite unprepared for it.  Future adventures with this substance will involve an accounting for this effect.  I'm quite embarassed that I made this mistake.  I make it to the bar uneventfully, although I'm beginning to experience some acute auditory hallucinations.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>11:00pm: I enter the bar and see a friend, E, shooting pool.  E waves at me walks up to me and shakes my hand, making small talk.  When I start speaking to him, he disappears.  This is my first visual hallucination.  With every ounce of will, I internalize this and tell myself I just had an hallucination.  E is where I initially saw him, but has yet to note my arrival.  I walk up to him and he asks,'When did you get here?'  There's the proof I need that convinces me I am deeply under the influence of Diphenhydramine.</p><p>11:15:  I'm on guard for major hallucinations now, but walking is even more difficult as the ground seems to be like waves.  It's almost as if the wooden floor of the bar is painted on undulating water.  I make it to a bar stool.  My bartender asks what I want to drink and I ask for water, making her immediately suspicious as I am a fairly heavy drinker.  I sip my water for a bit and talk to various friends that come to greet me.  I find that while I'm talking to them, I'm able to 'shrug-off' the effects of the drug    and have lucid conversation.  As soon as I stop talking, though, I'm swimming in a liquid room.  Streamers of smoke from cigarettes (I don't smoke them, but most of my friends do) sitting in ashtrays are fascinating and form anthropomorphic shapes.  Not entire people, but body parts.  Mostly hands are what I see.  It isn't disturbing, just surprising.  I'm aware I'm hallucinating, but it's obviously happening. </p><p>12:15am (approx.): I move to a table where a group of friends I haven't spoken to yet are sitting.  My half-drunk glass of water I place on the table before me, for reasons unknown I lay the brown plastic straw on the rim of the glass.  I'm talking to the others, keeping more-or-less abreast of the conversation.  Conversation stops for a few moments.  The ends of the straw laying horizontal on the glass rim begin stretching into infinity.  One side flows outward like a jagged licorice-stick, the other side follows.  Then, the whole picture - the glass with the infinite straw upon it, begins to sway rhythmically within my vision toward infinite points on a semi-circle.  I describe it to my companions (now fully briefed on my drug intake) as reminiscent of the motion of the 'Viking Ship' ride at an amusement park.  I watch it for a while before I become slightly nauseous.  I focus on another person and speak to her to lose the hallucination and am successful.</p><p>12:45am: I continue with our conversation as the group is now very interested in my little trip.  They know me for an honest person and are surprised at how intense such an inexpensive OTC drug is.  I decide that the loud environment and all the attention is too much for me to handle at long last.  I feign a restroom break, knowing full well my friends wouldn't let me drive home in the condition I'm in, and head to my car and drive home.</p><p>1:30am: I'm in a curious state, still tripping quite hard, sitting in front of my computer listening to music.  I've finally answered the crop of text-messages that followed my clandestine departure from the bar.  I find this task surprisingly easy, just as talking is easy and focusing.  After satisfying everyone that I am indeed alive, I contemplate sleep.  I'm not drowsy, per se, but I'm utterly convinced that sleep will come easily.</p><p>2:00am (approx.): I fall asleep quickly into a slumber filled with vivid, shocking dreams. </p><p>3:00pm: I finally feel as though I can wake up and stay awake after roughly 13 hours of sleep.  I remain drowsy with a feeling of emotional detachment for the remainder of the day.  This after-effect lingers until early afternoon the next day.</p><p>In Conclusion:  Diphenhydramine is viable as a recreational drug for me provided I take better precautions to account for my poor judgment while on the drug.  Future experiences - which may or may not occur - will involve a lower dose and a sitter.  An overly 'busy' environment will be avoided as well.</p>",
 "year": "2006",
 "id": "58278",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-07-13T07:00:00.000Z",
 "views": "65829",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ]
}
