{
 "title": "Thank You for Choosing Salvia Airlines",
 "author": "Madtallica",
 "citation": " Madtallica. \"Thank You for Choosing Salvia Airlines: experience with Salvia divinorum (40x extract) (ID 58318)\". Erowid.org. Sep 18, 2009. erowid.org/exp/58318",
 "substance": "Salvia divinorum (40x extract)",
 "bodyweight": "200 lb",
 "header": [
  "DOSE:",
  "1 hit",
  "smoked",
  "Salvia divinorum",
  "(extract)"
 ],
 "report": "<p>After finding myself caught up in the legal system (possession, sucks balls) I realized that after going a month without smoking pot. I needed to dissociate myself from the real world - take a 'vacation' so to speak. These 'vacations' were quite frequent when I could smoke pot, but now that probation has come around I found that my 'vacations' were bound by a very short legal leash. I had heard about salvia from a couple of older friends, so naturally I researched it like crazy. looking up all the effects, durations, and availability, all of which seemed to fit my requirements like pieces of a puzzle.</p><p>Being very cautious with this foreign plant, I started with lower doses, starting with 5x and making my way up. While reading the package that the salvia came in I realized that there were different levels of potentcy. After trying the 5x I realized something - I didnt get crap from that 1/2 gram at all! 'What a waste of money!' I thought, so I stepped up to the 10x... nothing! 20x... still nothing!! I had almost given up hope for salvia until I heard of the legendary 40x. 'Ho-ly-shit,' I was thinking. 40 times potentcy huh... well if I was gonna trip, this was gonna do it.</p><p>The instructions on the box detailed how to have a 'good experience'. I noticed that it said to use just a pinch and that you could get easily 20-25 experiences per 1/2 gram. Past experiences told me to say fuck the directions and put about a good half sized bowl in there and smoke it like no tomorrow. Then again past experiences didnt involve 40x salvia. My friend (the sitter) noticed how much I had put in and asked if this was really a good idea. 'Too late this is more fun' I said as I sparked the bowl and began my journey.</p><p>I took the first hit, sucking in as much smoke as possible. After what seemed like an eternity of inhalation, I cleared the chamber and glanced at the bowl quickly. 'Oh crap' I thought. I just barely scratched the surface. I set a stop watch next to me to see how long I could hold my breath...</p><p>T : first hit</p><p>t+10 seconds : doing good feeling like all the other times.</p><p>T+45 seconds : staring at the tv watching it very slowly start to twitch like a clock going tick tock tick tock except up and down.</p><p>T+1 minute : finally exhale! Wow that took forever. Wait hold on somethings happening. It seems like the room gets at least 20 degrees warmer, but it feels cold. I start laughing uncontrollably and cant stop. I dont know what is so damn funny, but I was on the verge of pissing myself from laughing so hard. Suddenly I get the feeling like my mouth is wide open and all the words that are coming out of my mouth are very long and drawn out.</p><p>T+1 min 20 secs : I touch my face in doubt... this can't be happening. It feels like I dont have a bottom jaw! At first I freaked out, thinking that theres no way this could be happening. But after I realized this I remember my friends saying dont control it, just go with what it throws at you. Still though all this time Im just laughing like theres no tomorrow. The thought that comes to mind is that I probably look retarded cause my mouth is just hanging open and I get the feeling that Im drooling uncontrollably. I keep trying to close my mouth without use of my hands but find it impossible, much like someone put a board in my mouth and Im trying to bite through it but to no avail. I call my friend. I can only muster out what sounds like if a kid with down syndrome had a cell phone. Just moaning out words that sounds like 'kehhhhvaaaaaannnn' (my friends name is Kevin). Impossible to stand up or to stay still... kinda what happens like when I get an inner ear infection... or if I'm drunk.</p><p>T+2 mins : Im just blown away at the power of this drug. 'Holy fuck' I say, but for some reason they didnt notice. Did I actually say that or did I just think it really loud inside my head? Damn this is some good shit! The whole room is shaking kinda like if someone grabbed me by the shoulders and moved me back and forth very quickly and violently, and yet I wasnt moving at all. I managed to look over across the living room and suddenly I feel like Im in the floor. Its as if I was standing straight up in a hole that someone dug in my living room so that my nose was at carpet level, and then they filled it in so that it was level like at the beach. Then it started to feel like the carpet was a giant blanket and from the 3/4 buried-in-floor position I felt I was slowly laying back, pulling the carpet with me like a blanket on a bed. I realized I was slowly leaning my head back but had no idea I was doing so.</p><p>T+ 5 minutes : the world is rolling over itself and Im going with it. The floor resembles that of walking on jello yet when I put my foot on the floor, it seems to harden just before I touch it. I begin going into deep thoughts. Its as if my brain was at a conference in an office with other people talking about very important matters, all the while bright colors and the feeling of G-forces on my body are everywhere and none of the people in the meeting can see/feel them except for me.</p><p>T+ 10 minutes : a giant wave of relaxation hits me like a ton of sponges. I feel like I just snapped out of a daydream similar to the ones I had in school, when out of nowhere the teacher calls my name for the answer, but all I can reply with is... 'woah.'</p><p>T+ 15 minutes : a complete body high is all around me, the feeling of a plane landing and the flight attendant coming over the PA saying, 'We're now safely landing in Reality, Thank you for choosing Salvia Airlines and we hope you fly with us again!'</p><p>In short salvia is kinda like strapping my brain to a rocket, headed to nowhere, running on laughing gas, at a bajillion miles an hour, through time, ending up at the front door of my mind where I step through, only to reunite myself with my physical body in the current timestream of... now. I like it.</p>",
 "year": "2006",
 "id": "58318",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-09-18T07:00:00.000Z",
 "views": "2712",
 "dose": {}
}
