{
 "id": 5832,
 "title": "Hawaiian Oddness",
 "date": {
  "submission": "2007-12-27T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "MushroomCandy",
  "gender": "Female",
  "weight": "80 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>[Erowid Note: 10 grams of dried mushrooms is considered an extremely high dose, see Mushroom Dose Chart]",
  "I've been using drugs since the age of 16. I stopped a year later because my best friend's little sister died and I was afraid I was going to think about her while tripping. My best friend and I started off with meth en MDMA. Since both of our parents are drug addicts, it was extremely easy to get the stuff. Later on we tried coke and shrooms. To this day, I'm a daily marijuana smoker and I drink almost daily too.",
  "Anyway, it has been two years since I stopped doing drugs, but I felt the urge for some wonderful experiences. I stopped taking my anti-depressants 2 months before, because I knew that would interfere with any kind of drugs. I decided on shrooms, since it's natural, I liked that idea. I live in Holland and shrooms are easy to purchase here. I just went to Amsterdam (35 minutes from where I live) and bought Hawaian Shrooms, dried. Dried shrooms are actually illegal, even here, but they had them anyway. I went to a friend's home and we both had 10 grams of the rancid-tasting mushrooms. It was quite strange, but it was working almost immediatly. I felt a strange, tingling sensation in my mouth and then a euphoric feeling in my whole body.",
  "The trip kicked off. The visuals were absolutely amazing. It was like I was seeing everything in some kind of DNA-strings and they were everywhere. The whole house was moving and vibrating. It went dark in the room and the only colours in my visuals were purple, green and red. The psychological effects were stronger than I had ever experienced before. It was like a psychosis. We were lying on the floor screaming out 'What the FUCK!' all the time. That was because we suddenly both realised that everything mankind does and has done in the past, is completely USELESS. A whole bunch of bullshit. Our everyday lives were useless, it didn't matter anymore. The fact we had friends was strange. The fact we had a body was strange. Computers, and especially the internet, were evil. And smoking cigarettes was good.",
  "We went outside and I lay down on the grass. It was dark outside, we thought. Later, when the trip wore off, we saw it was still daylight. We tasted some flowers in the garden and then I called a good friend of mine. She was laughing and I know why because all I was saying was: 'I've got a BODY!'",
  "Machines are difficult to understand while on shrooms. The telephone was objecting, it was beeping. I played the 'And all that could have been' DVD by Nine Inch Nails (my fave band) and it was absolutely amazing. Everything sounded and looked better than normal. I just couldn't believe how amazing they were. Time was really strange too. I don't know for how long I've been screaming on the floor, it must have been three hours. The overall trip lasted for approximatly 6 hours. I never experienced anxiety during this trip, because I knew it would ware off in a while. Sometimes we looked at each other and we were like: what, in heavens name are we experiencing. And we still talk about it to this day on.",
  "The aftermath was quite mild. We just went to see some friends and smoked a few joints and drank some beer. I didn't feel exhausted, I was only hungry because we skipped dinner. I did feel a bit irritated towards my trip-partner, but that lasted only three days. I really needed to overthink what I had experienced, since it was so intense. This trip changed my view on the whole world. I already knew it was all fucked up and useless. But it's more clearly now and it has given me the strength to share these thoughts with other people.",
  "Next time, I'm not going to take the Hawaiians again. They are too powerful to be pleasant. I'll just take the Mexicans, just like two years ago.</p>"
 ],
 "erowid": {
  "id": "35855",
  "citation": " MushroomCandy. \"Hawaiian Oddness: experience with Mushrooms (ID 35855)\". Erowid.org. Dec 27, 2007. erowid.org/exp/35855",
  "substance": "Mushrooms",
  "views": "3430"
 }
}
