{
 "id": 5833,
 "title": "Waste of Money",
 "date": {
  "submission": "2010-09-08T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Ritual",
  "gender": "Male",
  "weight": "75 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Skullcap",
   "form": "(tea)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(extract)"
  }
 ],
 "report": [
  "I bought 25g blue/25g scullcap off a local website. I am not a smoker so I decided boil tea out of it instead. I started off with the recommended dosage which according to the bag was 5g, I had it stir for about 40 minutes in a big cup. I then drank the substance quite fast and on an empty stomache. After 60 minutes I felt absolutely nothing so I decided to wait another hour, and still nothing.",
  "The next day I decided to try a higher dosage - about 10-12g. It had the same result.. NOTHING. At this time I was becoming slightly dissapointed and decided to email the website about it. The reply was: 'you are probably very unsensitive to blue lotus. We have an extract which I will send to you for free. In the meanwhile, try putting what you have left of the lotus in a winebottle overnight, then filter the wine and drink it'. So I did. Which only resulted in a very bad tasting wine and STILL NO EFFECT.",
  "During a couple days I tried mixing scullcap with lotus, 5-10 times the recommended dosage and nothing ever happened. So when the extract finally came in the mail I thought, well finally I might get my moneys worth. Hell no. Nothing. Absolutely bloody no effect.",
  "So, from now on Ill save my money and buy alcohol instead, it does have effect and it's cheaper."
 ],
 "erowid": {
  "id": "35856",
  "citation": " Ritual. \"Waste of Money: experience with Blue Lotus, Skullcap & Alcohol (ID 35856)\". Erowid.org. Sep 8, 2010. erowid.org/exp/35856",
  "substance": "Blue Lotus, Skullcap & Alcohol",
  "views": "5161"
 }
}
