{
 "title": "The Milkshake",
 "author": "Tom Shroomer",
 "citation": " Tom Shroomer. \"The Milkshake: experience with Mushrooms - P. Cubensis (ID 58348)\". Erowid.org. May 19, 2008. erowid.org/exp/58348",
 "substance": "Mushrooms - P. Cubensis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "14 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "report": "</p>\n[Erowid Note: 14 grams of dried psilocybin mushrooms is considered an extremely high dose, see Mushroom Dose Chart]</p><p>I was very experienced with mushrooms and LSD or at least I thought I was. One year, I grew mushrooms from an easy grow kit I purchased. I had some knowledge of cultivation, so I was able to extend the growth cycle and probably increase my yield by about 6 times. Unfortunately my crops finally did succumb to contaminants. Well, one night, I was sitting at the computer browsing the web and watching TV while consuming beer. I had a 3-day weekend, so I decided that I would take a very strong trip.</p><p>I weighed out 14 grams of dried mushrooms and made a shake with ice cream, fruit and mushrooms in the blender. The shake covered up the taste a bit, but not a lot. I was able to suck the shake down in about 5 minutes though. I sat back and continued to watch TV almost forgetting that I had consumed so many mushrooms. After about a half hour, I suddenly realized that I was sitting in a large mall at a desk in a corridor that was sloping down into a lower entrance to the mall. Thats when I knew the mushrooms were kicking in. I (probably out loud) said, Wow.</p><p>Often when mushrooms first start kicking in, I find myself unable to keep my eyes open. So I went into the bedroom and laid down. I closed my eyes and fell into a world where I was no longer anything but an entity. I felt like I could go anywhere and understand everything. I was not sure if I would be able to get back to the real world or not, but that didnt worry me much. I had decided that I would completely give in to the experience and not be afraid. I traveled around in this world for a while (seemed like a lifetime), maybe 20 minutes. I then realized that the beer was making me have to pee, so I entered a kind of elevator and arrived back in my bedroom.</p><p>I thought I was coming down (yeah right), so I went into the living room and grabbed the TV remote. I had digital cable with all the bells and whistles, so my remote was very colorful and confusing with lots of buttons. It looked a lot like some weird alien technology and I could not read any of the buttons. It took me a while of fumbling with it to get the TV to come on. Once I turned it on, I dont know what I was watching, but it was about me. I changed the channel, and it was a story that somehow was a metaphor for my life. No matter what channel I viewed (and I had a lot of channels) the show was about me, directed at me, or was somehow a metaphor for my life. I found this very odd and laughed a bit about it. I knew that I had taken mushrooms and that this was not actually real. But unlike a dream that fades once you realize its not real, this persisted. I relaxed and watched some sitcom about me and then switched to the news about me. It was really strange. It was as if I was in a completely different world and I was the center of attention.</p><p>I got bored with the TV and decided to take a shower. That was awesome. The bathroom instead of being kind of cheap and dirty (a cheap apartment bathroom), it was colorful and luxurious. The sound of the water and the stream of it splashing around was mesmerizing and I did not want to leave. The tub was plain white plastic with glass doors, but became a large tiled shower with lots of room and was very beautiful. I however got a bit paranoid thinking I was in the shower too long and the neighbor below would think it strange. I certainly did not want any neighbors checking in on me in this condition. So I ended the shower and went back to the TV to find out more about me, but it was no longer about me.</p><p>I continued with intense visuals and very deep and twisted inner exploration. Then around 4 AM, I started putting 2 and 2 together and getting 5. My parents had decided to sell their business, their house, and buy a smaller house. Somehow I thought they were preparing to die. I was completely sure of it. Why would they make these sudden choices? I was completely sure that they must have had some bad news from a doctor or something of the sort. I kept grabbing the phone and thinking I was going to call them. I rehearsed the call in my head for a long time. It kept going over and over. The more I thought about it, the more I knew that there was something they werent telling me. Finally around 5:30 AM, I decided it was close enough to morning to wake them up and ask. This is where having somebody else with me would have been useful to stop me from calling. So I called and they insisted that they were making decisions solely based on financial reasons and not health. I apologized for waking them up and they never knew I was tripping. Residual effects continued and I drank some beer to try to finally get some sleep.</p><p>I am certain that this amount of mushrooms could have some very serious side effects on some people. I would not recommend this dosage for most people. However, it was a fascinating experience and I did not have any lingering effects after a good nights sleep (the next night). I always remembered that I had taken mushrooms and that the world as I had previously known it would return. Toward the end of the trip, I did experience the feeling that the trip was over and I was now in a new world. This was probably the most uncanny part of it since I felt like the effects had worn off, but I was still in that world where the TV was all about me.</p><p>I have not tripped like that since, but I have a San Pedro cactus that is getting quite large and I am very curious. Being married now, Im not sure the wife will approve though.</p>",
 "year": "2003",
 "id": "58348",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-05-19T07:00:00.000Z",
 "views": "3389"
}
