{
 "title": "Trippin in the Orland Square Mall",
 "author": "n.f.",
 "citation": " n.f.. \"Trippin in the Orland Square Mall: experience with Salvia divinorium (extract) & Cannabis (ID 58350)\". Erowid.org. Aug 28, 2009. erowid.org/exp/58350",
 "substance": "Salvia divinorium (extract) & Cannabis",
 "bodyweight": "95 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "58350",
   "Male",
   "",
   "Not Given",
   "Aug 28, 2009",
   "1919",
   " "
  ]
 ],
 "report": "<p>My first trip on salvia was not exactly scary, but more just the fear of not knowing what was going to happen next.  It all started one day when me and my friend b.d. (whom I smoke cannabis with) were eating Panda at Orland Square.  Some random kids we had never seen before that were from Conneticut told us that they had just purchased some salvia extract.  They offered to let us smoke the Salvia with them in return to smoke some pot with us.  Me and b.d. agreed to it and so we went out in the parking lot behind some large woodchip piles and loaded up a homemade bong I had left there earlier from smoking pot.  </p><p>I think some of the weirdness of this trip was contributed by all of the pot we smoked.  Well, the salvia we had was all little flakes of paper, so we had to put a nug of weed in the bottom of the bowl.  We all took turns hitting the bong.  I took to fast rips of salvia and for the first 10 seconds felt nothing.  Then, I started noticing I was in a different state of mind.  I felt cold streams of air hitting me in little spots on every side of my body.  My friend b.d. disappeared and the kids from Conneticut kind of shifted out of sight.  I couldn't hear anything, except for the laughter of one of the Conneticut kids.  For some reason, I felt like I had some kind of mission to complete.  And for some reason I percieved the laughter of the kid as him laughing at me for not being able to complete the mission, although I was too distracted to pay any attention.  After about 1 minute (hard to tell when your tripping that hard) I tried standing up, but no matter how hard I tried I couldn't, and his laughter seemed to intensify.  After about 2 full minutes I managed to stand up.  All through the rest of the trip I continued to hear his laughter, and it seemed to intensify every 15 seconds or so.  When I stood up, reality went out the window.  </p><p>This next part is hard to describe, but I will try my best.  I started to get the feeling that the trip was never going to end, and that my mom was going to drive up out of nowhere and demand me to get in the car, and I would not have been able to do anything but stand there, that I would be stuck at indecision.  The weirdest part of the trip that sticks out the most in my mind was that the woodchip piles in front of me sort of broke off in to about 10 smaller piles and started swirling around me.  They somehow started grinning at me and opening and closing their grinning mouths and I felt frightened by it, and by my friends laughter.  Then, the ground beneath me gave way and I was just floating there for a few seconds with the piles, and then I was sitting again, next to my friends.  </p><p>All of our trips were staring to come off a little, but alot of stuff was still weird. ( 8 - 10 min).  We walked back towards the mall and we walked across the cylinder beams that were laid across the ground and when I stepped on them they seemed to spin and I felt off balance.  When we were walking through the mall, weird shapes that were actually just brush strokes on the wall seemed to resemble angry or sad faces.  After about 20 min the visuals stopped but I still felt weird as hell.  After 30 min when the Salvia trip was over we said goodbye to the Conneticut kids and never saw them again.  I am glad for this experience and wish to experiment with it again.  I also wish to try e, shrooms, and possibly acid.</p>"
}
