{
 "id": 5838,
 "title": "Instant Zombification",
 "date": {
  "submission": "2006-05-27T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Patrick",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Triazolam",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "At the time that I aquired my 60 tabs of .25mg triazolams (Halcion), I had been taking clonazepam by prescription for 7 months (for 'social anxiety', which turned out to be high-functioning autism), and the dosage had risen to 2mg clonazepam. I had also since begun purchasing diazepam to supplement my clonazepam dependence, intending to eventually discontinue the clonazepam in favor of diazepam, whose withdrawal is slightly longer, but is less intense than that of clonazepam. ",
  "Instead, upon the receival of the diazepam, I enjoyed the euphoria accompanied by the diazepam that had not been present in the clonazepam, and instead used both the diazepam and the clonazepam concurrently, leading to a daily dosage of approximately 80mg diazepam until I quit cold turkey at that dosage.",
  "When I received my triazolam, I took one .25mg pill and waited for the results.  Because of my tolerance, it had little effect on my state. I ate another. I was still fine, because of my tolerance, but the heavy effects hit me after taking more. ",
  "When I took triazolam, it disoriented me more than the other benzodiazepines I've encountered, and I've tried alprazolam (Xanax), diazepam (Valium), clonazepam (Klonopin) and Ativan.  Very, very soon after taking the pill it hits me at an astonishing speed. It is totally kicked in before 15 minutes are up, and I was instantly very uncoordinated (more than usual), stumbling around, forgetting what I was about to do or think, and pretty much useless.  It made me slur my words a lot worse, and generally felt much, much stronger than other benzodiazepines I've tried, when I took more than the base dose.",
  "Triazolam also did not provide euphoria, as I had hoped.  It felt like I was taking a sleeping pill and staying awake on it. ",
  "I do want to add that at the end of my awful zombie-like 8 months of benzodiazepine life, I quit cold turkey against doctor's orders and though it was a horrible, horrible withdrawal for weeks, it was well worth it.  I feel like I can experience things again, and my mom said I'm back to my 'old self'."
 ],
 "erowid": {
  "id": "35867",
  "citation": " Patrick. \"Instant Zombification: experience with Triazolam (Halcion) (ID 35867)\". Erowid.org. May 27, 2006. erowid.org/exp/35867",
  "substance": "Triazolam (Halcion)",
  "views": "12433"
 }
}
