{
 "id": 584,
 "title": "Strobe Light Ping Pong",
 "date": {
  "submission": "2002-01-05T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Benzene",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-E"
  }
 ],
 "report": [
  "In high school, my brother and I invented the sport of strobe light ping-pong. The sport is identical to regular ping-pong, except a strobe serves as the source of light.  It is quite difficult.  Recently my brother and I took this sport to the next level with the addition of psychedelic drugs (2C-E).",
  "Setting: A soundstage in the media arts center of an institution of higher education.  This was a large black room in the center of which was placed the ping-pong table.  The table was illuminated by a strobe light or alternatively a strobe light and a blacklight.  The ping-pong balls were painted with glow-in-the dark paint for added visual effect.  At the corners of the table were positioned 4 large speakers.  A stereo microphone at table level was patched into an G4 Powerbook running a customized delay filter.  The computer would take the most recent 4 seconds of audio input, chop it into pieces, rearrange them, and pass the audio on to the speakers.  The end result was an incredibly disorienting barrage of quadraphonic sound.",
  "t+0h:  20mg 2C-E consumed by each player.",
  "t+1h:  At this point the drugs begin to take hold.  It starts with a body sensation that builds to a strong buzz.  We begin to play ping pong.  The games start out reasonably enough.  We are both seasoned veterans in the sport of strobe light ping-pong.  Despite the fact that the delay filter makes it sound like there are several hundred ping-pong balls on the table, we are able to maintain a decent volley.",
  "t+1.5h:  The 2C-E is coming on strong.  Visual effects are now evident, with eyes both open and closed.  We are both easily distracted and lose track of the score.  Ping-pong skills deteriorate rapidly.  It is difficult to play when you see your opponent morph and dissolve into the black curtain behind him.  Furthermore, the 2C-E is drastically affecting the already-bizarre audio.  It now sounds like there are thousands of ping-pong balls in the room.  They echo and reverberate through the 4 channels of sound.  The visual effects are equally astounding.  Although the strobe is going at about 10 hz, the glow-in-the dark ball leaves massive trails as it flies through the air.",
  "t+2h:  The score of the game becomes completely irrelevant because neither of us can count above 5.  I use this to my advantage by simply announcing false scores.  My opponent is completely out of his wits and does not notice.  However, my brother retaliates with equally cunning tricks.  He hides under the table, then jumps out and screams as he serves the ball.  The computer dissects his scream and rearranges is into a spine-chilling blast of audio that reaches me just I'm about to hit the ball.  I almost lose my mind.",
  "Every piece of sensory input that would normally allow me to play this game has been altered beyond belief.  It is a testament to the plasticity of the human brain that we can even hit the ball.  My brain has reverted to basic survival skills as it fills in the gaps left by the strobe light.",
  "T+2.5h:  The possibility of physical and mental collapse is now very real.  The mental effort required to play this game is simply too much, and we cannot go on.  Turning on the lights, the full effects of the 2C-E are revealed.  There are gorgeous open-eye visual effects.  Lots of geometric morphing and persian carpet-type visuals.  Definite similarities to other the other 2C's.  Audio sounds crisp and clean, and lends itself to fantastic mindscapes (much like on 2C-B).",
  "The 2C-E lasts for about 6-8 hours in total, although I cannot sleep for 10 hours.  The auditory effects induced by our ping-pong game last for the duration of the trip.  The next morning, the sound of birds chirping outside still sounds like it's being rearranged and fed back to me in quadraphonic sound.  It's the sensory equivalent of the feeling you get after staying on a boat for a long time.",
  "All in all, I liked 2C-E a lot.  2C-B, as much as I love it, is the Fresca of psychedelics - light and refreshing.  2C-T-7, on the other end of the spectrum, is a 15-hour onslaught of intense visuals.  2C-E is a nice compromise.  I'm surprised it's not more popular."
 ],
 "erowid": {
  "id": "11333",
  "citation": " Benzene. \"Strobe Light Ping Pong: experience with 2C-E (ID 11333)\". Erowid.org. Jan 5, 2002. erowid.org/exp/11333",
  "substance": "2C-E",
  "views": "29223"
 }
}
