{
 "title": "Stupid Me",
 "author": "Augmented",
 "citation": " Augmented. \"Stupid Me: experience with Amphetamine (Adderall) (ID 5843)\". Erowid.org. Feb 5, 2002. erowid.org/exp/5843",
 "substance": "Amphetamine (Adderall)",
 "bodyweight": "230 lb",
 "report": "<p>Friday night rolled around, and after getting off from work, I was extremely tired.  Wanting to do something that night, I drank about 2 and a half cups of coffee, to go with the 3 I had already had that day.  Later on I managed to score 3 Adderall from my friend, and took 2 of them at around 8.  About an hour and a half later I took another pill and drank 2 20 ounce Dr. Peppers while watching a movie. </p><p>2 o'clock that morning I dropped my girlfriend off at her apartment and headed home.  I was feeling more pleasant that usual, and thought I might be able to get some sleep for once on Adderall (boy was I wrong!).  When I take Adderall, I get a nervous tounge gesture, and suck  on my lips etc.  This plus dry mouth often causes my throat to get quite sore, so before I take Adderall I make sure I have lots of water, cough drops, and Vics Cloraseptic spray.  On the way home I was smoking a ciggarette (taking weird drags, as Adderall sometimes makes me do) and started to note a tingling feeling on my lips.  At first I thought it was because I took too much Cloraseptic, and paid no attention.  As I got home it had started to make my entire face go numb.  At this point for whatever reason I thought that I was going to have a stroke.  I deluded myself into thinking that there was not enough blood getting to my brain and I needed to lie down immediately.  I snuck into my bedroom careful not to wake my mom, and the tingling only got worse. </p><p>Now certain that I was in danger of having brain damage, I propped my legs up on a pillow, hoping to force more blood to my brain.  I wasn't exactly in my right mind.  When that didn't make the tingling subside, I went and hung my upper body over the side of my bed keeping my legs in the air.  This made my feet and my face go numb (along with my hands) and I was certain that I had OD'd due to the abnormally large amount of Adderall coupled with caffeine. I lay in bed mortally afraid that I was about to die and pondered calling either one of my friends or 911.  Neither was very appealing.  I spent about an hour and a half deluded I was having a stroke and trying various positions to get more blood to flow into my brain.  To make a long story short it turns out I was merely hyperventilating, caused by taking quick drags on my ciggarette.  Since I had never hyperventalated before (or seen it happen) I had no idea what it was and the miserable experiance lasted around 2 hours maybe.  It wasn't until I had put my hands and legs in the air, that I quite by accident discovered I could make it go away by holding my breath.  After lying in bed recovering I went and looked up hyperventilation on the internet and sure enough, that was the culprit. </p><p>To sum up, my woefully lacking medical knowledge turned what was an otherwise pleasant trip into one of the worst nights of my life.</p>",
 "year": "2001",
 "id": "5843",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-05T08:00:00.000Z",
 "views": "42962",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": ""
  },
  "2": {
   "time": " T+ 1:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": ""
  }
 }
}
