{
 "title": "Absolute Helplessness and Despair",
 "author": "druglord",
 "citation": " druglord. \"Absolute Helplessness and Despair: experience with Mimosa hostilis, Syrian Rue, Mushrooms - P. mexicana & Cannabis (ID 58438)\". Erowid.org. Feb 20, 2007. erowid.org/exp/58438",
 "substance": "Mimosa hostilis, Syrian Rue, Mushrooms - P. mexicana & Cannabis",
 "bodyweight": "200 lb",
 "report": "<p>I just had possibly the most frightening experience of my life where I reached a state of total confusion and disorganization for a period of about 4 hours.  I prepared an ayahuasca brew and drank it in about 5 minutes.  It was very bitter and acidic, a truly bad taste.  Then about an hour later, I wasn't feeling anything too powerful, so I decided to take a few long drags of mj off my vaporizer and swallow a capsule of p. mexicana.  I have lots of experience with mj and different fungi (in addition to a few other things), but had never experienced DMT.  This was the first time.</p><p>Right after that, I started descending very rapidly into a state of total helplessness, and I very much regretted taking the p. mexicana capsule, knowing that when it kicked in in about an hour and a half, I'd be feeling even more insane.  I felt as though I had hit rock bottom, that this is what death must feel like, being torn away forcefully from everything comfortable and familiar.  I don't know if the sudden descent into madness had to do with the mj as a booster or if the ayahuasca had at that moment (coincidentally) intensified.  Either way, I wanted desperately to purge and rid myself of this poisoning agent.  I must have dry heaved 10 or 20 times, but I could not get anything out.  I believe this was the reason, my trip was so bad: the ayahuasca was inside my body the whole time.  It's one thing to be insane, but it's another to be sick and insane at the same time.  That is the combination that ayahuasca provided, at least until there was a physical purge.</p><p>The purge is as much figurative as it is literal.  It is the point of absolute helplessness and dispair--the point at which things can get no worse.  I was so thoroughly humbled by this experience that I now have a profound appreciation for love and acceptance.  Unconditional love is truly a beautiful thing.  I was scrambling desperately to find some amidst the terror, snot, sweat, and blood that I was stuck in.  I was not only scared by this experience, but I was wired, running from one room to the next, looking for a way to escape the suffering, hurting myself in the process.  I have several bruises and scrapes on my body, including on my right hand and wrist.  I know that was from pounding my fist in frustration on the toilet seat after so many failed attempts to purge.  I spent about half an hour cleaning blood from the carpet and walls afterwards.  I would not recommend trying ayahuasca (or anything equally intense) for the first time without an experienced sitter.  I learned a very hard lesson.  It's going to be hard for me, after this, to ever underestimate the amount of pain that we are capable of feeling.</p>",
 "year": "2006",
 "id": "58438",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-02-20T08:00:00.000Z",
 "views": "10274",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "(tea)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(tea)"
  },
  "2": {
   "time": " T+ 1:00",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "Mushrooms - P. mexicana",
   "form": "(tea)"
  },
  "3": {
   "time": " T+ 1:00",
   "amount": "3 hits",
   "administration": "inhaled",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
