{
 "title": "Possible Dangers of Chronic 5MEO Usage",
 "author": "Cerebronaut",
 "citation": " Cerebronaut. \"Possible Dangers of Chronic 5MEO Usage: experience with 5-MeO-DMT (ID 5845)\". Erowid.org. Mar 25, 2001. erowid.org/exp/5845",
 "substance": "5-MeO-DMT",
 "bodyweight": "190 lb",
 "report": [
  "<p> For a period of approximately 6 weeks, I experimented rather frequently with 5MEO (three or four times a week). Typical doses were in the 5 to 10 mg range, and we would do this perhaps 3 times over the course of an evening using a small glass pipe. ",
  "This substance produces a short lasting but extraordinarily intense psychedelic experience. In addition to mental effects which are roughly comparable to the peak of a double digit acid experience, the drug also produces indescribably euphoric physical sensations comparable to orgasm.",
  "The onset of effects is almost instantaneous and the ensuing rush so intense that no matter how many times one has used the substance the first few seconds after inhalation are invariably accompanied by a degree of shock and fear. The drug's principle effects are intensely euphoric and last in general 5 to 10 minutes. During this period it seems as though one has no direct contact with the outside world; as though all stimuli to the brain are emanating from within rather than through the senses. This period of intoxication, which we came to refer to as 'the warp', is sometimes followed by a period which may last as long as half an hour during which the user feels effects quite similar to a large dose of LSD.",
  "At the conclusion of this approximate 6 week period, interest in the drug waned and there was no further experimentation. Starting from perhaps a month afterwards, both myself and my partner in experimentation experienced a variety of disturbing neurological symptoms, such as twitches and occasional feelings of pins and needles and numbness of the extremities.",
  "Occasional disturbances of memory were also noticed. These symptoms continued with decreasing intensity for the better part of a year after the period of experimentation, at which point such symptoms ceased to occur. It was at this time that we noticed, week by week, a sense of increased mental clarity and proficiency. During this same period it became clear to us that our performance at work (software development) had been substandard in the months that followed the period of experimentation. It occurred to us both that the period of chronic experimenation with 5MEO, however enjoyable, seemed to have caused temporary but significant damage to our brains, both cognitively and neurologically. A chilling reminder that substances such as 5MEO are indeed RESEARCH CHEMICALS for which safe levels of use are yet undetermined.  ",
  "In light of my experience with 5MEO, I urge caution to anyone considering experimentaion with the drug and strongly suggest that such experiments be of a limited nature.</p>"
 ],
 "year": "2000",
 "id": "5845",
 "gender": "Male",
 "views": "20427",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2001-03-25T08:00:00.000Z"
}
