{
 "title": "Floating With Every Move",
 "author": "Penguin Butler",
 "citation": " Penguin Butler. \"Floating With Every Move: experience with DXM (ID 5846)\". Erowid.org. Feb 6, 2002. erowid.org/exp/5846",
 "substance": "DXM",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "210 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "report": "<p>This was my first trip with DXM, and it was really cool.  It was such a great feeling, wonderous in a way. I first heard about DXM when I first visited this site (researching LSD).  I found this place and said 'Woah, look at all these drugs I've never heard about'.  DXM was one listed, once I found out what it was, and what it's potential hazards were(almost 0 at low doses), I had to try it.  I set a date for saturday morning to take it (it was friday night at the time) and went to bed to ensure that I'd wake up before noon.</p><p>I took the stuff shortly after I'd got up.  For about an hour before I took it I watched some comedy and relaxed, to make sure I was in a good, happy mindset, to ensure a good trip.</p><p>I went up to my room and measured out some of the vicks 44 cough syrup, enough containing 210 mg of dextromethorphan hydrobromide.  I mixed the stuff in a fairly large glass with some sprite.  It tasted terrible, and since I'm a wimp it took me about 30 minutes to get it all down.  By that time I was already feeling the starting effects, a feeling that things are somehow different, a slight drunk feeling and slight loss of coordination.</p><p>I started to listen to music, but noticed no change yet.  It was at this time my brother yelled to me 'Do you want some pizza?'  I yelled back 'Yeah, sure.', even though I had no desire to eat whatsoever, my stomach was still a bit uppity from the vile taste of the cough syrup.</p><p>Anyway I went downstairs to wait for the pizza, and decided to watch home improvement with my brother.  I was coming up fast and the T.V show quickly seemed different.  It was kinda like how the T.V sounds when you are woken up by it, quite different and more real than normal.  Also I felt somewhat as if I were actually there, watching the scenes, kinda like someone watching with a telescope.</p><p>Right after the show had finish I was starting to peak, and noticed my brother looking at me somewhat strangely.  I decided to get up from laying down on the couch, I immideatly noticed that when I got up it felt as if my body were about to float away, placidly into bliss.  A wonderous feeling indeed!  But my brain, my mind, it felt like my mind was staying put, whereas my spirit (even though I don't believe in such things) was about to leave and go have a good euphoric time.  Now that I look back on it this must have been the dissociative aspect of the drug.  I felt this drifty-floaty feeling throught the whole trip.  This feeling can also make it feel like you jump extremely high.  I tried jumping, and although I know I only jumped up about 2 inches, it felt like I jumped up 20 feet.</p><p>Then I decided to go look at myself in the mirrir, I noticed that my pupils were dialated extremely widely, I chuckled and went 'woahh man! That's funky!', out loud, even though I didn't mean to.</p><p>Then I decided to go back up to my room for the rest of the trip, because I thought that people would notice by my pupils that I was tripped out.  I needed some more music though, so I went to my computer to upload some more music to listen to, it was one of the hardest things I ever had to do.  I could not read at all, all the words were so blurry it was impossible.  I had to squint real hard to be able to read things, and the clarity only lasted for a second before I could not keep squinting.</p><p>I finally uploaded the music and went up to my room.  I was really hitting the peak of my trip about now.  I layed on my bed listening to music.  I tossed and turned around, oh how good that felt!  Every move I made produced such a euphoric joy in my head and all over my body.  Then I got up and danced to the music, which was astounding.  I felt so uninhibited by an undescriable force that had existed for all my life and kept me from this state of freeness.  It was if I were fully able to move in all 3 dimensions as I pleased.</p><p>After a while I noticed I was starting to come down, which was good, beacause I was, believe it or not, getting a bit tired of feeling so happy after every move I made.  The coming down was very slow indeed, lasting about 2 and a half hours totally, also with a slight, pleasant lethargy lasting all night.</p><p>The next morning I woke up physically well rested and alert, but my mind felt somewhat more tired than my body, which wasn't a bad feeling at all. Not good but not bad.</p>",
 "year": "2001",
 "id": "5846",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-06T08:00:00.000Z",
 "views": "32051",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "210 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ]
}
