{
 "title": "A Low Dose Hangover?",
 "author": "A Spiritual Explorer",
 "citation": " A Spiritual Explorer. \"A Low Dose Hangover?: experience with Kratom (ID 58470)\". Erowid.org. Feb 19, 2007. erowid.org/exp/58470",
 "substance": "Kratom",
 "bodyweight": "195 lb",
 "report": "<p>I received my package of herbs from an online supplier several weeks ago, and last night decided to give the Kratum a try for the first time.</p><p>I wanted to try and decided to start out light. Boy am I glad.</p><p>After much reading I figured a threshold test of the material would be a good start to get a baseline feel for the batch. I purchased 25 grams of crushed leaves of standard grade (no extract or anything labeled Premium or Super). I decided on 3 grams for a threshold amount.</p><p>My last meal was had at 6 pm. No snacks since. No MAOI's or other drugs present in my system.</p><p>I put 2 cups of water in the microwave on High for 2 minutes. I then added the 3 grams (weighed on a digital scale that I calibrated just prior to making the tea) of leaves to the water and microwaved another 4 minutes on High. The water had just started to boil as the time was up. I let the mix steep for 15 minutes. I had read that 20 minutes was the most common steep time, but hey, I was going for a threshold effect.</p><p>After 15 minutes, I strained the leaves from the water and drank it down. To my surprise, the tea wasn't bad. I usually drink coffee without cream or sugar, and the taste of the tea was no worse than that.</p><p>T = 10:45 pm</p><p>T+0:15   Very slight effects are noticeable. Hard to pinpoint, not quite light headed, but a feeling more like not having had enough sleep the night before, but not in a sleepy way.</p><p>T+0:40   Notice definite effects now, difficulties refocusing eyes quickly when I turn my head. It feels like I've taken 10-15 milligrams of Vicodin at this point.</p><p>At this point the effects didn't intensify too much more, but lasted consistently until I went to bed at 2 am, and no nausea.</p><p>I awoke around 9:30 am feeling fine. I thought to myself, 'Cool, a positive experience.' I showered, got dressed, and went downstairs to enjoy my day.</p><p>After having been awake and moving around for 45 minutes, I became a little light-headed. It quickly started to get nauseous and to feel like I was having a mild alcohol hangover (which I haven't had for years). I hadn't eaten anything yet, and had only had a couple of sips of bottled water since waking. I headed back upstairs and lay down with my eyes closed hoping this wasn't going to be a bad morning.</p><p>After about 2 hours of light snoozing, I was able to get up and move around again without any further incident. I was still a bit 'off' for a couple more hours, and I had no desire to eat anything until dinner time because of the morning nausea. And this from what was supposed to be a threshold amount of Kratum?</p><p>All in all, it wasn't a bad experience. Without a doubt this was because I heeded the warnings to try the threshold amount of your product for a first time use. Thank God I actually took the advice. This would've been typed up as a disaster had I tried to use the 'common' dosage level.</p><p>It now occurs to me that it would be most prudent to check the threshold level for ANY new batch of product (even if used before) and because of this experience, I'll be doing just that.</p><p>Peace.</p>",
 "year": "2006",
 "id": "58470",
 "gender": "Male",
 "timestamp": "2007-02-19T08:00:00.000Z",
 "views": "4908",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  }
 ]
}
