{
 "title": "2C-B Dosage Descriptions",
 "author": "wb",
 "citation": " wb. \"2C-B Dosage Descriptions: experience with 2C-B (ID 5850)\". Erowid.org. Mar 24, 2001. erowid.org/exp/5850",
 "substance": "2C-B",
 "bodyweight": "190 lb",
 "header": [],
 "report": "<p>I've heard a minority of people need a pretty strong dose to feel anything, but for me:</p><p>5 mg: Noticeable, but can drive and relate to people. Went to a movie; alternately became really absorbed ('Get Shorty') and noticed the screen, audience, and theater. A nice level for an art shop, sensual sex, a concert, dancing to the Dead; good for tuning in and enjoying the senses. Occasionally forgot I was under the influence.</p><p>10 mg: Still a level one can function with; did some driving (also on some cannabis) and it was OK but not completely safe and would not try this again. Very nice for a large drumming circle, or a concert for flowing type music. More obviously 'stoned'; some reality shift but not strong; no visuals yet. [Erowid Note: Although the author was being careful here, it is worth emphasizing their comment that they did not feel it was safe to drive even on this very low level of 2C-B. Driving while distracted or intoxicated endangers others. Don't do it!]</p><p>15 mg: Now starting to see extra curlies and wisps around visual objects; again much tuning/focusing to events (eg Burning Man Sunday Night). Still more inclined to tune-in to what's around me; not an inner trip. Music is very nice; also dancing. Some reality shift, but enhancement rather than to a completely novel place.</p><p>20 mg: Becoming a stay-at-home psychedelic, but not 'pushy' at this dose. However, not really entheogenic; do not sense an inner spirit. (For focus on spiritual work, mushrooms + 10 mg could work well; cactus already has some of this tuning-in.)</p><p>Haven't tried more than this; 25 would probably be OK, but I hear it does get intense and 'pushy' at higher doses for many people. (But some people need this much, I'm told.)</p><p>Have tried with Syrian Rue (& mushrooms. No obvious problems with the Rue (but be cautious). Several people like it with mushrooms; adds some mushroom spirit qualities to the merging 2C-B qualities.</p><p>Have heard two reports with ketamine; 'D.M.Turner' had good things to say, but someone else said they felt pulled apart. These two have opposite effects; 2C-B is a body/entactogen, Ketamine is a out-of-body inner trip. Be careful here...</p><p>Have heard several reports of nice synergy with MDMA for a couple trip, and we hope to try this; would do MDMA first, get very open and trusting, then after about 3 hours add the 2C-B (say, 15 mg), which is likely to lead to very tuned-in/merged sensual/sexual experience.</p><p>Finally, note that this is a new compound with no traditional history, no widespread use/testing, and no pharmaceutical testing. It is not structurally an amphetamine and the doses are relatively low, so neurotoxcity is probably not an issue. Still, I would limit peak dose and lifetime exposure until more is known about the safety.</p>",
 "year": "1996",
 "id": "5850",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-03-24T08:00:00.000Z",
 "views": "42596",
 "dose": []
}
