{
 "title": "Frustration with Human Communtication",
 "author": "Sven",
 "citation": " Sven. \"Frustration with Human Communtication: experience with Salvia divinorum (ID 58501)\". Erowid.org. Sep 19, 2009. erowid.org/exp/58501",
 "substance": "Salvia divinorum",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "report": "<p>I had been very excited about Salvia for several weeks before the experience. My friend had promised me a trip for my birthday, so I was quite excited. We had attempted to trip once before, but with disastrous results. The smoke had made me cough (thanks to my low tolerance to it), and the salvia fell out of the makeshift tin foil pipe onto the floor. No effects, save for the perception of an elongation of my cargo van. This time was different, however. It wasnt a full breakthrough as Ive seen them be described, but it was damn close.</p><p>It began one lazy day after school. My friend called, and asked in an excited voice where I was, because he had salvia. I told him Id meet him at a local park in five minutes. Upon arrival, he and two of his friends (two girls who I dont know) piled into my van. We were off. W had no idea where, but we finally settled on the side of some road between two corn fields. It was a cold, windy day. There was a bit of unseasonable snow, also. My friend made the familiar tin foil pipe, and filled it with some salvia. For the next five or so minutes, it appeared as though he had developed some debilitating mental disorder. It was now my turn. I waited nervously as the pipe was passed up to me.</p><p>I was sitting upright in the passengers seat, which had been fully reclined. The door was open so I could blow the smoke out of the van more easily. I ignited the lighter and began what was to be my largest hit of anything to date. I held it in for what felt like a lifetime, being coached along by my friend. I felt lightheaded, and almost as though I was about to faint. I released the semi-sweet smoke out the open door, grabbed the handle of the door, and fell back into what felt like oblivion. There was a distinct section of nothingness between the hit and the beginning of the trip. What I found odd was the total lack of a come-up. What I found even stranger was how calm I was after being plunged into this all at once.</p><p>I rose up, and immediately felt as though some drastic change had happened. I flailed and yelled something about track number 9. I wanted to listen to Lateralus by Tool, but for some reason I could not communicate this thoroughly enough. I was saying the correct words, but they seemed to have no meaning. The next thing I noticed was this overpowering, undeniable force of energy pressing me back towards the seat. I fell back several times attempting to start the song. Finally, my friend started the song for me. I laid back in my seat, giving in to the river of energy flowing over me. The song was amazing, and every time I closed my eyes, I felt as though I was about to push up and out of existence itself. Then, my cell phone rang. I made the mistake of answering it.</p><p>It was my girlfriend calling to ask where I was, since I was now several minutes late to pick her up. I assured her (quite crazily, as it turns out) that I would be there soon. I panicked slightly, but calmed down. My mind was working better than usual, but I still couldnt communicate anything properly. It was now that I noticed that my three sitters were laughing uncontrollably at everything I said, no matter how small or mundane it seemed to me. I realized that in a sober state people cant grasp what could possibly be happening in the mind of someone tripping, even if they were just there not even five minutes prior. I became very frustrated in the attempt to communicate with these grounded beings. I felt as though I was attempting to exist through a broken and slightly out of tune CB radio. Everything was fuzzy.</p><p>I had become used to this state and began noticing things outside. For example, the corn was blowing in the same direction that I was being pulled. I felt like a giant octopus from across the stars was attached to my every cell and thought, pulling me backwards. I heard a sound similar to that in an ultrasound, a slight back-and-forth whooshing, gushing, beating sound. I was now waiting this trip out. I had to go outside, I felt, or this would never end. I leapt out of the van, despite the protests of those around me.</p><p>I immediately felt closer to normal, and as though driving would be a possibility within a few moments. I waited another minute, and felt fine to drive. I was having trouble contemplating the fact that I had just nearly broken through the bubble holing us into reality, so I held it off until later. Driving, I felt as though I had just awoken. I was completely lost, however. I finally got my friends back to their car (while one of the two girls had a salvia trip in the back of my van). I sped to get to my girlfriend. I was very relieved to see her, despite her anger at my lateness. When I arrived home, I immediately started trying to make heads or tails of the experience. Overall it was informative, but I wish I had fully broken through.</p>",
 "year": "2006",
 "id": "58501",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-09-19T07:00:00.000Z",
 "views": "1890"
}
