{
 "title": "A Matrix of Inescapable Ennui",
 "author": "Mojo",
 "citation": " Mojo. \"A Matrix of Inescapable Ennui: experience with LSD & Cannabis (ID 58577)\". Erowid.org. Sep 8, 2009. erowid.org/exp/58577",
 "substance": "LSD & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Cannabis - Hash",
   "(plant material)",
   "",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>It was the first time I took LSD. I had been fascinated by reports such as reported by Hoffman and Aldus Huxley and had been reading it up for a few months now. So I scored a 500 microgram double dipped hoffman 2000 from my man and me and my best friend Kim went down to the beach. [Erowid Note: Claims of measured microgram dosages for LSD are usually unsupported. Quantitative measurements for LSD are very difficult to do and cannot be done casually. Without further detailed information about how the measurements were derived, it is reasonable to assume that most statements of microgram dosages of LSD on blotter or in microdots are either misinformed or overstated.] We smoked a hash joint there and then I dropped the acid. Time approx sunset. He then left me to go to his girl and I proceeded alone on a long leisurely walk along the Arabian sea coastline of India. Looking back I should have surely needed a guide, I don't know why I didn't insist on him coming with me.</p><p>15 min later the effects still hadnt begun and as the stars had come out I tried inducing the trip by looking at the stars and spinning around. It kick-started the trip and would last me a full hellishly intense 12 hours. I got off the beach and into a beach bar. Initially it was like the most ultimately pleasant experience ever. Laughter on 45 min at anything and anyone. Everything was really cracking me up. Even things that were not funny. Then I spun in my seat looking at the thatched roof and it took off like a helicopters blades spinning it into the air. Fuck. Houston we have lift off.</p><p>I started to feel uncomfortable and decided to get out of there before it became obvious on my face that I was affected. I reached the end of the road and had to sit down at the bar. It was holi festival in India that same day. A festival where people throw powdered colour indiscriminately on people, cows, cars, bikes, houses. There was a group of grotesquely fat aussie women with their guys all covered with holi colour. What a disturbing sight. I needed peace sanctuary. Then the waiter noticed I was fucked and I asked him for a glass of water. He brought it and put it on the table. The table looked like it was sloping 45 degrees so I put my hand out to stop the glass from falling. The waiter kindly informed me that all was well. He asked if I was ok. I most definitely was not.</p><p>After an eternity or probably 20 min or so. I saw a face I knew which otherwise I could identify with the name but in my state I could just cry out Hey you! So he came over and I explained that I had taken acid and needed to go home. He brought me to my hotel. I was tripping on the journey back heavily didnt even recognize the road which I had been down so many times before.</p><p>The strongest part of the trip begins at my 50 rupee/night hotel room. I see thru miniscule holes in the door and see floating white mist in the room. From my bed I can see the ant moving in the crack of the door, illumined by the streetlight. I can focus in and out of the ant. I can focus in and see the ant in more clarity. I start to convulse on the bed and get palpitations. I look down at my left chest and it appears red. The red colour gets dimmer every time I breath out. Every time I breathe in, the red under my left chest gets brighter. I think Im gonna die. Im in a very bad state.</p><p>Oh no I got worse. I started to hear the distant cries in the sky of the birds of prey. Vultures. The cry of a fallen creature. Im really in a bad state. I think Im really gonna die. Then I also see Jesus Christ behind the grill. So I get down on my knees and say Father forgive me I have sinnedI have done LSD. Sounds funny and all but I was in a panicky state and was getting palpitations.</p><p>I was not feeling confortable on the bed, it felt like I was falling thru an endless series of blankets. Faces came out of nowhere and approached me in a parabolic fashion, exactly as Raul Duke@ Hunter S Thompson saw Nixons face in the Las Vegas hotel room in Fear and Loathing in Las Vegas. The girl I was presently involved with, Renu. Her face came up a lot throughout. Some other faces came up too but I dont remember now who they were. I then had a sexual fantasy. I remembered a Chinese woman I had a dream about when I was an adolescent and having such dreams. I had that fantasy again and this time I had virtual sex. I did not at any point masturbate myself. I just had virtual sex and I felt like I had come.</p><p>As that ended I suddenly remembered my distant past, when I was a little kid aged around 3 and chewing on the telephone cord in my grandmoms house. That was the first time I had remembered that incident since I had done it. In other words, I had remembered that at the age of 3, I was aware and had memory of doing that act of chewing on the telephone cord. This part of the trip amazed me the most. For obvious reasons.</p><p>Started drinking heaps of water and auto suggesting that it was not reality and that I will be better in the morn. The thought that I might live in this state of mind forever also terrifies me. Suddenly the world was appearing so mundane and boring which made the world seem to be made of a fabric so horribly banal and there seems to be a matrix. A matrix of inescapable ennui that it makes me depressed to be in such a world. The walls are made up of this fabric. This was the depressive part of the trip which I cannot properly explain in words. Mind you I had absolutely no music to divert my attention away from the physical symptoms I was experiencing. I should have kept a diazepam/valium handy just in case. That would have aborted the panic attack. I always go around with it these days if I ever trip. It has come in handy.</p><p>I realised I needed to externalize to get out of this bad inner trip. So I sat cross legged on the bed, eyes shut and started reciting aloud. OM OM OM OM Namo Shivaya. With every long OM,  I saw and felt concentric waves of sound/vibration come into focus and everything felt better. The universe felt ONE. It was one. So I said it again and again and it really helped calm me down. It all helped. I drank a lot of water. I peed a lot. I chanted a lot to keep those godamm birds of prey away. The sun came out. I walked slowly a godaamm long way to my friends hotel in the wee hours, woke him and his gf up saying I had a bad headache. Which I did. I ate an omelette with him. I had a tea. I finally felt better.</p><p>The next few months were definately the most creative period thus so far in my life. I changed forever after this experience. Quite a way to begin the new millenium. It was a bad trip though, and I sincerely hope NEVER to go through this again.</p>",
 "year": "2000",
 "id": "58577",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-09-08T07:00:00.000Z",
 "views": "5306",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(plant material)"
  }
 ]
}
