{
 "title": "Philosophical High",
 "author": "hopemaitreya",
 "citation": " hopemaitreya. \"Philosophical High: experience with Cannabis,  Blue Lotus (Nymphaea caerulaea) & leonotis leonurus (ID 58599)\". Erowid.org. Jan 6, 2007. erowid.org/exp/58599",
 "substance": "Cannabis,  Blue Lotus (Nymphaea caerulaea) & leonotis leonurus",
 "bodyweight": "70 kg",
 "header": [
  "DOSE:",
  "0.4 joints/cigs",
  "inhaled",
  "Cannabis",
  "(flowers)",
  "",
  "0.4 joints/cigs",
  "inhaled",
  "Leonotis leonurus",
  "(flowers)",
  "",
  "0.2 joints/cigs",
  "inhaled",
  "Lotus/Lily - Nymphaea nouchali var caerulea",
  "(plant material)"
 ],
 "report": "<p>Yesterday i finally got my bag of blue lotus wild dagga. i was in a good positive mood and overall feeling fine and decided to try a mix of all three with some purple weed, (40% cannabis, 40% wild dagga, 20% blue lotus).</p><p>The first thing which turned out to be pleasant was the taste. The smoke was really smooth and enjoyable; definitely better than a joint with tobacco and cannabis. Especially the fragrant flowery taste of the sacred lotus was a good suprise. The leonotis leonorus also had a very nice taste. I can now see why the hottentots used it as substitute for both tobacco and cannabis.</p><p>T+10</p><p>Having smoked weed on a near daily basis for a few years,  I was thoroughly familiar with its effects. It often would blur my concentration and lead my thought astray. But the joint of sacred lotus and wild dagga instead gave me a new high i hadn't experienced until then: a high of clarity and total concentration as well as creativity, it almost felt like a deep meditative state of relaxation and clarity. In my opinion the wild dagga acts synergetic with both cannabis and blue lotus. The blue lotus of course taking away the bad effects of cannabis and amplifying the good.</p><p>This feeling continued to persist for a few hours, fading away leaving no unpleasant side effects. I can see why these plants have been revered for so long. Maybe i'll try lotus and dagga with salvia sometime :)</p><p>I recommend smoking cannabis with lotus and leonorus instead of tobacco.</p>",
 "year": "2007",
 "id": "58599",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-01-06T08:00:00.000Z",
 "views": "13925",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.4 joints/cigs",
   "administration": "inhaled",
   "substance": "Cannabis",
   "form": "(flowers)"
  },
  "1": {
   "time": "",
   "amount": "0.4 joints/cigs",
   "administration": "inhaled",
   "substance": "Leonotis leonurus",
   "form": "(flowers)"
  },
  "2": {
   "time": "",
   "amount": "0.2 joints/cigs",
   "administration": "inhaled",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(plant material)"
  }
 }
}
