{
 "id": 5869,
 "title": "Midnight Madness",
 "date": {
  "submission": "2004-11-12T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Jay",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tsp",
   "administration": "oral",
   "substance": "Monotropa uniflora"
  },
  {
   "time": "0",
   "amount": "T+ 0:15",
   "administration": "30 mg",
   "substance": "insufflated"
  },
  {
   "time": "Amphetamines",
   "amount": "(pill / tablet)",
   "administration": "T+ 0:15",
   "substance": "200 mg"
  }
 ],
 "report": [
  "Location: Friend's house with four or five other people who were drinking beer and smoking weed.",
  "Before Dose: Calm but a little tense (stressful day.)",
  "Dose: 1/2tsp. dried and crumbled Indian Pipe root; 30mg Adderall and 200mg Provigil finely ground and insufflated.  I took the Indian Pipe first at about 11:30pm and the uppers about 15 minutes later.  I took Indian Pipe the night before but it put me to sleep in under an hour so I added some uppers to counter the sedative effects of the Indian Pipe. ",
  "After Dose: Around midnight I began feeling a euphoria.  I noticed I was very relaxed and I felt like the music was flowing through me.  15 minutes later I sat down to make notes about my experience and my feelings.  It was then I noticed my eyes felt heavy but my muscles felt tense so I wasn't tired.  I also noticed that the muscles between my stomach and my nipples were especially tense.  It felt as though the top half of my body was trying to go down to the floor while the bottom half wanted to go up to the ceiling.",
  "This was also experienced by a friend who had taken an equal amount of Indian Pipe but half as much Adderall and Provigil.  I also noticed my hand couldn't write fast enough to keep up with my brain.  Finally I found I was having a very difficult time focusing on any one thing for more than a few seconds.  Over the next two hours I continued to feel euphoric while the uppers faded and my ability to focus returned.  At about 2:30 or 3:00 I fell asleep and slept very well despite being on a couch."
 ],
 "erowid": {
  "id": "35999",
  "citation": " Jay. \"Midnight Madness: experience with Amphetamines, Modafinil (Provigil), Indian Pipe Root (ID 35999)\". Erowid.org. Nov 12, 2004. erowid.org/exp/35999",
  "substance": "Amphetamines, Modafinil (Provigil), Indian Pipe Root",
  "views": "18532"
 }
}
