{
 "title": "Descent Into an Ugly World",
 "author": "Squirrel eared man",
 "citation": " Squirrel eared man. \"Descent Into an Ugly World: experience with Mushrooms - C. cyanescens (ID 58707)\". Erowid.org. Sep 20, 2009. erowid.org/exp/58707",
 "substance": "Mushrooms - C. cyanescens",
 "bodyweight": "87 kg",
 "report": "<p>Stupefied squirrel-eared man dwells morbidly on the eternal cycle of life:</p><p>Took a drink of home made tea  5 PM - Effects were strong and fast and stupefying. It kicked in after about 10 minutes. Since it was coming on fast and heavy I decided not to drink the other cup of the evil brew - I set it aside and poured it away later.</p><p>For 3 hours I was stupefied. Generally it was a heavy experience, not uplifting at all, but a weird witchcraft type feeling was there. I sensed it as a sinister situation that I just had to ride out. Also it magnified morbidity and stomach problems. The chemical effect of the trip made it manifestly clear to me that chemistry is a foundation of consciousness. Any change to it affects my experience of life. I recognise my need to keep in mind other peoples shifting, changing body chemistry, and how it may affect their emotions and perceptions.</p><p>Toilet about 3 times:</p><p>Sitting on the pan and returning to it about 3 times made me feel convinced that ms would likely always give me a shitty reaction. Now thats all very well when I have my capacity to get to the toilet seat and dump it all out  so I feel I was doing fine to be on a level 2 bad trip where I had all my bodily functions and could manage all that. Grateful for bodily functions.</p><p>I called my brother D at about the 25 minutes point to give him some feedback. He encouraged me to go for 5g next time I think thats a bit rash when I was giving him feedback to the effect that it was a bad trip. Of course D is a hardened warrior of the chemical realm and so I judge that as macho talk. Anyway, he was good enough to have a caring chat and offered for me to call him back if I needed to.</p><p>A background natural sounds CD Sea sounds was playing. I initially set it to repeat continuously, then I realised that an endless loop of the Sea might feel like a trap, and decided, while I had my awareness, to switch it off. Vision was mistier and my hearing was actually quite dulled.</p><p>Thoughts of Saddam Hussein (who was finally recently executed) came to mind, in the sense that I had recently been reflecting on the way he sees himself and the way the executioners see him (as fit for hell). Jesus Christ (as a comparison to Hussein) came to mind somewhere insignificantly. My brain seemed to be making some kind of connections with these paradoxes of human good and evil. Nothing clear though!</p><p>I was able to see patterns on the floor like fissures spreading out but had no interest in exploring them since I was more interested in having my normal perception than an ugly and unappealing unreal one. If it had been beautiful I would have gone with it and enjoyed it for the novelty.</p><p>Also into the peak of the trip thoughts and decisions were moving at a crawl. Connections seemed to be taking place between ideas in my mind, but they seemed random and jumbled, and there was no sense of any useful insight. It was a peak of distorted visual feedback, warped walls and a few bleak and unattractive discolorations.</p><p>I was trying to figure out a few fundamental truths on this journey. I was seeing one corner of the room as a small representation of the whole of time and space. Sort of an eternal play with some mysterious set pieces in it. There were bad guys and good guys. Altars and symbols. There was a sense in which I/ we / everyone is the judge of themselves and of everybody else. Family and friends and past work colleagues and enemies came to mind and I had the sensations that all are one. Inter-related and of the same basic identity. I have already come to these conclusions intellectually, so the chemical seems to confirm this idea but not as you might expect in any kind of blissful universal love kind of way, just a bleak sense of unity! I am convinced that the realities of life are actually potentially blissful, so this was like a lying bleak version and I felt annoyed at it. Like it was a fake religious show - trying to convince me of what it was saying but I wasnt buying into it.</p><p>The thought came back to me a few times that Saddam Hussain thought of himself as a good guy. A man convinced with incredible self-deception (since he is likely to have been responsible for the deaths of tens of thousands of people). I thought of his executioners mocking him and saw it all as a moral example. A symbol of a basically wrong way to live a life.</p><p>Tilting and turning my head to the side when I got caught up and entranced with weird morbid thoughts was a way to snap out of things a little, since I had heard that altering the blood flow alters the chemical flow also.</p><p>For some strange reason I occasionally had a slight sensation of mousey or rabbit ears above my head (in peripheral vision) which was not a visually real effect but just sensed in a cartoonish way. I paid this no attention because I knew it was all illusory and would pass. Later I recalled someone had recently given me a 2007 calendar with a squirrel on the front!</p><p>The drug itself gave a sense of another presence or of others observing me while I observed myself. I interpreted this as I would interpret the effect of someone else's moods and chemistry on my own. The drug itself from the moment it kicked in, was effectively a strong presence directly fucking with my head (which is of course what some people also do).</p><p>So no actual sense of any other entities but I believe I was on a sort of threshold, and I can totally see how I could have interpreted the strong sense of presence of the drug effect as personalised entities (goblins, elves, aliens etc) in line with the other worldly theme the chemical induced in me. Since the trip was already kind of sinister, I didnt follow that thought through. I chose to regard the sense of other as my own brain dealing with the alien substance within.</p><p>I felt safe and peaceful throughout and my breathing was very calm. However this little weird unreal world of fucked up perceptions seemed real, sort of like an ugly country you dont want to visit again. The sense that all are one (You, me, Saddam Hussain, Jesus Christ, my granny, my parents, enemies, colleagues and friends from past and present and future) was kind of reassuring but it was also annoyingly morbid. Like a merry-go-round in a dismal fairground with cheesy music playing. This became a kind of looped trance for me, and eventually I snapped out of it by turning my head at different angles, since it never seemed to get any more positive in mood.</p><p>At the early part of the trip I was going to lay back and relax but when I did the main room light then took on the role of a kind of alien operating theatre lamp beaming its light on an area around the location of my collar bone. Whether its intentions were benign or not was not clear. I decided on my negative frame of mind that I wasnt going to let it develop into some nasty operation situation which I didnt think would be an encouragement.</p><p>Also at the peak stage there were long periods of starting things without finishing them. Starting sentences and statements of self refection bit not finishing it, until after lengthy pauses. However looking at the clock for example. Time was not warped in any big way  3 hours still took what felt like 3 hours 4 hours took 4 hours but I was probably at a level where time had not been able to distort big time. Which is good. A year or two on a shitty trip would not be a lot of fun. The 24 hour clock was unusually hard to figure out back to standard time. I knew I could do it but it just seemed annoying to tax myself with the mental work, and I knew I could do it later. I was on the journey full blast from about 5.10 to 8.10 and coming down for a further hour.</p><p>General comments:</p><p>My whole mindset was fine and uplifted before the trip but heavy and morbid as soon as it started,  and all the visual effects were that of enclosing me and making me feel prone to a negative interpretation. It was a very dark windy night outside  last night of the year. I felt no desire to play with the trip much  or to experiment with reading books or playing music. I found that when I moved my head around it could affect things. So in that way I occasionally took control to change my experience. However nothing lifted the mood of this trip into anything enjoyable or funny or beautiful. The theme at all times was ugly and grungy and at times sinister.</p><p>I settled for staying in my chair and more or less observing most of the effects passively, since I was still aware that eventually I would come out of it. Certainly my rational mind was still there, gauging things and toughing it out for the ride. Not a good ride, the brief while -where I found the corner of the room entrancing me as a representation of the eternal cycle + all is one - that seemed an example of the warped nature of insanity.</p><p>There were absolutely no good vibes. Only a sense of connectedness to some sort of something in a low level, groggy sort of cartoonish way. There was no blissful sense of unity. To experience that, I reckon would need very GOOD vibes going in, a good set and setting and a better sacrament. I was fairly positive and looking forward to things when I went in to the trip but its strongly stupefying chemical effect dragged me down.</p><p>Here is one insight I gained. We are all dependant on our brain and body chemistry  and everyones chemistry is altered to some extent all the time. This trip was just one big alteration, and it helps me recognise how people need to gauge how they deal with others based on that awareness of differing body chemistry.</p><p>Verdict:</p><p>I acknowledge that with a sunny day  some open spaces  a better stomach and some experienced buddy around things might have been a lot better. But good for what?  I dont know. I didnt get perfect set, setting and pre-journey diet to guarantee a good journey. But I did spend a whole stack of money growing them. I dont reckon that species (Panaelolus Ban Lamai) agreed with me. Frequent trips to the toilet show me that that species and that tea do not agree with my system. Happy to get out the other end with my every day consciousness. I accept my everyday consciousness as more enlightening and rewarding, than the mushroom state.</p><p>As for what I had heard of the valve of consciousness opening up  or any kind of positive enhancements or beauty  none at all  just dark ugly dismal and stupefying. It may be early days, but from that sample trip, I am discarding my mushroom growing interests for now. The stupefied and groggy effect made my mind up for me. I doubt that strong chemical is able to produce the lighter, clearer states I feel in heightened natural awareness. Quite the opposite. So I suppose in that sense its a useful negative contrast. It has got me thinking that I can do a lot more for myself with some regular meditation and Chi Gong.</p>",
 "year": "2007",
 "id": "58707",
 "gender": "Male",
 "timestamp": "2009-09-20T07:00:00.000Z",
 "views": "7151",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Mushrooms - C. cyanescens",
   "form": "(tea)"
  }
 ]
}
