{
 "id": 5872,
 "title": "An Odd Night",
 "date": {
  "submission": "2005-01-02T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Thrillhouse22",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "48 mg",
   "administration": "oral",
   "substance": "Pharms - Tiagabine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "About three weeks ago, I was hanging out with my new roommate (weve been friends for a long time), and I was feeling too sober yet didnt have any money for trees or alcohol, and he is prescribed many things for bipolar disorder, anxiety, depression and also adhd.  I asked him if he had any pills he would be willing to give me, and he said that all his prescriptions had run out except gabitril.  I asked him what it did, and he couldnt really explain, but he said they would get me pretty messed up and having some fun.  Im very experimental, and have tried just about everything, and always like to try something new.  So I took two 12 mg pills. The experience was alright, it kinda felt like a mild trip in my mind, and I felt out of sorts, but at the same time not intoxicated.  A few hours later, much earlier than my usual bedtime, I got very tired, very fast, so I went to bed. ",
  "The next afternoon I woke up at about 3 and saw the bottle sitting on the table, and thought, 'well, when I took 2 it felt like I could have tripped nuts if I took more.'  So I took 4 (48mg) and started playing some super nintendo.  An hour later, nothing had happened, and I was starting to get impatient.  Another hour passed, and my roommate walked in the door.  I had just started to notice that I was starting to feel some effects.  He started talking to me and said I looked stoned, and I was slurring my speech, and he asked if I took more trils, and I told him I took 4.  He looked at me like I was insane and said that hes never seen anyone take more than 2, and even 2 makes most people incoherent and retarded.  He said that he didnt understand how I had such a high tolerance to this.  A half hour had passed, and by now I was wasted, I had difficulty putting my thoughts into words.  He and I then left to go get his girlfriend (hour and fifteen minute round trip).  Getting in the car is the last thing I remember.",
  "All of a sudden, I come to, and Im sitting in my bed with my girlfriend holding me and freaking out, having no clue where I am or who I am or what time it is and Im conscious but I physically couldnt figure out how to talk to my girlfriend, who is freaking out.  All I could say was 'yay' because I glad she was there.  I kept trying to talk but couldnt make words.  after about fifteen minutes I finally could talk but I could only say a few words, and I kept calling her my roommates name, I couldnt remember mine, and I couldnt define any words even though I what they meant.  Apparently I was awake through this whole experience, but its a complete blackout.  according to my roommate, on the way to crescent beach I was talking complete gibberish, and I kept making weird, repetitive, almost autistic movements in my seat, he kept talking to me and asking me how and I could only respond 'yes' and give a stonerish laugh. ",
  "Then, we apparently stopped at a gas station, and I got out of the car after my buddy told me not to move.  I went to take my first step and fell flat on my face, and started convulsing on the ground.  At this point a cop was pulling into the parking lot and I still refused to get up so my buddy picked me up and tried to stuff me back into the car, but I kept bracing myself against the door and refused to get in.  He eventually managed to get me in the car and pump his gas.  then, when we got back to the trailer, I still couldnt walk (trying to get out of the car is the only part I vaguely remember) so my buddy and his girl went to help me up the set of 5 steps to the front door, but I tripped on the bottom step and faceplanted the top step and whacked my knee on one of the other steps hard enough that its still all scraped up.  Apparently after they stood me up and were like 'damn dude are you ok?' all I could do was laugh, despite landing pretty much directly on my face (Im lucky I didnt lose any teeth, although I had a nice lump on my forehead for a good week).  He then apparently just threw me in bed because I was completely incoherent and couldnt do anything.  And thats where I came to.",
  "So basically, if you want to feel like a baby trapped in an adult's body, and want to see what its like for your brain to be turned into complete mush, then take a bunch of gabitril for a fucked up experience you probably wont remember."
 ],
 "erowid": {
  "id": "36006",
  "citation": " Thrillhouse22. \"An Odd Night: experience with Tiagabine (Gabitril) (ID 36006)\". Erowid.org. Jan 2, 2005. erowid.org/exp/36006",
  "substance": "Tiagabine (Gabitril)",
  "views": "14153"
 }
}
