{
 "title": "The Perfect Speedball",
 "author": "Dr. Feelgood",
 "citation": " Dr. Feelgood. \"The Perfect Speedball: experience with Amphetamines & Hydrocodone (ID 58749)\". Erowid.org. Jun 24, 2008. erowid.org/exp/58749",
 "substance": "Amphetamines & Hydrocodone",
 "bodyweight": "200 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "Amphetamines",
  "(pill / tablet)",
  "",
  " repeated",
  "oral",
  "Hydrocodone",
  "(pill / tablet)"
 ],
 "report": "<p>Yes, I am a board certified internist. At the time I was in solo private practice in sweet home Alabama. Vicodin/Lortab was my DOC at the time and I had somehow worked my way up to 50mg at a time about every 5 hours (about 25 to 30 a day). Can we say physical tolerance? That liver can do amazing things with the crap we digest.</p><p>As expected, drowsiness became an issue and I can't have that taking care of the sick. I researched the available amphetamines on the market and corresponding costs. Understand now that these drugs have a Schedule 2 rating by the DEA (which also means they are registered in an electronic database every time they are dispensed in AL). The other issue is that they are only FDA approved to treat narcolepsy (sudden falling asleep events) and the misused and overused diagnosis of ADHD. Without hesitation, I wrote the script for Adderall XR 30mg for my wife using the diagnosis of narcolepsy. I also casually informed her that this drug also has the side effect of appetite suppression, and you know she wants to keep that girlish figure!</p><p>The script was filled without incident, I wrote for only 60 and no refills. I needed to work late that evening, so I took 2 pills (orange) out of the bottle and only popped one. I had already taken my next 'scheduled dose' of the painkillers. I had a cup of coffee also at the time. When I arrived back at the office, the chemicals were hooking up to their respective brain receptors as expected. Vicodin for me is a great mood uplifter, but the Adderall amplified this 10 fold! Talk about rollin. I was able to work like a demon for the next 5 hours straight, but often found myself getting sidetracked by looking up information in medical texts. I returned home around 1 am, still tweaking. I worked for another 2 hours on chartwork. I thought I should at least lie down for a few hours since I needed to be up at 6am. Lying in bed, I was still quite euphoric and never really fell asleep.</p><p>A couple of interesting side effects that stood out were a keener sense of smell, and the insatiable desire to scratch my scalp. So much so that it was quite sore and irritated the next morning while washing my hair.</p><p>The daily use of this combination continued for the next week or so. I also developed the compulsion to pick at my skin. Amphetamines increase oil gland secretion and worsen any acne. My face suffered the same and neurotic excoriations developed. My appetite was suppressed, and I hardly ate. Falling asleep was difficult and I started to become sleep deprived. I could ride the wave of being high for only so long. Without sleep and regularly eating, the body is going to demand payback. It did so also with a vengence. I experiences a serious depression episode. Any memory of the euphoria faded quickly.</p><p>The greatest consequences I would face were soon on the way. The medical boards and DEA are not stupid. They watch doctors like hawks and are swift to punish. Pharmacies reported me to my employer which led to a forced voluntary resignation. You now have no source of income. My medical license was revoked and DEA controlled substances writing privileges suspended. But the bright ending here is that I have been clean of painkillers and amphetamines for nearly two years now. There is also a strong possibility I will regain my medical license.</p>",
 "year": "2004",
 "id": "58749",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-06-24T07:00:00.000Z",
 "views": "33380",
 "dose": {}
}
