{
 "title": "Tossed Forth to Hades",
 "author": "Snafflehag",
 "citation": " Snafflehag. \"Tossed Forth to Hades: experience with DMT & Syrian Rue (ID 58801)\". Erowid.org. Jan 20, 2007. erowid.org/exp/58801",
 "substance": "DMT & Syrian Rue",
 "bodyweight": "135 lb",
 "report": "<p>This is mostly a second hand account, which is not ideal, but its a result of my girlfriends lack of time (busy student) and lack of dedication towards documenting her trips.  It drives me nuts, but I am a relentless drug geek and like to document everything.  As a consequence Im offering up this mixed account, because I think it provides some unusual data for consideration.</p><p>Some background:  A few weeks ago I had an incredibly strong and profound experience via 50 mg of DMT rendered orally active with 3 g of ground Syrian rue seeds (Report ID: 58800).  My girlfriend was eager to repeat the experiment for herself at a lower dose (because I had my ass kicked royally), and tried 3 g of Syrian rue seeds and approximately 30 mg of DMT. As it turns out, the combination made her very sick, and she spend most of the experience in bed throwing up, with only very minor psychedelic effects.  Not giving up, she tried the experiment again yesterday, as follows:</p><p>00:00   Dosed 1 g Syrian rue 10x extract (hoping for a cleaner effect).</p><p>00:40   No significant effects noted, added one gram ground Syrian rue seeds.</p><p>01:00   Dosed 37 mg of powdered DMT crystals</p><p>01:20   resting peacefully on sofa</p><p>01:55   Puked, revealing undigested Syrian rue.</p><p>02:10   Feeling significant body load, difficulty walking, but no psychedelic effects.</p><p>03:00   Still very sick, no psychedelic effects  puked again</p><p>03:20   Sickness seems to be abating, just had a cup of soup</p><p>It was at this point (which should have coincided roughly with the peak experience), due to the sheer disappointment over another uneventful experiment I suggested she try smoking some DMT. She readily agreed, so I measured up 25 mg and assisted her with the pipe.  What occurred next was interesting indeed (my notes):</p><p>03:30  - Smoked approximately 25 mg of DMT and laid back on the sofa</p><p>03:40  - Only vaguely responsive to my prompts, other than moaning, facial twitching.</p><p>03:50  - No noticeable changes. Barely conscious. Minor body movement.</p><p>04:05  - No noticeable changes, very unresponsive, just moaning, breathing.</p><p>04:20  - Still very difficult to talk, just beginning to come out of it.</p><p>04:30  - Able to communicate once again, but still feeling a strong body stone.</p><p>What one may notice here is the inordinately long duration of effects. I had fully expected her to begin coming out of the experience at about the ten minute mark, as is common for smoked DMT, but the trip was fully captivating for almost a full hour!  I was able to coerce her into providing some documentation, and she conveyed the experience as follows:</p><p> This trip was like being thrown into an inferno, in the deepest pits of hell, and having pure evil boiled out of me. Im not talking simmered  Im talking about being brought to a rapid, rolling boil. It was INTENSE. I remember thinking Holy shit, I had no idea it could be like this! but all that could escape my lips was a barely audible Wow. There was a loud humming sound, like the sound of a didgeridoo that enveloped me. It was absolutely maddening. At first I thought it was my boyfriend, who was trip sitting for me. But then I realized that he wasnt making any sound at all. Then I thought it was the music, but it didnt stop when the song ended.  I couldnt move, I couldnt talk. All I could do was moan and whine in the hell that I had created for myself. My rational mind had not left me entirely. I kept telling myself over and over in my head, Its okay this too shall pass. This cant last forever  and by the way, you asked for this  this is what you wanted and now youre getting it, so suck it up and take it like a warrior should .</p><p>Summary:</p><p>When the 37 mg of oral DMT failed to have any psychedelic effects, I assumed the MAOI had failed to do its work. However, surely the intensity and duration of the subsequent smoked DMT was potentiated by the MAOI.  It had not occurred to me that MAOIs could effect a dose administered by smoking, but it seems probable that this occurred. I would love to have more data on the phenomena but am unable to find any. I hope this report provides useful to others. In the least it only reinforces the notion that one should use great care when working with MAOIs.</p>",
 "year": "2006",
 "id": "58801",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-01-20T08:00:00.000Z",
 "views": "23448",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract - 10x)"
  },
  "1": {
   "time": " T+ 0:40",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(seeds)"
  },
  "2": {
   "time": " T+ 1:00",
   "amount": "37 mg",
   "administration": "oral",
   "substance": "DMT",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": " T+ 3:30",
   "amount": "25 mg",
   "administration": "smoked",
   "substance": "DMT",
   "form": "(powder / crystals)"
  }
 }
}
