{
 "id": 5881,
 "title": "And Then, There Were Ducks",
 "date": {
  "submission": "2008-01-04T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "BlindMind",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "cookie/food"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "plant material",
   "specific": "Cigarettes"
  }
 ],
 "report": [
  "Set/Setting: An afternoon in a scenic park with rolling hills, beautiful trees, a lake inhabited by ducks and geese, dated stone walls, and a nearby cornfield. The sky was slightly overcast with several discernable rays of sunshine seeping through the clouds. The smell of impending rain was omnipresent. Mood was positive, shared by all those who took part.",
  "People Involved:",
  "Myself (With a good amount of psychedelic experience)",
  "Friend W (Same credentials as myself)",
  "Friend S (Freshly realized pothead, no prior psychedelic experience - I am to be his 'guide', of sorts)",
  "Substances Consumed:",
  "Mushrooms, High-quality Cannabis, Clove Cigarettes",
  "Medications:",
  "I take Dexedrine infrequently for mood and attention, but would not identify myself as a regular user of it.",
  "At approximately 4:45 PM, W ate a 'little less than half' an 8th, or approximately 1.5 grams, of raw Mushrooms. S and I each ate one Mushroom Chocolate containing anywhere from 2.0 - 2.5 grams each; however, I'm estimating the latter, given the intensity and duration of the Experience.",
  "T + 0:30 First effects felt at 5:15 PM, immediately following the smoking of a bowl of Cannabis between the three of us. We exchange conversation while smoking some clove cigarettes.",
  "T + 0:45 A large body-stoning effect is noted by all three of us - typical. We agree that colors are brighter - definitely the beginning of a 'psychedelic awareness'. However, my first clue that the intensity of this particular trip would exceed my expectations lay in the sheer volume of color-saturation that I was already experiencing. Another bowl was shared between us.",
  "T + 1:00 Slowly taking in the onset, I lie down on a hill, staring lovingly at the trees surrounding us and looking out onto hilly planes in the distance. The one large tree in the center of the distant hill caught my attention in particular. I decided that music would be a great lift-off catalyst, so I played a Northern Exposure disc by DJ's Sasha and Digweed. This heightened the experience immeasurably!",
  "As if on cue from the music, branches began swaying, melding into each other. Some particularly thin ones form spirals which mesmerized me. Definitely picking up. Now, I apologize to you all, for at this point time became meaningless and was no longer recorded until the end of the trip.",
  "The sky seemed to sparkle and shimmer with some psychedelic 'flow', and the clouds seemed to erupt with a white brilliance that seemed astounding. Shortly following these novelties, the entirety of the sky began to ripple. A large mouth formed from the branchs of a nearby tree, moving in such a way that it seems to invite me to look inside it. I obliged, and began to stare into the innermost depths of the tree's existence. I can only assure you that, at the time, the aforementioned statement made complete sense to me! There came a noticable feeling of tranquility over me, and I mentally noted how connected I felt with my surroundings.",
  "Trees began to dance to the music, and bubble up like erupting mushroom clouds. The dance of the trees was erratic in its nature - the trees would be in one position, and then suddenly switch to a new one, and a new one, in quickly moving frames - I compare it to what someone would see while watching a person dance through the obscurity of a strobe light. The grass felt exquisite to the touch, although my skin also exhibited the sensation of insects crawling all over it. This turned out to be only mildly uncomfortable. The music turned the trip in such an intense direction visually and mentally that I had to turn it off to preserve my state of well-being.",
  "This whole first portion of the experience felt uniquely earthy and organic, as is characteristic of Psilocybin. Feelings of 'one-ness', returning to the earth, and the immeasurable joy over the uniqueness of Earth amongst the entirety of the void of space, continued to blanket my mind. I began thinking about the various forms of life on Earth and their sublime nature. How did they get there? Why are there so many species? Of what universal plan do we seem to be an ignorant part of? I have considerations of 'returning to my roots', followed by very intense CEV's directly reminiscent of Mayan/Aztec/Shamanic qualities.",
  "I had one particularly intense vision of a yellow temple, with rows upon rows of what I would describe as blue and green monk-like figures filing into its doors. The door itself became engulfed in a soft, red light, and when the last of the 'monks' entered the void, the door became a glowing red circle located in the dead center of my vision, and the temple disappeared. It reminded me of the red spot in the center of Carlos Castaneda's field of vision upon ingesting the Datura extract for the first time in 'The Teachings of Don Juan: A Yaqui Way of Knowledge', for those who have read it.",
  "I happen to glance down at my shoes. The base of each shoe expanded and flattened as if melting/melding into the Earth; this provokes further feelings of unity with the planet. I smoked a clove cigarette and watched smoke trails leave my mouth and nose, which was a very beautiful sight.",
  "After about an hour of this intense inner exploration, I remembered to check on S and see how he is doing - after all, it would be most preferable if his first experience was a fondly memorable one. I saw that he was lying down, about three feet from me, listening to some Jazz/Rock music, which I can hear through his headphones. He appeared to be taking in the experience with what I correctly perceived as absolute awe. I ask if he is alright, and he confirms that he's doing wonderfully. Relief! Feeling empathetic, I turn to and ask W how he is doing. He replies that he's feeling groovy, but has no visuals given the markedly lower dose he took. He claimed to have a more body-oriented experience accompanied by some very deep thinking.",
  "I propose walking down from the hill to the lake. To my joy, we discover a small bridge that extends approximately halfway into the center of the lake, onto a small circular patch of land. In the center of the 'island,' as it were, was a small overhanging japanese tree, whose branch style formed a very pleasing 'dome' of branches and leaves under which was a wooden bench. We sit down, and S pulls out an apple and eats it while I talk with W quietly. Suddenly, and to our extreme delight, three ducks waddle up to us and sit down, as we talk to them and enjoy their presence. It is clear they are there for the remains of S's apple, but we enjoy their seemingly absurd look and beautiful feathers nonetheless. S tosses them his apple core and they go nuts over it. To my surprise, after the rest of the apple is devoured by the ducks, they stick around with us and hang out, quacking, darting around, and generally providing laughter and amusement. I truly enjoy viewing wildlife while on any psychedelic substance, but Mushrooms had to be one of the best for interacting with the Earth's creatures.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "Unfortunately, at that point, a family with 2 children comes onto the island. S and W are visibly disturbed by the children's presence and laughter, but I found myself viewing them fondly, wishing to mimic the carefree nature of their movements but daring not, in case I would alert the family that our group was not in our right minds. W decides to drive (carefully mind you!! I would -never- recommend this action to someone without extensive experience in dealing with the perceptions induced by psychedelics, and in general do not recommend the practice of driving intoxicated at all...) to his house which is located about ~4 minutes from the park.",
  "Upon arrival, we sprawl out on W's back porch on couches, and S and I have another cigarette as we listen to the distant thunder, preceding the rain that we knew was coming but delightfully accepted. It then began to lightly but steadily rain, but it was a beautiful rain, highlighted by the setting sun shimmering over the tops of the trees, through the falling water. We listen to a funk-jazz album along with the sound of the falling rain, and it sounded absolutely *orgasmic* to my ears.",
  "At this point, I'm still having more CEV's, and when I open my eyes after watching them for a time, the entire room appears to be alive with color and movement. I take note that prolonged exposure to CEV's seems to provoke OEV's, in a good way. I would estimate this to have been about 7:00 in the evening (T+ 2:15) but have no real idea.",
  "After around forty-five minutes, we walk outside, S lies down by the pool and W goes to the bathroom. I locate a small grassy knoll near the backyard woods and sit in it and begin to meditate, looking at the surrrounding plants and watching a trail of ants as they worked. I noticed that, if I focused on any one piece of material surrounding me (examples being an ant's body, a fern, tree bark, or a rock) I could make out very minute and otherwise imperceptible details. Meditation has never come to me easily, but I felt that the whole trip's predominant motif of 'coming home again' really facilitated, in me, the desire to give it a try. Let me assure you, it was well worth it!",
  "Mushrooms are great for introspection. W gets the idea to drive 20 minutes to his brother's now-vacant apartment. We agree, as at the time it was an intriguing idea. The drive to the apartment was pretty awfully restricting, and when we got there we found the superintendent had changed the locks. Obviously disapointed, but still remaining positive, we had to just return home. By the time we first arrived at the apartment, all three of us felt that we were noticably coming down. I recorded this time to be around 8:30 (T+3:45).",
  "On the way home, we stopped at an extremely large and well-known nature reserve, and decided to smoke a bowl of Cannabis near roughly fifteen deer as they grazed in the setting sunlight. I found this particularly beautiful, because the deer did not appear to be disturbed by our presence in any way. I thought to myself, 'They know we will not harm them. Psilocybin opens mental channels between the brains of co-existing mammals, and transmits inherent messages of peace between them.'",
  "We completed the drive back to W's house, and played some Psy-Trance music to a setting of lit candles, black lights, and Tibetan meditative incense - which was particularly pleasing to the senses. After smoking one more hit from the passed-around pipe, strong tracers come back to me and I became elated. After about thirty more minutes of residual psychedelic effects, we went downstairs and gorged ourselves with bananas, exotic organic potato chips, and Hemp granola. Delicious!",
  "T + 4:15 We decided to watch South Park while eating, and I found the absurdity of the show almost enlightening because it was so funny to me. I was very relaxed, optimistic, and pretty peaceful at this point, and yet I knew that in as little as forty minutes, it would be appropriate for me to head home.",
  "T + 5:10 We went out to have a smoke before I left.",
  "T + 5:25 S and I left, and I dropped him off at his car (still parked at the park we were at originally). I then drove myself home.",
  "T + 7:30 I am quite 'low' (as opposed to uppity, high and euphoric) and lay in my bed listening to Expeditions disc 1. I smoke a bowl of straight Cannabis leaves as a sleep aid and it took roughly an hour before I am able to sleep, although the bed felt very soft and warm against my skin - a feeling I would compare to that of an Opium-induced warmth.",
  "The next morning I woke up peacefully, with optimistic undertones that seemed to follow me during the rest of the day.",
  "Conclusion/Summary:",
  "In retrospect, this was a very nice and touching experience for me, and I was quite thankful that it went well. Intriguingly, I somehow 'knew' all along that this experience would feel very 'right'. It had been some time since I had last experienced Psilocybin, the last time was in early February, 2004, but it is the psychedelic with which I have the most experience.",
  "One thing I was able to notice, in comparison with my *wildly* successful LSD experiences, is that there is a LOT more potential for a 'mind fuck' on Mushrooms relative to LSD. One may be able to control the direction of an LSD trip more effectively than that of the Mushrooms. However, I feel that being able to control the direction of a positive Mushroom trip, given its seemingly inherent challenge to do so, has a remarkably better payoff than being able to control the direction of a positive LSD trip. Don't mis-take my words, though; both can be *quite* profound."
 ],
 "erowid": {
  "id": "36048",
  "citation": " BlindMind. \"And Then, There Were Ducks: experience with Mushrooms & Cannabis (ID 36048)\". Erowid.org. Jan 4, 2008. erowid.org/exp/36048",
  "substance": "Mushrooms & Cannabis",
  "views": "2656"
 }
}
