{
 "title": "Chronic Pain Management",
 "author": "Grendel",
 "citation": " Grendel. \"Chronic Pain Management: experience with Hydrocodone & Cannabis (ID 58902)\". Erowid.org. Mar 4, 2009. erowid.org/exp/58902",
 "substance": "Hydrocodone & Cannabis",
 "bodyweight": "250 lb",
 "report": "<p>I have chronic joint pain all over, at least partly due to osteoarthritis, and a crippled arm from an old accident. Now in my 40's, I know I'm going to be in pain every day for the rest of my life. At night, it's typically around a 5-7 on the common 0-10 scale. Somewhat better during the day, except in bad weather.</p><p>Vicodin will bring the pain down 2-3 'points'. Lower strength non-opiates don't even touch it anymore. Winter often gets bad enough I have to double-up on the dosage, which scares me. Opiates eventually lose effectiveness, and you have to change to stronger ones at increasingly higher doses, with a very real risk of physical addiction. Not to mention what all the acetaminophen in Vicodin is doing to my liver (3 grams a day!).</p><p>I'd smoked plenty of pot in my younger days, but had trouble keeping it under control so had to give it up. These days it seemed I had a lot less to lose and I gave it another try. To my surprise, 3 tokes from a bowl will knock 4-5 points off my pain, easily outperforming even a 15mg double-dose of Vicodin. Relief lasts about 3 hours, verses 4 hours for the Vicodin. Plus Vicodin takes an hour to build up, while pot's working in a few minutes.</p><p>This small dose of pot leaves me less mentally affected than the Vicodin does, and in a much more pleasant direction (even so, I don't drive after smoking, or while double-dosed on Vicodin). It's also had a dramatic effect on our sex life, making my wife happier as well as me. I have trouble climaxing on opiates, and was usually in too much pain without them to be interested in sex, a nasty Catch-22 that was really hurting us.</p><p>It's insane that I could go to jail for possessing an ounce of marijuana, yet can legally buy a bottle of 120 Vicodin every month (far more than enough to be fatal). Crazy world.</p>",
 "year": "2006",
 "id": "58902",
 "gender": "Male",
 "timestamp": "2009-03-04T08:00:00.000Z",
 "views": "11461",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Hydrocodone"
  }
 }
}
