{
 "id": 5891,
 "title": "Three Extractions",
 "date": {
  "submission": "2008-01-04T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Durden",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Poppies - Opium",
   "form": "tea"
  },
  {
   "time": "0",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Poppies - Opium",
   "form": "extract"
  }
 ],
 "report": [
  "Be forewarned that I have a fairly high opiate tolerance; I commonly take 25mg of hydrocodone at a time.  That said, here are my first few experiences with poppy seed extractions.",
  "|| Poppy seeds, oral, 400g ||",
  "To extract the goodies from the seeds, I poured 400g poppy seeds into a Pyrex bowl and added enough lemon juice to make a thick soup.  I let it sit for 30 minutes, stirring every 5 minutes.  I then strained out the lemon juice into a cup, then rinsed the seeds several times with water, each time straining the liquid into the cup.  I ended up with 18 ounces of light brown, very sour liquid.  I mixed in a tbsp of honey and some apple juice to make the mess easier to drink.",
  "[5:30pm]  Drank the liquid.  It tastes basically like lemonade.",
  "[6:00]  I feel a bit nauseous, but nothing I cant handle.  I also feel a little light-headed, but this may or may not be due to the seeds.",
  "[6:15]  I am beginning to feel a standard opiate euphoric buzz.",
  "[6:30]  The buzz is growing quickly.  I now feel as if I had taken approx 10mg hydrocodone.",
  "[10:30]  The buzz has been pretty much constant up to this point, but I have been getting some pretty powerful waves over the last few minutes.  I have been battling slight intermittent nausea the whole time, but nothing too bad.",
  "[12:00]  The euphoria is beginning to subside.",
  "[1:00am]  Baseline.",
  "|| Poppy seeds, oral, 1lb (454g) ||",
  "This time I decided to do the extraction a little differently.  First I mixed in the entire pound of seeds with 5oz lemon juice and water to the top of the seeds.  I let it sit for an hour this time, stirring twice.  After rinsing and straining a few times, I ended up with 20oz of yellow-brown fluid.",
  "[7:00pm]  Chugged the whole mess.",
  "[8:00]  First hints of an opiate buzz.",
  "[8:45]  Definite euphoria, like maybe 10mg of hydrocodone.  No nausea this time.",
  "[9:30]  This is noticeably stronger than last time, more than would be accounted for by the additional 54g of seed; my guess is that either soaking longer helped a lot or these seeds were stronger.",
  "|| Poppy seeds, smoked ||",
  "I decided to try and smoke an extraction.  I used the same extraction method as last time with an entire pound, except with only 1.5oz lemon juice to keep the excess material in the extraction to a minimum.  I then poured the liquid into a pan and baked it on 300 degrees for around 2 hours.  A razor blade paint scraper served very well to get the gunk off the pan and into a pipe.  I put half of it into a pipe, and smoked roughly half the bowl (the extraction from a quarter pound of seed).  My head immediately felt inflated like a beach ball, my face felt very hot and flushed, and I felt very euphoric.  However, I tried smoking more of the extract on two separate occasions and it didnt work either time.  Which is to say, I dont know if smoking the extract works or not."
 ],
 "erowid": {
  "id": "36085",
  "citation": " Durden. \"Three Extractions: experience with Poppies - Opium (ID 36085)\". Erowid.org. Jan 4, 2008. erowid.org/exp/36085",
  "substance": "Poppies - Opium",
  "views": "15946"
 }
}
