{
 "id": 5892,
 "title": "The Energy That Controls Reality",
 "date": {
  "submission": "2008-01-05T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "bowls"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 ],
 "report": [
  "Mindset and Setting:",
  "I was at a friends house with three of my good friends.  The room was well lighted.  We were all in fairly relaxed and somewhat talkative moods.  I was sitting comfortably on a sofa.  I had tried salvia about 4 times before.  I should also mention that I am a very rational person who tends to be skeptical of reports of paranormal activity.  This makes my trip all the more strange. ",
  "The Experience:",
  "I smoked two fairly large bowls of the salvia through a bong.  I felt the effects as I was smoking the second bowl.  The effects were actually not any different from the previous 4 times I had used salvia, but this was the first time I was able to actually put my finger on the strange sensations running through my mind. ",
  "I had a strong sense that everything going on inside of me and in the room I was in was being controlled by masses of energy floating through the room.  I could sense the shapes and locations of the energy in the room.  I also both physically felt the masses of energy as they flowed through me, a sort of powerful but painless electrical field, and saw how the manifested themselves in me and in the world around me.  Its manifestations varied.  An example:  At one point, I knew a wall of energy was approaching me.  My friend made a joke, and just as the energy passed through me I laughed hysterically at the joke.  I felt that I was no longer controlling my actions; it seemed that the energy was controlling my actions and that I was simply experiencing them.  Because I could sense the energy flowing in the room in very definite shapes, I had a strong sense that I could foresee the future.  Though I question that sense, I am intrigued by the fact that my actions were fairly logical and normal despite the fact that I seemed to have no true control over them. ",
  "The trip lasted for about five minutes.  I had no visual or auditory hallucinations; I simply had the distinctly altered reality I have described.  As the trip faded, so did my sixth sense of the energies.  Another interesting aspect of the trip was that the reality I was in felt entirely normal.  Thus, I was not at all scared or disturbed.  I think that this sense of feeling normal is why I had so much trouble describing my previous four experiences.  In each of those experiences, I couldnt figure out what about the reality was any different than my normal reality.  I have felt this same sense of an altered but seemingly normal reality before when taking mushrooms. ",
  "It is strange to me that every time I have done salvia my reality has shifted to such a specific bizarre reality."
 ],
 "erowid": {
  "id": "36088",
  "citation": " Anonymous. \"The Energy That Controls Reality: experience with Salvia divinorum (ID 36088)\". Erowid.org. Jan 5, 2008. erowid.org/exp/36088",
  "substance": "Salvia divinorum",
  "views": "2943"
 }
}
