{
 "title": "I'm Glowing White",
 "author": "1337|train",
 "citation": " 1337|train. \"I'm Glowing White: experience with Mushrooms & Cannabis (ID 58936)\". Erowid.org. Oct 5, 2007. erowid.org/exp/58936",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " T+ 0:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 0:45",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>Alright, let me start things off by stating my prior drug use/experience. I am currently a Sophomore in college and before college I had smoked weed once and that was the extent of my drug use before college. However college changed things and I tried a few more substances before giving the magical mushroom a go. Before this experience happened I had smoked weed on numerous occasions, alcohol, MDMA and LSD.  One thing to note about my LSD use is that the doses had been improperly taken care of and were extremely weak when I took it.</p><p>I had been wanting to trip on shrooms for such a long time. I had been reading about the possible effects, dosages and other useful bits of information. I had decided that I would take an 1/8 and then see how that goes. Shrooms are fairly easy to get around here so I figured that I would get some and eventually trip with my friend. So I call up my friend, we'll call him A and he said he would be in town with a half ounce of shrooms and that I should stop by and get them when he gets there. So I head over and buy the shrooms, my friend A had taken an 1/8 about 10 minutes before he got there. Once he got there I purchased them and this is where the 'plan' changed.</p><p>I decided to take an 1/8 with him that night, along with another friend of mine, we'll call him B. We did no prep, which probably was a bad idea however the trip ended up fine.</p><p>Setting: For the most part I was tripping in one room for the whole time. There is a smaller sized living room with a television, this television has blacklights all around it, large speakers on both sides and then the living room is connected to the kitchen. Also, the couch that I spend the most of the time on has a wall full of posters to look at. They also have those 'party' lightbulbs everywhere, with the weird pale purple, pink and other colors. So, needless to say, the room is extremely colorful.</p><p>T+0: The shrooms are eaten raw with water, probably on around a half empty stomach. We sit and decide to smoke a bowl or two of some high quality marijuana before the trip completely engulfs us and to minimize the stomach discomfort.</p><p>T+30mins: I can feel the shrooms coming on very slightly. I have a minimal body high, and things start to glow, almost as if everything is slowly being wrapped in plastic wrap, giving it a shine. My friend B goes off into his room and plays his guitar as well as look at some things online while waiting for the mushrooms to come on.</p><p>T+45 mins: At this time, for some reason I notice all the minor effects I had before have completely vanished and I feel let down because I feel nothing at all. So I do the whole 'I am not feeling anything' so I decide to take more, which topped my dose out at 5 grams for the night.</p><p>T+1 hour 30 mins: Around this time I notice no effects except my stomach starting to get upset. I have acid reflux diesease and I notice that sometimes after taking drugs orally, usually shrooms and MDMA I get slight stomach discomfort, I have learned that this can be easily avoided by taking a few Tums before dropping. However, since I did not this time I notice my stomach begins to hurt even more and more. Eventually it gets so bad I feel like I am going to vomit. I run outside and vomit off their balcony and feel much better afterwords. After I did this, it is almost as if my trip went from nothing to full on hallucinations. We decide to turn on the program 'boobahs'. For anyone who is unfamiliar with these guys, they are pretty much a souped up version of the teletubbies. Normally this would bore me, however I was laughing extremely hard, as all the colors on the screen were extremely vibrant and I could literally taste all the colors on the screen.</p><p>T+ 2 hours: We are still watching boobahs and the hallucinations have become extremely intense. The boohbahs, the walls, everything is breathing. I'm sitting on this couch and I feel the room breathing around me, the floor, ceiling and walls are all breathing, which is making the room smaller, then larger as the room breathes in and out. As the episode of boobahs we are watching ends, we are just sitting on the couch looking around the room seeing all these things move and change like I had never seen before. I felt as if I was seeing everything for the first time. The simplest of objects has me astonished at their mere existence.</p><p>One of the best examples was this Dave Matthews Band poster that they had on the wall. It was a black poster with 3 panels on with some abstract art. Stared at this poster forever, I watched it morph into faces, continents, pretty much anything my mind wanted this poster to be, it became. Eventually the poster melted down the wall into a puddle and then a small white rabbit jumped out of the puddle and then dissipated into the air. As this is happening I'm watching this with my jaw on the floor.</p><p>T+ 2Hours 30 Mins: As our trip continues, people start showing up at this house to hang out with the other roomates. They are all smoking marijuana and getting very high. They all come and start playing donkey kong country 2 for SNES. This game is very fun to watch as I am tripping extremely hard and the whole TV is talking to me. So here I am in this world where everything is breathing, talking and well, LIVING.</p><p>Every now and then people check in with me to make sure I am okay, which I reply to yes. I later find out the reason why people were asking me if I was okay was because I was silent for about 80% of this trip because I could not talk due to the intensity of the trip. One person asks me how my trip is and I reply with 'Where the fuck are A and B, how are they not laid out right now?'. They were off doing their own thing, visiting with other people etc. Which I did not understand how that was possible, I later learned that they did not take more, as I had done</p><p>T+ 3 Hours: The trip is starting to peak, the hallucinations are getting more and more vibrant and intense. Talking with anyone is extremely hard and I feel when I talk to someone I have to make a visual 'connection' in order to communicate with them. Now this is the part of the trip that is the hardest for me to remember, the peak. From what I have been told about my peak, I sat there for around 45 minutes with my eyes closed. And I actually remember this, I could see as if I had my eyes open, however everything was very, VERY different.</p><p>I was pure white, my whole body was a very vibrant white, and I had very few characteristics that would show through this 'whiteness'. I had a glow to me and everything in the room was also glowing. The coolest part was that I could only see other people (with my eyes closed) that were not sober. The people that were the most vibrant were A and B, then the people smoking, and I could not really see anyone who was sober, it was like they were not fucked up enough to be in 'my world'.This whole thing went on for another 1 or so, where I could not talk and had my eyes closed the entire time, yet I was still there and able to see everyone.</p><p>T+ 4 Hours: I am getting very tired from the 'mind exercise' that I am getting. I am constantly thinking and manipulating things with my mind and the fatigue is starting to show. I ask one of my friends there if he will drive me home and he says he will. So I start heading home and while riding in the car tripping I could not believe the way the world looked. Roads look like they go on forever, even if they only go a block, kind of like that Jerry Bruckheimer intro to the movies, with the lightning etc. And one thing that I also noticed is that I wanted to eat everything, and I mean everything. I wanted to eat a car's tail light because it was red and I could taste cherries in my mouth, which made me want to eat it. I get home and my trip is on the last leg.</p><p>T+5 Hours: Most of the hallucinations are gone, I have some slight tracers but nothing else. I smoke a few bowls of marijuana which bring me backup for a slight period of time then I fall back down.</p><p>Overall this trip was absolutely amazing and was the most fun ever. I made the mistake of tripping two days later when I knew I did not want to trip and had a terrible trip, so I will not be taking shrooms for a while. However one goal I have is to trip here in the summer since we have one of the most beautiful campuses in the Nation.</p>",
 "year": "2006",
 "id": "58936",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-05T07:00:00.000Z",
 "views": "3121",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
