{
 "title": "Good Aphrodisiac/Mood Enhancing Tryptamine",
 "author": "psilocybonaut",
 "citation": " psilocybonaut. \"Good Aphrodisiac/Mood Enhancing Tryptamine: experience with 4-MeO-MiPT (ID 58956)\". Erowid.org. Feb 22, 2007. erowid.org/exp/58956",
 "substance": "4-MeO-MiPT",
 "bodyweight": "120 lb",
 "report": "<p>I received a 50 milligram sample of 4-MeO-MiPT Fumarate a few days ago.  Last night, my girlfriend and I each tried snorting an amount of it.</p><p>From what I've heard of this substance, it is a tryptamine with effects somewhat similar to 5-MeO-DiPT (foxy) from what I have heard so far.  There are not many human trials, and notably NONE that used insufflation, so that's why I'm writing this up.</p><p>This is my first trip report ever, so bear with me....</p><p>It was me and my girlfriend (who is not nearly as experienced with psychedelics). I snorted 28mg and she snorted around 22mg of the 4-MeO-MiPT Fumarate. The chemical burned our noses and the drip tasted thoroughly bad, leading my girlfriend to vomit a few hours later. I had to drink soda for about 20 minutes to get rid of the drip, and I snorted a little water 40 minutes after to get rid of the burn, though it was already going away slowly.  The chemical took about 20 minutes or so to kick in.</p><p>I think 4-MeO-MiPT could be explored further as an antidepressant, a definite erotic enhancer/aphrodisiac, a social lubricant, or just a 'feelgood' type of tryptamine. It lasted a few hours, I didn't really pay attention to time however. Me and my girlfriend enjoyed it. I felt a little bit like I was under the influence of a tryptamine, my pupils were dilated too, and I was getting giggles/hysterics, but there was absolutely no visual activity except for the normal effects of dilated pupils (things seem brighter). I had some of the best sex I've had in a damn while (3 times), and I could tell that my drive and pleasure was enhanced from the tryptamine. True aphrodisiac power I think. There was an ecstacy-like vibe to the feeling, maybe empathogenic effects (there is no unneeded stimulation or amphetamine-like effects from this one though). There was a strange 'good' feeling throughout my whole body while I was on it, and I felt as if the chemical had some antidepressant properties. I felt VERY short bouts of nausea a couple of times throughout (like for 1 second I would feel a bit nauseous then it would go away).</p><p>My girlfriend vomited a few hours into it, and I think mostly from the remaining drip. She was also complaining of a stomach ache, but I have no idea if that was due to ingestion or not. None of these things happened to me, maybe I have a stronger stomach.</p><p>I insufflated the chemical at around 9:00PM, and fell asleep comfortably at around 1:30AM - 2:00AM. It was a fun experience for me and my girlfriend both.  It seemed that the chemical lasted about 4 hours or so.</p><p>I have never tried 5-MeO-DiPT (foxy methoxy), but from the reports I have read, it sounds like this is the compound whose effects come closest. I would recommend it not to someone looking to 'trip', but to someone looking for a more mild, enjoyable, and fun experience. I did not reach above a ++ the whole time. I definitely did not hit a +++. I had fun, and would do it again (though I would prefer a tryptamine that has more visual effects), but I would not pay to order more of it, it's not worth that much to me.</p><p>This chemical felt to me like the dose needed to be upped, like it wasn't high enough and we possibly were not feeling the FULL effects of this compound. I could be completely wrong, maybe these are the full desired effects with an ambiguous tryptamine like this...</p>",
 "year": "2006",
 "id": "58956",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-02-22T08:00:00.000Z",
 "views": "7816",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "28 mg",
   "administration": "insufflated",
   "substance": "4-MeO-MiPT",
   "form": "(powder / crystals)"
  }
 }
}
