{
 "title": "Watching the One You Love",
 "author": "kenyasqueen",
 "citation": " kenyasqueen. \"Watching the One You Love: experience with Cocaine (ID 5906)\". Erowid.org. Aug 20, 2001. erowid.org/exp/5906",
 "substance": "Cocaine",
 "bodyweight": "",
 "header": [],
 "report": "<p>I met my husband in 1993. He was, as they say, too good to be true. And I guess, as they say, if it looks too good to be true then it probably is.  He was so sensitive, loving and caring. In 1995 became pregnant and had a daughter by him. He was distant during the pregnancy but I won't say it was drug related. (I don't know) In 1996 I started noticing the serious changes in his behavior. He started staying out every night extremely late. Then when he came home he wanted to talk and talk and talk. About everything under the sun.  It would be 4:00 in the morning or later.  He would stay up for hours telling me how much he loved and appreciated me. </p><p>This felt good I must admit but after a while I grew suspicious of the company he kept and his actions.  He was supposed to be selling the stuff but I never saw any of the profits. I would find pieces of paper in his car broke off at the ends. I guess to scoop it. I am not sure, being that I know nothing about the drug or how you use it.  I would find baggies twisted and twisted until broke off at the corners. Recently I started finding little tiny plastic seal bags that he denied belong to him.  Come on, I would think, how stupid did he think I was. Nobody else in the house had access to that kind of stuff. He kept telephone numbers of known dealers in his wallet or in his car at all times.  His attitude about everything changed. He became non-caring about any and everything one day, to very concerned and do-no-wrong other days.</p><p>See, my husband is the kind of person who likes to be liked. And he is liked by all who meet him. But it comes with a price. He is an excellent father and he is a very beautiful person when he is not out binging. He goes on binges about twice a month and blows anywhere from 150 to 400 dollars. His longest binge has been up to three days.  He comes home very sleepy and numb-looking in the face. Almost like his face is numb from the nose down. He doesn't think I notice it but I do.  He is very sweet when he comes home after being gone for long hours with no contact at all. Even though he is sleepy he will help clean the house or offer to do things he would normally not ask to do. My guess is either because the drugs have him up and he can't sleep, or because he feels guilty.  Some nights he is so wired until he comes to bed but can't sleep so he is out on the chair just watching TV for hours. He says it is because he is horny and I won't give in but I doubt it. Either way it annoys me because I know the deal.</p><p>I make excuses for him to people when they notice him acting strange. And it is destroying me. Now after 8 years of knowing him and almost 2 years of being married to him I am living out my worst fears.  The fear of him never breaking free from this horrible demon called cocaine. My guess is that he is snorting it but I can't say for sure.  Now we have 2 kids together. The youngest is 5 months old.  We just recently moved to a new area and I thought things would be different, but stupid me. Boy was I ever wrong.  Now after years of lying to me and me lying to myself not wanting to see the obvious, my suspicions were confirmed about a week ago. He broke down and told me that he has a problem. I am so angry because he is sooo smart and he wants so much in life but this demon is taking him down fast. Well there is a lot more to this story but my time and space are limited. So let me end by saying I do love him that is why I am still here now. The times are more good than bad. I guess that why it seems bearable at times.</p><p>But it is getting worse and worse. But if I don't start to see him jump into getting clean 150% I am taking my kids and me am out of here. I will have to support him from many miles away.  My desire is not to leave, but my desire for my kids to be productive stable kids is stronger. And no matter what I have to do to make this possible I will do, including leaving him to fight this devil alone.  I and my kids do come first. So my prayer is that everything gets straight. He comes across that his desire is to get clean but I am doubtful he is sincere. I hope I am wrong.</p>",
 "year": "2001",
 "id": "5906",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-08-20T07:00:00.000Z",
 "views": "39219"
}
