{
 "title": "Riding the Tortoise",
 "author": "Catfish Rivers",
 "citation": " Catfish Rivers. \"Riding the Tortoise: experience with DPT (ID 5915)\". Erowid.org. Mar 29, 2001. erowid.org/exp/5915",
 "substance": "DPT",
 "bodyweight": "270 lb",
 "header": [
  "DOSE:",
  "100 mg",
  "insufflated",
  "DPT",
  "(powder / crystals)"
 ],
 "report": "<p>100 mg of DPT was measured out and the split into two lines, one for each nostril.</p><p>6 am>  For some reason I woke up at 5 am and can not fall back to sleep. After reading for a few moments, a psychadelic lightbulbs winks on above my head. Everyone else in the house is fast asleep and it's Saturday so they'll be asleep until near 11 am for sure. So, I decide to 'awakenflate.' That's the word that immedietly popped into me noggin after snorting the first line. After the second line was sucked up I sat back against my bedrrom wall, grinned and thought, 'It's gonna be a golden grahams day!'</p><p>6:30>  The burn and the drip were not too bad. More of an annoyance than anything else, but it subsided after about 10 minutes. By this time I had smoked two bowls of MJ and was definately feeling the effects of the DPT very strongly. ++.5 I'd say. My body is buzzing with a pleasant warmth, a psychadelic hug. I feel as if I am inside of a bubble or something. I remember comparing the sensation to ketemine. I had a certain sense of dissociation. Another stange feeling came from my head feeling larger than it really was, as if it was a hot air balloon. My hands also felt like large cartoon hands. Very dreamlike. I have instant and very detailed CEVs that morph rapidly from one thing to another, but it is not the usual mess of colors and starnge geometries. I'm seeing people dancing morphing into a dust storm, landscapes folding over themselves to form new vistas. I was very impressed with the amount of focus I was able to hold on these fantasies.</p><p>7 am>  I put on the new Tortoise CD and am launched into a wonderful session of following CEVs. The music sounds amazing! I have my Gilligan hat on which is acting as an amplifier. There is a direct connection between the music and a state of bliss that I have entered. I feel carried away by sounds.</p><p>7:30> Starting to come down now. I watched the sun rise. Colors were clear and crisp. I could feel myself soaking them in. My body still has a very pleasant buzzing. I could pass for sober now, although I am still very pleasantly high. My pupils are still well dialted.</p><p>8 am> nearing baseline. This stuff has a great duration! If I had to work in an hour I'm sure I could with ease, but I'm glad I don't have to. I ride my stationary bike and find that energy comes readily. I am enjoying the sensation of sweating very much. It feels cleansing.</p><p>The after effects lingered until near 3:30 pm, but were very mild and pleasant. This compound is amazing. I am eager to experiemnt further with this, next time without my journal. I feel that if I was able to go more with the flow I would have had a much more profound experience. This would be great outdoors, listening to water or rain.</p>",
 "year": "2001",
 "id": "5915",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-03-29T08:00:00.000Z",
 "views": "18048",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 }
}
