{
 "id": 5918,
 "title": "VCR Tapes in the Fridge",
 "date": {
  "submission": "2004-08-25T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ny12302",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.5",
    "unit": "cups"
   },
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "tea"
  },
  {
   "time": "1:00",
   "amount": {
    "number": "0.5",
    "unit": "cups"
   },
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "tea"
  }
 ],
 "report": [
  "To prepare this tea, I put several flowers and large leaves from my Brugmansia versicolor (Angels trumpet) in 2 cups of water in a covered sauce pan and boiled it for about 30 minutes.  I then removed it from heat and poured it through a colander and caught the strong tea-colored liquid in a bowl (the darker the color the stronger it is).  I put this in the freezer for about 15 minutes to cool it to drinking temperature.  Note that I have also left leaves soaking in water overnight after boiling, and this seems to result in a stronger brew. After it cooled, I drank a half-cup.  It tasted like water which had vegetables cooked in it and wasn't that bad. ",
  "About an hour later I took another 1/2 cup.  I split the dose for safety reasons.  If I feel the first dose coming on unusually strong, then I know I do not need a 2nd does, or perhaps a smaller second dose. Effects start after about 45 min and peak at around 3-4 hrs later.  During this time I am really delirious.  I then start slowly coming back to reality for several hours after that and try to sleep. I was just hanging out in my apartment doing this.  This is not a social drug.",
  "Visuals:",
  "For me, this drugs causes some visual hallucinations, such as swirly patterns, a clear gel-like ooze on objects.  Everything seems to get a yellowish tinge, and watching the TV can become a real 3-d experience. You may see things moving around at the periphery of your vision, like dust bunnies on the carpet springing to life :)",
  "Eventually my vision becomes extremely blurry if I try to focus on any object closer than 18'.  This will last at least 24 hours.  It really sucks when trying to use the TV remote :)",
  "Mind:",
  "My favorite part of the trip is the communication with people who aren't there.  With eyes closed I will carry on conversations with everyone I know - friends, family, co-workers.  I will be speaking out loud when doing this.  It is SO real, when I open my eyes and see I'm alone, I walk around my apartment looking for them!!",
  "Sometimes I can't interpret what the characters are on TV - my brain just can't assoicate the visual to the memory in order to comprehend what its seeing, so it just appears to be some kind of morphing abstract art.",
  "Extreme Confusion and forgetfullness while on this drug can be funny or just downright exasperating.  I get up off the couch to go to the kitchen to get a drink of water, but when I get to the kitchen I don't why I'm there.  If I'm talking with someone on the phone, I cannot remember their conversation or mine long enough to comprehend it or respond.  I may place things in odd places, like finding VCR tapes in the fridge.  Once I tried to brush my teeth with my shaving gel. ",
  "Physical effects:",
  "I do not really like the physical effects from this plant.",
  "Initially I may have a very pleasant floating expanding feeling in my torso, but that usually gets replaced by a kind of itchy feeling everywhere.  Sometimes not, sometimes very much so.",
  "My sinus passages may dry up to the point they are very uncomfortable.  I found that using a nasal saline spray helps.  You may get very thirsty too.",
  "Walking/moving gets difficult.  I feel like I have lead weights all over my body and my coordination is really bad. ",
  "Talking may become difficult or impossible.",
  "Heart rate goes up.   I tend to get marked vaso-constriction which will make me feel cold.",
  "I can get hand tremors that make it diffult to write or do any task that requires dexterity.  This could last 48 hours.",
  "My skin flushes all over so I am quite red, and this may last for a good 24 hours.",
  "My pupils dilate markedly and stay that way for abour 48 hours.",
  "I would NOT recommend taking brug tea if you have any committments for the next 48 hours that require your full mental/physical capabilities."
 ],
 "erowid": {
  "id": "36202",
  "citation": " ny12302. \"VCR Tapes in the Fridge: experience with Brugmansia (ID 36202)\". Erowid.org. Aug 25, 2004. erowid.org/exp/36202",
  "substance": "Brugmansia",
  "views": "17994"
 }
}
