{
 "id": 5935,
 "title": "Life in Forward, Life in Reverse",
 "date": {
  "submission": "2007-05-23T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "Happy",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I am a 28 year-old male, who just completed a 5-year PhD in biochemistry.  I tried mushrooms for the first time last week, with a fellow student who was also a first-time tripper.",
  "1130 am.  We ate 1/2 eigth each.  Just popped them in and started chewing.  We hadn't eaten for about 2 hours before ingestion, so our stomachs were pretty empty.  We chased with orange juice, took about three hits of marijuana and sat back to wait for an effect.",
  "1145 am.  I am already feeling effects.  It isn't just the pot, as my body feels different - pleasantly expanding and contracting very slowly.",
  "12pm.  Things are starting to pick up.  We are sitting in his back yard on a warm summer day, watching the ground move in wavelike mortions.  I am particularly interested in watching some flies and other insects move across the table in front of me.  Every minute motion is readily apparent.  Intense detail predominates in everything I see.",
  "1215pm.  We decide to head on a walk.  We walk 5 minutes down the road and decide to cut through the power lines to the next neighborhood.  This is when things get extremely weird.  As we walk through the neighborhood, it seems that a new universe is encountered everytime we turn a corner.  Cutting through a park and stepping back onto the road brings us through two totally separate realities.  It is difficult to explain, but as we step off the road, into the park, there is a sudden shift in sight, sound, sensation, perception.  When we step back onto the road on the other side, another reality sets in.  The previous one just seems erased.  This happens repeatedly everytime we turn a corner, wak through the woods, etc.  It is very strange, but enjoyable.  We are loving the visuals and auditory differences that we encounter.",
  "The walk had a surreal quality to it.  At one point, some young boys pass us on their bicycles.  I am reminded of being a young boy myself.  From this point, I experience my entire life history in two directions...from boyhood until the present in forward time, and from death to the present in reverse time.  The trip at this point becomes less visual and very emotional.  I am leaving the country two weeks from now, and saying farewell to the two closest friends I have ever known.",
  "On the way back home, we cut through the power lines again, and upon exiting, we must step over a low gate.  I break down crying before stepping over.  It felt that by crossing the gate I was stepping down a path that had no return.  I knew that returning to the road at this point was a return to reality, and to THE reality that I was soon departing.  I also interpret this as a metaphor for death and the transient nature of life.  I know that returning to reality means a conscious acceptance of my departure and my eventual death.  The other option, it seemed at the time, was to die that very moment - to forego the suffering, pain and loss that is a necessary part of living.  Obviously I opted for life, with all of its imperfections.",
  "2pm.  We arrive back at the house.  It seems that ten minutes have passed, but given the distance we walk, I knew it had to be longer.  We are still tripping pretty heavily, though the effects slowly start wearing off and we are more or less down by 430pm.",
  "Overall, the experience was positive, despite the emotional struggle I went through.  After returning to the house, the struggle that began on the walk continued.  The simplest way to say it is that Life was looking me in the face.  I had two choices- to face it or run.  I didn't panic, but there were times I felt that things were on the verge of spinning out of control.  Toward the end of the trip, I found solace in thinking of my wife.  It seemed that my image of her led me home safely, and allowed me to face departing my friends.",
  "As I said, the effects were less visual/hallucinatory as they were an internal struggle.  At times, I felt that my voice came from very far away, and I had a feeling of disembodiment.  I think the experience I had was a direct result of being at a crucial turning point in life.  Also, in the last year or so, I have realized that life is temporary.  I always knew this, but the reality of it has become more obvious to me of late.  When we're young, it feels like we'll live forever.",
  "The lesson of the trip seemed to be Take nothing for granted.  Cherish the people you love, and the time you spend with them."
 ],
 "erowid": {
  "id": "36316",
  "citation": " Happy. \"Life in Forward, Life in Reverse: experience with Mushrooms & Cannabis (ID 36316)\". Erowid.org. May 23, 2007. erowid.org/exp/36316",
  "substance": "Mushrooms & Cannabis",
  "views": "2751"
 }
}
