{
 "title": "'Thanatos to Eros', Eh?",
 "author": "Erovingius",
 "citation": " Erovingius. \"'Thanatos to Eros', Eh?: experience with LSD, Alcohol & Cannabis (ID 59368)\". Erowid.org. Nov 6, 2007. erowid.org/exp/59368",
 "substance": "LSD, Alcohol & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "",
   "1 hit",
   "oral",
   "LSD",
   "(gel tab)",
   "",
   "3 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "",
   "5.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I obtained 5 gel tabs and 5 blotter tabs of LSD. Because LSD can be a little rough around the edges for me sometimes, I also obtained around 12 grams of marijuana and a bottle of 70 proof rum to soften those edges. I went to my house to be alone for the night. First I drank a shot of alcohol and smoked a couple grams to ease into the experience and then I took one of each type of LSD. I drank a second shot of alcohol with the LSD in my mouth.</p><p>Now it is T+ 1 hour and the cid is kickin in pretty hard, I can still write, but I feel very different suddenly. I felt effects at 15 minutes, but at an hour it is a definite tryptamine buzz. I need to kick back for a few and experience this. I will check back in later. It should be noted that I take an anti-psychotic called risperadol which I didn't take today so that I could experience a psychotomimetic.</p><p>T+1:15 I can barely think to write at this point, my thoughts are becoming vapor. I have music with visualization playing. Nice familiar stuff. Now a somewhat unfamiliar Allen Ginsburg reading. Allen Ginsburg talks like a hypnotist. I guess my thoughts are pretty random and scattered. Allen Ginsburg sounds like Timothy Leary. It seems like he is using similar speech patterns. There may be common words that they used in their readings.</p><p>But there are more similarities than that. I am smoking to calm myself at t+1:25. I was just looking in the mirror and thinking how nice it is to have mydriasys as ooposed to the opposite having recently withdrawn from opiates/opiods which cause the pupils to be constricted. The risperadol is for temporary drug psychosis from withdrawal. Death or Love, that has been the subject of my fantasy of white and black magic. I get lost in dualities alot.</p><p>T+1:45 it is starting to be hard to tell time or remember what I was thinking a moment ago. As I listen to some music I don', recognize, I wonder what I want imprinted on my consciousness, I guess life. That is the answer to the dark versus light dualities debate. Just life. When I relax, things are melting and moving. Internal monologue: You don't know do you? But you think you do. Intense trance music is playing as that thought comes to me. Almost like it starts fuzzy and gets clearer. When I concentrate, clarity and when I relax, enjoyment.</p><p>T+2:00 I've just been laying on the floor enjoying the music. Some Grateful Dead song I've never heard before or don't remember having heard. I find I am questioning myself more and more as time goes by. I feel like I am losing my mind as I gain lucidity. I am listening to a song called 'Hall of Mirrors'. How wonderful. I could feed my introspection all night, but I guess I should list some physical effects.</p><p>My brain feels like it's on fire, which is weird because I thought the brain didn't have tactile sensation. So I guess I think I can feel cerebrospinal fluid exchange. My back kinda feels like its on fire as well. Electricity more than fire I suppose. My senses are becoming heightened: the transition from fuzzy to clear. I have a little bit of a headache that's hanging on from before I dropped. Psychosomatic maybe, something to think about on LSD. I do get shaky as my senses are heightened. I must be in tune in order to not have involuntary reactions, is that right? I don't know, but I thought it. Seems opposed to Leary's normal talk. I felt brief anger that I must have an Ego.</p><p>T++ My sense of time is warping such that I cannot focus on the clock and think of when I ingested psychoactive chemicals. I would think that because I can say that I should be able now time is distorting in other ways. Music seems sped up and slowed down, just out of time.</p><p>Oh. I think this is about the three hour mark. Physically I feel fine, just a little more excited than I should be at this time of night. LSD is like wakening senses from a slumber in the way that it elucidates things. Don't know if I said that right, just trying to use the word lucid again.</p><p>t+4:00 I feel like I am unraveling great yarn balls of emotion. The 'Quantum Leap' effect: An emotion traveling through time. This even refers to the specific time travel theory in the show. Science fiction is the best fiction. Seems to be an ambiguos statement. Time to have another drink. I am trying to figure out if I can get a reasonable structural diagram of Gama Amino Butyric Acid from its name.</p><p>T+5:00 I can now say I am researching organic chemistry using reference material online. I was able to come up with what I believe is a structural representation of GABA from the GHB Archive 3-d moleculular model. I feel like I understand the symbols in organic chemistry better suddenly. It used to be more like a foreign language. Maybe it will be again. Its not a large difference between GABA and GHB, but I didn't understand that difference before.</p>",
 "year": "2007",
 "id": "59368",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-06T08:00:00.000Z",
 "views": "4004",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
