{
 "title": "The Devil In My Head",
 "author": "Dan",
 "citation": " Dan. \"The Devil In My Head: experience with LSD, Alcohol, Cannabis & Hydrocodone (ID 5947)\". Erowid.org. Feb 6, 2002. erowid.org/exp/5947",
 "substance": "LSD, Alcohol, Cannabis & Hydrocodone",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3 tablets",
   "oral",
   "Hydrocodone",
   "",
   "144 oz",
   "oral",
   "Alcohol - Beer/Wine",
   "",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   "",
   "6 hits",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "1999",
   "5947",
   "Male",
   "",
   "Not Given",
   "Feb 6, 2002",
   "10613",
   " "
  ]
 ],
 "report": "<p>\nThis is a story of my first and only trip on acid. I was with my friend Mike at a party getting drunk, popping pills and waiting for a bag of weed to arrive. When the weed didn't show up at midnight me and Mike took his truck to go and find a bag. Mike said that his roommate Matt could probably find some. When we got to Mike's dormroom Matt was just about to leave to another party.</p><p>'Got any buds?' I asked. </p><p>Matt said he didn't have any and he didn't know where to get any but for fifty bucks he'd run and get me 14 hits of acid. I'd never done acid before but I was so fucked up that I didn't even think about it and I gave him my fifty bucks.</p><p>When Matt returned he handed me a piece of foil with a strip of tie-dye paper wrapped inside it. Mike (who had tripped alot before) cut it and gave me a tab of paper amounting to about six hits. I asked Matt how much I should do and he said 'for the first time? I'd take one-maybe two.' I put the entire cut on my tongue 'if one or two will get me tripping, six will make me trip balls' I thought. 'great, now what am I supposed to do?' Mike asked (he had intended on splitting 3 a peice). take the rest, it'll be fun! I said. Mike took the remaining eight hits and we headed to the grocery store for some snacks and orange juice.</p><p>Mike and me had been planning on tripping together ever since we met. We had taken laundry detergent and black lights and turned his room into a tripper's paradise. When the lights were off and the black lights were on the tide that was flung all over the room would glow like a giant world of stars and as we started our trip, the setting couldn't have been any more comfortable. We turned on Pink Floyd 'saucer full of secrets' and the music made the room alive with crawling, swirling, glowing balls of bright white galaxies.</p><p>For about two hours all we did was sit there and watch this beautiful scene, it was great. Than we decided to go for a cigarette.</p><p>While outside, we ran into a pothead named Robert, he was smoking a joint, so we joined him right outside of the dorm doors, passing a doobie like it was legal. Every white car that went by looked exactly like a police car to me and Mike, who were relying on Robert to make intelligent decisions because we were too fucked up. What we never thought about was that Robert was really fucking stoned and not in any way reliable. He decided to give us a couple of joints to enhance our trip. We thanked him and went to Mike's truck and smoked both joints.</p><p>Mike's truck was so cloudy that I couldn't see him a foot away from me. We opened the doors and laughed as all the smoke bellowed out like a giant wave. To our horrored surprise, the campus police officer was just walking out of the door as we shut both doors.</p><p>Did he see us get high and is he coming to bust us?</p><p>we didn't know but anyone who's ever tripped will tell you that police are extremely negative to a trip.</p><p>Mike started to run but I grabbed him by the back of his shirt.</p><p>'He can't bust you if you stay cool.' Since we had no pot left he really couldn't prove shit. somehow I managed to comprehend that.</p><p>But poor Mike was under the power of eight hits of strong blotter, he didn't really comprehend shit.</p><p>The cop passed us without even looking. Five seconds later Mike turned around and in a very stupid manner said 'Hello.'</p><p>We decided to go back to his room and calm him down because he was starting to freak out about doing eight hits and being scared that he'd die. I was still having a good time but the combination of Mike's frightened voice, the six hits, and the events just prior, finally sank in, it was no longer fun to be this fucked up, and I wanted out.</p><p>But I wasn't getting out, the music became more and more violent, all the shadows in the room stood out and began to crawl, the television light began to dim, and the music became evil, chanting voices, I didn't know what they were saying but I knew they were summoning Satan. The faces on the TV merged together and turned a brilliant color red, the red became an ominous face and that face grew ram horns and fiery yellow eyes, and breathed blasphemous fire right into my soul. Every shadow in the room came together and locked around me in a cage, I was terrified, I closed my eyes but the face was still in my head, I whispered the name of Jesus and I began to cry.</p><p>Suddenly it was all gone, Mike was still frightened but my fear was over, God had saved me from the wrath of evil. I felt saved and very relieved. Me and Mike left his room and drove to a friend's house so he could calm down, his heart was beating a million times a minute, and he was very worried but eventually we both got sleep that night.</p><p>I have never done acid since than. For a year I was plagued with anxiety attacks, probably post-traumatic stress syndrome from what had happened. Mike too experienced negative reactions. </p><p>Since then I have come to the conclusion that the devil was a hallucinative manifestation of my depression, since that trip I quit popping pills, getting drunk, and only smoke weed occasionally. One might think my experience was negative, but I believe that LSD is a tool that showed me who I really was, and helped me change my life for the better. It also taught me to respect drugs and also myself, since my experience I have changed many of the negative things about me. And I couldn't have done it without the help of my own demons.</p>"
}
