{
 "title": "Just Relaxed",
 "author": "HWN",
 "citation": " HWN. \"Just Relaxed: experience with Nutmeg (ID 5953)\". Erowid.org. Feb 6, 2002. erowid.org/exp/5953",
 "substance": "Nutmeg",
 "bodyweight": "180 lb",
 "report": "<p>6pm I took only about 1 1/2 tbsp at first, thats all I could get down cause its some nasty stuff. I waited about two hours, not feeling a thing, then decided to smoke some since I had a lot left.</p><p>9pm emptied out 4 cigarettes and filled them with nutmeg, then went and smoked them. before I finished the first one I started to feel nice and relaxed and heavy. It felt like a nice, mild weed high but without the jitteryness I get from weed. Just relaxed, not caring about much of anything. I also felt like I was in a dream, like I was watching a movie from inside my head. I knew what was going on and I appeared to have control over my actions, but anything I made myself do took lots of effort.</p><p>2am By the time I went to bed I was starting to perceive everything I saw a bit differently, but no distinct visuals.</p><p>1pm (next day) Woke up 13hrs later, still felt calm, but not as intense as when I went to bed. I think I missed the most intense part while I was sleeping. The rest of the day everything was pretty close to normal, but occasionally something in my peripheral vision would look out of place until I focused on it.</p><p>I had none of the vomiting/dizziness others have reported from taking nutmeg, so it was a really pleasant experience. I'm just glad I planned ahead so I had a couple days to return to normal.</p>",
 "year": "2001",
 "id": "5953",
 "gender": "Male",
 "timestamp": "2002-02-06T08:00:00.000Z",
 "views": "11782",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 Tbsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 2:59",
   "amount": "4 joints/cigs",
   "administration": "smoked",
   "substance": "Nutmeg",
   "form": "(powder / crystals)"
  }
 ]
}
