{
 "title": "Amanita Tea Recipe",
 "author": "R. U. Trippin?",
 "citation": " R. U. Trippin?. \"Amanita Tea Recipe: experience with Amanita muscaria & Cannabis (ID 5960)\". Erowid.org. Mar 31, 2001. erowid.org/exp/5960",
 "substance": "Amanita muscaria & Cannabis",
 "bodyweight": "205 lb",
 "header": [
  "DOSE:",
  "3.5 g",
  "oral",
  "Amanitas",
  "(tea)"
 ],
 "report": "<p>I just discovered this recipe last night and I must share with the rest of our little community.</p><p>I had recieved an ounce of amanitas a day prior to this experience and had a rather ho-hum trip. I have tried aminitas on numerous occasions ranging in dose from 2.5 to 7.5 dry grams and have found it to be a very interesting spirit. However, if you have had the displeasure of dining on these mushrooms you have probobly discovered the taste to be less than pleasent. Trying to avoid having to eat them again (as I find the lingering taste in my mouth to be a source of nausea) I considered making a tea out of them.</p><p>I could not have imagined then what a good idea this was. I only used 7 grams in the tea and split it with a friend (making each dose only about 3.5 grams per person) but the trip was definitley more powerful than my previous experience at 7.5 grams, especially in the area of visuals and sedation.</p><p>The first few hours of the experience were quite nice. I was in a very relaxed environment (my home) and with people I can stand while trippin so set and setting were in line with a good trip.</p><p>It started out with a comfortable sedated feeling for roughly 3.5-4 hours comparable to a moderate dose of opium (not what I expected from a mushroom but VERY, VERY euphoric and chill). Then at roughly t+ 4:00 the trip changed to being more like a drunk feeling that was comparable to the earlier state with more energy and a little less of a 'damn this couch is the most comfortable thing I have ever sat in' feeling as before.</p><p>At approximetley 5 hours the trip started to actually become what I would classify a trip. I started to get light visual distrubances and things had a wavey look to them almost as if under water. It was not a mind blowing heavy visual trip like large doses of acid but more of a 'wow, everything just looks soooo COOL'. All in all a pleasent experience and a lot more than I was expecting at just 3.5 grams. By the way, my buddy had an experience very much in line with mine.</p><p>And finally the recipe:</p><p>1. boil an amount of water you don't mind drinking once it tastes like shit (because it will).</p><p>2. add a few crushed up vitamin c pills or lemon juice (this adds acidity to the water all though I am not sure this is neccessary)</p><p>3. add your mushies</p><p>4. boil for 15 minutes</p><p>5. for the last three minutes of boiling add a tea bag to cover up the taste of the shrooms.</p><p>6. strain mixture; discard mushies.</p><p>7. let cool and add a large amount of sugar.</p><p>8. drink it down</p><p>You can boil this mixture down to a very small amount of liquid for drinking purposes. This recipe produced very little nausea for me (less, in fact, than a previous time I ate 1.5 grams-and a whole lot more effective) and any that was produced was easily dealt with with a little canabis.</p><p>Please enjoy this recipe. Use it and the aminita mushroom responsibly to assure this powerful ally can remain legal and respected by those who know it's true power.</p>",
 "year": "2001",
 "id": "5960",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-03-31T08:00:00.000Z",
 "views": "47223",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Amanitas",
   "form": "(tea)"
  }
 }
}
