{
 "id": 5967,
 "title": "Giddy Type of Hyperness",
 "date": {
  "submission": "2007-07-31T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Twizted Bizkit",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30"
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30"
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "This summer I got to try out Adderall for the first time. Before then, I'd only had experience with weed and alcohol. Knowing only that it was a stimulant, I bought a 30 mg Adderall XR off of a friend for $3. For about a week the little orange and white pill sat hidden away in my room, until the last day of school. Our town has a festival-type deal every week during June and September, and as luck would have it, the last day of school and this event fell on the same day. Oh joy!",
  "That morning, I went to school, hung out with friends for a while, and took the pill. The effects were noticable after about half an hour. At the time, the group I was with were spinning various dice, everything from 4 to 20-sided, trying to knock each other's over. Eventually I started getting too enthuesiastic and the dice would often fly off the table. After finishing this 'game', the bell rang, signaling it was time for our 1st hour final.",
  "At the time, this was a fairly easy, yet boring class, focused on wildlife and forestry. The test was surprisingly easy. As it turns out, the effects of my little orange friend had only begun. The next and final class was my world history final. Since the schedule was all rearranged, we had 10 minutes to roam about. I took this time to see how many people I could find. In the end, I only found two. My conversation with them was mostly one-sided, with me bouncing about the entire time.",
  "Once situated in history class, I was still very hyper. It was that giddy kind of hyperness that naturally comes about. I just had ridiulous amounts of energy at my disposal. This test was somewhat harder, considering it was all multiple choice, with about 150 questions. Maybe 30 minutes later, I was trying to slow myself down while walking to the front of the class to turn in the test. Upon returning to my seat and looking at the clock, I was horrified. There was still an hour left. Much of that time was spent glancing about and mouthing the words to the faster AFI songs, especially their cover of 'Halloween'. Finally, everyone was done and I could talk to people around me, though that didn't last long. BRRRRRING!!! The bell rang. School was out for the summer.",
  "Normally, whenever going downtown after school, people congregate at some area. So I waited outside the door they would be destined to exit. And waited. And waited. It was probably only 2 minutes, but that seemed like an eternity, so I turned my hyper little self towards downtown and started walking. It's somewhere between 1 and maybe 3 miles from school to the arcade we usually meet at. Since I was alone, I let my thoughts roam as they wished, often ended quietly singing more AFI songs, and let my feet go on autopilot.",
  "Upon arriving, I found the guy who sold me the pill and a rather beautiful girl had gotten there before me. We talked a while, partly about how my experience was going. As luck would have it, he had 3 more pills, which I bought. Originally the money was to be used for buying a quarter of weed, but the dealer was lazy.",
  "Backing up a bit, on the way, I had noticed I was starting to come down in that annoying 'energetic one minute, slightly down, then back up a bit' way that Adderall does. I waited an hour after the last burst of energy, went for a walk to a nearby McDonald's for some food (I was starving), and took a second pill. Unlike the first one, it took a while longer for it to kick in, likely because of the food. By then, other people had arrived and we'd gone outside. According to a friend, I was still 'acting like you have ADHD.' This was mostly lost on me.",
  "A few of us decided to head into the main area where festivities were occuring. This brought on a slight 'fight-or-flight' response in me. The whole rest of the evening I was stressing out. Only when I got home did the effects hit me full on. Sitting at the computer, my legs took turns bouncing as I chatted away with friends for about 4 hours.",
  "Since then, I took Adderall two more times, both during the festival in June. As of typing this, I'm not sure if I'll be getting any sleep tonight, due to what may be slight insomnia and stress. Luckily, tomorrow evening is the first festival of september, and my friend with the Adderall may be in town. ^_^"
 ],
 "erowid": {
  "id": "36471",
  "citation": " Twizted Bizkit. \"Giddy Type of Hyperness: experience with Amphetamines (Adderall) (ID 36471)\". Erowid.org. Jul 31, 2007. erowid.org/exp/36471",
  "substance": "Amphetamines (Adderall)",
  "views": "13580"
 }
}
