{
 "title": "Sensory Overload",
 "author": "Synthetic",
 "citation": " Synthetic. \"Sensory Overload: experience with PCP (ID 5976)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5976",
 "substance": "PCP",
 "bodyweight": "150 lb",
 "report": "<p>Well I was just chillin at my friend Jon's one day when Kent calls me up from his work. 'I got some KJ,' he says, using the name his co-worker used when he gave it to him. I had never really even thought about trying angel dust because it just seems too ghetto to me, when I heard 'PCP' I saw little images of crackheads running around in circles pulling out their eyeballs or being arrested naked in their neighborhood. 'Ok,' I go, and we hang up.</p><p>About an hour later we show up at the shopping center where he works and we go out to the parking lot and he shows me the joint.  It's a half burned soggy looking tan colored joint rolled with parsley (his co-worker said weed would bring the effects of the shit down, but I think that would have been a good thing).  So we hop in my car and take a quick spin around the block and hit the joint and a couple bowls of some dank.</p><p>After toking we went back to the parking lot of the shopping center and I was getting a little confused.  I felt very compressed for some reason, I could barely hear anything, everything looked larger and smaller at the same time, and my entire body was numb.  I smoked a bowl of chronic and didn't even realize it until after I was blowing the smoke out.  When I talked it sounded to me like Charlie Brown's teacher sounded, and as I was making sentences, I would slur my words and stutter because I would began talking then forget how to talk or wouldn't be able to say words that I normally have no trouble with.  It wasn't exactly a pleasent feeling, just confusing and it felt like all of my senses were being overstimulated until they were humming with electricity.  I bet being electrocuted is somewhat similar, except probably more painful.</p><p>Now I wasn't having that bad of a time yet, the effects were somewhat tolerable, but Kent had been sitting in the car for about ten minutes while we sat outside it and smoked cigarettes and talked. When I went over to his window (walking was extremely weird...EVERYTHING was in slow-motion) I saw him sitting stiffly upright, eyes wide, sweat collecting in beads on his face.  I said his name and he stiffly turned toward me looking at me with wild eyes that I could see no emotion in.  He looked twacked out of his fucking gourd and he kept asking me where we were when we were what did we do. Later he explained that he felt like he was being sucked down a drain. </p><p>So anyways it gets too be a little bit too much for kent and he starts getting loud and a bit alarmed, then starts walking around the parking lot, walking stiff-legged like a robot, I kind of jogged after him, which was a strange sensation, and tried to get him to come back to the car, while I nervously glanced at a cleaning lady who seemed to be perplexed by the asian guy shouting and goose stepping around the parking lot.  We finally stuffed ourselves in the car and had Jon drive us to Steve's house, since his mom wouldn't be home and we could have a comfortable little place to be confused.  He rolls up right when we happen to get out of the car, looking none too pleased when he finds out that he's getting off work to find three people on PCP waiting for him in the front of his house, especially when one of them is on his knees looking around wildly and mumbling to himself.  So we went inside his house and Kent ran around, huffing with his entire body tense, puffed up like a scared cat, until he found steve's bed and laid down to nurse his paranoid sores.  I however stayed awake and had the pleasure of calling my boss to tell her I couldn't come to work because I was sick.  This was not easy but I somehow got it done, although I don't quite remember what I said, but I was still very fucked up. </p><p>The effects tapered off to a slight body high after about three hours, and were gone by four, but I still felt twacked out all night.  Kent felt fine after a couple hours and remembered nothing but confusion and half of the events that had occured.  PCP really wasn't that great of a drug if you ask me, it just confused me and built up a wall of static around all of my senses, so I have no desire to experience this drug again, although I'm glad that I do know what its like.</p>",
 "year": "2001",
 "id": "5976",
 "gender": "Male",
 "timestamp": "2002-01-18T08:00:00.000Z",
 "views": "27595",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "PCP"
  }
 ]
}
