{
 "id": 5988,
 "title": "Weak Sleep Patterns",
 "date": {
  "submission": "2006-06-08T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Misplaced Fate1313",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Bupropion",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "80 mg",
   "administration": "oral",
   "substance": "Fluoxetine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Ephedrine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Trazodone",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I had just come off a pretty heavy DXM trip the previous night, and I was feeling pretty good (albeit a little funny in the head). So I raided my step-mother's pharm stash and basically downed a bunch of pills at once. I didn't feel much, so I smoked the remnants of joint maybe ten minutes later.",
  "About 20 minutes later I was feeling very buzzed and hyper, I was running about for no real reason. I was sweating hell of a lot. Then I rested down, feeling a bit of a headache but still very buzzed. Then I watched a movie with my parents, I can't remember what it was.",
  "I noticed I felt really sad about something, though I had nothing to be sad about. Afterwards I went to bed. I didn't get any sleep that night, not a single second. I kept thrashing about all night. And the next day. And basically for the next 40 hours or so. I couldn't sit still for very long, either my leg would move around or my jaw would clench, or something.",
  "Eventually I fell asleep, and I gradually got more and more sleep each night until I was back to normal in maybe 4 days. It's about a week later from when I first took it. I feel pretty good. I told one of my friends (an experienced drug user) about it, and she told me 'you could have killed yourself'! And even though I kept telling myself, late at night when I couldn't sleep at all, 'I'm never doing this again', I kinda feel like doing it again. Maybe I will."
 ],
 "erowid": {
  "id": "36541",
  "citation": " Misplaced Fate1313. \"Weak Sleep Patterns: experience with Bupropion, Fluoxetine, Ephedrine & Trazodone (ID 36541)\". Erowid.org. Jun 8, 2006. erowid.org/exp/36541",
  "substance": "Bupropion, Fluoxetine, Ephedrine & Trazodone",
  "views": "15198"
 }
}
