{
 "id": 600,
 "title": "Be patient",
 "date": {
  "submission": "2011-08-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SuperGroover",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "550",
    "grams": 0.55
   },
   "administration": "oral",
   "substance": "Kava",
   "form": "extract"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "mg",
    "quantity": "225",
    "grams": 0.225
   },
   "administration": "oral",
   "substance": "Kava",
   "form": "extract"
  },
  {
   "time": "1:30",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Kava",
   "form": "extract"
  }
 ],
 "report": [
  "I had been reading information and reports on Kava online for a while and finally broke down and decided it was worth a try.",
  "I went to my local health food store and purchased a bottle of 60 kava extract pills, each pill containing 55mg kavalactone.",
  "I had already tried ground kava root powder with no success, so I was hopeful with the extract. about 8pm on my day off from work I sat down and counted out ten pills thinking 550mg of the active kavalactones would be a pretty good dose. Down they went with some mountain dew and I was all set for it's effects. Around 9pm I felt nothing. I decided to take 5 more, only this time I chewed the capsules and held them in my mouth for a while. My mouth grew rather numb and I was hopeful this would speed my anticipated intoxication a little bit. 9:30, still nothing noticable. This is where I got stupid. Upset that I had just wasted my money and desperately seeking to feel *something*.",
  "I started chewing down about 3 gel-caps every 5-10 minutes, washing my mouth out with ice cream between. I finished the entire bottle of 60 pills, equaling around 5500mg of kavalactone, which I believe is about 9 or 10 of the drinks served in Fiji. Nauseous and slightly groggy I decide to go to the store for some drinks! Before leaving I notice my heartbeat feels more rapid, and stronger. Checking my pulse, I read about 100bpm. 10 minutes later I recheck and measure 112bpm. another 15 minutes and I read back to 105bpm. Feeling sure that I am in no danger I rode off to the store on my bike! getting there I realise I rode way to fast. I'm out of breath and my heart feels like a jackhammer. I go to the nifty pulse rate meter in the supermarket and it reads off 125bpm and everything else is way too high but I figure it is just from the ride and leave with 2 sobe drinks. Coming home I look at the clock and see it is about 11pm now. Drink some sobe.... time for a smoke! I don't smoke much but I keep cigars for every now and then. I go sit in my favorite chair outside. Halfway through my cigar I realise I am getting very nausious. I stand up and my legs are extremely weak. I walk about 5 feet and can't hold it anymore and puke several times. Sitting down I try to compose myyself and end up puking a few more times. Go back inside and it is 12:30pm. Feeling very very groggy but not at all pleasent I go to bed and wake up feeling somewhat normal.",
  "My message to all you out there: Don't be impatient with Kava! I was very stupid in consuming the whole bottle of pills. I have tried Kava again in moderate doses and each time it has better effect but I have learned that it usually takes a few goes before you feel anything great so don't give up or poison yourself trying to rush it! Good luck to anybody else who tries this out."
 ],
 "erowid": {
  "id": "11395",
  "citation": " SuperGroover. \"Be patient: experience with Kava  (ID 11395)\". Erowid.org. Aug 15, 2011. erowid.org/exp/11395",
  "substance": "Kava ",
  "views": "8791"
 }
}
