{
 "id": 6010,
 "title": "Under the Clear Starry Sky",
 "date": {
  "submission": "2007-03-11T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bob the Stoner",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "3.5",
    "quantity": "3.5"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "4:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "My 3.5 gram shroom trip.",
  "This would be my 5th time dosing up on shrooms, and the highest dose yet. Prior to this I did 2.6 grams. The main difference between my 2.6 gram trip and my 3.5 gram trip, was the way they fucked with my mind this last time. I still have not experienced significant visual effects, but everything in my vision always sort of dances around, looking very amusing.",
  "There were 4 of us. Myself, my good friend J, his girlfriend K and her friend M. K and M would be dosing for their first times, luckily we were smart about this and only gave them a half eighth each. A little background. First of all, J and K have only been together for a short while, actually not even considering themselves together yet. M is a bitter person, and I hate to say it, but shes an ugly person, and I don't mean physically, but she doesn't look that great either.",
  "I learned a lot about myself and these other 3 people that night. We all ate our shrooms in peanut butter sandwiches, and washed them down with orange juice, at about 11:00 pm. at 11:45 or so we left the house, to go for a walk in the nearby woods, on a little dirt trail that leads around to a city park we could hang out at. By this time we were all definitely coming up, and we found ourselves confused and scared in these woods, but finally made our way to the park. Its not a long walk, probably 5-10 minutes. We got to the park, and I bought myself a dr. pepper and we got on the swings for a while. The dr pepper felt awesome to drink.",
  "I'm going to guess we hung out at the park for an hour. But now that I think about it, that would mean about an hour and a half would be lost, so I don't know. By this time my eyes are wide open, things are beginning to morph a little bit in my vision, and we all have a good case of the giggles. I thought that I had reached the peak, but I was wrong. We saw some cars driving into the parking lot, so we left quickly, back into the woods. Let me note that M is being very annoying, making rude comments toward J and otherwise just saying random shit that was not necessary.",
  "We went in a new direction up onto a hill, where we found a wood platform thing for exersising, I guess for doing situps at an incline or something. Anways I was the first to lay down on this thing. The sky was beautiful. The stars seemed to be shining and twinkling brighter and more beautifully than I could ever imagine, and the half moon was an awesome complement to them. I layed there on that thing for at least another hour. I didn't want to go. It was so beautiful. I stared up to the stars and was, in my head, not visually, sort of transported to another world, revolving around that star, looking back at our sun.",
  "I really began thinking about myself and my life. Unlike how I always thought shrooms would make me think, I was actually really positive. For once I was really happy with myself and my life, and I became very confident and lost all fear of anything. I said aloud, 'I want a fucking cop to come over here, and tell me where the fuck to go. What are they gonna do?' I felt so grateful to be here looking at the sky at this time. I felt sad that so many people are so caught up in their everyday bullshit, they never take the time to stop and just look at the sky. Look how fucking beautiful it is. I could have stayed there all night, but my friends were ready to head back, so on we went.",
  "This, I feel, was the peak, and I couldn't be happier about it. There wasn't a place in the world I'd rather be then right there, on that sit up thing, looking at the sky.",
  "During the walk home, we all sort of concluded that the peak had ended. M is still being herself. More and more I realize who she is, and more and more I do not like her. She really gave us all a bad vibe.",
  "We got back to my house at about 3 am apparently. We went to my room to smoke some weed. Once I got inside I realized my trip was still going strong. Things leaned in a really negative direction from this point on. We talked for a while, but I began to get really quiet and just thought a lot. At one point I looked up and saw these other 3 people as what they really are: just animals. Suddenly they all became very alien looking and I couldn't understand why these 3 other animals had gathered in my room with me to make sounds with our mouths. I had to look away, for some reason looking at these alien creatures disgusted me, even though visually they looked completely normal. I snapped myself out of this quickly, but it sort of made me wonder why I had never seen people that way before. It was like I was seeing a human being for the first time. Very weird and sort of disturbing.",
  "We smoked out of my bong. J decided to pack a huge bud, probably about a gram, into the bowl. It was overflowing, and we all were cracking up. He hit the bong like you would hit a giant pipe, he kept puffing it quickly to get the large ammount of pot in the bowl cherried. He got about half of the bowl down, with the chamber of the bong filled with tons of thick white smoke, then passed it to K to clear. She took as big a hit as she could, but only got probably less than 1/3 of the smoke.",
  "She then started coughing really really bad, for about 10 minutes. None of us were expecting this and J felt very bad. She was starting to freak out. She said she needed air, so she went outside, and then didn't come back. This put some extreme stress on all of us. It was 4 in the morning, we were all on mushrooms, and this girl had ran off into the night. If a cop had seen her on the side of the road, got out and looked at her eyes, or heard her mumbling some crazy shit, she'd be taken down to the station for sure. We went outside to smoke a cigarette, and look for her, as casually as possible.",
  "J found her on the ground out by her car. He picked her up and carried her inside. We got her some water and made her comfortable but she continued to hyperventilate for a good ammount of time. A lot of stress had been lifted. J and I were very sure she was fine, just freaking out, but she insisted she needed to breath like that or she was going to die. Finally we got into a conversation and she joined it, and after a minute or so she realized she had stopped hyperventilating, and sort of laughed that she really thought she was about to die from lack of oxygen.",
  "After this, the night quickly winded down. We were all glad the ordeal had come to an end. Its funny how on mushrooms, simple situations seem so complex. Every little word or facial expression or anything can mean anything. J and I were discussing this, how shrooms make communication so difficult. Its funny. I remember at one point he asked me to roll him a cigarette, and I paused for a minute then said alright. Then he said, no, nevermind, forget it, and we continued back and forth arguing about this fucking cigarette. I guess I said 'alright' in a tone that sounded like 'yeah fine whatever', so he was bummed about that, and I was trying to figure out what I said wrong. Finally I was like, stop this shit man, this is stupid, we're on shrooms, I'm gonna roll a cigarette. And that was that, even though my mind continued to analize what had just happened for a while afterwards.",
  "I began to feel really bad. I remember at one point my mindset went all negative, everything in my vision seemed to melt away, and I couldn't respond to anyone asking questions. I felt like I had fucked up bad and I needed to apologize. I felt like everything I had come to believe about myself and my life, particulary during the peak when I was watching the stars, was all wrong. I felt insecure and wanted to cry. Luckily I reminded myself how rediculous the situation was. J forgot about it before I did, and the night went on. I just kept over-analizing everything I said, and everything anyone else said. We didn't get to sleep till 7 am, except M who fell asleep earlier.",
  "The comedown was very introspective. All of the shit that happened when we got back to my house - M continuing to be an asshole, K having a very difficult time, and me going all crazy over a cigarette - all this had me very stressed out, and I spend the last hours of the trip thinking about the people I was with, and myself, and what all of this that had happend meant. K insisted that J had saved her life. I could see a definite new thing going on between them. In my shroomed state of mind I was very happy for them, I could tell that this would be a very strong foundation for a relationship, and that things were (now) going very well for them. I feel like I stepped over some mental boundaries and really learned something about myself.",
  "Its really funny how beautiful life is. There is so much good to be found, but these people that control us. They don't want us to have fun. They won't even let us have the stuff that grows on moldy cow shit. Stuff that has been here long before any government was. The mushroom is a teacher. Its such a beautiful part of life. Why aren't we allowed to appreciate life anymore? These days life isn't enough. Money, beauty, money, popularity, and money make everything in today's world. People don't understand that you never own anything. Long after you die, your possessions stay here on earth. Everything belongs to mother earth. I understand that you need money to live. I just wish it didn't have to be that way. These are the things the mushrooms showed me last night, under the clear starry sky.",
  "Take a minute at night before you go to bed, and go outside and look at the stars. Maybe they will remind you too how beautiful life is."
 ],
 "erowid": {
  "id": "36616",
  "citation": " Bob the Stoner. \"Under the Clear Starry Sky: experience with Mushrooms & Cannabis (ID 36616)\". Erowid.org. Mar 11, 2007. erowid.org/exp/36616",
  "substance": "Mushrooms & Cannabis",
  "views": "3026"
 }
}
