{
 "title": "May Possibly Be Just a Joke",
 "author": "Poofball",
 "citation": " Poofball. \"May Possibly Be Just a Joke: experience with Kratom (20x extract) (ID 60162)\". Erowid.org. Jun 25, 2007. erowid.org/exp/60162",
 "substance": "Kratom (20x extract)",
 "bodyweight": "200 lb",
 "report": "<p>After doing much research on Kratom I wanted to give it a try.  After spending some time looking around I found that it may be a substance in which I would be more than happy with.  I think I was wrong.  In general the most I got out of it was a feeling of relaxation.</p><p>I looked up the different methods of making it and decided that I would settle with the powderized version of a 20:1 extract.  I got 12 grams and my roommate and I set out to give it a try.  Here it goes.</p><p>T+0:00 - I took 2 grams of the kratom and mixed it with some chai tea. </p><p>T+0:05 - I finished the tea.  It was not too horrible of a taste at all.  In fact, it never really bothered me in the least.  The only bad thing was that not all of it fixed and its gritty remains were at the bottom.</p><p>T+0:45 - Feeling quite relaxed, but expecting much much more from it by now.  Perhaps I'll take some more.</p><p>T+1:00 - I just took two more grams of it in the same method as above.</p><p>T+2:00 - Two hours in neither of us are really feeling it still.  Just the same relaxed state, nothing more, nothing less.</p><p>T+2:30 - Took two more grams each and now we are both up to 6 grams.  The package contained 12 grams so we are officially out.</p><p>T+4:00 - Those last two grams just relaxed me a bit more.  I can't complain that it doesn't do that.  However I did not achieve much out of this at all.  It has almost completely worn off at this point. </p><p>For 25 dollars I do not think I will be purchasing this again.</p>",
 "year": "2007",
 "id": "60162",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "9456",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  },
  "2": {
   "time": " T+ 2:30",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  }
 }
}
