{
 "id": 6019,
 "title": "The Wheel of all Existance and Time",
 "date": {
  "submission": "2007-04-18T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ledzepln86",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "Background:",
  "All of my Salvia experiences have been pretty weak compared to what would be ahead of me. I had smoked the regular leaf and 7X extract. It did barely anything to me except for a tingly feeling and an altered sense of gravity. It was if gravity had taken the same level as the moon. Other than those little effects, there was no breakthrough.",
  "Mindset and Setting:",
  "My mindset is very happy. My cousin Brett is down in Oklahoma with me and we were having a great time. My friend Michael called me and told me that he wanted me to try this Salvia extract, and that it was amazing. Brett had never tried Salvia, and was eager to do so. The experience would take place at Michael's friends house.",
  "We arrived at the house in the early afternoon. Michael invited me and Brett inside to a back bedroom of his friends house. Michael smiles as he sees us, knowing that we were in for a life-changing experience. He said this Salvia was so potent it seemed like you were having a DMT flash. He packed in one full bowl of 20x Salvia.",
  "Experience:",
  "(Time: 00 seconds) I take the biggest hit I can pull up into the neck of the bong, enough to cache the whole bowl. I exhale through my nose and clear the bong. The smoke has a heavy volume, and tastes sharp.",
  "(Time: 30 seconds) As I exhale Michael tells me to just lay back. On my way laying back, The room began to move away from me. (Time is now non-existant.) In a card fanning motion, copies of the room kept falling away forming a spiral around me. I slowly became a part of this spiral. I felt as if I had been swallowed by a dark space and felt its huge size and emptiness. My face was pressed against the bottom of this void I had been sucked in to. I cannot lift my head because the gravity was very strong making me lay face down. It feels like I keep falling, almost the same feeling of a merry-go-round but at high speeds and vertically spinning, not horizontally.",
  "Visions appear to in front of me allowing me to glance inside my life's memories. I could see my parents holding my hand as a little boy when we took a trip to see the alamo. A blank room with nothing but a chair and window. Each memory had its own environment that I could feel like I was actually there. Entity contact is made, and I ask it how I get out of this place but it does not respond. Just a blank stare.",
  "Then I fall into the spiral again. It is like looking down into a book and I keep falling through the pages, where each page is a different memory of my life that gets somehow 'snapped' on to my face, then unsnaps and lets me keep traveling. More memories are passing by me, until I see the moment in my life where I took the hit of Salvia, and reached for that memory using my mind.",
  "My arm is now inside and I reach for Michael and pull myself back in by his arm. I'm back in partially. Half of my existence is still spinning around somewhere in that void. Who am I? I do not know my name, or where I'm at. I am not aware of my body. The only people I recognize are Brett and Michael. Slowly I become more aware of my body, which is very sweaty and hot. I cannot speak at all. I had forgotten how to even open my mouth. I am now aware of a stoned feeling and am dizzy and uncomfortable.",
  "(Time: about 6 minutes) Brett is terrified of trying it. He tells me my eyes rolled back into my head, and I looked at them with a blank stare like I was looking through them the whole time. Apparently I tried to get off the bed and on the ground but Michael had offered his hand to help me up. Which I'm thinking is the time I pulled myself back in to this world. Brett tells me I kept repeating, 'This is weird. This is weird.'",
  "(Time: about 16 minutes)",
  "I feel almost normal, but not quite there. Brain feels very hazy and everything seems a little off. I share my experience with Michael and his friend. It felt similar to what I'd imagine an alien abduction to be. Although this is more like my mind travelling to the center of all existance, and merging with it.",
  "Conclusion:",
  "Salvia is a very, very powerful entheogenic allie. A very brutal and unforgiving self analyzing tool. My experience was a Near Death Experience. Coming back from that made me realize how happy I am just to be alive and that relationships and love are the most valuable things in life."
 ],
 "erowid": {
  "id": "36639",
  "citation": " Ledzepln86. \"The Wheel of all Existance and Time: experience with Salvia divinorium (20x extract) (ID 36639)\". Erowid.org. Apr 18, 2007. erowid.org/exp/36639",
  "substance": "Salvia divinorium (20x extract)",
  "views": "4221"
 }
}
