{
 "title": "Memoirs of HBWR: 1979-1999",
 "author": "Curious Travels",
 "citation": " Curious Travels. \"Memoirs of HBWR: 1979-1999: experience with H.B. Woodrose (ID 60206)\". Erowid.org. Apr 17, 2009. erowid.org/exp/60206",
 "substance": "H.B. Woodrose",
 "bodyweight": "135 lb",
 "report": [
  "<p>I first learned of LSA many years ago after reading articles about morning glory seeds (Ipomea species). Unfortunately, these were difficult to obtain except as chemically treated seeds and I was not interested in being poisoned for my own protection by paternalistic corporations.",
  "In the late 1970s I bought a little book called Legal Highs at a headshop and discovered Hawaiian Baby Wood Rose contained LSA. I was interested but also apprehensive about trying these. After all, LSA is a precursor to LSD and it was used ceremonially in the form ololiuqui by Native Mexicans and others from that part of the world to induce powerful visionary experiences. What if I took these seeds into my body and had a terrifying vision? Would I have to go to the hospital? Would the police be involved and then what?",
  "I decided to try the HBWR seeds anyway and purchased a little baggie with 24 seeds from the same headshop. I read the instructions and proceeded to clean the fuzzy coating off nine of the seeds using a single edge razor blade. That was tedious work but worth it to minimize potential toxicity (and I was worried about eating the poison treated morning glory seeds!). Next, I crushed 9-12 seeds with a hammer, mixed them in water and drank the whole mess. The taste was horrible like a mix of raw green peppers and coffee. The taste was so bad I wanted to vomit but held it down anyway.",
  "Within an hour I began to notice the first effects. These were changes in my vision and a warm pleasant feeling. I looked at my face in the mirror and saw that my pupils were extremely dilated and the whites looked yellow but then everything had a yellowish cast. I was grinning from ear to ear. I do not remember very much of this first trip (way back in 1979) except that it was pleasant with time, space, and size distortions. There was no panic, no fear, no horrible visions, and no physical sickness. I smoked a little reefer during the night and some cigarettes. The trip lasted some eight hours. The next morning I was sleepy, probably a combination of the HBWR alkaloids and staying up until 3 in the morning.",
  "I began eating HBWR seeds fairly often over the next 20 years and never felt sick or had a bad experience. After my first experience, instead of drinking them in a glass of water I ground them to a powder in a pepper grinder and put that into gelatin capsules. \t\t\t",
  "I believe setting is important when taking psychedelics like HBWR. I always made sure that there was nothing urgent to do, that I had fasted for at least six hours (no cheeses or other aged/fermented foods or other MAO inhibitors), kept the lights low, listened to ambient types of music, had a cup of tea nearby, some high quality sticky marijuana and a few cigarettes (Camel straights). Good company was also helpful even if they were not taking HBWR.</p>"
 ],
 "year": "1979",
 "id": "60206",
 "gender": "Male",
 "views": "9532",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "submissionDate": "2009-04-17T07:00:00.000Z"
}
