{
 "title": "Appreciative User",
 "author": "Keith",
 "citation": " Keith. \"Appreciative User: experience with Cannabis (ID 60201)\". Erowid.org. Nov 8, 2007. erowid.org/exp/60201",
 "substance": "Cannabis",
 "bodyweight": "133 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Male 44, scientist, married 20yrs, UK, 2 to 3 times per month over 7 years (1 to 3 hits from pipe), mainly 'white widow'. No other drugs, no cigs, no alcohol.</p><p>MJ has been a great source of joy in my life. In low doses, MJ has a weakening and feminizing effect on my ego. It increases my emotion and empathy. It also greatly enhances pleasure from my senses. It's a mild relaxant, makes me more submissive and makes me smile a lot. In higher doses, my perception of time and reality change. Words and deeds dissolve into an ocean of expanding time. And as time dilates, so understanding and meaning seem to increase. Music can attach itself much more tightly to my emotions, to create an almost visceral response close to rapture.</p><p>[note - if I slow music (or video) down in media player 10% - 20% when high, it increases the emotion a lot.]</p><p>Food and touch take on a texture forgotten since childhood. Sensations are both profound and magical.</p><p>Marijuana is a mild aphrodisiac. All aspects of sexuality are heightened. The beauty of the feminine, the intensity of fantasy, of role playing, of touch, of intimacy and connection, and of orgasm and release. With the dilation of time, orgasm is not only deeper, but reverberates across an expanding canvas of time.</p><p>[Note - to my great surprise, the quality of both life and sex increase markedly with age. It seems something to do with wisdom, gratitude, appreciation and humility. So don't ever fear getting older]</p><p>---------------------</p><p>I would not smoke more than twice a week, and often less than twice a month, because I want the high to remain special.</p><p>[note - To test my emotional state before I get high, I might listen to some music or maybe view some erotic imagery and see how it makes me feel inside. See if my mind is too busy to feel.]</p><p>I have had one panic attack after 5 years. The week before, I had been very ill with nausea and felt close to death. My inner terror had still not subsided and MJ found it.</p><p>I knew 5 to 10 mg of oral Valium (diazepam) would kill the terror after 15 minutes. That knowledge alone kept me OK - so I keep some to hand, just in case. Just knowing it's there is enough. Plus my wife helped talk me down. Just lots of loving talk, good times etc.</p><p>After the (mild) panic attack, I started smoking a lower amount (one good hit from a pipe instead of three) And I found it's possible to 'sensitize' MYself to MJ so I can smoke less. My mind slowly learns to do more of the work for itself rather than relying on the MJ.</p><p>-------------------</p><p>Apart from nurturing states of bliss while high, I think a lot about consciousness.</p><p>Like my ego being made up of beliefs that try to deny the power my aesthetics (beauty, justice, duty etc.) have over my emotions. It protects me from terror, but also censors and numbs me from bliss.</p><p>Pride is the enemy of passion. Humility is its beginning. That there are pathways that can subvert my male ego and reach right into my depths of feeling. Sex, feminine beauty, drugs, music, meditation...</p><p>The real spiritual work of turning terror into bliss cannot be started until the beliefs of my ego have been disarmed.</p><p>That 2d patterns from my muscles and senses condense into a 3d simulation of reality. Language connects to the simulation to allow narrative and logic. I can 'observe' these 3d scenes as the 'witness', because the patterns exist within a quasi 4th dimensional structure of the subconscious. And just as I need to step out of a 2d picture (up into the 3rd dimension) to 'see' the picture, so I need to step out of my 3d reality, into the 4th dimension, to 'see' the 3d reality 'below'. 3d conscious awareness is what I 'see' when I step outside of, or reflect back from, the 4th dimensional patterns of my subconscious.</p>",
 "year": "2007",
 "id": "60201",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-08T08:00:00.000Z",
 "views": "4006"
}
