{
 "id": 6021,
 "title": "Caffeine and Sports",
 "date": {
  "submission": "2007-06-08T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Rear Admiral",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "1400 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Today I had a cross country meet and I decided to test an idea that I had got a few months ago. I was reading an article that caffeine was tested for as a performance enhancer in man aerobic sports (marathons, cross country, anything lasting more than 5 min.).",
  "I decided to take 7 200mg caffeine pills an hour before the race so my caffeine levels would peak just before the start of the race. I warmed up, and about 2 minutes before the start of the race, my hands went completely numb. I shrugged it off and decided that it wasn't a big deal. The gun went off and I imediately took first place and held the position untill the last 400 meters when my head began to throb with pain. I was passed, but I managed to get second place.",
  "Right after crossing the finish line, I was handed a bottle of water. I downed it and walked over to a fence where I began to vomit. I usually vomit after I race, but I began to panic after 20 minutes of vomiting. I checked my heart rate and it was at 140. 45 minutes after the race, I begining to vomit bile.",
  "I found my mom, who is a nurse practitioner, and told her what happened. She said that I would be alright and I could go to the ER if I wanted to. I opted out because I didn't want my coach to find out what I had done in fear of being disqualified and kicked off the team. I spent the next 12 hours trying to fight the caffeine. I was puking every 20 minutes and I had to drink a glass of water everytime I puked or I would puke up bile the next go around. I was able to eat a candy bar and a few bites of cereal before I went to bed.",
  "I was able to sleep for about 2 hours, and I just woke up. My legs are very sore, they are keeping me awake with the pain. My resting heart rate is down to 70 now. I am still vomiting, and I don't see and end to it anytime soon.",
  "In conclusion, if you want to use Caffeine in high dosages, don't. It was probably one of the stupidest things I have ever done. I wouldn't recomend taking more than 300mg of Caffeine at any one time. It is a terrible existance to overdose on the shit. I don't doubt caffeine's ability to improve endurance, I ran a very good time and raced pretty well. I just don't believe that it was worth it one bit.",
  "Peace,",
  "Rear Admiral"
 ],
 "erowid": {
  "id": "36643",
  "citation": " Rear Admiral. \"Caffeine and Sports: experience with Caffeine (ID 36643)\". Erowid.org. Jun 8, 2007. erowid.org/exp/36643",
  "substance": "Caffeine",
  "views": "14419"
 }
}
