{
 "id": 6023,
 "title": "A Frightening Experience",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Steve the Great",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I love opiates, even the wannabes like Tramadol.  So when I was in Bangkok this year and found that I could buy it over the counter and dirt cheap, I was thrilled!  And so I did; I had the weekend all to myself in Hua Hin between weeks of work.  I dosed around 7pm Friday night with 8-10 50mg pills. ",
  "I got a great buzz within 20 minutes.  I didn't have the usual itchiness I get with Codeine, and I walked around town poking my head in shops, got a massage, ate dinner, and just had a great time with a great buzz.  I wound up back at the hotel around 1am, took a shower, and went to bed.",
  "I awoke late, scrambled to get down to the restaurant before they stopped serving breakfast, marveled at the lack of headache and other usual symptoms of a good high the previous night.  I chilled by the pool, slept a little more, and had a nice relaxing afternoon.",
  "Until, that is, I went back to my room at about 3pm.  There was a message on my phone.  I called the receptionist, and was floored by the message.  It was Helmut.  He was downstairs.  He had been waiting for over an hour.  We had to get back to Bangkok and we had decided to leave at 2, where the hell was I?  What?  He must be playing a joke - we're staying the whole weekend.  What's he talking about going back on this beautiful Saturday.  So I went downstairs expecting to find him slapping his knee in his dry German way.  But he was dead serious - Steve, we're going to miss our plane, how could you be so careless with time?  So I asked him - Why did you change plans to return on Saturday?  He looked confused.  It's Sunday, he said.  Today is Sunday.  I stumbled a bit.  Sunday?  The last thing I remember is going to bed with a good buzz around 3am.  I got up and took it easy until I got your message.  What the hell happened to my Saturday?",
  "I'll never know.  I have never slept for more than 12 hours before in my life - I'm a notoriously light sleeper.  But that night I went to bed and slept 28 hours, including through the housekeeper banging on the door.  I have never felt so wierd in my life - somehow I lost a day, never to be found again."
 ],
 "erowid": {
  "id": "36659",
  "citation": " Steve the Great. \"A Frightening Experience: experience with Tramadol (ID 36659)\". Erowid.org. Jun 25, 2007. erowid.org/exp/36659",
  "substance": "Tramadol",
  "views": "28570"
 }
}
