{
 "title": "A Religious Experience",
 "author": "Matt",
 "citation": " Matt. \"A Religious Experience: experience with DXM & LSD (ID 6027)\". Erowid.org. Feb 8, 2002. erowid.org/exp/6027",
 "substance": "DXM & LSD",
 "bodyweight": "220 lb",
 "header": [
  "DOSE:",
  "200 mg",
  "oral",
  "DXM",
  "",
  "1 hit",
  "oral",
  "LSD"
 ],
 "report": "<p>I had tried DXM about three times and really enjoyed it affects. I ran onto some of the best acid I have ever had and decided to make a cocktail of the two. I had about 200mg of DXM and one blotter hit of LSD at 10:00 pm. This is what I experienced.</p><p>It didn't take long for me to find my bed. I could feel something coming on but concurrently I was relaxed and wanted to lay down. I feel asleep very shortly and awoke. I was enjoying my environment a little better and thats when I started looking at the glow in the dark stars on my ceiling. They began moving distaces of a few feet or so, moving in all directions. As hour 1 was approaching I didn't know what to expect since some of the things I saw were pretty intense for this short amount of time. Another half hour passed and I took to the outdoors. It was a cool breezy night with fast, dark moving clouds that caught my attention. I felt completely at peace with everything around me. I observed beauty in everything I saw and felt exhilerated by having the wind blow through my soul. I knew I belonged in this beauty as an intrical part of the surrounding environment. I danced with the wind, although I as a rule of thumb don't dance. I am not particularily religious but I felt God speaking to me telling me that everything was alright. I was the pupil in this mental conversation as God showed me the beauty in everything and how that was for me and everybody to experience. I wept at this beauty that now surrounded me. I wished everybody could remove themselves from the meaningless stress that they endure and join me in seeing what life was really like.</p><p>As the 4th hour encroached I put a headset on. I played Hendrix and could feel electric energy shoot through my entire body on every note. The wind complemented the music, adding it's own value to this mind-blowing experience. Soon I wasn't sure if the wind was influencing the music, or the music comanding the wind...it was all so interconnected and it all moved through my body. I felt love, and grasped everything at a higher plane than I'd ever perceived on any other psychadelic experience. Even when dealing with things like death that may be scarey on acid, now it was a part of life that was beautiful in its own respect. I stayed outside all night, watching the natural splendor that surrouded me. Everything contained beauty and so watching things was to observe and feel the beauty of these objects for the first time.</p><p>LSD and DXM both come to a peak when I use them but here it came in waves all night long. For a half hour I would experience intense hallucination and then 45 minutes later I would feel it again. This experience lasted 18+ hours.</p><p>I did look like I was on some heavy drugs while doing this and it appeared that even the most naive person could pick up on what I was doing if I were out in public.</p><p>My experience that evening has had a profound impact on me. I have retained great insight on what is really important in life and try to live my life in accordance with this. I don't think I'll ever forget what happened that evening.</p>",
 "year": "2001",
 "id": "6027",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-08T08:00:00.000Z",
 "views": "22274",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "DXM"
  },
  "1": {
   "time": "",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD"
  }
 }
}
