{
 "title": "Coping with Insanity",
 "author": "Laserblast",
 "citation": " Laserblast. \"Coping with Insanity: experience with DOB (Sold as LSD) (ID 60329)\". Erowid.org. Apr 26, 2007. erowid.org/exp/60329",
 "substance": "DOB (Sold as LSD)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "DOB",
   " T+ 0:00",
   "2 hits",
   "smoked",
   "Cannabis",
   " T+ 2:30",
   "2 lines",
   "insufflated",
   "Cocaine"
  ]
 ],
 "report": "<p>Firstly, I'd like to go over a few things about myself. I find myself as an intelligent, strong minded individual. I have been experimenting with acid recently, and love the way that I use my mind while i am on it. Up to this point, I have never had a bad experience with drugs, save getting a little paranoid after smoking. This experience was my first bad one, and I feel that it's worth it for you guys to know.</p><p>This is my tale of DOB and cocaine.</p><p>I had just gotten off of work. My friends had apparently gotten a hold of some AWESOME ACID. We found out 2 days later that it was actually DOB. I dropped the 2 hits of DOB and got prepared for the ride of my life.</p><p>We hung out for a while, watched a skate video called 'Yeah Right!', which was actually pretty decent, and smoked a little maryjane. I only took a couple of hits, not even really enough to get a buzz. For the next few hours I kinda just walked around my backyard, waiting for the normal perception and headchange that I was used to from acid.</p><p>2 1/2 to 3 hours after injesting the DOB I started to feel the effects. I had a slight euphoric feeling and everything became much more vibrant and colorful than it normally was. People seemed distant, their eyes wide and paranoid. A friend of mine, who had happened onto some free cocaine, gave me a gram and told me to have a nice night. I took 2 semi-large lines off of the top of an old television and rubbed some around the inside of my mouth.</p><p>At this point I could hardly feel myself at all. I felt that I was living through my eyes only and that I was actually watching myself exist rather than existing.</p><p>One of my friends began to panic about some girl that he felt very strongly for and disappeared without saying a word. Myself being a kindhearted person got very worried about him and began looking everywhere for him. I found him sitting on top of an AC unit at my neighbor's house, and talked to him for a few minutes about his problem.</p><p>After talking, we went into my house and sat in the dark in a large room in the back of my house. I fell to my knees and began to pray. I felt that I had done something wrong that needed repentance, and started to freak out just a little bit. As I stared into my couch, I began to see staircases scrolling downward in the back of my couch. The entire room was lit up with a glowing blue light, even though the lights had been off for quite a long time. I began to get very paranoid, feeling that I had ruined my life and that, up to this point, I had been lying to myself about many things.</p><p>I grabbed a sketchpad and began to draw. My hand was shaking violently, and I heard multiple voices in my head. As I would think, these voices would contradict me, and then each other. I tried to silence the voices and clear my mind, but there was no stopping them. I was almost positive that I had gone completely insane, and really began to freak out.</p><p>I noticed at this point that my friend who was worried about his girl had left, and went outside to find him. I felt nothing in my body. My perception was strewed, and everything felt as if it were not real. My entire plane of vision tilted from left to right as I walked. I looked up at the sky and searched for some answer, but could find none.</p><p>I walked back into the back, hoping that maybe my friend had gone there. Unfortunately he had not. I was really freaking out by this time, and no one could really understand that. It was at this point I realized that this couldn't have been acid. I saw patterns and visual swirls, but didn't feel a headchange or the other normal things that I feel on an acid trip.</p><p>For the next 6 or 7 hours I freaked out, eventually winding up drawing again on my couch. My mom awoke and told me that I could go to sleep in her room, seeing as I had work at 5pm that day [it was around 9 or 10am at this point.] As I laid there, all I could think about was my life and the kind of person that I had become. I started crying, which I don't do very often, and could not stop. for the next 6 hours I cried, rehashing what was important to me, what I wanted to do with my life, and what I needed to be truly happy.</p><p>I went and talked to my mother, who sent me into another tyrade of tears. After talking to her for a few hours, I had to go to work. I had gotten this job one day before this experience and hadn't been to sleep since the last time I had been in. Every color stood out, every direction was strewed. I couldn't think straight, but somehow I managed my way through the night.</p><p>When I arrived back home after work, I felt no urge to sleep, and almost felt that I would never be able to sleep again. After an hour or two of laying down watching my friend play WoW, I drifted off into a peaceful sleep. When I awoke the next day, everything was back to normal.</p><p>All I can really say about this experience is that it changed my life. After being completely insane for 2 days, it was nice to wake up from it unharmed.</p>",
 "year": "2006",
 "id": "60329",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-26T07:00:00.000Z",
 "views": "14049"
}
