{
 "id": 6035,
 "title": "Grassy Playa",
 "date": {
  "submission": "2005-09-14T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "rftek",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Methamphetamine",
   "form": "powder/crystals"
  },
  {
   "time": "9:30",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "liquid"
  },
  {
   "time": "14:00",
   "amount": "repeated",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  }
 ],
 "report": [
  "First time trying the 2c-e. I'm a fairly experienced psychonaut, none of our crew had tried the 2c-e either so this was going to be interesting. The setting was a burner party in Texas, camping next to the water, terrible music (more on this later), good friends.",
  "11am: background//pre-load. We started partying (smoked and snorted speed) around 11 that morning. Whoosh. Intermittent pot went around.",
  "8:30pm still tweaking/pretty wired. We took the 2c-e orally, it was diluted in water. The dr. Mixed up 100mg of the 2c-e with 100ml of water. He dispensed using a dropper with ml markings so dosage was quite accurate.",
  "The psychedelic properties we're present, stars spinning, not really any heavy visuals. Note that my dosage (7.5mg) is on the lighter side. Very bitter taste to the solution. The effects really seemed to be like foxy + mdma. Leaning more towards the foxy.",
  "I spun some fire around 12 (time is hard to estimate!!), this was very pleasurable. I got nauseous and let go all the water and little food i had drunk earlier. Not a big deal, felt better immediately.",
  "We broke out the nitrous around 1, music was sounding great by this point.  The nitrous + 2c-e is a very pleasant combination. 6 of us tore up 6 boxes over a 2 hour period (approx). Very good.",
  "Overall:: 6/10 on a scale of 0-10, 0 being straight sober, 5 being one good tab of x, 10 being two good tabs + nitrous.",
  "Note1:: I started getting stomach cramps around 3am, laughing too much? This persisted throughout part of the next day. With good music I hardly noticed, in silence it was pretty uncomfortable.",
  "Note2:: the speed was definetly up in the mix, this put a edge on the psychedelic part.",
  "Note3:: my friends that dropped 10mg of the 2c-e had quite a good time.",
  "Would i do it again? Only if i couldn't find something better! The perceived side effects (stomach cramps, nausea) we're slightly overcoming the good effects (great music enhancement, laughing, feeling of euphoric companionship, time distortion, slight visuals)."
 ],
 "erowid": {
  "id": "36699",
  "citation": " rftek. \"Grassy Playa: experience with 2C-E & Methamphetamine (ID 36699)\". Erowid.org. Sep 14, 2005. erowid.org/exp/36699",
  "substance": "2C-E & Methamphetamine",
  "views": "8410"
 }
}
