{
 "title": "Yeltres, Cosmic Key to My Soul",
 "author": "Astaroth28",
 "citation": " Astaroth28. \"Yeltres, Cosmic Key to My Soul: experience with Salvia divinorum (20x extract) (ID 60411)\". Erowid.org. Oct 2, 2009. erowid.org/exp/60411",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "180 lb",
 "report": [
  "<p>The setting is my dorm room. Its Friday evening. The door is locked to prevent any unnecessary intrusions, the lights are off. I have prepared a small crash pad, a doubled over blanket and pillow, on which Ill lie for the majority of my trip. In the background theres some generic trance mix playing. The window is slightly open for ventilation, as the room has a fire alarm wired to a central system, and Im sure that this going off would make for a very bad experience. Ive done Salvia Divinorum a couple times before, and its always been enjoyable, but Ive always felt that there was more to experience, and have chosen tonight to see if I can change that. Ive never had a sitter, which probably isnt the smartest thing, but Ive prepared the room to minimize the possibility of harming myself, and I feel comfortable with what Ive done. Ive packed a bowl of 20x non-standardized extract, acquired from an online supplier.",
  "Very quickly after the hit was taken, maybe 25-45 seconds, I can start to feel it. I position myself on the blanket. As I lay down, everything seems to be composed of flashing, bluish geometric shapes. Im not sure if my eyes are closed or open, but the room as it was no longer exists. My thoughts seem to repeat themselves over and over, I keep telling myself to let them know that Ive made it back. In the back of my mind there seems to still be a shred of conscious reason, but for the most part Im floating through the geometric madness playing out across my field of vision. My mind doesnt seem to be working the same as it did before. As I recover a bit, I realize that Im pressing my head against the pillow, and the back of my head is beginning to tingle. I raise my hand and it startles me. It takes a while for me to realize that it is my own. Slowly, as if it were my first time, I stand up, stumble over to my dresser, and turn on the lights.",
  "For some reason or another, I pack another bowl of the extract, fumble with the lighter, and take another hit. The harsh smoke, combined with my semi-conscious condition and trembling hands causes me to spill the contents of the bowl mid toke, and I begin coughing vehemently. Again, I collapse on the mat, but I dont reach the same peak, probably due to the bad tokage, just a rush of tingles throughout my body, and a melting sensation, what Ive identified to be the most common factors throughout my experiences with the substance. Im afraid for awhile. What if the people next door come over? What if someone saw me through the window? A car slowly drives down the alley outside, and I become terrified, before slowly calming myself down. I resolutely stand up, steady myself, and pack a third bowl, determined to reach a greater peak.",
  "My hands trembling, I set the pipe down. I was standing up, staring at the visualization on the media player on my computer. A tendril of drool runs down my lip, and I lie down, right before losing all semblance of consciousness. Im traveling through a geometric void. Echoing in my mind is an incomprehensible word. Although it is meaningless, and in retrospect I realize Ive never heard it before, at the time it seemed both familiar and commonplace. I then discover that I am not myself, but looking at my soul from a vantage point outside of anything Ive experienced before. I was contemplating switching to another form or myself, or another representation of self, I guess is the best way to describe it. It was clear at the time, however now it seems pretty cryptic. All of this was very visual, taking place in some removed, vast space, although everything seemed to be composed of intricate, grey, fractal patterns. After this, the experience seemed to climax, although I dont remember what happened then, aside from the pulsing repetition of the same unintelligible word. I think it was yeltres or something to that effect.",
  "As I returned to my body, which seemed to take hours (although clich, the perceived time distortion was this prevalent), I began thinking of my family and my friends with excitement. I couldnt wait to tell them about my profound discovery. Soon I realized that I couldnt tell them about it (theyre all unaware of my explorations with ethnogens, and wouldnt take it well), which frustrated me, but didnt detract much from the overall sense of euphoria that had possessed me. The repeating word seemed to take on a different form, and soon I realized it was actually the underlying rhythm of the track that was playing.",
  "By this point, I was able to stand, and paced about the room in excitement. Colors were more vibrant than usual, and moments seemed to congeal, as if each one were a painting, and I was viewing them as a series, like a slideshow. My hands had trails behind them when they moved. I enjoyed this for a while, still reveling in the euphoria left over from my trance-like state. Eventually I returned to baseline, aside from a subtle afterglow. I wouldnt hesitate to repeat the experience, especially after preparing my mindset and surroundings further to optimize it, and perhaps somewhere where I dont have to worry about smoke detectors or other people intruding. Definitely the most powerful psychedelic experience Ive had to date.</p>"
 ],
 "year": "2007",
 "id": "60411",
 "gender": "Male",
 "views": "6759",
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "submissionDate": "2009-10-02T07:00:00.000Z"
}
