{
 "id": 6044,
 "title": "A Gun Held to My Head",
 "date": {
  "submission": "2007-02-15T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Whocares",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "3.5",
    "quantity": "3.5"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I feel it may be important to inform you that I have been habitually smoking weed for years and I am also an expirienced MDMA user. I frequently take various prescription drugs for recreational use as well. I have always been a fan of drugs and have always took kindly to them.",
  "Last Friday me and two of my best friends decided to get some mushrooms. This was my second expirience with the substance and the first had been somewhat weak. I had only mild halucinations and felt extremely confused for about 6 hours. This time around the mushrooms we said to be more potent and I figured I would trip harder considering I now knew what to expect from the substance.",
  "We ate the shrooms with no real game plan for the night. We decided we would just let the mushrooms guide us. We ate the at about 9:00 P.M. and headed to a local park to prepare for the onset. After about 30 minutes a very strange feeling came over me. It was as if with each second I was overcome with a new unfamiliar emotion. I became very anxious and felt like I should be doing something but had no idea what. After about 10 minutes or so this feeling went away. I was now very giggly and my mind was racing. One of my friends and I saw red and green pixels over our field of vision, like snow on a television screen. I could see past it but it was covering everything.",
  "Now that we were beginning to trip we wanted to go to a more secluded spot. Foolishly, we chose an elementry school playground. There were no homes around it just a pasture with a bunch of horses. This is where we had been the last time we tripped. We chilled there for a while enjoying the colors and patterns. I was already tripping harder than the last time and was very impressed. I was stupid to think that was all to come.",
  "As we sat huddled around a frog that we had found I looked up to see a spotlight shining around the corner. I instantly knew it was the police. Being that I was on mushrooms this sent me into an instant panic. I ran and my friends followed. Now, if I had been stoned or sober I would have kept my cool and handled the cops, but anyone who has shroomed knows its a little different.",
  "So we're running and the cops have yet to see us. The problem was there was nothing but flatground all around us. No woods or anything else that would help us get rid of the cops. Just as I was starting to lose faith I noticed a ditch full of grass clippings that was surrounded with tall grass and brush. Without hesitation I jumped in it and covered myself. As I sat there tripping my balls off. I heard the car pull up to where we were and a door open and close. The cops passed me 4 or 5 times before spotting me. They held a gun to my head as they arrested us. I lay face down in the wet grass, cuffed, looking over at my friend. I saw smoke billowing up from his body and I was convinced that we were in the midst of a war and he had been shot and I was to be held hostage.",
  "In the back of the cop car I kept thinking we were moving when we weren't. The cop's heads looked extremely small. My friend could hardly speak when the cops would ask him something. To the question 'What is your adress?' he responded with a combination of numbers, letters, and streets in our neighborhood. I almost completely freaked out a couple of times but I was able to keep my cool because we had conviced the cops we had only smoked weed.",
  "The whole expirience with the cops seemed so surreal. When they were done with us one of my friends walked away with a possesion, the other a M.I.P. for tobacco, and I got nothing. My one friend had 4 valium on him in case of a bad trip that he somehow managed to swallow in the back of the car while in cuffs. The cops dropped us off at a gas station in the middle of no where.",
  "When we got back to my house the trip got more intense than it had been all night. We were outside in the parking lot of my apartment, but I felt as if I was in some sort of habitat not out doors. The stars in the sky formed groups of three. Cars seemed very small as if I wouldn't be able to fit in them. My friend who had took the valium was incredibly fucked up. He couldn't walk, stand or speak and I thought that he was going to die. I felt responsible for the whole night.",
  "When I went in for the night I went in my bathroom and stood in front of the mirror for hours. My skin looked a weird shade of brown. I kept picturing myself in an old black and white movie. The old movies from like the 30's where there is no sound just choppy visuals and an ocasional black screen with printed dialouge. In the movie I would pick up a mushroom eat it and it would zoom in on my pupils dialating and the there would be the dialouge screen where it said, 'The ape eats the sacred mushroom!!!'.",
  "When I closed my eyes to sleep I saw incredible patterns, lights and colors. I laid there for hours taking it all in. By the time I fell asleep the visuals had turned into disturbing images of thousands of spiders and bees crawling and buzzing everywhere. I then slept and the journey was over.",
  "Although it might not sound like it, this expirience was amazing and I would not have changed it. I probably wouldn't be saying this if I had gotten in some kind of trouble by the cops but it is definitly something I will remember for the rest of my life"
 ],
 "erowid": {
  "id": "36725",
  "citation": " Whocares. \"A Gun Held to My Head: experience with Mushrooms & Police (ID 36725)\". Erowid.org. Feb 15, 2007. erowid.org/exp/36725",
  "substance": "Mushrooms & Police",
  "views": "8909"
 }
}
