{
 "title": "The Wave",
 "author": "taco",
 "citation": " taco. \"The Wave: experience with Mushrooms - P. cubensis (dried) (ID 60461)\". Erowid.org. Feb 9, 2007. erowid.org/exp/60461",
 "substance": "Mushrooms - P. cubensis (dried)",
 "bodyweight": "165 lb",
 "report": [
  "<p>Before I get into the meat of the report, a prelude as to why this is such a curious trip: In April of 2006, I had a bag of one ounce of dried cubensis mushrooms. Some were eaten, some were given away, I ended up with about 15g of them left in the bag. I ate 7.5g one weekend, had a really intense, but great trip. Three weeks later, I ate the last 7.5g. To say I was unprepared is a mild understatement.",
  "I had not eaten in a little over 24 hours. I consumed all the mushrooms and threw away the bit of 'shroom dust' that remained in the bag.",
  "T+0:00: Mushrooms eaten.",
  "T+0:15: First alert. I turn off all the lights, computer monitor, sit on the sofa, and prepare a 4-cartridge balloon of nitrous. As I prepare it, in the dark, I seem to be enveloped in a large hollow sphere which had tribal symbols swirling all over the inside of it in glow-in-the-dark color, and is closing in on me slowly as I prepare it. When I put the balloon to my lips, the symbols/sphere rush inside of me. I am wearing clothes at this time.",
  "T+0:30??: I am no longer wearing clothes. The lights are on. Why am I in the bathroom? More importantly, what's that sound? Suddenly, the memory floods back, sort of. I was laying on the couch, laughing and laughing and laughing and laughing... and then I had to poop, so I went to the bathroom, still laughing maniacally. This wasn't just a chuckle laugh, or a belly laugh. This was the 'I'm totally batshit insane and I don't care who knows about it' laugh. I walk out to my computer through doors whose frames are swirling about in mischievious ways.",
  "T+0:45: I only know this time because I looked at my chat logs, which show what time I dosed and was talking at (since I said it in there). My chat logs show me TALKING IN CAPS SAYING HOW I WISH EVERYONE COULD FEEL LIKE THIS with a lot of repeat letters. I remember not watching the keyboard because my face was down on the desk. I wanted to chew on something, so I just started chewing. It felt really good, so I got down and started chewing on the desk. I told everyone in chat about how awesome that felt and how satisfying it was to be 'eating the world'.",
  "Suddenly, a revelation struck me. What I was feeling at that time, this absolutely indescribable feeling of what I can only call 'CONTINUITY', was that I was riding the crest, that I was having all the fun in the entire universe, that the reason that there was so much suffering in the world, was because I was having all the fun. I started to feel really bad about the fact that I was just sitting there when I was having all the fun in the universe, instead of actually doing something fun, so I jumped up and down and ran around my crappy apartment until I got tired and laid on the ground. Through this entire experience I was chewing happily on whatever was in my mouth.",
  "Some time passed. I went to get up, and I couldn't move. The only way I could move was by chewing, eating. I had to swallow some stuff too. I was perceiving in 2 dimensions. This was very remarkable to me, and I wanted to share it with the world via my computer. So, I start chewing my way over there, along my floor, to the corner, where a little bit of the world leaked out of my mouth, up the wall, over the underside of the desk, and up.. ahh, there's my goal. I turn on the computer monitor, and realize my mouth is full. I should do something about it, and I figured that since the stuff inside my mouth was the same stuff as on the outside of my mouth, I would just exhale or whatever, right? I'm not sure if I've been clear on this, but all boundaries between myself and the rest of the universe had been crushed. So, I get rid of the stuff that's in my mouth, and then there's blood all over my monitor and desk.",
  "Wait, WHAT?",
  "So, there's blood all over my monitor and desk. At this point, I realize that it is coming from my mouth, and that wasn't the universe I had been chewing on. It was my cheeks. Or maybe they're the same thing, really. I get some paper towels and clean up the worst of the mess. At least now I can see what's on my screen without there being lots of blood in the way. The dirty paper towels are shoved down the garbage disposal. (I find those the next morning.)",
  "I stared at the time on the computer for about 5 minutes, perceptively. I knew that I wanted to know how much time had passed since I ate the mushrooms, and I could read the numbers on the screen... I could tell you the name of the symbol, but I could not tell you what time it was. I was rather freaked out, both by the blood and by my nonchalance in the experience. I mean, my cheeks didn't even hurt, how could they be gushing blood like this? At this point, I decided that I was immortal and went into the bathroom and started licking the electrical socket in there. A few seconds into this routine and it occurs to me that if this doesn't kill me, it will probably hurt a lot and be very unexpected, so I decided to do something much less unexpected... which brings me to the part where I beat the hell out of myself with a 4'x4'x3' post. I had a large number of bruises, cuts, and splinters when I got tired of this and started really coming down 45 minutes later.",
  "I smoked some pot after that and started to relax and think everything was okay. An hour or so later, I got tired, and went to bed.",
  "Now, I've discussed what I did to some extent, but I didn't really express what I was going through, or feeling in that time. A lot of that is because it doesn't bear being put into language very well, but I'm going to do my best:",
  "CONCLUSION",
  "==========",
  "Throughout this entire trip, I felt this endless momentum rushing through me, and I tried to focus on it at different times through the trip. What I perceived from the momentum is that it is not a single unit of momentum rushing at insane speeds, but the combined momentum of countless tiny little pulses. Each pulse would start out as near to nothing as it can get, and it would build and build and build to a shouting climax, after which it would ebb and recede away.",
  "That same sort of arc is the life cycle of every single thing in the universe, including the universe itself. It grows, and grows, and it may change in time, but then it starts to get old, and ebb away, and grow less and less, until it forms back into that whence it came, nothing. It is a natural phenomenon, and both to be parted from (birth) and reunited with (death) the perception of this universal particulate momentum is a joyous event.",
  "I cannot overstate how important of a discovery this was for me. I see reflections of that insight in almost everything I do on a daily basis now. I see it in the world power cycle of the United States, I see it in the birth of a child, I see it in a growing corporation, as well as in dying ones.",
  "We are all transversing the same wave in the universe, but we are all at different points on the wave, and thus seem incomprehensible to one another. We have laughing fits when we trip because everything is really so ridiculously simple that we don't understand then why we don't understand when we're sober.",
  "It's taken me a long time to organize this enough to write it, and some details have probably been forgotten since the experience, in August of '06.",
  "Oh... I almost completely forgot to mention the aftermath. Turns out I chewed my way about 2/3 of the way through the insides of my cheeks. Couldn't eat solid food for about a week and a half, and had to rinse my mouth with peroxide every hour or two or it would start burning like hell. The cuts, bruises, splinters, etc. all healed up fine by themselves. IMO, that wasn't stupid shit I did because I was tripping... I look at it as the price I had to pay to receive that insight. Worth every single peroxide rinse.</p>"
 ],
 "year": "2006",
 "id": "60461",
 "gender": "Male",
 "views": "9257",
 "dose": [
  {
   "time": "0",
   "amount": "7.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2007-02-09T08:00:00.000Z"
}
