{
 "title": "Subtle Relaxation",
 "author": "Sigea",
 "citation": " Sigea. \"Subtle Relaxation: experience with Kava Kava & Valerian (ID 6050)\". Erowid.org. Feb 8, 2002. erowid.org/exp/6050",
 "substance": "Kava Kava & Valerian",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "1440 mg",
  "oral",
  "Kava",
  "(capsule)",
  "",
  "1440 mg",
  "oral",
  "Valerian",
  "(capsule)"
 ],
 "report": "<p>I had a bottle of a product called Kava Max, which contained 55 mg Kavalactones and 55 mg Valerian root per pill.  I had taken 6 one time, and had no effects at all.  It didn't even make me sleepy, and the bottle indicated 1 pill would be enough.  I did some research and found that when in high doses (> 1 gram) there is some mild narcotic activity.</p><p>T+00:05</p><p>I fasted for 6 hours and thought about how many I should take.  I decided to take all the rest (26) as it seemed like a relatively safe drug.  It has a really bitter, almost phlegmy taste.  I managed to get down all 26 without vomiting.</p><p>T+01:00</p><p>I'm still not feeling anything.  I'm beginning to wonder if I need the actual root for any effects.</p><p>T+01:30</p><p>Slight numbing in my face, I feel a little congested, but it may be because I'm getting over a cold.  Sort of relaxed, it's about 9:30 now and I usually don't get tired until about 11.</p><p>T+02:05</p><p>Definately feeling something.  Very bizzare, very subtle, seems like my thought patters are a bit off.  Sort of like a marijuana afterglow.  I have perfect coordination, and I can speak coherently.  This may just be a placebo effect.</p><p>Next Day:  I just woke up after a deep 10 hour sleep.  I went to bed early, lying there for about 2 hours.  I was stuck with a strange feeling like I was right about to fall asleep.  Lying in bed was very comfortable, when I got up to get a glass of water, I felt like I wasn't really walking, like I was still in the same place.  It was a vaguely disconnected feeling, but nowhere near intense.  I also realized I was breathing slower than usual. When I finally feel asleep, I have very vivid, realistic dreams.  Kava + Valerian was a very subtle combination, almost unnoticable.  It wasn't worth paying for, but it's still an interesting experience.</p>",
 "year": "2001",
 "id": "6050",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-08T08:00:00.000Z",
 "views": "21306",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1440 mg",
   "administration": "oral",
   "substance": "Kava",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": "1440 mg",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(capsule)"
  }
 }
}
