{
 "title": "Awakening",
 "author": "Steve",
 "citation": " Steve. \"Awakening: experience with Mushrooms - P. cubensis & Yerba Mate (ID 60546)\". Erowid.org. Oct 2, 2009. erowid.org/exp/60546",
 "substance": "Mushrooms - P. cubensis & Yerba Mate",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "6 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(tea)",
  "",
  " ",
  "oral",
  "Yerba Mate",
  "(tea)"
 ],
 "report": "<p>Yesterday was the last day of my vacation from work.  I had been planning on going snowboarding, but the weather on the mountain was terrible, so I decided to brew a pot of mushroom yerba mate instead.  I crushed up what looked like a little less than 1/4 oz. of shrooms into the filter of my teapot on top of some yerba mate, then added lemon juice to the bottom of the pot, poured hot water in and let it steep for about 45 minutes.  I highly recommend this recipe.  It tastes really good, and you dont have to swallow all of that indigestible fibrous material.  Ive done mushrooms dozens of times, and have eaten an entire 1/4 oz in the past.  I drank the entire pot within about a 10 minute period. </p><p>The psilocybin began to take effect within about 20 minutes, beginning with a sense of breathlessness, the familiar body buzz, and then increasing intensity of colors.  Soon after, I began to experience more intense visuals, with paisley and fractal patterns appearing in the carpet and the appearance of things (plants, paintings, etc) moving.  My stomach began to feel very uncomfortable due to the high volume of fluid in it, so I decided to sit and meditate while the water passed.  While doing so, my mind began to race.  I was starting to get very high, with incredibly intricate and vivid patterns appearing behind my eyelids when I closed them.  I began to fear how much higher I might get as the psilocybin contained in the water in my stomach was absorbed into my system, but was able to easily put that fear aside.  My thoughts raced around for a while, and I felt much better after having peed a couple of times. </p><p>After I released all that water, I felt very light.  I decided to brush my teeth, and found myself dancing around the lower level of my house while doing so.  After that I looked out the window.  The trees and other plants appeared vibrantly alive, and the clouds swirled and danced before me.  I had my face pressed against the window, simultaneously enjoying the sights, and the sounds of my fingers tapping arhythmically against the glass.  I then went upstairs and began dancing around, my body feeling increasingly fluid and light, and in sync with the rhythms of the world around me.  I was simply enjoying the music being made by the house- the sounds of air in the ducts, water flowing through its pipes, the compressor of the refrigerator all in perfect harmony.  I thought briefly about putting a CD on, and then decided instead to make my own, so I ran downstairs to grab my didgeridoo.</p><p>I lay on my back in the couch in my living room and began to play.  I started out with a low hum, and worked up into a steady rhythm.  I soon worked myself up in to a frenzied state.  What came through me can best be described as a grand opus to the pure joy of existence.  It felt as if God itself was pouring through my being and pulling with it all my emotional, sexual, physical and spiritual energies through the instrument.  I could see the path of all the energies of my life- emerging through my mothers womb, traveling the path of my 27 years of life, all emerging in that one glorious period of musical creation.  With my eyes closed, I could see intricate patterns dancing to my music.  My mother was upstairs taking a bath as I was playing.  I hoped at the time she could hear me, but I really didnt care if I was my own audience.  The word awakening occurred to me as I was playing, which is what I decided to title the piece.</p><p>After I was through playing, I just sat and stared out the window in a state of shock over what had come through me.  I had experienced a glimpse of pure unadulterated devine power.  I felt that my ego kept getting caught up in that power, and I needed to repeatedly let those thoughts go.  My thoughts began to take off in odd directions.  I began to think of my friend who is recovering from a bad gunshot wound.  Though shes recovering remarkably, and facing her challenge with more courage than I believe Ive ever witnessed, I became filled with sadness in thinking about her.  My thoughts wandered some more in fairly random directions for a while, and then my mom came downstairs.</p><p>I asked her if she could hear what I had played when she was in the bath, and she said she could a little bit.  I asked if she minded if I played some more, and she said she did not.  So, I played some more, pouring the sadness I was feeling, as well as the joy and other simultaneous emotions I was feeling into the music.  After playing for a while longer, I felt the desire to build within me to share the music coming through me.  So, I strapped my didge on my back, hopped on my bike and headed for Drake Park, near downtown Bend.  At this point I had come down quite a bit from my peak, but was still experiencing some visual intensity, as well as the emotional and physical energy granted by the mushrooms.</p><p>Once I got to the park, I spent over an hour and a half playing for the grass and the trees and the geese and the ducks and the sky and the occasional humans and dogs passing by, which brought me great joy.  I hope it brought joy to the other beings in the park.</p><p>I feel so blessed to have had that experience.  First, because I made a quantum leap in my ability to play the didgeridoo.  Second, because I have gained the ability to express myself through music, something Ive never known before, as well as a desire to share it with the world.  Im excited to see what comes of that.</p>",
 "year": "2007",
 "id": "60546",
 "gender": "Male",
 "age": "27",
 "timestamp": "2009-10-02T07:00:00.000Z",
 "views": "39969",
 "dose": {}
}
