{
 "id": 6056,
 "title": "Achieving an Out-of-Body Experience",
 "date": {
  "submission": "2004-09-16T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Buddhist Bill",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Mescaline",
   "form": "powder / crystals"
  },
  {
   "time": "1:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "flowers"
  },
  {
   "time": "2:15",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "flowers"
  },
  {
   "time": "2:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "flowers"
  },
  {
   "time": "2:45",
   "amount": "6 carts.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  }
 ],
 "report": [
  "I won't go into all the details of my trip, though it was a very good one, just the 'brief' time that I left my body.  I started feeling the Mescaline after about an hour, after another 30 minutes 2 of the other 3 people I was with were also feeling it and the decision was made to smoke to help bring it out.  We smoked a large bowl between the four of us and I was thrust into my first peak.  After another 45 minutes J decided we should smoke again, I was totally down, but M was in no condition to smoke so it was just C, J, and myself for the second bowl.  After we were done, J proceeded to pack another, at that point C dropped out and it was just me and J smoking out of his massive bong.",
  "At this point I decided it was time to use the whip-its because I didn't this I would get any more inebriated than I was at that point.  I inhaled the first three whip-its as I usually would... it seemed like I was experiencing the effects that I would typically get from whip-its when I'm really high.  Once I started the fourth, however, things got extremely intense.  I've heard lots of strange noises while under the influence of Nitrous before, but this time I heard music... really weird music, but I liked it.  My closed-eye visuals were getting extremely intense.  The patterns were becoming increasingly complicated and they proceeded to traverse through all the colors of the rainbow and eventually attained the entire visible spectrum all at once.  The fifth whip-it allowed me to maintain at this point, but the sixth sent me to another universe altogether.",
  "I was no longer a physical entity.  My body was back on Earth, but I was exploring another dimension.  On Earth there were three special dimensions (x, y, z) and one temporal dimension (time), but these restrictions had no meaning for me.  I continued to explore for what seemed like days, but for my body, only a matter of minutes passed.  While I was gone I encountered other beings, also explorers, and actually communicated with them.  Not by means of speech, but through the simple act of thought.  I saw, heard, and felt amazing things, but I slowly started to feel that I was being pulled back to my body on Earth.",
  "The problem when I returned was that I somehow didnt remember who any of the people around me where, who I was, where I was, or even what I was.  I looked around the back porch of M's house and was convinced that I was still exploring unknown dimensions until I saw a bag of Doritos.  When I saw the Doritos logo, things rapidly started to come back to me.  Doritos, thats a brand, a company, this is Earth, these are humans, these are my friends, my name is Bill, I work at Moe's, I go to GSU, this is M's house.  It all came back to be over the course of a couple minutes.",
  "While I had only been 'out of it' for 5 minutes to everyone else, my [soul, mind, spirit, etc.] had spent an unquantifiable amount of time exploring the other universes that exist outside this physical realm.  Long enough for me even to forget my identity, or at least my human identity.  While my soul wandered I had a very distinct sense of self, but my self was not necessarily 'Bill.'"
 ],
 "erowid": {
  "id": "36763",
  "citation": " Buddhist Bill. \"Achieving an Out-of-Body Experience: experience with Cannabis, Mescaline & Nitrous Oxide (ID 36763)\". Erowid.org. Sep 16, 2004. erowid.org/exp/36763",
  "substance": "Cannabis, Mescaline & Nitrous Oxide",
  "views": "41601"
 }
}
