{
 "title": "A Blissful Rush",
 "author": "Younger Cole",
 "citation": " Younger Cole. \"A Blissful Rush: experience with Kratom (ID 60574)\". Erowid.org. Mar 4, 2007. erowid.org/exp/60574",
 "substance": "Kratom",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Kratom",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>First some background. I am a 32 year old male with a steady history of drug and alcohol use. Starting with Cannabis and Alcohol, then Cocaine, MDMA, Pain killers of all varieties, Amphetamines, Heroin, LSD, and Mushrooms.</p><p>Now the mindset. I have abstained from alcohol and ALL drugs for four months prior to this experience, and also quit smoking two months prior. In the four months leading up this I began exercising six days a weeks and have gotten in really good shape physically, mentally and spiritually. I run four days a week, lift weights three days a week, and do Yoga and Meditate everyday.</p><p>Let me also say that my favorite feeling from my drug history has been either on opiates or MDMA, and I enjoyed them both a little too much in the past. I try to stay clear of them now except for special occasions.</p><p>Now onto the experience. I've done Kratom several times before, but this time was special, I fasted for 18 hours prior, my last meal was around 9PM the previous evening. The day of, I went for a 2 1/2 mile run followed by yoga and meditation. I thought around 3PM would be a good time to ingest the Kratom.</p><p>3:15 ~ I weighed out 7 grams and emptied the powdered contents into my mouth chasing it with a tall glass of water. It tastes nasty, but I know the reward will be sweet.</p><p>3:45 ~ I start to feel this intense warmth come over my entire body, it feels like a combination of my first MDMA high with a nice OxyContin like twist, along with the social aspect of Cocaine.</p><p>4:15 ~ Still feeling incredible, strong desire to communicate with loved ones. Very empathetic.</p><p>4:45 ~ Listening to music sounds like a really good idea right now. I put on a live Jerry Garcia Band disc from 77' and just lay on my bed really enjoying the moment.</p><p>6:15 ~ Starting to feel back to normal, I still very happy though.</p><p>Overall this experience was incredibly satisfying. What made it really magical was the fasting and the aerobic exercise, and the fact that this was the first time in four months I put anything psychoactive into my system.</p>",
 "year": "2007",
 "id": "60574",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-04T08:00:00.000Z",
 "views": "22663"
}
