{
 "title": "Technicolor Dreams",
 "author": "Angryferret",
 "citation": " Angryferret. \"Technicolor Dreams: experience with Nicotine & Dreams (ID 60601)\". Erowid.org. Oct 16, 2007. erowid.org/exp/60601",
 "substance": "Nicotine & Dreams",
 "bodyweight": "140 lb",
 "report": "<p>I am a twenty year old college student who has been a daily smoker for four years. I have bipolar II and occasional anxiety attacks. I always dream in color, my nightmares are particularly intense and I normally remember significant portions of my dreams. I recently started on medium-strength Habitrol nicotine replacement patches in an effort to eliminate or reduce my future cigarette consumption. Other than an occasional head or joint ache, I have had no side effects, unless I leave the patch on while sleeping. This has produced extremely intense, psychedelic dreams, second in intensity only to dreams I have had while my body adjusted to various SSRI antidepressants I have used in the past.</p><p>Soon after falling asleep, I had a dream in which I was running through a set of sprinklers in front of my dorm with some friends. We then had a mud fight in these huge puddles that appeared. The dream itself wouldn't have been that spectacular, if it weren't for the amount of *detail* involved. I could see individual blades of grass, hear the direction voices were coming from, feel the mud between my toes, and athough the water lacked any real sense of temperature I could feel water from the sprinklers. A spurt once hit me in the ear, and it sounded just like I would expect it to. I have never had this many senses fully present in a dream sequence before. In addition, people I know in real life are almost always absent from my dreams, so perhaps nicotine enhances memory retrieval in the dream state?</p><p>Everything eventually changed to a less coherent, fantastical scene in which my friend and I had to hide in rooms of this leaky, derilict house and hide from spiders the size of chihuahuas, who if they found us would report it to this unseen beast lurking in the basement, who would in turn try to eat the room of the house we were in before we could escape. I could hear the clicking of the spiders' exoskeletons and see the shimmer of their dim red eyes, and everything looked warped and twisted like a trippy graffiti mural. I also had a wonderful sex dream, and a dream in which I listened to about 5 songs that never existed, and all of them were normally structured and sounded fantastic.</p><p>Finally, I awoke in the middle of the night, and kept drifting in and out for a while. Then, something very odd happened. The line between dreaming and wakefulness disappeared. I actually started to hallucinate when I was awake, and when I lapsed into sleep my dreams continued from my last point of consciousness without a hitch. I looked at my wall in the dark and saw that it was gradually being covered with faint, illegible cursive in a pale blue. I blinked and it went away, then returned in a few seconds. I believe these to be a form of hypnogogic hallucinations, the forms some people see before they fall asleep, although they differed from the pulsing purples and blacks I normally would have seen with closed eyes.</p><p>I then unknowingly passed out, and in a dream went to hit my lightswitch, to find it was covered by a piece of paper. I tore it away and tried to turn the lights on, but the electricity was out. I became acutely aware that something in my room didn't want me to see it. I freaked out and awoke to find I was still facing my wall where the cursive had appeared. I sort of remember that various things of this nature occured several times in a row, and I always awoke at the point where the hallucinations began. I then made it a point to force myself to stay awake during the hallucinations. My eyes tried to close, but I forced them to stay open with considerable effort. I looked at the light on my ceiling, and it grew strange angles and took on a gelatinous shimmer. Then a large black tentacle started to extend through my ceiling next to the light, waving around and making a loud humming. I found I was unable to move. The humming increased in intensity and became an electric vibration that ran strongly through my whole body.</p><p>This made me start and look around the room, which quickly returned to normal, although my fingers, toes and scalp tingled for minutes afterwards, telling me that the vibration was some sort of nervous system activity. I was definately at least semi-conscious during the time of this final hallucination. According to a book I read about astral projection, this vibration comes at the point just before your consciousness exits the body, so I'm thinking that what I experienced parallels this, or perhaps even alien abduction reports. In short, I was extremely shocked at how powerful a mind-alterant nicotine can be when administered at an atypical time. I am wondering if it's effect on dreamlike states has anything to do with it's reward action on the brainstem, as nicotine is active at acetylcholine receptors, and the part of the brainstem involved in dreaming (the pons) is stimulated by acetylcholine. This was an amazing experience that rivals the visuals of any drug I have personally taken as an experienced psychonaut/space cowboy.</p>",
 "year": "2007",
 "id": "60601",
 "gender": "Male",
 "timestamp": "2007-10-16T07:00:00.000Z",
 "views": "22592",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "14 mg",
   "administration": "transdermal",
   "substance": "Nicotine",
   "form": "(patch)"
  }
 }
}
