{
 "title": "Unexpected Knockdown",
 "author": "Bombenhagel",
 "citation": " Bombenhagel. \"Unexpected Knockdown: experience with Alcohol - Beer & Alprazolam  (ID 60617)\". Erowid.org. Dec 5, 2007. erowid.org/exp/60617",
 "substance": "Alcohol - Beer & Alprazolam ",
 "bodyweight": "77 kg",
 "header": [
  "DOSE:",
  "2.5 mg",
  "oral",
  "Pharms - Alprazolam",
  "(pill / tablet)",
  "",
  "45 oz",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)"
 ],
 "report": "<p>I was prescribed alprazolam for my anxiety problems, and knowing that it's commonly preferred in certain circles, I decided to try more than I was prescribed. At first I took 2 pills (1 mg), and waited for an hour for the effects to kick in. It affected my mind only mildly, and I felt somewhat disoriented, and a slight impairment in muscle coordination. Nevertheless, no significant or desired alteration happened to my mental state. My friend then consulted me, that I should take at least 1 mg more of that stuff. I did that, and started to drink beer in the hopes of some kind of euphoria that I have read and heard from others.</p><p>After the fourth beer it started to kick in. It felt like I have drank double as much as I actually did. For some reason (this was very stupid, as you will soon find out) I decided to take 0.5 mg more. After that I had a complete blackout, and woke up very dizzy and disoriented after 5 hours. The bed was full of urine. I was fucked up and mad to myself.</p><p>A few days after that I took only 1 mg when drinking heavily, passed out and had no hangover, which is a miracle and a good side effect of this drug :)</p><p>The conclusion: I had no desired and good effects with alprazolam alone, but with alcohol it kicks in and hard.</p>",
 "year": "2007",
 "id": "60617",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-05T08:00:00.000Z",
 "views": "9773",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "45 oz",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
