{
 "title": "Hydrocodone to Oxycodone Transition",
 "author": "Anon",
 "citation": " Anon. \"Hydrocodone to Oxycodone Transition: experience with Hydrocodone (Vicodin) & Oxycodone (Percocet/Oxycontin) (ID 60643)\". Erowid.org. Aug 1, 2010. erowid.org/exp/60643",
 "substance": "Hydrocodone (Vicodin) & Oxycodone (Percocet/Oxycontin)",
 "bodyweight": "130 lb",
 "report": "<p>This is an experience that I believe no human should go through and was the resulting cause of doctors that were too busy or didn't care about their patient's well being.</p><p>In October 2006, my lower back problem started to get out of control, so I decided to go see my D.O. for some pain killers. She started me off with the usual NSAIDS, anti-inflammitory/codeine, tramadol. None of those seemed to help so she gave me 10mg hydrocodone/500 acteaminophen. I started off with 1 to 3 a day as needed but this turned into a problem since at the time, my lower back was still under a lot of stress from my daily activities. I only used them the days that the pain was unbearable so I wouldn't become dependent on them. Sadly this changed a few weeks later as the pain intensified and up until December I was on 20-30mg/day. Throughout the rest of December and Jan. 2007 I was on 40-60mg/day to keep the pain from being excrutiating. Throughout January I went to several orthapedic back surgeons, pain management doctors, and they all said that 50mg+ a day was too much to be taking especially for more than a few weeks. But regardless they just handed out more 10mg hydro scripts and all said the same thing 'try to not take as much'. This was complete bollocks because I had a serious back problem and these dr's were filling my bloodstream with simply the wrong chemical.</p><p>In between doses I was getting anxiety and pain withdrawls which were pretty bad so I decided to get a second opinion about my pain management (this was actually the 5th doctor I've seen about my pain/meds). I told him what all the other doctors said and how they continually ignored my back problem and just threw countless 10mg hydro scripts at me. He was the first to look at my MRI and see that something was wrong, a bulging disc. No other doctor had the fucking brains to figure it out so they simply thought I was another junkie looking for opiates (I could tell the way some were talking to me and how they dismissed me out of their office). He told me that since hydro has such a short half life I was literally giving myself withdrawls every day with the current doses and that people really shouldn't be on it for more than a few weeks. He said most doctors that have half a brain move should have moved me to oxycodone for long term pain within 3 weeks, not 2 bloody months.</p><p>He prescribed me 10mg oxycodone extended release and I stopped the hydrocodone dead cold. Even though I had the oxy to help mask some of the opiate withdrawl, the physical and mental pain I went through was ungodly. I have a very high resillience to pain (getting hypothermia in a frozen lake last year wasn't even close to this) and frankly too stubborn to go to the hospital because I didn't want to appear weak. but my god, I wanted to jump off a fucking building every time the pain level changed. Full body tremors ensued followed by the usual chills, and then my heart rate would jump to 115 BPM randomly even on the oxycodone and just sit there for hours, simply to piss me off. I'd get a shooting feeling starting from the top of my spinal cord through my circulatory system like I could feel the blood poking the inner walls of my veins, it was horrific. Can't sleep, can't move, can't even think about putting any type of food down my throat. The nausea is what fucking topped it all off because at that point I WAS ready to get to a hospital. The worst feeling out of all the opiate withdrawl ones is when just the back of my neck gets to be around 100 degrees and the rest of my body is cold and then it starts to make my entire head really hot and dizzy. Had a few bouts whens I almost would go unconcious as well. As an added bonus effect I got to deal with was the anxiety and depression which were worse than 60mg/day diazepam withdrawls which I went through a few years back.</p><p>This is day four now and the effects are just -starting- to slowly subside. I called my prescribing dr of the oxy and he said come in and see me tomorrow about a higher dose and that he was sorry he couldn't see me over the weekend (worst 3 days of my life).</p><p>To those of you who were wondering how I did somehow survive this, I used diazepam 5mg and lorezepam 2mg for when the anxiety spiked, clonidine .1mg as an anti-hypertensive, oxycodone 10mg 3 times a day (dr. didn't want me to go over that for now), cold packs/blankets, I think I also cleared an entire crate of vitamin water since I got so dehydrated too. My advice to everyone is don't stay on hydrocodone for more than a few weeks for pain and if you are seeking the opiate chronic euphoria get something with a much longer half-life like morphine, ms-contin, oxycodone.</p>",
 "year": "2006",
 "id": "60643",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-08-01T07:00:00.000Z",
 "views": "11683",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Hydrocodone",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "Pharms - Oxycodone",
   "form": "(daily)"
  }
 }
}
