{
 "title": "An Orange a Day",
 "author": "Happyphyco",
 "citation": " Happyphyco. \"An Orange a Day: experience with Gabapentin (Neurontin) (ID 60658)\". Erowid.org. Jan 12, 2011. erowid.org/exp/60658",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "1500 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)",
   "",
   "6 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "",
   "",
   "75 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "20062007",
   "60658",
   "Male",
   "",
   "Not Given",
   "Jan 12, 2011",
   "8496",
   " "
  ]
 ],
 "report": "<p>Ill introduce myself as K.  Over the last 5 years I've experimented with a numerous quantity of mind expansion including weed, meth, morning glory seeds, ether, DXM, diet pills, Adhd stimulants, barbiturates, copious amounts of iv coke,  benzodiazapines, narcotics, and the most sinister intoxicant of all... women.  On a daily basis I take effexor, smoke bud, drink. I cant function without my uppers, the downers are strictly for fun.  All this dope yet somehow I consider myself a happy person with all wits and IQ intact.  </p><p>My faithful friend M is every bit as psycho as me.  One day while burning CDs from a college computer (M and I do NOT go to college) I was browsing on the internet and remembered that Ms Darvocet was on its last refill.  I was compelled to conjure up a new pharmaceutical suggestion to relay to his doctor (he was running from the cops after a drug deal without shoes and acquired frostbite which caused nerve damage).  The oh-so-naive doctors have been fueling me, M, and whoever has cash, with pharmaceutical dope for the last 2 years and will continue to do so forever.   I did some studying and stumbled upon gabapentin.  Three anxious days later I find myself snickering I always get what I want from those M.D.s.  </p><p>It was noon, I was in a motivated mood having just got off the phone with a Devine female requesting I go party with her  time to get sauced out.  Script in hand we drove his 2006 Nissan to the pharmacy with a liter of pop (the carbonation dissolves pills faster).  When he came out I suggested we start with two, he inquired we take 4 each, somehow we took five each.  Ill not forget the bright, orange, almost intimidating appearance of the pill.  We returned to my house to take my effexor and cigarettes which are both vital to my mental clarity and stability.  </p><p>M is a speed freak in more ways than one.  A forty mile trip was ahead of us and he consequently thought 95 MPH was necessary.  Upon arrival and prior to our rendezvous went to Wal-mart to waste time. Midway though our two hour shopping and about 2 hours past dosing up M says these pills are bunk. I reply Indeed.   Fifty cents worth of pennies were rolled across the store for the sheer beauty of looks on peoples faces.  I talked to a Scottish chic and got a phone number.  </p><p>As we left I was hit by a colorful, exhilarating disorientated shock from a tranquilized rush.  The Nissan looked like a three-dimensional photograph as I get in.  I felt very sociable, and started spouting off every joke and every topic that came into my head.  I felt very high but still maintaining focus.  The Gabapentin hits M as well, judging by his worse-than-usual driving. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  We arrived at a seemingly luxurious apartment estate where a small keg party was being held.  I sat next to A and start telling her about my whacked-out mind state.  She seems interested despite her drug abstinence.  I was intrigued upon realization that my personality was very different and in some ways better.  The few beers I drank reacted strongly with the tranquilizer and I began laughing, talking, and seeing double.</p><p>I convinced A to go in the back room with me where I got a hickey and a erection that was not tended to properly.  In laymens terms, she teased the holy hell out of me.  Girls dont know what they want! I was too high to care.  She was very drunk but didnt want to screw, we went back out to the party room. Some ditz bumped into me and I fell on the table and messed up a game of poker, a couple of people looked pissed but started to laugh after As sexy body laid on the table with me and progressed with the teasing.  Some other chic joined in the kissing and the game was moved to the living room floor.  As usual the spotlight was on me.  </p><p>I was pretty much in heaven. Later on some giant, dorky looking guy approached me and said you have to leave, nobody wants you here.  I said something loud and obnoxious which I do not recollect.  My invincible attitude at the time led me to throw a powerful swing to his jaw. He didnt swing back so recalling a favorite movie of mine I said the only think that gives orders is balls.  A few guys stood up,  I had adrenaline, and dopamine rushing through my brain but, like I said I still have my IQ and possessed excellent intoxicated judgment so I eyeballed them and left.  </p><p>A stopped me in the hallway to bid me a farewell and suggest I get off the 'oranges'.  We each took three more and spent a spirited night playing videogames and bullshitting.</p><p>Since this glowing experience M and I have been using Gabapentin every 15 day refill without any disenchantment.  I suggest Gabapentin for people who like a confident, motivated, clear-headed high for 8 hours at a time.  In a twisted turn of events my documentation became a detailed story.. then again who doesn't appreciate fine literature.</p><p>Please use good judgment when on downers, alcohol is the devil.</p>"
}
