{
 "id": 608,
 "title": "Spiders and Moths and Flies, Oh My",
 "date": {
  "submission": "2000-07-18T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Jeff",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "850 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "It all started one night when me and my buddies (mind you we are underage, age 16-18) were out looking for alchohol..  with no luck...  we find a friend in town who gives us these motion sickness pills, 'equate' i think.. so we proceed to take them then head home, taking 12 as he says to 'get a good buzz like alchohol'... we wait, an hour comes still nothing... so me and another one of my buddies take more.. i end up taking 17 (50 mg dimenhydrinate each) and he takes 15...  we take some whisky we found in his dads cabinet, me 1 shot him 2... still nothing.. i was thinking, 'dammit these are worthless' i had been feeling an odd emtpy feeling but nothing totally different from what i usually felt at 1 am with nothing to do except try to watch porn through the static on skinamax... so i go home and go straight to bed.",
  "i wake up at prolly around 1:30 or 2 having to pee really bad, i get up out of my bed really quick (bunk bed, i sleep on bottom) and fall flat on my face.. my legs felt as if each one weighed a ton and my head felt like it wasn't there.  i find my way to standing position and am like.. ok these effects suck.  i stumble to the bathroom, and my eyes I see in the mirror are so fucked, all red and all..  i was thinking damn i od'd...  then i here my mom giggling in the roomwith dad talking to her, so i turn off the light and creep around in there, hearing voices saying my name.. so i was like 'oh shit they know i do drugs, they are worried' so i go in there trying to figure out what the hell they are talking about. i see nothing but them sleeping as usual... and then the voices stop as i get closer.  so i go back to my bed, jump in, only to wake up as if i hadn't slept... hearing them talking quietly, my name occasionally, and i had to pee again. so i went to the bathroom quietly hearing them talk louder and louder then quiet completely.",
  "this went on til prolly around 4 am.  then i wake up at about 5:45 it is a bit light out and i hear two voices at the end of my bed saying look at that spider chasing that moth.. and i look and there is a spider chasing a moth.. i jump out of bed and i start seeing these streams of flys or something like that streaming around the carpet, pretty cool shit, i could feel them hit my feet like fish nibbling toes... i would catch myself talking to people that weren't there, mainly my buddie down the street.. i would be talking to the tv and all the sudden it would stop talking to me and i would get pissed... i would wake up in a conversation with my electric globe lighting thing...  i saw spiders all around (note i hate spiders) I saw spiders in my bed again, so i didn't go to bed..",
  "my coordination was also fucked.. i couldn't even reach to things right.. couldn't direct hands...  it was interesting, but then i had a horrible hangover the next day.. all day."
 ],
 "erowid": {
  "id": "1142",
  "citation": " Jeff. \"Spiders and Moths and Flies, Oh My: experience with Dimenhydrinate & Alcohol (ID 1142)\". Erowid.org. Jul 18, 2000. erowid.org/exp/1142",
  "substance": "Dimenhydrinate & Alcohol",
  "views": "47466"
 }
}
