{
 "title": "Learning to Overcome the Numbess to Life",
 "author": "Bestieverdid",
 "citation": " Bestieverdid. \"Learning to Overcome the Numbess to Life: experience with Sertraline (ID 60841)\". Erowid.org. Jul 23, 2009. erowid.org/exp/60841",
 "substance": "Sertraline",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Pharms - Sertraline",
   "(daily)"
  ]
 ],
 "report": "<p>I began taking Sertraline about 4 years ago, maybe longer since it seems like I've been on it forever. I have depression, anxiety, and panic attacks so my doctor initially began me on Lexapro, which only made me nauseous so he switched me to Sertraline (Zoloft) 50 mg daily. I went from feeling depressed to feeling nothing at all, which became worse than feeling emotional pain. It also killed my libido and motivational drive. I had to relearn emotions since they did not come naturally anymore.</p><p>Now, I am at a point where I can feel emotions. It has been about four years or so, and sometimes, I still feel depressed. I have learned to control my panic attacks on my own, though. My sex drive comes and goes.</p><p>I've also had to be careful about alcohol. I can't start out with hard liquor too fast or else I will crash and become an emotional mess. I've never known the feeling of being drunk without being on Setraline so I don't know if what I experience is normal. It is normal for me. I have to be even more careful than other people with alcohol because it can make me euphoric or it can make me crash.</p><p>And another thing: I love Hydrocodone (Vicodin)for it's ability to ease my back pain. I only take it on a rare occasion, though, and only take half a pill. I haven't had any adverse affects with take them both together. Vicodin does make me feel like I am drunk with lightheadedness, dizziness, and general lack of coordination.</p>",
 "year": "2003",
 "id": "60841",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-07-23T07:00:00.000Z",
 "views": "10876",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  }
 ]
}
