{
 "title": "Army Volunteer Account, Edgewood Arsenal",
 "author": "John",
 "citation": " John. \"Army Volunteer Account, Edgewood Arsenal: experience with BZ (ID 60851)\". Erowid.org. Feb 19, 2007. erowid.org/exp/60851",
 "substance": "BZ",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "IM",
   "BZ"
  ]
 ],
 "report": "<p>[Erowid Note: This transcript of an Army volunteer's experience with BZ is reproduced from Chemical Warfare by James Ketchum,  2006 by the author. Used with permission.]</p><p>dose: 7.0 ug/kg.</p><p>On Thursday morning at about 8:30 AM I was injected with a drug [BZ]. I felt no different at that time, about an hour later I felt very restless and I wanted to get up and walk around but the nurse said I had to stay flat on my back.  I have no idea of when I fell asleep but it must have been between 8:30 and 12 noon because I cannot remember eating lunch. In fact, I cannot remember eating or drinking during the entire test.</p><p>I will now describe some of the dreams I had.  There was supposed to be an inspection in the barracks by a general and I had just come back from leave.  I was trying to get ready for it.  The only difficulty I had was that I could only find one boot so I put on a pair of shower shoes.  When the general saw them he asked why I was wearing them and I told him that I was under orders from a doctor not to keep my feet enclosed but to let the air at them.  He believed me and left the room.  In this same dream I had a girl waiting for me down the hall.  I wanted to go out and see her but the nurse wouldn't let me so after trying to fight my way out and failing I called the MP's who promptly arrested them.  After that I found out that they were going to beat me up so I tried to make friends with the one who appeared to be the leader.  It must have worked because I don't remember a beating.</p><p>In another dream I remember that I kept falling down.  I told everyone that I had lost my balance but I really felt that something was seriously wrong with me.  I remember taking only one fall that really hurt me, the others weren't very bad. In another short dream I can remember red lights blinking on and off but that's all I can remember about it.  I can remember no written tests or anyone taking blood.</p><p>Another effect of the drug besides being restless was a slight headache and a feeling of being very light-headed and having trouble focusing my eyes.</p><p>To the best of my knowledge [the other subject] was in the room when I fell asleep but when I woke up he and his bed were both gone.  I can remember eating a meal, I don't know what meal it was but it consisted of beans, cold cuts, and for dessert I had peach ice cream.  [This was Sunday, Feb 10, 1963]  I seem to remember Mrs. King and Mr. Stearn being there for a while, about what I don't remember.</p><p>In another dream I met a girl whom I had known for some time.  We had been going out quite a bit together but then I broke off with her.  She didn't look right to me and I asked what was wrong but she started crying and wouldn't tell me.  Finally she admitted that she was pregnant. I didn't ask her anything else and then the dream ended.  I could not understand why, she was always so careful not to go that far.  This girl I speak of is [--], a girl I went with for about 2 years.  I stopped going out with her all together [sic] in June of 1960 but in the dream I wanted to go back and take her out again.  If there were any tests taken while I was under the drug I don't remember them at all nor do I remember eating or drinking anything except for the one meal that I described before.</p><p>I do remember refusing to take orange juice and getting mad at whoever tried to give it to me.  I also remember trying to break out of a room, probably the one I was in but I'm not sure.  I tried to rip some of the walls or padding off.  Another incident I remember was sneaking out of my room and going for a walk.  Also, when I woke up this morning I noticed that there were white sheets on the bed but before I was injected there were green sheets.  No that I think back I can remember blood being taken once.  It seemed to be very, very painful.  I also remember my hands and feet being red in color.  At one time I seemed to have a very sore throat, it was then I asked for and received a drink of water.</p><p>[Note: Ketchum's book includes a detailed transcript of what occurred in the real world simultaneous with John's subjective report. The subject showed typical symptoms of BZ intoxication, alternating between stuperous slumber and incoherent delirium. The experience lasted for about 85 hours, and occurred in a special medical testing facility in Edgewood Arsenal, Maryland.]</p>",
 "year": "1963",
 "id": "60851",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-02-19T08:00:00.000Z",
 "views": "40154",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "IM",
   "substance": "BZ"
  }
 ]
}
