{
 "title": "Warm Legs",
 "author": "Psych0naut",
 "citation": " Psych0naut. \"Warm Legs: experience with GHB & Alcohol (ID 60869)\". Erowid.org. May 9, 2007. erowid.org/exp/60869",
 "substance": "GHB & Alcohol",
 "bodyweight": "58 kg",
 "report": "<p>I just brew up a batch of GHB today and because there wasn't any detailed report of a GHB experience on the forum yet, I decided, in the name of science to take a good dose of GHB and take notes. I always make my GHB myself, and always with the same recipe. I always makes liquid GHB but don't know the amount of GHB dissolved in the solution. But because I alway use the same recipe I am familiar with my own GHB. I always take the same dose, 5ml. Beware that other GHB might be a lot weaker or a lot stronger if it's liquid, so don't judge according to my dose. I also have to mention I drink some wine during my experience. Combining alcohol and GHB can be very dangerous, for some people even in low doses. Don't drink any alcohol when taking GHB unless when experienced. Here is my experience:</p><p>T 23:11 I drank my glass of GHB dissolved in apple juice.</p><p>T 23:21 I am feeling the first effects, they are getting stronger pretty fast. The main effect I feel now is sedation. Meanwhile I am enjoying a good glass of South-African red wine. When on GHB I always get snack munchies. I only enjoy snacks while on it, not anything sweet. The same happens when I am on opiates.</p><p>T 23:31 I am now really sedated and my legs are starting to get warm and glowy, this is a really nice feeling. I am also pretty euphoric now. I am going to get another glass of wine and something to eat, snacks of course.</p><p>T 23:38 I have just made 2 slices of bread with garlic butter which I am really enjoying, and I also poured himself another glass of red wine.</p><p>T 23:41 I think I am on my plateau now. I feel pretty sedated and euphoric. My legs still feel warm. I am going to make some more slices of bread with garlic butter because I am hungry.</p><p>T 00:11 The effects have grown even stronger. I am feeling even more sedated though I am not feeling more euphoric. The wine has amplified the sedation with a factor of two.</p><p>T 00:21 Feeling even more sedated, the wine has definately contributed a lot to this amplification. I am going to brush my teeth so I don't have to do this later. When I'm done I'm going to continue reading on online about GHB.</p><p>T 00:31 I have just brushed my teeth. I am still pretty sedated though also tired. I am going to sleep in 5 minutes. This has been a good experience, like it always is with GHB for me, only a bummer it has such a short duration.</p><p>T 00:41 My legs are feeling warm again, actually a lot warmer than it had felt the whole night. This feeling is very pleasant and feels somewhat like opiate warmth but more intense and just local.</p><p>T 00:51 The warm feeling has grown even stronger, my legs are almost burning of warmth, though the feeling is now even more pleasant than it was earlier this evening. I am also even more sedated than I was earlier this evening and nodded out a few minutes ago. I am really going to sleep within 5 minutes.</p><p>T 01:01 I am still feeling somewhat euphoric, though the euphoria has largely subsided. I am feeling pretty sleepy so I'm going to get some well earned rest.</p><p>T 01:17 Admitted experience report to the forum. I am going to sleep now, nighty night.</p>",
 "year": "2006",
 "id": "60869",
 "gender": "Male",
 "timestamp": "2007-05-09T07:00:00.000Z",
 "views": "12575",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "5.0 ml",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:10",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:30",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ]
}
