{
 "title": "A Warm Opiate Feeling",
 "author": "Psych0naut",
 "citation": " Psych0naut. \"A Warm Opiate Feeling: experience with Kratom (ID 60872)\". Erowid.org. Feb 22, 2007. erowid.org/exp/60872",
 "substance": "Kratom",
 "bodyweight": "58 kg",
 "report": [
  "<p>I haven't done Kratom before, and thought 3 grams would be a good dose to start with, so I mixed it through a cup of chocolate milk and heated it in the microwave.",
  "T 21:25 I ingested the cup of chocolate milk containing the Kratom. I didn't notice the bitter taste many people describe, it just tastes like chocolate milk always dose, the only difference is there's grounded up herbs floating in it.",
  "T 21:47 I read that 3 grams of premium is a rather small amount, so I decide to redose and take the other 3 grams. I mix it through chocolate milk again, and heat it in the microwave.",
  "T 21:55 I ingest a second cup of chocolate milk, containing 3 grams of premium Kratom. Total amount of premium Kratom ingested is 6 grams.",
  "T 22:25 I don't feel much, almost nothing at all.",
  "T 22:45 I'm finally feeling some of the warm opiate feeling, also, I'm more social, and just had a short conversation and really enjoyed it. The warm feeling is slightly increasing, and I'm also feeling relaxed. It's time to listen to some Coldplay and Massive attack.",
  "T 23:00 I'm defenitavely feeling some of the warm opiate feeling, and pretty relaxed, listening to some Coldplay. Time also appears to fly, 15 minutes seems like just a couple of minutes. I don't think the feeling is going to increase much, which is a bit of a bummer for the price I had to pay for the Kratom, but I'm certainly going to order some more, and try a bigger dose next time.",
  "T 23:15 I still feel the same as 15 minutes ago, though the feeling seems to fade away when I walk around. When I sit or lay down, the feeling starts to increase again, but fades away when I move around again.",
  "T 23:30 The feeling seems to have faded, I'm feeling very little at the moment, though my mind is still a bit clouded.",
  "I barely feel the warm opiate feeling I had earlier ago, the feeling appears to come up en fade away again after a while.",
  "T 00:06 I'm feeling some of the warm feeling again, I'm going to grab a blanket, rap it around myself, and get cosy. On second though, I didn't grab the blanket, I just stayed on my chair, and continued surfing Drugs-forum.",
  "T 00:50 I'm still feeling relaxed, but the warm feeling is gone, I'm practically at baseline. This experience wasn't as good as I hoped for, but I'm definetafely going to do it again with a higher dose.",
  "T 01:23 I thought it was over, but some weird feeling is coming back again, I'm feeling weird in my stomach, I'm going to get a glass of milk.",
  "T 02:24 I'm still feeling a bit 'weird', though no other effects are noticed.</p>"
 ],
 "year": "2006",
 "id": "60872",
 "gender": "Male",
 "views": "33935",
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:30",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2007-02-22T08:00:00.000Z"
}
