{
 "id": 6087,
 "title": "Usage Ups and Downs",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Henry",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I found a big bottle of this stuff in my Mom's medicine cabinet and I went on to research it a bit.  I found that it had opioid-type effects and being that I certainly enjoyed the effects of vicodin I assumed that I would like this.  I found that a typical initial dosage was around 100 mgs so I tried this.  I took the pills at about 9 o'clock and after about an hour I felt the typical opiate buzz arrive. It stayed with me until I decided to go to bed which was probably about 12 to 1 in the morning.  Throughout the night I would awaken to an itchy sensation all over my body, but it wasn't unpleasant, just like what I get with vicodin. ",
  "The next day I woke up as though nothing had happened the previous night; I felt completely normal.  The following night I decided to repeat this experiment except this time I would take 150 mgs.  The effects were precisely like the night before albeit a bit more intense.  Once again I awakened feeling fine.  I thought it would be wise to wait a while before trying it again to avoid building up any tolerance.  About a week later I decided that I'd like to see how much further I could take it so I tried 200 mgs.  I once again felt great that night and slept very well.    The effects were once again a little bit more intense than the previous time.  The following morning I awakened feeling quite bad.  I had to go work so I got ready still feeling a bit intoxicated from the previous night. ",
  "On the way to work my stomach became quite upset and I was force to pull the car over and vomit.  I got back in the car feeling a bit better but still not great.  Once I arrived at work I was informed that I had to go pick up some supplies from a store nearly an hours drive away but that a coworker would be coming along with me.  He drove up to the store and I sat in the passenger seat all the while feeling progressively worse.  On the way I ended up vomiting out the window of the car... not the most pleasant experience while heading down the highway.  I thought that I felt fine after this because I had vomited quite a bit more that the previous time so I thought it would all be out of my system. ",
  "However once I arrived at the store I still felt a bit stoned and really didn't feel like speaking with the sales people.  Once I arrived back at work I went to my office and proceeded to fall asleep for nearly two hours.  I awoke feeling pretty bad again and I vomited for the third time that day.  I went home after this and lied down.  Lying down made me feel much better than moving around.  The next day I was fine again.  I assumed that the dosage that night had been too high. ",
  "I have since then used tramadol in smaller doses of 100 and 150 mgs on a few nights but every time I do it I end up feeling pretty bad the next day until at least noon.  I don't know what happened and why tramadol made me feel great the first two times and makes me feel so bad now.  I don't want to use it any more... the pleasure of the substance is most definitely out weighed by the terrible hangover the following day."
 ],
 "erowid": {
  "id": "36876",
  "citation": " Henry. \"Usage Ups and Downs: experience with Tramadol (ID 36876)\". Erowid.org. Jun 25, 2007. erowid.org/exp/36876",
  "substance": "Tramadol",
  "views": "5651"
 }
}
