{
 "title": "Completely Unexpected",
 "author": "Jewfie",
 "citation": " Jewfie. \"Completely Unexpected: experience with Coleus (ID 60903)\". Erowid.org. Mar 12, 2007. erowid.org/exp/60903",
 "substance": "Coleus",
 "bodyweight": "270 lb",
 "report": "<p>I realized there was an abundance of Coleus in my school greenhouse. I quickly gained interest. Once I was sure of its effects and how to 'do' it, I was on my way. The next day at school I took just 2 medium sized, almost completely red leaves with just a bit of light whitish-green around the outside. They were very beautiful looking. I rolled them up and carefully stuck them in my backpack for when I got home.</p><p>I took a couple fairly big leaves just so I could see if there were any effects at all before I went smoking large amounts.</p><p>When I got home I broke the leaves up into pieces so they could be dried. I took an oil incense burner and took the bowl off the top and replaced it with a sheet of tinfoil (tea candle underneath, tin foil held up about 3 inches from the candle. I put the pieces on the tin foil, rotating them every once and a while. Once all the pieces were dried out I put them into a container for about an hour until I was ready to smoke it.</p><p>When I was ready I rolled an L-Pape style joint out of it which came out to what would have been a NICE sized cone for a one person marijuana session that would get me pretty high.</p><p>I proceeded to smoke the joint. After the first few pulls I noticed that my heart felt like it was going to explode out of my chest. It wasnt racing, just felt like it was beating REALLY hard. It kind of scared me because I'm a big guy and I was worried about a heart problem. I quickly calmed myself down and watched my chest vibrate as I finished the joint.</p><p>At first I was kind of disappointed because I didn't think it was working. If anything I had a slight contact high like one feels when being around a lot of stoned people.</p><p>The next little while was strange... after about 5-10 minutes while I was reading something my vision went a bit blurry, like when one looks at a computer screen for a really long time, but I had only been looking at it for a little while cuz before hand I was busy with my coleus smoking. Upon looking around my room I noticed that it wouldnt go away.</p><p>At this point I was excited because it was starting to kick in. After the next 10-15 minutes I started to feel extremely happy, and my body was all FUZZY (thats the only way to describe it). All I could do was smile, and the whole time I felt like laughing, but I couldnt. I just had that pressure feeling in my throat like when Im about to laugh. on top of that, EVERYTHING had an aura (a glowing color around the object), and everything had a different one. And to my eyes, my skin looked blue and green around the edges of my limbs.</p><p>After the effects set in I decided it was a good time to watch Beavis & Butthead and enjoy my high. While watching this, the effects kicked in even more. my computer screen started to warp, and shift around as if it were but a puff of smoke. not to mention I couldnt focus on anything, and when I tried I'd zone out and go cross eyed, but the main thing (usually beavis/buttheads face) was clear as day. At some point I called my friend, it made me realize how messed up I was I was talking like I had just smoked a blunt to my face.</p><p>The high lasted for a good couple hours, fading out slowly. But the annoying blurry vision stayed for a while. All in all it was a really fun experience.</p>",
 "year": "2007",
 "id": "60903",
 "gender": "Male",
 "timestamp": "2007-03-12T07:00:00.000Z",
 "views": "16355",
 "dose": [
  {
   "time": "0",
   "amount": "2 leaves",
   "administration": "smoked",
   "substance": "Coleus",
   "form": "(dried)"
  }
 ]
}
