{
 "title": "Another Perspective",
 "author": " 4-Acetoxy-DiPT",
 "citation": "  4-Acetoxy-DiPT. \"Another Perspective: experience with  4-Acetoxy-DiPT, Cannabis, Alcohol (ID 60914)\". Erowid.org. Apr 12, 2007. erowid.org/exp/60914",
 "substance": " 4-Acetoxy-DiPT, Cannabis, Alcohol",
 "bodyweight": "150 lb",
 "report": "<p>The Beginning Blow....................................</p><p>The first time I experienced this drug was at a friends house with a whole gang of people. I and about 8 other people took the same amount by snorting it. Let me tell you straight off, this stuff has probably the worst drip I have ever experienced.</p><p>After about 20 minutes or so pupils started to dilate and hearts began to race. Some experienced nausea but only 1 or 2 actually vomited. However shortly after experiencing this everyone began to experience the trip.</p><p>In my personal experience I snorted 25 milligrams and waited about 25 minutes when I started feeling the nausea. This was however light and didn't effect me much. When I started feeling it though I had no clue what I was in for. I started experiencing a strong visual trip at first. Geographic patters and just about anything else that popped into my head bounced around in the darkness. It seems the best place I found to sit was a corner piled with soft pillows. This makes you feel amazing.</p><p>I soon found myself alone in front of a computer on the game WoW, underwater with my character for about an hour just watching the waves surround me. Once that faded though, I started feeling very hyper and felt an extreme happiness. Overall this took about 6 hours for the drug to run its coarse but in the end I felt no side effects whatsoever.</p><p>Seconds Anyone?.......................................</p><p>The Second time was probably just as if not more interesting as the last. This time I had 30 milligrams. I had received this batch with a few friends, and when we took it we decided to go our separate ways for the night. Seeing as how we'd already experienced it and now knew we could handle ourselves in an open environment. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I took this and went home for a good hour as it was kicking in. Yet instead of what I experienced before with the visual trip, this was making me think about a million things at once. Then, searching the web and looking at far off places just made me more and more optimistic and energetic. I soon found myself in my car driving around feeling like I was on top of the world. Almost as if I had just won the lottery and all my problems in my social life just ceased to be. Its really unexplainable except to say it was similar to ecstasy but a bit more of an intense feeling to become something bigger. The entire trip only lasted about 4 hours but I will remember it forever.</p><p>Third Times a Charm....................................</p><p>This wasn't the last time I took Ace but it was the last time I had gotten a hold of a solid batch. It was Halloween and a party ensued. I and 5 others took it. This time I had an upped dose of 35-37 milligrams, and was smoking marijuana and had been drinking moderately.</p><p>This started off as the others with the nausea and heavy heart beating. This time though, it was a mixture of a visual trip and a thinking trip. The night had its ups and downs but in all was pretty fun, but unmemorable at times as I somewhat blanked out on occasion. This probably was caused by the alcohol, but I can't be 100% sure. I ended up falling asleep during hour 4 or so, but continued to see things in my sleep. When I awoke, my friend was ready to go home and I went with him. At this point I felt a lesser version of my second trip, including a warm and fuzzy feeling. This trip was in all about 6-8 hours long.</p>",
 "year": "2006",
 "id": "60914",
 "gender": "Male",
 "timestamp": "2007-04-12T07:00:00.000Z",
 "views": "6381",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "4-Acetoxy-DiPT",
   "form": "(powder / crystals)"
  }
 }
}
