{
 "id": 6092,
 "title": "A Rapid River of Thoughts",
 "date": {
  "submission": "2008-03-13T07:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Odie",
  "gender": "Male",
  "weight": "127 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. semilanceata"
  },
  {
   "time": "0:45",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. semilanceata"
  }
 ],
 "report": [
  "Its a Halloween night, Im dressed up as a soldier. I just get in after trick or treating for abit, Its then around 8:00pm and I take my first 3.5gs orally but in a tea.  After a few minutes of finishing them off, my friend Whou I will Call 'X' tells me that I shouldnt have eaten so much because im real little both short and skinny and that I dont know what im in for. I shrug. ",
  "We proceed to the 'Floyd Room.' This 'Floyd Room', is a pitch-black room where theres nothing but Pink Floyd playing sometimes other bands like The Doors, or The Beatles.  While im in there waiting for the mushrooms to kick in; Im thinking about a movie I last watched 'Apocalypse Now' which is my favriot [Viettenam] war movie and eventually after sitting thinking about that movie, I can feel the room im in expand, It feels as if it grew about another 20 feet and all the objects in there disappear besides X and I because I can hear him giggling and breathing, I begin to grow confused as to what im feeling because this is my first time trying shrooms. I wasnt sure if I was feeling it, but I knew it had to be the shrooms. I couldnt get the smirk off my face and My mind just kept flowing.",
  "After the effects kick in abit more, I get a hold of what I think the trip will be like. I begin to giggle so I lie down to see what visuals I get if any, I close my eyes and nothing seems to happen, all of a sudden I feel the room shrink, so I quickly open my eyes, and in front of me it seems as if the wall moved really close to me and there were many different colors, in a plaid pattern, I reach out to see if I can touch this pattern but with no luck it just moves further away. I then notice a small stream of light coming through a small crack in the window, it begins giving off little waves of shadows through the darkness, I begin opening and closing my eyes, playing with the vibes from the stream of light and the Plaid pattern that keeps appearing.",
  "All of a sudden X lights a match and moves it slowly until it burns out, It boggled my mind, It made many thoughts  go through my head and my body began to feel like it was full of sand. He continued to do so, I eventually became use to it and knew how to play with the bright light of the flame. Every time the flame would glow I would try and absorb it into my body, so I could feel this warm sensation go through the entire surface of my body and my mind.",
  "After what seemed like an eternity of playing with those matches, My reality was shattered. Another friend who will be known as 'Z' was also on shrooms came crashing through the door and whipped on the light, I felt like I was a rat in a sewer and some kids shined a flash light on me. My first instinct was to flee just incase it was danger so I scurried underneath a desk but then after that blindness went away from it going from pitch black to flourescent light bright I came out and he was sitting there with another bowl with about three or four grams of dried shrooms in it. Him and X starting eating them so I thought to myself I think im at my peak so I began munching down as well like they we're potato chips. But I glanced at his watch and I found out it has been only 45 minutes and my trip had only began and I now have more shrooms in me.",
  "So the lights go back off, and I begin thinking of things in my life, looking for answers to some things, and questioning myself with everyday questions but I think of nothing that I havent thought of before while sober. So I get my lighter out and start flickering it, Making the flame dance for me as if it was my own little friend. I called him my own little friend because I could get him to dance and move and stay however long as I pleased as well as somehow absorbing the energy it would be giving off sending that sensation through my body again. I put my lighter away because the metal on it grew too hot and I burnt myself and it scared me and sent a feeling of anxiety through my body so I sat against the wall and concentrated on breathing.",
  "My friend then starting playing with his matches while he was doing this 'The End' by 'The Doors' came on. Which made me think of 'Apocalypse Now'  again because its the intro song on that movie.  At this time the shrooms have kicked in a lot more and I remember im in my soldier costume, and that at the Beginning of the movie during this song there was napalm falling everywhere and my friends matches also resembled that, so I started breathing really fast and thinking/feeling there could be a war on the go and im part of it. So I try and control myself so I get back into my shelter(Under the desk) and I begin giggling and laughing and breathing fast because everything was so perfect and intertwining, so beautiful. [The End Playing, Me Dressed up as a Soldier, Matches being lit resembling napalm a fair bit] I felt as if I was in the movie. Every Scene flashed through my head, But soon enough the song changed, and the matches ran out.",
  "After about 60-90 minutes the mushrooms have started to hit me really hard, I start breathing a lot faster, shorter quick breaths. It made me worry, and made me start to think again, about everything. This time Life. Which is where my trip began to go down hill. I begin questioning life, and trying to figure out the meaning. I narrowed down everything. I made everything in life seem like it had no point or meaning, because we all die in the end. I thought it wouldn't make a difference if I went out and started tearing my friends house apart because the worst that would happen to me is that I go to jail, get beat up etc..etc... and Id just die in the end, which was the outcome to any situation I put in front of me, 'Id just die in the end' so I started getting really scared at this point.",
  "Also during this feeling up stairs people were jumping up and down banging on the floor, For some reason I think its a fight breaking out. And all these thought of life being pointless, a fight breaking out upstairs, me dying in the end is all racing through my mind. So I get up as fast as I can before I get any strupid regrettable thoughts and I race out to a half well lighted room I open a window or two, I sit down and I start controlling my breathing again. I then begin to shoot some Jack Daniels to help waken me up/(sober me up[yeah, right]) and come to realization of its just the mushrooms. I then get complete control of my trip again. Then I re enter the Floyd Room and begin to controll everything I can do in reality and many of my visuals. It brought me to a calm uplifting state, From that point on my view on life has changed. I think it changed for a more positive outlook, My experience expanded my mind to an extent that I didnt even think of, not even on Acid.",
  "The last part seemed really scary at first but when I thought about it, I came to the conclusion I actually enjoyed it, I enjoyed the thrill and the adrenaline that shot through my body while I was really scared and in attack mode(when I thought the fight broke out).",
  "At first I thought that shrooms would resemble acid, but I was wrong. Mushrooms are much more darker and I have to have alot more self control when using them. My Mind can Expand to any unimaginable plane."
 ],
 "erowid": {
  "id": "36892",
  "citation": " Odie. \"A Rapid River of Thoughts: experience with Mushrooms (Psilocybe Semilanceata) (ID 36892)\". Erowid.org. Mar 13, 2008. erowid.org/exp/36892",
  "substance": "Mushrooms (Psilocybe Semilanceata)",
  "views": "4501"
 }
}
