{
 "title": "Beautiful in Moderation",
 "author": "Offbeat Dude",
 "citation": " Offbeat Dude. \"Beautiful in Moderation: experience with Diphenhydramine  (ID 60933)\". Erowid.org. Nov 28, 2007. erowid.org/exp/60933",
 "substance": "Diphenhydramine ",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Diphenhydramine in my opinion is a truly beautiful substance when taken in moderation. I often used to hear about train wrecks and horror stories involving the drug so when I first decided to give it a try I made sure that I was taking a very small dose in comparison to what many say is the norm.</p><p>When I first took the substance I started off with only 100MG's barely if at all over the recommended dose. I felt the effects very lightly and decided that next time I would up the dose.</p><p>A few days later I bump the dose up to 200MGs and I can safely say that I have found my groove. The buzz that was produced with such a small amount was beautiful. I became very, very relaxed. I found that things on TV and conversations with friends became a lot more funny to me. Not to the point where everything was hysterical and I found myself giggling like a complete fool but just to a point where it was alot easier to appreciate the humor and laugh. Everything became a lot more interesting as well and overall I had a great feeling of well being.</p><p>I was in control the entire time but my mind WAS altered. Just enough to where it was enjoyable.</p><p>Since then I've always used the substance at around that dosage and always had an enjoyable experience. I've even found that using  it about an hour or 2 before sex allows be much greater stamina in terms of controlling climax and when I do reach that point it produces a bit of a drawn out longer orgasm. Imagine an Orgasm in slow motion and thats what you get.</p>",
 "year": "2007",
 "id": "60933",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-28T08:00:00.000Z",
 "views": "6723",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ]
}
