{
 "title": "Disaster",
 "author": "Ambiengirl",
 "citation": " Ambiengirl. \"Disaster: experience with Ambien & Various (ID 60998)\". Erowid.org. Oct 15, 2007. erowid.org/exp/60998",
 "substance": "Ambien & Various",
 "bodyweight": "109 lb",
 "report": "<p>I am a nurse in Los Angeles and I work on a very busy medical surgical unit. I work the night shift from 7p.m. to 7a.m..</p><p>I got off work on a beautiful July morning in 2005. I got home and did my usual routine of taking my beautiful little Pekingese, Kong on a short walk in the park across from my home on Sunset. I got home from the walk and took my multivitamin and an Ambien 10mg.I had been taking Ambien for approximately 7 years without incident until that day. I then took a warm shower and put on my pajama pants and tee shirt and down on the couch to watch some TV before crashing. I was already feeling the wonderful relaxing effects of the Ambien. I learned over the years of taking Ambien that if I fought going to sleep, I could have a wonderful little 'Ambien trip'. I would feel this warm sensation in my chest and feel my whole body relax and my mind would totally disconnect from reality. This was always an enjoyable side effect of Ambien until this day.</p><p>The doorbell rang and it was my neighbor and I invited him in and I asked if he would like some coffee. I made a pot of coffee on Ambien and did a pretty good job of it. I remember sitting there while my neighbor rambled on about his love life with a girl that was just using him. A really boring story. I took a second Ambien because I thought the effects of the first Ambien were diminishing. Anyways my neighbor left about half an hour after he arrived. At this point I can only remeber parts of what happened next. I remember taking two more Ambien and calling a friend of mine who was at work and laughing and falling on the floor and I remember my friend asked me to please get in the bed and to not smoke in my house and he would come by and check on me at lunch. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I remember thinking lunch sounded really good, so I got my keys and my Pekingese, Kong and drove to the local hamburger joint and pulling up to the drivethru and pulling to close and backing up and pulling forward and scraping the side of my car against the building. Well there was an LAPD cruiser behind me with two officers witnessing all of this maddness. I was asked to pull over for questioning. I submitted to a breathilizer test blew a 0.00. I then submitted to a field sobriety test and failed it miserably. I remember being really embarrassed and scared at the same time. I was then promptly arrested for DUI and went to jail for the day. I bonded out about nine hours later and my friend picked me up. I remember I took an hour long shower when I got home and I also remember feeling depressed and horrified of what took place that day.</p><p>The next night I was so depressed and scared, I drank a couple of beers and took two Ambiens and I attempted to drive to my friends house because I was so scared and depressed and now I was totally drugged out of my mind from the Ambien and the beer. I was driving down the wrong side of the road and hit a palm tree. I was sent to the hospital that I worked at and was treated for minor injuries and was re-arrested for another DUI. I really fucked my life up in two days from abusing Ambien. I lost my nursing license and had to pay an attorney $14,000.00 to defend me. I had to pay another $30,000.00 in rehab treatment fees and counseling fees. I am now free from Ambien, but still miss it, but I know that I can never take another one or there is not telling what would happen next.</p>",
 "year": "2005",
 "id": "60998",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-10-15T07:00:00.000Z",
 "views": "23511",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Coffee",
   "form": "(liquid)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
