{
 "title": "Mutual Experience of the Ever Present Now",
 "author": "Galactic Reset",
 "citation": " Galactic Reset. \"Mutual Experience of the Ever Present Now: experience with LSD & DMT (ID 61042)\". Erowid.org. Sep 13, 2008. erowid.org/exp/61042",
 "substance": "LSD & DMT",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(gel tab)",
   "",
   "20 mg",
   "insufflated",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "report": "</p>We had a small house warming party at L's new place. L and I had taken 1 hit of these clear-yellow gel tabs. Not too strong, but a nice trip with good friends.</p><p>As morning approached, L and I decided to retreat to her bedroom to snort some DMT together.</p><p>I wieghed out 20mg each (we wanted to start low)</p><p>L snorted hers first. By the time I had wieghed out mine and snorted it, she was already lifting off.</p><p>One note about snorting DMT, be sure it is really clean. Ours was snow white and glistened. Looked like crushed up glass. Purity is important. Who wants to put garbage up their precious sinuses?</p><p>L and I layed on the bed for a short bit. I could feel it rising up. Then, like some one flicked on a light switch, it hit.</p><p>I do not have a solid recollection of all the events that transpired, but I do recall L saying I looked like an Alex Grey painting. I laughed and then she did as well. How amazing that he captures this experience so well in his art.</p><p>about 15-20 min into the experience, L and I locked eyes. At first if was as if they were negotiating some sort of network connection, then they just locked completely.</p><p>At this moment, the whole scene around me dissolved into colored lines all seperated in black space with just a single set of eyes in the middle. They werent hers or mine, just eyes observing the ever-present now.</p><p>This must has lasted for about a minute before we disengaged and reclaimed our own perspectives in our own bodies.</p><p>I confirmed with L that she had the same experience as I did. We were both truely astounded by this.</p><p>A little bit later, L told me she was confused and lost and needed help. I gently held her, helping to ground her and allowing her to relax and let go of whatever it was that was bothering her. The energy passed and we both rested until sleep came.</p><p>We woke up feeling well rested and quite hungry.</p><p>All in all, it was a beautiful experience.</p><p>Though there is very little literature on the subject, DMT is definitly active when snorted. The burn is pretty bad but it subsides quickly. We both had some residual sinus sorness the next day but nothing horrible (I've snorted far far worse)</p><p>I hope to experiment some more with this method, employing higher doses. I'm curious to also try 20mg again with out LSD, as I'm wondering how much of a difference it will make. Seems like LSD potentiates DMT quite a bit.</p>",
 "year": "2007",
 "id": "61042",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2008-09-13T07:00:00.000Z",
 "views": "5643"
}
