{
 "title": "9:00 PM",
 "author": "Erica",
 "citation": " Erica. \"9:00 PM: experience with LSD (ID 6105)\". Erowid.org. Feb 13, 2002. erowid.org/exp/6105",
 "substance": "LSD",
 "bodyweight": "98 lb",
 "report": [
  "<p>I'd always been fascinated with acid, ever since I was 13 or so I'd wanted to try it. Up until then, my drug experiences consisted of smoking weed, almost every weekend in my senior year of high school, and a few times a month since I was 14. As far as alcohol goes, I'd only been drunk twice prior to that, can't stand the taste enough to get drunk easily.",
  "The friend of mine that hooked me up with acid got 2 cubes, one for each of us, but he decided not to dose, so he let me have both, each one was from a different supplier as well. The night I decided to do it, he wasn't there, but I was in my house with my two closest friends. I was in my room, which I can only say is PERFECT to trip out in.... posters and all sorts of stuff covered every inch of my walls and ceilings. My dad was still awake, but for some reason I decided to take the first sugar cube. About 45 minutes passed, and I was starting to get pissed, nothing was happening. I decided, what the hell, I'm gonna take the other cube. Let me just tell you, eating a cube of sugar tasted like shit. I was almost gagging, but I managed to swallow it down. About 2 minutes after taking the second cube, the first one started to kick in. Oh shit. I'd just taken two hits of acid for my first time.",
  "I immediately started smiling and giggling like mad, my walls had started to 'breathe'. I recall looking at this calendar I had, the picture that month was of a field of red flowers, as I looked at the picture, it was if a wind was blowing through the field making the flowers move.. it was quite beautiful. Kelly, who had tripped 100's of times was trying to fuck with me... but it wasn't working, i was just giggling and talking about all the stuff in my room. My anime posters seemed to be starting at me, but it wasn't frightening, because I knew it was only the effects of the drug... \t",
  "For the next couple hours I sat around looking at my walls and talking to my friends, at one point I left my room and was talking to my sister and my dad and watching the wooden cabinets swirl... the whorls in the wood had taken up a life of their own. I remember talking to them and in the back of my mind I was thinking 'Whoa shit, the wood is swirlin'.' I'd managed to make it downstairs. I sat on my computer for a while listening to the Beatles white album, Helter Skelter was playing and I was eating canned fruit, the fruit tasted quite normal... but Helter Skelter was a tad bit scary, so I decided to go upstairs again, at this point I was peaking, it must have been around 2-3am...",
  "I talked to my friends until they fell asleep, and around 5:30am, I sat on my bean bag watching the sunrise from my bedroom window, it was intensely beautiful. At that point I felt an overwhelming presence of God. Not Jesus/personal God, but a divine energy sort of 'God'. I felt as though for a moment in time I'd experienced the presence of something far bigger than myself. I just clearly remember sitting on the bean bag, with my 2 closest friends sleeping on my bed, watching the sunrise, feeling this presence.",
  "At that point, I decided to take a shower, my peak was over, and I was feeling the drug wearing off.. my shower curtain was rippling, it felt as though a wind was caressing it... I fell asleep that morning around 6am, a different person.</p>"
 ],
 "year": "1997",
 "id": "6105",
 "gender": "Female",
 "views": "7489",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:45",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2002-02-13T08:00:00.000Z"
}
