{
 "title": "The Yins and Yangs of the Speedball",
 "author": "Hunter S. Johnston",
 "citation": " Hunter S. Johnston. \"The Yins and Yangs of the Speedball: experience with Cocaine & Heroin (ID 61112)\". Erowid.org. Jan 5, 2010. erowid.org/exp/61112",
 "substance": "Cocaine & Heroin",
 "bodyweight": "170 lb",
 "report": "<p>INTRODUCTION:</p><p>I am not just writing a I got fucked up!!!  report, but a guided tour of how I get high using needles.</p><p>It is a hassle not having a car, and having to sneak around discretely. My roommate has no clue I do anything worse than smoke pot. So waiting at the coffee shop, I lost patience on my first coke-dealer (had to work at 6:00 PM).so my heroin guy picked up the coke as well before he picked me up drove me home. The first dealers phone calls were ignored since he was late. So I scored a half-gram of heroin, and a teener (1/16th of ounce) of cocaine for the price of an eightball. I was limited on time since I had to work, and wasnt going without the rewards of payday</p><p>A.) The Cocaine Ringer...</p><p>4,30 PM:  I went to my bathroom and carefully rationed out a  gram of coke in my spoon. I measured 40 cc of water. I rolled up a q-tip for a filter. The cocaine was good quality, chunky and had a rainbow shine. It dissolved well in the water and turned clear. I always get real excited when get ready to shoot up, had to do it slowly because my hands were shaking. I popped it into a good vein in my forearm. I pulled the plunger back to get a blood flow. Bingo! I shot it all in. As soon as I shot a rinse of water from my needle into my mouth I felt the desired effects. The taste slowly fills all of the taste-buds, nerves, and tissue. My whole body felt like a warm blanket covered my skin from toes up to my scalp. The music I had playing had a great flangy/ phaser effect and all I could do was just say ahhhh! The body buzz was more euphoric than ecstasy! That with the sound effects was my chemical-orgasm. There are no words to describe the feeling.</p><p>4:40 PM: Slowly felt the peak fade away.  Now this is where I want to do something so I dont get stuck on stupidthe restless energy I am left with tweeking on coke.</p><p>B.) The Heroin Follow-up</p><p>I wasnt going to work half-cocked. I needed a balance for the coke, and booze wasnt an option. Now I never mix cocaine and heroin at the same time because I cook my heroin, where if you cook the coke its gonna turn gooey and harden, thus clogging the needle and wasting dope.</p><p>4:55 PM: The heroin was a gray/tan chunk. I crushed it into a fine powder. I dumped about and tenth of a gram, maybe more into the spoon. I measured out 40 cc of water and slowly squirted it into the powder. I then lit the bottom of the spoon with my lighter until the brown mixture dissolved into a golden liquid. I dropped a new q-tip ball into the mix and pulled out a good 35 cc. I then found a different vein to shoot the dope in. I felt it immediately. Ahhhh! Kind of like 5 long island ice teas or  taking 5 1,000 mg vicodine pills. I get a nice body buzz and a spinning in my head. I always want to be seated when I do this. Breathe. Relax and enjoy. This lasted over 8 hours. I always end my coke rush with a heroin glow to get rid of the cravings. </p><p>C.) SUMMARY</p><p>Work was a breeze. Only one of my supervisors sensed I may have been on something, but is cool and told me to smoke pot after work next time. I repeated the same steps as above until I reached a critical supply level. I wrapped the goodies up and am saving them for a rainy day.</p>",
 "year": "2007",
 "id": "61112",
 "gender": "Male",
 "timestamp": "2010-01-05T08:00:00.000Z",
 "views": "21431",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "IV",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:25",
   "amount": "0.1 g",
   "administration": "IV",
   "substance": "Heroin",
   "form": "(powder / crystals)"
  }
 ]
}
