{
 "id": 6113,
 "title": "Seizure Inducing Combo",
 "date": {
  "submission": "2004-09-27T07:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "CactusBrain",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "tablets",
   "administration": "oral",
   "substance": "Lithium",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "   I just want to warn anybody taking Lithium (or probably most other psych meds) to NEVER do acid while Lithium is in your system. I was in high school, and I had to take Lithium. Anyways, I was taking it for a couple months, when I came across some acid. I've done LSD before I ever took Lithium, and I really liked it a lot. I didn't know that they don't mix.",
  "   Two hours after dosing, I went to a park. I was feeling really jittery even though I wasn't tripping that hard. Well, soon enough, I was tripping insanely hard, and began losing control of my body. Music was playing and getting louder and louder until it was louder than sound could physically exist. I sat down on the grass, so I wouldn't fall. My arms started flailing and I started shaking. I couldn't even really tell what was happening because I lost control over being able to think. My mind was insane, I could not think a thought, and I was gripped in terror. Eventually, it became so intense that I blacked out.",
  "I woke up in a ditch, covered in leaves and dirt, and began to walk back to my car. I had to ask somebody along the way, whether I was alive or not, what planet I was on, what year it was. My mind was completely empty of what former reality consisted of. I went to my car, and saw its' blue paint. I remembered the color I was looking at was called 'blue.' I started remembering things about my life and about reality again, like what my name was for instance. Anyways, the trip was over, I don't know how much time had passed.",
  "I went home and turned on the TV. On the bed, began to have yet another siezure and I couldn't breath. Eventually it stopped. Since that time, I have known two other people who have done LSD on Lithium. One had a violent siezure like me, and the other one had a very intense, terrible trip. DON'T MIX THESE DRUGS, IT IS LIKE BEING IN HELL."
 ],
 "erowid": {
  "id": "37002",
  "citation": " CactusBrain. \"Seizure Inducing Combo: experience with LSD & Lithium (ID 37002)\". Erowid.org. Sep 27, 2004. erowid.org/exp/37002",
  "substance": "LSD & Lithium",
  "views": "17362"
 }
}
