{
 "id": 6116,
 "title": "I Am on Another Planet of Greatness",
 "date": {
  "submission": "2008-01-17T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "140 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Background of drug use: Cannabis, Cocaine, Oxycontin, Hydrocodone, PCP, Alcohol, Tobacco, Methylphenidate, Antidepressents, DXM, Salvia, Caffiene.",
  "Experience: Another boring day, went over a friend's house, we will him M. He had 2 other people over, C and T. We were just hanging out, smoking cigarettes, talking, the usual. We were trying to buy some shrooms, but our seller ended up not coming up with the stuff. So, instead, we decided to just buy about 4 grams of pot. Then, B came over, and C left. We went out in B's car, and went to roll a blunt. I wasn't really feeling like smoking pot this time, so I said 'You three just smoke, I'm set, I don't feel like being tired right now'. Also, I didn't want to have to drive home stoned, not something I usually do.",
  "Then the fateful words came out of B's mouth. 'Dude, you left about 10 ritalin in my car the other day, why don't you just take those?' This sounded good, so we went back to the car, got the pills, and drove to M's house. The pills he had were the 20 mg each, so I was figuring I'd do 5 and get a good high. But, me seeing how stoned my friends now were, I decided 'Fuck it, I'll do em all'. Not a good idea.",
  "So I pop 7 in my mouth, and down em with a drink. Since it takes a little bit for it to affect me orally, I said 'Screw it' and just made the other 3 into a line and snorted them. AHHHHHHHHH the familiar feeling. Got the drips for a bit, and had to blow my nose a lot for the first few minutes. After that, I was on super drive.",
  "I was talking a mile a minute, and my friends couldn't get a word in. Everything I said was followed by 'Know what I mean' and 'Right, right'. Also, I was planning events that were occuring a good six months in the future. I had so much ambition, so much drive, it was insane. When I do high doses, it is almost like cocaine the way I feel. I am not on top of the world, I am on another planet of greatness. However, this did not last long.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I drove home about 11, and had a little chat with my mother. She totally could tell I was fucked up, but didn't really say anything. She went to bed, and I went on my computer and talked to many people, a lot I don't know, until about 1 in the morning. This was the start of hell.",
  "My heart was beating so fast I thought I was going to die. I was afraid to move because I thought it was going to cause my heart to explode. I was freaking out. This was the most fucked up I had ever been since I snorted OC, except this was in a bad way, a very bad way. I almost asked my mother to take me to the hospital, and this is not a usual occurrence.",
  "Believe me, I love the effects of Ritalin. But the fear that thinking I am dying gives me is terrible."
 ],
 "erowid": {
  "id": "37007",
  "citation": " Anonymous. \"I Am on Another Planet of Greatness: experience with Methylphenidate (Ritalin) (ID 37007)\". Erowid.org. Jan 17, 2008. erowid.org/exp/37007",
  "substance": "Methylphenidate (Ritalin)",
  "views": "12648"
 }
}
