{
 "title": "Watching the Fractals Cannabalism",
 "author": "Jack",
 "citation": " Jack. \"Watching the Fractals Cannabalism: experience with Zolpidem, Methadone & Cannabis (ID 61187)\". Erowid.org. Aug 22, 2010. erowid.org/exp/61187",
 "substance": "Zolpidem, Methadone & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  " repeated",
  "",
  "Pharms - Zolpidem",
  "(pill / tablet)",
  "",
  " ",
  "",
  "Methadone",
  "(daily)",
  "",
  " repeated",
  "",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Watching the Fractals Cannabalism</p><p>An Ambient Experience</p><p>Intro</p><p>A friend of mine, a person who some might call a pseudo-pharmacist, did me the pleasure of providing me with some Ambien (zolpidem).  The 10mg pills were skinny white ovals, lightly coated and very dense.  He told me that, although they are sleeping pills, they make you trip.  Yes, trip!  Like mushrooms! he assured me, Visuals and everything!  He advised me to take 2 pills, and to definitely not drive or pretty much do anything dangerous.  I was skeptical, never have I heard of a psychedelic sleeping pill.  But here I am, with several of them.  First I must say that I take opiate painkillers daily for a back problem, and I also smoke Cannabis quite frequently.  I was on both of these at the time of my Ambien voyages.</p><p>The first night</p><p>Dose: One 10mg tablet orally</p><p>A short while after consuming the tablet I began to feel reminiscent of a small bit of Valium or even Flexoril (cyclobenzaprine).  This feeling lasts for some time without progressing, then fades away.  I did not sleep any better that night than I normally would have.</p><p>The second night</p><p>Dose: One 10mg tablet orally</p><p>       10mg tablet insufflated</p><p>Repeated same as first time.  After the first pill had kicked in I snorted half of another one.  The pill burns the nose and I decided to abandon the other half.  Effect was slightly more pronounced after snorting this half-pill.  I did not sleep any better that night than I normally would have.</p><p>Third times a charm</p><p>Dose: Two 10mg tablets orally</p><p>Here I go, two tablets,  I began feeling the effect I have described twice now.  Its kinda cool, strong enough to not be boring, but its not even near psychedelic.  Its not even dissasociative.  I layed down on the bed in my room and waited for a while longer.</p><p>After a bit I noticed that I was, in fact, pretty high off the shit.  I sat up and looked around, my eyes darted between the posters I have scattered about the walls of my living space.  I looked at a large fractal poster, very detailed and colorful, shaped like an explosion, or implosion perhaps, of psychedelic energy.  It was the damndest thing, the poster was eating itself.  Rather, part of it was eating another part of itself.  It didnt have a mouth, or teeth, or even a true form, but the motion in which it was moving distinctly told me that it had turned around and was gnawing on itself.</p><p>I had done it.  I had achieved psychedelic visuals from a pharmaceutical sleep aid.  They werent too complex or meaningful, nothing that wasnt there, no colors even just object distortions, pattern movements, etc.  No closed eye visuals, no audials, no tactiles just a little visual eye candy.  It was pleasant, yet quite manageable, not overwhelming.  No anxiety.  It does not seem like something I could have a bad trip from.  I got up and walked to the bathroom, where I examined the wallpaper, which was moving around in a liquid fashion, melting perhaps.  I examined the 1 floor tiles, which were blinking and shifting positions and shapes.  I examined the wood grain of the door, which looked like rain almost.  I went back into my room, layed back on the bed, and woke up the next day.</p><p>Conclusions</p><p>Zolpidem can DEFINITELY cause hallucinations.  It is much milder than mushrooms, the visuals from Ambien are similar, but much less intense.  I personally experienced no anxiety.  The flip side to that coin is the fact that experienced psychonauts would probably find Ambien boring, compared to mushrooms, acid, salvia, etc  Ambien is probably not going to cause any religious experiences, although I personally have not gone higher than a 2-pill dose.  I think probably one would forget much of the experience if the dose was too high.  I experienced some hazy-memory feelings, but not too bad, much less than Xanax.</p>",
 "year": "2006",
 "id": "61187",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-08-22T07:00:00.000Z",
 "views": "6229",
 "dose": {}
}
