{
 "title": "The Green Fairy and Me",
 "author": "Playswithfire",
 "citation": " Playswithfire. \"The Green Fairy and Me: experience with Wormwood & Various (ID 61181)\". Erowid.org. Nov 29, 2007. erowid.org/exp/61181",
 "substance": "Wormwood & Various",
 "bodyweight": "200 lb",
 "report": "<p>Last spring I ordered a 10ml vial of essential oil of wormwood from a reputable internet entheogen supplier. As an amateur psychonaut my reasons for selecting this particular drug were most likely romanticized accounts of absinthe intoxication in literature and film. Though I've had my fun with the substance, I wouldn't recommend it to anyone without patience, discipline and a good knowledge of preparation and dosage. I have none of these things of course.</p><p>My first experiment was to make some 'absinthe'. Basically I bought a bottle of Pernod and added about 15 drops of the oil to it. I'd read an account of someone else doing the same, though this person recommended about 10 drops per 750ml bottle. Of course, the liquor and the oil don't mix, so I have to give it a shake before pouring myself some. Through this method, I get drunk long before I notice the effects of the wormwood. Being, as I said, undisciplined and impatient, I upped my dosage, adding more drops to the bottle and sometimes a drop or two right in the glass. When I did begin to feel the wormwood, it was like a lucid drunk, I was very clear headed but had the distinct feeling something was off. At some point during the evening I packed a bowl with marijuana, salvia divinorum 20x extract, resin of leonotis leonurus, and yes a drop or two of wormwood oil. In my hotboxed pickup truck, I got right stupefied and eventually went to bed.</p><p>The next morning I felt fine, no hangover, no lingering effects as far as I could tell. Then in the afternoon I started walking the two miles to work. About halfway there, things started to get funny, I never saw anything distinctly hallucinatory, but something wasn't quite right. This lasted my entire evening shift, I'd catch things out of the corner of my eye, and generally mistrusted my senses. The pattern repeated for the next few days, whenever my activity level went up I started feeling funny. I came to the conclusion that the orally ingested thujone had deposited itself in my fat and was being burned whenever I became active.</p><p>After three or four days of mild tripping, one starts to wonder if he hasn't given himself some brain damage. Hoping to purge the stuff from my system I began consuming copious amounts of caffeine. If my goal was to burn through the stuff faster, it certainly worked. I entered a state like the onset of a psylocibe mushroom trip. Walls moved when I wasn't looking at them, co-workers would turn around to see me standing on tables for no reason, and I generally went around doing and saying rather silly things. After almost a week of tripping, it finally wore off, but I retained a feeling of suspicion towards my senses for months afterwards.</p><p>So I haven't tried taking large amounts orally since then, if it was in my system that long it stood a good chance of causing liver damage I'd imagine. I have occasionally dripped some on a bowl of grass, with varying effects. It seems that one needs to get it burning pretty hot in order to feel it. There was one instance in which there was some wormwoody resin left at the bottom of the bowl of my small plastic bong before my friend and I threw a large roach in there. His grass was a very sticky 'juicy fruit' and burned nice and hot with a big red cherry. As I was taking a large hit near the bottom of the bowl I tasted a distinct change in the flavour of the smoke which was immediately followed by a wave of sensation passing through my head. My friend and I were still on shift, and we ended up having to stay quite late to get everything done because well, we were tripping balls. Walls melted, everything was funny, and my friend spend an hour rearranging objects to look like faces and then taking pictures of them on his cell phone. It was crazy.</p><p>I've never had the days-long effects when I've smoked it, only from oral consumption, but honestly I know too little about how the substance works to be doing the experiments do. Be careful out there, from what I understand, thujone is an incredibly powerful neurotoxin and a lethal dose is a pretty small one. LSD is safer, and easier to regulate doseages. Unless you're an advanced pyschonaut, or just crazy and stupid like me, it's probably best to stay away from it.</p>",
 "year": "2006",
 "id": "61181",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-29T08:00:00.000Z",
 "views": "9074",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Wormwood",
   "form": "(extract)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(plant material)"
  },
  "4": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Leonotis leonurus",
   "form": "(plant material)"
  },
  "5": {
   "time": "",
   "amount": " repeated",
   "administration": "",
   "substance": "Caffeine",
   "form": ""
  }
 }
}
