{
 "title": "Wow My Heart Is Gonna Explode",
 "author": "Carl",
 "citation": " Carl. \"Wow My Heart Is Gonna Explode: experience with PCP & Cannabis (ID 61196)\". Erowid.org. Mar 6, 2007. erowid.org/exp/61196",
 "substance": "PCP & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  "DOSE:",
  "1 cig.",
  "smoked",
  "Cannabis",
  "",
  " ",
  "smoked",
  "PCP"
 ],
 "report": "<p>Ok, so after a hard week of school Friday came and I was looking to smoke with my friends. We bought some weed from this sketchy kid and rolled a blunt. We went to a usually spot to smoke and started puffing away. That's when I noticed something weird, the taste and smell were off, it smelled like nail polish remover, and the taste was horrendous. After about 1 cipher of the blunt I was fucked up. I felt all rubbery, and out of nowhere I just started sprinting down the street to my friends house. I felt like just going crazy. I sat down on my friends porch and that's when the worse drug experience of my life happened.</p><p>I remember sitting in a wicker chair, and hearing a beating sound, I put my hand on my chest and started to panic. My heart was beating insanely fast. I felt constantly out of breath and really hot and scared. My breathing patterns were insane, I was taking huge gulps of air and yelling 'THIS IS THE ONLY WAY I KNOW HOW TO BREATH RIGHT NOW.' My friend's face started to turn extremely red and was sweating.</p><p>Phase 3, me and my friends decide to get into his car. I get in and I felt very small in his car. Now the weird thing is, his car is a very small Jetta. After this I really don't remember much. I could barely talk and my thoughts were racing so fast. I thought every thought anyone could ever think twice. I don't remember going to sleep or anything.</p><p>The next morning I woke up and felt out of it, I wondered what drug I had done last night. I was a veteran pot head and have smoked an exotic variety of weed so I knew that shit had to be laced, after reading about PCP and its effects I knew I had done it.</p><p>The suck ass part is that it has damaged me permanently. Whenever I smoked weed my heart races super fast and I can't enjoy because it feels terrible. It also left me with a terrible case of anxiety. </p><p>Don't ever do PCP it fucking sucks.</p>",
 "year": "2006",
 "id": "61196",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-06T08:00:00.000Z",
 "views": "13358",
 "dose": {}
}
