{
 "title": "In the ER for Akathisia",
 "author": "one",
 "citation": " one. \"In the ER for Akathisia: experience with Diphenhydramine & Ziprasidone (Geodon) (ID 61197)\". Erowid.org. Mar 6, 2007. erowid.org/exp/61197",
 "substance": "Diphenhydramine & Ziprasidone (Geodon)",
 "bodyweight": "205 lb",
 "header": [
  "DOSE:",
  "100 mg",
  "oral",
  "Pharms - Ziprasidone",
  "(daily)",
  "",
  "25 mg",
  "oral",
  "Diphenhydramine",
  "(daily)"
 ],
 "report": "<p>I am bipolar, and my psychiatrist decided to put me on geodon, 100mg.  So I get home and take it.  About an hour later I felt extremely agitated and I could not stop moving.  I tried to take a warm bath to calm down, sat in it for about 5 minutes and then I had a strong urge to leave.  I would start smoking a cigarette, take a hit or two then put it out, and 10 minutes later I would do this again.  I also repeated trying to calm down in the bath, only to have to leave it after a few minutes.  So I decided to go to bed, which was difficult but eventually worked.</p><p>The next afternoon, I took all of my medication as I usually do and went to work.  This turned out to be a mistake as, like the day before, the symptoms returned only this time about 100 times more intense and I had an overwhelming sense of doom.  So I talked to my boss and managed to get a ride down to the emergency room.</p><p>After waiting for what seemed like an eternity I finally saw the doctor.  He recognized it immediately as akathisia and prescribed benadryl to be applied through an IV.  I was nervous with this because I experimented when I was younger with this stuff and it was never a good experience, and even low dosages of benadryl make me uncomfortable, but at this point I was willing to try anything.</p><p>So after another eternity, the nurse finally comes in and gives it to me and BAM, it went away instantly.  The relief was so great that it was almost orgasmic.</p><p>So now I am still on the geodon, but I take a 25mg benadryl everyday with no return of the akathisia.</p>",
 "year": "2005",
 "id": "61197",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-03-06T08:00:00.000Z",
 "views": "31933",
 "dose": {}
}
