{
 "id": 6123,
 "title": "Brain Overload",
 "date": {
  "submission": "2008-01-23T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mark",
  "gender": "Male",
  "weight": 62
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "The other day a friend of mine A, his roomate T, his roomate's girlfriend J, a friend of the girlfriend L, and I all went out driving to smoke. J was driving. I hadn't smoked in 5 years, and back then nothing really happened.  So I decided to give it another try.",
  "As we drove, When it was my turn to hit, I took huge drags off of the pipe and held my breath for as long as I could, with the hope that I'd feel something this time.  After about 3 times around, each time taking as much as possible I started to feel it.  This was after probably about 15-20 minutes.  I noticed that everything seemed to become extremely slow.  Like time had slowed down, but not really.  When I moved my head, my hair would move and it would move with normal speed, but when looking at things not directly in my face, things seemed ultra slow.",
  "I asked my friend A if he was feeling anything, since it was his first time too.  He said not really.  I noticed when I talked to him that my voice seemed an octive lower than usual.  My mouth tasted/felt extremely sticky and dry; I needed a drink.  A wanted to stop by his brother's anyway so when we got there I got out with him so I could get some water.  On the way into his brother's I found I could barely walk straight. Things looked very strange.  My head felt like it was compressing a little and everything looked like it had no depth.  It looked kind of like a pop-up book, with each object being a card on a surface, not 3 dimensional like usual.",
  "When we got inside, I grabbed a small glass of water and drank it.  The water instantly cleared up my cottonmouth and I felt much better.  I wasn't feeling paranoid and I didn't feel like laughing.  I just felt like exploring the intensity of the experience.  After stopping at his brother's, A and I went back to the car and J started to drive back to the dorm.  We passed the pipe around more until our stash was gone.",
  "When we got back (about 45 min in), we all got out and I wondered if I really was moving as slowly as I thought.  I assumed no since no one said anything and started to walk towards the doors.  Before we made it to the steps up to the building, some friends of ours who were smoking cigs on the smoking island called us over to talk for a few.  Me and A went over there to talk to them.  One of my friends was talking to me, telling me something, but I couldn't focus at all on what he said.  I just replied with 'yeah' and 'cool.'  As I was standing there, I notice that when I moved my head it seemed that I was turning the background of everything with me, as If I was looking at a wall, and when I turned, the wall was still flat in front of me.  Eventually we got out of there and I noticed that A was acting completely normal.  I don't think he was anywhere near where I was, I could barely put a thought together, much less sing songs and talk fast like him.",
  "We went in and I wondered how bloodshot my eyes were and if people would notice.  I wasn't worried, just curious.  When we got up to the floor we were staying on, I stopped at the mirror and noticed that my eyes were very very red, but doubted people would notice.  We grabbed a movie, 'Rounders' and put it in. I was sitting on the chair in front of the TV.  As I was watching, I noticed that I could only see things at one depth in front of me, like if there was a pop can 4 feet away and a bottle 5 feet, I could only see one at a time.  Once I found this out, I noticed something very strange, when I looked from one thing to another at different lengths away in a line going up I could like 'overload' my head.",
  "I looked at the controller on the floor and from that to the desk, then to the TV, then the clock on the TV, then to the ceiling, and when I did that my head would 'overload' and I would trip out for a second and my head would go back to the beginning. I found that if I did that multiple times in a row quickly I could get my head majorly overloaded.  It wasn't a bad thing, just weird.  Kind of like I was dizzy, but not being at a disadvantage.  I wondered if the people in the room noticed my head rolling all over the place, but no one said anything, so I assumed they didn't.  Time seemed to be going by very very slow. ",
  "It started getting late, so I rode my bike back to my real dorm which was across campus.  I had no problem operating it. The cold air bothered me.  I got back to my place, did a little more 'overloading' and then tried to sleep.  I was unable to though and ended up getting no sleep at all, I just couldn't fall asleep.  The next day after I gave up on sleeping and took a shower and ate breakfast I still noticed that I was slightly light headed and had a bad headache (easily cured with liquid Advil tabs). ",
  "None of the other people who smoked had anything similar to the experience I had.  I'm glad that I was able to experience this 'brain overload' but hope that someone else will eventually be able to understand what I am talking about."
 ],
 "erowid": {
  "id": "37028",
  "citation": " Mark. \"Brain Overload: experience with Cannabis (ID 37028)\". Erowid.org. Jan 23, 2008. erowid.org/exp/37028",
  "substance": "Cannabis",
  "views": "3510"
 }
}
