{
 "title": "A Surprising Amazonian Treasure!",
 "author": "Endless Sky",
 "citation": " Endless Sky. \"A Surprising Amazonian Treasure!: experience with Erythrina mulungu & Cannabis (ID 61269)\". Erowid.org. Jul 2, 2007. erowid.org/exp/61269",
 "substance": "Erythrina mulungu & Cannabis",
 "bodyweight": "145 lb",
 "report": "<p>I was recently at a large indoor Pagan convention on the West Coast. While there, I browsed a botanical purveyor that had many interesting herbs- the most of which (for me) was 'mulungu' bark.</p><p>The label on the package stated very simply: 'Amazonian Mulungu Bark Erythrina mulungu', measured in 100g. The label stated it to be a sedative/hypnotic, and since I have had a long time need for valium for anxiety, I thought I'd give it a try.</p><p>After a bit of poking around online, I was still coming up empty, except for a few vendors. Most of them seemed to agree that there were no known side effects and that it's been used in the rainforest for centuries as a hypnotic/sedative and is currently used for anxiety and as a smoking aid. One site claimed it was actually competative at nicotinic repectors. I didn't believe this, but I decided after a bit of browsing for 'mulungu' and 'fatality' and not finding anything to go for a cuppa.</p><p>I boiled my teapot around 9pm, not really expecting too much, but deciding to warn my husband ahead of time just incase any complications should arise. I served out 3 tsp. of mulungu into my nice brown butterfly mug (from my mother- from childhood =) very 70s). I placed a plate on top of the brew and let it steep for 10 minutes, straining the pulp and discarding it. I sipped cautiously and waited for 10 minutes to see if I developed any signs of an allergic reaction. The flavor is remeniscent of anise, but not in a bad way....perhaps slippery elm root is a better comparison.</p><p>Well, I didn't react poorly, and I slowly finished the rest of the tea off over the course of a 1/2 hour.  I soon became very drowsy. As I started drifting, I joined my husband in bed after my sleeping time bowl of cannabis. I've been smoking tobacco since I was 12 (Am 26 now), and really want to quit, and just as I nodded off in bed next to my husband, I thought, 'I really want to quit- for my health and his, maybe the cannabis will help...' and fell asleep.</p><p>The next day I woke up and felt pretty good. The mulungu certainly was soothing if nothing else. I got up and started doing chores. I didn't really think about the fact that I didn't have a cigarette. In fact, I forgot all day, until about 7 when I saw my husband and roommate lighting up. I started to go for my smokes and then realized I didn't want them anymore. I smoked a bowl of very good grade medical cannabis (which I take for nausea), and considered my lack of desire for a smoke.</p><p>In my hubris (and perhaps because I intermittently smoked alot of cannabis with the mulungu no negative result), I thought that perhaps the Goddess had heard my prayer and was helping me to quit. This went on for about a 1/2 hour until I realized, 'No. This is not a miracle, the Gods dont do those anymore. What's the one different thing I've done today??'      </p><p>The only thing was the mulungu. I I know this sounds like a commercial for this wierd tree bark, but I swear, it worked for me. I actually came to this revelation while in my car on a windy road near my house. I was so surprised I called my husband. That night, I decided to repeat the experiment and see if I craved a cigarette.</p><p>The second night I made the mulungu - this time with a bit more reverence and less trepidation than the first time. I brewed up 3 heaping tsp. of ground bark (I wonder how they sterilize this stuff....if they do...). I put a plate over the cup to contain the steam and keep in nutrients- I've been told to do this by several herbalists for several different herbs, so I gave mulungu the same treatment. I let it soak for 10 minutes, then drained off the bark and drank the liquid. I felt a subtle tinge of relaxation after about 15 minutes, and there was a quiet buzzing to my thoughts. I have found a few internet sites saying that mulungu is an ingredient in some alternative ayahuasca recipes. From the slightly foggy drowsiness that I've come to expect from mulungu, I wouldn't be surprised. </p><p>The third day I tried not taking the tea: on the 4th morning I actually thought a cigarette sounded good, and it sounded better and better as the day wore on. I was happy to drink my tea that night, because the next morning: no cravings.</p><p>Thanks to the mulungu, I now know that what I was feeling when I longed for a cigarette wasn't my actual thoughts - they were cravings. I know this because I've felt no desire for a cigarette whatsoever. I've tried to smoke to see how it would feel: it tasted poor and was unpleasant. I thought I should write - because other people should know that I took mulungu and didn't die. And it seems to be synergistic with cannabis, and is an extremely excellent smoking cessation aid. Blessings to all - my story may not be common- YMMV. Have fun and be careful!</p>",
 "year": "2007",
 "id": "61269",
 "gender": "Female",
 "timestamp": "2007-07-02T07:00:00.000Z",
 "views": "17465",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Erythrina mulungu",
   "form": "(tea)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
