{
 "title": "Non-prescription Cure for Anxiety",
 "author": "SyM3i0Te",
 "citation": " SyM3i0Te. \"Non-prescription Cure for Anxiety: experience with St. John's Wort & Gingko biloba (ID 61311)\". Erowid.org. Nov 1, 2007. erowid.org/exp/61311",
 "substance": "St. John's Wort & Gingko biloba",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "St. John's Wort",
   "(daily)",
   "",
   " ",
   "oral",
   "Ginkgo biloba",
   "(daily)"
  ]
 ],
 "report": "<p>I recently began using St. John's Wort and Gingko Biloba to help with anxiety and depression. In my past I used ALOT of ecstasy, and recently quit at the end of summer last year. I was noticing that I was depressed quite a bit and would have anxiety attacks. I really didn't want to even start down the prescription anti-depressants route, since once you start it's very hard to stop.</p><p>I read some experience reports about St. John's Wort being an antidepressant and axiolytic, so I decided to give it a try. After about a month of use with minimal success I switched to a different brand which also contained Gingko Biloba extract. I'd heard of Gingko before but never read anything about it. I've been using this St. John's Wort and Gingko combination for about 4 months now, and I actually feel alot better. All anxiety is gone and I feel much healthier mentally. I take 3 400mg capsules every morning, and I feel great the whole day. It's not a buzz per-se, but just very clear-headed feeling, all thoughts are in order, bit of euphoric/stimulant effect. Especially goes great with coffee. I would recommend this especially for anyone who has used alot of ecstasy and is feeling down all the time. Definately a substitute for some of the precription solutions out there (ie. Prozac, Zoloft)I just wanted to share this information with everyone since I've had great success with it. Thanx</p>",
 "year": "2007",
 "id": "61311",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-01T07:00:00.000Z",
 "views": "17027",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "St. John's Wort",
   "form": "(daily)"
  }
 ]
}
