{
 "id": 6132,
 "title": "The Beast",
 "date": {
  "submission": "2004-09-29T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Rye",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "18 in",
   "administration": "oral",
   "substance": "Cacti - T. bridgesii",
   "form": "(tea)"
  }
 ],
 "report": [
  "Preparation-I purchased an 18 inch trichocereus bridgesii, also known as achuma cactus from a local nursery. The catus is a deep turqouise color and looks very healthy. I remove the spines and cut the cactus into thin circles. then I boil the material in water and lemon juice for 1 hour. The resulting brew is by far the nastiest, most bitter thing I ve ever tasted. Down the hatch!",
  "Setting-my house, the upstairs apartment to be precise. Its always served as a good place for parties, and a very mellow place for me to smoke ganja and trip. I lie on the bed and watch Adult Swim, waiting for the effects.",
  "After about 1 hour, I feel myself slipping from sanity. The ties that bind my rational personality are slowly melted away. I try to be positive and control the trip, but the trip controls me, increasingly pulling me from reality. I begin to get increasingly paranoid, and glance around the room . I look over to the kitchen and see something moving on the linoleum. A hand slowly pushes its way through the tiles, and an arm and head follow. The whole world around me is lit up like a giant neon display, too intricate too decribe. the  man slowly works his upper half through the linoleum and looks at me with his featureless face. At this point I knew I d taken too much. I look away from the man and close my eyes. I blast from the bed with such force that the vertigo makes me vomit. After a short vomiting session I lay back down. This is where things get seriously intense. At this point im incapacitated, barely clinging to conciousness.",
  "I feel a presence enter the room. The room darkens and trembles. Its emmensly large and male. With a thundering voice It declares itself The Beast.  Why do you seek me? the beast demands. I say  I come seeking inner wisdom.  The Beast says something that I ll always remember.  You dont come seeking wisdom, you seek hapiness. Hapiness can never be found through materials(such as the cactus) , True hapiness lies within .",
  "Then he leaves. The paranoia and anxiety leave. He leaves me with a smile on my face. I see the ceiling above me crack open and crumble away and universes and galaxies rush by. The secrets of life are exposed to me. my life is just an insant on the infinite span of time. The universe expands forever within me and without. Races and civilizations are born and die immeasurable times. I cry from the beauty of the things im exposed to. And 12 hours later, still tripping very hard, im left with the knowledge that sometime, somewhere, I have lived before, and will live again. And again. and again. . . . . . ."
 ],
 "erowid": {
  "id": "37055",
  "citation": " Rye. \"The Beast: experience with Cacti - T. bridgesii (ID 37055)\". Erowid.org. Sep 29, 2004. erowid.org/exp/37055",
  "substance": "Cacti - T. bridgesii",
  "views": "34018"
 }
}
