{
 "id": 6134,
 "title": "In the Zone",
 "date": {
  "submission": "2010-05-01T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Civilized Chaos",
  "gender": "Male",
  "weight": "230 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "22.5 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Pharms - Promethazine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I hate doctors. I hate hospitals even more. This is very ironic because I happen to be very accident prone. Anyways, a day before I was to have foot surgery (don't ask) my doctor made the mistake perscribing me some Vicoprofen and some promethazine to help its effects.",
  "Well needless to say that being the spacecadet I am I filled it that day. That night I took 3 of the 7.5/200mg pills with a promethazine pill to take the edge off. Being out of action and not having to work for three weeks was very appealing with a script of this stuff. After taking the the pills I laid out on the couch and watched regular Monday night NBC progams for two hours. I really couldn't tell anything was happening till I tried unsucessfully to get up for some pizza I had ordered. WHOA! my brain said, but my legs didn't get the signal. I had never been drosy or dizzy before with any Pharms. After several seconds for the seemily 7 differnt parts of my body to begin to comunicat to each other I got up. Talk about a headrush, but in that nice 'Cool' way. Walking was a little uneasy but I made it to the door. I had a little trouble grabing the knob but finally jerked it open,....into my self. The pizza guy brought the food in after that and looking rather really stoned I told him to keep the 8 dollar tip.",
  "So with pizza in hand and and a head full of feel good off went the lights and on came Kimball collins on surround sound. I didn't feel like dancing but was totally in my zone. I lay on the couch upside down with my feet propped up on pillows and my head hanging off the side. The news to a nice trance album was very intresting. After that I tried to read and found my imagination take off. 'Red Storm Rising' was a film in my head. Very very relaxed and at peace. My wife found me the next morning when she came still upside down on the couch sleeping like a baby.",
  "In retrospective, This was the best chill out drug combo I have ever had."
 ],
 "erowid": {
  "id": "37061",
  "citation": " Civilized Chaos. \"In the Zone: experience with Hydrocodone with Ibuprofen (Vicoprofen) & Promethazine (ID 37061)\". Erowid.org. May 1, 2010. erowid.org/exp/37061",
  "substance": "Hydrocodone with Ibuprofen (Vicoprofen) & Promethazine",
  "views": "9331"
 }
}
