{
 "title": "Effect on Diabetes",
 "author": "Dak",
 "citation": " Dak. \"Effect on Diabetes: experience with Piracetam & DMAE (ID 61340)\". Erowid.org. Mar 12, 2007. erowid.org/exp/61340",
 "substance": "Piracetam & DMAE",
 "bodyweight": "170 lb",
 "report": [
  "<p>Mindset: Clear concise, yet tired from rave.",
  "I was turned on to Piracetam after having experienced Modafinil for a while. Modafinil is great I just don't feel like staying up all the time. Though I did like the increased memory and cognitive ability(s).",
  "After taking into concern what I was putting my body through while sleeping only every other day, I decided to try Piracetam. There are many different 'racetams' out there but this one seemed to be the safest and affected most people that tried it. There are others but they seem to have a higher failure rate and one or two have some nasty effect on the liver.",
  "I found the taste of Piracetam to be horrid and decided that at the dosages I would be taking, I should invest in a capsule machine.",
  "2x800mg Piracetam - 3 times a day   (spaced about 4-6hours apart)",
  "1x200mg DMAE - 2 times a day   (spaced about 8 hours apart)",
  "1x Mens 1-A-Day Multi-vitamin",
  "I noticed clear benefits the first day after the attack dosage (roughly 4 grams, sometimes not necessary for everyone). I felt more aware of my surroundings and had a general feeling of being  on my game. These effects disappeared for 2 days only to reappear and grow stronger over time. (this seems to happen in alot of cases)",
  "As a martial artist and a type2 diabetic I pay attention to what my body is doing more than most and I've grown quite attuned to how I feel and what's causing that feeling. The first thing I noticed was increased reflexes. My neuro-kinetics are great to begin with, they are noticably better now. Things fall in slo-mo from time to time. My general attitude is better. Being more on top of things and having less procrastination seems to be a benefit as well. Anxiety is a thing of the past. I feel like I have the patience of a tibetan monk now.",
  "I don't believe my dopamine levels are raised from Piracetam or DMAE, however they may be slightly increased due to how well I'm accomplishing things in my daily life now.",
  "The most pleasant effect was noticed about a week after starting. My blood sugar no longer seems to be a factor in my daily life! My life usually revolves around my blood sugar being too high or too low, causing me to feel sluggish and sleepy, almost stoned.",
  "After researching, Piracetam increases brain glucose usage and metabolism up to 25%, this percentage being different for everyone. THATS DAMN SIGINIFICANT! Not only that, but the same mechanism causes the blood in the brain to carry slightly more oxygen!  I've never been more amazed!",
  "Think of the nasty drugs that MD's prescribe for Diabetes and though they help, they can also damage other systems. Now I find something that has no LD50 and is so non-toxic that the FDA sees no reason to regulate it? I'm ecstatic!   ",
  "I notice now that I'm eating smaller meals more often. Not by choice, but because of the increase in metabolic rate and usage of glucose.",
  "Other welcome effects...",
  "* Vivid long-term memory recall. I have good recall to begin with, but now I can remember experiences I've had years ago in tremendous detail.",
  "* Increased ambi-dexterity. Training with weapons in either hand is much easier now. My training partners are becoming scared at my increased understanding of techniques and ability to use either side of my body to enact them.",
  "* Increased speed. They are even more scared of the slightly increased neuro-kinetics.",
  "* Slight strength increase. Maybe because of stronger or more efficient signals to nerves?",
  "* Greater ability to multi-task without getting confused. (self explanatory)",
  "So far I haven't found any problems while using alcohol, marijuana, or modafinil. Though alcohol and marijuana have the opposite effect of what I'm trying to achieve.",
  "I'm now free of the daily struggle that was food. I still eat right and even better in some cases as the sugar cravings are gone. Now I have more of a genuine 'belly hunger' when I need to eat.",
  "I make sure I have a choline source as Piracetam depletes this from the system. This depletion is usually denoted by headaches.</p>"
 ],
 "year": "2007",
 "id": "61340",
 "gender": "Male",
 "views": "19287",
 "dose": [
  {
   "time": "0",
   "amount": "4800 mg",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "DMAE",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": ""
  }
 ],
 "submissionDate": "2007-03-12T07:00:00.000Z"
}
