{
 "title": "Near Death Experiance",
 "author": "Amanita muscaria",
 "citation": " Amanita muscaria. \"Near Death Experiance: experience with Amanitas - A. muscaria & Alcohol - Beer (ID 61354)\". Erowid.org. Mar 19, 2007. erowid.org/exp/61354",
 "substance": "Amanitas - A. muscaria & Alcohol - Beer",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "17 g",
  "oral",
  "Amanitas - A. muscaria",
  "(dried)",
  "",
  "1 glass",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)"
 ],
 "report": "<p>I started with 2 and a 1/2 caps of mascaria mixed with a single beer. I had bought them online. They were grown and air dried. I was sent about 8 caps all had white worts on them.</p><p>About one hour after I took them I was feeling good and one with the universe.</p><p>About and hour and a half after I had taken them I started to see things. I saw a large yellow bus speed past me. Unfortunately at that point I couldn't stand. Than my baby sitter said to me,'If you are ok than say something, so I will know'. He kept repeating himself. I knew he really wanted me to do somthing, but I couldn't figure out what it was that he wanted, so I picked apart his sentence.</p><p>Some how through doing this I made the universe fall out of existence. I brought it back to existance. It than fell out of existance again. Than it began existing and not existing very very rapidly. Until I finally firgured out that he wanted me just to say something. I thought I recalled him picking me up at that point. He says that he never picked me up.</p><p>The next thing I know I was walking in the park and my leggs compleatly went out on me. I got back up ok and tried to walk. My leggs went out again, only this time I hurt my ankle. I started to cry almost histaricly. Some how my babysitter calmed me down and made me sit by a tree. This is my last actual memory, nothing past this can I remember.</p><p>My babysitter told me the last thing I said was,'There is a fly flying in my eye.' I can't help but think that this may have had something to do with the legend that if you eat the amanita muscaria you will see the lord of the flys. My sitter said that I than became compleatly unresponsive. No one could wake me up or get me to talk. After a while he got worried and called 911.</p><p>At the hospital, they ran every test on me possible, spinal tap, mri, Pregnancy?, blood. Aparently they didn't ever find out that I had taken amanitas, they though I had drank too much beer! During the night my entire body swelled, I wasn't breathing right, My heart wasn't beating right, and they repeativly had to sedate me because I was trying to rip my breathing tube out. Of course my parents got to sit in the room and watch all this.</p><p>The next morning I woke up in a hospial room that I had never seen before, with about 6 people I had never seen before. When I got home, I saw a fly for the first time in our house, just sitting on the mirror. I have seen them here and there in our house ever since. They have a very deep and spiritaul meaning to me now. They, in a way, represent death to me.</p>",
 "year": "2007",
 "id": "61354",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-03-19T07:00:00.000Z",
 "views": "19076",
 "dose": {}
}
