{
 "title": "Monday Blues No More",
 "author": "Joexperimenter",
 "citation": " Joexperimenter. \"Monday Blues No More: experience with Yerba Mate (ID 61386)\". Erowid.org. Mar 12, 2007. erowid.org/exp/61386",
 "substance": "Yerba Mate",
 "bodyweight": "105 lb",
 "report": "<p>So anyways Ive been drinking yerba mate since about September 06 with a few breaks in between.</p><p>Basically this weekend was Daylight Savings time and I couldn't get to sleep till like 12. I thought 'Hey why not get some ready for tomorrow'. I got a thermos and some Yerba Mate that I bought from Argentina about 2 weeks ago.</p><p>I only drank half which is about 1/4th of what I usually drink (it tasted like shit for some reason).</p><p>The below summarizes my experience.</p><p>6:30 A.M. - Downed the mate</p><p>6:55 A.M. - Music on ipod sounds mildly different(placebo?)</p><p>8:00 A.M. - Movie in English effects me a bit more emotionally than usual.</p><p>8:50 A.M. - Walked into Media Arts, my friend was putting files into different folders on the computer. This cracked me up extremely I was laughing for the entire duration of when he was doing it. About 3-6 minutes. I would say this was the peak but I could be wrong.</p><p>10:45 A.M. - Effects mellowed out until now. I went to drop a plastic ball into a test tube and as soon as I put it near the rim of the tube I cracked up completely, felt floaty, legs tense, arms tense, bent over a little as my stomach tensed cause of laughter.</p><p>10:50 A.M. - Attempt to put a second ball into the test tube and held back a milder giddiness and did it. Reflexes have been heightened I got the drop rate of the ball almost perfectly at 1.45 seconds.</p><p>11:05 A.M. - Just finished walking to class, my legs felt like jelly they were very lazy, although I felt like I could move I had no will to so my legs slumped.</p><p>12:00 A.M. - Looked over at my friends face and started laughing, more mild then last 2 times.</p><p>Thats basically it, I did feel a bit of a crash and got extremely frustrated. Besides that I would say that it was an awesome experience.</p>",
 "year": "2007",
 "id": "61386",
 "gender": "Male",
 "timestamp": "2007-03-12T07:00:00.000Z",
 "views": "10181",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "40 g",
   "administration": "oral",
   "substance": "Yerba Mate",
   "form": "(tea)"
  }
 ]
}
