{
 "id": 614,
 "title": "Drawing is Fun",
 "date": {
  "submission": "2002-06-25T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "anonnymous",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "oral",
   "substance": "Amphetamines"
  }
 ],
 "report": [
  "It was a half day at school this girl I know gave me some adderall(20mg).  The pill was orange & I think it had 2 letters on it.  I had never really done any drugs before so i was nervous.  But I took it right before 5th hour English and didn't feel any effects until about 20 mins into class.  She gave us this LONG ass test where you had to write like 3 essays and I only got 2 hrs of sleep the night before.  It took me five minutes to answer the 1st 3 EASY questions.",
  "Then I noticed my leg was moving up and down real fast (like when u r nervous).  Then it hit me like a bullet .  My eyes wide open and my hands were constantly moving druming on the desk or something.  All of my sleepiness was gone.  I looked at the question thought, and circled the answer.  Then the next question - next - so on... I got to the essay portion and wrote like two 8 sentence paragraphs.  My hands were soaring and I felt so good. Ends up I was the first person to hand in the test.  Then I finished 6 make up worksheets in 12 minutes .  Then we were allowed to talk and I couldn't stop.",
  "I didn' get the slightest bit nervous about anything.  I usually get sorta stuck up on girls I like but not on Adderall .  I was hitting on them right in front of their big boyfriends.  I did a presentation and I was just like all you suck.  I felt I was better than everyone in the room.  When I got home I called my experienced friend and he told me to draw and I'll love it.  He was right I sat there for an hour drawing weird shit and making my name look cool and stuff.  Then I cleaned all the windows in the house and my room.  It kicked ass.",
  "I havent done it since then its been 2 weeks but I will try it again.  Unlike many people no side effects took place on me!"
 ],
 "erowid": {
  "id": "11467",
  "citation": " anonnymous. \"Drawing is Fun: experience with Amphetamine (Adderall) (ID 11467)\". Erowid.org. Jun 25, 2002. erowid.org/exp/11467",
  "substance": "Amphetamine (Adderall)",
  "views": "51654"
 }
}
