{
 "id": 6140,
 "title": "Vilca Snuff Huff",
 "date": {
  "submission": "2004-10-03T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "psilly",
  "gender": "Male",
  "weight": 10
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 seeds",
   "administration": "insufflated",
   "substance": "Anadenanthera colubrina",
   "form": "ground / crushed"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "I burnt some Palo Santo in my room & the kitchen, its beautiful scent made me smile. Then I went and got 4 Vilca seeds from the baggy in my box and spaced them equally over a circle of blue gas in a clear pyrex pan with the lid on. After about 7 minutes they jumped up with a crack, each seed popping within a few seconds of the other. I sniffed at the smell of the toasted seeds with delight, it made my head warm. I took them into my room on the back of a small plate and picked off the dark brittle shells. Their skin came off in big sheets when I got it right, making things easy. The insides were a smooth mellow yellow golden brown candy I put into my Pestle & Mortar. They ground easily in pleasing circular movements.",
  "I calculated roughly a third the amount of the Vilca dust in Baking Soda and mixed it together, the powder turning pastel. I poured it back onto the plate and cut it into five fat fluffy lines. I was nervous, anticipating great pain before the pleasure of the high, fading thru it. Nonetheless I snorted the searing snuff with great enthusiasm, quickly turning to a painful panic. After the first line seemed to expand in my nostril turning my head to sandstone I wasnt sure I would continue. Tho for some strange reason my other, empty nostril called out to be filled with the sharp, eye-watering sensations of the snort. So I went ahead and cracked it up there. I sat back trembling slightly and decided I wanted to blow my nose, I did so before waiting a minute to assess any psychoactivity. There was a definite alertness that could be put down to adrenaline, but also something more.",
  "I decided to do another 2 lines one after the other, rather than draw out any discomfort. This was a good idea; I sat with swollen nostrils as bright sensations started to match the sharp pain with closed eye colour play. My eyes streamed tears down my face, my body gained more feeling, more weight  but my head felt light. A space opened up with tessellating colour changing walls generating a sensation of looking out into a vast rectangular room. They rushed either side of me while thin bright squiggly lines poured thru me. I enjoyed a spectacular horizontal showering of strange shapes then suddenly puked, letting out a groan that felt amazingly good. I vocalized AUM type noises for a while; they brightened the visions and brought heightened sensations to my body. My thinking process was completely normal but was engaged in a dialogue with the felt presence of the snuff  I opened my eyes for a second and saw one of my paintings shifting around, then it thought in me: He likes painting, lets show him ours.",
  "The tunnelling sensation seemed to slow and the squiggles stopped streaming thru me and stepped back into the centre of the room. They created fantastic moving abstract weavings shot thru with frantic ever shifting motion, It was Beautiful  unlike anything I could ever imagine imagining  and I told it so. I was enraptured for a good while, but found the patterns beginning to resemble static when some fuzzy thought clouded my attention. The word Entity was playing games in me, stirring memories and provoking questions. A sort of glassy silhouette stepped into view and rippled its aura across the room. I looked at it and saw myself depicted in sharp but wibbly detail. It danced around in front of me disappearing into the background in a folding multiplication of itself. Then it came up close, to be the size of me, and started doing strange shapes with its steady hands.",
  "After a while of awed gazing I realised it was waving to me, and I waved back with a smile. I saw that about half an hour had passed and got up to get my dressing gown, feeling a bit cold. I wobbled when I walked and felt euphoria & nausea rise entwined inside me. Then out. I snort and hack into my puke bowl, then blow my nose. I feel pain far less than pleasure now. I smoke a joint and enjoy waves of happiness and warm colours behind my eyes. The Vilca snuff continues to wave goodbye over the next hour or so, I believe next time I might see what its like to smoke it  having to snort so much of it is a real pain.",
  "My notes (scribbled directly after the closed eye peak):",
  "INSTANT PAINAUSEA THEN FRIENDLY EUPHORIA SQUIGGLY SQUIRLY ROOMY MOVEMENT OF MANY COLOURS A SILHOUETTE SELF WAVES SLOW PALM SHAPES IN JUMPY COLOUR SWITCHING GEOMETRIES WITH CHAOTIC RUSHING AURAS OF INFINITE DEPTH",
  "I WAVE BACK."
 ],
 "erowid": {
  "id": "37083",
  "citation": " psilly. \"Vilca Snuff Huff: experience with Anadenanthera colubrina (ID 37083)\". Erowid.org. Oct 3, 2004. erowid.org/exp/37083",
  "substance": "Anadenanthera colubrina",
  "views": "40367"
 }
}
