{
 "id": 6147,
 "title": "Upon a Clear Purple Night...",
 "date": {
  "submission": "2008-01-24T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Wanderer",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>My friends decided they would all do mushrooms together; they gave me three stems, which was two grams of shroom, or half of an eighth. I ate it as soon as I got it. I kept the stuff in my mouth for about 7 minutes because I heard that the longer you keep it in your mouth, the more intense your trip is. I also kept on drinking and smoking herb. I didn't think it would effect me. I began to think I hadn't eaten enough or something. I was still social, a little bit zoned on pot but no shroominess. Then Chad got a great idea; 'Let's go to the tracks.'",
  "There are train tracks that run through the park, but no trains run on the tracks. There was a beautiful vista from this one point on the tracks. We started walking back past the tennis courts. I remembered the cop who had hassled us earlier. 'Ha. Stupid cop' I thought. I looked up at the sky, and it was purple that night. It was not a visual distortion or a hallucination, those would come later. The sky was cloudy that night, and for some reason, they appeared purple in the nighttime light of the moon. Thirty minutes into it, I started walking backwards, and it felt really funny. 'So, this is shrooms' I thought. 'Cool.'",
  "I was having fun. My body felt like it was doing its own thing, and it felt so good, almost like it was doing its own thing, and I was just advising it. We climbed up some stairs and started walking down the train tracks. It was dark, but we were smoking pot on the way, and there were so many of us that I wasn't afraid or anything. Everything was going to be great. But how great?",
  "We found the spot, and I took a few more hits off of the pipe. Oh Yeah; Oh Yeah. 'Look at the Colors,' I started saying, even though I wasn't seeing any colors the whole night. My trip wasn't really colorful. I started asking the others how it was treating them. Nobody could really articulate. I felt like I was losing my balance, so I",
  "layed down on the tracks. They were a little wet, but nothing I was worried about. I was facing up, and I looked into the sky.",
  "It was purple, but the parts of it without color were black. There were stars in the black part. It looked like there were two separate parts to it. A black part and a purple part. The black part was good and the purple part was bad. There were stars in the black part. I concentrated closely, and I zoomed in on the stars. Wow. Wait, why are they repeating like that? I thought to myself, as the stars formed a repeating pattern of a sort of grid. It was beautiful. It was all one surface. The constellations were made out of negative space in between all of the stars. I saw Greek gods in the stars, and I could feel that they were alive, and even thought I don't know anything about Greek mythology, I knew who these gods were. The central image was of the Famous birth of man mural from the Sistine Chapel.",
  "They started to speak, but I couldn't understand their words in English, it was a different language, but I could still understand. They were telling me that I am in a church. So, I looked up at the canopy of trees that stood above me, and it WAS a church. The pattern in the trees were repeating, forming a roof above me and walls going high up to my sides. Because the trees were just starting to grow their leaves back, I could still see through the branches to the purple on the other side. It was stained glass.",
  "I realized what it was that they were trying to tell me. They were telling me that the origin of all human buildings were trees. It was a profound revelation that could only come to me when I was in this special mushroom place. I sat up and looked into the trees to my side. I saw Chinese writing that I could not understand, and I saw Egyptian hieroglyphics, and Mayan symbols. They were carved into the walls of the church. I sat in awe of what I had just learned and the beauty that surrounded me.",
  "Next, I looked through the trees, and saw the playground hundreds of feet away lit by orange street lights. I didn't realize it was the playground at first. I thought it was a city. I kept asking my friends, 'What's that city?' I thought it was Atlantis, with weird architecture, and a foreign purpose. After a few minutes of contemplation, I realized that it was a play structure.",
  "A light rain began to fall; not like the stuff that we have here. It was almost like a mist, but a little bit more intense. One of my friends who hadn't eaten any mushrooms was sitting on the tracks with the weed pipe, and he had broken it. Everybody started freaking out. and feeling the bad vibes that would ensue, I decided it was time for me to leave. The trip had peaked, and I was coming down (or so I thought...).",
  "Another kid was going to leave, and even though I didn't know him well, I was going to follow him out of that place. He started walking down the tracks, and I followed him. I would look at the trees around me with their fresh leaves, and the leaves all seemed to have purple or pink borders. Weird, I thought. There was a huge upturned tree that had been cracked in the middle. It loomed over me, and I thought it was a monster, but it was unthreatening, so I  just laughed at it. The guy I was following; Alexander was his name; not Alex, Alexander. He kept on appearing at different places on the tracks. He would be in front of me one minute, behind me the next. I was a bit confused.",
  "He split up from me after we left the tracks. Later, I would learn that he had stolen all of Chad's marijuana. He was a bastard. He was leaving because he was going to do something with his girlfriend or something. I walked to where Jules' car had been parked. Shit. my backpack was in there, and they were all still at the tracks, freaking out. I had a choice to make. Was I going to go back to the others, in the rain or was I going to walk home, 4 miles away. I chose walking home.",
  "On my journey home, I kept losing myself, and then I would snap back to reality. At first, I was just walking down the hill in the park, and I would forget where I was and then realize again. When I got to downtown, it started to get scary. The rain had picked up, and I would be walking through our metropolitan streets in my soaking plush coat, seeing images of my own death. I would be on the sidewalk, and I would see myself walking into the street and getting hit by cars; or I would fall into a manhole, or get knifed by gang bangers. When I got to the river (I had to cross a bridge) I kept on seeing myself falling into the water and dying. I started chanting a mantra 'never again. never again' and it made these unsavory visions go away.",
  "I managed to get through the lower East side without seeing any of these visions, and I finally got to my neighborhood. When I reached my house, backpackless; I clicked my key in the door and walked straight to the bathroom. I looked at my reflection in the mirror. I was soaking wet, and deathly pale. I knew it was over. Contemplating my beautiful reflection in the mirror, my father came downstairs. 'Are you alright?' he said, half concerned, half annoyed, but mostly asleep. 'Yes' I answered, and I went to sleep at 3 AM.</p>"
 ],
 "erowid": {
  "id": "37118",
  "citation": " Wanderer. \"Upon a Clear Purple Night...: experience with Mushrooms (ID 37118)\". Erowid.org. Jan 24, 2008. erowid.org/exp/37118",
  "substance": "Mushrooms",
  "views": "2660"
 }
}
