{
 "id": 6149,
 "title": "We Have to Take the Wrapper Off of Reality",
 "date": {
  "submission": "2007-06-11T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Brown ghost",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 10x"
  }
 ],
 "report": [
  "Mindset & Setting: it's a Friday night, I'm alone in my apartment and free until tomorrow morning. My mindset is basically 'I'm going to use some time tonight to try and learn whatever salvia can teach right now'. I have no prescription chemicals nor herbal supplements in my system at the time. I eat a peach so my stomach won't rumble from hunger during the experience and I'm good to go. I take off my clothes and get in bed. I load 50mg of 'extra strength' leaf into the pipe, standardized to contain 1mg of salvinorin A per 25mg of leaf. It's 9:30 pm. I light the lighter and take the first hit. In about 7 seconds the effects begin. I take a second hit.",
  "For a moment my brain just stops. I'm sitting on the bed, my eyes are open, the light is on and I'm holding the pipe in my hand but for a moment which probably lasts 45 seconds I'm catatonic. I'm not in any particular place, mentally, the sensation is similar to passing out, except it's not dark. I think this is my brain adjusting to the new fuel I just put in it, or shifting gears so to speak. Some part of my mind is aware that I have yet to set the pipe down, turn off the light, lay in bed, and THEN the experience begins. So, after a moment of a sensation akin to swimming upstream I get my consciousness into the brain's center for input/output of nervous impulses. Now I can see, hear and I'm ready to move my body as needed. I see a small wet spot on the bed, apparently I have drooled onto it. This strikes me as funny so I laugh once. Then I lay down, pull up the covers and turn off the light.",
  "I'm experiencing something vaguely similar to visual stimuli, in red, green and yellow. It's as if little red, green and yellow lights are 'crawling' up and down a structure of some sort, like millions of ants, their motion giving the idea of the basic underlying shape. Think 'The Matrix code' in red, green and yellow, but not made up of fake japanese characters, instead something more like tiny little spheres and 'worms' crawling in all directions. At the same time I'm given the idea that there is a layer, a membrane or a 'wrapper' over reality - and I include our material bodies in this 'reality' - which covers it, conceals it.",
  "For the entire duration of the experience I don't feel like I'm anywhere else. I am 100% aware of the date and time and the fact that my body is lying in my bed. The difference is that my consciousness is no longer anchored in the flesh. My thought process remains completely normal. I can't 'leave' my body and go roaming around as a disembodied spirit, it's more like I'm 'hovering about' but always close by. There seems to be a nexus of the mind and the flesh in the head. I get the feeling that if I lay down flat, with my spine as straight as possible, I'll facilitate the 'separation process' of the mind and the flesh. It feels like there is a possibility of 'coming out' through the top of the head. I once read that those who practice Zen meditation are instructed to keep the spine straight, shoulders low and try to 'push the sky up' with the tops of their heads.",
  "The effects are beginning to wear off. I'm becoming more aware of the connection to my body. 'I' try to pull away and what I perceive are bands going from 'me' to my sensory perception devices; one to each eye, one to each ear, nose, tongue, etc. The image in my mind is similar to what an octopus would see if someone were pulling it's arms out in front of it. For some reason now my consciousness becomes anchored in my bones. I begin to think a lot about the skeleton and how the flesh is sort of 'draped' over it. I feel like I'm wearing an overcoat made of wet, mushy meat and organs. I wish I could take it off and just be a skeleton.",
  "I'm coming down some more now. I take a deep breath and I think I had been breathing very lightly during the experience. I open my eyes, wiggle my toes, slowly get ready to get up. It's now 9:42pm, the experience lasted 12 minutes. After I get up I find my pipe on the ground, I dropped it while I was catatonic. I get up, go to the bathroom, then come to the kitchen. I feel fantastic, very clear in mind and body. I eat another peach. Then I sit down and begin writing the experience report you are reading."
 ],
 "erowid": {
  "id": "37121",
  "citation": " Brown ghost. \"We Have to Take the Wrapper Off of Reality: experience with Salvia divinorum (10x extract) (ID 37121)\". Erowid.org. Jun 11, 2007. erowid.org/exp/37121",
  "substance": "Salvia divinorum (10x extract)",
  "views": "2817"
 }
}
