{
 "title": "A Variety of Effects",
 "author": "jmo",
 "citation": " jmo. \"A Variety of Effects: experience with Baclofen (ID 61520)\". Erowid.org. Jun 4, 2012. erowid.org/exp/61520",
 "substance": "Baclofen",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Pharms - Baclofen",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I came across Baclofen one day in 2005 when I ran out of weed and I really needed something to keep my mind off it, because I had no cash and no way of getting weed for a few days. I was searching my house. The only thing I found was a bottle of pills prescribed to my mom as muscle relaxers. I looked them up online and didn't find any information about its effects, besides what I found on Wikipedia.</p><p>Being the curious cat I am, I decided to take a few. I think maybe I took 3. These things don't really take effect for awhile. Whether I have a full/empty stomach, I might as well expect to be waiting awhile. After this first dosage, I started to take the Baclofen more and more, seeing as the bottle was a little outdated and assuming my mom wasn't taking them/didn't need them.</p><p>My experiences with Baclofen were anywhere from fiending out and needing something to relax, to mixing it with weed, to taking 9-10 20mg tablets just to see what I'd feel like. I'm sure I overdosed on it one time. It really scared me. I was picking at my face in the mirror in the bathroom and ended up taking a chunk of my nose off because I could hardly feel anything at all. All sense of feelings, emotional, physical, whatever...were all weaker...less present, than they normally would be.</p><p>I started to hand these things out to my friends to see what they'd say. My best friend took 6, and mixed them with some benzo's and ended up blacking out while driving and crashing into some trees. Luckily he wasn't hurt and his car wasn't very smashed up. He never took them again.</p><p>This drug had many positive effects on me. Appetite is increased, anxiety/worries are virtually gone, creativity pours out of me, I feel a quaint vibration from my inner body to the skin. It isn't like anything else I've experienced. Baclofen works wonders for muscle pain compared to any other muscle relaxer that I've taken, and I've taken quite a few different kinds.</p><p>These days, I tend to lay low from these drugs unless I really have no other choice and stick to the naturals. They work wonders.</p><p>Just thought I'd let you know how this drug affected me.</p><p>------------------------------------------------------------</p><p>MARCH 2008 FOLLOW-UP REPORT</p><p>I first came upon this chemical in my mom's pill collection. I look it up on erowid and bluelight, but couldn't find any info. This was about 2 years ago. In that time I've had much experience with the drug, as well as many other pharmaceuticals (like most people my age...19)</p><p>I have taken this in combination with Zoloft, Gabapentin and Adderall, weed and alcohol and have found that alcohol is the only thing that mixes with it in a bad way. I just gotten super sick and puked everywhere when I drank and took this stuff. The tablets were given in the form of 20 milligrams per tablet. I think the highest dose I ever took was maybe 8...so 160mg...but that was when I was taking a lot of this stuff and seemed to develop a tolerance.</p><p>When I was stupid and naive, I even sold these things as Valium's for a few months about two summers ago. Nobody could tell the difference (most likely because they didn't have any experience with benzos) and nobody was smart enough to look up the pill ID.</p><p>The effects come on slowly, faster on an empty stomach. It's hard to pinpoint the feeling, the only way I could describe it is almost a swift buzzing feeling in the very center of my body. It's quite pleasant at times, and at other times, it just makes me feel like I'm full of disgusting drug metabolites and will be and have been for so long and makes me wonder how long I can keep this lifestyle up.</p><p>As of now, I take 20 or 40mg along with my daily doses of Gabapentin (1800mg) and it seems to potentiate its effects. I'm assuming it would do the same with benzos, but I haven't had a chance to try that out.</p><p>A few kids told me this stuff made them feel the best they've ever felt and one of my other friends passed out on this shit driving his car and hit a telephone poll. Luckily, he was okay but the car was fucked.</p>",
 "year": "2006",
 "id": "61520",
 "gender": "Male",
 "age": "18",
 "timestamp": "2012-06-04T07:00:00.000Z",
 "views": "8734",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Baclofen",
   "form": "(pill / tablet)"
  }
 ]
}
