{
 "title": "Poster in the Wind",
 "author": "Lord Viper Scorpion",
 "citation": " Lord Viper Scorpion. \"Poster in the Wind: experience with 2C-T-7 (ID 6152)\". Erowid.org. Apr 10, 2001. erowid.org/exp/6152",
 "substance": "2C-T-7",
 "bodyweight": "270 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "insufflated",
  "2C-T-7",
  "(powder / crystals)"
 ],
 "report": "<p>One weekday night, a friend and i had nothing to do, no weed, no alcohol, nothing. then my friend decides that it is time to break out the 3 bags of 2C-T-7 (3, 10mg bags) that he had wanted to save and do all himself. he explained to me that he really wanted to save it for he loved its effects the 2 times he had done it before but was willing to let me have one of the bags for myself while he would have 2 for himself so that the night would not be wasted. He then proceeded to explain that once the small bag of powder was snorted, that the eye on the same side as the ingesting nostril would begin to tear rapidly followed by the sharpest pain imaginable in that same nostril. then he explained that 1 to 2 minutes later i should feel somewhat dizzy and possibly nauseated.</p><p>  Well, all of the things he had told me to expect all came true, every last detail, but he forgot to add one thing, that if i had had anything to eat prior to snorting the 2C-T-7 that i might feel an incredible and unstoppable urge to puke.</p><p>  i then responded telling him that i did feel like puking but that i wouldnt because generally, i can choke it back whenever i drink or feel like throwing up.</p><p>   well 2 minutes later,(about 20 minutes after snorting it) i ran to the bathroom because throwing up was inevitable. i almost didnt even make it to the toilet. i never puked so hard in my life but afterwards i looked at my self in the mirror and realized how horrible i looked and my face was bright red and both eyes were more bloodshot than i ever had seen. i walked back to his room and he laughed and said that he expected that i would puke.</p><p>   I sat down, with an awsome feeling of dizziness and extreme comfortabilty. i was no longer nauseated. now here is where the visuals kicked in.</p><p>    My friend has a giant POW-MIA banner on his wall. I looked at it as it hung completely flush against his wall with very few ripples in it. all of a sudden it started to move around more and more untill it looked like a flag that u would see high up in the air blowing proudly and violently in the wind. i really couldnt believe my eyes. i blinked a few times to see if i could snap out of it but it didnt work, the flag still flapped in the non-existing wind. then minutes later as we watched tv and looked around the room and also had an in depth conversation all at the same time, i looked at my friends wall out of the corner of my eye at a few spots on the wall where paint was chipped off . i quickly looked over at the chipped spots on the wall and i could have sworn that they were roaches crawling around on his wall, i continued to look in shock for anbother 3 seconds or so and then the roaches disappeared and turned back into chipped paint. i looked at him and told him that this was the most incredible drug i have ever done.</p><p>   the rest of the night i had many other amazing visuals and other things as well including my friends face turning diiferent bright glowing colors as i spoke with him.  Coming down from this hallucinogen was very pleasent and relaxing and followed by very enjoyable sleep. the trip lasted about 3 hours or so and was well worth the extreme pain in my nose and severe vomitting.</p>",
 "year": "2000",
 "id": "6152",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-04-10T07:00:00.000Z",
 "views": "6509",
 "dose": {}
}
