{
 "title": "A Little More Than I Had Expected",
 "author": "Owen",
 "citation": " Owen. \"A Little More Than I Had Expected: experience with Mimosa tenuiflora, Banisteriopsis caapi & Syrian Rue (ID 61552)\". Erowid.org. Jul 13, 2007. erowid.org/exp/61552",
 "substance": "Mimosa tenuiflora, Banisteriopsis caapi & Syrian Rue",
 "bodyweight": "185 lb",
 "report": "<p>Preperation: I started off by grounding up 5 grams of Syrian Rue in a coffee grinder. I then put the grinded seed into a plastic sandwich bag. I did the same thing with the 13g of M. Hostilis and the 6g of B. Caapi. I kept the substances in seperate bags.</p><p>I put 5 cups of of regular tap water and 4 sliced up lemons in a pot. I heated the water until it came to a nice light boil then added the B. Caapi and M. Hostilis. I boiled it all together for about 50 minutes then lifted the pot off the burner and poured the roughly 2 cups of brew through a strainer into a container. I took the contents in the strainer and put it back into the pot and added 4 cups of water and boiled it for 35 minutes. Again I strained it and put into a seperate container. I repeated the process one more time but this time on full boil for 20 minutes stirring frequently. Again I put it into a container.  Finally I took all three containers poured them through the strainer into the pot and boiled it all down to about one tea cup. I wasnt sure if this would be enough and even considered making more. Im glad I didnt.</p><p>I should note that prior to this I have never used a psychedelic. I had studied many experiences and read a book on DMT so I had a rough idea of what to expect.</p><p>t- 0:00 Mixed 5 grams of Syrian Rue with water and chugged it back. I chased it with Red Rose tea and had a tums.</p><p>t- 1:10 The Syrian Rue had definetly kicked in at this point. I was feeling very relaxed. I started sipping on the ayausca at around this time. It wasnt near as bad as I had expected. I finished it in about 10 minutes.</p><p>t- 1:20 Im about to puke at this point. Maybe 4 lemons was a little much. I considered taking another tums but I wasnt sure if that might have a negative effect on myself or the trip so I didnt. Instead I just kept sipping on Red Rose tea.</p><p>t- 1:30 I start puking for a couple minutes.</p><p>t- 1:40 I am starting to see tracers. I remember being  in awe of  how fast this was kicking in. It was some time around this point that the walls were starting to expand and retract. My thoughts were racing at this point. My world was starting to resemble one of Alex Greys paintings.</p><p>t- 1:45 I went to my room and layed in my bed. I was feeling nervous. I knew I had made a big mistake at this point. I didnt like this world at all but at least I knew this was just the drug and it would hopefully plateau shortly. I decided to force myself to puke as much as I could to get rid of as much ayahuasca as possible. I did this for quite awhile.</p><p>t- 1:55 Still feeling a little bit of nausea I decided to leave the bathroom and try to go to my room to sleep this off. Upon leaving the bathroom things started getting really weird. I walked out of the bathroom and by one of the rooms in my place. There was no one the room and yet I could here this really scratchy music playing. It sounded  like something from the thirties. At this point I still knew it was the drug so I just walked on by.</p><p>t- 2:10 Now I start hearing a light sounding carnival music playing in my house. It has a real evil vibe to it. I try closing my eyes to sleep but Its impossible. Im seeing lots of colors. Soon the colors are replaced by waves of purple then a theatre. There are these heads of clowns and jesters on the ceiling and theirs jaws are dropped to the floor. I try thinking positive thoughts to try and change the theme of my trip to somthing postive but all my attemps failed. I opened my eyes trying to snap back to reality but instead it just kept slipping further and further away. I then start hearing a heavy pulse of sound all around me. I later realized that really scary pulsing noise had been my fan.</p><p>t-??? I have now lost track of time. I faintly remember going to the bathroom and going into the shower and setting it to ice cold and laying in there. Then later crawling out and moving to the bathroom floor and gripping onto everything I could find. Then moving to my bedroom and doing the same. I clearly remember grabbing my 30gig iPOD and squeezing it so hard it broke in half. In reality i didnt. Then I slipped further into the trip.</p><p>All my memories started melting away. I had entered a new reality. I still knew I had a body I could kind of feel it but I had no control over it. I could feel a faint wetness around my eyes and truly believed I had ripped them out. I also felt a wetnness all over my boxers and remebered reading that ayahuasca can cause diarrea. This new realm seemed more real then the world I had just left. It felt like the world I had known had been one big illusion. I wish I could explain all the things that happened from this point forward but it was just way too abstract.  What I can tell you are things I could hear faintly in the world around me. I heard sirens blasting only a few feet away from me. I could also hear a guy and a girl talking back and forth. It sounded like complete choas. I could here the voices becoming more and more panicked. The realm I was living in wasnt much better than the world around me.  In fact it was alot worse. Shortly after I started coming back to reality. I remmeber feeling like I was a god it was so great to have some control. I could see the world around me again it was wonderful to know I still had my eyes. I was in my bedroom.</p><p>From the time I felt like I had a bit of control to the time I was completely back to reality was no more than 5 minutes. It felt like nothing had happened. Their were no side affects.  The first thing I did after the trip was quickly check the house. I thought I had trashed it but to my surprise everything was alright.  I had broken a candle taken off all my clothes except for my boxers and puked in the bathtub and all over the toilet. Not too bad. The wetness I had felt were my wet boxers. It was just water. The trip started at 9:00pm and ended at 1:00am. I had to be up for work in 4 hours. The following week I felt a bit depressed and the week following that I felt happy and normal again. Anyone considering doing this should definitely have a sitter. The trip was really insane there are a lot of things that happened that words cant explain. I  was lucky that the only thing that went wrong was I broke a candle.</p><p>Peace</p>",
 "year": "2007",
 "id": "61552",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-13T07:00:00.000Z",
 "views": "42311",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": "",
   "amount": "513 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "(tea)"
  },
  "2": {
   "time": "",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Banisteriopsis caapi",
   "form": "(tea)"
  }
 }
}
