{
 "title": "Stars as Signs of Hope",
 "author": "Junko",
 "citation": " Junko. \"Stars as Signs of Hope: experience with 2C-E (ID 61564)\". Erowid.org. Jun 21, 2007. erowid.org/exp/61564",
 "substance": "2C-E",
 "bodyweight": "210 lb",
 "report": "<p>[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active as such a small dose, eyeballing is particularly unwise. See related article]</p><p>After a long day of work I got picked up by a couple friends, one of whom made it clear that he had just rendezvoused with his chemical supplier and had an eyeballed amount of a powerful psychedelic '2C-E'.</p><p>The only 2C I've come in contact in the past was 2C-I which was to say the least an extremely powerful, if not horrifying experience and created feelings of doubt and anxiety inside. In retrospect the negative experience I had with 2C-I was due to a few factors, namely setting, combinations of other drugs and not having a measured dose (Took well over 40mg).</p><p>Since we had a relatively small amount of white, crystalline powder we decided the proper route of administration would be snorting it. I insufflated anywhere from 5-8mg and after a slight burning discomfort in my nose that vanished in about 15 minutes I began noticing slight heart increases and feelings of change. Nothing dramatic, just slight indications of a psychedelic beginning to take its course throughout my body.</p><p>A significant body load began to become apparent, a feeling of weight strapped to my limbs. As half an hour came around I decided that the amount I took was not going to get me much further, and came to the realization that another dose was necessary to really 'get the wheels in motion'.</p><p>For a second time I snorted a dose, although this one was slightly larger than the previous. Instantly I felt an amphetamine-like rush coursing within my veins and pulsed straight to my head. I sat down and jammed with my friends for a while but hadn't quite start to become 'out of it' this was a strange, but pleasant feeling. No overwhelming feelings of anxiety or fear consumed me, I was just free to be. My mindset had not been completely overrun by the drug by any means, I was just content and aware of it's place within me and began to let it wash over me. We walked outside and I looked up at the sky. The stars were beautiful, how did I just completely overlook this beauty for the past few months. The sound of the wind, the trees and the sky was beautiful. A concept within me dwindled, the concept that stars are signs of hope. Whether or not they are truly real is irrelevant, the fact that we are aware of something beyond our knowledge and capacity excited me.</p><p>All of a sudden I realized and isolated these thoughts as true beauty and at the same time was aware that true beauty is a relative concept, trying to express these feelings to others would potentially tarnish the beauty and meaning that resonated within my soul. The visuals I began experiencing were not particularly profound, however they were there. As I stood beneath a row trees, now by myself, alone staring up at the clear night the sky seemed to fold and expand, bending and shifting stars and celestial bodies with it. It was beautiful. I began listening to the sounds of nature and had realized that I had become so out of touch with my surroundings and had actually begun to fear the noises. It was because they were unknown, my comprehension could only begin to guess what the noises truly were. I then dawned on the concept that human bodies are vessels, even instruments of nature and that as time passes we may become out of tune with ourselves. Everything made sense.</p><p>I fell in love with the profound insight that this psychedelic had given me, it excited and fascinated me. I walked back inside and relished in some visual distortions and the profound feeling of meaning within me.</p><p>After smoking a few cigarettes and cooking some good food, it was time to call it a night. As I was lying in the guest bedroom I was contently and confidently analyzing my daily routines, past events and mindsets. I realized that at any given time within my mind are three bodies: The person I wish I was, the person I should be, and the person I am. It's a sick and twisted state of affairs that after some thought and a cup of coffee was laughed at and deflated. I then turned over and had a decent nights rest.</p>",
 "year": "2007",
 "id": "61564",
 "gender": "Male",
 "timestamp": "2007-06-21T07:00:00.000Z",
 "views": "3014",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Coffee",
   "form": "(liquid)"
  }
 ]
}
