{
 "title": "Snorting = Sloppy Trip",
 "author": "Cb",
 "citation": " Cb. \"Snorting = Sloppy Trip: experience with 2C-I (ID 61589)\". Erowid.org. Apr 10, 2007. erowid.org/exp/61589",
 "substance": "2C-I",
 "bodyweight": "125 lb",
 "report": [
  "<p>One of my first experiences with the chemical 2C-I was on a cold and snowy day in either January of 2006 or December of 2005.  My boyfriend at the time and I went over to hang out with a couple of friends at one of their houses.  My friend gave each of us a 20 mg capsule of 2C-I.  He had ordered quite the large supply of powder from a supplier and measured it out for us.",
  "Although my friend knew what this drug was, he did not have an extensive amount of experience with taking it, and had heard somewhere it hits you harder and faster if you were to snort it.  So, I trusted this friend of mine and I went through with snorting almost all of the 2C-I crystals up my nose.  Immediately after the fact, my head began to throb and I was crying out in pain.  My eyes started watering and I felt as if my head were going to explode.  The inside of my nose felt like it was burning and I was getting the most disgusting painful drip in the back of my throat. ",
  "I was getting really dizzy and my throat was very sore.  One of my other friends suggested some sore throat spray would ease the pain in the back of my throat, so I sprayed some of that in my mouth and it was terrible.  It made my mouth numb and tasted horrible.  I couldnt even make it to the bathroom before I vomited everywhere.  I felt really bad about puking all over my friends couch and I ran to the bathroom to grab something to clean it up with.  When I came back I was already seeing colored dots in my vision and everything was blurry and I felt as if my mind was in a fog.  I was shaking from the pain in my head and from throwing up, so I couldnt do much but stand there holding the tissues and towel and look at everyone.  I tried to help clean it up but I wasnt much help.  My friends took over as I rested on the couch, drinking lots of water, trying to stabilize myself. ",
  "\tAfter we got everything cleaned up, everyone went into my friends bedroom where he had loud pounding techno music playing, with the only lights being black lights and a strobe light.  I felt like the room was spinning and it was all too much for me.  I stumbled back out into the hall way and leaned up against the wall when I felt the nausea rising up in my stomach again.  I ran to the bathroom but once again not in time to lift the toilet seat and yet another mess.  By now I was scared and I felt awful for being such a bother and a mess.  I was in the bathroom for a good ten minutes trying to clean up the floor when my friends began to look for me.  I came out like nothing had happened and sat on the couch again.",
  "\tWe decided maybe smoking some weed would make me feel better, so we smoked a bowl.  Thankfully it did ease the nausea in my stomach and relieve some of my headache.  I felt more relaxed and at ease after this. ",
  "Back on the couch, we couldnt agree on what movie to watch, so someone just put on The Matrix.  When the movie began I was EXTREMELY confused.  I dont know if I was imagining it or if we really started the movie in the middle but I was lost.  I felt like everything I was seeing in the movie had already happened, and that we were watching the same three scenes over and over.  It felt like we had put the DVD player on to just play random scenes from the movie in no specific order!  Everything in the movie looked so fake, it made me laugh that I had never noticed how terrible the graphics were and how unrealistic everything looked.  I felt like I was finally seeing this movie for what it was really worth and I was shocked that nobody ever realized computerized almost everything in that movie was.  This had to be a joke!  On the other hand, even though the movie looked so strange and fake to me, it also looked very real in the sense that I felt like I was there and that this was all taking place right before my eyes.  Besides that, the movie was making me quite anxious.  I was confused because I didnt remember this moving having almost no speaking in it. The only sounds I ever heard seemed very distant and muffled.  Everything had this same overpowering sound to it like every word spoken or sound made had a breath to it.  Every sound made a movement that produced the sound of constant heavy breathing in my head.  Not just breathing, but sickly breathing, snoring-like.  Everything else was quiet, but this was extremely loud and completely annoying. ",
  "The movie got to be too much for me to handle with the noise distortions and confusion.  The rooms colors had changed in a way I couldnt distinguish, but everything appeared as if it were painted on with watercolors.  Everything was very watery and the colors were dripping and wet. I looked to my friends and spoke to them.  They seemed so far away and unreal.  Their faces began to melt with the rest of the world and everything seemed to be falling towards the floor.  Everything looked sideways and two dimensional.  I was experiencing a lot of distortion in depth perception and the size of objects.  I felt sick and confused.  Everything seemed very messy, Im assuming because of what happened when I took the drug. ",
  "Honestly, much of what happened that day besides what Ive already stated has slipped from my memory seeing as Im writing this over a year later.  I vaguely remember what kind of visuals I was getting.  I had sensitivity to light and everything seemed either too bright or too dark.  Things seemed either very foggy or overly clear and more detailed.  The high felt like being high on weed (maybe because I was?) and kind of unattached.  The effects lasted at least 6 hours, but I do not remember coming down, or even how I got home that night.  This trip was not at all like my other experiences with 2C-I.  I felt very isolated and as if I was surrounded by a fog all day.  Other experiences I have had with this drug also gave me an isolated feeling in the sense that I felt very different from other people, but during those times I really did not care, and I didnt feel as paranoid about it.  Other times, I felt more free.  This time I felt chained down, and my mind was clouded.  2C-I for me is generally a very happy and care-free drug filled with laughter and silliness.  This time, it was frightening and confusing. ",
  "If you want to avoid having a sloppy trip like I did, my advice is DO NOT SNORT 2C-I.</p>"
 ],
 "year": "2006",
 "id": "61589",
 "gender": "Female",
 "views": "11485",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2007-04-10T07:00:00.000Z"
}
