{
 "title": "The Road To Recovery Begins Here",
 "author": "Mem",
 "citation": " Mem. \"The Road To Recovery Begins Here: experience with LSD (ID 61638)\". Erowid.org. May 7, 2009. erowid.org/exp/61638",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "report": "<p>In 2004, my favourite friends and I spent a lot of time off our faces. Mostly it was just on weed, though occasionally we were able to lay our hands on some acid. We took it only very few times over the course of the summer, but the trips we had were some of the most beautiful and memorable of my entire drug-taking life.</p><p>There is something very special about tripping with people that you care deeply about. There is one night in particular, though, that will stay with me forever - not only was I in fine company, it was also a night of great self-discovery for me.</p><p>There were six of us. We were in our friend's band practice room. The tabs simply bore a red square bordered by white. The first few hours of the trip were pleasant but wholly unremarkable - the weirdness grew and grew until I was thoroughly outside of the metaphorical box and in tune with the surreal and child-like side of myself that I love so much. I recall spending quite some time watching a beetle crawling across the floor, and being absolutely mesmerised by the concept of an exoskeleton.</p><p>I also spent a good long while with an orange. Examining it in a way that I only ever really do when I'm tripping. Running my fingers over the skin, squeezing it gently, smelling it, digging my nails into it - it was as though I had never seen an orange in my life. I was absolutely enthralled with its perfectly spherical shape. I licked it, I tapped it, brushed it against my face and over my lips... everything I did was centred around getting an absolutely clear picture if what it is that oranges are all about. Peeling it took an awfully long time, but it was okay because time was nothing more than a harmless illusion anyway. And finally being able to pop a segment into my mouth.. slowly chew and feel it with my tongue, all the time marveling at the changes in flavour and texture, then at last to swallow... it was almost orgasmic.</p><p>I came to the conclusion at that point that oranges are nature's most perfect creation - and to this day I am still convinced that they're pretty fucking clever. The way they're designed and put together, they really are a bit special (and apart from the occasional satsuma I don't even like the bloody things!).</p><p>It was shortly after my little citrusgasm that I was hit by The Badness. At that time in my life, my depression was reaching its most severe. And at that moment I began to experience the most crippling low I can ever remember feeling. I dropped of my chair, crept into a little space in the corner, and fell into an almost catatonic blackness. I would have cried with despair had I any energy whatsoever. I became absolutely convinced that my whole existence was utterly pointless and insignificant. I didn't want to be alive any more.</p><p>Nobody else seemed to notice.</p><p>I don't know how long I was there, but eventually one of the others gently shook my arm and told me they were going on a mission - to walk into town (several miles down a country lane). I tried over and over to tell them I didn't want to go... in my head, I was ecstatic that they were leaving because it meant I would have the privacy I needed to kill myself. After a lot of persuasion, I was talked into going with them.</p><p>Standing up was so difficult that it physically hurt me. Trudging outside took only a few seconds but they lasted a lifetime.</p><p>As I stepped out into the warm morning air, suddenly every ounce of the depression lifted. The pain was gone. I looked around, everything looked so beautiful in the vague pre-dawn half light, and I smiled. Had I stayed inside and gone through with my plan, I would have missed this gorgeous moment. Each breath tasted sweet and each step filled me with a renewed energy.</p><p>The mission back into town on foot is a long one, but it felt like about 20 minutes. All of the plants, trees, fields.. everything natural was emitting a faint blue glow and the more I gazed over it all, the more it healed me and made me feel alive. I fell behind as the rest of the group went off ahead, and that was okay. I loved them all dearly, but I needed the semi-solitude to get through my little personal battle.</p><p>As we reached the town, I opted to head back home instead of going on to the castle. We said out goodbyes, and about ten minutes later I got back. It was about 5am. I made myself a big mug of coffee, cut a slab of chocolate cheesecake, and went and sat outside and watched the sunrise.</p><p>And as I sat there, drinking the nicest coffee in the world and eating the best goddamned cheesecake of my life, I watched the world wake up and I had one of those life-changing revelations that one often has on acid, but this one really did change my life.</p><p>It dawned on me that the reason the whole night had just been one big metaphor for my life. I'd had some fun, but because I'd slipped into my own little world and started ignoring everything around me I became depressed. It was the show of love and friendship from those around me that convinced me to get up and fight back, and it wasn't an easy thing to do but it made a huge difference and got me to where I needed to be.</p><p>At that moment, I finally saw the way out of my mental problems. And I knew it wasn't going to be easy, I knew it was going to be a long and painful road... but I also knew that I'd be okay at the end of it.</p><p>That was the first time in a lot of years that I started to see a light at the end of the tunnel. It was still a long time before I was able to say I'd recovered to any great extent, but since then I've always been able to think back to that night and know that everything would eventually come together.</p>",
 "year": "2004",
 "id": "61638",
 "gender": "Female",
 "timestamp": "2009-05-07T07:00:00.000Z",
 "views": "4772",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
