{
 "title": "As a Nootropic",
 "author": "Maturana",
 "citation": " Maturana. \"As a Nootropic: experience with Morning Glory (heavenly blue) (ID 61633)\". Erowid.org. Sep 4, 2009. erowid.org/exp/61633",
 "substance": "Morning Glory (heavenly blue)",
 "bodyweight": "78 kg",
 "report": "<p>I have become a fan of 'microdoses' of morning glory seeds in the recent months. I am a healthy male in my mid 20ies and have a background in academia. I occasionally chew up 1 to 10 seeds of Ipomoea violacea ('Heavenly Blue' variety) and hold them under the tongue for some minutes. Sometimes I swallow them afterwards, which might produce slightly stronger effects, but on most occasions I spit out the residues. I have no significant ill effects from this procedure. I sometimes consume the seeds in the morning, after breakfast. Taking the seeds after brushing my teeth seems to increase the effect significantly, which is probably due to easier absorption through the mucus membranes (removal of dead cell layers and mucus, increased microcirculation through menthol).</p><p>On most occasions, the consumption of a 'microdose' results in slightly sharpened aesthetic perception, heightened mood and makes social interaction a bit easier and enjoyable. Such microdoses have some nootropic and intellectualizing effects. I am experienced with other nootropics including Piracetam, Hydergine, Selegiline, Vinpocetine, Ginkgo, Ashwagandha and others, and morning glory seeds might be one of my favorites. All in all, they seem to improve my cognitive and 'spiritual' state in a very subtle, yet significant manner. The positive effects sometimes seem to last well into the next day.</p><p>It should be mentioned that I sometimes also consume the MAO-B inhibitor selegiline in low doses (</p><p>It might also be notable that I have tried the same procedure with seeds of Argyreia nervosa, but did not experience the effects above, or only in a barely noticeable manner. This seems counter-intuitive, since these seeds have a far higher concentration of ergolines compared to Ipomoea tricolor. Maybe one of the minor constituents in morning glory seeds is responsible for the nootropic effects, and this constituent is missing in A. nervosa -- but this is still a very weak hypothesis.</p>",
 "year": "2007",
 "id": "61633",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-09-04T07:00:00.000Z",
 "views": "6983",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "sublingual",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 }
}
