{
 "id": 6166,
 "title": "Extreme Fatigue",
 "date": {
  "submission": "2007-12-31T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tripsackian",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "DXM"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "5 hits",
   "substance": "smoked"
  }
 ],
 "report": [
  "[Erowid Note: 1 gram of DXM is considered an extremely high dose, see DXM Dose Chart]",
  "After taking the dxm I tripped ridiculously hard, but I never once freaked out. It was actually a memorable and enjoyable time for me but the problem occured the next day.",
  "I was at a friend's and I took only a few (maybe 5) bong rips of marijuana. I guess I passed out, which never happens to me on marijuana, and when I awoke my friends had already just left. I was confused and extremely fatigued. I was unable to rationalize why my friends were missing, and I was extremely panicky. I tried to go to the door and I fumbled with the handle. I realized my shoes were untied so I attempted to bend down to tie them but I kept loosing balance and I kept falling into the hallway wall. I fell to the floor and passed out for a moment, everything was darkish and I felt very very fatigued. I crawled to a nearby chair and rested my head on it, when I saw the host of the house was panicking about my actions.",
  "I was really scared, and I got up and stumbled to the door, and ran down stairs. I made it outside into the apartment complex parking lot and ran to a car I thought was my friend's. I began fumbling for the handle on the door while starting to regain my composure and energy levels rose above that of the fatigue I was experiencing. I was yelling my friend's name and eventually I saw headlights and realized where my friends car really was. It took my about 3 minutes to get the door handle and open the car, where I sat in and then felt much better. This may have been a warning sign for narcolepsy, it could have been the lack of sleep from last nights tripping, or it could be a potentially dangerous result of dxm use."
 ],
 "erowid": {
  "id": "37196",
  "citation": " Tripsackian. \"Extreme Fatigue: experience with DXM & Cannabis (ID 37196)\". Erowid.org. Dec 31, 2007. erowid.org/exp/37196",
  "substance": "DXM & Cannabis",
  "views": "10358"
 }
}
