{
 "title": "Chills, Feel Good",
 "author": "Peterb78",
 "citation": " Peterb78. \"Chills, Feel Good: experience with Piperazines (Parafluorophenylpiperazine / pFPP) (ID 61761)\". Erowid.org. Apr 2, 2007. erowid.org/exp/61761",
 "substance": "Piperazines (Parafluorophenylpiperazine / pFPP)",
 "bodyweight": "85 kg",
 "report": "<p>18:21 swallowed 40mg pFPP</p><p>20:00 I can feel the sight starts to lag</p><p>20:30 Smoked a joint</p><p>21:00 I'm feeling pretty good, nothing special in particular. I have some butterflies in my stomach, things tends to look soft</p><p>21:05 Swallowed another 40mg pFPP</p><p>21:14 Smoked some weed</p><p>21:17 Puts on my headphones and start to listen to trancemusic. I can feel that something strange is going on inside of me, I lay down on the couch.</p><p>21:45 I'm feeling really good, I'm getting chills from time to time from the music, the windows on the screen has become softer and the letters has a red/green glowing aura around it self. It rocks with the mothin of waves.</p><p>21:50 smokes a joint</p><p>21:54 Sometimes the letters turns into a big blur and I can't read what it says. The hair in my neck rises to heavy music. I lay myself down on the couch again.</p><p>21:56 i feel that it's easy to dream away in the music and the eyes roll back (I have no memory of writing this line)</p><p>22:38 At 22:28 I felt so damn good that I didn't even care about writing it until later on. The letters is moving more than ever before. (It feels like it was only ten minutes since my last note)</p><p>22:45 I smoke on my joint and my eyes easily rolls back when closing my eyes.</p><p>23:49 The letters is still moving on the screen and I still feel good, though the peak has passed and I'm listening to chillmusic now. I'm a bit tired</p><p>23:56 If I would have had something to make me more alert I could easily go out on a club and dance in this state of mind.</p><p>00:27 I'm going to bed. Things are still moving around</p>",
 "year": "2007",
 "id": "61761",
 "gender": "Male",
 "timestamp": "2007-04-02T07:00:00.000Z",
 "views": "8733",
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Piperazines"
  },
  {
   "time": "0",
   "amount": " T+ 1:44",
   "administration": "40 mg",
   "substance": "oral"
  },
  {
   "time": "Piperazines",
   "amount": "",
   "administration": " T+ 0:00",
   "substance": " repeated"
  }
 ]
}
