{
 "title": "Waste",
 "author": "Rabbi J",
 "citation": " Rabbi J. \"Waste: experience with Belladonna (ID 61769)\". Erowid.org. Jun 7, 2007. erowid.org/exp/61769",
 "substance": "Belladonna",
 "bodyweight": "155 lb",
 "report": "<p>Weeks before actually trying Belladonna, I researched about it. It was exciting to hear about the realistic visuals that some people received. I was looking forward to being transported to another place upon drinking the dose.</p><p>I ordered the plant from a website and received a discreet package containing 4 ounces of the foliage.  I prepared a liter of tea by boiling about a gram of it within. I strained the plant material and drank one cup, with plenty of liquid left, so approximately 300 mL. After waiting for nearly an hour for effects (having heard that it will take a long time and the effects can sometimes jump at you) I decided that my dose was relatively low and I needed to take some more. I dumped out the rest of the tea and put another pot on with 5 grams of foliage in it. Strained the plant out and drank one more cup.</p><p>I was slightly anxious, hoping for the best, but relatively in a good state of mind. I was just sitting in my friend's dorm (which is probably not the best setting for such a drug, very uncommon ground) watching tv. My stomach became unsettled. After nearly two more hourse after the second cup, so about three and a half hours altogether, feeling nothing, but slight physical discomfort I went  to my dorm room and tried to go to sleep.</p><p>Sleep wasn't easily found, though, as I scrambled from my top bunk down to the trashcan on the first floor. I vomited slightly, but knew it wasn't over yet. I went quickly to the bathrooms at the very end of the hall, furthest away from my dorm room, and vomited into the toilet, second from the left. As I walked back, I was incredibly fatigued and my sense of balance completely shot. I stumbled into the halls and had to walk with my hands holding the wall. I got back to my room, but my night wasn't over yet.</p><p>I couldn't fall easily to sleep, my mind was drifting off. I cannot say that belladonna contributed entirely to my wandering mind, I am usually like that anyway, but I won't say it didn't. Nor can I say that the violent upheavels in my stomach were solely accounted to belladonna, (I had a large chinese buffet only three hours prior to consumption) but my stomach is not easily turned, so I would say belladonna was a large factor.</p><p>I fell asleep, finally, but didn't stay that way. I woke up three times in the night to vomit or because of cold sweats. I couldn't make it to the bathroom once, a stain marks the hall's carpet to this day.</p><p>The next day I was exhausted, perhaps just because of my poor night's sleep, maybe partly because of the belladonna. I found that my reading vision deterioated severely, returning the next day. I received no visions nor any of the 'pluses' pertaining to taking belladonna. I think it could be contributed to the way I took it, the source of the foliage, and the amount I drank.</p><p>I may take it again, but hopefully, by that time, there will be more reports on how to take it by other people who were successful. I don't mean to dissuade anyone, just to report. Good luck!</p>",
 "year": "2007",
 "id": "61769",
 "gender": "Male",
 "timestamp": "2007-06-07T07:00:00.000Z",
 "views": "13376",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Belladonna",
   "form": "(tea)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Belladonna",
   "form": "(tea)"
  }
 ]
}
