{
 "title": "The Stuff of Illusion",
 "author": "Merlin",
 "citation": " Merlin. \"The Stuff of Illusion: experience with Datura (Datura inoxia) (ID 61764)\". Erowid.org. Aug 28, 2009. erowid.org/exp/61764",
 "substance": "Datura (Datura inoxia)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "",
   "Datura",
   "(seeds)"
  ]
 ],
 "report": "<p>This is actually three different jimson weed experiences spread over several months.</p><p>I aquired some jimson seeds and was egger to try it out.  Some how I decided on 154 seeds, how I decided on that number I don't remember.  I used a coffee grinder to grind the seeds up, then swallowed the grounds washing them down with water.  The seeds are small so this was just a small amount of grounds, not hard to swallow.  About 20 minutes later I started feeling weird and got really tired.  I mean really tired!  So I laid down and took a short nap.</p><p>When I got up I had more energy and I was really starting to feel stoned, also I was staggering a little bit like I was drunk.  Another notable thing was that my vision was messed up.  I was now farsighted, which is a common side effect.  I tried to chat with my lady friend on the internet but I could not see well enough to read what she was saying.  The next day she told me that I typed a few lines that didn't make much then the rest of what I typed was non-sense, she couldn't even make out words any more.  So I gave up on the computer and wandered off.</p><p>I don't remember much more about the night, I remember a couple of hallucinations.  The main thing I remember about that experience is that the distinction between dreaming and being awake was completely erased.  Also its seems it was impossible to hold a coherent line of thought.  I might have had some insane conversation with my dad that night if he got up for a drink of water, I wouldn't remember if I did.  He never mentioned anything odd though.  At sunrise I thought I had pretty much sobered up, but I had another minor hallucination.  The experience carried with it an uncomfortable feeling, a bodily feeling like being poisoned.  The farsightedness was gone in less than 24 hours.  Since I remember nearly nothing of the hours I was tripping I took too much.</p><p>I am a person interested in consciousness and its workings, so the complete blurring a the awake state and the dream state interested me.  I wanted to try jimson again with a smaller dosage.  Weeks later I did the same thing again except this time with much fewer seeds.  Perhaps about 50.  This was a big disappointment.  It wasn't large enough dose for me to trip but it was enough for me to feel very bad for awhile.  The feeling of anxiety in the body was not just because of a large dose, it was there with a smaller dose as well.  This second time I noticed no hallucinations or altered consciousness.</p><p>I thought I was probably done with jimson after the second experiment, but I still had a lot of seeds and was still curious about its dream quality.  So I decided to try it again.  This time with jimson tea and cigarette.  I ground 100 seeds and boiled the grounds for 30 minutes in the microwave.  I added water along to keep the amount of water roughly one cup.  Then I strained the seeds out.  If you boil in a jar with a neck like a preserves or jam jar you won't even need a screen to separate the liquid from the grounds.  I ground up an additional 35 seeds for the cigarette.  Also I dried out a banana peel in the oven and crushed a little of it up for the cigarette.  The banana peel was just for filler, I didn't think seed grounds would burn well by themselves.  Banana peel makes mild smoke with a flavor that is not unpleasant.  Some people say you can get high off of banana but in my experience they are extremely mild, sort of relaxing effect.  I consider the effects of banana peeling to be negligible compared to jimson.</p><p>I let the tea cool a little then drank it.  It had nearly no flavor, just a slightly nutty taste.  Then I loaded my backpack with water, fruit juice, bread, and the joint.  Within about 10 minutes I started feeling odd, doped.  Within about 30 minutes I was 'datura stoned.'  I went walking in the woods near my house, (woods I know very, very well).  The intoxication gradually increased.  At some point I took two puffs off the cigarette.  I had intended to smoke the entire cigarette but once in the woods I had that same bad jimson feeling I had the two previous times, so I decided I didn't want any more.  In hindsight I think it is a good idea I didn't smoke any more of the joint because it just would have been too much.  As it is I think I hit upon a good dosage for myself.</p><p>Unlike the first time I remember what happened and I was halfway able to hold a sensible chain of thought, and unlike the second time I tripped.  I fading back and forth between dreaming with my eyes open and being awake.  There were both auditory and visual hallucinations.  I turned around and saw this gigantic woman standing a few yards away, then she resolved into a dead tree.  One minute I was watching and listening to two creature talking one another, completely unaware of myself, then the voices were gone but I could still see the faces with their mouths moving, then the faces resolved into leaves.  That sort of thing was typical of the trip.  Jimson hallucinations are built out of what I am looking at with my eyes.  This might sound fun but remember that all the time there is an uncomfortable physical feeling, and thoughts tend to be disconnected.  I was relieved when I started sobering up.  The clumsiness and farsightedness were there like the first time but less so.</p><p>It is important to realize that jimson weed is not classified as a psychedelic, its classified as a deliriant, it causes delirium.  I didn't have any epiphanies or insights to take away from my jimson experiments (maybe Don Juan knew something about its use that I do not).  It seems the more I take the more chaotic my thoughts will be.  Another important thing to remember is that in some cases the farsightedness lasts a couple of days.  I noticed that when I wore my dad's reading glasses I could read fine.  I must have been a funny sight sitting here with those old man frames on.  Jimson weed is the craziest and most dangerous drug I've ever taken, and I've taken LSD, mushrooms, and DOI.  Like I said before, I didn't find the jimson experience enjoyable.</p>",
 "year": "2007",
 "id": "61764",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-08-28T07:00:00.000Z",
 "views": "14930",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "",
   "substance": "Datura",
   "form": "(seeds)"
  }
 ]
}
