{
 "title": "3 Days of Night",
 "author": "Mada",
 "citation": " Mada. \"3 Days of Night: experience with Sertraline (Zoloft) (ID 618)\". Erowid.org. Oct 12, 2000. erowid.org/exp/618",
 "substance": "Sertraline (Zoloft)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Pharms - Sertraline",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>It was a typical tuesday night:  I had just finished all of my work for the next day and decided that wednesdays are always the slowest, most boring days in the week...so i decided to make my next one a bit more interesting.  Wednesday, i got myself out of bed at my typical 6:30 am, to get ready for work.  My psychologist perscribed me 100mg tablets of the SSRI Setraline (more commonly known as Zoloft).  I popped in 5 tablets (500 mg), and went on my way.  About an hour later, i noticed that i was feeling severe nausea, and massive stomach pains.  I went home from work and lied down all day, being unable to sleep because of the severity of the pain. </p><p>Then around 10 pm, i pulled myself out of bed for some dinner (which i decided later not to have).  I felt like i should have thrown up alrdady, and was hesitant about eating anything.. so i put on my favorite beatles music, some Hendrix and then some doors to try and get me to sleep.  The lights were pitch black, and i had come to the conclusion that Zoloft was a weak drug...  Boy, was i wrong.  About five minutes later, while i was staring at my celing and listening to the Greatful Dead, i noticed that my wall was flowing (literally like an ocean) to the music.  It was rotating, shifting, flowing, in every possible direction, across the celing of my room.  I then saw these bright orangeish-red plasma-like objects dance across the ceiling and clash together, creating an even bigger object.  This lasted for about an hour or so, until everything went quiet.</p><p>'well, that's it... looks like i'll be going to bed now,' i said to myself.  All of a sudden, my jaws started spasming, and my teeth started chattering.  Complex retnal visions filled my ceiling for hours upon hours.  The next days were normal ones... nothing else happened like what happened the first night.. But my eyes stayed massively dilated for over three days.</p><p>PS-- i do not recommend taking more than 400 mg.  The Deaths from Zoloft occurred on 500mg and more.</p><p>Happy trails, and take it easy.</p>",
 "year": "2000",
 "id": "618",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-10-12T07:00:00.000Z",
 "views": "31582"
}
