{
 "title": "Malleable Hallucinations -- Sitter's Notes",
 "author": "Flotsam",
 "citation": " Flotsam. \"Malleable Hallucinations -- Sitter's Notes: experience with 2C-T-7 (ID 6184)\". Erowid.org. Apr 11, 2001. erowid.org/exp/6184",
 "substance": "2C-T-7",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "7.0 mg",
   "insufflated",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>This is really a corrollary to Jetsam's 2C-T-7 report (see Malleable Hallucinations), an experience for which I served as a sitter. I'm writing it because I observed very carefully her physiological response during the first 30 to 40 minutes and noted what I believe to be predictable patterns, for the same timing has held for myself and others I've witnessed.</p><p>I weighed out 7mg of powder for Jetsam which she split between both nostrils. The burn hit her hard. Following is a minute-by-minute account of my observations of her condition:</p><p>At 3 minutes she was flushed, perspiring, and her eyes were well dilated. It was obviously quite an intense coming up.</p><p>At 5 minutes she began having muscle tremors. She seemed to plateau at this point for a minute or two.</p><p>At 8 minutes she began showing signs of real discomfort. She curled up into a ball and asked that I hold her hand. I took her pulse; it was faint and accellerated.</p><p>Between the 9th and 10th minute was her first indication of any nausea. She asked for water. I began to get a little concerned, for Jetsam is a highly experienced psychonaut who's handled a *lot* of hairy situations and here she was having what appeared to be a particularly difficult time of it. I was extremely relieved having done nothing myself so that I could monitor her progress.</p><p>By the 11 minute point, she was visibly wincing and having muscle contractions, predominantly in her legs (from outward appearances).</p><p>By 15 minutes, she was full bore into the experience and was clearly having difficulty assessing her situation. I helped her into the bathroom after she indicated she was feeling the need to vomit.</p><p>At 18 minutes she had a massive purge. I've seen Jetsam vomit plenty, but this was more than I'd ever seen her expel. The duration of each expulsion worried me -- fluid would flow for 1-3 seconds. I immediately recognized the serious possibility of asphyxiation from such prolific puke.  This is a real danger which should be anticipated by anyone insufflating this substance. Have a sitter with you when you snort this stuff!! And especially right there with you if you have to throw up.</p><p>By 25 minutes, things were settling in. Once things leveled out, we had a great time. You can read her report for the rest of the story.</p>",
 "year": "2001",
 "id": "6184",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-04-11T07:00:00.000Z",
 "views": "9613",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "7.0 mg",
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 ]
}
