{
 "title": "40m Underground in a Sealed Box",
 "author": "Frodo",
 "citation": " Frodo. \"40m Underground in a Sealed Box: experience with Mushrooms & Alcohol (ID 61849)\". Erowid.org. Dec 3, 2009. erowid.org/exp/61849",
 "substance": "Mushrooms & Alcohol",
 "bodyweight": "175 lb",
 "header": [
  "DOSE: T+ 0:00",
  "3.75 g",
  "oral",
  "Mushrooms",
  "(dried)",
  " T+ 2:00",
  " ",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)"
 ],
 "report": "<p>This story is about my first time trying mushrooms, and the positive/negative experiences that followed.</p><p>Part I: Starting Out</p><p>The evening started out in our dorm, around 6pm. It was my first experience with mushrooms, and I was pretty excited about it. I was tripping with a fairly interesting and experienced group of guys, 8 in all. Most had shroomed at least once, some over 5 times. Overall, we were a diverse mix of personalities, and I was anticipating a pretty crazy time. We had planned to just relax and walk around throughout the trip. After eating about 3.5-3.8 grams each, followed by some orange juice, we departed from our room and headed for the campus quad.</p><p>At this point, Id like to make a brief note. I decided to chase the mushrooms with a particularly large and delicious burrito, which turned out to be the worst idea of the night. Youll find out why a little later.</p><p>Part II: Up on the Roof</p><p>So we headed across the quad. It was a really pleasant fall evening, around 65 degrees. We crossed the campus giggling and laughing, although we all knew the drugs hadnt kicked in yet. We passed some friends, who we laughed at for a bit, much to their chagrin.</p><p>At our school, the library has a spacious roof, with a terrific view, that has become a well-known smoking spot for many students. We had decided to just chill up there for a while and watch the sunset/city. At this point, about 30 mins into the trip, I wasnt feeling anything yet. After sitting in the grass on the roof for a while, we began to laugh and talk, and after about 10 mins, I started feeling a little dizzy and elongated. I started looking at the faced of my friends, who were obviously tripping by now, and their eyes and mouths seemed colorful, bulging and exaggerated. I turned back towards the sky and city, which were the most beautiful things I had ever seen.</p><p>Clouds and vapor trails from planes seemed to continue infinitely in all directions. I felt as though the sunset was a part of me, and I distinctly remember feeling as though we were all surrounded by a giant dome, on which all these colors and forms were changing and moving. Looking at the city felt so good and so right, almost as if watching was an activity in itself, like reading or biking. Every light and building seemed to glow separately. Looking around, I noticed that the concrete and grass top of the roof seemed to stretch in all directions like a giant plain. My friends were all wandering about in small groups pointing things out to each other. The seemed miles away, or sometimes extremely close.</p><p>At this point, I started feeling a little sick from the Mexican. My stomach was churning, and when I tried to sit and relax, my friends voices and other noises seemed to reverberate and echo uncontrollably in my head. I quietly told one of my friends about my condition, and he just stared at me. But I was feeling worse by the minute. Without thinking, I ran down the steps and into the library.</p><p>I sprinted down hallways and through rooms, noticing how the angularity of the walls seemed to cause a caving-in sensation wherever I ran. I felt like people were glaring at me from all around. Finally I made it to the basement bathroom. It was about an hour and 20 mins since I had taken the shrooms, and I had the Fear. I leaned against the mirror, noticing my own bulging and bloodshot eyes. Horror. This was the bad trip that I had heard about, and I finally panicked and jammed my fingers down my throat. I ended up booting all over the wall, completely missing the toilet! But afterwards, I felt so purged and cleansed, that I washed my face and returned to my friends as though nothing had happened. I decided not to tell them about my little breakdown, or the pile of puke left in the bathroom.</p><p>Part III: The Walk and The House</p><p>Around this time, about 1.5 hours from the beginning, I began to feel as though I needed to be somewhere else. My friend actually told me the next day that I had turned to him and said the winds of fate are drawing us to the house or something like that. We decided to split into groups and walk to our frat house. It was starting to get dark at this time. The walk back was my peak of happiness of the night. The campus looked so scenic and mysterious. Lights shone through tree leaves, and I kept thinking I was in some kind of fairy world. Everything was so pretty. We walked and talked, for what seemed like hours, but was actually no more than 15 mins. When we finally got to the house, beers were there to greet us.</p><p>I distinctly remember walking up the stairs inside the houseall of us bumping into each other, talking loudly, changing directions, all this played out against the eggshell white sheen of the wallsand thinking that this moment seemed to me like the perfect album cover. Anyway, we eventually made it into someones room, where we all sat down and lounged, smoking hookah and drinking beerstypical frat stuff. Enclosed in this perfectly square room, I felt like we were in a time capsule miles underground. We began (crappily, but with great enthusiasm) discussing philosophy, science and the past.</p><p>In terms of psychological effects at this stage, I had this amazing feeling that I understood everything in the universe, and that this master plan made complete sense. It seemed to me that if it was possible for me to experience my surroundings in the way that I could at the time, what would stop me from always being able to reach this new level of reality? Time also became a nonexistent or at least unfixed notion, which slowed and quickened at no logical or predictable interval. This part of my trip was by far the most enlightening, nearly 2.5 hours after ingestion. It seemed that mushrooms had loosened my ability to connect conventional meanings to everyday objects and principles. I was discovering everything for the first time, and everything made complete sense. The things I and my friends had been saying about the nature of life seemed extremely important and unquestionably true.</p><p>After about 30 more minutes, we all started coming down, which was a strange experience that I cant compare to anything else Ive ever felt. It seemed neither good nor bad, neither pleasurable nor uncomfortable. We started drinking heavily, and I never had a change to be completely sober after the trip. But the rest of the night proceeded in the usually drunken fashion.</p><p>The next day, I felt unusually happy and pleased with everything, and I didnt have any negative hangover effects at all.</p><p>Conclusion</p><p>Overall, shrooming was a pleasurable and enlightening experience that allowed me to reach mental states that Ive never before achieved. It was also a fucking laugh riot at times, and very beautiful at others. Im looking forward to doing them again soon, but perhaps in a slightly lesser dosage.</p>",
 "year": "2006",
 "id": "61849",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-12-03T08:00:00.000Z",
 "views": "4193",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "3.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
