{
 "title": "Rectal Absorbtion OMG!",
 "author": "Medric",
 "citation": " Medric. \"Rectal Absorbtion OMG!: experience with Hydromorphone (Dilaudid) (ID 61875)\". Erowid.org. Jun 19, 2009. erowid.org/exp/61875",
 "substance": "Hydromorphone (Dilaudid)",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "8 mg",
  "rectal",
  "Hydromorphone",
  "(liquid)"
 ],
 "report": "<p>A little background information: I have been experimenting with opiates for a little over a year. It all started when I found out that my mom had a prescription for oxycodone 80mg and hydromorphone 8mg. I had experimented with both and found the oxycodone to be much more easily used recreationally. I do not like to inject. I tried it once when I was throughly fucked up, just don't like the idea, makes me feel like a heroin addict. So I tried snorting hydro every once in a while, but did not find it to be nearly as pleasurable of a high as snorting oxy. I became addicted to oxy for 2 month and got myself off. I now use opiates much more responsibly, knowing their darkside. Anyways.</p><p>Today I tried a little experiment. I had a needle in possesion and was planning on trying the injection method for the hydro cause I wanted to feel her true strength. Fortunately (ACK NO INJECTING EVIL!!!) the needle bent and broke off acidently before I even got it ready. Now I just had a syringe with no top. That gave me an idea. I filled the syringe half way with water and then continued to crush an 8mg pill. I then poured it into the syringe and stuck the damn thing right up my arse and pressed it down. No I'm not gay, though after this experience...lol. Worried that the liquid would drain out, I pressed my back up against my bed so I was lying vertical upside-down.</p><p>I did this for about 5 minutes (kept my head level as to not get head rush) until I felt a wonderful warmth start to spread from my anus, it slowly spread all across my body. Laying down I realized, 'Wow I feel fucking good! I love hydro!' So for all those adventurers who have access to hydromorphone in pill form but don't want to shot up, this method works WAY better than snorting or oral, fast and it's a FRIGGEN RUSH!</p>",
 "year": "2007",
 "id": "61875",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-06-19T07:00:00.000Z",
 "views": "35989",
 "dose": {}
}
