{
 "id": 6189,
 "title": "Purple Juice, and the Incarnate Realm",
 "date": {
  "submission": "2007-07-31T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Flamboyantness",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "cup"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "tea",
   "specific": "P. cubensis"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "cig."
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Earlier today a friend came over to smoke a joint, and he gave me a glass full of purple juice, he had made a tea out of twenty grams of dried purple ringers, with some blueberry, and green tea, and honey, this glass was part of that brew, he told me it was strong, and recomended not to drink the whole glass, I drank it all, and we smoked the joint.",
  "Preface drug induced history, two nights before this trip I tripped off smoking some chronic while on 250mg of DXM which I stole from the grocery store, I have been smoking pot over 3 years (since 8th grade), had first 'trip' of nyquil gel tabs, then a experience off of benadryl, tried LSD once, tooken dxm a number of times, a few goes with ketamine as well, smoked salvia divinorum, as well as other salvias, and last year had some fun with tryptamines, including DMT(ayahuasca), 5meo-dmt, DPT, and magic mushrooms, as well as some encounters with 2ci, and 2ce.",
  "Now the ego-shattering shroom trip. . .",
  "By the time the joint was done my trip had begun, I felt odd sensations in my body as my world around was turning into vibrations, time, and shape was becoming aparently lost, within half an hour I was consumed. 'I'm tripping really hard, and I'm tired, so I think I should lay down for a bit, you can chill here' I say to my friend mumbling my words as I stumble to my room, I lay down as to fall asleep, but I become a heated vibration, and soon engulfed in a green flash, I am no longer in the ordianry world, this place was alien, the noises heard were buzzing, and periodic drumbeats, were noticed, intense visuals of celtic patterned vibrations were piecing together in front of me, my inner self screaming to me to open my eyes. He was saying some rude things.",
  "Incarnate spirits of ancient mushroom eaters, or it could have been the mushrooms themselves were having a rant as well, they were arguing with me telling me that this realm is nothing like fabrication of pychedelics I have organized, and built in my head from compiled information. I was flapping like a cow, a naked scrawny hairy animal, as human as I was, and close resemblace to a calf, I saw no difference between us. 'This is only chapter 2 of the book' something said, and I know what he had meant, I opened my eyes.",
  "The world was still a buzzing mess, time, and space had no meaning, I walked to the beach, the perceptions of the road I was used to seemed to be stretched an additional mile, the patterns of life were everywhere, and slowly the vibrations calmed as my time perception returned, and I could speak again without mumbling broken sentences. I have taken shrooms many times, and this was my hardest trip yet, and it was the trip I needed to nock me into shape with senses.",
  "I know now as the mushrooms even taught me, that drugs are not part of me, and I feel I in no way need them. Not to say I won't smoke bud again, or trip balls again, just time to tune my chakras, adjust my sentence, and indulge in what needs indulging, reality. I leave you now with a nice quote from a favorite botany website.",
  "'One final paragraph of advice: Do not burn yourself out. Be as I am-a reluctant enthusiast a part time crusader, a half-hearted fanatic. Save the other half of yourselves and your lives for pleasure and adventure. It is not enough to fight for the land; it is even more important to enjoy it. While you can. While it is still there. So get out there and mess around with your friends, ramble out yonder and explore the forests, encounter the grizz, climb the mountains. Run the rivers, breathe deep of that yet sweet and lucid air, sit quietly for a while and contemplate the precious stillness, that lovely, mysterious and awesome space.",
  "Enjoy yourselves, keep your brain in your head and your head firmly attached to your body, the body active and alive, and I promise you this much: I promise you this one sweet victory over our enemies, over those deskbound people with their hearts in a safe deposit box and their eyes hypnotized by desk calculators. I promise you this: you will outlive the bastards.'",
  "- Edward Abbey"
 ],
 "erowid": {
  "id": "37333",
  "citation": " Flamboyantness. \"Purple Juice, and the Incarnate Realm: experience with Mushrooms - P. cubensis & Cannabis (ID 37333)\". Erowid.org. Jul 31, 2007. erowid.org/exp/37333",
  "substance": "Mushrooms - P. cubensis & Cannabis",
  "views": "3654"
 }
}
