{
 "title": "The Perfect Drug for School",
 "author": "Anonymous",
 "citation": " Anonymous. \"The Perfect Drug for School: experience with Tramadol (ID 61891)\". Erowid.org. Jun 24, 2007. erowid.org/exp/61891",
 "substance": "Tramadol",
 "bodyweight": "180 lb",
 "report": "<p>Ive always gone to school high or drunk on different substances, but Im going to tell you about my day at school on tramadol. I had six 50 mg pills (300 mg).</p><p>7:15 Am - Take 5 of the pills</p><p>7:20 Am - Arrive at school</p><p>8:00 Am - I start to get spacey, still feel pretty normal though</p><p>8:30 Am - I can feel a definite change as the pills start to kick in more. At this point I have an overall sense of well being. I decide to take the last pill for the hell of it.</p><p>9:00 Am - More of the body high kicks in, theres an overall euphoric feeling and it feels kind of like Im floating.</p><p>9:30 Am - This is a period change and when I walked through the halls with the crowd of people they were all pretty much a blur. Of course I had some techno in my headphones to go along with it.</p><p>9:30-11:30 Am - just a great feeling most similar to hydrocodone, the high peaked in this time and my vision started to get blurry and slow. Tramadol great for school because I can act pretty normal when needed but all I have to do is close your eyes for a second and Ill be on another planet.</p><p>11:30-12:30 - I can feel the high lessening and I start to get a little drowsy but in a dreamlike state, vision still blurred.</p><p>12:30 - 2:00 PM - The comedown wasnt hard or anything left me feeling kind of refreshed which is awkward but hey who knows...</p><p>The rest of the day I could feel a small buzz from it. I even had a short conversation with the assistant principal and he thought I was a polite young man, ha.</p>",
 "year": "2007",
 "id": "61891",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-24T07:00:00.000Z",
 "views": "22507",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 1:15",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 }
}
