{
 "title": "Seeing Future/Mind Reading",
 "author": "amanitiyed",
 "citation": " amanitiyed. \"Seeing Future/Mind Reading: experience with Amanitas - A. muscaria (ID 61907)\". Erowid.org. Apr 2, 2007. erowid.org/exp/61907",
 "substance": "Amanitas - A. muscaria",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "3 caps",
  "oral",
  "Amanitas - A. muscaria"
 ],
 "report": "<p>3 caps: 1 smal 1 med 1 large</p><p>I saw the future before it happened then snapped back into the past then saw the future again until they kept going almost meeting each other but could never meet.  At the meeting point something both impossible and ordinary would happen.  It was at this point that both nothing and everything were possible.  Such as any concept was somehow the same as its opposite I could see both sides at once.  Including the large concepts such as being god and human,  self and other even odd ones like clean and dirty.  I went through these one after another then got caught in a time loop which involved an incredibly dramatic acting out of a story I wrote.  It contained many zen statements.  It was as if I was both reading and writing the story at the same time or living out a memory of rereading the story very intensely after writing it, in a weird fashion such as Id read the ending then not know what was going to happen next then read the beggening and think I would meet at the middle where the world would stop. </p><p>Didnt reach the middle point as I got taken to the hospital by scared house guest before that point.  In the car I kept repeating love the word over and over and talking about religious context.  I was very high and clear headed no one seemed to understand me however. The whole thing seemed fine I agreed to go to the hospital because it seemed like the right thing to do for everyone involved.  I shouldnt have looking back at it.  I was checked into a mental hospital as well.  I wished the time loop would stop or run itself out when going on, it was quite dramatic.  On another experience I was singing at the top of my lungs makings crazy dancing motions and sounds and being very social, that one was more fun.  Overall a beneficial experience even with the time loop and future seeing.  I was also totally able to read minds for a brief period which was exciting.  Had deep thoughts and insights dealing with my faith and life.  On relatively average doses.  A very fun legal fungi.</p>",
 "year": "2007",
 "id": "61907",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-02T07:00:00.000Z",
 "views": "16472",
 "dose": {}
}
