{
 "title": "Midget Elf Girls",
 "author": "Marakhan",
 "citation": " Marakhan. \"Midget Elf Girls: experience with Salvia divinorum (10x extract), Cannabis & Melatonin (ID 61916)\". Erowid.org. Dec 21, 2009. erowid.org/exp/61916",
 "substance": "Salvia divinorum (10x extract), Cannabis & Melatonin",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  "1 bowl",
  "smoked",
  "Salvia divinorum",
  "(extract - 10x)",
  "",
  "1 capsl",
  "oral",
  "Melatonin",
  "(capsule)"
 ],
 "report": "<p>This is a bit of a lengthy, but worthwhile, report of my first 'full' salvia trip.</p><p>*Lead up to the experience*</p><p>It was my first day off of work in what seemed like forever. I had lots of things that I needed to get done (groceries, cleaning, laundry) and my day off of work was gearing up to be...well another day of work. Though I did have a concert later that evening that I had been anticipating for a while.</p><p>I began the day with a healthy bowl of pot and set about my work. Around 4pm I was done all my stuff, and to be honest I was feeling great. Having gotten everything accomplished that I needed to was incredibly uplifting. I smoked another bowl of pot and began to play guitar. Everything that I played sounded like gold and I wrote a new song and some new riffs that sounded pretty tight (and I am usually my own worst critic).</p><p>Around 6 I was feeling pretty mellow and decided that it was time for some salvia. I had recently purchased a vial of 10x from my local head shop. I had experimented with salvia extract (5x) once before and had tried the 10x that I had purchsed about three times before. However with each of this previous experiences I had never had the full effects. My problem before, I believe was that I had not been holding the smoke in for long enough. My other trips had lasted around 20 mintues and had felt very similar to the onset of a mushroom trip (objects shifting in size and location, mild closed eye visuals, and generally spacey thinking).</p><p>Before the trip I baricadded the door to my room with chairs so I couldnt get out (I had no sitter so I didnt want to risk falling down the stairs or something if anything crazy happened). I sat crossed legged in my chair for about ten mintues and cleared my mind and focused on my breathing and then it was time to begin</p><p>*The trip*</p><p>I packed my long stemed pipe's bowl to the top and readied my self. I held the flame over the bowl and inhaled a large amount of smoke and held it in for around 30 seconds. After exhaling I took another hit finishing off the rest of the bowl. I wanted this trip to happen so I slowly counted in my head. As I reached 20 things began to change. I felt energy rushing through my body. The room was swirling to the right into a black vortex. I had time for one last thought before I was taken away. 'I definatley did it right this time.'</p><p>Everything is very dark. I was very confused and felt like I was traveling faster than the speed of light. I was very aware of my heart beating at this time. I realized I was on a train travelling to another world. Everything was very silent and I could hear my heart pounding. (My theory is that the heart pounding in conjunction with the feeling of moving rapidly is where the train feeling came from) I suddenly realise I am only half on the train and half of my body feels like it is still in the real world. I have a slight moment of panic where I think my body is going to be ripped in half since only half of me is heading to the other world. I can hear the voices of young girls, who sounded very much like midget elves, chanting in a very mocking high pitch tone 'don't forget to call the (this word was lost but it started with the word loco and ended with something sounding latin'). I tried my hardest to hold onto the word but I was unable to. I was entirely unaware of the 'real world' throughout this period of the trip and as generally the case with salvia was entirely unaware that I was under the influence of anything.</p><p>I came back to the real world to the sound of my own voice repeating the mantra that the 'midget elf girls' had been chanting. 'Don't forget to call....' I laughed outloud and said 'you are talking outloud like somebody is here' and as those words exited my mouth my eyes opened back up to 'reality'</p><p>This next part will be very hard to explain but was the most emotionally powerful moment of the trip. I feel like I am in a salvidor dali painting. I am staring at an old chair and the door to my room (covered by more chairs) and everything is vibrant and glowing and very slowly melting. I feel like I am being watched by some sort of goddess (a very very strong female presence). I turn my eyes to the left to see if somebody is actually there. The next image appears directly overtop of the chair/door that I had been looking at before. For a moment I am seeing two very seperate parts of my room at the same time. I could still hear my own voice ringing in my head 'you are talking outloud like somebody is here'. This continues for what feels like forever, images merging together in combination with my own voice chanting in my head.</p><p>I begin to think I was going crazy. It felt like this had been going on for hours. At this point I still wasnt aware that a) I had smoke salvia and b) I was still holding my long stemed pipe. The images melted together had mostly stopped but now as I looked to my right I began to feel like I was outside in a giant field full of bright green grass. My pipes stem was attached to my face and I believed that I was part of my body. My head felt like it was being split in two by a train. I didnt really mind though I was too pre-occupied with my right cheek (the one on my face heh) it felt like it was streching out, at a very odd angle, to the horizon...to eternity I thought. This is when my senses began to return to normal. Suddenly I realised that I was holding a pipe and that alot of the trip reports I had read talked about the feeling of trains and hearing voices.</p><p>I still wasnt full coherent though. The message of the 'midget elf girls' had been twisted in my head. It had become 'dont forget to call your friends' I stood quickly up from my chair and rushed to find my cell phone. But upon arriving I was overcome by the feeling that using the phone was a very dangerous idea.</p><p>I returned to my chair and tried to make sense of things. I felt like I had been high for days but when I looked at my clock it was 6:19. I had only been gone for 9 minutes! The come down, like the previous semi-experiences, felt very much like the onset of a mushroom trip. I was full of energy and again felt like talking to somebody, anybody.</p><p>I spent the rest of the come down playing guitar. Everything, again, felt and sounded great.</p><p>*Aftermath*</p><p>That night:</p><p>I was full of energy but felt utterly calm and at peace with the world. I was extremely pleased with the trip and utterly blown away by what I had saw and felt. Everything felt so real. I just couldnt get over how powerful this plant was. The concert that night was great though I did have a slight headache. My friends that I met there also commented that I talked alot more than normal and a lot faster. I did have trouble sleeping that night. But after taking a melatonin capsule I slept fine. I experienced dreams that night which were much more vivid than normal.</p><p>The next day:</p><p>I had a headache most of the day that felt very similar to a mild hangover. Though the feeling of peace and calm lasted most of the day as well.</p><p>*Final thoughts*</p><p>I was left feeling awed at the power of this plant. I have taken a few substances before (lsd, ketamine, shrooms,) but nothing had ever felt this real. I cant wait to go deeper into the salvia world.</p><p>My only regret is in regards to the 'midget elf girls.' I believe I mistook their message of 'dont forget to call...' At the moment I felt like they were mocking me as if 'my you are stupid how could you forget to call....' But after I think about it I think they were reminding me to call out to the spirit that I felt was watching me. Next time I hope to communicate with this female presence.</p>",
 "year": "2007",
 "id": "61916",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-12-21T08:00:00.000Z",
 "views": "4300",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  },
  "2": {
   "time": "",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(capsule)"
  }
 }
}
