{
 "title": "Medieval Stimulant",
 "author": "b_arctor",
 "citation": " b_arctor. \"Medieval Stimulant: experience with Diphenyl-2-pyrrolidinemethanol (ID 61923)\". Erowid.org. Mar 17, 2010. erowid.org/exp/61923",
 "substance": "Diphenyl-2-pyrrolidinemethanol",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "60 mg",
   "oral",
   "Duloxetine",
   "(daily)",
   " T+ 0:00",
   " repeated",
   "oral",
   "Alcohol",
   "",
   " T+ 0:00",
   "25 mg",
   "oral",
   "Diphenyl-2-pyrrolidinemethanol",
   "(capsule)",
   " T+ 6:00",
   "20 mg",
   "oral",
   "Diphenyl-2-pyrrolidinemethanol",
   "(capsule)",
   " T+ 11:00",
   "2.0 mg",
   "oral",
   "Diphenyl-2-pyrrolidinemethanol",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2007",
   "61923",
   "Male",
   "",
   "Not Given",
   "Mar 17, 2010",
   "6897",
   " "
  ]
 ],
 "report": "<p>B. Arctor, 25 year old individual. Dabbled with psychedelic drugs and research chemicals since 1997. A list is not neccessary to understand information in this report, but my favourite three drugs are AMT, LSD and Cannabis. I am currently on 60 mg dose of the anti-depressive Cymbalta.</p><p>T+00:00</p><p>25 mg. of what I was told was ((R)(+)-Diphenyl-2-pyrrolidinyl-methanol) is consumed orally in veggie cap. Two days earlier a test run with 5 mg was made to investigate appropriate dosage and possible unforeseen ill effects in me; I am also on the antidepressant Cymbalta.</p><p>I initiate this procedure early in the day, since I had seen references that the substance duration-wise has a long and smooth envelope, both comeup and comedown. Also the beautiful sunny spring weather contributed to this decision. 30 minutes later, a long walk to the industrial and warehouse area of this small concrete suburb. A clearly discernable energy of the little fuzzy type guides my steps in my quest to secure low cost, high quality dry fodder for my beloved kitten, here mentioned only under the alias 'Katyusha'.</p><p>T+02:00</p><p>Weak undefined sort of bodily euphoria is present - a buzz, but not the driving, grinding (and potentially orgasmic) feelings that larger doses of amphetamine can induce, nor the sort of friendly fuzzy body buzz which I tend to associate with tryptamines. I am in a good mood, working on some web design and at the same time playing host to two friends visiting, drinking wine and generally socializing. </p><p>Tend to get laboriously absorbed in the task of setting up CSS-classes and aggregating feeds from various services I employ. It was years ago since I constructed a site before. Sharing some glasses from of box wine brought by my friend who goes under the alias Windows Media Player 9.0.</p><p>Mild jaw clenching is noted. My girlfriend remarks on typical nervous tongue movements, but I hardly notice it myself. Some sweating is cooled off in some generous gusts of spring. Mentally, I rather reduce social contacts to a few trusty members, but now it feels like working in an elderly home would fit me well.The feeling is of slowly rising stimulation, expectations of a plateau to come.</p><p>Very hungry, both in the 'need energy' sense and having no adverse feelings towards redeeming this. Whip together a mild wok with chick peas, kidney beans and sweet and sour sauce. Turns out not a candidate to be served at the Nobel Prize Dinners, where all the fat cats of the scientific, business and bureaucratic rub each other's back. I digress, manage to get half the meal voraciously inside me before not feeling for the taste anymore. Hunger resurfaces through the day, and I feel very satisfied to have made the acquaintance of a stimulant that doesn't seem to induce extreme appetite suppression.</p><p>T+02:30</p><p>Oops, here it kicks in. Spontaneous exclamation on IRC, 'factor has been raised significantly!' The smoothness discussed about elsewhere also later proved true at the end of experience - at least at this level. I wonder where in the range of acceptable dosages of 25 mg would be? Is it a nice drug, but limited to being a social tonic with unacceptable side reactions accelerating with dose? Make note to 'Insert more research.'</p><p>T+04:00</p><p>I am having a quite pleasant evening now, in conversation with my friends, one of whom has decided to accept my offer to try 25 mg. I don't experience at all the sort of jittery egocentric babbling and feeling of 'the world is to slow for me, can't it get faster?'-effects that make amphetamines so lacking in exploring one's psychology alone and in group. Of course I might be perceived by the others in the room as dominating and babbly, but they don't seem to be disturbed by it and confirm their affection for me.</p><p>T+06:00</p><p>A booster dose of additional oral 20 mg. is added, since time is drawing near to use the commuter transportation system. The voyage is to a long awaited gig at a medieval themed cave pub.</p><p>A euphoric, almost psychedelic state stands forth clearly but fuzzily. Not been present in amphetamine, MPDV, Ritalin and other stimulants I have sampled. Euphoria yes, but not those higher spectrum overtones of psychedelic coating. Perhaps BZP in combination with TFMPP had some of this, but there it was a question of a more 'dirty' and bodily felt psychedelic tints. Mellow, but powerful, clearly talking for itself despite indulgence in rote Swedish alcohol culture.</p><p>T+07:00</p><p>I meet some interesting characters with which rewarding discussions were had despite club loudspeakers playing loud and extremely outmoded and antiquated music of feodal systems of the past. One person remarks about abnormally dilated pupils, which verifies that this chemical at least in me causes almost extreme mydriasis. I feel happy and socially secure.</p><p>Soon the main attractions, Vox Vulgaris, a band playing contemporary medieval music, citing influences such as Bo Hansson, Ornette Coleman, Aphex Twin and the KLF. The crowd goes wild in the stony, damp cellar valve. At first shouting and moving around enthusiastically, banging their fists on the sturdy but rough wooden tables, soon straddling them for dancing and the multitude are really getting into the Meshuggah-influenced breaks and the following soaring, wild solos of the skalmeja, the oboe-like double reed instrument once so popular in the middle ages and the renaissance.</p><p>It has risen to toot now again! The toot lives! This is the objective state of the concert. The powerful beats and melodies transform the room into a frenzy that can be likened to what happens when a really wild Klezmer/folk band like Kocani Orkestar or some other band one might expect to show up in an Emir Kusturica film.</p><p>Dancing on ((R)(+)-Diphenyl-2-pyrrolidinyl-methanol) brings forward a clear and strong good old stimulant character in this yet so mellow substance. There is very little peripheral action as has been reported elsewhere. No 'heart rushes' and overheating were experienced. But yet capable to 'take the lead'. Of course it is hard to speak about the general nature of this substance in cases like this with so little available bio-assay data.</p><p>In my interesting state of mind I concoct the slogan that 'the future is theory, middle ages are facts!' A great urge falls upon me to make these findings on specific relationships between that which is to be and that which has been. But, alas, the outcry is drowned out by omnidirectional shouts and outbursts originating from the rest of the ecstatic crowd and their already highly active reptile brains. Man must dance.</p><p>T+11:00</p><p>Inebriation is receding, lethargic 50 minute night bus is spent in the iffy feeling of coming down from the stimulant, the alcohol making me pleasantly stoned enough to daydream a little, hanging against the window passing by bus stop after bus stop. Almost baseline, but still alert.</p><p>My girlfriend preferred staying at home to the medieval festivities. My friends and I drink the wine left over in the bag-in-a-box she spent the evening with and assume sofa positions, which feels great. Some jazz to smoke would have been A+, but life is cruel sometimes.</p><p>On the XBOX, the movie 'Ewige Schnheit', which examines the wants and ideas expressed in architecture, body control and general aesthetics of the Third Reich projects. Chronological original and often schockingly beautiful material.. Leni Riefenstahl and so on. </p><p>I administer 2 mg. of phenazepam in veggie caps to circle of friends. Time passes with discussions on the movie, sometimes just observing without listening to speaking track (which is rather like an essay). Time is ready for bed.</p><p>This concludes our presentation. I had some hours of very good sleep after an interesting success in this bioassay. Insert more research!</p>"
}
