{
 "title": "3 Day Window to Enlightenment",
 "author": "Scurbs",
 "citation": " Scurbs. \"3 Day Window to Enlightenment: experience with Ayahuasca (ID 61933)\". Erowid.org. Jun 2, 2007. erowid.org/exp/61933",
 "substance": "Ayahuasca",
 "bodyweight": "145 lb",
 "report": "<p>There are many places you can read how to Brew it so im not going to write it, I'm lazy. I am not an overly inteligent guy, details are usually just a bit beyond me, my friends how ever have a slightly better way of comunicating.  But they didn't 'trip' like I did. Me and two of my friends ordered the ingrediants and proceded to 'cook' the two brews. 5 grams each for the seeds, a brownish liquid was extracted. We placed it in the fridge and continued to brew the roots (8 1/2 grams each). It came out bright red, almost blood red. We used pink sobe to make a 'mixed drink' with the root. We drank the seeds liquid. 25 minutes later I drank the blood red sobe root concoction.</p><p>Its onset was slow, no puke and only slightly enhanced visual perception, like a half an eight of shrooms.  I was disapionted. I didn't eat that day or at all for two more, I forgot to to be honest. I have been eating valume and doing coke and adderal during this time, and have no idea what it did for the trips.</p><p>That following day is where the trip begins, lol</p><p>We just cooked 120 grams of the root and split it three ways. I puked an hour later and it began instantly. Everything had a pattern or a face, I started talking to myself in the bathroom, and this thing was in the shower, the thing was being sneaky but I didn't see it, so I looked around the curtain and this little thing jumps out at me to either play a joke on me or scare me out of my mind, hard to explain but it had a 2d, 4d, black and white elf look to it, it was a higher being than I am, so my mind didn't quite 'get it'.</p><p>Most people probuably would have freaked out but I got the sense it was all in the name of fun. So I laughed myself silly went and layed on the couch and watched people. I could know what they were thinking, not like a psychic, more like there subconcious wants and flaws. I UNDERSTOOD but can't put words to the facts that I thought.  It felt like all theese drugs I do are worthless, accept this beutiful feeling of enlightenment.  I knew what I wanted, peace of mind peace with myself not the pretend peace you get from oxy or some other euphoric drug I wanted to be happy with who I am. I studied people for the come down, and found myself being judgmental in a sorry for you sort of way. </p><p>The next day I reboiled all the roots because they still had color, three times. And and seeds we had left, This time was the hardest I have ever triped, and I have done a lot of wierd drugs.</p><p>This time I layed down and I knew I couldn't sleep but tried to anyway, now this might sound wierd but I clear my mind before I go to bed, like meditation, I focus on nothing.  I layed thier and this time the onset was a creeper. I layed thier kind of sharing my soul with theese two 'spirits', kind of like talking without words or the ability to lie, or like sex with some one you care for, sharing myself, with my consiousness half way out of my physical shell. One of theese spirits had a feminine aspect the other a masciline but not quite male or female.</p><p>This is when I peaked, an even more 'enlightened being' caressed me like a plotonic hug. My dumb a** friend shook me and they went away. I was back in my body and my trip was on the come down.</p><p>This has some spiritual implications, I think that when I die my soul will be free, maybe to join the cosmos, but this universe created itself, maybe created life and with it thought, I believe we will become an 'ENERGY ENTITY', using energy lightly because if thier is matter and energy why not a diffrent spiritual substance? ho knows maybe I am crazy. I am done with drugs, I might do this Ayahuasca agian but the others wont make me happy, not really.</p>",
 "year": "2007",
 "id": "61933",
 "gender": "Male",
 "timestamp": "2007-06-02T07:00:00.000Z",
 "views": "6992",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Ayahuasca",
   "form": "(tea)"
  }
 ]
}
