{
 "id": 6194,
 "title": "Return to Oz (Ego Annihilation)",
 "date": {
  "submission": "2004-10-12T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Joe Mike Bob",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "oral",
   "substance": "TMA-2",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "All chemicals were measured using a calibrated analytical balance. I had not eaten in roughly 8 hours upon performing this experiment.",
  "Setting, my home, alone with a random mix of music, mostly ambient and classical",
  "T+0 (4:30pm) Ingest 50 mgs of TMA-2",
  "T+30 mins (5:00pm) A slight body load begins at this point and I head to the shower, just like last trip, quite relaxing followed by the sensation that toweling off is work. It is easier to break the lethargy this trip having had some experience with the substance.",
  "T+1 hour (5:30pm) Increasing body load, not unpleasant, but I have a slight case of the shakes. There is a nice halo effect going on, everything is glowing.",
  "I engage in a random typing test to test my brain response. The findings are quite amusing to me. Touch typing seems quite easy in a sense, the words are legible, but the letters are not in the correct order. Its as if the thought of where the letter is, is still there, but it is accessed at an inappropriate time in the sequence.",
  "T+1 hour 20 mins (5:40pm) I light up some #2 Gonesh incense and decide to continue the typing experiments. I start some random unguided writing.",
  "I start going off about western civilization and materialism, the standard fight club mentality. This is a common trend in my writing; somewhere in the midst of all this I decide I want to better understand something. I want to try and understand evil. So I look up Adolph Hitler. What a great thing to look up when youre tripping your balls off right? After reading about 8 pages on the history channels website Im not really depressed, its actually kind of interesting to see that Hitler was really just a spoiled little child who wanted recognition; he wanted to do something no one else had ever done. Mind you what he did was incredibly sick and twisted, but he still accomplished his goal. (Thinking about it now, it was incredibly easy to read while on this substance). I decide I need to read something uplifting, so I go and find some information on Mother Theresa, the exact opposite. A very interesting women who could be said to portray the epitome of good.",
  "At this point I continue writing; I have stopped tracking time in my report and just keep writing. I reach a point where I am in a dialogue, and it truly seems like I am talking to some one or some thing. This sure ass hell didnt happen last trip. The implications behind the dialogue are quite disturbing and well I dont really feel like sharing, but the end result is that a question is posed. Does there need to be anyone else?",
  "T minus blast off",
  "(??? Pm This is what I recall, the trip had a lot more substance or maybe lack thereof at the time of the experience, it was very cyclical and had that feeling of a recurring dream)",
  "Time to say goodbye, Andrea Bocelli sings to me. I say farewell to who I am, I ask God to protect me and tell him that I wish to be reborn as love. I dont check the musical score. I plop down on the couch and stare at the line up, boy does 20 mgs look big right now. Sniff",
  "Pause",
  "Pause",
  "Do I really want the other one? I mean come on, thats a lot of 5-Meo-DMT, the last time we did that quantity we got some serious ego smashing, ah fuck it sniff",
  "I lie back on the couch and melt The sliding feeling kicks in, as if you have just let a strange new entity into your body and it is slowly crawling into your brain, the initial onset causing a slight burning, not in your nose, but in your mind. The feel of an ever so slight electric tingle running over the roof of your mouth and ending at the tips or your two front teeth, a sort of metallic tinfoil feeling.",
  "Then the speed comes on, the flash zoom crackling brain static and an intense light. The thoughts fade away into things that cant be described in mere words, as many would say it is indescribable. Somewhere in the midst of all this my ego gets lost and the great eternal game of conflict begins. I stand up from the couch, the music is still on, but I cant tell how loud it is. I stand there staring at the lights on the receiver, totally naked, not just in the physical sense, but mentally. I lost my mind, my soul, my ego and now I have to find where I left it. Where did I set my sanity?",
  "I realize I have played this game before, so I decide to cheat and start rubbing my face and running my fingers thru my hair. This reminds me that I need to breathe; I begin doing so by placing my hands over my face and drawing in deep breaths thru the gaps in my fingers. The vacuum effect helps me to feel my lungs internally and it is quite refreshing.",
  "Stopping, staring shit I lost it (This happens a lot in DMT land when I lose something, I lose it over and over and over and yeah you get the idea)",
  "I turn and look into my room, its very hard to turn or move fuck, Im going to die this time really, Im going to die I keep trying to grab the rules, but cant even remember that Im playing the damn game anymore. Why am I standing here naked? Why am I looking into my bedroom, (all the lights are off, but this fact isnt terribly apparent to me). The music rages on, I wonder if its disturbing my neighbors. I decide to go turn it down a bit, it seems like it takes forever to get to the receiver which really isnt all that far away. When I get there, I cant remember what I wanted to do.",
  "Realization sets in, oh crap, Ive been here before. What are the rules? I run my fingers thru my hair, over my face and remember to breathe again. When did the game start? Crap lets go check the clock wait, wait? We know that wont work time cant save us right now; we left time behind and are now in the land of eternity. We have to keep moving.",
  "The musical accompaniment is very very disturbing.",
  "Amphetamine Psychosis by Hunter S. Thompson comes on. (If you have ever seen fear and loathing in Las Vegas it is the section where Hunter S. Thompson is checking into the hotel during the DEA convention and the cop at the desk is flipping out. This is not directly from the movie, it actually has narration by Hunter S. Thompson himself, I have no clue how in the hell this got in the mix)",
  "Fuck it, lets call him out I turn and stare into the mirror they say you shouldnt do that while tripping.",
  "Why you ask?",
  "Because thats where he lives and I look inside myself and find something I dont want to see its dark its scary twisted and wrong, it doesnt have fangs or horns and a sharp tail; it has thoughts that scare, ideas and dreams that confine. Somewhere in that looking glass is my opposition, my greatest enemy, the thing I fight against every day.",
  "Why am I here? Because I asked to become love",
  "I look at the dark me, and tell me that I love me, no matter how cruel or sick I am. I embrace the fact that I need opposition to exist. I look sad somehow, as if were both missing something where did it go? We have to find it. Things need to change; otherwise stagnation will set in breath",
  "I turn and head for the bathroom, another mirror another me, another time, place, something? What? Where? Wait water; water is one of the answers. I turn on the sink and dip my hand in, that feels really strange I try to drink some Shit??? Ok just a few drops. I have been here before, where is the answer. Ah yes, acceptance",
  "Somewhere in here, a lot of time is lost transitions of this whole event are blurry, but the musical score is what draws me back into what happened. Somewhere in the midst of this another song kicks on that really fucks with me. A Pink Floyd remix not sure who it was done by, but about midway thru the song there is an interlude from one of those old Woodstock films, they start talking about the brown acid that is going around causing bad experiences and they end with saying something along the lines of, but its your trip yeah just what you need to hear in the midst of an ego shatter",
  "This is where the learning begins and the lessons are hard. Can you make a mistake? Yes, can you admit that you may have made a mistake on a cosmic level, can you stand in Gods shoes.",
  "No, I dont want the responsibility, Im afraid. I am not God.",
  "Ah but you are my son, now listen.",
  "The musical score changes, Toccata and Fugue in D minor by Bach (if you are not familiar with this song think of any movie with Dracula and the most warped organ music you have ever heard)",
  "Visions of evil and death start dancing thru my something or other? It cant be my mind, pictures of atrocities committed by Hitler, by everyone and anyone who has ever killed anything. Darkness pain, suffering on a level beyond my mental capacity. About 3 minutes into the song it begins taking on a happier tone (I only know this from checking later).",
  "Slowly the trip transcends and I find myself staring at the computer screen, the question still lingers there Does there need to be anyone else? Ahhh a reference point is worth a thousand words what is my mothers name? I recite it in my head, out load my brother my sister, father anyone I can remember. I scratch and hope for something to hold onto, something to be real Strangely enough at this point Love song by Tesla kicks on, dont know how that one got into the mix either, and very strange timing, but eventually I pull myself back to reality, or perhaps God lets me come back. I have embraced my neighbors, my life, my family and seen things that I never knew existed, I cant say I retained all the knowledge I was shown, but I dont think youre allowed to keep some of the information due to the fact that life would probably become quite dull.",
  "I drank some water, cleaned my kitchen and baked cookies for my neighbors and they all lived after all um I mean happily ever after?"
 ],
 "erowid": {
  "id": "37350",
  "citation": " Joe Mike Bob. \"Return to Oz (Ego Annihilation): experience with TMA-2 & 5-MeO-DMT (ID 37350)\". Erowid.org. Oct 12, 2004. erowid.org/exp/37350",
  "substance": "TMA-2 & 5-MeO-DMT",
  "views": "11425"
 }
}
