{
 "title": "Perfect For Drunkards and Those Alike",
 "author": ":)",
 "citation": " :). \"Perfect For Drunkards and Those Alike: experience with Milk Thistle & Alcohol (ID 61986)\". Erowid.org. Nov 17, 2009. erowid.org/exp/61986",
 "substance": "Milk Thistle & Alcohol",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Milk Thistle",
   "(capsule)",
   "",
   " repeated",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "report": "<p>In efforts to soothe a hang over and curve the chance of permanent liver damage in the future, I ingested some milk thistle. I heard it has alot of health benefits.</p><p>When I purchased a bottle, I read the back to see if there were any precautions I should know about. Since I was not on any serious medications that might negatively interact with milk thistle and I was not allergic to daisy or ragweed type flowers, I figured it would probably do more help than harm.</p><p>I used to drink alot more, but have since cut my drinking to mostly weekends because I just feel like shit the next day sometimes and don't wanna become a alcaholic. The mornings after a long night of drinking, I would feel real queasy. So if I didn't have my milk thistle with me and I slept over a friends house, I would feel like utter shit next morning until I went home and took my dose. I would be sure to get some food in my belly as well since that helps soak up the booze. Food of course also helps with hangovers for me. Oh yeah... and water, lots of water.</p><p>When I take one pill before drinking and the morning after it does the trick to help get rid of that awful quease and wretching of my liver. I also find that it helps reduce the spins if taken before drinking.</p><p>This is an investment well made if you ask me. Not horribly expensive.</p>",
 "year": "2007",
 "id": "61986",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-11-17T08:00:00.000Z",
 "views": "8899",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Milk Thistle",
   "form": "(capsule)"
  }
 ]
}
