{
 "title": "Trippin while Asleep",
 "author": "Arabgoat",
 "citation": " Arabgoat. \"Trippin while Asleep: experience with Melatonin  (ID 62052)\". Erowid.org. Jun 12, 2007. erowid.org/exp/62052",
 "substance": "Melatonin ",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Melatonin",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>It does help. I started using this not too long ago.  I'm an insomniac and kind of a modern hippy, so I didn't want to use prescription sleep aids. The first time I only felt tired, but without the ability to sleep.  Another time it worked. Then read online that it alters dreams sometimes, and that's when it started to alter my dreams.  I don't usually have dreams, or very lucid ones. It's been a long time, and I usually have them on a Saturday, barely ever on a weekday. It was Sunday, which is usually the night I can never fall asleep or get really little of it. That night I slept for a nice 8 hours, (wish I had ten though) No dream that night.  The next night I wanted a dream so I took another 3 mg pill. </p><p>I had a crazy dream about me and my uncle buying a bunch of junk food because we had to spend 80 dollars because he wanted to get cash back I guess. we managed to get two carts full and it ended up adding to 15 dollars and 12 cents, and so I walked to an isle where this lady was stocking up the shelves with spices. I looked way up and saw a spice that said 'the missing spice' I guess it was the spice I could put in any food that'd make it just perfect. So I grabbed a little jar and it cost 326 dollars, so I asked her for a smaller sized one and it came up to be exactly 67 dollars and 88 cents. The end. I woke up.  my dreams never have a conclusion, or I guess they just end early.</p><p>I relied on my internal waking system and always woke up for school with like 6 minutes to get ready.  I take the pill two hours before I go to sleep because that's when it ends up being most effective.  I wake up at 5 am, and just go back to sleep till 7 that way the most lucid dreams occur in the two hours I have.  I stopped getting the dreams after two weeks of use, and just use it for the sleep I guess. The difference between 6mg and 3mg dream wise made no difference, for me at least. It also feels less effective sleep wise also.</p><p>It's trippy for awhile but then it dies down.</p>",
 "year": "2007",
 "id": "62052",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-12T07:00:00.000Z",
 "views": "14600",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  }
 ]
}
