{
 "title": "Wickedly Addictive and Quite Fascinating",
 "author": "MDPVagrant",
 "citation": " MDPVagrant. \"Wickedly Addictive and Quite Fascinating: experience with MDPV (ID 62097)\". Erowid.org. Apr 18, 2007. erowid.org/exp/62097",
 "substance": "MDPV",
 "bodyweight": "140 lb",
 "header": [
  "DOSE: T+ 0:00",
  "3.0 mg",
  "insufflated",
  "MDPV",
  "(liquid)",
  " T+ 0:45",
  "1.0 mg",
  "insufflated",
  "MDPV",
  "(liquid)",
  " T+ 1:00",
  "0.5 mg",
  "insufflated",
  "MDPV",
  "(liquid)",
  " T+ 2:05",
  "1.0 mg",
  "insufflated",
  "MDPV",
  "(liquid)",
  " T+ 3:15",
  "2.5 mg",
  "rectal",
  "Pharms - Zolpidem",
  "(pill / tablet)",
  " T+ 3:15",
  "0.75 mg",
  "rectal",
  "Pharms - Clonazepam",
  "(pill / tablet)",
  " T+ 5:00",
  "4.0 mg",
  "insufflated",
  "MDPV",
  "(liquid)",
  " T+ 7:45",
  "1.0 mg",
  "insufflated",
  "MDPV",
  "(liquid)"
 ],
 "report": "<p>Substance: MDPV (1-(3,4-methylenedioxyphenyl)-2-(pyrrolidin-1-yl)-1-pentanone HCl).</p><p>Structural similarities: Methylphenidate (Ritalin), cocaine.</p><p>Nature: Potent stimulant, dopamine (DA) reuptake inhibitor in humans.</p><p>Form used: Dissolved in distilled water, 1ml per mg of powder supplied.</p><p>Anticipated methods of admin: Intranasal (via atomizer), oral or rectal.</p><p>Anticipated after-effects: Mild depression/anhedonia (dopamine depletion).</p><p>Harm reduction (during): Antioxidants, beta blocker, sedative, food, continuous fluids.</p><p>Harm reduction (between): L-tyrosine, vitamins, minerals, hydration, food, sleep, time.</p><p>Experience Report #1 -- 10-30-2006</p><p>After a decent stretch of sleep (and some food) I feel much better today and got the urge to experience this reputed 'clear headed stimulation' fully, so I loaded 3ml (=3mg) into my nasal pump atomizer. After around 2mg intranasal, I noticed some irregular heartbeats consistent with mild stimulation, plus a sudden urge to empty my bowels. I'm at around 2.5ml (=mg) and once again it feels like a couple cups of coffee. I have decided to take it up to 5mg and will load another couple ml into my nasal pump. I feels that </p><p>I like this technique of administering small amounts at a time and watching as it takes effect. I am not going to tangle with either >5mg doses or rectal admin until more experience reports have been posted, nor do I plan to use this stuff regularly (particularly if I'm still awake in 12 hours!). Note that I have something of a general stimulant tolerance, if there is such a thing.</p><p>+ ~00:30 - solid 3mg ingested, I finally notice a little euphoria! This is much better...  I will go slow on the last 2mg.</p><p>+ ~00:45 - (~4mg) feels something like a couple solid lines of coke in terms of both degree of stimulation and general enjoyment. I should probably just stop here, but dunno. In any case, I am much happier with this stuff today and highly recommend that it's used when the body is well fed and rested, which is a good general reco. for enjoying oneself on any stim.</p><p>+ ~01:00 - I have slowed down/backed off at ~4.5mg... except for the degree of intestinal activation I'm very, very happy with this substance. Final post here will be when it appears to be wearing off, barring any unforseen events.</p><p>+ ~02:05 - I am craving a boost and will give into it ONCE, as in 1mg. Note that I consider it a duty to report any fiending and subsequent 'giving in' where dopamine reuptake inhibition is concerned.</p><p>+ ~02:35 - That's enough... although fiendish, the substance gives a clear warning sign I have learned to heed/obey or pay the price (propylhexedrine gives this too, strangely methylone does not and I could abuse myself to death on it).</p><p>+ ~02:45 - Peak seems to have come/gone, last 1mg didn't do much and was a waste of time. I will (with some regret) let this go.</p><p>+ ~03:00 - Main effects are gone (and badly missed), aside from some residual energy. I won't sleep for another 8 hours or so, hopefully I'll have no problem then. Great, 8 hours to mull over how nice it would feel to do more.  Resisting must be a rite of passage into the official RC-er's club... next I'll get a scale and join all the way .</p><p>+ ~03:15 - 2.5mg zolpidem + 0.75mg clonazepam taken rectally as a relaxant. An antidepressant is really what was needed. Doing/coming off of MDPV is like winning a Mercedes and being told at the last minute they got your name wrong. Uggh. In the future I will have to reserve kratom for the aftermath, but being so close to my recent 'O.D.' + severe stomach issues I don't dare use any for at least a couple days... that was far too traumatic to risk again so soon.</p><p>+ ~05:00 - Ahh!  I am craving a redose and is this close --> </p><p>+00:30 since redose - on the way back up, bowel stimulation noted right away. If same level is not reached at ~4mg as last time, I will give up completely and absolutely not push the bounds of this stuff (and next time I'll go rectal for improved bioavailability, and probably duration of effects too). I likely have yet to find the optimal (for me) way to administer this stuff.</p><p>+00:38 since redose - Entire 4mg administered, I will wait and see if peak occurs at 60-90 min. as before, and what that peak looks like. Still nothing even remotely resembling anxiety/panic, just an obvious energy boost.</p><p>+01:00 since redose - High is not comparable to the first time. Feels much more jittery and less pleasant. If this changes, I will say so and I'll post about it.</p><p>+02:45 since redose - Added a mg or so to nasal atomizer somewhere in there (sigh... at least it's not hit after hit like smoking would be). Nearly at or over personal dosage limit (fingers tingling slightly), but things are currently good. Peak has likely been hit, but no sign of downslide in effects yet. I am frankly about ready for it at this point. A sedative has been prepared on the side in case it's needed.</p><p>+03:15 since redose - Very interesting... substance appears to still be fully active, albeit still jitterier than the first dose. Let's hope this doesn't turn into some 6+ hour thing, or whatever. This was unexpected, but if there's a 'build up in the system' effect then in retrospect it's not surprising. Others have noted 'anxiety attacks' after a couple redoses (despite feeling like they came down in between) and attributed it to overdosage. It appears re-dosing once may be 'necessary' with this substance to fully enjoy it, unless brief effects are wanted for some specific reason (such as a sexual encounter, followed by sleep).</p><p>+04:15 since redose - Substance is still fully active in my system, no sign of comedown yet. I hope there won't be an ugly crash this time . I am going to pre-emptively go with the sedative, there should still be enough MDPV effect to tell when it's wearing off (and the stimulation is becoming annoying).</p><p>+06:00 since redose - Effects definitely on the downswing (I can instantly check sexual responsiveness to see what dopamine's doing in my brain). It may still be a while until I'm 'completely' down. Feels like the crash is gonna be worse this time, but nothing twisted or evil after this short a period of dopamine depletion. I have been to coke parties where a friend begs me piteously for a single small line, knowing it's the last anyone has for the night. None of that crap around here.</p><p>+07:00 since redose - Aftermath. Better than most stimulants, frankly. Better than anything but a short methylone run, better than propylhexedrine, *far* better than coke. I ate something and had a cup of black tea (brand contains only a small amount of caffeine). I feel back to baseline now, no depression and no cravings unless he purposely thinks about the drug. Another hour and a half or so browsing the web, then off to bed. Hope you have enjoyed reading this first report... MDPV requires caution, but appears to reward patience and experience (anyone can get there, but the latter requires the former).</p><p>Notes on the high: My appetite is killed by this stuff, but I managed to force 1/2 a protein bar no problem. Constant fluid intake maintained, as is my practice on stims. Increased stomach acid (as noted below with snapper's monkey). Periodic muscle spasms (mainly in face and legs) minor but evident. Some lower back pain/strain, as with any stimulant. Heart rate seems to be boosted very little, likely BP too (minimal peripheral sympathomimetic effects) although he's on a low dose of beta blockers. Boost in sexual interest present = telltale sign of increased dopamine. Periodic 'standalone' euphoria noted, but it's mild compared to some other stimulant substances.</p>",
 "year": "2006",
 "id": "62097",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-18T07:00:00.000Z",
 "views": "83996",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "3.0 mg",
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 0:45",
   "amount": "1.0 mg",
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "(liquid)"
  },
  "2": {
   "time": " T+ 1:00",
   "amount": "0.5 mg",
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "(liquid)"
  },
  "3": {
   "time": " T+ 2:05",
   "amount": "1.0 mg",
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "(liquid)"
  },
  "4": {
   "time": " T+ 3:15",
   "amount": "2.5 mg",
   "administration": "rectal",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  "5": {
   "time": " T+ 3:15",
   "amount": "0.75 mg",
   "administration": "rectal",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  "6": {
   "time": " T+ 5:00",
   "amount": "4.0 mg",
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "(liquid)"
  },
  "7": {
   "time": " T+ 7:45",
   "amount": "1.0 mg",
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "(liquid)"
  }
 }
}
