{
 "id": 6212,
 "title": "Static Noise from Rebooting Brain",
 "date": {
  "submission": "2007-03-11T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Daath",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "A drug that I've used for years can still surprise me utterly. I thought I knew what to expect, but with little warning I was thrust into alien territory. Or so it goes in this fable I just wrote, at least. It is based on a fever hallucination I had some months ago.",
  "Sometimes fate has a sense of irony. Last year, I had been facing something I had put off for years: the obligatory military service period of my fair fatherland. I no longer had a legitimate reason to gain any further deferments, nor much motivation to fake one. Since I had no intention to become Jehovah's Witness or play a lunatic, neither of which have to go, the service was like the removal of rotting tooth: something that had to be faced before it got even worse.",
  "There was no way in hell I was going to army proper, though. I am a part-time hermit and an esteemed misanthrope, so the thought of spending six months in confined barracks with a bunch of people I would neither like or respect was extremely unappealing. I chose civil service and made arrangements with a distant monastery for a 12-month service as a sort of jack-of-all-trades. Unfortunately this deal blew up, and I ended serving in the training center of civil servicemen. Instead of just six, I now had to spend twelve months in confined rooms with people with whom I had relatively little in common. Luckily, there was a constant flow of hippies, New Agers and potheads through the center, so there was an abundance of cannabis to soothe any frayed nerves and remove boredom.",
  "Hiding somewhere in that constant flow of young men, a fellow traveller known as Influenza A entered the center. People started falling ill in droves, and one evening I too noticed the warning signs of rapidly rising fever. The next morning I got a sick leave, but decided to stay for one day and get a good night's sleep before starting the long trek home. Since I had woken in 6:15AM, was dizzy with fever and had muscle aches, this was a good decision, or at least the best I made that day.",
  "That evening, my fever had reached a plateau. The feeling was not unpleasant. In fact, should there be a drug that replicated that sensation, I would be sorely tempted. My flesh glowed with warmth, but the flames under my skin weren't uncomfortably hot. I had a feeling of lightness, and sometimes when sitting or lying down, it was like I was floating. I felt a touch detached, and there was an oddly pleasing sluggishness to my thoughts, like running through knee-deep water on a hot summer day. I smiled a lot, deriving a great lot of satisfaction of the fact that this vicious invader inside me would be exterminated by my immune system, my beloved SS without mercy or regrets - and even now, in its heyday of parasitic rampage, the virus was only making me feel good!",
  "I could claim that it had impaired my judgment, as well, but looking back at the decisions I made, I fail to find any critical lack of reason. I was curious of how my fever and mild sleep deprivation would react with stoned state. I saw the possibility of unexpectedly intense reaction, but was quietly confident that I could handle it.",
  "When an associate of my roommate came by and offered us a smoke, I accepted. Somehow, it escaped me that he had talked about a mix of high quality weed and Dutch hash. I inhaled again and again, for once matching the pace of my roommate, whose intake could take fairly heroic proportions whenever he got the chance. And I'm sensitive to psychoactives even in normal times.",
  "We waltzed back to our room, with me feeling comfortably stoned. Of course that was only the fever at that point, with perhaps a tiny foretaste of what was to come. The main assault was still speeding through my veins, and when it broke through the blood-brain barrier, I went far beyond 'comfortably stoned' or even 'stoned'. But for a little while yet, I sat on my bed unaware of what I was due for, listening to psytrance and stoned babble.",
  "Then, the first wave struck. Violently and suddenly, I was jerked further into the altered state. I noticed that I was very stoned now, and those feelings of lightness had disappeared. This was still the kind of stuff I was expecting, and smiling tranquilly, I emptied my mind and let it surf on the soundwaves bouncing around the room.",
  "Suddenly, BOOM! The second wave hit me. At this point experience started to get derailed from its usual track. I literally felt gravity grip my suddenly heavy body. Surrendering to its pull, I laid down on my bed. My sensory perceptions felt distant and unpleasant, so I closed my eyes. I found colourful geometrical patterns pulsing and dancing on my eyelids.",
  "It wasn't fun and games anymore. I was uncomfortably aware of the ever-present gravity, pulling me down and struggling against my chest every time it rose in an intake of breath. The body buzz was harsh, far more intense than anything you normally get from pot. And those visuals, for all their delicate beauty, were more intense also, with little of that paleness of colours and detachment which characterize my occasional cannabis visuals. All in all, the experience now lurked at boundaries of a proper trip. I felt mildly anxious, but rather than giving in, I looked at what was happening and adapted to it.",
  "Something that felt like a minute passed. I was just beginning to get settled in, when the third wave rushed in. Gravity gained additional vigor, body buzz turned into electrical currents flowing through my body and visuals got much more vibrancy and depth, being now at par with those you could expect from shrooms or acid. My sense of balance started to malfunction, and lying there with my eyes closed, it was as if my body was slowly spinning and turning around. I began feeling dizzy, nauseous and weak.",
  "It was still fairly easy to remain in control of my now considerable anxiety, but the unescapable fact was that my mind was far more altered than I had anticipated, and that I felt pretty awful. I tried to change the direction of trip by changing my sensory input. I rose to a sitting position and opened my eyes. For a little while, it cleared away some of that dizziness and heaviness. Yet soon the crushing weight returned, and those pulsing geometrical shapes started creeping inwards from the edges of my visual field, overlapping and covering what I was supposed to see with my eyes. I sank back on my bed.",
  "The fourth wave came soon afterwards. My memory started getting fuzzy at this point, but generally, this wave turned the experience even harsher and brought with it intense tinnitus, infernal high-pitched scream in my ears. Sinking into my hallucinations and losing all grasp of my thoughts and emotions, I scrambled up once more. It wasn't a thought-out decision, since I no longer possessed a capacity for making those, but rather a purely reflexive attempt to escape, an act of misguided instinct.",
  "Of course, it was a failure. Reportedly, I struggled up and tried to stand, but fell right on the floor, smashing my face into a chair in the process. Of this I had no clue whatsoever. There was no time and space, no awareness of self, nothing but pure chaos. The only thing that existed was mind static, white noise encompassing several senses. It looked and sounded much like a TV tuned on an empty channel, and felt like electricity. I regret I cannot really describe it further, but not only was it so alien to make it hard to capture with words, it was basically a very simple thing for all its oddness. I see nothing one could learn from it, nor anything that could be called 'spiritual'. It was propably nothing but static noise from rebooting brain.",
  "I suddenly woke up, completely refreshed and happy as a clam. All the pressures had vanished, leaving me clear-headed and euphoric. Interestingly, I learned that my roommate had performed energetic healing on me before I woke up. I don't know if this had an effect on the way I woke up or not. Let those be certain who have found the truth. This could be compared to another mind static experience of mine years back, resulting from a combination of cannabis and antidepressant. Back then, I woke up on my own accord, also refreshed but not quite to the same extent. But, of course the different circumstances mean that any comparisions will be ultimately unconvincing.",
  "Was this some transformative experience? Certainly not. Was it interesting, mostly fun and worthwhile? Definitely."
 ],
 "erowid": {
  "id": "37410",
  "citation": " Daath. \"Static Noise from Rebooting Brain: experience with Cannabis (ID 37410)\". Erowid.org. Mar 11, 2007. erowid.org/exp/37410",
  "substance": "Cannabis",
  "views": "3971"
 }
}
