{
 "id": 6214,
 "title": "Overhyped, Yet Great",
 "date": {
  "submission": "2004-10-15T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SCREAMING EAGLE",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 oz",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(tea)"
  }
 ],
 "report": [
  "I tried (fairly unsuccessfully) Calea two nights ago.  I ate about three grams, smoked two joints, and made what I thought was a fairly strong tea. I did not feel a buzz like some others report, and had no dreams that night.  However, I did feel slighlty woozy for the rest on the next day. ",
  "I did some research, and found that the dosage is between 3 and 25 grams.  I thought that 25 grams seemed like a lot, and let me tell you, it is.  I estimated by putting two large handfulls into a pan and let it boil for 20 minutes.  I then proceeded to pour out the tea (pitch black) into a pitcher, and then repeated that process again.  The pitcher had markings on the side of it, and with the Calea in the pitcher, as well as the tea, the level was at about one liter.  I let it cool in the fridge for a couple of hours, and soak in the Calea.  I got back from work at about 10:30 and drank the tea.  (not great, but not as bad as some say (not bitter).  I was planning to eat the Calea too, but then decided against it, figuring there was still a few more good batches of tea left in it.",
  "Let me say, The first night I expected to be in a sort of weird sleeplike state, having crazy mushroomlike/physcodelic dreams after reading some reports.  The first night nothing happened, the second, many things did.",
  "I had many, rememberable dreams the night I drank the strong tea (last night.)  Which is pretty cool, because I can go weeks at a time without remembering a dream.  Coincidentally, I set my alarm to 9:00 this morning in order to get up and write a paper.  However when 9:00 rolled around, I was too tired to get up, so I started pushing the snooze button (10 mins) on my alarm clock.  I did this six times, and in between each one I had a controllable, vivid, yet not phsycodelic dream. I could go into details about them, but it would take a while, and wouldn't be very interesting.",
  "Anyway, it is noon, the day after I drank the tea, (about 14 hrs ago).  I am very relaxed right now, and have a definite head buzz too. ",
  "Happy Dreaming."
 ],
 "erowid": {
  "id": "37429",
  "citation": " SCREAMING EAGLE. \"Overhyped, Yet Great: experience with Calea zacatechichi (ID 37429)\". Erowid.org. Oct 15, 2004. erowid.org/exp/37429",
  "substance": "Calea zacatechichi",
  "views": "13616"
 }
}
