{
 "title": "An Intense Night",
 "author": "Fetus",
 "citation": " Fetus. \"An Intense Night: experience with 2C-E, Cocaine, Crack, Alcohol & Cannabis (ID 62174)\". Erowid.org. Aug 17, 2007. erowid.org/exp/62174",
 "substance": "2C-E, Cocaine, Crack, Alcohol & Cannabis",
 "bodyweight": "140 lb",
 "report": "<p>I've never heard of anyone being crazy, or stupid enough to attempt to combine tripping with a nice coke experience. The night I took all these chemicals began simply enough. Me and some friends were just drinking little and smoking a little bud, waiting for another one of my friends to get off work, so we could get some coke. I already had gotten together a bunch of 2C-E doses, and some of us were thinking about tripping.</p><p>After we finally got the coke and all took a sample line, we returned back to my friends house. It is then I decided to take the 2C-E. By this time I had taken about 4 shots of some pretty garnly liquor. After taking a couple more lines and chilling for around an hour, I began to feel sick. This was the 2C-E coming up. I finally ended up feeling sick for about 25 minutes, and throwing up once. 30 minutes after that I was into my trip.</p><p>I was allready blown by the time the 2C-E began to take full effect. The cocaine at times almost seemed to intensify all my thoughts and feelings. Yet I felt incredibly mellow during most of the trip. I felt like I could just sit back and melt into the reality of existence. When I was probably halfway into my trip I decided it was time to start sessioning the coke again. Fortunealtey my one friend, who was tripping was just about to cook up some sheets.</p><p>I can safely say smoking crack on 2C-E is a very strage experience. As soon as I exhaled my first hit, the pattrens I was seeing in the bathroom started to slow down a bit and mellow out. The colors I was seeing however allready intensifed by the 2C-E jumped out even more. I felt amazing. The coke high combined with the trip gave me a feeling of utter peace and control. It was almost as if I was the master of the universe. I took another hit and then sat on my friends couch for awhile.</p><p>Again, my thoughts raced in my head while the world seemed almost slow around my. I don't remember thinking about much, all I can remember is that my thoughts were intense. The weirdest part is, about 30 minutes later I began to come down from my crack hits the patterns I was seeing began to become more intense again. After the crack, it was a much more intense clear reality, at least that is the best way I can describe the experience.</p><p>This was my 2nd time tripping on 2C-E, so I am still very unexperienced with how it feels.  Overall, the coke mostly seemed to mask the trip and the effects of the 2C-E, although in some ways it seemed to intensify it, mostly the rate at which I thought and my euphoria/body high. I eventually ended this night smoking bowls, and was surprisingly able to fall asleep about 11 hours after dosing on 2C-E. I felt brain dead for a few days after this experience, and this is definitely a combo that I will not be repeating.</p>",
 "year": "2007",
 "id": "62174",
 "gender": "Male",
 "timestamp": "2007-08-17T07:00:00.000Z",
 "views": "5937",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": "4 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  "2": {
   "time": "",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": "",
   "amount": "18 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  },
  "4": {
   "time": "",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(freebase)"
  }
 }
}
