{
 "title": "My Bad Idea",
 "author": "Dick",
 "citation": " Dick. \"My Bad Idea: experience with Tramadol & Barbiturates - Phenobarbital (ID 62189)\". Erowid.org. Jan 17, 2008. erowid.org/exp/62189",
 "substance": "Tramadol & Barbiturates - Phenobarbital",
 "bodyweight": "235 lb",
 "report": "<p>Late last night I found that I could not sleep again. Like a serious nerd I was browsing an online encyclopedia for at least 6 straight hours, and on this occasion I was reading about the Marvel Comics universe to pass the time until I could get to sleep. In the past I have noticed that the encyclopedia has the effect of making me feel compelled to wander from article to article consuming input like Johnny 5 from the movie 'Short Circuit'. Its is almost an addiction in itself. Its pretty sad actually.</p><p>I have not gotten fucked up in a  while, and I found that I was very bored with myself after hours of internet use. I needed to do something to either get to sleep or to liven things up. Both, preferably. A member of my family uses tramadol for pain. I have taken this before, and it produces a pretty cool feeling that is similar in many ways to drunkenness, but without the mentality/beer goggles, and it is harder for others to detect that I am under the influence of something. It also leaves me feeling itchy all over the next day though. In addition to the tramadol, I have a dog that we must give barbiturates to alleviate seizures.\t</p><p>I was not so sure about the Phenobarbital. It is my dog's meds for god's sake! Also, I have not tried it before and was reluctant to do so. However, I was experienced with the tramadol. Usually I take a 300mg dose of that and I feel great for a while. Not as good as smoking weed or getting drunk, but it does the trick usually. It does make me feel a little nauseous sometimes, and also the itchiness was undesirable. I decide to take half my usual dose to avoid the itchiness, taking 150mg at around 3:00 a.m. To supplement that, I also take 300mg Phenobarbital, just to try it out.</p><p>After about an hour, I feel a minimal level of effects, so I take an additional 240mg of Phenobarbital. I realize suddenly that I have not been drinking enough water, as my throat is very dry. After getting a drink, I do some Phenobarbital research. That is when I learned that the half-life for Phenobarbital was between 58 and 118 hours!</p><p>At this point, I began wishing there was more info, since I don't want to be fucked up for days. At around 4:30 a.m. I realize that I am staring at the computer with my mouth wide open. If I had any saliva, I would be drooling like crazy. After getting up to get another glass of water, I make of lot of noise bumping into things in the dark. I decide to go to bed to try and sleep it off these drunken symptoms. Things such as X-men and Phenobarbital occupy my thoughts until pass out.</p><p>It is now 2:30 in the afternoon the next day as I type this. I have somewhere to be soon, and I still feel fucked up. In retrospect this experience was a bad idea, now that I know how long it takes to go away. I would do it again though if I had nothing to worry about the next day.</p>",
 "year": "2007",
 "id": "62189",
 "gender": "Male",
 "timestamp": "2008-01-17T08:00:00.000Z",
 "views": "16125",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Barbiturates - Phenobarbital",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 1:00",
   "amount": "240 mg",
   "administration": "oral",
   "substance": "Barbiturates - Phenobarbital",
   "form": "(pill / tablet)"
  }
 }
}
