{
 "title": "Speedy with a Psychedelic Twist",
 "author": "Fable",
 "citation": " Fable. \"Speedy with a Psychedelic Twist: experience with Cacti - T. pachanoi (extract) (ID 62183)\". Erowid.org. Apr 14, 2007. erowid.org/exp/62183",
 "substance": "Cacti - T. pachanoi (extract)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Cacti - T. pachanoi",
   "(extract)"
  ]
 ],
 "report": "<p>I have been searching for information on the insufflation of mescaline salts without any luck so I decided to try it myself and share my experience.</p><p>After performing an A/B extraction on a foot long section of San Pedro and converting the alkaloid base into a tartrate salt, I was left with about 2 grams of a pale olive coloured crystalline solid which I believed to be mescaline tartrate along with other alkaloid salts from the cactus.</p><p>I was not ready for a mescaline experience at the time of extraction so the powder sat in a small glass vial for about 6 months before I decided to investigate it.</p><p>One Friday evening in January and believing that the only way to try this in a small dose would be to snort a line, I racked one up. The mescaline had a certain citrus tang to it and was not at all unpleasant.</p><p>Initially I experienced the familiar lightness in my chest which I would usually associate with the very onset of MDMA however this did not last for more than about 30 to 60 seconds, I started feeling more relaxed and comfortable with myself and my surroundings. At around the 5 minute mark I noticed that my visual acuity was starting to change, there was a more vibrant colour and feel to everything in my field of vision.</p><p>I felt my mind become more alert and assessed the situation as being speedy with a psychedelic twist, this lasted for about 2 hours and slowly wore off without any difficulty sleeping later on that evening. My test monkeys indicated to me that this was definitely not placebo and that more investigation was required.</p><p>The next time I tried some was a week later at a friends house, again it was Friday evening. I tried 2 lines and the familiar lightness of chest and excited feeling was back I noticed my social interactions become effortless and realised my attempt as a raconteur was holding the attention of the room, my ego loved this. My mind was sharp and the room was vibrant with colour, I drank a couple of whiskies and found that there was a pleasant synergy between the two.</p><p>Again the experience was slow to plateau and was fully realised at around the 20 minute mark with a lasting high. At time + 1.5hr I tried another two lines which built on the previous experience, the minor rush followed by a mild amphetamine like high with a psychedelic motif that never got out of hand or was too overbearing, sleep came easily that evening however I was not refreshed when I woke the next day. The experience lasted approximately 4 hours.</p><p>It was worth noting that there were no unpleasant feelings, just acceptance and a realisation that the cactus was taking care of me and that this was working as a medicine beyond the obvious feelings of enjoyment.</p><p>If you are looking to get blasted into cosmic hyperspace and walk hand in hand with Mescalito then this is definitely not the way to go. If however you are looking to be introduced to the feel and character of the cactus without yet committing to the long bumpy ride then this I am sure is worth a look.</p><p>For me this is worthy of further investigation, unfortunately I have very little to compare this to as I know of no other reports of insufflation of mescaline.</p><p>Peace</p>",
 "year": "2007",
 "id": "62183",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-14T07:00:00.000Z",
 "views": "15598"
}
