{
 "title": "Unexplainable Twitching",
 "author": "T-Bag",
 "citation": " T-Bag. \"Unexplainable Twitching: experience with Cannabis & Zoloft (ID 6219)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6219",
 "substance": "Cannabis & Zoloft",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "3 bowls",
  "smoked",
  "Cannabis",
  "",
  "5 tablets",
  "oral",
  "Pharms - Sertraline"
 ],
 "report": "<p>3 Bowls of Cannabis and 5 Pills Of Zoloft</p><p>It was winter break, the day after New Years. I had stopped smoking weed for a long while (almost 4 months) so me and a former friend, M, decided to get together and smoke. M brought along one of his friends, B. I didn't really know B that well... but he seemed like a cool guy.</p><p>I'm not a big pill popper, but B had a prescription to Zoloft and he had abunch of pills (Zoloft is an anti-depressant muscle relaxer, I think) [Erowid Note: Zoloft is a prescription anti-depressant SSRI, like Prozac, it is definitely -not- a muscle relaxant].</p><p>So I took about 5 pills of Zoloft. M and B took 7. I never remember feeling the pills take effect, maybe because we got stoned about 10 minutes later. This was suppose to be really good weed too. I remember I was feeling uncomfertable and out of place. I got a vibe from B that he didnt enjoy my company all that much. M called me weird earilier that day.. which really hurt because he was my bestfriend. I knew B had something to do with it. Honestly, I just wanted to get stoned and go to sleep and go home the next day, but I was in for a horrible night.</p><p>After we had smoked the three bowls I decided to go to sleep, I laid down on the bed across from where B and M were sitting. They didnt look stoned. At first I thought they looked really cool, smoking three bowls of this 'great' weed and not looking stoned. Then the twitches started. I would jump up a little in the bed... or jerk forward slightly. I still dont know if it was all in my head, but I didnt like the feeling of being out of control.</p><p>My twitching continued for a long time... I think B and M thought I was asleep because I thought they were laughing at me because I was twiching. Saying things like 'Oh my god, why is he doing that?' I didn't know what to do, I couldn't stop.. I couldn't control myself, and I didn't like being laughed at, so I sat up and looked at them, not saying a thing. They didn't say anything to me, they didn't even acknowalge me. Thats when I KNEW they were teasing me. Why else would there conversation just stop?</p><p>'Are you guys laughing at me?' Was all I managed to get out.</p><p>They both looked at my like I was crazy. M laughed lightly and said 'What?' I jumped up and started over thinking, Saying 'Don't laugh at me! I can't control it!' If they didnt notice my twitchings, I must of seemed very strange. They both started laughing at me. M said they were geeking and I was acting really funny, but I didn't believe them.</p><p>Just at that moment, I remembered M and B talking about smoking crack right before we got stoned. M seemed like a completey different person to me, he had done those drugs I never wanted to touch. Then another paranoid thought burst into my mind, I remember between laughs while i was twiching on the bed M said 'Man, he deserves that, always telling me what drugs not to do!' Yeah, I had said crack was stupid and he shouldnt do it. Now it just all connected. I convinced myself that they laced the pot with crack.</p><p>I started screaming 'WHAT WAS IN THE WEED' while M and B cruelly laughed at me. I was panicking, this was too much. I started saying 'I'm going to wake up your mom! I cant do this' Thats when M got serious, and pissed. He started yelling at me telling me not to go to his mom because we'll all be fucked, but I didnt care, I wanted this to be over.</p><p>After some convincing, they calmed me down. There wasn't any crack in the weed. I asked them if they were laughing at me twitching. They both acted completely dumb to the idea. I still don't know if I was twitching that night. I felt out of control. I don't know if it was the Zoloft, or just me panicking.</p><p>Weed hasn't been the same for me since. I don't smoke anymore, I get paranoid and I still feel like I twitch when I do. The next day sucked.. my jaw hurt and I had a massive headache. Zoloft really fucked me over. I didn't sleep for almost 3 days and I had these awful tremours for even longer. I lost my appitite and got really depressed and felt stupid for how I acted that night. I think everything in that night led up to my panic attack, not trusting M and B, starting back up with 'really good weed' and mixing it with Zoloft. Unless you're presrcribed to Zoloft, I would advise against it. M is addicted to it and B was taken off of it and now he's even more depressed than before they put him on it.</p>",
 "year": "2001",
 "id": "6219",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-18T08:00:00.000Z",
 "views": "37110",
 "dose": {}
}
