{
 "id": 6226,
 "title": "Nothing Special Really",
 "date": {
  "submission": "2004-10-21T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "psy-marshal",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "160 mg",
   "administration": "oral",
   "substance": "4-Fluoroamphetamine"
  },
  {
   "time": "3:00",
   "amount": "120 mg",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "Set: My house, Friday night, bored, alone, wanting to sample the 4-FMP (4-Fluoro-alpha-methylphenethylamine, 4-FMPEA, 4-FA) Id recently acquired.",
  "Setting: Pretty normal Friday night, although as I was alone at home and everyone I knew was out of town, I was not sure what to do and was feeling pretty bored, plus winter was just starting which ruled out running around town. My general mood was good though and I had no serious troubles pressing on my mind.",
  "Dose: 160 mgs.",
  "T+0:00 - Ingested 160 mgs. 4-FMP",
  "T+0:30 - There is a tingle in my face and my palms are starting to sweat. Nervous anticipation? Perhaps.",
  "T+1:15 - There is definitely something here, it feels nice, no waves of euphoria or happiness, but I feel good. My extremities tingle slightly and I am very alert, I look in the mirror and notice myself smiling. Music sounds good; some good psy-trance is the perfect choice for the occasion. Start to get the cleaning of the house out of the way for the weekend to come.",
  "T+2:00 - I am left feeling a little disappointed. My body is warm and I have energy and motivation, but there is no bliss and no psychedelic aspects associated with this chemical at all (not that I was expecting any). I am reminded of simple amphetamine a great deal, but the stimulation does not seem to be as forceful as methamphetamine, more calm and relaxed. No nervous 'I must do all 1000 things which are rushing through my head simultaneously' sort of feel.",
  "T+3:00 - Decided to supplement with 120 mgs. MDMA. Was that a good idea? Hope there's no serious interaction about to take place. I doubt it though; this stuff feels pretty damned harmless.",
  "T+3:30 - Hmm... It feels like someone is sticking me randomly with a pin.",
  "T+4:00 - Feeling VERY nice now. Music has begun to sound infinitely better, have no desire to move anymore. Finish the cleaning tomorrow! Eyes closing in that spaced out e way, jaw starting to chatter a little, having trouble focusing. I am sure this is just the MDMA talking now, but it certainly does feel damn good and strong for a 120 mg dose. No negative aspects to it. (Pin-prick feeling has gone away.)",
  "T+5:30 - Peaking hard, I do not normally feel quite as nice as this when I take just 120 mgs. of MDMA. Is there a connection? My instincts tell me yes. This is nothing like when I combine speed and MDMA.",
  "----------------------------------------------------------",
  "About this time, my flatmate came through my lounge room (she has her own, separate lounge) and asked what the F*#K did you take? I guess my eyes were as big as plates! The next three hours or so I spent on the computer chatting on IRC, listening to music while lying on the sofa and watching a bit of television. I didnt make any more notes during this time for two reasons. One, I was bored with the concept of writing a trip report and two, nothing note-worthy (so to say) was taking place. I was able to fall asleep at about the T+9:00 mark, and slept for about four hours. The next morning, there was just a typical MDMA style hangover with a touch of lethargy and mental numbness.",
  "Conclusion:",
  "It was a good experience and I definitely think there is some synergy between 4-FMP and MDMA, but this particular substance does not overly impress me, especially on its own. From what I had heard about it, I was expecting a little bit more of a bliss element to be present with the 4-FMP alone, but it just wasnt there, at least not to an impressive degree. I have taken 4-FMP on three other occasions, twice alone, and once more with MDMA again. I found the same synergy to be present as with this experience on my subsequent MDMA/4-FMP combination. Alone, I find it to be a simple amphetamine-like stimulant with an even annoying edge to it at times. Id even compare it to dextroamphetamine on many levels. Even meth is more euphoric to me, and I dont find meth that euphoric at all."
 ],
 "erowid": {
  "id": "37464",
  "citation": " psy-marshal. \"Nothing Special Really: experience with 4-Fluoroamphetamine & MDMA (ID 37464)\". Erowid.org. Oct 21, 2004. erowid.org/exp/37464",
  "substance": "4-Fluoroamphetamine & MDMA",
  "views": "18826"
 }
}
