{
 "id": 6232,
 "title": "Engulfed",
 "date": {
  "submission": "2008-02-13T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Hot Milk",
  "gender": "Male",
  "weight": 10
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "1:00",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "I had a desire to try acid for almost two years before I actually tried it. I wasn't quite sure what to expect but I felt that my experience would help me to deal with it.",
  "Myself and a small group of friends had gathered at someone's house to try out some acid. We had each separately tried it but in very low doses. The evening started with a few joints to pass the time, we wanted to wait until there was no chance of bumping into any of his family members as they were still at the house. It was about 10pm when we decided to drop our first tabs. I had originally decided to go very slowly. On my first acid experience I had been tripping for 7 hours on just one tab and a bottle of cough medicine. It was an hour later when I thought that maybe one tab wouldn't be enough so I chewed down another. Over the following hour I started to feel a mild sense of euphoria and a desperate desire to eat my last tabs. By midnight I had munched down 4 tabs of half decent acid, as had one of my friends. Another (the guy whose house we were at) had taken 7 as he was a big guy and liked to get as high as possible whenever he chose to take any drugs. The other two people there took somewhere between 1 and 2 each.",
  "We were at the end of watching some stoner film when I began to notice that something was different. Something felt out of place or strange but I didn't know what. Then, as I stared at the computer screen that had been playing the film, I noticed that everything had started to melt. At first I thought it was a screen saver so I asked the others what they saw, it seemed that they're tabs hadn't taken affect yet. I then looked back at the screen and noticed that all the walls were pulsating colour that seemed to trickle down the walls. I felt very comfortable with this, it made me feel warm, which was good because it was freezing outside as it was about a week or two before Christmas.",
  "I stood up and looked at the others. They seemed stoned, uncommunicative, lethargic, as if something terrible had or was about to happen. I remember walking around the living room and kitchen when my mood began to shift. No longer was I happy and energetic. Now I was feeling ill. I felt like I might suddenly explode as the pressure on my stomach and brain built. This worried me at first, then I managed to focus and realise what had to be done. I told that others that we should go for a walk. It didn't take long to convince them as I could start to see them coming up, the drug had reached their brains. Now they were as excited as I was at the prospect of wandering the streets for many hours.",
  "We had left the house before 1am (any real concept of time was lost for the next few hours). The five of us decided to head for the nearest park to make full use of the children's playground. Thankfully it was only about two minutes walk from his front door. We were delayed by the sounds of cats fighting. The noise was incredibly loud and seem to come from all around us. I remember standing in the middle of the road spinning round in a circle trying to pinpoint the source of the sound. My hands began to wave around in front of my face even though I hadn't told them too. The combination of this noise and the silhouettes of my hands became too much. I stopped just in time to stop myself from going crazy.",
  "We reached the playground and utilised the swings. Even in the darkness I could see the amazingly bright colours that covered the playground's equipment. This was when I realised that the drug was beginning to engulf me. I could feel the psychedelic colours swarm around my head as though everything had become effected by my hallucinations. Normally when tripping I find that I only see things differently when I look directly at them, even then they appear to remain reasonably normal. Now even my peripheral vision was effected by the hallucinations. Everyone and everything was covered by a blanket of multi-coloured shifting patterns and shapes. This was fantastic as for the first time ever I felt truly at one with a drug. I was able to lose sense of what reality is really like in a safe environment.",
  "Still in the playground, some of my companions had decided to eat some tangerines that they had brought with them. There was a massive fruit bowl in the living room of the house that had been emptied very quickly. The bananas went first, the texture and consistency of these once chewed was disgust so I binned it. They, however, loved the sensation of eating whilst tripping. They had carried as many tangerines and oranges as they could out to the playground and spent a few minutes savagely tearing the skin off. This was quite a manic scene that had made me think they had all become far too intrigued by this action, that they would be there for some time. Thankfully they stopped and we played on the adventure playground.",
  "Bored of this we chose to carry on walking around discussing what was happening. Most of this is a complete blur to. What I do remember is trying not to focus on the hallucinations as, after a short while, they became too dominating. We eventually ended up at the house. I felt like the drug had left me and I grew tired. However, when I stopped to look at the small table in front of me and saw that it was stretched and out of proportion with itself (i.e. some legs were different sizes to the others but the table top remained level). I realised that the acid was still there. It was laying dormant whilst I was cold and my blood was running slowly. Now I was warm again, increased heart rate, the LSD was waking up.",
  "The five of us had gathered in the living room, the door was shut and we had circled a coffee table/stool and began talking again whilst rolling up a few spliffs. This was a difficult task as concentrating on anything for more than a moment or two was almost impossible. We would occasionally break into fits of laughter and we each had huge grins on our faces for the duration of the evening. It was not long before we got a call from a few friends who wanted to pay us a visit. I remembered that a few hours earlier they had called to say that they were on their way. At the time it sounded like a good idea but I was no longer sure. It was late and I was perfectly happy with the people that already surrounded me. The pair had arrived and were waiting for us nearby. We had no choice now but to meet them and hope for a quick resolution (i.e. that they would decide to go home, allowing us to do the same).",
  "Before leaving we went into the back garden to pay the dog a visit. Thankfully he was a placid dog, content to just stand there silently whilst we gathered around him. I couldn't understand how obsessed the others were by him. They seemed to be worshipping the dog. I wondered if they had gone mad but when I saw the dog's eyes I realised what had happened. It did have some kind of power over them, I knew this because his eyes' were both glowing bright green and I became convinced that he was trying to place thoughts in my mind by looking at me. This was not frightening, it just made me feel a little bit uneasy.",
  "We left to meet the other two just around the corner from the house. I new one of the guys and could tell by his expression that he wanted to go home, he seemed to have been dragged here by his companion who was looking for a good night spliff. Thankfully we had left almost the entire stash back at the house, this made it a lot easier to get rid of him as lying about how much we had wouldn't be a problem. I let the others take care of the situation, I couldn't handle all the noise. If I did speak to them I think I would have told the to 'fuck off', that would have led to a very painful conclusion to the evening.",
  "We eventually got away and back to the house. The atmosphere had been destroyed. It had put a real downer on a fine evening. Upon re-entering the house we all seemed to go into auto-pilot. Without saying a word we all managed to get back to where we were before we left on that little mission. It was fantastic. What made this even better was the fact that in our absence the lava lamp had heated up and was now flowing rather nicely. With all the lights off this made a nice centre piece.",
  "The process of rolling up a nice spliff had started again but it was not easy as concentration levels were very low. I remember how we would have conversations about rolling up then someone would eventually decide to take it upon themselves to complete this task. However, it would not take long for them to get side tracked and we'd end up talking about it again. This went on for some time, I was sure we were stuck in some kind of a loop.",
  "Eventually the task was completed. We stopped for a moment to stare at little fragments of weed that were still on the table. They had turned into red insects, maybe red ants (or tiny red caterpillars), and were crawling around. After studying them for five or ten minutes we began to smoke. At this point we were beginning to feel very drowsy and irritable. Our bodies and minds were tired but our brains were still wired awake. The friend whose house it was desperately needed sleep as he had to be at work by 9am that morning. It was between 5 and 6am when we finally decided to crash. As my brain was still wide awake I had entire operas and music videos playing in my head when I shut my eyes. The sub-conscious part of my brain tended to make up the words, the music was made by Goldfrapp I think.",
  "I woke up at 7am and lay there on the floor. We left his house at about 8.30am and headed into the city to go our separate ways. I spent the rest of the day filling unadjusted and very out of place. Something was wrong and would continue to feel like this for about a day. After an hour or two at home feeling depressed I decided to take a nap. I woke up at 7pm just to eat some curry. I went back to sleep till the afternoon the following day. When talking to my friend who had to work that day he told me that he was still tripping whilst at work. Thankfully his boss was sympathetic to this."
 ],
 "erowid": {
  "id": "37490",
  "citation": " Hot Milk. \"Engulfed: experience with LSD (ID 37490)\". Erowid.org. Feb 13, 2008. erowid.org/exp/37490",
  "substance": "LSD",
  "views": "3274"
 }
}
