{
 "title": "The Truth of My Reality",
 "author": "Wyldling",
 "citation": " Wyldling. \"The Truth of My Reality: experience with LSD (ID 624)\". Erowid.org. Oct 5, 2000. erowid.org/exp/624",
 "substance": "LSD",
 "bodyweight": "190 lb",
 "report": "<p>I was new to the entire drug culture, psychedelic and non, when I had my first trip. It was something that allowed me to see the deeper edges of my soul. I saw the abstractions of reality that, in turn, showed me the truth of my reality. (That's some deeep shit.) I was open to it. Heck, I was on a roll since I'd recently started smoking pot. LSD was the next logical step (bitter sarcasm). I knew things would look strange and they told me all about the severance of reality and the other reality or realities my mind would create.</p><p>Looking back on it I wish it had happened differently. It was going to be my first trip and people I didn't know all that well had decided it would be a good idea to give me three drops. I didn't know any better, but I didn't want to spoil anything. Also, we were smoking marijuana. Great set up so far, right? (Booo.) Anyway, so it was to be the four of us, my friend P-dog (Ha! No, that's not what I really call him. Please.) and his two female friends (their names don't matter because at all the interesting points I couldn't tell them apart) and we were all going to spend the night at the girls' place. So I was with one person I knew in a foreign place, but then, at the time, like I said, I didn't know any better.</p><p>Things started off simply enough. The four of us  were watching 'Half-Baked' and I was smoking up with them like a good little pot-head stoner should and about 10 minutes after dropping, my entire body was hit with a wave of weight, everything was suddenly very heavy. But that, I'm sure, was just the pot. I was hoping it would relax me so that if anything really crazy happened I just wouldn't care. Oh, the irony. I was all ready for the trip to begin so I just sat back and closed my eyes and relaxed. I started having what P-dog and I refer to as 'crazy thinkin',' which is basically thinking about things you never think about, nothing special. This went on for a while and somewhere along the way the movie had ended. When I finally opened my eyes all the regular lights were off and the black lights had come on. Then the fun began because the 'real' reality began its rough split with the new realities.</p><p>Several different phases occurred. First I just sat there, listening to what the people around me were talking about. I didn't feel like moving at all but I don't know if I could have. I eventually did get up as the next half-hour or so was spent going back and forth from the kitchen with P-dog and one of the girls, trying to get my friend a drink of water. Each time we got to the kitchen he'd get distracted by something and we'd head back out and so on.</p><p>The next phase was where I lost hold of reality. My friend and I were lying on a futon with one of the girls and I had my eyes closed, still just relaxing. This time when I closed my eyes I had crazy thinkin' and all the typical crazy patterns. Sound became light which became shapes, etc. Cool shit. That must've lasted an hour or so, I think.</p><p>When I opened my eyes later I was alone on the futon. I found out later that my friend during this time had sort of freaked out and the girls were tending to him (sort of.) They weren't real helpful for my friend and I. He was in the other room, curled up in a ball in a closet and for some reason they were keeping me from him. So I sat down in the other room and I started thinking that he was dying or something; I got really anxious. One of the girls asked if I was ok and I guess I said I was ok a bunch of times but I only remember a couple times. I don't know why she would keep asking me but then she was tripping as well.</p><p>While my friend was in the other room, reality had slipped away and I was trying my best to deal with that fact. I kept asking the girl with me whether or not I was 'really alive,' if I was 'really there with her.' I soon felt like I was in some high-rise hotel and I was really rich and she was a prostitute. It was what my mind had put together in trying to figure out where I was and who I was. I then became abusive with her and the other girl who was now back in the room. (I guess P-dog was still in the closet.) Since I was rich and they were prostitutes I had license to curse at them and smack them around, which I promptly did. (I regret it somewhat but they weren't really friends so I didn't stress about it afterwards.) Then I got to thinking that I was the CEO/President of this international mega-corporation. Where else did the money come from? And then the pseudo-'visions of truth' came into play.</p><p>I felt like what happened was that I was the chief of this company and that my entire life up until that point, my real life, had just been a bad acid trip. 20 years of my life weren't real. I was blown away. I started reciting all the names and dates I could think of to see if they were familiar to the others, but of course they didn't know what was going on. I felt like I didn't know anyone around me, that who I thought they were wasn't real. I started bawling saying I was coming to them 'from ground zero,' that I didn't know anything about the world, and I didn't. I told my friend that he was now 'God' to me. I was desperately reaching to him for help, but he couldn't really help me in retrospect.</p><p>Then I felt this amazing energy surge through me. My entire body tensed as it felt like I was suddenly omnipotent and didn't have the knowledge to control the power. And that's what I believed. I was giving off so much energy that when I opened my eyes to look at my friend, who was sitting with me on the floor at this point, it looked like I was literally blowing him away. Picture a candle that suddenly has a really, really hot heat lamp/fan blowing on it. Features just sliding back, his glasses melted onto his face, now nothing more than brown lines 'drawn' on his skin. Everything in the room was being blown away. I was terrified and I started trying to get away from it all, closing my eyes, thrusting him away. Then my brain told me I was the true God, awakening from a mortal shell. The energy I gave off destroyed the physical world. All of it, the whole universe. And now it only existed in my head. I could only really enjoy the sensation of the power for a few moments at a time because then my friend was lying on top of me trying to calm me down, but the sweat I felt on my back was blood to me and it felt like he was melting all over me.</p><p>The last paragraph took about 4-5 hours real-time, so I'm told. It didn't seem that long. But I got to thinking that maybe there's something holding me back (returning to the pseudo-truths) that's like a little linchpin that's holding back a dam. Like, there's something I need to break through and all my potential will come rushing out like the power I felt that night. The odd thing was that in the next few months I went through some psychological testing and they found that there was only one thing that was essentially holding back my abilities. It's not a little pin that can be just popped out, but as soon as it's conquered all my abilities can 'rush forth,' if you will. I don't know if I'd do LSD again, but I am intrigued by the insights it may show me. And besides, with the way the first trip sucked, I feel like I want to 'get it right' and get the setting right for the next time, should it come.</p>",
 "year": "2000",
 "id": "624",
 "timestamp": "2000-10-05T07:00:00.000Z",
 "views": "8726",
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ]
}
