{
 "id": 6240,
 "title": "Trifecta Delecta Effecta",
 "date": {
  "submission": "2008-12-18T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Usel",
  "gender": "Male",
  "weight": 127
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  },
  {
   "time": "0:10",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:15",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "The Trifecta Delecta Effecta is trippers utopia. Every year the men in my family make a treck deep into the woods to bond and gather strength as men. As I recall we were only 8 men strong. We had an excellent setting behind the pine curtain in a creek bottom, where we were able to make a sweat lodge and spend a large part of the purifying ourselves and mentally preparing for the twisting we were about to put on our travelin' souls. We had not originally intended to triple stack our psychotropics, however it is worth honorable mention to a gypsy artist, who of free will, told us where the mushrooms grow. We were able to haul a plethora of brown betties out of the field before we were run off by day light and no more shrooms could be found. So we are totally stoked about the guys generosity. When a gypsy says he knows where the shrooms go it is ALWAYS worth a peek.",
  "We started by creating some shroom tea. Interesting mix. when in rough camp, unprepared for shroom preperation, we got creative. 2 cans of canned Lemonade (Minute Maid) heated to just before ' bawlin ', then drop the chopped shrooms ( about 4 grams fresh per dosin' fool ). The tea was set to steep for 10 minutes. The brew turned out a pleasant 1/2 cup of tea. We sucked that down and immediatly chased it with Mars Delight. Ive always thought that when you take shrooms Synergy is fun tool. ' Lets eat this too' Mars says. 20 mg of 2CI.",
  "I have no bones with working one psychotropic with another, and the rule is one good turn deserves another. We were whipped up into a dose eating frenzy. I mean why not we are way off in the woods.... lets eat the acid too. The LSD turned out to be quite a gem indeed. super clean and left no nasty residual effects.It was a good 15 minutes before my body started to hum from the mushrooms.",
  "I sat down by the fire because shrtly after I started feeling the 2CI come on. 2CI always makes me lathargic and first. For about an hour i sat a lot. In my head it was like haveing 3 voices in my head, all humming their own tune. It was a pretty confusing cacophony humming away in by brain.It made it pretty difficult to function. My brother started looking a little worried, apparently he was haveing the same issue. Mars helped center us with Buddah stories. I have to say he tried very hard to convert ... haha. I found the trick was to mentally 'tune' the 3 vibrations together. They all wanted top voice. If I had taken any more acid, it would have literally drowned everything out.",
  "After I got the 3 seperate humms into harmony, I was left with what i can only describe as Tripping Clarity. After a short while we decided that a walk was in order. The Acid had kicked in nice and strong so lethary wasnt an issue anymore. I would rate visual activity at an 8. It was intense and vivid. I wouldnt say it was as as encompassing as visuals from DMT, however it whooped up on DMT's duration. We spent hours in the fields looking at stars and chasing hallucinations through the grass.",
  "About 4 in the morning the few of us that hadn't eaten the acid we ready to crash. 3 of us actually remained up when the gypsy came down to our camp and chit chatted with us. at this point holding a conversation was no trouble at all. we talked until the sun was almost up and then Hit the hippies field again. The whole experience  is rated on a a scale of 1-10, at a 12. It had it all, intense euphoria, great vivid in-your-face hallucination, and superb duration. I might be slightly influced by the company I kept but, the experienced is suggested to all experienced trippers. Biggest warning is make sure you have the mental capacity to harmonize your buzz with others or it could be a rough night of garbled messages."
 ],
 "erowid": {
  "id": "37523",
  "citation": " Usel. \"Trifecta Delecta Effecta: experience with Mushroom, 2C-I & LSD (ID 37523)\". Erowid.org. Dec 18, 2008. erowid.org/exp/37523",
  "substance": "Mushroom, 2C-I & LSD",
  "views": "3114"
 }
}
