{
 "title": "Bad Trip or Rebirth",
 "author": "shroomy McShroom",
 "citation": " shroomy McShroom. \"Bad Trip or Rebirth: experience with Ketamine (ID 62426)\". Erowid.org. Nov 6, 2007. erowid.org/exp/62426",
 "substance": "Ketamine",
 "bodyweight": "210 lb",
 "report": "<p>[Erowid Note: There is a 130mg discrepency in the dose the author indicated ('120mg IM (3 times)') when submitting this report and the dose he describes within the body of the report itself.]</p><p>I had done Ketamine when I was a kid and loved the dream like experience it brought on thru snorting the crystalline white powder. Well years have gone by now with innocence lost and knowledge gained that obviously contributed to the effects herein. I have been studying the out of body experiences brought on by Ketamine and consider myself to be quite educated on the effects of dissassociates effects anyway lets get down to business:</p><p>Time-11pm Just finished watching a movie with Wifee and am getting ready for my own little sensory deprivation K-Hole. Basically I turn on a loud fan and put blinders over my eyes then lay in bed (on my back). My wife is very understanding of my research and I love her for putting up with me in these states because as I can lose all touch with reality and need a calm person to guide me back to reality with a calm voice.</p><p>11pm- IM 120 mg of Ketamine I wait what seems like forever and get up and do another 110mg because I figure my tolerance is a little up from a single K hole from 2 days prior. Anyway My wife and I put together the events of the night because I was in what</p><p>felt like a parallel universe for awhile.</p><p>I first start to feel the effects about 5min after the second shot. I am wearing blinders over my eyes so I first start (like usual) watching cacoon like undescribable patterns wrapping around myself and engulfing me. I watch off in the distance patterns and other shapes and distortions growing all around me. Now to me this is normal when using sensory deprivation as there are no limits on the imagination when I am in that state. I start to feel like I'm suspended in time and space just floating in mid air in this other world. I'm cruising in and around the galaxy watching the patterns around me slowly building momentum as things around me start moving faster and faster till there is a sensory overload and everything goes white (Like a blinding white light). Now I like to think of myself as an intellectual and I also beleive there is an explanation for everything. (I know I wasnt in heaven or Near Death or visited by aliens, but there are strong feelings that everythin isnt how it appears so its easy to believe that I am being guided by some God or Aliens) Anyway I felt myself being dragged deeper and deeper into this world and for some reason started getting anxious and nervous because things were reaching an intensity level I had never been to before.</p><p>In my mind It was like I was being reborn with an understanding of myself and the world around me. A full understanding too. The realizations were very intense and made so much sense at the time. We were all made up of Energy everything was people, trees, animals and everything else. The energy flows through all of us and when I touched my wife it felt like we were connected like my skin was 'becoming hers when we huggeed and touched.(This is a reocurring K-Hole that I get)</p><p>Time- Approx 1130pm-  Things are gatting crazy. I'm delirious and fully under anasthesia I cant move and I've lost all contact w/ the outside world. Usually I just remove the blinders and realize I'm in my bedroom and everything is ok, but this time I was too far under. My Wife had feel asleep already because she said I  told her the K wasnt working and I was going to sleep instead. I dont remember saying this, but I must have because she wouldnt lie So I feel myself descending deeper and deeper into this other world for which feels like eternity and I start to get uncomfortable. As stated I usually just take the blinders off, but I was too deep so in my hole I was tunneling towards a light which I assumed to be the real world and sobriety. I'm jerking and jumping through this other world trying to get back to the world I left. During this tunneling is when I had a rebirth. I figured out the world and every question left unanswered at the moment and the realization was ALL KNOWING and FULL UNDERSTANDING I understood everything bad and good and it was a knowledge I couldve been without and on the other hand I needed to see. Even if it is an illusion the feelings are so real and also very disturbing and unforgiving.</p><p>So the last thing I remember before coming to was I was moving fast towards the light ahead in my mind (Real World) I feel if I didnt reach it I would be forever stuck (which is common) in a time loop where you think your doing' the same thing over and over again. Anyway I didnt know that the movement in my mind was playing itself out in reality. My wife awoke to me landing on top of her after jumping 3-5 feet in the air fromn a laying down position. When I landed I smashed the window behind the bed with my hands that I was using to tunnel (in my K-Hole) I finally came to a little because I landed on her. I then sprung thru the air again and landed in a squatting position at the opposite side of the bed. I asked her WTF was going on? Did the neighbors hear? Were the cops coming? I was in a panic and didnt know what was going on. Finally I came to I knocked our bedside table over smashed a big window, and bruised face alittle (nothing visual) when I landed on her.</p><p>All I remember was thinking what have I done? Why is the window smashed? Why is my wife saying her face hurts. I thought I had blacked out and beat her up or something then destroyed the house like a maniac on PCP. I couldnt comprehend the series of events</p><p>till the next morning when I was sober so now I'm passing it on...</p><p>Now even though the experience was scary at times I walked away feeling very satisfied and like I was reborn and taught things few will ever learn. Ketamine works like a virus going into my main computer frame (Brain) and misfires messages from the brain to receptors which causes all these realizations that feel so other-wordly.</p><p>So in closing Ketamine is probably the best teacher out there (IMO) but people really need to be careful. With the similarities to Phencyclidine (PCP) this drug can bring on bouts of psychosis and violence while blacked out on high doses. A sitter is needed when going through a night of multiple injections. The sitter should be someone you trust and someone experienced with Ketamine not just anybody.</p><p>Sometimes when I do multiple K-Holes I am disoriented when waking back to the real world. This amnesia can be very disturbing if an inexperienced sitter is playing games or not taking the time to tell me I safe and everything is ok. Its a far deeper experience then traditional psychedelics. Traditional Psychedelics deal with the waking world K effects dreams and the subconcious mind in ways I'm trying to 0understand through studies. </p><p>So I am careful with this teacher it can be very unforgiving if its mistreated.</p>",
 "year": "2007",
 "id": "62426",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-06T08:00:00.000Z",
 "views": "6970",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "120 mg",
   "administration": "IM",
   "substance": "Ketamine"
  },
  "1": {
   "time": "",
   "amount": "110 mg",
   "administration": "IM",
   "substance": "Ketamine"
  }
 }
}
