{
 "title": "Red Face",
 "author": "Kingkong",
 "citation": " Kingkong. \"Red Face: experience with H.B. Woodrose (ID 62429)\". Erowid.org. Jun 2, 2007. erowid.org/exp/62429",
 "substance": "H.B. Woodrose",
 "bodyweight": "260 lb",
 "report": "<p>Recently, I ordered some seeds from the net, and never being allergic to anything else, had no fear of an allergic reaction. I'm 26, tripped a couple times on shrooms, once on lsd, all were enjoyable. Mindset and setting were good, alone in barracks room (I'm military, therefore the 'legal' highs). Scraped off coating w/ fingernail file (found this a good method) and crushed up 10 seeds, soaked in 10 oz. bottled water before ingesting. Had eaten about 5 hours earlier.</p><p>30 min. later, got nauseous and puked exorcist style into the bathroom sink. not too bad, mostly water, not much burn. About 30-45 min. after puking, wasn't feeling much, decided to use the sublingual method reported on this site for 6 seeds, crushed up, put in 1 oz. bottled water for about 5 min., held in mouth for about 20 min, spit out. 20-30 min. later, no effects, except for face turning red,(warmth in face). I Repeated the same dose/method done again, only the coating was not scraped off as well in the interest of time.</p><p>About 10-20 min. later, I started noticing extreme redness in the face/neck, and very many red spots all over arms and back and chest. Had never had an allergic reaction to any substance before, but I knew this was what it must be. Would've went to the hospital, but, as I said, I'm military, so going to the hospital and saying 'I just took 22 H.B. Woodrose seeds so I could trip' would be a bad idea. Felt a little mind trip, like a little lsd, but not a whole lot. Thought I might die. Not the 'oh no! I'm tripping!' gonna die, but the 'oh no' - 'my throat and sinuses are closing so I can't breathe' kind of die.</p><p>Was getting cold, so I lay down on the bed and covered up. Started shaking violently, and the little mind trip didn't help, but I'm a pretty calm person, so I talked myself down, stopped shaking, and went to sleep/waking dream state for a couple hours. Woke up, threw up again, as on the second subligual trial, I had ingested about half the solution (about 3 seeds worth) felt much better, still some redness, but no convulsions, no throat closing, etc. Slept for about 10 hrs, woke up the next day and felt normal. Think I may try the 2-step extraction using ethanol and naptha lighter fluid next time, as I seem to be allergic to these seeds. If you are thinking this is a good way to trip, apparently it works for some, but I would suggest taking a very small dose (2-3 seeds), then waiting for a couple of hours to see if you are allergic first.</p><p>Happy tripping!</p>",
 "year": "2007",
 "id": "62429",
 "gender": "Male",
 "timestamp": "2007-06-02T07:00:00.000Z",
 "views": "5957",
 "dose": [
  {
   "time": "0",
   "amount": "10 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(tea)"
  },
  {
   "time": " T+ 1:00",
   "amount": "6 seeds",
   "administration": "sublingual",
   "substance": "H.B. Woodrose",
   "form": "(tea)"
  },
  {
   "time": " T+ 2:00",
   "amount": "6 seeds",
   "administration": "sublingual",
   "substance": "H.B. Woodrose",
   "form": "(tea)"
  }
 ]
}
