{
 "title": "Nutmeg Tea",
 "author": "three jones",
 "citation": " three jones. \"Nutmeg Tea: experience with Nutmeg (tea) (ID 6245)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6245",
 "substance": "Nutmeg (tea)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1.5 tsp",
   "oral",
   "Nutmeg",
   "(tea)"
  ]
 ],
 "report": "<p>Making the Tea:</p><p>1:30pm - I put 1&1/2 tsp's of ground nutmeg in 1 cup of water and let it simmer on medium heat for 45 minutes.</p><p>2:15pm - The majority of the water had boiled away, leaving a thick, oily brown substance.  I mixed that with 1 more tsp of water and drank it down as fast as I could.</p><p>The Effects:</p><p>2:30pm - I started feeling drowsy and relaxed physically.  Mentally I was calm, and my thoughts seemed to flow from one to the next.  I caught a ride to the mall, where I was supposed to be meeting up with friends, because I didn't feel capable of driving.</p><p>2:45pm - Arrived at mall, still feeling drowsy and relaxed physically, but mentally I was really anxious and excited.  Visually the floor seemed to have a fluid-like surface.</p><p>3:00pm - Walked around the mall feeling relaxed, but energetic.</p><p>4:00pm - Sitting on friends couch, feeling VERY relaxed and sleepy.  My thoughts were extremely calm.  Visuals were getting stronger.  Everything had a fluidity, and water-like overtone to it.  Peoples voices seemed lower than normal.  I just kind of sat there for about 2 hours watching the walls flow around, and listening to people talk.  The deepness in everyones voices was very soothing.</p><p>6:00pm - I started hearing a constant humming bass in the background of everything.  I walked around feeling like jelly, my skin was extremely sensitive to soft touches.  I still felt very calm and relaxed and just happy to hear people talk.</p><p>7:30pm - The effects of the tea dissapated very quickly.  By about 8pm I was just feeling extremely tired, like I had been up for a couple of days.  The sensitivity, and jelly-like feeling had gone away.  I wasn't hearing the humming anymore, and the visuals of water were completely gone.</p><p>9:00pm - I went home and went to sleep.</p><p>8:15am - Woke up feeling a little nauseous, but otherwise fine.</p><p>I wasn't on anything else when I drank the tea.  This is my first experience with it.  I definitely plan on trying it again.  Next time I want to try it with a friend and in a bigger doseage.</p>",
 "year": "2001",
 "id": "6245",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-02-18T08:00:00.000Z",
 "views": "35412"
}
