{
 "id": 6249,
 "title": "Caused Headaches",
 "date": {
  "submission": "2007-03-12T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "E. G. Cooper",
  "gender": "Male",
  "weight": "210 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(daily)"
  }
 ],
 "report": [
  "As a child and through early adulthood, I would frequently suffer debilitating headaches.  These headaches were accompanied by chills, nausea, vomiting, muscle tremors, and a sincere desire to 'end the suffering.' For many years we saw many doctors trying to ascertain the problem.  I later figured out myself that I was a caffeine addict and the withdrawal from caffeine (or excessive use) brought on these episodes.  To make matters worse, the only medications that would ease my misery were pain relievers that contain caffeine.",
  "I was born in England and as my mom would say, 'weaned on tea.'  I would usually have my morning cup of tea, as well as a few caffeinated soft drinks throughout the day.  There were days that I was in a hurry and didn't have time to drink my tea, or we ran out of tea, and I'd go to school and before the day was done I could feel the headache coming on.  An experience not unlike the aura a migraine sufferer gets before the headache. ",
  "As a musician, I was really aware of the jittery feeling that accompanies caffeine use.  On days that I had a concert or an audition or some other exposed performance, I would avoid caffeine use... and of course I would be violently ill by the afternoon.",
  "I have been brave enough to try many so-called dangerous recreational drugs, and I have never experienced withdrawal symptoms anywhere near as violent as caffeine withdrawal.  What is more disturbing is how often it is added to 'soft' drinks, over the counter medicines, as well as prescription medications, creating an endless cycle of caffeine use.  Since I stopped using caffeine, my headache frequency has gone down 90%.  They are nowhere near as severe.  And they can be controlled with medication that does not contain caffeine.  I assume that many people suffer what I did, but never attribute caffeine use as the cause."
 ],
 "erowid": {
  "id": "37546",
  "citation": " E. G. Cooper. \"Caused Headaches: experience with Caffeine  (ID 37546)\". Erowid.org. Mar 12, 2007. erowid.org/exp/37546",
  "substance": "Caffeine ",
  "views": "7303"
 }
}
