{
 "title": "It Is the Best",
 "author": "Jjj",
 "citation": " Jjj. \"It Is the Best: experience with Tramadol (ID 62492)\". Erowid.org. Jun 27, 2007. erowid.org/exp/62492",
 "substance": "Tramadol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Tramadol is my favorite drug.  I really don't do drugs because I am busy most of the time and I can't really function on drugs, but tramadol is definitely the exception.</p><p>I don't feel tram makes me tired at all, there may actually be more truth to the belief that it actually keeps me up.  What it does is make you more comfortable with nearly everything you do.  So, if I sit or lie down while on it, I can feel so comfortable that I may not want to get up for a while, causing me to want to fall asleep.</p><p>Also, while asleep, I will periodically wake up, probably about once every 2 hours.  However, this doesn't make for unfulfilling sleep.  In fact, it's some of the best sleep I have ever had.</p><p>I have no difficulty going right back to sleep once I wake up because like said it makes me a whole lot more comfortable.  Conversely, it feels even better to stay up and watch TV (for some reason, TV seems much more enjoyable while on tram, and I've read the same from other people).</p><p>This drug doesn't prevent me from doing anything, I function just fine on it, it just makes everything more enjoyable.</p><p>The bad side effects are itching and irritability.  However, the itching isn't even uncomfortable I guess because it's a painkiller and reduces the irritation.</p><p>The drug's worst side effect is how irritable it makes me.  When I'm trying to read or study I feel the need to be away from any noise because I get pissed off at the slightest thing, and that's not enjoyable.</p><p>This is hardly a weak drug.  It's definitely different from hydrocodone, which I haven't done very much, but when I tried it I noticed the difference was that tram doesn't really give me that 'sink into my seat' that hydrocodone has.</p><p>Tram kinda makes me want to get up and experience other things, although I can definitely get caught up in lying down or sitting.</p>",
 "year": "2007",
 "id": "62492",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-27T07:00:00.000Z",
 "views": "28195",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ]
}
