{
 "title": "How I Avoided Joining the Army",
 "author": "Jldm",
 "citation": " Jldm. \"How I Avoided Joining the Army: experience with Datura (ID 62498)\". Erowid.org. Mar 9, 2008. erowid.org/exp/62498",
 "substance": "Datura",
 "bodyweight": "70 kg",
 "report": "<p>Until the mid nineties in France one could buy those anti asthma cigarettes called 'Louis Legras'. The main ingredient was Datura leaves but they also contained other plants such as belladonna. I was 19 at the time and was called to the compulsory French army test, which I really wanted to fail in order to avoid serving one year. A lot of people were pretending to be psychologically ill so the army people were very tough on fake psychos.</p><p>A friend I was hanging out with the night before handed me 5 of these cigarettes saying, With those you won't need to pretend being deranged because you'll really be deranged</p><p>I went back home and started to make an infusion with the 5 ciggies, looked like a really dark tea, then I went to bed.</p><p>I woke up late the next morning, just had to time to jump into my trousers, grab a shirt and hit the kitchen to drink the 'Magic Potion'. It was so sour I had to add loads of honey to it. I drunk 2 mugs and got out to catch the bus. Within 5 minutes, I was on that bus, my hands started to grip a bar and my head starting to move around; with a slight paranoia like feeling. I hoped some other guys were going to the military camp were on that bus (5 min ride), so I just followed them. As I entered the camp the effects were kicking hard but I was still able to talk. I met an officer that I knew from school who laughed at me saying. Ah ah Weirdo you don't want to do it, the army</p><p>We were all in line, going thru the medical tests, first thing they ask you is to drop some urine in a small glass. Impossible. My mouth was also very dry and from that moment I realised it was gonna be a hard trip. They carried on with the tests, some funny results came out as I noticed I could read the smallest letters on the eyesight test and hear the slightest noise they would throw in the earphones for the hearing test, but I miserably failed the contrast/colours test.  I was supposed to see letters, numbers or symbols. I remember talking about devils, witches and a goat dancing around a bonfire. I had to go through a lot of stairs and corridors to see various doctors (eyes, ears, etc..) and one thing that was really crazy is that I couldn't tell if the stairs were going up or down, sometimes I would want to lean against a wall and the wall I expected just wasn't there.</p><p>During lunch I chocked on a small sardine filet I was trying to eat. Army guys had to grab my legs and turn me upside down, then a doc came and asked me if I wanted to see a psychologist, I said I was alright and I didn't want to but he insisted</p><p>So there I was in the psych office, being asked all sorts of questions while eyes are popping out of the table (I try to poke them but they move too fast):</p><p>'Are your parents divorced'? (yes)</p><p>'Are you afraid of snakes'? (no spiders)</p><p>'If I say red you think what'? (blood, of course)</p><p>In a way I was still aware I should act within my own trip, though I still wonder if the psych decided to evict me because he thought I was deranged or if he knew what kind of stuff I had taken and thought 'if this guy is up to this in order to avoid the army then we don't wanna take any risks'. So he declared me p4+ (means asocial and near to dangerous but not enough to put me in the psychic ward) so I went out with my paper secretly happy and still very fucked up.</p><p>I jumped in an army bus that took all the 'retards' back to the downtown train station, and jumped into the next train to my dad's home in a nearby village. The thing is I took the wrong train and ended up somewhere else (still wonder where) I walked around in that other city all night, talked with mates that were in a tree for a few hours and also made friend with a stray dog that could also speak. I got back to the station in the morning after walking many miles and I made it back to my hometown.</p><p>I had lost nearly everything, wallet, vest, keys even that important Army paper, so I crawled to my girlfriend's apartment. She was very worried as no one had had news from me since morning before. I collapsed in her bedroom and woke up 30 hours later. Felt like shit for at least a week.</p><p>I guess the dose wasn't that bad. Still a little too strong for my taste.</p>",
 "year": "1989",
 "id": "62498",
 "gender": "Male",
 "timestamp": "2008-03-09T08:00:00.000Z",
 "views": "6080",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Datura",
   "form": "(liquid)"
  }
 }
}
