{
 "title": "So Beautiful",
 "author": "Trancer",
 "citation": " Trancer. \"So Beautiful: experience with LSD (ID 6250)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6250",
 "substance": "LSD",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "report": "<p>I had been wanting to trip for some time now, being that the last time I did it was about 4 months ago (Dec.)  I purchased 3 hits of acid that were dropped on sugar cubes. </p><p>Setting:</p><p>In my room, with a little night light on at first; switched to black light later on.  Many glow in the dark things on the walls and around the room. </p><p>I ate the cubes at around 12:15 or so in the AM.  I expected it to take awhile to kick in, but I was wrong.  It took maybe 25 minutes.  It seemed like a rather short time anyway. </p><p>The first thing I noticed was my carpet.  There were designs all over it that looked like indentations.  I thought they were every single footprint that has ever been placed on my carpet.  I believe it was soon after this I started noticing the tracers.  I was using the computer for some time just looking for backgrounds on web pages that would fit the mood.  I was also listening to some trance.  When the acid first started to take hold, I could feel every beat of the music moving throughout my entire body.  It was the most wonderful sensation.  It made me so happy, I couldn't stop smiling. </p><p>At some point during the trip I lied down on my bed and held one of my stuffed animals.  I started to *deep* think.  Everything just (not just objects) seemed so wonderful in life.  I felt a great amount of love to everyone, even tho there was no one around at the time, except someone sleeping in another room.  I felt that everything was so perfect and that nothing should ever change.  I felt like I would never be unhappy again.  Everything fit together and was unified as one. </p><p>This was a pretty moving experience for me.  I don't know if I've ever felt so content in my life.  I'm in the after affects as I write this.  I'm running on about an hour of sleep and am getting pretty tired.  There's still the 'I'm not all here; funny body feeling' all over me.  I must say it was definitely worth the experience.  I hope to have more like this one in the future.  I enjoy going deeper into the trip than just thinking, 'Oh this is cool dude, everything's moving.'  I mean, that part is very cool, but it means a bit more to me than just that.</p>",
 "year": "2001",
 "id": "6250",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-02-18T08:00:00.000Z",
 "views": "13962",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ]
}
