{
 "title": "How I Became a 'Phine'",
 "author": "Jessica",
 "citation": " Jessica. \"How I Became a 'Phine': experience with Morphine & Cannabis (ID 62504)\". Erowid.org. Dec 2, 2009. erowid.org/exp/62504",
 "substance": "Morphine & Cannabis",
 "bodyweight": "185 lb",
 "report": "<p>My very first experience with a controlled substance, and perhaps the reason for my addiction now.  I was a simple pothead at the time, and an occasional drinker, getting wasted once or twice a week.  One night, 2 of my friends and me (my smoking/drinking buddies) were trying to figure out what to get into for the night. I was only 20 at the time, and all though there were the few local bars that served me, the real nightlife was downtown Buffalo, where I couldn't go.  As my friend L rolled up a blunt, K turned to us and said 'Hey, I got some pills from my Dad's room today'.  She pulled out a handful of 60mg morphine pills.  We looked at each other and nodded, figuring what the hell, why not?</p><p>Me and L both took just 1, while K took 2 (She's kinda heavy)  We lit up the blunt and toked as usual.  About 45 minutes later, my head started feeling way too heavy for my neck.  I had to prop it up with a pillow.  My body started itching, and I got this intense rush of euphoria- everything felt all good, no worries, no problems.  My hands were sweaty and there was a slight ringing in my ears.  I felt the need to chain smoke cigarettes and talk non-stop.  When the pot wore off, my body felt really heavy and the euphoria wasn't as intense.  We all agreed to roll up again.  As we smoked the second blunt, L puked (She's very thin).  For me, the weed intesified the effects of the morphine.  We only smoked half of it.</p><p>We all layed on my bed and talked for another hour.  I recieved a call from my friend A, asking where I was (I forgot I made plans with him).  I agreed to walk and meet him halfway to his house.  The walk was interesting.  I couldn't keep my head up straight and my legs felt like lead, but my feet felt like they were floating.  My thighs and nose were itching like crazy! When I met up with him and we walked to his house, the feeling wasn't the same.  I still felt euphoric, but not so talkative.  We got to his house and smoked a joint.</p><p>I sat on A's couch and felt like I was literaly part of the couch.  I didn't feel like talking so much, I just kind of vegged out and watched TV.  I figured maybe the change of scenary had something to do with it, with L and K, I knew they were feeling what I was feeling.  But A just got back from the bar, so we were feeling 2 completely different things. Afte about an hour and a half, I told him I was tired.  He walked me home and told me I was stupid for fucking with pills.  This time the walk home seemed to take forever!  My whole body felt about 500lbs, and I couldn't keep my eyes open.  When I got back, L and K were in the same postion I left them.  It felt really good to just lie down on the bed. We smoked a little weed, and I felt really calm, tired, and heavy.  We were all too tired to eat anything, like we usually did after a night of partying.  About an hour later, we all passed out, and slept for a good ten hours. The next morning I felt a little funny and a bit weak stomached, but it quickly went away with some toast.  My thighs were bruised inside and out from itching so hard.  I stayed lethargic for about 3 or 4 hours after waking up.</p><p>I repeated this for about a week and a half, until K ran out of pills. We'd say, 'Let's morph tonight', and call ourselfs 'phines(feens). Then I spent 3 days laying in bed with cold sweats, leg cramps and diarrhea (I though I was sick, and later on found out it was withdrawls) After that, K would occasionally swipe some oxys or lortabs from her dad (a whole different experience!) and we'd take them, but not consistantly like we did the morphine.  The experience was great, and I would do it again.  But only on a night when I don't have to wake up in the morning for anything.</p><p>Now I prefer Lortabs- a completely different feeling.  But I'm also highly addicted, and taking 8 10mg at a time, 2 or 3 times a day.</p>",
 "year": "2002",
 "id": "62504",
 "gender": "Female",
 "timestamp": "2009-12-02T08:00:00.000Z",
 "views": "17016",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Morphine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
