{
 "title": "Withdrawls, With Drawls, With Druels",
 "author": "lux",
 "citation": " lux. \"Withdrawls, With Drawls, With Druels: experience with Pharms - Zolpidem & Alcohol  (ID 62510)\". Erowid.org. Nov 24, 2009. erowid.org/exp/62510",
 "substance": "Pharms - Zolpidem & Alcohol ",
 "bodyweight": "150 lb",
 "report": [
  "<p>This is my notation of day three during the difficult adventure of quitting heroin, which was subsequently editted, so as to remain relatively coherent.",
  "Withdrawls, withdrawls withdrawls: There's not alot of room left for sleep..",
  "I've decided to take a good amount of ambien, 15mg orally, at about 2:30am. I'm now Laying in bed still experiencing withdrawls and I pretty much gave up on the idea of the ambien actually putting me to sleep. Then at about 3am i realize that there is more ambien where that came from.",
  "Note; I am reporting earlier events so i am not in the state that im describing as i am in it, the state that im in right now as im typing this will be described later in the report when i perhaps will be in yet another state all together. We shall see.",
  "I'm out of my bed on a mission to find the other little orange pill. Of course they're by the coffee (yes there is coffee just strewn about, im getting a sense of well being from what others may call messiness, but hey I live in seattle and I love my coffee.)",
  "I crush the small orange ambien cr pill into fine white powder, then i split it into two lines, and at 3 30 am i rail one. At this point my tactile senses are askew, im not halluniating but everything seems... off. It's almost as though someone has moved everything two inches to the left and i cant figure out where it all goes back to.",
  "I scrape the remaining line of ambien to the edge of the kitchen conter not planning on doing it tonight. i leave this note with an arrow pointing at the powder..",
  "The note reads 'ambien cr 15mg ----> hypnotic sleep aid do not discard this powder please!'",
  "With the note placed by the remains of the ambien I feel like I am safe to step out side for a cigarette.. While smoking my cigarette and looking at the gravelstone steps below they seemed to breathe and shift. The parking lot looked as tho it were a hollywood set.",
  "I am now drawn back to the remaining ambien, i scrape it up and do it in a line. i wash down this line with a lemon manhatton ... (1 part rasperry vodka 1 part manhatten mix 1/2 part lemon juice.) I leave this note next to the first it reads; 'disregard previous note as i have decided to do the rest'.",
  "And this is the point that I began to report this write up. We have now caught up to my current state..",
  "Current state report:",
  "4:24am: As i write i forget what i wrote, though organization is out the window, furniture around me seems to shift. i feel warmer. i have dropped the blanket that was draped around me. getting progressively groggy and disoriented. trouble reading words on the screen...",
  "[N.B. No editting at this point]",
  "bed seems to be calling to me",
  "430am 5am is a blur .having trouble remembering what i was doing .just images of laying on the floor and crawling to the kitchen for a glass of water altho i find no water around me",
  "at this point i notice that i am not noticing any withdrawl symptoms like i was when i started",
  "Gone?perhaps",
  "most likeley i am to confused and groggy to notice them",
  "this seems like a good place to stop the test.result? a seeming success.its now time to find my way to bed or perhaps the floor behind me and fall into what promisses to be one of the most deep and lucid sleeps of my life",
  "goodnight and good luck with you experiments with ambien</p>"
 ],
 "year": "2007",
 "id": "62510",
 "gender": "Male",
 "views": "7762",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Pharms - Zolpidem",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2009-11-24T08:00:00.000Z"
}
