{
 "title": "One Boxing Day I Won't Soon Forget",
 "author": "NativeNick",
 "citation": " NativeNick. \"One Boxing Day I Won't Soon Forget: experience with LSD, MDMA (Ecstasy) & Cannabis (ID 62533)\". Erowid.org. Dec 6, 2007. erowid.org/exp/62533",
 "substance": "LSD, MDMA (Ecstasy) & Cannabis",
 "bodyweight": "160 lb",
 "report": [
  "<p>So it tried a candyflip for the first time on Monday and have never tried LSD or MDMA as well. Needless to say I had a hell of a time. I had the most stunning visuals and the trip was a real head fuck but there was still a great deal of euphoria.",
  "It started out on a Sunday afternoon. I went to my buddies house and told him I would give him 20 so he could get a flap of coke while I went on an acid trip. I know its 5 bucks a hit but I wanted acid badly and 10 extra bucks was no biggie. I put the 2 hits on my tongue at 2:30 and held them there for about an hour. Around 3:00 I was already starting to feel strange. I felt really giddy and there was an all around strange feeling like my sense of balance was put off a little. I started to notice detail in everything. I was fascinated by my friends stucco ceiling and kept looking up at it as well as the wood grain patterns on his doors.",
  "My first visuals were seeing bright reddish pink dots out of the corner of my eye and even more when I looked at wood grain or the stucco ceiling. Soon they were in the center of my vision and were much more noticeable. I see these red dots usually at the begining of a shroom trip as well, on dxm and even on weed once in a while when I'm really ripped. My friend was playing Jedi mind tricks, the volume was turned up and I could feel the soundwaves hitting me. I could feel the raw anger and intensity of his voice hitting me. The music just had much more meaning and intensity.",
  "The trip really started at 3:30. The ceiling I was starring at in his living room was warping slightly and there was a light purpelish tinge to it. I began seeing the dots grow larger and start to move around along the wood grain when I looked at his door frame. As I breathed it looked like the door frame was growing in and out slightly. When I'd lean in to look closer at the carpet it would almost indent as if I was causing it to happen. When Id move my head to the left or right when looking up it almost felt like the ceiling was shifting with me. Shadows behind pictures on his wall would appear to grow. I began to notice that the ceiling was morphing more and more bulging in and out all over the place I also noticed 2 dominant colours a green and magenta interchanging with each other while the ceiling was morphing I went up stairs and looked at my pupils which were fucking huge I noticed the walls in the mirror starting to breathe.",
  "I went back downstairs and began listening to a Pink Floyd album on my ipod (A Saucerful of Secrets, really good on acid). The ceiling was warping with much more intensity almost bubbling. The patterns on his couch were shifting slightly. I looked at a painting across from me, a boy and a dad working on a tractor near a barn. There was a dog as well in the picture. The picture had such intensity the greens on the tree were incredibly vibrant the picture had a shining quality and it would appear to shimmer like a holagaphic image as I moved my head. The trees began to look like they were blowing in the wind.",
  "The visuals and music were working in perfect synergy I began to wonder if the visuals made the music more intense or if the music made the visuals more intense. My buddy decided to go out and buy a gram of weed and a cap of e instead of blow. We went out to meet the guy I took out another 20 from my bank in case he wanted to get blow later. While outside the snow had a purplish tinge the trees were a bright orange waving slightly as the sun setted. We got back to his place and he asked me if I wanted to candyflip. I was more then willing so he crushed it into 2 lines we each snorted it at about 4:30. I already felt strange within a few minutes the trip felt much more intense more euphoric and my body felt so good in a strange way.",
  "We decidded to go out and get some blow. I called the dealer on my cell he wouldnt answer so we called the guy we bought off earlier and decided to buy to more caps. by 5:30 there was a definite mood lift walking felt so good like I was floating and nothing could bring my mood down. I hadnt really noticed the visuals as I was walking as much almost like I forgot about them. I began to wonder if I sullied the experience by taking e. That notion was quickly thrown out the window when we got to the dealers house. We chilled at his place and railed a pill each. I was noticing the visuals getting much more intense there were roses on his wall that were spinning around growing in and out while the wall bulged in and out. The vines with the roses appeared to be growing as well.",
  "We decided to peace it and went for a walk to a burger joint. The visuals were only growing in intensity I stopped to look at the trees the branches appeared to be waving like tentacles like the tree was a living entity I was wondering wtf, I asked my friend if the tree was moving he said yes the wind was blowing through it. We arrived at the burger joint and I was definatley peaking the visuals were the most intense. I looked at the tiles and there was awsome floral patterns all over every tile spinning around moving to the next tile all interchanging with each other they began to change to fractals and the floor looked glass while some strange orange textured fluid was flowing underneath the tiles. Again it solidified to a floral texture the lines in the floor began to wave and morph like vines and began to change green and appeared to be growing out. 'Vines Im seeing fucking vines I said. My friend laughed and said 'yeah right' I was absolutley floored by the visuals.",
  "I decided to head to the washroom I looked in the mirror and was amazed I was absolutley fascinated as I was starring at myself my face had such detail I was gaping in awe with a goofy child like grin on my face with glazed over eyes. I felt as if I was being pulled into the mirror, soon green smokey fractal patterns appeared fairly faintly and began to thicken. Suddenly I heard some strange tribal music in my head like flutes or something the coulors were shifting from orange to green and I was so euphoric. The mirror began to look like it had added depth to it as I was leaning closer to it feeling like I was being pulled in.",
  "I was so amazed but I decided pull away and to go out and meet my friend before he got worried. We walked to a park and arrived at the pavillion. We smoked a few bowls when we got there and omg the weed brought the trip to a whole new level. Besides the head fuck of acid and visuals as well as the euphoria and energy of MDMA I began feeling very spacey and stoned. I leaned against a wall with my buddy and went into a trance I forgot my friend was there and my thoughts began echoing. I felt like there was nothingness behind me just a balcony I was leaning on. It got to the point where I could imagine myself leaning against the balcony I could see the infinite sea of coulors swirling around behind me. I closed my eyes and I could see myself leaning against the balcony as bright greens oranges and yellows morphed together beautifully. I opened my eyes and decided to turn around to see if this was all real. I turned to my right and for a second it was like I was looking in the mirror seeing my reflection it dawned on me that it was my friend and I finally snapped out of it I remembered I was leaning on a wall.",
  "We went inside and sat in the lobby the awsome fractal patterns were still on the tiled floor in the pavillion changing coulors. A car had pulled up shining light on the floor for a few seconds the floor glowed in a brilliant bright silver coulor as the fractals moved around, the floor appeared to be encrusted with jewels and diamonds shining brightly. I was absolutley floored and thought it was absolutley the most beautiful shit I had ever seen. It quickly dissapeared but returned when ever a car would pull out. We decided to peace it and I began walking home. I saw fractal patterns all over the sidewalks the snow shimmered and glowed with beautiful intensity. I went into a deep train of thought and wondered the neighborhood on an acid trip for a good 2 hours. I must of looked stupid because every couple of minutes I would have to stop and appreciate the visuals I would literally stand in the middle of the street or sidewalk looking at random things watching them morph for a good 5 minutes each time. I turned on dark side of the moon and it was wonderful as always.",
  "I began to think of how materialistic we really were and how people would go out on Boxing Day which was that day and buy shit they didn't need just for a feeling of empowerment. I began to realize how primitive it really was. It was just away for us as humans to gain status just as animals would in a primitive way. I realized we really are animals. I thought of how maybe I was itemizing drugs taking them just for the hell of it. And even intense beautiful music like Pink Floyd was materialistic. I didnt see it as an art form just because it was on an ipod. I really loathed the freaking thing. But it dawned on me that music was art and it didnt matter what medium it was in it was still music and still an art. It just came from some where different whether it was a cd, cassette, record, mp3 it was still music.",
  "I realized how surreal the visuals really were I likened it to surreal art like Picasso and Salvador Dali even wierd shit I created. I wondered how we could come up with stuff like this. I wondered if art as well as my psychdellic mindstate were just parts of the primitive brain that would manifest itself once in a while. Whether it was art, a trip, or a dream it would come out in some way. I realized we could not be like this all the time we would go insane and eventually be driven to suicide from such a chaotic mindstate. As creative and philosophical as you are on this stuff we are not meant to function like this all the time. This mindstate is only meant to manifest itself through various mediums. Too much of anything could be bad. Its essentially here for occasional use.",
  "As I walked around, I closed my eyes and got stunning visuals. I opened my eyes I realized the sky was clear I looked up and my cev's were projected on the dark sky there were wonderful blobs of coulor all over the sky red, orange, purple, and green every imaginable colour, as well as the bright pink dots every where. The stars began moving around growing and moving in and out slightly I noticed fractal patterns and the blobs of coulor looked like distant galaxies and nebula it was so stunning. And it got to the point where the visuals were imposible to differentiate from the sky itself. I sat down on a bench in a park and noticed trees blending together in the background with the most fluid motion, branches moving like a living organism intertwinning with each other, it began to look like they were bleeding together. I looked at the snow and it had a lumpy texture the snow began moving and looked like worms inching across the park.",
  "I decided to walk home as I did I noticed a tree that stuck out I focused on it with intensity the patterns of the bark moved around I noticed details and every individual branch and twig. The red/pink dots began to move along the bark almost as if they were swimming faster and faster fast enough to start making lines which connected together. I noticed the tree as a whole and I swear to god it was covered in red lines moving and pulsing. They appeared to be veins. I looked at other trees and they had the wonderful veins too.",
  "I got home and managed to slip by the rents. I went to bed pulled the blanket over me and was swallowed in a sea of awsome visuals and patterns. I could feel my self open and close my eyes but the visuals remained as I was in complete darkness under the covers. One last time I looked out the window the garage appeared to be breathing growing in and out slightly as the window on it shifted from left to right. The garage walls rippled. I watched this in awe for a half hour and eventually returned to my closed eye visuals. The last thought I remember was how we were primitive but how we had the ability to question existence and life itself. And form religions and feel love and hate. I thought of how we always strived for meaning in our life. I saw this as a curse and thought maybe we were the only one of our kind with this burden. Would we be happier in such blissful ignorance. I eventually drifted off to a dreamless sleep (those are the ones I hate).",
  "Needless to say I had a blast. I noticed acid visuals have alot more patterning to it and detail in the visuals. Mushroom visuals are a bit more fluid and things are able to blend together smoothly. Not to say there wasnt any fluid like visuals with acid.</p>"
 ],
 "year": "2006",
 "id": "62533",
 "gender": "Male",
 "views": "4928",
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 2:00",
   "amount": "0.5 tablets",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 3:00",
   "amount": "1 tablet",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 0:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2007-12-06T08:00:00.000Z"
}
