{
 "title": "Apathetic 9-11",
 "author": "Jayne",
 "citation": " Jayne. \"Apathetic 9-11: experience with Risperidone (ID 62573)\". Erowid.org. Nov 2, 2007. erowid.org/exp/62573",
 "substance": "Risperidone",
 "bodyweight": "115 lb",
 "report": "<p>I used to have nightmares every night, without fail, really awful ones. My psychiatrist assured me they would subside due to my new regimen of trazodone, but they never did. He decided to prescribe me Risperdol. I felt a bit awkward, like he was implying that I was psychotic. But it was worth a shot to get rid of these horrible nightmares.</p><p>My first dose was taken September 11, 2001. I rushed to take the 3mgs in the morning, as I was late for school. My mom drove me that day, I felt nothing yet. About 15 minutes into our travel we heard it on the radio, a plane had crashed into the world trade center. I was in awe. Still nothing yet. I got to school, no one had heard yet but me. I was the only one who had had a chance to learn of the incident on the radio. I was the only one who wasn't in class when it happened. I went to my first class, current events. I was feeling a bit dizzy by this point. I told them what happened. My teacher hardly believed me, he thought I must have misheard. He excused himself, and about 10 minutes later someone came in and told us all to come to the lounge to watch what was happening on the TV.</p><p>By this point I was really feeling detached. I was very drowsy, it was hard to move my limbs. All of me felt heavy. I went into the lounge and slumped onto one of the couches, but I wasn't paying much attention to the destruction on the TV. Instead I was blankly looking around at everyone's expressions. Their reactions seemed almost inappropriate. It was as if my brain had plateaued at a state of apathy. Another plane hit. I watched.</p><p>After a few more minutes it was hard to keep my eyes open. Everyone's voices sounded like I was hearing them from underwater. But then it happened, a huge explosion in the distance, everyone went silent. The ground shook under our feet. My school was only a few miles from the Pentagon. They gasped, they screamed, they cried, they had loved ones there. I watched. My brain wasn't computing the disaster around me. I was confused. It took me a minute to realize the explosion had anything to do with what was happening on TV, and when I did, it still didn't matter. Their despair was unsettling, but not in the way you'd think. It was almost irritating. I got too uncomfortable and decided to get up and walk down the hall to another classroom.</p><p>The hallway seemed long and the lights bright. My body was even heavier than before. I found one of my friends in another classroom. I knew I should ask her if she was okay, but my face felt tight, and it was hard to get the words out. I finally choked it out, she responded but it was unexplainably hard to concentrate on what she was saying. The words didn't seem to fit together, it was nonsense. I sat down on a desk next to her, but I started to feel uncomfortable in that room too. Nowhere I went was the right place to be. I told her I would be right back, that I was going to get some water. I squinted at the brightness of the hallway as I walked toward the fountain, only I went right past it into another classroom. I was disconcertingly confused.</p><p>I sat down and put my head down. I think I fell asleep for a minute until a few people came in exchanging opinions of what had happened. It didn't make sense. I decided it was mind over matter, if I could just concentrate I could understand what they were saying. I tried, but I couldn't seem to stay conscious anymore. I was drooling and gripping the desk.</p><p>Everything after that is a blur. I was a zombie. Everyone left, a teacher came in to tell me my mom was coming to pick me up. It took her almost four hours to get there through all the traffic. Finally I got home and slept the rest of the day and night. I stopped taking the Risperdol.</p>",
 "year": "2001",
 "id": "62573",
 "gender": "Female",
 "timestamp": "2007-11-02T07:00:00.000Z",
 "views": "21389",
 "dose": [
  {
   "time": "0",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "Pharms - Risperidone",
   "form": "(pill / tablet)"
  }
 ]
}
