{
 "title": "Refreshing Enhancement",
 "author": "Zero Dogma",
 "citation": " Zero Dogma. \"Refreshing Enhancement: experience with Piperazines - pFPP (ID 62575)\". Erowid.org. Jun 24, 2007. erowid.org/exp/62575",
 "substance": "Piperazines - pFPP",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 1:58",
   "50 mg",
   "oral",
   "Piperazines - pFPP",
   "",
   " T+ 19:30",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>On me and my girls anniversary we decided to give pure pfpp a try by it self. </p><p>9:00pm- reefer in a backwoods is smoked nice little blunt!</p><p>9:15pm- we intertwine while trance dancing and get our blood pumping</p><p>9:30pm- mutual massages lead to sexual ecstasy</p><p>10:00pm- we exchange brief energetic healings and perform a  meditative energetic separation</p><p>10:58pm- I take 50mg pfpp she takes 30mg</p><p>11:30pm- we meditate more and do some self acupressure massage</p><p>12:00am - begin to feel strong effects- cerebral stimulation, dilated pupils, wonderful skin chills and tingles.</p><p>12:30am- tripping but different feels like someone figured out a way to make acid out of some beautiful green plant.  Both of us have permasmiles grinning from ear to ear.  My head feels like cool minty water is flowing through it wow  so does my body. </p><p>3:30pm- no side effects no discomfort just a clean tripping  feeling that I feel fully in every pore of my body. Dancing is very very fun like a familiar ally</p><p>4:10pm both of us are tiring but permasmiles remain we agree  that we feel happier and less 'spun' than on acid </p><p>4:20pm smoke another blunt mmm honey berry</p><p>4:30pm- put on Pink floyd pulse dvd and lay in bed and slowly drift off</p>",
 "year": "2007",
 "id": "62575",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-24T07:00:00.000Z",
 "views": "13908",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
