{
 "id": 6259,
 "title": "Weird Stuff",
 "date": {
  "submission": "2004-10-21T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Andy",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 leaves",
   "administration": "oral",
   "substance": "Datura",
   "form": "(leaves)"
  }
 ],
 "report": [
  "It was about two summers ago and my brother wanted to go to a local park, which also has a massive garden with all kinds of plants. I was feeling pretty good and needed something to do anyway so I took him to the park. We got there and I just sat there enjoying the day while he played on the playgroud equipment. I asked him if he wanted something to drink and he said yes so I went over to the vending machine place and got us some sodas. Walking back to the playground I was looking at different plants along the way. I saw two small tree-ish plants with flowers hanging off of them. I though to myself 'Damn that looks like datura' upon closer inspection I found a tag on the tree and it was indeed two dautura plants in large pots just growing there beside the building. I had read about datura several times and thought it would be nice to try a low dose. So I pulled off two leafs and headed back to the playground. When we were about to leave I injested the leafs, on an empty stomach.",
  "Before we even got back home I felt a little different. About 30 mins after I got home I knew it worked for sure. Poeple say that they feel totally normal when on datura or other deleriants but I can deffinately tell. It is extreemly hard to explain but the feeling is distinct for me, two things I got was cottonmouth and dizzieness It made me sort of drowsy so I decided that I would lay down. After this I pretty much lost track of time and dont remember a whole lot but I can explain the highlights. After laying there for not too long I started to drift in and out of conciousness. So I decided to get up and walk around to wake myself up then layed back down and closed my eyes. This is where weird stuff started to happen. First I would just hear somebody talking to me and I would talk back for a while (not even thinking it odd that somebody was talking to me when i was all alone). Then i would open my eyes and nobody would be there. This happened ALOT and it was sort of discouraging. I talked like this to people for what must have been 3 hours or so. I never once SAW one just talked and when I went to look at them they were not there.",
  "One other incident that stands out in my mind was the phone was rining. I told one of my friends who I currently thought I was talking to to get it because I was kind of messed up. Then I opened my eyes and he wasnt there. By this time it rang about 5 times or so and I thought I better run and get it. But when I picked up the phone it was just a dial tone and the caller ID revealed nobody even called! Anyway after that I decided it was time to go to sleep. There was one major after affect. My close up vision was REALLY blurry for about 3 or 4 days after the experience. I couldn't read or anything.",
  "Overall not a bad experience, but not a good one either the constant auditory hallucinations were very annoying and discouraging to me. This was my first and last experience with datura but I don't regret using it at all."
 ],
 "erowid": {
  "id": "37599",
  "citation": " Andy. \"Weird Stuff: experience with Datura (ID 37599)\". Erowid.org. Oct 21, 2004. erowid.org/exp/37599",
  "substance": "Datura",
  "views": "9407"
 }
}
