{
 "title": "A Godsend for Withdrawal",
 "author": "Neuro",
 "citation": " Neuro. \"A Godsend for Withdrawal: experience with Bupropion (Wellbutrin) (ID 62615)\". Erowid.org. Jun 27, 2007. erowid.org/exp/62615",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  " repeated",
  "",
  "Methamphetamine",
  "",
  "",
  " repeated",
  "oral",
  "Pharms - Bupropion",
  "(daily)"
 ],
 "report": "<p>I used Methamphetamine for roughly one and a half years almost daily from early 2005 to late 2006.  It is the only drug I have ever been able to use that actually increased my productivity in life, rather than just making me a drug-addled mess.  However, inevitably I came to the point in my life that it was time to put down the substance, and I braced myself for the fall.  (Perhaps 'plummet' is a better word.)</p><p>Before I continue, I would like to note that after having used the drug for several months, I seemed to have a strange sensitivity to serotonergic -related substances.  For example, taking the serotonin precursor 5-Hydroxytryptophan resulted in considerable anxiety and overall reduction to my sense of well-being.  Later, after about eight months of Meth usage, I took MDMA.  While years before I had reveled in the euphoria of Ecstasy, this time I felt a nearly incapacitating sense of anxiety and tension.  It was almost unbearably overwhelming.</p><p>After putting down the speed for good, I tried several different medications - all with horrid consequences.  I tried amitriptyline, probably the least injurious of the medicines, but also entirely ineffective and making me prone to sleep for days on end.  I tried Paxil and Zoloft - Selective Serotonin Reuptake Inhibitors - and felt nothing but immeasurable anxiety the likes of which I would have liked to tear out of my skin to escape the horror of it.  It took all of my will to avoid the inclination to commit suicide that these drugs induced.  Also, I took Xanax, a benzodiazepine anxiolytic.  This drug, while helping with anxiety, also yielded a strange and rare paradoxical affect on me, resulting in unbridled aggression and fits of anger.</p><p>After going through this living hell for several months, I had finally had enough.  I told my doctor that if I were to try anything else, it was going to be Bupropion (Wellbutrin).  He remarked, 'Wellbutrin might actually be a good choice...' which brought me to question why he had not suggested it prior.</p><p>Wellbutrin has been an absolute Godsend to me.  I cannot tell you how much it has helped!  My anxiety is gone, I can focus and concentrate, my ADD is under control, my depression has vanished, my ambition is restored, even my sleep patterns have tended back to the normal circadian rhythm of a human being.</p>",
 "year": "2007",
 "id": "62615",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-27T07:00:00.000Z",
 "views": "19864",
 "dose": {}
}
