{
 "title": "Seeing the Future, Horny, Then Crying, Odd Night",
 "author": "Jelly on white bread",
 "citation": " Jelly on white bread. \"Seeing the Future, Horny, Then Crying, Odd Night: experience with Mushrooms & DXM (with CPM) (ID 62624)\". Erowid.org. May 1, 2007. erowid.org/exp/62624",
 "substance": "Mushrooms & DXM (with CPM)",
 "bodyweight": "140 lb",
 "header": [
  "DOSE: T+ 0:00",
  "2.4 g",
  "oral",
  "Mushrooms",
  "(tea)",
  " T+ 0:30",
  "120 mg",
  "oral",
  "DXM",
  "(pill / tablet)",
  " T+ 0:45",
  "60 mg",
  "oral",
  "DXM",
  "(pill / tablet)"
 ],
 "report": "<p>I was bored the day I got back to Wilmington after winterbreak, and it was only 6 o clock and I was restless.  I weigh out 2.4 grams and proceed to make several tea infusions because it tends to decrease the nausea.  I ate a small meal before hand.  All of these things happened, but the chronology of certain events may be a little off.  This is long but in depth and worth reading.</p><p>6:30  Some of the shroom juice and shrooms boiled out in the microwave.  I wasnt feeling any signs of onset, and Im a lightweight and they normally hit me around this time, so I was worried maybe I messed up the tea somehow.  I go into my room and pop 4 coricidin (been a year since last ccc trip) just to make sure I got some effects.\r[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]</p><p>6:45: Pop 2 more coricidin, like a dumbass, because Im not feeling it.</p><p>6:50  Maybe I was wrong, the shroom taste is in my mouth, and my stomach is uneasy, I burp and it tastes like coricidin and shrooms.  Colors are brighter, Im starting to feel a bit fuzzy, concentration is difficult.</p><p>7:00  Normally they come on really slow but Im quite bemushroomed now.  Walls breathing ever so slightly.  My thoughts are racing very fast, and I feel very inspired to write.  I write for most of this trip and have my laptop by my side at all times to take notes. By the end I have 10 single spaced pages, but lots of it is nonsense.</p><p>7:15  Im very intoxicated now. For some reason I keep tripping harder every time I trip, even if I take the same amount each time.  The trips get more intense every time, and I deal with more complicated issues in my life, and experience more painful emotions which is why I eventually quit tripping soon after this experience.  Im starting to realize that this is not at all normal and that maybe I either have a drug problem or Im setting myself up for some other problem.  Lots of people in my family deal with hardcore debilitating OCD, depression, severe anxiety, and paranoia in general.  I run the risk for hppd because my uncle is mildly permafried from acid in the 60s, I think its genetic, not sure, but still hppd is no joke...</p><p>7:25  I have to push these thoughts out of my mind for right now. Im tripping hard also because of those evil cough pills, and Im afraid I can feel my liver bleeding (ha).  I convinced myself that I was permanently in a bad mood before, and I didnt know myself, but now in my shpongled stupor Im over all of that.  Im enjoying the delusions of grandeur I always get on mushrooms. </p><p>I think about my future and I think Ill be famous.  I think about how I want to change the world, and if I really concentrate at being the best I will be, and for my age Im very good.  At some point I just have to stop scratching my balls, and change my life around so that it centers around my work.  I realize that this change needs to happen within the next couple of years, or else Ill lose talent, motivation, and my connection with the younger generation of pseudo intellectuals that Ill be scamming soon. By the time I finish my masterpiece, theyll be idealistic, rebellious and impressionable consumers. Mwahaha, Im so evil.</p><p>7:35  I'm flailing metaphorically trying to find answers, not quite knowing the questions. Maybe the meaning of life? I notice that I am sensitive right now. Im typing furiously with pursed lips putting everything on paper. At moments I feel livid with anger, about things and people I know.  Paranoid about the true nature or authenticity of certain friendships/relationships, suspicious that maybe people think Im stupid, pathetic, gay, or a loser or a jerk, etc.  Its fascinating to go back and see thought loops and the progression of my stream of consciousness.  Its cool to analyze it later, and decide how much mushrooms were making me realize things and how much it just seemed that way.  Sometimes, I have to wait awhile for the current things in my life to blow over before I really get a good perspective on these shroom logs.  As I write all of this Im trying to think about how I could make it easy to understand and useful later, and in retrospect I succeeded.</p><p>7:45  Tunnel vision on comp, small swirls of color. I come up with a title for my novel, Im Saved, and a premise including a very brief outline, and a few symbolic points and themes.  I later decide that the themes have potential but the outline truly sucks, and its currently being neglected on my external harddrive which is as good as the trashcan.  The novel shows cynical but desperate characters who are exploited in parasitic relationships and the role of cult/fundamentalist ideology in placating them.  Its really reflective of my pessimistic mindset at the time, and I also regurgitate plenty of things I learned from my symbolic logic class, and this all feels like the best thing Ive ever written or read.</p><p>Only a few people will truly understand my work but everyone will be able to relate to it. I feel like a genius, and I look into the future and see this novel on shelves, and in interviews Ill be a sarcastic rude asshole. Ill live in seclusion with strange ritualistic habits. Incorporating strange research, and crazy events, some of which i haven't even experienced yet into my memoirs. Planning out things that will probably never happen before they're even close to happening.  Im still nauseous, but I think its the cccs which I can taste in my disgusting burps.  I eat an orange to rid the taste.</p><p>8:00  I lay back on my bed poetically contemplating life, like I was receiving the ultimate enlightenment frying my neurons.  This is getting really fun.  Artifact by Soundtribe Sector 9 is groovin, basslines echo a bit, and I think I imagined electronic drum beats that arent even there or are more intricate than the actual drum beats, I get up and dance which I never do. I start thinking about all of my friends back home, and that I left with one of them on bad terms and I should call them the next day.  </p><p>8:15  Im very emotional right now going back and forth from dulling depression with racing cyclical thoughts, to ecstacy with free flowing thoughts.  Im still writing and I realize that this is all just a coping mechanism.</p><p>8:30  Im horny, but sexually confused.  I cant figure out whether I like guys or girls more. Its been bothering me for awhile. I decide it doesnt matter and masturbate, imagining an orgy, which is not normally unappealing.  Thankfully nobodys home, doors are locked.  Porns at full volume.</p><p>8:50  Wow. Im drained now.  I have the lightheaded feeling where you hold your breath for a long time and stand up.  I think about this girl that I had just fucked in my home town, and about crazy she is, and how much I like her but could never be with her. </p><p>9:00  I didnt even know I was close to crying, but all of a sudden tears burst out, and I think I was crying because I was so confused about life, my relationships with people, and feeling socially inept, but it was random.  It felt therapeutic and orgasmic to cry.  I bawled loudly, really overexaggerating and getting into it like I never have before.  I then realize my strange erratic behavior, and start laughing maniacally still crying a little bit.  </p><p>9:10  The cds skipping, oh. Wait thats trippy.  OH yea, its part of the cd, SS9 was made to trip me out.  That part is awesome, and conveniently marked the end of the peak.  My pupils are massive.</p><p>9:25  I take a long hot shower with buckethead going full blast, I head bang violently and shred my air guitar.  I feel enormous power, and sensations ripple over my skin.  The clump of hairs in the drain are hundreds of microscopic tentacles.</p><p>9:45  Incredibly relaxed after shower.  I get out and find a pack of cigs I forgot about and start chain smoking which feels great.  I play Tony Hawk 3 on mute with buckethead and feel like skating.  I go outside and try to big spin. Nope. Heelflip. No way. I try to no comply impossible and fall on my ass.  Nows not a good time to skate, I cant seem to get into it and Im not coordinated. </p><p>10:00  I go inside and play guitar, inspired by the bucket.  I unleash the same tired thrash riffs I always play and for some reason its just not as gratifying as I thought it would be.  Thoughts are still racing somewhat, but not about all the serious things I was thinking about earlier.  Im happier now, but still have an uneasy feeling in my stomach.</p><p>10:15 Totally shredding guitar hero 2 on expert, no better or worse than usual, just more fun.  Visuals gone. Thoughts slowing down.</p><p>10:35  Im losing interest in guitar hero.  I still write thoughts down whenever I think of something cool, but Im getting tired.  Still residual tripping, but most effects are gone.</p><p>10:50  I feel pretty much baseline, wishing I had weed to bring out effects.  I put on bob Dylan to mellow out. I call my friend who I had left on bad terms, and it was kind of an awkward conversation because I realized I wasnt all there and shouldve called the next day.  We werent even on bad terms I just blew things out of proportion coz I was on shrooms, weve always been best friends.  HA, Im a dumbass.</p><p>11:30  baseline for sure.  I drift off to sleep easily while listening to The Mantle by Agalloch, its so dark and ambient its beautiful. </p><p>Wake up the next morning around 11 and my pupils are still fucked up looking coz of the coricidin.  I feel great, but stupid about the coricidin because I know its bad for you, and did it a lot and told myself Id stop. Play a lot of play guitar hero, eat ramen, unproductive lazy day.</p><p>All in all a very revealing trip, targeted subconscious cynical/unfounded beliefs, and distorted thought processes where I jump to conclusions about what my friends are thinking/feeling.  Emotionally intense.  This is one of my best shroom logs.</p><p>I summarized my negative outlook on the world in a short essay a week later about hamlet basically stating that the point is not that hamlets existentialist views are right or wrong, its that its important to think about these things but if I dwell on it too much I will inherit his dire fate.  If I let these thoughts get me down, my brain will filter out the positives thus I am not thinking with a truly open mind.  Attitude is everything.  If I believe that nothing is changeable or worth changing (I realize these are two different subjects), then thinks wont change.  If I think everything is pointless nothing will have a point, and if I think everything is superficial then I will get no real satisfaction out of anything.  Even real cynics must be pragmatic.</p>",
 "year": "2007",
 "id": "62624",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-01T07:00:00.000Z",
 "views": "23789",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2.4 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "120 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 0:45",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 }
}
