{
 "title": "More Like a Tinnitus Simulator",
 "author": "Sunflower",
 "citation": " Sunflower. \"More Like a Tinnitus Simulator: experience with Device (brainwave entrainment MP3) (ID 62675)\". Erowid.org. Dec 17, 2007. erowid.org/exp/62675",
 "substance": "Device (brainwave entrainment MP3)",
 "bodyweight": "",
 "report": [
  "<p>I'm pretty new to the whole drug culture thing. At only 16 years old, I have very little experience with psychedelics in general.  All I've done before this were two bottles of hard lemonade (I found the buzz to be unpleasant) and have done marijuana twice (Neither time gave me any more than a dry mouth.) I have very little access to any sort of drugs, but over the years I've become insanely curious about them, especially 'trippy' ones like LSD and Salvia. After looking online, I saw reports of brainwave altering, that could potentially have entheogen-like effects. Desparately, I dashed to a search engine, and after a bit of searching, I found a free brainwave generator demo. I fired it up and tried some of the default settings, first to test if this was real or hocus-pocus quackery:",
  "Increased Alertness- Worked a little TOO well. After a very short time I became very nervous and jumpy. I shut it off quickly.",
  "Self-Hypnosis- This one surprised me because of how well it worked. I played it and after five minutes, it became very difficult to keep my eyes open. I felt very relaxed and floaty. It took another ten minutes to force myself awake so I could shut it off and try another one",
  "Creativity Booster- Despite the fact this was very pleasant to listen to, I still have severe writer's block. 'Nuff said.",
  "If I had the money, I would have registered. Some of the fanmade sets had exactly what I was looking for. But I am poor and young, so I left the site.",
  "So after I was done with those, and assured that this brainwave this had at least some validity to them, I went off to find some individual MP3s. Here's what I found:",
  "Coffee replacement- Very nice to listen to. Well arranged with birds chirping in the foreground and the actual sound hidden in the background. About halfway through (the file was 19 minutes long), I felt very happy and alert. This one, indeed, worked, and it worked well.",
  "There was also a website, I don't remember where that had brainwaves set to absolutely gorgeous music. Some interesting things happened, the floating sensation was back from most of them, but the 'spiritual uplifting' they promised wasn't there.",
  "And then, finally, I found it. A 30 minute file labeled LSD simulator. Finally I would have the chance to experience psychedelic effects without jeapordizing friends, family, and of course, my mental health.",
  "Or so I thought...",
  "I booted the file in WMP and put on the heaphones. The sound was loud and grating on my ears, but it was bearable. Five minutes went by, nothing happened. Ten, still nothing. By fifteen I found myself staring thoughtlessly on random objects and snapping back to reality. I felt a small bit of anxiousness, but I think it was just the fact that I was home alone (I'm easily startled). A few times, I thought I had visual distortions. Occasionally there would be a tiny split-second ripple in a pillow beside me, and once I saw an extremely short spin appear in the middle of the printer. However, these effects were so mild that I'm not even sure if it wasn't just my imagination that caused them. At 25 minutes, I gave up and took off the headphones and met an annoying ring in my ears. It was then that I remembered what the label on the file download page had said:",
  "'Doesn't work on everyone'",
  "Damn. It.",
  "Once again I'd aimed for a higher state of mind and failed. It was my one shot at euphoria and I missed again. Needless to say I'm very frustrated.",
  "I guess I'll just have to wait until the Euphio Machine's finally invented...</p>"
 ],
 "year": "2007",
 "id": "62675",
 "gender": "Female",
 "views": "8706",
 "dose": [],
 "submissionDate": "2007-12-17T08:00:00.000Z"
}
