{
 "id": 627,
 "title": "Ferris Wheel - Projector Head",
 "date": {
  "submission": "2004-10-28T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Uncle Vito",
  "gender": "Male",
  "weight": 94
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.0",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "I don't normally work the night shift.  At 0600 in the morning I finally made the commute home, and rolled an entire gram of 5X extract.  It had been a long night - fighting to stay awake, and battling a strong head cold. I stood out on my front porch in the dark (darkness lingers at this northern latitude) accompanied by early morning drizzle and the light of a yellow street lamp.",
  "I lit the rolled cigarette and inhaled deeply two times without effect.  It was rather smooth to inhale actually, which is surprising since I do not smoke at all.  On the third inhalation, the full effect enveloped my entire body.  After the fourth inhalation, further smoking was purely pointless since I seemingly could not achieve increased effect.  I ceremonially puffed it to the end, however. ",
  "The EFFECTS:  The strongest general sensation was a full body experience.  Imagine your arms and legs being the spokes of a wheel, or Ferris Wheel rather, that begins spinning vertically around your center of gravity.  The spinning increases in angular velocity until the illusion of the spokes standing still yet rotating slightly backwards begins. Much like the illusion of spinning spokes on a wheel. That becomes your in-focus, slightly blurred perspective. When you are rotating backwards slightly, you feel PULLED backwards, all visible images seem to be bent in a cirle, vertically around you in line with your spin. My head began to slowly, verrrry slowly, click back like a slide projector in a manner that brought each new thing into view much like a lingering slide show.  This continued until I almost fell backward, and my 46 year old knees buckled a little.  Next I found my bench, was seated, and throughly enjoying it.  At one point I walked around a little, and could feel myself pushing around an enormous package of not-so-numb genitalia, which is something I don't normally think about when I'm routinely walking around. ",
  "I can't say anything profoundly mystical occurred.  My neighbors cat came out to join me, which was odd, but then again he probably doesn't see too many people out at this hour.  Within 20 minutes I was carrying out my routine matters, and went to bed, giggling and told my wife about it.  Later, when I woke up, I had dull pain in my lower back in the liver and kidney area.  This persisted for about 12 hours then cleared up with some non-prescription pain reliever.  - I suspect residue in the extraction procedure.  All in all, it was an astounding experience - yet, I felt no departure from normal cognitive reasoning.  Within 20 minutes the effects diminished to the point where any normal, every day task could be accomplished.",
  "Well, that's my story, hoped you liked it.  I know I did."
 ],
 "erowid": {
  "id": "11518",
  "citation": " Uncle Vito. \"Ferris Wheel - Projector Head: experience with Salvia divinorum (ID 11518)\". Erowid.org. Oct 28, 2004. erowid.org/exp/11518",
  "substance": "Salvia divinorum",
  "views": "5542"
 }
}
