{
 "title": "Insight Through Herbal Exploration",
 "author": "Mish",
 "citation": " Mish. \"Insight Through Herbal Exploration: experience with Cannabis, Mugwort, Lavender, Hops & Rose  (ID 62717)\". Erowid.org. Aug 21, 2009. erowid.org/exp/62717",
 "substance": "Cannabis, Mugwort, Lavender, Hops & Rose ",
 "bodyweight": "200 lb",
 "report": "<p>Before I get started I would like to state that I am currently taking a variety of medications on a daily basis, including Buspar, Adderall XR, and the SSRI anti-depressant Celexa. I highly recommend taking EXTREME caution when experimenting with psychoactives while taking prescription drugs as very little data is available on the risks involved in combining the two. Personally, I have had no adverse reactions from the substances mentioned in this report (or at all for that matter).</p><p>I have been studying the medicinal properties of plants for two years now, and have been experimenting with psychoactives for seven plus years. I have tried smoking a variety of herbal blends and found most of them to be either intolerable taste wise or just plain ineffective. However, there is one herbal blend that not only has a very pleasant taste, but noticeable effects.</p><p>The recipe includes equal parts of cannabis, mugwort, hops, lavender flowers, and rose petals.  The blend is light and fluffy, with a lightly sweet taste. Also, it smokes beautifully.</p><p>The experience is a bit like an absinthe and cannabis (obviously) high, only without overwhelming effects of strong liquor tied in with it. I suppose that makes sense considering mugwort and wormwood are in the same family.  Smoking smaller amounts make the blend ideal for meditation and artistic inspiration, while smoking larger amounts tends to bring about sedation. Typically, I smoke one or two 1 gram bowls out of a glass pipe, but I imagine using a bong would produce a more powerful reaction.</p><p>I would also like to note that I tend to have some amazing dreams after smoking these herbs together. For those who are into lucid dreams but do not want to smoke plant material, I recommend placing the herbs in a pouch (minus the cannabis) and placing them under your pillow.</p>",
 "year": "2007",
 "id": "62717",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-08-21T07:00:00.000Z",
 "views": "9045",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Mugwort",
   "form": "(dried)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Hops",
   "form": "(dried)"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Lavandula spp.",
   "form": "(dried)"
  },
  "4": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Buspirone",
   "form": "(daily)"
  },
  "5": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "3C-B",
   "form": "(daily)"
  },
  "6": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Citalopram",
   "form": "(daily)"
  }
 }
}
