{
 "title": "Transferring Images into Sound",
 "author": "Brack",
 "citation": " Brack. \"Transferring Images into Sound: experience with 2C-B (ID 62724)\". Erowid.org. May 11, 2007. erowid.org/exp/62724",
 "substance": "2C-B",
 "bodyweight": "200 lb",
 "header": [
  "DOSE:",
  "15 mg",
  "oral",
  "2C-B",
  "(pill / tablet)"
 ],
 "report": "<p>Interesting night proceeded after I dropped this little gem. At around 1 in the morning, I popped this pill into my mouth and waited for the effects. They were really slow coming on at first. Took close to about an hour to start seeing any visuals. Most of it was just general shifting in the patterns along the floor. The visuals really took off after the first initial hour of the onset. That was pretty much the only thing I was experiencing. I was with a few friends and watching a couple of infomercials late on TV. Considering how boring infomercials really are, we were having a good time, with one other person under the influence of this drug, and a sober friend of mine.</p><p>There was lots of giggling to be involved, lots of confusion and major patterns shifting. Most objects that didn't have any sense of energy coming off them directly melted into tables, or other surfaces around the area. Anything that was alive like my friends, or the nearby cat that was sleeping had ripples of extra movement all over their bodies. It was quite interesting. At certain points, the hallucinatory properties got so intense, that I was getting a very convex way of seeing things. Everything got so distorted from the bottom and became larger on top. Kinda like Tim Burton's usual visualizations. Everybody went to bed around 6 or so, which left me still tripping balls. I couldn't sleep, and kept on having these really complex thoughts which involved infinite patterns in closed eye visuals linking up with sound, color and numbers. Couldn't believe what I was thinking, and everytime I started to overwhelm my brain with thoughts, I would all of a sudden start thinking in gibberish.</p><p>Around 9, I knew I had pretty much come down almost all the way, but I was still seeing minor pattern shifting around. The open eye visuals lasted for another three or so hours, and subsided. All in all... not bad for a first time. Had the pleasant effects of acid, but was kinda displeased that nothing jumped out at me like acid had in its properties. I'd deffinitely do it again. Just to mellow out.</p>",
 "year": "2007",
 "id": "62724",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-11T07:00:00.000Z",
 "views": "4618",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "(pill / tablet)"
  }
 }
}
