{
 "id": 6279,
 "title": "No Great Empathogenic Breakthroughs",
 "date": {
  "submission": "2004-10-22T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "D",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "10",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Escitalopram",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "tablet"
   },
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "First off, lemme describe myself and my state of mind during the experience. I'm a semi-healthy 19 year old male; highly intelligent in a very abstract, logical way. I've been intoxicated on a plethora of substances, controlled and uncontrolled ranging from mushies to coke to opiates to amphetamines.. etc.. the list continues... I am a daily cannabis and tobacco smoker, and have been for about a year prior to this experience.",
  "I have been on Lexapro 10mg/day for about 3-4 weeks prior to this experience, which shaped my reaction to it.",
  "First and foremost, the ecstasy experience was not 'magical' or anything like that, it was very mild. I felt minor euphoria, had minor visual activity (shifting in patterns, morphing of textures) and very little mental activity. Hell, because of the SSRI state of mind, which I'd describe as 'anti-depressed' (not happy but not depressed, a limbo state with minimal emotions), the ecstasy experience was far below stellar. This was my only time rolling, but my friends I was with were having a great time whereas I was only slightly off baseline. And within 5-6 hours after dosing I felt 'normal' in all regards. I get more of an effect from cocaine or 'uppers' in general.",
  "Sadly, this reaction was expected. From what I understand of the literature, SSRIs work by essentially saturating your system with serotonin, none of it gets reabsorbed by the neurons - it just floats around in the intersynaptic gap. MDMA, on the other hand, causes a large rush of serotonin. SSRIs will essentially 'normalize' this serotonin explosion, thereby attenuating all the reported amazing effects of MDMA. Like I said above, it felt a little bit speedy with a *very* slight twinge of psychedelia. Nothing to write home about.",
  "So, bottom line, SSRI + MDMA = reduced experience. No great empathogenic breakthroughs or any good shit like that, just minor speedy effects really."
 ],
 "erowid": {
  "id": "37650",
  "citation": " D. \"No Great Empathogenic Breakthroughs: experience with Escitalprolam & MDMA (Ecstasy) (ID 37650)\". Erowid.org. Oct 22, 2004. erowid.org/exp/37650",
  "substance": "Escitalprolam & MDMA (Ecstasy)",
  "views": "19546"
 }
}
