{
 "title": "Beautiful, Beautiful Fish",
 "author": "Plush Cthulhu",
 "citation": " Plush Cthulhu. \"Beautiful, Beautiful Fish: experience with Ayahuasca (ID 62807)\". Erowid.org. Jan 28, 2008. erowid.org/exp/62807",
 "substance": "Ayahuasca",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Ayahuasca",
   "(tea)"
  ]
 ],
 "report": "<p>I can't remember where I first heard of ayahuasca. By the time I tried it for the first time, I thought of it as a substance that one did not deal with lightly. My first time taking it, while not bad, definitely confirmed this feeling. I had tried mushrooms, acid, 2CB, and morning glory seeds by the time I tried ayahuasca, but it was definitely in a different league from those.</p><p>A friend of mine mentioned that he and a two other mutual acquaintances were planning on taking it, so I asked if I could join in. They said it was okay, and so one night about a week later we met at his house. We brewed up the ayahuasca on his stove, it might have been around 40 to 50 grams each of Syrian Rue and Mimosa Hostilis, along with some vitamin C pills.</p><p>It took a long time to get the tea brewed up. We didn't actually drink it until around 1:30 in the morning. By this point we had moved down to my friend's basement. Being one of the heavier members of the group, I got one of the larger glasses. It tasted absolutely disgusting, like mud but with a sickly, acidic aftertaste that probably came from the vitamin C. We drank very slowly. Two of our party threw up. I wasn't one of them, though I did get pretty sick to my stomach. Hearing the others vomit made me very uncomfortable. I remember staggering to the bathroom and staring into the mirror, which was already distorting noticeably.</p><p>Things started off pretty rough. The walls were moving, and one of them appeared particularly sinister, to the point that I became convinced that it was trying to kill me. I kept hearing the sounds of my friends vomiting over and over in my head. When I closed my eyes my visual field was covered by an oriental rug pattern, and from there I embarked on a brief fantasy about the Arabian Nights. When I opened my eyes a few minutes later, I was feeling much better.</p><p>At this point I realized that the bucket of vomit could be a kitten if it wanted to, and that this made things alright. I started thinking of everything, including inanimate objects, as having its own will, which it could exercise freely. I befriended the wall that had previously appeared threatening, and another wall perpendicular to it. At this point I realized that my hands wanted to be beautiful, beautiful fish, and so I allowed them to be. Then I went upstairs and called another friend of mine, and left a message on his phone telling him that my hands were beautiful, beautiful fish.</p><p>I got an intense feeling of ego death as I returned to the basement. I simply wasn't me anymore. In one of my most vivid visions, I realized that I was a nineteenth century English schoolgirl. Time slowed down noticeably, such that I would look at my watch after what had felt like nearly an hour, and find that only five or ten minutes had passed. I saw cloudy gray wisps on the walls that resolved into elaborate geometric patterns. At one point I became obsessed with remembering the name another friend (unrelated to this experience) had kept repeating while tripping on mushrooms about a year earlier. When I finally remembered it, I yelled it out triumphantly, frightening and annoying my compatriots.</p><p>I started coming down a bit before five in the morning, and staggered home a little after five. Even at this point I was still getting visuals as strong as a moderate acid trip, particularly light trails. The act of walking had become very complicated and difficult. By the time I got home the visuals had tapered off a bit, but when I got to sleep at around six AM I was still feeling far from normal.</p><p>The experience wasn't exactly good or bad, as a whole, but rather really, really strange. It is as of this time still the hardest I have ever tripped.</p>",
 "year": "2006",
 "id": "62807",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-28T08:00:00.000Z",
 "views": "3077"
}
