{
 "title": "A Note From Someone Who Works on AC Units",
 "author": "Smoke",
 "citation": " Smoke. \"A Note From Someone Who Works on AC Units: experience with Inhalants: Freon (ID 6281)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6281",
 "substance": "Inhalants: Freon",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "inhaled",
   "Inhalants",
   "(liquid)"
  ]
 ],
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I guess ill start off with some backround info...</p><p>My grandpa owns an air conditioning repair place. Its basically a family business. Ive worked there, and my cousin used to work there. I worked on a/c units for a few years (illegally though, I was only 18 and didnt even have a license).</p><p>While I worked there a few friends of mine kept trying to get me to try huffing freon since I had access to mass quantities of it. They also tried to get me to hook them up with it. I always harshly turned them down, because I know how dangerous this shit is. It says right on the box in big letters that inhaling it can and will make your heart stop, among other bad things. But you guys are probably aware of this, so ill go on with my story...</p><p>One morning in 1998 I woke up to a phone ringing. It was my grandpa, and he was sobbing. He told me to wake up my parents and come to 'the shop' quick. I hauled ass over there to find an ambulance in the parking lot, along with a bunch of cops. My cousin (who was working there) had been huffing freon (r-22, if that matters) from a trash bag and had passed out into the bag. There was a small amount of liquid freon in the bottom of the bag. Needless to say, his lungs were practically destroyed and he had been dead for a while.</p><p>I guess what im trying to say is do not do this shit!!!! Ive messed with inhalants before and I know how cool they can be, but damn, dont huff freon. When you get it out of someone's a/c, think about it. Youre not even getting quality freon. It has probably been in the unit for at least 5 years; during that time it absorbs oil from the compressor, chemicals from the welds in the freon lines, and other shit like that. Freon is a tasteless, odorless chemical. The 'honey' taste ive heard described is the impurities in it from the machine its been in. And if the compressor is going out or electrically shorting from age, you might be getting burnt freon. Once when changing out an old unit that had some in it, I had on a mask (of course) and let a blast of this stuff out on a nearby anthill. The ants immediately stopped moving, dead. This is nasty shit.</p><p>Anyway, if you wanna get high, inhalants are a dumb way to do it. Just smoke some weed or sniff some coke or something. If you like inhalants that much, stick to the tamer ones like whippits or something. Freon is just about the most dangerous one you can do, especially if you are getting it out of an a/c unit. Theyre trying to get rid of freon altogether because of what it does to the atmosphere; just think about what it does to your lungs and brain. Peace.</p><p>I miss my cousin</p>",
 "year": "1998",
 "id": "6281",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-18T08:00:00.000Z",
 "views": "31988",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(liquid)"
  }
 ]
}
