{
 "title": "Nice and Mellow",
 "author": "Psychedelic chick",
 "citation": " Psychedelic chick. \"Nice and Mellow: experience with Morning Glory Seeds (Heavenly Blue) & Cannabis (ID 6289)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6289",
 "substance": "Morning Glory Seeds (Heavenly Blue) & Cannabis",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "500 seeds",
   "oral",
   "Morning Glory",
   "",
   " T+ 1:30",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I am here to talk to you about my strange (but interesting) first time experience with morning glory seeds.</p><p>Let me start by giving you some background information: I had a friend over, we'll call him Trevor for supper and a movie. We were only going to smoke a few bowls of marijuana to get mellow. However, since my parents (unexpectedly) went out for supper, I suggested we try some morning glory seed tea that I had brewed and left to sit in my refrigerator for a week. (Interesting fact: a food blender is great for grinding up the little bastards and getting out the LSA).</p><p>I have always been weary to try synthesized psychedelic drugs (such as LSD) for fear of not getting exactly what I paid for. But morning glory seeds seemed pretty harmless, being all natural (and not to mention legal!).</p><p>I have never had what I'd call a 'visual hallucination' before this experience. Even though I am a slim, 16 year old girl, my tolerance to psychedelics is higher than most people of my stature; I had been disappointed that after ingesting two grams of magic mushrooms, I experienced only a giggle fit and (slightly) heightened physical sensations. I hoped that morning glory seeds would be different.</p><p>6:45- I prepare tacos, Trevor eats tacos, I eat many tacos. (this may have something to do with the LSA not kicking in as fast as I'd hoped)</p><p>7:00- We drink the morning glory tea, and no, it doesn't taste THAT bad. (If you think that's bad, try nutmeg!!)</p><p>8:30- We smoke a few bowls (away from parents) and get nice & mellow. I put in the REF. The pot did what it always does, I felt relaxed and just sat back to watch the movie. Nothing from the morning glory seeds, we are rather disappointed. We figure that this is it, a failed experience.</p><p>11:00- Trevor leaves. :-(</p><p>11:30- I decide to watch a movie. I start to watch the movie and notice that the lights are unusually bright and shifty. I dismiss it as an after-effect of the weed, which had worn off an hour ago.</p><p>12:00- I am getting into the movie and noticing how strange the plotline is. I am beginning to feel strange, the experience is too strange to convey to you fully, but I will try my best. First, I close my eyes and suddenly feel like I am swinging back and forth, closer and further to my television. So, I open my eyes and am temporarily disoriented.</p><p>12:15- The movie is getting even stranger (to me, at least), so I turn over on the couch and close my heavy eyelids. All of a sudden, I see that I am floating over a bridge surrounded by red water. An experience such as this one was very alien to me, so I opened my eyes and continued to watch the movie.</p><p>12:30- I am VERY hungry (thank you Mary Jane) so I get up and make my way up to the kitchen. I remember thinking: 'I am fine, I am not that high! I can handle myself'. Well, after spending some time opening a pizza pocket and putting it in the microwave, I went to the fridge to get some juice. Next, I could have sworn that someone walked up next to the fridge and asked me what was going on. I looked over and said 'HUH?' very loudly. It was dark, but after looking around for a few minutes, I concluded that I had imagined the whole thing and that there was no one there. Uh-oh.</p><p>12:33- Suddenly, when I looked at the cupboard door, it was different. I wont say it looked like it was melting, because it would have been being pulled towards the ground. The cupboard door was being pulled in every direction, moulded like silly putty.</p><p>1:30- I am tired and decide to go to bed. Once in my totally dark room under the covers, I close my eyes only to see a troll. I sensed that this troll was trying to frighten me. It made 'scary' faces and such. I laughed out loud at this meager attempt to frighten me. (Was this a 'bad' trip?) The troll appeared insulted and disappeared.</p><p>1:45- Zzzzzz.</p><p>In conclusion, the experience was very enlightening as to what lysergic acid compounds are all about. Though I've never tried it, I've heard that LSD is a great deal more potent than LSA. But this was a good prelude to LSD and any other strong psychedelics I might try in the future.</p>",
 "year": "2001",
 "id": "6289",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-02-18T08:00:00.000Z",
 "views": "9890"
}
