{
 "id": 629,
 "title": "Best Time of My Life",
 "date": {
  "submission": "2003-04-23T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Shorty",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>It was summer and me and my friend (which I will just call Ray) had gone to Minnesota to our cabin with my family. We had brought some Lsd and Cannibus with us to make the trip a little more fun.",
  "It was the first night we were there and we had bought a energy drink called Venom which contained a high percent of citric acid because we had heard from a friend that citric acid will inhance the trip of lsd. We took our doses at about 9:00 and already started feeling gigglely and seeing trails. Soon after that we went to our cabin and drank our energy drinks. We grabbed my cd player and my cds and headed down to the lake. When we got down to the lake ,it pitch black with no moon but you could see every star in the sky including some Northern Lights off in the distance to our right.We grabbed some lounge chairs and sat on the dock looking at the sky. It was about 11:00 and we turned on some Mindless Self Indulgence and Ray pulled out a joint. We smoked the joint and the sky started gettin blurry and all the stars started producing trails.",
  "Soon we started trippin hardcore and continued to smoke a couple bowls and every time I looked back a Ray he turned into somebody I knew but I just didnt know who they were. I looked up at the stars and they looked as if they were fallin but never hit the ground and the waves of lake looked like there was a strobe light reflcting of them. The stars where still spinning and moving when at 12:35 i looked at my watch and I got hit with an intense amount of feelin and started talking but no words would come out. The stars started spinnin really fast and kept spinning until they had turned in to a lazer show which moved on to a tunnel that kept moving forward and looked like i was movng closer to it and i coulnt look away. All these clown faces started fallin out of the tunnel in the sky and hit the water ,and the waves from these faces came toward me and when they hit he dock I fell out of my chair and couldnt move. I and watched Ray  for a long time as he gazed up at the stars.",
  "Then i couldnt handle it and got up and turned the music off. Ray stood up and grabbed me and shook me and said to stop yelling when i was sayin nothing at all. I picked up the cd player and we started walking back to our cabin. I looked at my watch and it was 1:45 when we reached the hill we had to climb up to get to our small about 10x10 cabin. We were walkin up the hill through the dark which what had seemed to be at least an hour which it should of tookin 5 minutes. I sat down and waited for Ray to catch up I  look at my watch  and it had been 3 min. I asked Ray if he thought we were goin the right way because i thought it had been so long and he said ya. I stood up and looked at the ground and continued walkin up the hill and i wasnt moving at all and looked up and i was at the top and could see out cabin. The light outside the cabin was puttin off sound that sounded like a insect and we stepped inside and th sound stop.",
  "Ray turned on a movie and I ignored it and looked over and at it and some girl came out of a miiror and killed another and i freaked out and shut it off. I couldnt handle any sound or movements and my friend tried calming me and saying just wait you will reach your peak. It was helping me but i coulnt look at him any longer because he had four eyes. We both sat there in silence for what seemed a long time. Then i started coming down and could handle music so we turned on some techno and grabbed 2 flashed lights and waved then over our heads untill i felt like i couldnt see any more. I layed down and closed my eyes and i got a huge amount of visuals of colors and shadows. i opened my eyes again and it was morning .I had fell asleep and continued to trip in my dream or unconcius mind. That is the description of the best time of my life. Since then i have never tripped as hard and i havent drank anything or took anything that involved citric acid, so I think the citric acid definitly inhanced my trip.</p>"
 ],
 "erowid": {
  "id": "11524",
  "citation": " Shorty. \"Best Time of My Life: experience with LSD & Cannabis (ID 11524)\". Erowid.org. Apr 23, 2003. erowid.org/exp/11524",
  "substance": "LSD & Cannabis",
  "views": "9300"
 }
}
