{
 "title": "My New Love",
 "author": "Kratom",
 "citation": " Kratom. \"My New Love: experience with Kratom (Mitrogyna Speciosa) (ID 62926)\". Erowid.org. Jun 10, 2008. erowid.org/exp/62926",
 "substance": "Kratom (Mitrogyna Speciosa)",
 "bodyweight": "206 lb",
 "report": "<p>This is my first time entering a report on here.  I will try to explain the effects of Kratom to the best of my ability.  I have been reading other reports on here about Kratom, and there are more negative ones than positive.  I am writing here to give to an all positive report. </p><p>I drink Kratom fairly regularly, (3+ times a week) and I notice no tolerance to it.  It actually has displayed to me 'anti-tolerance' qualities, meaning the more often I use it, the more Kratom likes me.</p><p>5:00PM - I begin boiling water in a regular size pot.  I place 5 grams of dried Thai Kratom into the bottom of a 20oz heavy plastic cup (I like my Kratom drinks tall).  After the water is at a full, rolling boil, I slowly pour the water over the dry Kratom in the bottom of the glass.  This will yield a floaty-looking cup of leafy wet material.  Don't fret, it will sink to the bottom.  I stir the tea vigorously for about a minute.</p><p>5:20PM - The leafy matter has sunken to the bottom of the glass, and the tea has taken a wonderful amber brown hue.  It is ready for sipping at this point.  I feel the initial effects after 3 or 4 sips.  It acts fast.  I boil more water.</p><p>5:45pm - I have finished my first glass.  I don't drink the leafy matter in the bottom.  The next pot of water is ready.  I put 2-4 more grams in the glass on top of the old stuff.  I again pour more boiling water over the Kratom.  Stir vigorously as before, it should settle faster this time.  I feel very good and 'toasty' at this time.  The relaxing feelings that come very fast are setting in very well.</p><p>6:30 PM - The opiate effects are getting a lot stronger.  I feel very euphoric, and am developing an enormous sense of well being.  It just keeps getting better.  I become more talkative to my roommate.  I am on to my third cup.</p><p>6:50pm - I am halfway through my third cup.  In addition to the relaxation and feelings of well being, I am starting to feel quite stimulated.  I get up to tidy up a bit.  I feel very social.  I am a MJ user, every day, and I tend to get rather quiet when I use it.  Kratom is a very social drink.  I only wish we could rid ourselves of alcohol and drink this socially in bars.</p><p>As you can see, the effects of Kratom are very fast acting.  I am a regular user, and I prefer making it into tea.  The variety that I get regularly has a wonderful roasted taste, and a numbing effect on the mouth and throat.  There is a bitterness to it, which I have read lots of complaints about the taste, but the nummy takes the bitter away.  I add no sugar of honey.  If you REALLY don't like the taste, put a little peppermint or chamomile in the the cup along with the Kratoms. </p><p>I have noticed that Kratom has wonderful anti-anxiety, anti-depressant, painkilling, diuretic, prolonged sexual intercourse, and even nasal decongestant qualities.  It is my cure all.  I have noticed no detrimental effects from drinking it, and at any quantity.  My body seems to tell me that I have had all I need, once I have reached an awesome plateau of good feelings.</p><p>I have also noticed potentially awesome synergetic qualities in Kratom.  Kratom potentiates other substances I've noticed.  I have eaten some quality ecstasy and drank Kratom at the same time, and the Kratom keeps up with the X.</p><p>I wish I could go on, but I feel as if there might be a more appropriate place to post all of my findings on Kratom.  I also have some cultivation info, and there is not much information on that anywhere in the net.</p>",
 "year": "2007",
 "id": "62926",
 "gender": "Male",
 "timestamp": "2008-06-10T07:00:00.000Z",
 "views": "16612",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "20 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  }
 ]
}
