{
 "title": "My Car is a Junker?",
 "author": "Jewjitsu",
 "citation": " Jewjitsu. \"My Car is a Junker?: experience with Diphenhydramine (Benedryl) (ID 62942)\". Erowid.org. Oct 18, 2009. erowid.org/exp/62942",
 "substance": "Diphenhydramine (Benedryl)",
 "bodyweight": "160 lb",
 "report": "<p>It was November of 2005, and I had just begun my 6 month probation for possession of marijuana-under 2 ounces here in the great fascist state of Texas. I was looking for other, slightly more legal substances to lose my head with. Dex was getting old and Dramamine never really worked for me. But one day I was surfing the pages of totse.com and came across several reports of using just regular Benedryl to trip balls. 'Wow,' I thought. 'First cough medicine, now this?'</p><p>I had to work later that night, so I went to the grocery store and bought a bottle of the fuckers. I worked for Domino's, so the fact that I was a drug-user was less than exciting to these people. I popped about 30 pills on one of my deliveries and waited. It was one of the biggest mistakes I have ever made, and I fortunately realize now that it could have been my last.</p><p>It was a Saturday night and I had to close. At about 10 pm the trip just washes over me. My skin turned red, like I was blushing. We had closed the front end and I was helping to clean it. As I was sweeping, I swear I heard Billy say, 'So what's going on down in ratchet-town?'</p><p>I turned to him and said, 'What?' probably a little louder than necessary. He looked up at me and said, 'I didn't say anything.'</p><p>I just sort of looked at him, trying to comprehend this. He just laughed and said, 'You're tripping.' He then gave me the eeriest cheshire cat smile.</p><p>Later that night it took me about an hour and a half to do a delivery that should have taken 15 minutes. I got yelled at several times and am suprised now they didn't send me home or fire me. I was useless that night. It was terrible trying to read addresses because when I tried to read anything the letters were all blurry.</p><p>We finally closed the store at about 2 am. I remember getting my money and sitting in my car. The next couple of hours or so is competely blank. When I came to, I was standing in some sort of junk yard, looking at what I thought was my car. The hood was torn off, then engine a mess, and my key didn't even fit. I knew it would be a lot of work. It was hopeless, no matter how much i tried, the car only got worse. I looked up and saw a couple of mexicans looking at me and shaking their heads. When I met their eyes, they walked off. I followed them to try and get them to help me, but they had disappearred. Tired, cold, and still too far gone to even know I was high, I got in the back seat and went to sleep.</p><p>When I woke up, I was horrified. I was in the back seat of some smelly ass car with no idea where I was. I got up and ent to look around. My fear became much deeper. I was on the south-side. The ghetto of Midland, Texas. My car was nowhere to be found. My keys, phone, money,...also gone. I walked all the way across town to my house in the safe haven of white-suburbia. My mom was so worried. She had already called the cops looking for me and my car. They called an hour later saying they had found my car, and that I was going to get a point on my liscense.</p><p>So, we went back for my car, and I realized just how lucky I was. I had parked my car half-way on the sidewalk with the windows down at 3am. It was only 3 blocks from where I had ended up. My money was miraculously still there, sitting all over the seat. But my keys and phone weren't.</p>",
 "year": "2005",
 "id": "62942",
 "gender": "Male",
 "timestamp": "2009-10-18T07:00:00.000Z",
 "views": "9974",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "750 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 }
}
