{
 "id": 6294,
 "title": "Habit Forming?",
 "date": {
  "submission": "2004-10-25T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "XX",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 Tbsp",
   "administration": "oral",
   "substance": "Lotus/Lily",
   "form": "liquid",
   "specific": "Nymphaea nouchali var caerulea"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": "2.5 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I used Blue Lotus (Nymphaea Caerulea) several times. To me, it must be mixed with alcohol to give its full effects. I tried to boil teas, to smoke it (a waste, though it produces some effect), but my favorite preparation is to put 2 big tablespoons of crushed flowers in a bottle of wine. I let it sit for a week MINIMUM (and not on the eve for the next day). If I let it sit just for 1 or 2 days, the taste is milder, but I don't extract all the active products.",
  "I drink half a bottle of the mixture. Once I had drunk a full one, but it didn't give twice the effects (except for the alcohol part). I also smoke 2 or 3 little weed joints during the evening.",
  "The effects have something common with opiates. It gives me a feeling of universal love and a nice good heat. The alcohol wears off after 2 or 3 hours but the blue lotus effects last all the evening and a part of the next day (but milder). I dont take lotus more than once a week, but even like this, there seems to be a light tolerance.",
  "The next day, a light hangover and some irritability takes place in the afternoon. 2 days later, I experience some depression in the morning. If I think about Lotus, I want to take some. All this fades in the following days.",
  "It happens this way every time. The effects are coming up slowly and long lasting;  the aftereffects work the same way. I think that Blue Lotus is habit forming. I don't agree with reports which state  that tolerance is short lived and that there are no aftereffects. All this is manageable and there are a lot of more dangerous drugs, but my advice is to be careful."
 ],
 "erowid": {
  "id": "37709",
  "citation": " XX. \"Habit Forming?: experience with Blue Lotus, Alcohol & Cannabis (ID 37709)\". Erowid.org. Oct 25, 2004. erowid.org/exp/37709",
  "substance": "Blue Lotus, Alcohol & Cannabis",
  "views": "27561"
 }
}
