{
 "title": "Overstimulation",
 "author": "RG",
 "citation": " RG. \"Overstimulation: experience with 5-MeO-DIPT & 2C-T-7 (ID 6297)\". Erowid.org. Apr 17, 2001. erowid.org/exp/6297",
 "substance": "5-MeO-DIPT & 2C-T-7",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)",
   " T+ 0:15",
   "11 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>\nI recently acquired some Foxy and thought it might be nice to try in addition to some 2ct7.  I thought the 2ct7 would provide the visual aspect of the trip, and the foxy would provide some mental and physical aspects.</p><p>Around 12:30 I took the 2ct7, knowing that it would take longer to come on.  After about 15 minutes I got impatient and decided to take the foxy.  This turned out to be a horrible idea.  Just as the 2ct7 started making me nauseous, the foxy kicked in, making me feel horible all over.  I threw up about 30 minutes later and was glad I did, because I could already tell the trip was going to be too much for me.  I lied in bed for another hour and a half, feeling miserable and nauseous.  Finally when the 2ct7 started to kick in, the nausea started to receed, but then I spent a great deal of time on the toilet.  By this time the visuals were very intense, probably the most intense I have ever seen.</p><p>I sat on the toilet doing my business, and watched the floor tiles morph.  The music which was playing in my room sounded incredible.  After that I spent most of the day laying down in a field listening to my walkman.  The visuals were very intense for another 6 hours.  However, my skin felt like it was crawling, and anything that touched my skin stimulated me so much that it felt painful.  The shirt on my back hurt my skin when I walked, and if any of my skin touched the grass on the ground, it felt like I was being stabbed.</p><p>Another unpleasant aspect was the fact that my sweat smelled very chemically, and after I had smelled it once I couldn't get the awful smell out of my head.  The whole experience ended after about 9 or 10 hours, and I finally started to feel better.  In conclusion, I do not recommend using these two substances together.  The synergy was too much for me, I felt overstimulated by everything, especially the way that everything that touched me felt painful.  I will never again repeat this experience, and I recommend using these chemcials seperately.</p><p>-RG</p>",
 "year": "2001",
 "id": "6297",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-04-17T07:00:00.000Z",
 "views": "9292"
}
