{
 "id": 630,
 "title": "Gone for Good",
 "date": {
  "submission": "2004-02-06T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "AiMEE",
  "gender": "Female",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:00",
   "amount": "1 ",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Last night I went tomy favorite rave club with ian my boy friend. Tomorrows new years so I only bought one E pill (as opposed to my usual 3) so I would have a better roll on new years. MY pill wore off in about an hour. Ian suggested we buy some K. I had never done it before, but im pretty open to try anything so we bought 2 20 sacs. We went in the back and snorted it. Almost instantly, I was in my own world, this was all right for a few minutes, but then it hit me.",
  "That night will have an impact on the rest of my life. I saw things I never wanted to see and never want to see again. The scariest halucinations I could ever imagine. Seeing myself completley get sucked into the couch I'm sitting on. The room flipping over and everyone sitting there like they weren't upside down. Looking at myself and my boy friend sitting there, my boy friend holding you and crying begging for forgivness. I wonder why hes apologizing, and then I realize its because he just bought the drug that I OD'd and died on for me. Theres much more, and these are only the few things I remember, I was blacked out most of my trip. I remember a girl walking up to my paralized body, feeling my wrist for a pulse to see if I was still alive. It felt like all my limbs were attached to something by magnetic force.",
  "I couldnt stay one more second in that club. I got up and immidiatley fell over, it took all my physical, emotional, and psycological energy just to get up and get myself to my fucking car. Begin trapped in the 'k hole' is the worst thing in the entire world, any longer in it and  I think I wouldve killed myself.",
  "I will never buy drugs from anyone whos not a personal friend again. Also the only bad trips I've ever had have been with intense halucinogens, barbituates, (you get the picture) so I also promised myself I would not do the folowing again : shrooms, LSD, and K...  Peoples minds should not work on the levels that my mind has worked on those three.  I completley shut down and loose all motor skills, let alone the ability to think correctly.",
  "I'm only on one over the counter prescription, its called minocycline. Its an oral treatment for acne. It's not very strong, so it's never affected my drug use."
 ],
 "erowid": {
  "id": "11538",
  "citation": " AiMEE. \"Gone for Good: experience with Ketamine & Ecstasy (ID 11538)\". Erowid.org. Feb 6, 2004. erowid.org/exp/11538",
  "substance": "Ketamine & Ecstasy",
  "views": "21240"
 }
}
