{
 "title": "Introspective Nap Time",
 "author": "CognitiveLiberty4all",
 "citation": " CognitiveLiberty4all. \"Introspective Nap Time: experience with Nelumbo Nucifera (Sacred Lotus) & Skullcap (ID 63008)\". Erowid.org. Sep 8, 2010. erowid.org/exp/63008",
 "substance": "Nelumbo Nucifera (Sacred Lotus) & Skullcap",
 "bodyweight": "8.5 kg",
 "header": [
  [
   "DOSE:",
   "1 tsp",
   "oral",
   "Lotus/Lily - Nelumbo nucifera",
   "(tea)",
   "",
   "1 tsp",
   "oral",
   "Skullcap",
   "(tea)"
  ]
 ],
 "report": "<p>I've been experimenting with with various herbs for the treatment of anxiety and mild depression for a while and one combination I've tryed yielded some quite nice results so I shall share...</p><p>A blend of 1 part Nelumbo Nucifera (sacred lotus) and 1 part Skullcap, both known for their anti anxiety properties, taken at around 11:30 pm. The first time I tried it I was sitting on the sofa watching t.v when I rolled my head over and found a spot of incredible comfort, it was perfect, I didn't want to move, but I eventually did and went to bed for a very good hard sleep.</p><p>After making note of this good combination I tried it again a few nights later but this time I went straight to bed and found myself to be sedated but my mind was awake and the thoughts were flowing freely. I had a good think about the nature of existance and decided upon a paralell between vision and existence in that my vision didn't just suddenly stop at the edges but it merely fades away from conscienceness and that behind vision was blindess which ties in with the ying and yang in the you can't have the light without the dark.</p><p>I mean don't go thinking the herbs made me think these things, they calmed my mind and allowed me to open my thought processes, basically it makes a great meditive aid.</p>",
 "year": "2007",
 "id": "63008",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-09-08T07:00:00.000Z",
 "views": "5321",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tsp",
   "administration": "oral",
   "substance": "Lotus/Lily - Nelumbo nucifera",
   "form": "(tea)"
  }
 ]
}
