{
 "title": "subtle....",
 "author": "wanderer",
 "citation": " wanderer. \"subtle....: experience with Coleus blumei (ID 6303)\". Erowid.org. Apr 18, 2001. erowid.org/exp/6303",
 "substance": "Coleus blumei",
 "bodyweight": "145 lb",
 "report": "<p>I bought a 6.99 coleus blumei plant today. I've read before that crushing seventy or so of the leaves and soaking in a pint of warm water provides a legal alternative to a mild shroom trip. Here's the method I employed for my experiment:</p><p>#1 First I cut off about seventy leaves, complete with stems, from the plant. Basically this was the entire plant. I left enough leaf nodes at the base to allow regrowth, as well as some largish leaves to supply energy to the plant.</p><p>#2 Next I washed all the leaves with a sprayer in my kitchen sink. I then poured slightly over one pint of luke-warm water into my blender, and about 3 table-spoons of lemon juice. Then added the whole leaves and stems. I found that it helps if you chop up the leaves in the blender with a pair of scissors before blending.</p><p># Now blend on low speed chop setting. Do not use liquify. It will make the product difficult to filter if you do. I suppose if you want to drink it unfiltered this would be okay. I just find it unpleasant. Choice is yours.</p><p>#3 If you want to, filter. A coffee filter will not work. Clogs immediately. I use a tall disposable plastic cup with many small holes poked in the bottom. (straightened paper-clip, pliers, flame.) I then fill the cup a little over an inch with cotton balls. Another cup fits perfectly inside of course and is used to squeeze the dry cotton-balls down a bit before adding liquid. the other cup is also used after the liquid has run through to press ALL the water out of the plant material. If it's filtering slowly you can press your face to the top of the cup and 'blow' the liquid through the filter. All in all this is a cheap, very simple, very effective method of finely filtering.</p><p>#4 Now all you have to do is drink. As these things go it's not that bad really, I've tasted much worse. I've noticed very little nausea at all. But sometimes a slight feeling of tightness in the stomach, almost like when one has eaten too much.</p><p> THE EFFECTS:</p><p> What it does is hard to describe really. It is psychedelic, definitely. But it is very subtle. It has been described as mushroom-like, but I find it to be more like a mild dose of ecstacy. About 25 minutes after ingestion I first notice the tightness in my stomach. Then I feel like everything is GOOD. If i was tired before it fades, and I feel happy, and content. Numb but sensitive. Basically for me like a very mild e-trip. If mixed with a little bit of mary jane things are more intense. Colors and after-images can do some very unusual things....</p><p>Alltogether it is enjoyable, though as I said before..subtle. It's also legal and easy to find. Has good synergism with other substances so far.</p>",
 "year": "2001",
 "id": "6303",
 "gender": "Male",
 "timestamp": "2001-04-18T07:00:00.000Z",
 "views": "33259",
 "dose": [
  {
   "time": "0",
   "amount": "50 leaves",
   "administration": "oral",
   "substance": "Coleus",
   "form": "(tea)"
  }
 ]
}
