{
 "id": 6305,
 "title": "My Old Friend",
 "date": {
  "submission": "2004-10-27T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "G-man",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "substance": "PCP"
  }
 ],
 "report": [
  "Greetings, I have been a PCP user for around 25 years give or take. I was pretty much a daily user for close to 13 years up until about 12 years ago. I indulge now only several times a year. Of course I love the stuff or I would not use it. Strangely enough my experiences do not mirror most of the reports I've read of overpowering visual and physical distortions. I have had bad trips and repeatedly, the same bad trips more than once. This is possible due to constant use over a prolonged period of time, and then over-indulging.",
  "An alternate reality begins to emerge with prolonged use, not an unpleaseant one, but not the one most people operate in. Of course what is reality but perception? However this reality is sometimes not compatible with functioning in the 'real' world. So I guess my point is, this is not a substance that you should use habitually.",
  "Though I recommend it for people who like to stretch the mind from time to time, I caution that this drug is totally inconsistent as to potency, everytime I get it, it is different.",
  "I call it my old friend because when I use it, it's like putting on an old comfortable pair of shoes or spending the night with a great lover from the past. Some of my fondest memories are of just getting high on PCP and strolling through Central Park. Getting high on PCP for me is like going to a peaceful quiet place where the world's cares can seem not so important. And in that quiet place when the world slows down I believe I can walk closer to our Creator...."
 ],
 "erowid": {
  "id": "37757",
  "citation": " G-man. \"My Old Friend: experience with PCP (ID 37757)\". Erowid.org. Oct 27, 2004. erowid.org/exp/37757",
  "substance": "PCP",
  "views": "16651"
 }
}
