{
 "title": "One Pill ... Three Trips",
 "author": "Fnord",
 "citation": " Fnord. \"One Pill ... Three Trips: experience with 2C-B (ID 63096)\". Erowid.org. Mar 10, 2008. erowid.org/exp/63096",
 "substance": "2C-B",
 "bodyweight": "138 lb",
 "report": "<p>T  0:02: Slightly anxious. Listening to Pink Floyd's 'The Wall'.</p><p>T  0:08: Slightly indecisive. Not sure if what I wrote is funny.</p><p>T  0:10: Some kind of buzz. But clear headed. </p><p>T  0:36: Nothing really. I forgot I took it.</p><p>T  0:54: Kind of tired, headache on right side of my head.</p><p>T  1:05: Going to play piano. Feeling normal.</p><p>T  1:28: Piano was fun. Colors looking slightly brighter.</p><p>T - 2:30: Still nothing. Wait, getting CEV's and some OEV breathing.</p><p>Unfortunately this is where my notes stopped and the trip really began. Or at least the first one. The wall behind me became like a movie screen with strange images covering it. They were not frightening but I kind of thought they should have been. They are things like demons, skulls dark things. I know they are not real so I dont worry. Im listening to ELP which was totally a good choice. Im also seeing fake shadows that effect the lighting in the room like a real shadow would. As if someone were carrying a candle around and thus changing the lighting in the room.</p><p>I had heard 2CB users had some control of their trips and were able to switch to sober at will. I give this a try and had total success. I went up and watched hockey with my dad. My buddy J calls and hes on the way over. We chill in my basement for awhile listening to music and playing piano. By changing the notes Im playing on the piano I can change the tint of the room. J and I drink two beers each while we are chilling here. We are supposed to meet my other buddy up at the pool hall. I dont really want to leave. I cant imagine leaving the music. However Im assured Im getting weed out of this so I agree.</p><p>Out of my basement the trip becomes quite different very much like what I would imagine MDMA to be like, however Ive never done it so I cant be sure. Im very happy and content with colors changing almost constantly. Im getting tracers off of moving objects like the pool sticks. I dont even make an attempt to play pool, I couldnt follow the game at this point. I have been very thirsty for a long time and thus knowing about dehydration and drugs I have made quite an effort to stay hydrated. I bought a Dr. Pepper and refilled it with water repeatedly in the bathroom.  While watching my friends play pool I hear them making excuses to why they missed shots. This shit seems so much more ridiculous then normally. All the bullshit excuses people come up with for fucking up. It is obvious to me how little this matters.</p><p>My friends keep thinking Im paying attention to the game but I totally am not. Finally we go out to the car to smoke. After blazing we start the drive home. We have a close encounter with a cop that everyone seemed to be convinced was trying to bust us. I can not verify this because I was tripping too hard to even see the cop. I knew he was near by but I was not nervous. At this point I was confident it would be impossible to have a bad trip off of 2cb. I was wrong.</p><p>I know this part of the trip started at T  7:32 because I looked at my clock on the way in.  The second I went into my house everything changed again. I had full blown lifelike OEVs which I could not differentiate from reality. Additionally disturbing time dilation. Sitting in a chair for a minute seemed like hours. I realized at this point I had to be very careful to control what I was thinking about to avoid getting terrifying lifelike visuals. Time was going so slow I wondered if I could solve one of the worlds biggest issues tonight because it seemed I had forever to think about anything. At this point I took actions to safe guard my safety.</p><p>First I took out my contact which was quite difficult because the visuals were actually fighting me. They were producing images which were intentionally distracting to prevent me from removing my contacts. However just when I realized what was happening I succeeded in getting them out. I went to the bathroom to piss and drink some more water. Looking in the mirror I saw hallucinations that were unbelievable. My face was pulled in half via the two corners of my lips toward opposite sides of the room. One of my eyes was no longer blue but vivid green. My eyes had appeared on the shower curtain</p><p>I was not wearing a shirt and my mind built my abs into a perfect six pack. At this point I realized I might be able to exert some control over the OEVs. I tried thinking about different topics to see if I could conjure up any image I wanted. I tried to think about an old friend and see if I could make them appear in my room. I would get close but once I was almost there I would freak and it would disappear. I think with a trip sitter who could have helped pull me out of the trip if I started freaking out I would have be able to get to that point. I was too afraid the visions were getting too real.</p><p>Eventually I feel asleep and the next morning got up for work. This was at T  11:58. I was still getting visuals so there was no way I could drive to work safely. I dont really remember what I was seeing at this point but it was enough to prevent me from driving. I called in sick and went back to bed. I woke up at about T  16:00 and still saw some visuals but much diminished from before. I tried to go back to sleep but I couldnt. I eventually (T  17:00ish) gave up on sleeping and got up. All the visuals were gone with very little afterglow effects.</p>",
 "year": "2007",
 "id": "63096",
 "gender": "Male",
 "timestamp": "2008-03-10T07:00:00.000Z",
 "views": "2818",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "",
   "substance": "2C-B"
  },
  "1": {
   "time": "",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "2": {
   "time": "",
   "amount": "1 repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  }
 }
}
