{
 "id": 6317,
 "title": "A Newfound Appreciation For Existence",
 "date": {
  "submission": "2007-05-07T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Phantasm",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 5x"
  }
 ],
 "report": [
  "Tonight I experienced first hand the powers contained in the herb Salvia.  I was at my friend Jordans house late at night, and up for a new experience, although admittedly a bit nervous about the whole thing.  From what I had heard, Salvia was rather unlike anything I can possibly experience with any other drug.  I read that the trip only lasts a few minutes, but it takes you to a whole new realm of consciousness.  What the hell, I thought.  Its worth trying once",
  "A few of us ventured out back behind his house, by the pool.  I didnt want a large number of people to crowd around me, just incase I got a bit uncomfortable.  I was in a very empty mind state.  Not particularly great, not bad at all, just normal.  Not thinking too much about what I was doing, I lit the preloaded bowl of 5x and held the hit in as long as I could.  I remember having a few strange thoughts as the smoke permeated my lungs.  As I held the hit in, things got very strange.  At first it felt exactly like being high on cannabis, except it was extremely strong, almost to the point of being uncomfortable.  I looked at the clouds and moon, and they started to look more three dimensional.  I blew the hit out when I started to feel very weird.  At first I couldnt tell if this was an effect of the chemical, or just from holding smoke in my lungs for so long.  Ah, I feel reaaalllly stoned, but odd I managed to sputter out.",
  "My vision appeared as though it was in frames, like it was in slow motion.  A friend suggested another hit to make sure I broke though.  I felt so strange that the words echoed in my skull, but I understood.  With all my might I placed the bowl to my lips and sucked. I do not honestly know what happened after that.  All recollection of my past life, of all the things that I had done, my entire personality, of the world, and that Salvia had even existed, was totally gone.  I was in a different world.  I cannot easily describe what it felt like, but Ill give it a try.",
  "I wasnt sure what I was not that it even mattered at the time, though.  I guess that I felt what many consider ego death.  It felt like everyone around me was constructing something perhaps a sign, because I distinctly remember words being spelled out.  But I was the center of this construction.  When in reality my friends were trying to help me up, in my mind it seemed as though they were arranging me in all these positions so that they could construct around me.  I was the frame.  They had handheld machines that clicked out a piece of whatever it was they were constructing, one at a time. Sort of like a label maker.  But they were arranging me in all these positions, constructing words around my perimeter.  I did not know why, and I didnt know who any of these people were.",
  "I kept screaming whats going on? (maybe I did?) and the only thought that my mind could even formulate was So when did this become the universe?  In a vague way I knew that I was accustomed to being somewhere else, but I wasnt sure what that something else was.  Everything was going SO fast.  I kept laughing and yelling things, thinking that everyone was playing some sort of weird joke, and that it would end soon. One of the most bizarre things about this trip was how long it seemed.  In reality it was short, but according to my perceptions it was neither short or long.  Time was totally irrelevant and had nothing to do with anything.  Everything seemed infinite.",
  "The comedown was not so fun, at first.  My consciousness flickered between trip-mode and reality.  My body felt really heavy and I also noticed that my sense of touch was exceedingly heightened.  I could feel every single blade of grass on my entire body; these tactile perceptions seemed very real though.  I remembered that I had smoked salvia.  As soon as I gained enough recollection to realize that all of my friends were suddenly standing around me, I felt very trapped.  I made some sort of verbal command for them to spread out, and then just sat there with my face in my hands; there were still some visuals on the insides of my eyelids.",
  "A few of them inquired as to what had happened, and I tried to explain, but I knew that it was impossible, and that I didnt expect them to understand, so I just started laughing hysterically.  I just felt like laughing for hours at how ridiculous the whole thing was.  Everything seemed so ironic.  Even now, I cannot exactly recall what I was thinking at that time.  My friend helped me up from the ground, but I later sat down in the grass, not feeling too well.  I wanted to talk to someone, but I didnt want to be around a large group of people, and I started to slightly panic.  I felt extremely stoned again, but the visuals on the insides of my eyelids still surpassed anything I had ever seen from a marijuana high.  I still felt really trippy, and I didnt like it, mainly because my body still felt really uncomfortable; however, Derek assured me it would wear off, so I felt better about that.  I just didnt want the comedown feeling to last too long.",
  "I went inside with my friend Rick to play some Mario because I couldnt stand being around a large group of people.  I felt very anxious at the time, but as the trip wore off I began to realize why Salvia was a benefit to me.  It made me feel very optimistic, as it wore off, about life in general.  These feelings seem unconnected to the content of the trip itself, which is the strange part.  In time I felt much better and said goodbye to the folks that were there; I was tired and wanted some rest.  An inebriated Derek walked me home and here I am.",
  "What I have documented is the best I can possibly explain, but nowhere near what I felt.  It was totally unlike what I expected it to be.  But even for weeks afterwards, I felt so refreshed and relaxed.  I felt like if I could handle that experience, I could handle anything.  Well, have fun, and I suggest trying Salvia once, although I do not really want to do it again.  I am inclined to think that  its shown me what it can do."
 ],
 "erowid": {
  "id": "37794",
  "citation": " Phantasm. \"A Newfound Appreciation For Existence: experience with Salvia divinorum (5x Extract) (ID 37794)\". Erowid.org. May 7, 2007. erowid.org/exp/37794",
  "substance": "Salvia divinorum (5x Extract)",
  "views": "2785"
 }
}
