{
 "title": "Perspective in the Key of Triangle",
 "author": "Yosefxp",
 "citation": " Yosefxp. \"Perspective in the Key of Triangle: experience with 5-MeO-AMT (ID 63172)\". Erowid.org. Oct 25, 2007. erowid.org/exp/63172",
 "substance": "5-MeO-AMT",
 "bodyweight": "61 kg",
 "header": [
  [
   "DOSE:",
   "18 mg",
   "oral",
   "5-MeO-AMT",
   "(capsule)"
  ]
 ],
 "report": "<p>This was definitely my first plus four trip. I had taken 5-MeO-AMT before but only 4mg and 10mg doses which were no more than a high plus two. I have also tried LSA, which was fairly subtle, Salvia, which was fun for the first 2 trips but then not fun and of course Marijuana, which I smoke about once every week or 2.</p><p>Like any good drug user I had done tones of research, online and talking to friends and family, about psychedelic trips in general so I knew all about set and setting. I can almost guarantee that without that information this trip would have been the most horrible experience of my life but instead it was the exact opposite.</p><p>So I had a few friends over, 2 of which were trying this drug with me also. Ill call them H and J. H had done this drug before (4mg) so I gave him 12mg and J hadnt so I gave him 5mg. We put the powder in capsules and swallowed at about 10:30 while the other 2 people there smoked some weed and we started to watch a movie.</p><p>After about 30mins I definitely felt something. Usually it takes about 1.5 hours to feel anything with this but there was a definite rush mixed with like a feeling of anticipation, I knew this would be different.</p><p>After about 1.5 hours I was still the only one feeling anything and it was getting quite hard to ignore, nearly plus three. A few cold chills and slight nausea but still feeling pretty good. Soon H started feeling nauseous too and he went and threw up. J started feeling strange but otherwise normal.</p><p>3 hours into it I could feel the negative body load coming on strongly. I stood up and my body felt really uncomfortable and I threw up until my stomach was empty then I sat on the toilet trying to take a crap. i.e. it was a pretty horrible feeling in my gut but this is when it started to get interesting. The walls were beginning to move and sway around. I was beginning to see patterns in the cracks and I couldnt focus on anything.</p><p>I went back out about 30mins later and H and J were feeling it. Probably no more than an average plus two but I was way into three territory. I was trying to focus on the T.V. but it was way too hard, trails were coming on strong and colors were very bright and seemed to be running together so I decided to look at the floor which seemed to be dancing around. H and J were amazed about how everything on T.V. looked 3D.</p><p>I went back into the toilet for a while because my gut still hurt real bad and my senses were beginning to overwhelm me. I briefly considered going to a hospital because the body effects were so bad and I felt like something might be really wrong but I managed to calm down. Nevertheless I had to find a place to relax so I went into my bedroom, turned off all the lights and put The Dark Side of the Moon on my iPod and moved on up to plus four city. I have listened to Dark Side on weed so many times and it always seems so great but what I was hearing now was on a whole new level. I realized I could see the music and it was helping me guide my trip. Everything in my head was so bright and I could see my life as a triangle spread out in front of me and I was at the tip looking down and the triangle was riddled with paths. These paths were all my possible paths in life and there were thousands of them, filling up this infinitely large golden glittering triangle, and all going off towards the base of this triangle, far in the distance. When I focused on horizon, all I could see was this amazing aura of golden light, waving and shimmering and I suddenly realized what this trip was telling me. That no matter what path I take in life, Ill always be fine, in fact better than fine, because Ill always be going towards that light, and that revelation made me feel so great.</p><p>I came out of my room at about t + 6 hours feeling psychologically great but my body was beginning to take over so I managed to go back to the toilet and experience the diarrhea I had heard about with this drug but after that it was smooth sailing. Everything visually was so colorful and made up of triangle shaped crystals which glittered and there were trails that lasted for about t + 16 hours. H and J probably experienced a very low plus three at the most, only threw up once each and after that they felt fine. We played around with the trails and our really good mood till about t+12, just chatting and playing PlayStation.</p><p>Overall I would say it was an extremely rewarding trip psychologically and for the sensory experience but I dont think Id use this particular drug again as the body load was too high for it to be fun again. I think that maybe taking the powder in a pill might be bad because previously I had just eaten the powder by putting it on my tongue, which might help the body prepare for this new chemical, and I didnt have anything over slight nausea for those times which was very easily ignored. Compared to other trips, I thought I was pretty high with LSA and with my first 2 5-MeO-AMT experiences but after this I would compare the first to with jumping about a foot off the ground whereas this was like being shot into outer space.</p><p>As a side note, I called it in the key of triangle because everything I saw was made up of triangles, including the music and my thoughts. I realized everything was made up of triangles when I was listening to Dark Side, the album cover of which is a triangle :S. I didnt actually realize this until days after the trip..strange huh?</p>",
 "year": "2007",
 "id": "63172",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-25T07:00:00.000Z",
 "views": "6277"
}
