{
 "title": "Reach In",
 "author": "France",
 "citation": " France. \"Reach In: experience with Mushrooms (ID 63195)\". Erowid.org. Jan 4, 2010. erowid.org/exp/63195",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>This happened on a Friday night during the summer vacation before my junior year of high school. Overall, this had been one of my best summers I had experienced so far and I had strengthened my relationships with my two best friends while discovering a very good new friend. I had wanted to try shrooms for a while and finally I had an opportunity. A week prior, two of my friends had done shrooms and their stories definitely raised my interest in trying this ancient psychoactive.</p><p>On the Friday when everything was supposed to go down, catastrophe struck. The connection through which my friends had bought shrooms just a week ago had run dry, and didnt know anywhere else we could find some. This was very disappointing to me, as I had prepared myself mentally the past few days and was anticipating the trip. Determined to find shrooms, we started calling anyone we thought who might have some. After much suspense as to whether we were going to eventually get any, I finally abandoned hope. However, someone called back and said they could get us some through a dealer they had gone through before.</p><p>I now realize this was a pretty big mistake, as know your dealer is a fundamental rule of responsible drug use. All of us were eager to trip, however, and met up with the dealer. He seemed sketchy when he entered our car coked out then offered to sell us some meth he would be receiving tomorrow. We declined respectfully and took the shrooms. We then drove to the motel where everything was going to occur. This was another mistake as setting is seen as a vital aspect of a trip and this was a completely alien, scary setting to all of us. This was a cheap, seedy motel located on the old part of the Las Vegas strip, notorious for crime during the night. But hey, it was cheap and we were broke with no place to go. Before I continue I should describe the people who were to embark on this journey with me, as I feel it will help clarify the rest.</p><p>Myself- A pretty quiet, introspective person interested in mind-expansion with not too many friends. However, the friends I had were good ones. Im a regular user of marijuana and enjoy it for the roads of new and exciting thought it sends me down.</p><p>Leonardo- A very good friend of mine and a pretty nice guy. We had been friends for a while.</p><p>Michelangelo- A new friend of mine, but I felt a strange connection to him in some way, as if we thought similarly. At this point I had known Michelangelo for a couple of months.</p><p>April- A girl I hardly knew at the time but turned out to be real cool. At this point, she had just broken up with a serious boyfriend and everyone could tell her and Michelangelo liked each other, however nothing was out in the open yet.</p><p>Tang Shen- Someone who Ive known for a while but never became good friends with. She was good friends with Leonardo and Michelangelo. She seemed nice enough at the time.</p><p>Casey- Someone none of us but Tang Shen knew too well. He was here because of his romantic connection with her.</p><p>Michelangelo surprised us by revealing he had generously bought all of us a Mucho Mango Arizona Iced Tea to help wash down the fungus, a sentiment which I greatly appreciated. We separated the shrooms up into equal portions (amount-wise and paying attention to cap:stalk ratio) and got ready after warning each other not to get trapped by staring into a mirror.</p><p>I looked at my portion and felt slightly nervous. I examined it closely. It looked pretty gross and wrinkly as I had expected. However, I noticed gold flakes on the stalk which I found odd. I watched everyone else eat theirs and then finally began to eat mine. They were pretty gross, I suppose. They just tasted like old mushrooms and were a bit hard to chew. The Mucho Mango really helped with the taste and consistency.</p><p>The motel room was a bit boring so Michelangelo walked over to the T.V. and switched it on, saying, This will change everything. And he was right. Within ten minutes or so, I began to notice strange differences with the T.V. Everything was hilarious and caused us to burst into laughter. We would comment on something hilarious that had just happened, and burst into laughter once more. I think we all had tears in our eyes from laughing so hard. The laughter subsided after a small while and I began to watch the T.V. again.</p><p>This time, it was far more interesting. Everything on the screen seemed to take on a red tint and it was as if all the programming was a commercial for some reason. As I concentrated more and more, the redness of the T.V. began to bleed outwards from the screen. It looked like a T.V. screen does when my glasses have a smudge on them, but this time it seemed as if it was occurring in reality, not because of dirty glasses. All the while I was extremely interested and amazed with the effects I was experiencing. The glowing redness began to come towards me slowly in a wormhole-like tube. It was very nice to watch and experience and I could almost see a picture of myself sitting brainwashed in front of the T.V. with subliminal messages being sent into my brain by the red wormhole. The sound from the T.V. began to echo inside my mind in a very trippy fashion and I enjoyed listening to it. I felt as if I was extremely aware of my immediate surroundings, like a third eye had opened and it could see 360 degrees around my body.</p><p>I began to notice that when I blinked I could see complex patterns in the darkness. They reminded me of circuitry and they crackled to life with a green electricity whenever I blinked. I decided to close my eyes for a while. However, I opened them again after I saw an image that is difficult to describe. It was a man in a suit with a briefcase who had no face and was made entirely of electrical light. He looked almost like he was composed of the pixels you see when you stare closely at a CRT monitor. He was extending his hand towards me, as if to seal a deal with a handshake. I was not frightened by this, but decided to open my eyes and see how everyone else was doing.</p><p>April was sitting on the bed with her face buried in her hands. She would remain like this for most of the experience, and I decided not to disturb her. Tang Shen and Casey were talking to each other by themselves, and Michelangelo and Leonardo were in a similar state as me. Then, Leonardo glanced upwards. Dude, look at the fucking ceiling, he said with a tone of awe in his voice. I looked upwards and I seen what he was talking about. The ceiling was white and had a slightly glossy finish to it. It was reflecting some of the light from the television set and reminded me of the aurora borealis. It was quite pleasant to watch but after a while I focused my attention elsewhere.</p><p>I began to feel very sick so I went to the bathroom. Without much hesitation I puked. I looked in the toilet bowl and could see parts of the mushrooms swirling around in clouds. It was hypnotizing watching them swirl around and around slowly. I snapped myself out of it and flushed the toilet. For a while I was worried that the effects might now diminish since I had thrown up, but this was not the case at all. I came out of the bathroom and to my surprise, it had seemed like I was in there for only a few seconds, despite the fact that time had seem stretched out up until that point. I felt really good and went to look for my notebook and a pen.</p><p>At around this time, Michelangelo seemed to be getting a bit frantic. He was pacing back and forth and sometimes he would try to talk to someone. I was quietly trying to draw in a corner. Michelangelo started getting excited and was generally tripping out as far as slang goes. Leonardo tried to calm him down but Michelangelo didnt seem to want to listen and kept moving loudly from the bathroom to the main room, yelling. After Leonardo attempted to calm Michelangelo again, Michelangelo said something that still sticks with me. I think, at the time, this was one of the most profound things I had ever heard anyone say. I was having trouble understanding all of what was said, but the main message was clearly conveyed.</p><p>Leonardo, you just cant reach in. You want to reach in, but you cant. You try to reach in to other peoples lives and trips but no one can do it. Its impossible. Reach in, reach in he said.</p><p>I looked at Michelangelo and I repeated his words, Reach in.. He looked at me and agreed, yeah. I see what you mean, I said. I really see.. reach in, reach in, reach in I kept repeating to myself loudly at first but then under my breath. I contemplated the meaning of his words for what seemed like a long time, my thinking spreading into elaborate trees. I was still feeling as if my tactile senses were expanded, almost like I could feel the air and space around me very clearly.</p><p>Then, there was a loud banging knock at the door. The type of knock that cops give. I think everyone felt terrified, and certainly no one wanted to (or was in much of a condition to) open the door. However, Tang Shen bravely went to the door to see who it was. To my extreme relief it wasnt cops, it was management. Apparently they thought there was a fight going on because of all the noise Michelangelo had made earlier. We assured them there wasnt and they left.</p><p>Feeling good once more, I tried to draw something. I was curious how the shrooms would affect my creativity and anxious to draw (a very enjoyable activity for me.) For a while, I stared at a blank page thinking of what I would possibly put down to convey visually how I felt. At that moment, Leonardo walked over to me and threw a piece of paper on the small desk I was using.</p><p>Here, dude, he said to me. You take it. I cant fucking do it. I cant draw with that guy watching me.</p><p>What guy? I asked. I looked down at the paper and saw that there was a strange devil-looking face drawn in the corner.</p><p>I began drawing an outline for a face, and then two ears (one was massive compared to the other, not my intent) I realized that I was not so good at drawing while on shrooms but tried to continue anyway. Then, my hand totally froze. It was completely locked up. I struggled to move it but it felt like the muscles in my arm had disappeared. It reminded me of trying to walk for the first time after lying down for a week in the hospital. Finally, I used my left hand to force movement. Slowly but surely the right hand began to move again, but very shakily.</p><p>I then began to draw an intricate line design inside of the face and something rather extraordinary happened. I became lost in my drawing. It is hard to describe, but its almost as if the lines I had drawn became a maze and I had to navigate out of it. I stared very closely at the paper, holding my face less than an inch away from it for what I estimate to be about 20-30 minutes, although it seemed longer.</p><p>Michelangelo had been calling April into the bathroom to show her something miraculous he had discovered. He was very excited about it, and I think that he felt it was very, very important at the time. I was curious about what it was, but he didnt want to tell me at the time so I didnt bother going any further. Months later, I asked him what it was that he had discovered in the bathroom. He told me that it was a combination of playing with the water faucet and a secret spot he found behind the medicine cabinet. He said the spot was good for hiding messages and he wrote something on a piece of paper and shoved it in there. We are both curious to see what he wrote.</p><p>Everything was slowing down and I definitely was starting to feel a lot more normal now. I went into a comfortable closet-like area and smoked some pot with my friends, which I hadnt done all night in order to experience a pure mushroom trip. I became much more mellow than I usually am when Im stoned and brought the effect of the shrooms up a little. After this, everyone either lay still or went to sleep except for me and Leonardo. It was around 6 AM at this stage and I could feel the refreshment of dawn despite the fact I was in a dark motel room. Me and Leonardo sat at a table and smoked a cigarette (something I no longer do) and talked calmly about our experience. The smoke coming off the tip of the cigarette was in a way beautiful and very interesting to watch spiral upwards into the air.</p><p>I felt very good and refreshed in one way and tired in another. I suppose its similar to a hiker returning from a favorite trail, physically exhausted but mentally revitalized. I felt physically tired, mentally tired a bit, but spiritually refreshed. It was empowering to able to think not only with mind but with spirit. Up until this point I had held a very atheist view towards all aspects of life but since then I have come to accept spirituality as important and powerful.</p><p>I was quiet and thinking most of the morning, turning the events of the evening over in my head. I had an understanding of the mushrooms reputation and also a respect for something so worthy of awe for its greatness. I was thankful that it had opened my mind to new thoughts and indeed, to new ways of thinking. It was a very good experience.</p>",
 "year": "2006",
 "id": "63195",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-04T08:00:00.000Z",
 "views": "2415"
}
