{
 "title": "I Almost Prayed to God",
 "author": "Pharmaz",
 "citation": " Pharmaz. \"I Almost Prayed to God: experience with Heroin, Cocaine & Cannabis (ID 63300)\". Erowid.org. Jun 20, 2007. erowid.org/exp/63300",
 "substance": "Heroin, Cocaine & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  " ",
  "insufflated",
  "Heroin",
  "(powder / crystals)",
  "",
  "1 bowl",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  "1.0 g",
  "insufflated",
  "Cocaine",
  "(powder / crystals)"
 ],
 "report": "<p>I started my freshman year of college last fall, 2006. For two years I had been smoking marijuana daily, and had tried cocaine on numerous occasions but had never really felt the effect of the drug. When I got my own place in the dorm, I was suddenly given a whole new experience of freedom then had previously, living with my parents. I consider myself a creative person, I play guitar, make movies, draw and write, but I will say that drug usage has really taken over the creative part of my brain. In the early fall I had tried heroin for the first time (sniffed) and continued to use it just about once a week or once every other week. Then I bought a bag of coke and for the first time I got high. I stopped with the dope for a week or two, but used coke continuously every day to help me finish my homework for school.</p><p>One day, close to Halloween, I went over to my friends house. We bought two 10 dollar bags of 'no pain' stamped heroin and insufflated them. We waited around for a while but I didn't feel much, possibly because the day before I had sniffed two bags. After an hour or so we began to feel bored, so we smoked a bowl. We sat around in the shed for a while, wishing that we could get more dope, but I had no more money and our connect stopped answering his phone.</p><p>Soon we decided to procure some cocaine. We bought one bag and split it, felt a good buzz and talked for a while until we began to come down, and then we went out and bought more. We took the coke to the park where we took key bumps of it until half of it was gone. I was racing at this point and felt great. We went to go meet up with some girls who had some beers and sort of watched over their shit while they were vomiting on the street. We ended up steeling their beers and some of their weed, which we rolled into a blunt. We went back to my friends shack. Their we smoked the blunt. I was fucking high at this point. We decided to put the clip in the bowl and put the rest of the cocaine on top of the weed and smoke it. My friend took a hit and passed it to me.</p><p>As a greedy person, I wanted to make sure that I got as much of the coke out of it as I could so I took a giant hit and exhaled. Suddenly I felt higher then I had ever felt before. I felt so high that I felt like something was wrong. I looked at my hands, then my worn blue jeans, and then up at my very stoned friend. 'What?' he said. 'Nothing. I just feel really weird, I feel like how I would imagine someone that smoked too much crack would feel'. As I said this I began to become uncomfortably aware of my heart beat, and I could feel blood pumping through all my veins and at the tip of my fingers. I waited for a while thinking that I had to just calm down and that it would pass. But it didnt. I couldn't stop concentrating on my heart beat and my eyes began to go crazy. I was seeing red dots.</p><p>At this point I got really fucking scared. I told my friend we had to get out of the house. 'Stop being fucking gay' he said, but I told him that I was not OK and that I had to get outside right away. We left his house and as I walked down the broken stairs of his house I began to fear that I was bleeding out of my eyes, because I kept seeing the red dots. I felt like I was in a movie about a troubled teen that takes drugs too far and ends up overdosing and dying. When I got to the sidewalk I demanded that we walk two avenues down. My heart was hammering inside me. It felt like their was a motor behind my chest that was revving up.</p><p>A few blocks later, my heart beat was no better, and even worse, I began to notice that my arm was going numb. This really freaked me out because I began to assume that I was having a heart attack. I had to sit myself down and take deep breaths and I also kept constantly shaking my arm to see if I could feel it. For the first time in my life I really thought that I could possibly be dying and it scared the shit out of me. I wanted to cry. I thought of my mom and my dad and how they would feel if I did die. I thought about all my friends. I guess I'm a depressed person and tend to resort to self destructive behavior when I get down, but this made me realize just how much I wanted to live. I thought about praying to God, but at the time I was a devout Black Metal head and strangely enough that overpowered everything. Eventually I was good enough to walk. I went back to my friends place and I sat down in his shack for a little while, drank some soup, and at about three oclock in the morning on a school night, I took a cab home.</p><p>For two weeks after this incident I swore to myself that I would never fuck with hard drugs again, that weed was good enough. I walked around as if I had been reborn. I didnt feel depressed, I felt happy to be alive. But after two weeks this started to change and Mr. Brownstone came knocking on my door again.</p><p>I continued to use Heroin for the next six or so months, but almost completely stopped with coke, except occasionally. After those six months I have decided to give up all drugs. It is not easy at all. I have still fucked up.</p>",
 "year": "2006",
 "id": "63300",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-20T07:00:00.000Z",
 "views": "22747",
 "dose": {}
}
