{
 "title": "Green Little Mutants",
 "author": "Wally",
 "citation": " Wally. \"Green Little Mutants: experience with LSD & Cannabis (ID 63309)\". Erowid.org. Jun 28, 2010. erowid.org/exp/63309",
 "substance": "LSD & Cannabis",
 "bodyweight": "78 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   " T+ 2:00",
   "0.5 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 4:45",
   "0.5 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Pre-History: I am an 18-year old boy, living in Belgium. I have had a number of acid and mushroom experiences. In my old days I was very fed up with amphetamines en mdma, during these times I had a few bad trips on acid. But lately my life has been going for the best, and my trips are getting more and more spiritual. At a good Friday-night I was planning to take some acid. There was a psytrance party I might wanted to go to, but it soon turned out I wanted a more solo-experience.</p><p>(00:00) My trip started at home at midnight. I took a very potent Hoffmann 2000 blotter.</p><p>(00:15) The first acid waves are noticeable. I put on some psytrance music, Sesto Sento. Mmmh lovely music There is a little tension in my body, no anxiety, but more a happy welcoming of the acid kicking in. I roll some joints for underway.</p><p>(00:30) I go to my garage to take my bicycle to the party, but when I do this I make up my mind. I dont wanna go to the party already. I made a big walk in town, tripping around, very nice walk.</p><p>(01:30) I am expecting a phone call from a friend for a few hours, but I decide to put off my phone to have no feelings of possible interruption. I jump on my bicycle when I get home, but I am not really planning to go to the party. I bike to a very chill distant area. Its a group of benches but hidden in a little park. I knew nobody would ever disturb me here.</p><p>(02:00) I smoke a joint to peak the experience. I smoke about half of it. Everything is starting to breath very vividly. I close my eyes, I see all kind of circles with strange patterns on them. I try shifting my consciousness through my whole body and the colours change when I travel through my body. I open my eyes, full of confidence. I decide I should go to party anyway. I decide I should roll another joint here to smoke at the party. I take some weed from the baggie and put it in my hand. I start to grind the weed with my hands. But it feels very weird, very soft. I look, and suddenly my weed has changed into little green gremlins, very very small. They start jumping around.</p><p>I try to continue to roll, but its impossible. Now I try to put it back in the baggie. But even that is impossible. Now my whole environment is full of the little green animals. They become larger, and look like the creature Gollum from lord of the rings, but totally in green. They are like little swamp people totally in green. My inner conversation is now being held out loud. I call them the green little mutants First I am a bit suspicious against them. The mutants start jumping up and down. I relax and put myself in a comfortable position on the bench. I start thinking about why they are here? Is it a message from my mind that I smoke to much pot? Must be I put the baggie away, but the weed is still in my hand. I am complete zen now, I dont want to move, and I dont think I could even if I wanted to.</p><p>The green mutants starting getting more ferocious.</p><p>My eyes are opened. There is a second vision created. Its like a sort of projection screen. Al my focus is now gathered in this new vision. I see myself. I am playing basketball I think at the school basketball field. I see some scenes of my youth flashing by. Awesome visions. Soooo accurately. They come out of nowhere. Nothing in the environment could have triggered it. The visions come straight from the inside of my mind. The next thing I see on the projection screen is a cop on the street. The screen is just 1m before my eyes, so I startle. I am distracted for a few seconds and out of everywhere I see sirenes, there are people coming out of everywhere. The thought of running is there for a second, but then I realize I am busy with my mind. I search concentration again. The screen is there again.</p><p>I think of my girlfriend. My deepest fantasies are projected on the screen. I see my body, how it works, I see myself breathing. First with my stomach, then with my chest. I see our bodies moving in perfect harmony. Then I see my body again. A fully mature body, but inside the body there is a little man. At that time I interpreted that I might feel like I am mature and confident, but my mind inside is still that of a child.</p><p>A lot of sad thoughts enter my mind, the little green mutants start laughing at me. But inside I still had a feeling I had to stay relaxed. Id prove the little mutants wrong. I would attain my calm even if the world would end. The cops returned from everywhere. All kinds of people started to surround me. I closed my eyes very gently, and I felt like I was falling. Then suddenly I started breathing very deep, and suddenly I stop breathing. I feel like I am drowning, I am fading away. My vision is becoming blurry. I calmly regained my breath.</p><p>I opened my eyes, everything was calm for a moment. I wanted to move, but then I heard a loud whispering in my left ear. And a man with a little flamethrower appeared, he was scaring me. But I enjoyed this. You might think I am a masochist But deep inside I knew the rebirth would follow eventually But I must admit I was very afraid the moment after this. A pack of black dogs came out of the bushes. One of them approached me and he bit of my penis. Then a bright light came and covered my whole sight. It consisted mainly of psychedelic white, pink and yellow colors. Some time after this, I put my weed in my baggie and left.</p><p>(04:30) I realize I have been sitting there for quite a while. I ride home on my bicycle, full of confidence again. Chasing and sometimes being chased by the little green mutants. But the rest of the trip was very calm, I never had so much clear thinking</p><p>(04:45) At home I see that my mp3-player is on and playing a song. I check which song it is, Darkpsy  Mutants. This was rather ironic and pretty shocking at that moment</p><p>I smoke the rest of my joint in the garden, I think more about my girlfriend and I can see her very vividly in front of me The rest of my trip I fill my time, by taking a shower, eating a bit, and falling asleep like a rock</p>",
 "year": "2007",
 "id": "63309",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-06-28T07:00:00.000Z",
 "views": "3310"
}
