{
 "title": "Flying High in the Ololiuqui Valley",
 "author": "6um",
 "citation": " 6um. \"Flying High in the Ololiuqui Valley: experience with Turbina corymbosa (ID 63322)\". Erowid.org. Jul 23, 2007. erowid.org/exp/63322",
 "substance": "Turbina corymbosa",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "100 seeds",
   "oral",
   "Turbina corymbosa",
   "(seeds)"
  ]
 ],
 "report": "<p>This is my account of three seperate trips, each using 100 seeds of the sacred Aztec hallucinogen, Ololiuqui.</p><p>Taking the 100 at once has yeilded true trips lasting 6-10 hours. Sometimes similar to Ecstacy, or some mild LSD. All of my experiences have been for the journey and personal insight, as the natives also use these plants in such a way. The Aztec tradition is very old, and may offer alot of wisdom to those who treat nature (and themselves) with respect.</p><p>I prefer the Ololiuqui due to the much lower amount of 'bad chemicals' as compared to the morning glorys or baby woodrose. Although the strongest seed-induced trip I have experienced was with Madagascar Woodrose at 8 seeds, Ololiuqui seems to do just the right thing, but this may vary intensely depending on mindset. Experienced psychedelic users should have nothing to worry about. I will recount the three trips now for the explorers, skeptics, or worried enthusiasts.</p><p>TRIP ONE:</p><p>My 100 seeds arrive in the mail, and I take them at around 12 midnight, being the night owl I am. Many websites list the traditional way of preparing the seeds as either grinding or chewing the seeds up, and then leaving them in a small amount of water for several hours. I would'nt recommend chewing because your saliva may breakdown some essential chemicals. Doing some research, I found that the shamans would leave them in an alcohol solution, and not water. On my first try, however, I was not as informed as I am now, and I both chewed them and left them in water for about 1 hour.</p><p>The seeds taste like nothing I've tasted before, a mixture of something magical, ancient, and downright nasty. I liken the taste to perfume and spinnach. It packs a bite. Mixing them with alcohol instead of water lessens the bitter taste, and may help to extract more alkaloids from the plant material. The onset of effects is within an hour to an hour/half.</p><p>It feels like I've slipped into an off-world where everything feels like I'm in wonderland. I notice;</p><p>-A slight change in vision</p><p>-Colors are clearer</p><p>-Objects are more pronounced</p><p>-The air itself feels like i'm on another world.</p><p>A strange thing happens with Rivea that I haven't noticed with anything else, I tend to 'become' the image I am looking at. I can focus on something like a car, a dog, a woman, and then I am that car, dog, or woman. It's hard to describe. These seeds seem to be very unpredictable, and this first trip lasted about 5-6 hours with the same effects heightening, and then eventually fading off like a dream.</p><p>TRIP TWO:</p><p>100 seeds again, about 6 months later. I take them in the morning this time with the house empty. This was my strongest Rivea trip yet. The onset was fast, and came in waves with each new wave pushing me further into the world of the plant.</p><p>I begin to get very very happy and excited. The 'wonderland effect' is there again, but very different this time. I feel as if I am one with the heart of the earth, or the whole of nature itself. I realize that everything I experience is a part of me, and I of it. It's all one thing, and this thing is God.</p><p>I see slight visual hallucinations in the form of subtle passing lines of light, and the blue carpet which looks like waves begins to ripple slightly. I experience a pleasurable body-high much like Ecstacy. It seems the seeds this time have decided to be a little more exciting. The experience lasts 8 hours.</p><p>TRIP THREE:</p><p>I am including this one to show just how unpredictable these 'round things' are. 100 seeds again, I had eaten something about 5 hours before. Onset is about 1 hour, and the seeds seem to be 'bored', and offer me very little in terms of effects. About 20% of the last trip. There is no explanation for this that I can find.</p><p>I about to try on my fourth trip, with 100 seeds once more. In retrospect, these seeds seem to have a mind of their own. Sometimes I will be blown away to another world, and sometimes I will seem to be stuck with flypaper to my own.</p><p>The essense of the Rivea Corymbosa trip is a mostly emotional one, with very little (if any) visuals. Don't let that discourage you. Sometimes the things you cannot see are the strongest, and each trip seemed to put me atop a deep ocean of experience. Very LSD like. Never underestimate natural acids.</p><p>With each experience, though, I have come away with a feeling or experience that I felt I needed to have. Treat these little guys with respect. The possibilties are endless, and you will truly commune with the spirits of nature.</p>",
 "year": "2007",
 "id": "63322",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-23T07:00:00.000Z",
 "views": "19032"
}
