{
 "title": "Death and Back Again",
 "author": "Max",
 "citation": " Max. \"Death and Back Again: experience with Mushrooms (ID 63357)\". Erowid.org. Sep 4, 2007. erowid.org/exp/63357",
 "substance": "Mushrooms",
 "bodyweight": "110 lb",
 "report": [
  "<p>This happened a while ago so I may have forgotten things here or there, but the story is still there.",
  "This happened about a month before I turned 20.  I had gotten a hold of some shrooms from a rather inconsistent source, and I was looking forward to an evening of giggling, stumbling madness.  My friend, who will be referred to as k, had decided to experiment with some other drug, a research chemical not unlike 2cb.  About an hour after ingesting the shrooms, maybe less, I got a call from my mother (I should've known better than to answer).  I was supposed to see my father for the first time in over a decade that summer, and my mother was calling to tell me that the timing wasn't going to work out and I wouldn't be seeing him after all.  I was surprised by how hard I took this.  I don't remember exactly how I felt, but I was very unhappy and felt like this was a very, very big deal.  The trip went downhill from there.",
  "k and I decided to go to the local grocery store.  I think that's when I started peaking.  I was wandering around rather aimlessly, not knowing what I wanted, generally feeling shitty.  When we went to check out, the goth girl at the register seemed to know we were tripping, and that just made me more paranoid.  On the walk home, the trees looked sinister in the dark, and I couldn't stop thinking 'God, I'm so fucked up, I'm so fucked up.'",
  "k and I started watching some futurama, and I absolutely could not pay attention.  My mind was consumed with thoughts along the lines of, 'Wow, I'm so worthless.  I could die and it wouldn't really make a difference to anyone.  It makes no difference to my friends if I'm there or not.  what if they're just hanging out with me to humor me?'  there was no rationale behind these thoughts, it was poison spreading throughout my mind. ",
  "I genuinely thought I was going crazy, and for good.  I kept thinking about how I wouldn't be able to go to school in the fall because I would have to be committed, and how my friends would or wouldn't wonder what had happened to me.  I looked over at k, I had no idea what k was thinking or what k was experiencing.  I tried my best to communicate what I was feeling, starting slowly and fumbling over my words.  I think I said something along the lines of, 'I'm so depressed, I'm so fucked up' and I kept asking k to tell me stories about people who had been in similar situations as me (bad trips) and came out of it just fine.  It helped.",
  "Eventually, I simply became overwhelmed with the vastness of the universe and the fact that in the grand scheme of things, I don't matter, my problems don't matter, and I'm not even a blip on the map of the universe.  Feeling so hopeless and meaningless, I was never as capable of killing myself as I was that night.  I could've done it easily without hesitation.  I was even concerned that k might not let me go to the bathroom fearing that I wouldn't come back out.  But I didn't do it.  I wanted to see what happened next.",
  "I can only describe what happened next as an open umbrella flipping inside out.  I realized that since my actions mattered so very little, I was essentially free.  I could do *anything* I wanted to, if I really wanted and was willing to deal with the consequences.  I could do whatever I wanted to with my life, and nothing anyone said would make me think otherwise.  Drinking water felt like I was filling my body with life.  Smoking cigarettes felt dirty, and I promptly quit.  We sat outside breathing in the fresh air, and I felt not only content but joyful.  The world is so simple and all the answers are right in front of our noses, and I realized it for the first time.  All you have to do is be.  Everything was beautiful and I was filled with love.  I wanted so much for everyone to be happy and feel the way I felt.  I had thought that it was part of my nature to be pessimistic and cynical.  Turns out, somewhere deep down, struggling to break free, is a love that I didn't know I was capable of.",
  "This experience completely changed my life for the better.  It was like I had died and was reborn.  It was as if I'd been somehow sleepwalking and I was finally awake to the beauty of life, of everything.  I had tripped on numerous occasions before, but this was the first time I remembered how it felt to be tripping after coming down completely.  I was bubbly and happy for the next two months or so, when I met someone who would crush my happy spirit.  But that's another story.</p>"
 ],
 "year": "2005",
 "id": "63357",
 "views": "2654",
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2007-09-04T07:00:00.000Z"
}
