{
 "id": 6335,
 "title": "Redirecting My Path",
 "date": {
  "submission": "2001-02-15T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Newbie",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablet",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "powder/crystals"
  }
 ],
 "report": [
  " I've never really done drugs before, basically because I was never offered the chance until my last year of high school and because I was scared of what might happen to me and what people might think of me.  I'm shy and quiet by nature and I don't like to do anything that would disappoint anyone or embarrass myself.  This weekend, I rolled for the first time.  I was a little bit scared about what would happen.  My boyfriend and his friend have been rolling somewhat frequently ever since they both stopped smoking marijuana about four months ago.",
  "I was kind of worried about what could happen.  Ever since I reached high school age, my parents had been pounding their morals about drugs and alcohol into my head:  how bad these substances were, how much damage they could cause, and how they would, or had the potential to, screw up my life forever.  I'd seen drug induced death glamorized on television and I just kept hoping that it wouldn't happen to me.  I wanted to try E though because I had heard good things about rolling and I was insanely curious.  It's also a relatively big part of my boyfriend's life and I wanted to know what it was like and why he liked it so much.",
  "It was a Sunday afternoon that I rolled.  My boyfriend and his best friend were my guides on my trip and they explained what I was taking and what kind of feelings I could expect.  They told me to drink a lot of the juice that they supplied and when I said that I wasn't thirsty, they told me to drink anyways.  I parachuted the pill, which means that it was ground up into a powder.  I was told that this made the drug take effect faster.  I remember that I had a really bitter taste in the back of my throat because I have my tongue pierced and the covering of the ground powder got stuck on my tongue ring.  I ended up finishing off a bottle of juice by myself to get the taste out of my mouth.  We were in my boyfriend's car on the way to the mall and we had the music up loud.  The other two had taken their pills about twenty minutes before they came to pick me up and when they started to feel the effects, I was still waiting. ",
  "To be perfectly honest, I really didn't notice that I was feeling the effects until I stopped walking in the mall concourse and looked up and realized that my entire body felt warm.  The tension had melted out of my body and I felt incredibly relaxed.  My fingers and toes were tingling ever so slightly and felt kind of cold.  My throat was very dry and my head was kind of foggy.  I saw things, but I couldn't react as aptly as I had been able to before.  My arms and legs felt like they were miles away from my body and I felt an overwhelming need to be close to my boyfriend.  We walked through the mall for an hour or so looking at lights, venturing into stores, and watching the people.  We left the mall with no real intentions about where we were going. ",
  "On the car ride, my boyfriend's friend gave me a back massage.  It was the single most pleasurable experience that I had come into contact with in a long time.  As soon as he started, I bowed my head and closed my eyes.  There was rhythmic techno music playing in the car and his fingers seemed to mold my skin in time with the music.  The warm feeling was stronger when he was stretching my skin and it felt delicious.  My arms and shoulders tingled for minutes afterwards, but it didn't hurt.  It comforted me and relaxed me even more.",
  "We finally decided to go bowling.  This might not seem strange to anyone else, but I hate bowling.  I despise it almost as much as I despise playing pool.  I readily agreed to go bowling with my friends though.  I was cheering and yelling and hugging everyone after they bowled a frame.  I'm normally the girl who will sit there quietly until it is her turn and then bowl her frame and sit back down.  I would usually be embarrassed if I was yelling or making a scene.  I wasn't, I felt this freedom.  It was like I wasn't concerned about what people thought about me and I felt like I could say anything to anyone and there was nothing that they could do about it.  I felt free and very open about everything.",
  "My boyfriend came back to my dorm room after we dropped his friend off and when I looked in the mirror on my door, I was shocked to see that my pupils were huge.  That worried me a little, but then I realized that I didn't really care that much because no one else was going to see me.  My boyfriend and I lay down on my bed and we began to talk.  We only recently began to go out on a regular basis and yet we were talking as though we'd known each other forever.  Usually our conversations were kind of slow and hard to keep going because we were both the quiet type.  Sunday night we talked for two hours straight about everything from why we liked each other to what our experiences were like and what we were feeling.  He told me that I was like a different person, but not in a bad way.  I realized that I was and told him the same about himself. ",
  "My experience was a really good one.  The people that I was with knew what they were doing and were careful to watch out for my well-being.  The only advice that I can give other first timers would be to make sure that the people you are with know what they're doing.  If they've experienced it before, it makes it much easier on you.  I had many revelations about my life and about what was going on with me.  It would take me hours to explain everything, but I realized what it was that I wanted to accomplish with what is going on in my life right now.  It also opened up the channel between my boyfriend and I.  We can talk without problems now and we're not as concerned with how stupid we look around one another.  It made me more comfortable with myself and with the people around me.  That's what has been most valuable to me.  I realized what I wanted to be different about myself and I plan to change some things because of it.  Thanks for letting me share my story!"
 ],
 "erowid": {
  "id": "3787",
  "citation": " Newbie. \"Redirecting My Path: experience with Ecstasy (ID 3787)\". Erowid.org. Feb 15, 2001. erowid.org/exp/3787",
  "substance": "Ecstasy",
  "views": "3603"
 }
}
