{
 "id": 6345,
 "title": "Would Not Repeat",
 "date": {
  "submission": "2006-07-09T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Vagabond",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "9.0"
   },
   "administration": "rectal",
   "substance": "4-Acetoxy-DiPT",
   "form": "capsule"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "mg",
    "quantity": "8.0"
   },
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "capsule"
  },
  {
   "time": "1:45",
   "amount": {
    "unit": "mg",
    "quantity": "15"
   },
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Background:  Other chemicals experienced include Marijuana, LSD, Cocaine, Rohypnol, DXM, MDMA, and Alcohol.",
  "Mindset & Setting: Well rested, fairly empty stomach, some muscles were sore from previous days workout.  I was in my apartment with no pressing issues or matters for the rest of the evening.",
  "Preparation:  A digital scale accurate to .002g was used to weigh out 9mg of 4-Acetoxy-DiPT encased in a pill sized capsule of ice for rectal administration (this is my preferred method of administration for MDMA).  Subsequent dose of 8mg was placed into a gel cap for oral administration.  Final dose of 15mg was wrapped in a VERY small corner of tissue for oral administration.",
  "Experience: ",
  "7:50pm  9mg administered rectal,  30mg Grape Seed Extract (anti-oxidant) administered oral",
  "8:08pm  anticipation, but no effects",
  "8:18pm  some sensation of warmth, slight trouble with concentration, slight GI nuances, slight leg buzzing.",
  "8:30pm  slightly less of what was above, starting to think some of it may have been placebo affect, no pupil dilation.",
  "8:50pm  8mg administered oral via gel cap with sips of cola.",
  "9:03pm  no change.",
  "9:08pm  slight stomach queasiness.",
  "9:35pm  15mg administered oral in tissue with sips of cola.  No change.  Left the apartment to get a massage.",
  "10:30pm- have a feeling of fuzziness, like there is a cloudy separation between my mental being and my physical being.  My body, actions and voice at times seem to be one foot away from me.  I had sex twice, but it was not all that enjoyable, as this also felt like it was happening distant from me.  There is no effect on any of my 5 senses, and besides the fuzziness, none on my mental state either.  Body felt a little warn out and distant from me.",
  "12:47pm  went to bed, ability to sleep was no different than normal.",
  "Summary:  I had very minor effects from what is typically considered a moderate dose.  Nothing was felt or experienced that I would consider pleasurable or interesting.  Body felt tired, fuzzy, and distant, with no changes in any of the 5 senses.  The best way I could describe it would be the way I feel after an experience on MDMA or LSD.  Kind of drained and out of it.",
  "I dont have much desire to try it again, but may give it one more shot at a single dose of around 30-35mg."
 ],
 "erowid": {
  "id": "37910",
  "citation": " Vagabond. \"Would Not Repeat: experience with  4-Acetoxy-DiPT (ID 37910)\". Erowid.org. Jul 9, 2006. erowid.org/exp/37910",
  "substance": " 4-Acetoxy-DiPT",
  "views": "7870"
 }
}
