{
 "id": 6348,
 "title": "Several Experiences with Nature",
 "date": {
  "submission": "2006-06-17T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Oak",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "<p>[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I bought one gram 10 X Saliva Divinorum Extract from an online smoke shop early in the summer. I had about it because a friend of mine and I were very interested in experimenting with Hallucinogens especially natural ones.",
  "Over the course of the summer, I probably smoked the Saliva 9 or 10 times. I encountered an intense psychological, mystical, or hallucinogenic experience each time. I'd say that, considering I paid about $20 incl. shipping and handling, used the substance 10 times, and still have a good amount remaining for a rainy day, I got my money's worth. Here are a few brief descriptions of my trips on Saliva over a 3 month span.",
  "1st time: SO SO TRIP. VERY MELLOW. STARS BLURRRRRRRRRRRRRRRRRRRR.",
  "The first time I used Saliva, I was with my friend. We would meet fairly often after band practices or work to smoke a few bowls of pot, mellow out, and provide each other with AMAZING company. Since this summer, we've become brothers. I pulled out the 1g bag I'd received that day in the mail and told him that it was a pot alternative. At the time, I had no idea what to expect.",
  "We packed the bowl with pot and placed a generous amount of Saliva on top.  Saliva tastes like absolute shit and the effects of marijuana seem to make the effects of Saliva less intense. The first effect I noticed was the feeling of additional weight in my head and limbs. As we were on a golf cart, I pulled over and enjoyed the remainder of the trip. This lasted about 20 mins.",
  "Not much happened on the first time. The feeling of being very weighted only intensified for the next ten minutes and walking became impossible. When I laid down on a golf course green and looked at the stars, I felt a mild feeling of time displacement. The next thing I remember is feeling perfectly normal aside from the marijuana high.",
  "2nd Trip: TIME TRAVEL",
  "A few days later, I was visiting my girlfriend at her home in the City. It had been a while since she'd smoked and I had no pot. But. I did have the saliva. I told her about how mellow I'd gotten off of the Saliva and we decided to smoke some. We did it outside her house and, feeling very little, I went back to my car to put away my pipe and accessories. About halfway to my car, I noticed a mild euphoria was over me. I laughed all the way to my car.",
  "I heard her laughing, too and she asked what I was laughing about. Being some distance away, she had to raise her voice to effectively communicate with me. Her change in volume caused a rush of panic to replace the Euphoric sensation I had been experience. I tossed my pipe into my glove box and spun round, slamming my car door. My car was parked outside of a garden area at her home. Though I'd been there many times, this placed seemed completely unfamiliar to me. I can only describe this feeling as a sense of EXTREME TIME DISPLACEMENT. I was sweating incredibly. Every sound. cars passing, birds chirping, neighboors talking, even my girlfriends voice seemed strange and frightening. When she put her hand on me to ask if I was all right, I couldn't remember her name and ran about the garden wondering who she was as well as where, but more importantly, when I was.",
  "Events seemed to occur repeatedly and everything was De Ja Vu. I thought perhaps I was having an acid flashback because everything in my field of vision began to dance and form tie die like shapes and colors. I touched the bird bath and scooped water on to my face. My girlfriend was terrified that I was going crazy. When the water touched my face, everything became clear.",
  "I returned to perfect normality- aside from the leftover adrenaline. Where I had been scared I was now amazed for I had come to realize the power of this plant.",
  "THIRD TRIP: THE BEATLES AND ME",
  "That same day, I returned home. However, it was not day. It was night. About 10:30. I had been listening to Abbey Road all the way home. When I arrived home I parked my car on the street, just below my driveway. I started the album over and lit up what was left from earlier that day. Wasnt not, want not, right?",
  "By the time I began to feel anything, the Album had reached song three, Maxwell Silver Hammer. The feeling of extreme weightiness came upon me. The details from here are fuzzy. All I know is that I experienced and extremely visual trip that lasted for at least 40 mins. I remember Ringo Star being seated in my passenger seat and Paul McCartney and George Harrison in the back. When I asked where John was, the three laughed as if we were good friends and said, Good one, John. Just relax. I eventually accepted that I WAS JOHN LENNON as if it were just truth. I remember seeing all kinds of Marine Life swim around me in mid air beginning with the song 'Octopus' Garden' the lasted until I saw Oysters on my dashboard singing 'One, two, three, four, five, six, seven, all good children go to heaven...' These lyrics occur much later in the album- at least 20 mins. The oysters and the Beatles seemed to fade out of existence with the transition of songs and I was once again myself and not John Lennon which was very difficult for me to accept at first.",
  "By this point I had moved my car [which I have no memory of actually doing.] I had parked it safely [thank God!] in  my driveway. I turned my car off, ejected the cd, and went inside. Fortunately, the door from the driveway led straight to my room/apartment- I would not have to deal with any of my family in my inebriated state. The details are also sketchy after this. I remember that all objects in my room appeared paper thin and I heard a Japanese voice over what sounded like a PA system announcing a final boarding call [God only knows how I understood the Japanese] for TWA Flight 480. I dunno. I fell right asleep and had some weird dreams.",
  "TRIP 4: Being a car.",
  "The aforementioned friend and I smoked in his car. I don't remember many details of the extreme visuals. Only that my friend seemed to stretch like semidried glue and become one with his steering wheel. I saw the shape of his face in the wheel and it spoke as we were tripping. As the trip neared an end, he seemed to come out of the wheel much like he'd gone into it but in reverse. After coming to, he said he'd experienced an out of body experience as the car. Go figure.",
  "TRIP 5: SEX AND SALIVA",
  "I didn't actually have sex while under the influence of this drug. But, I thought I did. AND I thought that I was a woman while having sex. Perhaps needless to say, I was disappointed with the guy's [who looked like I really do] performance. Hmm. I think Saliva taps into our deepest psyche and gives us a glimpse of ourselves we couldn't other wise see. For example, during this time, I was having doubts about my ability to perform sexually. Since this time, I've remedied that thank you.",
  "TRIP 6: ME, THE TREE",
  "I've read a lot of other stories about trips like this on Saliva since experiencing it myself. So, I won't bore you with all the details.",
  "I smoked the Saliva on a tree stump. Within minutes, I felt my physical form change into that of the tree I was sitting on. Not only that, but I experience the Oak tree's entire life from acorn to Giant to stump. I remember falling from a tree and being stepped on by an Indian, planting me in the ground. In what seemed like an eternity, I became a sapling, grew an enormous root structure, and became a giant. At one point, I remember talking with other trees about how nice it was to be a tree and how terrible it must be to be an animal. Then, in about what seemed like 1960 or so, men came to the area I lived and began constructing a neighborhood. I said goodbye to my friends and was cut down. Eventually, a young man came and sat on me.",
  "TRIP 7-10: Similar Trips",
  "Most of my other trips were very similar to those described above. Sometimes I was a bird, sometimes I was a beetle.</p>"
 ],
 "erowid": {
  "id": "37927",
  "citation": " Oak. \"Several Experiences with Nature: experience with Salvia divinorum (10x extract) (ID 37927)\". Erowid.org. Jun 17, 2006. erowid.org/exp/37927",
  "substance": "Salvia divinorum (10x extract)",
  "views": "5553"
 }
}
