{
 "title": "Its Arite",
 "author": "Shizzle",
 "citation": " Shizzle. \"Its Arite: experience with Catnip &Tobacco (ID 63485)\". Erowid.org. Apr 11, 2011. erowid.org/exp/63485",
 "substance": "Catnip &Tobacco",
 "bodyweight": "148 lb",
 "report": "<p>As I am on probation, and not supposed to smoke marijuana or drink. Lately I have been searching for alternative experiences. Since being put on probation last month I have experimented with DXM (which was not the first time), Skullcap, and began smoking cigarettes and pipe tobacco a lot more often.</p><p>Feeling experimental, I was aware that some users reported that Catnip produced some effects as well, so I went to the local store and got me a baggie of 'cosmic catnip' thinking it would suffice. That night, after reading a little more about the stuff I decided to take a trip out to smoke a cigarette, and took the catnip with me as well. I packed the first bowl half with catnip and half with cherry pipe tobacco. I lit up a cig and afterwards lit the bowl and finished that as well.</p><p>Having sorta expected an immediate onset I decided to pack another bowl, this one solely catnip. (I should mention that these bowls were not totally packed meaning I did not stuff the pipe full, but it sat in the bowl loosely enough to fill it to the top). I lit up the second bowl taking moderate 'hits' (as much as I could stand at a time --- the smoke is a bit harsh). I did not notice any certain taste bad or good, just a smokey 'flavor'.</p><p>Second bowl gone, and still not feeling anything too distinct, I opted for another bowl. I read in some reports that users vision was slightly delayed and/or distorted, but could not notice anything like that.</p><p>I smoked the third bowl and lit up another cigarette as I walked back inside. As I was walking, I *thought* I *may* have felt a little more sedated but could not confirm this. I got back to my room and sat down at my laptop and browsed more reports.</p><p>As I read I did notice feeling a little more sedated, but on the same level as when I was walking towards the room, no greater. During some points, I noticed the lights a little brighter, and oddly noticed the computer screen to 'sway' a little, it's rigid plastic shape was almost flexible as I read more reports, shifting slowly, but it was very mild.</p><p>I felt a little warmer inside and relaxed. I was slightly dissapointed that it was not more intense but the dissapointment was not enough to cause any distress. I was chill. My muscles seemed a little tense, and music was nice to listen to, but not really different than it would be sober.</p><p>A little later, say about 20 mins later, after reading one users experience of eating the stuff, I decided to try that method. I took a pinch of the cosmic catnip and put it on my tongue. It rested in my mouth a while until I finally swallowed it with a gulp of water.</p><p>20 minutes later I do not notice anything different than the effects of having smoked it. I am still a bit warmer on the inside, and pretty relaxed. About ten minutes later I began to feel the slight buzz that went along with smoking it. the screen began to dance a little again, but as of now this is the extent of it.</p><p>Overall, it's arite. Not bad, but not great. Maybe I did not consume enough of it. I am considering trying a bigger quantity (more bowls) if there is a next time, and knowing me and my quest for a feelgood there prolly will be.</p>",
 "year": "2007",
 "id": "63485",
 "gender": "Male",
 "timestamp": "2011-04-11T07:00:00.000Z",
 "views": "5880",
 "dose": [
  {
   "time": "0",
   "amount": "2.5 bowls",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Catnip",
   "form": "(plant material)"
  }
 ]
}
