{
 "id": 6351,
 "title": "Lunch King",
 "date": {
  "submission": "2007-11-09T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Grassman_3000",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I am a pretty experienced drug user, having smoked pot heavily for 2 years, a gram a day. But that is an entirely different story. An older woman watches our house when we go on vacation. After coming back from one of these vacations I walked into the guest room and noticed a bottle of pills. Oh what a great look must have been on my face when I realized that there were 40 vicodin pills of with 10mg of hydrocodone in each pill. I had a grin from ear to ear, I quickly called my friend Marshall and told him of my find. I have taken vicodin before but only in my home in private. I thought that I would take the pills the 2nd period before lunch. Marshall asked for some and was politely told to go fuck him self ;)",
  "The next day I woke up and could not wait to begin my journey, alas 2nd period rolled around after a considerable wait. I had not eaten breakfest so that I could take them on an empty stomach, I quickly gobbled 3 pills down as the teacher turned away. I felt the same for about 25 minutes then I felt a small high, like coming up on bud. Then about 50 minutes after I had taken them I felt very very happy and talkative. I felt as if everything was ok and the world was a great place. In simpler terms I was fucking high off my ass. By the time lunch rolled around I felt as if I could do anything. I walked around and had many converations with everyone. The words just flowed out of my mouth. I was on top of the world. I felt in every conversation that I had made a meaningful connection. I was at peace with myself and with everyone else.",
  "A total of 3 hours passed before I came down from cloud 9. I noticed that I was extremely irritable. Every time someone talked I wanted to just yell at them and call them a fucking moron. I just wanted to be alone and not talk to anyone. I also noticed that I was having trouble talking and listening. I could talk but it came out not making any sense. And when I spoke I could not tell if I was yelling or whispering. I felt semi sick but overall I was ok."
 ],
 "erowid": {
  "id": "37943",
  "citation": " Grassman_3000. \"Lunch King: experience with Hydrocodone (ID 37943)\". Erowid.org. Nov 9, 2007. erowid.org/exp/37943",
  "substance": "Hydrocodone",
  "views": "38027"
 }
}
