{
 "title": "Recreationally and as a Tool",
 "author": "PharmPhan",
 "citation": " PharmPhan. \"Recreationally and as a Tool: experience with Kava & Tramadol (ID 63550)\". Erowid.org. Jan 10, 2010. erowid.org/exp/63550",
 "substance": "Kava & Tramadol",
 "bodyweight": "285 lb",
 "report": "<p>As a fairly experienced user of opiate and psudo-opiate pharms (codiene, ultram, lortab, dilaudid, fentanyl etc.) I didn't expect much from a natural herb such as kava kava.  I have been a daily user of ultram for probably 5 years, taking as much as 1500mg/day or 25 50mg tabs.</p><p>Anyway, I ran out of ultram one day recently which for me can produce some fairly unpleasant withdrawl symptoms.  After some research online I decided to give Kava a try for a supplement to help me deal with withdrawl.  I went to the local healthfood store and picked up a bottle of 60 250mg 30% kavalactone tabs and popped 7 of them immediately.</p><p>I noticed no effects, but I also did not experience nearly the level of withdrawls I had in the past.  Of course by the end of the day I had managed to get my hands on a script for the ultram So I had to try em together.  I popped down 10 ultram and 15 kava tablets and within 30 minutes I felt great.  The kava seemed to compliment the ultram buzz very nicely.  I enjoy being functional, yet having a nice, euphoric feeling and state of mind.  Very nice.</p><p>After taking the 30% kavakava tabs for a few days, I decided to go online and get some higher kavalactone content geltabs (84%) I believe, from what appeared to be a higher quality, more reputable kava farm. Today I took 25 of the 84% kava geltabs (no ultram yet), making sure to pop a couple in my mouth, which produced a nice numbing effect, and really didn't taste bad at all. Within 25 minutes I felt relaxed and calm, just a nice buzz to sit around and relax and be happy.</p><p>All in all I like kava, and when I am ready to quit tramadol all together I think it will be a great aid, and something any opiate addict should try both recreationally and as a tool.  I guess theres good reason the pacific islanders have been using kava for thousands of years...Aloha! :)</p>",
 "year": "2007",
 "id": "63550",
 "gender": "Male",
 "timestamp": "2010-01-10T08:00:00.000Z",
 "views": "15103",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Kava",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ]
}
