{
 "id": 6360,
 "title": "Relative Knowledge",
 "date": {
  "submission": "2007-07-24T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lenin",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0:00",
   "amount": {
    "number": "1",
    "unit": "cup"
   },
   "administration": "oral",
   "substance": "Coffee",
   "form": "liquid"
  },
  {
   "time": "0:30",
   "amount": {
    "number": "1",
    "unit": "cig."
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "3:00",
   "amount": {
    "number": "1",
    "unit": "cig."
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Please bear with me here, folks. I know it's a bit lengthy, but the story that follows depicts a moment that was quite holisticly significant to my existance.",
  "I am a 23 year-old male living in a large urban center upon the Canadian prairies. I have considerable experience (mostly responsible) with pretty much all major psychoactive substances. Nearly all herbs and chemicals fit (or unfit) for human consumption can be found with relative ease in Big City Canadiana, and mushrooms are no exception. I have consumed hallucinogenic mushrooms numerous times over the course of several colourful years, and recently decided to consume some more.",
  "I had recently been cheated on for the first time with what happened to be a 'serious' girlfriend, and had subsequently broken up with her and severed contact. She had pleaded with me for a bit, and I was afraid that I would crawl back to her, only to be used again. However, she broke my trust and shattered a future of love and sacrafice that I thought we had dreamt of together. Ah, the Tramp who thinks it's a Lady! Ha! But I digress.",
  "It had been a dark few days of questioning for me, and I wanted to at last breathe deep and seek peace. I had also been in a largely philosophical mood the duration of the week, so a psychadellic experience at once seemed prudent. I realize that taking 'drugs' will not erase one's problems, nor shall it serve to enhance one's psychology if negative thoughts are imminent. However, I felt that an afternoon reflection was necessary, and decided to temporarily let psilocybin become the guiding chaperone of noveau perspective.",
  "It was a bright and fairly warm day in mid October when I elected to eat about 2.0 - 2.25 grams of pretty dry mushroom product. A little bit of this was a fine powder, and the rest were small chunks of stem coupled with a small cap or two. I consumed this with a glass of water on a fairly empty stomach.",
  "Shortly after eating the mushrooms I walked a few blocks to a nearby river and sat in a secluded area by the banks. It was warm outside and the sun felt delightful, especially after about 20 minutes, when, in the words of H.S. Thompson, 'the drugs began to take hold.' I sipped my coffee. Caffeine and THC are splendid psilocybin champions, and both seem to 'kick in' the latter drug faster, and enhance the intensity and duration of the experience for me. I slowly pulled on an herbal cigarette, staring at the lazy river. As my thoughts became skewed and my body a little lighter and fuzzy-feeling, I remember the typical organic feeling mushrooms often produce; that genuine 'oneness' with all things natural and in fluid change.",
  "After the smoking had been rendered complete, I had the strong desire to wash my hands and rid them of their herbal scent. After smoking I usually like to wash my hands, because I don't really enjoy the strong stale odour, and maybe I'm a little bit paranoid, too. At any rate, the only place to wash my hands at this juncture was the river. Please kindly remember that due to my funghi-induced state, this matter of washing the hands seemed quite important for some reason. I vividly remember staring out across the glittering river, and communicating, in a sense, to her (nature's always feminine, right?!?) silently through my mind and eyes.",
  "I was asking the river if I should wash my hands in her, and if that would be all right. Would it be tainting or polluting her waters? Would it even rid me of the herbal scent? The river looked pristine and pure; the brazen apex of nature and the culmination of sustinence. The river began quietly whispering to me, coaxing me towards her and attempting to calm my nerves. I was fairly grounded the entire time, and of course realized that I was not actually 'talking' with a river. However, this dialogue appeared within the corals of my mind, and I knew that it had been dormant thus far for a reason. The river was now telling me to wash my hands within her being.",
  "I was about to stand up (I was sitting on a log by the banks) and go to the river when she continued her sentence. This sentence seemed louder than the rest and struck me dumb. She said 'I give you my word.' Suddenly I pondered, 'Why is she so insistant? Why do I need to be wet? I shall be happy as I am. Why should she feel the need to convince me of my need to cleanse what is upon me?' And then I knew. This river was not as clear as it appeared. This was an urban, industrial river: polluted and ravaged, and my hands would not be the first to feel her force. She was unpure.",
  "As I sat there I remembered my ex-girlfriend and her attempts to negate the pain she had caused and to justify and highlight her 'sincerity.' She had said the words, in a moment of superficial and laughable honesty, 'I give you my word.' And she was the river and the river was she. What appeared the crest of a beautiful wave was sterile gray loathing, a false sentence spat by a false being.",
  "All of these thoughts raced through my mind almost instantaneously after the river finished her words, and suddenly I replied: 'I know what your word is worth, and the word is the person.' To me this was not mere truth. This was Truth. I would not wash my hands in the filthy river because I knew what lay beneath the surface. The satisfaction of ridding myself from what was upon me (the herbal odour) was neutralized by the thought of succumbing to the empty promise of the unpure river.",
  "I knew then that my life must be dictated along the same path. Momentary satisfaction or peace of mind cannot overwhelm the urgent need for long term happiness and confidence. I would be happy with my hands, even if they did temporarily smell like Amsterdam. I had created the situation and I would let it come to pass. I would not trust a river that offered no real solution or sincerity, and I would not pollute my confidence and wellbeing to feel her narcotic wetness once more. On a parallel note, I would refuse to take back a woman whose blade was still lodged in my spine. For I knew what her word was worth, and the word was the person.",
  "Following this experience, I basically sat on the log by the river temptress for a few more hours and eventually smoked another fancy cigarette whilst gradually returning to baseline and small 'r' reality. The whole time I contemplated my conversation with the river, and realized that I was worth my word, and my word was that of honesty. I am FAR from perfect, of course, but at least I am trying to change. In days following the said spiritual journey, I have realized that my creed is to follow what is within me and embrace what is upon and around me. At the same time staying true to myself dictates a life without a certain cruel woman, and a life devoid of her whispering wet facade."
 ],
 "erowid": {
  "id": "37993",
  "citation": " Lenin. \"Relative Knowledge: experience with Mushrooms,  Coffee & Cannabis (ID 37993)\". Erowid.org. Jul 24, 2007. erowid.org/exp/37993",
  "substance": "Mushrooms,  Coffee & Cannabis",
  "views": "8944"
 }
}
