{
 "id": 6361,
 "title": "Medication-Inhibited Trip",
 "date": {
  "submission": "2007-12-05T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Skip",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "0.25 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I take the following medications daily:",
  "200mg Wellbutrin SR",
  "50mg Paxil CR",
  ".5mg Clonazepam",
  "This was my first attempt at shrooms. I smoked approximately .25g of marijuana to help curb the nausea and anxiety I was anticipating from the shrooms. Then, over a course of about 20 minutes (between 11:00pm-11:30pm) I ate the entire eigth. I was surprised at how they smelled like a cow's ass, yet reminded me of eating a shitty raisin. The stems were chewy, but the caps were crunchy, in fact, when I bit down on the caps they basically exploded into a cloud of dust. I think the cottonmouth [from the marijuana] helped in blocking the true taste.",
  "I sat on my bed and watched TV for about an hour, waiting for the shrooms to really kick in...no such luck. I had an EXTREMELY mild trip for eating an entire eigth. The only difference I noticed from the usual marijuana high was:",
  "1. When I stared at something, my peripheral vision would distort slightly.",
  "2. The lights on my ceiling fan seemed to pulse when I glanced at them, but no halos.",
  "3. I also noticed an elevation in mood.",
  "Over the course of the night I smoked two or three more times as well. I stayed up until 5:30am waiting. I was so damn sure that if I had fallen asleep the shrooms would kick in and I would waste my trip, but as you can see, that was irrelevent.",
  "Best believe I called my friend [who got me the shrooms] and informed him of my experience, or lack thereof. He informed me that the other people who bought some of the batch, and had taken a lower dose than I, had good trips. He said it was more of a body trip (i.e. few if any visuals), however I did not. He and his girlfriend said they didn't really trip too hard their first time but...I mean...I ATE AN EIGTH!",
  "I suppose I can only chock this up to 'shit happens' and or possibly my meds."
 ],
 "erowid": {
  "id": "38007",
  "citation": " Skip. \"Medication-Inhibited Trip: experience with Mushrooms, SSRIs (Bupropion & Paroxetine), Clonazepam & Cannabis (ID 38007)\". Erowid.org. Dec 5, 2007. erowid.org/exp/38007",
  "substance": "Mushrooms, SSRIs (Bupropion & Paroxetine), Clonazepam & Cannabis",
  "views": "10426"
 }
}
