{
 "title": "Dreams Better, But Not Lucid",
 "author": "Karl",
 "citation": " Karl. \"Dreams Better, But Not Lucid: experience with Calea zacatechichi (ID 6362)\". Erowid.org. Apr 20, 2001. erowid.org/exp/6362",
 "substance": "Calea zacatechichi",
 "bodyweight": "145 lb",
 "report": "<p>Having read books on lucid dreaming but achieving no results personally, I was ecstatic to come across an herb that promoted this phenomenon. I received one ounce of Calea and promptly prepared it the same night. I read that the preparation should consist of a handful of leaves (about one ounce). I wrapped the ounce of leaves up in a thin cloth, and then tied it up with dental floss so that the chemicals would blend into the water without the plant itself getting into the water. I simmered this for around a half hour using about 300 cc tap water.</p><p>Well let me say, this is THE most disgusting, unpalatable, horrendous taste I have or will ever know. I don't think there are words in the English language powerful enough to describe the foul taste of this stuff. The only way I can come close is to say it tastes like earwax and soap times 100. People say Kava Kava tastes bad. This makes Kava taste like Coca Cola. Needless to say, I was unable to get most of it down, it was that bad. I then smoked around two cigarettes of the plant and began to lie down. I noticed no abnormalites (such as hearing one's heartbeat) and promptly fell asleep. While I experienced no lucid dreams, I did remember three entire dreams the next morning. This is very rare to remember three for me. I didn't feel at all unusual the next morning.</p><p>All in all, I would say I failed to experience the full effects since I was unable to drink much. I do believe, however, that this plant can provide better dream experiences, and I am not done with this herb. Next time I will use a smaller dose mixed with other herbs and sweetened so that I can at least get it down. Crushing the plant and putting it in gelcaps may also work. If you decide to try Calea, use small amounts of the plant in your tea and drink more of it so you can get it down.</p>",
 "year": "2001",
 "id": "6362",
 "gender": "Male",
 "timestamp": "2001-04-20T07:00:00.000Z",
 "views": "18410",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "26 g",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(tea)"
  },
  {
   "time": "",
   "amount": "2 joints/cigs",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": "(leaves)"
  }
 ]
}
