{
 "id": 6366,
 "title": "A Unique Feeling",
 "date": {
  "submission": "2004-11-12T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "provsrock",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "7 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "200 mg",
   "substance": "insufflated"
  }
 ],
 "report": [
  "At around 11 o clock, my friends and I began drinking. It was nothing new. After about 7 shots or so of some vodka, I started to feel a pretty heavy buzz. At this time I remembered the Provigils I had recently collected from a friend.",
  "I have had experience with provigils before, and they have all been quite similar to the experiences listed online, but this was a truly different experience. I pulled two 100mg provigils from a bag and proceeded to finely crush them and form them into two large lines. I was expecting the normal upper feelings with the unique provigil intoxicated high that comes along.",
  "However, after my first line, the effects were immediate. I all of a sudden became heavily intoxicated yet almost clear at the same time. I sprawled myself on the floor where I could tell that sight and sound was amplified but somewhat unimportant to me. I then daringly snorted the next line which gave the same immediate feeling. From then on stuff began to get a little blurry, but I remember trying my hardest to have a normal conversation, but all I could focus on was the way my own voice sounded. It was almost as if I was hearing my voice echo. The experience was very enjoyable and I would definitely recommend it.",
  "Though the experience sounds very hallucinagenic, I believe that the unique feelings were just due to the strange combining effects of the drowsy intoxication of alcohol and the high of provigil."
 ],
 "erowid": {
  "id": "38043",
  "citation": " provsrock. \"A Unique Feeling: experience with Modafinil (Provigil) and Alcohol (ID 38043)\". Erowid.org. Nov 12, 2004. erowid.org/exp/38043",
  "substance": "Modafinil (Provigil) and Alcohol",
  "views": "26374"
 }
}
