{
 "title": "I Didn't See a Thing",
 "author": "Tang",
 "citation": " Tang. \"I Didn't See a Thing: experience with Salvia divinorum (60x extract) (ID 63665)\". Erowid.org. May 24, 2008. erowid.org/exp/63665",
 "substance": "Salvia divinorum (60x extract)",
 "bodyweight": "",
 "report": "<p>BACKGROUND</p><p>I had wanted to get hold of a hallucinogen for a while - it was the wrong season for mushrooms, acid seemed to have evaporated from the area and the only person I know who deals 2c-b didn't have any in. I have tried legal hallucinogens - Hawaiian Baby Woodrose seeds, Morning glory and Amanita Muscaria before with no great effect - certainly no open eye visuals (something I have never experienced). I have also tried disasociatives such as ketamine and ether - again with no response other than being unable to move for a while, even after taking a whole gram of ketamine in one go.[Erowid Note: 1 gram of ketamine is considered an extremely high dose, see Ketamine Dose Chart] MDMA completely failed to do anything in terms of hallucinations, even when a whole gram was consumed in one go.  [Erowid Note: 1 gram of MDMA is considered an extremely high dose, see MDMA Dose Chart] I have never tried acid or mushrooms, so I don't know if those potent hallucinogens will work for me. So, in a desperate search for something to make me hallucinate, I found Salvia. I looked online and found a site offering 2 grams of 60x extract (cherry flavored) for 30 pounds sterling, which I bought.</p><p>SET AND SETTING</p><p>When it arrived I went outside, as the sun was lancing down on the grass - a rare enough experience in England, and one I wanted to enjoy. I sat on the lawn and rested up against a small garden wall, turned on my iPod and selected 'Cody' by 'Mogwai' and put it on a loop. All of this was to ensure that the 'setting' was correct - Cody is one of the most relaxing songs in existence, the sun is glorious and I was in the safety of my own garden, comfortably resting in the light. I breathed deeply and slowly to induce a state of calm so that the 'set' would be correct. I had seen bad trips and I had heard how powerful it was - I wanted to minimize the risks of following this.</p><p>PREPARATION AND COMSUMPTION</p><p>So I took out one of the vials and half loaded my pipe bowl - It can't have been more than 1/8th of the gram - probably more like 1/10th. I have no apparatus for measuring such small masses, so I couldn't check. The smell of cherry was instantly strong and overpowering - that's what you get for ordering cherry flavor. Unlike when smoking tobacco through the pipe, I didn't try to light it and allow it to burn down - I held the flame above the pipe and then drew a deep long breath into my lungs - I kept drawing until the material in the pipe had turned to ash before I extinguished the lighter flame.</p><p>It was painfully hot - not something that someone who has never smoked before is going to be able to do first time. I have smoked both tobacco and cannabis in the past, so I have a tolerance to the pain. Nonetheless, it was still painful for me, especially as I had to hold it down for 20-30 seconds. I tried counting in my head as I held it, reaching 20 before I released the lungful. This is not an accurate measurement of time as I did not start to count until I had drawn all the smoke in, and the material was incinerated - which took 5-10 seconds. Also towards the end of my counting I became confused as the salvia kicked in so my measurement of seconds is subject to doubt.</p><p>ONSET AND PYSICAL EFFECT</p><p>After 15 seconds the effects of the salvia became apparent, by 20 I was sweating profusely, my body felt uncomfortably hot and sticky and my jaw began to have a feeling of a certain shooting rigidity - almost like a muscle clenched that I couldn't unclench. My clothing became uncomfortable and I had a strong urge to take it off (which I resisted). During this time I controlled myself, and did not move from my spot, even though I had the urge to dash to the shower to cool myself down. I forced myself to relax and accept the sweating and great discomfort.</p><p>VISUAL EFFECTS</p><p>I was expecting some kind of vivid imagery - to see things that were odd or curiously out of the usual - my garden remained as it was, although the grass did appear to be rising to meet me without moving at all - the usual mild distortions and long lived after images that I have experienced before. Some may call these hallucinations - but if they are all that is to be experienced through hallucinogens I can barley understand the attraction of them. They were nothing like the kaleidoscopic LSD visuals I had seen depicted in art, nor were they like the MDMA induced experiences my friends had had - seeing dead kings on biers born through night clubs etcetera. It was remarkably boring in terms of visual effects.</p><p>MENTAL EFFECTS</p><p>At the time I was in a confused mental state - when I closed my eyes I came to believe that there were people around me, but when I opened them again, it became apparent that it was a delusion rather than a hallucination. However, when I closed my eyes again, for a sustained period of around 5 minutes I certainly felt strongly delirious - it was not that I saw anything at all - only the darkness under my eye lids - but that it seemed that there were two ways to look at things - I was solidly fixed in reality, seeing what was there only, smelling and touching and hearing only what was there - but I could see how others could slip into another world where imagination became super-imposed on reality. I could feel suggestions from that world. I am using world in a strongly figurative sense  I am an Atheist  when I say world I mean that some can break through the mental barrier that separates imagination from invading reality under the influence of drugs or otherwise, and some cannot so easily.</p><p>The suggestions came across not as reality but as suggestions as to what reality could be. Thus I knew that I was sitting on the grass with my back against the wall, but I also knew that I could be in a different reality, in this case a lilting octagonal tower, with people calling me from each parapet. I did not come to believe that I was in the octagonal tower, but the idea became suddenly apparent and forcefully suggested  You are not, but you might be.</p><p>Still it was not a sensory hallucination  I had no sensation of sight or touch or smell of the octagonal tower, it was just a thought  all the time that I was thinking of it I still saw the inside of my eyelids, and felt the grass under my hands, and smelt the smoke and cherry and fresh clippings. It was such a full on, sensory experience that I had wanted  I have dreamt more powerfully and certainly less uncomfortably before  and again, I was let down. After 10 minutes at most the sweating died down, and the comfortability with it  I was left with a deep feeling of relaxation which, too, left 10 minutes afterwards.</p><p>EVALUATION</p><p>As to whether it was worth it or not  I got the salvia at the best price I could find (,15 for 1 gram), and perhaps it was worth it just to be able to know that it doesnt work for me. I have more left so, before I post this I will try it again a few times  some people have indicated that there is a reverse tolerance.</p><p>Summary:</p><p>Dosage  1/10th of a gram, 60x extract</p><p>Consumption methods  smoked in a metal pipe</p><p>Set and Setting  positive</p><p>Experience  Neutral</p><p>EDIT: I have tried it again and again with no real difference. It is still as powerfully uncomfortable every time.</p>",
 "year": "2007",
 "id": "63665",
 "gender": "Male",
 "timestamp": "2008-05-24T07:00:00.000Z",
 "views": "5735",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
