{
 "title": "The Tent of Dreams",
 "author": "Luke&Lucy",
 "citation": " Luke&Lucy. \"The Tent of Dreams: experience with LSD  (ID 63699)\". Erowid.org. Jul 20, 2007. erowid.org/exp/63699",
 "substance": "LSD ",
 "bodyweight": "11 kg",
 "report": "<p>Im 17 and live in England and about 2 days ago I tried acid for the first time, and it was amazing! I have done a few other drugs before such as MDMA, marijuana, mushrooms and salvia. I generally tend to take it easy though when I take drugs by not taking them very often and taking them with good friends in good situations. Ive wanted to try acid for about 2 years now ever since I was still in high school, simply for the experience. It has been ever since then that I have been researching LSD and its effects to better prepare myself for the trip, which actually helped quite a bit.</p><p>Now, I received a phone call from my friend Z a couple of days before we did it asking if I wanted to do it with him and some of our friends and of course I right away said I would. The plan was that we would camp out in some woods near home for the night and take a tab each. It would be me, Z and E taking it for the first time. I dont really know E very well but hes a well nice guy and I was happy to do it with him. Someone else who I dont really know called H was doing it with us but hes done it a couple of times before so he was a little more experienced in this drug than we were. A load of Hs friends were joining us this night as well but they never did take it that night with us.</p><p>So anyway, we set up camp ate the tab of acid, which was tiny and plain, and me, Z and another friend S (who was taking MDMA for the first time that night, but no acid) went for a walk through the forest to explore. It was about 20 minutes into this walk that both me and Z started feeling the effects of the acid very mildly. Things began to look out of place and a little brighter and clearer. Objects began breathing and crawling and we sat down on a hill and really started noticing the effect come on, it was when we started heading back to camp about 30 minutes into the trip that this section of the trip leveled out and we got used to it. On the way back we sat on a hand carved bench with two bears carved onto the arm rest and I had my hand on the bears head which again seemed to be crawling and my hand was doing much the same. Me and Z started looking at this tree in front of us and noticed it swaying, however according to our friend S it wasnt. As we walked down a set of stairs coming closer to camp the steps seemed much larger drops than usual and when I turned around after going down them I found they were in fact very shallow steps.</p><p>Now back at camp, roughly 1 hour into the trip things really started coming on. Our friends at camp had set up a huge fire in the center and everyone was stood around it doing their own thing. Walking around the site I began becoming really confused and unsure of what I should be doing. I had a strong feeling of anxiety throughout the trip, not sure whether to be sat down, stood up or walking. Some more of my friends had turned up now and I tried talking to them but with great difficulty, I struggled to find words to say and to say them. I remember a general feeling around the camp of a sort of 60s theme and very tribal atmosphere. I saw my friend stood over the fire with a large stick and thought he was some tribal man, even though I knew he was my friend. Soon after I got the stick which as I mentioned is the single greatest stick ever. I waved it and saw blue, green and purple tracks coming off it.</p><p>I had an overwhelming desire to keep this stick with me at all cost. At one point in the night someone actually threw it in the fire and burned it which was a very difficult experience yet quite amusing at the same time. However when I still had the stick I saw a guitar and dropped the stick without even noticing it and went to the guitar. As I tried to play the guitar I noticed the stick and felt nothing for it anymore, all my love was now focused on the guitar. Trying to play was unbelievably difficult. The strings were hard to find as I could see them and the guitar seemed so much smaller (I later found out it was a  size guitar).</p><p>I went to look for my friend Z so I went over to one of the tents and shouted for him. I heard his voice from the tent so I attempted to go in. On the outside the tent had flowers all over it and these flowers were growing, shrinking, crawling and shifting all over the surface. I found the entrance of the tent and waited for someone to open it as I had no idea whatsoever where the zip was. Someone managed to open a small hole which I somehow crawled into with great trouble. As I got inside hands were all over me helping me in and arranging me into a position suitable. Before I knew it I was sat down inside with about 4 other people. There was one small light inside the tent which was flashing everywhere disorientating us all. This tent felt as though we were in a ball of silk completely unaware of where the sides, top or bottom was. I wasnt even sure if we were level. At one point I thought we were upside-down. As far as I knew this tent was all there was, there was absolutely nothing on the outside, and it was just the tent. This was probably the most extraordinary experience I have ever had.</p><p>After this we decided to head to our friend Bs house. He was a little drunk but very capable of taking us there so he led the way. We went across a small patch of forest which seemed like an endless plain with random trees dotted around, this walk seemed to take hours. The whole journey took around 20-30 minutes but honestly felt like 14 hours! We walked along a footpath surrounded by trees when suddenly one of our friends shouted look at the sky we had been looking at everything but the sky all night and when we looked up we were amazed.</p><p>It was like looking through a diamond, the stars were fantastic, there were shades of blue, red, orange purple and any colour you could think in these little lights. They were all connected by lines of red and there was a purple glow to the surrounding sky. It was simply the best thing I have ever seen. When we arrived at Bs house we went to his living room which had photos all over the walls. When we looked at these photos it looked as if they were 3D holograms which were all moving inside the frame, they were absolutely fascinating and we ran around the entire house looking at these amazing moving photos. One of them was of a horse galloping through water, me and Z were both looking at it and both seeing it actually running in the picture with the water spraying up.</p><p>There was a clock on the wall which I couldnt help but look at every 2 minutes, time had seemed to slow down so much. Throughout the entire trip time felt as if it slowed down 100 fold! This was a slight annoyance but quickly passed my mind when I found something of interest.  Me and Z left Bs house to head back to camp which we found surprisingly interesting. By this point we were roughly 4/5 hours into the trip and slowly returning to reality. We were still extremely high still but things made much more sense though the visuals were still going crazy. On the way back we watched the sky and a plane flew across the center of it, it seemed as thought the plane cut the sky into two, and Z began explaining how he could see colours like a prism coming from the smoke trail left by the plane. As he mentioned it I could see it too. We watched this and talked about our trip for the rest of the night and eventually when the sun rose we left the camp site to explore our tracks that we made that night. Walking this journey flooded so many memories and seemed a good way to finish the trip.</p><p>Ive not explained everything that had happened, just the best bits and what I could remember. This trip that I experienced was the single greatest thing I have ever done and I plan on trying acid some time in the future, however I am in no rush as I have seen it, done it and enjoyed it.</p>",
 "year": "2007",
 "id": "63699",
 "gender": "Male",
 "timestamp": "2007-07-20T07:00:00.000Z",
 "views": "3890",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
