{
 "title": "Hyper",
 "author": "Merlin",
 "citation": " Merlin. \"Hyper: experience with Passion Flower & Mushrooms (ID 63703)\". Erowid.org. Jun 15, 2007. erowid.org/exp/63703",
 "substance": "Passion Flower & Mushrooms",
 "bodyweight": "125 lb",
 "report": "<p>I had read that passion flower increases the potency of mushrooms.  I recognized the flower from pictures as one I had seen growing around my area.  Mushrooms are my favorite so I was keen to try them with the flower.  Recently I went out looking and found one mushroom (I think the species is psilocybe cubensis) and a passion flower vine.  I picked two flowers.  By the way these flowers are very beautiful!</p><p>I tore the flowers up and left them to soak in 2 cups of water for a couple of hours, waiting for evening.  Then I boiled the mixture for several minutes, added more water and boiled a little more.  Then I added a tea bag to the mixture, Lipton.  Because there was only about 2 cups of water I only soaked the bag for 2 minutes.  I drank the tea, flowers and all, and waited about 40 minutes before ate the mushroom.  The tea tasted normal.  I forgot to weigh the mushroom but I guess it to have weighed 15 or 20 grams.</p><p>The onset was normal for mushrooms.  An hour after eating it I was quite high.  I stayed high for 7 or 8 hours.  Id say the effects of the mushroom were roughly doubled in intensity, but it was different than normal, I didnt like it.  It made me hyper but at the same time I didnt want to do anything.  The high had a sharp, uncomfortable edge I didnt like, and it was the same from beginning to end.  I don't think I'll ever take passion flower with mushrooms again.</p>",
 "year": "2007",
 "id": "63703",
 "gender": "Male",
 "timestamp": "2007-06-15T07:00:00.000Z",
 "views": "6003",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "2 flowers",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:00",
   "amount": "2 flowers",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:40",
   "amount": "1 cap",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  }
 ]
}
