{
 "title": "The Quest for Pain Relief",
 "author": "Chronic Pain Boy",
 "citation": " Chronic Pain Boy. \"The Quest for Pain Relief: experience with Barbiturates (Butalbital), Codeine & Caffeine (ID 63700)\". Erowid.org. Nov 15, 2007. erowid.org/exp/63700",
 "substance": "Barbiturates (Butalbital), Codeine & Caffeine",
 "bodyweight": "148 lb",
 "report": "<p>Just a little background: I've had chronic pain for about 6 months, and nothing but opioids have worked for me. I've dabbled with hydrocodone, oxycodone, hydromorpone, morphine, tramadol(basically sugar pill compared to everything else), once a small amount of codeine (negligible effect, And that's all for opioids. For non-opioids, just butalbital,pregabalin, DXM, diphenhydramine, and dimenhydrinate. All of those (sans the OTCs and the hydrocodone, which was also my dad's and I used during a pain crisis,  were presribed to me in the last 6 months).</p><p>My love of opioids began when I was 13 and tried my very first pill: percocet (hell of a drug to start out with, especially for a 13 year old) and I knew I was in love. I subsequently proceeded to use the rest, seeing as my parent had long forgotten there were still some left. I recently considered cold water extraction, so I decided to try it with the 6 fioricet w/ codeine pills I had gotten from the ER yesterday when I went in for a migraine I've been on this at least 3 times in the past (and it has done nothing) so I decided to try cold water extraction to get the acetaminophen out so I could take a larger dose in hopes of some pain relief.</p><p>+0:00: Ingested bitter cold water extraction mix.</p><p>+0:010: Feeling the codeine and possibly some butalbital coming on, got a pleasant buzz going and of course the beginnings of the warmth associated with opiates.</p><p>+0:20: Definite opioid feelings of warmth and a slight euphoria, although I am not a big fan of what I am assuming to be the butalbital feelings, my head is very foggy. Inserted a 25mg promethazine suppository about now, this should increase the efficacy of the codeine and help with any nausea or itchiness that might occur. Finding it a little bit hard to type, not because of disorientation but because of how clouded my brain feels. Naturally a little bit tired after not sleeping last night due to pain. Haven't noticed any caffeine effects as of yet. Slight pain reduction :) although not much euphoria :(</p><p>+0:40 Not much has changed, just laying down listening to music, feeling essentially the same. Still just very mild euphoria, but that's codeine I guess, mild.</p><p>+1:00 Not much has changed so far, head is slightly less cloudy though :)</p><p>+1:35 Still nothing, pain is basically at its average of 5 1/2 of possible 10, feeling a bit more alert, possibly the caffeine?</p><p>+2:00 Pretty much nothing. I feel like I wasted 45 minutes on the whole extraction process. Oh well.</p><p>+2:05 Starting to feel the come down effects, not too bad.</p><p>+3:10 Wow, over so soon.</p><p>My overall review of codeine is although I've heard it's a good starter opioid, it doesn't really do the others justice, anesthetically or euphorically. I'd recommend it only if you have a mild headache or just feel like getting a bit of a buzz.</p>",
 "year": "2007",
 "id": "63700",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-15T08:00:00.000Z",
 "views": "31220",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "180 mg",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(extract)"
  },
  "1": {
   "time": "",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Barbiturates",
   "form": "(extract)"
  },
  "2": {
   "time": "",
   "amount": "240 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(extract)"
  }
 }
}
