{
 "id": 6371,
 "title": "The Exploded Mind",
 "date": {
  "submission": "2008-01-16T08:00:00.000Z",
  "experience": "2003"
 },
 "author": {
  "name": "Hash Eater",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(tea)"
  },
  {
   "time": "1:00",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Five of us, decided on attempting something unknown to us, and that is snorting DPT an hour after taking a MAOI (syrian rue). Cautious of the dangers, and risk to ourselves, we decided to take the risk, and take a leap into the chaos to come.",
  "Setting - House, dimmed lights, with music playing via computer playlist.",
  "It's been an hour, and the MAOI is in full effects, we all eyeball our lines, and snort it up, the onset starts when I feel the gross drip. Immediantly visual disturbances begin. [Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at small doses, eyeballing is particularly unwise. See related article]",
  "The air is moving in front of my face like a river, this is crazy feeling, already a much more potent experience than other DPT sessions. 3 of us go and venture outside right away, the other 2 need to sit down, and calm down, the effects are gaining strong on all of us. I open the door, we run outside, it the night sky was dazzling with chaos, the stars, moons, plants were all moving, it was also beginning to rain, the relections of the rain drops just brought on more intense feelings. The rain continued to get harder, we all took our shoes off, and went back inside, the dramtic change of climates, or just the drugs themselves (most likely both) threw me into a crazy psychosis.",
  "Buzzzzzz My body was vibrating (literally), at least the 3 of us who went outside were all uncontrolably shaking, basically convulsing at times, thoughts of overdose, and death of course are nessesary for this psychosis to become psychotic, and I tried to reason with my mind what was going on, I was seeing halo's inside of halo's rotating with infitinite more halo's in a giant spiral opening a hole in the middle of the air to a fifth dimentional looking pattern, inorganic shapes, and images dominated most of the experience, the icons on the computer looks HUGE!, everything was way out of proportion.",
  "I stumbled around saying ' I think I should be doing something right now ' I assumed it was daytime, and somehow my day got rearranged, and I was late for a important date. These overwelming thoughts, and hallucinations hit a peak, and in this peak I heard people in the background vomiting who I couldn't even see, so naturally, I vomited, I was vomiting, and I tried to hit the toilet, but it was all around the toilet, and it was a purple slime, and it made me sick looking at it, or trying to clean it up, and I wasn't able to go bak into the bathroom, and clean it up for another hour or longer. The trip was long from over, and until this point we had all felt very isolated, we all grouped together, and shared our insanity we were experiencing, this was very relieving, and I know knew I probally wasn't going to die. ",
  "To sober us up, I turned on a Family Guy episode, which took me great effort, and right away, X said 'I don't think we should be watching this', and he was right. Peter had been cut into four, and rearranged he had arms coming out of his head, and his legs were part of the house, nothing made any sense at all. I quickly turned it off, and a more suitable way to buzz away was to listen to some aphex twin, and nintendo themed techno music, the first song was a donkey kong remix, and this mellowed me out ALOT. the vibrationas started subsiding at the 2 1/2 hour mark, it seemed double that time though, time distortion played a big part in this trip, and we all finally came down. This was my last experience I had with DPT.",
  "Looking back on it, I only think... Too much.... It was too much..."
 ],
 "erowid": {
  "id": "38055",
  "citation": " Hash Eater. \"The Exploded Mind: experience with Syrian Rue &  DPT (ID 38055)\". Erowid.org. Jan 16, 2008. erowid.org/exp/38055",
  "substance": "Syrian Rue &  DPT",
  "views": "7219"
 }
}
