{
 "title": "Addicted to Extacy?",
 "author": "MDGurl",
 "citation": " MDGurl. \"Addicted to Extacy?: experience with MDMA (ID 6371)\". Erowid.org. Apr 21, 2001. erowid.org/exp/6371",
 "substance": "MDMA",
 "bodyweight": "146 lb",
 "header": [
  "DOSE:",
  " tablets",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>I first tried ectacy on July 4, 2000... It took about 1 1/2 hours to kick in, and bu then I was on the subway home from the fireworks. It was amazing- I was talking to everyone around me, and I couldn't stop smiling- I was in ectacy! The next day I didn't get depressed like most people do, thats probably cause I am on an anti-depressant. After that I would pop about 2 pills, but I never was REALLY rolling. I went up to 3 and that was a little better, I was doing ectacy out of control, about every other day. One night I took 5 1/2 in about a 2 hour span. I layed down on the floor of the hotel room, and got the worst splitting headache I have ever had- it hurt to move, and I whatever I thought I was thinking in my head, I was really saying out loud. After that I took about 3 1/2 every time I rolled. Once school started I would roll every weekend, sometimes twice in one weekend. Then I slowed down a little. Around Christmas I started hanging out with some new people and my *new* best friend dealt Ectacy so I could get it whenever I wanted, I was doing it again whenever I could, sometimes on weekdays. Finally I looked at my friend and saw what it was doing to her- she was obcessed with extacy- she did it about every other day. I cut off my friendship- because I realized that when I was with her all we did was drugs. Now she has moved on to Coke- and has even gotten some of my other friends to do it. She was out of control.</p><p>All I have to say to anyone who is thinking about trying ectacy is: Its an awesome drug, it makes you feel incredable and you meet lots of new people, but be careful to not let it get out of control, and be careful!!! Drink lots of water and have fun!!!</p>",
 "year": "2000",
 "id": "6371",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-04-21T07:00:00.000Z",
 "views": "60056",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
