{
 "title": "Throwing Up White Foam",
 "author": "mookie",
 "citation": " mookie. \"Throwing Up White Foam: experience with 2C-T-7 (ID 6372)\". Erowid.org. Apr 22, 2001. erowid.org/exp/6372",
 "substance": "2C-T-7",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 mg",
   "insufflated",
   "2C-T-7",
   "(powder / crystals)",
   " T+ 0:15",
   "3.0 mg",
   "insufflated",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>\n I receiving 250mg of 2C-T-7 a couple weeks ago, and was pretty enthusiastic about trying it.  Unfortunately I had no scale accurate to the mg.  Eyeballing a 30mg oral dose made me nervous because I didn't want to take too much for my fist time. Despite all the negative reports about snorting this substance, I decided to eyeball out a VERY small pile (would fit on the head of a pin) and up my nose it went. I assumed this to be only a couple mgs and was probably about right...(by the way eyeballing this substance is extremely foolish, so I intentionally eyeballed much less than what I thought I should take).</p><p>Not much happened except intense burning so after like fifteen minutes I did the same amount again... more burning... getting worse... worse... Ouuch! snorted some water to allieviate the pain with no success. When I looked in the mirror I noticed the viens in my forehead were bulging out as if I was standing on my head! This concerned me (possilbly an increase in blood pressure??) Anyway then I started feeling it... my muscles started tensing up and the nausea grew in intensity.  Then I started to throw up, only it wasn't throw up, it was white foam, like the head of a beer.  Once there was no foam left I dry heaved a couple times.</p><p>Now I was freaked out.  I remembered hearing that this happens when people O.D. on cocaine (and later found out this also happened to one of the people who died from 2C-t-7).  Anyway now I'll tell you about the trip.  It sucked.  Muscle cramps, back pain, and headache similar to real 'dirty' acid (negative effects lasted two days though). Mild visuals,lots of nausea. At this point I really felt like I had wasted my money.</p><p>However, a couple days later I decided to try it orally, hearing it was much cleaner, and it was. I mixed it with a couple grams of creatine so accurate doses could be weighed on a scale, and took the equivilant of 30 mg. It was beautiful. Like a weak hit of E, with LSD like qualities, no nausea, no muscle cramps or headache. I thought this might be one of my new favorite substances...until the recent deaths associated with this compound surfaced [erowid note: Report submitted April 2001].</p><p>Now i'm considering throwing the rest out and dealing with the financial loss, unless more info regarding its safety is learned. This really scares the hell out of me. One thing seems obvious, it is posible to overdose on this substance especially when snorted.  Don't be foolish by snorting this stuff, and if your going to take it orally be aware you can still die. Don't mix it with other substances either (except possibly MJ, which I actually highly recomend). We dont even know all the physiological effects of the drug itself, let alone in combination with other drugs. Also, don't go for mind blowing visual experiences, it just too risky, small oral doses can significantly elevate your mood and give a great body buzz with less potential complications.</p><p>This last April should be a tragic reminder to us all the potential dangers of taking synthetic designer drugs, these research chems may be much more dangerous than our illicit street drugs. Please keep yourself and others informed so we can prevent any more tragedies associated with this substance.</p>",
 "year": "2001",
 "id": "6372",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-04-22T07:00:00.000Z",
 "views": "18445"
}
