{
 "title": "Burning/Sizzling Spider Web",
 "author": "Laura",
 "citation": " Laura. \"Burning/Sizzling Spider Web: experience with Salvia divinorum (60x extract) (ID 63793)\". Erowid.org. Oct 22, 2007. erowid.org/exp/63793",
 "substance": "Salvia divinorum (60x extract)",
 "bodyweight": "127 lb",
 "report": "<p>This was my second experience with Salvia Divinorum. I tried the 10x concentrate about a year ago and felt no effects. This time I tried the highest concentration available to me, 60x.  For a little background on me, I have ingested LSD on 3 occasions, eaten psilocybin mushrooms twice, smoke cannabis on occasion, and am a healthy, athletic woman in my 30's. I have been on Celexa (an SSRI) for several years.</p><p>The experience: After one, deep, intense inhale from a pipe (using a butane torch), I experienced the onset of the experience within 5-10 seconds. I was unaware that the experience had begun because I initially dissociated from consciousness so completely that I was unable to 'recognize' what was occurring.  I was sitting in an armchair while two friends joked around with each other and waited their turn to try the Salvia. It was actually their friendly banter that would keep me able to 'find my way back'.</p><p>I was aware of myself sitting in the armchair only for a couple of seconds after onset. I felt and simultaneously saw a burning/sizzling, 'electrified' net or web of energy that I can really only describe as cutting through the room, and my head at the same time, sort of like a wire cheese cutter. As the swept across my field of vision, I could feel it 'slicing a hole through my consciousness' so that I found myself tipping backward into Another Place.  I capitalize these words because if I compare all of my hallucinogenic or psychotropic experiences previous to this one, I would say that I remained in the 'same' reality, but that reality was being altered in some way, or my internal reality was being projected onto or mingling with, familiar reality.</p><p>This experience with Salvia was completely unlike any other hallucinogenic experience (even any dream state) I have ever been in.  The overwhelming epiphany/impression I had was that I had finally broken through the barrier of 'this world' into a completely different reality.  At this point, I was told I began to laugh uncontrollably. And this is the point where I imagine one could become frightened, because with this understanding that I had entered a new place, came the knowledge that I had gone off the map and didn't necessarily know if I could return. </p><p>I felt a short sense of panic, as the stabilizing sense of a more 'real' reality, ie, my personal past, my ability to re-enter my consciousness or body, and my ability to recognize myself and my surroundings seemed as if it might not return. All of this was compounded by the fact that there was a sheer immensity and neverendingness to the place I had entered. There was also no sense, whatsoever, of time. I remember struggling with the idea that my current state of free-floating in this entirely new dimension was replacing/supplanting/erasing any life I had previously led or experienced. The formerly existing me, with its history, loves, family, even body, was no longer 'real' any more than anything else was.</p><p>There was very little visual effect during this time. I think I closed my eyes because I felt unable to cope with the sense that I could not recognize what I was looking at. I have the distinct impression of a gray, deep, endless, rushing vastness that I began to struggle to surface from. Or rather, I was trying to find my way back to the reality where I could still hear my friends talking and reacting to me.</p><p>I next became aware of myself laughing. I could not respond to anything anyone said, because for a few minutes I was trying to re-enter my body. I could feel the armchair and could see the room, but the two realities were coexistent at that point and I was conscious in both of them. But more in the new one than the familiar one, until they began to equalize, and finally, I swung forward (in a sitting position), back into my seated body.</p><p>I was extremely elated, because the overall impression I was left with was the sense that I had finally broken through the barrier of this world into what was very definitely a different dimension.  I am an extremely rational person, and no drug has ever really sent me into a reality that wasn't simple the 'normal' one, just being seen from a new perspective.</p><p>Except Salvia: it clearly burned a hole into the next world, long enough for me to immerse just long enough to be convinced that what I normally recognize as my hold on reality and operating self is not inescapable.</p><p>Wow.</p><p>It's been about 14 hours since I had this experience and other than feeling a little tired, vague, and having a slight headache, I haven't felt any negative effects. My mood has definitely been elevated since I took the drug. The entire trip lasted about 30 minutes, when I had re-established my 'normal' waking consciousness.</p>",
 "year": "2007",
 "id": "63793",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-10-22T07:00:00.000Z",
 "views": "6609",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "Pharms - Citalopram",
   "form": "(daily)"
  }
 }
}
