{
 "title": "Like Being Underwater",
 "author": "Daytripper",
 "citation": " Daytripper. \"Like Being Underwater: experience with 4-Acetoxy-MiPT (ID 63821)\". Erowid.org. Jun 19, 2007. erowid.org/exp/63821",
 "substance": "4-Acetoxy-MiPT",
 "bodyweight": "145 lb",
 "report": [
  "<p>12:30am- My friend and I each bump 20mg in the parking lot of the hotel we're staying at in.  We end up chilling on the small wooden boardwalk outside of our room.",
  "12:45am- I notice that the drip from having bumped the stuff has a nasty acidic taste to it and it burns the back of my throat for about 20 minutes when another friend of ours bumps his.  I feel light headed but notice advanced sensory perception.",
  "1:30am- Kid who took his dose last begins to trip within minutes of snorting it and I think his dose may have been a little bit higher by default.  All three of us have a clear view of sand dunes and the beach from this boardwalk and the fence in front of us is swaying like grass in the wind even though the air is still.",
  "2:30am- We sit and smoke cigarettes and I feel very euphoric and alert and I begin to see pale colors projected over everything. I notice that the street lamps appear to emit a pulse of amber light every other minute, then white light the next.  I cant tell if this is really happening or just the drug. I am absolutely entranced by shadows cast by palm trees on the ground around me but they dont appear surreal, just captivating.",
  "3:30am- I have a few Smirnoff twists and feel a little drunk in addition to having a light body high. The lights are still pulsing and my friend keeps seeing things running in the sand behind me which makes me really anxious. Its senior week and there are drunk kids walking past us all the time and Im very afraid that one of them will be a cop.  We move inside.",
  "4:30am- We roll a blunt to smoke between 2 of us and I get really high. Putting on one of my favorite cds makes me uncomfortable because it sounds different than I had remembered it so I must have been having some sort of auditory hallucinations. Im still having light oev and a sense that everything is still not completely normal. ",
  "6:30am- I finally begin to feel tired after watching the sunrise and I notice that I do not feel any effects of the trip any longer. Lying down to sleep I decided that the trip was not as intense as I would have liked it to be but that overall it was a very happy and safe trip. Besides the acidic drip and paranoia the drug seemed to have no other side effects and was very enjoyable.</p>"
 ],
 "year": "2007",
 "id": "63821",
 "gender": "Male",
 "views": "4971",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-MiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2007-06-19T07:00:00.000Z"
}
