{
 "id": 6387,
 "title": "Thought I Was Just Going to Sleep",
 "date": {
  "submission": "2006-03-29T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Charlotte",
  "gender": "Female",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I was in a psychiatric hospital when I took my dose of 50 milligrams of Ambien.  A 'friend' of mine offered them to me.  He was checking out in a few days and had somehow acquired some sleeping pills.  I thought I would get a good night of sleep.  I'd never taken Ambien before and I had no idea how much was a typical dose.  I thought 5 pills were more than 'normal' but not that much more.  I had no idea he was literally overdosing me.  So I took 5 and he supposedly took 10.  Another friend, unbeknownst to me took 3 of the pills.  I thought I was the only 'cool' one he offered them to. ",
  "So it was only 20 minutes after I took them that I started to feel anything.  I was sitting on a railing outside on the smoking porch and commented that I felt like I was on a boat.  I told him that I thought I had better go in and to my room so that no one would suspect anything and I could go straight to bed.  I don't know what happened after that except flashes of that night and what my friends told me I said and did. ",
  "I know when I walked in the door in the unit I stumbled all over the place and my friends knew something was up right away.  I went to my room and remember using a paperclip to cut up my leg with.  Then I came out of my room and my friends wanted to know what drug I took.  I fell over a friend of mine who was sitting on the floor, they told me.  My eyes were strange looking, they said, and I kept telling them that some of them had two heads and some of them were green.  I absolutely do not remember that at all.  Finally one of them asked me what 'so and so' gave me.  They knew which friend it was that gave me the drugs.  He was a bad influence on me.  I was told that I said, 'What does it matter?'  They said then they knew for sure that I had taken something so they told the nurses.",
  "The next thing I was told happened was that all the patients were sent to their rooms.  Me and the other two guys were told to sit on the couch.  Apparently we practically sat on top of each other on this huge three-person couch.   They called the ambulance and we were all rushed to the ER.  I dont have anyone to tell me what happened after that because I left all my friends behind at the psych hospital. ",
  "I actually got kicked out of the hospital for 2 days but somehow they allowed me back in.  I was lucky.  The guy that took 3 pills was let back in too.  The guy that gave them to us, he wasnt so lucky.  He was not allowed back in and wasnt accepted at his step-down program either.  I hope he is okay. ",
  "So to sum up the whole thing Id say I was completely surprised at the reaction I had to the 50 milligrams of Ambien.  If I had any clue that would happen Id never have taken that many in a psych hospital.  Ive taken lots of LSD, shrooms, and pot before but Id never choose to trip in a psych hospital.  Thank God I dont remember most of it!  Losing over 12 hours of my life to absolute amnesia is a pretty scary experience too.  I dont think Id like to experience that too many more times in life, if at all."
 ],
 "erowid": {
  "id": "38119",
  "citation": " Charlotte. \"Thought I Was Just Going to Sleep: experience with Zolpidem (Ambien) (ID 38119)\". Erowid.org. Mar 29, 2006. erowid.org/exp/38119",
  "substance": "Zolpidem (Ambien)",
  "views": "33776"
 }
}
