{
 "title": "Just Relax",
 "author": "Cayana",
 "citation": " Cayana. \"Just Relax: experience with Barbiturates - Phenobarbital (ID 63880)\". Erowid.org. Jan 17, 2008. erowid.org/exp/63880",
 "substance": "Barbiturates - Phenobarbital",
 "bodyweight": "119 lb",
 "report": "<p>Well I got my hands on some Phenobarbital and decided to try it.  I had heard that barbiturates are powerful sleep aids, so I put my PJs on and got ready to take one in my bedroom.  The first day I took 60mg Phenobarbital.  I had just woken up from around 8 hours of sleep and was a little hungry. </p><p>It took about 30 minutes before I started to feel anything.  I just hung out with my computer and surfed on the internet for a while.  As the drug started to kick in I began to feel very relaxed.  I normally have anxiety issues, so this was an extremely pleasant feeling.  Just like all my worries went away.  I lied down on my bed but did not fall asleep immediately.  I just lay there feeling very relaxed and kind of warm and happy. </p><p>After about an hour I did finally fall asleep.  When I woke up 6 hours later I still felt extremely relaxed for a couple of hours until the drug finally wore off. </p><p>The next day I tried 120mg before I was ready to go to bed, expecting this to really knock me out.  Instead it made me feel drunk.  It took about 30-60 minutes to really kick in again.  I felt very stumbly and uncoordinated and like the room was moving a little.  But it didn't knock me out.  I was kind of disappointed with the lack of immediate sleep from it. I expected it to be stronger than it was. </p><p>After a while I got tired of stumbling around and laid down and slept for 8 hours or so until my alarm clock woke me up.  I woke up feeling really refreshed from all the sleep.  I normally have insomnia and can't fall asleep at night.  That day at work I felt really cheerful and relaxed, I think the drug was still in my system for at least 12 hours or so.  I could stay awake though, just felt very calm. </p><p>All in all I really liked Phenobarbital.  It made me feel very relaxed and cozy, and I am normally very anxious and worried all the time.  I would not take it on a regular basis though.</p>",
 "year": "2007",
 "id": "63880",
 "gender": "Female",
 "timestamp": "2008-01-17T08:00:00.000Z",
 "views": "15701",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Barbiturates - Phenobarbital",
   "form": "(pill / tablet)"
  }
 }
}
