{
 "title": "Instant Relief From Depression/Saved My Life",
 "author": "BipolarAddict",
 "citation": " BipolarAddict. \"Instant Relief From Depression/Saved My Life: experience with Hydrocodone with Acetaminophen (Vicodin/Lortab) (ID 63881)\". Erowid.org. Aug 1, 2010. erowid.org/exp/63881",
 "substance": "Hydrocodone with Acetaminophen (Vicodin/Lortab)",
 "bodyweight": "220 lb",
 "report": "<p>Background: I was diagnosed with Bipolar II, a mood disorder, in 2005. I have suffered from depressive episodes for almost my entire life (ever since I can remember, beginning around age 5). Recently I have been in a severe depressive episode for almost three years, exacerbated by a pregnancy and the birth of a child and associated hormonal instabilities.</p><p>There were times in my life when I contemplated suicide - not necessarily because I truly want to die, but because I am DESPERATE for relief of any kind from the constant, unbearable emotional pain that comes with severe depression. Modern psychiatry has been unable to offer relief from my depression. I am very medication-resistant and have never experienced relief when using an antidepressant or other psychiatric medication. I have, however, always experienced a very positive result with any opiate I have taken (usually following surgery, accidents, or broken bones). My first experience was with a morphine injection at age 14. Within seconds of the injection, the depression, and the physical pain from an ankle fracture, were GONE. It seemed all was ok with the world and I couldn't possibly feel anything negative. Lying on a narrow, hard hospital bed with a splinted leg was the most comfortable thing that could possibly be.</p><p>Since that time, I have selectively chosen to use the drug Lortab (generically, hydrocodone) sporadically for temporary relief from depression. This drug is easily obtainable in limited quantities through doctors and also easily obtainable and relatively cheap when purchased on the street. Also, it works fabulously for me and when used carefully I do not become overly tolerant. Also, taken sparingly interspersed with frequent periods of non-use I can control my use enough to not let it become abuse.</p><p>Just a few days ago, I crashed following a manic episode. My manic episodes are almost identical in aspect to the effects to being on speed or another strong upper drug. I was very, very depressed. But instead of apathy, I felt intense emotional agony. When Im in that state, it feels to me as if a part of my soul is missing or dead and I cannot feel positive emotion. Instead, I feel the gut-wrenching pain of a sudden loss or other emotional trauma without cease, only with no negative associated stimulus. There is nothing I can do to relieve this pain. The ONLY thing that works that Im aware of is hydrocodone.</p><p>After a few hours in this depressed state, I was actively planning to take my life simply to escape it. I desperately wanted to live but couldnt bear the pain. So I turned to my last resort, called a friend, and managed to get almost a full 30-tab prescription of hydrocodone. I immediately took two tablets (see dosage above) and within 45 minutes I experienced complete relief from my depression. I felt a mild euphoria, and, even more powerfully, relief that the horrible pain was gone  totally! Suddenly the desire to die to end the pain was gone. I could live after all! The dead or missing part of my soul felt returned in full and I was able to feel positive emotion that totally evades me in my day-to-day life.</p><p>Although tired, I didnt sleep that night because I didnt want to miss a second of the effect. My body felt pleasantly heavy though not overly so, I actually had energy had I chosen to be active. I didnt, though, because it felt so damn good just to lie there. Emotionally, I reveled in feeling good  actually good  for one of the only times in my life that I could remember. My mind was clear and quite sharp when I chose to focus, and yet it would drift off dreamily in a pleasant way if I simply asked it to. Ordinarily my mind races with thoughts uncontrollably all day, every day, so to be able to shut this off at will is, for me, remarkable.</p><p>The high lasted for almost a full six hours, possibly because I took the pills with food and they were subsequently slowed in their absorption. I experienced no unpleasant side effects like nausea that are common with this drug. I did have some slight itching, but since it felt so good to scratch I dont consider this a negative. It was more a sensual pleasure.</p><p>Coming down was painless except that I grieved for the gradual loss of pleasure over perhaps two hours. There were no physical side effects during withdrawal or once the high was gone other than fatigue, due I believe to a longer than normal period without sleep.</p><p>As far as I have found through my experience, the only opiate that matches the pleasure of hydrocodone for me is pure morphine, last received via an on-demand morphine pump for a few days post cesarean section. That, however, came with far greater side effects  pretty severe itching, loss of coordination, muzzy thinking, and extreme memory loss afterward. I remember very little of those first few days in the hospital with my child and my sense of time is obscured completely.</p><p>I understand that my extremely pleasurable and positive reaction to hydrocodone (and opiates in general) is not necessarily unique, but I believe it may be slightly stronger than the average experience simply because the drugs bring me up from a place much farther down than most people begin.</p><p>I am glad that I was able to find hydrocodone so quickly that night, or I fear I would not be here now. I had an active suicide plan and Im fairly confident I would have carried it out in desperation had I not had a sudden idea, called a few friends, and gotten very lucky. Since that night I have not had to take any more hydrocodone for relief of depression symptoms, but in the future I will keep a small supply on hand just in case I need it.</p><p>A note: since I have some experience with hydrocodone, I have determined a few things that affect the efficacy of the medication. First, it makes a great difference over a few months or a year if I store the drug in a totally dark place, this seems to help it retain its potency. Likewise, from what Ive learned it should be kept at room temperature and not get too hot or cold. Finally, unlike some drugs and herbs, hydrocodone can get substantially weaker within just a couple of years. So if I find a two-year-old prescription, the analgesic power may be undiminished, but I wouldnt have much faith in the hydrocodones power to cause a pleasurable experience.</p>",
 "year": "2007",
 "id": "63881",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2010-08-01T07:00:00.000Z",
 "views": "22355",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "1000 mg",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  }
 }
}
