{
 "title": "The Waiting Room",
 "author": "Jamie C",
 "citation": " Jamie C. \"The Waiting Room: experience with DMT & Cannabis (ID 63917)\". Erowid.org. Oct 1, 2007. erowid.org/exp/63917",
 "substance": "DMT & Cannabis",
 "bodyweight": "200 lb",
 "report": "<p>I had been searching for DMT since I read an article in 'Time' magazine about the drug. While living in Hawaii more than a decade later, I ran into a guy that I went to high school with in TN. I noticed a book on his shelf titled, Experiences in DMT. I asked him about the book and he asked me the $64 question. 'Have you ever tried it? After saying No, but I would love to, he rummaged through a small wooden box that had been sleeping on the bookcase. We moved the furniture out of the way and got on the floor. He placed the DMT atop a bowl of Hawaiis finest and handed me the pipe.</p><p>After the first hit it took 3-4 seconds before reality began to break down. The world became 2-demential and full of color. Things seemed to pulse too. He handed the pipe back to me and it looked like it was several times larger. I did my best to hit it again but when the lighter lit up fire jumped and danced in my face with more yellow than ever before. I held the second hit in as long as I could as I softly melted to the floor. I said out loud, I have been here before. I felt as I was melting into the floor.</p><p>There was darkness for a brief moment till I sank into what seem to be a small doctors office waiting room. The pastel colors scrolled vertically from top to bottom like the code in The Matrix. The colors were shades of blue, white, green and brown. There was a group of connected school-like chairs in the center of the room and chairs lining three walls. The fourth wall had 4 doors that had Stargate SG1 type membranes. I sank until I was floating inches above the floor in the standing position. I then noticed an entity that was standing in front of a chair in the center of the room. It was not shaped like a human but like a poorly molded clay biped. It was almost dumpy looking. It sat slowly, not facing me, and began to raise his arm to point as he turned his head towards me. It told me, without moving a mouth, Thats the one you want.</p><p>Without hesitation I floated to the door and passed through the plasma door. On the other side was a huge woman 200 feet tall in a long flowing white gown in a black void. She was to the left of me and I briefly felt scared. She placed her now scale sized hand on my shoulder and It is going to be okay, entered my mind as she gave me a small push forward. I then began to fall in a black vortex, very much like a black hole, that bent to the left so I couldnt see what was around the corner. Eventually I advanced past the turn in the vortex and entered into space. I was floating a moderate speed, trying to take in all the beauty before me. There was galaxy after galaxy showing off their colors and designs.</p><p>Then I became scared again and the womans hand retuned to my shoulder with the same message, It is going to be okay, but she pushed me faster this time. I started to see that I was coming towards the Milky Way and then I could see myself approaching our solar system. As I came towards earth I could see that I was falling towards Hawaii. As I got closer I could see that I was falling in the same area where I currently was. I got closer to the house where I was lying on the floor and then I sat up. I was completely coherent and had my memory of the experience intact.</p><p>For the next 5-6 min, I experienced a gold plasma that was coming up from the floor that was about a foot and half thick. It had things moving around in and the crest of the plasma pulsed like a pool full of kids. It jumped and sank arbitrarily. Large bacteria looking creatures were seamlessly moving around. This is hard to describe but the plasma seemed to be at the bottom of my eyes. If I looked up and didnt look through the bottom of my eyes everything was normal. Also, I stared at the base of the camcorder that was recording me. If I tried to focus on one thing then that spot would begin to swirl and get sucked into blackness leaving a hole in the ground. As the minutes wore on the gold plasma became fainter and fainter. I find the most interesting part of the whole experience. It left me with the impression that the gold plasma is always there but I cant see it without the DMT. I would like to try DMT again to see if I go to the same place and maybe try another door. DMT is worth trying at least once.</p>",
 "year": "2004",
 "id": "63917",
 "gender": "Male",
 "timestamp": "2007-10-01T07:00:00.000Z",
 "views": "27195",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "DMT"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
