{
 "title": "Long weekend",
 "author": "S.F.P.G",
 "citation": " S.F.P.G. \"Long weekend: experience with Ecstasy, DOB & BZP (ID 63952)\". Erowid.org. Feb 22, 2010. erowid.org/exp/63952",
 "substance": "Ecstasy, DOB & BZP",
 "bodyweight": "11 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   " repeated",
   "oral",
   "Alcohol - Beer/Wine",
   " T+ 0:20",
   "1 tablet",
   "oral",
   "MDMA",
   " T+ 0:50",
   "1 tablet",
   "oral",
   "MDMA",
   " T+ 2:30",
   "1 repeated",
   "inhaled",
   "Inhalants",
   " T+ 6:30",
   "1 tablet",
   "oral",
   "DOB",
   " T+ 14:30",
   "1 tablet",
   "oral",
   "Piperazines - BZP",
   " T+ 15:15",
   "1 tablet",
   "oral",
   "Piperazines - BZP",
   " T+ 15:45",
   "0.5 tablets",
   "oral",
   "Piperazines - BZP",
   " T+ 23:30",
   "1 bowl",
   "smoked",
   "Cannabis"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>It was a friday evening, just before I was finishing work for the weekend. A friend of mine who I hadnt seen in months (who we'll call R) called me up and said he had the house free (way outside town) and he could get some e pills. Straight off this put me in the mood for a great night since we took drugs together a lot and always had a great time.Also since his house is in the countryside its a beautiful place to take any drug.</p><p>At about 9.30pm me and two other friends (A and D) showed up at Rs house with beer,wine, vodka and cider. And we all started to drink and chat. The mood was a happy friendly one.</p><p>After about 20 mins R told us he had only been able to get 8 pills. Thats 2 each which isnt much compared to what we're all used to, but we took 1 each anyway, no longer expecting too much from the night but we'd make the best of it.</p><p>About 30 mins after taking the pill it started to work. The typical e come up although not the strongest pills ever so we took the 2nd ones. About 15-20 mins later the 1st pills seemed to peak. The conversation was flowing and everyone was feeling good.</p><p>When the 2nd pills fully kicked in (about 12am) we decided to go for a walk. The cool night air felt great and we went and sat in the woods for a while. Unfortunately these pills didnt seem to last very long and in despiration for a buzz me and D decided to huff some gas. NOT something Id recomend.</p><p>At about 3am it seemed as though the night would be cut very short compared to what was planned. Then i remembered i had some DOB at home. so myself and D called a cab and went to get it. I also found a bottle of whiskey so i brought that back too.</p><p>Around  45-60 mins after taking the DOB (1 pill each) it started to take effect. Sort of like the e come up but slightly off in some way.(if you've taken it you'll know what I mean)</p><p>Usually it takes a couple of hours before DOB seems anyway psychedelic but that didnt seem to be happening at all this time. (I knew it was DOB because id takin some from this batch before) So we drank the alcohol we had left and decided to go into town to the headshop as early as possible.</p><p>It was around 12pm when we actually got there. The cab journey had been uneventful and it was easy to talk to the driver without seeming like a jabbering mental patient. ( I think )</p><p>We bought 8 yellow SMILIES and took 1 each straight away. We were also given a free bottle of poppers (amyl nitrate). Walking through the busy streets on a Saturday morning felt pretty wierd and we decided to get back to the house ASAP.</p><p>It took about 30-45 mins before we got back and the smilies had started to work, so we took the 2nd ones except R who gave his 2nd 1 to me which i split with D about 1hr later. After a while it all got very psychedelic. Colours got brighter and everything started to breath and move. Nothing would keep its shape for very long, and anything that was said would have everyone in fits of hysterical laughter.</p><p>When we went outside everything felt and looked so alive. Everything seemed to have gotten a face to it and when I looked at the trees in the distance it was like i could make every individual leaf seperately from the trees. It all looked truely amazing and very beautiful.</p><p>These effects lasted about 3-4 hours. After that everyone felt very tired but still alert and the visual effects were still going strong.</p><p>At about 6pm D and A went to get some hash and R headed out to meet some people and I was left in the house for about 1hour alone. This would usually freak me out a bit me when Im tripping but i wasnt really bothered and it allowed me the time to reflect and to think about my life and what changes I need to make to it.</p><p>Then I went to meet D and A at Ds house which was about an hours walk. Everything still looked brighter then usual and i just enjoyed the surroundings for the whole walk with none of the paranoia id usually fell in this sort of situation.</p><p>When i arrived at Ds house I was pretty wrecked and just smoked 1 bowl of hash which brought back a lot the visuals and that lasted until i went to bed around 4am.</p><p>It was a very enjoyable experience and even though the doses of each drug were small the mixture worked very well. Probably one of the best mixtures i've tried.</p><p>If anyones planning this sort of thing themselves I'd advise having a day or two after to recover because it really takes a lot out of you.</p>",
 "year": "2006",
 "id": "63952",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-02-22T08:00:00.000Z",
 "views": "4773"
}
