{
 "id": 6395,
 "title": "Peace in a Dream",
 "date": {
  "submission": "2006-03-30T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Just a Man",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "0.5",
    "quantity": "0.5"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "daily"
  }
 ],
 "report": [
  "There are a few dreams that I can recall somewhat vividly, but there is one that stands out far more than others. I can't recall what I was doing earlier in the day prior to my falling asleep that would allow my mind to open as much as it did in my dream. Please note that I am a habitual marijuana smoker, enjoying about .5 grams per day, and on this day I did nothing out of the ordinary for my lifestyle.",
  "I'm not sure how my dream started off, but I remember being aware of myself in a dark room just sitting there and wondering why I was sitting there. I then decided I needed some perspective as to why I was in that room and I left, but I didn't use the door. I went through the ceiling, and was looking down at my house, but I didn't stop there I just kept going up gaining more and more perspective the further I went.",
  "Soon I was floating up through the atmosphere looking down on the earth as I kept moving further and further away. My perspective was now that of astronauts orbiting the planet, and then it seemed like all I did was blink and the earth was nowhere in sight. I was in space, with nothing but nothing around me. I could see stars in the vast distance, and knew the general direction of earth but I was not to concerned about getting back. I had no body, nothing to contain my spirit or essence, or whatever I was at that point. Just me in space, but I did not feel alone, I felt a greater presence around me and it was comforting.",
  "I was so content with just being there, it is hard to find the words to describe the level of completeness I was feeling. I was so at peace I didn't leave, I was just there observing the living universe. I thought I was going to be there forever, I felt that I had been there before and I knew my way around. It was then I asked if this is where I'm going to be when I leave my body for good. I received an affirmation to my thought and I felt even more content with everything. I didn't want to leave, and it was then that a blinding light took over the vast darkness and I woke up feeling better than ever.",
  "I consider myself to be a spiritual person, and although I claim no religion I have studied many religions. In my heart and soul I know what God is, and I can't help but think I was at the right hand of God in my dream. I don't go around claiming that I know God or anything,  or try to influence people into searching for God because God is always there I just have to open up. I've also taken many types of psyhedelics in my time, but the last time I've ingested anything other that marijuana was back in 2000."
 ],
 "erowid": {
  "id": "38148",
  "citation": " Just a Man. \"Peace in a Dream: experience with Dreams (ID 38148)\". Erowid.org. Mar 30, 2006. erowid.org/exp/38148",
  "substance": "Dreams",
  "views": "4345"
 }
}
