{
 "title": "Oudoor Grown Cubensis",
 "author": "Nico",
 "citation": " Nico. \"Oudoor Grown Cubensis: experience with Mushrooms - P. cubensis (Penis Envy) (ID 63971)\". Erowid.org. Jan 2, 2010. erowid.org/exp/63971",
 "substance": "Mushrooms - P. cubensis (Penis Envy)",
 "bodyweight": "185 lb",
 "header": [
  "DOSE:",
  " ",
  "",
  "Mushrooms - P. cubensis"
 ],
 "report": "<p>I have been growing the Penis Envy strain of P. cubensis for some time now.  I never liked throwing out the 'spent' cakes of mycelium after they had finished producing mushrooms, but there's not much you can do with them.</p><p>Last month I noticed that the local park put down a load of fresh hardwood mulch around the trees.  I know that mulch isn't the preferred substrate for cubensis, but I didn't have anything to lose.  Inspired by Paul Stamets' 'patches for the people' concept, I crumbled up some of my spent cakes into ziploc bags, loaded up my cargo shorts, and seeded the mulch beds one night.  This was in May in Illinois. </p><p>There was a bit of a drought period during June, but a string of thunderstorms finally arrived towards the end of the month.  On a hot, humid day after a day of rain, I took a nice stroll through the park.  What I found absolutely amazed me.  Not only had the cubensis grown, but they produced a crop where the smallest mushrooms were about as big as my largest indoor-grown mushrooms.  I walked home with handfuls and pocketfuls of mushrooms that weighed up to 2g each after drying!  The stems were typically about as big around as a U.S. quarter, and the caps (which are rather small in the Penis Envy strain) were an upwards of two inches in diameter. </p><p>Ten minutes worth of work on night, using cakes that I would have otherwise just thrown away, produced ounces.  The bioassay was a complete success also, with several friends (all experienced trippers) agreeing that the potency was nearly indistinguishable from my previous indoor crops.  The size and thickness of the mushrooms appeared to help prevent oxidative breakdown of the active chemicals, thus compensating for the non-preferred diet.</p><p>As a final aside:</p><p>I know that every grower has their own little secrets, but here's mine....  I have had the best luck using cheap bird seed from the local grocery store as a growth medium.  The diversity in diet of having 6 different seeds rather than a diet purely of rice or rye seems to speed up the growth.  Spiking in a tablespoon or so of well-leached coffee grounds (rinsed until they'll no longer color water during soaking) also aids fast colonization of jars. </p><p>Finally, I has had great success adding some 'yeast nutrient' from the local wine/beer making shop to the water when I soak my growth medium (seeds, rye, etc.) in the initial hydration phase.</p>",
 "year": "2007",
 "id": "63971",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-02T08:00:00.000Z",
 "views": "16674",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Mushrooms - P. cubensis"
  }
 }
}
