{
 "title": "Transiently Transforms the World of Flavor",
 "author": "Randolph Carter",
 "citation": " Randolph Carter. \"Transiently Transforms the World of Flavor: experience with Miracle Berry (ID 63981)\". Erowid.org. Jul 2, 2007. erowid.org/exp/63981",
 "substance": "Miracle Berry",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 bry",
   "oral",
   "Miracle Berry",
   "(fresh)"
  ]
 ],
 "report": "</p>I recently had the opportunity to tour an herb farm that grows the Richadella dulcifica bush (also called Synsepalum dulcificum). This bush produces small, oblong fruits or berries that are commonly called 'Miracle Fruit' or 'Miracle Berries'. The berries themselves are hardly miraculous in taste - they are vaguely sweet with a slight tang, and a gooey, gelatinous consistency. But they contain a protein that apparently inhibits the ability to taste sour or bitter, and that's where the miracle comes in.</p><p>I was presented with a fresh Miracle Berry right off the tree along with half of a fresh lime. I began by licking the lime to verify that it was a typical specimen. It tasted like an ordinary lime to me - quite sour. I then chewed the Miracle Berry for about 30 seconds, swishing the goo around my mouth to coat my tongue. I waited for perhaps 30 seconds more and then sampled the lime again. Sure enough, the taste was completely transformed. It was still distinctly lime-flavored, but all of its sourness was gone - it now tasted extremely sweet, like a sorbet or juice concentrate. Amazing.</p><p>I ate the entire lime half with relish, but a minute or two after doing so I felt a bout of mild-to-moderate nausea which persisted for about 10 minutes. I am not sure if my stomach was responding to the acidity of the fruit, or if I was reacting to the Miracle Berry, or if there was some other cause.</p><p>I did not have the opportunity to sample anything else so I do not know the duration of the effects, though I hear that they persist for approximately half an hour. I was told that if one eats a Miracle Berry and then drinks a Guinness, the beer tastes like a milk shake. I'd love to try that, and I hope that this interesting fruit becomes more widely available so I can experiment with them further.</p>",
 "year": "2007",
 "id": "63981",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-07-02T07:00:00.000Z",
 "views": "10212"
}
