{
 "title": "Nutmeg: One Time is Enough",
 "author": "Skater",
 "citation": " Skater. \"Nutmeg: One Time is Enough: experience with Nutmeg (ID 640)\". Erowid.org. Sep 10, 2000. erowid.org/exp/640",
 "substance": "Nutmeg",
 "bodyweight": "150 lb",
 "report": "<p>My friends and I had been trying to get acid or mushrooms for a nice weekend trip, but the shit never came through. I had heard that if you take about 2-3 tablespoons of nutmeg, that you would trip. Well, everyone laughed at me, but they still tried it anyway.</p><p>3:45-4:30pm: Me and two friends ate our tablespoons of nutmeg. It was very nasty so we mixed it with water and took shots.</p><p>5:30pm: I started to feel a little weird but no big change yet. I went to the dinning hall to eat but wasn't interested in the food.</p><p>7:00pm: Chillin in my friends room playing video games when suddenly I dropped the controller and laid back on the bed. I felt really lazy and heavy. I didn't even have the energy to pick up the video game controller and play.</p><p>7:30pm: started to feel really really stoned. I was really fucked up, dizzy, and glued to the bed. I was just staring at the TV while other people in the room were laughing at me. My other friend said that he was seeing cool patterns and tracers when he moved his hand.</p><p>9:30pm: Still feeling the weed-like high, but its more intense. We decided to go to a party. When we get there I had a couple of beers and now I'm outta this world! I couldn't even talk right so I gave up trying.</p><p>12:00am: We left the party and went back to my friends room. I was still feeling the effects of the nutmeg. I sat there watching TV and staring into space while my friends roomate laughed his ass off at me.</p><p>2:30am: I left my friends room and went back to my room where I went to bed.</p><p>3:00-5:00am: I couldn't sleep cause everytime I closed my eyes, I would have weird visuals. It was like I was watching movie clips, but somehow I was in them. It was very unpleasant. It was sort of like an acid trip where you want to go to bed, but you keep thinking weird thoughts over and over again.</p><p>8:00am: Had to get up, take a piss and drink water. My mouth was so dry. It was the worst cottonmouth I had ever had.</p><p>9:00am: Woke up, tried to walk around and function, but I was still fucked up. It seemed like I was still stoned. Fuck this! I went back to bed.</p><p>3:00pm: Woke up and took a shower. I still felt like shitty and stoned. I was hoping taking a shower would wake me up, but it didn't work. Went back to bed.</p><p>7:00pm: Woke up. I slept like a baby. Still felt weird but it was over by 8pm.</p><p>Summary: I only recommend taking nutmeg if you are very desperate or poor. The next day 'hangover' was no fun at all. The basic effect of this drug on me was that I was really stoned for 24 hours. My two friends both agree that once was enough.</p>",
 "year": "2000",
 "id": "640",
 "gender": "Male",
 "timestamp": "2000-09-10T07:00:00.000Z",
 "views": "14377",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.75 Tbsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 }
}
