{
 "id": 6404,
 "title": "What Not To D0",
 "date": {
  "submission": "2005-10-12T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anzo",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "insufflated",
   "substance": "5-MeO-AMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "From 12:30am - 1:54pm the next day:",
  "The hardest trip I've ever had, the scariest trip I've ever had... I decided to snort some old chemicals I had. I thought the chemical was not as potent due to the brownish tint that had been acquired from time. I neglected to look for dosage requirements, all I could remember was the last time I did this chemical I had to do a lot to get any type of different mind set. So, I measured what I thought was 20mg of 5-meo-amt and snorted it.",
  "In 5 to 10 minutes I could barely focus on my monitor. I immediately went downstairs feeling very very (emphasis on very) dizzy, and began to throw up, I went upstairs and the feeling persisted. Did I take too much I asked myself. Yes, but not to worry. I was as mentally and physically prepared as I could be, getting ready to puke until the drug had gotten itself out of my system. I think it might have been around 1..to 1:30am when this started. I remember sitting on my bathroom floor for quite some time, puking, and drinking water. At 3am I went back upstairs, still feeling very very dizzy, only with intense visuals now, ones I've never seen before. I could only compare it to a scary movie. I remember sitting on my couch after going upstairs, helpless, restless, fading in and out of my mind, this world. I remember looking at the time on my lcd laptop monitor, and text in my mIRC window, whenever I tilted my head a certain way, the text would garble, kind of like when a scary movie goes horribly wrong, and the screen vibrates as horror prevails. The light was on in my room, and for a second I thought my glasses were fogged, the entire room looked like it was foggy, had to take my glasses off to find that it was just me. I could not function at all, and felt very nausous. I wanted it to stop, but knew time was the only thing between that.",
  "At 4 I got up, even though the throwing up stopped I would cough every once in awhile, every time I coughed, I felt like throwing up again. I puked one last time @ 4am, the nausea had stopped for the most part, my stomach would still move around gasses and make me wanna burp/cough/puke.",
  "Shortly after I decided to play some quake2/ra2 and listen to music. I knew it was the only thing that could keep me sane in the hours of tripping that were ahead of me. Once I started up q2 I could swear something was wrong. Everything felt different, completely different. After I got used to it I started to hit every shot I made. People were calling me a bot. Everything made perfect sense when it came to predicting. I couldn't miss, even if I wanted to, Id pull off some crazy 180 degree rail shot between two boxes. This made me feel very good, couldn't stop laughing. I played this game for quite some time, probably until 11:00am ish in the morning.",
  "3:30pm, couldn't go to sleep, watched a movie on comedy central, drama/comedy...what a combo - I loved it",
  "Now Im tired - I'm going to sleep!",
  "Overall - I did way too much, specially insufflated making it more intense. The first 4 hours of the trip was pure insanity/hell for my mind. After the nausea went away I started to have fun."
 ],
 "erowid": {
  "id": "38204",
  "citation": " Anzo. \"What Not To D0: experience with 5-MeO-AMT (ID 38204)\". Erowid.org. Oct 12, 2005. erowid.org/exp/38204",
  "substance": "5-MeO-AMT",
  "views": "7966"
 }
}
