{
 "title": "Sex, Ecstasy, and Immune System",
 "author": "Stoned Cupid",
 "citation": " Stoned Cupid. \"Sex, Ecstasy, and Immune System: experience with MDMA (ID 6406)\". Erowid.org. Apr 22, 2001. erowid.org/exp/6406",
 "substance": "MDMA",
 "bodyweight": "170 lb",
 "report": "<p>I better share this experience with Erowid comrades. I heard some people say it lowers down the immune system in your body, mainly due to its tendency to make you tired, not because of the nature of the drug. However, I guess it may not be correct. I used to be very healthy and I still am. So is my girlfriend. Getting to the point, after E experience, I got so sick and had multiple illness, which is very common among people with poor immune system( just like old folks ).  So, here is my story, and I hope you can figure out whether that is a nasty side of this drug or just elaborate coincident.</p><p>Having learned its aphrodisiac side from previous experience, my girlfriend and I decided to try this while we have sex. I took half pill (due to my heart discomfort with any kind of stimulant) and she took one pill. As normally it is, after 30 minutes later, it started kicking in, and we both agreed on that this is good shit ; )</p><p>Just as any guys with high on the drug, this ex- cheerleader girl looked so erotic and gorgeous then she usually was so I instantly start kissing and taking her shirt off, and ? mum,mum,mum? Despite I had hard time making & maintaining erection because of its side effect, the sex was somewhat between okay and pretty good, but not as we expected (so, we will try foxy methoxy next time).</p><p>Now, this is the beginning. It was okay at that night. After sex, we just talked and talked and had light dance at the living room. Next morning, I found myself being totally fucked up beyond recognition. I had runny nose, soar throat, headache, sneezing, you name them.  I managed myself to take Tylenol cold but it made things worse. It effected my heart and made me feel very uncomfortable. The flu (presumably?) lasted about seven-fucking- days and now I am still on the effect of it. Making things worse, I just found that I just had a swallowing glands on my upper jaw( massive amount of inflammation stored on near saliva gland and it fuckin? hurts like hell. One day, when I was young, I had to go to the ER because of that). Fortunately, she didn?t get sick after the experience( but we both crashed at end of the trip ! ).</p><p>Please keep in mind that I was very healthy college dude who spends lots of times in gym and so she was. .  There was no way I got sick because I was very exhausted or something like that, because as I mentioned, I was ?proudly? very healthy and we didn?t even dance that much. In fact, we spent most of the tripping time by talking and sitting on the couch, touching each other in the warm place I never had this kind of sickness in recent days, and back then, I have some flu experience, but these were never intense as one happened this week.</p><p>Are these just coincident or dreadful effect of the drug? I am not sure since I?m not a doctor.</p>",
 "year": "2001",
 "id": "6406",
 "gender": "Male",
 "timestamp": "2001-04-22T07:00:00.000Z",
 "views": "15912",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
