{
 "title": "Stranger",
 "author": "Fireinside",
 "citation": " Fireinside. \"Stranger: experience with Opiates (Various) (ID 64070)\". Erowid.org. Apr 20, 2008. erowid.org/exp/64070",
 "substance": "Opiates (Various)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " repeated",
   "",
   "Opiates",
   "",
   " repeated",
   "",
   "Opioids"
  ]
 ],
 "report": "<p>I remember being a kid and the teachers try to instill in our back then innocent mind that drugs are the worst thing that has ever happened to society. It seemed years ago, those words were of importance. But, as I grew older, I came to learn about the children who are starving on the streets, the thousands of innocent lives that are taken, the cancer that defeats our world etc.</p><p>I am no stranger to opiates. I've always had the curious attitude toward life, and was up for trying new things. I was always warned that one thing leads to another, each one being a little worse then the first. Of course, who am I to take advice? I control myself, my feelings, my actions, and my world...or so I thought.</p><p>I started out using nicotine, trying to portray the image of a more sophisticated individual who could one day make an impact on the world. My dreams were big back then, when I had control over my life. As I was warned, one thing led to another. My sister was an alcoholic, and knowingly, I had the potential to become one as well. I didn't care, it was 'cool' to drink and pass out naked out the front lawn so your peers had something to talk about at school. I developed the partying lifestyle and the 'I don't give a shit,' attitude towards the world.</p><p>Drinking became a weekend fling, rapidly turning into an every day event. I escaped reality while drinking, although at the time I was sure the only reason I did it was to have fun. Drinking got old fast. My next door neighbor, we'll call him 'Joe', was into drugs prior to my daily usage. He had been on drugs for a good while before I ever decided to experiment. He often came to my house searching for pills, and I had no education on them at the time. He would take some, and I could have cared less because they didn't mean shit to me then. I did ponder about what it would feel like.</p><p>At my dad's house one spring break in 2004, I had let my life slip away from me. I starting going through depression, became a threat to myself, and became my own worst enemy. I never have coped well with pain and problems, I tend to avoid them and run away as fast as I can. I like to store them in the back of my mind, although they creep up from time to time to haunt me. I said, 'fuck it,' and began to go through my dads medicine cabinet. I came across 2 full bottles Hydrocodone and Oxycodone. I knew Joe (next door neighbor) had mentioned those before when searching at my house. Being a complete pill idiot, I took 6 oxycodones at once.</p><p>DAMN! I had never been so fucked up in my life. I remember that day very well. I became numb and accepting towards myself and my life. I felt as though I could achieve anything. I would work my life issues out in my head, and actually think everything would be okay. Something I could never achieve by being sober. Over spring break, I continued to go through the bottles of pills, each day looking through them and thinking well he won't notice Ill just take a couple more. The bottle was empty. I also had learned how to snort pills over spring break, and felt like a complete idiot after wasting 6 oxycodone by swallowing them. I lost faith, and Im ashamed to say this, but I took pride in snorting my pills on a Bible. I was on top of the world, and nothing could stop me. I went back to my house, went through my mom's bottles of Hydrocodone. I noticed she had hid them from me, but I easily found them. I was past caring if my parents knew.</p><p>I ran out and soon became aware I had developed a habit, and had a dependency. I got so desperate at times that I would look for pills, and just took them. Didn't know what they were or anything. I took heart pills once, and laid in my bed in fear for my life. I had to break free, and I did. The craving never stopped. I didn't know any sources besides Joe and he certainly wasn't the most dependable person in the world. After hearing how expensive the pills were, I broke free. Anytime I found pain killers, I took them. It wasn't hard to quit because I hadn't been on them but for a few weeks. I thought you couldn't get addicted for just being on them for awhile. Anyway, I was wrong as always, and I continued my drug use anytime I could over the years.</p><p>July 12, 2005 I met my first love, we'll call him 'asshole,' because that's exactly what he is and there is no better word to describe him. I fell head over heels for him the first night, it was unknown to me I would face a constant battle to this day. He was the first person I allowed myself to love, I was positive he was the one. I was wrong, and December of that year, I caught word he had cheated on me. It came to be true. I was alone, again. I have tons of friends, but I always felt alone. I began using pills again, stealing my parents, and also became familiar with Tramadol. I liked this feeling and it seemed to last longer then the Lortabs did. Luckily, I knew not to snort them haha. I once again became numb to the world and my surroundings. It was the only way I felt at home. Asshole came back to me of course, all was great. I promised I would quit the pills, and I don't break promises. I did quit, with no withdrawals because I didn't use them on a daily basis, I had control then too.</p><p>The summer of 2006 my sister (the alcoholic) had double - knee replacement surgery in May. I was in Lortab heaven, she became so dependant on them, she wouldn't notice if I took over half the bottle. She was getting them constantly in large amounts. I didn't break my promise to Shane, but found out that he had cheated on me AGAIN. I felt my life slip away more than ever at that point, so I started using. 8 Lortabs got me through the days. I started using everyday all day. Snort 2 in the morning to get the good buzz, then 1 every few hours to maintain the buzz. I stayed on them daily until late August.</p><p>I can't say I was happy, but I was numb and content. I could never be happy when I know I'm only running away, and that those things will be there always. I quit because my close friends (the only ones who knew I did pills) were watching my waste my life away. I felt so horrible because I always think of other people first, that I decided to give them up. On days I didn't get my 8 lortabs, I begged my friends to help me, and even once took some from my best friends granny who is dying of cancer. I was never meant to be that person, and Im ashamed so bad that I would have ever done anything like that. But, I did, and I take full blame for my actions. I remember spending nights with my sister searching for pills.</p><p>In September of 2006 my best friends got into a wreck. We were drinking and driving, living the partying lifestyle once again. I couldn't grasp the reality of it all. I went to the hospital to see them hooked up on the machines lying in endless pain. I should've died that night, I should be the one hooked up to the machines, not them. I was 10 minutes from dying in the car accident. I wasn't meant to. Her family hated me, and looked at me as if I were some sort of convict. I couldn't blame them for doing that, and I never will.  I lost touch with my best friends, we got into a big argument over something stupid. We all over-reacted, especially me because I was always so fucked up on shit. I'll never forgive myself for walking out on my best friend when she needed me most. But, I had to get away from it all. I obviously didn't choose the correct path, as I became heavy into pills again. Darvocets, Percocets, Lortabs, Lorcets, Xanax, Tramadol, Valium, everything I could get my hands on.</p><p>On January 20, I gave up fighting for life. I felt like I was fighting for nothing, I was a big fuck up and Ive already crashed my dreams down. I blamed myself for the wreck, I blamed myself for not doing more to make my relationship work with asshole, I blamed myself for growing distant from my family, I blame myself for walking out on those who needed me most. I was worthless, and everything I had run away from came back to me. I had been on pills again everyday. I held my glass of vodka up, saying fuck the world. I chugged it down. Got wasted drunk, did some Lortabs and Valiums. I went downstairs and took a whole bottle of alieve, motrin, and tylenol. I wanted to die more than anything that night. Obviously, it didn't work, I wasn't meant to die. My best friend called me that night and knew I was fucked up and attempting suicide. She called me police, as well as another woman. I went to a mental ward, where I stayed 2 days and most people stay months. I left there with them saying my problem was drug and alcohol dependency. They didn't seem to care that I had sleeping problems, or suffering with depression.</p><p>From September of 2006 to April 2007 I was on pills everyday. The withdrawals were worse then every before. Cold sweats, anxious/nervous feeling, shakes, aches and pains etc. I felt myself for the first time in months. I continue to use pills still whenever I can get them, and I also get withdrawals easily now. I went through them again in May of 2007 after using tramadol for 2 weeks.</p><p>If I had it to do over, I never would have experimented for the first time. I never would have looked through my fathers medicine cabinet, and I never would have taken any. If I didnt do things on impulse, I wouldnt be in the situation today. The best way to get off pills, is to never start. The craving is always there, and pills are often hard to obtain as well as extremely expensive. I wasted 1,000s of dollars over the years just to be high. I should take reality for what it is and accept it.</p>",
 "year": "2004",
 "id": "64070",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-04-20T07:00:00.000Z",
 "views": "12786",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "",
   "substance": "Opiates",
   "form": ""
  }
 ]
}
