{
 "title": "Relationship Therapy",
 "author": "Bob",
 "citation": " Bob. \"Relationship Therapy: experience with MDMA (Ecstasy) (ID 64090)\". Erowid.org. Feb 13, 2010. erowid.org/exp/64090",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 1:30",
   " ",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I am a 45 year old male approximately 185 lbs. married with 3 children. I/we have used MDMA or variations thereof for 7 years. My wife and I only use together and never in combination with any other drugs. We have been to rave clubs and rolled a few times and had friends over and rolled with other couples (platonically) and all were fun but not really for us. A normal roll, the ones we plan for and look forward to are the times we lock the world out and roll alone together. We spend as much as a week primping the house and planning for the childrens supervision. We try to find new things to experiment with for our night and we make sure that we are mentally prepared. This is the most important part, we never roll to work out problems or if we are having trouble, its not necessarily for that and can, I feel, create problems later in the relationship. We on the other hand use it when we are doing ok but feel the need to reflect and dream about our future and how the kids are doing in our eyes. All the things we never seem to have the time or find the importance to talk about being a typical dual income family in the 21st century. We use it to more or less reconnect and better understand what the other is going through inside the walls busy people tend to build to block out the things that seem petty or selfish at the time but we ponder about when we have time alone with our thoughts. We spoil ourselves and each other with attention. I will run down a timeline of a typical roll for us. They vary in time depending on allotted time and how much X we have, anywhere from 8 to 20 hours.</p><p>T-48:00 hrs. , we shop for supplies (water, candles, oils various other things that over the months we see and think wow that would be fun the next time we roll), we get the kids ready for there adventure (a weekend at grandmas or the like), I load the computer with a huge collection of music, one folder full of techno trance and one with soft mellow stuff like Enigma, lots of music. We get the house completely clean, sheets, blankets, towels, clothing, trash took out, everything done.</p><p>T-01:00, kids are long gone, house is clean. Phone unplugged, everything is set and the excitement builds. </p><p>T-00:00, we fill the tub, light a few scented candles and take one pill each. We bathe together and relax or try too. By the time we get finished shaving and rinsing off we are usually starting to feel the effects, say 30 minutes into it and that time varies.</p><p>T+00:45, we retreat to the bedroom and fire up the music, loud enough to enjoy yet low enough to talk comfortably. We start with maybe a game of cards or dice and step lightly into conversation until we feel the full effects of the roll kick in usually grinning a lot and bouncing to the techno flowing out of the sound system.</p><p>T+01:30, we have by then hit on a few topics that flow into conversation that justifies undivided attention and the game playing stops. We always are in contact physically either legs touching or most usually rubbing something a foot or calf usually works good when sitting across from one an other. Never anything sexual, that takes away from the purpose of where we are at. Still the music plays on catching our attention from time to time if the beat or the song itself catches the right pause in our thoughts. This goes on until we feel we have comfortably caught up with where each other is at this point in our lives usually four hours or more. Usually requiring a second pill or sometimes just a half each.</p><p>T+05:30, by now the conversation has ran its coarse for the most part and I am usually slowing her thoughts with a nice full on foot massage with lots of oil. I must confess at this time that I have somewhat of a skin fetish and the tactile enhancement that ecstasy provides is fortunate for both of us. When the time is right and for some reason we both know when that is, we go into a routine of a full on whole body massage, we change the music to the softer side like Enigma and the like and turn it up just a little because we still talk a little through this precious portion of our adventure. I fancy myself a rather good amateur masseuse and pride myself as such. I will massage with and too the music and get totally rapped up in the job at hand enjoying every muscle and inch of skin I encounter rubbing hard and then soft in unison with the music. Sometimes working muscles and sometimes more of a sensual rubbing and touching yet still nothing sexual . Well ok maybe a little anxious build up by now. I will work on areas that she feels need a bit more attention then others because aside from my personal enjoyment as the giver my intention is for it to benefit her as well.</p><p>The energy that ecstasy gives me is a great thing about now and I will work her body over for no less than two and as much as four hours. I usually sweat profusely for most of this and sweatband and lots of water are essential as are towels, no one likes to be sweated on so we take care to avoid this at all costs. We always find something new to try weather its new oil or massage technique or position. Verbal communication is essential and we are at our best while rolling and it makes anything we do together new or old better since we are in tune with our own and each others needs. We may by now if time and will allows take another dose, these are usually the really long nights actually going into the next day with blacked out windows.  This is the point where we wish we could stay forever just talking and massaging each other for hours and hours feeling completely back on track as a perfectly partnered couple. A lot of sighing and long soft hugs usually go on about now. By now there is a lot more full body contact and we tend to be fully absorbed in each other and everything we do begins to be more sensually motivated until we cant take it anymore and we bond in a physical, emotional and spiritual way that we have yet to mimic any other way.</p><p>I would like to add a final note that we use in extreme moderation as in never more frequently then once every three months so we dont burn out and diminish the all too valuable effects that we so desire.</p><p>Thanks for reading and enjoy safely, I really hope this helps someone.</p><p>Bob</p>",
 "year": "2007",
 "id": "64090",
 "gender": "Male",
 "age": "45",
 "timestamp": "2010-02-13T08:00:00.000Z",
 "views": "14803",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
