{
 "title": "Unexpected Intensity",
 "author": "Shroomer",
 "citation": " Shroomer. \"Unexpected Intensity: experience with Mushrooms - P. semilanceata (ID 64129)\". Erowid.org. Sep 20, 2009. erowid.org/exp/64129",
 "substance": "Mushrooms - P. semilanceata",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. semilanceata",
   "(dried)"
  ]
 ],
 "report": "<p>Well Ive tripped twice on shrooms before, about a year prior to this experience.  Both times I did about 1.7g of cubensis.  My friend T bought 28 grams of shrooms, and I decided that I had a perfect opportunity to take advantage of them-my mother and sister were out of town, and my father and brother were gone most of the next day.  So I bought 3.5 grams of shrooms, of the species semilanceata.</p><p>I decided that I would do all 3.5g because I would not have to deal with my family.  I woke up at 8 AM on sunday and proceeded to eat the whole bag.  I heard a rumor that ascorbic acid in orange juice enhances the visuals, but we didn't have any.  I decided I would run out the store to get some before the shrooms took effect.  I ate them on an empty stomach, so I figured I would have about 30 minutes before I had to be back home and out of the car.  I went to the store and bought the orange juice but the cashier was extremely slow.  By the time I left the store I could notice that the parking lot was just a little different, and felt anxious and antsy.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>T+ 30: Return home, lock all the doors, drink the orange juice.  Grab Ipod and listen to music. Go upstairs and sit on the computer for a little while.</p><p>T+ 50: I look over to my wall, which is covered in glow in the dark wallpaper. I notice a sense of 3-d in the wallpaper, and smile and giggle, happy that the trip is going well.  I head across the hall to the bathroom and have to pee. I look at myself in the mirror and see my dialated pupils and smile.  I feel the 'shroom' gravity make it feel weird to walk.  For some reason I think the person in the mirror isn't really me.</p><p>T+ 1 hours:  I go downstairs and sit in the chair, listening to 311. I am coming up really quick, due to not eating anything else.  I much on a few crackers and then cover up.  My ceiling starts to swirl and flow.  Borders around pictures and the tv are extremely pronounced. </p><p>T: 70 min:  I go outside on the deck and sit down.  The music Im listening to affects my vision.  The grass in the backyard turns teal and reminds me of a disco floor.  It turns into fur and starts 'dancing' to the music.  I am giggling and having profound realizations.  I go through the typical - 'I am one with nature,' 'Shrooms let you see the world as it really is,' etc.  I feel like I am holy and shrooms are holy and everything is right.</p><p>T: 85 min:  This is where the trip goes south.  I didn't remember that I set my phone on the stand next to my chair.  I am slowly losing reasoning and critical thinking.  The vast amount of sensory information is flooding my brain, distracting me, and crossing over.  I go upstairs again and go into the bathroom.  This is one of the most memorable moments of my trip.</p><p>I take off my headphones and put music on through my computer speakers.  I walk to the bathroom and the music sounds like it is coming from a different world... far far away. In the bathroom everything is in slow motion.  The walls are white and blue at the same time.  I have a full size mirror in the bathroom.  I go to move and see myself moving extremely slow.  The music slows down to match me.  This is so fun I think.  I go to the bathroom again and go back to my room.  I look at myself and think, I am not really this person in the mirror. I think I look like a frog.</p><p>I sit and think in my room, and realize that I am having a very difficult time thinking logically.  I think, what happens if my parents call me?  There is no way in hell I can sound normal.  I get afraid that they will drug test me for weed, which I smoked the previous day.  I try to talk myself out of this, saying dont worry, you'll be fine.  My reasoning mind cannot overpower my intense fear.  I feel schizophrenic.  Soon I realize that I am spirialing into a bad trip and try to stop it.  I hold it back for a few minutes, and go back to the bathroom.</p><p>T + 90:  I grow considerably more afraid.  I am not afraid of what I see or feel, but I am afraid that I cannot control myself.  I knew before and my reasoning mind knew this was ok, but it wasn't enough.  I go back to the bathroom I say to myself 'stay in control, stay in control, its ok, its ok.'  The fear grows too intense and I get one thought off 'HELP!'  I wake up a few seconds later on the bathroom floor.  Apparantly I totally left reality and fell down.  This is what I told myself: 'OK, OK, OK, OK, OK, OK, We are going to reason through this, talk through this, lets talk, talk, Im gonna go into my ball, my safe place, my happy place, and think what to do.'  And then I guess my physical body disconnected from my mind and I collapse.</p><p>Even though this was scary, it was my first loss of contact with reality and I sort of miss and love it.  Then I look in my pockets' my phone isn't there.  This makes me so afraid and alone.  I feel so scared that I can't contact anyone.  I start screaming out loud 'I just want my phone! Just give me my phone! you can do whatever else but give me my phone!'  I run back and forth between the bathroom and my room looking for it.  After a while I realize maybe it could be downstairs.  I go downstairs and find it and I am so happy.  I come to the realization my phone is a symbol of security to me.  It is my connection to the world. </p><p>T+ 90:  I sit back down and try my best to think.  I decide that its not safe in my house and that I will get caught by my parents, even though I know there is no way for them to be home.  I decide I must leave my house by 3 PM to be safe.  I am still coming up and this scares the hell out of me.  My walls and ceiling are shaking and my house looks like its going to explode.  I totally give up on my own reason and try to figure out what to do.</p><p>After a while I remember my friends parents are out of town, and I decide I have to go over to his house.  It takes me forever to go through the steps of leaving my house and making sure everything is ok.  My house is a symbol of safety as well, since I know Im safe in it.  I finally get my shoes on and decide to leave.</p><p>t+100: The world is nothing like I remember it. I feel like Im on a foreign world. The clouds are like skyscrapers.  Im walking down the road, staring at my feet, since I feel like my body is a lava lamp.  I call my friend and he doesn't answer.  I call his brother and he answers.  I tell him Im coming over.  He says OK.  Then I get afraid that I forgot to lock my doors: I can't remember.  I turn around, but then get too afraid and turn around again.  Cars are flying past me and I don't even think about them.  I keep saying to myself out loud 'Its good, we're Good.'  I call my dealer, get his voicemail and tell him to call me back. </p><p>t + 110:  I feel so scared and alone walking down the street.  I realize I must talk to someone in order to function.  I call my friend who was sleeping, and realize that there is no reason for me to talk to him.  I tell him what I ate and he says he is going back to bed.  I realize that he doesn't really care about what's happening to me.  I call my other friend call him 'Al' and tell him that I ate an eighth of shrooms and I am having a really bad trip and I need his help.  He says he is gonna take his dog out and then talk.  I get so antsy, like I will never make it to his house.  I ask him if he can pick me up. </p><p>t+ 120: I am so afraid. I feel like I have no control over myself and I really don't.  I can't think.  My friend tries to talk to me and it sort of helps.  About the longest 5 minutes of my life pass, and he finds me and takes me to his house.  I tell him that we need to come up with a plan if my mom calls.  Apparantly this is a big deal, and I don't think that I can just not answer it.  I think about telling her the truth and that she will understand because shrooms are so holy.  Then I realize this will never work.</p><p>We get to my friends house, and I feel a little better. I realize that there are 3 things affecting how afraid I am: The sun, my friend, and my nausea.  When the sun goes away, I got scared.  When my friend left the room, I got scared as well.  And I felt so sick.  I just want the trip to end, I think that I will never do drugs again, and I am afraid I'll be like this for too long and my parents will notice. </p><p>t+140: I sit outside, and the realize that walking helps me think. I start walking in circles and try to talk to my friend.  He tries talking to me to calm me down.  His brother also comes out and talks.  I feel like they have no idea what I am going through.  But then again I don't want to freak them out either so I try to act as sober as possible. </p><p>I'm caught in a dilemma-I want to be able to act sober because I have this fear I will need to face my parents any minute, and I also want to act as high as possible so my friends know what Im going through.  I alternate between these feelings every second and I hate how I can't feel just one thing at a time. </p><p>For basically the next two hours I go off and on between enjoying the trip and hating it.  I walked back and forth on the sidewalk for a while listening to music and trying to think of the lyrics, but I can't remember any.  The clouds are morphing, the steps become slopes, my friends eyes are glowing.  The trees are waving to me and the sky is indescribable.  When I start feeling nauseous again I get scared again, and try to drink water to help it pass.  I realize that my body is not me, and I am a separate entity.  I try eating some stuff, but it really doesn't help.  I go to the bathroom again, and in the mirror I turn into a skeleton and a frog and I hate the person in the mirror which isn't me.  The decorations in the room keep flying off the walls at me. </p><p>My friend is an abstract artist, and I enjoy looking at his paintings. They are amazing.  They are moving and shifting and changing before my eyes.  Everything I look at melts into something else.  In the mirror a see myself pop in and out of existence. and I see what I perceive to be hindu gods.  I close my eyes and put on fast music, and I just dance and feel ecstatic.  I see blue balls of energy and feel like Im falling. The whole time I want the trip to end.  My dealer texts me and I ask him how long it will last, even though I know myself and don't need his reassurance.  It makes me feel better though. </p><p>t+ 180:  I calm down a bit, my breathing gets a little better.  Im still tripping balls.  I think that if I sleep it will go away, but I try and can't get anywhere.  My friends' paintings stare at me.  We watch TV and the eyes of the characters glow.  Candles shrink and grow, and the carpet turns into grass.  My legs feel like one, and I interlock my fingers and it feels like one hand.  I still feel nauseous and want it to end.  I lie down on the caught and watch my feet and hands shrink to baby size and back.  I watch my skin crawl, but it doesn't bother me, because I know that its just the drug.  I am starting to come down, and now I am enjoying the trip.  I feel like every minute is an advance to reality and that makes me happy.</p><p>t+240:  I am mostly down, things are still shifting and weird. The world just looks really weird, and now that I can think straight, I am happy.  I wish I could think normally and trip intensely, but I know that is not possible.  I realize that I hated and loved the trip at the same time.  I am starving, and my friends and I go to eat.  For the next few hours I feel a little weird, and things seem a little weird, but I am basically back to reality.</p><p>Later I realized that I took a pretty potent species of mushroom.  The trip was just too intense for me, I felt out of control and this put me into a bad trip.  I realize now that even though I said I wouldn't do drugs anymore, I feel good about my trip.  I probably will try another 3.5 again, but probably not alone, and I will also have to convince myself that there is no way I can get caught, because that was my biggest fear. </p><p>Maybe next time I will remember how I got through this one and I will be OK.</p>",
 "year": "2007",
 "id": "64129",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-09-20T07:00:00.000Z",
 "views": "2614"
}
