{
 "title": "Out of Body Without Drugs",
 "author": "DemonicDreamer",
 "citation": " DemonicDreamer. \"Out of Body Without Drugs: experience with Brainwave Generator & Coffee (ID 64148)\". Erowid.org. Aug 21, 2007. erowid.org/exp/64148",
 "substance": "Brainwave Generator & Coffee",
 "bodyweight": "180 lb",
 "report": "<p>This was a while ago. I was messing with a brainwave generator that played sounds, most of them either give me a headache or make me feel different but I was messing with the settings trying to make one for Out of Body. About 2 months later I finally found sound settings that worked for me.</p><p>I remember laying on my bed forever with eyes closed thinking nothing would happen. About 10 minutes of listing to that horrid sound I started to feel 'different' And my feet started to tingle. Eventually it ran up my body and into my head. It felt like pressure on my body but it felt really good. I felt what I thought was a hand on my chest and I quickly snapped out of it kinda freaked out.</p><p>I continued to lay there the sound made me sleepy even though I was awake from taking coffee earlier that day. Closing my eyes felt so good for some reason. About 10 minutes after I closed my eyes again I started to get that feeling again but this time I wanted to see what happened and not 'freak out' I remember opening my eyes because my body felt so good. To me it was better then the body high from MDMA. The body high was very strong even though I opened my eyes. It felt good to wrap my furry blanket around me as I continued to listen to to ever growing enjoyable sound.</p><p>I don't know when it happened but some time during that body high that I was enjoying I was staring at my light everything around the light darkened and started to take shape. I was transported to where I use to live and I saw the refridgerator open. I walked up to it and closed the door but the light still remained. I turned around and looked out the window but all I could see was that light, I then heard a strange noise and snapped back to reality. It was my sister opening my bedroom door asking about that sound.</p><p>For a while after I have tried to get the same effect from that sound but with little or no luck. This experience was one of a kind that I wish I could have finished. I'm sure that if I tried it longer like I did that time.</p><p>I've tried a 3rd plateau of DXM with that sound and have had good results except that sometimes the experiences are too emotionally intense. I have woken up from an OoBE completely in tears unable to stop myself from crying a couple of times.</p>",
 "year": "2004",
 "id": "64148",
 "gender": "Male",
 "timestamp": "2007-08-21T07:00:00.000Z",
 "views": "12987",
 "dose": []
}
