{
 "title": "Alright Then",
 "author": "The Doc",
 "citation": " The Doc. \"Alright Then: experience with Salvia splendens (ID 64159)\". Erowid.org. Oct 18, 2007. erowid.org/exp/64159",
 "substance": "Salvia splendens",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 leaf",
   "sublingual",
   "Salvia splendens",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2007",
   "64159",
   "Male",
   "",
   "Not Given",
   "Oct 18, 2007",
   "4651",
   " "
  ]
 ],
 "report": "<p>Well, I read about Splendens on the interweb (where else?) and was immediately intrigued by its non-scheduled-ness and its readily-availability. I was further delighted to know that it was growing just down the street from my school, naturally, I had to pick some. Please note that what I did could be considered 'stealing', but I'm sure there has been far worse documented without the use of a disclaimer, so I will continue without further delay. I have had a fair amount of experience with substances, ranging from Marijuana to Codeine, to benzos, to Propylhexedrine, to Addy, etc etc etc. However, I have never had any experience with any of the Salvia-family plants, such as the ever-growing-in-popularity Salvia Divinorum, and reading that Splendens was less intense the aforementioned, I was quite comfortable with this experimentation.</p><p>Anyway, to make a long story short, I picked ~20 leaves and chose a medium-sized one to use sublingually. I tore off the stem, rolled it up, and shoved it under my tongue as best I could. I just let my saliva run up into the ball of plant matter and get washed down my throat as I swallowed. After about five minutes, I  could begin to feel a slight anxiolysis coming on. At about 20 minutes, the effects peaked. The only thing I could really compare it to was, perhaps, subling-ing ~1-2mg of Clonazepam, minus the dis-coordination. HOWEVER, I will say that it produced this sort of 'clarity'. I don't believe in a lot of this spiritual mumbo-jumbo that many people tie-closely to substances, but the feeling it produced was like lifting a dark, translucent film from  my train of thought, a film that most likely came from my recent  over-indulgence in marijauna. After the general backdrop of anxiolysis fell away (after about 1.5 hours, I 'buccal'd' it for about 25 minutes), I was left with this 'clarity'.</p><p>I thoroughly enjoyed this experiment and will soon be re-visiting this very interesting plant.</p>"
}
