{
 "id": 6419,
 "title": "Better Than I Could Have Imagined",
 "date": {
  "submission": "2007-01-17T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jack2",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "DMT cracks me open like a chestnut. It forces the most radical, temporary, awakening I could imagine. The second after I smoke it, it's like all the light that is twisted 'wrongly' around my third-eye unravels to reveal to me how I'm really connected to the Universe.",
  "(This is just my experience BTW, I have lots of friends who report different experiences that don't have much to do with their physical bodys energies, that's 'cause they left their bodies though...)",
  "The first time I smoked it and the third-eye 'unraveled' itself, I was struck by a bit of fear. There is a radical sense of someone's very familiar 'Presence' that accompanies the overall experience. This Presence showed me energetically where the fear laid in my body, and showed me how to sweep it away with my mind. Once the ego was swept away I could sense every iota of energy within my body as pure consciousness, impersonally aware of me. Yet AWARE like you wouldn't believe.",
  "This knowing then stretched beyond my physical body and I could sense every iota of energy in the ENTIRE Universe also aware of me. My ego started spinning again at this point and frantically asked, 'What does all this mean? What does it mean?!?!' The Presence then non-verbally replied, 'IT IS ALL PERFECT. You can't #$%& it up! All your troubles and fears are illusions that keep you from seeing this magnificent connectedness all the time. The ENTIRE Universe is conspiring to bring you EVERYTHING you ask for. Stop asking for anything less than Perfection and Knowing of Oneness and that's all you'll get. Stop judging right and wrong because every time you do you are VIOLENTLY off base. To be grounded in the only True Reality you must have an inner state of Peace because anything less is not Reality. ",
  "I was so grateful I thought I was going to melt away, so I thought to the Presence that I would like to go back to my 'normal' state. I was immediately 'slid' back with another non-verbal communication from the Presence that I could come back anytime and didn't need DMT to visit that state, it is my Divine Heritage and my only True Home, as it is anyone's, within the realm of All That Is.",
  "The whole experience took less than three minutes.",
  "I have been back to that state via meditation but it normally gets cut off once my silent mind is interrupted by my ego catching a glimpse of Reality and exclaiming, Holy Shit , HHHHOLY! WOW! THIS IS BETTER THAN I COULD HAVE IMAGINED! THE BEST OF THE BEST IS WHAT I M A PART OF! And that s not Peace, so I m shifted out of that state and back the unpeaceful state of questioning and wondering instead of just Being."
 ],
 "erowid": {
  "id": "38278",
  "citation": " Jack2. \"Better Than I Could Have Imagined: experience with DMT (ID 38278)\". Erowid.org. Jan 17, 2007. erowid.org/exp/38278",
  "substance": "DMT",
  "views": "4167"
 }
}
