{
 "title": "Worse Than It Seems",
 "author": "Kym",
 "citation": " Kym. \"Worse Than It Seems: experience with DXM (with CPM) (ID 6420)\". Erowid.org. Feb 24, 2002. erowid.org/exp/6420",
 "substance": "DXM (with CPM)",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  "28 tablets",
  "oral",
  "DXM",
  "(pill / tablet)",
  "",
  " ",
  "oral",
  "Chlorpheniramine Maleate",
  ""
 ],
 "report": "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]</p><p>I first did coricidin the start iof my sophmore year at high school and thought it was fun enough but didn't really care about doing it again. I did it a few more times on weekends and realized how it made me want to meet people and made me feel more comftarable socially. I switched schools in the middle of the year and didn't know anyone so i took it my first day. anyday when i wasn't on it at school i felt like a reject, so i did it almost every day for a month or two.</p><p>One night me and my best friend were at my house and i ended up taking 28 just for the hell of it. I had never done any drug besides weed and i started tripping out and i got more scared then i ever have in my life. i was hallucinating and my best friend was drunk and didnt know what to do. After I started throwing up all over my basement my parents found out which was really bad because they thought i was an angel.</p><p>I didn't realize til after that episode how bad it gotton where i was doing really bad at my new school and probably acting really messed up all the time and not even realizing. I also realized how many boxes of coricidin I'd stolen over this period wherew i had never stolen anything before that. I throw up really easily now which really sucks. I saw coricidin pills for the first time like a week ago when some girl was taking them in the bathroom at my school, and seeing them made me throw up. It's a really scary thing and its embarassing to basically go thro emotional rehab for a COLD medicine. I like to call myself an ex grocery store druggie, and for anyone who does it i recommend getting a real drug, at least then you know what you're getting into!</p>",
 "year": "2001",
 "id": "6420",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-02-24T08:00:00.000Z",
 "views": "22155",
 "dose": {}
}
