{
 "title": "Effects Present yet Unknown",
 "author": "Pry3rdEye",
 "citation": " Pry3rdEye. \"Effects Present yet Unknown: experience with Salvia splendens (ID 64215)\". Erowid.org. Jan 18, 2008. erowid.org/exp/64215",
 "substance": "Salvia splendens",
 "bodyweight": "190 lb",
 "report": "<p>I started growing salvia splendens after I was forced to quit smoking cannabis after about a year of heavy habitual use. It sort of happened by accident as I was simply buying an array of flowers for my yard; I stumbled across a purple variety of splendens. At this point I had no idea if it had anything to do with divinorum or not but I figured its worth it to find out. After a little bit of research I understood that splendens is a pretty ambiguous substance in relation to psychoactivity, methods, effects, etc. I decided to experiment.</p><p>So far I have had 3 experiences with the plant.</p><p>The first one entailed the smoking of one dried leaf. As expected, I didnt feel much if anything. I figured Id start small, get the feel for things.</p><p>The second experience involved a 9-11 leaf quid, one dried leaf smoked, and a few dried flowers that were also smoked. I smoked all the material quickly holding in each of the 7 hits at least 20 seconds each. From this there were about 2 hits of dried leaf, and the rest were dried flower. I still didnt have much expectation until the quid. I rolled it up and sat calmly as I started a slow meditation in the darkness of my room. After about 10 minutes effects were slight, almost not noticeable. It was very soothing though once things got going, it felt a little different to just sit and relax, different in a good way.</p><p>The third experience occurred about a month after the second one. I was in a different environment, at the lake rather than at my house. I brought with me 5 leaves, 2 were dry and ready to be used. With the first two experiences smoking was done with a homemade pipe made of a can and the other out of a pen and some foil. Probably the two shittiest ways to smoke but I didnt have my glass pipes because of my discontinuation of cannabis.</p><p>This time I had higher hopes. I made a waterfall bong out of a bottle, and a 1/4' socket after drilling two holes. After clearing the 2 dried leaves in about 2.5 - 3 hits, I finally had achieved something more noticeable. There was an apparent relaxation coming over me. Everything was soothing. There were short stints of auditory hallucination. Everything felt calm, but extremely different in an almost weird way. I felt as if something strange was happening. Everything was interesting and peaceful, looking at the scenery was different, lights were sharp but still quite calm and every day things just seemed the slightest bit heightened, but at the same time they were still so peaceful.</p><p>Finally, the anxiety of unapparent effects and the high hopes of pinning down something tangible with this plant overcame me. I lit up a cigarette, which was actually quite interesting as I sat and watched the smoke swirl in, out, and around the room. It felt as if I had never smoked a cigarette this way before, but then still nothing was extremely distorted about it, it just felt much different.</p><p>Overall I believe this plant is psychoactive. I think its a great material to sit, meditate, and form internal thoughts and ideas as it seems to have such calming effects without mental fuzz. It seems to be very picky and ambiguous at almost any raw or dried leaf dosages. I think extraction is the only way to completely define this plant. I intend to do much more experimentation and hopefully gain success in trying to make a proper extract in order to achieve worthy effects.</p>",
 "year": "2007",
 "id": "64215",
 "gender": "Male",
 "timestamp": "2008-01-18T08:00:00.000Z",
 "views": "4893",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia splendens",
   "form": "(dried)"
  }
 }
}
