{
 "title": "Truth Serum",
 "author": "DT",
 "citation": " DT. \"Truth Serum: experience with Alcohol (ID 64279)\". Erowid.org. Sep 29, 2009. erowid.org/exp/64279",
 "substance": "Alcohol",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "1.5 shots",
  "oral",
  "Alcohol - Hard",
  "(liquid)",
  "",
  "3 glasses",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)"
 ],
 "report": "<p>I am a very uncertain person, and yesturday it just showed through so much. I was depressed, and I have a bit of a problem distinguishing the truth on how I feel about someone/something, especially when it came to love.</p><p>So I went over to my ex's house and drunk 1 and a half shots or so of 70 proof, and between 3 or 4 beers. I was pretty fucked up, I felt fantastic, it feels like DXM but without the dreamy feel of DXM, and not AS empatheogenic, but still empatheoginic. I was extremely minded at the time, and was hanging out with my ex, and just got a desire to tell her the truth, something I can not do when Im sober. I felt that I made up my mind of how I felt about my ex, so I told her how I felt instead of what she wanted to hear, I was completely straightforward, honest, and blunt(though not rude). I find that I sugar coat things way too much when Im sober, and when Im drunk I see things as they really are and the curtains covering the truth are completely released. It's pretty amazing.</p><p>Somehow I wake up the next day, and I feel so much more understanding and I feel like I can take closure from her. I don't feel as dependent for her, and I just feel more independent, and very optimistic and enlightened to think of another road. A day before this experience I was terrified to think of no Tiff and was extremely clung to her, when I got drunk I saw all the flaws the way they ARE, I was not in denial of them, and I saw just how irresponsible it would have been to go out with her, etc.</p>",
 "year": "2007",
 "id": "64279",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-09-29T07:00:00.000Z",
 "views": "6390",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.5 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": "3 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
