{
 "title": "The Start of the End",
 "author": "Thesh",
 "citation": " Thesh. \"The Start of the End: experience with Cannabis (ID 6427)\". Erowid.org. Feb 27, 2002. erowid.org/exp/6427",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " joints/cigs",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Me and all my mates were 18 at the time. We were sat in my mates car, all 5 of us squished in. Around came the joint. A friend had been to USA and had brought back a whole pack blunt cases. This is what we smoked. I smoked the majority of it.</p><p>Then I started laughing, really really laughing. i shut my eyes and laughed harder then everything slowed and i was a tiny dot beside my face, it was as if my face was a cliff and i was a little rock climber ascending it.</p><p>Next i'm behind my head, looking at my body as it laughs and looking at my friends as they talk. my attention was drawn to the guy sat in the driver seat and he had a small point of light in front of his head. All of a sudden i hear a crack, see a flash of white brilliant  light and hurtle back into my head and back into my eyes. I open my eyes and start talking about the experience I just had. The guy in the driver seat had exactly the same experience; the slowing down, the hugeness of his face, situating himself behind his head and looking at me and seeing the light behind my head.</p><p>We talked some more and i 'pulled a whitey' (went really pale). I felt like i was going to swallow my tongue and had to sit with my head between my head and my tongue firmly clasped between my lips to stop it being swalloed. I bought some water and drank that, the liqiud seemed to stop my anxieties and me and my friends parted ways as they dropped me off at my car.</p><p>i drove home stoned off my nut. something that i did quite alot during this time and found quite pleasuarble. I looked in my rear view mirror and saw a car coming up behind me at a fair rate. it was night time so he had his lights on. he signalled right and pulled out to over take. he was taking his time coming so i slowed and waited. still he did not overtake and so i turned my head and looked at the back of the car, through the windows. There was no car there! i went back a couple of days later and found out whether there was anywhere that he could have turned down, none! i had hallucinated the whole thing.</p><p>I get home and i am scared. very very scared. i lay down on the bed and tried to calm myself. it wasnt happening. everytime i slowed my thoughts down i felt as if, no, i was sure i was going to die. i now know what it is like to die, the slowing of thought, the realisation that this is your last thought and then nothing. no dream like state, no ascending blissfully to heaven just an end of thought and an end of consciousness. it was scary scary shit and i wanted to have my mum around as it ended.</p><p>I woke her up and we both went back to my bedroom where i lay down again. she took my pulse and said it was slow. she tried talking to me but i was thinking too slowly for anything to register. having her there was my saving grace. without her i would have simply stopped thinking and died. she told me the next day that eventually i fell asleep, my pulse was still low but my breathing was on an even keel.</p><p>i have never, ever had an experience like that, nor would i want to have another. sure i have had experiences with weed where i think deeply and my past present and future, i have had panic attacks, i have even had great times but never have i been so sure of being so close to the end.</p><p>has it changed me? yes, sad to say i am more introverted than i was before, i think deeply all the time about everything, i cannot concentrate and i cannot study. i have lost friends, become detached from my family, lost girlfriends and found solace in alcohol. at a time when my peers are having the time of their lives and who,when i pluck up the courage to talk to them, delight in lecturing me with how great their lives are at the moment.</p><p>i hate the way i am and what that evil weed has done.</p>",
 "year": "1998",
 "id": "6427",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-27T08:00:00.000Z",
 "views": "6210",
 "dose": {}
}
