{
 "title": "Big Mistake",
 "author": "Hax0r",
 "citation": " Hax0r. \"Big Mistake: experience with Dimenhydrinate (ID 6429)\". Erowid.org. Feb 26, 2002. erowid.org/exp/6429",
 "substance": "Dimenhydrinate",
 "bodyweight": "143 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "",
   "Dimenhydrinate"
  ]
 ],
 "report": "<p>\nWell, I took it at 11:00pm, by about 11:30 I started to feel like I had a light buzz from smoking weed.  But when I began to walk, it was like I had taken robotussin.  I had to piss twice in 15 min.  It was kind of odd.  Then I got into my bed, while my two friends stayed in the room(they also took the same amount)  I am not sure what they were doing or what happened to them, because I think I fell asleep.</p><p>When I was 'sleeping' in my bed, I was looking at them with my eyes closed and could see their every movement, then I would open my eyes and they would be doing the exact same thing as I thought they were doing.  So, then i was woken up the next day at 12:00 completely confused and I saw my girlfriend by my bed, she came in to wake me up.  I fell asleep again.  I woke up an hour and a half later.  The entire day I was completely disassociative to what was happening, I didn't think that life was real.  It was the worst day of my life.</p><p>Today, being two days after, I am still feeling like nothing is real.  My hand are constantly shaking, i am seeing in trails. I feel as if I lost at least 20 IQ points.  I am having a lot more trouble understanding things in school.  Basically, this is hell, I will never do this again.  I want to write a letter to the company that makes this shit saying what it did to me.  This should not be legal.  IT is more dangerous than LSD or anything else.  The only advice I can give, is never do this, EVER!  Its not worth the experience or anything.  Also, when I take my ritalin/concerta (methyphedidate) I get the robo walk back.</p><p>I love hallucinagenic drugs, I am fascinated by the altered consciousness, but this is the worst thing I can imagine.  Please don't ever do it.</p><p>~hax0r</p>",
 "year": "2001",
 "id": "6429",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-26T08:00:00.000Z",
 "views": "20972"
}
