{
 "title": "A Shift in Head Space",
 "author": "Captain Ridiculous",
 "citation": " Captain Ridiculous. \"A Shift in Head Space: experience with Salvia divinorum (5x and 60x extracts) (ID 64303)\". Erowid.org. Nov 7, 2007. erowid.org/exp/64303",
 "substance": "Salvia divinorum (5x and 60x extracts)",
 "bodyweight": "170 lb",
 "report": "<p>By: Captain Ridiculous, 17 Male Caucasian 170lbs</p><p>I decided to make my friend A's 18th birthday memorable, so it seemed the right thing to do to obtain items that were not available (legally anyway) to us minors. We smoked an authentic Cuban Cigar stolen from Mexico (god damned trade embargo...), he bought a porno, and of course, we visited our local head shop. The man working the counter at the store asked for our I.D.s immediately, so I had to step out, being 17. Our main goal was to get our hands on some 20x salvia extract. We have both smoked salvia several times before, up to 10x, but it only left us with a mild stoned type feeling with a piercing headache about 30 minutes later.</p><p>I must have waited outside that cheap little L.A. smoke shop for 20 minutes, so I expect something good is bound to come out in the plain brown paper head shop bag. So of course, that rat bastard A comes out with 5x, saying that the only other extract they have is a 60x for eighty bucks. Well, I was a little disappointed, but I remembered all the trip reports of people saying they went to alternate realities and had experienced some sort of chemical communication with ancient gods and all that other stereotypical psychedelic crap on 5x so I decided we might as well give it a shot.</p><p>Before I go on, I should mention I am not a newbie in the world of psychedelics, but Im not bonafide psychonaut either. During my four years of publik high-school (where I learned that if you have half a brain, You can smoke pot for four years and still get into a U.C. system school,  hooray publik edjucashun!!! I have tried DXM up to the 4th plateau, nutmeg, lotsa pot, some alcohol, morning glory seeds, Syrian rue (those Peruvian Shamans must have iron stomachs not to throw that shit up the second it touches their mouths), benadryl, adderal, and concerta.</p><p>Experience #1, the 5x salvia extract</p><p>Setting: Noon, My backyard, typical suburban size, has many types of colorful flowers. We sit down at a table on my porch and start to smoke the Cuban.</p><p>T:00mins: We smoked a quarter of the Cuban cigar and decide to get into the salvia. I pack a bowl, roughly a 1/6 of a gram and down it in one hit. I dont know if this is relevant, but we used a butane barbeque lighter.</p><p>T:01mins: I feel a little off baseline, but nothing significant. I pack another bowl and hit it a long as I can.</p><p>T:06mins: I feel like something is pulling me sideways, I turn to my right and the pulling sensation is still coming from the same place. The flowers start to seem much brighter, but there are no real visuals. I can tell what people mean by You have to meet it half way. I try to relax and make my brain give off more Alpha waves, (the ones you give off when your about to fall asleep) but I stay in the same being pulled/colors are brighter head space, Im not really being thrown into an alternate reality. So naturally Im slightly disappointed. During this time, A packs a bowl for himself and smokes it in one hit and sits back down.</p><p>T:10mins: While I feel like its working to some extent, its not giving me a parallel universe of some sort, so I decide to finish off whats left.</p><p>T:20 minutes: Me and A sit outside discussing the meaning of distances between objects. I feel the salvia has changed my thought patterns somehow, but I cant put my finger on it. Its nothing like morning glory seeds or pot, it seems deeper than that. Very unusual, but still enjoyable and pleasant.</p><p>T:25 minutes: The strange pulling feeling is present in both myself and A, and we are discussing our usual intellectual topics like, Our physics teacher is a fucking son of a bitch and the ever popular Can I go through college stoned like I did in high school.</p><p>T:30minutes: We both feel very stoned, but our ability to think clearly is not affected at all. We decide to go inside and watch part of the porno A bought.</p><p>T:31-50minutes: We cant stop laughing at the terrible acting. All of the sex acts seem ridiculous and superficial, not in the Oh its fake cause its porn kind of way, but all sex in general, and I cant stop thinking You want proof that were evolved from monkeys Christian America? Here it is! We turn it off after some sicko 45 year old starts to have sex with a 20 year old pretending to be one of those 12-15 year old candy stripe girls that they have in hospitals. I begin to feel a general disgust at males for letting their lust take over every aspect of thinking, including general decency.</p><p>T55:minutes: Both of us are generally baseline with mild headaches. While the 5x salvia was fun, I was disappointed that I wasnt sent into some sort of disassociated from reality hallucinogenic state. Theres no way that Im gonna end the day feeling disappointed, so A and I decide to grab lunch and then go back for the 60X Salvia Extract.</p><p>Experience #2: Salvia 60x: Bubbles, Dots, Tunnels, and other such ridiculousness.</p><p>We go back to Dj Vu, our local head shop in beautiful Torrance California (sarcasm) and A tells the guy at the counter we smoked the entire thing and only got a buzz and a headache and that we want the 60X. He laughs and gives him a strange look, pauses, leans in, and says in a soft voice, Your gonna enjoy this.</p><p>Setting: We decide to go to Redondo Beach to smoke, but all the lifeguards are on duty, so we have to walk all the way down to Rat Beach, which boasts the most feces in the water of any surf beach in California, to smoke on a fairly large plateau by the beach club where the wealthy whites of the world gather to celebrate their riches and whiteness. The plateau is fairly large, so the danger factor of walking off the cliff in a salvia stupor is fairly low.</p><p>We walk 20 minutes to the plateau only to discover I forgot the lighter, which caused both me and A to rattle off a plethora of curses and swears. I run to my car and back, which is about 1.5 miles in sand. Needless to say, I get back and I am extremely sweaty and out of breath. At this point, the sun sets, but the fog blocks out most of the natural light show.</p><p>T:00 minutes: I pack the bowl and say, Here goes nothing, and unfortunately, I was right. Being very out of breath, I can only hold it in for about five seconds before I start coughing like a newbie. Even after only five seconds, I still felt something.</p><p>T:05 minutes: I pack another bowl of the 60x, hit and hold for about 25 seconds, as soon as I exhale, Im right back to where I was at the 5x salvia extract peak. I quickly load 2 more bowls and suck them down in to hits.</p><p>T:7 minutes: The gravity sensation is VERY strong,  The Ocean starts to look like an oil painting. I offer A a bowl and he smokes about 7/8ths of it and holds for about 45 seconds. I, being the vermin bogart that I am, suck what he doesnt finish.</p><p>T 10-45 minutes: I am now very captivated by the ocean. I start to feel how overpowering the ocean is and how no matter how big or small you are, the ocean is still trillions of times more powerful than you. Everything around me looks incredible. I lie on my back and look at the clouds and everything seems to be moving at an incredible rate of speed. I quickly close my eyes and apply slight pressure to both of them for about 45 seconds (AKA, the elementary schoolers way of hallucinating) and when I open my eyes, everything is incredibly bright. I turn to A and say Everything is so bright! which I think he found amusing.</p><p>At this point, I get this oval shaped transparent tunnel right in the middle of my vision. It is rather small, so I put my hands in its shape around it in attempt to capture this strange tunnel. It took me a few trys, but once I got it, it kind of looked like the bubble liquid in those bubble blowing wands before you blow it, the oval shape I was making my hands in being the wand. I explained what was going on to A and he said he had a vision of a gigantic mirror hovering over the ocean and it suddenly being thrown at him. After he said this, I tried to throw my bubble oval that I had captured in my hands at him, just for the sake of ridiculousness. When I made the throwing motions at him however, it became apparent that my bubble/tunnel would not be thrown. A started cracking up because I was just holding my hands in an oval in front of me for 10 minutes trying to throw an imaginary tunnel/bubble at him. I guess I did look a bit ridiculous. Also, both me and A saw dots going every which way for the majority of this time.</p><p>T:45-60 minutes: A starts to talk about very complex and introspective subjects that I have never heard him talk about more. I quickly pack another bowl and suck it down, hoping that Id get propelled into an alternate universe, but no such luck. However, both mine and As speech patterns turn very Mr. Miagi Karate Kid dojo like aka Fragmented Japanese Engrish like in structure, but both of us can still understand what the other is talking about. I think we were having parallel trips, because whatever subject I was thinking about, he would start to talk about, leading me to say, no way! I was totally just thinking that! many times and visa versa.</p><p>T60 minutes: We were both starting to come down and A had to be home for some family birthday party at his house, so we decide to pack up and go.</p><p>T:70 minutes: We get in the car and drive to my house where A left his car. While I feel very relaxed, I am completely confident that I was 100% to drive, as driving intoxicated on anything is something I am very much against.</p><p>T:90 minutes: I get home, A and I part ways, I walk inside feeling very relaxed. When I talk to my mom however, she seemed to think that I was stoned or something, but I convinced her that we only went to the beach to smoke some more of the Cuban.</p><p>T150-330minutes: I write this report feeling very at ease with myself and all that is around me, which is very unusual for me. I usually have this feeling of wanting to do something or smoke some pot 24/7, but that feeling is completely gone.</p><p>Conclusion:</p><p>While I didnt enter any alternate universes or talk to an Egyptian goddess, I still had an incredible experience with the 60x salvia extract. I particularly enjoyed the effects on my thought processes, making me feel introspective in the John Lennon way as opposed to the Syd Barrett way. Also, I never felt stupid like I do on pot, which is a major turn-off for me when it comes to weed.  This is a very wonderful worthwhile drug and if you can spare the cost (shit I just realized I spent 105 dollars on salvia today), I highly recommend the 60x. Because like they say, anything worth doing, Is worth doing right.</p>",
 "year": "2007",
 "id": "64303",
 "gender": "Male",
 "timestamp": "2007-11-07T08:00:00.000Z",
 "views": "3670",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  },
  "1": {
   "time": "",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
