{
 "id": 6435,
 "title": "Smooth Fun Trip",
 "date": {
  "submission": "2008-09-26T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Phoenix",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 1:30",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:30",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "<p>I had just gotten home from work and i knew i was going to trip with a few people in my dorm. When i got back they had all already taken them. They had made peanut butter and jelly sandwiches, so i put the mushrooms (which i had heard to be spectacular, and they looked incredible) into my grinder and shredded them and placed them in between the sandwich and ate it down. my girlfriend was coming over for about an hour, so shed be gone before id really start tripping.",
  "She came over and we watched a funny movie and i could feel the mushrooms starting to wash over me with a nice body high. My girlfriend wants to take them too, so i was trying to describe them to her. She left and i went to see what my friends were doing, knowing they would be into their trip now. My friend B can into my room and we put on some music and some cartoons and checked out all the trippy stuff i have in my room while watching cartoons listening to hendrix, zeppelin, shpongle, and pink floyd. Good times. We smoked a bowl while doing this. Then a couple other people came over and we smoked some more.",
  "The body highs became pretty intense at this point and the visuals started, as well as some auditory distortion. I smoked relatively non stop all night during my trip, and i took 20 mg of 2ci i had about T+1:30 after the shrooms. I had done a lot of 2ci and was very familiar and comfortable with the effects, and i thought it would compliment the mushroom trip, (which i had only done a few times) nicely. I went to see what the other people tripping were up to, and i saw my friend steve, tripping for his first time rolling around on the floor laughing. he was peaking about now and having a great time. he told me he had been thinking WAY too hard. to give him somethin to do for a while, i asked him 'Hey steve, Where are you?' He went nuts thinking of all the different ways he could answer that question in his current state.",
  "My visuals were getting intense now, a sort of psychedelic film formed over my entire field of vision and i could see geometric designs floating everywhere i see, almost superimposed over my vision. I could barely understand anything that was said at times, but was having a great conversation about total nonsense with B. i wandered around my room hallucinating for a while, thinking, hey this is fun! The 2ci was comin in now and i had a sort of different euphoria washing over me with a great body high and overal happy feelings. i knew the 2ci would keep me up for a while, and we smoked some more out of my bong. as i was hitting it, the bowl has tubular inside-out designs in the glass, which started wriggling and writhing and growing, but it wasnt disturbing at all, i just knew i was hallucinating and it looked great.",
  "Everyone left for a while and i shut off all the lights in my room and just sat on my bed staring at the stars on my ceiling, having amazing visuals and intense introspective thought. I conceived the entire universe and could completely understand everything and its purpose. I realized immediately that everything i was thinking was complete nonsense and i explored the unvirse on my ceiling for a while with some great music on. Then my friend J came back and we smoked some more and watched some Aqua teen hunger force (great to trip to) and i eventually fell asleep.",
  "Overall the visuals were a lot of fun, i could see the transition as the 2ci hit and the patterns changed from the shroom style of hallucination. I didnt get the visuals i had wanted from the mushrooms however, i was looking fr something more intense, and i think in the future i will try making tea, and ingesting more, at least 7 grams.</p>"
 ],
 "erowid": {
  "id": "38326",
  "citation": " Phoenix. \"Smooth Fun Trip: experience with Mushrooms & 2C-I (ID 38326)\". Erowid.org. Sep 26, 2008. erowid.org/exp/38326",
  "substance": "Mushrooms & 2C-I",
  "views": "3965"
 }
}
