{
 "id": 6437,
 "title": "In the Name of Science; Definitely Not Worth It",
 "date": {
  "submission": "2004-11-22T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "MMan",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Moclobemide"
  },
  {
   "time": "0",
   "amount": "T+ 1:00",
   "administration": "28 mg",
   "substance": "oral"
  }
 ],
 "report": [
  "In the name of science (and because methylone is now unavailable), I chose to explore the dreaded combo of an MAOI (moclobemide) with a stimulant (Methylone).  My normal dose of methylone is 220mg, so I figured a good starting point for experimentation with an MAOI would be 20-30mg.",
  "I was looking to potentiate required amount only (dosage).  I was hoping to turn my shrinking store of methylone into 3 or even 4 times the amount of experiences left.",
  "Quick conclusion: from what I gathered from this low-dose experience, moclobemide does appear to potentiate the methylone by a factor of at very least 2x, and likely more... but not necessarily in a linear or positive way.  Here is the 'spread' of the experience:",
  "T-1 hour: Consumed 75mg Moclobemide.",
  "At t+0 hours, I was feeling a slight mood lift and alteration of headspace from the moclobemide.  My hands were cold.",
  "I drank 28mg methylone dissolved in water over the course of 15 minutes.  At t+20 minutes, I felt slightly chilly.  Also around this time I experienced the usual body flush - a digestive track 'flush' (cleansing, welcome diarrhea).  I hopped in the bath, feeling a twinge of the usual lethargy.  Some nice tingles were present - pretty nice for 28mg.",
  "t+40 mins: I should be feeling fun effects if this were a full dose about now, but I feel barely any mood lift, only slight heart rate/BP elevation, mouth is plenty moist (it usually is DRY), and my member is decidedly NOT shrunk (it usually shrinks, common with most amphetamines).  I experience only minor feelings of deep, satisfying breathing.  This feels like perhaps 70-80mg methylone (sans MAOI), at most.",
  "T+1.5 hours: weird, I still feel like things are getting more intense.  Usually things have plateau'd by now.  This feels like a low dose, which is fine.  This is in the name of science - I wasn't planning on having a full blown fun time today.  Is this gradual increase in effects perhaps the MAOI increasing catecholamines, since they aren't being broken down as quickly?",
  "T+2.5 hours: Ahh, bummer, any sign of mood lift is gone, just feeling tired now.  Perhaps the mood lift lasted a little longer than usual, but I'm also feeling more confused/slow (mentally) than usual.  Not good for such a low dose.",
  "T+4 hours: I almost fell asleep - I feel tired, warm, in the usual methylone come-down kind of way.  However, the come-down feels like I just went through a 150-200mg experience, not a 28mg one!  I consider this a big negative, because I didn't get the euphoria, heart opening, or insight of a higher-dose experience, but the lethargy of a larger-dose experience is there...",
  "Well, it seems like the MAOI continued to make things stronger as time progressed.  However, this strength was overlayed on the usual methylone timeline!  Blah.  So it appears as if the fun, initial effects (T+0.5 to T+2 hours) probably won't be greatly potentiated by the MAOI with higher doses of methylone, but the after-effects will continue to grow in intensity.",
  "I now feel wiped out and mentally slow.  Given this finding, I believe that a larger dose of methylone with moclobemide would likely produce large, negative after-effects, including lethargy and loss of motivation.  However, I have the sense that the initial effects wouldn't be similarly potentiated.  In other words, this combination doesn't look like it's worth it, especially given the potential danger of mixing MAOIs with stimulants!",
  "I was planning on trying a 56mg dose of methylone with 75mg Moclobemide later this week, but after today's experiment, further experimentation will cease.  I guess this will be another data point for MAOI+stimulant drug = potentiation, but not in a good way, and definitely not worth it.",
  "In the name of science,",
  "MMan"
 ],
 "erowid": {
  "id": "38345",
  "citation": " MMan. \"In the Name of Science; Definitely Not Worth It: experience with Moclobemide & Methylone (ID 38345)\". Erowid.org. Nov 22, 2004. erowid.org/exp/38345",
  "substance": "Moclobemide & Methylone",
  "views": "16178"
 }
}
