{
 "title": "Long Term",
 "author": "Vegas",
 "citation": " Vegas. \"Long Term: experience with GHB (ID 64387)\". Erowid.org. Jul 13, 2007. erowid.org/exp/64387",
 "substance": "GHB",
 "bodyweight": "180 lb",
 "report": [
  "<p>I've used GHB for about three years, moderately.  I find it to be non addictive.  My doses have remained the same, without the need to increase.  Since G is a by-product of a lactone and a base conversion, (resembles a salt), one should drink plenty of liquids to keep hydrated.",
  "I quit for two months last year to test side effects and i found none, other than i missed it (but not to a point that i couldn't function without it), no withdrawals, no depression, no physical side effects (that i can tell).  Odd enough, when i first started it seemed i had developed a tolerance to it and required a bit higher doses at first.",
  "I Never, Never, Never...Ever mix with alcohol.  Effects are not linear with dose, it can creep up on me as I decide to continue doses in one sitting. I like to take 5 ml (1 gram dissolved per 5 ml) every 30-45 minutes, for an all day affair, or 15 ml before bed, after a work out.",
  "I believe G is good for me, it used to be legal and sold at nutrition stores nationwide.  It's the only thing out there that doesn't have a come down.  I metabolizes in the body and leaves no traces, it's found naturally in mammalian muscle tissue (in very small traces), and after a night on partying, a couple doses make next day feel light last night never happened...:)",
  "As with anything in life, always do your research to form your own opinion, know your limits, and understand there is a big differnce between use and abuse, you only have one body and soul for the rest of your life, it's your responsibility to care for it and moderation is key.</p>"
 ],
 "year": "2007",
 "id": "64387",
 "gender": "Male",
 "views": "10231",
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2007-07-13T07:00:00.000Z"
}
