{
 "title": "A Confrontation with the Hollow Infinite",
 "author": "Tom Dark",
 "citation": " Tom Dark. \"A Confrontation with the Hollow Infinite: experience with Mushrooms & Cannabis (ID 64413)\". Erowid.org. Jan 4, 2010. erowid.org/exp/64413",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  "DOSE:",
  "3 g",
  "oral",
  "Mushrooms",
  "(dried)",
  "",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>My sleep was interrupted today at 10:00 am, a curiously early time to be waking up on a summers day. I answered the receiver, M. on the other end, imploring me to do acid with him within the next hour. I wasn't entirely prepared, but decided that I had no obligations and no reason not to try it. As it were, acid was inaccesible. On the contrary, Psilocybin was.</p><p>I am 17 years old in case the reader is curious, and have had 3 sound experiences with psilocybin in the past. My last experience was approximately a year ago, as I have decided to limit myself to once a year. Unlike the last 3 years however, this year I would be doing more then I had ever done before, and on an empty stomach and malrested head. Thus, acting on utter whim, we drove to Vincent's house, a bloke M. works with at home depot and a hospitable drug dealer as well. We sat in his backyard, got snug under the sun, sipped some water and made chit-chat.</p><p>Vincent lay the brown dust on the table, 6 grams in total, and we lapped it up, me from my palms, M. from a bowl. A few drags of marijuana from a make-shift pipe and the sails were set in motion. Following a bid farewell, we got into our vehicle and returned to M.s pad. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] While still in the car grooving on beck, I was already feeling a euphoria pulsating within me. The pot definitely lubricated the onset of the mushrooms, and I was feeling that queer mushroom bliss. It sprouted from the depths of my gut, a buzzing that eventually annexed my entire consciousness.</p><p>When we got to the garage we promptly exchanged the car into bikes. At this point in the trip my euphoria transformed into an antisocial and lethargic mood. The weather seemed smothering and my body frail. It may have been from the insufficient sleep, but my body fell into the depths of a heavy languor. It's a surprise to me still that I could ride a bicycle as coherently as I did. M. on the other hand was rambling about something my mind did not have the energy to understand. As we rode through the static suburbia of Oakville Ontario, I felt an anxiety consume me and a desperation for our destination  Neyagawa. We rode on through a hellish smog, watching pink empty heads practice sad routines - mowing lawns, keeping life safe and dull.</p><p>My spirits had sunken into grave depression until we arrived at the forest. This would remain our setting for the time being, but a storm was encroaching on the sea of my mind. I tossed the rucksack off of my back and ran down into a bizarre opening amongst the dense brush. Mateusz persistently talked about what to do now that our destination had been reached. I picked up a shard of glass but truly felt no inclination to analyze it. Instead of feeling a curiosity towards my surroundings as is typically experienced on hallucinogenics, I soaked in a cold sea that reminded me that nothing was real, and that, being stripped of all human constructs, nothing existed, even time became mangled. I was more emptier then the darkness of space, the blankness of arctic deserts  I was the deep throbbing void. A mirror in front of a mirror, reflecting infinite.</p><p>I would have been contented to sit and just be, but M. was actively talking. Language became futile to me. My mind contorted into a thousand spiraling memories, that twisted and cocked before my eyes like a fabricated nightmare. Intertwined in my nostalgia was the recollection of dreams and the blending of realms and dimensions. Having been denuded of my person altogether meant that communication was futile and that my personality a fraud. Mateusz on the other hand was highly animated and characterized. I began to doubt his existence and shun my own naivety. I very much felt like being alone to work things out for myself, to make sense of my experience and to deliberate on fishing for novel ideas rather then ramble incoherently about moot subject matter as I was doing when trying to reply to M. on topics ranging from religion to solipsism.</p><p>It had only been a short while in the forest before I began to peak. This peak happened to be sharp enough to totally dismantle the fabric of time and space. I was now surfing through time as if in a whirlwind. The closest thing I could equate it too would be James Joyces Ulysses. My mood swings felt like see-saws, basking in the bliss of elation one moment only to then come careening down to the ground. A pain in the ass, everything else hurt me. My skin itched, my testicles hung cumbersomely in between my thighs, breathing even became a task for me. My vessel became alien to me now that I had erased my history. My fingers ran through my coarse hair and gave me the most unreal sensation. I couldn't make sense of anything, but there was ultimately no point to make sense out of anything anyways. Here was the dilemma. It was too hard existing without trying to understand things, but it was impossible to understand things and thus, everything became frustrating.</p><p>My mind kept retrieving memories of past dreams and past experiences. Suddenly, I recalled my family but I began worrying that even my family was just a set of characters from a dream. Mateusz and I soon got to our bikes once more and biked through some trails only to stop at a phantasmagorical lookout point over 8mile creek. Finally, I felt an environment conducive to my trip and I felt euphoria again. My frustration subsided. A peaceful calmness. Here I learned the essence of life for me was in laughter, Love and Music. I realized there is nothing more that I want out of life. Without one of these ingredients, life would stop making sense to me. Exploring the forest had it's merits, but instead of observing passively as the earths organic systems respired, creating music became a much more rewarding alternative. So Matt and I returned like yo-yos to his townhouse where we hastily replaced our bikes with guitars and became new gods, parring our fingers on the fret boards of our creation.</p><p>The music was the highlight of my trip, and oddly the psilocybin facilitated my musical aptitude. My fingers played the frets with pure heart and no head. I trusted myself and played instinctively. It was the most enlightening part of my trip, and perhaps my life. We then smoked a blunt mellow out and then sat dragging on M.s new hookah. I left M.'s and spent the rest of my day traipsing through the woods behind my home. I lay under the twilight, alone as I prefer it, brooding over the wild and whimsical journey of July 10th, 2007, an experience that has cauterized itself onto my life and one of the greatest learning experiences a school could never teach you.</p>",
 "year": "2007",
 "id": "64413",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-04T08:00:00.000Z",
 "views": "1795",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
