{
 "title": "I Am The Milky Way",
 "author": "TheAppleCore",
 "citation": " TheAppleCore. \"I Am The Milky Way: experience with Nitrous Oxide (ID 64414)\". Erowid.org. Oct 12, 2009. erowid.org/exp/64414",
 "substance": "Nitrous Oxide",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "2 carts.",
  "inhaled",
  "Nitrous Oxide",
  "(gas)"
 ],
 "report": "<p>Set and Setting:</p><p>A few nights ago I was pretty bored, and I was browsing the internet. After awhile, I had built up an urge to go and enjoy some nitrous oxide. I was trying to conserve my nitrous oxide cartridges for sharing with a friend during a get-together, but I figured, what the hell, I have more than enough. The trip that followed was much more interesting and profound than any other experiences I have had with this gas.</p><p>Here's a list of the points I covered when preparing for the administration of the nitrous, and when actually administering it. These were developed from having used nitrous in the past, and discovering what works for me:</p><p>1. I filled up my trusty old nitrous-balloon with the contents of two cartridges. One cartridge feels like hyperventilating. Two is where the real nitrous experience happens.</p><p>2. I shut off all the lights in my room. The only light that remained was the hallway light peeking through my bedroom doorway, which was not completely shut. On nitrous I get almost no open-eye visual distortions (other than a slight red/purple/blue tinting of my vision), so there's no point in having the lights on. Rather, I like to have the lights off so I can close my eyes and let the drug come up with what I see.</p><p>3. I lay down on my bed and propped my head up against my pillow. I have found my bed to be the most comfortable place to enjoy nitrous oxide.</p><p>4. When it came to actually inhaling the gas, I've learned that I always have the most potent trips if I administer the entire dose of nitrous oxide all at once, one lung-full after another, until I've inhaled all of the nitrous. The contents of two nitrous oxide chargers fill up my lungs completely exactly three times: exhale completely, put balloon up to mouth, inhale slowly but deeply, take balloon away from mouth, repeat two more times until balloon is emptied.</p><p>The Experience:</p><p>After the third and final breath of nitrous was exhaled, I took a good lung-full of air to replenish my body's oxygen, and soon enough I closed my eyes and completely forgot who I was and where I was. What I saw was a strange pattern covering my entire field of vision. This was almost like a wallpaper of some sort, made up of a small repeating image, of which there were hundreds, against a black backdrop. Each of these little images was tiny, and made up of about a dozen large, perfectly-square pixels, which were mostly red and orange. In my mind, this was the entirety of the universe. Reality was no more than and no less than my perception of this pattern.</p><p>As soon as I became slightly more aware of my existence, this visual faded. I opened my eyes, and I could still barely make out the pattern that overlaid my vision. I closed my eyes again, and soon something entirely different happened. There was a merging of my senses, in which my vision, hearing, and even proprioception were involved. I observed myself as a two-dimensional image of swirled colors, with curved protrusions coming out of the center of this image like the arms of a spiral galaxy. These were my arms, legs, and neck. I could hear a continually beeping noise which 'beeped' at a certain rate. Every second or so, I would see the swirly image twist and contort into a new shape, and since this image was actually my body, I felt myself moving every time this happened. I believe I actually was twisting around on my bed. Every time it happened, the rate of the beeping was increased. These contortions occurred about six or seven times until the beeping was so fast that it no longer sounded like beeping, but more like a continual flanging sound. I then opened my eyes and became fully aware of who I really was, and where I really was.</p><p>I then descended into the usual euphoric, giggly nitrous-comedown. I rolled around a bit on my bed, rubbing my tingling skin against the comforter. It felt REALLY good, and I laughed the entire way through this 30-second taste of heaven.</p><p>The whole trip was just awesome. It did not have a scary or ominous or forbidding or confusing overtone, but rather a fascinating and 'fun' overtone.</p><p>Final Notes:</p><p>Hope you enjoyed the read, and maybe even learned a little bit from my list of preparation points! Peace.</p>",
 "year": "2007",
 "id": "64414",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-10-12T07:00:00.000Z",
 "views": "12285",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 carts.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 }
}
