{
 "id": 6442,
 "title": "An Intense but Fabulous Trip",
 "date": {
  "submission": "2005-08-04T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Prospero",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25",
    "grams": 0.025
   },
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "This was my highest dose so far of this delightful chemical, and very interesting. As is usual for me I had a whole day clear for the experience, with an easy day following to cope with any after effects. I was alone in my flat, with no worries about anybody intruding, and generally in a positive state of mind.",
  "Previously I had taken this substance at the 15 mg level, which I found mild and pleasant, but not particularly interesting. As a veteran of many powerful drug trips I was happy to boost the dose substantially.",
  "As is usual for me I had quite a lot of anxiety as I prepared the dose, which I now always get after an extremely unpleasant 5-MeO-DMT experience a few years ago. Funnily enough the anxiety goes as soon as Ive taken the drug and am committed to the trip. Throughout the trip I played a pre-recorded tape of Progressive Trance, a musical style which for me always brings out the best in psychedelic drugs.",
  "Anyway the experience went well and I would say the chemical is extremely comparable to 4-Acetoxy-DET, though slightly more friendly and slightly less intense. Definitely in the same style as Psilocybin, it had a rapid onset (fast climb from fifteen minutes, peaking at one hour), a two hour plateau, and then four hours of steady decline. The open eye visuals were good and distinctly tryptamine like, the closed eye visuals started like LSD and then shifted to more like 4-Acetoxy-DET. It had the (for me) bizarre property, like 4-Acetoxy-DET, of when I listened to music that the closed eye visuals took over my senses, so that what I heard merged with what I saw merged with what I felt (physically), so that I actually became one with the music. At one point I could feel my body dissolving into many multicoloured abstract shapes, and then breaking up and flowing off the bed and onto the floor like a stream of water!",
  "I started to explore the spiritual side, and though I didnt have any intense revelations, got the very clear but simple message that my life was my own to do exactly what I wanted with, and as long as I followed my conscience and didnt hurt other people God was with me and nothing could ever go wrong. My ultimate immortality was also in no doubt. Nice, and very re-assuring.",
  "I then felt extremely randy and in the absence of anyone else had to relieve myself (sorry for being crude). What followed was quite simply the best orgasm I have ever experienced, either alone or with anyone else. At the peak my body completely dissolved into a cascade of colour and light, of such speed and intensity I could barely take it in. I felt like a droplet of water must feel going over Niagara Falls - absolutely amazing. Ive done this on other drugs before but 4-Acetoxy-DiPT is definitely the best!",
  "It all did eventually get quite exhausting and I finished the trip watching TV and finding humour in what I know are the most boring and tedious afternoon television programs.",
  "Overall a great trip and a chemical to be treasured."
 ],
 "erowid": {
  "id": "38362",
  "citation": " Prospero. \"An Intense but Fabulous Trip: experience with 4-Acetoxy-DiPT (ID 38362)\". Erowid.org. Aug 4, 2005. erowid.org/exp/38362",
  "substance": "4-Acetoxy-DiPT",
  "views": "10607"
 }
}
