{
 "title": "Lucky To Be Here",
 "author": "Inconsiderate",
 "citation": " Inconsiderate. \"Lucky To Be Here: experience with Methamphetamine (ID 6443)\". Erowid.org. Feb 27, 2002. erowid.org/exp/6443",
 "substance": "Methamphetamine",
 "bodyweight": "135 lb",
 "report": [
  "<p>For any of you who believe crank is such a wonderful thing, please read my story. I too thought it was pretty cool until.......",
  "It seemed as though it was one of the best nights of my life. I was tweeking really hard having so much fun with my friends. Then morning came and everyone was leaving and I was left home alone. By this time I wasn't feeling all that well, I felt lethargic. I couldn't do anything, just lay there. Finally, I thought I would get up and do something and maybe I would get everything out of my system. I couldn't have been more wrong. It became harder and harder to breathe, I began praying to God 'Please don't let me die!' I have two small children, all I could think was that they weren't going to have their mommy anymore. I knew how much I would miss them and how much they would miss me. I was too scared to call for help, and I thought I was just tweeking too hard and that this all was my imagination. It wasn't it was too real, which became aparent when I realized my legs were turning purple. Gasping for air I thought my heart was no longer beating so I began to beat on my chest until I felt my heart beating again. I went through this routine for quite some time.",
  "Finally, my brother came to my house. Gasping for air, I told him I was going to die and to tell everyone I love them. He then called 911 and an ambulance arrived in what seemed like an hour. The first thing I said to them was 'I need oxygen,now.' I believe that the last breath I got before the ambulance arrived was my last breath. The parametics got me to the ambulance and on the way to the hospital they asked what had happened, I was honest with them, I needed their help. Though it was nice getting some air I still felt I wasn't getting enough. At this point, I told the parametics I felt like I could pass out, that must of been a bad sign because they sped up. When I finally made it to the hospital, they made me take potassium pills and also put me on potassium and saline I.V.'s. I remember looking at the heart monitor and my pulse was 180, over double what it should be. They had to take x-rays to see if and how much my heart was damaged, they also did several EKG'S.",
  "I was first told that at anytime my heart could go into abnormal palpitations and I would just die and I wouldn't be able to be saved. I was in the hospital for 3 long days. I went in on Christmas Eve night and didn't get out until the day after Christmas. My children came to visit me in the hospital on Christmas Day, but it was a bad Christmas for all of us. I wasn't suppose to be getting upset because it made my heart rate increase, but my daughter began to cry and I felt like the worst parent ever. So, needless to say, they didn't get to stay long. Finally the doctor decided I was stable enough to go home but first, one last EKG, which was good news my heart palpitations were normal and my heart was not damaged. Very good news, I got to go home. I later found out how serious my condition was, the doctor told my parents that I had one foot in the grave when I got there and that I am very lucky to be alive.",
  "It's almost been 4 months since my incident and I haven't yet recovered, I am still suffering for my mistake. I now have severe anxiety which disrupts my whole life, anxiety attacks quite frequently, and a constant uneasiness, thoughts that I can't breathe or that my heart is not beating normally. If you honestly think that this won't happen to you, you may be  sadly mistaken. I don't care how 'careful' you are, it can still happen to you. I have learned alot of things through all of this, but the main thing is that my life, is more important to me than that shit is and I'm not willing to leave this world, my family for something so stupid.</p>"
 ],
 "year": "2000",
 "id": "6443",
 "gender": "Female",
 "views": "28994",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Methamphetamine"
  }
 ],
 "submissionDate": "2002-02-27T08:00:00.000Z"
}
