{
 "id": 6444,
 "title": "Pleasurable Mellow Bliss",
 "date": {
  "submission": "2005-02-16T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Antisyzygy",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "tea"
  }
 ],
 "report": [
  "I decided to experiment with legal herbal drugs fairly recently.  After much research I found several herbs which seemed to have real effects that are not just minor or placebo feelings.  The one which I enjoyed the most happened to be Kratom.",
  "I decided to buy a type of 'super kratom' powder which is supposed to have 300 mg of the active chemical per 25 grams of leaf.  This concentration is signifigantly higher than the standard leaf according to my research.  I attempted taking this powder by several methods in incremental doses.  I started off with just a pinch in water, which was approximatly 1-2 grams and felt nothing noticable.  The next attempt I used about 1.5 times as much and placed it in peanut butter.  From this I only felt a minor euphoria, however at the time I attributed it to placebo effect.  The most recent time I attempted to take kratom I used about 3 grams in a tea format with the leaf material still in the liquid.  I followed this dose with a similar sized dose in the same method.",
  "The experience I recieved from taking two doses of 3 grams in tea was very pleasurable.  It tasted similar to green tea, which is probably due to the fact that it takes less super kratom than standard leaf for the same effects.  The tea numbed my tongue and throat very slightly, furthermore, my senses numbed, as did my toes.  I felt moderate euphoria and relaxation, as well as a lack of stress.  Furthermore, I felt absolutely no nausea or dizziness, nor any of the itchyness associated with this herb.",
  "I am unsure of the reason why I felt a lack of nausea and itchyness.  Either the consumption of relatively small amount of powder needed to get noticable effects also means consuming less of a particular toxin, or my own biochemistry is efficient at removing or unresponsive to said toxin. My father and I are very resiliant to sickness and effects of narcotics (my father needed twice the anaesthesia for his body weight when he had a recent surgery).  The aforementioned condition probably has something to do with the fact that I reacted so well to the kratom.",
  "I plan on using kratom regularly due to the utter calm it infused within me.  It would be very good to take after a hard day or in small doses to relax me before a long college assignment.  If experimenting, do not start off with very much, i.e. work your way up.  Though my experience may have been very good, my biochemistry and methods probably contributed to this.  Since all readers will not use the same methods nor have the same biochemistry, the reader cannot assume that they will have a similar experience."
 ],
 "erowid": {
  "id": "38368",
  "citation": " Antisyzygy. \"Pleasurable Mellow Bliss: experience with Kratom ('Super Kratom') (ID 38368)\". Erowid.org. Feb 16, 2005. erowid.org/exp/38368",
  "substance": "Kratom ('Super Kratom')",
  "views": "13171"
 }
}
