{
 "title": "Who Knew?",
 "author": "Mog (Toke)",
 "citation": " Mog (Toke). \"Who Knew?: experience with Cannabis (ID 645)\". Erowid.org. Sep 10, 2000. erowid.org/exp/645",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "report": "<p>This incredible occurence of mine occurred around the middle of the first year I began smoking weed.  I was still relatively new to the experience and had only gotten legitimately blazed one time before.  I decided to drop by my friend's house to get just a little high.  Of course, I brought along a little of my own weed, it's just courtesy, but I also knew he had his own little stash, I just didn't know he was growing in his closet!  Well, we rolled most of mine into blunts, and spent 1/2 an hour on them.  As I mentioned, I was relativly new to the experience and everything was new to me.  He put on some Bob Marley and dimmed the lights, I leaned my head back on the couch and closed my eyes, It felt almost as if I was on a roller coaster, but it was moving along with the speed of the song.  My feet felt as if they didn't touch the ground and I sat there for what seemed like hours.</p><p>My friend woke me from my dream-like state and said something along the lines of, 'You gonna hit it man?' I opened my eyes and he presented me with a blue tinted glass bong and a well packed bowl.  It seems I was only sitting there for several minutes while he packed a bowl into this instrument that was thoroughly foreign to me.  Well, I said he could hit it again, to give me a second because I didn't even know how to use it.  I stared as he hit the bong and the smoke traveled up the odd contraption.  I thought I had it down, and so I decided to brave a hit.  I hit it and kept waiting for my throat to burn as a sigal to slow down, but even as I cleared the carb it was a beautiful flow that felt almost as clean as Oxygen as it passed into my throat.  'Hey guy, slow down on that,' I heard from somewhere around me, I passed it to my friend, I couldn't understand what he said after that.  I listened to the beat of the music and leaned back again.  I returned almost instantly to the roller coaster-type-world and that levitation feeling returned in my feet and eventually captivated my entire body.  'Holy Christ,' I muttered aloud, unaware I was talking, the sound of my own voice was amazing to me and I began mumbling.  I forgot that my friend was even in the room with me.</p><p>'Guy, take another hit on this, then I'll pack again,' He said.  I took hold of the bong and exhaled all of the air in my lungs, then I flicked the lighter and intook all the smoke I could.  I coughed suddenly, and my throat began to burn, one after another the coughs exploded from inside the inner-most core of my body.  I began to lose track of everything around me and my world span.  The roller-coaster world was now surrounding me, and I could feel evey move of it in conjunction with the real world.  It stopped suddenly, and I realized it had only lasted a few seconds, I felt amazing, like I could do anything.  He said I could clear it, so with pleasure I did just that.  I got the cool air feeling again, and wondered what went wrong last time.  To this day I still do not know.</p><p>I passed the bong and gazed at the curling smoke,  I looked beyond it, to a world where everything was made of the smoke and I was part of it, I was floating with it, and then he passed it to me again.  This went on for what seemed like all night but in reality was only about an hour and a half.   When he was fresh out of bud, I do not know, I just know that eventually the bong stopped coming to me and I fell into this amazing trance where it seemed as though the music was a part of me and it was swirling around me and I could have never felt better in my whole life.  From there the effects gradually decreased, my rollercoaster stopped and I eventually returned to my normal state of consciousness.  To this day I doubt I've ever reached a high so full as that, and I can hardly wait till the day it is upon me again.</p>",
 "year": "2000",
 "id": "645",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-09-10T07:00:00.000Z",
 "views": "6395",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
