{
 "id": 6458,
 "title": "Red Dots and a Straw",
 "date": {
  "submission": "2001-12-26T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "BeastieDR",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1200",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Kava",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Well, I had heard about kava some time ago, probably around June of 1999.  My friend and I had discussed it, but never came around to using it. ",
  "One night about a month ago, we were out, and decided to pick up a bottle of the pills, since I had already decided I was going to crash at his house that night.  We got home at around 1:00 AM, and went down to the basement.  I took 3 400 Mg pills, brand name of which I do not recall.  We each chased with a can of Diet Pepsi, since ice water was out of the question: the ice at his house always tastes quite putrid.  Admittedly, the caffeine may have countered some of my effects.  My friend took 7 pills, with 3 at first, 1 30 minutes later, and 2 more after another thirty minutes...quite a bit more adventureous than I would be with a first-time drug.",
  "Turns out that we both regretted our decisions.  After 45 minutes, I started to become nauseous, yet relaxed...we switched off the lights, and he proceeded to take more pills despite my symptoms.  He became very ill within the next half hour or so, with nausea as well.  We both laid there waiting to drift to sleep in a less-painful moment.",
  "It was around this time that I experienced two mild hallucinations, an effect that I was unaware could occur with use of kava.  The first happened when I was staring at a wall, we were in complete darkness.  I saw a red light on the wall, simply a small dot.  I asked my friend what is was, but, he did not see it.  The dot made a spiral pattern, and moved towards me, then disappearing.  The second happened when I closed my eyes: I imagined a fish tank with a straw in it, and the straw was between my lips...very vivid, I felt water drip from the straw.",
  "My friend did not hallucinate, but, he did feel very sick.  We do intend to try it again, but using tea, as we have heard it works better."
 ],
 "erowid": {
  "id": "3843",
  "citation": " BeastieDR. \"Red Dots and a Straw: experience with Kava Kava (ID 3843)\". Erowid.org. Dec 26, 2001. erowid.org/exp/3843",
  "substance": "Kava Kava",
  "views": "12621"
 }
}
