{
 "id": 6459,
 "title": "Confused Zombie",
 "date": {
  "submission": "2010-07-11T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Airow",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "200",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Topiramate",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "My friend had told me about this new really good painkiller called Topamax, and being the conservative person that I am I tried to abtain all of the information about the drug that I could because I don't like to take prescription drugs that I don't know what they are or what they are for. So I looked it up and found a couple reports that said it was a painkiller, antiepileptic, some that said it is for manic-depressive people but all the reports I read said they didn't know how it worked and that it had many other uses however I was never able to find anything on what the high or the trip was like. So I wanted to post this so that anyone that is thinking about taking it can realize how horrible this is.",
  "I was told it lasted for several hours and that you felt really, really good on it. I am someone that usually does oxycontin, lortab, and percocet so I thought that it was going to be a similar high. I waited till the next morning to take it, I always enjoy taking painkillers early to start my day so I took it at about noon. I sucked the coating off and swallowed the 200 milligram pill.",
  "After taking it I drove straight to the mall [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] and right about then it kicked in, I could tell because my mind was racing faster then usual. I couldn't even keep up with it. It almost felt as though my mind was overwhelming my body.",
  "Next, came a state of confusion that was unlike any I have ever experienced in my entire life. There's the type of confusion that I get when I am really stoned and playing a video game, then there's the confusion that I get on topamax where I can't figure out which it is that makes the car accelerate, the cluth or gas pedal. The entire time that I was on this pill I felt really, really depressed.",
  "So then after that, I had to drive home. Its almost like while I was on it and driving I forgot everything that I have learned and I had to re-learn it before I got into an accident because I am so confused and stupid. So I got home and I thought that I could sleep it off, falling asleep was easy because it caused drowsiness by then. My girlfriend came in and woke me up about three hours later and the mind-racing had gone away but by now the confusion had totally taken over my mind. Imagine your short term memory just stops and you cant even get through one sentance AND YOU ARE TRYING TO ACT SOBER IN FRONT OF YOUR PARENTS.  ",
  "***heres an example***",
  "My dad had asked me where my brother bought my car from and the sentance I had to tell him was this 'His tenant was going to sell it to the junk yard for 100 dollars so my brother just offered them a hundred dollars for the car.' But it came out like this",
  "'His uh......his renters.......they uh........were gonna..uh....... gonna sell it.....uh and.....uh.....and.....uh.......' and he had to finish my sentances for me.",
  "I literally felt like the smart and articulate part of my life had died and I was some type of zombie that couldn't do anything because it all caused way too much confusion. This state of confusion lasted for about three days."
 ],
 "erowid": {
  "id": "38432",
  "citation": " Airow. \"Confused Zombie: experience with Topiramate (Topamax) (ID 38432)\". Erowid.org. Jul 11, 2010. erowid.org/exp/38432",
  "substance": "Topiramate (Topamax)",
  "views": "11193"
 }
}
