{
 "title": "Unlike Other Dancing Experiences",
 "author": "jazzmatthew",
 "citation": " jazzmatthew. \"Unlike Other Dancing Experiences: experience with LSD (ID 6461)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6461",
 "substance": "LSD",
 "bodyweight": "225 lb",
 "report": "<p>I am a college student who had dabbled with mushrooms and ecstasy and a few other things (ether, special k, of course weed), but I was quite nervous about taking LSD, due to what I had heard about the drug in the past.  I feared permanent insanity, flashbacks, and doing something drastic and fatal, such as jumping out of a window.</p><p>Finally, I decided that I would try acid.  I was visiting friends in New York (I live in California) who have tripped many times, and they asssuaged my fears enough to where I felt reasonably comfortable.  We dropped two hits each in the car on the way back from LaGuardia airport on our way to a rave in the South Bronx.  The acid was on pez candies.</p><p>I felt the threshold effects while we were still in the car, and it reminded me of mushrooms, the sort of anxious, uneasy feeling you get before the drug peaks.  Finally, after driving around for awhile, we arrived at the rave.  It was at a rundown old rollerskating rink in the Bronx, and it wasn't too crowded.  My only previous experience with a rave was a massive out in Southern California, and this was nothing like it.</p><p>When the drug peaked I was dancing alone in the middle of the rink, and things became very fuzzy and just odd.  Unlike mushrooms, which rendered me grinning like an idiot and really unable to function normally, acid seemed somewhat more controlled, and I felt that I could act normally if I needed to.  Of course, I didn't need to at all, and I was able to relax and enjoy the trip.   I never felt more connected to music before, and I felt that I could predict the direction of the music and that somehow I knew each note before it was played. </p><p>I'm not much of a dancer, you won't see me signing up for swing dancing lessons any time soon.  But I danced for hours on acid, feeling completely free from self-consciousness and worry.  Unlike other dancing experiences, such as nightclubs, I didn't feel the need to hit on the cute girls or the rush  of testosterone.  I felt in the mood for thinking, which I did in copious amounts.  I thought about everything I could, and I came to a feeling of peace with the world, not concerned with various inadequacies.</p><p>I didn't have too many hallucinations, though I did see very interesting patterns and sometimes things normally clear were blurry.</p><p>Near dawn (we dropped at around midnight) I started coming back to normal.  Unlike unpleasant side-effects of shrooms and e, I felt content with my acid trip and didn't feel down about being sober again.  Of course, I doubt I was sober....I sat for several hours unable to go to sleep, unable to read, but with a great new experience to think and talk about.</p><p>I know a lot of people who do ecstasy routinely but refuse to try acid for the same reasons I was nervous.  They believe in myths such as doing it a certain number of times (like 8) will make you legally insane.  I don't see myself as a prophet, I'm not Ken Kesey or Timothy Leary or Grace Slick or anyone, but all things considered, acid is the best drug experience i've ever had.  If you're careful, reasonably secure with yourself, and safe with your setting and people, you could have a really mind-blowing experience.</p>",
 "year": "2001",
 "id": "6461",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-28T08:00:00.000Z",
 "views": "14009",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD"
  }
 }
}
