{
 "id": 6462,
 "title": "Good but Overrated",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Psychadelic",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Here's a little information about myself, I am currently 17, a pretty good student, I take all AP classes and almost all are A's. I have plenty of friends and am not depressed or anything.  I used to be one of those people who though drugs are bad, but my friends convinced me to try some pot once, and I realized that drugs are not bad, that they can be spiritually enlightening and can bring people very close together.  Since that time I have smoked almost every weekend with a group of buddies, and I enjoyed being stoned with them.  I have also tried ether a few times.  However I recently decided to experiment with something else and decided cocaine is as good as anything. So here goes.",
  "Today is thanksgiving, and two days ago when I wanted to try something new I decided a four day weekend from school would be a perfect time, so I asked a girl I knew if she could hook me up with a half gram of coke.  She said the guy she knows only sells by the gram or more so I gave her $50 and she told me she'd get me the gram.  Next day, I was partying with her and a couple of friends when she decided to go get the coke.  She gave it to me, and I went home after a pleasant evening of drinking and smoking pot.  The day after that (today, Thanksgiving) all my friends were with their families so there wasn't much to do, because my parents are the only ones here with me. ",
  "So while waiting for dinner, I took out the gram and decided, why the hell not.  I poured out a very small bit maybe about 50 mg, crushed it up with a credit card, formed a line and snorted it with an empty pen.  Very little happened, so I kept crushing up and doing small lines until after a few I felt sort of energetic, but still nothing extremely pronounced.  So I took a 3 minute break, and took it up again.  I kept snorting lines but nothing was happening.  At this moment I checked on the internet that the minimum lethal dose is usually 1.2 grams but that in very sensitive people OD has occurred with as low as 30 mg.  But I am not very sensitive to drugs, I am about 5'9' to 5'10' and 160 lbs, so I figured I'll do the whole gram. ",
  "So twenty minutes after the first line, the gram was gone, and still not much besides a totally numb jaw and nose.  Some people maybe thinking I got myself some shitty coke, but my friend who hooked me up with it, and was formerly a coke user, sampled it and said it was very good stuff.  So about 2 minutes after I finish the last line I realize I felt extremely energetic and pretty good.  I basically just left the house and spent the time walking around feeling good.  I also called a few people.   ",
  "Now, don't get me wrong, cocaine is pretty nice stuff, but I find it extremely overrated.  From what I've heard 3-4 lines and some people will feel this magical 'Whoomph' and they're in heaven, feeling pure pleasure and energy.  This did not quite happen, rather more gradually I began to feel good.  I felt physical pleasure and confidence, but I did not experience the famous (or infamous) rush that people talk about.  I did have a lot of energy, and the people I talked to on the phone told me I was talking very fast, but again I wasn't bouncing off the walls like I had expected to. ",
  "Maybe I just need a lot more coke than other people.  Maybe I have naturally high tolerance or something or maybe 20 minutes is too long of a time to do a gram, but the last 300 mg or so I did in about 30 seconds, so I really don't know.",
  "I did feel a small rush, but personally I have had stronger rushes on pot.  Also the peak effects as mild as they were lasted only about 20-30 minutes, but after that I could still feel them, just not as strong.  Also on the walk home, I began to have some interesting visual effects.  Everything seemed really sharp and focused, and while I was walking it seemed like one of the houses in front of me was moving forward with me for a few seconds, but that's about it.  At home I put on some Pink Floyd, and stared at the visual patterns on Windows Media Player, which was nice, but again, I've experience even nicer on pot.  It's been three hours since I snorted and I still feel it a little bit. Although it's pretty much over, I have not yet experienced any of the crash symptoms that people talk about like headache, nausea, depression, or anything.",
  "So like I said, I find both the good and the bad about cocaine extremely overrated.  It's not that addictive, if I never have coke again, it won't be a big deal, but I want to experience that intensity I have heard about."
 ],
 "erowid": {
  "id": "38449",
  "citation": " Psychadelic. \"Good but Overrated: experience with Cocaine (ID 38449)\". Erowid.org. Jun 25, 2007. erowid.org/exp/38449",
  "substance": "Cocaine",
  "views": "4167"
 }
}
