{
 "id": 6466,
 "title": "A Trip To the Mall",
 "date": {
  "submission": "2008-02-25T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "LoveDrugs",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>I arrived at the mall with S at about 4pm. I grabbed a coca-cola from a vending machine and walked to a deserted part of the hall that was like an emergency exit no one goes out. I pulled out the bag of mushrooms I had got the day before and started in just eating the dried fungus washing it down with some soda. S wasn't interested but didn't object to me eating them, just got kind of nervous when I ate the whole bag, I reassured him that it wasn't a lethal dose, a higher dose but reminded him of the many drugs I've done before and how I'd researched and got the facts before, he smiled and told me to enjoy my flight, I promised him I would.",
  "T+0:15 - no effects yet, just wandering the mall looking for something to do, checking out the usual stores for anything new. Felt a little bit nausous but sat down for a few minutes and it passed.",
  "T+0:30 - effects noticed just in the past few minutes, no visual or auditory hallucinations, just things seem different, they are somehow changed and it is much noticable.",
  "T+0:45 - sounds are different very much so now, small sounds I would never notice seem to jump out at me. This mall has a billion lights, neon lights, and all different kinds all around, I had known this ahead of time and knew I'd love it. I had no real visuals yet except that the lights had that aura kinda thing everyone talks about, its like a colorful light surrounding it, sort of like if you squint your eyes but more colorful.",
  "T+1:00 - The auditory effects are getting better-stronger, All the voices in the mall seem to be in my head instead of where the people are, hard to explain. The visuals have picked up a lot too. We stopped in the hall for S to look at something in a store window for a few seconds, and when I went to tie my shoe I noticed that the floor in front of me had a ripple in it like dropping something in still water, but the ripples moved much slower, when I stood up it was normal once again.",
  "T+1:30 - Auditory is very hard to explain but hasn't changed much since last time, no actual hallucinations like hearing things that aren't there, just the sounds that I do hear are very much changed. Visuals are really getting amazing now. Me and S went to eat something at burger king, he got this bright green florescent soda from somewhere else, and I didn't want him to drink it for the sake of me looking at it, I got my own after he drank it to carry around. It glowed the brightest green I've ever seen and probably ever will see(since then I've got another and noticed it was not very bright at all, just very lime green).",
  "T+2:00 - Amazing visuals especially with all the lights and people moving. I had gotten advice not to come here when I told S I was going to come here and do shrooms but I'm so glad I did it's amazing. We went back to the record store and I bought a new cd so I could listen to it in my discman, music is a great thing in combination with mushrooms, at least in my opinion. I've been talking up a storm with S for about 15 minutes now, I was talking before then, but I've gotten quite emotional now. We started having a conversation about life and what we are going to do after high school and such.",
  "T+3:00 - About this time I'm thinking to myself, 'This has to be the peak, it can't get any better then this can it?' Visuals are out of control, every color is more colorful, every light is brighter with an aura of colors. We then go outside and a car drives past and leaves a trail, another goes the other direction and leaves another trail of cars and my jaw hit the floor and then I started cracking up. I felt in control of it all though, and I noticed I was in fact somewhat in control of things. It was now a little after 7pm and as dark as the ny area can be any given night, I looked up at the stars in awe. The color aura on each one had a given color, a single color and they were constantly changing, but in a pattern I noticed. And then I thought well I don't like that pattern and looked at S to get his attention up, the pattern changed, and then changed again and again. We noticed it might look suspicious two teenage guys standing in the parking lot staring at the sky in awe, we went back insde, it was somewhat cold out tonight. Me and S were having one conversation after another, he didn't seem to mind, he's the kind of guy I can talk about really deep stuff with and we have a lot in common so it was great.",
  "T+4:00 - All the effects from an hour ago might have gone down a tiny bit if any, we went to a computer store and I got sucked in, playing on the computer was fun as anything ever, looking at the digital art my favorite artists had online.",
  "T+5:00 - Auditory effects are definitely starting to go away a lot, visuals are going too. I'm getting somewhat depressed the effects are going, and we are walking to S's truck now to go home. It's 9pm now and the stores are closing soon anyway. The ride home was fun, I was staring at the headlights of the oncoming traffic the whole time, we listened to my favorite band on the way home, one of S's top 10 but not his favorite he seemed to have enjoyed himself about as much as me even without any drugs.",
  "T+5:45 - S just dropped me off at my house and it's 9:50pm. The effects are now greatly depleted. Visuals are not noticable except a little bit of an aura still around the lights, might be just cause I'm very tired tonight. Auditory effects are completely gone for all I can tell. I think there still is some effect on my mood though, I am still quite emotional. I sat at my computer on the internet for awhile before going to bed.",
  "T+7:00 - All the effects are now gone and I'm going to bed, it was a very enjoyable experience which I would definitely not mind repeating it. I'm glad I didn't listen to any of my non-drug-using friends and take a smaller dose, or stay home from the mall. I then got in bed and fell asleep listening to my new cd. I had a more trippy dream that night then I usually do, but it was somewhat depressing when I think back on that dream. I'm not sure if the mushrooms actually contributed any to my dream or if it was a placebo effect where I thought they would, so subconsciously I wanted the dream to be trippy and psychedelic.",
  "The next day I felt no after effects, just felt like a normal day. Actually felt somewhat boring and plain, but just because I was comparing it to the day before.</p>"
 ],
 "erowid": {
  "id": "38471",
  "citation": " LoveDrugs. \"A Trip To the Mall: experience with Mushrooms (ID 38471)\". Erowid.org. Feb 25, 2008. erowid.org/exp/38471",
  "substance": "Mushrooms",
  "views": "2875"
 }
}
