{
 "id": 6468,
 "title": "Back To The Future",
 "date": {
  "submission": "2006-12-19T08:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Front To Confront",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "120",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Dihydrocodeine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Opioids"
  }
 ],
 "report": [
  "[Dihydrocodeine Bitartrate 120 mg Sustained Release Tablet.  Nicomorphine Tartrate 10 mg Tablet.  Nicocodeine HCl 10 mg/ml Sublin -- 20 to 100 morphine units (120 to 600 mg Dihydrocodeine Bitartrate equivalent) per 24 hours in 2-6 divided doses]",
  "It seemed like everything wrong was fixed with a magic wand!  No more Tylenol No. 3 -- the 120 mg dihydrocodeine tablets available in my new home country were a miracle for my chronic pain, and I soon learned to chew conservative doses of them or take immediate-release preparations like Paracodin to deal with serious jags of breakthrough pain.  It was also very euphorigenic and made me feel full of love for everyone and agreeable in the extreme.  It also relaxes me enough to be able to speak some of the languages I am newer to better, with results alluded to below.",
  "The doctor and chemist sometimes also rotated me onto the big three rare narcotics, which are never seen in the USA except as an intermediate in making DHC for Synalgos DC or cough syrup -- namely dihydromorphine (Paramorfan, Paramorphan) Nicomorphine (Vilan) and Nicocodeine (Tusscodin)  They never made it to the USA because they were invented and used in imperial Germany and the Austro-Hungarian Empire before 1914, which saw both the USA's Harrison Narcotic Act and the beginning of the war in which the USA would later take the wrong side against Austria-Hungary...but back to the drugs:",
  "DHC, Vilan, and the specially-compounded DHM-Scopolamine-DXM capsules also were powerful euphoriants.  Contrary to conventional wisdom, positive emotions from external loci of control were not dulled.  It felt great to feel great with my bones and Irritable Bowel Syndrome banished apparently for good, and to know people wanted it that way -- the package insert says in giant letters that every human has the right to freedom from pain, quoting the 1995 WHO report and contradicting pain clinic workbooks I was given years past in the USA. ",
  "Banquets, political meetings, other social functions were just wonderful.  The most significant event of the time period was the DHC, nicomorphine and events combined to build the highest peaks of well-being I have ever known, which was on one or more of several occasions.  When I finished making a speech, the woman running the event came to say hello and compliment me on the presentation and after a more formal greeting, I could feel her move closer like the warmth from a dose of dihydromorphine hitting my chest after being IVed so I took her in my arms and we actually cuddled for several minutes whispering in one another's ears -- no Ectsasy and/or alcohol caused that!  I go to the theatre with several of the ladies from the neighbourhood and one in particular, a French lady from around the corner who has always been a favourite of mine because she feels the same way and was never shy about it. The very pinnacle of well-being and euphoria would have been the occasions when we walked through the squares and down by the river with her clinging to me like a cat and resting her head on my shoulder... as the winter of DHC turned into the Nicomorphine spring, everything just accelerated...better living through chemistry!",
  "and now they are about to switch me to morphine and/or hydromorphone :)"
 ],
 "erowid": {
  "id": "38474",
  "citation": " Front To Confront. \"Back To The Future: experience with Opioids (Dihydrocodeine, Nicomorphine & Nicocodeine) (ID 38474)\". Erowid.org. Dec 19, 2006. erowid.org/exp/38474",
  "substance": "Opioids (Dihydrocodeine, Nicomorphine & Nicocodeine)",
  "views": "15364"
 }
}
