{
 "id": 6471,
 "title": "Two Days after Overdose, Heart Rate Still Fast",
 "date": {
  "submission": "2005-01-03T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Andrew",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "1000 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:30",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I had always heard that Wellbutrin was not a fun trip, but still decided to give it a try myself.  So at about 6pm I ingested 5 200mg pills.  After about 30 minutes, I started to feel light, a quite comfortable feeling, so I figured 2 more would kick it in.",
  "An hour after ingesting my 6th and 7th Wellbutrin, I started to tremble uncontrollably, and my heart rate quickened.  Out of nowhere I became overwhelmingly paranoid, anxious, and all I could do was lay in bed and tremble. ",
  "As time passed, hallucinations started, which would have seemed pretty cool aside from the fact that I was extremely paranoid and nervous.  And once again my heart quickened.  I tried to ignore it and go to sleep, but when I'd roll over and close my eyes, I would hear something scratching on my bed... this and the feeling that my heart was going to jump out of my chest kept me up.",
  "2:00 am - By this point.. I was walking around, nearly in tears, because I was almost certain I was going to die that night... I could see my heart beating through my chest, it has never been this bad before, even after running or weightlifting.  I went back and forth for 2 hours wondering if it was worth waking up the parental units and telling them I had an overdose and needed to go to the hospital. ",
  "4:00am - At this time, I was so unbelievably scared for my life, that I knew I had to go tell them. So I woke them up.. tried my best to stay calm while explaining to my mother what I had taken and how many.  So we got into the car, and she rushed me to the nearest Emergency room, and upon getting there, my blood pressure was 186 over 95, and my resting pulse was over 150... and for a 16 year old, 140lb, mediocre conditioned male, that is not good at all.",
  "They took me to a hospital bed, and that's where I spent the next 4 hours or so.  I spent that entire morning laying in a hospital bed, connected to an IV and having doctors injecting me with medicine to try and slow my heart down... They said they were going to release my when my pulse went down below 110, but I was released with a pulse of 125-130, which frightened my mother.  I spent the rest of that day laying down, drinking alot of water, and pissing alot to get that stuff out of my system. ",
  "Here I am now, 2 days after my overdose, and my heart rate is still a little fast, and blood pressure still a little high.  This was without doubt the scariest ordeal of my life, I was almost certain I was going to die.",
  "For anyone who is considering using this drug recreationally, I STRONGLY recommend that they do NOT.  Bupropion provides a horrendous trip, filled with frightening hallucinations and tremors/nervousness one does NOT want to experience... and it is quite easy to overdose...  The doctors said I got lucky... don't make the same mistake I did."
 ],
 "erowid": {
  "id": "38483",
  "citation": " Andrew. \"Two Days after Overdose, Heart Rate Still Fast: experience with Bupropion (Wellbutrin) (ID 38483)\". Erowid.org. Jan 3, 2005. erowid.org/exp/38483",
  "substance": "Bupropion (Wellbutrin)",
  "views": "41153"
 }
}
