{
 "title": "My God Man!",
 "author": "PurpleNeptune",
 "citation": " PurpleNeptune. \"My God Man!: experience with HBW (ID 64721)\". Erowid.org. Mar 21, 2010. erowid.org/exp/64721",
 "substance": "HBW",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "15 seeds",
   "oral",
   "H.B. Woodrose",
   "(dried)"
  ]
 ],
 "report": "<p>7:30pm - I got these seeds with a bit of skepticism. I've done LSD before, the most being 2 hits at one time, so I though 15 seeds might give me that 2 hit experience. I crushed them up, and downed them with a glass of water. No Problem. I did this on an empty stomach.  I started feeling some nausea about 20 minutes later, not so bad, it only lasted about an hour.</p><p>9:00pm - I started feeling some effects, I started to wonder if this might just be a placebo effect. as more time would pass I would believe that if this was a placebo effect, it was one hell of a placebo effect.</p><p>10:00pm - I believe I started to peak around this time, it's a bit sketchy. Watching TV, faced started to have that mutating effect. Colors were definitly more intense. My thoughts began to transend far what I expected. This is were one would begin to realize that they were connected to the spirit world. It became an eye opening experience, especially for my personal life.</p><p>11:30pm - So it was around this time I decided to take this experience to a whole nother level. I smoked a bowl... This brought a whole new mind alteration. A happy, giggly sort of alteration. It also eased my mind somewhat, not that I was having a bad trip, but maybe borderline.</p><p>12:30am - I decided to watch the Beastie Boys 'Awesome, I Fuckin' Shot That!' This seemed to last for hours. It was a whole new experience.</p><p>3:30am - after about this time I'm not sure how long the experience lasted because I went to sleep. But I can assure you that these seeds are no joke.</p><p>Next time I think I try going with less seeds.</p>",
 "year": "2007",
 "id": "64721",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-03-21T07:00:00.000Z",
 "views": "3570"
}
