{
 "title": "Underwater Magic",
 "author": "Blue Midget",
 "citation": " Blue Midget. \"Underwater Magic: experience with Mushrooms (ID 64738)\". Erowid.org. May 2, 2010. erowid.org/exp/64738",
 "substance": "Mushrooms",
 "bodyweight": "65 kg",
 "header": [
  "DOSE:",
  "4 capsls",
  "oral",
  "Mushrooms"
 ],
 "report": "<p>Before this trip Ive taken a wide range of psychedelic drugs including Ecstasy, LSD, Weed, DXM, DMT, Mushrooms and Mescaline and consider myself to be quite experienced with psychedelics although there are some quite well known ones Ive yet to try such as Ketamine and Salvia.</p><p>At around 11.15 in the morning I took the mushrooms while in the city. I was with my 2 best friends Tim and Cathi, my friend Esther and her boyfriend Dylan and Cathis friend K. The plan was to head to the city Aquarium (AQWA) while tripping and since they take around 2 hours to kick in we dropped early. Only Esther and Dylan were also tripping with me.</p><p>After the long train and bus ride we finally arrived at AQWA around 12.30 giving us 45 minutes for it to kick in. This gave us enough time to look around the place before we got too screwed over. One of the best features of AQWA is a huge underground tank called the Ship Wreak Coast which has glass tunnels through it allowing you to pass beneath the various sharks, stingrays, turtles and fish while not even moving since theres a conveyable on the ground. This we decided to save our first look at this when we were tripping hard.</p><p>As we were coming up we started looking at the creatures inside the smaller display tanks. The first thing which creeped us out was in the Swan River tank. It was full of various fish but the one thing that stood out was this one completely evil eel. At least 2/3s of its body was buried in the sand. The remaining 1/3 was stuck completely vertical up in the water. The snout was pointed with 2 beady eyes and a mouthful of tiny needle like teeth. Esther, Dylan and I began a conversation about the utter evilness of this particular eel. The ideas ranged from the eel darting up to eat the other fish, to it crawling through the air vents in order to steal babies and finally that the eel was in fact the creator of the Nazi party. Naturally our imaginations went a little wild about the lifestyle of this eel.</p><p>After this I got out a lollypop, one of two Id brought because I love them while tripping. Unfortunately as I was eating it K asked me if I had another one which I told her yes but I wanted it for later. Unfortunately K wouldnt take no for an answer and immediately started asking can I have it, can I have it over and over again while backing me into a corner. Eventually under this pressure I surrendered my second and last lollypop. In my currant circumstance I had no clue how to deal with someone who wouldnt take no for an answer.</p><p>At this point the visual effects of the shrooms began to kick in. The interesting thing about mushrooms (at least this particular type) is that apart from some slight wobbling of lines hallucinations dont particually move. What is interesting though is the change in the texture of everything looks. Everything people, walls, animals looks like its made out of plasticine. If I didnt know I was tripping I would be sure that I could pull a chunk of wood off the wall and mould it into any shape I wanted.</p><p>We found Tim and Cathi sitting around the cylindrical jellyfish tank. This area was very dark but the tank itself was lit by black lights. Watching the jellyfish brought up all sorts of thought patterns focussed about the life of a jellyfish. They seemed like the most pointless organism on earth. A clear jelly sack moving around with nothing but instinct and absolutely no memory, it wouldnt even know it was in a tank. It wouldnt even have any enjoyment in its existence because its whole life was virtually determined by the ocean currents. But would the jellyfish care. Was it so simple that the pointlessness of its life didnt occur to it, could it recognise some things were better off then it. The life of this sad organism was pointless but in a way it seemed much better then ours. Sure it could never be happy but only because there was no such thing as happiness in its primitive brain and so likewise it could never be sad. It was an entity with no mind of its own, and perhaps that's better then the alternative. On a visual note I could swear the tank was full of tiny fish which I would see clearly for a moment but would disappear when I got up to look at them.</p><p>Since we were now quite clearly tripping hard we decided to go to the Ship Wreak Coast tank. Along the path down to it there were more tanks. The first one virtually prevented us from moving as soon as we saw the Cuttlefish in there. It was hardly moving at all just hovering in mid water with its tentacles lowered down and its skin slowly changing colour. It looked so wise, like a shaman or wise man. It even seemed to have a human face with its tentacles being the beard.</p><p>About halfway along the path things began to turn a little weird. Every animal in the tank had human faces on them. Whole schools of fish looked exactly the same. The same dull, blank and soul less face looking like they wouldnt hesitate to hurt us if they could. The Sharks looked like frankistines monster. They were ugly, dangerous but ultimately kind and misunderstood. It was strange what is by all logic harmless (the fish) seemed dangerous and although physically human was nothing like this on the inside, almost like a zombie. While the sharks which are dangerous were on my side.</p><p>Once we got out we ran back upstairs refusing to use to lift for obvious reasons of not wanting to be trapped inside a small steel box. Once upstairs we headed outside but stopped at the close up tanks. These were a collection of 4 circular tanks with magnifying glasses over them allowing you to get a close up of the creatures inside. The one that grabbed our attention was the one containing Moray Eels. There were about 10 of them all wrapped together in what looked like a nest of maggots. They were absolutely revolting but it was impossible to look away. The front one looked like it was advancing towards and threatening us, while another smaller one looked like it was being crushed by its friends. Once outside we stopped by the touch pool. Feeling the slimy scaly surface of the stingray was creepy but at the same time very exciting. This particular situation was even better since we were the only people over 10 who actually wanted to touch what was in the pool.</p><p>Next to see were the Fur Seals. After almost getting caught in a large net hanging from a pole (we were sure it must have been put there to catch people who were high) we went into the underwater viewing area. The seals were amazing animals to watch and we managed to get there attention several times and make them spin around in the water while right in front of us. At this point I started to talk to Tim about the seals. Since he wasnt tripping and I was he decided to screw with me and started telling me that the seals were here to put on a strip show for us. At the time it seemed like the stupidest idea ever and I immediately told him that the seals couldnt strip since they lacked clothing. Tim replied by saying they would just peel off their skins. This got a disgusted look from me and I immediately walked away and told Esther Im not talking to Tim anymore hes being disgusting.</p><p>After some pointless wandering around the rest of the building we returned to the Seal tank at 2.15pm because Cathi wished to see the Seal expert who was meant to turn up at that time. This time at the tank though we werent interested in the actual seals at all. In fact the whole time us 6 were gathered around the side of the tank without any seals while all the other visitors were at the other end. One of the cool things were the rocks. They made all sorts of shapes for instance one looked like it was definitely a chicken. Me and Tim soon came to the conclusion that the centre boulder was in fact the foot of a dinosaur. This dinosaur had survived in AQWA for the past 165 million years and was at least 50 times the size of any other dinosaur ever discovered. Of course for this theory to work AQWA had to have existed since the same time which we quickly agreed that it must have. We then discovered the most magical thing about AQWA and the seal tank in particular. If you pressed your head hard against the glass and looked directly down you could see rainbows in the algae on the floor. This kept us entertained for quite some time.</p><p>We headed back up and went to look at Stingray Cove while the feeder was there. The Stingrays were very very weird, especially when they put their head up and you could see their mouth while they ate. We didnt stay long though because Tim, Cathi and K wanted some food. Esther and Dylan wanted to have a cigarette first though so I waited outside with them while they smoked. Although we told the others wed meet them inside instead we sat there for 20 minutes talking about drugs and how every parents passing buy gave us evils. They obviously believed we were there to sell heroin to there children.</p><p>After a while Cathi called us asking us to come inside since they had no money for food. We said we would but after 10 minutes we hadnt moved so Cathi called us once again and we convinced them to come outside. At this point they asked for money so they could get chips. I thought why not and gave Tim 10 bucks to get them. Two seconds later I realised that I didnt wanna give them money for food I didnt want and so I tried to grab my money back. However Tim using his non-mushroom reflexes avoided my attempts to get the money and went inside to get the food.</p><p>He came back in a few minutes with 2 plates of chips. I picked one up and held it in my fingers for a while in order to sample the texture and image of it. Although a bit apprehensive about eating it I eventually put the chip in my mouth and bit down. After swallowing it I realised that the chip was actually swimming in vinegar and quite quite disgusting. The whole thing was soggy and fowl tasting and I swear it wasnt made out of real potato. I then turned on Tim to try and understand why hed bought 2 plates of these horrible snacks.</p><p>After the others finished eating Tim wanted to go to the toilet so I went with him to locate it. After an intense run there which I managed to avoid getting distracted he went inside and I waited for him outside. It was at the point where I met the most amazing, beautiful and coolest creature on the earth. It was a medium sized red and white fish which while seeming normal had one difference, it could walk. This fish had 6 whiskers which it used as legs to walk around the tank floor. It was amazing to watch and I came to the conclusion that it was the most perfect creature on earth, as well as being the evil eels enemy. I felt as if Id met god.</p><p>After this encounter Tim, Cathi and K decided it was time to leave since they were bored of AQWA even though Esther, Dylan and I werent. Since it closed in half an hour anyway it wasnt too big a deal although I did still bitch about it slightly. AQWA really is an amazing place to trip at. The environment that the animals live in is so alien to us its like being on another planet which the various fish, rays, lobsters and eels are its inhabitants.\r[Reported Dose for this report was '4 '00' size capsuals of spores (sic)' -- Erowid Note: The spores of psilocybin-containing mushrooms are not psychoactive.]</p>",
 "year": "2007",
 "id": "64738",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-05-02T07:00:00.000Z",
 "views": "1452",
 "dose": {}
}
