{
 "title": "As If a Title Would Fit...",
 "author": "SerdaL",
 "citation": " SerdaL. \"As If a Title Would Fit...: experience with Mushrooms & Oxazepam (Serax) (ID 64764)\". Erowid.org. Oct 5, 2009. erowid.org/exp/64764",
 "substance": "Mushrooms & Oxazepam (Serax)",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   "10 mg",
   "oral",
   "Benzodiazepines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "64764",
   "Male",
   "",
   "15",
   "Oct 5, 2009",
   "5655",
   " "
  ]
 ],
 "report": "<p>I've smoked pot. Ya know, the usual. Nothing out of the ordinary. God, I hate it. I wish I had individuality. I wish I was original. But what more could I want to be but myself? For that is my individuality, and my originality. But there's two of that. Do I wish to be me, the way I was born? Or me - the one who is me from experience, depression, and happiness, and my life. How do I mix those two? Can I? </p><p>Besides pot, I've done other drugs. Nothing good though. Nothing intense. Nothing to blow my mind. Nothing like a psychedelic. Nothing like what I wanted. What I craved. Hoe, I don't care to 'trip balls' (Well, yes I do), I don't care about getting high. I do drugs to explore my reality. I do drugs for optimism. I am the psychonaut - who has never done a psychedelic. My fingers have practically touched dmt, amt, lsd, and salvia. You name any psychedelic and I've had it...almost. And my summer what hyped up for all those drugs. But it turned out to be nothing - and a weed drought to top it off.</p><p>I'm 15 years old. And my name is Eric. Today...Well, a few days ago I came across some mushrooms. I practically snagged them from my friends hand. Ya know, 'cause I've only been staying up until 2 am every night reading up on psychedelic drugs online. I was the drug geek. But the closest I've ever came to 'psychedelic' was probably when I smoked a dime of weed. Yes, I said it. A dime of weed! It must be the apocalypse! Well, to me it is. 'Cause I'm the most light-weight mo'fucker you'll ever meet. I've never smoked more than a dime, and when I smoked a dime, that was only one time from a gravity bong, because every time I try, I usually end up forgetting how to use the pipe... or something like that.</p><p>But it was different now. Before I went into sophomore year, I wanted to be a whole new me. 5 grams of shrooms? That's gotta bring me up to the 7th plateau.  And yes, it only goes up to the 5th. Okay, let's cut all the crap now...</p><p>Set: Trying to get into a good mood. I guess I was in an okay mood. Just so excited for the journey.</p><p>Setting: My room, in my house. On the other side, lies my mom. My dad is on some business trip. Bound to my room, otherwise my old, creeky house would awake everyone there. I am by myself (very smart), it's 12am.</p><p>I ate the 5 grams and I took a benzo (serax) so I wouldn't get fearful, panicked, or any other bad thoughts. I had my ipod, filled with psytrance. I spent a hew hours making the playlist. Mostly infected mushrooms... but any other 'uplifting' song. Since music is important, check out the song 'Elation station' by Infected mushrooms. A lot of the songs were like the beginning of the song. I was laying on my bed. I could feel it - slightly.</p><p>And just like the first time I got high, it hit me. Like a pimp slap across the face. BAM! Or maybe it was just that I lost time, and I really took the whole time to peak. I was lucky I already started the play list on my I pod. </p><p>Sometimes.... words just can't describe things. Who was I? What is I? Haha... but no seriously... When I say 'Who was I?' I don't actually mean it. Because there is no way, in any shape or form I could come up with that thought. Three words? Common! That's like...for college students! ....  .... .... ....</p><p>There was no I. There was no world. There were no shrooms. There was just me. In my room. Slowly twitching or moving. The air particles in the room - I see them. They bounce off of me. There are always there. I'm not. I move them with my hand. (And when I say 'hand' I don't mean 'hand' I mean that limb that's attached to my body. What I'm getting at, is these words, hand, body, I - don't exist. There are no words. Just me.) My headphones fell out of my ears.</p><p>And finally, after the few hundred hours it came to me to pay attention to the visuals. WHAT?! No. That's not what makes something psychedelic. But damn - it helps. Walls: Breathing. I am breathing. But it's hard... I can't tell how long it's taking me to exhale and inhale (This scared me A LOT...thanks benzos for helping the panic!). Time distortions plays the role of this. There's just too much going on to pay attenion to vision. And besides, there was more important things going on then the 10 new colors I was seeing. A rainbow of their own. I fell onto my bed. Head on pillow. I closed my eyes. And then - it began.</p><p>DESKHSKGFHUIEHGVGFIFHKLASHSD KA BOOOM. Into and out of fuckin' vortexes and realities unheard of. Going the speed of light. Faster! Faster! Faster! Trillions of miles traveled in the matter of a tenth of a second. And then, I just stopped. I ended up... no where. But no where is somewhere. So I'm here. I'm there. It didn't matter. I remember, seeing myself spinning and floating, with sparkly colors trailing after me. I heard a voice. It told me to 'let go'. A few years later, I realized that I heard this voice and then decided to do what it telepathically told me. I don't know how I 'let go' but I did. </p><p>Nothing but geometric patterns and veins. The veins pulse blood. My blood. Our blood. The blood they pump. It beats. I see the blood in the veins. The pressure is too great. The veins burst. Where's the blood? There's just light.  Why is there so much light? What is light? Light isn't real!!! It's not....</p><p>*GGGAAASSSSPPP* I'm breathing fast, rapid and hard. It was the next morning. I guess I fell alseep? Or I don't remember? I stayed there for a few hours. Compiling everything... impossible. And here I am writing this? How degrading! You can't put this into words! Shrooms go beyond words.</p><p>-----The next day------</p><p>I remember what I wrote, and a little more from which I can't describe. And even with what I wrote, it's nothing compared to what happened. I just wish I remember more of it. I supposed I closed my eyes and layed on my bed for who knows how long, and then fell asleep probably from the benzo. They knock me out.</p><p>Was it worth the 70$ I spent for these bitchin' shrooms? Totally. This really gave me what I needed. Something to wonder about. I just wish I could describe how it changed me. It's something where if you're ready for it, it can help anyone out. Especially being a teenager and growing up in this corrupt society, this saved me. Was my shroom trip fun? No. But I loved it. It's pure insight and optimism. Next time I hope to lower my dose so I can think more. It brought a whole new mystery to my life. I'm Atheist / agnostic now. Fuck Christianity. \rYou've changed my life forever. And until next time, I say goodbye.</p>"
}
