{
 "title": "Peaceful",
 "author": "Can_be_cruel",
 "citation": " Can_be_cruel. \"Peaceful: experience with Mugwort (ID 64805)\". Erowid.org. Aug 21, 2009. erowid.org/exp/64805",
 "substance": "Mugwort",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "",
   "Alcohol - Beer/Wine",
   "",
   " T+ 12:00",
   "2 g",
   "oral",
   "Mugwort",
   "(tea)",
   " T+ 0:00",
   " ",
   "smoked",
   "Mugwort",
   "(dried)"
  ]
 ],
 "report": "</p>Today has been a very strange day, truly one of a kind. I don't think I've felt this peaceful and content in almost two years.</p><p>It started with the events of last night. I drank almost an entire liter of wine. I was very very intoxicated. I was alone at home, but I was talking to numerous people online, both on AIM, MSN, and chat rooms. There were points when I felt I was on the verge of making an ass of myself, but I think I caught myself every time. I made a connection with someone that I previously disliked. I listened to his story and I empathized with him. It's a rare occurence nowadays for me to be able to listen to a story, and not immediately pick a side, so for me to be able to listen to this story and remain neutral, and sympathize with both parties was kind of a revelation for me. In addition, I laughed so much. I haven't laughed that much in a long time, and it was very theraputic for me. I know a lot of that had to do with the alcohol, but it was good for me regardless.</p><p>I went to sleep pretty late, and I didn't sleep well or long. I woke up around 7 am with a bad stuffy nose. I decided to try some of the mugwort I bought yesterday to see if it would calm me down enough to sleep again, and that's where the fun really began. I made a cup of tea with about an ounce of herb. It's a very fluffy, powdery feeling substance, and it has a sweet, herby smell to it. I was nervous about drinking the tea initially, I was expecting a strong, bitter flavor for some reason. The flavor was actually very nice. It tasted just like a cup of mild green tea, with a slightly bitter aftertaste now and then, but nothing lingering or unpleasant. I finished the entire cup in about 5 minutes (I'm a tea drinker, so it goes down like water for me).</p><p>After about ten minutes, I started feeling very calm and mellow. Although I had slept so little, I didn't feel tired or exhausted, I felt very relaxed, but awake. It also seemed to suppress my appetite. I had awoken with a hangover headache, and with a growling stomach. I didn't eat anything because I wanted to feel the full effects of the tea. After drinking the tea (which was at about 8 am), I had no desire to eat.</p><p>For the rest of the morning I just hung out in my room, playing around on my computer and chatting with people. Around noon, my friend came and picked me up to go to the bank. She noticed a difference in my demeanor right away. Normally when we're together we're very rowdy, loud, raunchy, and obnoxious. She commented on my relaxedness. After we went to the bank, we were both a little hungry so we stopped at Taco Bell. I was unable to eat much, I got two burritos and I was only able to eat one in the restaurant. I had no idea that mugwort was an appetite suppressant, but I'm not sure I mind it at all!</p><p>After she dropped me off at home, I decided to try smoking some of the herb. I emptied out a cigarette, and packed it with mugwort as well as I could manage. Once I lit it however, the herb burned extremely fast. The cigarette was literally gone in seconds. I'm pretty sure I didn't pack it correctly. From what I managed to inhale, the smoke was very sweet and light, it smelled similar to marijuana, only without the heavy chemical/tar smell. The taste was nonoffensive, and the smoke didn't sting or burn. Next time I'll either try rolling papers, or I'll try smoking it out of a glass bowl. I have a feeling that will work a lot better.</p><p>After I smoked (or attempted to smoke) my mugwort joint, I remained in my room. At this point, fatigue took over, and I managed to nap for a short period of time. I did have a very vivid, emotionally-charged dream. When I woke up again, I was still very relaxed, but as time wore on the thought of productivity became more and more appealing, and eventually the desire to get up and do small tasks around the house took over. It's now been over 12 hours since I first ingested the mugwort tea, and while I'm still feeling very mellow, I'm not floating quite as high as I was during the majority of the day. My appetite is slowly beginning to come back, and genuine fatigue is beginning to set in due to the lack of sleep.</p><p>Right now I'm steeping a tea bag full of mugwort in the little wine that I have left over, and I plan to drink it at about 10 pm tonight. Hopefully the outcome with be lucid and memorable dreams!</p>",
 "year": "2007",
 "id": "64805",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-08-21T07:00:00.000Z",
 "views": "13269"
}
