{
 "title": "A Guy with No Face at My Window",
 "author": "The Devil",
 "citation": " The Devil. \"A Guy with No Face at My Window: experience with Bupropion (Wellbutrin) (ID 64818)\". Erowid.org. Oct 6, 2009. erowid.org/exp/64818",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "165 lb",
 "report": "<p>[Erowid Note: 3000 mgs of Bupropion is considered an extremely high dose.]</p><p>A friend of mine was just prescribed Wellbutrin pills for depression. Out of curiosity I was reading the pamphlet on it and I saw that large doses cause hallucinations. Of course my dumbass ignored the side effects and dosed as high and I could.</p><p>I didnt hit me for a couple hours, but when it did I had uncontrollable vomiting. I would try and get some sleep, sleep for 3 hours wake up fucking 3 min later. I was difficult to sleep as well due to the large amount of spiders crawling on me, and the guy with no face at my window. I finally got up and moving at 5:00 am, I was still puking every 15 min, and I couldnt sit anywhere on account of the spiders that would crawl on me (I fucking hate spiders just for the record).</p><p>The hallucinations got worse, when I went to puck a hang came out of my toilet and waved at me and quickly went back in. I sat down in front of the TV, which was turned off, this however didnt stop me from watching a movie anyways, lots of Dinosaurs playing on my blank TV. Finally when I was all alone I started seeing people, I could see them in the mirrors, when I waved they waved back. However when I turned around they were gone although I could still hear them moving. One of them was wearing stilts in my living room, I could hear him walking around, and shaking my furniture.</p><p>Altogether my trip lasted 16 hours, I had one minor seizure, and the whole time my heart was pounding like I was running a fucking marathon! The vomiting lasted just as long, it was painful and retarded.</p>",
 "year": "2007",
 "id": "64818",
 "gender": "Male",
 "timestamp": "2009-10-06T07:00:00.000Z",
 "views": "7836",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3000 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(pill / tablet)"
  }
 }
}
