{
 "id": 6484,
 "title": "Being Dissolved in the Universe",
 "date": {
  "submission": "2008-02-26T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Evil_Pole",
  "gender": "Male",
  "weight": "81 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(fresh)"
  },
  {
   "time": " T+ 0:40",
   "amount": "80 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(fresh)"
  }
 ],
 "report": [
  "[Erowid Note: 120 grams of fresh mushrooms is considered an extremely high dose, see Mushroom Dose Chart]",
  "Shrooms are a bizarre thing: a kind of love hate relationship. People who refer to them as teachers have it absolutely right in my opinion. In this trip, I was an idiot and overdosed myself massively, causing an unbelievably fucked up trip, which I did not enjoy at all. However I feel so unbelievably much stronger for the experience, and was so elated after it was over (things can only get better), that I can only compare it to being cast into the flames, to be reforged, newer, and stronger.",
  "Starting off with 200 grams fresh, my girlfriend, a friend and I took 40 grams each. Now something which I will never quite understand, is that after about forty minutes, both of my friends were smacked off their gourd, and yet I was left almost perfectly in touch with myself; able to read, make cups of tea, basically do everything I might normally be able to do. I had neither euphoria, nor was I able to see visuals. This pissed me off. My friend suggested that I try a few more. Now, I think I must have been more fucked than I realise, because I for some reason thought it would be a great idea to eat the remnants in their entirety; some 120 grams, or a quadruple standard dosage. I was of course fine for a bit, seeing cool warping and stuff, and agreeing to the proposition which my friends had, which was to get a film out and watch it.",
  "Fifteen minutes later, I was feeling really rather ill. It was a sensation rather like not being in control over major sectors of my mind. Negative thoughts, like how I really needed to get cracking on an essay, and how I needed to do this or that kept on rudely barging their way into my thoughts. I couldn't really concentrate on anything else. I was seeing some seriously weird shit, like peoples faces distorted into mickey-mouse shapes, and corridors which seemed to go on forever when I was walking down them, but I wasn't really able to enjoy them, because of the overwhelming rushes of self loathing which were coming over me. Most importantly, my environment started to appear really unfriendly. For some reason, the fact that the people around me weren't constantly smiling and happy as hell was having a really bad effect on me, and I thought I was being extremely impolite by tripping quite as hard as I was. Needless to say, this was a recipe for disaster: On the high dosage that I was on, it was plain for all to see that I was on an express train straight to hell.",
  "In a minute, everyone in the room we were watching the DVD in was crowded around me, girlfriend included, asking me if I was alright. It didn't help that no-one believed me when I said that I was okay. They all had these worried expressions on their faces, which was making things worse. I could hardly talk to people by this stage. I was completely wrapped up in my thoughts, which were going at about a thousand miles a second. It occurred to me that it was a distinct possibility that I might die.",
  "My girlfriend took me to my room to watch over me, despite the fact that she was still tripping, which was pretty brave. I just lay on the floor, staring at the ceiling, while this massive battle played out in my mind. Basically, something very strange happened to my ego. I felt myself lose all grasp of myself, whilst simultaneously feeling the presence of a very high power indeed, which informed me in no uncertain terms that by messing with mushrooms I had done a very foolish and sacrilegious thing, and that I would be judged accordingly. The force then opened my eyes partially to a glimpse of what the universe actually was; a notion so profound and real-seeming that it was utterly terrifying. As my vestigial self identity seemed to fly apart, the power asked me to justify my existence in the grand scheme of things: in other words to show why I merited inclusion in this fantastically rich canvas, or else I would be winked out of existence. I felt so close to this point, that I was scared completely out of my mind: more than I have ever been. This thought tortured and occupied me, keeping me in a miserable state for what seemed like hours. Finally, I felt a sudden release, as I was cast into a still terrifying, but less disorientating realm, in which the self-loathing, nihilistic part of my mind was striving to destroy me.",
  "Fortunately, what I might call my less redeeming self came to my rescue. The part of me that is an arrogant overbearing idiot drove me out of the mire with the confident and utterly true assertion that 'Fuck you - you can't do shit; this is all going to wear off within a few hours'. I held onto this precious piece of information as I felt this new part of me grow incrementally, ready to fling it in the face of my tormentor, who was no doubt rejoicing in his victory. Then, it happened: I just snapped out of it. I put everything into perspective, and just got up. I could still see the visuals, but I was in control of my own mind.",
  "Aftermath: A lot of apologies, especially to my long-suffering girlfriend, to whom I still have a lot of making up to do for the shit trip she had and the amount of worry she went through looking after a zombie - not knowing whether to call an ambulance, or what. I, however, emerged from the experience unscathed, and stronger for it."
 ],
 "erowid": {
  "id": "38537",
  "citation": " Evil_Pole. \"Being Dissolved in the Universe: experience with Mushrooms - P. cubensis (ID 38537)\". Erowid.org. Feb 26, 2008. erowid.org/exp/38537",
  "substance": "Mushrooms - P. cubensis",
  "views": "2403"
 }
}
