{
 "title": "An Extreme Love Story",
 "author": "McH",
 "citation": " McH. \"An Extreme Love Story: experience with Methaqualone, Caffeine & DMT (ID 64854)\". Erowid.org. Oct 22, 2007. erowid.org/exp/64854",
 "substance": "Methaqualone, Caffeine & DMT",
 "bodyweight": "76 kg",
 "header": [
  "DOSE: T+ 0:00",
  "250 mg",
  "oral",
  "Methaqualone",
  "(capsule)",
  " T+ 0:48",
  "1 glass",
  "oral",
  "Caffeine",
  "(liquid)",
  " T+ 1:24",
  "2 hits",
  "smoked",
  "DMT",
  ""
 ],
 "report": "<p>Luding out with DMT.</p><p>Male, 76 KG</p><p>Year of birth: 83</p><p>Mindset: Alone at home, radio playing. Rainy day, a bit bored. Looking forward to testing the ludes. I am in good health. Previous experience with various psychedelics, no experience with methaqualone.</p><p>Last meal: 14:00</p><p>18:00: Methaqualone: 2x 125 mg capsules, making up 250 in total. Empty stomach.</p><p>18:22: This is the come up. Lovely feeling, numbness in hands and legs. Difficult focussing eye sight. General drowsiness.</p><p>18:26: Tingling sensations in hands up to my finger tips, arms and legs. Loss of coordination. I like this feeling. My belly moans, I am quite hungry. Hands are so cold and numb. I feel like going for a walk, yes, I'll take a short hike.</p><p>18:48: Back from my walk: I feel relatively intoxicated. Wasted is also a good word. Socializing requires a bit more effort. So does walking in a strait line. I am sure my neighbour can confirm this. Tingling sensations all over my body. Numbness in my face. Cold hands, now I feel tired, I would like to take a nap. I'll have a energy drink I guess. All this is quite enjoyable!</p><p>19:11: After the energy drink (75-90 mg of caffeine) the sleepiness disappeared. So did the inability to focus. That spoiled part of the fun. Still feeling very content and happy, in an intoxicated way.</p><p>19:17: Music is quite nice. Still a bit drowsy. I wouldn't have any problems going to sleep but staying awake is part of the fun. I am getting used to the effects now. Great stuff fur just chilling. I feel a good solid dose of MDMA would be wonderful. Decide against it, supply is short. Better save it for when I am not alone.</p><p>19:24: DMT!? YES! Don't know. 2 knife tips in a tube, didn't bother to weigh it. Vaporised with lighter. Next thing I know I am departing. The sound, crackling of a upcoming nitrous ride. The familiar feeling.</p><p>Ohh my God. Notice I spelled God with a capital? I am a agnostic. Or was? I think.</p><p>She was beautiful. Red and nice. Warm like a rose. Many faces dancing on her. We become one and I am her and she was me. There is nothing else than us. Inside or outside its all the same. Heavens. This rush of orgasm. I realize we are having sex. She smiles. I scream out loud. Again she laughs and the shivers intensify, I sink in and out of her with shivers of pleasure when it reaches a peak, unimaginable. 'I want to stay with you!' No, she nods. This feels so good. Orgasm of the soul. Free from the clumsiness of my body. Her colours change from red to yellow to orange to pink, back to red again. Her faces become one with beauty and she kisses me goodbye. 'I don't want you to leave! 'no' 'Why?' 'I want to stay with you, be like this, the two of us, like this forever.' This everlasting pleasure. 'I love you!' I never meant that more in my life.</p><p>19:32: As I sober up I notice I said that out loud. I realize what happened. I fell in love hopelessly. The best thing to ever happen to me. I feel warm and fuzzy. I just met the pure manifestation of love. I need to go back! I feel a strong urge to moan out loud. Still my body shivers with pure pleasure.</p><p>It feels so much like cheating: 'Honey, I just merged with this beautiful being and had sex with pure energy materializing into ecstatic love, in another dimension. Extra stellar orgasm lasting ages. I love her and I want to go live at her place. She is perfect, flawless.' That would score pretty high on the 'thoughts better not spoken out loud' scale!</p><p>In retrospect:</p><p>After the DMT I laid down on the floor shivering and saying ohh my god, ahhh. Must have been there for about 10 minutes staring at the ceiling. After that I got up and felt completely sober. Maybe sober in this case is relative to the way I felt 10 minutes before. Also the energy drink (golden power) took the edge of the lude experience. I feel a beer would have done the opposite. Had I not used the caffeine drink and the dmt I guess the ludiness would have lasted for an other hour or more. For having fun on ludes without anything: I would advice a 300+ mg dose. This is a drug that is great for lots of combos, I know for sure!</p><p>The good thing about the lude & DMT combo was that it took the potential fear and anxiety of the rush away and I went in feeling very relaxed and comfortable. The combo of effects, DMT visuals and complete rush, together with the sedative, relaxing and slightly euphoric/erotic feeling of ludes was just wonderful and left me feeling like having an incredible orgasm with extra ordinary visions and out of body feel for 10 minutes that seemed like eternity but were way to short!</p><p>I don't know if there are any dangers involved with combining methaqualone with various other substances, please be careful. In no way do I advocate reckless experimenting with these substances!</p>",
 "year": "2007",
 "id": "64854",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-22T07:00:00.000Z",
 "views": "28755",
 "dose": {}
}
