{
 "title": "How Not to Trip for the First Time",
 "author": "theo neon",
 "citation": " theo neon. \"How Not to Trip for the First Time: experience with H.B. Woodrose & Alcohol (ID 64868)\". Erowid.org. Sep 28, 2010. erowid.org/exp/64868",
 "substance": "H.B. Woodrose & Alcohol",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "7 glasses",
  "oral",
  "Alcohol",
  "",
  "5 seeds",
  "oral",
  "H.B. Woodrose"
 ],
 "report": "<p>Timothy Leary would slap me in the face if he heard this abortion of set and setting for my first entrance into psychedelia.</p><p>Set: I just started dating a girl and was pretty anxious about where it was going, I've always been scared of psychedelics and didn't do anything to calm my nerves prior to the trip, I'd recently been getting more pronounced paranoia from pot usage, I occasionally have anxiety episodes for no obvious reason, earlier my friend and I were having a conversation where I was arguing that humans only exist to further the cause of entropy.</p><p>Setting: 3:00am after a night of drinking, at my friend's tiny, institutional place, which is foreign to me and uninviting, it's freezing cold out and I'm in an unfamiliar city, we have no chill music on hand, I'd never even heard of hbw.</p><p>Prior drug use: plenty of pot and alcohol, one DXM experience (roboitchin'), one cool nyquil/pot/alcohol synergy, one nitrous hit.</p><p>So my friend suddenly pulls out this bag of 'legal drugs' he's collected. I'm somewhat drunk and more than a little impressed with the mound of weird plants and seeds. He didn't have any pot and I'd been in the mood for something besides booze. So when he proposed that we dip into the supply, I was intrigued. He showed me the hbw and said it was what he wanted to do (he'd done it before and wanted to give it another shot). I'd always wanted to trip, but never had the balls. Alcohol grew me a pair that day. After debating, we each grabbed about 5 seeds (low dose, I know, but I'm a small guy and was uninitiated). We did nothing to prepare, just chomped away and began the wait. At this point I noticed my friend had a guitar. I figured wailing away for a while would be a good prep for the trip and that's just what I did. For about 45min-hour I slammed the strings, more frantically every minute, yelled things, knocked things over and eventually as the drug kicked in, started biting random objects and shouting heartfelt pleas for my friend to bang out a beat. Most of the playing was normal for me, especially infused with alcohol, but towards the end of the hour I began feeling a surge of energy that had nothing to do with booze.</p><p>As the trip began, I was immediately relieved. It felt strange like nothing before ever had, but it wasn't at all disturbing. In fact, I soon found in addition to the weird energy, there was an intense euphoria coming on. For about 30min-hour I babbled nonstop about how great the drug felt, how I never should have been afraid, etc. I then got an intense urge to share my mind with my friend. I wanted him to understand everything I ever knew and all my feeling. I especially wanted to talk about places we've been together and how our perspectives were different. I talked about all kinds of things, including the negative aspects of life, but nothing bummed me out. I was ecstatic to be sharing and to view all my problems as insignificant and solvable. At this point, I figured I had reached the peak and was about to come down.</p><p>Then things got intense. First I went into a sort of meditation where I would feel on the edge of something: falling asleep, waking up, dying, enlightenment, god knows, but I'd flinch and lose it at the last second. Then I snapped. I lost complete touch with reality. There was no hallucination. Everything around me was still there, but it was no longer real. I knew I was on a drug, but somehow that didn't explain enough. While I had no insight into the real nature of life, I did know that I could no longer continue with whatever this illusion is. For a while it was amazing. Until terror struck and I bolted into the cold night without shoes, socks or a jacket.</p><p>It took quite an effort to get me back inside. My mind alternated between viewing the apartment as safety or hell. Somehow between my running, 911 dialing and confused rambling my friend managed to give me the impression that his apartment was not confining me to the fucked up existence I'd known previously. During the walk back, I felt a clarity, a stillness, a loneliness I've experienced on more than one sober occasion since. It is beautiful and frightening and may be what I believed it to be. The rest was classic bad trip. I was already dead or in the process of dying, I was forever insane, I was in the womb waiting for rebirth, I was at my parents' house hallucinating and could hear their voices vaguely through the madness, the tv discussed my death (actually saddam hussein's), my friend alternated between demon (complete with melting eyes) and angel. Meanwhile nausea struck causing me to spit constantly, triggering visions of 'actual reality', a car accident and me on the side of the road spitting blood. My friend vomited, but was exceedingly calm considering my condition. The only positive aspect of this part of the trip was the intense closed eye patterns I saw. I knew if I could just get some sleep, I'd feel better, but it wouldn't come.</p><p>The next day the comedown was in waves. Sober, then slightly tripping, then paranoia. I paced the city and moved with the flux. Eventually I felt relaxed enough to sleep. That was around 8:00pm. The drug itself had worn off by 2pm or so (about 11 hours after ingestion). Scattered memories: spitting out a large gulp of water I deemed poisoned, becoming a puddle of piss as I pissed, glowing textile patterns, realizing my friend and I had murdered the neighbor [no, not actually of course], visions of my aunt's house, trip dialing and leaving an extended message, pillow humping.</p><p>Don't take this as a condemnation of hbw. The drug packs a powerful head trip as advertised. Just be ready for it and plan properly.</p>",
 "year": "2006",
 "id": "64868",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-09-28T07:00:00.000Z",
 "views": "24944",
 "dose": {}
}
