{
 "title": "My Playlist Became the Most Significant Thing in the Universe",
 "author": "Grey",
 "citation": " Grey. \"My Playlist Became the Most Significant Thing in the Universe: experience with DXM & LSD (ID 64863)\". Erowid.org. Jan 31, 2008. erowid.org/exp/64863",
 "substance": "DXM & LSD",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "888 mg",
   "oral",
   "DXM",
   "(liquid)",
   " T+ 2:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>I drank the DXM (delsym) and biked around town for awhile.  It was a nice berkeley day.  About 2 hours in, I rode to the campus and sat by a nice stream.  I felt the DXM feelings coming and reached a very relaxed state.  I got back and was still feeling peaceful.  It was about 6 o'clock, and I ate a hit of (strong) acid.  By this time, the DXM was in effect.</p><p>It ramped up slowly.  Here are my day-after notes:</p><p>The 'winamp playlist' became the most significant thing in the universe.  I thought I had enqueued the world's longest playlist that automatically figured out what I needed to hear.  I thought it had mystical powers.</p><p>The music separated into individual parts coming in at the wrong times.  The music would play 10 times slower than it should, then speed up to catch up.  The notes couldn't decide weather or not they were in the music or part of a mesh.  The sounds of the music were coming from everywhere.  I played 'in the court of the crimson king' and was totally overwhelmed.</p><p>The visuals were subtle, and only visible in a dark room.  Everything waved around and was slighly sparkly.  The music was the best part of the trip.  Even today, 4 months after, that music is still crazy to listen to, and I hear the same detail that I heard the night of the trip.  I thought my computer came alive and was communicating with me.  I saw lots of crazy things in my head.  More than DXM alone, more than LSD alone.</p><p>It took a lot of mental energy.  It's not good for parties, but it is a very interesting combination, and the night is still vivid in my mind.  It's on my list of things to try again.  Happy trails!</p>",
 "year": "2007",
 "id": "64863",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-01-31T08:00:00.000Z",
 "views": "7017",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "888 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ]
}
