{
 "title": "The Islanders Know...",
 "author": "fierphly",
 "citation": " fierphly. \"The Islanders Know...: experience with Kava Kava (ID 6487)\". Erowid.org. Apr 26, 2001. erowid.org/exp/6487",
 "substance": "Kava Kava",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "6 Tbsp",
   "oral",
   "Kava",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>I have gone through two pounds of this wonderful powder in the past 3 weeks (not including 2 bottles of supplements).</p><p>Let me introduce myself as a mild opiate addict and xtc worshipper who has tried *almost* everything (that was invented up to 1997) from MJ and shrooms to crack (I'm not proud of that one).</p><p>This is not a drug to 'trip out' on. Rather, to me it is the 'lithium' of the botanical world. When emotions are running too high or too low, when I am on the verge of insanity, it puts me in a place of serenity and knowledge that 'all is ok.' When my muscles are burning, aching and tired it turns me into a sort of solid (not formless) jello that moves with ease. It has become my new fix.</p><p>I discovered this only a month ago, and wish that I had discovered it years ago. It provides an ample amount of euphoria without any clouding of judgement or cognitive skills.</p><p>Let me add some cautions here. I have learned through my research that continuous, heavy use of kava can damage the liver (similarly to the abuse of alcohol). It can also lead to a serious vitamin B12 deficiency, so taking B supplements is advisable if you are considering using it on a regular basis. Additionally, from personal experience (as backed by research)that you *can* O.D.</p><p>My single overdose experience (caused by consuming about 8 cups) caused a mild tremor (from the neck up!) This was quite wierd. I felt fine otherwise, very euphoric. I have read that overdose can cause symptoms similar to nystagmus but involving rolling of the eyes, and stiffness of the neck (I did not experience these, at therepeutic doses it is a muscle relaxant). But don't let me scare you away: when used in *reasonable* amounts, kava is very gentle to the body and mind.</p><p>Recipes: (here are some recipes for preparing kava, for those who are put off by the muddy taste)</p><p>recipe 1 (kool kava recipe)</p><p>* 4-6 tbsp kava kava in nylon strainer bag or cheesecloth (lg cloth teabag will do)</p><p>* 1 qt cool water</p><p>* 1/2 cup +/- pineapple juice</p><p>* 8 tbsp light corn syrup</p><p>* 4 tbsp honey</p><p>* 1 tbsp almond extract</p><p>* 2 tsp coconut extract</p><p>* 1-2 tsp vanilla extract</p><p>serve in 1/2 cocunut shell (optional)</p><p>recipe 2 (coconut creme kava)</p><p>*3-6 tbsp kava kava</p><p>* 5 cups H2O</p><p>* 3 cups milk</p><p>* 1/2 cup light corn syrup (sugar or honey may be substituted)</p><p>* 1 tsp coconut extract</p><p>* 1 tsp almond extract</p><p>(or 2 tsp vanilla)</p><p>cheers!</p><p>~fierphly</p>",
 "year": "2001",
 "id": "6487",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-04-26T07:00:00.000Z",
 "views": "73760",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6 Tbsp",
   "administration": "oral",
   "substance": "Kava",
   "form": "(ground / crushed)"
  }
 ]
}
