{
 "title": "How It Ruined my Life",
 "author": "Tom's Daughter",
 "citation": " Tom's Daughter. \"How It Ruined my Life: experience with Cocaine (ID 6488)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6488",
 "substance": "Cocaine",
 "bodyweight": "150 lb",
 "report": "<p>I am writing on behalf of my father.  He is 47 years old and was the President of a publishing company.  He is addicted to cocaine.</p><p>I noticed several years ago that he was acting very strange.  He would be happy, then enraged.  He would make endless promises that he would never keep.  I have a young son who has never really known my father because when he did see him, my father could care less.  This was a man who believed that family came first.  He saved his money and was very successful.  After he started using cocaine, he became all of the things he hated. </p><p>My 15 year old sister lived with him and she became addicted. They would do 4-5 lines at a time and race to see who would finish first. She started skipping school, and he started skipping work.  This man had not missed a day of work in 20 years, yet he started skipping every Thursday and Friday.</p><p>Last year, my father called and said that his house was raided by the police.  He was convicted of 7 felony charges and sentenced to 4 years in prison.  He was released early and is currently in a halfway house.  He will be on probation for 3 1/2 years.  He lost most of his money, his brand new van, many friends and most importantly his pride. </p><p>Dad said that cocaine made him feel happy, invincible and sexual. He was also convicted of trying to have his way with some of my sister's friends.  He will be registered as a sex offender for 10 years.  His whole life has changed.  My whole life is changed.  I have my own family, yet I take care of his house, his finances and him.</p><p>Cocaine is something my father claims he will never touch again.  I most certainly hope so.  He says he will give presentations to others about the harm it causes, so I am hoping it will change someone else's life.  It has changed mine forever.  Cocaine doesn't just affect the person who is using--it affects everyone in the family. </p><p>This drug has taken a man who had everything to a man who has nothing.  Thank God he is still alive.  Cocaine does not discriminate as far as addiction is concerned.  It affects every gender, every race, every socio-economic status and every age.  My father is not alone in his fight against the addiction, but he will always have to live with the consequences of his actions.  I believe that it is a terrible drug, and if you try it, be prepared to hurt the ones you love and ruin your life.</p>",
 "year": "2001",
 "id": "6488",
 "gender": "Male",
 "timestamp": "2002-02-28T08:00:00.000Z",
 "views": "20278",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ]
}
