{
 "title": "Approaching the Other Dimension",
 "author": "Suave",
 "citation": " Suave. \"Approaching the Other Dimension: experience with H.B. Woodrose (ID 64932)\". Erowid.org. Aug 15, 2007. erowid.org/exp/64932",
 "substance": "H.B. Woodrose",
 "bodyweight": "58 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)",
   " T+ 4:30",
   "2 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "report": "<p>Age: 22</p><p>Experience type: First time</p><p>Previous experience: Alcohol, magic mushrooms, weed, speed, MDMA powder, ecstasy, herbal ecstasy (Trip-E), salvia</p><p>Years of experience with psychoactives: 8</p><p>I had bought a total of 30 Hawaiian baby woodrose seeds off the internet, and because I tend to enjoy exploring the creative and introspective aspects of drugs without any interference, especially the first time I take them, I decided to try some on my own in my studio flat. I was in a good mood and looking forward to the experience.</p><p>For anyone who does not want to read the entire account, I want to say that I highly recommend HBSs  it was without doubt one of the most stunning experiences Ive ever had  however I urge caution to people sensitive to psychedelics: the effect was incredible but surprisingly potent, and a considerably more thorough preparation than the one I undertook is suggested. I would also like to recommend putting up notices around the room with messages such as Dont panic! and Its just a drug  you will get out of it! in case the trip turns out to be a bit overpowering. I used to do this as a magic mushroom novice and I will be doing the same the next time I take HBSs.</p><p>I did not prepare for the trip in any way, except for reading about the general effects. I had eaten about two hours before the trip, which with hindsight was something of a mistake. I have previously tried herbal ecstasy  which, whilst stronger than I had been led to believe, is far weaker than most other drugs Ive taken  and as the particular type I took contained Hawaiian baby woodrose seeds, I anticipated a similar effect from the seeds themselves.</p><p>At a quarter past eight in the evening I ingested five seeds by chewing them and keeping them in my mouth for about thirty seconds. Having read a few articles about HBSs, I knew that the best way to take them was to crush them and let them soak in a glass of distilled warm water until the water had cooled to room temperature, but I did not have the patience to do this! The seeds tasted quite bitter but went down without a fuss. Almost immediately, however, I started to feel nauseous and after about 20 minutes I had to vomit, this means that my total dose, including the additional two seeds I took a few hours into the trip, probably amounted to about four to five seeds rather than seven.</p><p>At about T=-1h, I was starting to come up. Groundhog Day was showing on TV and I was extremely fascinated with how two-dimensional everything looked, as though each object and character in the film was a cardboard cut-out suspended a centimetre or so over an equally flat background. The theme of the film intrigued me, and I was deeply impressed with the script, the actors and pretty much everything else.</p><p>Two hours after the first dose I was tripping wildly and felt unable to sit still. I kept switching between sitting by the computer and lying in my bed whilst giggling constantly at the film, the commercials showing in between (although one, featuring two elderly ladies who looked like some sort of two-dimensional, gnome-like monsters, did disconcert me slightly) and the random thoughts that kept popping up in my head. As I was lying on the bed I realised that I was behaving rather like an animal, or a young child: rolling around, kicking and playing with my arms and legs, rocking back and forth whilst grinning like a loon, and stroking and poking at my skin. My body temperature had increased significantly  note that I was a bit ill and may have had a mild fever, although as I understand it some increase in body temperature is to be expected  and I felt compelled to remove all my clothes. Soon after I went over to my hallway mirror and stood there and admired myself for a minute or two, normally I dont find myself to be especially pretty, but at the time I thought myself to be a pure miracle of beauty.</p><p>Following that, I sat down in front of the computer to ponder the mental shifts I was experiencing. As soon as I turned my attention inwards, an incredibly profound sense of dissociation descended upon me, it felt, quite literally, as though I was physically standing on the brink of another existence. I was also able to travel back to old memories and relive them with amazing clarity. It was at this point, at around T=2-3h, that I decided to write down what I was experiencing. Its not an extensive account as my vision and mind were both too dazzled to focus properly on the computer screen, but it captures fairly accurately what I was feeling at the time:</p><p>I know I won't be able to remember this when I wake up, but it's like I'm just on the cusp of another existence. It's just out of my grasp... like if I could reach out just a little bit further, I'd be in a completely new realm of existence. I can see it. It seems impossible to explain, but I'm familiar with the feeling. It's sharp, and seems to have a light texture to it. It's clear and direct... Really, I can't capture it but it's so familiar somehow. I can barely remember what life is like outside of this. I'm glad I'm not talking to anyone at the moment, I don't think I could cope.</p><p>Wow... Memories are so clear. I am actually at . Wait, let me go back to the coffeeshop in Amsterdam... It's so clear, I can't believe it.</p><p>I wonder if the memory I have is from another drug experience... Mushrooms? Weed? I don't know. Man, this is so amazing, I just can't believe it.</p><p>I want to capture this feeling but I just cant. I know Ill read this tomorrow and think What the **** was I on? but I swear, this is special.</p><p>Every single word I read seems to be full of meaning. This is just so absurd... I cant make any sense of it at all. Flipping heck... I hope Ill recover from this!</p><p>Im behaving like an animal and I love it. It does make me reflect on the fact that words come so automatically to me, even when Im feeling so primitive. Im struggling to identify the language Im writing in, but semantically speaking I know its English.</p><p>Im sorry. I want to capture this, I want to keep this feeling but I cant.</p><p>About 4 hours into the trip, I could feel myself starting to come down slightly. Being who I am, I instantly decided to take some more. I had been wanting to do something creative ever since the onset of the trip but hadnt been able to bring myself to, so I took an additional two seeds hoping it would bring me back up to the peak. The trip continued in the same vein as it had previously for about two or three hours after that: the walls were breathing, my room seemed to be alive, colours seemed unusually distinct and sharp and everything appeared oddly two-dimensional.</p><p>A couple of hours after the second dose, things started to go overboard. I felt sick and wanted to go to sleep but couldnt. Probably because I had eaten a small buttered bun soon after taking the second dose I was also suffering from terrible heartburn, and my mind would not rest, I kept having closed- and open-eye visuals, my thoughts were disorganised and confused and I was very hot. At one point, as I was lying on my stomach at the foot of the bed, I seriously considered whether I was suffering from an actual drug-induced psychosis and whether I might have to seek help. Fortunately  in a manner of speaking!  I started to feel very nauseous indeed and decided to go to the bathroom to throw up. I did so, violently, and whilst the resulting aftertaste was unbearably foul I immediately felt better. I ate some strawberries, drank some water and then went to bed and read for a couple of hours. At this point I started to experience mild nystagmus (rhythmic involuntary eye movements), and the open-eye visuals that had become extremely overpowering before I was sick were now milder and more benign.</p><p>Ten hours after taking the first five seeds I was able to get some rest. I enjoyed eight hours of dreamless sleep, and in spite of the frightening severity of the later stages of the trip I did not suffer from any notable hangover the following day, except for a slight sense of absent-mindedness.</p><p>Im intending to take HBSs soon again, perhaps next weekend, and this time I will not eat anything for at least six hours before. Ill keep the dose at between five and seven seeds and Ill definitely make sure to pick up a pen and paper as well as listen to some music  Im already looking forward to it! Ive never taken LSD so this trip was unquestionably up there among the strongest Ive had, if not the strongest.</p>",
 "year": "2007",
 "id": "64932",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-08-15T07:00:00.000Z",
 "views": "44233"
}
