{
 "id": 6493,
 "title": "Mind the Stairs",
 "date": {
  "submission": "2006-12-27T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Andy B",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 ],
 "report": [
  "On a recent Friday night I went party hopping in the apartments surrounding my university, and I consumed a moderately large amount of alcohol for a person of my size and tolerance. As a list of what I had: one shot of spiced rum, two shots of vodka, 1.5 to 2 shots of Bicardi 151 rum, and 1.5 to 2 shots of gin. I have had more alcohol than this before and been completely conscious, having an enjoyable drunk experience.",
  "However, there was a party at an apartment nearby, which we accessed by going down a set of stone stairs. These stairs, I recall, were very fun to race down crazily and drunkenly, and I had little problem accomplishing this, up until one point, when I lost memory. That point was when I apparently slipped and banged the back of my head hard against the stair.",
  "The memory loss was caused by this trauma, clearly. After hitting my head, my friend tells me that I claimed to be okay, but wanted to simply rest or sleep. Bad idea. I sat down and apparently dozed off, despite my friends' attempts to keep me up. I got up, but then lost the ability to continue standing. An old roommate and friend of mine had to hold me up. At one point my friends walked me home to my apartment and stayed with me until I freaked them out so much they called campus security. I believe what scared them was my amnesia and delirium--I was speaking nonsense and could not answer simple factual questions (How old are you, what day is it?). Campus security called the paramedics, who continued the interrogation and decided to take me to the hospital, where I clearly needed to go.",
  "I have no way of knowing what happened over the next four hours. I assume the doctors did the usual tests for a drunken college student, plus CT scans and other examinations of my head. I eventually woke at the hospital and apparently called home. I have a message on my answering machine from myself. I don't remember making this call. From listening to this message, I could tell that I was still very much out of it and needed to rest until I cleared up. But that didn't happen, as I somehow walked out of the hospital (the simplest answer is that I escaped, as the hospital was a busy downtown hospital). As I left the hospital, I regained the ability to form memories, so I can recall the rest of the story from this point on.",
  "I walked two or three blocks from the hospital and up to a parking  lot and some construction workers doing work on a street outside of an apartment complex. I hassled these guys, as I had absolutely no idea where I was, why I was there, what day it was, etc. I actually believed that I was experiencing a dream and that 'dream logic' could be applied. I remember entering a car at one point, thinking I could drive it home or at least scare the nearby assholes enough to help me somehow. I gave one guy my friend's cell phone number, and he eventually called it, but by then the police had come and arrested me for public drunkenness.",
  "I fought those cops verbally, and begged for them to take me home. Instead they took me to a station and breathalyzed me, and I got .11. It was 8 am, so the cops thought I got really trashed the night before and that all my behavior was from alcohol, when it must have been more to do with the fact that I probably had a concussion only 5 hours earlier.",
  "The cops threw me in a cell for 4 hours, which is standard for drunks they won't prosecute.",
  "I called everyone, my parents, my roommate, myself, and eventually my grandfather came and drove me home. Being in jail was terrible, it was 4 hours of remorse. I had absolutely no idea what had happened to me the night before, so I was scared out of my mind and just needed to be at home.",
  "When I got home, my roommates told me what happened, though I am always hearing new details. I apparently shit in my pants and vomited all over, which means I probably had a concussion."
 ],
 "erowid": {
  "id": "38575",
  "citation": " Andy B. \"Mind the Stairs: experience with Alcohol - Hard (ID 38575)\". Erowid.org. Dec 27, 2006. erowid.org/exp/38575",
  "substance": "Alcohol - Hard",
  "views": "5868"
 }
}
