{
 "title": "First Descent Through An Intricate World",
 "author": "Arjuna",
 "citation": " Arjuna. \"First Descent Through An Intricate World: experience with Salvia divinorum (10x extract) (ID 64998)\". Erowid.org. Jul 19, 2010. erowid.org/exp/64998",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "181 lb",
 "header": [
  "DOSE:",
  "100 mg",
  "smoked",
  "Salvia divinorum",
  "(extract - 10x)"
 ],
 "report": "<p>Background: I am 20 years old and have had virtually no experience with drugs. Aside from mild frivolous drinking and smoking when I was younger, drugs have never really entered my life. However, I am naturally very creative, open, and interested in the world around me. So I was very excited when I accidentally found a web-forum discussing Salvia Divinorum. After finding out it was legal and hallucinogenic, I hurried to my local head-shop. I purchased one gram of Salvia Divinorum, 10x extract, Club 13 brand. After buying it, I had to wait for about a week before trying it. Finally, a good chance came when I and two other interested people gathered at my friend's house to try it.</p><p>Setting: We were all sitting in my friend's backyard. He and his girlfriend decided to observe, while I and two other friends of mine decided to smoke. We were sitting on the cobblestoned ground, with some grass poking up and the sky visible over two large fences. I was fairly comfortable, but not overly so. The weather was pleasant.</p><p>Mental State: At this point, I had very little idea what to expect. I had done some research, but never having had a hallucinogenic experience, I was excitedly tense.</p><p>Dose: I smoked about 1/10 of a gram from a metal pipe. I had read about the recommended ways to smoke Salvia, so I inhaled hard and fast with a steady flame.</p><p>Experience: 0:00- I pulled the smoke into my lungs and quickly passed the pipe. I felt the need to cough, but restrained myself. The smoke had a light, not unpleasant taste.</p><p>0:30- I exhaled and started nervously looking around, waited for the trip to begin. My friend asked 'Did it work?' As he was saying those words, I felt a loud and powerful rhythm in my head and body, beating away. At the same time, trumpets and other musical instruments rose up to the beat. It seemed that his question was simply part of the growing song, and I managed to whisper 'You're in a movie,' before bursting out laughing.</p><p>1:00- People were talking around me, but I wasn't paying attention to the meaning of their words. Instead, I saw the forms of their words flying down from the sky, entering their mouths, and clicking off their tongues. This was like nothing I could have imagined, but it didn't seem strange or fake. It was as if I was looking past the veil of the world into a layer of mechanism we normally couldn't imagine, but which is no more strange than gravity or motion. I saw my words flying from the sky into my mouth as well, even though I didn't know what I was saying. About this time, I began to feel a strong pressure on the roof of my mouth. This pressure seemed to correspond to the entry place of the words. I started to explain to my friends that my face was bent because of the words, but I couldn't speak correctly. I was feeling very light and happy, with no unpleasant or scared feelings at all.</p><p>2:00- I felt a word enter my mouth, but I didn't react quickly enough to flick it off with my tongue. It dissolved, and I felt mildly disappointed about missing the word. Around me, others were laughing and also taking hits off the pipe, but I was so entranced by the flying words I hardly noticed my trip-buddies.</p><p>3:00- Suddenly, I felt the need to look at the people around me. When I saw my gathered friends, I burst out laughing. They seemed to be composed out of 4 tan blocks: 1 block for each arm/hand combo, and 2 blocks for the forehead and face. Thus, what I saw was a group of arm and forehead block-people, comically waving their limbs around and flicking off words. I exploded into laughter and said, 'You are all so ugly! I can never look at people again!' When I saw my block friends looking concerned, I laughed even harder.</p><p>4:30- Very slowly, like a film dropping over my eyes, the amazing things I was seeing started to vanish. I knew that they would always be there just underneath my normal layer of sight, and that  I would see them again. I was feeling blissful and joyous.</p><p>5:20- Open eye visuals had mostly stopped. I turned to my observer friend whose backyard we had been using and said, 'It was just like I imagined.' I lay on my back and stared at the sky, the visions gone now, and calmly thought about my experiences.</p><p>6:00- Mild lethargy with heavy limbs. I was filled with warmth and happy thoughts. I lay in one place and daydreamed, not paying attention to anyone around me.</p><p>10:50- Effects largely gone. Nice feelings for another 20 minutes.</p><p>Reflection on Experience: My experiences were beautiful and intense, with completely distinct open eye visuals and tactile hallucinations. No negative aftereffects. Highly engrossing mental stimuli. My visions were completely enmeshed into the normal world. I even felt that my visions were more real than the normal world.</p><p>My first experience with Salvia Divinorum was one of the most life-changing events in my life. It led me by the hand into another world. It enhanced my creative visions and deepened my philosophical insight. I am planning to experiment with Salvia many times in the future.</p>",
 "year": "2007",
 "id": "64998",
 "gender": "Male",
 "age": "20",
 "timestamp": "2010-07-19T07:00:00.000Z",
 "views": "2406",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
