{
 "title": "It's No Good",
 "author": "corb",
 "citation": " corb. \"It's No Good: experience with Buprenorphine (ID 65002)\". Erowid.org. Aug 9, 2007. erowid.org/exp/65002",
 "substance": "Buprenorphine",
 "bodyweight": "120 lb",
 "report": "<p>When my friend asked me if I wanted a small line, I didn't know what I was in for. I actually thought he was being kinda stingy with the dose. He warned me that for my first time, it could knock me out. He told me it was what they used to get junkies off heroin, but that didn't scare me.</p><p>I consider myself pretty experienced with opiates (I've done every pharmeceutical painkiller I can think of) so I thought I'd be fine.</p><p>It didn't kick in right away. It took a lot longer than I thought, so I was very happy with the initial high after snorting it. it smelled like gatorade. I felt slightly dizzy and giggly and pleasantly low as we watched a movie.</p><p>It was after getting up and smoking a cigarette that the bad stuff started.</p><p>I found myself feeling very hot, then very cold. Every time I stood up I felt nauseous, but I was still sure I'd be fine, because sitting still felt good. I was feeling very, very low at this point.</p><p>I puked for the first time in the toilet, and thought I was done. I felt fine after throwing up, so I thought going to the movies would be okay.</p><p>For the record, no pill has ever, ever made m throw up before this one.</p><p>Halfway through the movie, I had to practically run to the ladies room. I barely got into the stall before projectile vomiting all OVER it. I have never, ever projectile vomited. Even the few times I've been drunk enough to puke, I've been a ladylike and subtle puker. I was not prepared for that. I threw up everything I'd ate and drank since taking the drug. I was surprised at the volume.</p><p>I felt okay again, and after cleaning up, I went back into the theater, where I practically passed out on my boyfriend for the rest of the movie.</p><p>In the car, on the way back to his house, I had to ask my friends to pull over. I got out, puked what tiny bit of sprite I'd dranken in the theater out, and got in again. It was terrible.</p><p>I threw up again on the side of the road on the way back to my house. that was mostly dry heaving.</p><p>the only truly enjoyable part of this experience was getting back to my house, where I slept like a rock for the entire night.</p><p>I still feel it now, the next afternoon. It's a little headbuzz, and when I woke up I still felt a bit nauseous the second I got out of bed, although laying down felt very very incredible.</p><p>this is not something I will do again. And I don't recommend it. The drug is potent as hell, and fine for heroin addicts, but for an everyday recreational drug user, I'd say stay away. I regretted it.</p>",
 "year": "2007",
 "id": "65002",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-08-09T07:00:00.000Z",
 "views": "30694",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Pharms - Buprenorphine",
   "form": "(ground / crushed)"
  }
 }
}
