{
 "id": 6502,
 "title": "A Breathtaking Trip with God",
 "date": {
  "submission": "2007-06-20T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Apoc",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "LSD was the first big hallucinogen I encountered, and currently my chemical of choice for my uses. Here follows the details of my first trip, my discovery of the intense and breathtakingly beautiful sensory, bodily, and mental changes which LSD so flawlessly activates:",
  "After a quick prayer, I dosed a single hit of reputably outstanding LSD just over an hour before sunrise, and sat in my room alone waiting for effects to come on. I was not really anxious, so I listened to some music while chatting with a few friends. about 30 minutes passed before I felt symptoms coming on slowly, a feeling of energy and warmth throughout the body. Then, my mind became suddenly very silent, very clean, very relaxed. I was already very happy at this point, and really started to enjoy myself by the time the hour had passed. Not too far past the first hour, I was feeling amazing, and I knew I had to get outside before the sun came up. I walked to the back door, feeling like I had *never* in my life felt. I grabbed some blankets and a pillow off the couch, and headed out the back door, and set up a spot on the large trampoline in the middle of the yard. I lay down and began to take in my visual field, realizing how delicious and spectacular my entire world around me had become! Even in the low light everything was glowing with life and feeling and energy, and the sun was still coming up over the horizon, out of view behind my house.",
  "I began to stare into the sky, my body completely relaxed like never before. I began to converse with God in my mind, so clearly I felt no need to speak. My visual field was wider and more focused than ever, and I watched the sky unblinking as the light of the sun came across everything slowly, so slowly, so patiently. As the sunlight came onto the trees in front of me, I began to see why trees were so respected by the many who enjoy LSD. The superb detail and clarity and focus, of every single branch and detail on every single tree I looked at, completely blew my mind. I had never imagined that perception could be so grand and delightful. I thanked God out loud for this gift, this sacrament, for the world around me, for the Life He Is and Is, all around me and throughout existence.",
  "I realized, that true Life is true Love is true Good, IS GOD, not personified in any way, but the Energy of energies, the Power of powers, the Existence of existence. Without LIFE, existence cannot persist, because without a supernatural purpose it has no driving force. Existence without true Life is like a clock without time; All the mechanics and potentials of operation are there, but the dimension which constrains it is no longer present. In a way, God could be compared to a dimension which bounds all existence, like time but timeless, in a completely different layer of reality.",
  "Eventually my mind finally relaxed from the realization, and I stared once more at the tree I had been fixated on. I drew my attention to another in the background, and something caught my eye. A face, a small blue face. As I concentrated, I realized quickly and painfully what I was staring at; I was staring into the eyes of an evil force, a watcher, which I had encountered in my younger years during a severe sleep paralysis episode. I froze completely where I was, terrified as it took shape increasingly clearer. I asked it to leave, I asked it to shut its eyes and turn away, but it stood motionless in the top of the tree, staring straight into my soul. Falling to my last hope, I spoke out quietly but directly to God, 'remove that thing from here God, remove it now, take it down, take it down and i never want to see it again!' I will never forget that moment, when I spoke those words, and God grabbed me inside, and the form disappeared, and the feeling of complete and amazing hope struck me inside like a train, and I spread out my arms to God, and looked up into the sky. I'd never felt stronger or closer to God until that time, the time when I needed Him most, a direct encounter with my only true fear, fear itself.",
  "'Evil' is nothing more than fear, a flaw in the human mind, where wisdom and Life are missing. I realized this fully, and from that moment, my goal has been to Live life for Love, for God, for Good, to pursue wisdom and share it with my fellow man and woman. From that point on, I have never again encountered evil or fear in a trip, because I no longer allow even the slightest hint to exist in my mind, because I understand exactly what it is. The terror I felt was incredibly and completely surpassed by the awesome joy, hope, and Love which grabbed me by the soul and didn't let go. The rest of that day was perfect and completely enjoyable, as was the following two days. I have never had such a refreshing experience in my life."
 ],
 "erowid": {
  "id": "38609",
  "citation": " Apoc. \"A Breathtaking Trip with God: experience with LSD (ID 38609)\". Erowid.org. Jun 20, 2007. erowid.org/exp/38609",
  "substance": "LSD",
  "views": "3207"
 }
}
