{
 "title": "Pleasent End to a Quiet Day",
 "author": "Jayster",
 "citation": " Jayster. \"Pleasent End to a Quiet Day: experience with Mugwort & Passion Flower (ID 65034)\". Erowid.org. Jan 8, 2010. erowid.org/exp/65034",
 "substance": "Mugwort & Passion Flower",
 "bodyweight": "153 lb",
 "header": [
  "DOSE:",
  "7 g",
  "oral",
  "Mugwort",
  "(tea)",
  "",
  "5 leaves",
  "oral",
  "Passion Flower",
  "(tea)"
 ],
 "report": "<p>I first heard about Mugwort online, and thought I'd try it. I went to my local herb shop and bought a half ounce of Oat straw and Mugwort, and about 5 leaves of Passion Flower which, I guess, is two and a half grams. I then put 1/4 ounce of the Mugwort 1/5 ounce of the oat straw in a pot of water and boiled it for about 15mins, I put honey and vanilla extract in the mixture to add flavor as well. I lost about half of the mixture when I filtered the mixture poorly, I took a sip but didnt feel like drinking it now, so I stored it in the refrigerator for a few days. I didnt feel like drinking the tea due to a bad experience with catnip, the flavor in my mouth wouldnt go away, along with the feeling in my stomach every time I saw or smelled an herb that can be used in tea (which is just about every herb).</p><p>Anyways, after a couple of days, I decided to drink some, but it was a Luke cold type temperature, if you can imagine, Undrinkable. Since it needed to be heated up, I figured Id add the passion flower because its a sedative like the Mugwort. So I cut up the leaves and put them in my cup then heated it in the microwave for two minutes on 25% power. I put some milk, and more honey in the tea and only took a few sips (the catnip was still on my mind...) Surprisingly, I felt a lot of the effects, I thought to myself, This stuff must be very powerful if 3 sips can make my eyelids heavy.</p><p>There wasnt really a lot of experience the first time I drank it, so an hour later I drank some more in hopes of a better one and I ended up chugging the whole dam cup. I decided this would be easier then taking one sip every 3 minutes. After I drank it, I had a lot of phlegm in my mouth (flem to be a lot simpler [lol]) I was also on the computer at this time... so I got off and laid down for awhile and watched a movie. I was patient for a half hour and thought I still wasnt feeling the effects, until I got up to snack...</p><p>I could barely walk, and I had a slight headache, too. I probably had a headache because I drank the whole cup in a few seconds. Anyways, the effects, like before were more powerful than I expected. Im not sure if this was due to the addition of Passion Flower, but probably not, because it only was a few grams, and also, Passion Flower is a mild sedative from what I read. It turned out my mom was thawing a chicken for dinner so I couldnt snack on anything. I couldnt eat, but I didnt like this headache, so I took a couple of Advils.</p><p>I fell asleep at the end of the movie, though the tea was making me stay awake. Weird thing about this, Ive found that it makes you drowsy but restless. I had very vivid, colorful dreams, and I recalled them almost perfectly. Besides what happened in my sleep, this wasnt much of a trippy experience, unless you call very mild delirium a high... but its very good if you like to dream. This is still a pretty good experience, compared to other herbal buzzes Ive tried. Pretty cool, but its not at all psychoactive.</p>",
 "year": "2007",
 "id": "65034",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-08T08:00:00.000Z",
 "views": "12834",
 "dose": {}
}
