{
 "id": 6507,
 "title": "Overdose-induced Schizophrenic Episode",
 "date": {
  "submission": "2005-01-28T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "plank",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "120 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I wish to share my terrible experience only to inform others of a dangerous 'potential' side effect that can result from taking extreme doses of Adderall (amphetamine- CNS stimulant). I was introduced/perscribed to Adderall my Freshman year in College due to general academic problems such as Focusing in class, and trouble studying for Tests. The last five months of school I showed a dramatic improvement in my grades, and it gave me a boost of confidence that was almost scary. After about seven months that feeling began to shifted gears on me, and I found myself taking more medication increasing dosage to achieve the same inital effects that I had felt.  Then one night I found myself taking four 30mg tabs= 120mg (this was after being up for about 3 days no sleep). My initial dose was 15mg a day as prescribed.",
  "About 45 minutes later after taking the extreme dosage I began to have audio hullucinations.  Like someone was calling my name, and words just seemed to come out of the air.  Then maybe 30 minutes later I could swear that I was hearing my parents talking to me, and then talking about me because of my strang behavior. Then in minutes I was induced into a paranoid schizo. behavior, and I could not tell what was real and not real. I then had convinced myself that my family had hidden cameras in the walls in my room watching my every move. I went into a rage running out of the house accusing my parents of this hullucination, and ran through the neighborhood trying to hide myself some way. Understandably concerned, and in a panic they went looking for me.  They found me 2 hours or so later running through the neighborhood in an emotional wreck. This happened at night, and I also remember having visual hullucinations of what I would describe as shadow people.  Dark shadow figures of people, and I thought they were following me as I ran my crazed self through the neighborhood. To make it worse people in the neighborhood called the police because of my displayed behavior.  The police showed up just about the same time as my parents, and then I had an EMS truck take me to the hospital. ",
  "I was not the same for about 2 weeks coming to terms with reality, and understanding what had happen to me after the doctor explained that Schizophrenia can be induced (or unrecognizable from) overdose of an amphetamine but is rare. Just to inform of the potential risk of misuse of Adderall."
 ],
 "erowid": {
  "id": "38630",
  "citation": " plank. \"Overdose-induced Schizophrenic Episode: experience with Amphetamines (Adderall) & Sleep Deprivation (ID 38630)\". Erowid.org. Jan 28, 2005. erowid.org/exp/38630",
  "substance": "Amphetamines (Adderall) & Sleep Deprivation",
  "views": "31923"
 }
}
