{
 "title": "Why... Can't Stop",
 "author": "Spy friend",
 "citation": " Spy friend. \"Why... Can't Stop: experience with Methylphenidate (ID 65095)\". Erowid.org. Aug 16, 2007. erowid.org/exp/65095",
 "substance": "Methylphenidate",
 "bodyweight": "225 lb",
 "header": [
  "DOSE:",
  "200 mg",
  "insufflated",
  "Pharms - Methylphenidate",
  "(ground / crushed)"
 ],
 "report": "<p>My addiction is very very old...I have loved drugs since I was 16, I'm now 55. I Had a few beers one night and got buzzed and of course I liked it. I smoked a joint soon with friends and LOVED that! I soon became a major pot head and drank more and more. Before I was 17 I was shooting dope (heroin). I did everything out there. We armed robbed and B&Ed drug stores for pharms. We risked our lives daily doing that, and then risked it again doing the drugs holed-up in motel rooms for days on end. Most all my friends are dead (from that stuff) but I survived, straightened out (sort of) kept drinking though, got married had a kid, bought a house, got divorced, got re-married to a gem (still have her) for 20 years now, had more kids one of whom was diagnosed with ADHD about 4 or 5 years ago, relatively late at about age 11 or 12. He wad prescribed methylphenidate of different varieties for a couple years and settled in on Concerta (5) 18-mg pills a day. 90 mg is a big dose some say but his pediatrician titrated him to that dose.</p><p>About a year after he started taking these meds I found a unused bottle of Methylin ER (generic for Concerta) and crushed and snorted it and bang...I was hooked. To make this long story a little shorter, it's now 4 going on 5 years now that i have been juggling 2 docs for Concerta and Methylin ER per month as well as robbing whatever I can from my son's. It has basically reduced me to a recluse guitar playing hermit who is on the verge of divorce. My wife found out I took my kid's meds and I managed to wiggle out if it as I am also prescribed Concerta. We junkies are very adept at wiggling out of predicaments! I was astounded to find that this extended abuse has not had severe health ramifications...at least not yet. I have Hep C and my liver's okay, and my heart is also. I thanks God for it. I always say this is the last script. Nothing changes, I can't stop!! I'm fine if I don't have any for days, but as soon as I can get it I'm back.</p>",
 "year": "2007",
 "id": "65095",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-16T07:00:00.000Z",
 "views": "20720",
 "dose": {}
}
