{
 "id": 6510,
 "title": "A Right and Proper way to Share the Drink",
 "date": {
  "submission": "2007-07-25T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Photographer Chad",
  "gender": "Male",
  "weight": 526
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "liquid"
  }
 ],
 "report": [
  "How one drinks it has tremendous implications as to whether absinthe will be enjoyed.  When purchasing, I base my consideration primarily on the look of the bottle.  It cannot look generic or homemade, for it will lose the trust of the drinker and the stomach will start a revolt long before the fluid's introduction (It's true what they say about first impressions.)  The same is true for the receptacles.  They should not be plain, but should be clean, colourful and dazzling.  Second only is chemical content.  I usually add a few drops of oil to increase the alkaline content to a level that is more accurate of antiquity.",
  "I only keep one bottle at a time, and my guests are never allowed to mix, match, or otherwise dilute.  It is served in a very small glass to prevent licentious indulgence, which the taste also helps to protect against.  Many decline a second sample, while most will dare a second, and often a third.",
  "I only produce the drink in the company of one or two guests, never more than a party of four.  As the floodgates to conversation are opened, more than four voices become a rabble that the brain cannot soak.",
  "The best time to drink, I find, is midday, with lunch; because with breakfast, it leaves one sluggish throughout the day (cappucino that is percolated with some cocaine is a much more suitable engine-starter).  The body is too exhausted for it at dinner, and leaves one dreaming some of their best ideas away long after bedtime.  At noon, however, it is nice sipped with a lunch.  Its effects will be enjoyed as the workday unwinds.  It calms the soul and puts angry business-doers at their proper priority in the grand scheme of things.",
  "It is also quite necessary to vary ones invitations each day.  I typically invite a few of my customers over for lunch, which is good for relations.  It earns a level of trust because drinking absinthe together is like divulging a forbidden secret.  It makes them feel like they have gotten to know a more personal you; but it also nice to invite a stranger every now and then.  The homeless are benevolent, grateful guests, I find.  The insane are also entertaining and enlightening, provided they are not overly paranoid."
 ],
 "erowid": {
  "id": "38640",
  "citation": " Photographer Chad. \"A Right and Proper way to Share the Drink: experience with Absinthe (ID 38640)\". Erowid.org. Jul 25, 2007. erowid.org/exp/38640",
  "substance": "Absinthe",
  "views": "10143"
 }
}
