{
 "id": 6513,
 "title": "First Trial",
 "date": {
  "submission": "2006-03-21T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Smoker2004",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Methcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "0:05",
   "amount": "0.075 mg",
   "administration": "oral",
   "substance": "Pharms - Clonidine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I was not planning on doing any stimulants that night but a chance came up to try Metacthinone. I'm always down to add another substance to my resume and in this case I was interested in the serotogenic action of this particular stimulant and how it compares to meth (the best stimulant period IMHO).",
  "I had very little time to prepare for this but I like to go into any experience expecting nothing and get the best results.",
  "T+0:00 Took ~100mg Metcathinone orally. The powder just had this 'chemical' taste, even though I thought it reminded me of something.",
  "T+0:05 Ingested ~0.075mg cloindine which seems to alleviate a lot of the side effects that I get from stimulants. Keeping my blood pressure in check is always good.",
  "T+0:15 Wow this stuff comes on faster than anything else does when ingested orally. Starting to feel calm and relaxed, getting pleasant tingles all over my body, feels like MDMA did before I 'lost the magic'. It also very slightly resembles good uncut cocaine. Very 'smooth'.",
  "T+0:30 Going for a walk now w/ a 'companion'. It is wintertime here in Greenland but I do not feel cold at all. I also do not feel like I've ingested a 'drug'; unlike meth, cat does not make its presence felt in terms of the physical effects. Could be due to the Cloindine though. I do not feel the urge to go and do things and 'handle my business' like I do on meth but communication is no problem; I feel very extroverted and at ease in any situation. It doesn't seem to make me super honest, however, and gives me the urge to fuck with people's minds similar to the way meth affects me. Weird. People can still tell I'm spun though since I seem to slur words together really fast in a manner specific only to this substance. I don't notice it either, but its quite evident to others.",
  "T+2:00 Still feeling great, but the peak definitely passed. The desire to do some more is only slightly weaker than meth and crack. At this point I decide to head home and a new stage of the experience begins. I use underground transportation (subway) to get to where I need to go; as soon as I enter I realize that I do not feel the serotogenic effect anymore. Some mental confusion is present, my thoughts are racing and I can't focus on any one of them for longer then 2-3 seconds.",
  "T+3:30 I finally get home and go nuts looking for something I lost ages ago. Having read about the 'manic' effect of MCAT I was able to control myself. Everything is going well, I still feel slightly energetic and then....",
  "T+4:00 All of a sudden, out of nowhere I feel the 'crash' which is weird since the effects seemed so subtle, almost harmless. This  is the biggest turn-off about this substance: I don't know what to do with myself and everything really bothers me. I also get really paranoid this is the strongest paraonia of any stimulant for sure.",
  "T+5:00 Smoked some excellent herb which alleviated the comedown quickly. I also got some cool visual effects, but nothing too prominent.",
  "T+9:00 After going for a short refreshing walk I smoked some more and slept without a problem. Woke up the next morning feeling refreshed, unlike after a night on ampetamines when I cant get out of bed for an hour.",
  "It would be interesting to try a combination with 5-HTP to see if I could have a rolling-like experience but I think I'm through with this substance: Manic obsession with something insignificant and a HORRIBLE comedown make it not worth exploring for me. Too confusing to be a 'working man's stimulant' it is hard to focus on even the simplest tasks... In comparison, meth has all the advantages over this including, unfortunately, a much stronger addiction potential. Combining it with other stimulants also does not look promising as the side effects would likely increase exponentially."
 ],
 "erowid": {
  "id": "38650",
  "citation": " Smoker2004. \"First Trial: experience with Methcathinone (ID 38650)\". Erowid.org. Mar 21, 2006. erowid.org/exp/38650",
  "substance": "Methcathinone",
  "views": "9834"
 }
}
