{
 "id": 6517,
 "title": "Turn Around, Blue Eyes",
 "date": {
  "submission": "2005-12-12T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "muidumees",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(daily)"
  }
 ],
 "report": [
  "I have been depressed, suicidal and suffering from PTSD (childhood sexual abuse) since I was 14. I am 21 now, yet no significant approvment has occured. I have been through neuroleptics, anti-depressants, a four year heavy benzodiazepines addiction (and even heavier withdrawal). I started smoking weed when I was 15, I have done a fair share of pills, spent half a year on daily amphetamine doses, blew the money meant to be spent on my kitchen furniture on coke.",
  "After getting married and buying an apartment with a bank loan, I started feeling better, yet still depressed and extremely desperate and agitated. Also, still having attacks of self-destruction and abuse flashbacks causing enormous trouble with lovelife and emotional stability. Having more responsibility in term of a loan, I did not lose control of myself during those attacks anymore, though. All in all, my identity was still as fragile as a cloud, with a slight burst of wind making me disappear.",
  "My work was constantly limited by lack of energy, and although depression started to give in after going through 8 month long benzo withdrawal, I remained desperate.",
  "Suddenly, chronic pain took a toll on me. I made my way through to get on Tramadol.",
  "And it was more than I could expect. Much more. The pain is under control but most of all the total eclipse of the heart has changed. I have turned around.",
  "I have been on Tramadol for nearly five months. I was working for four hours a day, I am now doing 10-12 hour days, I concetrate all day long and work perfomance is effective. My identity has been unchained from desperation and loss of soul. I can once again feel deep emotions, happiness, contentment, enjoyment from achieving good result with my work - on Tramadol, it is not the sick kind of happiness as on amphetamines. It is natural - I also get down when there is a reason. Most of the days, although, I feel extrem happiness for having come through, having the sexiest and most lovely woman beside me every day and for having a job I like. I am in balance, I am free, I am positive and most of all, I am myself - a whole identity.",
  "My brain is working and does fall into diccoation. I can finally say, I have turned my back on the trauma and have conquered PTSD. I also suffered from premature ejaculation and therefore, sexual frustration. Tramadol took care of it as well - my sex life has reached a state that I was thinking I will never experience.",
  "And am I high? No. I feel like a human should feel. I have been reborn with a past full of suicide attemps and self-destruction, turning my back on it for good. I have also given up most drugs - because I just don't want (and like) them anymore. I enjoy different kinds of highs (like working) and sex.",
  "I have one concern. Having taken it for months, higher doses than 300mg daily (I am now on 200mg), I started to get extreme anxiety and panic attacks, lasting for weeks with very strange physical symptoms. I was off for three weeks and now taking Tramadol again, it has not returned on those doses. Maybe it was something else what I was taking.",
  "Also one other downside - I have never done opiates, but I have now a very strong appetite for morphine or heroin.",
  "All in all. I was thinking for years that I cannot be saved - but I was. Turned around."
 ],
 "erowid": {
  "id": "38660",
  "citation": " muidumees. \"Turn Around, Blue Eyes: experience with Tramadol (ID 38660)\". Erowid.org. Dec 12, 2005. erowid.org/exp/38660",
  "substance": "Tramadol",
  "views": "45707"
 }
}
