{
 "title": "Mellow Times",
 "author": "OpiateLover",
 "citation": " OpiateLover. \"Mellow Times: experience with Tramadol (ID 65181)\". Erowid.org. Apr 9, 2008. erowid.org/exp/65181",
 "substance": "Tramadol",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "Pharms - Citalopram",
   "(daily)",
   " T+ 0:00",
   " ",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " T+ 0:00",
   "100 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   " T+ 0:43",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   ""
  ]
 ],
 "report": "<p>[Erowid Warning: There are case reports of people having bad reactions when mixing tramadol with SSRIs. This may include potentially life-threatening adverse reactions such as serotonin syndrome. See Tramadol Health Concerns]</p><p>I am big into Vicodin (especially Norco 10/325s) and got some Tramadol from my friend because he did not have any Norcos on him.  I wanted to try a new high, anyway, and thought these would be fun from what I had read about them.  I did all my research to make sure the dose was safe (I always do that!). </p><p>T+0:00:</p><p>Took 100mg of Tramadol and started washing some clothes.  Also drinking a strong Vodka cranberry.</p><p>T+0:17:</p><p>Nothing yet.  I am going to eat my dinner now.  Leftover Mongolian BBQ!!</p><p>T+0:24:</p><p>Ate dinner.  Definitely feeling something, but I dont know.  Things feel better to the touch and I have a heightened sense of hearing.  Ill report back in 30 minutes or if something else happens faster.</p><p>T+0:26:</p><p>Ok, I am definitely having a mood changeFor the better.</p><p>T+0:33:</p><p>ARRRGGHHHH!!  Forgot to add detergent to my clothes washing!!  Ill have to do it again.  Anyhow, I am feeling pretty good.  Happy and I have an overall heightened awareness.  My eyes are sensitive to lights right now.  OddAnyhow, I am definitely in a better mood from when I got home from work and the pan in my lower back is going away as well.  So far so good!  The food might have helped squash the nausea most people have reported as my stomach feels a-ok. </p><p>T+0:43:</p><p>Heart rate has increased, but nothing to be worried about.  I still feel good.  Dont think I have peaked yet.   Gonna go smoke a cig and see how it feels outside.</p><p>T+1:00:</p><p>A nice warm, happy feeling is running over me.  Everything seems good in the world.  I feel mellow and have energy at the same time.  While outside smoking a cigarette, everything looked fantasticThe sky, the trees, all of it.  This is seeming to be a good drug but time will tell.  Definitely different from a Vicodin high, but not sure if it is better yet.   Oh yeah, I am a bit itchy as well.</p><p>T+1:15:</p><p>Smooth like butter.  I am just relaxing.  Nice feeling.  Time to change the laundry.</p><p>T+1:33:</p><p>Well everything is fun right now!!  I feel pretty darn good.  I dont like it as much as Vicodin, but it definitely doesnt put me to sleep like Vicodin does.  It is good in that respect.  I am going to watch a movie now, but will report back after it is over.</p><p>T+2:49:</p><p>Gave up on the movie as it wasnt very good.  So this is a nice, mellow high.  It doesnt have the euphoric feeling of Vicodin, but it sure keeps goingOn and on.  I am smooth and mellow right now and feel very good.  Its a pretty good drug for sure.  I would do it again most definitely.  Ill report once more before I hit the hay.</p><p>T+4:20:</p><p>Still just very mellow.  Overall a very nice and warm experience.  I feel like I could stay up awhile or go to bed.  Whatever I really want to do seems attainable.  I will probably go to bed here soon as I have to work in the morning.  I will make one more post tomorrow morning to tell everyone how I slept.  This is a very interesting drug, for sure.</p><p>T+13:20:</p><p>I slept like a rock!  Wow, that was a great night of sleep for me.  I still feel very relaxed.  I would have loved to sleep it, but oh well, I still have 2 pills left and will use them this weekend.</p><p>All in all I had a great time on this drug.  Like I mentioned, not as euphoric as Vicodin, but it lasts a lot longer and still made me feel very happy and right with the world.  I also drank 3 vodka/cranberrys and have been on 20mg of Celexa daily since 2000.  I know they say you arent supposed to take Tramadol with SSRis, but I think at a low dose it is ok.  Always be careful with drugs!  Thanks for listening!!</p>",
 "year": "2007",
 "id": "65181",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-04-09T07:00:00.000Z",
 "views": "39877",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Citalopram",
   "form": "(daily)"
  }
 ]
}
