{
 "title": "Nothing Happened. Immunity?",
 "author": "GH",
 "citation": " GH. \"Nothing Happened. Immunity?: experience with Cocaine (ID 6525)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6525",
 "substance": "Cocaine",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  "8 lines",
  "insufflated",
  "Cocaine",
  "(powder / crystals)"
 ],
 "report": "<p>Okay, I am posting this in order to show another slant on all of this cocaine mayhem that seems to be happening.  And I am not saying that *your* trip will be like this...remember to know your mind, body, substance, and source.</p><p>My first experience happened at a goth club with my close friend at the time.  I had never taken part in the wondrously white realm of coke before, so was curious but scared as hell to try it out. We did two lines apiece, but nothing happened for me.  I was just all numb, and the drip was gross as all hell in a handbag.  She, on the other hand was really grooving on the stuff.  So, about a half an hour later we did some more, etc. etc.  And so on throughout the entire night.  I had probably snorted eight lines in the course of two hours.  All I felt was my heart pumping a bit, and then I got super annoyed with everyone...but in now way craved anymore.</p><p>My second experience involved snorting a LOT of coke throughout a span of three hours...for awhile I was 'up', but I could't really tell if it was my mind telling me that I should be feeling slightly fucked, what with all of the shit I had been putting up my nose, or if something was *actually* happening.  We ran out early in the morning and it took forever to get to sleep.</p><p>The last time I have used it was relatively close to the other experiences (all within three months of one another), and still nothing really happened.  I even snorted fat lines... Is there such thing as cocaine immunity?  Everyone else was raving about how 'good' the coke was, but I was just in my own land! Which I suppose is a really good thing, as I never craved it *once*, or settled into it's deathlike habit. </p><p>Just my $.02</p><p>However, be careful.  I've seen my friends get very fucked up on this white fairy, and I don't speak with many of them anymore because they are so far gone, and have pushed away all attempts of help.  Cocaine is easy to get fucked up on, as you can tell by the myriad of reports displayed on this site.</p>",
 "year": "2000",
 "id": "6525",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-02-28T08:00:00.000Z",
 "views": "11899",
 "dose": {}
}
