{
 "title": "UFO In the Forest",
 "author": "King 1",
 "citation": " King 1. \"UFO In the Forest: experience with Salvia divinorum (ID 6529)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6529",
 "substance": "Salvia divinorum",
 "bodyweight": "240 lb",
 "report": "<p>I ordered some Salvia D. from a internet company on a Friday, and received it on the following Monday. I got the package, and with excitement opened it. It looked like a bunch of dried leaves that had fallen off a tree. I didn't care, as I had heard too many great trip reports to tun back now. I waited till that night to try it cause of all the noise that was going to be bothersome during the day.</p><p>At 10:30 PM I went into my room and turned off my lights, disconnected the phone, and got out my water pipe. I pulled out my Salvia D. with excitement. I opened it up and packed a bowl of it into my pipe. I then followed the 'Salvia Rules To Smoking' that I had heard so much about. Get the full dosage of Salvinorin-A in your system in 2-3 minutes, use a water pipe, be in a quiet room...etc. I took my pipe and lit it. I held all my hits for about 25-30 seconds. While holding the second hit, I noticed a weird feeling in my body, the feeling that something was happening. I then took my third hit and once again held it for 25-30 seconds. When I exhaled the third hit, waves of euphoric feelings flooded my body. WOW! I thought 'This is amazing for a legal herb!' I then closed my eyes and hoped for visuals of some sort. No more than 20 seconds later I felt as if I were in the woods somewhere. I felt lost but not frightened. I saw a UFO looking craft in the middle of the forest.</p><p>All of a sudden a bunch of 'alien looking' beings started walking towards me. The amazing thing was that I was not scared! I saw hundreds of them gathering around me. I then saw what seemed to be the leader coming towards me. I felt safe and loved. I had never felt this way before. Just as the 'leader' made his way to me, I snapped back into realty. I sat there and thought for a good 10-15 minutes what would've happened if I would've stayed 'there' longer? The whole experience with the beings lasted for about 4-6 minutes, and the thinking back and recollecting what happened lasted for about 10-15 minutes. The overall time was about 20-25 minutes. I learned a lot from this experience. Maybe these strange beings I saw have a connection somehow to the Salvia plant? We may never know. . .</p><p>But I do know that Salvia D. is a plant meant for opening up the mind to things we do not see in realty. It should not be used as a recreational drug. This is a teacher plant. If we use it with god intentions it will surely shed light on many things unseen by the human eyes, ears, and mind. . .</p>",
 "year": "2001",
 "id": "6529",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-28T08:00:00.000Z",
 "views": "7262",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 }
}
