{
 "title": "Throwing My Life Away...",
 "author": "Malachi Speck",
 "citation": " Malachi Speck. \"Throwing My Life Away...: experience with Cannabis (ID 6531)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6531",
 "substance": "Cannabis",
 "bodyweight": "145 lb",
 "report": "<p>I have hardly ever read stories about the bad side of weed. So thought i'd</p><p>enlighten everyone to how some of the dangers of weed.  But once it</p><p>happened to me, I never want anyone else to have to go through that. I'm</p><p>talking about being arrested. I'm writing this a few long thought out days</p><p>after being let out of the police station into the custody of my parents (i'm 17).</p><p>Up until tonight, i was a firm believer in the way of the drug. I had been</p><p>doing drugs since a friend once introduced me to weed years ago, and was</p><p>hooked ever since. I never wanted to do heroin, or crack. That stuff can</p><p>take over your life. Weed was safe to me. No addiction, no withdraw, no</p><p>hangover, and really fun.</p><p>Like most teenagers, i never thought i would be caught. All of my friends</p><p>did, but that was just because they where stupid about it. The day before</p><p>my girlfriend's birthday i got a dime to smoke with her. We where driving</p><p>around smoking a joint and just talking. We finished the joint and had</p><p>tossed out the roach when the thing every driving pothead fears the most</p><p>showed up in my mirror... the blue lights. Both of my taillights where</p><p>out, but when he walked up to my window, all he could smell was weed.</p><p>He got me out of the car and flat out asked me where the weed was.</p><p>Knowing that i was supposed to deny everything i told him i didn't even</p><p>have any weed. Very patiently he asked me again and again where it was,</p><p>threatening with the drug dogs. I told him he had no right to search my car</p><p>without a warrant (forgetting the Arkansas law that just smelling weed is</p><p>enough to by-pass a warrant.) But still i wasn't going to tell him where it</p><p>was. I was gonna make him work to take my weed. But then he did what i</p><p>feared would happen. He got me where it counted, threatening my g/f with</p><p>prison time IF he did find the weed. That did it for me. I made sure i got all the blame, and she just had to call her parents, then i gave them the weed once she was taken care of.</p><p>Bam, the handcuffs go on. In that one second i saw myself as a totally</p><p>different person. I think i have a bright future ahead of me. I'm going to</p><p>college right now, carrying a 3.5, and i know what i'm going to do. But my life flashed before my eyes. Not my past life, but my future life. And for what? To be stoned. Not only that, but that could have fucked up my g/f life too. For what? Weed.</p><p>I don't want anyone to get the wrong idea. I am fully in support of legalizing weed. I think it isn't that bad. If legal, it would have a great place in our society. But the fact is that it is illegal. The thing i never really got is that weed may be the safest drug in the world, but you can still get a felony for it. With a felony i would not be able to get scholarships. I couldn't leave the country. I couldn't run for office, or own a hand gun. It would follow me around forever. And for what? To get stoned.</p><p>I'm not trying to change anyone. In fact, i would like nothing more than to</p><p>smoke a bowl. But if i even do it that one time, it is too easy for me to fall back into that lifestyle, and start thinking im not gonna get busted again. I'm just not willing to throw away my entire life's work to be stoned. Because if something is illegal, there is ALWAYS a chance you could get caught. I just realized that for me, smoking weed isn't as important as finishing college. I hope you print my story, cause even though i think it is stupid to be put in jail for life for pot, it can still happen, and i don't want that to be me.</p>",
 "year": "2001",
 "id": "6531",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-28T08:00:00.000Z",
 "views": "37652",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
