{
 "id": 6533,
 "title": "The -Nothing- Type Feeling",
 "date": {
  "submission": "2001-11-18T08:00:00.000Z"
 },
 "author": {
  "name": "Skabiez",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Inhalants"
  }
 ],
 "report": [
  "This is a less toxic isomer of ether, non-flammable, non-explosive, only real risk is the possibility of malignant hyperthermia associated with all ether products. This is faster-acting than ether but wears off fast too. I stole a 100 mL bottle while I was in the Navy and used it all in the period of a week after I got out.",
  "This is very interesting, pleasurable and unique enough to almost be considered addicting. It smells very sweet, after a good deep breath it sent the -nothing- type feeling into my whole head, the same feeling I would get from ether or nitrous, which is noticable immediately and subsides mostly within 3 seconds, totally within about 30. It works very fast and comes on hard, sometimes I might stand up, take a breath and next thing you know I are on the floor, with no memory of falling.",
  "I used the whole bottle within a week, the liquid is very volatile and even if you get a rag sopping wet with it, it dries out within a minute. I prefered huffing to sniffing this stuff, that is I got the rag wet, stuffed it in my hand, and breathed on like it was a thick straw. It tastes awesome and feels even better.",
  "The only down side is that I freaked out a little once I ran out. It is addicting in the same non-physical way nitrous is, they don't call it hippy-crack for nothing. It lasts a very short time and as soon as it is over I wanted more. In using it regularly, I felt kinda like my 'head was in a fishbowl' until I got it all out of my system...",
  "Also the passing out thing is more pronounced with forane because of its quick and intense action. I passed out 2x in my room, once I broke my lamp and the other time I put a good gash on my leg from a jagged bed frame. Maybe it's a good idea to sit and do this. Also I obviously didn't experience this but Malignant Hyperthermia is a very real and extremely deadly side effect of ether and you never know when it may hit, but studies show a user's chance of being affected increase every time they 'go under...' My theory is I'll do one bottle, maybe wait 5 years before the next. Or keep some dantrolene around, it is the antidote. I am unsure of the dosage for this.",
  "Overall, I thought this was worth doing. Always pleasant, regardless of mind-set before use. Didn't last long at all. Addictive. Pleasurable. The brief loss of memory is tricky, it also very briefly anesthetized me. The time I cut my self I was standing, took a huff... nothing ...i was sitting on the floor, I stood up again, sat on my bed, nboticed my leg felt wet, then noticed it was hurt... overall it took 20 seconds to realize I must have fallen and cut myself. This was weird, you don't really realize that memory formation can cease so I really didn't comprehend what happened, but the evidence is there, nonetheless..."
 ],
 "erowid": {
  "id": "3874",
  "citation": " Skabiez. \"The -Nothing- Type Feeling: experience with Isoflurane (Forane) (ID 3874)\". Erowid.org. Nov 18, 2001. erowid.org/exp/3874",
  "substance": "Isoflurane (Forane)",
  "views": "25872"
 }
}
