{
 "title": "My Friends are Idiots",
 "author": "TheTripsCaptain",
 "citation": " TheTripsCaptain. \"My Friends are Idiots: experience with Quetiapine (Seroquel) & Cannabis (ID 65395)\". Erowid.org. Aug 29, 2010. erowid.org/exp/65395",
 "substance": "Quetiapine (Seroquel) & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Pharms - Quetiapine",
   "(pill / tablet)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "20012004",
   "65395",
   "Male",
   "",
   "Not Given",
   "Aug 29, 2010",
   "8465",
   " "
  ]
 ],
 "report": "<p>Ahh, to be young again.  :)</p><p>The year was 2001, I was 13 years old, and had just discovered the wonders of Cannabis.  I began smoking daily in about May (small amounts due to low tolerance) and continued right on through the summer.  I had never done any other drugs, including alcohol, when in September of the same year a friend of mine hosted a small party at a local pool.</p><p>I smoked my usual bowl of cannabis and headed for the party on foot.  Walking into the crowd of about 20 people I said hello to a friend of mine, who promptly informed me Ive got some Seroquel, itll get you fucked up.  Knowing nothing about it, I eagerly ate the small red pill anyways, which I later learned is 25mg.</p><p>It wasnt more than half an hour before I began to feel a sort of lucidity.  Kind of a spacey feeling, but not a mind fog.  I looked at the cloud-less night sky and it seemed just incredibly clear, vivid, and peaceful.  I stared up at the stars for many minutes, all the while not really feeling inebriated, just altered.  Tuned to a different frequency, perhaps, but my mind and thought process were clear as day.</p><p>As clear as my mind was, however, my body was not doing exactly what my brain wouldve liked it to do.  Its not that I was falling over, but occasionally I would stumble a little or slur a word or two.  I left the party with a different friend who informed me, Youre a dumbass for doing that.  The feelings described above lasted for a few hours and then slowly wore off without me even noticing very much.</p><p>EXPERIENCE 2</p><p>So, now its mid-2004, I am 17, and have a drivers license.  The memory of my first Seroquel adventure is buried under a mound of other drug memories.  Ive drank alcohol, ate opiates, benzodiazepines, amphetamines, DXM, mushrooms Ive smoked Salvia divinorum, snorted cocaine, and smoked far more weed than I could ever begin to estimate.  Im probably leaving something out, to tell you the truth.  When a friend of mine called me and said, Ive got some Seroquel.  I immediately thought of that night at the pool, and drove over to his apartment.</p><p>But these pills were different.  They were 100mg, and peach-colored.  My friend explained that he had taken two, and felt little.  He recommended that I take three, which I did.  Immeditately as I swallowed the pills, he began laughing and pointing, saying Holy shit this guy just took three Seroquels!  Apparently, he had actually taken only one pill (the previous day) and it fucked him up incredibly.  This worried me.  I decided to drive home quickly before the pills kicked in.  It wasnt long before I thought I was going to nod off at the wheel  But I remember getting home safely, I do remember that.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>The next thing I remember is literally crawling (standing was impossible) from my bed to a ringing phone, which I answered, and proceeded to tell whoever was on the line not ever to call back because nobody lives here.  I then crashed back out.  I woke up the next day, about 20 hours after I had taken the pills, and groggily stood up.  I felt like I hadnt gotten any sleep at all, and in fact I was only up for a few hours before I went to sleep for the night.</p><p>My summary of Seroquel is this:  Eat the pills, and wake up the next day.  That second experience has killed my interest in the drug, although the first experience with 25 milligrams was pleasant.  In my opinion its not really a good recreational drug.</p>"
}
