{
 "id": 6544,
 "title": "New Trials",
 "date": {
  "submission": "2006-05-26T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dumb Luck",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Zaleplon",
   "form": "tea"
  }
 ],
 "report": [
  "It started with a trip to my doctors office to inquire about hypnotics and anxiolitics. After about an hour of drug pushing on the part of the Doc,(Prozac, Paxil, and other SSRI's that he said I NEEDED!)I finally talked him out of the SSRI's for now(not an easy task when the Doc gets kickbacks from the pharming community). After his sales pitch was completed, we discussed what I had actually gone to discuss. It seemed I had developed a social anxiety disorder and insomnia after completeing high school(I recently graduated). After the Doc's prognosis, he went right over to his magical little stack of green papers. He scribbled something on a couple and gave them to me. XANAX, he said, would get rid of the social anxiety, and SONATA would put me to sleep. Thinking I couldnt get any more scrips on this trip I PROMISED the Doc I would eventually try an SSRI of some sort. I went in wanting to try and obtain scrips for alprazolam, zaleplon, and maybe a pain killer of some sorts, and I came out with 2 of the 3, so not a bad trip to the Doc.",
  "After filling the scrips I went home to experiment. I have much experience with benzos (especially alprazolam), and the only reason I got them on this occasion were to use in mixture with my upcoming 2CX/Benzo trials. This left me with Sonata, a trendy new sleeping pill that is touted as being Ambien without the withdrawl. I hopped online and couldnt find any info, so I checked the usual medical journals and eventually found that zaleplon is a pyrazolopyrimidine, has a one hour halflife, and selectively binds to the GABA A receptor complex. This gave me enough of an idea as to its pharmacological action to give it a try. Earlier in the day the Doc told me not to take them until I am in bed with conditions good for deep sleep. To see what he would say I asked him why. He said if I took them then waited for them to kick in I would start noticing the effects(duh).",
  "I asked him what effects they would be, and he said drowsiness and maybe hallucinations.",
  "So now, to the trip. I opened one 10mg gelcap and emptied its contents into a cup of hot tea. I stirred for a moment to ensure dissolution. I drank the tea over 3 or 4 minutes and by the time i was done with the tea I was already feeling effects similar to Zolpidem. These effects can be charachterized by a 'floating' feeling, muscle weakness, and overall drowsiness. 2 minutes after finishing the tea my pupils were extrememly dilated and the aforementioned effects were being felt quite a bit stronger. This is the point where the trip changed completely. As the usual affects were mounting up in intensity, I began to notice my vision 'breathing' along with my lungs. Objects began to rise and fall and move along with my breathing. As I pondered this, other visual distotions became prevalent. Shadows and colors got a wavy effect where sharp edges and curves in objects began to look round. Most of these distortions I had experienced before using some drug or another, but there was definetly a unique aspect to the distortions.",
  "At this point my vision was all I was thinking about. The distortions, along with the tracers and frame vision I usually experience with GABA-Potentiators had made for quite an interesting field of vision. The GABA drugs also have the tendency to make me feel giddy and childlike. These effects all added up to make quite a happy tripper. Mentally, the effects of this drug are on par with most other GABAs(in my case anyways). I felt slightly dumb, with a somewhat cluttered thought process. These effects by themselves prolly wouldnt be too fun, but in combination with the 'fun' visuals I was experiencing and the lovely physical effects(relaxation, slight euphoria), the mental effects were greatly appreciated. I felt like a kid again, seeing certain things for the first time and experiencing basic feelings and emotions the way I did when I was 6 years old or so. Fun could be found in everything. Responsiblity took on a whole new meaning just as it had when I 'grew up,' only reversed obviously.",
  "As far as negatives go, there werent any other than the length of action. A one hour half life works well for getting to sleep, but not for recreational use. I cant complain about that however, because I obtained the meds under the guise of insomnia. This is only my first experience with this drug, so im sure my view of it will change after other experiences. I would very much like to know if anyone else has reacted to this drug the way I did.",
  "Another note: I found it quite ironic that the whole time I was with the Doc, he was trying to push drugs on me, and I was trying to exract the drugs I wanted from him. The Doc knows of the extent of my knowledge of pharmacology and chemistry due to many long conversations we have had before about the topics mentioned above.  Somewhere along the line, my health kinda got pushed out of the picture to make space for his drug pushing and my drug pulling. Dangerous as it is that the Doc was trying to give me drugs I knew I didnt need and I was trying to get drugs he knew I didnt need, I really didnt mind because I was the one who had initiated our little monthly 'checkups' where I usually end up with 2 or 3 scrips. So it all works out for both of us, Doc got to pawn off some rather expensive(98$ for 30 pills!, cut down to $25 after copay), trendy meds(SONATA)with no generic counterpart, which by the way are the ones that get doctors 'kickbacks,' and I got the meds I wanted to experiment with without the hassle and danger of the black market.",
  "All in all, Sonata is a rather fun, seemingly harmless little chem when taken against indication. I have yet to actually try the SONATA for its prescribed purpose, but probably will eventually."
 ],
 "erowid": {
  "id": "38788",
  "citation": " Dumb Luck. \"New Trials: experience with Zaleplon (Sonata) (ID 38788)\". Erowid.org. May 26, 2006. erowid.org/exp/38788",
  "substance": "Zaleplon (Sonata)",
  "views": "16574"
 }
}
