{
 "id": 6545,
 "title": "4+ Hours to Kick In",
 "date": {
  "submission": "2008-03-04T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "ColoradoTripper",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(capsule)"
  }
 ],
 "report": [
  "So, first of all im an 18 year old high school student and I live in Denver, CO.  Last Friday I was headed to Phoenix for a seminar for the weekend.  I had a 1:00 pm flight and got to the airport at around 11:30 am.  I had recently got a capsule with 10 mg of what I thought was 2c-b but was actually 2c-t-7.  I took the pill on a semi-full stomach at around 11:30.  Got on the plane at 1 feeling totally normal.  I dozed on and off during the 2 hour flight and landed at around 3 pm.  I got up and felt absolutely nothing.  I called my friend who I had purchased the pill from and he said just smoke some chronic.  So I got to my hotel room at around 3:30 pm.  I immediately smoked a bowl of some pretty heady pot.  I called my friend back and told him that I just felt really really stoned.  Probably about 40 minutes later I started tripping my balls off.  The world was breathing and spiraling out of control.  It really seemed like a nice mushroom trip but with some subtle differences.  I'd think to myself, wow Im actually tripping, and then forget I was tripping and than I would realize it all over again.  It definately wasnt an overwhelming experience by any means.  I didnt really feel any mood lift or euphoria, just visuals.  I tripped hard until about 12 am. ",
  "For the most part, it was an enjoyable experience, I was just amazed that it took 4 hours to kick in and only after I smoked a bowl.  I tried to go to sleep about 1 and tossed and turned all night having some crazy trippy thoughts.  I had a bit of cramping throughout the night in my stomach and no nausea.  The next morning I woke up a bit tired at 7:30 am but with no terrible side effects.  As the day went on I got some energy and felt fine. ",
  "Nice subtle drug at 10 mg, going to try 20 mg on friday."
 ],
 "erowid": {
  "id": "38795",
  "citation": " ColoradoTripper. \"4+ Hours to Kick In: experience with 2C-T-7 (ID 38795)\". Erowid.org. Mar 4, 2008. erowid.org/exp/38795",
  "substance": "2C-T-7",
  "views": "3380"
 }
}
