{
 "title": "Diabetes: Not a Contraindication?",
 "author": "Jack Daniels",
 "citation": " Jack Daniels. \"Diabetes: Not a Contraindication?: experience with MDMA & Isophane Insulin (ID 65455)\". Erowid.org. Sep 4, 2007. erowid.org/exp/65455",
 "substance": "MDMA & Isophane Insulin",
 "bodyweight": "57 kg",
 "report": "<p>Throughout my teenage years, I resisted the temptation to experiment with MDMA/Ecstacy, despite the fact that several of my close friends were taking it fairly regularly with no ill-effects.  This was because, as a Type-1 diabetic (i.e. my condition is treated with regular, subcutaneous injections of insulin), I felt that it would be unwise for me to take a powerful stimulant that would affect my blood-glucose concentration level, when I had no idea what these effects might be.  I was happy enough then with a bit of skunk/hash and a few beers, I did mushrooms occasionally (which invariably caused massive hyperglaecimia, one reason why I stay away from psychedelics these days).</p><p>The real problem for people in my position is the lack of articles, experiences, research and advice about the effects of recreational drugs on diabetic people.  The Authorities continually pump out guidelines for people who are going to get high despite the Official Disapproval, but despite spending ages surfing the Internerd I could uncover NOTHING useful about the effects of MDMA on diabetes.  There was a medical forum somewhere in which  a user posted something along the lines of: 'I'm diabetic.  I'm gonna do MDMA.  I don't want to hear 'Just don't do it', I want all you doctors and medics on here to advise me if I am at risk of any special complications.'  Of course, the poor dude just got a load of 'You shouldn't do MDMA, it's illegal/dangerous/sinful'. </p><p>So I left it.  But then, a few years later, I snorted a bit of a crushed Ecstacy pill at a party, and found no negative effects either psychologically or physiologically.  So I got hold of about 3/4 gram of MDMA powder, and decided to see what effects it would have.</p><p>So, for all you people who have typed 'MDMA diabetes effects risks contra-indicators' into Google and ended up here, I thought Id write down my experiences with this drug and this condition.  My friends X, Y and myself had been drinking all day, had a big pot of pasta and tomatoes for dinner, and then had gone to a birthday party, where we drank some more and smoked shisha (not with dope mind, just apple molasses, mmmm.).  We got home around 1:30am (even then we werent properly drunk, maybe a little tipsy), put some music on, and decided to do the MDMA I had.  I took my basal (background) insulin dose -- 0.28ml -- (I take two types of insulin, 1 fast-acting before each meal and 1 basal or slow-release before I go to bed to counterbalance slow glucose release from my liver whilst I sleep) and then we started snorting the MDMA in lines.  I took slightly smaller lines than my friends, I thought this a sensible precaution.  We took about 4 lines each over the course of 3 or 4 hours.</p><p>We all had a wicked night, listening to George Clinton and Jimi Hendrix extremely loudly, talking all night, watching the sunrise while listening to Godspeed You! Black Emperor.  No sleep until about 11am.  I remember feeling utterly alive, really really happy, loving the music and dancing, and that my thoughts seemed streamlined and very lucid.  All the typical stuff really, physical contact = amazingly good sensations, my impulsiveness skyrockets, smoking cigarettes is suddenly REALLY enjoyable, beer tastes great (cos of the awful MDMA taste in my throat).  We danced on the hill overlooking our city while the morning broke over the sea, feeling so joyous, it really was fantastic.</p><p>The ill-effects: none that I noticed.  I dont think there is a heightened risk of MDMA use to diabetic people.  Ive done it twice since and had nothing negative either time.</p><p>My idea is to just be sensible, have something carbohydrate-rich like pasta  or rice before I start, if I'm gonna go out dancing then take glucose tablets or something like that with me in case of hypoglaecimia.  I think there could be a risk of hypoglaecimia because MDMA gives a tremendous feeling of energy regardless of whether my body has that chemical energy or not, so one could dance for ages and possibly not notice your blood sugar level start to fall.</p><p>Summary:  MDMA is, in my limited experience, as safe for diabetics as for everyone else.  There seem to be no extra or unexpected effects.  Next time I do it I will try to remember to take readings of my blood glucose levels regularly, to get a more quantitative picture.</p>",
 "year": "2007",
 "id": "65455",
 "gender": "Male",
 "timestamp": "2007-09-04T07:00:00.000Z",
 "views": "6795",
 "dose": [
  {
   "time": "0",
   "amount": "4 lines",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  }
 ]
}
