{
 "title": "Uncomfortable Dehydration & Vascular Effect",
 "author": "Ramiro",
 "citation": " Ramiro. \"Uncomfortable Dehydration & Vascular Effect: experience with Lactuca spp. (ID 65481)\". Erowid.org. Nov 6, 2007. erowid.org/exp/65481",
 "substance": "Lactuca spp.",
 "bodyweight": "60 kg",
 "report": [
  "<p>I started out by picking a whole garbagesack full of wild lettuce from Suomenlinna, Helsinki. I made it to my home the same night and ate some sixty seeds, but no effect was felt.",
  "The next day I smoked some wild lettuce's flowers with a friend of mine from a bong, and felt a mildly sedative effect. However, something more powerful was on it's way.",
  "At night, I cooked about six plants with 3 litres of water. I let it be for an hour or a half, cool down, and then I started to drink. I never ended up drinking more than half of the tea. It is interesting to note that I never processed the plants in any way whatsoever. It is possible that this was the reason the experience turned out to be so toxic.",
  "After 30 minutes or so my mouth started drying up. First a little, but gradually I ended up finding myself more dehydrated than all of Sahara. At the same time a funny drunkenness (as reported in other trip reports) came in. In an hour or so I was dry and hot like hell, especially in my head.",
  "I started noticing that my mind was going somewhere. Then I closed my eyes for the first time, and man, what happened. I saw people around my house. I was in fact empty, but there they all were, doing whatever. It's funny, because actually I was kind of aware that I'm tripping, but yet I spoke to these people if they asked me something. I didn't know anyone of them.",
  "What occurred to me as shocking about the experience was, that my blood started flowing to my head, hands and feet and packing up there. That was really scary. Also the dryness. The dryness was absolute. I was very strongly dehydrated, and it felt extremely uncomfortable.",
  "My mother told me the same thing happened to her when she ate psilocybe-mushrooms in the 90s. Blood packing up into the body. Like she, I was really freaked by this.",
  "All in all, the experience was interesting, but more like a curiosity. I didn't enter the cosmic void, I had no psychedelic mandala-like visuals, only hallucinations of people in my house.",
  "I highly recommend to watch out with this stuff, because to me it felt like poison, more than LSD or other non-toxic substances. The dehydration and the blood packing up made the experience as startling as it was entertaining.",
  "Thank you for heeding the warning.",
  "Aum</p>"
 ],
 "year": "2007",
 "id": "65481",
 "gender": "Male",
 "views": "11115",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Lactuca spp.",
   "form": "(tea)"
  }
 ],
 "submissionDate": "2007-11-06T08:00:00.000Z"
}
