{
 "title": "More Than I Bargained For",
 "author": "Rhino",
 "citation": " Rhino. \"More Than I Bargained For: experience with Salvia divinorum (ID 6553)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6553",
 "substance": "Salvia divinorum",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "smoked",
  "Salvia divinorum",
  "(extract - 5x)"
 ],
 "report": "<p>This was my first time. </p><p>I was self assured and confident that I could handle it well since I have engaged in the entheogenic use of most other known hallucinogens without too much difficulty.  I consider myself to be a person of maturity, psychological strength and spiritual depth.  Because of my experience in such matters, I usually make it a point to caution others not to do as much as I do.  I am in good health and physically fit.  I am comfortable with ambiguity.  I have a background in philosophy, religion and psychology (including years as a Gestalt group leader).  I felt totally prepared.</p><p>My wife and I had just returned home from the movies, nothing heavy, just Bridget Joness Diary.   The Salvia had just arrived in the mail.  I had ordered the high potency leaves because, well, you know.  Anyway, I cleaned out my water pipe, which I call the cannon.   It is the best pipe I have ever used.  You can totally fill both lungs with cool smoke without any drag or effort. </p><p>I remembered the warning to have a sitter with you because some people may be prone to walk around in a stupor when they use it so I asked my wife to sit with me.  She was about to take a shower and I felt a little silly asking her to stop and baby-sit me.  I told her it should only take a few minutes and for her to go on about her business if I didnt get up and start walking around.</p><p>Since this was the first time for me to use this substance, I only took two hits.  But they were big ones.  My biggest concern was that nothing would happen.</p><p>It only took about thirty seconds after the second hit that I started feeling an electric tingle on my skin and in my hands and feet.  I told my wife, I feel electricity all over my body.  I heard a distant, vaguely familiar voice reply, electricity?  </p><p>Immediately the electrical current became much stronger.  It was pulling my muscles and distorting my face (I thought).  My wife later reported that she did not notice any facial or muscular distortion.  Then my body began to dissipate into little red and green and yellow balls that looked like the inside of a Contact capsule.  These tiny balls began to melt through the back of my body into another universe totally unconnected with this one. It was as though the front of my body was the border between this reality and the universe I was melting into. </p><p>I struggled against the electricity to hold my energy in the front of my body so that I would not be swept violently and completely out of this world and into that Jungian archetypical, wet paint universe of primordial jungle ooze, witch spirits and fear that was pulling me.  I could not see anything around me.  I was only aware of my distorted face, the only part of me left in this world and it was crying out for help.  I had to keep energy in the front of my body or I would be lost.</p><p>My wife reported that I was saying help me, help me, this is not my life.  Then I began to get up and stumble around.  I remember I thought that moving forward would keep me in the front of my body and, consequently, in this world.  My wife held my hand and tried to get me to sit on the bed.  I have no memory of this.  She says I asked her where am I...who am I.  I was mostly in the other world by this time, pulsing back and forth between, and when I was there neither this world nor I existed. </p><p>She tried to answer my questions.  She says I asked: who are you? and what is happening? and help me, help me.  The electrical pull was rather uncomfortable, even painful.  She says I asked her to take me to the hospital, which she knows is not like me at all.  She has always known me to be a tower of strength and composure no matter what.  And she knows how I feel about taking someone on hallucinogens to the hospital.  Its the doctors that kill you, not the substance. She started walking me toward the garage.  I asked: where are we going?  She said: to the hospital.  I said: no and stumbled back to the bedroom.  I have no memory of this either.</p><p>Back in the bedroom, I sat down.  It was as though the reality of this world were two-dimensional like a T.V. screen and I was pulled off of it by a magnetic force into Nothingness.  And the Nothingness was real, and the realness I had known was nothing and had never been.  A curtain had been lifted and I was not at all comfortable with it.  I heard a sound.  It was my wifes voice, but I did not recognize it.  Gradually things began to come into focus, but they had no meaning.  They just were. </p><p>She asked me: Who are your parents?  I gave their names.  Who is your business partner?  What is that? I asked.   I didnt know what a business partner was.</p><p>Within five minutes, I was completely reoriented and the only sensation left was a sort of mental flavor, the spell that comes after, and lingering fear.  My heart was pounding.   My clothes were wet with sweat and my shoes were full of sweat.  I was a little weak.  All I could do was stare straight ahead and feel grateful I was home.  I felt that I was reassembling, rebooting, so to speak.  I felt like what I would imagine my computer feels like when I hit the restart button. </p><p>My wife reports that I was drooling during the episode and that my speech was slurred and my motor skills impaired.  The entire thing from start to finish lasted only about ten minutes.  </p><p>Usually I always experience some sense of the presence of God.  Not this time.  I remember feeling the presence of witch spirits and things that are not gentle, even violent and primitive.  I felt I was in the realm of sorcerers, jungle magic, demons and something bigger than I had ever experienced before.  I dont even believe in that sort of evil spirit stuff.  Not objectively, anyway.</p><p>I told myself that I would never do this again.  That was eighteen hours ago.  Im already thinking about doing it again.  I have never been so totally lost, not even on the potent LSD available during the 60s or on 2CT7, which has only recently come to my attention. This is potent stuff and absolutely not for recreation or parties.  I am thankful for its short duration. I can see its value and appreciate its dangers. I am accustomed to thinking and to traveling outside of the box, but Salvia put me in a place where there is no box, never was a box.  I have had to reassess everything.  Im still thinking about it.</p>",
 "year": "2001",
 "id": "6553",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-28T08:00:00.000Z",
 "views": "53156",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
