{
 "id": 6557,
 "title": "My Body is a Bomb",
 "date": {
  "submission": "2007-05-10T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Atreyu",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 5x"
  },
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Ive tried salvia a few times before and always had interesting results.  About five months had passed since my last salvia trip.  Anyways I ordered 4 grams of 5x and received the package a few weeks later.  That day I fasted, and meditated to prepare myself.  I rode my bike out to a remote location in the woods and packed a bowl.  Three hits later and the only result was a burnt out feeling.  I tried one more hit, but it only added to my headache, so I headed home.  The next day I decided to try again, but from a separate package.  Each gram came in a separate package.  Again, three hits later and I was only left with a burnt out feeling.",
  "The next weekend came and I decided to try again; same results.  By now I must have had more than a gram of salvia built up in my system.  That same night my brother invited me to smoke marijuana with him.  I was feeling burnt out but I decided to smoke with him anyways.  I took two hits from the bong and the trip began.",
  "It came on fast, I felt sick because everything was so overwhelming.  There were five other people in the room, all carrying on conversations but I could only mumble out single syllables.  My body felt like a lightning rod, everything around me was fantasy.  I could feel the individual tones that made up each persons voices.  My brain was on turbo mode, and in pain.  My body began to tremble, so I made a retreat into my bedroom.  Laying in bed with covers over me, I focused on slowing my heart rate down.  But my body continued to shake and my heart was beating even faster.",
  "That was when a major heart artery, obviously under too much stress, snapped off.  Internal bleeding began filling my chest and it was becoming hard to swallow, difficult to breathe.  My limbs were heavy, and I realized that it was too late to call for help.  My body began to convulse, fire was burning me from below.  I let go and a feeling of peace came over me.  A light materialized in front of me, the more I let go of my life, the brighter it became.  The light was made up of individual squares, each had their own characteristics.  They were far apart at first, but multiplied and drew closer together as I accepted death.  I felt like I was flying through them.  At the same time, my brother was aware of what had happened to me, I could hear him crying in the room across the hall.  I could hear his friends wondering what to do next.  I was still lying in the same spot, but I had the distinct feeling that I was laying inside of a body that was no longer connected to me.  I tried to forget and move on to whatever waited, but my feelings for my brother overwhelmed me.  I got up, and it surprised me that I still had to open the door.",
  "When I got out into the hall, I was greeted by one of my brothers friends.  Turned out nothing was really happening out there, it was all in my head. After telling the story, I went back to bed.  I was still tripping.  My body felt like it was home to millions of entities, and it was their paradise to live in.  They were responsible for keeping my body alive, and part of their job was to dispose of anything they found harmful.  After removing one harmful entity, they even joked around by adding in a wink.",
  "Recovering from this trip was a long road.  The next week my brain was literally covered in burning sparks.  Hunger became a powerfully sickening feeling.  The right side of my head was numb for a month.  My heartbeat changed to a frightening irregular beat.  Some nights I was convinced it would stop all together.  Sleeping was impossible; I could only make it through the nights by wandering.  It was a feeling of pure stress that pulsed through my body, its presence COULD NOT go ignored.  This lasted about two months.  It has been just over three months now, and Im finally feeling healthy again."
 ],
 "erowid": {
  "id": "38867",
  "citation": " Atreyu. \"My Body is a Bomb: experience with Salvia divinorum & Cannabis (ID 38867)\". Erowid.org. May 10, 2007. erowid.org/exp/38867",
  "substance": "Salvia divinorum & Cannabis",
  "views": "9542"
 }
}
