{
 "title": "Ewige Blumenkraft with Morning Glories",
 "author": "Aetheros",
 "citation": " Aetheros. \"Ewige Blumenkraft with Morning Glories: experience with Morning Glory & Cannabis (ID 65618)\". Erowid.org. Apr 28, 2012. erowid.org/exp/65618",
 "substance": "Morning Glory & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Morning Glory",
   "(ground / crushed)",
   "",
   "1/2 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "350 mg",
   "oral",
   "Morning Glory",
   "(ground / crushed)",
   "",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>1st Experience</p><p>After reading several reports of Morning Glories, I decided to test them for myself.  I bought an untreated pack of 3600 seeds, sectioned them into eight portions of 300, ground them in a coffee grinder, and gave seven of the portions to my friends.  I told them to put the seeds in applesauce or yogurt and eat it directly.  When I checked back with them they all said they only took a third of a portion (while smoking as well) and experienced a great time similar to half an eighth of mushrooms.  One night I decided to take their dosage with two of my friends and we split a container of 300 seeds three ways (each of us getting 100 seeds).  We smoked two bowls and then waited.</p><p>About 30 minutes into the trip I noticed that my 'high' had become unusual.  I began hearing low level humming and experiencing mild stomach cramps.  The irresistible urge to smile set in and I knew the beginnings of the trip had started.  My friends and I seemed to delineate in our conversation from general cultural topics to social/spiritual growth of individuals and humanity (this isn't so unusual for my friends, we are all pseudo philosophers).</p><p>I found that the muscles in my body had been going through brief spasms after I attempted to stand up.  I was sore in my legs and my abdominal region.  The spasms didn't cease until I had walked around for a bit.  We decided to go for a walk and found ourselves in the park.  More spiritual discussion ensued until we reached a trail leading to a forest preserve that had a reputation for being a dangerous place at night (muggers and bears, apparently).  I pleaded with my friends to go in but they refused.  After this we walked back to the house and ate sour patch kids (always a good choice for any hallucinogen).</p><p>My friends decided to sleep but I was restless.  I tried to lay on the couch and still my mind but found my internal dialogue focusing on areas of my life I was unhappy with.  Now, I'm the kind of person with the mental discipline to have a good time under duress, so I allowed myself to focus on these 'thought forms' (if you will) and came to very peaceful conclusions to change the way I had previously lived.  After a time, the dialogue ceased and I noticed the room was pulsating slowly.  I stood up and felt the floor shift, it was similar to being on a waterbed.</p><p>I went to the bathroom and found I couldn't break my gaze from the mirror.  I was entranced with the image before me, sure that it was the me I wanted to be (stronger, more jovial, and much more prone to wildness).  Looking back I could say I was seeing an aspect of myself as Cernunnos/Baphomet. </p><p>Feeling especially mischievious, I turned off the lights in the bathroom and continued to stare.  I felt a surge of sexual arousal and prowess looking into the image, it seemed to flood my entire being.  I finally mustered the courage to try and touch the glass of the mirror (I'd like to note that I've always held the frightful myth of the 'Bloody Mary' in the mirror).  When I moved closer, the 'double' moved with me but at a slightly slower pace.  My finger brushed the glass and I looked into eyes of the 'double'.  He looked back at me then moved his eyes to the left.  I yelled in excitement and fright and ran out of the bathroom to the comfort of a blanket over my head (yes, just like a kid with monsters under the bed) and fell asleep.</p><p>Note: the remaining seeds from the pack that I bought were scattered around the woods near my house.  I would not recommend doing this since Morning Glories are an invasive plant.  Tempting though it may be to spread hallucinogenic wonder throughout the wild, don't do it!</p><p>2nd Experience:</p><p>Having bought a larger pack (7200 seeds), I repeated my initial exercise, only this time attempting an extraction method with Bacardi 151.  I separated eight doses of 350-400, ground them, and put them into bottles with 151.  My friend and I were impatient to try them so in the midafternoon we ground two more piles of 350 and 250  (with me taking 350) and ate them with yogurt.  The yogurt was unpleasant with the graininess of the seeds and I kept attempting to chew (not a good idea, let me tell you).  We smoked a bowl apiece and waited.</p><p>30 minutes had passed and nothing really happened so we decided to take a walk in the woods near his house.  I had been reading the series of books authored by Carlos Castaneda so I was of course attempting to 'stop the world'.  At the beginning of the trail, I found a walking stick that seemed almost placed there for my benefit.  I took that as both a sign that others found this trail special, leaving a communal tool to traverse it, and that this walk was specifically 'for me'.  On our path we found that many side trails were blocked by spiderwebs which I took as an omen to not enter.  We walked a circular trail and I began to feel the cramps and the smileys.  I noticed that my body had become extraordinarily heavy and with only the most diligent concentration was I able to put one foot in front of the other.  Muscle spasms began happening but in a manner that wasn't too intrusive to my ability to walk.</p><p>Then, in the middle of the trail, my thoughts cleared and I began hearing a series of shrill bird-calls.  There seemed to be a pattern to them that was unusual for the birds (Blue-Jays and Crows), almost as if they were calling out a specific song.</p><p>As we continued walking I felt the distinct impression that I was being watched from several sides.  Unsure of whether or not it was my imagination or an actual entity (or ally if you will) I slowed my pace to check the surroundings.  Trees began taking on grotesquely beautiful forms (witches, disembodied hands, wolves, etc) out of the corner of my eye and when I would look directly at them, the image would sustain for a moment, then fade into 'reality'.  We had nearly completed the loop and the so-called bird calls came back into focus.  They suddenly seemed angry and I got the distinct impression that they (whatever they were) did not want me to leave.  Rather than freaking out at this sudden display of possessiveness, I resolved to steadily leave the trail.  The calls became more aggressive and much closer.  Finally, we left the trail and went back to the house.</p><p>My friend and I made a half-hearted attempt at eating but couldn't really get into the taste of the food (it's such a shame that good healthy food isn't as palatable in a hallucinogenic state as opposed to junk food).  We played Soul Calibur II for a while then watched Fantasia 2000 (not as fun as one would think).  I was in the peak of my trip and looked up at the ceiling.  Not only was the ceiling rippling heavily but there were also giant translucent spiders climbing around.  They were quite beautiful (and I'm very afraid of spiders) with long spindly legs and a pulsating neon center.  When the lurking fear of spiders set in, a strange thing happened: my stomach (around the diaphragm area) gave a terrific lurch and they disappeared.  Remembering the description and location of 'will' in the Castaneda books, I felt that I had succeeded in utilizing my will to banish/block out the spiders.</p><p>The sun was just setting (red and gold) and we decided to go outside to watch it.  There were storm clouds on the horizon that were moving in time with the setting so at the last ray of light, the storm clouds moved in completely.  It was still warm and dry so we sat on the grass.  Again, I felt another surge of intense sexual excitement, so much so that I trembled throughout my body.  As the embarassment of arousal was beginning to form in my mind, it began raining.  My friend jumped up and headed for the house, but I yelled that he should stay.  He sat down again and the rain continued, lightly at first, then increasingly heavier.  I looked up and noticed the clouds were swirling in a sort of tornado just above my stomach in the same area I had felt that peculiar lurch.  The lurch happened again and I felt afraid of that cloud formation.  I tried to get up but had no control of my body.  A delirious and giddy panic set in and I tried to convince myself that I could stand.  The lurch happened once more and I found myself standing.  I walked into the house.</p><p>At this point we tried to watch Throne of Blood (a Kurosawa classic) but I found that I couldn't focus due to the pulsating of low level noise (it sounded exactly like Gregorian chanting) and my own frustration at my sexual excitement.  Not wanting to be around my friend anymore (lest we do something that he might regret in the morning) I said goodbye to him after the storm ceased.  I walked back home with a relatively clear head and went to sleep.  Noting the time before I slept, I realized that the trip lasted 12 hours.  The time seemed to fly by.</p><p>Afterword:</p><p>I will of course be documenting my third trip with Morning Glories via the 151 extraction method.  I'm not sure of the exact science to tinctures and the like so It will be interesting.  I'd also like to comment on the phenomena of sexual arousal.  After talking with some of the other people I gave the batch to (from the first experience) I found that there were only a few people who experienced the same arousal.  Our commonalities were based in the zodiac (Taurus, Aries [me], Scorpio, and Capricorn (Aquarius cusp) and in our sexual expression: mild bisexuality (Taurus and Capriquarius), 'perfect bisexuality' (Scorpio) and homosexuality (Aries).  These four signs are affiliated with sex in some way.  Given that astrology is an inexact (and some also feel pseudo) science, I wouldn't make a statement saying that the sexual excitation/power is linked with those signs alone, but it is an interesting correlation.  I encourage others to further study the nature of this anomaly.  Kundalini, Tantra, and Sex Magick (Crowleyan and Chaos) would seem to be the means to study this.</p>",
 "year": "2007",
 "id": "65618",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-04-28T07:00:00.000Z",
 "views": "6573"
}
