{
 "title": "A Thunderstorm in Every Reality",
 "author": "Calvinmyhobbes",
 "citation": " Calvinmyhobbes. \"A Thunderstorm in Every Reality: experience with DOI (ID 65622)\". Erowid.org. Sep 29, 2008. erowid.org/exp/65622",
 "substance": "DOI",
 "bodyweight": "175 lb",
 "report": "<p>[Erowid Note: This report is marked as a DOI report, but readers should be aware there are aspects of it that suggest the identification is speculative.]</p><p>On the 4th of July this past summer my friends and I obtained 10 tabs of what we were told by our dealer and thought was LSD. all my friends but me did it that night and I sat for them. They all acted very strange for hours, I could go into detail about that night, but I am here to tell you about my experience.</p><p>I had never done LSD, or 2-Ci, and had never even heard of DOI, neither had any of my friends either, so we didnt have anyone who could compare their trips to LSD and state that we were not dealing with LSD, but with an unknown substance. About a week after my friends had all tripped I got home from work at about 4pm and took one tab, I was by myself and I called my friends to tell them that I was going to take a tab, and I would like to hang out with them if possible. None of them could though, so I got on my bike and started riding. I didn't have a destination, but it was a beautiful day and I live in Daytona Beach, so I decided to go to the beach. My mindset going into this was that I knew that I am very comfortable with myself mentally, and I knew that if things started getting crazy, I could just tell myself it would end and everything would be back to normal in a few hours. So I wasnt worried at all.</p><p>The first visual effects started showing up after about 45 mins to an hour, which I thought was very strange. I was on top of the bridge over the river and it looked like the river was flowing very swiftly like a stream below me. There was a huge boat going under the bridge and it looked to me like it was trying to fight the current and was having a hard time getting anywhere against such a force (I later concluded that it was actually just moving very slowly because of the engine, not the river).</p><p>Before I got to the beach, I stopped into a pharmacy and bought some tea, all the people in there were extremely strange looking to me, and all I could concentrate on was how ape like they all looked, and how different each person looks from one another, it was like different species of human. The Chinese woman in front of me in line was exceedingly strange looking to my altered brain. By this time I was starting to feel very strange physically, like I had a bunch of energy in my body that couldnt get out, but it felt very nice in my legs like smoking a lot of marijuana and getting that pleasant feeling, only without the grogginess of extreme highness and lots of energy.</p><p>Finally I got to the beach it was about 2 hours into my trip, I walked away from all the people and sat down on the sand feeling tremendously good, and looked out across the water and watched some pelicans and an osprey hunt fish. I was doing a lot of smiling however the visual effects were not very pronounced, which I thought was weird, because it had been over 2 hours. I was just getting a sort of wavy aura in my vision that rippled the sky, colors were very vibrant too.</p><p>I noticed a breeze was starting to pick up and I looked south, and much my chagrin I saw a giant thunderstorm coming my way, having no way of escaping it, I went through my options and decided that I would bury myself in sand and weather out the storm in a sand cocoon. Let me assure you that I have never before had any urge to do something like this, but it seemed like a good thing to do at the time.</p><p>Everyone else slowly left the beach and I dug out a cavity in the sand, I laid down and started to cover myself. At the same time I was comparing the coming thunderstorm with the actual start of my trip, for I hadnt really started tripping (things were most definitely different, nothing mindblowing though), but my friends had told me it had taken hours for their trips to really start, and they had lasted 24 hours, so I wasnt really worried that I wasnt going to really trip. I had lost all sense of time, and had stashed my stuff in some rocks so they wouldnt get wet when it rained, so I had no way of telling what time it actually was.</p><p>The wind started to pick up and the thunderheads got closer, and I realized that the pathetic amount of sand I had covered myself with was going to leave me very wet and cold by the end of this, my trip was also coming up and getting more intense by the minute too, and I compared my sand barrier to my mind and realized I was prepared for neither the height of my trip or the storm. I dug myself in deeper in the sand, and built up what felt like an actual brick wall in my head against the LSD, again I turned around and the thunderheads had gotten bigger, and I got that same sense of unpreparedness, I covered myself more and by the time the storm actually hit, I was the most prepared person ever.</p><p>The only thing exposed was my head, and the wind was hitting the back of it so I could keep my eyes open without getting sand in them. It poured, and there was lots of lightning, very intense, I was laying so that as the storm passed me, it would come into my vision. When lightning would strike, which it did often it would light up the sky and then I would  get rainbow flashes directly afterwards, as if the lightning was lighting up the sky with the full spectrum of colors. At one point, I looked up and thought that if the clouds had opened up and a shining light had engulfed me, I would not have been surprised. Of course it didnt, and I was rather thankful, because that would have been exceedingly crazy.</p><p>After the height of the storm had passed, it was still raining, but pretty lightly, I got up and walked back and got my stuff. I was not cold in the least bit, and felt like maybe my internal body temperature had been raised slightly. I called my friend who was off of work, and he came and picked me up. It had been about 5 hours since I had taken the tab and I was feeling fine, the visual effects were getting much more pronounced, everything was waving, and water was flowing at what looked like astonishing speeds.</p><p>When my friend picked me up we listened to some music. It was either hit or miss, my mind hated some sounds and songs, but loved others. He had some marijuana, so we loaded a bowl of that and smoked it. I think that made me feel physically relaxed, and maybe made the visuals more pronounced. We talked about his trip and compared and contrasted it to mine. He had taken more than me, and his had been a lot more intense, and the come up had been much quicker for him. He took three tabs and was getting full visuals within 15 mins of taking it.</p><p>We thought of things to do, and he decided that we would go to this cave that he had found in high school walking along the river looking for places to smoke. I was intrigued by the fact that there was a cave, in Daytona beach, which most definitely has no caves. So we went there, it was behind an abandoned bowling alley along the rivers edge. The hurricanes that had hit here a few years ago had washed away the seawall and made a secluded cave that was turned out to be really interesting, compared to anything I was expecting.</p><p>We smoked and looked out across the water, downtown Daytona was on the other side, and it looked like the city was pulsing to my eyes, the water was completely calm and the night was beautiful. We left there, and stopped by my house, I got a fresh change of clothes, and took a shower.</p><p>THEN, I decided it might be a good idea to take another half tab, because even though my day had been crazy, I felt like, I hadnt really broken that barrier of what my friends had done the other night. So I did, I knew it was probably a bad decision, mostly because this was my first time doing LSD and I should probably play it safe, but I didnt. I took another half tab. My friends drove me over to their house and we started watching Raging Bull. Watching a movie was awesome, my mind had been so all over the place all day that just having all my senses focused on the movie was really nice. I watched the movie from about five different perspectives it seemed like, very strange. I realized the movie was completely different about three quarters of the way through, confused the heck out of me for a little while, then I just accepted it as simply an interesting occurrence. Eventually my friends got tired and I decided to go home.</p><p>We got stopped by the police on the way back for not having the headlights on, I got pretty nervous until I found out my friend wasnt going to get a DUI (he had drank about 4 beers). [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  I got home, and assured my friend I would be alright and he left.</p><p>The visuals at this point were very intense, and my mind would get lost in strange thoughts that would be triggered by memories and seeing things. Shadows moved about on their own for no apparent reason, and things like blinds seemed like they were opening and closing on their own. I went and laid down on my bed. I felt like there was zero chance I could go to sleep. When I tried I would start getting intense close eyed hallucinations. At points, I would open my eyes and realize in complete astonishment that I was the only one in the room. Voices and characters would manifest themselves in my mind. Everything was very strange.</p><p>I tried listening to music, I had it on random, a wide, yet very selective bunch of music appealed to my mind, I listened to Pink Floyd for the first time in my life, Brain damage, Shine on you Crazy Diamond, and Comfortably Numb were perhaps some of the greatest songs I had ever heard in my life. Some of the other songs that particularly amazed my mind, were Sweet Dreams are made of This (Annie Lennox), Everything in its right place (Radiohead), and the end of the song Yummy, by Gwen Stefani (It was on random).  For the rest of the night I altered between, intense closed eyed hallucinations, listening to music, watching select scenes from X-Men 3 and just thinking about how crazy this all was. Eventually I think I fell into a dreamless sleep for about an hour out of what seemed like extreme mental and physical exhaustion.</p><p>The whole next day I felt really different, yet very pleased and generally great. Nothing was rippling or anything anymore. For the next 2 months the whole world felt extremely nice, and I couldnt have been happier, I have never felt like that before. My other friends that had taken it felt a lot different after their trips a couple said that they felt more separated from the world for a while. It was all very intense, and I felt like maybe the LSD we got was different somehow, more powerful than regular LSD.</p><p>I knew I would do it again after that night, just because I had felt so great at some points, and at very select times, I felt like I was getting giant waves of euphoria, triggered by a thought, realization, or music. That was another thing, it felt like I would get waves of visuals, sometimes, I would get psychedelic trails, then I would get wavy effects, then shadows would go crazy, then it would seem like I was looking through a screen or seeing two images of the world overlapping each other.</p><p>At this point, I still thought it was LSD, and went on to have other trips thinking it was LSD again.</p>",
 "year": "2007",
 "id": "65622",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-29T07:00:00.000Z",
 "views": "7039",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "DOI",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": "",
   "amount": "0.5 hits",
   "administration": "oral",
   "substance": "DOI",
   "form": "(blotter / tab)"
  }
 }
}
