{
 "title": "My Magical Journey",
 "author": "Apfluxx",
 "citation": " Apfluxx. \"My Magical Journey: experience with Mushrooms (ID 65709)\". Erowid.org. Oct 14, 2010. erowid.org/exp/65709",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " T+ 1:30",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>I have wanted to try psychedelic substances for a while. Once my friend's boyfriend (who is a dealer) got a hold of mushrooms, he sold me a 1/8 ounce for $35 which seemed to be a reasonable price.</p><p>It was about 12 PM on a Sunday and I invited a few people over to watch me as I went on my 'journey.' No one else was willing to try the drugs with me so I was the only one tripping. I first ate half of the 1/8 ounce bag of shrooms (which really didn't taste that bad so I don't know why people say they do) After an hour of nothing happening (probably because I had eaten breakfast prior to eating the shrooms), we went for a ride to drop somebody off at their house and by then I was feeling really queasy. I already get car sick a lot but the shrooms in my stomach made it worse. Then my knees started feeling all tingly and I started laughing a lot, but still I wasn't seeing things.</p><p>I got back to my house where I ate the rest of the bag and watched more videos. Still... nothing happening, and it's been at least 2 hours by now.</p><p>At approximately 3 PM, the three of us decided to go for a walk to the park behind an elementary school. Then it started raining and storming which was PERFECT and exactly how I wanted my trip to go. At first I felt as light as a feather and was floating through the air. Patterns started forming in the grass and the trees. My jaw kept tightening and could barely talk, so I was generally silent throughout my trip. It felt weird later on during the trip when I wanted to eat and drink something. I was taking little bites of my food because of all the muscle tension I had in my jaw. I remember also shaking quite a lot, but maybe that was just out of nervousness, I don't know.</p><p>The sound of the rain, the thunder rolling in the sky, the green trees and grass... EVERYTHING came alive and I felt like I was in a jungle. I was so excited. *D* noticed that my eyes were dilating so much that they almost turned completely black. By then I knew there was no turning back to reality for a while.</p><p>Everything started turning colors and was more intensified, but little did I know this was just the beginning of my trip. All of the plants and trees morphed into kaleidoscopic patterns that I felt I was staring at for hours and hours. I remember looking at these clutter of clovers on the grass and they morphed into patterns that soon took over the concrete. By then the patterns which looked exactly like kaleidoscopes started rising from the ground and I felt like I was getting shorter and sinking into the ground. I looked over at my friend and at this point she had four eyes and a discolored face. I wasn't scared of it.... a little nervous, but not scared because everything was too beautiful to be scared of it. I kept telling myself that it was only the drug that was doing it to me, even though everything looked as if it WAS real.</p><p>I was running through the grass and under the trees and into the rain just laughing and enjoying my peak. I felt like I was a child of nature. I think shrooms really helped bring out my inner-child that I knew was in me somewhere. It was great and just what I had wanted.</p><p>We stayed at the park for what seemed like the longest time because I kept getting lost in the kaleidoscopic patterns and the sounds all around me. The rain and the birds chirping never stopped. Everything kept repeating itself. If I heard the sound of a bird flying by, it would be chirping forever, but it was pretty and sounded like a song that never ended.</p><p>We walked back to my house on the side of the road, and everything was so alive that I still felt like I was in a rainforest and walking forever. The cars going by did annoy me because the sound never stopped and they seemed to be going by very slowly, too. I remember seeing the cars bending as they came around the corner. I was paying attention to all of the sounds and visuals around me which after a while got really annoying because that's all there really was. I couldn't concentrate on anything else. When people tried to have a conversation with me and ask me questions, I couldn't pay attention to what they were saying and wanted them to shut up because they seemed to be ruining my experience.</p><p>Everything was morphing into shapes and glowing. The sky was pure white, the whitest sky I've ever seen. I barely made a sound the whole time I was walking because I was only paying attention to the thoughts in my head.</p><p>We finally made it to my house and decided to chill out in my room for the remainder of my trip. Everything was spacey and if I walked a step then it felt like a giant leap. I had no sense of time or space whatsoever. I kept jumping around to places and couldn't sit still. I found like I kept repeating all of my actions and thoughts and words because at this point, all these thoughts kept coming into my mind which actually isn't unusual when I'm sober, but when I'm tripping it's obviously more intense. I was jumping from one thought to another.</p><p>It seemed like everything in the universe started making sense, but at the same time it didn't which was weird. I started questioning my life more and even my death. When I thought about death, the more I didn't want to die because life was so beautiful and I never wanted it to end. I wanted to live FOREVER. It's like when people say they see a 'white light' before they die... it was similar to that.</p><p>At this point there was a force inside me that wanted to 'break free' and made me realize that I need to stop destroying my life and start to appreciate everything and everyone around me. I wanted to hug everyone around me, even if I already hated them.</p><p>For the rest of my trip I kept seeing patterns everywhere and listened to some hippie music. I could now start to hold conversations with people because my thoughts seemed to calm down after I was coming down from my trip, and my jaw was loosening up a bit. My trip lasted for 3-4 hours, but in my mind seemed like an eternity.</p><p>After it was all done I was never happier to finally be back to reality and was really excited to tell everyone what I saw and experienced that I really wish I had someone to share it with.</p><p>Conclusively, shrooms gave me a mind opening vision of the universe and my place in it. For some people tripping is about the 'cool' visuals and 'tripping balls,' but for me it was more than that. It was more spiritual. I felt like I was given a special gift that I could never give back. I learned to appreciate everything around me a lot more and faced some of my fears. Even days after the trip, I feel like a generally happier and more mellow person. Prior to my experience I was chronically depressed.</p><p>The only negative things that I have to say about the whole experience was the jaw clenching, the points of good and bad hearing, mental confusion, and the slight nausea.</p><p>Is it something that I'd do again? Quite possibly, but not anytime soon. But the next time I try it I would definitely not like to be the only one tripping.</p>",
 "year": "2007",
 "id": "65709",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2010-10-14T07:00:00.000Z",
 "views": "3007",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
