{
 "id": 6573,
 "title": "Cataclysm",
 "date": {
  "submission": "2007-04-14T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "HailChickenWing",
  "gender": "Male",
  "weight": "154 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "I was kneeling on my bed around midnight one evening when I fleetingly saw what seemed like a ghostly hand to my right, but instantly dismissed it as my eyes playing tricks on me: just an everyday occurrence. I then focussed for the first time on a small dot of light which was hovering in front of my amplifier. I looked on in awe and within seconds, the dot ignited, causing a small explosion of light right in front of me. This made me so jubilant that I shouted 'yes!' whilst laughing in disbelief. As I did this, the light in front of me moulded itself to the shape of the word 'yes.' I was already dumbstruck by this point, but within an instant, I was catapulted backwards at such incredible speeds that I had left my room within the space of a millisecond and all I could see was a massive tunnel of infinite colours and shades which had formed in front of me, constantly shifting and changing. Needless to say, I was completely mesmerised by this and managed to express myself only by saying 'holy shit.' Instantly, the tunnel changed to the shape of the word.",
  "By this point, I had completely forgotten what I had been doing before all these things began. I became completely and utterly convinced that I had died and was transcending another plane of existence. I once again uttered (an incredibly poignant) 'holy shit' in recognition of this and the tunnel reformed in the appropriate shape. As I began to realise what was happening, I saw that the tunnel was being formed by the lives of every other being on Earth who were all part of a massive cataclysm which I had caused.",
  "I saw a block of people to my right which I instantly recognised as being all my friends and, as I thought that I would never see any of them again, or discuss what was happening to us, I felt the greatest pang of sadness I had ever experienced, along with an overwhelming feeling of love for them all. I felt almost no connection with my previous life, but I did make out the shape of my bong for a short second before it began to dissipate and found it quite amusing that a stoner should be the architect of what was without a doubt the most significant event in the history of mankind! I now began to see a black shroud at the far end of the tunnel. I knew that this was all that now remained of mankind's prior existence and, as all this event was all my doing, I felt it was my duty to salvage as much of our culture, art and heritage as I could. As I thought this, the shape began rapidly dwindling, so I gulped up as much of the blackness as possible in a deep breath. I remember thinking I had done quite a good job.",
  "I kept falling backwards through the tunnel until I began to notice the shape of my bin right in front of my eyes, followed by my 8-track. I slowly stood up, back in my room. The first thing I noticed was that my bin had a giant crack down the side of it. I began to remember that I had smoked a considerable amount of 15x strength salvia divinorum extract. Suddenly feeling a whole new appreciation for life, I surveyed the scene.",
  "My room was devastated. During the few minutes this was happening, I had fallen off the back of my bed, knocked over a CD rack, knocked over my guitar, knocked one of my speakers to the ground, overturned my clothes horse, knocked over my chair and crushed my bin. The most amazing thing though, is that I had been able to set my bong down on the edge of my desk (albeit with the bowl broken off)! I was still feeling the effects of the salvia, but managed to take a photo of the scene before hastily tidying up. The whole event was easily the most enthralling ordeal I have ever undertaken, pushing my emotional boundaries to levels of ecstasy and sorrow never before experienced. As pointed out by a friend of mine, the strangest thing about believing you are dying is that you become so much more discerning and aware of what is happening around you that it could be more likened to waking up from misconception than anything else.",
  "Some parting advice: USE A SITTER! Happy voyaging!"
 ],
 "erowid": {
  "id": "38918",
  "citation": " HailChickenWing. \"Cataclysm: experience with Salvia divinorum (15x extract) (ID 38918)\". Erowid.org. Apr 14, 2007. erowid.org/exp/38918",
  "substance": "Salvia divinorum (15x extract)",
  "views": "3131"
 }
}
