{
 "title": "Supergroovalisticprosifunkstication",
 "author": "SmokingMan",
 "citation": " SmokingMan. \"Supergroovalisticprosifunkstication: experience with MDMA (Ecstasy), MDA & Cannabis (ID 65756)\". Erowid.org. Feb 14, 2008. erowid.org/exp/65756",
 "substance": "MDMA (Ecstasy), MDA & Cannabis",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "",
   "MDMA",
   "(pill / tablet)",
   "",
   " repeated",
   "",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2007",
   "65756",
   "Male",
   "",
   "Not Given",
   "Feb 14, 2008",
   "18051",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: While it may be that the substances described below are MDA and MDMA, Ecstasy tablets are notoriously impure or misrepresented, often containing chemicals other than those they are presumed to contain. This report is marked as an MDA report, but readers should be aware that this is more of a general Ecstasy report.] </p><p>This is a dual trip report. The pills were all purchased at the same time from the same source and all look like they are from the same batch. The first report is a single pill for my attempt at substance identification and the second is for a full on trip with a triple drop.</p><p>Test Run - Single pill: .G/ Lady</p><p>Description: tight press, bright white, sharp edges and imprint. Suspected MDxx.</p><p>T 0:00 (11:00PM) Took a single one orally whole chased by water. I had eaten last about 8:00PM. The last time I had rolled had been a year before. This should make me more aware of the effects of the pill.</p><p>T+1:00 Starting to feel some rushes and tingling. There is definitely something here. I feel anxious and the need to get up and move around. Walking is okay but I still feel tweeked and jumpy. Maybe listening to music will help some. No, It makes me anxious looking at the music. Grrrrrr There is some muscle tension in my neck and shoulders and combined with the anxiety of the pill, Im not enjoying this much. I decide to smoke a joint to help relax myself. (+)</p><p>T+1:30 Im only getting rushes that come and go with a slight visual distortion. This is definitely a (++). I can feel that there is an active MDxx here and it is very clean but I have a choice as to whether I feel this or not. I can think myself straight and then back up again at will. I go lay in the hammock to try to relax and enjoy this.</p><p>T+3:00 There hasnt been much change in what I have been feeling. I dont really feel much other than a little wired and some slight light flares and distortions in my vision. There wasnt a plateau of a peak, it just keep rushing up to the same peak in waves. It is apparent to me that this was a smaller dose than my personal threshold. Next time I will double up. I smoke some more weed.</p><p>T+ 8:00 Pretty much baseline from the pill. Im still stoned as hell since the pill was up and down and I hate that. I pop right off to sleep and slept very well.</p><p>I feel completely normal the next day. Since I slept so well, I would say these pills are very clean but below the threshold. Dirty ones keep me awake and good ones keep me in the afterglow. Neither one of those this time.</p><p>For The Win -</p><p>Same pills from same batch .G/ Lady</p><p>5 weeks after the previous report</p><p>T0:00 (10:40PM) Took 2 orally whole chased with water. Im listening to music and chatting on the computer to take my mind off of the waiting. I last ate a light meal around 7:30PM. Ive got plenty of smokes, a couple of joints rolled and a bowl loaded. I cant focus enough to do that when Im rolling and its annoying to try. Having the party favors ready is time well spent and aggravation avoided. The only preload is my daily multi-vitamins and a little extra magnesium as my neck muscles have been really tight lately. Ive gotten plenty of rest and eaten well recently, so I am in a good state physically and mentally for tonight. YEAH!</p><p>T+0:40 Eyes mostly dilated. Im starting to get some good body rushes. I am feeling warm and also getting some tingles following the rushes. Taking a deep breath feels extra good. Starting to come on a little sooner than I expected. My eyes are starting to wiggle the smallest bit when I try focusing on IM windows. The smile is starting to reach back towards my ears. (+)</p><p>T+0:45 Strong Body rushes now. My eyes are wobbling in wavesactually it all is coming in waves that get stronger each time. I notice some gurning going on now. I hate that so I take 500mg magnesium to head that off. (++)</p><p>T+1:00 Getting going really good now. My typing is slipping really badly. Its very difficult to focus on the computer screen or the keyboard. (Trying to decipher what I typed later is funny!) All of a sudden I am REALLY into the conversation I am having and the physical co-ordination of trying to type and read the screen becomes an entertaining game on my end. Im pretty much enjoying everything right now and feel absolutely amazingclean inside and focused like the light of MDA through the crystal clear lens of my body. Im vibrating with the light/energy/feeling of the rush. Theres nothing like this feeling. (++) and moments of (+++)</p><p>T+2:00 Im just past the beginning of the peak with all effects I mentioned before and Im sweating now. Since 2 pills got me to a good point and based on the previous test run, I guesstimate they are about 70-80mg per pill. That would put my initial dose (@ 140-160mg) in Shulgins recommended range and the same for a second dose of 2/3 to  of the initial. I crush up the third pill of the night and parachute it down the hatch. Its time to go outside and smoke a clove cigarette. I grab some music, headphones and glide down the hall to the door. My step is light and I weave some on the way. I stop at a mirror on the way and my pupils are completely huge. Its soooo funny when I look like this. Hehe.</p><p>Outside is wonderful! The breeze feels good on my skin and seems to change the frequency of my vibration. Everything is in focus on every level. I feel like Ive tuned the instrument of my being to the chord of the world now. I feel the harmony, music and vibration of the life of the trees, the grass, the ground, the air, the sky and the whole Earth under me. We are playing the same song now. (+++)</p><p>Time for me now ceases to have any meaning. At one point I look at my watch to see what time it is. I turn on the backlight and can only see the blue light. I cant see any numbers at all. That is completely funny to me and Im laughing out loud. Im listening to music and loving it but I couldnt tell you who it was. Occasionally I find myself standing and starting into some middle space and not knowing how long I had been there. This is hilarious too! I felt like I had to pee and stood there for who knows how long. I gave up and waited til later. That side effect of MDA sucks. Im just wandering around smoking lookingfeeling.beingexperiencing.existing. Thought is light and slippery through my mind like small fish in shallow water. Here one second and gone the next flashing to get your attention, then gone again too small to catch. Linear thought is gone and I just am. This time of the present is all that exists. There is no past or future, only things as they exist nowalways have been and always will be.</p><p>T+4:00 It feels like the biggest peak has passed and Im starting to hit the come-down slope. I decide to try the fourth pill for a triple drop. Even though all the info Ive seen says I will only get a speedy effect from this dose, I had previously decided to try it. Since it had been so long for me to roll, this was the best time physiologically. I crushed this one with the nunchucks and parachute the last one of the night. I go back out to the hammock to smoke a joint. This is the first time tonight I even thought about weed and it sounds great! Usually I like to smoke a lot of pot but these pills dont need it and it was good to feel them by themselves.</p><p>T+4:30 The last pill starts to come on. I think the weed helped it a little. I smoked less than a  of the joint. Thats odd for me but thats all I wanted.</p><p>T+5:00 I am definitely feeling like Im rolling again and not speedy like I thought I might. Im still in the hammock watching the stars and trees and closing my eyes and into the music.</p><p>At some point I have a collection of Parlaiment Funkadelic and George Clinton on. I am looking at the trees and then I start seeing fractal patterns in them. Yes, I see the Fibonacci sequence in the leavesthen the golden ratio, then the golden spiral. The fractal spiral opens further and deeper. It takes the pattern in the leaves and spirals down and back into another dimension. All of a sudden I feel like The Mothership has just made its Connection to meStarchild is speaking to meOne Nation Under A Groove/ Getting down just for the funk of it/ One nation, were on the move/ Nothing can stop us now.</p><p>The stars are the backlight for the trees to show me the pattern of this dimension. Dr. Funkenstein shows me the way while Bootsy plays and the trees swayI pledge my grooveallegiance to the Funk/ The Untied Funk of Funkadelica. Im staring in wonder at the colors that are appearing in the clouds. Purples, electric blue and green. Swirling into fractals and random shapes and dancing with the spinning stars. The long extended P-Funk jams and solos are sliding around in my mind and mingling with the sights I see. Its a perfect fit and I get all of their music I didnt before. I am in a completely psychedelic mind-set now and tripping my balls off. I have never had such active and colorful OEVs on MDA or MDMA beforeneverthese are completely enthralling and I can see and understand the meaning behind all of the patterns. Its so simple! Why havent I seen it before? (++++)</p><p>T+7:00 I am coming down from the last peak. I can feel the detachment from the headspace I was in and the esoteric attachment to all that I had. I can see the down slope of the comedown, but its okay. I still feel very good and euphoric. I feel heavy and slow like the air is slightly thicker and everything is moving slower. I spend the next couple of hours enjoying the come down while smoking weed, cloves and listening to music. I have never had a problem with comedowns. I usually just enjoy music and the afterglow feelings and ride them down to baseline.</p><p>I finally feel like I can get some sleep around T+12:00 but all I am really doing is just relaxing with my eyes closed. I might have actually gotten an hour of sleep during the day but the relaxation and quiet are needed. Im not sure when I actually reached baseline. I still felt like I had a mood lift for the next 3 or 4 days. Other than that I dont recall any feelings of depression or anxiety. The comedown was very clean and without any apparent negative side effects. Doing a triple drop seems to have been worth the extra pill. Without such a long break, it might have been different. I think the break in time was the key to letting my serotonin levels be at a level it could take this amount without pronounced negative effects. All in all it was a really good experience with moments of complete awesomeness and amazement. Under the same circumstances, I would definitely repeat this but not regularly.</p>"
}
