{
 "id": 6583,
 "title": "Potent Stuff",
 "date": {
  "submission": "2007-04-12T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "T-Monkey",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Morphine",
   "form": "pill/tablet"
  },
  {
   "time": "1:30",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Oxycodone",
   "form": "pill/tablet"
  },
  {
   "time": "0:00",
   "amount": "110 mg",
   "administration": "oral",
   "substance": "Morphine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "My friend acquired 10 'MS Contin 200' pills from someone whose grandmother had recently died of cancer and had a bunch laying around. In order to be prescribed these 200mg pills. I didn't even believe they were real until the guy showed them to me. They were green 'ovalish' shaped pills that said M200 on them. I looked them up online and found that the pills I was holding were in fact real. Verified by pictures and descriptions.",
  "I asked this guy how much one should normally take, and he said, 'Insufflate 1/4 of a pill'. I responded, 'I don't want to insufflate this, how much do you take orally?' He went into some random story, and what it boiled down to was that he'd never eaten it. I can't stand it when people sell something that they know absolutely nothing about. He should have been scared to sell these things to people. If somebody ate two, I could see them dying. He didn't give me any kind of warning, so I can only assume he wouldn't have given anyone else one. Luckily I tend to research things a bit, and I am no stranger to opiates so I know they can be quite dangerous if you take too much.",
  "Once online, I found that a whole pill would be FAR too much, so I took 1/4 of a pill (Approximately 50mg) just to test it out. What I didn't realize is that peak levels of morphine don't occur until 4-5 hours after the injestion of MS Contin. After waiting 1.5 hours and feeling only barely noticeable effects, I decided to eat 10mg of oxycodone to help it along a bit. With no tolerance, I need 25-30mg of oxycodone to get the effects I desire (Nods, intense euphoria, etc). After about 45 minutes, however, I was completely destroyed. I quickly fell asleep and I woke up the next day feeling rather odd and still somewhat intoxicated. I then went to my friends house and got on the internet to figure out what happened. It was at this time that I realized MS Contin takes *forever* to peak, and that I had likely slept through the most intense part. So at around 12 that afternoon, I ate slightly more than half a pill (~110mg).",
  "I started really feeling it at around T+2:00, and by the 3 hour mark I was quite intoxicated. When the 4 hour mark came around, I was vomiting and I could barely move. I had to remain quite still in order to avoid the nausea, and even then it would come on occasionally. I remained in this state for quite some time, probably 4 hours or so, vomiting every 20-30 minutes but feeling fairly good. After the peak was over, I felt a lot of relief and I slept well.",
  "The euphoria from it is a little lacking compared to oxycodone (Oral) or hydromorphone (IV) in my experience. I'd normally be a bit more euphoric but have less of a body buzz on oxycodone. MS Contin caused a stronger body buzz and lots of pain killing, but not as much euphoria. I'd imagine the real magic of morphine lies in IV administration. I have not experienced IV Morphine, however I have had my fun with quite a few decent doses of IV Dilaudid in the hospital. MS Contin did not really produce nods or euphoria anywhere near that intensity. For me, oxycodone gets closer to that intensity as far as euporia goes than morphine does at high oral doses. I think this has to do with a more intense 'coming up'. MS Contin is still a very good opiate, however, and I'm sure it would help relieve rather severe pain.",
  "I do urge anyone with access to this drug to be extremely careful. I don't recommend 'boosting' a dose. MS Contin is a VERY long lasting substance that is quite potent. In fact, the 'timeline' for the effects of one dose is quite similar to that of 5-MeO-AMT in my experience (Oddly). Take too much, and you'll be regretting it all day long, you could even die. If you research it and take the right amount, you can have a great, refreshing, dream-like day. :-)"
 ],
 "erowid": {
  "id": "38945",
  "citation": " T-Monkey. \"Potent Stuff: experience with Morphine & Oxycodone (ID 38945)\". Erowid.org. Apr 12, 2007. erowid.org/exp/38945",
  "substance": "Morphine & Oxycodone",
  "views": "31552"
 }
}
