{
 "title": "A World of Pure Perceiving",
 "author": "Longfehlo",
 "citation": " Longfehlo. \"A World of Pure Perceiving: experience with Mushrooms & Cannabis (ID 65849)\". Erowid.org. Sep 9, 2010. erowid.org/exp/65849",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "20 g",
   "oral",
   "Mushrooms",
   "(fresh)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I am submitting this account because many people travel to Europe and want to go to Amsterdam to experience the weed and other things. I do suggest it, but want to warn unsuspecting travelers of the difference of intensity between the shrooms we often get here in the US and over there as sellers give to you.</p><p>I was travelling around Europe as I did a semester of school abroad and went to Amsterdam on one of my breaks. I mainly went to smoke the good weed, but once my friend and I saw the high quality mushrooms they sold, we decided to trip. Let me tell you this... It was nuts.</p><p>Before this I had tripped on shrooms and acid many times and had had what I thought were pretty crazy trips. Previously my most intense trip was from mushrooms that made me nearly unsociable and intense visual distortions of nearly everything I looked at. However, I was still there in reality and could function in my environment despite my tripping. I thought I had had a hard trip until.</p><p>We chose from a selection of 4 different types of shrooms and purchased the 2nd best ones which I believe called Columbian something or others which cost us about $34 or so. They only sold one size package which was about 30 grams and we each bought one. However, (and this is important) the mushrooms were not shriveled up and dried like you often get here, but rather were full, thick, and moist mushrooms, like you may see at a store. We asked the clerk how much we could take since they were different in this way and he said we could take the whole thing if we wanted. Therefore we ended up eating about  of the package, which equaled about 20 or so grams each. Normally, we would not have taken that much, however since these mushrooms were not dried, we figured they were not as potent, we were also following the advice of the seller. We then smoked a small joint. Then we began tripping balls.</p><p>The Trip</p><p>I was in a store when it began to hit me and immediately had to leave. I began to feel very crazy and my eyes moved around everywhere quickly, but with little distortion, although my perception was off, as if I just immediately woke up from deep sleep and started running through a crowded area. My friend backed up against a wall and said he was going to go back to the hostel and sleep with a very crazy, paranoid look on his face. I told him that was impossible and he then agreed to come with. We had planned on renting bikes and going to the Van Gogh Museumdid not and could not happen.</p><p>The next couple hours I was completely and utterly lost inside my mind. I have nearly no recollection of what happened in the outside world for at least 2 hours. I had a few brief moments when I stopped and grabbed my girlfriend and asked her very seriously if it was really her, as I thought I had disappeared into another place. I did this several times, maybe like 5 times. Apparently we spent the entire time walking up and down the same couple streetsI really had idea at all.</p><p>Not There in the World</p><p>I spent most of the trip in my head, where I found myself inside a kind of small room that was dark, but outlined brightly. Each room represented a question that I for the life of me could not find the answer to. Then as I neared the answer, I was swept into another room which represented another question which was like a tangent off of the previous question. This went on for many, many rooms until I realized I would never successfully answer a question or find the end of this inquisitive cycle.</p><p>I realized I no longer knew anythingnothing at all. I was here in a very primary and basic form of existence that had none of the former significances of the normal world. I think we feel comfortable here in the sober world because he are grounded in all these things we think we know about our surrounding and situations, but here in this trip I was in a place that rendered those perceptions irrelevant, and my complete ungrounding in normal reality had me free, but lost and scared because I thought for sure I could never ever return knowing and seeing what I knew then.this universe of the mind apart from the world.</p><p>You see, the mind is constructed throughout life in conjunction with the world we learn. When the mushrooms took that world away, my mind was still there, but it had very little to make reason with, and therefore chased notions that led me on a frantic exploration of this little known, less conscious realm of perceiving. An almost pure perceivinglike the sound of one hand clapping.</p><p>I was slowly starting to come down from the peak, and finally could perceive the normal world and speak again. I thought everyone was starring at me all of a sudden and we went to a pizza place. I ordered a slice and put pepper on it. The pepper looked like shiny black diamonds in 3-D, and the pepperoni was spinning. The pizza tasted like cardboard, and I could not really eat it. I had a revelation about time, as I realized how utterly subjective of a notion it is. I could not tell if 10 seconds or an hour had gone by at any given moment of assessment.</p><p>As I began coming down I completely stopped having the discomfort of the loss of reality and began feeling incredibly euphoric. I had forgotten everything and was now re-learning everything I knew and understood again, but in a new appreciative and insightful way. It was really, really chill and I could not stop smiling, not laughing, just smiling. The place I was before was definitely disturbing, although interesting. I felt like I had been right in front of a beast I thought was about to kill me, and could, but didnt.  I looked at it bewildered, and once it left I walked away with a new feeling of appreciation and insight. As if there must have been a purpose to all this.</p><p>We spent the rest of the night smoking the best chronic and it was great. The mushroom trip was good, but was a bit too much considering what we had originally planned to do that day, and considering our estimation of our trip which we thought would not be too much harder than previous experiences. Wrong, wrong, wrong. We were utterly useless to the world for about 3-4 hours. These shrooms were different as I had finally broke to the other side that I had only heard about. Although I was enlightened, it was clear that our minds do not live there for a reason. We are intimately connected with our world that we know and it is a direct reflection of our being. Without it, we kind of cease to exist in a definite way.</p><p>All in all, I do not think I ever want to trip that hard again, but I am glad that I did, because it was a crazy, insightful, and mysterious experience, one of which I could have never imagined happening.</p>",
 "year": "2006",
 "id": "65849",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-09-09T07:00:00.000Z",
 "views": "1843"
}
