{
 "title": "Choose Smack and Life and a Career?",
 "author": "Bee",
 "citation": " Bee. \"Choose Smack and Life and a Career?: experience with Heroin (ID 65940)\". Erowid.org. May 15, 2010. erowid.org/exp/65940",
 "substance": "Heroin",
 "bodyweight": "65 kg",
 "header": [
  "DOSE:",
  " repeated",
  "",
  "Heroin"
 ],
 "report": "<p>My boyfriend and I don't fit many Junkie clichs out there, we have good interesting jobs, a nice flat, nice friends and we are hitting thirty. However (and that is a big however) unbeknownst to most of our nice friends, we have been using Heroin for more than 6 years.</p><p>We have never used a needle. We only ever snorted and smoked it. Somehow we still refuse to give up that last bit of the other life. I am probably wrong but I fear giving up smack would mean growing up completely and god - do I hate the thought of that. Its somehow like we need Smack to balance out all this other stuff that takes over our lives when we do choose life and choose a career, and a fucking big television. Theres mortgages, insurances, business meetings, commuting to work on grey and rainy Tuesday mornings with all the other poor nine to fivers. That fucking cant be all there is? I put up with it and its ok and it does have its perks but I cant describe the feeling to you of leaving the office on Friday after a hellish week and rushing through town out to the suburbs to see our dealer. Sitting at his place, laughing, chatting with all the crackheads, junkies and smoking the first well-earned bit of smack Ive had in a month. Shit. It all falls off. Its like an instant short break only I dont have to go through customs and wait hours at an airport for a delayed plane.  Its an instant holiday for a fraction of the price.</p><p>We were always quite into drugs and weve done them all but when heroin came along it was love at first sight. One positive thing about Heroin was that it completely eradicated the need and want for other drugs because it made us realise how crap everything else is. Its been years since weve taken any other drug than smack. In the beginning of our smack years, inexperienced as we were and also keen as hell to try addiction and become REAL junkies, we even managed to fuck up a little bit. We completely overdid it for months, ruined our lives and our relationship, got hooked and had to leave town at some point to kick.</p><p>When we came back after a couple of months apart we vowed never to touch it again. Well of course we did. This time round we thought, right, we know what happens if we fuck up on it so if we dont want to give it up completely then we must use it as responsibly and sensibly as humanly possible. Grown up heroin use? HmmmMany people dont think it is possible and many people ruin their lives or die trying but somehow and I dont know why this approach has worked for us, it worked and it still does. But I am afraid I dont know anybody else like us and who was able to use casually for such a long time. Neither does anyone else because our dealer always introduces us to other customers like we were the eighth wonder of the modern world. I sometimes wonder if theres other people out there who pull it off but if they are half as secretive as us we will never know.</p><p>Why it is working I dont know. All I can say is that we have rules and rituals surrounding smack and that helps us a lot. Heroin is quite a challenge to control because it has a tendency to silently snow me in, to numb me and to take over every aspect of my life without me realising until its too late. Sometimes we have periods when we use almost constantly for three weeks and its quite shocking coming out of my daze after three weeks plus a couple of days of hangover (wouldnt call that turkey) and suddenly realising that the flat looks like a crack den littered with cigarette butts, aluminium foil, cut off straws and dirty dishes and clothes, that my friends are getting increasingly mad at me for not returning their calls, that I look pale and wasted and the gardens completely overgrown. Thats always when I am disgusted with myself and think I've had enough now for a while. We then spend about six weeks catching up with everyone and everything. It always feels like coming back from somewhere. We are inviting our friends round for dinner, we try living our clean and pleasant life, getting fit and healthy, going shopping, doing work in the garden and going to the cinema.</p><p>As great and enjoyable as all of this grown up stuff is, it is still not as good as to say fuck to all of it for a while and spend a night burning holes in my jeans totally blissed out on smack. Some day the straight life will be winning anyway. When we loose our connection or when we decide to have children or we reach the point that the smack becomes too much of a health issue. The time of growing up will come soon enough and at 30 it definitely is on the horizon. I am not saying this will work for everyone but I am saying it is possible but it is hard work and sometimes I feel that if I would put as much effort and energy and time in more important things in my life as I put in controlling Heroin and being a part-time Junkie there would be no need for the drug anymore. It does hold me back and it drains me no matter how responsible I try to be with it.</p>",
 "year": "20012007",
 "id": "65940",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2010-05-15T07:00:00.000Z",
 "views": "34875",
 "dose": {}
}
