{
 "title": "Is This What Brain Damage Feels Like?",
 "author": "Pat",
 "citation": " Pat. \"Is This What Brain Damage Feels Like?: experience with DXM (ID 65958)\". Erowid.org. Oct 14, 2010. erowid.org/exp/65958",
 "substance": "DXM",
 "bodyweight": "184 lb",
 "header": [
  "DOSE: T+ 0:00",
  "300 mg",
  "oral",
  "DXM",
  "(capsule)",
  " T+ 5:00",
  "355 mg",
  "oral",
  "DXM",
  "(liquid)"
 ],
 "report": "<p>Male, 25, 85kg (184lb)</p><p>20 Robitussin gelcaps, 15mg/cap (=300mg dxm)</p><p>T+30 1 4oz bottle robitussin long lasting dm, 15mg/5ml (=355mg dxm)</p><p>Total= 7.71 mg/kg body weight</p><p>I have tried out DXM twice before, first aiming for the first plateau as described in the faq, than somewhere in the lower second plateau.  Those 2 previous experiences were nice and easily controlled, so figured would try a bit higher this time. This dosage would have placed me at the top end of the second plateau, maybe slightly into the third, although in hindsight the longlasting syrup must have had a much more potent combined effect, making me go higher than anticipated.</p><p>T=0, took 20 Robitussin gelcaps, they take a bit longer to take effect than syrup.</p><p>T+30, drank 4oz bottle of robitussin long lasting dm (cherry flavored).  Ugh. I can see how people could get nauseous on this.</p><p>T+50minutes.  This experience did not start off the way the others did at all.  To begin with, there was little or no buzzing sensation.  The first thing I noticed was difficulty walking and co-ordinating.  Closing the garage door nearly made me fall over.  Decided I'd better get back inside and relax, gathered together some things like guitar cds drink of water.  This took forever (or so it seemed, time was getting distorted already).  Sat down and watched tv.</p><p>T+70 minutes, tv is making me agitated, I cannot follow what is going on, but several things make me feel irritated, so I figure its best to switch it off and just chill out for a while.  Chilling out was not happening however.  I was extremely dizzy and could not focus on anything.  I got up and got myself a drink.</p><p>T+1 hour 20 minutes, anxiety was increasing, I knew I had not overdosed but at the same time I felt like something was not right, the description of effects of where I was supposed to be (high second plateau, maybe barely into the third) in no way matched what I was experiencing.  Every now and then I would get moments of clarity where I'd focus on getting the task done (e.g. getting a drink, or looking up something on the computer), but then that would disappear and I found myself forgetting what I was supposed to do. Time at this point became very distorted, I was well beyond being able to write the experiences down at the time so this is a summary of what happened next:</p><p>I was feeling no euphoria at all, this in itself made me disappointed, after all, whats the point of tripping without feeling a nice buzz. I was unable to walk properly, and was extremely paranoid, which is understandable with all drug use, but this was extreme.  This got me into a bad place, and I had to really concentrate on getting myself in control.  I knew why I was this way, so therefore I could control my mood a bit with a bit of positive mental attitude.  So I started whispering to myself telling myself it was ok, and I wrote this down on a piece of paper also.  It was if my mind was falling apart and I need to write myself reminders on how to get out, a breadcrumb trail of sorts.  It helped, for a while.  But then my eyes couldnt focus at all anymore, so I couldnt read, and I felt so paranoid that I was afraid to talk myself out of it.  Instead, all my thoughts started converging on one thing - I had damaged my brain and what if I was left permanently like this, retarded, or mentally unstable, why had I thrown everything away. </p><p>The physical symptoms were frightening also, my heartbeat was racing though at points I couldnt feel it at all, I knew this was normal (or told myself it was)...but then I had what can only be described as a brief seizure.  My head felt kind of 'pinched', pins and needles shot through my body and I thought I was having a heart attack or something.   This passed, but the anxiety it caused lingered on for a while, and I thought 'oh no, someone is going to have to take me to the hospital'.  And I couldnt do that, that would have been a disaster altogether.  So I focused myself on coaching myself through this.</p><p>I started repeating reassuring statements to myself, this helped a lot, and the panic subsided.  I decided I needed to try find some positives from this and put on the tv again, this time to something I knew, the simpsons. That was nice for a little while but again I became agitated, and got up to walk around, started to feel like I was going to vomit. As it happens, I got that in control too.  Then something weird happened, I just laid down on the carpet in another room of the house, (no reason for being there at all)... I laid down and shrank, felt like I was just shrinking down to the size of a pea, and I submitted to this.  It wasnt actually pleasant, just, strange.  I then had some moments of clarity which was extremely helpful in convincing myself it was going to pass without a trip to the E.R.  The room twisted around a few times and I tried to enjoy this but it wasnt happening.</p><p>All in all the best thing was to go to bed at that point, about T+3 hours.  Feeling very paranoid and completely out of sorts, I tossed and turned all night, and, finally, thank God for the morning.</p><p>Overall, terrible trip, and impossible to stay in control. Despite past good experiences, I am not going near this again, I feel like in 20 years I want to be still intelligent, and doing DXM would take that away from me.  Luckily I am relatively experienced with drugs and what they can do.  Had I not been, I could easily see possibilities of suicide attempts, calling 911 for an ambulance, really bad stuff like that.  My lesson learned: stick to lower dosages and grow some pot or shrooms instead.</p>",
 "year": "2007",
 "id": "65958",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-10-14T07:00:00.000Z",
 "views": "15923",
 "dose": {}
}
