{
 "title": "Austin City Limits Festival",
 "author": "ParanoidAndroid",
 "citation": " ParanoidAndroid. \"Austin City Limits Festival: experience with DOI & Cannabis (ID 65962)\". Erowid.org. Apr 20, 2008. erowid.org/exp/65962",
 "substance": "DOI & Cannabis",
 "bodyweight": "130 lb",
 "report": "<p>So to start off I have a lot of experience with psychedelics. Mostly LSD, some shrooms. This was the first time I'd ever heard of or taken DOI.</p><p>So I took the DOI at 12:15 pm at a friend's. I sat around, smoked a little weed and about 45 minutes later the first wave started to wash over me. I felt just a little jittery and less fluid like with an LSD come up, but also a little of the uncomfortable rising tension in my chest that I get sometimes with ecstasy. The bad uncomfortable feeling was easily overlooked as I trusted it would probably go away eventually.</p><p>About 2 hours later(2 pm ish) friend and I left and walked to get some of his friends. We spent about an hour at his friend's and smoked some more weed then left for ACL (Austin City Limits music festival). Listened to some music while we were driving [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] and although it wasn't really to my taste as it was my friend's car I could tell I was going to be enjoying myself today.</p><p>3:30 pm we got near ACL and parked. We had to walk on the highway about 2 miles to get to the festival, it felt great outside and everything was starting to look very definite, details stood out, color was exaggerated, the clouds looked like masses of swirling puffy marshmallow. We walked and I felt pretty great, although I did still have a bit of an uncomfortable feeling with me the whole time, thankfully it felt completely separate from the rest of my experience and I sorta mind over mattered it into the back of my mind. We had to scalp some tickets and ended up getting preached at for about 15 minutes by an older african american man who was really nice, just kinda crazy. A bit of an odd experience in the state of mind I was in. I wasn't freaked out or anything though.</p><p>4 pm we finally get in. Intensity, grandeur, bass, SO MANY PEOPLE, spectacle. A brief list of the feelings and thoughts flying through me as I got inside. I felt overwhelmed, but not in a bad way. Purely overwhelmed and ecstatic about being there and involved in what seemed like a glorious spectacle of existence. I had to meet some friends and that ended up being very hard. With everything going on around me it was really hard to keep focused on anything that was a little difficult, but eventually I found my friends and we proceeded to get close to the stage for My Morning Jacket and Bob Dylan.</p><p>Walking into the sea of people was an intense and disorienting experience, ACL is a big festival, there were thousands and thousands of people there all at the main stage, because almost everyone wanted to see Dylan. I couldn't really find much while in the people to differentiate the spot I was in from any other spot in the sea of people around me and almost lost people once. It ended up ok though and we started smoking weed on and off throughout the show, about 3 bowls during the next 6 or so hours.  The music came on, I was floored. I was overwhelmed by the intensity and hugeness I felt from the music.</p><p>Music on DOI is somewhere in between what it's like on ecstasy or acid, and nothing like mixing them. On ecstasy I feel pretty much only physical pleasure and happy, on acid to me at least a lot of music is like an all intensive almost religious experience, it changes how I think and feel. Music on DOI feels very intense, very large, I can feel waves of sound hit me, if I close my eyes and start moving to it I can easily become disoriented and feel lost. My Morning Jacket and Bob Dylan both put on incredible shows.</p><p>My mind during this time usually felt clear, but would randomly descend into confusing and odd thoughts, while just as quickly snapping back to clarity. Because of this clarity I was able to focus on whatever I felt like at the time, be it the crowd, the sun/moon, a single soft guitar line, or the lyrics. After the show was over and we started walking the discomfort washed away. Everything was beautiful, I felt amazing, alive, and like I had just experienced something I was going to look back on and smile on a lot in the future.</p><p>Visuals didn't begin to set on til about 4 hours into the trip and they really didn't set in very strong until about 5-8 hours in. When they finally came it reminded me of paintings and pictures I've seen of the desert done in a sort of mystical mescaline-ey way. The visuals were kind of like the feeling of the drug, waves. Reds, oranges, and yellows were accentuated more than anything, not only during the day, but also at night. The sky looked beautiful and had clear lines parallel to the earth where one shade of orange or pink met another, trees looked like they were made of the densest most detailed wood-like material possible while the leaves looked thick, vibrant, and shimmered. A lot of color augmentation and a lot of detail that isn't normally noticed.</p><p>We drove home with the top down, I felt great, the wind rushing over me was like cool water gently massaging me. Austin looked beautiful, lights everywhere. The world kinda reminded me of how HDTV sometimes looks sharper, richer, and more colorful than real life. Lights were extremely bright and the light coming out of them looked pure. The moon and stars stood out like if you were looking at them with the clarity of a high powered telescope.</p><p>The rest of the night was pretty uneventful, DOI gives me a pretty good amount of energy so I couldn't sleep until 8 am, and even then I only slept for 1 hour, woke up and my mind booted up like a computer and started flying. During the night I watched 2001: A space Odyssey which was beautiful, surreal, and also really grand and intense. That's kinda the point of the movie though. I laid around feeling content in my friend's room, when I tried to sleep I started hearing things I knew weren't there like the walls yelling at me, but I was able to will it to stop. Spent the rest of the next day on buses and in cars, didn't sleep until about 12 pm and until I slept again everything still seemed a little 'different.'</p><p>When I finally did wake up I was tired, but my mind didn't feel muddled as much as after an intense acid trip.</p><p>Overall it was a great experience. It's definitely no acid, a little less mentally trying and a little bit more on the physical side. It all in all is good.</p>",
 "year": "2007",
 "id": "65962",
 "gender": "Male",
 "timestamp": "2008-04-20T07:00:00.000Z",
 "views": "12657",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "DOI",
   "form": "(blotter / tab)"
  },
  {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
