{
 "title": "I'm in the Matrix",
 "author": "Joeyramoney",
 "citation": " Joeyramoney. \"I'm in the Matrix: experience with Paroxetine (Paxil) (ID 65970)\". Erowid.org. Mar 4, 2011. erowid.org/exp/65970",
 "substance": "Paroxetine (Paxil)",
 "bodyweight": "145 lb",
 "report": "<p>My brother has social anxiety and God only knows what other problems, and has a prescription to a Paxil everyday. He probably dont even take em, so I nicked a few to experiment with later on. My rule of thumb with pharms is three times the suggested dosage (yeah I live on the fucking edge), so I take three little pink pills and stick them in my wallet.</p><p>Mid morning on a Friday, Im in trig class, doodling in my notebook because I havent got a damned clue what the teacher is going on about and dont really care. I'm just bored outta my skull, and then I remember I have Paxils. Nows as good a time as any to take them and ride out the high for latter part of of the day (which is how long I figure itll take since Im kinda full). I drop them straight down my throat without touching my tongue, trying to avoid the ubiquitous bitter aftertaste in the back of my throat where I always think that I dont have taste buds.</p><p>T-00:03- The stuff hits like a freight train. All the sudden, I get this bizarre feeling that nothing around me is of importance or even real, and that my consciousness is the only definite thing in the universe. I dont even try to pay attention to my instructor or the problems were going over, and resume doodling in the margins of my notebook. Nothing around me has meaning, even the things I just drew. There is a widening chasm between my internal monologue and the world around me. I think at this point I could just get up at any point and leave, since this freaking school means nothing to me.</p><p>At the same time, my eyes drift in and out of focus, and for the next 15 minutes or so, its pretty challenging to see anything straight, but I dont really need to anymore since the only things of matter in this universe now exist inside my head. Now the hard part- I suddenly get a horrible, searing stomach ache, like an alien parasite fighting its way out of my belly. I excuse myself to the bathroom because most immediately I am possibly about to vomit and secondarily since Im just loosing my shit in the middle of math class. I have the challenge of making small talk with a friend in the bathroom, but its hard to talk. I sit on the toilet for a few minutes, not really to relieve myself but just to breathe enough air into my stomach to convince myself Im not gonna throw up.</p><p>T-00:10- Pretty soon the bells gonna ring, and the next class is not important enough to bear through like this, so I just lie down on the couch in the senior lounge. About twenty minutes after I took the pills, all the effects fade out, and I feel better. I feel a bit relieved, but a bit ripped off. My head is near totally clear, aside from my eyes periodically wandering out of focus.</p><p>T-02:30- Im on a public bus, and I get the realization that my own consciousness is the only thing that is constant in my life and thus the only thing that I should consider. Nothing else is real. Its like Im in the matrix and Im the only one thats human. All the other effects have faded, but a lengthy, intense delusion of intense alienation has ensued. This shit can make me do pretty cool things when nothing else is real. Im usually a pretty shy dude, but I was talking to every girl that came my way. This was really creepy inappropriate shit that I didnt rehearse in my head at all. It just flowed right out. Nothing happened with them, but Ive never seen myself that way before in my life. Its a really amazing sensation. This was all on top of that elemental slightly confused-THC like high that effects my immediate perception.</p><p>The effects lasted about thirteen more hours or so, until I woke up the next day. All in all, Paxil was (aside from the initial stomach pain) a really awesome and invigorating mood enhancer. Of course, Im just talking at the illicit recreational level, and have no ezperience with what the reccomended dose would do.</p>",
 "year": "2007",
 "id": "65970",
 "gender": "Male",
 "timestamp": "2011-03-04T08:00:00.000Z",
 "views": "11171",
 "dose": [
  {
   "time": "0",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(pill / tablet)"
  }
 ]
}
