{
 "title": "50 Trips Later ...",
 "author": "Tooloose",
 "citation": " Tooloose. \"50 Trips Later ...: experience with 2C-I (ID 65980)\". Erowid.org. Dec 15, 2008. erowid.org/exp/65980",
 "substance": "2C-I",
 "bodyweight": "165 lb",
 "report": "<p>I have had about 50-60 experiences with 2-CI over the past few years. It makes a nice addition to weed or E but it isn't special alone.</p><p>Over time I have noticed a deffinite decrease in it's effect on me. At first it was beautiful museum piece visuals. I would listen to music and the visuals would evolve with the music and I thought they were beautiful. Unlike mushrooms and their wavy visuals or LSD's simple geometry and and intense visual focus, these were complete 3 dimensional glass sculptures with symmetry and color. Over time though, the visuals have dropped to nil. There is an intense body load that comes with the high, that has been there from day one and has not let up. It can be annoying when I just want to chill or do something other than have sex or squirm on the bed.</p><p>All in all, it is a very mild drug. The visuals and the ride up are not very threatening. The body load was a little scary at first though. 2-CI has the most intense body load of any psychedelic I have tried. The body load is stronger by far than the visual experience.</p><p>Oral consumption leads to a very mild hippy-flip type of high. A sensual body load with very mild visuals. Great for headphones and a dark room. Smoking a little weed makes for a nice comedown too. It has a slight amphetamine effect, rather like several cups of coffee, the weed helps to get over the lingering body load after the fun effects wear off so I can relax.</p><p>I never really got smoking it by itself to work. It doesn't produce much vapor by itself with out using a very large amount. I did however find that by taking 10 mg or so and sprinkling it over a well packed bowl of weed made for a really deep stone. It isn't like the hippy-flip from oral consumption, it is more like a couch lock stoning. I could see and hear just fine but verbal communication was out the window. To use the cliche, it feels like a date rape high when smoked over weed.</p><p>It isn't a substitute for E or cid, but goes very nice with them and things like shrooms, weed or even benzos. I hate xanax by itself and would not take it otherwise, but it does make the comedown enjoyable.</p><p>On a scale of 1 to 10, Salvia being number 10, cid being about a 7.5, shrooms about 5, E about a 4, 2-CI is about a 2. It really is not much more than a mixer for a drug cocktail. It has very unique attributes that add well to other drugs but it isnt special beyond that.</p>",
 "year": "2007",
 "id": "65980",
 "gender": "Male",
 "timestamp": "2008-12-15T08:00:00.000Z",
 "views": "4538",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-I"
  }
 ]
}
