{
 "title": "WAY Too Much",
 "author": "T-zone",
 "citation": " T-zone. \"WAY Too Much: experience with 2C-B, Cannabis & Sleep Deprivation (ID 66030)\". Erowid.org. Oct 31, 2007. erowid.org/exp/66030",
 "substance": "2C-B, Cannabis & Sleep Deprivation",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "2C-B",
   "(capsule)",
   "",
   " ",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "report": "<p>A few weeks ago, a friend of mine called me up and said he had Nexus. This was after I had been awake for two days taking Ritalin like candy, because I had a lot of shit to do (but boy did I get it done!). The pseudo-speed had worn off by the time I got my shit, so I was feeling totally burnt out. I didn't even THINK about 2C-B being a phenethylamine - that was my first mistake. My second mistake was to assume that since I had taken large doses of psychedelics before, I could handle an extremely large dose of 2C-B. I ate the capsule at about 9:45 PM.</p><p>The beginning of the trip felt a lot like MDMA, was very empathogenic. I ended up talking to my neighbors outside. They invited me up to their apartment to smoke a little bud, so I went. I told them that I had taken 2C-B, and it was little surprise that they had done it before, albeit a lower dosage. Objects started to take on a noticeably 'shiny' quality at this point, but communication - speech - it was just too much, I was silent almost the entire time. I did a lot of reflection up there in that chair, after a few hits from a huge-ass bong, and it changed the way I thought about a lot of things, especially my family - I had always been too hard on them, never thinking about anything in my life from an outside perspective. It was quite a humbling experience.</p><p>I left there after maybe an hour, and things really started to pick up, but my heart was racing and I felt constantly nervous. I knew that if I didn't get myself together, this was going to be a seriously bad trip, but I felt like I just COULDN'T. My heart was going to burst out of my chest, I was going to die, I had to find some charcoal or something to end this trip... but instead I walked inside and lay down to watch some TV. It was Family Guy. The episode where Peter does drugs. The synch was incredible, like the things Kesey talked about in his LSD days.</p><p>'Everything is so... SIGNIFICANT,' I thought to myself, only to hear the same line from the TV a few seconds later. 'This is way too real,' would prove to have the same effect later, though my left brain knows that this was just a very rare coincidence and nothing to do with the drug... although the abstract side is left to wonder.</p><p>The visuals were the most intense thing I have ever experienced. It was not like acid, where shit just melts together - objects actually changed size, bits of them rearranged themselves - the visuals were things that, if they weren't so absurdly impossible, I would actually BELIEVE, and everything was bathed in an unimaginable halo of red light, the same light flashing in front of my eyes when I closed them, making me think I was dying... if my heart had not been beating so fast, it would have been great, but the physiological effects kicked my ass...</p><p>I spent the next five hours hyperventilating and freaking out, worrying that I was overheating, and at the same time feeling the drug's effects 'hypersensitizing' my body. I was so tired, but I thought if I closed my eyes to sleep, I would surely die... I thought I was on the verge of death many times, I could feel it pressing in on me, I simply could not get a grip on myself.</p><p>Overall, I would do it again after a good night's sleep and possibly at a slightly smaller dose. If I hadn't been so retarded about it, it would have been a great experience.</p>",
 "year": "2007",
 "id": "66030",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-10-31T07:00:00.000Z",
 "views": "13455"
}
