{
 "id": 6613,
 "title": "Having Fun",
 "date": {
  "submission": "2008-04-10T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Psilocybe Cubensis",
  "gender": "Female",
  "weight": "110 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0:15",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I decided as preparation a week in advance that I would try and keep my mind pretty clear and upbeat. Two days before I'd be tripping I hardly ate anything, so that I'd have an empty stomache when I took the Mushrooms.",
  "[8:20PM] Went to Elizabeth with Brian and Sue to get my I.D. made so that I could get into the dorm rooms at Montclair College Campus. When the ID was done, I met up with 3 of my friends, Joey, Nick, and Vicky. All of us were jittery and somewhat nervous, but got on the train and talked. When we got to Newark I peed! We waited for the bus, that's where it was beggining to get into my head that in a few hours I'd be in a complete different state of mind. I was feeling sick, my ribs were bothering me, and my stomache was in knots because of the excitement.",
  "[9:00PM] We FINALLY showed up at Montclair, and met up with Vlad and Kenny. We went back to Vlad's dorm room, and very quickly after that, Vlad divided up the shrooms, and we ate them. They don't taste bad, But they really don't taste good. Vlad was tripping with us.",
  "[9:15PM] After we finished, We all smoked the little BlueBerry Haze that Vicky had brought with her. I have no idea why, 2-3 hits and I was fucking gone. It started the trip. A few minutes later I realized the emotional rollercoaster of the shrooms had started. But overall, I felt great. We were all just sitting around talking, and laughing about shit. I suddenly felt away from everyone around me. I felt like I was the only real one, and then questioned myself if even I was real. I gave up on that thought and laughed with Vicky about Kenny's facial expressions. Fucking! Kenny has vampire-like teeth, and he has horns on his forehead, and then the way the shadow was appearing on him, it seemed as if his eyebrows perked upwards, making him seem very like the Devil. It occured to me that Satan was possibly sitting in the same room as I was, and I figured if this is what Hell was like, I'd be glad to go.",
  "[9:45PM] I had gotten into the visuals, A poster that was on the wall winked at me slowly. I thought the person in the picture had turned into a real person, and was quite confused because it was only a head-shot. I lost my grip on reality then, it had seemed like a few hours from the last time I had heard my own heartbeat, I wasn't breathing? or was I? Not knowing didn't bother me much either. I felt short of breath, and started taking big deep breaths. Each one had a new emotion to go with it, The first time I felt this 2 second hardcore adrenaline rush, The 2nd was more or less normal, and the 3rd I wanted to lay down and cry.",
  "[?]I wasn't sure how much time had just passed, but I glanced around the room and noticed Joey on the other bed sitting next to Nick, both zoning the fuck out, and Vicky staring at the T.V. looking fascinated. I could tell they were all having pretty good trips so far. Blah. I don't know how much time was spent between each event. Eventually, I was laying on Vicky on the couch, we were joking around about shit. I was cold. Without noticing, I started shaking violently, Until Vicky pointed it out about 50 times. Joey came over to help calm me down, It worked for a few seconds, but I was still shaking alot.",
  "[10:00PM] I was fucking dying of hypothermia. I needed to move, So Vlad suggested I move into a different bed. I liked that idea, the beds had blankets! It seemed like I was there for hours contemplating on how to get my legs to work. But how?! I couldn't feel them. I finally pulled myself out of it for a few seconds and stumbled across the room uneasily. I quickly covered my entire body in blankets, curled up into the tightest of emoballs. I thought about alot there, I won't go into this part.",
  "[10:10PM] Vlad eventually came back and asked me if I could move to his bed, because the bed I had chose to lay in was his room-mates. Of course I agreed. Vlad's bed was the top bunk (bottom was the couch) with no way to get up but jump. I was scared. But Vlad picked me up and put me on his bed. Even more quickly than before, I tightly wrapped myself in the blanket to the best of my ability. You know how after being cold, when you wrap yourself in a blanket it makes you feel very... warm. Well it DIDN'T! I was still freezing cold, I was starting to feel really upset. I thought more and more about life but the thoughts didn't come out as possetive as hoped. I stopped while I still could.",
  "[10:45PM] The music that was playing had a huge effect on my trip though. Alot of techno like trance shiza. It made everything pulsate when I opened my eyes, and that stung and hurt. I could still feel it. I could feel the music. I was absorbing it through my entire self instead of just my ears. But since I couldn't open my eyes, I was having REALLY intense closed eye visuals. Everyone seemed to last hours, and give me different emotions towards each. My entire world was changing channels so quickly. Everything in the background seemed to be turned down low, but I could still hear them.",
  "[11:00PM] After about 10 more minutes of that bullshit, People showed up. Now, It was supposed to be -- Me, Vicky, Joey, Nick, Vlad, and H, Kenny, or Rob might have joined us... Girl after girl was showing up and drinking, or already drunk, hitting on Vlad. He seemed thrilled but not interested, but hell, what do I know? Haha. Anyway, Immidately I started to analyize them each. Decided against liking them in the least bit. I couldn't make myself realize that they were serious. They were like: 'Omgz Vlad! Yous are soo! hawt. I deffintly think we should hook up babe, I think you are so sexii! I had so much to drink! *graps second beer* I'm such a lighweight, teehee!!' .... In complete serious-ness. They even had the prepish-richgirl-type accent going on. I was annoyed. For some reason they just brought on negative energy for everyone.",
  "[11:15PM] Joey, Nick, and Vicky decided they wanted to leave and tried to get me to go with them. I wanted to so badly, but I couldn't get myself to move. I wanted the trip to end so I could just fall asleep. I couldn't. After they left I started feeling isolated and somewhat alone. I was curled up in a blanket in a room full of people I hardly knew. The music was playing, there were people coming in and out, constant talking, not to mention all of the crazy shit that was happening in my own mind. It was too much to handle, I was buggin out, mentally, not physically. I was thinking about so much, but nothing at the same time, More and more questions without answers, so it wasn't getting me anywhere but frusrated. But at the same time, It didn't feel like I was even thinking, Only thing was these vivid colors and sounds, that were making me feel whatever I corresponded with them.",
  "[11:50PM] It is so difficult to try and explain to anyone who wasn't there tripping. Eventually I started to feel myself come down, I could open my eyes without freaking out, and my heart was beating slow, I felt warm on the inside. Then I was overwhelmed with all of the thoughts that came to me. I finally sat up and Vlad came over to ask if I was alright. We talked for a little while, He apparently didn't have the best of trips either. He tried calling Joey for awhile and he didn't pick up. He offered me some beer, of course I didn't turn that down. Haha.",
  "[12:30AM] As soon as I had came out of all the 'darkness' I instantly wanted to see Vicky and Joey. I was looking out the window hopeing to see them.. Vlad was trying to comfort me, but I all I wanted was to get out and be around them. He eventually got ahold of Joey and he took me outside to meet up with them. When I had walked outside, it felt like all of my negative energy had just left me, it felt so amazing. We all talked for a few minutes, and since it was VERY cold outside, Vlad went back upstairs and we went over to the piano room. I was feeling amazing and energetic. We all were attempting to share our trips, but we didn't need to. I already knew.",
  "It was so fucking beautiful outside, I couldn't stop staring at the trees and the sky and everything around me. Being outside in nature made me think alot about how much we've destroyed for our own personal 'happiness', while the world suffers. People suck.",
  "[12:50PM] We got to the building, and started to explore. We went into the autotorium (spelling?!) and wondered around a bit. Vicky and I were on stage and we found these spiral stairs that went ALL the way up. Joey and Nick came over and we all climbed up really fast. I had so much energy, and we all felt like we needed to explore the entire building. So we did! We were wondering around going into all of the classrooms. In one of the hallways, was a vending machine, which I don't think I could forget. We were all hungry so we got cookies and drinks and Skittles. Joey got hyper. I will not try and explain that either, but it is the funniest shit of my life. We wandered around into different hallways and came across a classroom, we chilled in there for a bit. Vicky decided to leave 1 skittle on each desk. She ran out so we went back and got more skittles. We found our way into the piano room -- which is a room with like 20 really small rooms that each have a piano in them. Eventually, we left and went back into the autotorium (spelling. again?) Joey went up on stage and entertained us for about 20 minutes. That was fucking hilarious. We all sat in different sections, and talked.",
  "[3:00AM] We decided that we needed cigarettes, badly. We called up Vlad and finally got ahold of him, he told us where to get them. We had to walk far, but it was so much fun just being with them. It didn't matter, nothing did. Vicky, Nick, and I waited while Joey went to buy them. He got 3 packs, w00t. We decided to head back, and of course talked on the way. When we got there we stopped out by the tennis courts and smoked another stoge, and decided we'd go back in because they wanted to sleep, that did not work. Vlad was not picking up his phone. We explored some other building thingys, which were not as fun as the first. It seemed like we had the whole campus to ourselves, No one was outside. No one had been pratically the whole night.",
  "[5:00AM] We all headed back over to Vlad's building, The sad part is you can't get into the dorm rooms unless someone who lives there signs you in. Well, We couldn't get ahold of Vlad. He probably had fallen asleep. It was fucking COLD outside. We called Vlad repeatedly for about and hour and gave up. We headed back over to the building of fun-ness. Eventually all went into one of the piano rooms and everyone went to sleep. Besides me. About 15 minutes later, I saw someone in the building, and we kind of weren't supposed to be there. So I woke everyone up and we went to the lobby room type thing. We all sat around, Joey fell asleep in the chair. Me and Vicky had fun with that for awhile. Finally around 9:20 we decided we'd catch the first bus out so that we could go home and sleep. That didn't work because Joey sucks at waking up, alot. So we all waited around for an hour waiting for the next bus. We missed that one too because we had forgotten where the bus stop was.",
  "[11:00AM] We headed over to the diner because we were all cold as shit. Got some hot chocolate. Then left for the bus stop. We found it! and waited 20 minutes for it to show up. I layed on Joey and Vicky. Finally, The bus came. We all went to the back and sat around and talked. It was so amazingly warm on that fucking bus, it was heaven. Then about 5-10 minutes later, we pulled up to some mall. We were confused because we didn't on the way up here. Joey asked the bus driver if the bus went to Newark, he said No. dum dum dum!! The busdriver was really nice and just told us to wait until after he took his break, and he'd be going back to Montclair and then to Newark, he didn't charge us again.",
  "Around 1:25 he came back! We all went back to where we were sitting before, and it was good. Long ride to Newark. I layed on Joey. Vicky layed on herself. Nick was sitting. We got to the Newark Trainstation, and I got to pee. No one was really feeling well, but we were all hungry. So with the remainder 4$ we had, we spent on lots of french fries at McDonald's. We ate fast and then left to catch our train. It showed up and we sat around. Joey was tired as hell, he was falling asleep on himself. Vicky snapped out of her tired-ness so we talked alot.",
  "[2:00PM] Finally, We were back in Westfeild. Our adventure was sadly over. Said our good-byes to Joey and Nick, that was sad. Vicky and I went into town for 0.2 seconds with the small hope we'd find someone willing to give us money for food. Nope! We walked back to my friend Sue's house and on the whole way back we talked about our trips. It was fucking wonderful.",
  "The entire expierence was amazing, Although the afterglow is making me either feel like I couldn't be happier with anything, or like everything is worthless and sucking. I learned alot from this trip, It made me realize (thanks to Vicky) that it doesn't matter where you are, or who you're with, or what you're doing, As long as you are having fun.",
  "Also, Joey has a theory about 2 people being 'liquid' and every person in the world has 3 different inner colors. If all 3 colors are the same, The 2 people are 'liquid' and can 'melt' into each others thoughts and feelings, aka True Love. Well, I came to the conclusion that the 3 colors could stand for spirtual, mental, and emotional connections. And instead of being just different colors, They would be different shades of colors as well. Because true love is hard to find when you don't know what your looking for."
 ],
 "erowid": {
  "id": "39035",
  "citation": " Psilocybe Cubensis. \"Having Fun: experience with Mushrooms & Cannabis (ID 39035)\". Erowid.org. Apr 10, 2008. erowid.org/exp/39035",
  "substance": "Mushrooms & Cannabis",
  "views": "2465"
 }
}
