{
 "title": "Fever Dreams",
 "author": "Mr. Badger",
 "citation": " Mr. Badger. \"Fever Dreams: experience with Salvia divinorum (20x extract) (ID 66146)\". Erowid.org. Aug 28, 2009. erowid.org/exp/66146",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "195 lb",
 "report": "<p>First off, a note concerning my dosage. I did not have access to any means of measuring the amount of extract I smoked, the 1/10th of a gram is a very rough estimate.</p><p>I had been away at my first semester of college for about six and half weeks and had not been inebriated once. This was not a conscious decision I merely had been keeping to myself and had not engaged in the usual social rigmarole which would provide a setting for substance use. Also I did not want to take my bong and other smoking accoutrement with me to school, at least in the beginning.</p><p>At the time of the experience I was already fairly experienced with psychoactives including, prolific cannabis use, several mushroom trips, plenty of cocaine, mdma in the 'molly' format and several other 20x salvia trips.</p><p>Anyways I had really been jonesin' to get fucked up for the past couple of weeks, I had enjoyed an extended period of sobriety but after about six weeks enough was enough. Not being plugged into the local social networks which would have given me the connections to procure some form of inebriant I thought to myself, what is a way I can get fucked up that does not involve much leg work. And then I remembered the slew of legal ethneogens which are available legally and relatively cheaply online, I thus went to one such online website and purchased a gram of 20x salvia. I got it on a wednesday and was planning to save it for the weekend and just trip out in my dorm, when I opened the package which contained a fat sack of black extract I simply could not contain myself and promptly crafted a bong from a coke bottle using a pen tube downstem and was using the little metal pen tip for a bowl piece. I loaded it up and fired away.</p><p>Almost instantaneously I felt that distinct Salvia headrush, which is rather difficult to explain although it kind of feels like a portion of my brain is trying to break out of my skull. I did not have any great visuals just some distorted perceptions of furniture and lights, which was nice but not mind blowing. For me what I always seem to get with salvia is a huge body trip, and this experience was no exception. I had a huge loss of coordination I kept flailing around on my bed trying to stand or sit up, but I felt like a beetle tossed on my back and I literally could not get up. I had some mystical new age music playing and that was sufficient to send my mind reeling off into the stratosphere of extrapolated fancies concerning faeries and hobbits and all manner of perverse delusions. All in all it was pretty good and I ended up just laying on my bed rubbing my body feeling as if my hands were attached to someone else.</p><p>When I was coming down I figured ah fuck it its only 3 o'clock in the afternoon and no one is around. So I loaded up another bowl and went into my closet and burned it down. During this entire experience I was worried about someone smelling the smoke and telling an RA so I had stuffed a moist towel under the door and lit some incense but was nonetheless a little paranoid. During the closet smoke sesh I heard voices outside in the hallway and I heard someone say 'Do you smell that'. I'm now almost positive that this was just a hallucinated manifestation of my paranoia because there is just no way anyone could have smelled such a small amount of smoke inside a closed closet in a closed room with a towel and incense going. However on hearing, or perceiving these words, I freaked out and promptly dashed out of the closet and quickly opened the windows and started fanning the closet door to circulate the air.</p><p>While I was frantically swinging the door, tripping balls, I thought that I was some little man working the bellows of a great castle forge or something and was frantic to do it right or my master would punish me. I then stashed the homemade bong and ran to and fro trying to clean up this and that, but not really accomplishing anything. I put some queso and salsa in the microwave and heated that up for some reason and then I laid out some books and sat at my desk so that when the army of RA's and police arrived I would have an alibi, that I was merely studying with incense. I of course ended up staring at my desk occasionally glancing out my window, the whole time my head was flying forward through a tunnel pressure and heat. When I looked out the window I saw a person walking far away and thought that they were a drone of the enemy and were spying on me through my window, I flapped my arms at them and my body started to vibrate uncontrollably and I went and laid down in my bed starting to come down and eventually falling asleep.</p><p>When I awoke I was drenched with sweat even though it was about sixty degrees in my room, my head felt like cotton and the part that had tried to escape my skull was throbbing, I realized I still had some music playing and then I started remembering all these dreams, that were related to whatever music must have been playing. I don't really recall the specifics now other than they were more just vague amorphous thoughts and fancies. Also my sweat can only be described as that peculiar post-fever break sweat so I think my body temperature probably rose during the experience, most likely due to the frantic paranoia.</p><p>All in all I concluded what I had always known which is that Salvia is an exceptionally potent drug and should be approached with caution and respect. It can definately knock your dick in the dirt if you are not careful.</p>",
 "year": "2007",
 "id": "66146",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-08-28T07:00:00.000Z",
 "views": "2615",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
