{
 "id": 6618,
 "title": "That Last Line",
 "date": {
  "submission": "2007-04-15T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sapphire",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3.5",
    "unit": "g"
   },
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I am a 19 yr old college student who is open to doing basically any and all drugs.  I figure nothing but death and pain lies ahead of me nomatter what so I may as well enjoy myself while I can.  I have done Alcohol, Pot, Shrooms and DXM.  I became friends with a few cool people in my dorm who wanted to do some cocaine, one of which had been strung out on it for about a year previously.  We purchased some from some very creepy coke heads on our floor who kept glaring at us.  We decided to avoid all other kinds of substances that evening rather than risk fucking up our high.",
  "Let me tell you, coke is totally not what I expected.  I expected to be HIGH but on the onset I found coke milder than marijuana.  We took out first line around7:30 pm and we just kept snorting a line or two every hour for the next 4 hours.  It was the most awsomely fun night of my life.  I smoked packs of cigarettes, I danced wildly to Rufus Wainwright.  I was extroverted like I had never imagined, I am normally rediculously shy.  It made me feel like I was everything I ever wanted to be.  I felt like I was walking on air and I couldnt stop TALKING! I bonded and talked to new friends for hours.",
  "We finally finished up our last lines around midnight and then my ex-heavy user friend G. Become so morbidly awfully depressed when it ran out that it gave me quite a scare.  There was such deep dispair in his eyes and I knew nothing could comfort him except more coke.",
  "It has been about 17 days since this experience, it has felt like a life time.  I think almost daily of doing more.  I am resisting because of the look I saw in G's eyes.   Still it doesnt get any easier.  To my boyfriend I try to pretend that its no big deal and that I will just do coke every once in a while but he doesnt know how much I think about it.  Am I already addicted?  Sometimes I convince myself that I dont want it but GODDAMN what I wouldnt give for a line right now.  I have considered going to the creepy coke heads on my own and getting a whole bunch and save it just for me.  But these are the thoughts of a drug addict.  I snort coedine just cause I love to snort things now. What is going to become of me?"
 ],
 "erowid": {
  "id": "39065",
  "citation": " Sapphire. \"That Last Line: experience with Cocaine (ID 39065)\". Erowid.org. Apr 15, 2007. erowid.org/exp/39065",
  "substance": "Cocaine",
  "views": "6576"
 }
}
