{
 "id": 6620,
 "title": "This Probably Won't Do Anything...",
 "date": {
  "submission": "2006-05-23T07:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "kilgore",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "glasses"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "administration": "2 joints/cigs",
   "substance": "smoked"
  },
  {
   "time": "Cannabis"
  }
 ],
 "report": [
  "I was visiting with some old friends back in my hometown after being a way for a while. As tends to happen with this group, we ended up putting away a few cases of beer, numerous joints, and began the search for other means of intoxication. This wasn't a group that was looking for spiritual enlightenment, or personal insight. We had all grown up and experimented with drugs together in  this small town. A few years after high school alot of us had drifted off into other lives with different friends, interests, and jobs. I say this to try and explain our headspace at the time. We were all searching to recapture that feeling of being young and together. Invincible and insane. Some one mentioned that they had a few caps of mushrooms left. Barely enough for one person to enjoy.",
  "We decided to smoke the caps. Figuring nothing would happen. The bong is passed to me. I inhale deeply. The smoke is earthy and thick. I don't feel anything. Too bad, we think. Let's go hiking. About 20 minutes later we find ourselves at the top of a bluff overlooking the city in the middle of the night. I feel an uneasy anxiousness, not unlike the come up of a mushroom trip, creeping up my stomach and tingling through my arms. We all start to look at each other and smile. Something is different. Something is definately happening. I start to run in a large circle around every one. One by one, every one starts running at top speed in a circle in the pitch dark on top of a large hill overlooking our hometown. I had so much energy. The lights from the city were swirling and twisting. All I could hear was the distorted breathing of 10 guys as we ran as fast as we could. We must have ran in that circle for two hours. Non stop. Not saying a thing. Definately tripping.",
  "I had heard that smoking mushrooms was a waste of time, money and stash. I haven't done it since, but it was one of the strongest experiences I've had."
 ],
 "erowid": {
  "id": "39069",
  "citation": " kilgore. \"This Probably Won't Do Anything...: experience with Alcohol, Cannabis & Mushrooms - P. cubensis (smoked) (ID 39069)\". Erowid.org. May 23, 2006. erowid.org/exp/39069",
  "substance": "Alcohol, Cannabis & Mushrooms - P. cubensis (smoked)",
  "views": "8015"
 }
}
