{
 "title": "Backyard Blitz",
 "author": "Czar",
 "citation": " Czar. \"Backyard Blitz: experience with Cannabis (ID 6620)\". Erowid.org. Mar 10, 2002. erowid.org/exp/6620",
 "substance": "Cannabis",
 "bodyweight": "60 kg",
 "report": "<p>The year was 1996, and I was fifteen years old. I had smoked cannabis before, but only in small amounts. A hit here and a drag there, without effect. One day after being given a bag for free, from a girl I knew at school (weed is plentiful), I decided that I might as well try some of it at home that night. As far as I knew, weed made your eyes go red and made you laugh alot, so I was expecting something kinda similar to being drunk. How wrong I was.</p><p>At the time, my mother and my brother were both at home, and my father was out somewhere. So, I snuck out into the backyard, and into the tool shed. I quickly had 4 hits of the cone, which pretty much roasted all of it, then I put the pipe in my pocket and started to walk back to the house. I was half way back when I dropped my lighter, so I bent down to pick it up. As I stood up from retrieving it, I noticed something was different about the way my neighbour was doing his gardening, I just couldnt put my finger on what it was.</p><p>By the time I had completed the last few steps back to the house, I was off the planet, totally unexpectedly, with absolutely no experience, and a morbid fear of my parents finding out. I had never truly experienced paranoia until that day. Once inside the house I though maybe watching TV would take my mind off of the intense fear of what I was experiencing. I sat down in front of the television, and started to watch repeats of 'I Dream Of Jeanie'. That was when I noticed that everything not in focus (ie. everything but the TV) was vibrating intensely, so as to create a motion blur.</p><p>That really scared the shit out of me, so I got up and went to the bathroom mirror to see what my eyes looked like. They were *very* bloodshot. At about the same time, I realised that my heart was beating in an extremely heavy and irregular fashion, and I seemed to actually be able to see my chest jumping with each beat. By this time, I was out of my mind with fear that my mum would catch me, or that I would loose my mind. It was all a matter of time before one or the other happened.</p><p>I thought maybe a walk outside for some fresh air might calm me down so I could enjoy this altered state, but it just seemed to kick it up a notch. I stepped out the back door, and walked to the top of the yard, and yet my thoughts and my vision were telling me I was only just coming out of the back door, even though that was seconds ago.</p><p>I cant clearly remember what happened after that, I think I said something really messed up to my brother, and I *think* I smashed a beer bottle or something, maybe I imagined it, im not sure. Anyway, in my very stoned mind, I decided that telling my mum that I felt sick, and retreating to my room to sleep this off, would be the best plan of action, so without making any eye contact I did so.</p><p>Once in my room, I lay on the bed, hearing my blood pumping through my ears, feeling it tingling the tips of my fingers and toes as it ran through my veins. I tried to go to sleep, but shutting my eyes was the *worst* thing I would have done. I felt like the bed was floating in space, with me stuck to it, then it began to freefall, casting me off into the black void, leaving me to tumble aimlessly as my bed flew out of control in a different direction. I quickly opened my eyes, but the feeling remained, and that caused me to have the first panic attack of my life. I was out of my mind with confusion and fear, I got dressed, then undressed, then back into bed and just lay there, eyes open, staring at my pet rats as they played for the remainder of the 'trip'.</p><p>After this experience I had some problems with panic attacks for the next few months, and that kept me away from it for 4 whole years, for fear of it happening again. About a year ago, I tried it again, and absolutely loved it. Now I smoke nearly every day, and then some on weekends.  I have a feeling that my mind-set and mental stability have inproved/matured somewhat since then, so I can handle the substance much better now. I also think that smoking alone with a parent at home, without knowledge of the effects was a rather stupid thing to do.</p><p>Now, I fully appreciate cannabis, as a recreational substance, a medicinal plant, and most importantly a tool for learning.</p><p>Thanks for reading.</p>",
 "year": "1996",
 "id": "6620",
 "gender": "Male",
 "timestamp": "2002-03-10T08:00:00.000Z",
 "views": "10955",
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
