{
 "title": "Friend Went Tripping ... and Never Came Back",
 "author": "Concerned Bud",
 "citation": " Concerned Bud. \"Friend Went Tripping ... and Never Came Back: experience with Datura (ID 66232)\". Erowid.org. Oct 8, 2007. erowid.org/exp/66232",
 "substance": "Datura",
 "bodyweight": "150 lb",
 "report": [
  "<p>[Erowid Note: No contact information was provided with this report, so we are unable to confirm it or follow up with the author. It is our policy to try to verify any serious long-term adverse reactions that people report, where possible. If the author reads this, please contact admin@erowid.org.]",
  "A friend of ours (lets call him Rich) drank a tea brewed from Datura flowers (Sydney Australia) that were growing in a neighbours yard. He had been warned that it was a bad idea.",
  "Let me preface this by saying that before he consumed this tea he was a reasonably rational person, although considered somewhat eccentric (he was 20 yrs old) and was attending Mcquarie Uni at time.",
  "The tea was brewed at [deleted], and we lived about 15 miles away. At about 2am in the morning Rich shows up in his underwear (boxers and a t-shirt), at our door babbling about his mother needing money for 'the holiday', we looked outside and saw a cab waiting. I went out and asked the cabbie what was going on, he told me that our friend had hailed him at Hyde park (in the city center) and asked to be taken to our place, he was babbling incoherantly, and the cabbie felt sorry for him (Australians are like that - ask no questions, just help him out) and took  a chance. I paid the cabbie for the ride, and went inside. Rich starting saying that 'his room' was the living room, and that he wanted all the people to leave so he could ... something or other, lets just say it was nonsense, cause there were only three of us there. After about 60 minutes of babbling he went into the kitchen where he was talking to the tea tin, while shaking his fist violently at the refridgerator, he mysteriously turned and went out the back door and then started talking to the orchids. We were considering taking him to hospital, but led him into a spare bedroom and watched him over night. He remained in a weird state for at least another 24 hours (my girlfriend took a day of work to watch him). After he stopped his babbling, he became very quiet, and would not talk to anyone.",
  "We later learned that he had 'visited' several other people during that night, mysteriously leaving at some point. No-one knows how he got to Hyde park. He did strange things such as pulling out his penis and investigating it closely for hours, pretending to be eating and drinking things, talking to inanimate objects, the list goes on and on.",
  "The sad thing is that after this episode he became psychotic, and refused to talk to anyone for about 2 years, his life was ruined, and he wandered from friends house to friends house looking for food and shelter, he effectively became a hobo, disappearing for months on end. After a few years he began talking to people and learned what had happened, he was very ashamed, but still remained somewhat psychotic, he has never 'returned' from that 'holiday'.",
  "We are posting this to let others know of how dangerous this stuff is, and to stay away from it.</p>"
 ],
 "year": "1978",
 "id": "66232",
 "gender": "Male",
 "views": "13045",
 "dose": [
  {
   "time": "0",
   "amount": "6 flowers",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 ],
 "submissionDate": "2007-10-08T07:00:00.000Z"
}
