{
 "title": "Zombie Life Saver",
 "author": "bugman",
 "citation": " bugman. \"Zombie Life Saver: experience with Seroquel (quetiapine) (ID 66285)\". Erowid.org. Nov 6, 2007. erowid.org/exp/66285",
 "substance": "Seroquel (quetiapine)",
 "bodyweight": "70 kg",
 "report": "<p>I've been depressed since my early teens (I'm in my late twenties) and have been (self or not) diagnosed with OCD, BDD, GAD, Social Phobia, Avoidant Disorder, Bipolar II amongst other 'disorders'.</p><p>Deep down though, I have always thought that all of these were just labels, and that my severe depression was really a result of cognitive errors in my brain caused by stuff that happened in my childhood. Not 'mental illnesses'.</p><p>However, this last year things got really serious. I was self-medicating with marijuana, which helped me a lot, but I have a real problem when it comes to substance abuse. I became a bum - living with my parents, I didn't want to work, spending all my money on weed, hell, my motivation to do things was zero. But whatever.</p><p>Eventually, after a few very unpleasant (to say the least) experiences with alcohol+pot, I became suicidal and borderline psychotic. To me, suicide was the only solution for my pain. I actually volunteered to be placed in rehab, or to to take whatever med the doctor said to alleviate my pain. So he prescribed me Seroquel.</p><p>Well, it knocks me out completely. I have extremely vivid (and usually nice and interesting) dreams. If I try to remain awake, which is very hard (even on 25 mg), I'm a zombie. But you know what? It saved my life. While I'm still depressed and etc, this med is the perfect escape for someone who is in as much pain and in the depths of darkness as I was.</p><p>I would never recommend Seroquel as a recreational drug. I haven't abused it (no need to), but I suspect that those looking for fun might find hell instead. However, if you're thinking about how you're gonna kill yourself, this is the med to take, even if it's just to help buy some time before you do something stupid.</p>",
 "year": "2007",
 "id": "66285",
 "gender": "Male",
 "timestamp": "2007-11-06T08:00:00.000Z",
 "views": "9074",
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "(daily)"
  }
 ]
}
