{
 "title": "Energy Up the Ass",
 "author": "Nunya",
 "citation": " Nunya. \"Energy Up the Ass: experience with Amphetamines (Adderall) (ID 66297)\". Erowid.org. Nov 13, 2009. erowid.org/exp/66297",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "150 lb",
 "report": "<p>First a little background.  I've been prescribed Adderall off and on for years, for my ADD/ADHD.  I tend to build tolerance very quickly each time, so I typically avoid any sort of accelerated method of ingestion.  However, in an effort to make my prescription last a bit longer, I began looking into alternatives to oral consumption.  I read a lot of the effect is lost in the stomach.  So, to get a more efficient dose, I had to somehow bypass it.  I won't shoot up anything, and I don't snort addies anymore because it doesn't last as long and it raises my tolerance too rapidly.  So I decided to go with the rectal insertion idea.  I didn't see any articles online about amphetamine being used rectally, but there were a lot on methamphetamine so I figured it'd still be active.  Boy was I right!</p><p>T-0:  After going to the bathroom and a little preparation in the shower (lots of KY) I easily get one 10mg adderall about 2-3 inches up my ass.  Still in the shower for this.  I Took one pill out of my bottle and kept it in an empty bottle until I needed it.  From what I read pills inserted rectally need a solution to dissolve in properly.  1.5mL of water is suggested.  I didn't have a syringe or anything so I assumed the tablet would be absorbed in the KY jelly.  Then I got out of the shower and lay in bed for a few minutes to make sure things were settled properly.</p><p>T-20: Left bed and started heading to class.  Some onset effects (feel more awake, more positive)  Difficult to compare it to the intensity of oral ingestion.</p><p>T-30:  Definitely kicking in.  I feel like I have taken a much stronger dose...perhaps 15-20mg rather than my usual 10mg.</p><p>T-1.00:  I am very happy/energetic, as opposed to normal/calm/sedated like I usually get from a usual dose.  I am talking to a girl I would have otherwise ignored.  Even...listening to her.</p><p>T-1.30:  I feel like it's peaking now.</p><p>T-2.00:  Still feeling a speedy rush, but only slighter, more centered/calm now.</p><p>T-2.30:  Speedy rush gone.  I still feel very centered/extremely calm.</p><p>T-3.00:  Still calm/centered.</p><p>T-4.00:  I feel hungry.  I take this as an indicator that it has worn off.  I still feel calm.</p><p>Conclusion:  Great success!  I will try this whenever possible.  It was much more potent than oral administration, but it lasted just as long, and took effect just as fast.  There was no noticeable crash (as opposed to snorting).  I was fine with my 'usual' oral dose the next day.</p>",
 "year": "2007",
 "id": "66297",
 "timestamp": "2009-11-13T08:00:00.000Z",
 "views": "13024",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "rectal",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 }
}
