{
 "id": 6629,
 "title": "The Nervous System's Down",
 "date": {
  "submission": "2008-03-10T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Disassociative",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "15"
   },
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I can clearly remember the day that my spirit became digital. It was March, 13 2004, I remember the date because it was 1 day after my angel's birthday. We will from here on refer to her as J. It was about 6pm when we arrived at my place. I asked J if she wanted to find out what humanity really is. She smiled and said, sure. I then proceeded with the administration of 5-MeO-DMT in a 15mg dose.",
  "Upon taking the first 'hit', I began to cough profusely. It was as if I had a sore throat. I then began to feel that my body was tingling. Afterwhich, I started to slip out of my body like one would do on Ketamine. Something was odd about this dissociation, I can't explain why, but it was different than ketamine. At this point I would say that my GCS was somewhere around a 3 on the glasgow coma scale because I could still see my eyes spontaneously open. I felt like my primitive brain had taken over and the autonomic nervous system was in charge. I had taken the rest of my consciousness with me.",
  "I could see J on the couch beside me lying in the position she was in when she took her hit. As I floated there post-somatic, I began to recall one of my favorite songs, which coincidently I had playing in the background. The song was by Marilyn Manson, it was called disassociative. The song spoke of an astronaut lost in space fighting to stay seperated from 'gray earth'.",
  "At this moment, I had my vision. A blue light surrounded me; paramedics rushed to the scene and lifted my shell from the floor. I remember being wheeled into the hospital with this constant feeling of love and effiminance all around me. I could see each light pass overhead as they wheeled me to the transport. I looked down on the red amnesia skies from the helicopter. It was almost as if I was in space looking down at the world, deep and wide as a night sky echoing with a sorrow so humanitarian that it's almost grief. This was the most sensual thing I have ever experienced. I found comfort in knowing that I was human and that I was vulnerable. I blacked out at this point.",
  "The Para-medicators came to load me into an ambulance from the helipad to the hospital. Upon arrival I was rolled down the hall again and brought into a gray room where this  blue light surrounded me again. I then heard a voice cry out, 'He's not responding!'. I then watched my soul slip out of this shell and experience the cold lonely space that the Alien had told me about all along. I then realized that maybe the disassociate is not fighting to stay on earth. Maybe they are fighting to stay dead and gone. It is from this experience that I concluded that death is a feminine experience. There is this constant feeling of Motherly love. This is the reason that most children are closer to their mother than the father.",
  "After about what seemed like forever floating around in space, about the point when I realized that I was just like Major Tom. I slipped back into reality, I was lying on the floor where I had began in the first place. None of this had happened, it was all part of the vision. The paramedics had not came, I was not floating in space. I was there on the floor. 7 minutes had passed. GCS was back to 15. I still felt minor effects of the drug for about 15 minutes. When J came out of her trip, she was crying and smiling. I held her close and said, 'I love my angel'. We cried tears of humanity, and hope to dance with the stars once more. To this day, she has never told me about what she saw."
 ],
 "erowid": {
  "id": "39114",
  "citation": " Disassociative. \"The Nervous System's Down: experience with 5-MeO-DMT (ID 39114)\". Erowid.org. Mar 10, 2008. erowid.org/exp/39114",
  "substance": "5-MeO-DMT",
  "views": "2949"
 }
}
