{
 "id": 663,
 "title": "Effects Less than Expected",
 "date": {
  "submission": "2005-10-05T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Adrian C.",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "425 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>I had previously taken 12 Benadryls (300mg) and felt nothing but a bit drowsy and heavy throughout my body, and in disappointment I decided to sleep. Since then I have wanted to increase my dosage. In desperation to get high I took 17 Benadryl softgels totaling 425mg, I thought this would be an adequate dosage.",
  "12/31/01: (New Years Eve)",
  "-11:21pm:",
  "I just swallowed 17 Benadryls in one gulp, the quicker the dose the better the high as I have learned with opiates. I am in a positive state of mind, and physically and mentally prepared for anything.",
  "-11:32pm:",
  "I'm listening to some Trance music and I'm anxious for the effects to come in.",
  "-12:11am:",
  "I feel as if I have takin a large quantity of Narcotics, and a teaspoon of Nutmeg. I am quite relaxed and a bit drowsy, sounds seem more distant and it's quite difficult to carry a conversation withount slurring & repeating words. This high could also be compared to being drunk, such as carelessness and slurred language when conversing with others. My heart rate has mildly increased and  my muscles are twitching a bit. My muscles are stiff and heavy like a statue and I don't have the slightest bit of energy to freely move around. I feel as if I'm sinking deeper and deeper into my couch and I cannot get up, so heavy and OH so VERY HIGH.",
  "-12:23am:",
  "I attempt to get up and immediately fall on my ass, as I'm looking around I still dont notice any hallucinations whatsoever and I'm starting to get pissed off. I'm having no OEV's (Open eye visuals) or CEV's (Closed eye visuals), not even auditory hallucinations. I was at least expecting some hallucinations at the corner of my eye but nothing! I live in an old house and sometimes hear voices or see things when I'm sober, but I'm getting the opposite even when I'm high out of mind.",
  "-12:49am:",
  "Still nothing, this leads me to speculate some factors that could have prevented me having any visuals. Maybe it's my weight (190 lbs). The Benadryl has been laying in my bathroom for about 4 years but it's never been opened and it's sealed shut. But I am taking Prozac which is an SSRI antideppressant but it can slighty alter or reduce effects.",
  "-2 hours later:",
  "Still the same and I'm falling asleep, I would not call this a bad trip but rather a trip with no excitement. I decide to end this trip and sleep.",
  "-12:00pm:",
  "I awake with a slight hangover it's still difficult to communicate normally and I'm a little paranoid being around my parents so I try to avoid any human contact with them. I feel as if I am in kind of like a dream world and I'm a bit giddy than I normally am, I swear it feels like I'm on Nutmeg.</p>"
 ],
 "erowid": {
  "id": "11634",
  "citation": " Adrian C.. \"Effects Less than Expected: experience with Diphenhydramine & Fluoxetine (ID 11634)\". Erowid.org. Oct 5, 2005. erowid.org/exp/11634",
  "substance": "Diphenhydramine & Fluoxetine",
  "views": "25510"
 }
}
