{
 "title": "Pure Crap!",
 "author": "Kalma",
 "citation": " Kalma. \"Pure Crap!: experience with Piperazines - mCPP (ID 66309)\". Erowid.org. Feb 11, 2011. erowid.org/exp/66309",
 "substance": "Piperazines - mCPP",
 "bodyweight": "78 kg",
 "report": "<p>I was a little bored and as I had done Kratom for two days in a row (I always try to keep one day off because of its habit forming potency - at least that's what they say. I haven't notice anything like that myself) I decided to try some of this mCPP powder that I had ordered. Price was not much, 15 euros for a gram. I had tried this substance once before, but considering the effects it had on me now, I must conclude that the dose was much lower then. Earlier in the day I had take couple of small hits of cannabis and I could still feel the effects.</p><p>So I took the hit orally, wrapped in a cigarette paper. I swallowed it, drank some water. I hadn't eaten much during the day. Little piece of pizza and some bread in the morning. We had planned a musical session with our band and I had one hour time to get there. I had planned to take a bicycle, but as it was starting to rain a little bit I decided to take a bus. Bus was full. I started to get effects, calming down, a little psychedelic maybe. Nothing really special. I couldn't stand being in a bus so I hopped out before I had planned. I walked to the railway station and took a short distance train. There I found a seat where I could just sit by myself and watch the scenery outside the window. I could feel the effects. I was feeling a bit sad. I had feelings for my girlfriend so I called her and told her I was sorry that I had been so angry with her earlier the same day.</p><p>I met my friends at our training place. The effects were getting stronger. Half of our band has nothing to do with drugs, so I didnt say anything about what I had taken. I felt tired and sad. I was sad that I had taken the substance. I didnt like the effects too much. Im not a great friend of amphetamine-like drugs and this was feeling a bit like that. Well, a lot like that! Something like ecstasy and something like amphetamine, but not quite like that. There was something missing. Although the effects were getting stronger there was no sense of euphoria. I just kinda wanted it all to go away.</p><p>Which of course it didnt. I drank some beer, five to be sure, during our musical sessions. I couldnt remember how I had played the songs before. I didnt remember the chords, I had to watch them from the paper. My solos were getting crappier all the time, until finally I just couldnt even find the right key. I had no sense about how the whole thing was sounding like. I felt like everybody was a little nervous. Was it because of me? I started to get bad feelings about one of my band mates. I felt like I had never really understood what he was about. Was he a gay? I was eyeing him suspiciously and he was getting nervous. He stopped playing and went to kitchen. I wanted to shout, maybe crash something. There was tension in the air but no way to stop it. I closed my eyes and tried to concentrate on the music, which was not easy.</p><p>At the end of our music session I apologised for not being in a very good mood. I started my trip back home in the bus. The bus was full again. Half way through my 45 minute journey I decided to jump off. I couldnt stand sitting in the bus. I had a feeling that the silent messages I was giving from myself to others, were something different than I had hoped for. I was getting a little paranoid. I bought six beers and went to see my mate. I gave him two beers and drank four myself. Cigarette tasted good. Feeling was better now that the drug was coming down, the alcohol was kicking in and that I didnt have to play any instrument. I felt pretty good!</p><p>My friend went to bed and I continued my way back home. I was feeling now like if had taken some crappy speed. There had been some sympathetic feelings during the evening, but for most of the time I had been feeling just lonely, because nobody around me was in the same state of mind as myself. I didnt want to watch people in the eye. I felt like some kind of outcast. I didnt fit in. I felt bad. At the same time I felt a little euphoric. The beer had made me felt better. As I approached home I felt good and when I met my girlfriend I felt even better. We talked a bit. I didnt tell what I had taken, but told her that I hadnt played well and that there was something bad about the chemistry in our band (should have said: in my head). We watched some television. I felt a little bit outta my head, but otherwise just fine. We went to bed. I took some valerian and fell asleep. No problems with that. Not until I woke a little later and started to vomit some black stuff. I felt like there was a hole in my stomach and a burning sensation in my kidneys. I slept a little bit, woke up again, vomited again, didnt have any Rennie [antacid]. Wished I had. Slept, woke again. Burning sensation in my stomach and kidneys was still there. I ate some yoghurt, drank lots of milk and some water. Head ache had also started. Took some paracetamol, took 5-HTP, got a little better and slept for a few hours more.</p><p>Overall I had a feeling that the whole thing was rather useless. The trip had some pseudo-psychedelic thing in it. Bad things came to mind, but unlike with some real psychedelic stuff there was no therapeutic value in it. They just were there, like statues in my head. I felt stupid and clear at the same time. Mixed up, but still in control. The worst part was the night. In my experience it was all just too artificial. I like quality drugs, not just getting my head in some strange useless state, like this one did to me. From now on I will stick to kratom and cannabis, which is a good combination and has very little harmful side effects. Besides mCPP I have once tried combination of BZP and TFMPP and from this little experience that I have with these chemicals, I can say that they are pure crap.</p>",
 "year": "2007",
 "id": "66309",
 "gender": "Male",
 "timestamp": "2011-02-11T08:00:00.000Z",
 "views": "8279",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "30 mg",
   "substance": "oral"
  },
  {
   "time": "Piperazines - mCPP",
   "amount": "(powder / crystals)",
   "administration": "",
   "substance": "3000 ml"
  },
  {
   "time": "oral",
   "amount": "Alcohol - Beer/Wine",
   "administration": "",
   "substance": ""
  },
  {
   "time": "0",
   "amount": "oral",
   "administration": "Valerian",
   "substance": ""
  }
 ]
}
