{
 "id": 6632,
 "title": "Three States of Mind",
 "date": {
  "submission": "2008-03-24T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Colorful Chaos",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "specific": "P. cubensis"
  }
 ],
 "report": [
  "To begin with what state my mind was in before I ate the mushrooms, I had just topped off a 5 day meth binge the night before. So my brain was very weak, and it turned out I went much much deeper into the psychedelic void than my friend did who also ate a 1/4 ounce. We took closed cap cubensis, grown by a friend who definitely knows what he's doing. We had a few beers in us when we ate the shrooms, and washed them down with beer so that would also contribute to the intensity.",
  "So Im in a beautiful mood, I got shrooms in my belly, my favorite mind altering substance, and I was about to experience my second laser Floyd show. So we munched them down, and literally seconds BEFORE I ate the last cap I was feeling it in my veins. 5 minutes after we finished them we were frying balls already, so naturally we got scared considering we had quite a bit more of those crazy 5 minute explosions until we peaked.",
  "Soon my visuals started off kinda merged with imaginary sounds. Sections of cars in front of us, as we were driving down the road, were like flapping and making this crazy clicking sound and as I watched this amazed at the uniqueness of the visuals, my mind felt like it was expanding, and expanding, and expanding, until it couldn't expand no more, then it expanded again and every piece of my mind was rapidly spiraling down a vortex of fear, pain, suffering. I was convinced that my death had already been played in the cards and the place I perceived myself to exist in was like a spiritual waiting room, like a place for souls to wait while the unknown entity processes the extinction of your spirit. I was convinced I was already dead and I was SOOOO scared because I KNEW my immediate future involved nothingness.",
  "I walked around asking people for water, every one I saw I asked because my mouth was so dry, all I wanted was to be comfortable and hydrated while I was awaiting nothingness. Intense deja vu plagued me, it seemed as if this place I were in, I had seen before birth once, and some spiritual being let me know, before I was born, that the next time I saw this place would be the end of my indulgence of existence. That's why I was so convinced. That lasted about 45 minutes, we never made it into the Floyd show because I kept saying, almost in tears, 'Dude, NOOO!!!!! I don't wanna die.' We wouldnt be able to handle lying on the floor in this state of mind for like 2 hours.",
  "After I figured out this WASN'T the afterlife, and I WASNT being erased, we went exploring, Seattle was officially our playground. There's three major states of mind that occurred after that but I cant remember which order they were in. One of them I remember the fear going away and a crazily deep bliss, acceptance, and happiness welling up from an unknown source, an intriguing source. Then I just kinda separated into two...one was my mind and my body down on earth and the other was my soul, an astrally projecting soul being introduced to this place in the sky betwixt the air clouds and sun rays. This place had other bodyless souls and the energy I felt spewing out of them told me they were part of a perfect existence and they were ALWAYS satisfied with everything. The sun was shining up in this place, smiles felt warm on my skin, I saw a waterfall made of tiny crystals. I just floated around this oasis in the sky as if some other form of energy were directing me around, showing me everything there was to see up there",
  "Then it gets cloudy after that. Heres number two of the three states I mentioned. Most of my soul was back down on earth along with my mind and body, but I was NOT any more towards sober. I was still peaking. I was in a chaotic state of mind, very disturbed but very much loving the feel of living. I was delusional. I thought like every ten seconds that cops were chasing us. One time I had stopped to think about something and I even heard the cops breath on my neck and then when the imaginary cops spoke, it was like a robotic kinda eerie sound that for some weird reason I knew what translated to.",
  "Then once again, it gets a little cloudy after that. Then, the other of the three major trip states was just my psychedelic trip climaxing to a fit of intense exhilaration like I was seeing everything for the first time. I felt like I could do anything. I was just jumping around, stuck with a very small vocabulary which consisted of, 'Did ya see that?!?! Did ya see that?!?!' That's all that would come out of my mouth for like 2 and a half hours. Then there's a gap, I don't know how big, in my memory from there until I floated down to my find my body lying on a blanket of fallen leaves, giggling and moaning.",
  "I sat up, it was as if the crazy chaotic structure of our scatter minded trip was reassembling and we were becoming normal again. I looked at my feet and all I saw were a pair of socks. I had SOMEHOW lost my shoes in the wave of madness we had just surfed. So obviously we were coming down by now. We got up, looked around and figured out where we were and exchanged a few words of how satisfied we were with what came from that journey.",
  "This trip was kinda short but time had no meaning because it felt like at least a 3 day experience, so if I experienced 3 days and it was only 5 hours, authentic time doesnt really matter now does it? But it was more psychedelically chaotic than ANY other trip off LSD or AMT or mescaline in my life. This trip blew all my past experiences out of the water. I am forever changed and somehow enlightened as a result. I'm also very grateful and thankful that all the things I was afraid of throughout the trip were not real and did NOT happen. I couldnt really sleep well that night, I had SO much on my brain. So that's my life changing experience."
 ],
 "erowid": {
  "id": "39119",
  "citation": " Colorful Chaos. \"Three States of Mind: experience with Mushrooms - P. cubensis (ID 39119)\". Erowid.org. Mar 24, 2008. erowid.org/exp/39119",
  "substance": "Mushrooms - P. cubensis",
  "views": "2480"
 }
}
