{
 "title": "Do NOT Take Together",
 "author": "Adult Adder",
 "citation": " Adult Adder. \"Do NOT Take Together: experience with Tyrosine (L-Tyrosine) & Amphetamine (Adderall) (ID 66398)\". Erowid.org. Oct 17, 2007. erowid.org/exp/66398",
 "substance": "Tyrosine (L-Tyrosine) & Amphetamine (Adderall)",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  "500 mg",
  "oral",
  "Tyrosine",
  "",
  "",
  "20 mg",
  "oral",
  "Amphetamines",
  "(capsule)"
 ],
 "report": "<p>Background: I was recently diagnosed (at 43 if you can believe it) with Inattentive Type ADD and was prescribed Adderall XR 20mg, which I take as prescribed orally once a day.  In researching ADD after my diagnosis, I found that several sources, including Dr. Amen of ADHD Amen Clinic fame, advise ADDers to supplement with (smart drug) l-tyrosine.  L-tyrosine is an L-DOPA precursor which is itself a dopamine precursor, and ADDers are pretty short on dopamine all around.</p><p>I had read that individual reactions to l-tyrosine could vary quite a bit, and that some people have unpleasant side effects such as increased heart rate, elevated blood pressure and arrythmia.  Fortunately I noticed nothing of the kind myself with l-tyrosine, and consequently was taking 1 500 mg l-tyrosine (drug stores sell with the vitamins) 3 times a day for a total daily intake of 1500mg.  I found it helpful.</p><p>One day I took the l-tyrosine 500 mg pill and an Adderall XR 20mg together (quite by chance, on all other days I had taken the l-tyrosine at least T+2:00 and later from the Adderall).  Don't take these together, kidlets, they don't play well.  T+3:00 to T+5:30 were not fun.  Pounding heart, heart rate increase (120-140), pressure behind the eyes (=elevated BP), waves of nausea/wired-ness especially when another level of salt kicked in from the Adderall, feeling faint/must lie down, and a very uncomfortable, sore and worrying tight throat around the adam's apple, making swallowing disturbingly difficult and painful.  It felt like Darth Vader had me against the wall off my feet and was squeezing, per 'Star Wars'. Slight fear/paranoia/panic/what is happening, concentrating on any symptom would immediately make it worse.  Breathing was OK tho.  While not emergency room calibre, this was a VERY unpleasant 2 1/2 hours and I am writing this report to save someone else from it!!!</p><p>After I figured out it must be the tyrosine with the Adderall that was the problem (as Adderall alone had always been fine), a look at the l-tyrosine bottle finds magnesium stearate as a non-medicinal ingredient.  Magnesium in any form taken with Adderall increases Adderall bioavailability (dangerously?) and is warned against in the Adderall information pamphlet with your prescription. </p><p>So a double whammy here: 1. Adderall + l-tyrosine together seems to increase the bad side effects of each, 2. the magnesium in the l-tyrosine pill acts to boost the amount/speed of the Adderall effect.  DO NOT TAKE SIMULTANEOUSLY.</p>",
 "year": "2007",
 "id": "66398",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-10-17T07:00:00.000Z",
 "views": "35921",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Tyrosine"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": "20 mg",
   "substance": "oral"
  }
 }
}
