{
 "title": "A 4am Fire Alarm",
 "author": "one01",
 "citation": " one01. \"A 4am Fire Alarm: experience with Mushrooms (P. cubensis), DXM & Cannabis (ID 6639)\". Erowid.org. Mar 18, 2002. erowid.org/exp/6639",
 "substance": "Mushrooms (P. cubensis), DXM & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.25 oz",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   " T+ 1:30",
   "1 cup",
   "oral",
   "DXM",
   "(liquid)",
   "",
   "1 bowl",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "report": "<p>This experiece happened in spring term of 2000.  A friend had aquired an ounce of prime cubies and it was decided we would split it between 4 people.</p><p>After aquiring my dose, I put the mushrooms in a blender and filled it with O.J.  I drank the discusting mix (I hate the taste of mushrooms) and after 15 minutes of trying not to throw up my stomach calmed and I was able to relax for a bit.  It was about 8pm now. Me and one of the other guys decided to go for a walk through the small college town after about an hour of watching T.V.and vegin' out. As soon as we got to the main street, the mushrooms started to hit.  I had a horrible case of the giggles and I wanted a smoke.  Neither of us had any, so we were out of luck, or so we thought. Lo and behold, a car drove by, yelled some obscenities and through a pack of GPC's at us!  Now, GPC's aren't the most great tasting smokes, but anyone who's tripped before knows that cigarettes are like the WATER OF LIFE when you're tripping.  ANYWAY...</p><p>We walked by the local drugstore, and by this time (an hour and a half or so had passed)  I was having trouble walking.  It was quite interesting, the store, cars, and street all seemed to originate from the same point... it's hard to describe. Anyway this guy (my friend) turns to me and asked if I had ever robo tripped and shroomed at the same time. I am quite experienced in both, but as of this point, I had never combined them.  He began to explain to me that relatively low dosages of both put together amplify the effects GREATLY.  I said, well lets go for it. I gave him 7 bucks and he went in (I was affraid to go in because I was starting to peak).</p><p>He got it and we went into the back streets to dose.  I drank the bottle (robo tastes like fucking shit) and I began to feel it almost imedeatly.  After 10 minutes I could feel my body begin to get distorted.  This made walking even more difficult, for it felt like my legs were of different lengths and were constantly changing lengths.  My depth perception was going as well.  My friend went to go throw away a wrapper for a taco he had bought at the store, and I stayed because I was afraid to walk to the trash can.</p><p>Watching him throw it away has got to be one of the most fucked up things I have ever seen while tripping.  He didn't walk to it, but rather the world began folding over into itself, allowing him to walk in place, but still get to the trash can.  When he walked back to me, the world unfolded and returned to normal.  He asked me if I was OK because I had turned completetely white.  I said no, because I was starting to panic, I had not expected to robo to act the way it was or so fast for it had only been 20 minutes since I drank the bottle.  I ased him to take me back to my dorm. He walked me to my dorm, thank god too because I forgot where I lived what floor, and what room.</p><p>I asked him to leave because  I wanted to be alone to meditate, to get my bearings back.  BIG MISTAKE. As soon as he left my trip got more intense.  I remember lieing in my bed and starring at the ceiling.  It looked like there were countless bodies trapped in the ceiling and they were trying to escape.  The ceiling appeared to be made of a fine clothe, and I could see their hands reaching towards me, and their facing, screaming trying to escape.  While this was going on, a soft buzz started in my ear and grew steadily louder until it was unbearable.  It turned out this rumble, was me screaming at the top of my lungs,  causing my roommate to come running down the hall to our dorm.  As soon as he came in the noise, and faces stopped and all I saw was him lieing over me asking me if I was OK.  I told him I was and that I was frying extremely hard and not to freak me out and if he would stay with me til I came down a bit.  He told me ok, and then he precdeded to load up a bowl. </p><p>'This will calm you down bud' he said.  This made me sooooo nervous, but I figured I was just tripping and he would take care of me.  We smoked the bowl, and I found out that this was another BAD idea.  As soon as we were done, I began to take off again, this time it felt like I was going through a wind tunnal at lightspeed, leaving my body behind.  For s plit second it felt like I knew everything, and was experiencing everything at the same time... this seemed like hours upon hours upon hours...</p><p>The knock on our door snapped me out of it.  It turned out to be campus security.  Our smoking had reaked the entire hall and someone had ratted up out.  I started to freak out, I began to cry, but the officer didn't notice.  My roomie managed to not only convince him it wasn't us smoking pot, but to leave us alone and not search our room.  We were sooo lucky.</p><p>And then the phone rang and my roomie answered it.  As I laid in my bed and listened to him on the phone, he began to slow down to almost a crawl.  I don't mean his speed I mean everything.  HE sounded like what it sounds like when you tape a record on a record player and slow it the hell down, but his movement were also doing it.  Then he began to speed up and he sounded like a chipmunk.</p><p>And then to my dismay he began to talk, move, and walk backwards!  This freaked my out and I begged him to get off the phone, but I realized I couldn't speak properly.  Later, he said I was making incorant babbling.  He could tell I was distressed though and got off the phone and put on some Greateful Dead.  This mellowed me out enough to I could lie down, close my eyes and meditate.  I saw the mosaic of buddha with a million arms in a million collors flying through space, changing into every form of religious symbol in the world.... crosses, saints, stars of davids, pentagrams, everything... it began to speed up...</p><p>All of a sudden my roommate jumps down from his bed, in his underwear saying there was a fire... I looked over at my alarm and it was 4am!  I must have passed out, and the funny thing was was that I was still tripping hard...</p><p>After he got his pants on, he helped me outside.  The hall was something else.  The fire alarm was goin very loudly, people were running arround, and my R.A was knocking on every door screaming FIRE FIRE!!!  Needless to say in my state, I was very scared. Somehow we made it to outside the building and the last coherant thing I remember was sitting on the curb in my PJ's crying...</p><p>Nothing else of interest happened that night but I learned quite a bit:</p><p>1)DON'T MIX DRUGS IF YOU DON'T KNOW WHAT IS GOING TO HAPPEN</p><p>2)CHOOSE YOUR SETTING SMARTER THAN I DID</p><p>3)IT'S GOOD TO HAVE FRIENDS WITH YOU TO CALM YOU DOWN</p><p>My opinion is, no matter how hard you are frying, and how scared you are, nothing will bring you down and calm you better than a friend comforting you.</p><p>I hope this was an informative and entertaining piece.</p><p>PEACE!</p>",
 "year": "2000",
 "id": "6639",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-03-18T08:00:00.000Z",
 "views": "14939",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "0.25 oz",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ]
}
