{
 "title": "Beautiful",
 "author": "Jessica",
 "citation": " Jessica. \"Beautiful: experience with Cocaine  (ID 66395)\". Erowid.org. Sep 25, 2009. erowid.org/exp/66395",
 "substance": "Cocaine ",
 "bodyweight": "130 lb",
 "report": "<p>So I've been doing cocaine on a regular basis for about two years now. I guess I'm one of those addicts you'd call 'functioning' I go to a great university and I manage to keep friends and relationships and a steady job, etc... But non-the-less definitely an addict and I really have no intention to quit especially after the other night...</p><p>See I really like needles and I've done heroine a few times in the past and my friend S and I were sitting around with an 8 ball of coke. We had attempted to inject it before but had made the mistake of cooking it first. So we said what the hell, let's try it un cooked. I went first. I dropped the little rock-probably equivalent to a nice line-into the water and mixed it up with the small side of the plunger. It dissolved instantly, a sign of good coke. I put the needle back together and sucked the mixture into the shaft. I pulled the belt tight around my arm and plunged the needle into my vein. I pulled back and instantly saw blood. This caused my heart to race and I pushed the plunger forward.</p><p>Instant euphoria. I tasted the coke in my throat first, then noises were amplified, and then my body felt like it was floating - basically it felt like an orgasm but better. I was in heaven, I was God. I was warm happy and euphoric. My heart was racing and my blood was pounding, words can't really describe how amazing it was.</p><p>My friend S did her shot and instantly felt the same way. We continued to do the rest of the ball, commenting all the while about how shooting it was much better it was then snorting it. For one it doesn't clog my sinuses and it's a much cleaner high. Then after it was gone the crash came but then it was over. I typically get really depressed for a hour or so but shooting it makes the crash much more bearable. It just puts my body back to normal, no depression or anxiety, again it's amazing.</p><p>Shooting cocaine is literally the best feeling I've ever had followed by the least depressing crash I've ever had, so quitting is definitely not in my near future...</p>",
 "year": "2007",
 "id": "66395",
 "gender": "Female",
 "timestamp": "2009-09-25T07:00:00.000Z",
 "views": "12303",
 "dose": [
  {
   "time": "0",
   "administration": "IV",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ]
}
