{
 "id": 664,
 "title": "The End, or so I Thought",
 "date": {
  "submission": "2007-06-06T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Redwood Queen",
  "gender": "Female",
  "weight": 55
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "dried"
  }
 ],
 "report": [
  "I was at a Reggae concert when a stranger approached me.  It was 8 o'clock on the second night of the three day concert, and he looked to be in his mid-40's.  He offered me an eigth of cubensis for 20 dollars.  I declined that offer, and proposed to him that we trade substances, for I had more of this fantastic strain of pot than I needed at the time, and I was hoping to achieve a better mushroom experience than the last panic-stricken hellish time I had spent in the fetal position in the back seat of a friend's car. That time, I had known without a doubt that I had been abandoned and would suffer greatly at the hands of some unseen evil, and then, eventually, die. As we all know, mushrooms vary greatly by variety as it relates to the experience, and this time, at this Reggae concert, I was hoping to settle the score with my foe, psilocybe cubensis.",
  "The man was thrilled, and we made the trade, wished each other well, and continued on our respective ways.  The rest of the night was fairly uneventful, and after drifting off to sleep, safe in my tent, I awoke to a beautiful cloudless day.  I wandered over to the area where my closest friends also attending the concert were, but was turned away by the people watching the gate.  My friends were part of the food service crew, and therefore had different wristbands, wich gave them the priviledge of better camp sites, etc.",
  "Then another friend came along, I told her my plight, and she bravely led me through the gate and past the 'guard' to the cool and shady other campground.  I came upon the circle of tents I knew to belong to the group I was seeking.  There was a tarp partly supported by a bamboo fence which created a sort of living-room area between the circle of tents. The man I had been looking for sat there on the ground talking to a friend.  When he saw me, he rose and we embraced.  We began talking about various things, and the topic turned to mushrooms, which, it turned out, we both possessed at the time.  We decided to take them together and proceeded to do so, munching them down wrapped in a slice of wheat bread.",
  "In about 30 minutes, I began to feel the effects.  Silence fell over me like a curtain.  Speech seemed a profanity, to disturb such precious thought.  I was moved by the beauty and comfort I experienced.  I loved everyone and everything.  Lying on my back on a pile of sleeping bags, I contemplated the tarped ceiling above me and, lo and behold, I began to make out the perfect profiles and flowing golden hair of angels, their visages tesselated for me and me alone.  I stared at the tarp, undulating slightly in the perfect breeze, and heard their sweet voices, whispering assurances to me, sounding like heaven.",
  "My attention was distracted and I glanced at the bamboo fence mentioned earlier.  To my horror, it was not made of bamboo, but instead imaciated bodies of what appeared to be tiny people were aranged vertically and woven together in place of the sticks I had seen previously.  Every nick and mark on the fence appeared to me to be tiny horrified faces, limp arms and legs, dark exposed crotches and breasts of these people who in my mind had been brutally killed and hen arranged in this way.  Also, the bodies appears to be rotating counter-clockwise in a hypnotic anner.  I saw in their suffering as the suffering inflicted universally by the strong upon the weak.  Before me was the agony of the innocent in what appeared to be hell, and above me was the perfection of heaven.  I am not a religous person, but the images I was witnessing were making me wonder.  Could there be more to our world than I initially thought?",
  "The object of my affections at the time (let's call him Jeff) asked me to go swimming with him.  We made the journey along the sun-baked rocks, past the guard and weaved our way through the tents to the deep green river.  I was scantilly clad and removed my sandals and walked in.  The deliciously cool water enveloped my skin.  It was the most wonderful experience I had ever had, and after a brief dip, he and I wandered back to his tent, retracing our steps to the guard post.  There was a new person there who refused to let me in.  All of my belongings and senses of comfort were within that campground.  Rather than arguing with the woman, I let Jeff speak for me and I stared at the dust on the ground, dumb-struck that this person, in the face of such mind-bobbling beauty, could care about something like a wristband.",
  "Jeff eventually convinced her to let me pass, and we walked back to the tent contemplating the insignificance of the womans protest.  When we got back to the circle of tents, Jeff asked me to go into his tent with him, and I accepted.  Bear in mind, it was about noon and 90 degrees in the shade at this point, and going into the sauna-esque tent was most appealing at that point.  We retired to the air matress inside and began a long and meaningful talk about our current experience.  We wound up intertwined and I naked, slipping in and out of consciousness.  I can only guess it was the heat that caused it, but unlike the hyper-alertness I usually experience during a mushroom journey, I was totally lethargic.",
  "A thought slinked into my mind.  What if the kind stranger I had procured the mushrooms from had made a mistake? Could they have been deathcaps?  I didn't know.  I began focussing all of my energy on maintaining control of bodily functions.  It was blindingly hot in the tent, so I kept my eyes closed for much of the time.  I became acutely aware of this smell, highly unpleasant and mildly nauseating.  I was sure that I was in some way responsible for it.  I opened my eyes one more time, looked directly into Jeffs, and he said the two most profound words I have ever heard in my life.",
  "'Don't Die,' he said.  My mind careened out of control.  I knew I was dying.  It had to be true, I respected Jeff's knowledge and opinion enough to know it had to be true.  His fears were mine, and then it happened.  The bright light appeared before me, overwhelming me with the glory of it.  I heard voices speaking faintly in languages I didn't understand.  I saw the faces of my family, smiling and bidding me a safe journey.  It's all going to be okay, I thought.  This is only one more step.  Living, Dead, what does it matter?  I am me, and I understand, I thought.  It was like a bolt of lightning, and I felt it to my core.",
  "I welcomed my own death, reaching out to it with open arms, longing to taste it, to experience something completely new.  I was ready.  I remained in this deeply meditative state for about an hour and a half, jostled from my dream-like trance by the noise of the camp around us.  I heard voices of the other revelers outside the tent, whoops and laughs and raised voices.  It was time to go rejoin society, I thought.  I put my clothes on and someone opened the tent and we re-joined the gray and wasted world outside.  I took with me the knowledge that I had confronted death, stared it in the face, embraced and explored the threshold and then returned to the world of the living unscathed.  Any substance capable of allowing a person to leave themselves in this way is truly a gift from the divine."
 ],
 "erowid": {
  "id": "11635",
  "citation": " Redwood Queen. \"The End, or so I Thought: experience with Mushrooms - P. cubensis (ID 11635)\". Erowid.org. Jun 6, 2007. erowid.org/exp/11635",
  "substance": "Mushrooms - P. cubensis",
  "views": "2674"
 }
}
