{
 "title": "Recreational Use=Shitty Day",
 "author": "wizardinblack",
 "citation": " wizardinblack. \"Recreational Use=Shitty Day: experience with Buprenorphine & Naloxone (Suboxone) (ID 66473)\". Erowid.org. Jan 31, 2008. erowid.org/exp/66473",
 "substance": "Buprenorphine & Naloxone (Suboxone)",
 "bodyweight": "185 lb",
 "report": [
  "<p>A friend came by my house early one morning (about 9 am, early for me) to hang out. I had a slight hangover (mild headache) from shitty beer and not enough sleep. At about 10:30 he asked me if I would like to take some pills, and I asked him what kind. He said 'Suboxone', which he said was like taking a few percocets, but different in a way he couldn't explain. I've always enjoyed the 'minor' opiates, so I said sure. We planned on taking the suboxone and going to the music store to check out gear.",
  "I decided to take a half of a 5 mg tablet to be on the safe side. [Erowid Note: Suboxone is available in two dosage strengths, 2 mg buprenorphine and 8 mg buprenorphine. No '5 mg tablet' is available as far as we know.] I placed it under my tongue and we went out in my yard to walk my puppy a bit. Within 10 minutes I started to feel that tingly feeling, and I knew then that I had made a mistake. It was coming on WAY stronger and faster than any percocets I had done. I felt clumsy  so we went back inside. I sat down on the couch and BOOM, overwhelming nausea. I couldn't get up, I couldn't keep my eyes open without the room spinning, and I could hardly talk for fear of throwing up all over the place. I had the 'pleasant' body high going, but the nausea over-shadowed it. My friend apologized profusely, because he had taken 2 whole tablets and felt fine. The problem was, he takes opiates (vicodin, percs, etc) on a fairly regular basis. I hadn't taken any in months.",
  "The rest of the day was spent on the couch sitting in the same position and keeping my eyes closed. Around 7 pm I started to feel a little better, and I decided to try and eat (I hadn't all day). I made a very plain sandwich of turkey and bread, ate it and had some water, and about 5 minutes later I was on my knees puking into the bowl. After that I went to bed. The next day I felt extremely strange, still a little sick, and anxious.",
  "All in all I would advise against the use of suboxone unless you are withdrawing from opiate addiction. It is much stronger than it seems and is meant for people who have a tolerance to opiates.</p>"
 ],
 "year": "2007",
 "id": "66473",
 "gender": "Male",
 "views": "27130",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "sublingual",
   "substance": "Naloxone",
   "form": ""
  }
 ],
 "submissionDate": "2008-01-31T08:00:00.000Z"
}
