{
 "title": "Euphoric High, Sleepy Low",
 "author": "Concerned User",
 "citation": " Concerned User. \"Euphoric High, Sleepy Low: experience with Gabapentin (Neurontin) (ID 66493)\". Erowid.org. Jan 12, 2011. erowid.org/exp/66493",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "Tryptophan",
   "(pill / tablet)",
   " T+ 0:00",
   "600 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)",
   " T+ 3:00",
   "300 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)",
   " T+ 5:00",
   "300 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Came across some Gabapentin, after researching it's effects and to try and find the correct dosage I decided to take it on my Day off, in case I became too groggy and tired to do much else. I expected a good high with some sleepy after effects and that's exactly what I got.</p><p>Started with 2x 300mg pills around (11am) . I was at home with my roommates the plan was to go to the mall for the day and run some errands, I figured this would be perfect. Onset was slow didn't feel much but was very excited and anticipating the high. About 2 Hours after dosing (1pm) I began to notice a persistent smile on my face and began to feel calm, relaxed and slightly euphoric, 30 minutes later (1:30pm) my arms and legs began to feel light and easy to move.  The feeling was akin to MDMA without the tactile, visual and auditory sensations. At this time (2pm) I dosed with another 300mg pill in an attempt to intensify the effect. I played some video games and found myself extremely focused on the game, my roommates left without me to do some errands while I played. I became engrossed with it until my roommates returned and we left to go to the mall. (3pm)</p><p>As I stood I felt slightly inebriated my arms and legs were functional, but it was clear to me I was slightly impaired, like a slightly strong buzz of alcohol. The euphoric feeling remained, I sang in the car to many songs (much to the dismay of my roommates). Another hour passed and I took a final 300mg pill. (4pm). I went to the mall and was thoroughly enjoying the sights and sounds. The euphoric feeling can still be felt and I was extremely talkative conversing with many of the workers at the mall stores. The world was great nothing could go wrong. On the car ride back I began to feel very tired, If I didnt focus on something or try to stay awake I began to dose off. If I closed my eyes I would fall asleep almost instantly and awake a minute or too later. (530pm)</p><p>At the time of this report (6pm) it is 7 hours since my first dosing and Im still feeling the positive effects, however the drowsiness and lethargy is more pronounced than at the beginning of my trip. I found stretching and extension of my appendages intensified the feelings. Sex was not impaired and was slightly intensified, orgasam was delayed slightly more than usual (which was a good thing ).</p><p>In addition to this drug I took 100mg of 5-HTP (Hydroxtrytophan) in the morning, not sure if it has any effect on the Gabapentin. Overall a great drug with acceptable side effects and long lasting effects. I am opiate tolerant and this was a good substitute.</p>",
 "year": "2007",
 "id": "66493",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-01-12T08:00:00.000Z",
 "views": "106585",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Tryptophan",
   "form": "(pill / tablet)"
  }
 ]
}
