{
 "id": 6655,
 "title": "Passed Out",
 "date": {
  "submission": "2011-01-11T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lantano",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "cap"
   },
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  }
 ],
 "report": [
  "I am certainly a professional in the realm of drug experimentation and saw no reason to be anything but mildly cautious with my first experience in GHB.  I drank nothing that night and had smoked just a little marijuana.  My freind gave me one cap full citing that he had already taken three (and ended up taking over ten that night). ",
  "Within thirty seconds I began to feel the nausea I sometimes feel when getting motion sickness in the car or on a swing.  Around the two minute mark there was a short period where the nausea subsided and i began to feel what i am sure is the high of this drug.  Strangely euphoric and a beautiful, slightly numb body high.  This lasted less than a minute.  My last memmories were trying to type something on a keyboard and thinking how lovely the keys felt against my face.  ",
  "I woke up three hours later lying on a couch with my concerned girlfriend helping me throw up into a garbage can.  Someone had laid me out face up on the couch after i had passed out at the computer.  About an hour later someone else noticed i was throwing up in that position and my friends pretty much hung with my unconscious throwing up body for the next two hours. ",
  "I have never had any allergies to anything and tend to be a rather robust partier when the moment calls for it.  I dont know how you can tell if you are going to have this same reaction but my intuitive theory is that if you are susceptible to motion sickness stay away from the shit."
 ],
 "erowid": {
  "id": "39193",
  "citation": " Lantano. \"Passed Out: experience with GHB (ID 39193)\". Erowid.org. Jan 11, 2011. erowid.org/exp/39193",
  "substance": "GHB",
  "views": "5058"
 }
}
