{
 "title": "Fading Care of Feelings",
 "author": "Ghost301",
 "citation": " Ghost301. \"Fading Care of Feelings: experience with Anadenanthera peregrina (ID 66568)\". Erowid.org. Oct 30, 2007. erowid.org/exp/66568",
 "substance": "Anadenanthera peregrina",
 "bodyweight": "145 lb",
 "report": [
  "<p>Prep.:",
  "The seeds are baked by placing a seed on top of a lit light bulb seems to work for me better than in a stove or any other. Seeds are crushed in a mortar and pestle to a very fine powder. Then seeds are mixed with baking soda and a bit of water. After placing the brown sludge over a lightbulb set in a lamp I waited. After the mix is completely dried I crush it again in the mortar and pestle. It is ready.",
  "Setting and Mind Set:",
  "Sitting in my room very anxious. This would be my second yopo attempt first attempt was ill prepared and gave me all the bads without the goods. I sat there with well prepared powder in a medium sized line breathed in and out and dove in. One nostril, Two nostrils. Oh god it burns. I run into the bathroom and calm myself down.",
  "Experience:",
  "T=+0:30",
  "In the bathroom staring at myself in the mirror. My Shower is on to calm me. The pain is intense but not anything i can't handle. My face is burning and drool is coming out of my mouth. I know that soon I will be vomiting. Correct, I am currently vomiting but the effects are starting to kick in so I really don't care my vomit actually looks neat in yopo vision and I'm staring at it.",
  "T=+5:00",
  "The effects are now full blown there are many colors and if I close my eyes I can see a spirograph spinning out of control. I decide to take a shower just to experiment it is very relaxing and to my surprise i notice all feelings have become simply feelings. It was like if I feel pain and I tell myself that it is all in my mind. All feelings did not feel good or bad they were just feelings. Moving around is also very easy.",
  "T=+15:00",
  "I'm done with my shower and lay down in my bed I feel very good and all effects are still the same. I turn on my Zen CD for some peace.",
  "T=+30:00",
  "The effects start to change. Now there are transparent planes All over my room. It looks like there are windows all over my room. Also my room is green.",
  "T=+35:00",
  "My ceiling is moving and there are transparent tentacles coming out of my ceiling light. There are also geometric patterns all over the ceiling they look very fancy.",
  "T=+45:00",
  "I look up at three dots on the ceiling and realize that this must be how people made up star constellations. These three dots make up a horses face but look nothing like a horse without the yopo.",
  "T=+65:00",
  "The effects are gone and I feel great I turn on family guy and have some good laughs.",
  "All in all this was a great experience and I can't wait to try again with lime in the mix. A word of advice is when this stuff is in your nose don't breath in through your nose and blow the stuff out when it starts to take effect.</p>"
 ],
 "year": "2007",
 "id": "66568",
 "gender": "Male",
 "views": "4943",
 "dose": [
  {
   "time": "0",
   "amount": "3 seeds",
   "administration": "insufflated",
   "substance": "Anadenanthera peregrina",
   "form": "(ground / crushed)"
  }
 ],
 "submissionDate": "2007-10-30T07:00:00.000Z"
}
