{
 "title": "Bill The Trip Gnome",
 "author": "Colleen C.",
 "citation": " Colleen C.. \"Bill The Trip Gnome: experience with LSD (ID 6661)\". Erowid.org. Mar 23, 2002. erowid.org/exp/6661",
 "substance": "LSD",
 "bodyweight": "122 lb",
 "report": [
  "<p>I have taken LSD many times. There are only a precious few trips that really stick out in my mind as an EXPIERIENCE, this is a letter about one of them. I was with my best friend/trip buddy Meg, and we decided to go to a party and take some acid. My other friend Nikki and her date (a guy i never met before) decided to come to the party with us, and trip also. This was fine because i love Nikki and this guy she was with was cool and had a positive attitude. On the flipside, the party we were going to was going to be intense. A lot of my ex-girlfriends were going to be there along with people i didnt like and a lot of strangers. The party was at a 2 floor apt. in a bad city. During recent acid trips my best friend Meg and I had we became bonded with this ceramic garden Gnome that i had in my room. For reasons i cant explain he was our tripping buddy and we named him BILL THE TRIP GNOME. He has a wise smile on his bearded face and seems to have brought us peace and comfort during our recent acid trips. We knew it was gonna be a crazy nite, so we all decided to bring Bill the Gnome to the party with us. I put him in my backpack along with other things to prepare me for the nite. I alwasy have certain things with me if im doing acid away from home, the things i brought that nite besides Bill the Gnome were, some beer because i like to drink a little when i trip. I also brought a change of clothes in case i did something stupid and got dirty or sweaty. I also had my glow toys which included a squishy glow ball(red) and green glow sticks. I also have asprin just in case of a headache. So I was prepared physically and mentally for a good trip...",
  "Knowing Bill would be there gave me a really good vibe for the nite. We dropped in the car on the way to the party at about 9pm. The blotters were named MAGIC, which i liked because i wanted it to be a magical evening. It kicked it quick for us, we all took 2 and 1/2 hits at the same time. Meg gave everyone vitamin C drops to help out our colors and visuals. I never really thought it did much but this nite it all seemed to flow so well. We get to the party, and there are so many people there, at this time the acid is starting to take effect and when we walk in we stayed in our little trip group and found a spot in the house where we could have our 'comfort zone'. We all decided to just sit for a bit and take in our surroundings before anything else. We were on the floor in a 4 person circle when i opened my bag and took out Bill. Everyone else at the party was drunk and smoking pot, we were the only ones on LSD. When i took Bill out and placed him in the center of our circle we all smiled and giggled because Bill started to smile with us, and gave us strength that the nite would go smoothly. This little 10inch ceramic Gnome became the center of our 'comfort zone' and many of the drunks were already making fun of us, but we all looked at eachother and nobody cared because Bill was giving us courage and strength. He knew us and they did not.",
  "About 30 min. after we got to the party the acid started to kick us full on. It was about 1 hour into the trip. Everyone was standing and smoking and we were all still sitting. As we looked up the smoke at the top of the room looked amazing. I asked Nikkis date if he was ok, because he really only knew Nikki. He just smiled and laughed and said 'im lost!'. I knew he would be ok and i let him take in his own trip. My gay guy friend Al came over to us to talk and just laughed when he saw Bill. Al had a shirt on it with a wonderful abstract pattern and we all noticed it at the same time. He found it amusing that we were so fasinated with his shirt. He had never done acid and asked us what was so special about his shirt. I told him that ' it looks like your wearing liquid clothing, its not a shirt its liquid armor!'. For the next hour we just sat in our circle and watched everyone. People didnt really talk to us, and it felt like we were flys on the wall just watching and waiting. About 2 hours into the trip we decided to take a walk upstairs. We left our circle and Bill to hold the fort(even though he was an inatimate object) we knew he would keep our comfort zone safe.",
  "Going upstairs was like going to another world, and we all agreed on this. Things were so different upstairs because the whole scene had changed. Different people, and different music. It wasnt bad, but it wasnt as good as being downstairs. All four of us sat on a bed huddled toghether and just started to crack up for no reason. The laughing fit seemed to last forever until the girl who lived there gave us a HUGE sticker book with all kinds of sticker like fuzzy ones, glitter, squishy, big, small, and very colorful. The stickers are just what we needed at that point in the trip. They were amazing and the color was just popping out of the pages of the book. Every kind of image was in that book on a sticker. I started to worry about my Gnome,Bill. So Meg and i took the journey down the stairs into the place we started our trip. It seemed like we were only upstairs for like half an hour but it was actually close to an hour and a half. So we were reaching the end of our peak and we all knew it.",
  "I told Nikki and her date that they had to come and bond with Bill the trip Gnome. We went to our comfort zone which was untouched thanks to Bill. He had a little satisfied smile on his face, and just looked at us with his blue eyes. We all agreed he was special, and magical. We were all glad I decided to bring him to the party. Most of the people had left, and the others that were still there gave us a nice vibe and we were all very comfortable. I drank some beer and took some asprin and just relaxed the rest of the nite. I said my goodbyes and went home with my friends. That nite or should I say early morning, cause it was like 4am when i got home, well I sat Bill down on the table next to my bed and just stared at him until I fell asleep. He seemed to sooth my brain and sing me to sleep.",
  "That was one of the best trips ive ever had, and i really owe it all to a ceramic garden gnome. I know it sounds crazy, but he was a good friend and although i dont have him anymore, i do miss having him with me. 'BILL THE TRIP GNOME' I will always love that guy. I wish all of you acid lovers could meet him. I do think LSD is a great drug, and a wonderful way to find yourself. That nite i learned that you can love anything. Even if his reality only exists in my own head.</p>"
 ],
 "year": "1998",
 "id": "6661",
 "gender": "Female",
 "views": "7811",
 "dose": [
  {
   "time": "0",
   "amount": "2.5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "submissionDate": "2002-03-23T08:00:00.000Z"
}
