{
 "title": "Journey To The Centre Of My Head",
 "author": "DayTripper",
 "citation": " DayTripper. \"Journey To The Centre Of My Head: experience with Mushrooms - P. semilanceata (ID 66614)\". Erowid.org. Dec 16, 2007. erowid.org/exp/66614",
 "substance": "Mushrooms - P. semilanceata",
 "bodyweight": "113 lb",
 "report": [
  "<p>Our decision to do a trip that day was a spontaneous one. It was near the beginning of the shroom season for where I live, for some reason they don't seem to grow until mid-October around here, and prior to this experience we had only managed to find about 10 liberty caps each time, so we had only had pretty mild individual trips since last year's season.",
  "Anyhow, I checked our best known shroom field (a racecourse) expecting to come away with few, if any, mushrooms. For the first ten minutes, as expected, I found nothing. Then I found shroom heaven, about 30 clusters of shrooms, all close together so that they formed one giant cluster of well over 200 liberty caps. I went into a picking frenzy, but was still careful not to uproot the shrooms and I left about half the shrooms I found to let them grow for next time. With my unexpected psychedelic bounty, I went to a friend's house to start tripping.",
  "We decided to eat the shrooms, then go on a mission across some fields on a path by the river, a mission we had done before on mushrooms and had a great experience. We divided the mushrooms (about 70 for me, 50 for my mate), ate them fresh, grabbed our skateboards for some reason and set off on our quest.",
  "They began affecting us quicker than normal, probably because it took so long to eat them, the first shrooms we ate would have been starting to work. The trip came on hard and fast. Within minutes the world had become a very surreal place. The sun was brighter than it had been, sounds were enhanced (but not distorted) and colours were much more pronounced. And I was getting freaked out by blades of grass.",
  "My mate had been investigating a tree but when he came back over I grimly informed him of the grasss plans to kill us. He said he was aware of their plans and that we should move on. I went down to the river and tripped out on the ripples, which seemed to be forming and endless spiral across the water, which now looked more like a mirror. We contemplated walking across this mirror to the other side, but then decided that it would probably trick us by turning out to be water after all. We moved on.",
  "As we walked we encountered several dog walkers and joggers. At the start of the trip we had intended to freak out as many random people as we could, and I am pretty sure thats exactly what we did, though I remember none of what we said or did to them. God only knows what they were thinking, and I doubt even God cares. With a bit of luck, their lives were ruined forever.",
  "We passed a building on our journey, an old water tower (or something) which has been graffitid by some strange people. One of the pictures is of sort-of Liberty Cap shaped shrooms, with spots, and LSD written around it. Someone needs to get their drug facts right before they start spraying stuff that makes them look stupid. Anyways, one side of this building was made up of large sandstone bricks which stuck out unevenly. On shrooms, this was extremely trippy. My friend pointed it out to me, and then I couldnt stop watching the bricks switch around, change size and move in and out of the wall. I dragged myself away knowing that there were trippier things further on.",
  "We finally reached our destination, a dual carriageway that goes over the river. Underneath it is a very peaceful place we had discovered 2 years previously on shrooms, and named the Temple.  We tripped out on some strange graffiti people had written there over the years, including a weird poem, something like, In the age of knights and armour, there lived a hairy llama.  We sat on a stone bank going down into the river and chilled out for a while, seeing the other side of the river and the underside of the bridge form some kind of gods face.  Eventually we got worried about the safety of the place as our shroomed minds were convinced the bridge was about to collapse. We moved on to a tunnel that runs through the ground underneath the dual carriageway not far from where we were. That was where we spent the next 200 years of our lives, or so it seemed.",
  "There is nothing in this world that can possibly be trippier than that tunnel on shrooms. The ground is made of uneven, rippled and cracked concrete, covered with all sorts of multicoloured grime, and the walls are even worse. There were all sorts of patterns and images forming out of the slime and pockmarks on the wall. The trippiest thing was, the wall was made out of wood and concrete at the same time. This completely baffled us. We spent what seemed like a very, very long time contemplating what it was and what it could mean. When we touched the wall, it was definitely concrete. When we looked at some parts of the wall, it was definitely concrete. When we looked closely and around the edges, we noticed the wood pattern and splinters around the edge.  We eventually decided that the only thing it could be was wood with a thin layer of concrete over it, and carried on with our trip.",
  "We spent about half the time trying to communicate with bizarre creatures that were forming on the walls, and the rest of the time we were discussing things and discovering secrets locked in our brain which the shrooms had released, as always, none of which I can remember, I just remember it happened. We also noticed that if we looked out of one side of the tunnel, it appeared to be nice, summery weather, but when wel ooked out the other side, it appeared to be winter: the trees were dead, the plants looked browner and the light was completely different. This was very confusing but definitely seemed real.",
  "We tried to do some skating in there, but the surface was crap and the shrooms made everything difficult to do, I couldnt even pull off an ollie. I attempted some Bert slides, which didnt go spectacularly well and left me covered in mud and God knows what else, but it was a very trippy thing to do on shrooms.  After what seemed like four eternities, we attempted to leave, out of the summery side of course. I say attempted because we were waylaid by some new trippy things on the wall which we discovered, including numbers counting up from 27 written all over the tunnel walls. We tried to find all the numbers, thinking that this would result in some reward, possibly enlightenment. Eventually we gave up and tried to leave again.",
  "This time we were halted in our tracks by some weird green slimy thing my mate had discovered in a massive puddle at the entrance. We couldn't figure out what it was, until he dropped the slime in some sunlight. Its a mouldy sock! I said. He insisted that it wasnt a sock, but I was convinced it was. It appeared to be made from the same material as a sock when I studied it closely. Then I looked closer at the puddle. It was half covered in the same material. It couldnt be a sock after all, so what the hell was it? We finally managed to escape this tunnel by splashing around through a swamp which we must have gone through to get in, but we were sure it hadnt been there, and it wasnt raining or anything.",
  "We emerged from the tunnel into a completely different world. Decades, maybe centuries seemed to have passed. All the plants seemed about three times as tall as they had been when we fought our way through to get there, and the cars speeding over the bridge looked futuristic. One thing that was the same was a truck that had been parked in a lay-by about a hundred yards along the dual carriageway. We could only see the top of it over the enbankment and now it looked like a huge monster hiding amongst the greenery, ready to pounce. We fought our way through the tall and thorny plants, wondering what the new world was going to be like, and how we had survived in the tunnel for so long. We decided it must be at least 50 years in the future, and we headed back to town to see what it was like.",
  "On the way we were sidetracked by the discovery of an incredible shroom field. We had always thought that they should grow along that route but had never found them. The grass was quite long, but amongst them we couldnt stop finding shrooms. We only picked about 10-15 each because we didnt need them that day and we wanted to leave them for another time.  Plus it was starting to go dark. The journey back was even more insane than the journey there. The darkness strengthened the trip, and then the mist came in. We encountered a few more people, and I definitely remember saying strange things to them, but I still cant remember what we actually said.",
  "About halfway back along the trail, we realised we were in Vietnam and being hunted by US troops and Vietcong, as we were just a couple of tripping guys that had suddenly been transported to the middle of a warzone. We grasped our skateboards as weapons and carried on up the trail, careful to avoid punji stake pits and grenade trip wires. As we neared the end of our journey we received a phone call from some mates who were not tripping, but had a bunch of shrooms and wanted us to come round and give them the few we had.",
  "One of them, an annoying little pill-munching cokehead who we had attempted to raise from schoolboy-ness into the ways of ganja, shrooms and righteousness but had fucked that all off for chemical class As and had a delusion of being a big time dealer, completely ruined our trip with his unneccessary whinging about how 70 wasnt nearly enough, after the experience we were having on 70 and 50, this fucked with our heads and pissed us off. He also kicked off for no reason when we suggested that they come out to meet us so we could all trip outdoors. We decided that if he was there, being like that then we was no way we were going to meet them. This led to a very dark and depressing 45 minutes of wandering the streets, tripping, trying to squeeze some kind of plan through the psilocybin in our brains.",
  "In the end, we rescued the night by going back to my mates house to end the trip where it had started. We smoked a joint and watched Jay and Silent Bob Strike Back, and during this the trip faded away. Soon after the film I departed to return home. Walking through town the trip reactivated and the streets suddenly became very strange. I started to think a nuclear war or plague or some apocalptic thing had happened while were in the tunnel. I actually enjoyed this experience because deep down I knew that wasnt really true, but there was enough psilocybin and psilocin left in my brain to create that reality on one level of thought. On the bus home the trip faded again, leaving nothing more than bright colours and trippy patterns over my vision.",
  "When I got home, I watched TV, smoked some more weed and finally fell into some weird and very interesting dreams.</p>"
 ],
 "year": "2007",
 "id": "66614",
 "gender": "Male",
 "views": "2817",
 "dose": [
  {
   "time": "0",
   "amount": "70 caps",
   "administration": "oral",
   "substance": "Mushrooms - P. semilanceata",
   "form": "(fresh)"
  }
 ],
 "submissionDate": "2007-12-16T08:00:00.000Z"
}
