{
 "title": "Cops and Hallucinations, Paranoia, and Fear",
 "author": "Travis",
 "citation": " Travis. \"Cops and Hallucinations, Paranoia, and Fear: experience with DXM & Dimenhydrinate (Dramamine) (ID 6662)\". Erowid.org. Mar 23, 2002. erowid.org/exp/6662",
 "substance": "DXM & Dimenhydrinate (Dramamine)",
 "bodyweight": "160 lb",
 "report": "<p>Ok this is travis, i've written experiences to erowid before about my friend at the bowling alley etc.. I'm going to tell you the trip of my life that happened a few weeks after my friend had the seizure. I had been taking tussin and dramamines way too much constantly during my spring break and almost every weekend i'd trip. I guess this night it was just all built up and fucked me out of my mind.</p><p>First thing we took all the dramamines, i was with my friend Jon. We were just chilling listening to trance music then we decided to go to sleep because we were very tired. Next thing i know i'm sitting in his living room and his mom is like Travis, are you ok are you sleep walking? are you gonna be ok do you need a doctor? all this stuff she was saying. This was after i did this and i dont remember this at all i went and knocked on his moms door and opened it and then turned the light on. i then asked for the phone. she gave it to me then i left the room. i kept trying to come in and she kept kicking me out and she blocked the door.</p><p>After this is when i was in the living room and she was talking to me to make sure i was ok but i only remember being in the living room i dont remember going in her room. Next thing i know i was standing in some bushes and i took off running for no aparent reason and this cop started chasing me. This black dude that had said i was in his yard crawling around chased after me and tackled me and threw me on the ground. Comes to find out i had left Jons house at 3 am and was out running from the cops for 2 1/2 hours. it was now almost 6 am. I'm sitting in the cop car and i didnt know what the fuck happened. They dropped the resisting arrest charges against me and now i have two violations of my current probation and i have a court date set for them.</p><p>Also this whole time i was barefoot and running around my feet were bleeding and they were all fucked up. Please post this experience i want people to see what dramamines and dxm can do after a long build up in your system. Normally i can handle 24 dramamines and 900 mg tussin together without problem but this time it was just unreal. I honestly say dxm is a great drug and i love doing it but if your going to do it you need to be in control and dont do it more than once a month. If you let it get out of hand you will eventually fuck up and have a bad trip or worse.</p>",
 "year": "2001",
 "id": "6662",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-03-23T08:00:00.000Z",
 "views": "49250",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "DXM"
  },
  "1": {
   "time": "",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate"
  }
 }
}
