{
 "title": "I Have the Light, I Feel the Light, I Am the Light",
 "author": "fierphly",
 "citation": " fierphly. \"I Have the Light, I Feel the Light, I Am the Light: experience with MDMA (ID 6665)\". Erowid.org. May 6, 2001. erowid.org/exp/6665",
 "substance": "MDMA",
 "bodyweight": "120 lb",
 "header": [
  "DOSE:",
  "1.5 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>I drove down to Santa Cruz expecting a good time. Walking the beach, watching the waves, strolling through the drum festival downtown... most of all, spending time with my best friend Lisa.</p><p>When I pulled up to her aunt's beachhouse, I was beaming with anticipation, and some uncertainty. She was intending to introduce me to 'shrooms,' and this would be my first psychedelic experience (being 18 y/o at the time). I was excited and a little bit scared.</p><p>When I got inside she and C.J (her ex-fiance) offered me some beer and as I began to sip on it I asked 'so where are the shrooms?'</p><p>Lisa pulled out a ziplock sandwich bag in which there was a little white pill and a fragment of another. With a confused look on my face, I waited for Lisa to explain.</p><p>'We couldn't find any mushrooms, but this should be even better... it's ecstacy' (gulp, on my part. I had heard about this stuff in high school. My punk ex-boyfriend had been trying to convince me to try it... that it was the most wonderful and harmless drug, etc... and I'd always find some way out) But, with a spirit of adventure, I swallowed the little pill-and-a half they had saved for me, and waited for something to happen. </p><p>I started to drive the three of us to the beach, to take a stroll. Before we had arrived, maybe halfway there, Lisa says 'Oh my God! Oh my God, Jen, stop the car.  Pull over. Just stop the car, oh-my-god!' A little uncertain why, I pulled over at a nearby coffee shop, and just as I began to step out I felt it... from deep within me came a swarm of warm electric butterflies, venting from me. Waves of pure excitement and joy rolled in and out and through me. As they did, a thought came to me. All of the depression I had ever felt about the sickness and conflict in the world was lifted, and I lept up onto the hood of my geo metro and said, 'Guys, listen. I just figured something out! I don't know why I never knew this before, but all the evil that is in the world, is just because of misunderstanding. People think they are not loved, and because of this they are hurting. They lash out and hurt one another, in defense, because they do not know they are loved, but deep inside everyone does love everyone else...or at least they only want to be loved.... There is no evil, it's just misunderstanding and defensiveness.'</p><p>'Jennifer, get down from the car,' Lisa said.</p><p>'Wait no! I've just begun! I'm realizing things I should have known all along, and'</p><p>'Jennifer, just get down from the car. People are starting to stare.'</p><p>'Oh, o.k,' I stepped down. After the peak subsided somewhat and we felt our feet were somewhat on the ground, we headed on to a walking stretch on the beach.</p><p>I remember the water reaching out to meet us on the sand, and I reached back with my hands and touched it, communicated with it, felt my connection to it. I was talking to the ocean, and the ocean talked back, silently.</p><p>We spent the next 24 hours (I had no tolerence to E back then), walking on the beach, talking about issues we had never had the courage to bring up, laughing, crying some, holding eachother tight... passing through gift shops and record stores, attempting to make easter eggs (they came out pretty silly looking).</p><p>At one point (about 2:15 a.m.) a cop pulled us over for a routine sobriety check. After shining a flashlight in my eyes and having me recite the alphabet, he commented on the size of my pupils, but shook his head because I seemed sober. He asked if we had smoked anything and I said we'd had some cigarettes, but that's all. He and I had a short conversation about my home town, where he had lived for a while and, seeing that I was completely coherent and articulate, he let us go and bid us a pleasant evening/morning.</p><p>THE COME DOWN:</p><p>24 hours had passed and I don't know why I was still tripping, but I was. (I was 95lbs then and a virgin to any drug but marijuana and alcohol. I was also on sort of a natural 'manic' high back then). We entered some kind of music/head shop and I browsed the poster section. There were horrible depictions of children having nightmares, of a demon-like man whose penis was a giant cobra, of a teddy bear being ripped out of bed and taken to a place of torture. I looked away and shuddered. A whispering voice said 'Look at it! You can't turn away from it! It's part of you...'</p><p>I pondered this as we left, and headed to the local Denny's. We were all starving, as we hadn't eaten the night before or all day.</p><p>As we sat there trying to eat sandwiches, we got quite grouchy with eachother. Cranky doesn't quite describe it. Bitchy is closer. We decided we were completely wiped out and headed home to sleep. I slept soundly and comfortably, filled with new insight. I was quite exhausted and incoherent the next day, but somehow made it home to Tuolumne county, ugh.</p><p>A year later, I was invited to a birthday party of my friend's friend, who was putting on a 'micro' rave. I bought a couple of hits and took one, drank some mushroom tea, a little bit of liquor, and a few hits from a joint. I sat in a bedroom with some new acquantances, and after about 30 minutes I was struck by 'lightning.' I sat up a bit more and announced, reaching out and up with my arms, 'I have the Light! I feel the light. I AM the Light!' and ran out to the living room to dance.</p><p>As I danced, I remember saying to myself, 'I've waited so long for this!'</p><p>Now it has been quite some time again. I'd like to visit my old friend. I have picked up a test kit and I'm ready to Dance again...</p>",
 "year": "1995",
 "id": "6665",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-05-06T07:00:00.000Z",
 "views": "7479",
 "dose": {}
}
