{
 "id": 6675,
 "title": "The Room of Colors",
 "date": {
  "submission": "2007-05-01T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Andyshmoker",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>I recently had gone to Toronto, to visit the HotBox cafe to pick up some salvia extract. I purchased about one gram of 20x extract for about $40, with the intent to getting completly fucked. My past drug expereince includes marijuana/hash, cocaine, LSD, mushrooms, ecstasy, and i had tried salvia one time prior to this, which induced visions of aliens. I was hoping to get another such trip.",
  "I went over to my buddys house, who I will refer to as G. My friend K was already there. I brought my little vial of the brownish/black extract and my lighter, with hopes of throwing it in his glass bong.",
  "He allowed us to smoke in his basement, which was a rare occourance because his mom really wasnt cool with us doing anything like that in the house, but luckily it was only us and his brother in the house.",
  "I dumped out a little pile of the extract on a peice of paper...an eyed-off two hits (it turned out it was a perfect two hits). I was sitting in G's pink comfy chair, G in the other one, and K sitting behind us. I loaded the 2 hits into the bong and attempted to spark my lighter...it was dead, shit. The only other option was matches, and knowing salvia needs a high temperature to burn well, I used two matches simotaneously. I lit them, and drew the flame onto the bowl by inhaling. I took one long, large hit from the bong and pulled the rush. I held the hit in for about 20 seconds, and in the last 5 seconds of which, I began to feel the familiar effects, a sense of gravity, tingling body, raised temperature, and an overwhelming feeling of confusion.",
  "I tried to ask K for 2 more matches but all that came out was 'Uhh..I, uhh..more..matches'. Luckily he understood me. I lit the matches, and took another ripping hit. The last thing I remember of actual reality is placing the bong on the nearby table. What happened next in reality, and what happened in my mind are two completely different things, which I will explain separatley. First I'll tell you what happened in my mind.",
  "I lost complete touch with reality and all I could see was a room of spinning, and mixed colors. The only sounds I heard were scrambled roars and screams, which could not be made out. I could see no other objects which were in the room. My two friends K and G were no longer K and G, they were two other beings, who were trying to trap me in this spinning room. I had never felt such intense fear in my life and all I could rememeber thinking was I'll never get out of this, I'm here forever'. So I attempted to 'leave' this intense room of color, so I stood up and began to walk, trying to escape. I was then told in some weird language, which I understood, to sit down, so I did it, and ventured back to my pink chair. From that point on things began to be more and more real, and I began to gain my vision of what was in the room, and lost the sense of being scared off my ass. But all I could say for the next 5 minutes was 'Holy Shit'. I felt my forehead and realized I was pouring sweat, and then noticed my shirt was drenched.",
  "Now I will tell you what they saw happen with me. After taking my two hits I placed the bong on the table and started leaning forward in my chair. I then said 'Its getting hot' and thats when G noted that I began to profusely sweat. I then began talking about a cross of some type, and tried to grab a burning incense stick that was beside the bong on the table. After that, I was just completely slurring all my words and not making sense, the only words they would make out were 'Match' and 'Cross'. Then I started looking around like I was deeply paranoid, and jumped up out of my chair, and began walking as if I was completly wasted, and tried to leave the room. G then told me 'Sit back in that chair', so I did it, then came back to reality. The whole time they were just laughing at me, so I assume thats why I was hearing roaring, and such.",
  "This was not at all what I expected from the salvia, I was expecting a euphoric trip, like my first one, not a fearful intense one. But this was still amazing, and I still have a bit left, and plan to soon use it.",
  "And a note for anyone who uses this stuff...USE A SITTER..I could have at any time knocked anything over, or fallen and hurt myself if my friends werent there to tell me what to do...happy tripping ;-).</p>"
 ],
 "erowid": {
  "id": "39273",
  "citation": " Andyshmoker. \"The Room of Colors: experience with Salvia divinorum (20X Extract) (ID 39273)\". Erowid.org. May 1, 2007. erowid.org/exp/39273",
  "substance": "Salvia divinorum (20X Extract)",
  "views": "2729"
 }
}
