{
 "title": "Shootin' Bees",
 "author": "Thrip",
 "citation": " Thrip. \"Shootin' Bees: experience with 2C-B (ID 66759)\". Erowid.org. Nov 5, 2007. erowid.org/exp/66759",
 "substance": "2C-B",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "25 mg",
  "IM",
  "2C-B"
 ],
 "report": "<p>It was halloween. I wanted to quickly change gears from work play and had heard from a friend that a mutual friend of ours had tried intermuscularing 2c-b and it worked well. I had just gotten a fresh batch of needles and haven't had any K to IM in a long time so I was itching to stick something in my skin. I mixed it up with 1 Ml of water, it dissolved reluctantly but completely after a few minutes of stirring. I loaded it into a 22g syringe.</p><p>The injection didn't burn at all like I thought it might (If you've ever snorted 2c-b you know how painful it can be). As I pulled the needle out I began to feel like I made a mistake. I could feel it coming on rapidly. I began to sweat, what if I took waaay too much? I never found out how much my friend tried. Somebody else told me people have died from 2c-b I began to worry I might have overdosed. [Erowid Note: As of November 2007, there have been no known 2C-B-related fatalities.] I took my shirt off a staggered to the bathroom.</p><p>T 0:05</p><p>The 2c-b is in full force. I don't know if it's going to get stronger. I feel like I'm at the peak of a normal trip. Extremely bright vivid visuals, every detail of the room has some sort of flashing pattern. Lots of blue, green and black stripes. It's like walking through a DMT trip. The visuals are amazing but I'm So afraid I'm dying or about to loose my mind that I cant quite enjoy them. I want to puke (all the Halloween candy doesn't help) but I don't. My body wants to get this out of my but it's confused. I squeeze at the injection site but soon realize it's rather futile. While staring at my arm I realize I can morph my body to look however I want. Neat! But now back to panicking. I wonder who I can call. I don't want to alarm anyone because that might make this situation worse. I think I can pull through this. I puff my chest out and sit up on the bathroom floor. I know if Panic and convince myself I'm dying I probably will. So I stop.</p><p>T 0:30</p><p>I can hear a few people come in through the front door. My roomate knocks on the batroom door. I'm too mesmerized to talk. I eventually open the door after I'm pretty sure I'm not going to die. He gets me water while I sit in the bathroom. Some friends have shown up and the living room is a bit too much to handle right now. The visuals are still bright and my motor skills are a bit off. my legs starts to twitch. I feel pretty toxified.</p><p>T 1:00</p><p>I'm back in reality enough to socialize. I can quite follow conversations. I wonder if  I permanantly damaged my brain. We listen to Bo didley and I listen to fragments of conversation. I feel good now, physically and mentally.</p><p>T 2:00</p><p>A friend catches my attention with UFO talk and I'm able to carry a conversation again. We decide to go out for a walk. Halloween is  scary in a big city. About 10 block from my house a few people got stabbed... I'm more afraid of the cops this year. They're everywhere. more than I've ever seen on halloween it looks like they're geared up for a riot.</p><p>T 3:00</p><p>There is an abrupt stop in the visuals almost 3 hours on the dot from when I dosed. we go to a heavy metal show. I needed the release from all the stress in my life lately. I'm able to let out all my pent up anger and frustration, it feels great.</p><p>T 5:00</p><p>I'm feeling like I'm back in reality but a little blown away. I have a headache. I get some food and go home to relax. I have no trouble falling asleep.</p><p>I want to experiment with this again but starting with a lower dosage and work my way up. I'd also like to be more prepared. I want to lie down for the first hour and enjoy it like I would a K trip.</p>",
 "year": "2007",
 "id": "66759",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-05T08:00:00.000Z",
 "views": "5459",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "IM",
   "substance": "2C-B"
  }
 }
}
