{
 "title": "Death in the Air",
 "author": "860",
 "citation": " 860. \"Death in the Air: experience with Naltrexone (ID 66772)\". Erowid.org. Nov 5, 2007. erowid.org/exp/66772",
 "substance": "Naltrexone",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "50 mg",
  "oral",
  "Naltrexone",
  "(daily)"
 ],
 "report": "<p>I've been addicted to opiates on and off for the past 5 years, and because of a recent relapse I am being forced to take naltrexone.  I started taking it 10 days clean, and I've been on it for 2 weeks.</p><p>Naltrexone treatment has a notoriously low compliance rate, and now I understand why.  There haven't been any specific, dramatic side effects, but something is definitely wrong.  Everything around me has taken on a subtle, sinister quality, as if I were living in the early scenes of a horror film.  I feel like I'm being haunted by a spirit of Death.</p><p>The day I started on this stuff, I knew something was off, but I couldn't put my finger on it.  That night I had a vivid dream, in which various aspects of my self appeared as other people.  They were large or small, sick or healthy, according to their influence and importance in my life.  Among this mostly ordinary group was a thin, bent man with a hat.  I suddenly realized he was the naltrexone I had taken, and that he did not belong there, that he was an invader.  At the same time, the man turned, and I saw he had no face - there was just a black  void where his head should have been.  When I woke up the next morning the evil feeling of that dream seemed to flow out into the real world, and it has been with me since.  It gets worse each day when I take the tablet, then gradually fades, but it never goes away completely.</p><p>Whenever I mess with my opiate system it brings about some disaster.  As an addict I was so stuffed full of myself I was incapable of doing anything useful.  Now, I feel like my actions are dying as they leave me.  I don't believe chemicals like this have their own spirit, but I think they can open us up to different things, depending on their character.  This experience doesn't feel like a negative physical or mental reaction - it feels like I'm being exposed to some external, spiritual evil that is working through the naltrexone.  Either way, I'd recommend you keep clear of this stuff.</p>",
 "year": "2007",
 "id": "66772",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-05T08:00:00.000Z",
 "views": "11181",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Naltrexone",
   "form": "(daily)"
  }
 }
}
