{
 "title": "Help with the Sexual Side Effects",
 "author": "ShagShag",
 "citation": " ShagShag. \"Help with the Sexual Side Effects: experience with Paroxetine (ID 66820)\". Erowid.org. Nov 6, 2007. erowid.org/exp/66820",
 "substance": "Paroxetine",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "20 mg",
  "oral",
  "Pharms - Paroxetine",
  "(daily)"
 ],
 "report": "<p>I recently was told to take such drugs (specifically paroxetine) and developed the problem of a REALLY delayed orgasm. Like I'm talking hours of stimulation, with a partner or by myself, to achieve an orgasm. After maybe a month of this, since me and my girlfriend were clearly getting frustrated, I decided to stop taking the drugs without talking to a doctor. I heard about the negative effects of quitting these drugs, but I decided it was a fair trade. How was this supposed to help with depression when I couldn't even participate in my favorite pass time? Anyways, a little over 48 hours after I had stopped taking paroxetine, I ended up at my girlfriends house after a few drinks at a bar. I had yet to notice any negative effects of stopping these drugs when things started to get heated. I won't go into detail, but I was able to achieve orgasm in a very reasonable amount of time (AND it was one of the most intense I've ever experienced). Things seemed to be back to normal, that is, how I remember sex being before I started taking paroxetine. For a couple months after that, I just did not take Paroxetine when I knew I was going to get into any kind of sexual activity. It was a difficult way around it, and I did notice some of the effects of quitting paroxetine cold turkey on occasion, but it worked for me.</p><p>Let me close by saying that I am not a doctor. It was not until a while later that I talked to my doctor about all this and he concluded that I should decrease my dose. After my doctor halved my dose, the sexual side effects disappeared altogether.</p>",
 "year": "2007",
 "id": "66820",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-06T08:00:00.000Z",
 "views": "4263",
 "dose": {}
}
