{
 "title": "Breakthrough in Technology (DMT Made Easy)",
 "author": "Teafaerie",
 "citation": " Teafrie. \"Breakthrough in Technology (DMT Made Easy): experience with DMT & 5-MeO-DMT (ID 66957)\". Erowid.org. Nov 9, 2007. erowid.org/exp/66957",
 "substance": "DMT & 5-MeO-DMT",
 "bodyweight": "115 lb",
 "report": [
  "<p>I'm pleased to report that our local chapter of the Last Saturday's Club has recently stumbled upon a real breakthrough advance in DMT smoking technology!",
  "Sing ho for the joys of the electronic vaporizer!  We used the Volcano Vaporization System by Storz & Bickel, but the Frie is not their sales associate and I bet that other brands work just as well.",
  "We simply placed the proper amount of material on a piece of aluminum foil in the element.  According to the Volcano website the melting and boiling points of aluminum are higher than the machine goes, so we don't have to worry about inhaling toxic aluminum foil at all.  Of course we have to set the temperature at above the boiling point of the material so that it will vaporize. We used an analog Volcano turned up to 8 (almost all the way up) and it worked all fine and dandy. Just push the button and voila! The bag fills up with magic smoke!  We look inside the machine when we're done and there's nothing left but foil. ",
  "This method is superior in several important respects.  First, it takes the guesswork out of dosage.  We pretty much get whatever amount we put into the machine right in the bag, which can easily be sucked into the lungs in three big tokes.   No fuss, no muss, no red hot crack pipe to deal with.  No lighters to Trickster out on us when we're almost there.  You can do it by yourself.  You can do it lying down.  You can pass the bag around and share pop-ups.  In short, it's sheer genius! ",
  "We tried it with DMT, 5-meo-DMT and with a combination of the two.  In all cases it worked like an absolute charm. ",
  "Oh, and here's the kicker.  Do you know that sound?  The one that Terence McKenna said sounded like the crumpling of a plastic bread wrapper or the crackling of flame?  It's EXACTLY the sound of the vaporizer bag deflating when you suck on it!  I guess this is really more of a tech report than an experience report, but I tell you I laughed my ass off when I made that connection.  I thought that in making this discovery I had somehow projected that sound into thousands of people's DMT trips, even ones that took place in the 'past'.   I know, I know.  Silly Frie.   It really is an uncanny synchronicity, though...</p>"
 ],
 "year": "2007",
 "id": "66957",
 "gender": "Female",
 "views": "33630",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "5-MeO-DMT"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "DMT"
  }
 ],
 "submissionDate": "2007-11-09T08:00:00.000Z"
}
