{
 "title": "Negativity",
 "author": "BoneyDragon",
 "citation": " BoneyDragon. \"Negativity: experience with Cannabis (ID 6696)\". Erowid.org. Mar 19, 2002. erowid.org/exp/6696",
 "substance": "Cannabis",
 "bodyweight": "185 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>It was a friday afternoon. My friend's parents were gone for the weekend, so he decided to have a party. I decided I had better get some weed, but I didn't know any dealers, so I got one of my friends and this other kid I smoked with once (herein known as Jackass) to pick up for me. Me and three others gave them $50 dollars (which should buy 5 grams).</p><p>Now, I agree with what you are thinking. That was a stupid move, asking to get ripped off. They came back later with barely over two grams and some bullshit about how the dealer had ripped them off. I was, and am, pretty sure they pinched half of it. I was pissed off.</p><p>Later that night the party was underway and we went out to smoke the weed. To be honest, it was pretty good stuff, which just made me even more angry that we didn't have 5 grams of it. I became further annoyed at people who kept trying to mooch off us. We already had gotten fucked over and now a million people were trying to score some free weed, people I barely knew, including Jackass. We had smoked two bowls and I was flying, I felt great. My friends wanted to have another one, and I didn't, but I did anyway. This is when things went bad. I came back inside and Jackass starts apologizing for the bad deal. I hid my anger and said something neutral and walked away. I went downstairs and noticed that a lot of people had arrived, people I didn't know. There were these girls who looked like total skanks and way younger than they should have been. One of them said something to me, calling me a loser or pothead or something.</p><p>At this point I was feeling horrible. Here I was in my friends house after getting totally ripped off, having to deal with people being assholes, and not recognizing anyone in this sea of dirty 14 year old girls. I felt like I was out of place, that I was some loser who didn't belong here at all. It was at this point I noticed the music, it seemed way too loud with too much bass. The last thing this party needed was the police to show up. But more than the volume, I felt the negative vibe of the music. It was gangsta rap, 2pac I think, and it totally hit me the wrong way. The aggressive nature of it felt...almost threatening. I looked at this one kid and told him to turn it down. He told me to stop worrying, but I had promised my friend I wouldn't let the party get out of hand so I went and turned the bass down. The guy got mad at me and started saying something I didn't understand. I looked at his face and it seemed discoloured, his skin was like bronze, like a sculpture. His lips were purple. I just walked away.</p><p>Someone then told me that Jackass was outside smoking a joint. Gee, I wonder where he got the weed? I went out and asked where he got it and he replied in his typical fashion 'Nah man chill iss mah personal stash.' If it weren't for the fact that I was extremely high, I would have lost it, but I decided I would handle it when I was sober. As I walked away I must have muttered something offensive because he got mad screaming 'Don't fuckin' talk to me like that bitch. I'm a call up some boys and we'll fuckin' stab you bitch!' Normally such a display would make me laugh, especially because this kid was a total wigger and way smaller than me. But the pot made me see it differently. I got scared. I contemplated just punching him out, but I worried that either he would actually hurt me, or that I would end up seriously hurting him. So I just mumbled some kind of apology and went back downstairs.</p><p>I felt trapped. Like I was in a bad dream and I couldn't wake up. I just sat between a couch and a table, feeling like a total loser and a complete pussy. It was then that a girl I actually knew arrived. She stood out because she wasn't 14 and she wasn't caked in make up. She saw what a bad condition I was in and tried to make me feel better, but I just felt like I had disappointed her, that here I was, this drug smoking geek who can't have fun. I couldn't take it anymore. The skanky 14 year olds, the wiggers trying to act tough, the smell of alcohol and smoke, and most of all the negative vibes emanating from my friends stereo. I was drowning in the bass and anger of it. I had to leave before I seriously freaked out, so I got a buddy to drive me home. All this had occurred in about 2 hours, and once I got in his car I felt amazing relief. Like I had escaped hell. The negativity just dripped off me as I felt the drugs beginning to wear off.</p><p>I can't really remember what happened after that. What I do remember was the lessons I learned, about how not to obtain drugs, about how important setting is, and about how powerful marijuana can be, how much it can affect your emotions and totally ruin your evening and destroy your confidence. Bad trips are possible on marijuana.  From now on I'll remember the risks and stop smoking when my body tells me to.</p><p>~BD</p>",
 "year": "2000",
 "id": "6696",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-03-19T08:00:00.000Z",
 "views": "8380",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
