{
 "id": 6698,
 "title": "The Trembling Chin",
 "date": {
  "submission": "2006-06-16T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Luathas",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "120"
   },
   "administration": "oral",
   "substance": "Vinpocetine",
   "form": "daily"
  }
 ],
 "report": [
  "I'm always searching for an energy boost, and found Vinpocetine interesting. I bought some at the health food store and took 10mg with no dramatic effect. So, I took another 10mg. After consuming about 60mg, I found my vision greatly improved, and my mind seemed much sharper. I thought, shit, this stuff is great! So, I promptly went back to the store and bought 3 more bottles of 5mg capsules, 100 per bottle.",
  "I think I was taking maybe 120mg a day for several months, and felt ok, but noticed a strange 'racing' of thoughts, and a weird anxiety. Seemed like the world was closing in on me. Then the really weird part. My chin took on a life of its own, and started trembling when I was in any situation where a confrontation was possible. There didn't have to be a confrontation, just the thought of it, and the way I was thinking, that was most of the time.",
  "The up side is, I had a boner most all the time, and constantly thought about sex and pussy. It became very disconcerting to even be in public with my chin and lips trembling, and a big ol' hard on pulsing in my pants. Fuckin' weird. Especially since I'm a nurse and have to wear thin scrubs. I couldn't figure out the cause of the chin thing for a while, but it finally dawned on me that the Vinpocetine was causing it. I quit the stuff, and it took like 3 months for my chin to behave. But, being the maniac that I am, I started taking it again recently."
 ],
 "erowid": {
  "id": "39358",
  "citation": " Luathas. \"The Trembling Chin: experience with Vinpocetine (ID 39358)\". Erowid.org. Jun 16, 2006. erowid.org/exp/39358",
  "substance": "Vinpocetine",
  "views": "12012"
 }
}
