{
 "title": "Unripe Berries and Leaves",
 "author": "Freddy",
 "citation": " Freddy. \"Unripe Berries and Leaves: experience with Mulberry (ID 66984)\". Erowid.org. Jan 2, 2012. erowid.org/exp/66984",
 "substance": "Mulberry",
 "bodyweight": "220 lb",
 "report": "<p>A friend and I spent about half of a day browsing on ripe and un-ripe mulberry berries and leaves.</p><p>Set and Setting: We were in a memorial garden dedicated to a friend who had died a few months earlier. Hanging out, sharing memories. Good times. </p><p>Dose: Some produce was starting to come on, and there were mulberries on a couple of trees. We were hungry and ate our fill of raw green beans, ripe and unripe mulberries, and mulberry leaves. We each ate several 1 liter nalgene bottles full of mixed leaves and berries. We picked heavily of unripe berries when we found them, and preferentially sought out smaller immature leaves.</p><p>Effects: After a couple of hours of grazing my friend and I sat down and discussed the fact that we both felt mildly drifty and dreamy, almost as if on the edge of an out-of-body experience.  We were calm and happy.</p><p>After another hour or two the effects were negligible. We both agreed that more unripe berries in less time might have magnified the effect. After the acute effects had passed I felt conscious, alert, and full (but not overflowingly so) of calm energy. </p><p>There were no negative effects, psychologically or physically, and no 'low' when coming down. Overall the effects were very pleasing, though mild. Unripe mulberries, though not as tasty as ripe ones, were in no way unpleasant to eat.</p><p>I hope to experiment with this plant more in the future, as it is pretty, accessible, free, legal and, in my limited experience, pleasant.</p>",
 "year": "2006",
 "id": "66984",
 "gender": "Male",
 "timestamp": "2012-01-02T08:00:00.000Z",
 "views": "7597",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Mulberry",
   "form": "(plant material)"
  }
 }
}
