{
 "id": 670,
 "title": "Sacred Medicine",
 "date": {
  "submission": "2002-05-02T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Peyotero",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "8 buttons",
   "administration": "oral",
   "substance": "Peyote",
   "form": "(flowers)"
  }
 ],
 "report": [
  "I just would like to first talk about this sacred plant of the Peyote, and mescaline one of the sacred chemicals in the plant, which I believe should all be consumed in the natural form and taken by itself to humble ourselves to the divine medicine.  I have been taking this sacred medicine now for two years.  Let me tell the you I've been searching all my life for many things that I cannot explain and now I believe I have found it. ",
  "I got involved with Drugs at age 21 with my ex we started to use Marijuana, then I got into MDMA, I became very addicted to ecstacy and could not stop.  I then knew of the Native American Medicine men who would conduct sacred ceremonies in Tee Pee's which would take place as all night prayer rituals including the usage of the Sacred Tobacco, and we would all be in a circle around the fire, the fire was in the center of the teepee, then next to the fire was the holy altar.",
  "The Medicine man gave me a total of 8 buttons during the night and then we prayed all night singing and speaking our mind the teachings that came from our elders.  I had visions, beautiful ones, I was able to speak to the peyote, ask it to heal me, I asked for blessings to me and many others.  I saw a whole new world I was able to connect to the universe, I saw in the sky many Native american Designs like the ones you would see on Hopi Kathinas or in many pueblo arts and pottery also many Meso american Designs and I was taken to a world where there was colorful cactus everywhere.  I then saw, the constant movement of the universe and a web this interconnects us to every object, every prayer and every feeling idea.  I was able to see the many spirits that are in our lives at every time I even saw the Web/internet being another example of this web.  I saw issues in my life and noticed I faced all my fears each time I did that I noticed I would get sick and then it would all come out.  Sometimes instead of puking I would just burp or fart.",
  "Near the end I would just see bright colors and my mind slowed down and my thought process was back to normal.  After this experience I had quit all drugs except the natural medicines in nature.  I now have good things and good people in my life, I still to this day continue to go to the ceremonies and I now want to go to mexico and south america to experience the Medicines including Mushrooms and Ayahuasca.",
  "That is all for now I hope you all can get something good out of the usage of peyote and mushrooms respect them and use it all for a purpose and to heal."
 ],
 "erowid": {
  "id": "11657",
  "citation": " Peyotero. \"Sacred Medicine: experience with Peyote (ID 11657)\". Erowid.org. May 2, 2002. erowid.org/exp/11657",
  "substance": "Peyote",
  "views": "41536"
 }
}
