{
 "title": "In Exit as an Exit",
 "author": "BuzZBuRn",
 "citation": " BuzZBuRn. \"In Exit as an Exit: experience with Ketamine (ID 6701)\". Erowid.org. Mar 19, 2002. erowid.org/exp/6701",
 "substance": "Ketamine",
 "bodyweight": "190 lb",
 "report": "<p>I walked into Exit on west 56th street in manhattan for the first time. I had been to other places in the area, but I had no idea what was in store for me tonight.</p><p>I had brought one friend and met a few others on the dance floor. Everyone had seemed to have already taken their E pills (MDMA) and I was jealous. I began to look around for some pills and found someone. I bought 2 pills (due to frequent use, I have built a higher tolerance) and ate them. I waited a hour....then another hour....then I realized I had been screwed. I was sold fake pills.</p><p>I started to sit on the stage and sulk, when a friend from school came over to me and said that he had K if I wanted to try it. Now I had never done it before, but I figured I am here and have done a lot of other drugs.....so why not. I think I might have made one of the greatest decisions of my young life.</p><p>I inhaled a bump in each nostril and figured it would take awhile to kick in. I began dancing with my friends and without warning the lighting became much more intense. I felt my body begin to dissolve and I loved it.</p><p>I kept staring at the lights and dancing. I felt as though I had entered a dream. Everything seemed unreal. I noticed a guy with glowsticks and suddenly became mesmerized. He was in the middle of a circle of people and the glowsticks were on strings. The light engulfed him as he swung the sticks with incredible skill and precision. I don't know how long he was there, but it felt like forever. The glowing light seemed to reach ot and grab me. I felt like I was being pulled into the green glow. Then ot of nowhere it began to snow.</p><p>I looked up and there was snow falling from the ceiling. I could not figre out why....but I didn't care. I watched as the light passed by the small white particles as they approached and landed on my face. The flakes seemed so peaceful as they gently glided down. I began to get lost in the music and the snow filled dream. I felt as though I was one of the little white flakes, and that the music and light passed through me as though I was that delicate.</p><p>Everyone around me seemed fake. It seemed to me that they were all just there for my enjoyment of watching them move. My vision seemed heightened yet my perception was blurred. Things I focsed on became perfect and clear and almost better than ever, yet everything behind or arond it melted away. It was incredible.</p><p>I left the club that night and decided to test K again in other situations. Everytime it has been enjoyable and enlighteneing. I find it also helps an Ecstacy trip out as well (when you take real pills).</p><p>So my experience has been a good one for me and everyone else I shared it with that night. I only hope that everyone else that may try K does it in the right environment for their state of mind. This way they can enjoy their K as much as I did. If they do it right they will be enlightened......and hopefully they also can one day enjoy the snow falling from the ceiling at Exit.</p>",
 "year": "2001",
 "id": "6701",
 "gender": "Male",
 "timestamp": "2002-03-19T08:00:00.000Z",
 "views": "18838",
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Ketamine"
  }
 ]
}
