{
 "id": 6703,
 "title": "Sick and Wasted",
 "date": {
  "submission": "2007-05-08T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Yunalesca",
  "gender": "Female",
  "weight": 41
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid"
  }
 ],
 "report": [
  "The first time I drank alcohol, I was 14 years old. During my freshman year of high school, I began dating a boy named C. One Friday night he and I went to a party. C was a junior, older than I, and his friends were big metal heads who drank and smoked and did drugs while listening to Pantera. I had never had alcohol at that point, but when C offered me a beer, I accepted it.",
  "He got me a Beck's (I'm a vegan) and a Coors for himself. My first sample made me grimace a bit. It tasted like a stale, bitter tea but after a couple of mouthfuls, I got used to it. An hour later, I had finished 3 bottles of the stuff.",
  "Three beers may seem petty even for a first time drinker, but for a little girl on an empty stomach, it was excessive. I began feeling nauseous and dizzy and my head was pounding. When I went into the bathroom, I saw my reflection, pale and sweating in the mirror. I told C I wasn't feeling well and he drove me home. He helped me up to my room and stayed with me until I fell asleep.",
  "When I woke up at around 2 in the morning, the first thing I did was run to the bathroom and vomited. Up the beer came, looking not much different than it had when I first drank it. After successfully emptying myself of the horrid stuff, I took a shower, dressed in clean clothes and went back to sleep.",
  "Due to the less than wonderful reaction I had with alcohol my first time, I stayed away from alcohol for a time. The following summer though, my own friends started drinking. Whenever they offered me a beer or a shot, I always turned it down. This usually meant I was the only sober one of the group, but it never bothered me much. They knew of my last unfortunate experience with alcohol, but blamed it on the beer being bad or something of that sort.",
  "So I agreed to give it another try. B, W, L, M and A won the rights to 'pop my drinking cherry' after a tumultuous rock-paper-scissor battle. We all gathered in W's room with a big bottle of Jack Daniels and 6 shotglasses and started drinking. They knocked back their shots like nothing. Hard liquor tasted even worse than beer, I figured out. Beer was unpleasant, but at least it didn't burn a hole in my throat on the way down. To the delight of my friends, I drank my first glassful like someone would with tea, sipping it tentatively and ended up coughing. They taught me how to throw back my head and take a shot properly. It still burned like mad and tasted disgusting, but I kept drinking anyway.",
  "I can't recall how much time passed, but it was a lot. I had 8 shots and the rest of them had done about 12 or 13. They were all very drunk and giggly and retarded and funny. But I wasn't feeling drunk at all. Just sort of sleepy. And my legs felt heavy. No double vision or incoherent slurring. I wondered if something was wrong with me.",
  "And then suddenly, it hit me. All of a sudden I felt very, very, very sick. Sicker than I had ever been in my entire life. I felt as if I was going to die. The ground beneath me began twirling and the mouths of my friends were not coinciding with the words they were speaking. It was like one of those scenes in a movie just before the character blacks out. I swayed, no longer having enough balance to sit up straight and Derek caught me before I hit the floor. I looked up at him and said quite placidly 'I feel ill'.",
  "As tanked as they all were, they somehow got together enough coordination to get me to the bathroom. B carried me to the toilet and two seconds later, with someone carefully holding back my hair, I threw up violently for what seemed like forever. My stomach heaved up the rejected liquor repeatedly until I was weak and empty and half dead.",
  "I woke up the next morning dehydrated as hell. I brushed my teeth and washed my face and went downstairs to the living room to find five guys sleeping in their boxers with the porn channel still playing on the television. I cannot remember the rest of the night too lucidly, but from what I heard they called my parents and told them I was sleeping over at W's. Then they carried me into his bedroom, tucked me into bed, debated whether or not to undress me and in the end, took off my shoes and left a wastebasket next to the bed.",
  "It's been 3 years since that incident and to this day, I rarely drink. It just makes me feel terrible and I hate the taste. I don't mind not drinking at parties even though everyone else around me for miles is chugging down beer and vodka. I am the ultimate non-drinker.",
  "Maybe in my next life, I can be an alcoholic."
 ],
 "erowid": {
  "id": "39368",
  "citation": " Yunalesca. \"Sick and Wasted: experience with Alcohol (ID 39368)\". Erowid.org. May 8, 2007. erowid.org/exp/39368",
  "substance": "Alcohol",
  "views": "5867"
 }
}
