{
 "title": "Threw the Rest Out",
 "author": "Anonymous",
 "citation": " Anonymous. \"Threw the Rest Out: experience with 2C-T-7 (ID 6705)\". Erowid.org. May 8, 2001. erowid.org/exp/6705",
 "substance": "2C-T-7",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "2C-T-7",
  "(powder / crystals)"
 ],
 "report": "<p>A friend obtained an amount of this chem.  She tried it several times at various light to medium doses. The advice given not to risk high doses with this material was well-heeded.  5mg was injested first to test for hyper-sensitivity.  Even that amount was produced a noticeable effect.  She drifted off to sleep easily in a unique dreamstate induced by the chemical and balanced out with cannabis.  This was a pattern that repeated itself throughout the project.  Further experiments were done at 10mg, 15mg, 20mg, and twice at 25mg.</p><p>These experiments were attempts made by this individual to guage it's entheogenic potential.  Virtually none was found.  The experience was found to be quite shallow.  It's effects seemed to be purely audio/visual/tactile with little or no true psychedelic qualities. </p><p>What few internal effects were present could have easily been attributed to the copious amounts of cannabis which were required to smooth out the rough edges of the trip itself.</p><p>Without the pot, she was nervous, jittery, squirmy......yuk! </p><p>With the pot, she felt physically euphoric and noticed moderate visual activity, plus an imaginative capacity that was fully mesmerizing.  This resulted in her spending much of her time lying down with eyes closed, dreaming and feeling good.</p><p>Not only was sleep not a problem, she said it was her favorite part of the experience.  During the last experiment she said 'I want to go to sleep earlier this time, while I'm still peaking.'</p><p>Curiously, her trip timelines turned out markedly different from the usual 'wait two hours till it hits you all at once' routine. She always reported first alarms at 20 minutes and was usually slow to the top finally around +3:00-4:00 and 'never really was sober' until waking up in the morning.  Even then, she reported there was a pleasant body-glow accompanied by a feeling of mental clarity.  She said she felt 'refreshed' and 'sharp' on the days after with no lingering depression.</p><p>A pure audio-visual  trip with no mindfuck may seem like candy to some (and undoubtedly is...), this particular user percieved the experience to be devoid of content.  The 'friendly at best' description of 2CT7 proved to be a humourously accurate.  Benign, but not specifically useful, at least not as spiritual medicine for this girl.</p><p>A judgement on the usefulness of the experience versus the risks and liabilities of ownership of the chemical itself resulted in the disposal of the remainding material.</p><p>Why have something around the house that could make somebody vomit foam and die?</p><p>My friend insisted that I add to this report a cautionary reminder for those of you out there who are responsible for samples of 2CT7 to be sure that they clearly labeled and marked POISON and secured in a locked container or area.  A conspicuously packaged off-white powder could seem awfully curious to some people...</p>",
 "year": "2001",
 "id": "6705",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-05-08T07:00:00.000Z",
 "views": "11985",
 "dose": {}
}
