{
 "id": 6707,
 "title": "No Climax",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Stoned Immaculate",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "1350 mg",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "(extract)"
  }
 ],
 "report": [
  "Ive experimented with yohimbe on a few occasions, but always in combination with other substances. The last time I did it, I bought some standardized extract herbal tablets of yohimbe from a health food store. It was $15.00 on sale for $11.99. I bought it and took three tablets that were extracted to 450 MG of Yohimbine.",
  "Although I didn't really feel especially horny and aroused, I felt an increase in energy and many hours after consumption I was trying to see if yohimbe lives up to its reputation by attempting masturbation. I usually finish within a couple minutes, but this time I simply couldn't reach orgasm. I tried for about I'd guess an hour before my brother came home than I had to stop. I waited until he fell asleep then continued again. I tried again for about another hour, but even though I had amazingly vivid fantasies that would usually finish me in a second, I simply couldnt reach climax. even when I moved into hyperspeed, it just didnt do its job.",
  "So after all my effort, I gave up and I tried to go to sleep. But even that was impossible to do. I actually enjoyed being awake. I was slightly meditating and halfway dreaming and thinking of very pleasant thoughts. when I looked at the time I realized it was like 4:30 in the morning and I decided it was probably time to check in for the night. I took four Benadryls and after about another half hour I fell asleep.",
  "So all and all it was actually not an unpleasant experience;. I hated all the effort with no pay off, but it was still a fun experience. I guess yohimbe would be a great herb for sex, seeing that I never reached orgasm."
 ],
 "erowid": {
  "id": "39372",
  "citation": " Stoned Immaculate. \"No Climax: experience with Yohimbe (ID 39372)\". Erowid.org. Jun 25, 2007. erowid.org/exp/39372",
  "substance": "Yohimbe",
  "views": "13289"
 }
}
