{
 "id": 6711,
 "title": "A Better Sucky New Years",
 "date": {
  "submission": "2007-08-21T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Andrea",
  "gender": "Female",
  "weight": "110 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "27 mg",
   "administration": "sublingual",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "<p>Well, after my friends ditched me on new years eve I decided I needed to do something drastic to make myself feel better. My ritalin seemed to be a great choice since I was tired anyways. I had insufflated ritalin before and probably developed some tolerance so I knew I had to take a large dose to get it to work 'drastically' well. So at about 8:30pm I crushed up 4 10mg pills and after that I'm like eh I'll just take one orally too. I waited a few minutes and barely felt anything so I snorted one more.",
  "I also have a prescription for two different doses of concerta (27mg and 36mg). I decided, since I don't need the lower dose anymore, to cut it in half and see if I could snort that too. Unfortunatly, since its extended time released it was all weird and I couldn't totally get the shell off. Instead I decided to put it in the sides of my mouth so that it would absorb into the mucus membrane of my gums which is how insufflation is suppose to work. The taste is pretty bitter, but I've snorted it before and kinda got used to the taste. Now, whether this method worked or not, I have no idea.",
  "By now I started feeling good and I got really excited. Then I went outside and had a cigarette which felt amazing along with the euphoric feeling of the ritalin. On my way back to my room I took a sip of liquor in hopes to enhance my experience. I know that when I drink on ritalin, even if its just a little bit, it gives me double vision and I sometimes see spots or something.",
  "However, when I got to my room I felt like the rush was lost and I became very nauseous. It seems that ritalin gives me this great immediate rush but then after like 15min. it becomes a dull stimulation. This really upset me because I was feeling sooooo good. I snorted one more pill and decided to listen to music to cheer myself up.",
  "Right away I noticed that I heard the music in more detail, kinda like when I'm high. I heard sounds that I had never heard in the song before. I was really suprised that this could happen from just taking a stimulant. It was really enjoyable, especially listening to 'Bring the Pain' by MSI.",
  "I read that too much methylphenidate can make you paranoid which really worried me because when I smoke pot I get extreme paranoia and that's why I don't smoke up anymore. As I listened to the music I thought I heard foot steps coming up stairs which alarmed me because I didn't want my parents catching me reading this website. However, because I can think clearly its easy to realize that I'm just imagining things. Although, later when my dad actually did enter the room I jumped and felt this sharp shock. It was just like if someone were to like grab me when I wasn't looking, except that it was alot more severe.",
  "So my dad had come to pick me up to bring me to this party that my parents were at :P ugh. Seeing a human actually brought me up from my dull state though and I could tell I was very excited because of the ritalin. I think, because ritalin makes me talkative, that socializing is essential to keep me happy during my trip.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "Well, I was really glad that my dad let me drive (I have a permit) to test how well this drug would affect me. I think that the ritalin actually made me drive a little faster without noticing. My dad kept telling me to slow down but I felt like I was really going the speed limit. And I actually parallel parked perfectly!",
  "As I got to the party I noticed that I just wanted to blurt out everything on my mind. While other people were talking to me I became really impatient because I wanted to tell my whole life story. I generally felt good when I kept my mind off of the reason why I was stuck there on new years eve.",
  "Of course there was wine and of course I had some but I felt like it depressed me more. I really wanted to go back home quick to snort another pill. I even asked my mom if I could go back to the house to take ritalin because I was tired, though she refused to let me. She says I shouldn't being using that drug for purposes of keeping you awake. HAH if only she knew.",
  "Next on my mind was finding another stimulant. I REALLY really wanted a cigarette but I didn't bring them. It's really strange because I don't normally smoke but lately I had been wanting to smoke. It's weird. Luckly, coffee was being made but it made no difference in my mood when I drank it.",
  "At about 10:30 I started feeling a little bit more jittery. The most prominent side effect I've found was that my mouth was dry and that I couldn't stop moving it. I was either biting down or moving my lips and tongue to the side as if there was something in my teeth. Also, if I held my teeth narrowly apart they would chatter as if I was cold. I'm pretty used to shakeyness from medications I've been on so I didn't notice I was shaking until I held my coffee cup. I think the shakeyness was more from the coffee though. I've noticed that when I take ritalin I don't really shake, it's more like feeling tense.",
  "So throughout the party I remained slightly euphoric and generally happy and talkative. When I would think about depressing things I felt terrible. This feeling quickly subsides if I set my mind in a different direction.",
  "Now I am home. As I left the party, around 1am, I already felt myself coming down. I've heard that any amphetamine crashing is the worst. Right now I still feel kinda euphoric and music still has a slight enhanced effect. My vision though seems to be way off and really blurry. I know that I won't be sleeping for awhile after all the ritalin + caffeine. I feel nauseous too.",
  "Here I will list all the effects I felt from this experience:",
  "- nausea",
  "- decreased appetite (basically mine was extinguished, I didn't eat the whole night, even when I tried it was impossible)",
  "- mild to moderate euphoria",
  "- excitability",
  "- stuttered speech (I felt like I had trouble pronouncing some words and they came out kinda slurred)",
  "- aggitation/impatience",
  "- mild paranoia (but controllable)",
  "- talkativeness",
  "- auditory enhancement, maybe even auditory hallucinations",
  "- altered vision/dialated pupils (my eyes took longer to adjust to light changes, like if someone takes a flash picture and you see that spot afterwards, it lasts longer than normal)",
  "- blurred vision",
  "- double vision",
  "- dry mouth",
  "- thirst",
  "- odd twitching (especially my mouth)",
  "- tense muscles",
  "- increased body heat",
  "- general feelings of well-being (I felt very comfortable with myself)",
  "- dreading the crash/craving more methylphenidate</p>"
 ],
 "erowid": {
  "id": "39386",
  "citation": " Andrea. \"A Better Sucky New Years: experience with Methylphenidate (ID 39386)\". Erowid.org. Aug 21, 2007. erowid.org/exp/39386",
  "substance": "Methylphenidate",
  "views": "28661"
 }
}
