{
 "title": "Motivation and Emotional Stability",
 "author": "kevbo",
 "citation": " kevbo. \"Motivation and Emotional Stability: experience with Selegiline (ID 67131)\". Erowid.org. Mar 9, 2010. erowid.org/exp/67131",
 "substance": "Selegiline",
 "bodyweight": "170 lb",
 "report": "<p>First off, I'm a 19 year old male, about 170lbs, who is experimenting with nootropics out of curiosity. A few months ago, I ordered a bottle with 60 doses of 5mg Selegiline from a research chemical site and took it pretty much every day. The day I started taking it I noticed a marked increase in motivation. For me it was money; there was a huge desire for me to make as much money as possible. I had never been a material person at all, and although I had money, I never thought about doing anything with it other than spending it. I guess some might say that being possessed by money is a bad thing, but the feeling was/is nothing short of complete empowerment. I loved doing math problems in my head involving money; the thinking was so clear. I went from having a bit under 500 dollars in the bank to over $10,000 in the two months that I had taken it. Of course I can't quite disclose how I made this money, but I have to say that I engaged in activities that I probably wouldn't have without Selegiline.</p><p>Of course that isn't the only feeling I noticed on Selegiline. I was motivated to use better vocabulary while speaking to people. I used to be pretty goofy and not many people really took me seriously. Now, when I talk, I feel that people listen. There is a noticable increase in the strength of my voice. I would say that I probably had low self confidence before taking Selegiline, now when I word things it is not in the 'may I' form, it's 'I will'. It makes me tend to look down on most people, but not in such a way that it would affect friendships, although a few friends mentioned to me that I had changed because of my general mindset. This probably sounds incredibly cocky, but it's true confidence. I'm still nice to people, it's just that they now seem to look up to me.</p><p>Another benefit is the emotional 'numbing.' Before Selegiline I would jump at any chance with a decent looking girl and become attached pretty quickly in a flurry of emotions. On it, my thinking is completely rational and emotions never affect my thinking. I'm not even looking for a girlfriend until one can rationally show me that she is really worthy. Girls love to play the game, to say the least. I'm calmer, without emotional outbursts. When I get upset with people, I simply use my 'enhanced' charisma to undermine them, rather than losing control.</p><p>As far as in combination with drugs; when I smoke weed I don't feel as high; or at least, my speech and thinking are not as detrimented. With cocaine, the feeling of euphoria is minimized, which is not a terribly bad thing. It's almost like most of the euphoria associated with cocaine is already there before I snort it. I know Selegiline isn't considered an upper, but it feels like one in this sense. I am also definitely more talkative on it, although this may be a result of the increased confidence.</p><p>After being off of it for a week and a half, I started to have those uncontrollable feelings for girls again. I also lost the ability to socialize effectively and the field of eligibles began to shrink. After about a month, I decided to hop on the train again and order another bottle.</p><p>I try not to make judgements based on placebo effects. I was pretty skeptical of it when I first tried it, as most nootropics tend to be pretty subtle. However, after a few days I realized that this is the closest I can get to a stimulant without the negative effects. It's definitely not placebo, and I can say that it makes more of a difference than all of the other nootropic I have tried combined.</p>",
 "year": "2007",
 "id": "67131",
 "gender": "Male",
 "timestamp": "2010-03-09T08:00:00.000Z",
 "views": "18572",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "Pharms - Selegeline",
   "form": "(daily)"
  }
 }
}
