{
 "title": "Disturbing Fear",
 "author": "DissociateDeity",
 "citation": " DissociateDeity. \"Disturbing Fear: experience with Salvia divinorum (10x Extract) (ID 67143)\". Erowid.org. Dec 16, 2012. erowid.org/exp/67143",
 "substance": "Salvia divinorum (10x Extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>I have wanted to try salvia divinorum for about 5 years now.  I actually once tried just the dried leaves when I was in college, smoking them with a group of friends.  This produced very little of an effect at all, engaged with a mild headache and an unpleasant aroma.</p><p>About 5 years later, after a lot of experience with other substances, both good and bad, I decided to finally order it.  I ordered from a web-based company, 1 g of the 10x extract.  I expected that it would be much more of an experience than the plain dried leaves I had tried in the past and I was right.  I'm not sure why, but even beginning this journey, before I had received my package, I felt a slight dread and fear of the substance.  I have always been very interested in psychoactives, so this fear didn't get the best of me.</p><p>The Salvia extract came in about a week ago and my girlfriend and I tried it, smoking it out of a homemade water bong.  This was probably a mistake, although I don't think it really mattered much.  She apparently had a mild, unimpressed experience.  It just made her laugh.  I thought that was odd and while she was laughing I was laughing as well.  We hadn't really smoked much and hadn't held it in at all which was what I had been instructed to do by a friend.</p><p>I was very surprised at the feeling.  It seemed to wrench control of me, mind and body, and did not relinquish at first.  I felt a brazen tingling over my back and the back of my head and felt what seemed like a very strong flying sensation.  It felt like I had fresh cool air blowing against my body, strange because I've never experienced external stimulation from an internal stimulant before.  Needless to say, this was a very small part of the experience.  It was not pleasant, so do not take this as being a pleasant effect, it was actually more of an interesting detail.  The effects wore off quickly and I resolved to just get rid of it, but I ended up not doing so because I thought maybe I didn't have a strong enough experience.  I was using some reserve since I was with my girlfriend and I couldn't really let go like I wanted.</p><p>The next day I smoked another bowl and held it in for a little longer.  This started becoming frightening as I was staring at the fence on my patio and it seemed like I had no control of my body.  I felt as though I was being lifted and turned sideways in midair.  As cool sounding as that is, it wasn't.  It is not a painful feeling that the salvia induces, but it is an extremely uncomfortable one, kind of like being held down and controlled by a person larger than oneself.  I would have described it as being emotionally, mentally, and physically raped by some outside force, except I have never been raped so I don't know what that's like.  But it seemed that this would be close to me. </p><p>Also I had the distinct feeling that there was a gateway that was near me, that I wanted to enter to experience the full effects, but my fence (or the thing controlling me) was mocking me, laughing at me, saying no, that this is not what I thought it was going to be.  That I would not be allowed through that gateway.  It frightened me, but I also understood that I may not have been ready for that type of experience.</p><p>The third and last time that I smoked the salvia 10x I held it in for at least a minute.  It was terrible.  I was thrown into a fit of near blackout.  I could only see dark images of myself and the things around me and was very very frightened.  The world was spinning and instead of only have most control over me, I felt as though the (thing) I had experienced before I had taken complete control over me.  I felt suffocated, although I could breathe.  It took at least 20 minutes for this to end and even as my vision began to return I felt very uncomfortable and out of sorts and could not settle down.  I felt like a small animal being roughted up by a hand grasping all around me.  As soon as this experience ended enough for me to move and thinking semi-clearly again, I dumped the rest of the extract in the toilet and flushed it away.</p><p>Salvia extract not only tastes horrible, but I had several bad experiences with it and I don't anticipate trying it again.  If I ever do, I will probably meditate for a couple of hours before hand, maybe it is something dependent on mindstate, I don't know.  All I know is, it was terrifying and I want to stay away from anything like that in the future.  Damn galactic monster or something.</p>",
 "year": "2007",
 "id": "67143",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-12-16T08:00:00.000Z",
 "views": "705"
}
