{
 "title": "Feeling Death",
 "author": "Myka",
 "citation": " Myka. \"Feeling Death: experience with Mushrooms - P. semilanciata & Cannabis (ID 67169)\". Erowid.org. Feb 23, 2008. erowid.org/exp/67169",
 "substance": "Mushrooms - P. semilanciata & Cannabis",
 "bodyweight": "",
 "report": [
  "<p>First off I have extreme anxiety and I am bipolar. About a week ago I lost my anxiety medicine, but havent been in any particularly anxious situations and so I was coping alright. I also want to say that in the past, I loved liberty caps. I always had fun on them before and was really looking forward to this trip as much as the past ones. I feel though that we did not take some proper preparations and that perhaps I shouldve respected my drug a bit more. Heres the story.",
  "My good friends had a quarter of liberty caps on hold for them, but realized that they didnt have the money for them, and so offered them to us. My fianc, my roommate K and I all decided that Friday would be the perfect night as our other roommate, who only smokes weed, would be there to be our sitter.  We had done shrooms three times before, and would be taking a smaller dose this time than usual as our friends had only set aside a quarter and the three of us would have to split it up. We each took about 2.3 grams.",
  "Looking back now I realize two things that caused this to be a bad trip. 1) I was worried that I would not trip since this was a smaller amount then I was used to and therefore 2) I didnt eat anything that night, hoping that would intensify the trip. I also smoked a bowl before eating them hoping for the same thing.",
  "After eating the shrooms we sat in the living room with the TV on, slowly feeling the effects build up. Within 45 minutes from eating them the TV became far too overwhelming and we all headed upstairs to Ks room. I crawled in his bed and asked my fianc to lay down with me. But I felt all wrong. I was having trouble breathing, I felt light headed and nauseous, and extremely cold. As I tripped harder and harder the tapestry that K had attached to his ceiling to dim the lights started taking on the frightening shape of alien faces. As I am extremely afraid of Aliens this was the worst possible thing that could happen. Suddenly everything was made up of alien faces. They were swirling around me all staring at me with their big eyes.",
  "I sat bolt up right in the bed and said, I am going to throw up I need you to come with me. My fianc could tell I was not having a good time and followed me. I sat shivering in the bathroom wishing I would just throw up but I couldnt. The only thing in my stomach were the shrooms; so even when I did gag, that was all that would happen. I was determined not to go back in the alien room. And so I suggested we go down stairs. K followed us and put a pizza in the oven thinking we were all cold because of our empty stomachs. It seemed like just one second and the pizza was done and they handed me a piece. I felt afraid of everything, even this innocent piece of pizza and therefore was only able to eat a couple bites.",
  "I continued to get colder until I was shaking and felt like I was definitely going to be sick. I kept thinking that I had stopped breathing and would try and catch my breath, but I was just having so much trouble. I got up and dashed across the room to the bathroom. I sat on the bathroom floor and shook uncontrollably. I somehow confused myself into thinking that I had eaten the wrong shrooms and had therefore poisoned myself and I was dying, a thought put I my head because of all the research I had been doing recently on amanitas which we had just received in the mail that same day. I asked for my Searaquill hoping that I could take one and fall asleep, but then thought, because I was so terrified, I am dying anyway, I should take all of them and just finish this now. My fianc did not hand me my Searaquill as he knew I would fall asleep and miss the trip. Looking back now I very glad he did not give me my pills.",
  "He came to the bathroom and helped me up and hugged me. I nearly passed out in his arms twice before I was able to say lets go to the bedroom. The second we were in the bedroom I took off my clothes and got under the covers. I was getting colder and colder. And I couldnt stop shaking and wiggling. My fianc held me for what seemed like an eternity. He said that every few seconds I would say Baby Im not ok, I cant breath, Im dying, call the hospital. Eventually I stopped adding the Call the hospital and just decided that I was going to die, and if I was going to die, in my own bed being held by the man I loved was exactly where I wanted to be. So I resigned myself to never coming out of the trip and just layed down to die.",
  "What seemed like decades later, but was merely just a few hours, I felt better. It was like all of a sudden the shrooms lifted and I was all smiles. I had lived! I couldnt believe it. I felt on top of the world for a few hours and then went to bed. The next day I woke up feeling kind of off. And that night I got cold and I freaked out. I thought I was dying again instantly. I insisted we go to bed again and he held me while I shook for the second night in a row, only this time there were no drugs involved. I even made him take my temperature. My anxiety had taken over and I had no more anxiety medicine.",
  "I am a pagan and have strong beliefs that always made death seem like a natural thing. For the first time in my life I am afraid of death. I feel like I know what its like to die and its scary as F***. 3 days later I am still a nervous wreck and I cant help but think about death. I learned that shrooms may not be for me. I will now be the permanent sitter for our house and stick to weed and pharmaceuticals.</p>"
 ],
 "year": "2007",
 "id": "67169",
 "gender": "Female",
 "views": "3781",
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "2.3 g",
   "administration": "oral",
   "substance": "Mushrooms - P. semilanceata",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2008-02-23T08:00:00.000Z"
}
