{
 "id": 6718,
 "title": "I Understand the Essence of the Cup",
 "date": {
  "submission": "2008-03-28T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Rocketman",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:00",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(fresh)"
  },
  {
   "time": " T+ 1:00",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(fresh)"
  },
  {
   "time": " T+ 0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "A plus four experience has been defined as 'A rare and precious transcendental state, which has been called a 'peak experience', a 'religious experience,' 'divine transformation,' a 'state of Samadhi' and many other names in other cultures. It is not connected to the +1, +2, and +3 of the measuring of a drug's intensity. It is a state of bliss, a participation mystique, a connectedness with both the interior and exterior universes'. That is the only way I can describe what happened to me the other night: a state of pure transcendental bliss and I feel obliged to document here the extraordinary things that were going on in my mind. I've had plenty of drug experiences in my time, and around four or five mushroom trips before, but nothing even came remotely close to what I experienced on this occasion.",
  "BACKGROUND: It was new years eve, and the day's experience truely started at around 1.30pm, but I really want to concentrate on the mushroom trip, which began after midnight. Let's just say that by the time I took the first portion of shrooms I was far from sober. My friend (X) and I had been to a rich variety of bars, pubs and venues, chatted to a variety of people (mostly complete strangers) and at around 9.30 had met up with another old friend (Y) who we hadn't seen for a while, and his girlfriend. By 12.00am we were back at X's house and were already on top of the world. We didn't have a care in the world and we were incredibly happy about being in one another's company. I had made sure that throughout the day I was pacing myself so that I wouldn't be too far gone to enjoy the trip later on in the evening. Every time I felt myself tipping over the edge, I would stop drinking alcohol for a while and drink plenty of water.",
  "THE TRIP: Just after 12.00am X and I took 10g each of Columbian mushrooms first. These produced an effect not unlike ecstacy, but slightly less pronounced and energetic and a dreamier, but possibly stronger, deeper, sense of euphoria. Y is a very experienced drug user but had taken an aversion to shrooms/LSD after several awkward experiences. There were no visuals other than a slight glow and enhancement of colour and we were perfectly capable of holding lucid conversation without our minds drifting off on exhausting psychedelic journeys of psychoanalysis and philosophical musings. I was very pleased with the way things had turned out. X and I were singing very loudly and getting involved with he music, which was making us even happier. I was having an exceptionally good time. Soon after, Y left with his girlfriend.",
  "At around 1.00am X and I ingested the rest of the shrooms - 5g of Hawaiians each, though for some reason or another it took me about 15 minutes to eat mine, whereas X knocked them back all in one go. The onset of this new set of psychedelic treats was gradual to begin with, for me at least. I had to watch X writhing around in ecstacy on his bed for 15 - 20 minutes before my trip really got under way (just after 2.00am). I felt like I was floating to begin with, the usual shroom 'come-up' and mistakenly thought that this was as good as it was going to get and that I had made a terrible mistake eating the shrooms so slowly. I got up and phoned another one of my best friends, who was several hundred miles away having a party in his home town. Speaking to him made me feel more elated, and I'm sure I gained comfort from the fact that he was also pretty twisted on alcohol. Half way through the conversation it started to hit me.",
  "At first, everything began to shimmered, glistened, sparkled, twinkled and glowed with pure light, energy and colour. As per usual, I had to work everything out from first principles and I found the tiniest of things confusing, but wonderful and full of life. My mind drifted between what seemed to be different worlds and dimensions as I was overwhelmed by rich textures and tapestries of colours, shapes and sounds and an infinite number of different dimensions of bliss.",
  "I remember being so uttlerly overpowered by the sensation, mumbling 'wow ...' and 'oh my god ...' over and over again. Everything had new, heightened senses of meaning and purpose. I would look at a glass cup and appreciate the very essence of its being. I thought I could see that cup exist in many different parallel dimensions. Objects twisted and turned in fluid waves and blended or melted into one another. X's face periodically took on the texture and colour of a constantly mutating chequers board. If I tried to focus on anything I visualised a vortex of light patterns zooming in on that on particular item. In my mind, it felt like I was visiting many different worlds or realms of feeling and emotion every second. The covers on x's bed turned into waves that consumed us and made us merge with our surroundings.",
  "At its height, I experienced something I never even conceived of as possible, as did X. We were both heavily hallucinating, but that didn't really hold any meaning or significance because thought, sight, sound and touch became one. As much as I tried to make sense of my watch, I couldn't. My appreciation of time had been completely demolished. It didn't even make any difference whether our eyes were open or not, because we both saw exactly the same thing either way. Just like the Kantian/Schopenhaurian sense of the 'phemoninal', I could see the true essence of everything after the human perceptions of space and time had been removed. I honestly believed that I was seeing pure energy (maybe I was), and this filled me with such and utter and complete multidimensional sense of joy that I don't think it is humanly possible to feel any greater sense of euphoria on drugs.",
  "The peak of the experience only lasted until just after three, at which point we sat in bewilderment for two and a half hours, smoking weed, talking about and trying to make sense of what just happened to us. I'm not sure I'll ever fully understand myself."
 ],
 "erowid": {
  "id": "39404",
  "citation": " Rocketman. \"I Understand the Essence of the Cup: experience with Mushrooms  - P. cubensis & P. cyanescens, Alcohol & Cannabis (ID 39404)\". Erowid.org. Mar 28, 2008. erowid.org/exp/39404",
  "substance": "Mushrooms  - P. cubensis & P. cyanescens, Alcohol & Cannabis",
  "views": "3264"
 }
}
