{
 "id": 6719,
 "title": "Tachycardia",
 "date": {
  "submission": "2007-12-04T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ET",
  "gender": "Male",
  "weight": 114
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.5",
    "unit": "joints/cigs"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "cup"
   },
   "administration": "oral",
   "substance": "Coffee",
   "form": "liquid"
  }
 ],
 "report": [
  "Well,",
  "Let me first start by telling you I am 35 years old and have been a fairly 'heavy' marijuana user for about 15 years.  I have been diagnosed with Marfans Syndrome, a connective tissue disorder, in 2002 that required an Aortic Graft (open heart surgery).  I couldn't even stop smoking two weeks prior to the surgery as suggested by my doctors,  though I did manage to quit a week before the surgery, so I guess you could call me a pot head.  I have been seriously thinking about quiting lately and going away on business trips has helped this cause.  I go away for about three days at a time and went from smoking about 5 joints a day to zero while away.",
  "Well, on my last return home, after a 20 minute argument with my bi-polar dad, I rolled a much anticipated joint and drank a cup of coffee.  About a half hour later I started feeling dizzy and felt my heart pounding BIG TIME.  I managed to put my heart-monitor wrist-watch on (used for working out) and found my pulse was at 160.  I felt very bad and asked my dad to call an ambulance before I passed out.  When the EMT's arrived my pulse was at 145 and they transported me to the ER.  On the way to the hospital my pulse went to 125 then back up to 160.  All the while I couldn't concentrate, find the right words, and was very confused and scared.  I had no idea if I was having a heart-attack or stroke or something.  After an Adavan IV and several blood work-ups, my pulse went down to 105 and they sent me home.",
  "As soon as I got outside from the ER my pulse went back up to 135.  Not knowing what the hell is going on, I have stopped cold-turkey and will NEVER, EVER smoke again.  My cardiologist says that it may be from the combo of caffeine and cannabis, yet he doesn't understand why due to my prolonged use, or an electrical problem from the surgery (two years ago?).  At any rate, a heart monitor is presently being fed-exed to me for further testing.  This is the scariest thing that has ever happened to me in my life, even scarier than the surgery, and I miss my daily smoke VERY much but, it's not worth dying over.  It has been two days and my pulse has not returned to normal yet, when I rest it is 80-100 and if I go down the stairs it jumps to 135."
 ],
 "erowid": {
  "id": "39405",
  "citation": " ET. \"Tachycardia: experience with Cannabis & Coffee (ID 39405)\". Erowid.org. Dec 4, 2007. erowid.org/exp/39405",
  "substance": "Cannabis & Coffee",
  "views": "5463"
 }
}
