{
 "title": "Dubious, But Pleasant",
 "author": "wanderlust",
 "citation": " wanderlust. \"Dubious, But Pleasant: experience with Catnip (ID 67216)\". Erowid.org. Jun 17, 2011. erowid.org/exp/67216",
 "substance": "Catnip",
 "bodyweight": "240 lb",
 "report": "<p>Being on the verge of entering a rehab program (court-mandated, which is another story, suffice it to say that my trip-sitter lost me), I was in search of some unorthodox highs. After reading up on catnip, I tried it, and here are my verdicts.</p><p>A little backround, if it's necessary: I am seventeen, and an aspiring psychonaut, I suppose. I have experience with (in order of familiarity) Marijuana, Alcohol, DXM, and 2-CB, and limited experience with dramamine/benadryl, lortabs, ritalyn, and LSD. (The last was one unexpected but impressive 5-hit trip, the reason for my rehab) I am relatively well-read and specifically have done extensive research on the internet, mostly concerning drugs, religion and history.</p><p>Anyway, I tried smoking the catnip in a glass pipe, which I found to be very harsh, harsher than cigarettes, although the catnip was very dry and seemed to have a lot of seeds and stems, which might account for that. I also found the the smell of the smoke was kind of powerful and lingered significantly on my hands, clothes, and even in the air (outdoors and indoors, which was strange, and it might just be me, I tend to notice smells very easily if they are on my mind).</p><p>As far as the mental effects, I noticed some very subtle sedation, and I will admit I'm not great at studying such effects. I mostly just wanted to impart my opinion of the smoking experience.</p>",
 "year": "2007",
 "id": "67216",
 "gender": "Male",
 "timestamp": "2011-06-17T07:00:00.000Z",
 "views": "3044",
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Catnip",
   "form": "(tea)"
  }
 ]
}
