{
 "title": "I Always Choose This Combination",
 "author": "Drogoteca",
 "citation": " Drogoteca. \"I Always Choose This Combination: experience with GABOB, Pyridoxine and Clorazepate (Dorken) (ID 67223)\". Erowid.org. Nov 21, 2007. erowid.org/exp/67223",
 "substance": "GABOB, Pyridoxine and Clorazepate (Dorken)",
 "bodyweight": "92 kg",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "GABOB",
  "(daily)",
  "",
  " ",
  "oral",
  "Benzodiazepines",
  "(daily)",
  "",
  " ",
  "oral",
  "Vitamin B-6",
  "(daily)"
 ],
 "report": "<p>I've been using a prescription med named Dorken. It contains 25 mgs of Tranxilium [Clorazepate], 150 mgs GABOB and 75 mgs Piridoxine (B6 vitamin). I got to it because of anxiety problems, and I have used it for more than 8 years, discontinued for some periods.</p><p>I have taken from half a pill, sometimes a quarter, to 2 or 2 and a half pills. And I can compare it to others benzodiazepines. Even with the tranxilium itself alone.</p><p>I have NEVER found any psychoactive effect, such any resembling something rewarding or a happy feeling. The only happiness I got from this compound, is the anxiolitic effect. It is more anxiolitic and more long lasting than tranxilium, probably with faster effect, but not as much a flunitrazepam (Rohypnol). The reason because they use this 3 compounds together is =to form the naturally ocurring compound GABA in the brain, it's needed the GABOB and in another metabolic step, a form of piridoxine.</p><p>So taking it as prescription med, is not anyway funny, but it really kicks anxiety when other benzos can't get it totally.</p><p>I have ocassionally administered this drug to other people, in small dosages, as a quarter or half pill. And all of them find it more rewarding than other typical benzodizepines. Specially mention to a woman that with a quarter of that pill, said in a lot of ocasions, that she was happy for the real first time in her life, because 'the little dwarfs she had in her chest' had been blown away and that never had happened to her before. Obviously she had a long anxiety problem that has never been treated, but when she went to therapy, no other benzodiazepine could make her feel the same feeling of peace and calm. I have to say that this woman, had an entheogenic experience with 10 mgs Zolpidem. I mean that she was awake after taking it, and she was really in a world of incredible visions, afraid, but always knowing where she was, who she was, etc. And as that effects were there to stay for a while, the best option was sex. So she had an incredible experience as far as long she has never taken any other drug, nor cannabis.</p><p>And she is not a psychotic. Just suffers some anxiety ocasionally, and has a normal way of living, far away from drugs.</p><p>And I personally, when I have felt really nervous, even having a lot of possibilities to choose from, if I find the feeling to be really hard, I always choose the GABOB-Piridoxine-Tranxilium option.</p><p>After long term use, even with no large dosage, such as half a pill a day, if I stop use abruptly, I won't feel problems the first day, or even the next one... but after the second day, I'll get more anxiety than I have experienced before. Far much more than with other benzos or sleep help, like Zolpidem, alpralozam, bromacepam, etc. So stop its use with smaller steps.</p>",
 "year": "2007",
 "id": "67223",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-21T08:00:00.000Z",
 "views": "16791",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "GABOB",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Benzodiazepines",
   "form": "(daily)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Vitamin B-6",
   "form": "(daily)"
  }
 }
}
