{
 "title": "Vaporizing Is The Secret",
 "author": "DaggaVaporizer",
 "citation": " DaggaVaporizer. \"Vaporizing Is The Secret: experience with Leonotis leonurus (ID 67232)\". Erowid.org. Feb 23, 2008. erowid.org/exp/67232",
 "substance": "Leonotis leonurus",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  "5.5 flowers",
  "smoked",
  "Leonotis leonurus",
  "(flowers)"
 ],
 "report": "<p>First let's start with some background info. I'm a lightweight at 125 pounds and have experienced wild dagga many times in the past. I've also smoked cannabis many times and used several 'legal smoking blends'. The only other plant I've tried that is rumored to be psychedelic is Coleus Blumei. I recently ordered an ounce of dagga flowers from a small online business for $10. This wasn't my first time experiencing these little orange jewels, and I expected another small buzz off a few flowers. I have vaporized the flowers a couple times before and gotten a slight euphoric buzz similar to smoking them. Tonight I decided to go all out and packed 3 'vapepacks' (each of 2 or 3 flowers, not sure, I  definately used 6 flowers at the most, I'm thinking maybe 5) in my ubie vape and toked up. Mind you this was 100% clean and it was my first time using this particular ubie (I broke my other one earlier. Anyways, at 10:45 PM I put on some good reggae and prepared to do it in the perfect environment. So, on with the writeup.</p><p>I finished my last 'vapepack' at 10:55 PM, after 10 minutes of vaporizing and listening to some Bob Marley and Linval Thompson. I opened aim and started talking to some friends waiting for it to kick in, and she finally worked her magic at exactly 11:01.  At 10:59 I said 'damn, i hope this kicks in soon' and stared at my lamp. I  just felt sedated, I stared at it for a minute and snapped out of it, thinking it was placebo. Then I turned my head to look back at my computer but didn't feel like summoning the strength to pick my head up and look at the screen, so I stared at my hands on my lap for 30 seconds or so. Then I looked up (at 11:01) and out of nowhere I was HIGH. Not buzzed mind you, I was simply HIGH. Thats it. I thought back to tell minutes earlier and thought to myself 'wait a sec, what, I'm actually high right now, was that weed or wild dagga?!?!?'. For the next 2 minutes I just exclaimed to everyone around me (and on aim) 'IM HIGH! WOOOOW! IM ACTUALLY HIGH! OFF WILD DAGGA, AND A SMALL AMOUNT TOO! WOWWWWWWWWWWW! I HAVEN'T EVEN DONE ANYTHING ILLEGAL!'. It's almost 40 minutes later and I'm still feelin' it, almost as strongly as I did when I first realized I was high.</p><p>Now remember, this isn't my first time smoking/vaporizing wild dagga, I've experienced what lady dagga has to offer countless times, I've even smoked bowlpacks (big ones) of up to 15 or so flowers without feeling anything other than sedation and a slight euphoric buzz, so it's not like I'm just overestimating a small legal buzz, this is the real deal! Finally, after  countless wild dagga experiences I realize why it's the number 1 legal marijuana substitute (excluding smoking blends) in many parts of the world.</p>",
 "year": "2007",
 "id": "67232",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-02-23T08:00:00.000Z",
 "views": "23464",
 "dose": {}
}
