{
 "title": "There's Gold in Them There Pine Needles",
 "author": "Shamathan",
 "citation": " Shamathan. \"There's Gold in Them There Pine Needles: experience with Amanitas (A. muscaria), Passion Flower, Cannabis & Tobacco (ID 67249)\". Erowid.org. Dec 16, 2007. erowid.org/exp/67249",
 "substance": "Amanitas (A. muscaria), Passion Flower, Cannabis & Tobacco",
 "bodyweight": "202 lb",
 "header": [
  "DOSE:",
  " repeated",
  "smoked",
  "Tobacco",
  "",
  "",
  "6 caps",
  "oral",
  "Amanitas",
  "(dried)",
  "",
  "8 ",
  "oral",
  "Amanitas",
  "(tea)",
  "",
  "2 caps",
  "oral",
  "Amanitas",
  "(tea)",
  "",
  "50 leaves",
  "oral",
  "Passion Flower",
  "(tea)",
  "",
  "1 bowl",
  "smoked",
  "Amanitas",
  "",
  "",
  "1 bowl",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>I have been independantly researching psychoactive plants, multiple religions, and the idea that psychoactive plants have influenced the evolution of the human mind (I'm not forgetting about the other brain evolution theories).</p><p>For some reason nature amazes me. It has since I was a little boy, and I believe that this is one of the reasons I am who I am today. Humans have a very deep rooted connection with plants (ha, pun) and the ability to realize this is a gift. A gift to be taken with passionate respect. The right plant, the novice and misinformed, the people that end up at the hospital or in a casket.  Moving on to my recent experience with amanita muscaria and passion flower.</p><p>I had recently discovered amanitas and was interested in the entheogenic properties. I have previous experience with multiple entheogens, stimulants, hallucinogens, deleriants, and experimental chemicals like AMT when it was legal here in North Carolina. So I ordered 50 gms, I ate a few, someone offered to buy them so I sold the rest. I had eaten about 10-12 gm of this Amanita Muscaria Var Muscaria from Siberia. Probably T+4hrs I was just very sleepy and only with mild vision distortion. I treated them, decarboxylized them in the oven at exactly 185F for 30 min. Let cool, ingested, tastes as if a viking may have relieved his bladder upon them.</p><p>Failure.</p><p>No amazing feelings of one-ness with nature, no OOBE's just sweepy vewy sweepy.</p><p>T+ 1 month later.      </p><p>I have a spot in the woods for personal reasons... it's on a creek, I have two boats back there, a small hut and a kitchen all of which was made by me and a friend.</p><p>I was just going for a walk, I didn't expect it to happen like this but it always does. I walked across my normal path, taking an un-routine path for some odd reason.  There, poking up from the pine needles was a small yellow cap with scales on it. I thought to myself 'that kinda looks like an Amanita'. I kept walking but something was telling me that it was very important that I turned around and looked again. So I turned around. Right before I got to them, just when I could see them, a feeling overwhelmed me kind of like the first time I took LSD-25 (lots of people call this a flashback, but I believe it is certain situations that either inhibit or render more functional certain chemicals in the brain). At any rate I took these toadstools (8 in all) back to my house instead of going for a walk by the creek, to further investigate them. This was very suprising to me, not because it was what I thought it was (Amanita Muscaria Formosa) but because I did not think that it grew in WASHINGTON NORTH CAROLINA. That's right folks. For those of you who live around here, you should know that we have a pretty good variety of naturally occuring  psychoactives. Datura Stramonium Solanaceae (Jimson Weed), Ipomoeae Violaceae Convolvulaceae (Heavenly Blue  Morning Glory), Passiflora (passionflower) Reed canary Grass, and so on.....</p><p>So I decided to take these possitively identified mushrooms, along with leaves from passionflower vine and boil them together as passionflower has been known to contain MAOIs which can intensify the effect of muscimol. I ate 6 big caps heated in the oven previously mentioned, took all 8 stems and 2 small caps and 50 passionflower leaves and threw them in a pot to boil in the woods at my spot. I then strained it and threw the junk away, let the tea cool and drank 20 ounces which was all of it.</p><p>I felt the need to go out on the water so I began to paddle around while I smoked a bowl of Amanitas and Cannabis mixed. The tea/brew was fucking gross... needless to say I wanted to vomit... but weed helps.\t</p><p>About an hour and a half of laying on the boat floating around I became VERY tired. I just wanted to go to sleep. This was very farmiliar. Except this time I really REALLY wanted to go to sleep. So I decided to walk to my house and catch a nap. I noticed on the walk that I was abnormally goofy footed. A very intoxicated feeling. So I made it home and crawled on the couch and fell asleep very quickly (about 5 min, NOT normal with me). While I was dreaming I felt like I was still in the woods at my boat and the couch was really the boat.</p><p>This slowly became my dream...I was back in the woods in my boat , cooking a rabbit I had killed, after what felt like all day of tending to a beautiful garden I had never seen before I decided to walk home and I remembered I was asleep inside on the couch.  Suddenly I felt propelled by tremendous force and I was awake again on my couch VERY fucked up. VERY VERY FUCKED UP. The entire room was spinning, everything past 3 feet of my sight was blurry, I was sweating (I woke up soaked),  I could not stop drooling, I was cold to the bone, freezing cold (it's like 70f outside),  and I was very confused for about 5 minutes. Then I realized I was awake and tripping HARD. Light hurt my eyes pretty bad, and my living room sucked so I went outside and called my friend 'd' to check on me (sometimes it helps to have another opinion). 'Yep, you look pretty fuctup.' It had been confirmed ...this was a totally different trip than psylocibin, way more random, also I could hear smells, I could taste my cats playing, I could see words, they were represented by shapes and colors and feelings. 'Now I know why,' is all I could think. Now I know why people have bad trips. She told me, the spirit of the mushrooms and the whole earth, through feelings and uncontrolable sensations, that we were depriving our connection with this planet, suffocating in our own waste. Only the misinformed, inexperienced, disrespectful and unready have bad trips. I saw the light.</p><p>Then it was gone...........</p><p>I take no medication that would alter the effects of these chemicals. Cigarettes were used throughout duration with noticable effects.</p><p>T+ 9 hrs</p><p>I feel no side effects, no stomach pain, nothing bad was experienced, and the only neutral effects were blurry vision, cold chills, and sweating. No discomfort except cold chills.</p><p>I learned alot from this experience. It taught me that I was doing right in persuing a life connected with plants.</p><p>Warning: these plants and fungi mentioned are not recreational toys. They are spiritual tools, to be used properly and with a great deal of respect. Many mushrooms will kill. As in not breathing anymore. I put alot of research into these shrooms before I ate them. I do not recomend trying this unless you are experienced and knowledgable about botanicles.</p><p>The people awoke in a sweat of realization, and all pain was gone. - Jonathan Taylor</p>",
 "year": "2007",
 "id": "67249",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-16T08:00:00.000Z",
 "views": "30859",
 "dose": {}
}
