{
 "id": 673,
 "title": "Downside, Different for Men and Women?",
 "date": {
  "submission": "2003-07-24T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "no name",
  "gender": "Male",
  "weight": 102
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "50",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "0:45",
   "amount": {
    "number": "200",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "4.0",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Clonazepam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "First of all, if you have a known sensitivity or bad reactions to SSRI's or many other anti-depressants or are a paranoid or anxious person I HEAVILY advise againt this stuff. As far as I'm concerned it's pharmokonetics are nothing like opiates. I first took 1 50mg capsule hoping to get a mellowed out opiate-like buzz. I waited 45 minutes and had nothing but a light-headded zip, kinda like caffiene. At this point I decided to up the dose dramatically and took 4 more 50mg capsules and emptied out the powder into a little piece of toilet paper. I swallowed it and in about an 30 minutes I was in a near panic/convulsive state. I had to take 4mg's of clonazepam (Klonopin) tabs to calm myself down but that still didn't stop my mind from falling into a deep paranoid depressed state. Luckily it only lasted about 6 hours and the ordeal was over.",
  "Here's the amazing paradox to this story, My wife (125 lbs) tried a 100mg dose of Tramadol and in exactly 1 hour she was in such a 'great place' she said she felt so euphoric and liked it so much like an opiate with speed in it. I actually had to hide the caps so she couldn't get to them. Also I offered the same dose to another girl (130 lbs) 100mg and she had the same euphoric high my wife did.",
  "I have a good friend who is heavy into pharmacueticals and he (270 lbs) took an excessive dose of 20 50mg capsules equalling 1,000mg of Tramadol and said he felt nothing except a little anxious, uncomfotable and agitated for a few hours and nothing else.",
  "Maybe the pharmakonetics of Tramadol Hydrchloride favor women over men?"
 ],
 "erowid": {
  "id": "11673",
  "citation": " no name. \"Downside, Different for Men and Women?: experience with Tramadol (ID 11673)\". Erowid.org. Jul 24, 2003. erowid.org/exp/11673",
  "substance": "Tramadol",
  "views": "36223"
 }
}
