{
 "id": 6732,
 "title": "Electricians Nirvana",
 "date": {
  "submission": "2008-03-28T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sparky",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "5"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "As soon as I finished services as a Naval Officer, I promised myself that would burn all of my uniforms and experience cannabis in a ceremony.  After several months as working as an Electrician I befriended serious tokers of the plant of the gods.  On the Fourth of July, I was initiated into altered conscious.",
  "In Kuzzles back yard, 11pm, we start smoking.  In a circle of about 5 friends I begin to slip into Nirvana.  I had smoked five times before; however, these effects motivated me to share them.  Every cannabis experience for me oddly begins with my father telling me 'When you hit those switches, its like pow pow pow pow!'  After hearing that string of words, I experience a strong vibration in my teeth.  Then something phenomenal happens.  As one writer described it, reality of my mind tries to break through to real life.  This time, it broke through.  What was imagined, I saw or at least I believe I imagined.",
  "Up until this time, I had never heard music while high.  When my friend put What the F*** in the CD player by Lil Scrappy, my mind took off.  It started with the static panther.  I saw a panther made entirely of television static.  It struck at my body in a rhythmic fashion, painlessly swiping my face off.  The skin would rejuvenate then become swiped off again.  Then came fat Albert.  As I looked at a basketball sitting on a table.  All of a sudden the entire span of my vision blacked out and turned into a strangely lit room with a real life Fat Albert doing the running man.  He was sweating profusely and playing the tambourine.  All surrounding conversation and music faded from my consciousness as I heard this Fat Albert say my name over and over again in a loud booming Fat Albert Voice.  He was extremely loud as he shouted my name repeatedly.  It was so strange.  Mind you.  What I hear is so loud that it totally drowns out all noise external to my ears.  The amazing thing about all this is these hallucinations took place well before the Fat Albert movie became a reality.",
  "My friend asked me if I wanted something to drink and I semi-snapped out of my trance.  Once my drink was in hand, POW, I began hallucinating again.  This time, it was a stream of interconnected hallucinations so amazing, that I instantly forget each successive one after another.  I had a strong desire to remember some of these hallucinations so that I can record and document them for study and contemplation.  The problem was that when I used brain power to remember a hallucination, I would loose the hallucination.  So I could only remember a little of what I saw.",
  "The only way I could describe what I saw next was a continuously changing pattern of carnival scenery.  Imagine going to an amusement park, drunk, looking through a kaleidoscope.  Visions of horses made of cotton candy, Ferris wheels made of gummy bears all swirling around in my field of vision.  This lasted for 30 minutes.  With fat Albert intermittently appearing out of the hallucination calling my name.  Then there came the thunder god.  Imagine a darkly lit room.  With a chair made of petrified wood.  A very earthy chair that forms a throne.  Out of nowhere, water is flowing down from the chair, bathing it in its glistening droplets like a waterfall.  However; the water is made of pure lightning as it runs down the throne.  Then a grotesque, naked demonic figure with red pulsing skin steps up and sits on the throne.  To perfectly explain what he looked like he looked exactly like a big blue Lord Zed from the Power Rangers.  Grotesque, naked and demonic just like him.  He represented my ego. ",
  "Looking back, it was a great experience.  Later I learned that one of the joints that we smoked was of the Hydro variety.  I still dont know what that means but people get happy when I tell them.  Nowadays, I can reach that same level of Nirvana just by listening to Lil Scrappy or Pink Floyd."
 ],
 "erowid": {
  "id": "39448",
  "citation": " Sparky. \"Electricians Nirvana: experience with Cannabis (ID 39448)\". Erowid.org. Mar 28, 2008. erowid.org/exp/39448",
  "substance": "Cannabis",
  "views": "2713"
 }
}
