{
 "id": 6734,
 "title": "Time Warp",
 "date": {
  "submission": "2006-05-09T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Skeet",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "700 mg",
   "administration": "oral",
   "substance": "Carisoprodol",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ],
 "report": [
  "A day ago, I got in a fairly serious car accident. Physical injury was minimal, I didn't have any problems besides six staples in my scalp and a sore knee from kicking my door open... but from the looks of the accident and how hard I got hit (70mph), everyone expected to me to be pretty sore the next day.",
  "To make a long story short, I'm not in much pain at all, and that leaves me with a full bottle of Vicodin and a whole bottle of Soma at my disposal. At about 9:30 I injested two 5mg Vicodin tablets, rolled up a blunt, and started watching Adult Swim. Half an hour later, I injested two 350mg Soma tablets, and half an hour after that smoked my blunt.",
  "I'm a fairly experienced pot smoker, and no stranger to vicodin. It takes a good quantity of either one to really fade me, and combined the effects of the two typically seemed to negate each other. This is the first time I had even heard of Soma, but I had been taking it the whole day before, combined with the Vicodin; just like they had given it to me at the hospital. That combination produced the expected floating sensation... but not as much as it just made me extremely drowsy.",
  "Anyway, after I smoked my blunt I started working in Fruity Loops on my laptop... and the next thing I know I get an instant message and realize it's a  quarter until two in the morning, and I missed Family Guy.",
  "In Fruity Loops I had made a little bit of progress on the instrumental, but definitely not 3 hours worth. I chase the whole experience with another one of the Vicodin and smoke a cigarette.",
  "Soma by itself didn't have much kick... but something about the weed brought about some nice effects."
 ],
 "erowid": {
  "id": "39454",
  "citation": " Skeet. \"Time Warp: experience with Hydrocodone, Carisoprodol & Cannabis (ID 39454)\". Erowid.org. May 9, 2006. erowid.org/exp/39454",
  "substance": "Hydrocodone, Carisoprodol & Cannabis",
  "views": "16343"
 }
}
