{
 "id": 6736,
 "title": "A Classic Tale of Self-Betterment",
 "date": {
  "submission": "2005-08-10T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "college boy",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  }
 ],
 "report": [
  "At the time of this experience I was spiritually lost. My first semester of college was drawing to a close; I was far from home, I missed the closeness of my old friendships, and was very bothered by the meaninglessness of my life.",
  "I was also a true nihilist. For years, I had been an atheist, a moral relativist, and an exceedingly rational person. Philosophically, I was preoccupied with the opposition of reason and emotion. I was unable to use logic to affirm the value of emotion. I believed that emotion was an evolutionary construct, but not something that had any place in the intellectual life of the modern person. I appreciated the value of emotion in art, but only in that art could be used to sort of store emotion and then elicit it in others. Almost like art was nothing more than a drug. Essentially, I felt that all art contained a heavy dose of kitsch, and that this was okayit was simply the nature of art.",
  "I had never done mushrooms or any serious psychedelics before; this was my first time venturing beyond weed. I am fairly sure that they were dried P. cubensis mushrooms. I did it with two female friends of mine, both of whom had done it before. We bought two eighths, but they recommended that we not eat it all. (I think their previous experiences had been fairly low-dosage, low level trips).",
  "We each ate maybe a gram initially. After an hour or so of not really feeling much, I made the classic novice mistake of thinking it wasnt working and that I needed more. (Im glad I did that, though.) I about half of what was left and the girls decided to split what was left so that they wouldnt be too far behind me.",
  "The first two hours were a lot of fun. We went outside and marveled at the buildings, the trees, the streets, the culture. I noticed a contrast between nature and man-made things that I had never noticed before. I felt that man had built cities to crush nature, and that beneath the streets where we were standing, nature was there, suffocating. We went from place to place and got obsessed with little things like windows and tree roots. It was very much like Alice in Wonderlandwandering from place to place having strange adventures. However, it wasnt until we retired to my dorm room to escape the cold that the experience became truly intense.",
  "On the first floor of my dorm building, we ran into a large group of our friends. They were all pretty stoned, and we really didnt want to talk to them. It was just your standard awkward encounter like, Hi, hows your night goin, I really dont want to talk to you right now. For some reason though, as soon as we left and got into my room, the three of us simultaneously expressed rage at those people. Not hate, but sort of a nasty condescension. I felt that those people were fake, dishonest, and superficial. These were all thoughts Id had before, but now they led me to a new conclusion: why the hell do I waste my time with these uninteresting people? Why shouldnt I just forget about them and focus on more meaningful relationships?",
  "We went to my room and much more intense visuals started for me. Weird color patterns in light, and the cinderblocks in the walls were moving. I hated my cinderblock room more than ever (bad feng shui) but I just dealt with it. The next few hours were the most intense of my life. I felt like I had access to all the information in the universe but could not analyze it. I was very frustrated with the inadequacy of language to express the thoughts I was having. I felt like the world was so complicated, and that anybody who claims to understand anything is lying. I also had frightening, negative thoughts, but I was able to learn from them.",
  "I theorized that in everyday life, we have mental mechanisms to block out this immense network of information that surrounds us. For Darwinian, evolutionary reasons, we focus only on simple, mundane things that are conducive to procreation. The expansion of the mind by drugs brings us closer to truth, but farther from survival. Knowledge and understanding is not necessary for survival. The only purpose of our lives is create offspring. All else is irrelevant in the larger senseeven these profound thoughts that I am having now.",
  "I hated western civilization. I felt that it was evil because it crushes other civilizations. Also, I felt that western civilization was logic over emotion; I marveled at the Tao te Ching, and its wise but irrational message. I reflected on the fact that this text was written concurrently with the birth of science and western philosophy at Athensand that the movement at Athens had had the larger impact on the world. I was very saddened by this because the Lao Tzu understood happiness and serenity far better than Plato or Aristotle.",
  "My emotions were intense and for once in my life, they were not buried by an avalanche of reason. I let myself feel. I saw things very, very distinctly from the perspective of other people. It was painfully clear to me that I had mistreated my emotionally fragile ex-girlfriend. I saw that in many of my daily interactions with people, I was arrogant and condescending. I resolved to change. I resolved to stop devaluing the emotions of myself and others, and to form more honest relationships.",
  "I also had an epiphany that for my entire life, I had been sexist. I had fallen into the classic chauvinistic trap of thinking of women as less logical and more emotional than men. Interestingly, this did not completely change, but I saw things in a new light. I saw men as emotional retards who obsess over the mundane and then call themselves intelligent. Women suddenly seemed wise and superior.",
  "I cried on like three occasions during this trip. It was a hell of a first experience, but it was beautiful and it made me a better person. Im still slightly under the spell of drug propaganda and Im more substantially worried about losing my ability to function in mainstream society due to the truths I may discover with psychedelics. However, I wouldnt trade in that first trip for anything. If you want to trees melt and feel like youre three inches tall, dont take shrooms. They wont do you any good. But if you are willing to examine yourself, and strong enough to admit your faults, I recommend them. They will help you see things from different perspectives and they will get you closer to a truth that functions outside of the mouse-wheel that is your life."
 ],
 "erowid": {
  "id": "39460",
  "citation": " college boy. \"A Classic Tale of Self-Betterment: experience with Mushrooms - P. cubensis (ID 39460)\". Erowid.org. Aug 10, 2005. erowid.org/exp/39460",
  "substance": "Mushrooms - P. cubensis",
  "views": "3368"
 }
}
