{
 "id": 6737,
 "title": "Gravity and Respect",
 "date": {
  "submission": "2006-11-30T08:00:00.000Z",
  "experience": "1996"
 },
 "author": {
  "name": "Medea",
  "weight": "78 kg"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Datura",
   "form": "(leaves)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>My experience was to see a thorn apple (Datura Stramonium) growing in a churchyard. I was familiar with the plant's reputation and, having read Castaneda, decided to 'make friends' with the plant first. I walked past it several times, greeting it and talking to it over the next few days, and then came back one the night to harvest it. You may laugh at this 'mumbo jumbo', but I believe it contributes to the correct attitude of respect that is necessary to have a positive experience.",
  "At that time I was a habitual user of skunk, smoked in a small glass waterpipe, so I decided just to try a small fragment of leaf, about a 4 mm together with a full bowl of skunk. This was certainly enough for me to feel something within 5 or 10 minutes, some kind of strange 'gravitational distortion' effects in my brain, as if someone was rubbing two like poles of a magnet together up there, and a feeling of 'shifting' of my point of consciousness. I felt very sure that I was on the threshold of a 'heaven or hell' experience, and resolved to keep the dose at this low level.",
  "Subsequently I would sometimes try another leaf fragment together with Cannabis in my waterpipe, and each time it would intensify (and somewhat eclipse) the THC high. Interestingly, my datura experiences, while almost entirely positive, have contributed to my decisions to almost entirely give up psychoactive drugs and herbs. I maintain an interest in them, and occasionally partake, but now I find that good-old-fashioned hypnotic trance can go a long way.</p>"
 ],
 "erowid": {
  "id": "39461",
  "citation": " Medea. \"Gravity and Respect: experience with Datura & Cannabis (ID 39461)\". Erowid.org. Nov 30, 2006. erowid.org/exp/39461",
  "substance": "Datura & Cannabis",
  "views": "16071"
 }
}
