{
 "id": 6741,
 "title": "Running and Waving",
 "date": {
  "submission": "2008-03-28T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Atman",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "I have had several experiences w/ salvia in the past, all of which were mind-boggling & led me to question everything I take for granted about my Self. However, the experience in which I am about to share w/ you is unlike any other.",
  "I was alone in my house. I put on some Miles Davis & rolled a joint of some fair cannabis. This helped to get me relaxed & give me time to contemplate my 'mission', what it is I wish to accomplish. I remind myself to meditate only on that which is eternal. I placed a fairly large hit of the salvia on top of a sliver of cannabis inside my glass water-pipe. 'Here goes nuthin'' crossed my mind, & I flamed the bowl. I took in all of the smoke rather easily. I replaced the bong to the table, sat back, closed my eyes, & blew out the smoke when I could'nt hold it any longer. As the familiar taste/aroma of the leaf flooded my being, I exclaimed 'I remember you!' & what exactly happened after this is not clear to me.",
  "I lost all connection w/ reality & the Self. I 'woke up' in another place. I was seeing thousands & thousands of people running from all directions toward a bright white light in the center. Everyone was laughing hysterically & waving their right arms in the air, as if signaling to the light that 'I am here' or 'don't forget me.' Once I took notice the the people & what they were doing, I heard a familiar voice laughing w/ immense joy & repeating over & over 'They're all running & waving! They're all running & waving!' The voice was my own. I was laughing & saying this, but it was not of my will. My voice seemed to come from a far-off land.",
  "Before long, the objective statement of 'They're all running & waving' turned into the subjective 'We're all running & waving,' & instantly I was caught up in the action of running & waving along w/ everyone else, trying desperately to make it to the light.",
  "At that point, I again heard my own voice in the distance. 'If you go to the light, you'll die. Don't go to the light.'",
  "This invoked an inner sense of panic, & I tried w/ no results to cease my running & save my life. I just kept on 'running & waving' & laughing all of the time, but inside I was manic & unsure of what was going on. I got the sensation that what I was doing was'nt right, that I was'nt supposed to be there yet, & at that moment, I began to feel a vibration along my back & my butt. 'The couch!' All of my senses flooded w/ information from the room I was in. I was back & intact, except the visual aspect of it persisted. Again, I paniced. I knew that I had hit the salvia, & I knew where I was, but my eyes were still watching the other world. 'When will this stop!?' Immediately following this inquisition, my eyes popped open to reveal my living room. I did'nt think to open my eyes, because in my mind, they were already open.",
  "Following the experience, I was extremely energetic in communicating to everyone that I know the importance of what had just been revealed to me. As clueless as I am about what actually occured that day, I know that 'something' happened, & in my mind, it changes everything."
 ],
 "erowid": {
  "id": "39466",
  "citation": " Atman. \"Running and Waving: experience with Salvia divinorum (20x extract) (ID 39466)\". Erowid.org. Mar 28, 2008. erowid.org/exp/39466",
  "substance": "Salvia divinorum (20x extract)",
  "views": "2428"
 }
}
