{
 "title": "The Safe Drug...Right..?",
 "author": "Berto",
 "citation": " Berto. \"The Safe Drug...Right..?: experience with Cannabis (ID 67414)\". Erowid.org. Dec 1, 2007. erowid.org/exp/67414",
 "substance": "Cannabis",
 "bodyweight": "165 lb",
 "report": "<p>[Erowid Note: Some authors report suspicions that their cannabis has been 'laced' (adulterated). While this is possible, readers should be aware that idiosyncratic response to the effects of cannabis (usually higher doses) can lead some users to presume their cannabis has been 'laced'. There is no way to know if the cannabis in the report below was adulterated or not.]</p><p>I was with a friend last night.. yes last night.  We were both depressed so we wanted to ' smoke some dope.'  It is a common misconception in my school (I'm a junior in hs) that Weed  is a safe drug and just numbs you.  true right?</p><p>COMPLETELY WRONG</p><p>we Lit our bong thinking yeah we're gona get wasteD!!  fuck the world we're gonna get wasted...forget our problems!! So we smoke and smoked.  About 2 minutes later, I started seeing the moon from his door... and it looked like it had rings around it.  I then immediately started feeling the effects.  I Saw Christopher columbus, and then I Saw Jesus on a beach walking with me, and then I saw a ring and then I Was on the moon.  I then immediately fell down to the ground.  I woke up 5 seconds later and started screaming, ' THE DONUTS ARE IN THE OVEN.'  I then immediatelye felt my heart pounding out of my chest.  I thought I was going to die.  My heart was pumping a million times faster then my head which was spinning.  I went to my friends basement tried to chill and went home.</p><p>It is now 10 hours later and I am half normal and still half high... what can I say about weed?</p><p>1.- its not a safe drug, neither is any drug sold on a black market, and I certaintely dont know if what I'm getting is laced or not, because lets be honest, drug dealers dont care about my health</p><p>2.- My weed was most likely laced with Hallucigens bc my effects were not supposed to be felt with weed.   All i know is I'm never touching this shit again.  It made me want to die I kept asking my friend, I feel like I'm going to die.  what the hell am I doing.  I didnt know anything I Was saying and I wanted to die feeling like I was in a hole of non reality and I would never get back to reality.  For once, reality seemed like something nice to me.</p><p>all I know is I'm never touching this shit again, I  dont know what is in it, but I am never ever touching this again.  It is garbage and I will never use any other drug on the market.  I had a seizure immediately after I woke up and couldnt control my muscles?  Weed so safe? Think again...</p>",
 "year": "2007",
 "id": "67414",
 "gender": "Male",
 "timestamp": "2007-12-01T08:00:00.000Z",
 "views": "3337",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
