{
 "title": "How I Avoid Sickness",
 "author": "YopoYoyo",
 "citation": " YopoYoyo. \"How I Avoid Sickness: experience with Anadenanthera colubrina (ID 67439)\". Erowid.org. Jul 22, 2008. erowid.org/exp/67439",
 "substance": "Anadenanthera colubrina",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "3 seeds",
   "insufflated",
   "Anadenanthera colubrina"
  ]
 ],
 "report": "<p>I had tried yopo about 6 times now. I have never puked, only felt a bit sick when I gave myself a drip accidentally. The seeds I purchased are of a high quality. I say this because I have experienced very powerful effects from seeds prepared in the same way others complain of no effect.</p><p>Three days ago I prepared 20 seeds. I used about 16 big ones and 4 small ones. On a gentle heat in a pan til they popped. Not all of them, I didn't want to burn any. Then removed and threw away the casing, crushed up the insides in a mortar. Mixed in baking soda. Approx 4:1 ratio, with yopo in the majority. To this I then added a drip of water and mixed with fingers. Continued adding drips until similar to dough. I then kneaded this substance for several minutes. Left it out in the open for a day. The next day crushed it up and left it for another day. By then it was pretty much totally dry. Bagged it up for future adventures. Of course I had to try a little!</p><p>By eye I divided it into half then quarters, then halved the quarter. Therefore 2.5 seeds, added a bit more for good luck. This was then divided into four equal lines. (using mortar and pestle first). The way I snort and act after is, I think, the most important aspect to gain a good trip. The way I did it was to snort two lines, one up each nostril. The pain is horrid, but most definitely much more bearable than when I prepare just before I snort. Probably 50% less pain. Just snort all the way up in one go, right up there. Wait for the pain to subside for about a minute. Then rail the other two, one up each. I don't sniff no matter how badly I want to. I'll only get a drip and feel awful and maybe puke. Just let it sit there, absorbing. After about 5 minutes the pain will mostly have subsided.</p><p>I start getting a gentle then quickly powerful full body heaviness setting in. Then I'll start feeling real nice and giggly. Things start looking a little funny. Like that effect I can put on photos where there are only a few colour layers on each object. Approx 7 minutes after snorting, I blow my nose really hard into a tissue. It's all gone. No sickness, puke free. I know you're kind of meant to puke. For all those purists out there. I think I'll save that until I'm actually in a jungle in South America. Then sit back and enjoy.</p>",
 "year": "2007",
 "id": "67439",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-07-22T07:00:00.000Z",
 "views": "12232",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 seeds",
   "administration": "insufflated",
   "substance": "Anadenanthera colubrina"
  }
 ]
}
