{
 "title": "The Darkness of My Mind",
 "author": "cPrime",
 "citation": " cPrime. \"The Darkness of My Mind: experience with Mushrooms & Cannabis (ID 67437)\". Erowid.org. Jun 15, 2009. erowid.org/exp/67437",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "1 g",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  "3 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>This is an account of the worst experience I've ever had with psilocybin mushrooms, or for this matter, any drug I've taken yet. It was terrifying, but at the same time a valuable experience that taught me a lot about myself. I still remember the night because I went through what I remembered the next morning over and over because I felt there was something to learn from this waking nightmare.</p><p>It all started at my friend's house one night. We were all just sitting around smoking weed and getting bored because nothing exciting was going on. I smoked about a gram of good pot with my friend in buckets (I have a very low tolerance to THC so I was VERY stoned after this session). It was only about 7 people there and it was all people I was used to hanging around with. Around 9pm another friend showed up with some mushrooms he wanted to sell. I had taken psilocybin mushrooms a few times before this so I was familiar with the effects and my best dosage. I was really bored and wanted to take some shrooms to have some fun, but no one else was interested. Finally I decided to buy some and trip alone. I didn't think there would be any surprises since I already had experience with mushrooms. I was dead wrong.</p><p>I ate 3 grams after a buddy kept bugging me to take them, and washed it down with a big bong hit. It was the first time I had taken them alone and I was about to find out it was something completely different. I had previously told a friend, I'll call him 'Steve', that he could stay over at my house that night. He was very drunk already, and was mostly oblivious to the terrible experience I would have that night.</p><p>After about 20 minutes I was starting to feel uneasy and the first signs of the trip were coming on. I'm not sure why I was getting nervous but it may be because I was so high from the pot I had smoked, and I realized that so one else was doing mushrooms with me. These feelings of anxiety increased as I sunk deeper into the trance of the mushrooms. Things around me seemed unreal and foreign, even though this was a familiar setting.</p><p>At about an hour after ingestion the full effects started to grab hold of me. By this time I was becoming very anti-social and self conscious of how I was behaving. I kept trying to calm down by playing video games but I was having unpleasant hallucinations where the whole game turned inside-out and this made me feel nauseated. It seemed like the more I tried to converse with people and have a good time, the worse my trip got. The moment I realized I was having a bad trip was the turning point of my whole experience. I started to panick, but tried not to show it. I went to the bathroom to look at my eyes when I realized my pupils were extremely dialated and my eyes were blood red. When I looked at the toilet there was urine all over the floor around it and feces smeared over it. This was extremely disturbing and I got out of there.</p><p>I decided I wanted to go home and sleep off my bad trip. When I asked 'Steve' if he wanted to go back to my place to crash, he was reluctant because he was so drunk and wanted to stay longer. For some reason I felt I couldn't ruin his night just because I was tripping out so we agreed we would leave in 2 hours. For the next 2 hours I sat completely silent, living in my own mind hell as I waited eagerly to go home and end this nightmare. Finally, I decided I had waited long enough and I told Steve we had to get going. He laughed at me and said it had only been 10 minutes. This was when my mind totally imploded. I had lost all perception of time and I really started to freak out.</p><p>I thought some fresh air would help so I walked to the store. The cashier gave me a funny look so I must have been acting strange, or so I thought. On the way back I started to realize how strange the society we live in is. Why do people treat each other like they do? Why do we need to have every convenience possible to make our lives a little easier, at the expense of others? My mind was racing and I couldn't stop it. When I got back to my friend's house, It was as if everyone there were total strangers. All of their faces were twisted and contorted into sick shapes and I couldn't even talk to anyone without feeling sick. By this time my friends were all talking about how messed up I was and it only made me sink further into madness.</p><p>Insanity. Suddenly it occurred to me that I had lost my mind. My ego was completely destroyed at this point and I could barely keep from breaking down. Everyone was watching me. I started to think that maybe I had been insane all along and I was just realizing this for the first time. They weren't really my friends, just people that felt bad for me and couldn't tell me how messed up I was. This was the most horrible and degrading feeling imaginable. I felt like a retard who was too mental to know how mental I was. Thank god Steve finally decided it was a good time to leave. I couldn't stand these distorted alien people's pity any longer. We walked a long distance in the cold to get back to my house. At first I talked distantly to my pretend friend who was only using me for a place to sleep and a meal.</p><p>Suddenly, I had a chilling realization. Steve didn't exist at all. He was only a figment of my imagination created to cope with this terrible and cruel world. I had just seen the movie 'A Beautiful Mind' and I was getting paranoid that I could be hallucinating entire people and I wouldn't even know it. It was at this point that I stopped talking to Steve in case others saw me talking to a person who didn't exist. This was the most terrifying experience I have ever felt, realizing my own insanity and complete delirium, unable to separate my mind's creations from reality. After Getting home my trip was starting to lose it's momentum but I was still scared and my friend was confused at why I wouldn't talk to him. I couldn't sleep. I was afraid this would never end.</p><p>The next morning I tried to explain this to Steve but he just couldn't understand the nightmare I had lived through. I had regained my sanity and most of my confidence but I was still shaken. Never had I experienced anything that terrifying in my life, the feeling of total insanity. I have learned a lot about myself from those horrible mushrooms but I still wish it had never happened.</p>",
 "year": "2006",
 "id": "67437",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-06-15T07:00:00.000Z",
 "views": "3331",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": "3 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
