{
 "title": "I Thought She Was Going to Die...",
 "author": "Akatzu",
 "citation": " Akatzu. \"I Thought She Was Going to Die...: experience with Cocaine (ID 67453)\". Erowid.org. Sep 25, 2009. erowid.org/exp/67453",
 "substance": "Cocaine",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "3 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>My girlfriend and I had been doing cocaine on occasion together on the weekends alone (just her and myself) we generally would do about an 8 ball in a night and not mess with it again for a few weeks, then we would have another 'talk session' as was the intended point of this use. Our experiences were very pleasant for the most part... Wonderful communication, stimulation and sexual lustfulness. However the first night we decided to get a quarter oz thing turned very bad.</p><p>We took larger doses within less time (about 5 hours), and being that I'm in the army I took a little more than her by dosage. About 4-5 hours into our 'talk' her eyes rolled back into her head and she began to shake violently, clenching all her muscles and making a horrible gurgling noise. I was able to fight her mouth open to prevent her from swallowing her tounge and I knew when dealing with seizures not to fight it. Just as i was about to freak out and call her mother into the room she stopped shaking and lay limp on the bed.</p><p>I thought she was dead, but then she started snoring loudly. I then tried to wake her up and see if she was coherant. She slowly came to and it seemed as if she might have been brain damaged for quite some time after that, maybe an hour it took her to remember her name. She fully recovered in time and I had to explain to her what happened as she had no memory of the occurance. I was frightened that she had had a stroke related to overdose because her motor function came back just as slowly. This happened two more times that night and form then on I vowed never to do it again... she is just too precious to me.</p>",
 "year": "2007",
 "id": "67453",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-09-25T07:00:00.000Z",
 "views": "9237",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ]
}
