{
 "id": 6745,
 "title": "Feeling 'In the Body' Like Never Before",
 "date": {
  "submission": "2005-01-04T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Noviseer",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "13 in",
   "administration": "oral",
   "substance": "Cacti",
   "form": "tea",
   "specific": "T. pachanoi"
  }
 ],
 "report": [
  "Sometime last week I was online reading a thread about new year's eve drug plans. It inspired me to get up and prepare a batch of pedro tea from my light and water-starved 13 inch San Pedro Cactus. I sliced, blended, boiled, and strained it into an amount that eventually filled one standard-sized red beer cup. As the big night approached, it became apparent that I was going to be doing a lot of walking, interacting with hordes of drunken friends, and other demanding but fun tasks, so I decided to pay attention to set and setting, and took a rain check on the mescaline.",
  "New years eve was fun, the next day's hung-over shift at my delivery job wasn't, and then Sunday finally arrived. I got up around 11am to a cold, windy, rain-swept town. That wasn't about to stop me. I went on a run to get my mind and body stimulated and then slowly drank the ultra-bitter slime. The first sip is always a revolting surprise, but it's really pretty easy to drink with a chaser.",
  "About an hour went by and I didn't feel much yet, at this point I'm thinking my cactus was weak. Mild 'alert' feeling, that's about it. My girlfriend and I went to a local park, feed a pack of agressive geese in the pouring rain. After that we snuck into a local gated community and went in one of their public jaccuzis. This is where I started to trip.",
  "As I relaxed in that water, the surrounding environment started to take on that dramatic condition that psychedelics seem to bring about. The world looked like a stage, my girlfriend and I the audience in some sort of cosmic play. I started to see subtle faces in the trees, and got pretty excited that the mescaline was finally kicking in. I got an uncomfortable feeling in my teeth, a sort of dirty speed side effect, which would be the only negative for the rest of the trip. I was starting to trip, but still feeling nauseated.",
  "We got bored of the jacuzzi and decided to head back to my apartment. We got there 3 hours after ingestion, and so began my 3 hour peak. I had kaleidoscopic CEV's, saw faces and swirls in the ceiling, but I wasn't paying any attention to the hallucinations at all: my BODY took center stage.",
  "I felt incredible. I was accessing a much higher amount of the sensorial data entering my brain than normal. I could feel the mucus in my sinuses, the different textures of all the sheets on my bed. It was a body-trip. The air tasted like sweet vanilla. I was hallucinating all sorts of pleasant tastes and smells. I had the best sex ever. In the height of it I told my girlfriend that she tasted like the rainforest and smelled like an angel. Mescaline and sex were made for each other. Just kissing was as intense as most orgasms.",
  "For the next three hours we just layed around in bed. I wasn't getting the sort of profound, optimistic thoughts that I do on psilocybin, I was just a lazy bastard, stretching, rolling around, grinning a non-stop smile, totally without reservation, completely happy.",
  "I had so much fun playing my drumset, the drug definitely syngergized creativity, helped get me into some new grooves I'd never played before.",
  "I like mescaline, but not nearly as much as mushrooms, which always make me insta-guru, feeling like an explorer venturing through the wonderful wide world. On mescaline I just layed around and had sex. Both are amazing gifts from the plant world, I'd like to say thank you to whoever made these incredible experiences up. ANd thanks to mjshroomer for such an easy, effective, and only minimally disgusting prep technique."
 ],
 "erowid": {
  "id": "39489",
  "citation": " Noviseer. \"Feeling 'In the Body' Like Never Before: experience with Cacti - Trichocereus pachanoi (ID 39489)\". Erowid.org. Jan 4, 2005. erowid.org/exp/39489",
  "substance": "Cacti - Trichocereus pachanoi",
  "views": "21743"
 }
}
