{
 "id": 6749,
 "title": "Pot Dreamland",
 "date": {
  "submission": "2001-03-05T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Chaval",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "This report is intended to attest to the extent that Cannabis is capable of putting you out like a light. One night, my friends and I decided to have a little jam session at a friend's garage. This entailed playing music with little or no actual cohesion, and smoking lots of weed.",
  "Before entering the experience, I was not noticably tired. Keep this in mind. Also, I have a relatively low tolerance to weed.",
  "T+00 The first bowl gets passed around as we are setting up our equipment. The weed is of fairly good quality, and by the time we are all done smoking, I'm starting to feel fairly stoned.",
  "We play music for a while. We have only one light in the entire loft, a lamp pointing straight up. This caused the surroundings to be either illuminated in light or cast in pitch black shadow. The intense contrast in lighting might have contributed to the experience.",
  "T+60 Starting to feel a bit tired.",
  "T+90 I eat a meatball sub, and smoke more weed. I was VERY hungry at this point and wolfed down the sandwich.",
  "T+95 I finish sandwich and realize that energy level is declining rapidly.",
  "We play more music for a while. I am still sitting on the couch as I have no inclination to get up, being very tired and very stoned. Starting to loose motor coordination.",
  "T+140 We smoke yet another bowl, which in retrospect, given my level of exhaustion, was a really stupid idea. I still had to drive home, which fortunately was only 20 minutes away.",
  "T+170 I bid my friends goodbye, and climb the ladder (we were in a loft) down to my car. Climbing down can only be described as choppy and unsteady, and I'm sure my balance was horrible at that point.",
  "I had told my parents that I was going to be home by 11 as it was a school night. They are usually asleep by then, so it wouldn't matter how stoned I would be when I finally arrive. However, it was only 10pm. I had an hour to kill, so I figured I'd drive my incredably stoned and out of it self down to the beach parking lot, and chill out there for a while.",
  "T+190 I arrive at the parking lot. It's now 10:20 and I'm still extremely stoned and tired, I make the foolish mistake of 'resting my eyes.'",
  "T+310 (120 minutes later) I wake up, realize I am an hour and 15 minutes late, and zoom home. I had slept off most of the effects of the weed, and was feeling refreshed.",
  "Luckily, I didn't get into any sort of trouble for this incident. But, it did teach me that Cannabis can make one extremely tired, to the point of not being able to keep oneself awake unless one's eyes are open. Although random slumber is not necessarily a bad thing, I definitely think I should not have been driving that night, as I very well could have fallen asleep at the wheel. Be forewarned."
 ],
 "erowid": {
  "id": "3950",
  "citation": " Chaval. \"Pot Dreamland: experience with Cannabis (ID 3950)\". Erowid.org. Mar 5, 2001. erowid.org/exp/3950",
  "substance": "Cannabis",
  "views": "9333"
 }
}
