{
 "title": "Had a Seizure in the Office",
 "author": "Belladonna",
 "citation": " Belladonna. \"Had a Seizure in the Office: experience with Tramadol & Doxepin (ID 67503)\". Erowid.org. Jan 19, 2008. erowid.org/exp/67503",
 "substance": "Tramadol & Doxepin",
 "bodyweight": "110 lb",
 "report": [
  "<p>[Erowid Note: No contact information was provided with this report, so we are unable to confirm it or follow up with the author. It is our policy to try to verify any life-endangering adverse reactions which people report, where possible. If the author reads this, please contact admin@erowid.org.]",
  "This is a warning NOT to mix Tramadol/Ultram with Tri-cyclic antidepressants such as Doxepin. I was prescribed Doxepin to help me sleep, was taking normal dosage, 1 capsule/day, and took 4 Ultram/tramadol that day before work. ",
  "About 2 hours later, I was on a telephone conference call and started feeling jittery, then suddenly my jaw just started opening and closing and I couldn't control it, I was stuttering into my conference call.  I had to slam down the phone.  Next thing I remember, I woke up to see a complete stranger staring into my face asking if I was OK. that stranger, about a minute later, turned out to be my best friend at work. Complete  amnesia, temporarily.  There were paramedics there and I was told I had a grand-mal seizure, right there in my cubicle.  I remember nothing of it.  I went to the hospital and gradually (within an hour) remembered what medicines I had taken to do this to me.",
  "I will NEVER take a tri-cyclic again, and ultram maybe in very small doses.</p>"
 ],
 "year": "2007",
 "id": "67503",
 "views": "12710",
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Doxepin",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "4 tablets",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2008-01-19T08:00:00.000Z"
}
