{
 "title": "The Buzz",
 "author": "Mei Huang",
 "citation": " Mei Huang. \"The Buzz: experience with Methylphenidate (ID 67740)\". Erowid.org. Jul 19, 2011. erowid.org/exp/67740",
 "substance": "Methylphenidate",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)",
   " T+ 0:05",
   "15 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2007",
   "67740",
   "Female",
   "",
   "Not Given",
   "Jul 19, 2011",
   "4434",
   " "
  ]
 ],
 "report": "<p>I take methylphenidate every now and then because it's quite different.  At a lower dosage, it acts more like a CNS. [??] At a higher dosage, it's a lot like cocaine with the energy of MDMA.  I have anorexia with a very low BMI and rarely have a 'full' stomach, so I am pretty sensitive when it comes to drug absorption.  What 30 mg does for me might not do the same for you.</p><p>Ritalin LA comes in capsules, but inside the capsules are little bits of MPH that look like tiny dip-n-dots.  I crush these into a fine powder before you snort them.  For the tablets, I just crush them to the consistency of powdered sugar.  The smaller the particles, the more surface area of the substance, and the more absorption that will occur. I usually divide the 30 mg into two 15's, then snort each one separately between about 5-10 minutes, just to be on the safe side.  The rush sneaks up on me.  At first, I'm just hanging around as usual, but then I find yourself getting antsy and wanting to go for a walk, and the walk isn't good enough so I want to run or dance or violently headbang to loud music, and I find myself in an incredible rush of energy and endorphins.  It feels a lot like cocaine without so much of that 'rounded' feeling, and like MDMA without the fuzzy-body feeling.  It's quite different.</p><p>The after-effects are based on how much I take.  Taking 30-40 mg (empty stomach) gives horrible insomnia after the rush, and while it may not feel that bad during that 48 hour period of no sleep, it surely does not feel good on that 49th hour.  I can't say whether or not it kills my appetite, because my hunger signals are so messed up from my eating disorder that I have no idea.  I can say that other people that I know that take Ritalin non-recreationally don't eat much, until 8pm when it wears off for them and they eat three dinners.   Taking too much will give me headaches, nausea, confusion, dizziness, and mild cognitive distortion in addition to the insomnia, which isn't very fun.</p><p>In short, MPH is a very different drug with huge similarities to cocaine and MDMA, is easier to purchase (and cheaper), but has bad after-effects depending on dosage.</p>"
}
