{
 "title": "Drunk for a Week",
 "author": "Hembree",
 "citation": " Hembree. \"Drunk for a Week: experience with Alcohol (ID 67773)\". Erowid.org. Sep 29, 2009. erowid.org/exp/67773",
 "substance": "Alcohol",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "Alcohol",
  "(liquid)"
 ],
 "report": "<p>Ever since I was about fourteen I have been known to drink a little more than I need to. It was no different this time. I am seventeen now and drink almost on a daily basis. But anyway, here is how it started. My sister was turning nineteen and she was having a huge party at the hilton hotel. I was told there would be lots of alcohol. Well this party seemed appetizing to me seeing that there would be an untold amount of alcohol present. So I went.</p><p>Soon as I got to the party I started slamming down shot after shot of hennesy and hypnotic. I must have drank around ten shots when my brother in law saw that I was drinking up all of his hennesy and so he took it from me and pointed me in the direction of the beer. So the night went on and I was happy with my drunkeness at this point. We were playing quarters, and pong, and other various drinking games. At this point sipping the beer was no good, I felt as though I had to chug. So I did. Somewhere between my fifthtenth and twentieth beer I decided to confront my brother in law about how he hits my sister when they are at home. This started a fight, and he is much bigger than me. I got beat on for a little bit until my sister noticed us fighting and stopped it. So the night ended and everyone went home except a few of us.</p><p>I woke up the next morning feeling fine, so I opened up another beer and started drinking. When I had woke up I noticed that I must have got so drunk the night before that I still couldnt see straight. We finally left to go to my sisters house, bringing the untouched alcohol with us. I continued for about a week of drinking beer all day long from the time I woke up until the time I passed out.</p><p>Alot of things I cannot remember about that week. I remember nearly drowning in a hot tub and almost crashing my sisters car into a stop sign. That week was the best week I will never remember. Best thing about it, I didn't have the slightest bit of hang over, and I only threw up a few times. But for some reason I had a sharp pain in my side for about a month and the next two or three bowel movements I had were insanely painful.</p>",
 "year": "2007",
 "id": "67773",
 "gender": "Male",
 "age": "17",
 "timestamp": "2009-09-29T07:00:00.000Z",
 "views": "12033",
 "dose": {}
}
