{
 "title": "Journey In The Mind's Eye",
 "author": "Nexis",
 "citation": " Nexis. \"Journey In The Mind's Eye: experience with BDB (ID 67787)\". Erowid.org. Jan 26, 2012. erowid.org/exp/67787",
 "substance": "BDB",
 "bodyweight": "145 lb",
 "header": [
  "DOSE: T+ 2:00",
  "50 mg",
  "oral",
  "BDB ",
  " T+ 0:00",
  "200 mg",
  "oral",
  "BDB "
 ],
 "report": "<p>BDB First Experience  Journey In The Minds Eye</p><p>A BDB excursion</p><p>2-AMINO-1-(3,4-METHYLENEDIOXYPHENYL)BUTANE; 1-(1,3-BENZODIOXOL-5-YL)-2-BUTANAMINE</p><p>Had the good fortune to experiment with BDB last weekend. Took 200mg and felt a surge around 45min into it. I was reminded of methylone at first but there was something else here that was surprising. The happiness and good feelings of methylone were present but I got into much more of a trippy headspace not unlike MDA.  I noticed a lot of color enhancement and time dilation. I was in a nightclub where there was dancing but felt no urge to dance even though there was a good amount of stimulation. I began having difficulty concentrating on the activity around me so I sat back on a nice leather couch. It was becoming more intense. For a while, it felt like I was somewhere else. I was traveling somewhere distant in my minds eye. It was like my mind was shutting out the inflow of my  immediate surroundings, the music, people, lights and pushing it to the background and taking me somewhere else. I didn't try to resist this and let it take me wherever it would lead.  I began to recall the events that happened earlier that day and in my minds eye I was reliving them but from a perspective of an independent observer.  I then recalled a recent dream I had and was reliving that experience and it was a very pleasant one. I don't remember all the details or how exactly long this lasted.</p><p>After coming out of the minds eye view, I thought this was probably not the ideal environment for this so  I left the club and took the booster dose of 50mg somewhere around the 2 hour mark which brought me to a plateau which lasted for about 4 hours. I got the overwhelming feeling that everything before me, surrounding me, past and present was 'right' and there the universe was in harmony. The future was now, in the present and there were no worries over the path I was on.</p><p>I took a walk around a lake near my apartment and the cool swift breeze blowing on my face felt wonderful. As I was watching the waves on the water and just hearing the sound of the waves breaking on the shore I could feel calm waves of euphoria washing over me, over and over pushing me further into a blissful consciousness.  The stars looked much brighter and the night sky was just serene. The experience brought me closer to my inner thoughts and at the same time closer to the universe around me. I thought the earth to be a living being, nurturing her inhabitants with food, water and energy. When I try BDB again it will be outdoors for sure because I felt this was the  place to bring out the best in what she had to offer.  There was a strong desire for closeness and communication. I  felt the trip would have been magnified if I had tripped with my girlfriend, but sadly she doesn't approve of my experimentations.</p><p>I felt fine the next day. Conclusion: BDB has similarities with methylone but I thought it was much trippier. It has the special magic of MDA/MDMA but seemed far gentler on the body without the severe depression the next day.</p>",
 "year": "2007",
 "id": "67787",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-01-26T08:00:00.000Z",
 "views": "2424",
 "dose": {}
}
