{
 "title": "Sleepy Smoke",
 "author": "Herb",
 "citation": " Herb. \"Sleepy Smoke: experience with Skullcap & Salvia officinalis (ID 67790)\". Erowid.org. Jul 18, 2011. erowid.org/exp/67790",
 "substance": "Skullcap & Salvia officinalis",
 "bodyweight": "200 lb",
 "report": "<p>I bought some scullcap from a local herbalist a year ago to brew as a tea for insomnia.  As a tea it had proven to be mildly sedative but it was difficult to brew without an infuser, as a  result I rarely used it.  For almost a year it sat in my pantry until I began researching 'legal bud' and alternative smokes and discovered scullcap to be a common ingredient.</p><p>I mixed a bit of scullcap with some sage (another ingredient found in some herbal smoke blends) from my pantry.  I chopped the two substances up on a tray and rolled a medium sized cigarette from the blend.</p><p>Unsure about what to expect I lit an incense stick and relaxed a moment, then I lit the cigarette and proceeded to take about 4 or 5 hits.  The smell was pleasantly sweet and a little earthy, the taste was spicy, earthy and rounded out nicely on the exhale.  Within minutes I was surprised and shocked to feel the effects were MUCH STRONGER than I ever expected!  Wow!  I was experiencing a unique, dizzy sort of buzz, my body was tingling, and I felt very relaxed and sedated.  I almost panicked because it came on sooo strong!  After about five minutes I became VERY SLEEPY and that scared me a bit too.  The intensity of the effects caught me by surprise.  I had slight difficulty with motor skills and there was some indescribable and weird effect on my vision, blurriness or difficulty focusing perhaps?  The effects were soooo noticable and strong but not at all unpleasant!</p><p>After 15-20 minutes the effects were gone.  I'm alert, awake, and back to normal now and thinking about finishing my skullcap cigarette.</p>",
 "year": "2007",
 "id": "67790",
 "gender": "Male",
 "timestamp": "2011-07-18T07:00:00.000Z",
 "views": "5342",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Skullcap",
   "form": "(dried)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia officinalis",
   "form": "(dried)"
  }
 ]
}
