{
 "title": "Slightly Sedated and Rather Relaxed",
 "author": "MDL",
 "citation": " MDL. \"Slightly Sedated and Rather Relaxed: experience with Hyoscyamus Niger (ID 67855)\". Erowid.org. Mar 29, 2013. erowid.org/exp/67855",
 "substance": "Hyoscyamus Niger",
 "bodyweight": "195 lb",
 "header": [
  "DOSE:",
  " ",
  "",
  "Hyoscyamus niger"
 ],
 "report": "<p>I decided recently that I am going to conduct a series of experiments on plants and herbs that are legal to purchase in the US.  My first victim will be: Hyoscyamus Niger.  Henbane is a member of the nightshade family, containing the atropine alkaloids that are considered to be very poisonous as well as hallucinogenic (among other things) depending on the dosing.  As far as I have researched into it, the seeds of the plant are supposed to be most potent, followed by the roots.  Based on other plants and herbs out their, I can only assume that when it comes to dry or fresh leaves, that fresh are more potent then those dried as well.  However this is not proven, or at least I have no knowledge of this being 100% true.  I was able to order an ounce of dried henbane foliage over the internet.</p><p>First off a little more about me, I am only 16 years of age, 511, and 195 pounds.  I exercise regularly and consider myself to be healthy.  As far as drug use goes, I have tried Ecstasy, LSD, Cannabis, salvia, vicodin / hydrocodone, and barbiturates.  I dont consider myself to be a full blown psychedelic maniac I am just totally and completely fascinated in chemical reactions and responses.  I plan to approach everything that I test carefully and intelligently.</p><p>Into my first experiment, I simply start off by boiling some water and dumping it into a small 8oz French press.  I then add about 1 and  teaspoons of dried henbane foliage.  I simply let it steep for approximately 1 hour.  It was about 10:30 when I had finished the henbane tea, and frankly it wasnt half bad at all  kind of mild.  Anyone could easily stomach this.  I remember now that I have indeed been eating regularly through out the day, and my last meal was a bowl of cereal at about 8pm.  (The last meal for the night).</p><p>0:30 I feel as if my eyes are wide open; I feel slightly sedated and rather relaxed.  My heart rate seems to slow down and then speed up a lot.  I check my eyes for dilation, and notice nothing to that level.  Without the dilated eyes I have a feeling that these feeling are possibly standard as the night grows on + anxiety or placebo of some kind.  This is good though considering I was planning on keeping it as safe as possible and work up.</p><p>1:00 it would seem now that its time to lie down and for me to write more in the morning.  I plan to stay up at least another hour and see if this plant has any effect on dreaming that I will be able to recall.  I checked the mirror and my eyes seemed to have dilated some what, but not too incredibly large.  Also I have had to pee twice in 1 hour, which will sometimes happen when I drink tea, but will sometimes tend to happen due to the atropine alkaloids.</p><p>1:30 When I was lying down I began to feel my head start to spin and my vision blur slightly.  My mouth was getting rather dry (cotton mouth).  These sensations continue till I begin to fall asleep about  hours later.</p><p>This preparation of henbane had no effects on my dreaming, (of which I didnt expect it too, considering this plant hasnt been known to induce such things.)  When I woke up the next morning my eyes were still slightly dilated.</p><p>Experiment two:  This time around I will be simmering the henbane for 15-20 minutes and then let steep for 10 more minutes off the burner.  I will be adding 4 teaspoons of dried henbane foliage to two cups of water.  Also, this time around I wont be alone, a friend of mine will be taking the same drink; the idea here being that we both get 1 cup of henbane tea with 2 teaspoons of henbane in each.</p><p>0:30  My friend with me who happens to be 115lbs and has ADD, naturally has always dilated eyes.  At this time its impossible to tell if that part has affected him.  He reports that its hard for him to focus on objects.  I myself feel sedated and my eyes are very heavy.  Its also hard for me to focus too.</p><p>1:00  I was lying down at this point very tired and relaxed.  My friend describes his eyes of feeling like glass, and its getting hard for him to focus on anything.  While lying down it was almost impossible to concentrate on the TV and I kept on day dreaming about my thoughts rather then just thinking about my thoughts.  I dont remember what happened for the next hour though, I remember waking up from not being asleep at about</p><p>+ 3:00 and seeing my friend asleep on the floor.  I just crawled in bed and sleep away for the rest of the night.  O yea and we both had cotton mouth at about 0:45 minutes, sooner then my previous experiment.  When we awoke the next morning J was still having trouble focusing on text and objects, however I was not and my eyes were no longer dilated.  Actually something really worried about me about this particular experiment, my friend J didnt fully recover his ability to focus with his eyes till about 30 hours after ingestion maybe more.</p><p>For this next experiment I plan to use it during the day in an attempt to get its full effects.</p><p>It wasnt a day time experiment as I had hoped for, but was more at like 9:45 pm at a friends house.  This had to be the most fun I have ever had smoking a legal drug.</p><p>9:45-10pm my friend and I smoked maybe 6-8 bowls (water pipe) of the dried foliage.  (Split between us).</p><p>0:15 - I begin to feel floaty and rather relaxed.  Slight sedation as well, all too common with the relaxing sensations.</p><p>0:45  We put on some music, and at this point I am just completely fascinated by the music were listening too and got waaaay too into it.  My friend Phil and I are musicians and begin talking about music, and bands, pretty much anything we can think of that even remotely relates to the music were listening too.  I also note that I feel really comfortable and happy.  I have also already had to urinate.</p><p>1:00  There was one incident sometime near an hour in where my thoughts started to wonder down dark paths and into depressing ideas that frightened my very existence.  I quickly lost interest in what I was thinking about as fast as possible to try and stay positive and enjoy my experience.  I was able to shake away the intense negativity of the situation and float back into the happy head space and enjoy everything around me.  I went to get up and check for dilation in the mirror and too my surprise I couldnt really tell much of a difference, any at home parent wouldnt be able to suspect a thing.  I would like to note at this time that the smoke was not too harsh, and rather smooth compared to tobacco.  We often tasted apple pie for some reason weird. </p><p>I felt very wavy for the rest of the night and would often kind of leave myself staring off at something, listening intently to a nearby sound, or just go off into my own headspace.  I did indeed have a loss of coordination, but not too bad.  This whole experience was really enjoyable and I look forward to doing it again, in smaller, and some larger doses.  I did have to urinate a lot though out the night as well and fell asleep around 1am.  I awoke in the morning feeling refreshed and able to commit to physical activities.  I think I was able to reach a level of delirium to an enjoyable level and not too far blown out of my mind to the point that I have no idea whats going on.  I believe here is where I will end my research, seeing as how I was able to achieve a method of consumption that works well, and safely.  I cannot recall any definite negativity, other then the minor episode of depression that might have ended the night in terror and demise.  Good luck out there, and just remember to be safe.</p>",
 "year": "2007",
 "id": "67855",
 "gender": "Male",
 "age": "16",
 "timestamp": "2013-03-29T07:00:00.000Z",
 "views": "2227",
 "dose": {}
}
