{
 "title": "Violent Vomiting but Interesting Results",
 "author": "Lemon Scented Dirt",
 "citation": " Lemon Scented Dirt. \"Violent Vomiting but Interesting Results: experience with Anadenanthera peregrina (Yopo) (ID 67856)\". Erowid.org. Apr 3, 2008. erowid.org/exp/67856",
 "substance": "Anadenanthera peregrina (Yopo)",
 "bodyweight": "145 lb",
 "report": "<p>I have tried Yopo a number of times, both smoking it and taking it as a snuff. For the most part, these experiences have mostly been ineffective. Aside from extreme burning, snorting the snuff left me feeling very disoriented. At most I would have mild CEVs but nothing truly mind-blowing. Smoking, on the other hand was a little more pleasant. My back and neck became to tingle and I definitely felt its influence, however the visions were hardly apparent, consisting of some wavy textures and some CEVs. </p><p>In retrospect, I chalk these previous failures up to the fact that I did not use lime. At the time I only had baking soda available to me and I really didnt think it would make a whole lot of difference given that so many people have reported dramatic success with it. Well, it certainly did with me. In my last experience with Yopo, I snorted 0.25 grams of the snuff with lime and found it extremely effective.</p><p>The website that sold the seeds to me offered them in powdered form. I figured, what the hell and ordered them thinking they would at least remove the shells before they powdered the material. WRONG. When I received the seeds, to my surprise I saw that they had not removed the husks, but simply crushed the seeds. Oh well, I thought, at the time I didnt think it would make a difference. So I proceeded to make the snuff:</p><p>Firstly, I reground the seeds in my mortar, then I weighed it; the yield was about 1.7 grams. I set that aside and weighed out a portion of lime that was 1/5 the weight of the Yopo. I then mixed them together and with an eyedropper, I added enough water to turn the mixture into a thick paste. After it was thoroughly mixed (no clumps), I let the material dry in my mortar, in close proximity to a fan. After about an hour the mixture was fairly dry and doughy. I then placed the material in a frying pan, turned on medium. Using two razor blades, I preceded to mix the material as it heated to ensure it that it dried evenly.</p><p>After less than 15 minutes, the snuff was powdery enough to work with. Assuming it was done; I let it cool and then poured 0.25 grams of it on a smooth clean surface and divided it into 6 semi-equal lines. I then proceeded to snort it.</p><p>To my surprise it didnt burn as bad as before, but still was pretty unpleasant. With a pretty steady pace, I took the first three lines in my left nostril then did the others on the other side. It was fairly easy to do. When I was done I could feel the sludge moving through my nasal cavity towards the back of my throat. I could practically taste that disgusting roasted peanuts. It was so pungent that I began to gag a little. I could feel the next stage of the trip quickly beginning.</p><p>Without delay I ran to the bathroom and kneeled at my porcelain altar. I dont think I have ever thrown up that violently in my life. My housemate was concerned on account of all the yelling, the heaving and the gagging I did. Apparently between heaves I was screaming, OH GOD, OH GOD!! and slamming my hands upon the altar. When I closed my eyes I saw swirling images and various shades of green and purple. My vomit also took on this hue and perhaps this helped me accept what was happing. My mind was pretty much at ease through all of this, aside from the horrible vomiting, of course. But still, I knew it was all part of the process and I was just waiting for it to end.</p><p>About half through the upchucking (which I think lasted about 15 minutes), my housemate knocked on the door and asked me if I was OK, and in a very calm and collected voice, I told her I was fine, Im OK. In my head I definitely knew that. As the vomiting subsided I became tranquil and whether I passed out or voluntarily fell asleep on the bathroom floor, I couldnt say. I couldnt tell exactly what I experienced then but whatever it was, it was definitely serene.</p><p>I woke up to my housemate slamming the door into the back of my head and asking me if I wanted some water. I told her to leave it where I can find it and Ill be out in a few minutes. Then, as I stared at the ceiling I saw beautiful textural patterns appear. The room had taken on a very warm color and it appeared to be breathing lightly. It was a very blissful experience.</p><p>When I finally came back to myself I walked out to the living room with an odd swagger. I was definitely feeling euphoric and I all I could say for a few minutes was how amazing the experience was even though I could and still cannot explain it fully. Overall, I was pretty out of it and I couldnt really hold a conversation. The visuals lasted for a few minutes longer and then diminished.</p><p>So was it worth it? Im still not sure. As a recreational drug, fuck no! But that wasnt why I tried it in the first place. It was indeed an interesting experience, visually and disgustingly stunning. Ill always remember it. I didnt really gain any insight into my life but then again being pushed to that level of purging could have been insightful in itself. It did have its drawbacks: I became horrible congested for the next week, got a bad cold, for the rest of the night when I blew my nose I blew out brown snot with little pieces of husk in it. In fact, Im wondering if the husk had actually caused me to vomit so fiercely. Indeed if I do, do Yopo again I will make sure to shell them first. Or better yet, Id rather try smoking an extraction from the Yopo, (i.e. Calcium Bufotenate).</p>",
 "year": "2007",
 "id": "67856",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-04-03T07:00:00.000Z",
 "views": "20732",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "250 mg",
   "administration": "insufflated",
   "substance": "Anadenanthera peregrina",
   "form": "(powder / crystals)"
  }
 }
}
