{
 "title": "A Rebirth Experience",
 "author": "Tech House Junky",
 "citation": " Tech House Junky. \"A Rebirth Experience: experience with 2C-E, Ecstasy & Dextroamphetamine (ID 67876)\". Erowid.org. Sep 30, 2008. erowid.org/exp/67876",
 "substance": "2C-E, Ecstasy & Dextroamphetamine",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "oral",
  "Amphetamines",
  "(pill / tablet)",
  "",
  "20 mg",
  "oral",
  "2C-E",
  "(capsule)",
  "",
  "1 ",
  "oral",
  "MDMA",
  "(pill / tablet)",
  "",
  "10 mg",
  "oral",
  "Amphetamines",
  "(pill / tablet)",
  "",
  "10 mg",
  "oral",
  "Amphetamines",
  "(pill / tablet)",
  "",
  "1 ",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>Although experienced with many of the so-called club drugs, I have rarely ventured into the realm of psychedelics. I was quite intrigued, and still am, with 2c-b. However, I was only able to procure a single dose of 2c-e. The 2c-e itself was in a generic 500mg capsule. A collegue of mine had mixed 20mg of 2c-e with about 400mg or so of B-complex vitamins, of which I'm not too fond of, but oh well.</p><p>Start of experience, gorgeous fall day, stressed with work and school, I relish in the idea of a dark room, good music, and close friends. I start with 10mg dextroamphetamine(dex), and head to the a nightclub to meet up with friends, and later to see Sasha spin. I already have the 2c-e but am waiting to take it until about a half hour before Sasha(favorite dj) to spin. The first dose of dex is kicking in, I'm feeling energized, enjoying the opening dj's tracks. Drinks start to go down fast, characteristic of my dex use, I take note and slow down. I procure a couple tablets of 'ectasy' from a friend, save them for later or another time. Decide to take the 2c-e.</p><p>I hate the taste of B-vitamin complex and I can feel it churning in my stomach with the 2c-e. Taking a not so recommended gung-ho approach, I decide to take one tab of ecstasy as I wanted something more familiar in my body as well.</p><p>30-45 minutes: I start to feel the ecstasy, a week dose of MDMA, but it warms my body and complements the dex. I'm not sure if I'm feeling the 2c-e yet. My vision is becoming a bit blurry though, which rarely happens with ecstasy anymore...interesting. I take another dex as well.</p><p>60mins: The 2c-e is starting to hit. I tell my friend that I'm having problems recognizing people, but in a good way, everyone seems familiar, and a lot of them are, but I'm apprehensive about approaching some people as I'm worried its not actually them. This is the only time I really feel somewhat paranoid, it quickly goes away. At the bar ordering a drink, a woman comes up and starts talking what seems to be gibberish to me...I turn to my friends half-jokingly asking if she is real. They were not on 2c-e and they reassured me that they didn't understand what she was saying either, she was foreign...haaa.</p><p>1.5hours: Sasha is spinning, a decent set, the dancefloors are packed, nice friendly Chicago crowd. Now I'm in it for the long run, the 2c-e starts a fast rush toward the peak. My sense of time is completely lost. Of particular interest is my reaction to LED and LCD light. I try looking at my phone, and it is blurry. My eyes aren't as reactive to other types of light, it must be pupil dilation. However, I try to text a friend to see where he is and I find I can't figure out how to use my phone, it was as if I had never seen a mobile phone before. I realized it was the drugs, and it was not like a drunk confusion, I was perplexed!</p><p>This was the start of my REBIRTH.</p><p>I felt like a child again. The familiar lights of the club became different, new. Music had a texture to it...felt much more 'raw' at times, but I really could feel certain frequencies of sound in a way that I had not felt before. It was amazing. I can no longer reference time, and that will be reflected with the lack of anymore time stamps in this report.</p><p>Ecstasy again, on the dance floor. I'm all smiles, enjoying the beats and my friends. We are having a blast. We were talking quite a bit...and interestingly I was able to hear them fairly well, I usually have a hard time hearing conversation during any kind of music, let alone in a club during a dj set. I find myself looking at the lights more, dancing, enjoying.</p><p>I lose my ability to drink alcohol. My stomach isn't hurting, but its telling me not to drink, and I obey(this is where experience comes in and I do not recommend my combination of substances to a novice). The b-complex vitamins are also in full effect, turning my skin quite red, which makes me stand out a bit, but I'm not worried.</p><p>Light visuals are noted. It was not unlike mushrooms, but unique in a way. There was definitely a pulsing in lights that were merely glowing at a steady rate.</p><p>I laugh at everything I find new and funny. Interactions between people in the crowd, things I hear being said, and I was quite good at coming up with puns for some odd reason. There really must be a creative component to the 2c-e trip.</p><p>All in all, it was excellent...a once in awhile thing though.</p>",
 "year": "2007",
 "id": "67876",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-30T07:00:00.000Z",
 "views": "5802",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(capsule)"
  },
  "2": {
   "time": "",
   "amount": "1 ",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": "",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  "4": {
   "time": "",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  "5": {
   "time": "",
   "amount": "1 ",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
