{
 "title": "Sublingually: A Smoother Transition",
 "author": "LucidStudies",
 "citation": " LucidStudies. \"Sublingually: A Smoother Transition: experience with 2C-E (ID 67949)\". Erowid.org. Nov 19, 2009. erowid.org/exp/67949",
 "substance": "2C-E",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "16 mg",
  "sublingual",
  "2C-E",
  "(liquid)"
 ],
 "report": "<p>The purpose of the day today was to test the effectiveness of absorbing 2C-E sublingually: Holding it in the mouth and spitting it out. My first time taking 2C-E, severe nausea was experienced, so much that I considered not following up any further with the substance. I thought, being a difficult psychedelic, 2C-E demanded experimentation with alternate routes of administration.</p><p>At 2:25PM I took about 16 milligrams of 2C-E, dissolved into a small amount of water, into my mouth. After 25 minutes of holding the bitter water under my tongue, I spat it out. I am calling 2:50PM my T-Time. I rinsed my mouth out and brushed my teeth immediately afterwards. I was eager to see how much this compound could do without a pinch of it ever entering my stomach.</p><p>I wont comment too extensively on the details of the trip and the states of mind that were involved. The hallucinations were very similar to those I described in my first experience report, including multi-sensory hallucinations and fleeting moments of synaesthesia. The difference, in a nutshell, is that this time around 2C-E had a much lighter touch on my body.</p><p>At T+0:15 I was coming up nicely on some hallucinogenic effects, feeling at least a +.  Nausea was conspicuously absent as the compound crept through my body and brain. It never really stung me deeply with any serious body load.</p><p>T +0:45: Im noting significant color intensification and some visual movement (lots of swirling patterns emphasizing circular movement). I have some of the feeling of being uncomfortably hot and cold at the same time that I associate with 2C-E, but it is not nearly as pronounced as when the substance is administered orally. I took my temperature and confirmed I have no fever. There is no real sweating, either.</p><p>T +1:00h: Im at a +2, enjoying a light trip with slightly less visual cohesiveness than usual. The experience is less than fully immersing and I can choose to acknowledge it or ignore it.</p><p>T+2:00h: I decide to go to an art museum to enjoy what Dr. Shulgin would most definitely call a museum level trip. I find a room full of stylized paintings of the local landscape of my state. It uses stark contrasts between black silhouettes and neon-colored backgrounds. The more I stare at one position on the canvas, the more everything I see moves. I close my eyes and feel the painting on a deeper level, almost coming off of the canvas and into me. I smile to myself as I commune with the painting.</p><p>T+5:00h: Im on my way back from the museum and starting to come down a little early. If I had swallowed the stuff this would go on for a few more hours. However, it feels like it will probably be over with soon.</p><p>T+7:00h: Mostly back to baseline. Vomiting was not necessary, in fact no nausea occurred at any time whatsoever.</p><p>Conclusions:</p><p>For people like myself who have had problems with nausea, body load, and temperature irregularity when taking 2C-E orally, sublingual application is worthwhile. It reduces nausea and temperature discomfort considerably, allowing a smoother transition into an altered world. There may be a reduction in hallucinogenic effect, so it may be necessary to slightly increase the dosage in order to compensate. I cannot tell yet for certain, but some aspects of the hallucinogenic experience may be connected inseparably to the nausea involved in processing the substance through the stomach. It felt like something was missing from the hallucinations this time through, though much still happened and I cannot exactly find the vocabulary to describe what was absent. It seemed well worth the loss, though, to be free of body load and nausea, free to walk around normally and enjoy my day. I would like to try another experiment with a larger sublingual dose, to see if 2C-E can be pushed beyond recreational territory and further into the entheogenic realm. I think it will be wise to up the dosage gradually, though, as this is definitely a powerful chemical.</p>",
 "year": "2007",
 "id": "67949",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-11-19T08:00:00.000Z",
 "views": "19667",
 "dose": {}
}
