{
 "title": "Wandering Into a Cult Gathering",
 "author": "LucidStudies",
 "citation": " LucidStudies. \"Wandering Into a Cult Gathering: experience with DiPT (ID 67950)\". Erowid.org. Feb 9, 2008. erowid.org/exp/67950",
 "substance": "DiPT",
 "bodyweight": "160 lb",
 "report": "<p>I had decided the day before that it was time for a follow-up with the irregular hallucinogen Di-isopropyl-tryptamine. The dosage the second time would be a bit higher, but the method of administration was changed: I knew from my first experience that DiPT has a nauseating undertone that needs to be controlled, as well as a long duration at higher doses. I elected to sublingually absorb it. The dose was twice as great as last time, but none of it was swallowed. Sublingually applying any chemical can result in subtler effects as well as reduced side-effects, so I was not sure if the experience that lay before me would be more or less intense than my first time with DiPT had been.</p><p>At 2:15PM I took 35 miligrams of DiPT mixed with a small amount of water into my mouth and held it under my tongue for 20 minutes before spitting it out. I could already feel it processing when I spat it. There were no audio hallucinations at that time but feelings of energy moving into my ears and flowing around my head. The first effects were an elevated heartbeat and a general sense of reality changing. These effects were in full swing by T+1h. The audio hallucinations took until T+1.5h to kick in. I heard a few distinctly deepened tones around this time. Yet with the substance sublingually absorbed, there seemed to be less of a tendency for pitch-shifting. The emphasis seemed to be more on desynchronization, or resynchronization, of sounds in relation to each other. Mild tachycardia came and went, along with the fuzzy, dazed feeling I recognized from my first DiPT experience. I was giddy and felt good, but sometimes I lost my train of thought unexpectedly.</p><p>Around two hours in, my ears were dreaming up new surroundings, and I decided to go for a walk outside and see the world. I needed to make a stop at the post office, and was hoping to see some interesting people while I was out. The lightness of DiPTs effects at these doses gives me a voyeuristic sense of control towards the world around me. With everything that I heard, I knew I was different from the people around me. I knew I was part of an altered reality they could not know or understand. Yet I was totally in control of my actions, as well as my emotions; both were unaffected by the compound. When people talked to me, I answered in a completely well-reasoned and inconspicuous way  it was my private secret that the voice I was answering in was not my own voice. I was eager to include unknowing people in my experiment.</p><p>On the way back home, I stumbled upon a large crowd of people, mostly kids and teenagers. Shouting, laughing, talking, walking, and extremely excited about something. At first I thought they were school kids with teachers on a field trip, until I remembered that it was Saturday. The excited crowd congregated around a plaza where some sort of event was taking place. Imagine my surprise when I wandered into the area and saw a sign: Soka Gakkai International. It was a charity event, and the opening of a new community. Suddenly it dawned on me: No wonder everyone here is so blissfully happy to be a part of this event. This is one of the dominions of the intense religious group, Soka Gakkai! How fascinating. A ridiculously well-groomed asian man asked me what I was looking for, and ended up directing me to the plazas bookstore. I ventured deeper into the nest, poking around while trying to remain inconspicuous.</p><p>Swarms of amazingly well-dressed people congregated here, amidst rows of books on Bhuddism and world peace. People twittered at each other in strange dialogues. Mostly all they talked about was who had read more books. One cult member would say, You HAVE to read these seven books here Ive read this one five times and its totally changed my life. Have you read these seven books on the ultimate holiness of the returning lord Buddha yet? Another would reply, Yes of course Ive read those seven books on the returning ultimate holy lord Buddha, but you REALLY need to read these sixteen books over here! Their voices, individually, sounded *almost* normal, but when they spoke together as a group they were an alien intelligence. The greater the volume of sound around me, the more noticeable the DiPT distortions were.</p><p>Among traditional Buddhist scriptures, plans for world peace, and various spiritual guidebooks, the SGI bookstore was also full of tons of books written entirely by the leader of the Soka Gakkai Group, Daisaku Ikeda. The insanely well-groomed aliens surrounding me all insisted these were the best books of all. Unfortunately, it was not long before they spotted me, the outside observer, and ruined my fun by surrounding me and trying to draw me in to their group. Everything broke down when they found out I had not read the sixteen different volumes of Super Buddhist Healing Power Forever, or whatever the latest book series there were communally obsessing over was. I eventually excused myself from a circle of six recruiters (five Asians with clean, sparkling hair and an older white guy with a beard), slipping carefully away and making my way home from exploring a cults domain.</p><p>It is always a strange experience touring a fringe religious group, whether DiPT is involved or not. So much love, so many utopian ideas flowing. And yet I cannot allow myself to accept the offers of friendship that are extended to me in such a place. I know that cult members offer friendship and sincere love one day so they can ask for money and professional commitments a few weeks later and the love will be withdrawn if the money isnt payed. I want to point out I have no prejudice against religious people. I think Christianity, Bhuddism, Hinduism, Judaism and Islam all have worthwhile messages to teach us. But theres a difference to me between a church/temple and a cult, and Ive had bad experiences with the latter. Being in the midst of a fringe religious group while tripping was a fairly intense random detour.</p><p>By T+4 hours I was home again; the effects were still at a solid +2 with no nausea. The sublingual technique was working well once again, as it seems to with most substances. I should note that there was a bit more subtlety to the auditory alterations when the compound was taken this way. Mostly there was just a dreamy, liquid quality to sound as it flowed around me, combined with a stimulated, slightly dazed feeling in my body and head, which was not at all unpleasant.</p><p>The auditory effects were still somewhat notable at T+8h, but after nine hours they seemed to die down completely, leaving me feeling good. I ended the day watching television and taking down notes for this report. After a good nights sleep there were no negative after-effects the next day.</p>",
 "year": "2007",
 "id": "67950",
 "gender": "Male",
 "timestamp": "2008-02-09T08:00:00.000Z",
 "views": "8368",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "35 mg",
   "administration": "sublingual",
   "substance": "DiPT",
   "form": "(powder / crystals)"
  }
 ]
}
