{
 "title": "First Date with La Fe Verte",
 "author": "Nihasa",
 "citation": " Nihasa. \"First Date with La Fe Verte: experience with Absinthe  (ID 67987)\". Erowid.org. Jun 12, 2012. erowid.org/exp/67987",
 "substance": "Absinthe ",
 "bodyweight": "160 lb",
 "report": "<p>  I've been interested in Absinthe for about a year now. I first heard about it from my current girlfriend who introduced me to the topic shortly after we started dating (sept 06.)</p><p>I've been a fan of Marilyn Manson since seventh grade and when I heard he was an Absinthe drinker (along with E.A. Poe, Oscar Wilde, and Vincent van Gogh) and that he was working on his own brand my interest turned into an obsessive hunt. Considering many of my favorite artists were users, I simply HAD to get my hands on a bottle.</p><p>Well months passed and plans to obtain and/or make this mysterious elixer failed, mostly because I was too chicken and poor to simply order a bottle online because of my current legal problems. I didn't want to take a chance getting in more trouble with the law being on probation. And then December 7th rolls around and the American Absinthe prohibition finally ends.</p><p>I went to a local bar/liquor store and purchased a bottle. $60 for a fifth, pretty steep, but worth every penny.</p><p>My girlfriend and I didn't have any actual Absinthe-wear, so we took two strange wine goblets (shaped like whiskey glasses on stems)and a normal slotted spoon and began the louching ritual.When we were done we were left with a milky cloudy liquid, gave a toast to the Green Fairy and sipped away. The effects were instantanious for me (as they have been eveytime I've drunk it afterwards.) Once I swallowed I felt a light wave of relaxation flush my body. The taste was not bad but not good my first time; but now the taste alone has become an irresistable element of the drink. Nothing can compare to the experience of that taste on the lips of the absinthe drinker. I don't even like to drink it straight for the effects, I must preform the ritual; I consider it disrespectful to consume such a divine spirit as if it were a shot of whisky.</p><p>The effects are very lucid. Like a semi-drunken dream. After my second (technically third considering the volume) glass I was deranged, almost mad. I listened to Christopher Walkens riciting of Poe's 'The Raven' (a must-hear) in a tearing trance. I've never experienced such a powerful moment from a poem, I don't think I can ever see it the same.</p><p>Over-all Absinthe is one of the most important spirits in history. I finished my first bottle in about a week, which is outragious considering before Absinthe I often refused to drink alcohol, I pesonally never liked it. I am now a regular Absinthe drinker and it has had quite an impact on my life. I've started drawing again, a past-time that left me when I was 12 years old. My poetry hasn't been nessisarily better, but definitly different. Parts of the day when I'm not drinking Absinthe I often go into dazes, where my vision may be distorted and have evebn experienced some very slight halucinations, for instance, I may be driving and the road will look like it's slowly getting longer or I may see a shadow move in the corner of my eye. Nothing overwhelming. In these dazes I am very melancholy and quiet. I pity everything around me and am slightly pessimistic, but not in a negative way, just seeing things as they realy are and not sugar-coating elements of the world.</p><p>I hope my experience report has helped you in any way. I see Absinthe as a very powerful spirit and would recomend it to anyone seeking artistic inspiration.</p><p>Mercy la Fe Verte.</p>",
 "year": "2007",
 "id": "67987",
 "gender": "Male",
 "timestamp": "2012-06-12T07:00:00.000Z",
 "views": "5698",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ]
}
