{
 "title": "Sgt Pepper Lands on the Dark Side of the Moon",
 "author": "Mr Kite",
 "citation": " Mr Kite. \"Sgt Pepper Lands on the Dark Side of the Moon: experience with LSD & MDMA (ID 68018)\". Erowid.org. Aug 14, 2013. erowid.org/exp/68018",
 "substance": "LSD & MDMA",
 "bodyweight": "",
 "report": [
  "<p>It was a pretty groovy summer evening some time in July or June or something. Might even have been May actually, in fact I'd go as far as to say April. These are minor details, what's important is the substance of this story, not the date. What followed was possibly the purest acid experience of my life. Well, that's not technically true, the purest psychedelic experience. I used Acid, had a bit of a drink and munched on some MDMA, and not ecstasy pills either, some good, really pure crystalline MDMA; all purpley blacky greyish and lovely with some nice big crystals, lovely except of course for the eating of them which caused the most amusing facial expressions and ghastly tastes. But anyhow, onwards and upwards...",
  "I'd visited a friend at the university he attends with the sole intention of getting mashed up together, we both share a love for good music and mind altering substances. We met up with a couple of guys he knew who were like minded chaps and who I subsequently became acquainted with, and they too came on our magic carpet ride, one by one of course. It must've been some time after dinner time, although dinner was neglected in favour of a little bit of MDMA, and not long after 7:30 I popped a tab of some of the nicest acid I'd ever have. Within half an hour we'd all eaten some blotter and began our march to the safe tripping pad through the wilderness of south east England with strict, strict instructions to 'not f*ck it up'. I noticed it not too long after, but at first I wasn't sure if it was the MDMA. A group of non-existent fireflyesque cricket type things hopping across the path we were on and this was the first inkling I had of something more profoundly psychedelic than Europe's favourite party drug was coursing through my nervous system. And the enormity and loudness of a train rushing past, all dark in the night with glaring bright windows staring out at us emphasized the point. We stood transfixed, the noise seemed deafening but I didn't mind, the lights all seemed very bright and blurring into one long streak of pallid yellow light as it roared past, then it was just gone into the night.",
  "It wasn't too long after this that we found ourselves at the house, which looked as though a bomb had hit it. Matey boy who's absent parents owned the place had spent some time emphasising to 'just don't f*ck it up, please'. This caused crippling laughter. The kind that's got tears and the risk of pissed pants, but somehow we barely got it together. It was a hole, but it was a great venue. Finding things this funny on acid is one of the things I have subsequently enjoyed the most in fact. What followed was the world's worst attempt to play Playstation games ever, I was too transfixed by the screens pulsing and colours to really do anything useful, and I was grinning from ear to ear by now and certainly incapable of attempting to play FIFA soccer. I felt really connected with everyone in the room though so didn't mind much, and just so chilled out and relaxed, I felt very magic and decided to sit back and relax for a while and shut my eyes. I wasn't conscious of what was going on but somebody put a Manu Chao CD on and I'd never had music make me feel that way before, it just even more relaxed beyond anything I'd experienced, I couldn't help but move about (albeit in a sprawled mess on a sofa) to it, and the first really heavy visual hallucinations kicked in not long after.",
  "I'll never forget the moment I opened my eyes to see the lampshades pulsing and shifting, and the ceiling around them rippling like the waves on an ocean, and the light was every colour at once somehow, it's hard to explain, and all through the night we were trying to convey these sorts of thoughts and impressions to each other, and every time the discussion ended with 'that'll be the acid.' I'm always able to crack a smile thinking about that. See, acid changes you to an extent, I can remember that first trip clear as day. And Whenever I'm blue 'that'll be the acid' is always there for me. After a while my friend who was considering double dropping came up on it properly too, and agreed with me that it was totally surplus to requirement. We'd have been 'off our nuts' as they say. The four of us lay there monging on the sofa to the Beatles, Pink Floyd, The Stones etc, and the music felt so profound. The visual hallucinations were so strong and vivid, and exploring the house was so ace. I felt compelled to ask the guy who lived there if he knew the shower was missing (he did, obviously) but to me it looked as if it'd that moment been stolen. And that there was a painting painted right onto the wall which I also decided to check if it was real, it shifted in an amazing way, two hands sort of rubbing each other and caressing in an endless colourful waltz. Speaking of walls, that was the first time I've cuddled a wall. It felt as if it was breathing under me, and as if it was there for me. It also felt as if I leaned hard enough it'd fall over, so I didn't, it was a good wall with some very interesting things going on with the pattern on the wall paper. One of the things that persisted after the illusion of 'coming down' set in, because we were nowhere near down.",
  "There was a dark moment however. On the way there I'd got too hot for my coat and decided to carry it, and at some point I was convinced I'd left it somewhere on the way, and was preparing to venture into a strange town with a head full of acid to retrieve my beloved coat. Luckily after I'd put my boots on, along with my missing coat, we all realised it wasn't very missing after all and had a good chuckle. Listening to music and exploring a strange (albeit completely normal) house on acid was really fun, and I felt a great sense of connection with my fellow trippers throughout. And there were moments of calm where thoughts about the inner workings of reality came to me at will. There were moments where we thought we were coming off of it and one of us would realise for all three that 'we're still on acid mate.'. But we walked home around sunrise, which was really, truly beautiful. Colours and sounds were so vivid and strong, everything sounded much closer than it was, and 'normal humans' caused a mix of paranoia and 'haha they have no idea'. Oddly, we'd all come to the concurrences that cats knew. Which is obviously not true, but seemed completely logical at the time, somehow. But the world seemed so peaceful that morning, it usually is, but it seemed ever so profound and important then. Bushes and grass shifting shades of green and blue, the sky tinged with pink at the cloudy bits, and a realisation that we were all so very, very small in the scheme of it all.",
  "It lasted a good long time, and sprawled out on a sofa-bed under a blanket I came slowly, softly down from the trip watching the clouds writhe, pulse and change colour through a patio door while the sofa across from me wobbled around like a belly dancer. I was struck with an enormous sense of well being and a complete sense of Acid being far superior to anything else I'd taken prior to that night. I bonded with a close friend in a way we'll never forget, finally got what 'Dark side of the Moon' *really* meant, and experienced the crescendo in 'A Day in the Life' last for what felt like about five solid minutes. I've tripped plenty since, but that's still a firm favourite.",
  "You should decide for yourself to do it or not, but read up on it, find out what you're getting into and treat it with respect if you do, and I'm sure you'll have a beautiful time.</p>"
 ],
 "year": "2007",
 "id": "68018",
 "gender": "Male",
 "views": "1162",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Alcohol",
   "form": ""
  }
 ],
 "submissionDate": "2013-08-14T07:00:00.000Z"
}
