{
 "id": 6807,
 "title": "End of Week Pick-me-up",
 "date": {
  "submission": "2005-06-27T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Spawnee",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "52 in",
   "administration": "buccal",
   "substance": "Catha edulis",
   "form": "plant material"
  }
 ],
 "report": [
  "I have used various legal and illegal psychoactives before now, however, due to the nature of my work, I felt that I didn't want to risk being prosecuted, and have now decided to use just 'legal highs' - both for recreational purposes, and/or self medication. I live in the UK where Khat is currently unrestricted. I had heard of Khat as far back as the late 1990's, but never seen it. I then came across a garden nursery that specialises in herbs, one of which was Khat. So I ordered a couple of plants from them more out of curiousty than anything else. They arrived as young one year old cuttings. I let them grow a couple of years before trying using them for the stimulant properties.",
  "I was at home on my own, in a fairly tired state (it was Friday evening after a long hard week at work), but I was in a relatively good and happy mood. I had read up on recent information on Khat. I had got the impression that it was going to range anything from a strong coffee right up to similar effects of amphetamine.",
  "I was intending to meet some friends later on at a bar in town, so I wanted a little 'pick me up'. I intentionally didn't have any other stimulant (including coffee, tea, cola, etc.) so that I could get an idea of how stong the stimulant was going to be. Instead I just drank tap water. I put on some funky music to get me a little more upbeat. I went and clipped a few smallish twigs from my plants on the patio and started to chew on them like I would liquorice root. I have to be honest and say that the taste was quite unpleasant, and that it had an astringent affect on my gums. I did think about making it into a drink, however, I persevered, chewing on each leaf and twig for about 10 to 15 minutes until each had become a pulp in my mouth, which I then spat out. I did this over a period of about 1 hour, whilst listening to the music and reading a little. I then decided to get ready to go out, so I was chewing more sporadically.",
  "After 90 minutes had passed since the start of chewing the very first twig, I guess I had chewed about 6 or 7, eight inch (about 20 cm) twigs, and I started to feel the first effects. It had taken a little longer than expected, but I knew from experiences with other psychoactives that it can take a while. I felt like I had a boost of energy, I initially felt my jaw clamping (which I beleive is called trisma), and a mild but dull ache in my limbs, (which I have noticed when I have orally taken amphetamine in the past). I felt a restlessness, that I wanted to get up and go. With that I was spurned on to get ready quicker, and off to my friends which I did by taxi. The effects lasted I would say for an hour or two, and just as they were starting to fade, I started to consume alcohol.",
  "Over all, I enjoyed the effect as it was enough to make me feel more awake, which is what I had set out to do, but not so long that I got frustrated or couldn't sleep. I had no 'come down' affect that is associated with other stimulant use (such as amphetamine). I know that each plants psychoactive strength varies and it depends on my energy levels and mood before/during/after, (self, setting, substance etc) however, I have used it since and I have found each time to be of a similar effect on me. I personally find that doseage to be somewhat like having a few very strong expresso's, but without the palpitations."
 ],
 "erowid": {
  "id": "39714",
  "citation": " Spawnee. \"End of Week Pick-me-up: experience with Khat (ID 39714)\". Erowid.org. Jun 27, 2005. erowid.org/exp/39714",
  "substance": "Khat",
  "views": "37379"
 }
}
