{
 "title": "Another Dimension",
 "author": "KH",
 "citation": " KH. \"Another Dimension: experience with Salvia divinorum (ID 6814)\". Erowid.org. May 1, 2002. erowid.org/exp/6814",
 "substance": "Salvia divinorum",
 "bodyweight": "165 lb",
 "report": "<p>I had read alot about Salvia before I decided to try it.  I had smoked marijuana before and tried DXM a few times.  Neither of these prepared me for the mind altering experience salvia had in store for me.  I had tried salvia before with little more than a strong marijuana like buzz, no visual or auditory distortions.</p><p>The times before I had used a small glass bowl, which in retrospect wasn't the best way to experience the true essence of salvia. I decided to use a large water bong because I heard this was the best way to smoke the plant.  I loaded up the bong with 3 medium sized leaves.  I was in a dark room with only the TV on.  I was watching the tonight show which would come to life later.</p><p>I took one hit and felt the normal slight buzz I had felt before.  I continued to take hits I think 3 in total holding all of them as long as I could.  Next thing I know I am transported into another dimension or world.  The whole room around me seemed to be made out of round objects with a similar texture to rubber.  I swore I wasn't in the room alone, which I was, and that these people were talking to me.  I couldn't make out what they were saying but it freaked me out.  All I could think of was getting to my bed to just lay down.  I looked up at the tv as i was trying to walk to my bed and Jay Leno started talking to me.  It seemed like he was watching over me like a god through the TV.  Whoa, she had me I was seriously tripping like I never had before.  To tell you the truth I was not prepared for the intensity of this experience.  I made it to my bed and laid down.  I tried to let my mind go and see what happened.  Well I started hearing voices whispering to me, yet again I couldn't really make out what they were saying, but it was really assuring, as if they were saying, you will be ok.</p><p>Soon after the trip was over and I was left in utter awe.  I couldn't believe what I had just gone throuh and seen.  This was definately the most profound mind altering experience of my life.  A little scary at times but definately a good trip.  I all I have to say is try to read up on salvia before you try it, so you know what to expect.  Then just let the drug take into another world unimaginable by the conscience mind</p>",
 "year": "2001",
 "id": "6814",
 "gender": "Male",
 "timestamp": "2002-05-01T07:00:00.000Z",
 "views": "5715",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ]
}
