{
 "id": 6816,
 "title": "Barbies with Baggage",
 "date": {
  "submission": "2008-03-31T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "SomeonElse",
  "gender": "Male",
  "weight": "290 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:00",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:00",
   "amount": "10 tablets",
   "administration": "oral",
   "substance": "Barbiturates - Phenobarbital",
   "form": "(pill / tablet)"
  },
  {
   "time": "3:00",
   "amount": "10 tablets",
   "administration": "oral",
   "substance": "Barbiturates - Phenobarbital",
   "form": "(pill / tablet)"
  },
  {
   "time": "3:00",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I experience chronic nausea, and after experimenting with many drugs to control it, I decided to give donnatol a go. I got it from my doctor no problem, he did say it was an old fashioned drug, 'But if it works, well hey.' Each time release pill contains approximately 49 mg phenobarbitol and a belladonna extract of atropine, scopolamine and hyoscamine, each alkaloid totaling less than .7 mg each for each pill. These pills dissolve over a 12 hour period I think. I thought I'd give getting off on the barbituate part a try, thinking the belladonna dose was too small to effect me greatly.",
  "I started off taking 3 crushed up, reading a dose of 150 mg phenobarbitol to be a good bedtime hypnotic dose, not too much, but sedating. The only side effect was a dry mouth, which I assigned to the belladonna. after a few days, I threw caution to the wind and after ingesting a good bit of opiates, 45 mg each of oxycodone and hydrocodone, a decent but not too strong of a dose for me, I ate 10 donnatol whole, figuring I'd get 150 mg phenobarb each 4 hrs. Phenobarb takes at least 2 hours to fully kick in for me, so after three hours I thought I could handle 10 more, knowing 300 mg phenobarb would put me down for the next day, which is what I wanted. I totally ignored the large dose of belladonna this would give me, and time released at that, I reckon a total of at least 3 mg of total alkaloids as I later did the math. Even worse I washed down the last 10 with a beer.",
  "I dont remember much after that, but at some point I woke up in my mom's bathroom holding the cat's food dish, mixing kibble with baby powder and trying to grind it up with my moms contact lens case. I'm not sure how long I was in there, but eventually my mom came in and, despite my protests I hadn't finished grinding it yet, she took it away. This woke me up a little, and I claimed I was sleepwalking which Im sure did little to convince her, but Ive been in drug stupors before so she took it in stride. I went back to bed, the next 36 hours I recall bits and pieces of ambulatory dreams, reaching to grab things that werent there, etc. Fortunately the phenobarb kept me sleeping through most of it, other wise I could of done something worse while unintentional tripping."
 ],
 "erowid": {
  "id": "39749",
  "citation": " SomeonElse. \"Barbies with Baggage: experience with Barbitrurates - Phenobarbital with Hyoscyamine, Scopolamine & Atropine, Opiates (Hydrocodone & Oxycodone) & Alcohol (Beer) (ID 39749)\". Erowid.org. Mar 31, 2008. erowid.org/exp/39749",
  "substance": "Barbitrurates - Phenobarbital with Hyoscyamine, Scopolamine & Atropine, Opiates (Hydrocodone & Oxycodone) & Alcohol (Beer)",
  "views": "29258"
 }
}
