{
 "title": "Salvia-tion Revised",
 "author": "Danos",
 "citation": " Danos. \"Salvia-tion Revised: experience with Salvia divinorum (5x extract) (ID 68187)\". Erowid.org. Sep 4, 2008. erowid.org/exp/68187",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "75 kg",
 "header": [
  "DOSE:",
  "2 bowls",
  "smoked",
  "Salvia divinorum",
  "(extract - 5x)"
 ],
 "report": "<p>I was home alone in my little apartment in London and had just taken delivery that day for some Salvia. I began with a few small cones and had visions of the parts and pieces that made up my living room to be what I thought was people made from the universe. Like my chair and a map of London and my desk made one person and so on. I decided to up the ante, as I wasnt reaching a threshold. I packed one pipe and kept the vial of Salvia open ready to pack again while I held the first toke in. I repacked and took the next hit. This is what happened next.</p><p>I remember thinking I was stuck in what was the inside of some sort of cone shaped reality. The point of the inside of the cone was defined by the index finger of my outstretched left arm. I could feel a thin line running down my left arm like I was laying on the edge of a piece of glass. As I tried to roll off of it my surroundings emerged out of the left side of my body leaving behind 3D expressions of bits and pieces of my body mainly my face. My surroundings were fully intact like normal.</p><p>I kept rolling and rolling trying to escape this cone. It was like reality had merged with this thin line that was attaching itself to the length of my body. As I rolled I could hear my body emerging out of this reality but leaving expressions of itself behind and forming my living room that spewed out into place as I rolled. It reminded me of bricks forming a road as a person walked along the path being formed, like you see in the movies. I began to panic a bit a let out some weird cries for help. I began asking entities that I thought were observing me what had happened. I was asking what I was and who I was and something communicated to me your Daniel Kelly.</p><p>I remember thinking that I was a version of myself in a slice of the past that had become conscious. Like I was trapped in a single moment in time in the past. I thought to myself this is not supposed to be. I was still me in this slice of reality but I thought the real me had kept going on his normal path. I then got really freaked out and began to roll more trying to escape. I could hear my self rolling in this reality, I could hear the expressions of myself being left as I rolled.</p><p>It was then that the entity that I thought was watching me told me to roll back into the expressions of myself that I had left. I began to do this and could feel those expressions remerging with my body. The voice was saying Thats it, thats it. I became excited because instead of trying to roll out of this slice of reality I needed to roll into it. That worked for awhile but I must have got stopped by something in my living room cause I opened my eyes again and saw my body like it was cut down the middle sticking up out of the floor three or four times where I had rolled.</p><p>I began to think that what I had smoked evacuated me from the illusion of reality and I was now in the true reality and stuck. Like I had been awoken from a 28 year long dream to find that this was what the true reality was. Not being able to pull my body off of this thin edge running down the left side of my finger, arm, face and body. The thoughts that went through my head when I was confronted with such a thing are describable so I'll stop there. The entitys that I thought were observing me were confirming that this is what was the truth of reality.</p><p>At this stage I was really worried. I started half crying asking What is this, what am I, whats happened? I thought back to my original conclusion that I was a version of my past self stuck in a been and gone version of reality and had become aware of itself. Just a forgotten memory of a past reality fully aware of its existence but stuck in that moment forever! At this point I was hysterical I remember crying out for help and seeing the three or four expressions of my face that were merged with the floor where I had rolled doing the same thing in exact time with the facial movements I was doing as I was crying out. This continued for awhile.</p><p>At this point something clicked and I looked at my index finger of my outstretched arm which was where this point of reality seemed to be emerging from and bent my arm so as my finger touch my nose. It was all still as I saw it in my drama but I could see where things began and where they ended, so to speak. I found myself on my knees with one arm pointing and touching the ground. I sat up and looked around. There was a tea-towel near a belt on the ground this still had the look of my face as did two pillows on the couch. This is what I had thought were the expressions of myself being left by my rolling inside this cone of reality.</p><p>Upon further awareness of my surroundings I discovered that the place had been trashed. My couch was on its back there were glasses and cups overturned, spilt ashtrays, remote controls everywhere. My TV was pushed out of place. My living room was a mess. The sound that I thought was what I had described earlier as being the path forming in front of someone walking which I described as being this reality emerging out of the left side of my body was actually the sound of me trashing my tiny living room.</p><p>I spent the next 20mins walking around repeating, FUCK, FUCKIN FUCK, FUCK! WHAT THE FUCK WAS THAT I couldnt really comprehend what had happened and to a degree still can't.</p><p>Will I do it again. Probably. But I'll have someone there to make sure I dont trash my place again.</p><p>The most bizarre experience of my life!</p>",
 "year": "2008",
 "id": "68187",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-04T07:00:00.000Z",
 "views": "2322",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
