{
 "title": "6 Hour Ride",
 "author": "LSDChem",
 "citation": " LSDChem. \"6 Hour Ride: experience with H. B. Woodrose & Ephedrine (ID 6818)\". Erowid.org. May 1, 2002. erowid.org/exp/6818",
 "substance": "H. B. Woodrose & Ephedrine",
 "bodyweight": "142 lb",
 "header": [
  "DOSE:",
  "10 seeds",
  "oral",
  "H.B. Woodrose",
  "(ground / crushed)",
  "",
  "12.5 mg",
  "oral",
  "Ephedrine",
  "(pill / tablet)"
 ],
 "report": "<p>I got off work with a terrible headach, and had 10 B. H. seeds And 1 ephedrine pill ready to go.  I timed myself; I ingested the seeds one by one drinking strawberry soda to flush the taste I didn't chew the seeds up I just broke them in my mouth then splashed the soda back and swallowed.  Last after all the seeds I took down the ephedrine.</p><p>I read that woodrose is a quick trip 30 minutes and you peak beganing to fall slowly, not for me.  30 minutes went by nothing but the smallest amount of nausea.  I walked around for about 45 minutes going to a few close stores getting my smokes and drinks, like O.J, but I never needed it.  I went home at about my first hour of ingestion and laid down.  I kind of slept for another hour.  When I woke up I felt like I was drunk, so I decided to go downstairs, and smoke a black & mild. When I got down stairs and began smokeing the fun began I felt like I was so happy, and excited when I listened to the music I got so into it.</p><p>About 15 minutes later The awsome feeling became so intense I had to close my eyes for several minutes.  I have done a lot of drugs out there and I swear this was the greatest experiance I have ever had. I'm comparing this to acid & XTC together, which could not beat this, I have done those together many times because I thought you couldn't get any better, And I was wrong.  I found myself haveing trouble walking, but not in a bad way I felt like I was as High as I could get.</p><p>I had done 1 hit of acid the weekend before and caught visuals, but my mind had trouble conversating, but not on woodrose I could talk for hours with some club homeies. I was in XTC. I reset my clock when I new I was peaking, and the total ride from high to low lasted 6 hours + 2 hour come on I had very few visuals, but I was on this ride for a high, and damn I got it.</p>",
 "year": "2001",
 "id": "6818",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-01T07:00:00.000Z",
 "views": "24083",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": "",
   "amount": "12.5 mg",
   "administration": "oral",
   "substance": "Ephedrine",
   "form": "(pill / tablet)"
  }
 }
}
