{
 "title": "Absurdly Violent",
 "author": "Mad Cyantist",
 "citation": " Mad Cyantist. \"Absurdly Violent: experience with Brugmansia (ID 682)\". Erowid.org. Sep 9, 2000. erowid.org/exp/682",
 "substance": "Brugmansia",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "2 flowers",
   "oral",
   "Brugmansia",
   "(fresh)"
  ]
 ],
 "report": "<p>\nOn a warm night in the summer of'98, in central FL, one decided to experiment with datura/brugmansia. I had been drinking that night, I had about 4 shots of citrus flavored vodka. Across the street from an associates' house there was a datura/brugmansia tree which was about 6 ft tall. The flowers were white at the top and pink at the bottom.</p><p>I decided to eat 2 large flowers. I went back to my friend's house and washed them off to get rid of the bug killer. The flowers were extremely fragrant. With a beer i chewed up the two flowers. For the next hour and a half I enjoyed my alcohol buzz which was substantial since it had been a couple months since i had any octane. Then i remember getting cold sweats, accompanied with minor anxiety.  This only lasted 15 minutes. I then began to experience hallucinations.  People's faces began to take on an evil look to them. The next thing i remember was my mother waking me up at 4 a.m. She was shaking me and asking me if i was alright. She said she was talking to me in the kitchen and my speech was incoherent. Then i grabbed a knife and swung it at her, she ran and locked herself in her room. She said i then proceeded to bang on her door. After 10 minutes she said i went to bed. I dont remember doing any of those things. I only remember her shaking me at 4 a.m.</p><p>I woke up around noon the next day and went back to my friends. I really dont remember leaving their house. They said that around 2 a.m. i started getting really weird, pacing around the room, making no sense. And then they said i just stormed out, not saying bye or anything. The last thing i remember was the people appearing different to me. Thats it.</p>",
 "year": "2000",
 "id": "682",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-09-09T07:00:00.000Z",
 "views": "17376"
}
