{
 "title": "Something is Wrong with Me",
 "author": "Benadryl Burnout",
 "citation": " Benadryl Burnout. \"Something is Wrong with Me: experience with Diphenydramine (ID 68241)\". Erowid.org. Jan 2, 2010. erowid.org/exp/68241",
 "substance": "Diphenydramine",
 "bodyweight": "215 lb",
 "report": "<p>I have been recreationally using diphenydramine for about 3 years. I would take 300-650mg of benadryl 3-5 times a week a few hours before I fell asleep. I have probly benadryl tripped on these doses about 500 times in the past 3 years. I don't know why, but I couldn't stop taking it. The trips are horrible and terrifying, even worse than datura or other atropine containing plants.</p><p>I first started taking it as a sleep aid until I heard from a friend it gives you and lsd like trip (which is entirely untrue) and I have always wanted to try acid. So after already taking it as a sleep aid for maybe 6 months I tried tripping on it, I took 10 25mg pills (totaling to 250mg). I loved it. It was so relaxing and the hallucinations were wonderful. But that only happend the first year or so of my tripping. I think I may have grew extremely mentally dependent on it over about a year. The trips just got worse and worse, but I kept upping my doses with no reason.</p><p>I remember one time when I took 26 25mg benadryls (650mg). I didn't even know where I was. I was literally in another dimension or something. I saw a man in a top hat just rocking back and forth in a rocking chair in my basement, but I remembered I didn't have a rocking chair. The next day when I woke up I was still tripping, I think this was actually the peak. I watched my walls like a tv because of all the patterns and movements on them. I tripped all that day and a little bit into the next day.</p><p>The last time I took it I took 12 pills (300mg), a fairly small dose for me. It was the weirded exp. of benadryl I've ever had. Instead of getting tired like I usually do, I couldn't sleep, I could barely stand sitting. My hole body literally vibrated, I didn't know what went wrong.</p><p>I haven't tripped on it in about 4 days and I NEVER plan to again. I still feel fucked up from it. I get extreme headaches, that low-grade pain-killers barely help, I feel like my body (mainly my head) is constantly shaking, I have very fucked up vision but for some reason only in my left eye, trouble focusing, muscle cramps, muscle spasms, and constant hallucinations that are very similar to those of a benadryl trip.</p><p>I originally thought it may have developed a brain tumor but my doctor assured me that I was too young (I am only 15) to have one. I demanded a catscan or MRI but he said no. I have been doing more research on what could be wrong with me. I think I may have partial brain damage. If not a brain tumor or brain damage, something else is wrong with me. But something definently IS wrong with me.</p>",
 "year": "2007",
 "id": "68241",
 "gender": "Male",
 "age": "15",
 "timestamp": "2010-01-02T08:00:00.000Z",
 "views": "10831",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 }
}
