{
 "title": "Something That Works",
 "author": "TwoHeadedboy",
 "citation": " TwoHeadedboy. \"Something That Works: experience with Gabapentin (ID 68247)\". Erowid.org. Oct 7, 2011. erowid.org/exp/68247",
 "substance": "Gabapentin",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "1800 mg",
   "oral",
   "Pharms - Gabapentin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "68247",
   "Male",
   "",
   "Not Given",
   "Oct 7, 2011",
   "5722",
   " "
  ]
 ],
 "report": "<p>I have generalized anxiety disorder (GAD) and major depression among other possible mental problems. I've been on just about every SSRI and benzo. The SSRI's made me feel none existent and that made me more depressed. Some benzo's like klonopin seemed to have no effect on me and others like xanax just made me act like an ass. </p><p>After getting busted with mary jane I was sent to a psychiatrist who specialized in addiction. He put me on gabapentin. I was hesitant, as he said it was non-addictive (BS). I generally assume if they say it's non-addictive then it really doesn't do anything. I was wrong this time though. Within two hours of taking my first dose of 600mg I was feeling more outspoken, friendly, and willing to accomplish tasks. </p><p>I've been on it for 9 months now and have gone from being jobless and laying in bed all day to working full time and taking night classes. It really has turned my life around. I feel like I can accomplish anything within reason and I don't hesitate when I need to do anything in public like I used to. </p><p>I've also taken my full days dose of 1800mg at once for recreational use. It makes me feel euphoric like ecstasy but without the tension and racing thoughts or shaking. I feel very open with people which never happens and have a general loving attitude.</p><p>The only negative effects seem to involve simple cognitive functions like spelling and remembering names of some people or places. I feel so good for once in my life though that I don't mind. </p><p>There is also I believe some addiction potential. I think about taking it all the time and it's the first thing I do in the morning. However, if I miss a day or forget a dose there really are not any negative reactions other than I seem to be lazy.</p><p>Gabapentin has changed my life and I hope that others with anxiety and other emotional troubles get help with it as well. It really is a miracle drug.</p>"
}
