{
 "title": "To the Stars and Beyond",
 "author": "Potter ",
 "citation": " Potter . \"To the Stars and Beyond: experience with Salvia divinorum (20x extract) (ID 68265)\". Erowid.org. Sep 18, 2011. erowid.org/exp/68265",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "125 lb",
 "report": "<p>This was my second salvia experience. I had recently tried it a few months before. Well the following is not the actual experience, but something I wrote a week after having this intense episode.</p><p>'Lie down and look at the stars above to begin the journey. My mind travels to the velocity of light and I reach the stars in a glimpse. Everything becomes a balanced figure of light and darkness. This is the point where my conscience and subconscious was able to leave everything behind, to forget everything Ive known and will know. Eternal peace begins to flow, I am totally disconnected to the life I had before. I cannot remember anything. I am connected with everything; and know everything is perfect, balanced to create divine harmony.  No troubles, no worries, no pain, no hate, no ignorance, only sensation; sensation of simplicity to create this divine feeling of harmony. Then I realize it, I am dead, because death is the disconnection of the spirit and body. I have no body, only spirit, and I am form part of everything, including other spirit forms that have elevated from our manufactured prison. I am dead, and I am finally at peace. Time does not exist, only feelings of eternal peace.</p><p>Suddenly out of nowhere a glimpse of my last life. I do not want to die yet, even though I could not want to be anywhere else but here. I remember in brief people who I love, things I cherish, and realize I am not prepared to evolve yet. I must go back and return to this infinite harmony when I am ready. But I cannot simply go back; I am another being than I was before. I realize it now; I am my own God at this moment. To go back I must create. But how do I create?  Make a question and the answer is creation, a creation generated by feeling. One answer creates another question and so on. Everything becomes more complex. I go through time starting from the beginning, passing through all events. I then create a guide who tells me, not through words, to calm down, lose panic and just feel! I create respiration, I create my hands, I create my legs , I create my friends, I create the stars, I create the scenery from which I parted, only working from scratch (light and darkness). Finally I returned, but I cannot speak, I must create language to communicate.</p><p>This intense spiritual experience is very hard to grieve, and I am finally free. I understand now, where I came from, were I will go, and how to do it. I just have to wait until Im ready to leave everything behind and elevate. All this happened in minutes, but I elevated to a place where time is irrelevant because it does not exist. Time is an illusion as this world is.  We are all the same and we are all connected. We are here for a reason and it is to enlighten ourselves and escape this prison that is an obstacle we established on ourselves. We must release ourselves to this fiction world and all the lies we believe in it. Then we can all be one again and truly live in eternal peace and harmony. The answer is within us and nowhere else can it be found.' </p><p>This was done laying down on a boat with a very good friend looking at the stars on new years eve. I must say that my trip, illumination, spirtual experience or whatever you want to call it had very much to do with what was going on in my life at the time. I recently had been going through a stage of searching for the 'meaning of life'. Well, salvia, being a powerful entheogenic drug, give me a very traumatic glimpse of it. Be careful with this drug cause it will take you as far or farther then you want to go if you are willing to. But if you are looking for these kind of answers I very well recommend it.</p>",
 "year": "2007",
 "id": "68265",
 "gender": "Male",
 "timestamp": "2011-09-18T07:00:00.000Z",
 "views": "3306",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 }
}
