{
 "id": 683,
 "title": "Lucid",
 "date": {
  "submission": "2006-09-19T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "mistabishi",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 ",
   "administration": "transdermal",
   "substance": "Nicotine",
   "form": "(patch)"
  }
 ],
 "report": [
  "'Dude, you gotta try this' is the usual response to this cheap and easy (and legal) super trip through life, and seemingly beyond.  I was trying to give up 'the tabs' in an effort to clean up my lifestyle - it seemed like a good vice to start with - so I got loads of nicotine gum, nicorette patches and so on. At one stage I had four patches on my left arm. At another I had just stuck two on, and started to feel drowsy. I fell asleep.",
  "REM sleep must have hit, and with it, the slow release of around 40 marlbro's worth of nicotine. A vast cinematic experience followed, like a dream but like I was viewing someone else's dream. But I recognised various landmarks and symbols and faces and soon realised that this was my own subconscious I was walking around in. With some kind of instinct, I took control of this landscape I was in (a sub-conscious rendering of my home town newport) and began to play with it. I started flying because I just wanted to, (it was actually the same sense experience as swimming - but through the air this time!). I also summoned people from my past I had not seen for a long time and was shocked at how accurate their rendering was, since I had thought I had forgotten what these people had looked like.",
  "The only truly awe inspiring moment for me though was when I realised I didn't have to be located in just one dream so I switched the whole backdrop of my mind to the Akihabara district of Tokyo - a place I had been years before. It felt great to be back amongst the rabit-warren of electrical shops again!",
  "I woke myself up that night. A conscious decision to awake and write everything I saw and did, down, on my note pad, which still gets me giggling when I read it."
 ],
 "erowid": {
  "id": "11713",
  "citation": " mistabishi. \"Lucid: experience with Nicotine (Patch) (ID 11713)\". Erowid.org. Sep 19, 2006. erowid.org/exp/11713",
  "substance": "Nicotine (Patch)",
  "views": "12122"
 }
}
