{
 "title": "Ahh The Glory!",
 "author": "ErowidAddict",
 "citation": " ErowidAddict. \"Ahh The Glory!: experience with Morning Glory (ID 6830)\". Erowid.org. May 1, 2002. erowid.org/exp/6830",
 "substance": "Morning Glory",
 "bodyweight": "115 lb",
 "header": [
  "DOSE: T+ 0:00",
  "6.0 g",
  "oral",
  "Morning Glory",
  "(ground / crushed)",
  " T+ 1:00",
  "1 bowl",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>For months I have read about the effects that Heavenly Blue Morning Glory seeds could bring, and after about 6 months I finally experienced the Morning Glory trip.</p><p>It was a Friday night, we had purchased the seeds on Wed. and were planning to camp out and consume the seeds after we got back from a local keg party. Plans changed..</p><p>**Saturday - After everybody left, my friend Ben and I decided that he would come over Saturday night and we could eat the seeds then. We set up my tent, and after getting it all ready it was about 9:00. We said goodbye to my parents and drove our ATV's to the tent, anticipating the seed-eating ritual. We arrived and quickly ran into the tent, grabbing the zip-loc bags filled with our seeds. Our plan was to eat 6g each (we chewed them because I never got to grind them up in my coffee grinder, all I did was wash them off in water) and if we needed more we had another 6g left over from Mario, who had to work. We chewed the seeds well and swallowed them with Juice. This is when the fun starts.</p><p>T+10:00min - We had just finished eating the seeds, (this was very easy, they taste kind of like lettice or plant matter, and are not that hard) and we were very excited. We decided to smoke a really small bowl of some good KB we had left over. I felt kind of light headed.</p><p>T+25:00 - I am definitely feeling something now. Im getting that removed feeling and my limbs feel weird. My friend has grown nauseous so we decide to go sit in the lawn chairs I have placed outside the tent, incase he has to puke. I have no nausea.</p><p>T+35:00 - My friend still feels pretty sick, and my stomach has grown kind of queasy. I stand up and all of a sudden I feel a sort of stinging and tightness when I straighten my leg out, right behind my knee and on the top of my calf. My friend stands up and said 'ouch whats wrong with my leg, its like stinging behind my knee' He had the same thing as I did, and I hadnt even said anything out loud about it. It felt pretty weird. I am shaking now, I dont know if its because its chilly out, but it feels cool.</p><p>T+45:00 - The effects are rising. I was feeling OK and all of a sudden I felt like I was going to puke, so I stood up, walked a few feet, and threw up my dinner. Defiantly not like throwing up on PK's. It was pretty violent. After I puked, we decided to walk back to my house for jackets, tissues, and something else but I forget. Walking back was fun, it was really hitting me now and everything had a plastic look to it.</p><p>T+1:00:00hrs - We return to the tent, 'trippin balls'. I had the greatest idea to smoke another small bowl (we had a very small amount of grass) and after this was done I was REALLY screwed up. We laid in our sleeping bags, looking up at the ceiling of the tent and listening to Moby - Play. Everything looked so different, and my body really felt good. It felt like there were things touching me all over. Our eyes were completely dialated in the dim light, but when there was a bright light they got to a little bigger then regular size.</p><p>T+1:30:00 - Im really trippin now.. My friend seems to not be as screwed up as me, but I figured out why he wasnt, because he wasnt letting the seeds take him like I was.. It sounds weird but last night you could of given me any problem or mystery and I would of solved it in 5 minutes. My mind was racing, I would lay there, not saying much, but in my head I was thinking 1000 miles a second. I took out some paper and a colored pencil and I started drawing.. I am NOT a drawer, I hate it, but I just felt the need to. I drew this really crazy picture of a face, but there were faces in every feature on the face, like one of those black light posters with a million things going on in it but it only looks like theres one picture until you look closer, now I know how they draw those lol, on acid.</p><p>T+2:45:00 - The effects are still peaking, Im curled up like a ball in my sleeping bag.. I dont remember much after this. I shouldnt of laid down like that because I fell asleep, while I was still tripping. No dreams that I can remember..</p><p>Summary: I really loved these seeds. I dont feel burned out right now and its 10:30am. We got up at 8 because my friend had to go, we felt fine. I still see patterns and feel funny, but nothing that people would know about. If you are going to do these seeds I recommend that you have a puke bucket near by, because you probably will puke, I would say that there is a 50% chance you will. 6grams of Heavenly Blues is what I ate, it was not overwhelming, but it wasnt too weak neither. Next time Im going to eat 9grams of Flying Saucers or Pearly Gates to see if they are any different. I defiantly recommend this to anyone, unless you dont like puking. The nausea goes away after like, 40 mins. Just know your limit and be safe.</p>",
 "year": "2001",
 "id": "6830",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-01T07:00:00.000Z",
 "views": "12427",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
