{
 "title": "New Years Ecstacy",
 "author": "KingV",
 "citation": " KingV. \"New Years Ecstacy: experience with MDMA & Cannabis (ID 68307)\". Erowid.org. Aug 1, 2013. erowid.org/exp/68307",
 "substance": "MDMA & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 joints/cigs",
   "smoked",
   "Cannabis",
   "",
   " T+ 2:00",
   "0.5 joints/cigs",
   "smoked",
   "Cannabis",
   "",
   " T+ 2:00",
   "0.25 tablets",
   "smoked",
   "MDMA",
   "(ground / crushed)",
   " T+ 3:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 8:00",
   "0.25 joints/cigs",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "report": "<p>Note: I have only rolled once before and was very eager to try it again. I smoke cannabis about 2-3 times a week, and have experienced mushrooms once. It was maybe about a year ago since my first experience with MDMA. I am really excited with this experience and I appreciate you reading through. Its a decent size experience.</p><p>Mindset: I had many mental struggles in he past with self confidence, the loss of a serious relationship, and my career path in life. I wanted to use the experience in combination with the new year to find myself and start a clean slate. So what better a night than a rave in LA on New Years Eve, right? I know, a clich place to be involved with ecstasy, but I love electronica and DJing so it is my home there.</p><p>It was my friends K, A, S, and I that were going to the event. I had never met S before that night and she showed up with 4 pills for her and A to split (they were more experienced than I) and 1 extra for me. This let a huge burden off my head now that I wouldnt have to find some sketchy person at the event to buy some from.</p><p>8:00pm</p><p>My friend K and I smoke a joint on the way there (about 1 hour drive) listening to Tiesto to get us pumped, the sheer rush of the music knowing we would be in a crowd of 5500+ people made us shake the car to the beat. My head: completely excited. I am usually nervous that something may go wrong before big events, but not this time. My friend talked about a girl he just broke up with and I was really able to help him since I went through the same struggle so I felt very good about this and our connection as best buds before the night began.</p><p>10:00pm</p><p>We just got inside, man it was crowded but in a good way. Everyone there was dressed so exquisitely and so unique. My first thought was that I wanted to find my true personality like them and dress however I want next time. This was a good thought. All of us went up to the main stage bleachers to share a gigantic joint rolled before hand. Little to my knowledge or Ks (who doesnt do ecstacy) the joint had a crushed up ecstacy pill in it! I knew we were going to be in for a lot tonight.</p><p>11:00pm</p><p>Our highs are strong, the music is amazing, our group is still together, the light shows from the mainstage and the ravers were mesmerizing. But time to take our pill; it's getting close to new years. We pop the pills.</p><p>New Years Eve</p><p>Slight euphoria but still placebo effect I think. Everyone was high fiving and giving hugs all around making me feel so comfortable that I was experiencing the night with old friends and new. The music starts up again. I start thinking about wiping my life clean and if things are really different now like I planned... I am kinda sad because I still have the same thoughts. But I keep my mind open and really just feeeel my life around me.</p><p>12:30</p><p>FORGET WHAT I WAS JUST THINKING!!! The ecstasy kicks in and it comes in hard. There is a light blue haze about everything, I can pick out individual people to focus on and get lost in their own dance, or mesh everyone together as one big dance party. I felt like I was dancing with all of my best friends. I had photons with me and I just started creating my own dance circle with lights. Other glowstickers joined along and I felt like I started this light dance to the gods of electronica and our electro crops won't grow if I dont keep the lights moving (haha).</p><p>1:30</p><p>My friend A has never done a light show before and we both just started dancing with our lights. Before we know it he had 3 people sitting on the ground in front of him with their mouths open chanting for more. I gave him a huge pat on the back. My limbs felt very loose at this point. Like silly putty, I said. I just wanted to throw my arms and legs in a all directions because they could move and I was making them do it! A girl dancing in front of me said it was her first time rolling, I gave a here a big hug and she started to get flirtatious but she was young so I just danced with her but she made me smile a lot considering my self-consciousness with the opposite sex.</p><p>2:30</p><p>Rolling comes in waves, it took like a 45 min break then came back real hard again at this point. We have gone to each dance area and decided to save the end of the night in the drum and bass for a joint, but that wasnt till 4am.</p><p>K is a pretty self conscious guy too, but at this point he bought this crazy shirt that bounced frequency levels to the music. Hard to explain but I have never seen him receive so many compliments in one night. I was so happy for him and I was happy that I was happy for him. I feel happy when others around me are happy. I told him to pound my back to the beat of the music with his fists...I can't explain how incredible this feeling was! The bass was passing through his arms and shooting into my body pumping me full of rhythm and life! He repeated to do so spontaneously through the night.</p><p>4:00</p><p>We smoke our last joint as we planned in the drum and bass room to diesel boy djing in the arena. Simply amazing. I was getting rushes as we walked between the different music styles, my mind just adapts so quickly to the situation and the vibe by the crowd it was, well, blowing my mind! I had intense thoughts of wanting to learn who I am, to be closer the friends I was there with, to forget everything in the past and re-write my life how I want it. Dancing was endless, plenty of water was essential as to not dehydrate.</p><p>Then it was over...</p><p>No sleep that night but the blanket I was in felt like I was hugging a panda bear made of cottonballs. My roll came back the next day when I was at work, not scary though, I told one of my close co-workers and she laughed through my shift and it made it so amazing that I performed so happily in front of so many people considering I work at a hotel.</p><p>Conclusion</p><p>Today I still have some confusing thoughts about my life, but being around my parents, work, and going back to school is what brought a lot of the memories back, however I do everyday sit and think about who I am, who I want to be, and how my experience with ecstasy helps put something in front of me, I just have to look through the closed door to know that the universal joy and oneness I experienced on xtc is already there. Ecstasy opens my eyes, but soon I will train myself to believe and experience ecstasy for the rest of my life.</p>",
 "year": "2008",
 "id": "68307",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2013-08-01T07:00:00.000Z",
 "views": "752",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "0.5 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
