{
 "id": 6834,
 "title": "The Final Night",
 "date": {
  "submission": "2008-03-31T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Semloh",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "This actually happened in both 2004 and 2005, as it took place New Year's Eve night. I have been a long time drinker, coke sniffer, and pot smoker for only being 16. I've been doing coke since elementary school, and alcohol and pot since middle school, and I'm now currently almost finished with my Junior year.",
  "I went up to Tampa with my mom dad and little brother who is 14 to see my older brother who is 20 at his apartment where he goes to college (USF). He lives with his girlfriend, and me and my little brother were staying several nights there while my parents got a hotel so that they could spend time together and we could party. We got a couple cases of St. Pauli girl since all three of us brothers love German beer and drank with my mom into the ball falling down in New York. My dad is a recovering alcoholic so he doesn't drink obviously.",
  "After we drank into the night my mom and dad went to their hotel and I went into my older brothers sorda game room/guest room with my little brother and had him lock the door. His girlfriend has no problem with us smoking Marijuana in the room, but I didn't even wanna ask her about coke so I decided to just not bring it up. My plan was to quit coke for the new years, and in doing such, go out with a bang. I only had a little bit of powder left, but when I emptied it out, it became much more than it seemed in the bag. I had over 20 lines, which is plenty for myself to have some fun. After 3-4 lines I got the body buzz I usually expect, and hit a few more lines and got the emotion buzz I always look for when sniffing coke.",
  "100x worse than even when drunk, I become unreasonably more talkative and I want to right my wrongs, take back horrible thing's Ive done to people, and just everything positive, the kinda feeling like I could love or forgive anybody. By now the alcohol was completely drained of my system, at least enough that I wasn't distorted and any other body type buzz was completely drained out from rail after rail of expensive pure powder. My little brother kept telling me that if I ODed hed probably kill himself cause I mean so much to him and I kept reassuring him that I know my body and I wont overdo the lines.",
  "Spacing the rest of the lines over an hour to make him feel better, we finally went outside into the living room to talk to my older brother and his girlfriend. I made sure I had no coke residue and although I know the difference between a coked up eye and a stoned eye, I think she just assumed I was stoned because she never once mentioned powder. Being extremely friendly and generous with kindness to her we talked while my drunk older brother was calling one of his college friends and we all stood around him. We were supposed to be playing cards but it was delayed for several minutes standing their talking, just because anything in the world is enjoyable on coke.",
  "I guess the higher I get the faster it wears off, because after those short 5-10 minutes of talking to her (although alot of the effects happened in the room which makes sense) I almost instantly became violently depressed, unhappy and ashamed. I felt as though I was tainted by the devil, and I was dirty and didn't deserve to talk to the people around me. Being a long time coke user, I knew coming down happens and it's never fun once I get 4-5 lines into me, but I had never felt this horrible coming off a drug in all my life, which surprises me because Ive done more coke than I did that night.",
  "I felt so bad, I knew I was hurting alot of my friends and relatives when they knew I did powder, and I was so ashamed that I did all those lines just earlier. We sat down and I tried to play it off, but I didn't even have the willpower to shuffle the cards and told my little brother I didn't feel like dealing. I felt as though Satan were holding my hand, not in a trippy way, in a metaphorical way, and it was at that point I decided I was never gonna sniff coke again. I did end up quitting for good now, I did slip a few times early this month though. I smoked a black and mild cigarillo to help calm the come down. I smoke any tobacco like a cigarette, pipe tobacco, cigars, I dont care. My lungs are really unhealthy.",
  "It took many, many bowls to even get the sharpness of the come down out of my mind. Even late into 4:20 AM where we continued to smoke, I still felt the bad feelings left behind from cocaine, and it took many hours of sleep to finally get rid of it. My older brother was glad that I quit, and told me to 'Stick to weed, man'. I hope I can continue to do what I am doing, because for all the evil and regret and depression coke causes, it will always tempt me with it's initial positive effects."
 ],
 "erowid": {
  "id": "39851",
  "citation": " Semloh. \"The Final Night: experience with Cocaine, Alcohol & Cannabis (ID 39851)\". Erowid.org. Mar 31, 2008. erowid.org/exp/39851",
  "substance": "Cocaine, Alcohol & Cannabis",
  "views": "9521"
 }
}
