{
 "title": "Taking Over",
 "author": "dilated_pupils",
 "citation": " dilated_pupils. \"Taking Over: experience with Cocaine (ID 68357)\". Erowid.org. Feb 5, 2008. erowid.org/exp/68357",
 "substance": "Cocaine",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Well I was all worried about trying to stop using coke, and now I don't think I'm going to be able to use it, since I had the worst experience ever, last night.</p><p>The night started off in the afternoon actually.</p><p>5:30pm - A few of my close friends and I are starting early, take a couple lines and just play poker.</p><p>more lines here and there nothing spectacular</p><p>10:30pm - Everyone now has bought their own coke, around like 1-2 grams a person (not too much, but a decent amount for the night). We continue taking lines, one of my friends decides he wants to smoke some crack, so my friend whips some up for him (I didn't really like this but whatever). By now we've also smoked at least a good 6-8 bowls of marijuana as well (usually I can't feel the pot high until I start to comedown off the coke, and I didn't come down from the coke until much later).</p><p>11:30pm - Still taking lines, at this point I feel like I'm higher then I will ever be, honestly my eyes are dilated the size they would be if I was rolling, and I feel like I'm rolling as well.</p><p>12:00pm - Started to feel myself coming down just a bit, so I take another line to get back to that incrediable place I just was (I ended up doing this all night even after I ran out of coke, I'd get some off someone else\n</p><p>The rest of the night I spent geaking out. I mean fiending for coke like I would literally kill for some. Every time I would come down just a tad, I would do anything to get more coke. At one point I went down to our table we take our lines off of, and scrapped the table until I got like a dot of coke and I just snorted it to give me some relief (rediculous eh?).</p><p>2am - My dealer (who chills with us) leaves to go get more coke. I walk from the basement to the upstairs, to the garage, etc all over the house geaking out fiending wanting more. My dealer geaked out bad all night he kept getting on the floor and 'searching' as he would say. I'm telling you, he did this 'searching' for coke on the floor a good 4 hours last night, maybe more. I've never seen anyone like that.</p><p>3am - My dealer arrives back, with a gram for us and a bag for him. I got a line out of each bag and at this point I feel no emotions, but I feel like I am going to die (which I had felt like for the past couple hours fiending for the coke).</p><p>I spend the rest of the night geaking out hardcore, wishing I would die, feeling like my heart was going to explode, my chest hurting, my nose KILLING me, my muscles tense, finding it hard to breath and sometimes forgetting to breath and having to catch myself not doing it, my jaw clenching, my migraine strong as all hell, and the worst of it all, realization that I am totally fucking up my life and it HAS to change.</p><p>I laid in bed for a good hour or two feeling like I was going to die, praying to God that this is not the way I should go, and that I will try my hardest to stop doing this to myself.</p><p>Eventually I just go down the basement for some privacy and fall asleep there. I didn't wake up until like 3:30pm the next day (since I probably didn't get to sleep until 6:30am? and I took some melatonin to help me pass out).</p><p>I hope all of this made sense, and maybe some people can get something out of this, and not put their self in this situation.</p>",
 "year": "2006",
 "id": "68357",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-02-05T08:00:00.000Z",
 "views": "16606"
}
