{
 "title": "Possessed Rampage",
 "author": "TJ",
 "citation": " TJ. \"Possessed Rampage: experience with Mushrooms (ID 6839)\". Erowid.org. May 14, 2002. erowid.org/exp/6839",
 "substance": "Mushrooms",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "0.125 g",
   "",
   "Mushrooms"
  ]
 ],
 "report": "<p>It was the Friday before Mother's Day when I and six of my closest friends each ate 1/8 gram of mushrooms. This was the first time for only one of my friends; luckily he had a great experience just like everyone else, that is until Ray tripped out.  It was a friend's birthday and everyone was back from school since it was the begining of summer.  Everyone was having a good time, just laughing and passing weed like candy, appreciating the good vibe from all of our friends who had reunited for the summer, except for Ray who refused to leave the couch which was secluded upstairs away from the rest of the party.  Everyone would check on him, but since it wasn't his first time eating mushrooms, we figured he would be okay. </p><p>Then he started sweating and his skin was mad clammy and shit.  His eyes looked all bugged out and he looked like he was looking straight through me when I talked to him.  After about three hours of tripping pretty lovely, shit started going bad.  Ray said he was scared and he insisted that I not leave him.  He began babbling an incomprehensible gibberish as he finally got up from the couch to sit next to me on the foot rest.  He was a little bit too close for comfort as he put his arm around me, holding me like I was his bitch or something.  All he could say was, don't leave me.  But I was tripping hard at that point and I didn't want to waste my high in the grips of Ray's arms so I left.  I went into E's room where some folks were smoking more weed.  After I smoked, I went downstairs to have a cigarette in the patio in the backyard.  We chonged some more chiba on the patio and we were eating frozen berries and shit. </p><p>That was when I saw Ray in the living room.  Before stripping completely nude he said, 'this is a reality check!'  I couldn't believe what I was seeing and I assumed that I was seeing things until he ran outside and began unleashing some serious blows to N's face and body.  I jumped out of the window into the backyard.  Ray followed and he went immediately to the pool where he walked in just deep enough to hide the view of his piece.  B walked toward Ray who was coming out of the pool and Ray said, 'look at my cock.'  Then he began to hit B intensely.  We wouldn't have been so scared to fight him had he not been naked and also a 6-foot-1-inch, 180-pound Taikwondo Black Belt. </p><p>Everyone who was still left at the party began running like hunted animals.  I wasn't sure if Ray had a weapon at this point so I decided to just run away from him.  About five of some of my bigger friends were in the house trying to keep Ray under control, who was still hitting everyone in sight.  Finally J fuckin socked Ray who was running at him full speed until he fell to the ground feeling the pain of J's fist.  They immediately restrained him by holding his arms and legs that were kicking furiously.  This is when he started to speak as if he were possessed.  He would repeat the same phrases in random order.  He was saying shit like: 'This is perfection, I am Jesus, I am the center of the universe, I'm gay, Come lie with me, Daddy Mommy lie with me, black people, fingertips, Cock!!!' and he would scream at the top of his lungs between saying these horrid things.  He was spitting on everyone who was holding him down. </p><p>Eventually we decided to send two people down the street to get D's father who is a doctor.  He immediately came to try to calm the chaos by taming this beast who I couldn't believe was the same person that I have known since kindergarden.  He duct-taped his feet together to stop him from kicking anyone.  Then we waited for the paramedics to come.  We were still tipping as we held Ray down.  He wouldn't stop saying all that fuckin psycho shit and he wouldn't stop spitting, which was almost as distubing as seeing him nude.  Two hours passed from the time that Ray was nude until the authorities came.  We were trapped in the house with that violent demon for two hours, which seemed like an enternity in mushroom time!  Finally they took the beast to the hospital.  That was only two days ago.  It's Mother's Day and I feel so bad for all of our moms for having to put up with this kind of bullshit.  Nobody has talked to Ray yet.  But tommorow many people who were there will see him again at school. The story is not over yet; we have yet to see how this experience will affect Ray.</p>",
 "year": "2001",
 "id": "6839",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-14T07:00:00.000Z",
 "views": "23576",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.125 g",
   "administration": "",
   "substance": "Mushrooms"
  }
 ]
}
