{
 "id": 6840,
 "title": "Speaking in Tounges",
 "date": {
  "submission": "2005-01-28T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sunyata",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "DMT"
  }
 ],
 "report": [
  "Newyear s eve I found myself holding a pipe filled with an unknown amount of Dimethyltryptamine, my guide had measured it out, and assured me it was more than enough for the full effects. I was at a party in his house with a lot of close friends and strangers, 6-7 of us had retired to his bedroom, some to smoke cocaine, me and two others to smoke DMT. Ever since reading The Archaic Revival by Terence McKenna Id been interested in Ayahuascha and DMT, and had experienced Ayahuascha three times, two blissful experiences and one terrifying, and was somewhat apprehensive, but excited about smoking the synthetic compound. I had eaten some Ecstasy earlier and felt at ease with my friends, not fearing that my subconscious surfacing would be a problem, and that I could feel free to go with the experience, no matter what direction it took, without anyone ridiculing me for it afterwards.",
  "Be sure to hold the smoke in as long as possible. Are you ready? My guide ignites the lighter and holds it right above the DMT, which is resting on cigarette ashes, so as not to run into the pipe when melting. Im nervous and breathing too fast, but as soon as the smoke hits my lungs something strange happens, I feel no need for air and am able to inhale until I taste only ashes. The pipe is taken from me and my friend tells me to lie down with my eyes closed. My body feels strange, synthetic, lungs feel like they are made of some kind of plastic with the same consistency as aluminium foil. I have no time to reflect on this, because, suddenly, Im in front of a giant swirling disc, with coloured moving patterns, the chrysanthemum that McKenna talked about, and Im pushed into it. It feels almost too intense and I got the impression that I was definitely heading down the rabbit hole this time, am I dying? I have little time to contemplate this, cause fluid starts coming out of every part of my body, feet, arms, head, ass and heart are all pouring out some liquid substance which is somehow me, I can no longer feel my body. I have the impression of lying in a hospital bed, with doctors watching over me, monitoring my condition, discussing excitedly. Then my consciousness slips, which bothers me today, because something extraordinary must have happened while I was unconscious.",
  "I am first aware of an energy rising up from the base of my spine, hearing some noise that remind me of applause and cheering, open my eyes and see the room I left bathed in semi-liquid diamonds and emeralds. The energy rising through my spine becomes a sound made deep in the stomach and travelling up to my throat where it comes out of my mouth, but also out of my forehead in the form and shape of  lightning, slowly moving towards and, finally, into my guides head, who instantly starts laughing uncontrollably, sending the lightning back into my head. Its like an orgasm within the pineal gland, and I feel free, I am at one with my experience and suddenly know myself, although I cant describe what that self is, it simply is, no words will ever stick to it. Both voice and experience fades, but I do not try to hold on to them, I realize I am going to be inside a human body once again and feel no regret about it, somehow its the right thing to do.",
  "I embrace my guide, and thank him from the depths of my soul for providing such an opportunity to discover that which I had been seeking all my life, however fleeting it was I know it will stay with me forever. I feel such peace upon returning to the surroundings I left just five minutes ago, no more of the depression that normally weighs my shoulders, or the anxiety that tightens my chest, no thoughts to make me doubt myself or others, just a serene knowledge that everything is all right, and that the breadth of experience in the universe parallels infinity.",
  "The rest of the party I spend quietly pondering the meaning of it all without expecting an answer. I talk to my Guide about the lightning going from my head to his, he said it felt like I was explaining the joke of existence to him, and that it was as if he became deeply entranced by the sound of my voice, as if I managed to bring him into a state similar to mine at the time. My voice had been like that of a little baby, even though it sounded completely alien to me at the time, I really wish I had a recording of that session. What this implies is almost too good to be true, that you can share your experience of something without using symbols of speech or gestures, but by uttering a sound that brings the experience directly into anothers mind. Because I was not trying to utter any words, the sound seemed to contain meaning within itself. Everyone in the room was staring at me in amazement when the voice had faded, it was clear that no one had remained indifferent to it, even those who were coming down from coke raised an eyebrow.",
  "For several days after the experience I felt utterly tranquil and satisfied with everything that took place both within me and on my outside, everything inspired me in some way. Since then I have of course more or less returned to my normal personality, but I cant seem to take my depressions that seriously any longer, I have some conviction that all the ups and downs in my life are there to teach me something, and that theres more to reality than what appears on this level of consciousness. To call my experience a crime and expect threats of violence or loss of freedom to scare me from seeking it, is nave. I would rather be burned at the stake than deny that what happened to me was real, not just a psychosis or delerium."
 ],
 "erowid": {
  "id": "39857",
  "citation": " Sunyata. \"Speaking in Tounges: experience with DMT (ID 39857)\". Erowid.org. Jan 28, 2005. erowid.org/exp/39857",
  "substance": "DMT",
  "views": "28006"
 }
}
