{
 "id": 6842,
 "title": "Bipolar Reaction",
 "date": {
  "submission": "2006-06-16T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bengt",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I just wanted to note my hindsight of my experiences with ecstasy since I've been diagnosed as Bipolar.",
  "To start, I've recently been diagnosed as Bipolar II, which is characterized by hypomania rather than full blown mania. Hypomania is like a weak state of mania. I'll feel one of two ways: euphoric, content, energized, and like everything is generally going positively; or, extremely irritable, cocky, and aggressive. Sometimes I feel both of those mixed. I cycle between states of depression, hypomania, and indifference. A full manic episode would be those symptoms to the extreme in an uncontrollable whirlwind that can quickly turn very bad. I've had only one fully manic episode (after taking MDMA), but normally only experience hypomania. Nevertheless, I'm at risk and my symptoms could potentially (and probably eventually will) progress into full blown manic episodes.",
  "I've been like this for a while, but being the stubborn person I am, I refused to seek help whenever suggested (usually when I'd be depressed) and it went undiagnosed. Throughout high school I experimented with various drugs, and my first MDMA experience was in my senior year, at the age of 17 (I'm now 19). I'm not saying that MDMA caused my disorder, but it did have an effect.",
  "I've only taken MDMA twice. Both times I commented on how the experience was pretty uneventful although the next day I felt like a million bucks, ready for the world. I wrote both experiences within the following week, and am clearly elated and euphoric at the fact that I feel so ridiculously positive... in one experience claiming that I feel so good I'll never take another drug again because I'm on some kind of natural high. Looking back, I realize that I was experiencing what I now know is hypomania and was writing my experience reports in the midst of being manic.",
  "It's actually very humorous to me to read them because in the reports I'm ridiculously positive and optimistic, and I can see myself during those states on the verge of tears because I'm so happy. Anyways, after the first experience I went into a fully manic episode (coupled with the fact that I had just graduated high school) where I went absolutely nuts all over town, resulting in cloudy memories of alcohol, sex, and vandalism. The second experience was more of the same, and one can again tell by my writing that I am clearly in some sort of altered frame of mind.",
  "Needless to say, following these periods of unbelievable ecstasy I plummet to the exact opposite of the scale into horrible depression. Ecstasy is the only drug I've experienced that triggers manic episodes after taking it. If I smoke marijuana, it throws me into depression, coke makes me feel relatively normal, but nothing else has ever done what ecstasy does to me. Before and since then I've had plenty of ups and downs that looking back I see was just the effects of my disorder, but the only time I've ever gone manic was after taking ecstasy. I don't blame anyone or anything, but now that I know I have a mental disorder I defiantly won't be touching ecstasy again."
 ],
 "erowid": {
  "id": "39866",
  "citation": " Bengt. \"Bipolar Reaction: experience with MDMA (Ecstasy) (ID 39866)\". Erowid.org. Jun 16, 2006. erowid.org/exp/39866",
  "substance": "MDMA (Ecstasy)",
  "views": "11248"
 }
}
