{
 "id": 6843,
 "title": "What in God's Name",
 "date": {
  "submission": "2005-08-10T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "imaginefication",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "7.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Dioscorea spp.",
   "form": "extract"
  }
 ],
 "report": [
  "Background: I've been searching for a natural sleep aid other than drinking and smoking weed. I'm not on any prescriptions and I would rather find an herbal sleep aid than take a prescription.",
  "One of the herbs I ordered was, Dioscorea dregeana, or Wild Yam. The website said that it was a powerful sedative and would result in sleep with just 1/10 of an ounce. It was very cheap so I ordered an ounce along with some other herbs. The part of the plant I got was the root which is rock hard so to grind it I had to wrap it up in tinfoil and cloth then bang the heck out of it with a hammer until it was powder. Then I soaked this in a water bottle full of 80 proof alcohol for 3 days. I strained it, leaving an amber colored liquid. I measured out 1/4 of the liquid because I really doubted 1/10 (a few tablespoons) would do anything. I mixed it with oj and it went down very easy, I could hardly taste it. Oh yeah this stuff smells like lasagna or something but it stings my mouth (way more than just alcohol) if I try to drink it straight. I hadn't done any other drug besides alcohol or weed that day or several weeks before.",
  "Within 15 minutes I started to feel kind of weird almost nauseated, comparable to the beginning of a trip. I instantly started to think I'd taken more than a dose but I wasn't worried because I believed I'd just fall asleep soon and avoid any negative effects. 15 minutes later I had to lay down, not because I was sleepy but because my muscles no longer worked right, at this point I was pretty concerned that I may have poisoned myself with this crap and I made myself throw up, although I wasn't really nauseated at all anymore. When I stood up I felt like I was weighed down by 100 bricks and my legs felt like jello. I fell down my stairs when I went to get a drink. I crawled back upstairs with my drink and tried to set my drink down. I had so little control of my muscles that instead of putting my drink down I just threw it on the ground. Next time I got a drink I just drank it right away instead of trying to take it upstairs. Despite how messed up my body was I had absolutely no mental effects besides dizziness and messed up vision. I wasn't even a little sleepy. I was perfectly sober except my body no longer worked and my legs were twitching which was really uncomfortable.",
  "Thank God this stuff wore off in just a few hours and I actually felt pretty normal when it did. The only real after effect was, ironically, I was unable to sleep at all that night and felt almost stimulated, until finally at 6:00am I chugged half a fifth of alcohol which allowed me to finally drift off. I dumped out the rest of this crap and I now call it the evil wibbly wobblies, although I'm sure at low doses it has medicinal benefits, it is the worse recreational drug I've ever found.",
  "Conclusion: What the hell is this shit? I really want to hear more about this stuff from other people but I have searched everywhere on the web and I haven't found a single report on it. I have found many medical uses but absolutely no report of someone taking a large enough dose to have the effect it had on me. Also because I have read from other websites a medical dose is one ounce I think some Wild Yam is bunk. The stuff I got, the website said that was equal to 10-15 doses and 1 ounce was 10 dollars. If the site doesn't say that then it might be the fake stuff. I did not like the experience and I could not have ran 10 feet let alone drive a car. Oh yeah and for my insomnia I found that real kava from a good source prepared correctly is a great sleep aid, especially with a few beers."
 ],
 "erowid": {
  "id": "39870",
  "citation": " imaginefication. \"What in God's Name: experience with Dioscorea dregeana (Wild Yam) (ID 39870)\". Erowid.org. Aug 10, 2005. erowid.org/exp/39870",
  "substance": "Dioscorea dregeana (Wild Yam)",
  "views": "11076"
 }
}
