{
 "title": "Not as Cool as I Had Hoped",
 "author": "Lechium",
 "citation": " Lechium. \"Not as Cool as I Had Hoped: experience with Propylhexedrine (Benzedrex) (ID 68452)\". Erowid.org. Jan 1, 2009. erowid.org/exp/68452",
 "substance": "Propylhexedrine (Benzedrex)",
 "bodyweight": "140 lb",
 "report": "<p>After reading the experiences online I decided to give Benzedrex a shot. I was feeling very unmotivated and bored and hoped that the stimulating effects would wake me up and get me moving a bit more. I'm a bit nervous trying it, having read some bad experiences others had. And although I had read that it's best to take only half the cotton the first time I do it, I decided to take the whole thing because I didn't want to be disappointed.</p><p>5:00pm - Just swallowed the 250mg cotton. I cut it up into like 10 pieces and parachuted about 3/4 pieces at a time in order to not really taste it. My parachutes were really half assed so I still tasted it a little bit but it wasn't too bad just have to swallow as fast as possible.</p><p>5:05pm - Realizing that I took a stimulant and probably wont have an appetite later, I decided to down a tuna sandwich before the stimulant effects kick in.</p><p>5:08pm - While eating sandwich, I noticed my hands are slightly jittery.</p><p>5:30pm - Just noticed the my heart is racing. So fast in fact that I'm afraid it may blow. A little scary but I'm going to put on some music and try to get my mind off it.</p><p>5:40pm - Finally turned on music and having a fun time listening to it. Still no profound effects and heart's still racing. I do feel like I have more energy but a little achy, probably because it's first day off heroin. Heart seems to have calmed down a little though, finally doesn't feel as though it's going to burst out of chest.</p><p>5:46pm - I'm typing really really fast, making more typos than normal but I'm also typing at like twice my normal speed. Ahh...don't know how my fingers can handle.</p><p>6:10pm - My head tingles and I'm just waiting for something more to happen. I am sweating a little and starting to feel a bit hot. I hope this isn't all that it's going to do because so far I'm a little disappointed. I have read that it may take up to an hour and a half to really start feeling it so I hope in 20 minutes I'll be in a better state.</p><p>6:16pm - Head is still tingling. Noticing slight change in my vision, my concentration is increasing.</p><p>6:24pm - Still feeling very hot, had to take sweater off and now I'm shirtless. Still nothing that noticeable yet. Gonna do a little room cleaning while listening to music.</p><p>6:30pm - I just put a hand to my heart and it is beating a lot slower than it was a while back. I feel pretty content but not much different. Still hoping I havn't peaked yet but something tells me I have, maybe I'm just so used to doing downers than I'm not used to stimulant effects or maybe the 8mg suboxone I took earlier today is interfering a little. Anyway I'm still getting these waves of tingly pulses in my head. Also, finally feel a little more motivated and willing to move around instead of laying around all bored and achy like I have been all day before I took the propylhexedrine. Don't really have any negative effects.</p><p>6:38pm - Decided to smoke a cigarette (a Camel No. 9 Menthol) and for some reason I didn't taste the menthol of the cigarette at all, it really tasted a bit funky so I think my sense of taste has been affected. The stoge definately increased the effects a little bit, especially since it's the first one of the day, but I didn't really get a nicotine rush like I usually do after smoking first one of the day. I definately feel a lot better than I have all day, slightly euphoric and definately stimulated like hitting a line of really mellow cocaine.</p><p>7:15pm - Effects seem to be wearing off a little, I'm still feeling hot and actually it's more of a hot flash feeling that I have with slight chills, probably from heroin withdrawals. I been reading forum posts for a long time and got pretty into the reading. I think I'm going to try doing something different now like play a video game or something.</p><p>7:45pm - The stimulating effects have basically diminished. I'm pretty bored just sitting on the pc and I think this is where I'll end my report.</p><p>So all in all I am definately glad I took the whole cotton rod. I was a bit nervous as I had been warned that this may be too much and to take only half of it my first time. The effects were fairly mild and I definately did get a bit more motivated, stimulated, and had very slight euphoria. I never really reached the peak that I had hoped for. I guess for an OTC drug it is pretty cool, especially since it can be found at a drugstore for about 5 dollars. I'm willing to try it again and next time might take more than one cotton rod -- I'll probably try taking one and a half. Also as I mentioned during my experience, I had taken 8mg of suboxone earlier in the day which may have kept me from achieving the desired effects. Also, I thought I should add that I fell asleep fine that night around 2:30am (I typically don't fall asleep till around 1:30-2ish in the morning) so that was pretty normal.</p>",
 "year": "2008",
 "id": "68452",
 "gender": "Male",
 "timestamp": "2009-01-01T08:00:00.000Z",
 "views": "23862",
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Pharms - Propylhexedrine"
  }
 ]
}
