{
 "id": 6847,
 "title": "A Handful of Beauty",
 "date": {
  "submission": "2008-03-10T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Electric Jesus",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "16 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "The following is a report of my second experience with 5-Meo-DMT.",
  "My friends and I just finished a jam session.  We decided that now would be a good time to experience 5-Meo-DMT.  My intention of this experience was to see if I could go deeper into a vision that I had a few nights ago. ",
  "I put what was believed to be around 16mg of this substance into a glass pipe, on top of the dead leaves of a plant.  I knew that this was a quick-burning chemical, so I tried to find the thinest, driest leaves possible.  Music playing was Radiohead, Kid A.  I exchanged advice with my sitters, received godspeed wishes, and I enhaled the entire content of the bowl as I sat comfortably on a rug.",
  "Within seconds, a was launched into my most powerful, mystical state of being in my Life.  I immediately felt extreme vibrations and pressure in my face.  My sitters became increasingly unrecognizable.  zzzzzzzap TERROR.  What I am feeling is the most mentally and spiritual pain imaginable. ",
  "Extreme waves of unbearable energy.  Reality/Sanity will never come back.  I lie on the floor entranced repeating in a soft voice:: Please Kill Me :: This is Terror :: I want to DIE::  The music is taking me for a ride.  I am just a cosmic baby lying in front of violently waving strings of colours and dimensions.  I escape time.  This is never ending; Spiritual Death cannot even end my suffering.  A sea of Morphine would not phase me.  I focus on my sitters; they are the only thing left I have to hold on to.  Their voices are distorted, high-pitched --if only they would kill me.  I grab onto myself and pull Me back from the storm.",
  "Ascending to the blissful state of normality.  I am back.  For the next half hour I narrate to my friends what just happened.  This was strange for me, as I was talking directly from my subconscious.  I am in a state of awe and wonder.  My foundations of thought on Reality have been sucked into the Maelstrom.  Physically, I cannot yet stand up.  I can still feel my hands rubbing each other minutes after they are separated.  I ask how long I was gone, 'Three Minutes' they say.",
  "Days later, I still experience a feeling of the 'coming up' process, like I am about to be pulled back at any second.  My dreams have been a wealth of vision.  Almost every night since the trip, I have experienced identical vibrations/waves in my dreams.  (My visions are of) Passing through the Gates of Two and Three dimensional reality, and witnessing the two paths my Life may take, on each side sits a woman separated by a stream.",
  "As far as my initial goal, I failed.  But what happened that night has changed my universe for the better.  It gave me a taste of death, yet a much bigger bite on Life."
 ],
 "erowid": {
  "id": "39879",
  "citation": " Electric Jesus. \"A Handful of Beauty: experience with 5-MeO-DMT (ID 39879)\". Erowid.org. Mar 10, 2008. erowid.org/exp/39879",
  "substance": "5-MeO-DMT",
  "views": "2353"
 }
}
