{
 "title": "Medicine for the Week After",
 "author": "Ajax",
 "citation": " Ajax. \"Medicine for the Week After: experience with MDMA (Ecstasy) & Acetaminophen with Diphenhydramine (ID 68565)\". Erowid.org. Jan 2, 2010. erowid.org/exp/68565",
 "substance": "MDMA (Ecstasy) & Acetaminophen with Diphenhydramine",
 "bodyweight": "187 lb",
 "header": [
  "DOSE:",
  " repeated",
  "",
  "MDMA",
  "",
  "",
  " repeated",
  "oral",
  "Acetaminophen",
  "(pill / tablet)",
  "",
  " repeated",
  "oral",
  "Diphenhydramine",
  "(pill / tablet)"
 ],
 "report": "<p>Hello everyone,</p><p>I am 16 and an avid Ecstasy user. I have ingested Ecstasy four times, each with results beyond definition. Everything is pure bliss... until the aftereffects took course. Each time after ingesting Ecstasy, I would notice severe nausea and a rush type feeling. These symptoms would range from hours to days after initial dosage. Mix these two feelings together and I simply felt out of place, and extremely spaced out for at least a week. I realized that I needed to find a way to combat these feelings if I wanted to continue to take Ecstasy.</p><p>One day in my kitchen, browsing the medicine shelf for possible solutions, I saw a bottle of a legal painkiller which contained 500 mg Acetaminophen/12.5 mg Diphenhydramine per pill. Not really thinking, I took two pills out of the bottle and popped them both, not thinking much of it. 20 minutes laterBAM! I remember a feeling of clarity, and I noticed that the severe nausea and spaceyness had vanished and I felt, well, normal. Completely normal, actually the sanest Ive felt in months. I could focus and perform my role in society (school) without the least bit of nausea and never once felt out of place. After the Acetaminophen with Diphenhydramine would where off, the aftereffects of Ecstasy would return, but it definitely was not as overwhelming as before. At first I believed that this was all in my head, but after I took a second dosage (1 pill) I returned right back to feeling completely normal. It takes that painful, dizzy, emotional feeling and literally makes it vanish! For 4-5 hours! Very useful, and now I will not use Ecstasy unless I have Acetaminophen with Diphenhydramine.</p><p>To me this was an amazing discovery, and now I know how to combat the negative effects of MDMA.</p>",
 "year": "2008",
 "id": "68565",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-02T08:00:00.000Z",
 "views": "19263",
 "dose": {}
}
