{
 "title": "Seeing the Fabric of the 'Other Side'",
 "author": "Domino K",
 "citation": " Domino K. \"Seeing the Fabric of the 'Other Side': experience with Salvia divinorum (ID 68584)\". Erowid.org. Jan 27, 2012. erowid.org/exp/68584",
 "substance": "Salvia divinorum",
 "bodyweight": "165 lb",
 "report": "<p>I have been very fascinated by the reports of salvia. I have smoked marijuana on and off for more than 30 years, and in the past I have experimented with most other hallucinogens. I have had some great 'learning' experiences from good LSD trips and I have had a few bad trips, from low or non-quality drugs and bad mushrooms. I have been no longer interested in anything other than marijuana, I find it energizing, creative and beneficially introspective. It helps with my ADD and depression. The only problem is its legal status. Sad, how a simple common plant is treated.</p><p>A bit on me - I'm in my late 40's and I'm a professor.</p><p>I bought some 10X and some 20X standardized salvia from a well respected site. Frankly, at first I did not expect much. I have sought a legal alternative for marijuana and this seemed to be something worth trying based on all the reports I have read, as well as scientific evidence (especially a paper on it's beneficial effects on depression) so I figured I would see. Indeed I did. Truthfully, I was blown away.</p><p>I followed the repeated recommendations to carefully choose a setting and reduce external distractions. This is wise advice. I can't imagine someone trying this while driving or doing anything else. Here in my comfortable living room, on a rainy afternoon, with just some ambient music playing in the background I gave it a try. I placed a pinch of the 10X, perhaps a medium to large sized hit, in the brass bowl of a bamboo bong, no water. I made myself comfortable and lit it up with a butane lighter. it burned quickly to white ash. What followed was amazing.</p><p>Within about 20 seconds, the oriental carpet in front of me split. Half went up, half went down. In the next few seconds, Everything swirled to the right and the next minutes dissolved into a totally convincing vision, difficult to describe but as vivid as reality.</p><p>I was in an M.C. Escher-like city, multiple archways made of repeated red, white and green colors. The city was dynamically forming in front of me. I was on the edge of a canal, looking across at someone, though I cannot say I knew who it was. The archways were dynamic, literally forming in front on me, folding and repeating. There was a blue sky beyond this arched city, and though it was strange and new, it was beautiful.</p><p>I suddenly realized that the archways were formed from a fabric of humanity, that's the only way I can describe it. Each set of arched 'blocks' was another person. I told myself, 'this is the other side', and I was convinced that this was the structure from what the reality I had known was built from. The arches folded and I realized that I too was going to be subsumed into one of the arches as the dynamic construction approached all around me. I felt as though this was it, this was real and I accepted that I would become part of the fabric of these circular repeated forms. I was willing to give up all that I knew with only a bit of remorse, but it was so beautiful and different that I easily accepted it. It was more real, and seemed to be the truth 'behind' our everyday banal world.</p><p>The patters of rain on my window were the textures on the arches, it is so hard to describe, but this vision was so real, maybe more real than any LSD venture I have ever had. I was sure that I would be 'folded' into the architecture I envisioned, never to return to the life I had known. It was as if I had found the other side of what we know, it was that convincing. There was a bit of fear, but as I said, I was able to accept it.</p><p>But then I came back to myself, I stared down at my hands on my lap, my pipe had fallen to the side. My vision was still a bit swirly. On the TV across the room, there was a graphic with circles in it and I was sure that the TV was still showing me the circular arches I had seen so clearly. I realized that the colors of the arched city were the same as the couch and pillows I was sitting on. It all seemed to come together.</p><p>As I came out of this brief trip, all I could say was 'holy shit', 'unbelievable', 'wow...'</p><p>I was sweating a little bit, it felt like a circular sweat (hard to describe) was moving around my face. Soon I felt a bit chilled.</p><p>The effect was maybe a hundred times more intense than anything I expected; so vivid, and so completely enveloping of my visual and aural senses. And it was only one hit! I anticipated having to smoke a bunch, but afterwards I looked at the remaining gram of 10X and realized what a powerful and valuable herb this was. I can not yet even imagine what a big hit of the 20X will be like.</p><p>A little later in the day, I tried another very, very small pinch of the 10X, perhaps one-quarter of what I had smoked earlier. I clearly felt and saw the 'swirl', everything twisting to the right, but I was clearly able to maintain my conscious mind and experience the effect in a somewhat objective manner. Within a few minutes, all was clear again.</p><p>It is amazing how salvia affects my senses - - I can see why others say it will question your sense of reality. Everything seemed to twist and melt, vividly, right in front of my eyes.</p><p>Brief advice: be comfortable, be happy and have no distractions. Do not leave your space or try to interact with anything you know. Just stay in your mind and take your time. Salvia grants a true experience. It is not for anyone looking for a social drug or mood enhancer. It is not an everyday smoke like reefer. It is definitely for special occasions when you have time and space in the right setting. If you buy salvia, value it. But don't screw up, because I can easily see why it could be outlawed.</p><p>Thank you herbalists! Good luck!</p>",
 "year": "2008",
 "id": "68584",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-01-27T08:00:00.000Z",
 "views": "2540",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
