{
 "id": 6865,
 "title": "Sinoid",
 "date": {
  "submission": "2007-08-13T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "ZombieNamedBub",
  "gender": "Male",
  "weight": "185 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ],
 "report": [
  "As of late there have been some mushrooms/acid in town, and as three of my friends were going to be tripping, I decided to trip as well. I always thought I'd plan my first or any trip way in advance, but I was feeling happy overall with some deep questions I wanted to probe.",
  "I ate little in preparation, a bagel for breakfast and a small sandwich for lunch with no caffeine throughout the day. Then at 6:30 (I ate at 12 so my stomach was empty) I thoroughly chewed a cut of good shrooms, most had small caps, many with veils still connected, no bruises, along with a glass of water and a little bit of honey. We smoked a bowl and about 15 minutes later I started feeling really, really, different.",
  "I looked down at a tie dye style bouncy ball I had in my hand and saw the colors twist and there appeared to be a flame behind them. It was fascinating, but at the same time I began to get worried. A friend came over and said my pupils were very dialated, and proceeded to tell me he wished he had tripped on a full cut his first time. I asked him for some advice, and he said it feels almost like dieing and to keep in mind people had done this for thousands of years and it is safe. I distinctly remember the shadows on the walls dancing around like flames.",
  "Everyone who wasn't tripping left, leaving me, H (who was on two hits of acid), S (who was on a cut of shrooms), and C (who was also on a cut of shrooms). I was the only one who hadn't tripped before. We snuffed out the candle lighting the room and turned on some music. As I laid back on the ground I realized I had injested a good dose of a powerful psychadellic. I began to worry about what I had done and the fact that no matter what I was in for a trip. I said in a sort of scared tone that I realized I was about to trip hard.",
  "I began to get uneasy with my pockets filled with junk. Each piece felt like a chunk of every day concerns and worries that I stake way too much claim in. I began to pull it all out and pitch it in a pile, finally taking off my watch, which dominates my life all too often. I laid back, still sort of uncomfortable with what was going on, and listened to the music. It felt like the distortion being used was grating on me. I heard chanting and drumming in the distance and once again felt tense as I realized it was getting tough to distinguish between having my eyes open or closed. I grabbed my watch, and after struggling to look at it, noticed it was only about 6:50.",
  "I decided to make the best of things. I realized I was going to trip, it was likely to get more powerful, and that it was absolutely true that people had done it for years and I would be safe. I smiled and noticed fractals in front of me like a tunnel up through the ceiling. I felt like waves were washing in through the door and sediment was layering around me. In the music (distorted, trippy, guitar) I heard a line spoken sort of sternly: 'This is not just a dream', and I thought it was the greatest joke of all times. I laughed/sighed and realized that the room was filled with a viscous pattern that I could feel on me, suddenly it disappeared.",
  "I put my hand on my forehead and began to project myself into the fractals that I saw, I could only feel my hand on my forhead, only hear the music, and only see the crazy patterns my mind was producing. I looked at the wall and suddenly saw it wash with lavender and orange colors. I told C, who is a veteran tripper, how a felt and we began to discuss what sort of word would best desvribe how I was feeling. He eventually said perhaps sinoid, and I repeated the word after him. I remember the word had a ring to it that seemed to make the walls ripple every time I intoned it.",
  "The lights were turned on eventually and the whole room jumped with vibrant, breathing, colors. I unwrapped and red hankerchief I had packed with four oranges and proceeded to hand them out and take one myself. For the longest time I just stared at mine, it appeared almost like a large berry with small seed fiber jutting through the skin at the pores. I heard a crackle as S peeled his orange and a distinct snap as he bit into a section of it. I peeled mine partially, and took many brief whiffs of it. Each smell seemed to resonate entirely through me. I eventually peeled the entire thing, marveled at its appearance, then ate a small piece. The taste was amazingly sweet, but I encountered some difficulty as I had a loose fitting bridge in my teeth. It cut me slightly and it angered me that we should feel so obligated to build up our appearances.",
  "S and H decided to go for a walk, but we were in an apartment in the city and I really could not handle all the man made structures I would encounter. In addition, I had a leg injury that was mostly healed, but I didn't want to push it in my current state. Also, it was bitter cold outside, and I was thinking about human mortality and how in many ways we are fragile creatures. It seemed so abstract to me that we had ever chosen to migrate into such environments that we'd need to alter so drastically just to survive in.",
  "C and I stayed behind and discussed tons of issues, namely the way we handle relationships with others, our families, and why society can frown so heavily on such a seemingly important experience. Words seemed to meld with gibberish at times and I remember wondering if I was speaking english. Many times we could pick up on each others thoughts seemingly just through the atmosphere that was present. I saw in my mind and image of advanced primates, perhaps the first people, on a beach just basking in the sun and totally experiencing the moment. I felt akin to them and to all of life, all of which seemed to be just existing and wanting to exist in this world, except for humans. Life seemed to be almost a song within the entire insane and perhaps irrelevant universe. I wanted to laugh and cry at the same time.",
  "S and H returned and told us how their walk was. I immediately remember the mood becoming much lighter as H began strumming on a ukelele and we all began joking with one another. A lot of laughter was shared about how spoked language seems so lacking (How cold is it outside? Cold, or really fucking cold?). We also joked about Easter Island for a while and how more than one civilization has been caught up in its own existence over what actually matters (Ted enters a room: 'Hell, I think I'm going to just build a giant head right about here'). I considered that when you are on mushrooms, you know how others who are on mushrooms have felt. I thought about the report of someone seeing an Aztec warrior vomiting. He looked up from his purge, saw the visitor passing by from today's era, and just nodded. I felt as though I could absolutely relate with such an experience.",
  "Everyone mingled and entered different rooms. We reminisced a lot about things we experienced together years ago, and the memories seemed very vivid. I was able to remember things I haven't thought of in a long time. I went through some moments of eternity and felt very connected with my own past. We began to listen to many genres of music including African singing, psychadellic rock, and even stuff such as Rob Zombie.",
  "We were all coming down a bit. I stood in a doorway with my hand on the grained wood it was composed of. It shifted, expanded to about 6 inches, and began flowing upwards. I smiled, and this was about the last visual I had, approximately at 10:30. By 12:00 I was almost baseline and went for a walk to get something to eat. By 3 in the morning I was totally down, though tired, and went home to get a very good sleep.",
  "Overall, the experience could have gone entirely downhill. I realize now that had I fought what was coming on as I was when I feared it, I would have been forced very painfully into the mindset. That being said, I gained a refreshing outlook on life as well as a new found respect for psychadellics."
 ],
 "erowid": {
  "id": "39990",
  "citation": " ZombieNamedBub. \"Sinoid: experience with Mushrooms (P. Cubensis) (ID 39990)\". Erowid.org. Aug 13, 2007. erowid.org/exp/39990",
  "substance": "Mushrooms (P. Cubensis)",
  "views": "3269"
 }
}
