{
 "title": "Boom",
 "author": "Sauceman",
 "citation": " Sauceman. \"Boom: experience with PCP & Cannabis (ID 68668)\". Erowid.org. Dec 6, 2008. erowid.org/exp/68668",
 "substance": "PCP & Cannabis",
 "bodyweight": "150 lb",
 "report": "<p>PCP is, perhaps, one of the most troubling drugs to place into one specific taxonomy. As such, its effects are equally hard to describe, and are most often blurry, at best.</p><p>Such is true for myself. Last Summer, around July sometime, me and two of my friends (referred to as friend A and B) bought weed from a friend of ours at an accidental meeting at a gas station. Upon inspecting the herb, we thought we had been ripped off; the buds were pale green with a tinge of light brown and smelled NOTHING like the incredibly distinct smell of weed. From what I remember, it smelled like some kind of cross between nail polish and old copper. Nonetheless, we packed the bowl and sparked up soon after. About 10 minutes went by.</p><p>Whoa.</p><p>Laughing became an uncontrollable reflex not assigned to any specific action. There was no humor; no joke or punchline. For what felt like 2 hours, we were lying around laughing uncontrollably, and the second grasp of PCP began to take hold. I stopped laughing, grew incredibly lethargic, and laid down with my eyes closed.</p><p>Boom. Thousands, if not millions, of seemingly random images were flying through my head at lightning fast speed, though I could only record a certain amount in my memory. I distinctly remember feeling as though I was on a carousel to which I possessed the controls; whichever direction I felt like revolving, I went. For some reason, there were colors assigned to the endless rotation; shades of blue became the only descriptor for spinning clockwise, green for counter-clockwise. After this period, the experience becomes a fuzz, unto which I know certain events happened, but have no idea where to place them in time.</p><p>Near the end of the experience, things grow ever more interesting. As I lay flat on my back, eyes still closed, my body explodes outwards into every direction. I no longer possess a substance for which I can translate the surrounding universe. I knew I was alive, but had no feeling of my body for quite some time. As I stepped out of that phase, (I opened my eyes, simply enough) the sense of reality drew closer, yet still distant. The only sense of touch in my entire body was in hands, lips, and throat. As I looked around, confusion arose. For some reason, friend A was sitting in Buddha position half naked, playing on Xbox Live. I'm still not certain if this actually happened or not, none of the three of us present remembered a great deal. As the experience drew to a close, I somehow arrived upon the floor.</p><p>The next morning, and several days after, a small sense of depression and fatigue was definitely present. I could not grasp a single subject for long, and my attention span was lacking. I slept much more than usual as well.</p><p>It was probably about three days before we all actually discussed what had happened. Friend A didn't describe much, though he remembered something blurry about water or the sensation of water. Friend B, however, most likely had more in his system than either of us. He told me that ghosts were talking to him, and he kept yelling for me and friend A, but neither of us even noticed. His explanation for the next part is in his exact words: 'My bed opened up and I fell into hell.' I was certain at that point that the weed definitely had some kind of unnatural addition. PCP seemed to fit the puzzle more precise than any other drug. It was later confirmed by the dealer, as well.</p><p>The only reason I included my friends' stories is because I don't want to encourage a reader to look upon my experience with assumption that a mystical plateau will be achieved; I happened to be lucky and not be stricken with the least bit of fear or terror. However, my friend wasn't quite so lucky.</p>",
 "year": "2007",
 "id": "68668",
 "gender": "Male",
 "timestamp": "2008-12-06T08:00:00.000Z",
 "views": "16843",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "PCP"
  }
 ]
}
