{
 "title": "The Beach and the Men in Black",
 "author": "Jackrabbit",
 "citation": " Jackrabbit. \"The Beach and the Men in Black: experience with LSD (ID 68713)\". Erowid.org. Dec 25, 2012. erowid.org/exp/68713",
 "substance": "LSD",
 "bodyweight": "200 lb",
 "report": "<p>The background: My friend, whom I'll call Cedric, and I have been friends since elementary school (although we didnt go to the same high school). Just being the nature of his high school friends, he got exposed to drug culture much earlier than I did. The immediate friends I had were mostly devout Christians, which I didnt mind at all despite my being an Atheist since Jr. high.</p><p>So, as I would learn much later, Cedric was somewhat of a stoner his junior and senior year. Schools out, toke up kind of behavior. Having been DARE-brainwashed throughout my life by education, I still had my doubts about trying cannabis. Eventually, though, I got around to it after my junior year and thought it was alright. First times with pot are usually let-downs, or so Im told. My second and third experiences were incredible, somewhat like very mild trips, but Ill not get into that. Anyway, after moderate use, pot petered off into a mild sedated high  though music has a habit of enhancing the feelings of well-being.</p><p>And as I would learn later still, Cedric had tried so many drugs during the summer after graduating high school, he had a hard time remembering them all. From what I can recall: marijuana, LSD, mushrooms, opium, ethanol, nicotine (addicted), salvia, robo, absinthe, MDMA, amphetamines, morning glory, etc. I never felt pressured into trying anything, but I could tell he was always excited when I agreed to try something new.</p><p>We went to the same university (still do), and roomed together in the same dorm for our first semester. We had a third roommate (who is still rooming with Cedric), who Ill call Jason. Jason was part of the ROTC and was pretty strict about never trying any drugs. Both I and Cedric associate ethanol (alcohol) with any other drug, but he, along with most of society, refuses to acknowledge the similarities. We never talked intensively about it, and he was fine about us smoking in the bathroom every now and then (we had hospital-grade air sanitizer for good measure).</p><p>Cedric got an IM from his good friend from another university that hed gotten hold of some LSD, and was willing to sell it to us for the price he bought it. We added in the price of gas money (though I do feel like we shortchanged him a bit), and set off to meet him in a parking lot about a week later. The exchange was quick; I pulled up beside him and his friend in a truck and left the engine running. Cedric got out, had a short conversation, and came back in the car with a folded-up paper towel in his pocket.</p><p>We had originally arranged to wait until Friday when we had no classes and no obligations, but as is the case with many people, could not wait it out. We decided it was important enough that we should skip classes and just do it the next day.</p><p>The experience:</p><p>Cedric likes to sleep in, and I dont. This was a problem, because when I woke up at 7 am I was already mentally prepared and anxious for my first acid trip. I walked around a little bit, ate some food, checked my internet forums. By the time 8 oclock rolled around Cedric finally got up out of bed and I was eying the piece of paper towel on the counter signaling I was ready to go. It took another hour (for what reason I cant remember) for us to open the paper towel. Inside were two little squares of paper, maybe  inch by  inch. I was very surprised at the prospect of such a tiny thing containing a decent amount of LSD. And I wonder to this day if the paper towel had absorbed any, which would have made it a crappy mode of transport.</p><p>[9:00] We placed the tabs on our tongues. Cedric got two, and I got one. Almost immediately, I breathed in too hard and sucked the tab off of my tongue. I could feel it stuck to the roof of my mouth just in front of my uvula, which wasnt too exciting. I eventually scraped it back down and resumed absorbing it through my tongue, though salivation was a minor problem. I highly recommend not being hungry while ingesting acid.</p><p>[9:45] Cedric was feeling minor affects and I was not. I wasnt too worried about it, though a little disappointed. At this point I began to wonder if maybe I was expecting too much from just one hit. He said he was a little put off by how slow the affects were appearing, so at this point we chewed up the papers for several minutes, then swallowed.</p><p>[10:00] The trip came on very slowly, but I was definitely feeling it. It was one of being somewhat separated from normal reality, and a very slight sense of happiness for no reason. Things were definitely brighter in the room, and held more character. Computer screens and electronic things were fairly boring, and everything physical felt naturally grounded.</p><p>We put on The Gorillaz B-Sides, and both decided the majority of the album was very good for tripping. For a good while we just sat around, walked around, and did whatever while listening to the music. Cedric turned on the PS3 since he decided he wanted to play a demo called Toy Home, a very childish driving game. He quickly became bored with it and favored instead watching the patterns on the floor. Jason commented that we were both very interesting to watch.</p><p>I wasnt getting much of any visuals except for increased brightness in everything, but I didnt really care. I was just happy to be alive and listening to music. However the windows called to me. I announced to Cedric that it was completely necessary we go walk around outside. Nah, theres plenty to do inside. Plus, there are people out there. The word people did actually sound menacing to my plan. Go take a shower, he said.</p><p>I did so without question, and Im glad I did. Its actually very hard to explain how it feels, but Ill do my best. Wherever the water hits and runs down, it tingles and my brain responds with loads of serotonin (happy neurotransmitter) for no good reason. The CEVs are intensified at least 3x in the shower; I saw a kaleidoscope of colors, random words, people, and everything in-between.</p><p>[11:00] Cedric was wary of the idea of leaving, which was understandable being that he was at the peak of his twice-as-strong trip. But I eventually persuaded him. I couldnt help it. The sunshine from the windows gleamed and nature called.</p><p>Walking down the hallway toward the elevator of our dorm building, I became aware of my distorted depth perception. It wasnt quite as bad as 1 g of P. cubensis, but it was definitely there. Again, the light from the glass doors down the hall was an amazing sight and I wanted to see more of it.</p><p>Holy shit its bright, I believe were my words when we stepped out the door. We walked around a bit in a tree-shaded area of dirt and rocks next to the parking lot. Our campus is a nature preserve, so the naturalness of our surroundings was incredibly pleasing to the eyes. At one point, I even stopped and bent down just to feel the ground.</p><p>What? Cedric said</p><p>Just had to feel it, make sure it was really there, I said. I meant it literally, but without much forethought. I began to then contemplate the idea philosophically, the idea of the ground being under our feet. I didnt expand on it much but it was an interesting perspective.</p><p>Oh, right.</p><p>Great texture, I sounded like an idiot, but I didnt mind. I could have definitely come up with something more intelligent to say, but I didnt feel it was necessary.</p><p>[11:30] We decided on watching my Led Zeppelin live concerts DVD, which was another great idea. The colors of the lights on stage, Robert Plants belting vocals, and Jimmy Paiges wailing guitar were all pretty astounding. We skipped around songs, and when it came to Paiges White Summer/Black Mountainside, I came up with a great idea.</p><p>Back in my lit class there was this assignment we had to do. We had to pick any song we liked, and analyze the lyrics so as to argument for or against it being poetry.</p><p>Right, okay? Cedric was just barely following me.</p><p>So, I should have picked this song! Its a guitar solo, so it would have been f***ing incredible if I showed up and played White Summer, and laid out my argument for why its poetry. It wouldve been pretty original.</p><p>Oh, damn! Youre right, man, that wouldve been pretty cool.</p><p>[2:00] I talked Cedric into going to the beach. It wasnt quite as hard as convincing him to go outside, because hed realized that was a good idea. Obviously, going to the beach wasnt the greatest idea, and I knew it, but I pressed it on him because its what I really wanted to experience.</p><p>I would be the one to drive, because I was the one with feet still firmly planted in reality. On the way to the parking lot, we encountered 10 or so police cars leaving the law enforcement education area. Neither of us were really spooked; in fact, I thought it was pretty funny that we were tripping in the vicinity of so many cops.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>The drive there was pretty much a 30 minute haze of music and I cant recall most of it. I was very intensely focused on driving, though it wasnt that much harder than doing it sober. The Gorillaz tunes were following us everywhere we went that day. I couldnt have made a better selection in music.</p><p>[2:30] Being on the beach while just coming down from my peak on LSD was incredible. It was, and still is, the most incredible experience Ive ever had.</p><p>The clouds fractalized into themselves millions of times over, and the sky was enormous. The sand felt cool and the wind was soft. This was the first time in my life I was able to focus on every single aspect of perception at one time, and I was overjoyed by this fact. I could feel that the wind was coursing throughout the sky, over the waves and sand, and blowing over my face. The horizon of the ocean was incredibly distant, and yet I felt so incredibly close to it. I could feel myself occupying a tiny space of the gigantic entity that was the beach, ocean, and sky.</p><p>Dude, you have to lie down in the sand. Its great, I said</p><p>Nah, thats alright. Youre doing your thing and Im doing mine, was Cedrics reply as he sat with legs criss-crossed.</p><p>Just to add a little oddity to my utopian experience, I giant DirecTV blimp floated into view and directly over Cedric and I. The blimp had a flexible jumbo-tron attached to the side of it; we both watched the movie previews as it soared away. It bothered me, being a little unnatural in my surroundings, but after a few minutes I decided it fit into my utopia in a very quirky, sci-fi kind of way.</p><p>At this point I noticed the Men in Black Shirts on the beach. They werent figments of my imagination  they were real people, and creepy at that. I understand that youre supposed to be a little paranoid on psychedelics every now and then, but I wasnt being paranoid for no good reason. There were literally 6-7 older men in our area, all wearing the same exact black t-shirt, all patrolling up and down the beach while communicating on cell phones. It wouldnt have bothered me too much if there were some of them posted further down the beach on either direction, but there werent. They were all confined to walking in circles within a 200 foot radius of Cedric and I. Obviously, we got a little edgy (me, mostly). So, we headed for my car.</p><p>[3:20] Upon backing out, I bumped into another mans SUV, who was waiting for his turn to back out. I attribute this to my crappy depth perception, which is why it was probably not the best idea to be driving in the first place. I parked my car, turned it off, and stepped out, hoping to the Flying Spaghetti Monster that I hadnt dented his bumper.</p><p>I apologized immediately to the man when he stepped out, sorry about that... I just didnt see it and thought I wasnt too close and...</p><p>Dont worry about it. Just lemme see here... He checked his bumper. Nope, its alright.</p><p>[4:00+] The rest of the day was pretty laid-back. We were both a little sad to be coming down, but overall, it was a great first experience for me. I can't wait until Bonnaroo 2008 for my first REAL trip :)</p>",
 "year": "2007",
 "id": "68713",
 "gender": "Male",
 "timestamp": "2012-12-25T08:00:00.000Z",
 "views": "866",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
