{
 "id": 6874,
 "title": "The Agony of Withdrawal",
 "date": {
  "submission": "2007-06-27T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Firebird",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "GHB",
   "form": "daily"
  }
 ],
 "report": [
  "Ok well I first started using GHB back in September. I was getting the pharmaceutical powder which I really loved and was using it maybe once or twice a week. I fell in love with the stuff and couldn't wait for my next shipment.",
  "Anyway in these next couple months I would do it off and on until about end of November-December. My Pharma source only started supplying large quantities that I couldn't afford at the time so I was now getting a  Liquid source with a concentration of 4ML=1g. I would start to use daily, doing about 10mL's 3-4 times a day and to sleep as well. I thought this was the best drug/mood elevator/body building supplement by par and it blows Alcohol out of the water euphoria wise.",
  "I was on Paxil before for my panic attacks which seemed to help and I felt depressed because of the panic attacks but G beats them all by far. G totally took away my anxiety and lifted my mood so much that I became addicted and was doing it on a daily basis with maybe 3-4 day breaks in between because I was waiting for my next shipment, but those 3-4 day breaks were only maybe every two weeks.",
  "Anyway, around late December I started noticing some 'chills' or 'strange body waves' a couple hours after the g wore off. Like the feeling when someone drags their nails across a chalkboard. But when I took more g, the feeling went away. At first I thought I had some flu or something but that was not the case, I figured I must be going through withdrawals but I continued my daily usage until just the other night here when I was taking G all day long and as soon as it wore off my face start getting really hot, felt like I had a temperature, heart was racing, blood pressure was up. So I took another dose of G and bam, symptoms were gone like that. I fell asleep for about 4 hours and woke up with the worst dopamine rush/panic attack ever. I couldn't stop shaking and my heart was racing so fast. Luckily I had a 10mg valium that helped and I finally got back to sleep, when I woke up I still felt sketchy. And it's been about two days now and I still don't feel normal.",
  "I don't have an appetite at all, I feel severely depressed, have bad anxiety, almost panicky. I hope this subsides. I love GHB and used to swear by the stuff, as it opened me up socially and made me feel like a better person. Also I noticed that I never really got the chills when using the pharma powder. Although I am not really sure if it makes that big of a difference."
 ],
 "erowid": {
  "id": "40014",
  "citation": " Firebird. \"The Agony of Withdrawal: experience with GHB (ID 40014)\". Erowid.org. Jun 27, 2007. erowid.org/exp/40014",
  "substance": "GHB",
  "views": "4554"
 }
}
