{
 "title": "The Unimaginable Terror of Enlightenment",
 "author": "Sam",
 "citation": " Sam. \"The Unimaginable Terror of Enlightenment: experience with Syrian Rue, DMT & Mushrooms - P. cyanescens (ID 68768)\". Erowid.org. Sep 2, 2008. erowid.org/exp/68768",
 "substance": "Syrian Rue, DMT & Mushrooms - P. cyanescens",
 "bodyweight": "70 kg",
 "report": "<p>Recently my friend and I sampled some very high quality DMT extracted from Mimosa hostilis root bark. We are both quite experienced with drugs in general, especially psychedelics, both organic and synthetic, but are most experienced with LSD, mushrooms, 2CE and mescaline. More recently we have been experimenting with DMT, both in pharmahuasca preparations and smoked, and this has to be one of the weirdest, most interesting chemicals weve come across so far.</p><p>We started off consuming 2 '00' gel caps of 4x Syrian rue extract, and 40 minutes later, each had a capsule of 250mg DMT extract. I also consumed 12 dried, tiny Copelandia Hawaiian mushrooms (quite a low dose, but still surprisingly effective with MAOI's).</p><p>My friend purged around half an hour later, and said it was the easiest, most stress free purge he has ever had, unlike last time when caapi was used, although he had been drinking heavily the night before. I got mild stomach awareness, which passed completely within an hour. I seem much more prone to purging and nausea with caapi. The Syrian rue gave quite a different effect than the caapi - much more relaxed, less 'deep', caapi we both found on the time before to result in an extremely intense but short trip, which was a lot more visual and had a lot more 'messages', and resulted in a strong purging. The come up also felt different to my last time with rue, partly due to me not fasting the necessary 6 hours before dosing. The trip came on very gently, and was certainly enjoyable and relaxing, but at the same time it wasnt really taking us anywhere really interesting.</p><p>Around an hour and a half later we decided to smoke some of the DMT extract, in my friends new glass pipe - due to my previous experiences with 2 different glass pipes I have encountered, I was quite relaxed about using a good amount of the extract, around a 1/4 of a capsule I think, approximately 50mg of material as this cap was less full than the other 2 we had taken. It did however look of very good quality.</p><p>The pipe proved to be very, very effective indeed. I fell into a strong trance very rapidly, but managed to finish a third toke (Terrence McKenna style), but before I'd even finished this the world had changed dramatically. It then hit me in the most intense fashion anything ever has, ever. Other psychedelics can take me out of my usual box, can provide me with an alternative perspective and open up my mind to the possibility of other dimensions. For me in this case, the high dose of smoked DMT completely and utterly launched and submerged me into an incredibly alien, incredibly vivid dimension. The experience itself did not feel like a drug intoxication-more like some extremely futuristic virtual/hyper reality technology.  The 'visuals' (this is really a fairly poor, empty description), were utterly vivid, and all encompassing-my entire perspective on the universe for that time was not simply altered, but completely transformed.</p><p>I've have read that high dose DMT experiences (and other tryptamines), have been compared as being near identical to alien/UFO abduction, and I must say that was pretty much exactly what the experience felt like, minus the actual aliens, although the whole feeling of the experience made up for that. The fear and utter terror, which I felt during that 5-minute eternity, have been unmatched so far in my life. I have been in a near plane crash, in an extremely dark iboga trance and had a particularly nasty ego annihilation after smoking some strong Salvia extract on the tail end of an acid trip, but these simply can't compare to the sense of dread I felt during this experience. When I started to return to a more gentle, and still quite shpongled state I was quite shaken for a while and prone to swinging between emotions.</p><p>Imagine stumbling, almost instantly, into a completely alien, yet seemingly completely real dimension of reality, and having no idea how to navigate this strange place, or what rules apply here. That was the experience felt like. Yet it was without a doubt the most profound experience of my life - all other psychedelic experiences to date seem mere footnotes by comparison. My friend asked me afterwards if I regretted it, but I replied with all my life, no. It has opened up my mind, rather unexpectedly as well, to the possibility of actual parallel dimensions, alien life, and even the possibility of a higher power of some sort. I know this must sound quite rainbowed out, but trust me when I say I am as subjective as I can be when experimenting, but this quite literally blew me and all my preconceptions away.</p><p>If we think of our brains as very sophisticated biological receivers of sensory data, perhaps DMT (baring in mind it is an endogenous chemical) can alter the receiver wavelength of our brains, so we start tuning into and experiencing whole new levels of reality that may always be there but shrouded from us. I know this theory has been touted elsewhere, but this is the one I think most fits my perception of the DMT experience.</p>",
 "year": "2008",
 "id": "68768",
 "gender": "Male",
 "timestamp": "2008-09-02T07:00:00.000Z",
 "views": "7859",
 "dose": [
  {
   "time": "0",
   "amount": "2 capsls",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract)"
  },
  {
   "time": " T+ 0:40",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "DMT",
   "form": "(extract)"
  },
  {
   "time": " T+ 0:40",
   "amount": "12 caps",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  },
  {
   "time": " T+ 2:10",
   "amount": "50 mg",
   "administration": "smoked",
   "substance": "DMT",
   "form": "(extract)"
  }
 ]
}
