{
 "title": "One of My New Favourites",
 "author": "magicalchem",
 "citation": " magicalchem. \"One of My New Favourites: experience with MDPV (ID 68773)\". Erowid.org. Jan 31, 2008. erowid.org/exp/68773",
 "substance": "MDPV",
 "bodyweight": "185 lb",
 "report": "<p>The night before I smoked a lot of weed so when I got up I was all cloudy-headed and a bit hung over. I was feeling really unmotivated to do anything much. so i decided to try some MDPV to get the day started--at 1pm--as I would notice the effects well on such a day.</p><p>+00:00 1pm. Snorted 3mg</p><p>+00:05 I think I am feeling something but decide to ignore it in case it is placebo.</p><p>+00:10 I can taste the drip and effects are starting to come on.</p><p>+00:15 Almost at full effects. I am feeling a lot more motivated and quite happy and slightly euphoric.</p><p>+00:20 Full effects. Slight pleasant euphoria. I am energetic and in a very happy mood. I put on some techno and it sounds great. I am enjoying the music a lot. I feel the need to be doing something and since music is on I dance a bit around my room. Heart rate has not really increased.</p><p>+00:50 Turned off the music as I got bored of it. Effects are starting to wear off, especially the happiness and euphoria. Still feeling energetic and have the need to do something. I feel the need to redose, however I control myself. I can't usually control myself with methylone--it usually turns into a 10 hour, 1 gram binge with methylone.</p><p>+1:10 I decide to go to the gym and do some weightlifting. Usually I feel unmotivated to work out, but I was very enthusiastic to get there this time.</p><p>+1:20 I arrive at the gym. Most of the effects have worn off except slight stimulation. I still feel like I've got to be doing something and am eager to get started lifting weights.</p><p>+1:40 The past 20 minutes have gone by faster than usual while exercising.</p><p>+2:05 Workout finished. I did notice that towards the very end I was getting more short of breath than usual. Nothing too bad though: as long as I concentrated and breathed properly during the exercises, I could barely notice it. All of the effects have worn off. However, I am still in a slightly good mood, as opposed to when I woke up. For the next two and a half hours, the slight mood elevation continues.</p><p>There was no crash just a very subtle come-down. I like this one a lot. I will try 5mg next time. I think it would be really nice in a social setting. I like that I can easily handle the effects and don't feel a very strong need to re-dose.</p><p>It's one those drugs that I would do if I need to take it easy when going out one night--snort a few bumps, have a few drinks and some good weed. This is especially useful since in this small town if you show up with your rolling/tripping face at a club you are about the only one, everyone else is just drunk.</p><p>I could also see it being very useful when doing schoolwork.</p>",
 "year": "2007",
 "id": "68773",
 "gender": "Male",
 "timestamp": "2008-01-31T08:00:00.000Z",
 "views": "45466",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.0 mg",
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "(powder / crystals)"
  }
 }
}
