{
 "title": "No Life WIthout It",
 "author": "Badfish stylee",
 "citation": " Badfish stylee. \"No Life WIthout It: experience with Venlafaxine (Effexor) & Clonazepam (Klonopin) (ID 68793)\". Erowid.org. Dec 29, 2008. erowid.org/exp/68793",
 "substance": "Venlafaxine (Effexor) & Clonazepam (Klonopin)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)",
   "",
   "3.0 mg",
   "oral",
   "Pharms - Clonazepam",
   "(daily)"
  ]
 ],
 "report": "<p>I have had Hallucinogen Persisting Perception Disorder for seven years from abusing LSD & Ecstasy back in 2000 - 2001.  Since then I have quit all drugs, alcohol, nicotine, and even caffiene & still am aflicted with this terrible disorder!</p><p>I am currently on 3mg Klonopin/day and 150mg Effexor XR/day just to get by.  I've been on the Klonopin for almost 4 years and I know I'm addicted to it but it's the Effexor that worries me more than anything.  I take Effexor to help stabilize my mood and it helps a tad with the anxiety but it's mostly for my depression.  And I have to say it works like nothing else I have ever tried.  I've been on it only a year but I cannot see life without it.  I just wanted to give an example as to why it scares me.</p><p>Ran out of money to refill my prescription and couldn't take my 150mg dose for 2 days.  The first day I just felt slightly sick and I started to start feeling pretty depressed.  I took some extra Klonopin and fell asleep for the night.  Day 2.  It didn't hit me until I was at work.  Not only was I feeling sick but I was more depressed than ever and everything irritated me.  I knew what I had to do:  I had to kill myself.  It made perfect sense and no matter what I could not talk myself out of it!  I took more klonopin to try to mellow out but it didn't help.  People at work noticed I was banging things around and something was wrong even though I denied it.  I started hallucinating more than usual:  Auras, Floaters, Static, Afterimages, Flashes of Light, etc.  Yes, I must kill myself!  But wait!  I must kill everyone else, too!  It made perfect sense!  Go home for my 15 minute break, load up my AR-15, drive back to work and gun everyone down.  Bring enough ammo to get the job done.  Load all the clips to the hilt.  Gun everyone down & get the police to send the SWAT team in, we'll have a shoot-out and then they will shoot me down & I'll finally be free!!  It was perfect!  I just needed to run to the bathroom to throw up & then I could get this all over wth.</p><p>My plans weren't realized because I was puking most of the time until it was time to get off work.  I got home and loaded a round into my .38 pistol and spun the revolver before slamming it shut.  I put it to my head and pulled the trigger.  I did this twice more.  I figured if there was a God he would have to stop this nightmare or I would!  The phone rang - my ex-wife calling to see how I was doing.  I told her I ran out of my Effexor and I had to kill myself.  But she was nice enough to pay & pick up the Effexor and bring it to me.  I took 300mg immediately.  I'm glad she came.</p><p>It took about 3 days to get stabilized to where I was feeling 'normal' again.  But this Effexor scares me!  I never thought these kind of thoughts BEFORE taking this drug!  I mean I get way way more depressed without Effexor than I did before I ever took it & never delusional!  I'm still taking 150mg/day.  I gave all but one of my guns to my dad for him to hold because I don't want to hurt myself or anyone.  I've taken so many types of drugs, got hooked on some of them, suffered the withdrawals from them but I've never had anything that has put me in a bad state as Effexor withdrawal!</p>",
 "year": "2007",
 "id": "68793",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-12-29T08:00:00.000Z",
 "views": "49881"
}
