{
 "title": "Time Lag",
 "author": "Bill R",
 "citation": " Bill R. \"Time Lag: experience with Pregabalin (Lyrica) & Hydrocodone (Vicodin) (ID 68829)\". Erowid.org. Apr 30, 2010. erowid.org/exp/68829",
 "substance": "Pregabalin (Lyrica) & Hydrocodone (Vicodin)",
 "bodyweight": "180 lb",
 "report": "<p>I injured my leg skiing earlier this year and was prescribed lyrica (pregabalin) for some non-specific neuropathy after physical therapy. I've gotten better, but I still had about 250mg of the lyrica left. I decided today to take it, and see what happened. I've read some great experiences on line regarding this drug, so I was expecting a pretty fun time.</p><p>at T+1:00 I had felt no effects, and I was wondering if I should have taken more. I decided to wait about an hour, but at T+1:45 I started to feel some tingling in my hands and peripheral nervous system, but I wasn't sure if I imagined it.</p><p>By T+2:00, I was feeling pretty strange. I had the feeling that my vision and perception was 'lagging' when I moved, which is pretty familiar to me and resembles being high on gabapentin. I decided to go hang out with a friend, but before I did I got a 5mg hydrocodone pill from my roommate. I have a reasonable tolerance to this particular substance, so I didn't expect much, but it can be fun so I took it.</p><p>I drove to the local McDonalds to get some lunch, and noticed my perception of events was speeding up and slowing down randomly. I would feel like everything and everyone, myself included, was moving extremely fast, then suddenly it would switch over to everything moving very slow. I would also have the occasional bout of normalcy, where the drugs seemed to be having no effects on me.</p><p>Needless to say, this is not a condition to drive in. I could manage, but I recognized the fact that I was not working to my full driving capacity, so I parked and decided to walk around until I chilled out some. I realized I could not really control my walking pace, and noticing this would have sent me into a fit of laughter had I not been in a public place. This began a one hour (or so) period of euphoria that rivaled some of my most profound Vicodin experiences. After that I basically lost all track of time, and finally came down at about T+5:00.</p><p>I'm still a bit altered as I write this, but overall I'd say this is one of the best experiences I've had, rivaled only by my first time smoking marijuana. I was euphoric, extremely social, and my perceptions were severely altered.</p>",
 "year": "2007",
 "id": "68829",
 "gender": "Male",
 "timestamp": "2010-04-30T07:00:00.000Z",
 "views": "10180",
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Pregabalin",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:30",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Pregabalin",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 2:00",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  }
 ]
}
