{
 "title": "Which of These Arms is Mine?",
 "author": "Cash",
 "citation": " Cash. \"Which of These Arms is Mine?: experience with Salvia divinorum (ID 6885)\". Erowid.org. May 14, 2002. erowid.org/exp/6885",
 "substance": "Salvia divinorum",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "report": "<p>\nI just had a very odd trip. it was astounding..and alarming..and exciting..and confusing..and revealing.. causing me to revere this teacher plant more than ever. I think my last trip (2 nights ago) was intended to be a handshaking with salvia..so that the salvia journeys would stay fresh and 'familar' (although in hindsight, my salvia trips have all been vastly different despite using the same salvia in the same setting). </p><p>Tonight's ride was a full-on mindfuck.  I did yoga to prepare and I thought it would just be 'another salvia journey..' feh.  That is a moronic notion indeed.</p><p>I took a lung busting hit.. and laid on my bed in near-darkness and total silence. the familiar feeling of my heart growing thunderously loud in my chest forshadowed the voyage and within seconds I was teleported into an ego-free space.. and I was not alone in this space.</p><p>Not that saying 'I' means much..I seemed to be scattered all over space and time.. to the point that there was no specific 'me.' I sat up..to find me. There was a dim light coming from my stereo, making my white arms glow to an extent. however.. they seemed to be just one set of many arms in the room.. all lined up parallel with mine. The other arms were black (pitch black.. not a skin tone) like my sheets and the darkened room but my arms were glowing against them.</p><p>I don't know how I was maneuvaring my arms the way I perceived because in hindsight it is impossible.. because I was flipping my arms.. like pages in a book... turning them over, across each other. it seemed that a new arm would replace the arm I flipped.. like a new page revealed by turning the one you just read. These arms did not appear to belong to me even though I knew they should. I was searching for 'me' in this sea of arms.. and entities. I could see my legs too but there was really no distinction between them and my arms.. I knew the room was filled with appendages.. All lined up in rows and they couldn't have ALL been mine.</p><p>I got somewhat panicky because the ego loss here was startling..I was in a space where 'I' did not exist.. where I was a character in a story.. an idea but not a reality..and I was not alone in this carnivalesque space. It was as if my existence was a mischievous prank.</p><p>I had the impression of neons.. blue and red mostly.. these colors worn by or indicating the other presences in the room. they seemed to be very amused at my confusion with my arms. Wicked creatures!  None of these arms seemed to be connected to 'me' as in, my ego or my torso.. I desired to be me, to know me and to be reassured of my existence.. that I was not just another of these faceless phantoms that were visiting me.</p><p>I am wondering if more salvia would make them talk? impart their wisdom? I got the feeling that some of the visitors were sages and mystics..shamen..yogis..spiritual masters far beyond me..watching me..as if I had invaded the coffeehouse of the gurus and they all stopped their chitchat to point and laugh at the kid who fashions himself an explorer of these realms.. they were thoroughly enjoying watching my discovery and confusion. The presence behind me I interpreted as the intelligence/spirit/consciousness of Salvia.. and I interpreted it as female. Whether this was an honest impression or one I have gathered from research I will not know..but I said 'Hi' to the female presence.. the one who had invited me into her magical wonderland space.. or had I intruded?</p><p>Hearing my voice jarred me somewhat and I recovered my identity from the sea of dismembered appendages and egos. The sages still seemed to laugh contendedly, as if to say 'of course that's you, you silly fuck.' The reunion with myself was breathtaking.. as if I had woken from a dream that I had called life.. and here I was finally the dream maker and not the dream.</p><p>I turned on the light and gazed at myself in the mirror for a very long time.. some very real and vivid questions (and answers) about the nature of my identity and existence were raised tonight.. and I contemplated them as I stared into my eyes. I could see into myself from a new angle. an angle I have never seen a face before.. as if from the center.. from the inside..(third eye meditation experiments with entheogens have been profound before.. but this was new..vivid..real) I could see through myself and to myself.</p><p>This was a definite wake-up call. A testament to the fact that this is NOT a 'RECREATIONAL DRUG.'  The disorientation, and uncertainty were startling. I think that being blasted out of my ego so fast was part of it.. and part of it was my aversion to slipping into the boundary free space of salvia (this is usually not a problem for me.. this trip however was my most powerful so far and caught me off guard).</p><p>I look back on it very fondly. The real me that salvia is alerting me to is not far ahead.. and may even slow down enough to be caught.</p>",
 "year": "2001",
 "id": "6885",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-14T07:00:00.000Z",
 "views": "11032"
}
