{
 "id": 6886,
 "title": "Words Are Not Enough",
 "date": {
  "submission": "2005-08-24T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "MaybEtard",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ],
 "report": [
  "On Friday, April 9th, 2004, at 7 P.M. I consumed a little over 2 grams of Psilocybe cubensis, three large stems. This Good Friday trip was the follow up to my first experience with the mushrooms, exactly one week prior to this. The dose then was just half a gram less, but the difference in effects was absurdly unexpected!",
  "On this day, I had class, and this was the day a good friend of mine was supposed to visit me for the first time - but he didnt come. I spent the day with my friend J, who spent time with me the week before when I first dept into the mushroom. Then I went off to see my boyfriend at the time. I was wondering whether I should take the mushrooms on this day and he answered my question by playing me a strange cartoon of dancing mushrooms, singing, Mushroom, mush-room, ohhhhhhh mushroom! That was clearly a yes.",
  "7 P.M.- I went back to my dorm and unfolded the aluminum foil which held the entheogen. I then proceeded to eat the three long stems and follow them with a cup of water, a small banana, and gum. I went over to Js room where we sat and talked for a few minutes, until D came. As they conversed, within 10 minutes of taking the mushrooms, the effects began to slowly rise.",
  "7:30 P.M. I was feeling highly euphoric, very highly euphoric, and began to touch myself just to experience this feeling. I began to wonder if this is going to be a very thought-less trip. I was feeling good, giggling for no reason, or perhaps because their voices sounded a little bit like they had inhaled helium. Time began its slow creep, and I was very focused on my euphoria. For some reason I thought that this was the peak, and after a few hours of feeling good, and giggly, I would just come down. At this point, my vision began to dance a little bit. The carpet began to melt a little bit, and the patterns on it began to emerge, as though speaking of their historic significance. J and D ordered some Chinese food, which arrived within half an hour.",
  "8:00 P.M. I ended up paying for some of the food, perhaps because in my euphoria I was feeling generous. We began to watch the Simpsons episode where Milhouse moves to capital city. The colors of the screen were remarkable. I perceived the first five minutes with such clarity and such attention to detail. My brain was immersed in the wonder of the Simpsons. I found things to be so funny yet so true, and every word provoked countless thoughts and associations. I tasted a piece of the spicy fried chicken and the spice burned my senses. I could feel the spice all over me, and I quickly had to drink a lot of water to try to wash over my palate, but by then it was too late I began to rise ever upward. I blamed the spice for this new feeling, one which I didnt get last time on the mushrooms.",
  "As I watched my surroundings, I began to feel an intense pressure on my body, all of it, as though I was being pulled from it. I tried to pretend that everything was ok, but every few seconds, a new pull would envelop me. I felt as though I was being pulled into another world. At the moment of the feeling, the periphery of my vision would explode with color, and I would actually move back a little bit. The room became so detailed before me that it looked like a painting. The faces of the Bart, Homer and Lisa, and later the cartoon of the woman from the Jeffersons began to show something more then what I had seen before, their faces began to come apart and discombobulate into colors and archetypical ideas of faces. I got up, in the middle of my adrenaline rush - panic that I would be pulled away from this world into ego death perhaps?? And decided to go outside for a cigarette. D joined me. In the hours that it took us to walk 10 feet to the elevator, I stared at her and wanted to tell her that her eyes were the most beautiful eyes imaginable. They sparkled with such clarity and such intense beauty. Her face was slowly coming apart into the basic colors from which it was manifested in my visual field.",
  "We walked out onto the patio to smoke. Walking around the hallways, everything was brighter then it normally is, and all moving objects were leaving delicious semi fractal trails. I had never imagined that I would see such beauty. Everything was simultaneously coming apart and coming together.",
  "8:15 P.M.  Me and D smoked a cigarette and while on the patio of our dorm, a large expanse where we would all go to smoke, two people came to join us. They knew D and introduced themselves to me. One was a girl I had seen before, and something about her was off. I felt at times that I could sense something more then was shown to me visually and audibly - it wasnt paranoia, but a peace of mind, knowing that this girl hides so much from the world. All her pain is manifested in this strange behavior of masks. In fact, her face looked like a mask at this point, and I was certain of all the lies. Me and D parted and I went up to my room and turned on my computer. I sat there and the heat of my room began to increase the effects of the mushrooms. Time was pretty much meaningless at this point. I could look at a clock 10 times and have a million thoughts and ideas, and still, a minute had not passed. The time dilation was very intense. I went online and it was pretty difficult to read anything, as it swam around in my vision, so I decided to check out the visionary arts vault. The picture which was new that day was this: http://www.erowid.org/culture/show_image.php3?i=art/artists_e/erial_steeringtowardheaven.jpg  .",
  "Now, this image is very intense when sober, but in my be-shroomed state, I watched it unfold itself in many transcendent levels. The field surrounding the head of the alien-like figure was shining out of the picture, the levels of color were shifting in unison, in cohesion and I felt elevated to the state which the figure was experiencing. I felt as though I was in that same world.",
  "I must note during the entirety of the trip, I did not take the time to watch the closed eye visuals due to my complete disbelief over the transformation of my visual field.",
  "8:45 P.M. I was listening to some music- Tiestos mix of Southern Sun I believe, and I was very joyful. Then, my roommate at the time came in. Our room was very small, and he came in, and sat right behind me. We had a very bad relationship. He was utterly inconsiderate (would turn off the lights when he would go to sleep at 9 PM and would never consider my sleep by banging the door whenever he left). We also had not spoken in weeks. Suddenly, my adrenaline surged. My teeth began to shake (more then they were already) and I got very cold. His presence was beginning to propel me into a state of panic and I began to have thoughts of permanent madness. Of course, I knew it wouldnt happen and in a few hours, I would feel fine again, but the setting had changed because he was in the mix.",
  "After a few minutes of this, and attempting to focus on the picture, to regain my once blissful state, I began to experience auditory hallucinations. I heard explosions coming from him and I knew that things were pretty bad. I could not tell him to leave, so I got my bag, my jacket, and my phone, and left the room. I walked to the stairway and called two friends of mine who began to joke about there being a robber in their house. I was pretty dumbfounded - they actually purposefully tried to bug me out, while my roommate did not do anything specific to make me feel crappy. I told them I had to go. I wandered back to my hallway and sat down on the floor. Then it began...",
  "9:00 P.M. I was sitting down comfortable in the quiet hallway, brightly lit with my perception of it, and I experienced the transformation. My surroundings more then melted, tendrils began to creep from the wall, transparent hyperspacial tendrils, symmetrical in nature, which began to transform the space I was in. They grew only from the walls, and I interpreted it as folds in the nature of reality. When I had taken LSD for the first and only time, years prior, I experienced something similar - a perception of holes in space time. I observed these empty spaces of blackness on the face of a building, their edges surrounded by colorful fields. I was quite fascinated by this, and I was beginning to feel incredibly good. At this time, my thoughts began to race out of control. It was fascinating.",
  "9:15 P.M.  Two hours into the trip, I called my boyfriend and we talked. It was earlier this week that his reaction to someones rudeness made me believe that he was not very sane. In fact, I started to think he was a schizophrenic. When we spoke now, I understood what he was saying, perfectly, and in fact followed up with his inane ramblings for the first time, which freaked him out a bit. It was at that moment that a revelation came to me that he is in fact not present in this world. I later found out that he was taking Zoloft, clearly misdiagnosed as suffering from major depression. The Zoloft seemed to actually exacerbate his obsessive compulsive disorder. This conversation made me realize that it is not for me, this life, his life is not my life and I cant suffer because of his madness. (To the reader this may sound cruel, but in the next two weeks, before we broke up, he deconstructed our relationship in the most horrible ways, and made me feel like I am not a human being - in a negative sense and in a positive sense.) So this conversation, which occurred as I watched the tendrils flow, was important. When I hung up, I went out to the patio for another cigarette and sat down on a bench.",
  "10:00 P.M. The visual phase of my trip had now ended. The colors remained bright, but the tendrils were gone and peoples faces were still and their bodies trail-less. But sitting out on the patio, I began to think about my madness at that moment. I realized that I was an alien, a being whose nature was not human, and not of this Earth. I began to thank the Earth for her kindness, for allowing me to experience life as a human being on this planet, to feel what it is like to be human. Then, an antithesis - What if I just went crazy right now? - and then an antithesis to that - What if its ok to have gone crazy? What if Im right? What if Im not human? Of this I had no proof, except this feeling like I was not of the Earth. I felt as though this paradox, the paradox of life on Earth, was irreconcilable with the hyperspacial nature of reality. I felt that the small problems which plague mankind - jealousy, hatred, greed, you name it, are paradoxical - WHY? was the big question. Why is this happening to this planet? Why are we so doomed to doom ourselves?",
  "My alien feelings did not make me think that I was born on another planet, in another part of this universe, I felt like my true nature was not material, but spiritual, that I was of this world, in that I was this world, and I was a manifestation of the divine in us all. The entheogenesis of the cubensis mushroom allowed me to become the mushroom itself and the deity it represents - which is the universe. Here lay all the answers - somewhere in my brain, but unreachable, for to understand the divine in my material state is the end of the material state. We cannot fathom the true nature of reality like this, in the day to day state, or explain it in words. Words are not enough, I learned on that April night.",
  "The time dilation was not as extreme now and I knew that soon would come the sweat of the comedown - when my first trip ended, I let out a sweat, after which no effects were noticeable in my senses - but my thoughts remained a little paradoxical.",
  "10:30 P.M. I went back to my room from the patio and I wrote these words (the spelling has been corrected for your viewing pleasure):",
  "This is an incredibly fascinating species. My god. Having been raised and brought up within its society has been an incredible experience. But that is what life is, an experience, it is pure, and continuous until death. Death ends the experience and takes the experiencer back to the all aware god. God is infinite. God is eternity. Eternity is not a concept understandable to human beings. We just can't. We name things simply because we try to quantify our own existence, try to explain why, try to give meaning to our seemingly dull lives. Life is not dull. Life is the greatest trip of them all, because it is so filled with experience. Life is pure experience.",
  "We all play roles at different times in our lives - this is important because it is just a way of naming and quantifying the experience. Our brain is this really complex filter for experience. Because we cant possibly process everything at the same time, if we would we would experience the infinite and not be able to learn anything from its many parts. We have to experience the small parts, and that is exactly what life is. Experiencing the small parts of existence (the universal existence).",
  "We are very intelligent primates, kind of like monkeys, yes, but we have thoughts to rationalize existence. Maybe monkeys are more emotionally or spiritually intelligent because they dont have the same brain filter we do, or because their filter is far less advanced then our own.",
  "This rhythm of thought continued as I wandered outside to listen to music. My roommates presence didnt bother me, because I felt like he too was experiencing reality, but his experience was different.",
  "11:00 P.M. As I listened to my headphones, outside, watching people walk by, I could still sense their emotions and I felt so good. So good. I felt at one with all the beauty and at one with the ugliness. I forgave myself for my ugliness and my damage to this world and gave up my sins with the wind. I forgave the people around me for their dirty looks and asked myself, what is so strange about this guy (me) sitting here on the ground, smoking a cigarette, listening to music, and enjoying his experience of life?",
  "11:30 P.M. I went and bought myself an ice cream bar - the first food I would have since the spicy chicken and I devoured it. It was the most delicious tasting ice cream I ever had. After this, the sweat truly came and I let go. I was down completely, my thoughts running at a normal speed and only the memory of the days and eons long entheogenic voyage remained.",
  "This experience taught me a lot, as you can see. Since that trip, I have done extensive research as to their history and the cultures associated with them. Maria Sabina said that mushrooms are the flesh of God. She said that when a healer takes the little ones that spring forth, he becomes as God. I ate of the tree of knowledge of good and evil and as a result, I sipped the nectar of the fruit of the Tree of Life! Or that is how I felt as a result. Never underestimate the great power of the mushroom and dont forget its ability to create ripples in space time, and cause change in the concept of Self."
 ],
 "erowid": {
  "id": "40082",
  "citation": " MaybEtard. \"Words Are Not Enough: experience with Mushrooms - P. cubensis (ID 40082)\". Erowid.org. Aug 24, 2005. erowid.org/exp/40082",
  "substance": "Mushrooms - P. cubensis",
  "views": "9664"
 }
}
