{
 "id": 6887,
 "title": "Peaceful Showering",
 "date": {
  "submission": "2005-07-21T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kaleidoscope",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.25",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Alprazolam",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Experience Report",
  "Description of Substance:",
  "What it contains - 0.25 mg of generic Xanax (Alprazolam)",
  "What the standard dosage is - 0.25 mg every 4-6 hours",
  "What the legitimate uses are - Stress Relief",
  "Mindset - Optimistic, Happy, Slightly Nervous",
  "How it will be taken - Insufflated",
  "How much is taken - 1.25 mg",
  "Previous experience - Yes, 0.75 mg snorted, and 1.50 mg oral on several different occasions.",
  "Any additional pertinent information - This is the highest amount Ive snorted to date, almost double what my record was before.",
  "7:20 - Ground up and snorted 1.25 mg, has an awfully bitter drip. Probably the worst of anything Ive ever snorted. It was hard to keep from almost throwing up due to the extremely bitter and disgusting taste. My nose almost instantly turned numb.",
  "7:25 - Feeling it already, feeling very heavy, relaxed and the familiar nose-numbing sensation. Feeling very slow also.",
  "7:33 - Effects rapidly increasing, everything is feeling a lot slower, Im typing a lot slower and feel very heavy and relaxed. It is extremely enjoyable. Walking ability is greatly impaired, it would be very apparent to someone at this point that Im under the influence of something. I keep drinking a lot of soda to help drown out the taste of the drip. Im also slightly disoriented, kind of like if you spin in circles for a few seconds.",
  "7:37 - Feeling a lot more impaired now than before, Im making a lot of typing mistakes and feel very uncoordinated. Feeling even heavier then before and a lot more relaxed. Im listening to Nirvana and its actually quite relaxing.",
  "7:54 - Effects have seemed to have come to a plateau and Im feeling very relaxed and mellow. The numbness in my nose has gone away as did the awfully disgusting drip. Music sounds better, its just pleasing and even more relaxing to listen to music you like.",
  "8:11 - My memory is starting to get very impaired, I loose track of what Im doing even while Im doing it, but it doesnt bother me because I know I have nothing important to do. When I look around, it feels like my vision is slightly behind the motion of my head, its barely noticeable.",
  "8:34 - Most of the moderately intense effects from snorting it, like the disorientation have started to fade and Im feeling very mellow and very content. I dont feel quite as slow and my walking ability is increasing.",
  "9:15 - I went to get a shower and it felt amazing. Showers for me are always very relaxing, the Xanax made it feel 100 times better then normal. Most of the more intense effects have faded almost completely leaving me with a beautiful, relaxing, euphoria that Ive come to love Xanax for. I feel very content with everything and overall just in a very positive mood. I still feel kind of sluggish and disoriented, but it is nowhere near as intense as it was.",
  "9:30 - Most of all the effects have faded, other then the relaxation. I feel very mellow, with a slight headache and sore throat. I think I may have snorted more than I should have and it irritated my throat.",
  "Conclusion - This was a relatively small dose, so it wasnt as intense or as long as a higher dose would have been. It was all in all, a very enjoyable and relaxing experience. Whenever I take more than 0.5 mg of Xanax in one sitting, I usually get severe amnesia and have a lot of memory issues for a couple days or even up to 2 weeks afterwards. I cant remember much of what I did, and the rest of it is blurry. I have never showered while on Xanax before and will definitely do it again, it was very relaxing."
 ],
 "erowid": {
  "id": "40085",
  "citation": " Kaleidoscope. \"Peaceful Showering: experience with Alprazolam (ID 40085)\". Erowid.org. Jul 21, 2005. erowid.org/exp/40085",
  "substance": "Alprazolam",
  "views": "130818"
 }
}
