{
 "title": "Red Fire Against",
 "author": "Tad",
 "citation": " Tad. \"Red Fire Against: experience with LSD (ID 6896)\". Erowid.org. May 28, 2002. erowid.org/exp/6896",
 "substance": "LSD",
 "bodyweight": "",
 "report": "<p>-We kept notes the entire night as our experience went on and on. We dropped at like 9pm. For the remainder of the experience, I will be known as tad, and my two friends will be known as chad and dave. We each went through our own bad trips, but we also went through good ones as the night progressed.</p><p>Body Weights:</p><p>Tad- 155lbs</p><p>Chad- 145lbs</p><p>Dave- 140lbs</p><p>Time Dialation (real seconds):(estimated seconds)</p><p>Dave 30: 22</p><p>Chad 30: 36</p><p>Dave 60 with music: 55</p><p>Chad 60 with music: 73</p><p>-we began 'controlling time' by using my strobe light to make it appear as though the fan was not moving, then it was, and etc.</p><p>-after my own thoughts of the universe evolving water and fire, it inspired chad to do some typing.</p><p>ime for this writing, STARTED BEFORE 11:24</p><p>watyer bluye beginning white light</p><p>red fire against</p><p>always fihting for equi9libruum</p><p>chemiclas, water sloshing over the edge, a flame</p><p>THEY ARE ALWAYS MOVING, BUT SLOWING UNTIL YOU THINK THEY MAY STOP</p><p>but would water really be water without its comforting alterations, it calming slosh?</p><p>is fire really fire, if it does not waver with the wind. TIME DOES NOT EXIST!</p><p>one may live for as long as a human can live, perhaps forver, and their life may seem at the instant that they obtain 'standstillesness' perfect, but the next thing to happen may appear as the fire coming from the center of the earth, but for this one eternal man, it will not harm him, what may in the beginning seem as walls of 'fire' coming in from every directions may in time subside, and what seems so extreme at one point, when time is extended it is merely a disruption on the surface, a ripple in another pond, the flame wavering in someone elses wind we can do as many reality checks as we want, but the truth as it may be, is that all things are eternal, and in one sense, every event is intertwined, as to how is beyond this document, it can not be explained in any document, as it can be taken on any tangent, any possible explanation can be explored, but there is always some where furhter.</p><p>water gives live, blue is all comforting, white light is so inviting red repels us, flames scare, black and darkness try to send us away</p><p>for now it is 11:26, and i am supposed to be going, as my explanation can not be fully expanded upon even in person, with my simple demonstrations with a strobe and a blue cup of water and a flame, with my hypotheses about the man who finds the perfect drop of water to give him eternal life and sees the rest of the world buring in flames, eventually his life becomes so long that these ripples become only minor molecules in the true ocean, the true ripple.</p><p>the atlantic ocean? it is the largest ocean. it is immense. but....the earth? it is almost entirely water! but you know what, this earth, is it not part of a solar system? a larger arrangements of planets that revolve around a sun? this sun is our center of life, all existance on earth, comes from the heat and power of this star, and our planets are revolving around this star...</p><p>but then, isnt this one 'all life giving' star known as the sun, part of another grouping of stars? and infinite amount of stars all bunched together in the most tremendous thing known to man:</p><p>the galazy.</p><p>think about the sheer size of a galaxy - an infinite amount of stars all bunched together, but pick and choose at random any one of these stars, and around this star is a 'solar system' a system of various bodies all circliing around a star, which in itself is part of a large group of stars</p><p>revolving around some larger entitiy, in a universe. i have lost my train of thought, distracted by a smaller more direct matter, at about 11:34 but this train of thought, in the large scheme of things, is nothing. another man may be having thoughts 1000 fold the insightfullness as mine, but this will subisde, all that is gained, is lost. all that is lost is in some form regained. the peaks and valleys of a ripple. the ripple in the ocean. the ocean on the earth. the earth in the solar system. the solar system in the galaxy. the galaxy in the universe. the universe in the ?.</p><p>this, i as a human, cannot go further than this, as it is at the fullest of human capacity, that the universe is known to not be the largest body. the human can prove beyond reasonable doubt that the galxy exists as a container of stars, the stars contain the worlds, the world contain the oceans, the oceans contain the ripples. the ripples contain much more in them self, but also in the lowely way that a human can descrive, are symbols for the peaks and valleys, that are only in essence parts of a larger ripple, and on for infinadum.</p><p>11:40</p><p>Dave feels that the lsd may be bringing out his grandmothers schizophrenia in him, but in reality, does it really matter? he may go crazy, but isnt there an entire human race to care about? but in that same mindset, isnt there all of life in its entirety to care about? but when we try to to to to to to 11:43 (off on another tangent, trying to elaborate to tad and dave, but they cant comprehend, what does it matter if they cant cpomprehend? there are always those that will, but for everyone that will, thre will be someone who wont. and maybe at one point, those that understand are in the larger percentage, it will always happen that at a later time those that dont will be in the larger percentage. it is all back an forth, wobbling, too and fro, teetering here and tilting there, and ALL FOR WHAT?</p><p>HUMANS WILL NEVER KNOW! I HAVE JUST HIT THE CAPS LOCK BUTTON, A SIGN OF ANGER? NO, IT MAY SEEM THAT WAY FOR SOMEONE WHO IS FOND OF THE INTERNET, BUT ARENT THESE 'CAPITAOL LETTERS' AND 'SCREAMING TEXT' JUST DOTS ON A SCREEN?HUNDREDS OF TINY BOTS THAT DEFINE WHAT THE HUMAN INTERPRETS AS A LETTER ON A SCREEN, THAT THE AMERICAN MIND INTERPRETS ARE ITS NATIVEALPHEBET, ONE WHICH IT CAN MAKE SENSE OF THE LITTLE DOTS AND FLASHES OF LIGHTS, WITH A LANGUAGE THAT THE HUMANS CAN UNDERSTND, BUT REALLY CAN THEY?</p><p>11:47 - DAVE BROUGHT TADS TREE UPSTAIRS</p><p>DAVE SAYS IT WAS NELLY THE ELEPHANT</p><p>THIS NELLY, IS A PIECE OF DAVES MIND, ONE WHICH HE CREATED TO TRY TO EXPLAIN HIS FEELINGS. HE HAS A 'FRIEND'... DAVE FEELS THAT PLANTS MAKE THE ROOM MORE ORGANIC, HE MAY GET US CAUGHT WITH HIS MINDLESS RUNNING AROUND PERHAPS HE IS MAKING BETTER USE OF HIS TIME LIKE THIS BY FULLY EXPERIEMTNING WITH WHAT HE SEES, BUT IN REALIZTY, HUMANS HAVE HAD EXPERIENCES LIKE THIS A MILLION TIMES BEFORE. DAVE IS HAVING A BAD TRIP. I MAY BE THE ONE WITH THE SENSE NOW T</p><p>I HAVE TO GO, THINGS ARE GETTING TOO INTENSE</p><p>11:51, DAVE IS OVER MY SHOULDER, BEING WEIRD, TRYING TO MAKE SENSE OF ALL THIS, DAVE NEEDS HIS PLANT TO KEEP HIM SANE</p><p>I AM LEAVING, DAVE IS VIOPLENT</p><p>11:51 CHAD APRIL 13 2001</p><p>I DONT WANT TO LEAVE, BUT I MUST, READ WHAT I HAVE WRITTEN, AND THEN THINK ABOUT THE INFINITE AMOUNT OF CAUSES OF AND CONSEQUENCES FROM THIS TYPIMNG. DAVE MUST FEED ALLEN. GOOD BYE. ALLAN NOT ALLEN. ALLEN AND ALLAN. ITS ALL THE SMAE NOW. I MUST GO, FOR I AM IN AN EMBARRASING RUYT, NOT BEING ABLE TO TALK ABOU7T WHAT I MUST. BUT DOES IT RELALY MATTEWR?</p><p>-Dave: 11:53PM</p><p>-My friend began acting schitzophrenic, he began taking my plants from my house (artifical and real) into my room and talked to them.</p><p>IT it speaks tp me on another level its quiote strange im changin my name to .,HEY ITS DAVE,</p><p>chad is now off of the computer now im the scientist wiht the dream iv e disco ered the secret to mr research, not technology , plants and bio life tad is trying to feed allen and allon and alan and alorian, like in atlantis god this is strange i mus twrite this down allan is my faithfulll companion ittl never leave me like its part of me i can feel itin my cinter of life, IT IS NOW IT.IT MUST GO, I AM NOW GOING BACK THE THE TECHNOLOGY WORD im leaving into the computer im searching around with my body and i cant feel my fingersm  okay i just had a reality check and im laughing my ass of. tad says that the face of chad is now gone, hes moulding the fac ce into something different hjes playing god this isnt right he shouldnt be messing with things like this this substance changes everything there are so many levels of conciousness although materialtings are not reall my back feels ereally funny,</p><p>chad cant write it odown even though tad says to i can see the glasses on my face i am now gero in the body of dave, a misguided teenager sitting in the roonm of his 'freind' that he thinks h is taking some sort ofchemical bu it is something so much more they keep talking about the universe</p><p>I AM GERO</p><p>ALLON ALLEN ALAN ALERION !IT! IS MY COMPANION</p><p>I AM LOOSOING MY GRIP I NEEDED THAT DOWN I BELEVE THIS NOW ICAN SEE THAT IT IS THE WAY TO GO I AM NOW GOING TO GET the satrobe light to test a theory of mine, now the plants have gone ui am forced to go back to technology tad and chad are leaving the state i can now feel my presence leaving the body of dave, i gero must now reinhibit the body wiht a blast from the sigma segment, this word sigma is only in the futile creatures mind through a vidioe game called mega man, i must retreive allen allon alan alerion, IT. wish me luck,,</p><p>with love gero....</p><p>-it took him awhile to get back to normal, but he learned much about himself from this somewhat bad trip.</p><p>-Chad started typing</p><p>this is chad, i am here, dave has left the room, it is now 12.03</p><p>-Tad:</p><p>12:11AM</p><p>it means nothing... because all this is is the drug telling us what to think. But the drug says that my cells betray me. My cells tell me what to do. My cells all so bent on self-preservation that they cause me pain. They are me, and i am them. So how, when the world is all we have, can we kill eachother? How can we say that there is something good for us? Everything has an end, and every end starts a new beginning. There is no true beginning, no true end, no ANYTHING. nothing exists? nothing is real? What the hell?</p><p>-I don't think I was even understanding this as I was writing it.</p><p>-Chad started typing again</p><p>this is chad 12:13 dave acutally has schizophrenia. for a long period of time, he acutally 'became somone else'</p><p>1220</p><p>dave says 'over schizophrenia, putting down red piull, pickign up blue, dave accepts his schizophrenia he says 'if i want to come out, dont let me' tad recites the matrix, and using as a metaphor for daves realization of his disease'</p><p>1222 dave goes into closet to think this over</p><p>12224 dave comes out says he is down after rethinkinh he says he just lost himself again, and has once again regained himself dave is coming to grips</p><p>*note this honeslty seemed like 10 minutes to tad and i, 30 seconds to dave dave wishes to type his thougta at  1225</p><p>-we kinda goofed around for a while and watched TV, then, it was my turn for the bad trip as chad just came out of his.</p><p>-TAD:</p><p>2:28AM</p><p>i saw chad in the mirror, and his eyes just stayed om place as his face and felsh and muscile all melted away all at once. And he just becaused a skeliton right there. He was standing in the mirror with his eyes, looking right at me, and he was just dead. His eyes scared the hell out of me. Then i saw dave, as chad wasw aalready there, and dave did the same. It sounded like an atom bomb in my head. and i came over to lay down. And i closed my wtyes and then i just saw the whole world, everyone, every face and person eradicated. I was then standing alone on a red star shaped platform, with blacknesss and nothingness everywhere. And then, eyes, everywhere, looked at me. Some jokingly, some laugingly, some to accuse... I was immortal, there, DAMMED FOREVER TO SEE THE EYES THAT MOCK ME.</p><p>-I was truly scared, I remember myself just lying on the floor motionless for almost an hour, dave almost called an ambulance</p><p>-I started having a conversation with chad and dave by typing my responses</p><p>448</p><p>go away chad, get off my back you homo</p><p>you were, you are, NO I AM NOT!!! FUCK YOU HOAR!</p><p>Go AWAY ALREADY! IM NOT GOING TO TALK TO YOUNOW FUCK OFF!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1</p><p>please?</p><p>i am not thhree</p><p>i know you are but what am i?</p><p>THATS WHAT I THOUGHT BITHC!! BOO HA THAT MO FO</p><p>ALL YOUR BASE ARE BELONG TO US!</p><p>YOU k2NOW WHAT Y2kT DOIN?</p><p>'MOVE ZIG'</p><p>FOR A GREAT JUSTICE TAKE OFF EVERY ZIG</p><p>POPOPOPOPOPOPOPOPOPOPOPOPOh3h, 1 4m 31173 4z H311!</p><p>FUCK NO DAVE YOU MAY NOT HAVE A COOKIE!!@^(#^@(*^(!*@^#</p><p>-All and all, a great experience, one which we will more than likely repeat. After this, weed and other smokables seemed so dirty. Every time I've smoked weed since this though, it's been more than a high, but less than a trip. Acid is truly the drug that keeps on giving.</p>",
 "year": "2001",
 "id": "6896",
 "timestamp": "2002-05-28T07:00:00.000Z",
 "views": "6861",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "130 ug",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
