{
 "id": 6898,
 "title": "Long-lasting Visionary State",
 "date": {
  "submission": "2011-10-29T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Chez Sativa",
  "gender": "Male",
  "weight": "225 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  }
 ],
 "report": [
  "<p>Cannabis Gourmet",
  "I've recently been introduced to the advantages of ingested cannabis. I get a more powerful high eating it than I could ever get from smoking it, and it provides a long-lasting visionary state similar to other psychedelics.",
  "In the past, I tried ingested cannabis with minimal effect. Then I tried some brownies made with cannabis butter. WOW! I said, I must speak to the man who made this butter.",
  "As it turns out, the THC is sucked out of the leaves by the butter when you cook it, then you strain the leaves out and that's that. You need to use butter or some kind of very saturated fat, otherwise it does not work.",
  "Rather than get distracted with the specifics, I will provide a single experience report followed by the recipe.",
  "The Experience:",
  "00:00 - Eat one guacamole eggplant quesedilla containing approximately 1/8 cup (one fluid ounce) of cannabis butter.",
  "00:20 - Start to feel a bit dizzy and relaxed.",
  "00:40 - Color enhancement, good mood, easily amused.",
  "01:00 - The full effects come over me and I feel an extreme sense of euphoria and presence. The feeling is similar to MDMA but without the speedy anxiety. I'm able to continue working, talking on the phone, having a wonderful time.",
  "02:00 - Listening to music is delightful. The mind is very relaxed.",
  "03:00 - Spend some time in the hot tub. Emerge refreshed and alert.",
  "04:00 - Later stage psychedelic feelings of completeness and purpose of being are felt. Erotic push is very strong.",
  "05:00 - Damn, I'm hungry!",
  "06:00 - Deep sleep",
  "14:00 - Feel fine the next day",
  "The Recipe:",
  "Cannabis Butter: 1 lb Butter, 4 oz. Cannabis Shake (the stuff nobody will ever smoke), Water. Put the shake through a colander to break it up more and get rid of the seeds and major stems. Fill a pot with 4-6 cups of water, add 2 oz. of the shake and bring to slow boil. Add the butter and stir until melted. Let simmer for an hour. Pour the whole mix through a cheesecloth to strain out the vegetation. Squeeze out as much of the butter/water you can. Throw out the leaves and put the butter/water in the refrigerator for 6 hours. The butter will separate out from the water and you can pour off all the water and leaf gunk (there's no THC in that water just bad stuff). Repeat the whole process using the remaining 2 oz. of shake, reusing the butter you just processed. You will end up with enough excellent butter for 4 batches of brownies.",
  "Cannabis Eggplant: Saute one large eggplant cut into small strips in 1/2 cup cannabis butter. Let cook slowly until the eggplant is crispy and all butter is absorbed. Makes delicious sandwiches, put on pizza, pasta, etc.",
  "Cannabis Guacamole: Add 1/4 cup cannabis butter for each avacado. Add garlic, lemon juice, season to taste.",
  "I've found that the dessert-based cannabis treats are weaker than those made with no sugar and flour, so I make main dishes that will use a lot of oil. If you use cannabis for pain management, you might want to think of eating it instead of smoking. It's healthier and the effects of the cannabis are much greater and longer lasting. It can also be a lot cheaper. Anyone who grows cannabis at home will be more than happy to have someone come by and take all the leaves away so they don't have to figure out how to get rid of them.</p>"
 ],
 "erowid": {
  "id": "40130",
  "citation": " Chez Sativa. \"Long-lasting Visionary State: experience with Cannabis (edible) (ID 40130)\". Erowid.org. Oct 29, 2011. erowid.org/exp/40130",
  "substance": "Cannabis (edible)",
  "views": "4045"
 }
}
