{
 "id": 6900,
 "title": "Evil, Strong... but I Liked It",
 "date": {
  "submission": "2005-11-11T08:00:00.000Z"
 },
 "author": {
  "name": "tai",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Lotus/Lily",
   "form": "extract",
   "specific": "Nymphaea nouchali var caerulea"
  },
  {
   "time": "0",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  },
  {
   "time": "0",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "I had salvia and wanted to have a strong experience. I wanted something new and exiting, even at the cost of my own sanity. I started smoking bowls of blue lotus extract, because I heard it goes good with salvia. I smoked it until I felt pretty high and I started seeing things. I believe in energy that the universe is made of and sometimes I can see it, but when I smoked the blue lotus it was even more clear and I saw even more of the weird things I can normally see while sober. I got to a weird state of mind with the blue lotus extract and decided to put it down because my lungs had taken about as much of it as they could comfortably handle. I decided it was time.",
  "I put a chair next to my bed and put a pillow on my bed, so that I can sit on the chair and lean my head back on the pillow when I space out. I took a phat hit of salvia 20x extract. Immediately I had the sense that there was some massive overpowering force of salvias spirit, which is normal, but it always catches me off guard. I took another hit, and I might have taken another, but by then I was so gone, I can not remember if I took 3 or 2 hits. Anyways I was f***ed up!!!!!!",
  "I leaned back and started seeing this weird brown pattern with green in the middle, which I always see after smoking. It is the spirit of salvia, at least thats how I perceive it, and it has a face made out of green that moves around doing whatever she is doing. I felt as though she was face to face with me, which has never happened before. I could feel/see her looking straight into me, and through me. She seemed partly in approval, but partly in disapproval. the reason why is because I was partly holding back, because I wanted to keep a little self control over myself. Eventually I started telepathically telling her that I wanted to journey out of my body and see something amazing, anything, as long as it would please my need to journey to the other side. ",
  "I started seeing pictures of a rainforest, mostly vines and trees, with a beautiful light shining through. Although salvia was not the light, her spirit was in the vines and plants. It was beautiful, it was as if I was in two places at once, I was slightly conscious of my body, but mostly conscious of this dream world salvia has taken me to. I assume it was a dream world... it could have been an actual place, but I didn't get that feeling that it was a physical place within the dream of this planet and all of us. It was a separate dream where salvia lives... I think.",
  "Eventually I started to let the spirit of salvia come into me, and sort of become me, sort of possess me, while I was still conscious. I lost all passion for my normal life. My pet dog was in the room, who I normally love, but I woke him and made him leave my room. Salvia always makes me furious when anyone or anything makes any noise. It makes me want to rip everyone to shreds if they do anything that even slightly stand in my way.",
  "I started hysterically laughing. My shoulders would go up really high and I would curl my hands and bring them to my chest, just like vampires do in the vampire movies. I felt evil, but not in a bad way. I saw what looked to me like the green man, who is a figure in pagan witchcraft, who represents nature. I saw someone standing in my room with hair made out of salvia leaves and I have the feeling he/she was made completely out of plants, although I did not see the whole body clearly. I saw what I made out to be ghosts. I honestly think my house is haunted, but not haunted, I just think there are ghosts that go through my room because I see them a lot, even while sober. I started yelling at them and laughing at everything in this evil sort of 'I am superior' sort of tone. Soon I felt as though marilyn mansons spirit was in me, as if I was becoming marilyn manson himself. But not him as the individual, it was more like I was become similar to him but there was also this werewolf presence as well. It was the spirit of salvia in me. I felt like my fingertips were really long and painted red with blood/fingernail polish. I am male by the way, so this was kind of strange.",
  "I was coming down then, and thats about it. It lasted about 20 minutes or so. Salvia has a delirious hypnotic possessive and slightly evil quality to her, which I now understand, because it still feels as though the spirit is still partly in me. After that I was sick of salvia and just wanted to be my normal self again, although I will always love her for her amazing powers. I bless the spirit of salvia, Salvia is beautiful. I think I am in love."
 ],
 "erowid": {
  "id": "40142",
  "citation": " tai. \"Evil, Strong... but I Liked It: experience with Blue Lotus (extract) & Salvia divinorum (20x extract) (ID 40142)\". Erowid.org. Nov 11, 2005. erowid.org/exp/40142",
  "substance": "Blue Lotus (extract) & Salvia divinorum (20x extract)",
  "views": "5175"
 }
}
