{
 "id": 6902,
 "title": "Playing with Fire",
 "date": {
  "submission": "2008-04-01T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Euro77",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "IV",
   "substance": "Cocaine"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "IV",
   "substance": "Heroin"
  }
 ],
 "report": [
  "I live in the Netherlands and my first experience with cocaine must have been in the late nineties. I always snorted it with friends but was never very impressed with the effects although it kept me boozing longer. Although I shoot it now I still think that I am less susceptible to cocaine than most because I've seen friends getting very psyched and physically speedy from amounts that would do little for me.",
  "In 2000 I got an American girlfriend who started fucking up by shooting up cocaine and heroin (speedballing). I desperately tried to get her to quit which she actually did, way after our relationship and after becoming a single mother (and thats the positive stuff). Somewhere around 2002 or 2003 I found some needles in my house which I had bought for traveling to a developing country years before. I dissolved some cocaine I had left from  a new years party in a spoon with boiled water and shot it in my arm. It gave me quite a nice euphoric and speedy high but I didn't touch the stuff for another year.",
  "Then I was playing with chemicals and found out that you could convert cocaine powder (the hydrochloric salt) to crack and back by changing the PH. Although good cocaine is difficult to get (for me, lousy network ;-) ) crack is quite openly sold in the streets of amsterdam and easily spotted by the junkies hanging. So beginning 2004 I started buying crack and heroin with the help of some female junkies I would approach. I started shooting combo's of crack and heroin by converting some crack in a spoon with ascorbic acid (pure vitamin c which I bought on the internet) or citric acid (which I bought in a foreign food store) to a soluble salt and adding a little heroin.",
  "Actually I never liked the heroin cause it made me dizzy and nauseous although I like the warmth. I always puked repeatedly the next day. Now I prefer to just shoot the converted crack and sometimes I get the metallic sounds everybody talks about, they dont last long though, and its always quite a rush. I stay speedy for at least two hours but Ill drink to calm down. I dont know if I am getting seriously addicted cause I've never done it in binges but I do find it nicer than most nice things out there in the world and what is more important easier to get at."
 ],
 "erowid": {
  "id": "40148",
  "citation": " Euro77. \"Playing with Fire: experience with Cocaine (from Crack) & Heroin (ID 40148)\". Erowid.org. Apr 1, 2008. erowid.org/exp/40148",
  "substance": "Cocaine (from Crack) & Heroin",
  "views": "17742"
 }
}
