{
 "title": "The Coldest Night of the Year",
 "author": "Navi",
 "citation": " Navi. \"The Coldest Night of the Year: experience with Mushrooms (ID 6906)\". Erowid.org. May 17, 2001. erowid.org/exp/6906",
 "substance": "Mushrooms",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "2.25 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(tea)"
  ]
 ],
 "report": "<p>\nThe leak in my ceiling was fixed today. It's over there, in the corner near the window; I can see it from where I'm sitting. Looking at the mottled patch where the hole was plastered over, I have to laugh at myself for freaking out the way I did. Yet that pathetic brown stain is the only material evidence of one of the most terrifying nights of my life.</p><p>It was a small leak, really, a slow but steady drip whenever the radiator went on in the apartment above me. The winter had been mild, and it was so intermittent, I gave it little thought. A large bowl caught the water just fine, spattering a bit, but never overflowing. I could afford to ignore it for awhile, and anyway the sound wasn't too annoying compared to the neighbors' TV and the motorcycle gang across the street. That day I noticed the stain had grown a bit, and vowed to call the building superintendent, but as it was the weekend, I figured nothing would be done about it immediately. It could wait until Monday.</p><p>Because I was going to do mushrooms again. I really should have listened to myself; I knew I wasn't ready. There were several personal matters that were still pending from the previous experience, and I had told myself that to invoke another experience before resolving those issues would be premature. These were things like: taking advantage of my health care, getting new glasses, making certain phone calls. I had already made progress as a result of my previous journeys, but knew that I had to get past this 'level' on my own before the mushroom would proceed with the lesson. \rThe First Mistake</p><p>I ignored that voice inside me. It had even suggested that the dripping ceiling would be a source of great anxiety while intoxicated, but I laughed it off. I ignored my meager experience with altered states, all those times when the outside world had interrupted the profound reverie of the Self and become unavoidable.</p><p>My intent was to take only 'a little'. There was a rave that night, and I liked the idea of dancing off the tail end of an afternoon of introspection. A 'little' in this case turned out to be about 2-2.5 grams of mushrooms. Only I did something new, which was to run them through a coffee grinder and make tea. This likely speeded the processing of the psilocybin.</p><p>The effects came on within fifteen minutes. There was increased awareness of the body, and as I sat on the couch I struggled to find a comfortable position, a true feat on my cheap-ass futon. I just wasn't relaxed the way I should have been, not in the right state of mind.</p><p>Then the dripping began. There was an alarming plank! sound every time a drop fell into the metal bowl on the floor, which happened every twenty seconds or so. This was accompanied by the hissing and popping of the radiator as it filled with steam. That much was common enough, and though it sounded as if some infernal factory were starting up in the corner of my apartment, I knew that it would pass when the pipes were full. I closed my eyes again, determined not to let it distract me.</p><p>My mind wandered... plank! plank! It was an angry sound; it wanted my attention. I recalled an experience in a previous apartment, where I'd come home to find the radiator fallen over on its side. It didn't leak, but I was surprised by how heavy it was when I lifted it back up. A metal box concealed the radiators in the present apartment, preventing such accidents. But it also prevented me from seeing how they were supported. Looking at the noticeably increased stain I wondered -- how long had water been pooling there before it soaked through the ceiling? How long had that radiator above been leaking? Was it riveted to the wall, or did it simply rest on the floor -- the wet and rotting floor above me where water had been pooling, eating into the wood, weakening it... \rThe Gates are Opened, the Dogs are Loosed</p><p>I started up in alarm, visions of the radiator crashing through the ceiling flashing in my head. The sounds of cracking wood, the groaning of metal pipes, the crash and chaos as the mass of steel burst into my life, spraying steam and scalding water. I had heard that my grandfather was once badly burned when a boiler burst and covered him with hot water. Things like this happen; I could become one of 'those people' that you see on the news, in shock as the police try to find out what happened.</p><p>The police! It was one thing to have a radiator fall through the ceiling, but what would come out later? I was certainly not in a condition to deal with other people, let alone landlords and cops and panicky neighbors. What if they found out about the mushrooms? What if they saw the books that lay scattered about the room, what if certain flags were raised in certain offices? The paranoia began spiraling out of control. My apartment now seemed the site of an impending disaster. plank!... plank!... plank!... Like the countdown on a ticking bomb.</p><p>Should I call the building superintendent? I felt I could not deal with that at all. He is somewhat aloof as it is, and in my bemushroomed state I could not communicate, could not avoid raising suspicion. But what if I didn't call? What if the radiator fell through the floor below and someone got hurt? A sense of doom was descending upon me. I felt trapped in a way I have never felt before. I felt confronted with a dilemma whose reality overwhelmed me. I decided to get online and see if I could find some friends.</p><p>The chat channel was not busy, but a couple of people I knew were there. I contacted them privately and exchanged some greetings, made some small talk. Then I casually asked for advice on a 'minor crisis'. I waited for a response. After a few minutes I had heard nothing. Sweat beaded on my forehead, but I didn't want to sound too nervous. Suddenly a message appeared saying that the connection had been broken. I had never seen this message before! It was absurd -- as if I were being actively punished by the situation. I reconnected and was able to stay in contact after that, but I was getting extremely frightened. My friends suggested that I stay calm and maybe get some carbohydrates in me. They talked me down a bit, and I resolved to get out of there long enough to regroup. I thanked them, assured them I'd be okay, and signed off.</p><p>I resolved to walk the ten blocks to my girlfriend's apartment. She was out to dinner with her parents, but I had a key. It was the only other place I felt I could go like this, although I didn't want to frighten her by showing up so panicky. I started putting on my coat.</p><p>It was then that I became aware of the appearance of my room. What if something happened, and people had to come and investigate? In my state of mind, the apartment looked particularly disheveled. Clothes and books and papers formed small piles here and there. Dishes needed washing. In a frenzy I stacked the books and papers, threw the clothes in the closet, along with the coffee grinder and associated paraphernalia. I washed the dishes. I quickly made the bed, and moved everything out from the corner of the room where the leak was. I wasn't worried that people would see a mess, I was worried that the state and contents of my apartment would attract undue attention to me in the wake of a catastrophe. I felt profoundly unprepared. \rThere is No Sanctuary</p><p>Not satisfied, but too panicked to be fussy, I put on my hat and left the apartment. It was one of the coldest nights of the year, yet I was sweating under my clothes. Images were racing through my head, trains of thought speeding to calamity. Intricate, paranoid fantasies were now spiralling out of control. I saw myself in court for negligence (for not having called sooner about the leak), for possession of a controlled substance, getting evicted, fired, imprisoned. It was out of control. I actually came to terms with the possibility that my life would be drastically changed from this point on, as if it had all happened already.</p><p>By now it was dark out. I reached my girlfriend's apartment without incident -- I wasn't so far gone that I couldn't navigate the familiar neighborhood successfully. The first thing I did was down a small spoonful of peanut butter for the carbohydrates, as advised. Whether it would have calmed me down or not, I'm not sure, because soon another crisis presented itself. My girlfriend's parents would be bringing her home, and they might come up with her. Although they know me and like me, they are not necessarily aware that I'm anything but a friend to their daughter. Discovering that I not only have keys to her place, but finding me there tripping and spooked would be a lot worse than having a radiator damage my ceiling. I couldn't do that to my lover.</p><p>It was a quarter till 9. She had estimated they would return around 9:30, but I couldn't be sure. I had to put on my shoes and coat, straighten out the bed where I'd lain, unset the alarm (my intent had been to try and rest for awhile), lock the door and get down four flights of stairs before they arrived. Panic seized me as strongly as before as I hurried to make my escape. \rThe Walking Meditation</p><p>Out into the cold, out into the streets of Manhattan. I had nowhere to go. Returning home was out of the question. Luckily I had maintained enough composure to dress adequately, but still, it was biting. I decided to sit on a nearby stoop and wait for my girlfriend's return. As people passed by, though, I became worried that I would arouse suspicion hanging out on the street on such a night. In fact that block is known for drug dealers and prostitutes, and a patrol car did pass by once. Or was it a taxi? I figured it would be better to keep moving, as much to stay warm as to avoid attention.</p><p>I started to walk. It was Saturday night in the East Village, but the usual throng of nightlifers was attenuated by the cold. All things considered, being in Manhattan on a freezing night had its advantages: there were enough people to make me feel safe, but not so many that navigating the sidewalk in my state was problematic. I wanted to be left alone, and the cold gave me an excuse to cover most of my face without appearing overly furtive. I was uncomfortable and extremely anxious, but the sense of immediate danger was receding.</p><p>As I walked, I thought, and the secondary effects of the mushroom became apparent. Something was nagging at me, something I seemed to have forgotten. It was like a word trying to form in my mind, but not quite succeeding, a seemingly simple idea that I 'knew' but could not name. All lines of thought seemed to lead back to it; it was like an echo of something important yet simple, right on the tip of my tongue. It had an 'I told you so' feeling to it, and seemed to be associated with the concept of 'grandfather' or 'ancestor'. I struggled in vain to identify it. It was uncanny like dej v, with the urgent beauty of a just-forgotten dream. The experience was ineffable, provocative, and weird.</p><p>At one point I had the experience of what I have tentatively labeled 'unfiltered perception.' I was approaching a streetcorner. Cars were passing, some were turning, lights were changing, people walked in both directions, coming in and out of stores and restaurants, dogs, posters, horns honking, change jingling in the cup of a beggar... Suddenly I was aware of all these stimuli at once, these things that are normally filtered out of our consciousness, which we react to, half-aware. For a few moments I could observe all of these signals simultaneously, see how they intersected in the body, how they were anchored together by my particular perspective. I experienced reality as a massively parallel process, a field of endlessly interacting patterns, emerging, refracting, and dissolving around me and through me. And yet it was not confusion. I knew what things were, what the blinking red 'DON'T WALK' sign meant, what an oncoming car meant. On the contrary, it was an uncanny clarity. I was a bit awed, but felt distinctly awake to the world around me. \rSafe at Last</p><p>I had no way of telling how much time I'd been walking, as in my panic I'd forgotten my watch. After what seemed like a reasonable amount of time, I headed back to my girlfriend's street. Sure enough, the lights were on. Still, I had to be sure she was alone. Found a pay phone. No quarter! Ducked into a deli and had to buy a small tube of toothpaste to get the change. Back at the pay phone, I spoke with my lover at last, trying not to sound too anxious. In a few minutes, I was safe and warm in her apartment. My lips were chapped from the cold, and the tip of my nose was itchy and slightly numb.</p><p>By that time I was coming down, and was able to explain what had happened. I am eternally grateful to this wonderful woman for listening and comforting me, without judging, when I needed it so much. My bemushroomed mind dubbed her the Comforter, and gave thanks. Without her, and without my friends online, this crisis could have been far more serious.</p><p>After all that, I still ended up going to the rave! (Hey, I paid 25 bucks for the damn ticket.) Around two in the morning I got a cab to the club, and spent the next 3 and a half hours jumping and sweating to loud Goa trance. I may have been the only sober person there. \rPostscript</p><p>The next morning I found myself thinking, inexplicably, of my grandfather, who was many years deceased. I was showering when I suddenly recalled that he -- and he alone -- had always called me by my Hebrew name. I had never thought much of it, but now it struck me as mysterious and significant. When I called my father to ask about it, he said that he too had awakened that day thinking of my grandfather, and further surprised me by adding that my grandfather's birthday was only two days away. I'm not sure what to make of it, but I wondered then if it was connected to the fleeting suggestion which had haunted me the night before.</p><p>I continued to process the whole experience over the next several days. A major issue throughout was that of preparedness. Needless to say, the radiator did not fall through the ceiling -- but what if it had? What if there was a fire? What if Something Happened? I don't believe in living in fear, but there are steps one can take to prepare for the unforeseen. This experience strengthened my resolve to attend to those 'loose ends' in my life.</p><p>And there is another matter of preparedness where entheogens are concerned. I was not ready for a session with the mushroom, as my intuition had correctly suggested. What happened was an example of irresponsible use of an arguably sacred instrument. Oh yes, lessons were learned, but not quite the ones for which I'd navely hoped. I thought I knew from experience that one must secure one's environment, both external and internal, before invoking these neurological states -- and yet I acted impulsively.</p><p>Looking dubiously at the stain on my ceiling, I hope that I won't need any more reminders.</p><p>(1-18-97)</p>",
 "year": "1997",
 "id": "6906",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-05-17T07:00:00.000Z",
 "views": "17041"
}
