{
 "id": 6906,
 "title": "Down by the Lake with Marijuanilla",
 "date": {
  "submission": "2008-04-15T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Wolf Shaman",
  "gender": "Male",
  "weight": "250 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Leonurus sibiricus",
   "form": "(leaves)"
  }
 ],
 "report": [
  "I had been growing my marijuanilla plant for about 4 months. It had arrived as a scrawny little bundle of stems from a mail order herbal shop. My girl had responded well to my loving attention, and grown into a 2 foot tall bushy young lady by this time. By the end of the season, she would become 7 feet tall and 4 feet wide.",
  "I had saved up about an ounce total of dried green leaves. I had smoked a few before, but this is the time that I am choosing to write about.  It was a warm spring afternoon in South Carolina. I had ridden my motor scooter down to the lake, and now I was sitting on the concrete ramp that formed the boat launch. The sun was hanging low over the trees surrounding the lake. It was a beautiful sight. I put a big pinch of marijuanilla into my woooden pipe and took a big hit. I held it in as long as I could. Then I exhaled, rested and took another. I smoked the bowl in 4 big hits. My mind began to feel light and slightly dizzy. I could feel my nerves and muscles relaxing. It felt like a light buzz off of cannabis. I loaded up a second bowl and smoked what as well. I now felt like a medium to heavy buzz, quite similar to what a plant of this name would be expected to deliver.",
  "I sat cross legged and looked out across the water. The sun gradually began to set, and the sky became a dazzling oil painting of orange, red, yellow and purple. I had a wonderfully enhanced perception of the beauty that God created. It was wonderful and dreamy.",
  "The buzz lasted about 2 hours, and after that, I felt relaxed and calm. I enjoyed the afterglow of the marijuanilla until I went to sleep that night. I dreamed sweetly, and awoke refreshed the next morning. I now make sure to always keep some of this wonderful herb on hand."
 ],
 "erowid": {
  "id": "40168",
  "citation": " Wolf Shaman. \"Down by the Lake with Marijuanilla: experience with Leonurus sibiricus (ID 40168)\". Erowid.org. Apr 15, 2008. erowid.org/exp/40168",
  "substance": "Leonurus sibiricus",
  "views": "16157"
 }
}
