{
 "id": 6908,
 "title": "I love exams",
 "date": {
  "submission": "2007-04-28T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mells",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(daily)"
  }
 ],
 "report": [
  "We have our midterm exams in January, about a week after winter break.  We'll take first and second period exams monday, second and third tuesday, and so on.  On days we have exams, we have I think 2 hours for each exam, so we get out at 12ish.  I hate exams, and I hadn't studied as much as I should have, so I decided some Adderall would help.  My first exam started at 7:45, so before I left the house at 7ish I put all the little balls from one 30 mg capsule under my tongue, along with drinking my usual cup of black coffee.",
  "By the time my Physics exam started, I was actually excited about it.  I was running around and talking to everyone, and when I sat down, I was jiggling my leg extrememly fast, not something unusual for me to do even sober, but this time it felt like I wanted to shake my whole body like that, just because I had so much energy. ",
  "I started my exam, and the mathmatical processes I had to go through to get some answers were very enjoyable.  I hate math for the most part, but I love some of the logical processes, when I know what to do because there's such a routine.  I loved doing these problems, figuring out acceleration and momentum and such.  I felt like I knew exactly what I was doing, and would excitedly scribble the equations down.  It was like a really really fun puzzle.  Math on Adderall is my favorite thing ever.",
  "My next exam was Psychology, but I'd written a paper so I had the two hours free.  I studied for my english exam by looking up all the literary terms in the dictionary, and this too was really fun, mainly because it was something to do, and so like routine, I guess.  Normally I hate routines, but with adderall, it all just made such sense that I loved it.  Anything that's logical is great and fun on adderall.",
  "I snorted another 30mg the next morning for my english exam, and when I was writing the essays, the words just keep pouring out of me.  I knew exactly what I was going to say, it felt like I was telling a story about the psychological meanings of The Tempest.  I was so excited about writing it, and I kept getting these new great ideas that felt like revolations-no one had ever thought of that theory before.",
  "My Latin exam was like a game.  We had to match nouns and adjectives by their endings, and it was a puzzle to figure out which was conjugated the same.  All the scantrons were really fun, just filling in the little bubbles one after another.",
  "I took Adderall every day that week for my exams, 30 mg for three days and then 50 mg for two.  Every exam was just like a big puzzle or a game that I had to figure out.  The only bad part was that I had to take benadryl at night to fall asleep.  And I ate like an orange all week.  Although I generally prefer painkillers and downers in general, I love Adderall because I'm just so happy and productive, and everything, whether it's cleaning my room or taking an exam, is really fun."
 ],
 "erowid": {
  "id": "40171",
  "citation": " Mells. \"I love exams: experience with Amphetamines - Adderall (ID 40171)\". Erowid.org. Apr 28, 2007. erowid.org/exp/40171",
  "substance": "Amphetamines - Adderall",
  "views": "8142"
 }
}
