{
 "id": 6909,
 "title": "The Reason I Stopped Using It",
 "date": {
  "submission": "2006-04-18T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mystical Llama",
  "gender": "Male",
  "weight": 13
 },
 "dose": [
  {
   "time": "0",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "daily"
  }
 ],
 "report": [
  "After the xmas holidays I decided to regulate my sleeping patterns using Melatonin. I was also inclined to use Melatonin as I hoped it would allow me to have a better nights rest, having been waking up multiple times during the night previously.",
  "I had taken it maybe 6 months earlier as I wanted to experience more vivid dreams. As it happened, though I did experience this I felt it not worth the interrupted sleep I suffered from waking up during the majority of the lucid dreams I encountered.",
  "So anyway, the most recent time I have been using Melatonin I have had two fairly disruptive experiences. What happened the first time, a week or so ago, is that I woke up during the night, and attempted to get back to sleep - only to find myself lucid dreaming as soon as I seemingly fell asleep. Now, these dreams  seemed to originate from very basic parts of my subconscious, for example one of the dreams was of myself in a scene at work, looking through a guide on something as I usually do to check certain things, and I read a part saying 'number must be wrote in roman numerals'. It was extremely short, but it was hugely vivid, and lucid. Now I forgot about this dream, until I was at work where I was asked a question about the same part, in which I explained to the colleague that among other things, she must write the number in roman numerals. Now, this isn't actually in the guide at work...and when thinking hard on why I would have thought the guide had this written I managed to remember that in fact, I had dreamt this.",
  "My analysis of this is that when I do this part of work, I do write it in roman numerals personally, though it isn't by any means essential, so the dream must've been a represntation of that part of my subconscious - but in dreaming it so vividly, in such light sleep (in that I had barely dropped off) and then forgetting the dream - it actually became a part of my memory.",
  "Another issue was that in waking up one night, attempting to get back to sleep I actually got stuck in the same dream each time, and woke up each time - what must've been 3/4 times. It was a dream where I felt like I was being pulled up by 2 hands swooping down from somewhere high above, from my bed - it was lucid, I was saying 'For fuck sake' in my mind because it aggrivated me rather than scaring me. I was pulling back as hard as I could to stay in my bed instead of being pulled up - each time I succeeded in staying down I woke up. This happened 3/4 times, the same dream the instant I fell asleep.",
  "I've stopped taking it now, as I didn't fancy any repeats of the first issue I wrote about. The second one was mostly aggrivating but I suppose slightly interesting - I could feel the hands underneath me, and I felt almost awake - thought it still was definitely a dream."
 ],
 "erowid": {
  "id": "40174",
  "citation": " Mystical Llama. \"The Reason I Stopped Using It: experience with Melatonin (ID 40174)\". Erowid.org. Apr 18, 2006. erowid.org/exp/40174",
  "substance": "Melatonin",
  "views": "63593"
 }
}
