{
 "id": 6910,
 "title": "Enlightened Relaxation & Pleasant Visuals",
 "date": {
  "submission": "2008-04-15T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Orb",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.25",
    "quantity": "1.25"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I had been smoking pot regularly for just over a year and was highly curious about other natural substances that I could use to get in touch with my subconscious. After reading about mushrooms for a month or so, I decided they would be perfect for expanding my consciousness. My girlfriend and I set out to get some, with no luck for the longest time. After I had almost given up the prospect of ever getting shrooms, our luck changed when my girlfriend's brother informed us of someone selling mushrooms for $30 per eighth. We bought an eighth, which actually weighed out to be 4 grams and set them aside for a few days until the weekend rolled around.",
  "I started doing more research on mushrooms because I take Lithium and I needed to be sure if there would be any interactions between the two. I read online that Lithium can intensify the trip, but the night we took the mushrooms, I also took my regular dose of Lithium because I didn't think it was anything I couldn't handle.",
  "During the week, the wait and anticipation were killing me. I was excited because I had been looking forward to doing shrooms for a long time. Finally it was Saturday night. I had to work until 9:30pm so when I got out of work, I went straight to my girlfriend's house, where we would be tripping, and jumped in the shower so I'd be comfortable during the trip. We sat down and divided out equal doses from the bag. A very experienced tripper with 30+ years experience had sampled the mushrooms beforehand and informed us that they were very potent and the species was P. Azurescens. We divided the shrooms into two 1.25-gram doses and put the rest away because we thought eating half an eighth of potent shrooms would be too much for our first trip.",
  "We dimmed the lights and got into loose, comfortable pajamas. We made the bed with an electric blanket and a bunch of other blankets and pillows. We had a black light to be used as a trip toy. Earlier in the day, I bought a CD called 'Spiritual Healing' which later proved to be soothing music, perfect for the trip. We took down any artwork of my girlfriend's that we thought might be frightening (I react very strongly to any sort of drug), and got rid of anything that looked dangerous.",
  "Beginning (10:00pm): We smoked three hits of pot each to calm down and ate the shrooms. They didn't taste bad at all; they sort of had a peanut-like taste. We made sure we didnt eat anything for 5 hours beforehand. I chewed a pretzel stick while I ate my shrooms and it masked the taste perfectly. We smoked a bowl of pot mixed with shroom powder because our trip guide said that would help us start tripping faster (it did).",
  "Coming Up (10:20pm): After only twenty minutes, I started to feel strange. My girlfriend was talking about the weirdest things like dog collars with multiple leashes attached. My head was also filled with strange thoughts. I kept thinking I heard an echo in the room and for some reason, I was convinced the echo was coming from the corner of the room. Everything we talked about was explosively funny and we couldn't stop laughing. When I exhaled smoke from the pipe, a small portion of the wall wiggled. Staring at a textured blanket was amazing because I saw blue dots on it and the texture gave way to a 3-dimensional cone protruding from the blanket. I looked at a lamp and the light bulb was outlined several times with a thin black line. Looking around the room, I saw sparkles and kept seeing people in my peripheral vision.",
  "Peaking (11:00pm): I sat on my girlfriend's bed under the electric blanket and the warm sensation was wonderful. I sat in what I told my girlfriend was the 'Buddha Position'. Light from the light bulb seemed to be all around me, shining specifically for me. I felt very connected to my mind, body and spirit. A wonderful, enlightened feeling washed over me and I was as calm as I can ever remember being. I sat and stared around the room, taking in the new colors and patterns that my mind's eye saw. I thought I would be seeing 'trippy spirals' and things of that nature, but in actuality, tripping shrooms allows your mind's eye to hallucinate, warping what already exists. The walls wiggled around and I did see amazing scenes when I closed my eyes, but overall, it was very calm and enjoyable. We looked through a Salvador Dali book, drawing our own surreal pictures of what we saw. I went into a soothing trace for what seemed like hours, but it was only a few minutes. It was as if my mind tasted things for the first time. Everything seemed new and wonderful and full of life. The bed seemed to breathe with me and everything around me had intense purpose and meaning. I felt full of knowledge.",
  "Coming Down (1:00am): Everything was hilarious again. Someone would say something funny and I would laugh hysterically. When someone said something sad, I would cry. My emotions were very fickle and one feeling never lasted very long. There were times when I felt sort of scared, but the most important thing I kept in mind was that I had the ability to change the course of my trip by changing my thoughts. We went to bed around 3:00am feeling relaxed, rejuvenated and inspired.",
  "Next Day (10:30am): I woke up around 10:30am feeling sort of tired. For a while, I was still tripping and seeing things in my peripheral vision. My trip guide told me to smoke a few hits of pot so I would feel better. I did so and actually did feel better. After I got something to eat, I realized I felt absolutely great. I gained such a different perspective on things and since I drew a lot during the trip, I gathered a ton of new inspiration. It was most definitely worth doing and I'm glad I read so much about mushrooms and took the time to set up a nice environment for the trip. Setting and mindset really are everything when you're tripping. Its important to keep a positive outlook during the trip. Im normally quite a negative person and if I had been thinking that way while on mushrooms, who knows what could have happened.",
  "We are going to buy more mushrooms while theyre still available because we are going to shrink wrap them and set them aside for later use. Who knows when the opportunity for shrooms will roll around again? I want to be ready to expand my mind when it does."
 ],
 "erowid": {
  "id": "40177",
  "citation": " Orb. \"Enlightened Relaxation & Pleasant Visuals: experience with Mushrooms & Cannabis (ID 40177)\". Erowid.org. Apr 15, 2008. erowid.org/exp/40177",
  "substance": "Mushrooms & Cannabis",
  "views": "3771"
 }
}
