{
 "id": 6914,
 "title": "Not Exactly the Same Effect",
 "date": {
  "submission": "2007-01-03T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "user",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Sceletium tortuosum",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "I recently have discovered the effects of sceletium tortuosum ('kana'). This substance is a bit expensive, but very enjoyable. It's effective at low doses (0,2 g or even less). It can be used as a stimulant, an antidepressant or as a booster for pot. The first times I used it, it seemed to be a mild addictive effect, but I dont feel it anymore. I guess it was more in my head than in the substance itself.  It also seems to be a light tolerance, but short lived.",
  "While always being stimulant and antidepressant, the effect is not exactly the same depending of the way I absorb it.",
  "- insufflated . I need to separate the most fine powder from the coarser one in order to be able to sniff it.   The effect comes on very quick. There's a distinct 'rush'. I think that the overall effect is a bit shorter than with other ways. The best way for a quick stimulating effect.",
  "- smoked . maybe the less effective method. The smoke is a bit harsh, though it tastes good. I mix it with damiana for a stimulant effect, or with pot for a 'high' pot trip. The effects seem to last longer than with the insufflated way. There's not really a 'rush'.",
  "- oral . when kana is eaten or chewed, the effects come on much slower than with the other methods. It takes something like an hour, but it's hard to say, cause it's very progressive. The effects are long lasting. I guess it's the best way to take sceletium tortuosum  as a medecine for depression, stress or tiredness.",
  "Sceletium tortuosum has interesting effects. There's no come down nor depression following the stimulation.   Though it does not seem to be adverse effects, I think it is better not to use it constantly."
 ],
 "erowid": {
  "id": "40198",
  "citation": " user. \"Not Exactly the Same Effect: experience with Sceletium tortuosum (ID 40198)\". Erowid.org. Jan 3, 2007. erowid.org/exp/40198",
  "substance": "Sceletium tortuosum",
  "views": "13133"
 }
}
