{
 "id": 6919,
 "title": "More Powerful Thank I Expected",
 "date": {
  "submission": "2005-08-15T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Kenny D.",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>Being a stoner, I used to think tobacco is very nasty and only idiots would ever try it. I had no idea what it would do, and I used to think that people only smoked to make themselves look cool, and then continued smoking only because they were addicted. Almost everyone in my family smokes, and the only person that I ever asked questions to was my grandpa, who basically just told me that it has no positive effects. He said he started when he was 13, and that he had to 'force himself to start'.",
  "Well I got busted with weed, and I was on probation for a couple months, so I was just dying for any type of high that I could get. I tried nitrous, which was nothing like I had heard. It was a good high, but I couldn't find 'whippets' anywhere and whip cream cans are expensive, plus it's very messy. So I tried to get something cheaper. After reading about various other inhalants, I concluded that nitrous is really the only 'good' inhalant, but that still wasn't really an option. I live in a crappy area and anything besides weed is nearly impossible to obtain.",
  "So that left me with tobacco. It was easy to get, it was cheap, and my parents would provide me with it. So one day I asked my dad for a cig. He actually smokes 'mini-cigars', so he gave me one of those. At about midnight, I decided to try it. I've heard a lot about people saying that it will make you cough uncontrollably. I lit it up, and took a short puff. I didn't even inhale. I was just trying to get a taste of what the smoke is like. Not too bad. Then I decide that maybe I should try putting it in my pipe instead. So I take just a tiny bit of the tobacco out of the mini cigar, and put it in my pipe. I then proceeded to smoke it like weed. I took a long toke and sucked in air afterwards. Immediately, I realize that this is the harshest smoke I have ever inhaled. I held it for a few seconds, then exhaled. Didn't couph at all.",
  "Within seconds, I feel a weird feeling. I got up off my couch to go to my computer, and almost fall on my ass because I'm so dizzy. I feel euphoric. After a minute or so, the dizziness went away and I just feel relaxed and an overall 'good' feeling. I'm dissipointed that it didn't last very long.",
  "But that first time was almost as good as the first time I tried weed. I didn't want to become addicted, so I just thought that I'd only do it about once a week, or on special occasions, and never by myself. Well the next day, a couple of my friends came over (although they're drug-free). It was a special occasion, so I smoked it again. The effects weren't necessarily as intense as the first time, but still great. The next day, my best buddy comes over. He's disappointed that I have no weed, but I tell them that I have some tobacco. I told him that we're going to smoke a cigar in my pipe... he laughed at me and said I'm crazy. I told him to just pretend it's weed. So we smoked a bowl of that, and he was impressed.",
  "So I started to do it every day... and then instead of just smoking a little bit in my pipe, I started smoking the actual cigars. Now it's been about a month and I've had about three a day. I don't feel addicted... and I don't feel any desire, craving, or 'need' to smoke tobacco. I simply do it to get the buzz, which is now nothing like it first was. But I've read at a few places that nicotine tolerance is permanant, and doesn't ever go down. So now I don't see a reason not to do it every day.",
  "But a few days ago, I ran out of the 'full-flavor' cigars, and decided to get some 'vanilla' flavored ones. Well they taste like shit, and I regret getting them. Well I tried inhaling these... in an effort to get that intense buzz I got my first time. Well I sure got my buzz... but as I got up to go upstairs and get a coke, I thought to myself '... this is unpleasant'. By the time I got back to my couch, I realized that the 'unpleasant' feeling was now turning into nausea. I was feeling sicker by the second. I felt a desire to take a shit, so I got up to go to the toilet. I now feel an intense desire to vomit. After I took a shit, I felt a little better. I took off my shirt to help the nausea, then took a couple Tums. I grabbed some duritos and went back to my couch and layed down. The doritos seemed to help the nausea a little. But it didn't go away fully until I went to sleep. I felt fine the next morning. I didn't smoke at all the next day.",
  "A few days later I was talking to my mom, who smokes cigarettes. She said she tried one of my dad's cigars, but inhaled it like a cigarette. She said she felt really sick and almost vomited. I told her I felt the same way.",
  "I've only experienced the nausia with the vanilla flavored cigars. It's a good, cheap substitute when I don't have any bud, but that's all it's good for.</p>"
 ],
 "erowid": {
  "id": "40229",
  "citation": " Kenny D.. \"More Powerful Thank I Expected: experience with Tobacco (ID 40229)\". Erowid.org. Aug 15, 2005. erowid.org/exp/40229",
  "substance": "Tobacco",
  "views": "38258"
 }
}
