{
 "id": 692,
 "title": "Finding Truths with the Earth's Gifts",
 "date": {
  "submission": "2004-11-22T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "explorer",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "My experience began by engaging in a deep conversation with my best freind (herby called KP). We discussed why we were doing this and what we intended to gain from it. We wanted to gain a new understanding on life and this seemed a proper corse of action seeing as it was provided by the earth. We then talked about each other, about what we liked and disliked about each other and dealt with these matters so they were no longer an issue to either of us. This was in case these topics came up during our trip.",
  "We both ate a handful of mushroom caps and stems at around 8pm. We then sat down and began to talk about our futures, awaiting the effects. Approximately half an hour later I began to feel a strange force, first in my stomach, and then radiating throughout my body. Kp said he also felt the same. We then talked about why, as people, we were here. We came to the conclusion that the things concerning the human population in general are trivial. Kp put forth the idea that we were simply here to find the truths of the universe, and that the earth provided a door to these truths through psycoactive plants. I felt this was rather profound and we contemplated the intricacies of this theory.",
  "At this point I decided to go to the bathroom. When I emerged from the bathroom I found that the lights had all been turned off and began experiencing closed eye visuals, but my eyes were open, because the absence of light mimicked this. During this series of visuals (which I have estimated to last 3 hours) I found myself in another dimension, where thoughts floated around in the ether of space and there was only truth. I also felt that I had the discovered the meaning of life, but I can not dictate it as it came to me in the form of an emotion. Eventually I discovered that I was actually in Kp's bedroom. I then related to him my journey, and he spoke to me of a similar time he experienced. He said his journey delt with the issues of religion. We then decided to create our own 'religion', more of a way of life or means to live by, while we let the mushrooms wear off.",
  "The 'religion' that we created is now my standpoint on life. I have since denounced the religion I grew up with and now love the earth, the universe, and all life, for we are all together trying to discover the truths of life. We are all explorers. This experience  has surely helped me. I now live my life in happiness, knowing that one day I will be with the powers of the universe, and that in my life I can find gratification in helping others to also discover the truths of life."
 ],
 "erowid": {
  "id": "11733",
  "citation": " explorer. \"Finding Truths with the Earth's Gifts: experience with Mushrooms (ID 11733)\". Erowid.org. Nov 22, 2004. erowid.org/exp/11733",
  "substance": "Mushrooms",
  "views": "4736"
 }
}
