{
 "title": "An Occasional Delicacy",
 "author": "SWIM",
 "citation": " SWIM. \"An Occasional Delicacy: experience with Cocaine (ID 69213)\". Erowid.org. Apr 13, 2012. erowid.org/exp/69213",
 "substance": "Cocaine",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " repeated",
  "insufflated",
  "Cocaine",
  "(powder / crystals)"
 ],
 "report": "<p>Exactly one year ago was my first experience with the drug cocaine. I was quite young, 15 years old, and a freshman in high school at the time. I did have previous drug experiences, but they werent very extensive; rather, I had used several different kinds of substances, but not to a very large extent. They included marijuana, alcohol, Clonozepam, Tramadol, Vicodin, and DXM.</p><p>That day was the first day of February break. I had wanted to try this drug for a while now. I wished to see whether the social stigma given it was true; was it really all the propaganda made it up to be?</p><p>I woke up that morning after very little sleep; a friend and I drank 12 cups of coffee each the night before in an attempt to own at Halo 2. Needless to say, it was a disaster. With four precious hours of sleep in me, I groggily make myself an Expresso and start my day.</p><p>At around 3:00 I received a call from my dealer, who says she could get me anything I wanted, and asked me if I wanted something. I had $90 on me at the time, and it was between a gram of cocaine ($80) or a quarter ounce of some pretty nice nugs ($90). I decided, what the hell, Ill get me some blow. So I left my house, took a walk and met my dealer and her boyfriend in their car at a gas station nearby. I got in the car and was promptly presented with a small blue baggie. It was in little chunks with some powder floating around the bottom of the bag. I didnt want to sound like a newb at this, so I asked to gum it and smell before buying. I dipped my finger into the bag and smeared it all over my gums; to my astonishment, they went completely numb!</p><p>At that moment, I smiled and knew I found something nice. My dealers boyfriend asked for a bump, and handed me a CD case and a credit card. I pretended like I knew what I was doing and gave him a tiny line, which he proceeded to snort, remarking on how I was Jewish for giving him so little. He did, however, comment on how good of shit it was.</p><p>About twenty minutes later, I arrived home. It had been raining out, so I went to take a shower so as to not catch a cold. I took my Ex-Acto knife blade and a CD case with me, as well as the bag. I turned on the shower and set up all my equipment on the toilet seat. Here is where the fun began.</p><p>T=0:00</p><p>I snorted a tiny line, about a centimeter long and a few millimeters thick. It was a bump rather than a line. It tasted and smelt slightly like diesel. Almost instantly I felt awake and focused, and my mood elevated slightly, but I knew I just had a taste of the drug. I got up, looked around, and went back down to pour out a new line, this time of decent size; I estimate it to have been between .05 and .08 grams, and snorted that.</p><p>T=0:05</p><p>At this point, I had about .1 grams in my system, and I felt good. I felt energetic, awake, and happy. I was content. Looking back, I can compare it to the feeling when one is coming up on amphetamines. The cocaines anti-depressant actions were clearly, clearly felt. I felt as if everything had gone right in my life, as if I had not a care in the world. My nose and throat were extremely numb, as well.</p><p>T=0:20</p><p>I am extremely social; I have texted at least 5 people and am IMing about 10. However, I feel the effects waning ever so slightly, so I make another line of what I estimated to be .1 gram again and snorted that. In two minutes I was back in my happiest place.</p><p>T=0:25</p><p>It is time for dinner with my family. I am not hungry at all. I do talk to my family a lot, I tell a lot of jokes, and blame my not eating so much as usual on the fact that I ate just three hours previous.</p><p>T=1:45</p><p>I am done with dinner and go to my room upstairs and continue talking to people. I snort another .1 gram line. Then, I attempted to masturbate, just because it seemed like a good idea at the time. It took a while to bust; 30 minutes of intense work had me dripping with sweat, but I had succeeded.</p><p>T=2:20</p><p>I go downstairs to play some Halo. I take my remaining .7 grams, my school ID, and CD case with me. I take another .1 gram line and play some games. I didnt play any better than usual, but I did talk a hell of a lot more. In games where people wouldnt talk, I would get frustrated. I was still in a great mood.</p><p>T=3:20</p><p>I take down two lines of the same dimensions as before, leaving me with .4 grams left. I get extremely talkative, but not much more than before. I noted that tolerance builds during use. Still, Halo skill remains the same as it would be sober.</p><p>T=4:30</p><p>I want to finish my cocaine so I can sleep tonight. It is 10:15 right now, and I make two giant lines. The entire .4 grams was snorted. I played a couple of more games of Halo, but I get bored of it. The feeling from the .4 gram line could be compared to the feeling on the peak of 60mg of Adderall. I felt GREAT.</p><p>T=5:10</p><p>I started writing this report.</p><p>T=5:45</p><p>I am clearly coming down, but it is not nearly as bad as I thought it would be. I imagined craving the stuff intensely, but I just feel a positive afterglow similar to the positive feeling after a high dose of DXM or after taking LSD. I simply feel content. I am still awake, but will try and sleep soon. I feel some strain on my heart, but its not bad.</p><p>Aftermath: The Anniversary Reflection</p><p>This report was written based on notes taken the day of. Since then I have gone through over 14 grams of the stuff, and not once had a craving for it. I find it a very social drug, and not near as addicting as amphetamines or methamphetamines, now having tried both. The social stigma is false; this is just a drug that, when treated with respect, will treat you with respect as well. It is not something to indulge in often due to its pricy nature, but is still an occasional delicacy.</p>",
 "year": "2007",
 "id": "69213",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-04-13T07:00:00.000Z",
 "views": "10641",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
