{
 "id": 6928,
 "title": "Inverted Brain Octopus",
 "date": {
  "submission": "2001-02-04T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "william d.",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  }
 ],
 "report": [
  "bold and sassy, this drug tap danced on my brain.",
  "last year at this time, my friends and i decided to take 'the plunge' with acid. i had smoked a considerable amount of weed by this time, and was very familiar with the effects of a 'high,' but many people glamorized this 'tripping' thing.",
  "i had a few offers to try it earlier, but in fear of losing my mind, i declined each time. also, i thought LSD was something similar to heroin, or coke or something, and all throughout elementary school and junior high i was told of the horrors of LSD and how it 'fries' your brain.",
  "eventually, i'd grown up and formed my own views, after indulging in several episodes of weed smoking. i got to college, and one lazy, boring, pot smoking night, a little spanish girl named natalie came to my dorm to ask my roommate if he wanted to buy acid. well, as it was, i had just gotten a considerable amount of money, and was keen to try something new and exciting.",
  "about 4 friends and i decided that we would all trip together, and go to a local 'hoppin' party. sounded good.",
  "so, natalie takes a pair of tweezers, and singles out two tiny yellow things from a pencil case, and places them in the palm of my hand. 'what the hell is this?' i asked. 'that's the acid, now where's my fourteen bucks?' i was very surprised at how small the hits were, but i'd never seen acid before, and had nothing to compare it to.",
  "my friends and i dropped the acid, then rushed to the store for orange juice, which makes you trip harder, or so they say.",
  "about 15 minutes later, after asking about a million times 'when will this kick in?', i had intense chills, very tickly, followed by intense episodes of laughter, which my friends got annoyed with, and tried putting their hands over my mouth saying, 'c'mon, keep your composure, what's the matter with you?!'",
  "i'd say that was the funnest part of the trip.",
  "then everything got really bright, and visually pulsating. out of nowhere, there were all of these visuals. i guess i noticed when i tried to focus on something, and saw how lucidly clear, yet backwards it was. when i would put my hand on something, it felt like it was moving. and everything just seemed very wavy. the mindset that went with it was very silly, like being 5 years old in a candy store, a tim burton-esque candy store.",
  "when i got back to the dorms, i found that my room looked like a disaster area. everything seemed so scattered, so i did the first thing i could think of...eat gummy bears. the gummy bears seemed all weird too, and i imagined that they were pissed at me for eating them, so i stopped.",
  "my friend kirk, who was very silly at this point, had caught himself up in the blinds on the window, and swore he was being attacked by an octopus. i vigorously tried to save him with an umbrella, and we pretended to be on a hollywood high-seas adventure, playing around like a bunch of children. it was lots of fun.",
  "after the peak, we decided to sit and play playstation in the dark. the characters in tekken seemed to speak in tongues, translated to:  satan is going to come over with girl scout cookies, and pulverized us with one punch.",
  "we laughed and laughed for hours, as we tried to decipher the spanish channel. the sounds of foreign languages sounded hilarious! but then again, so did everything.",
  "as we came further down, we were very chill and complacent with everything around us, still thinking silly stuff, and still having visual distortions.",
  "sleep was not even a remote possibility. it seemed like bugs were crawling all over me when i tried to lie still under the blankets.",
  "my friends claimed to have been still getting visuals when they went to sleep, and they had no problems actually falling asleep. but i was antsy as hell for about 6 more hours.",
  "all in all, LSD was very fun, and something i would do again. it seems as though it discombobulates your mind, and puts it together at random throughout a trip, and if you have a fucked up mind, this may not be for you!!",
  "i've also heard that for some people DXM is stronger or equal to LSD. it's not as strong, or as visually interesting and spacy as LSD, at least not in my opinion.",
  "LSD was also my gateway drug to MDMA and mescaline, which led to some difficulty, so just be careful, okay, don't get wrapped up in tripping, it can be very costly."
 ],
 "erowid": {
  "id": "4026",
  "citation": " william d.. \"Inverted Brain Octopus: experience with LSD (ID 4026)\". Erowid.org. Feb 4, 2001. erowid.org/exp/4026",
  "substance": "LSD",
  "views": "10246"
 }
}
