{
 "title": "Changed My Thoughts Forever",
 "author": "Daniel",
 "citation": " Daniel. \"Changed My Thoughts Forever: experience with LSD (ID 6935)\". Erowid.org. Jun 1, 2002. erowid.org/exp/6935",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "4.5 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "report": "<p>   I had always heard people say that LSD often times leads to life changing experiences or profound prophecies, but I never believed them.  I was one of those 'hey dude lets take acid for some cool visuals' kind of tripper.  I would take as many hits as I was dared to just because I thought I was the king of LSD.  All of this changed, however, when I had a true LSD experience.</p><p>   I was thrilled when my girlfriend came home with a vial one Tuesday.  Even though I had classes the next day I was eager to try out the new stuff.  I took pride in the fact that I was always the guinea pig, for the first trip out of the vial was always free.  After she distributed all of the liquid onto sweet tarts, I took 4 of them plus the extra half hit that was in the vile.  My friend who had never tripped before took two hits, and we waited like we were little boys eager to find the toy in our Happy Meals.  I told him him not to ever panic, that it was only a drug.  Irony, however, would bite me on the ass in the end.</p><p>   The first four hours of the trip were very normal.  When it kicked in, I turned on some Aphrodite and danced to satisfy my increasing energy.  The visuals kicked in very soon and I took my friend to the woods for a hike.  I knew this was some good stuff and my journey had officially begun.  We had a lot of fun and upon returning 5 hours later I was drained (I was still tripping very hard at this point).  This is where the unexplainable happens.</p><p>   For some reason, before we even stepped foot into the apartment, I wanted to see my girlfriend really bad.  I felt a strong emotional attachment like I had never felt before.  It was like I loved her more than ever.  When I finally got inside she was off to bed (she didn't trip) and I followed her even though I was still very much out of it.  When I got into bed and shut the lights out, my life would forever be changed.</p><p>   I immediately had an out of body experience.  It was as though I was dead and I was watching myself screw up in life through these unusual 'scenes'.  I literally saw myself partying and failing out of school.  I also saw myself not paying much attention to my girlfriend which would lead to a break up.  I saw myself taking the wrong paths but I couldn't tell myself I was taking it.  I screamed and yelled, but 'he' kept on going anyway.  All at once I realized that I was 'he', and that I did have control of my life.  I came to a realization that these prophecies could come true if I didn't change.</p><p>  I got out of bed to go and talk with my friend to see if anything unordinary had happened to him.  Right when I got to his place, however, I suddenly became fearful.  I couldn't say an intelligent sentence if my life depended in on it.  I felt as though I was on the brink of insanity.  Had I taken too many drugs and now my brain was fucked up?  Was it too late to change my life for the better?  Was I doomed?  Ironically, my rookie friend talked me out of my fears.  Acid had put me in my place.  'It' grabbed my ego from deep within my soul and threw it away forever.  I realized I never had control of acid, rather it had control of me.</p><p>   Although some would say I had a 'bad trip', I look at it as the best trip of my life.  My GPA drastically improved in one semester and my girlfriend and I are happier than ever.  I also realized LSD probably isn't good to do every week, but doing it every once in a while is good to gain some insight into your life.  You just have to be open to what you learn.</p>",
 "year": "2001",
 "id": "6935",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-06-01T07:00:00.000Z",
 "views": "15206",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "4.5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ]
}
