{
 "id": 6937,
 "title": "Am I in a Dream? Whoa, I Am in a Dream",
 "date": {
  "submission": "2007-01-12T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Jake",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 cups",
   "administration": "oral",
   "substance": "Kava",
   "form": "tea"
  },
  {
   "time": "1:00",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  },
  {
   "time": "1:15",
   "amount": "2 cups",
   "administration": "oral",
   "substance": "Kava",
   "form": "tea"
  },
  {
   "time": "1:45",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Kava",
   "form": "tea"
  },
  {
   "time": "0:00",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0:00",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Kava",
   "form": "tea"
  },
  {
   "time": "0:00",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Kava",
   "form": "tea"
  }
 ],
 "report": [
  "I was in my local supermarket and was walking through the tea section when something caught my eye. One box was labeled 'Kava Tea'. Remembering reading about kava kava, I baught the box and returned home. each teabag contained 78mg of kava root extract, so I decided to drink 2 bags worth and see how I was feeling.",
  "About an hour after drinking the two cups, I felt very relaxed. I decided I wanted to go further though, so I made 2 more cups. While the tea bags were soaking in the hot water, I took a shot of vodka. I felt the affects immediately, and just had to sit down. Then I chugged each cup of kava tea. Half an hour later I was sitting on my sofa loving everything around me.",
  "I was having affects similar to marijuana. I was so relaxed at this point that I decided it would be a good time to meditate. Before meditating though, I helped myself to one more hot cup of kava tea, which I drank slowly. The meditation was amazing, I had several out of body experiences, and was at total peace with everything around me.",
  "When I was done meditating I had a beer, and then chugged another cup of kava tea. Lying in my bed before going to sleep, I slowly sipped my last cup of kava tea as I listened to relaxing music. Then I lay down and fell asleep immediately. In my dream I remmeber thinking to myself: 'Am I in a dream? Whoa, I am in a dream.'",
  "I had alot of fun in this dream of mine because I could control my every action, and even the actions of those around me. It was like playing god. I went on adventures, took huge risks knowing that I wouldn't die, and just had lots of fun. It was like I had rented an immortal god's body for one night. Truly an amazing exerience.",
  "The next morning when I awoke, I was the most refreshed and relaxed I have ever been. I just lay on my bed for a while, in a peaceful state of mind. I highly recomend kava tea, it was very enjoyable and relaxing.  I will definately do kava again, but I'm going to wait at least a month so I can appreciate it as much as I did last night."
 ],
 "erowid": {
  "id": "40332",
  "citation": " The Jake. \"Am I in a Dream? Whoa, I Am in a Dream: experience with Kava & Alcohol (ID 40332)\". Erowid.org. Jan 12, 2007. erowid.org/exp/40332",
  "substance": "Kava & Alcohol",
  "views": "36451"
 }
}
