{
 "title": "Turned Up the Color Knob",
 "author": "Tropein",
 "citation": " Tropein. \"Turned Up the Color Knob: experience with Aniracetam & Supplements (ID 69387)\". Erowid.org. Jul 10, 2010. erowid.org/exp/69387",
 "substance": "Aniracetam & Supplements",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1500 mg",
   "oral",
   "Aniracetam"
  ]
 ],
 "report": "<p>I have tried Aniracetam many different occasions, and mostly have noticed its anxiolytic effects, as well as other similarities to Piracetam.  I have been out of Aniracetam for a few weeks, and so today I decided to go down to the vitamin store nearby and grab some more to experiment with.</p><p>I have had a decent night's sleep, and started my morning with 400mg SAMe, 351mg DMAE, 500mg N-Acetyl-Carnitine, and a really good homemade cappuccino.  3pm 1500mg Aniracetam was washed down with a bottle of kombucha.  I wanted to use it on as empty of a stomach as possible, and I figured that the acidic nature of the kombucha would help me break it down.</p><p>It's about an hour later now, just after 4pm.  Certain colors grab my attention unlike before an hour ago.  Blues in particular seem to hog my visual attention, as do somewhat reds, oranges, yellows.  It's as if someone turned up the color saturation knob in my visual processing a slight, but noticeable amount.  I am very aware of a shift in my mental state, primarily in two areas.  I notice that thoughts feel more fluid than normal.  I also notice a certain quality of quietness in my mental/emotional state, much like the state one might achieve during a sitting or 'meditation.'  It's interesting, I find, how these two shifts may be dependent on each other as well, for maybe I often react to my own inner dialog more I realize. </p><p>Aniracetam is interesting.  In 45 minutes now, I'll be starting my shift for the night as a bartender at a fairly upscale restaurant, along with my normal work night dose of 10mg amphetamine salts (prescribed).  The result should be even more interesting.</p>",
 "year": "2008",
 "id": "69387",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-07-10T07:00:00.000Z",
 "views": "13863"
}
