{
 "id": 6940,
 "title": "Sexual Side Effects of Anti-Depressants",
 "date": {
  "submission": "2006-07-28T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Seraph",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  }
 ],
 "report": [
  "A few years back I used to take Effexor XR (Venlafaxine) as an anti-depressant (250mg/day).  Unfortunately I wasn't fully warned of the side effects, my entire body and senses would feel dulled, not to mention certain sensitive areas not really being so sensitive anymore.  My theory is that the stuff just makes me feel nothing, not necessarily good or bad.  Eventually I had to stop taking the pill everyday because I would rather learn to deal with my depression than face a world on a dimmer switch at half setting.",
  "Recently I actually decided that I might be interested in giving a different type of anti-depressant a shot.  In the side effects descriptions of the anti-depressants, they all mention sexual side effects.  So instead I decided the best way to find out the truth is to hear it from the actual users.  I noticed people with similar problems as mine having no problems with Wellbutrin (Bupropion).  Not only that but Bupropion is also marketed as a stop smoking aid (Zyban) and I was currently in the struggle of quitting. ",
  "I marched down to my doctors office and picked myself up a prescription of Zyban, same stuff as Wellbutrin.  The interesting part about it is that, yes, there are still sexual side effects, but those include heightened libido, pleasure, and the ability to have multiple orgasms now.  I also have my insomnia cured for the most part, something I never thought would happen.  I am no longer a slave to cigarettes, I still smoke them on occasion but purely for pleasure and not out of addiction like before.  But best of all I feel happier.",
  "I'd like to mention a few other strange side effects.  I seem to have a dramatically reduced tolerance to drugs, one puff off a joint will get me high now.  I used to be able to take 4-6 gravols to put me to sleep before, last time I took one gravol to put myself to sleep I was with my girlfriend.  I woke her up in the middle of the night to inform her that my hand was cut and bleeding, but upon further inspection by my girlfriend there was nothing there, and no trace of it in the morning, which would be typical if I were eating 8 gravol, but I only had one.  I'm also getting more frequent dreams.  Instead of 3 dreams a night I get 6 now, and they are much more vivid and lucid.  Best of all I can wake up in the morning with ease, and feel well energized throughout the day.",
  "All the positive effects are definitely worth the trade off for the negative ones, which include:  Headaches (once a week usually), occasional inability to focus, and restlessness.  All in all I'm a satisfied customer.  To people who have quit an anti-depressant because of sexual side effects (I have a few friends who have) I would suggest giving Wellbutrin a try.  I'm glad I did."
 ],
 "erowid": {
  "id": "40335",
  "citation": " Seraph. \"Sexual Side Effects of Anti-Depressants: experience with Bupropion (Zyban) (ID 40335)\". Erowid.org. Jul 28, 2006. erowid.org/exp/40335",
  "substance": "Bupropion (Zyban)",
  "views": "24096"
 }
}
