{
 "title": "Psychedelic Jitters",
 "author": "The Saint",
 "citation": " The Saint. \"Psychedelic Jitters: experience with 2C-T-2 (ID 69477)\". Erowid.org. Mar 5, 2008. erowid.org/exp/69477",
 "substance": "2C-T-2",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "oral",
  "2C-T-2",
  "(powder / crystals)"
 ],
 "report": "<p>I am a healthy 24-year-old male, and started exploring psychedelics about a year ago. The following account describes my first experience with 2C-T-2, which took place two days ago. This account was reconstructed using a combination of a log from a chat room, a few notes on paper, and memory. I measured my blood pressure and temperature several times during the experiment. I had been taking a break from psychedelic experiments for a few months due to a bad AMT experience. In fact, I believe I may have had some subconscious guilt because I had promised myself and others that I would not use any drugs for at least a year.</p><p>6:23 pm: Vitals: blood pressure 118/82, pulse 74, temperature 98.9 degrees Fahrenheit (rectal)</p><p>6:56 pm: Swallowed a gelcap containing 10mg 2C-T-2</p><p>7:41 pm: First feelings of something out of the ordinary</p><p>8:08 pm: Feeling 'fuzzy' and getting chills. I see ripples moving across the carpet. Temperature: 98.6 degrees Fahrenheit (rectal)</p><p>8:15 pm: I begin shivering, which comes and goes throughout the experience. 'Im starting to notice patterns in the carpet now, lights seem to persist longer after closing my eyes than I would expect. A bit of an ache in the back of my head, but not too bad.'</p><p>8:23 pm: Listening to some music, I notice underlying melodies that I had not noticed before. 'Distances seem to be greater than usual.'</p><p>8:27 pm: 'I'm seeing distortions in the ceiling, like it's bunching together.'</p><p>8:33 pm: 'I'm seeing rainbows in my peripheral vision' Temperature: 99.0 degrees Fahrenheit (rectal)</p><p>8:45 pm (approximate): I am startled when music I am listening to suddenly seems to start skipping. In fact, it had simply reached a repetitious part of the melody. The volume of the music seems to suddenly increase and decrease.  At times I seem to hear it crystal clear, at other times it sounds as though it's coming from inside a cave.</p><p>8:47 pm: 'Now I'm starting to remember how this feels and why I liked it'</p><p>8:48 pm: 'I was talking about a higher dose experiment tomorrow, but now I'm not sure I will. [...] I dunno, it just occurs to me that I'm poisoning myself. I guess I should just respect my body more.'</p><p>8:50 pm: Blood pressure: 136/88 pulse: 100</p><p>9:11 pm: 'I'm seeing some faint rainbows if I close my eyes for a while'</p><p>9:19 pm: Window Media Player, the program Im using to listen to music on my computer, generates some animated abstract graphics when playing music. If I close my eyes while watching these graphics, I can faintly see them continue.</p><p>9:28 pm: Blood pressure: 145/104 Pulse: 103</p><p>9:41 pm: 'Very jittery again'</p><p>9:50 pm: Blood pressure: 144/100 Pulse: 110</p><p>9:56 pm: I feel achy. 'It seems like most of the good feelings didn't stay.'</p><p>10:01 pm: 'I feel like I've isolated myself so much.'</p><p>10:10 pm: Blood pressure: 134/97 Pulse: 112</p><p>10:15 pm: 'I've gone through almost a liter of Gatorade. I'm pretty thirsty.' I had also had about 600 mL of water.</p><p>10:21 pm: 'I had romantic notions of being a psychonaut, doesn't seem to be so romantic at this point.'</p><p>10:22 pm: 'I'm seeing little green lights in the carpet. I can still see the lights if I move my head away, but when facing the carpet, they snap to certain regular points in the pattern.'</p><p>10:29 pm: Temperature: 100.5 degrees Fahrenheit (rectal)</p><p>10:34 pm: Blood pressure: 141/103 Pulse: 106</p><p>10:44 pm: 'Problems with motor control are frustrating me.'</p><p>10:45 pm (approximate): Turned on the television and started watching a satirical news program. I find it very funny, and wish I had been watching it from the beginning. The sound sometimes seems to echo. At the time I wondered if I was noticing an artifact of my television's cheap speakers.</p><p>11:09 pm: 'My jitters seem to be gone.' Blood pressure: 139/97 Pulse: 97</p><p>11:35 pm: Blood pressure: 128/97 Pulse: 92</p><p>11:38 pm: 'I'm coming down.'</p><p>12:08 am: Blood pressure: 129/88 Pulse: 97</p><p>12:56 am: Blood pressure: 128/90 Pulse: 86</p><p>1:20 am: Went to bed. I had no problems sleeping.</p><p>I did not find this experiment to be particularly rewarding, but maybe with a better set and setting, the benefits might have outweighed the unpleasant side effects. I might try another experiment with this chemical, but not any time soon.</p>",
 "year": "2008",
 "id": "69477",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-03-05T08:00:00.000Z",
 "views": "7266",
 "dose": {}
}
