{
 "title": "The World within Me",
 "author": "Vee",
 "citation": " Vee. \"The World within Me: experience with DOC (ID 69522)\". Erowid.org. Jun 3, 2009. erowid.org/exp/69522",
 "substance": "DOC",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "4.0 mg",
  "insufflated",
  "DOC",
  "(powder / crystals)"
 ],
 "report": "<p>Tripping has always been by far my most pleasurable past time. Expanding one's mind and being a visual person myself--tripping is a feast for my eyes. DOC was all that and more.</p><p>It was about 5:30pm when this new drug fell into our laps. It was being offered for free and after doing some research decided-- who wouldn't want to trip? My friend took his first snorting a small 4mg line up his nose, taking a step back, and waiting. I followed immediately after accidentally exhaling and having to take my 4mg in two seperate snorts. The burn was that of an intense coke burn, but it soon spread and took effect.</p><p>Not even moments after I took my lines, my friend threw up in the trash can. I started to look around and everything had already started changing, and drastically. I found myself running to the bathroom and puking as well, being overwhelmed by the strong and immediate effect. No onset.</p><p>I could barely collect my mind, and that's where the entire trip began. Without the onset all I could immediately think was about the time I tried Salvia, tripping hard for a few moments and than nothing. I would only discover my friends, one nasal and one oral, having stole his fathers car and yelling for the next 5 hours, 'STILL PEAKING, STILLLL PEAKING!' and laughing hysterically because by this time our visuals had been strong for the past 10 hours.</p><p>My mind wasn't were it should have been for this trip, and that's what really tripped me out. Having a lot of turmoil in one's life and taking a 24 hour drug isn't always the best idea. I sorted through all of it in more depth than ever before. At one point I was repeating myself over and over again in the passenger seat of my car as my best friend drove me around so I could 'think about it' and this was about 6 hours into the trip. After that I sat for 4 hours with my tripping friends and thought and laughed about it. Then I laid in my room for 8 hours, still trying to think about it, and then went out with some friends, only still just thinking about it.  The entire trip I was just trying to think. I felt as though I had lost my mind, but only because I had completely found it.</p><p>The night was very internal, especially for the first 4-5 hours. I could barely speak and when I did it was sometimes hard to process my thoughts exactly how I wanted them. I was so worried about turmoil amongst my large group of friends that I just kept trying to gather them all night. I ended up calling them my dragon balls and spent all night trying to keep track of them. I made a million conclusions in one night about myself and others. Everything just kept coming full circle, everything made a connection in my mind. It was just hard to realize that for the first 15 hours or so.</p><p>Visually, the trip was out of this world. Geometrical patterns crept their way into my eyes even 20 hours after ingestion. I watched my friends faces morph all night, one of which shrunk away, looking like a starving child. I saw a lot of things that would have scared me, but even in my beginning I knew what I was seeing. I talked to magazine covers and a ceramic fish and of course my dog, a pug, named Frank. I busted him out on being an alien, and the sad thing is I still kind of think he is.</p><p>Oh, DOC. It's nice to have my brain back. Just as I had left it-- crazy.</p>",
 "year": "2007",
 "id": "69522",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-06-03T07:00:00.000Z",
 "views": "5210",
 "dose": {}
}
