{
 "id": 6953,
 "title": "Amazing to Horrifying",
 "date": {
  "submission": "2008-04-30T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Wiggles",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  }
 ],
 "report": [
  "Overall I would have to say that the following trip was a good experience. Maybe not necessarily fun the entire time, but enlightening and instructive.",
  "Anyway, I bought an eighth of shrooms from a co-worker of mine and decided to trip that night.  I learned later was that these were extremely powerful mushrooms; much more so than any I had previously experienced, but I ate the whole eighth anyway.  Ok, so I chopped up the eighth and ate it with some bread and jelly. As I sat alone in a friend's apartment, I noticed that some of the stucco on the walls was beginning to move and drip. This was the first indication that these were not normal shrooms. These open-eye visuals began only 30 minutes after ingestion, which I took note of but it didn't really bother me. Normally I don't see things till about ninety minutes in.",
  "After a little while, my friends came back and I was starting to really leave the planet.  I moved while I was still mildly coherent into another room and turned on some music.  For probably an hour and a half, I sat by myself in a room absolutely dissolved in the enormity of the experience.  The open eye hallucinations were a lot of a powerful 'pulsing' sight, and bright patterns on the walls that I could only describe as 'Mayan' in appearance.  When my eyes were closed I was rapt in a world of swirling globes and I felt as if I was diving under the earth, but that the profoundly odd image of music itself was guiding me on the way.  The most distinct memory I have of this stage was noticing that my mouth was wide open the entire time, and I felt a deep sense of awe.  It felt like all the stars and nebulae had lowered to around ten feet above my head and I was permitted to view them close up.  Very cool.",
  "While still on the other side of reality, and one hundred percent insane, I watched some TV.  I felt like I was swirling in warm oil, very comfortable and womb-like.  Most of my friends were in another room again.  This was probably somewhere around the two and a half hour mark. I had no sense of time and I had no idea how long I had been alone. I got the idea that my buddies were avoiding me. I began to feel uncomfortable. The anxiety kicked in full when I thought I heard someone say, 'He's tripping too hard'.  I thought I was in trouble, and I sensed loss of control.  I needed a sitter, or someone to talk me down, but my friends were not having a good night themselves and they were not in the mood to deal with me.  The trip changed gears on me instantaneously.  I had felt mostly good, and now, suddenly, I felt quite bad. powerful anxiety and nausea  quickly came over me. I knew I was getting the Fear. I ran to the bathroom and vomited, and I felt a little better, more relaxed.",
  "While recovering after vomiting, the fear came harder.  I opened my eyes and realized I was floating in blood.  I saw the toilet and it looked massive and it towered over me.  a fountain of blood erupted from the bowl and poured over head.  I wanted to cry, but the vision passed relatively quickly.  I was still extremely uncomfortable, but I was conscious and at least aware of what was going on at this point. I got a friend to drive me home, which was intense in itself.  I was coming down but I was far from back to normal.",
  "To make a long story short, I spent the rest of the night whimpering under my sheets and pleading with god to make it stop while the enormity of numbers and time itself threatened to crush me like a roach.  The trip was good at first, but I overstepped my bounds and went too far."
 ],
 "erowid": {
  "id": "40379",
  "citation": " Wiggles. \"Amazing to Horrifying: experience with Mushrooms - P. Cubensis (ID 40379)\". Erowid.org. Apr 30, 2008. erowid.org/exp/40379",
  "substance": "Mushrooms - P. Cubensis",
  "views": "2764"
 }
}
