{
 "title": "Two Days in the Hospital",
 "author": "sputnik",
 "citation": " sputnik. \"Two Days in the Hospital: experience with Caffeine & Sertraline (Zoloft) (ID 69531)\". Erowid.org. Apr 18, 2008. erowid.org/exp/69531",
 "substance": "Caffeine & Sertraline (Zoloft)",
 "bodyweight": "125 lb",
 "report": "<p>So I was bored one night, and was out of weed, so I decided to try something new. I was just going to go for something at the store, and I already tried DXM and had a pretty bad trip, so I wasn't going to go that route. I decided on a box of caffeine pills to see how that would be for a change.</p><p>I first took 4 of the 200 mg pills with little effect, so I decided to finish off the pack with the last four. About half an hour later I started to feel really bad, so I tried to make myself vomit up what I had taken. I ate right before this, so I had a hard time puking it up. Tried drinking a few cups of water to help it come out, nothing.</p><p>I don't remember puking much, but I got a little out of me eventually. This is where the bad part came into play. I guess I was near the front door at one point, and I had a seizure. I remember my mom coming in the door, and I guess I woke up then. Boy did I feel terrible. I couldn't talk right, see right, and barely could walk. I stumbled my way to the toilet and puked my guts out. I guess my mom knew something was wrong and called 911 while I was in the bathroom.</p><p>The next thing I knew the EMS crew was in my house and led me to the awaiting ambulance. I was still out of it, and the EMS asked for my name and birthday, and I couldn't even remember what it was. I got to the hospital about 11:30 PM where they put me in a room at the ER, and my parents arrived shortly after. I came to a bit then, and was still throwing up.</p><p>I guess I had another seizure sometime while in that room because I woke up some hours later with an IV in me and was in a new room. I spent the next 2 days in observation. I was sore all over from my muscles tightening up on me, but they wouldn't give me any pain pills because they knew of my abusing of the pills.</p><p>I know now, that Zoloft and caffeine do not mix, and can cause these seizures. Now I have to wait 6 months to be able to drive again due to state law.</p><p>Be careful, be safe, don't abuse pills.</p>",
 "year": "2007",
 "id": "69531",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-04-18T07:00:00.000Z",
 "views": "22220",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": "1600 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 }
}
