{
 "title": "Way Worse Than Drunk Dialing",
 "author": "Anonymous ",
 "citation": " Anonymous . \"Way Worse Than Drunk Dialing: experience with Clonazepam (Klonopin) & Alcohol (ID 69540)\". Erowid.org. Oct 24, 2009. erowid.org/exp/69540",
 "substance": "Clonazepam (Klonopin) & Alcohol",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  "3 mg",
  "oral",
  "Pharms - Clonazepam",
  "(pill / tablet)",
  "",
  "8 shots",
  "oral",
  "Alcohol - Hard",
  "(liquid)"
 ],
 "report": "<p>This experience lasted about a month long. I acquired the pills (a lot of them) from a friend who had found them. I wasnt sure what they were so I looked them up and it didnt sound too bad so I figured what the hell? I took two. Felt great! Took some more. Felt better! Woke up the next morning and didnt remember a thing. I did the same thing for about a month every night. Then I started to mix alcohol with them. By the time I was doing that Im pretty sure I was addicted.</p><p>One night I took about six. Im not all that sure what the dosage of them was. They looked exactly like the ones in the pictures in this vault. Anyway I took about six and polished off about half a bottle of tequila. I played guitar for a while then BAM! Thats all I remember. I woke up the next morning and there was a knife next to my bed and my arms and body were bloody as hell and cut to shit. I apparently tried to kill my self that night. I swear I cant remember a thing.</p><p>Apparently I called my ex-girl friend to tell her I loved her and the next day when I told her about the experience she said I called her at three in the morning crying and carrying on about this and that and I freaked the shit out of her. I dont remember doing that. I flushed the remainder of the pills down the toilet that day and went though what I considered mild withdrawals that night at work. I was sweaty, irritable, nauseous, and such. Kind of like if I am just about to get the flu or something.</p>",
 "year": "2008",
 "id": "69540",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-10-24T07:00:00.000Z",
 "views": "18391",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "8 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 }
}
