{
 "title": "Opium Dreams?",
 "author": "Pinktinker",
 "citation": " Pinktinker. \"Opium Dreams?: experience with DPT (ID 69590)\". Erowid.org. Apr 27, 2010. erowid.org/exp/69590",
 "substance": "DPT",
 "bodyweight": "200 lb",
 "report": "<p>My partner and I are very experienced in the exploration of psychoactive substances; we learn all we can about the substance we intend to take (by reading other's experiences) and carefully consider whether we are prepared to experiment with the substance in question.  In the case of DPT, we read about many very intense experiences, and were somewhat hesitant to try it for a while.</p><p>When we finally did, we took 0.5 mg clonazepam to ward off any possible anxiety at about 8pm.  At 10pm, after making sure our home was clean and comfortable, we each insuflated 25mg of DPT.  It did not burn, but the post-nasal drip was pretty bad tasting.  I sucked on a piece of hard candy to rid my mouth of the taste.</p><p>We lay down on the bed together, and quietly waited for the effects of the drug.  At about 10:20, we could definitely feel the effects, though mild.  Just the 'come on' of something pleasant.  We remained in bed, each of us making an observation of how we were feeling intermittently.</p><p>Pleasant, dreamy thoughts were washing in and out of my consciousness.  At all times, I was aware of my surroundings, and felt that I could halt the trip if the occasion called for it.  For the most part, I just lay quietly, enjoying the opium-like dreams that I was experiencing.</p><p>At 10:50pm, when we realized that we were probably at the peak of the experience, we decided to take another 25mg each.  Because I did not feel good about the post-nasal drip all over again, we took the dose in a suppository.</p><p>After the supplement, we did not get a stronger effect, in fact it seemed to ebb a bit, but we continued to enjoy our dreamy trip until about 11:30pm, when we got up, agreed that we really enjoyed the mellow, peaceful, dreaminess of the trip, made a smoothie,and watched a movie.  By the time we went to sleep, about 1:30, we were back to baseline.  There was no hangover whatsoever, in fact, I felt a sort of glow for the next few days.</p><p>There are a few factors worth considering in looking back at my experience.  First of all, the benzodiazepines must have certainly had a part in the mellow-ness of our trip, even though they were of a very low dose as far as benzos are concerned.  Also, we were in possession of the DPT for about 4 years prior to using it, so it is possible that it could have degraded some.  And, of course, it was a fairly low dose to begin with.</p><p>I am certainly going to try this substance again, with the 50 mg all at once, and without the clonazepam, now that I feel comfortable with it.</p>",
 "year": "2008",
 "id": "69590",
 "gender": "Female",
 "timestamp": "2010-04-27T07:00:00.000Z",
 "views": "5257",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam"
  },
  {
   "time": "0",
   "amount": " T+ 2:00",
   "administration": "25 mg",
   "substance": "insufflated"
  },
  {
   "time": "DPT",
   "amount": "(powder / crystals)",
   "administration": " T+ 2:50",
   "substance": "25 mg"
  }
 ]
}
