{
 "title": "The Good and The Bad",
 "author": "miloauckerman",
 "citation": " miloauckerman. \"The Good and The Bad: experience with LSD (ID 6959)\". Erowid.org. Jun 28, 2002. erowid.org/exp/6959",
 "substance": "LSD",
 "bodyweight": "175 lb",
 "report": "<p>I tried LSD for the first time this past Friday/Sat - overall, I would say it was a 'bad trip' - I wasn't prepared for what it could do. And was stupid enough to take three hits total - one, then two more at +35-40 minuts, thinking it wasn't working well. At the same time, I saw some incredibly beautiful things once I stopped trying to control the trip. I was having mild visual hallucinations inside the apartment I was at, until we decided to take a trip to a center area with rocks and grass.</p><p>One of my friends started talking about slug trails on the rocks, which then made the stones look like giant slugs. This started to freak me out, until my mind took over and I realized why I saw them. But all of the sudden, I looked at my feet and saw things opening up on my skin - which freaked me out incredibly badly. I couldn't get away from that vision until I was safely back in the apartment - where I then began to see small heads coming off of all surfaces, and could even taste them crunching in my mouth when I swallowed water and orange juice. I was constantly scared with an incredibly high heart-rate until I talked with a sober friend, when I said 'maybe I should stop trying to fight the trip and let it happen' (or something along those lines). When he agreed, I did so, and immediately the heads I had been afraid of before became strands of criss-crossing thread filling the room side to side like a smoky haze, piling up little by little.  I was never in great fear of the 'bad' hallucinations - I knew it was in my mind, and once I stopped trying to make them go away, they did.</p><p>That was about 4 in the morning, and the threads became a constant whenever I wasn't concentrating on something else for the next 10 hours. If I sat with my head to the side, I could see the room slowly filling in front of my eyes, and once the room got to a certain point, the trip began to get much, much more hallucinatory, things dissolving into each other, and so on..  Throughout the night, we had watched the Matrix (actually, I watched about one scene over and over with small changes in scene and dialogue - this was during my freak out), the end of Election and then 'Say Anything.' While sitting in a chair waching the wall and ceiling, something odd started happening with Say Anything. The scenes started playing themselves backward, in my mind (I guess I had paid just enough attention to the first part to absorb it) - audio and visual. Very, very cool.</p><p>The next eight or so hours (4am to noon - the 'good' part of the trip) were great - I understood why people would take LSD (whereas earlier I was asking 'why in God's name did I do this to myself?'). I was seeing beautiful things (especially a friend's diploma), actually had some interesting conversations (with others and myself).</p><p>At noon, I got a call from my parents, and they needed me to come home to help with some stuff. They wouldn't be there until 3pm, so (after freaking out once again) I decided to go home, and try to fall asleep in the guest room (which still had my old bed and stuff). Better than telling them I was on acid (no more help on tuition...). I got dressed (when I took my button-up shirt off the coatrack I had hung it on and spun it around my shoulders, two moths/butterflies flew out and landed on the chair - absolutely incredible).</p><p>Driving (about a five-minute trek) was fairly easy - I wasn't tripping very hard, seeing only minor visuals (yes, I know this was dangerous and stupid). Their was no sense of proportion to my truck, though. It felt like I was driving a vehicle I had never driven before.</p><p>I popped a 5/500 hydrocodone and a Lodeine, hoping to knock myself out. I curled up under two sets of covers with the TV onto VH1, and proceeded to sleep off and on for the next five hours, until a Nicholas Cage movie drew my attention. I was, by this time, having only minor visuals. Rather than deal with the 'rents in a 'cracked out' state, I feigned illness and stayed in bed all day. I then slept off and on until eight o' clock this morning and am feeling great.</p><p>Overall, with the two freakouts and a general sense for quite some time of 'when's this going to stop' - I characterize it as a bad trip. But at the same time, I have an overwhelming desire to try a smaller dose with less-violent movies (no Matrix!) and good music (we had no music at all).  I understand the great things LSD can do now and am prepared for them.</p>",
 "year": "2001",
 "id": "6959",
 "gender": "Male",
 "timestamp": "2002-06-28T07:00:00.000Z",
 "views": "9848",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 0:35",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
