{
 "id": 696,
 "title": "I Fought the Death of My Ego",
 "date": {
  "submission": "2003-04-23T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Charles W.",
  "gender": "Male",
  "weight": 109
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "Saturday, early afternoon",
  "My friend arrived with the Salvia Divinorum at about one in the afternoon, a little earlier than I had expected.  I had decided to approach this experience as a spiritual journey and was finishing sweeping and vacuuming my studio apartment so that the Salvia entity wouldnt be hampered by old dust and clutter.",
  "Im a pagan spiritually and have a permanent altar set up in my living space.  I opened the gates of the pentagram and asked the Ancient Ones to show me what I most needed to learn during my shamanistic journey.",
  "After inserting a new screen into my pipe, I sat down on my futon sofa beside my friend.  He filled the pipes single hit bowl with finely ground Salvia leaf, which had been enhanced with Salvia extract.  As my friend explained it to me, this made it possible to experience the Salvia high without having to smoke a cereal bowl full of the natural leaf.",
  "I held the flame of my lighter just above the bowl and drew it down into the leafy material.  As I held the smoke in my lungs, I passed the pipe off to my friend and settled back into a comfortable position on the sofa.  About 5 seconds later, I had my first indication that I wasnt in Kansas anymore.  There directly in front of me, superimposed over my room, was a little white cottage with a freshly mowed front lawn, surrounded by a white picket fence, straight out of Disneyland!  A second or two later, my peripheral vision on both sides began to bend all the way up to form a tunnel, with the cottage still in front of me.  There it stayed for a few more seconds then came back down.  The cottage vanished and things returned to normal.  Well, not quite.  I felt light headed and my perceptions were still not right.  With some effort I found the will to speak and told my friend that the launch had evidently been aborted.  He suggested a second hit and I repeated the procedure.",
  "This time I hardly had time to pass the pipe to my friend when the cottage reappeared, again superimposed over the room, and the sides began to bend upward again.  By the time the tunnel had formed, the room had completely vanished, leaving me completely alone and disconnected from this world.  The walls of the tunnel began to twist at the far end, enveloping the cottage.  The twisting motion continued as it consumed the tunnel, coming straight toward me.  I felt very apprehensive, and felt myself sweating profusely, especially on the forehead.  I raised my hand and wiped the sweat from my brow.  The feeling of my hand against my skin was reassuring.  At least I still had a body, even though I couldnt see it.  I must have said something because I heard my friends voice off in the distance reminding me that my journey was supposed to be a short one and that I would soon return.  (Salvia journeys are said to last from twenty minutes to an hour, depending on the dosage and the sensitivity of the subject.)  I replied, as best as I was able, that I appreciated his reassurance, but the twisting motion was still approaching and my anxiety didnt subside.",
  "Soon the twisting was upon me and I physically felt the torque as my body twisted out of existence.  Then it was up to my head.  I saw everything turn upside down and felt my mind being turned inside out.  I knew that the physical world had being torn away from me and I was in mortal fear that I wasnt going to be allowed to return.  I was now in some kind of surreal environment, almost cartoon-like with bright primary colors.",
  "I felt a communication of some sort telling me, that not only was I disconnected from all that I had known before, but that the world I came from, my friends, my family, my previous life hadnt really existed, ever!  It felt like I had just woken up from a slumber, a warm cozy comfortable sleep, only to be told that what I had thought was real had been but a dream.  I felt like my friend had played a terrible trick on me.  If only I hadnt been so foolish and taken that horrible drug, I would still be with what was comfortable and familiar, instead of being trapped in this terrible cartoon reality.  With all the force I could muster, I rebelled against my new existence.  I couldnt, wouldnt, accept this!  Then, the grip that had held my mind vanished.",
  "The tunnel suddenly receded to its previous size and shape.  I felt relieved, but the twisting started again and advanced toward me, much more quickly this time.  It devoured my body again with the same physical sensations that I had felt before.  Again it swallowed my mind, turning it inside out, all the while telling me that my connections to the physical world were lost forever, and that this was my reality, now and forever more, and that it always had been.  Again I rebelled, literally fighting for my life, and again the tunnel receded, only to attack me for a third time.",
  "In the middle of my third battle with the twisting tunnel, it suddenly backed off and unfolded, revealing the cottage, with its freshly mowed lawn and picket fence, all superimposed over my room, my blessed room.  The cottage quickly evaporated and I was home again.",
  "---------------------------------------------------------------------------",
  "My evaluation of the experience is this.  I had asked the gods to show me what I needed to learn and I believe they responded.  My struggle with the twisting tunnel was a fight against death, the death of my ego.  My identity is evidently tied to this physical reality.  With its twisting and turning, the tunnel was trying to sever all the connections I have to this world, but my fear wouldnt allow me to surrender to such a death.  I have the feeling that, if I can, my experiences with this amazing drug will be much more positive.",
  "I plan to try."
 ],
 "erowid": {
  "id": "11753",
  "citation": " Charles W.. \"I Fought the Death of My Ego: experience with Salvia divinorum (extract) (ID 11753)\". Erowid.org. Apr 23, 2003. erowid.org/exp/11753",
  "substance": "Salvia divinorum (extract)",
  "views": "19282"
 }
}
