{
 "id": 6975,
 "title": "Getting Off GHB or It's Analogs",
 "date": {
  "submission": "2011-01-11T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Scott 416",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>I just wanted to write and tell my experience of getting off of 1-4 Butanediol.  Since 1999 I was doing GBL or 1-4BD pretty much every 1.5 hours!  A fact I'm not proud of.",
  "I didn't even get high on it anymore.  I just did it to 'maintain'.",
  "I was like an over-eater and the fridge.  Every 1.5 hours I'd just find myself in the kitchen at the sink where I kept it.  For the last 2 years I even needed it to sleep.  The max. amount of sleep I could get was 3 hours before waking up to do another.",
  "My Christmas gift to myself and my family was checking into a medical detox in December/2004.  Now I've withdrawled from this stuff before it was NOT pleasent.  However-- in detox the doctor loaded me up with phenobarbital.  Passed out for a good 15 hours or so and it was done.  I was litterally feeling much better by day 2 and barely experienced (or felt) any withdrawl symptoms!  I was actually hoping for a bad experience to teach me a lesson :-)",
  "If you're addicted to this crap I highly recomend the above.",
  "PS- I should note that before checking into detox I was systematically watering down my doses.  At first I watered it about 10% and over about a month worked my way up to 50%.  More to play tricks with my mind so in a way I felt I was still getting a 2.5mL dose but in reality only getting 1.25mL.",
  "After 2 months of being off of it... a 2.5mL dose still doesn't do much for me and it's going to take a couple more months until my sleep patterns return to normal.",
  "I hope this helps,",
  "S.</p>"
 ],
 "erowid": {
  "id": "40468",
  "citation": " Scott 416. \"Getting Off GHB or It's Analogs: experience with GHB & 1,4 Butanediol (ID 40468)\". Erowid.org. Jan 11, 2011. erowid.org/exp/40468",
  "substance": "GHB & 1,4 Butanediol",
  "views": "4940"
 }
}
