{
 "id": 6978,
 "title": "Allergic Reaction",
 "date": {
  "submission": "2007-05-31T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Davey",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "(ground / crushed)"
  },
  {
   "time": "4:30",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I snorted half a pill, Im sorry I dont know how many milligrams it was, at around 2pm.  The feeling was good, although nothing too intense.  However, between 6 and 7pm I smoked some pot.  Immediately I became very hot and had to step outside.  Sitting outside in the 15 degree temperature, still very warm, I began halucitating.  The visuals were very similar to a mushroom trip. ",
  "I then managed to climb up some stairs on my college campus. However, I fell down these stairs and lostcontrol over my body.  My mind was still present and I was aware I was falling.  I came to having fallen down half the set of stairs, only to black out again and fall down the rest. ",
  "I was more than pleased with what the drug had done to me, namely because of its intensity and I began to come down around 9 or 10 pm.  However, the next day, I woke up with a rash on the undersides of my arms.  The rash only increased in the coming days.  It appeared on my midsection and slowing migrated up my chest and neck.  I also had the rash on the palms of my hands and the soles of my feet.  Showering burned intensly.",
  "The rash was bad, but I also experienced serious respatory difficulty.  I couldnt walk up stairs without being seriously out of breath.  I would need to rest while standing in front of the refrigerator picking out something to eat.  Eating also was not something I was able to do for a very long time.",
  "More than a week later, with the rash still going strong and the respitory problems continuing, I ended up going to the doctor.  She told me I had an extraordinarily enlarged spleen, that I would need to be put on steroids and that I was lucky I didnt die from taking the morphine.  The steroids reduced the rash and breathing difficulty and got my appetite back.  Two weeks after taking the morphine, the rash was gone.",
  "Oddly enough, I had taken codeine and I have smoked lots of opium since that time and have experienced no side effects.  I have been told that I may have been alergic to whatever else was in the pill, however, all of the symptoms I displayed were similar to allergic reaction to morphine.  Be careful."
 ],
 "erowid": {
  "id": "40476",
  "citation": " Davey. \"Allergic Reaction: experience with Morphine (ID 40476)\". Erowid.org. May 31, 2007. erowid.org/exp/40476",
  "substance": "Morphine",
  "views": "13033"
 }
}
