{
 "title": "Don't Use Inhalants!",
 "author": "Glad2beAlive",
 "citation": " Glad2beAlive. \"Don't Use Inhalants!: experience with Inhalants (ID 69797)\". Erowid.org. Apr 3, 2012. erowid.org/exp/69797",
 "substance": "Inhalants",
 "bodyweight": "150 lb",
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>My experience with inhalants was absolutely dreadful. Not only was it scary, but it is a miracle I am not dead or a vegetable.  After heavily using drugs, I moved to another state and therefore lost all of my connections. Feeling depressed and with no drugs to use, I turned to inhalants. Anyway, enough with the background. Here is my experience, taking place over about two months.</p><p>Sitting around the house with nothing to do I came across a can of butane about the size of a can of spray paint. I used one of the attachments for filling a lighter to breathe the gas in taking straight butane, no oxygen. The experience was almost a relief at that point in time. Anything that would get me high was good at the time. Lightheadedness and an array of geometric colors began to show up.  There sounded like there was a sound similar to that of an industrial fan or something of that nature coming from the air vent. In addition to that, I felt almost paralyzed; as if I was in a trance.  Looking back, it was probably brain cells being fried. I continued to use for several days, and the experience slowly began to become something far more than I could have ever imagined.</p><p>Over the period of a couple days I began to feel almost as if I was in an alternate reality whenever I inhaled the butane.  It was like everything around me was exactly the way it should be.  I cant even explain it. Almost like looking at a picture of someones room in a magazine and not one thing was out of place (even though my room was a disaster). This feeling of an alternate reality seemed to go hand in hand with the euphoric feeling I was experiencing.  However, as my daily use continued I began to hallucinate whenever I used. It started off with small things. Sounds and small visual distortions such as red trails appearing in the air (Always red for some reason) doing spirals were most common at first.  Then, I started to become paranoid whenever I used.  The hallucinations seemed to adapt to that paranoia, greatly intensifying it.  This is where things got so messed up I can hardly describe it.  Not using text anyway. I will do the best I can.</p><p>As I continued to use, it started to seem like there was a dark shadow literally on the corner of my eyeball. A feeling of heaviness seemed occupy that spot as well. I started to feel like there was a demon or something out to get me.  As I continued to use, the feeling of a demon in my presence became more real.  I began to feel as if this shadow was going into my eye from that dark spot.  It felt wet, and like it was the hottest thing I have ever felt, only it didnt burn.  It truly was one of the most uncomfortable experiences of my life. As this feeling began to get worse and stronger, a feeling of impending doom came over me at the same time.  Like if I let this thing continue going into my eye I would die a horrible death, and worse feelings would continue long after.  In an attempt to eradicate that feeling, I began spinning in circles and whatever it was going into my eye began to recede.  I never inhaled butane after that.  However, being the dumbass I am, a few weeks later I used a different chemical.  Brake Cleaner. And at school of all places.</p><p>While using brake cleaner in an automotive class, I got the great idea to huff that.  I saturated some paper towels and pocketed them when no one was looking and after class was over I went into the bathroom to get high.  Holding the paper towels over my mouth and nose, I began to breath.  I went back out into the hallway feeling more fucked up than I had ever been on inhalants, and thats when the deepest, scariest hallucination I have ever experienced took place.  The hallway was about one hundred yards in length, and full of people.  Groups talking, people walking, and everyone just carrying on with whatever they were doing.  Suddenly, time froze.  Everything and everyone around me froze in place. Like someone had flipped a switch.  Someone in front of me was leaning forward to pick something up.  A person leaning on the wall was taking a drink of soda, and the bubbles were frozen in place. Scary music, sounded like something from a pipe organ, overwhelmed my ears as I tried to comprehend what had just happened. Darkness was slowly closing in from both ends of the hallway.  Then, I thought I figured it out.  I had died.  A girl I knew came out of this frozen state, meanwhile time still remained frozen.</p><p>Are you ok? She asked.</p><p>No, I just killed myself. Im dead! I replied.</p><p>What are you talking about? She asked.</p><p>Im dead! Dont you understand? I replied again.</p><p>Without warning, I began to lose my balance, and all at once everything around me unfroze.  As if it had never been frozen to begin with.  I felt more sober, and more alive than I have ever been in my entire life.  It was like I was dropped into hell, and just got pulled up into heaven.  I realized I was indeed not dead, I realized the exact magnitude of what I had been doing to myself, and just how lucky I was to be alive.  To this day I have never used another inhalant of any kind, and never will again.  I love life too much to risk death, and that is exactly what I was doing.  I was on top of the world after that, with a reformed outlook on life.  I hope this experience can shed some sort of light on the danger of inhalants, and how each use is the equivalent of Russian Roulette. Today I am normal, alive, dont have brain damage and count each day as a blessing.  Dont use inhalants.  No high in the WORLD is worth putting your life on the line.</p>",
 "year": "2005",
 "id": "69797",
 "gender": "Male",
 "timestamp": "2012-04-03T07:00:00.000Z",
 "views": "10905",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Inhalants"
  }
 ]
}
