{
 "id": 6989,
 "title": "On the Brink of a Vision",
 "date": {
  "submission": "2005-08-03T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "josh",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(tea)"
  }
 ],
 "report": [
  "In the middle the night, or early one morning, if you prefer, I was having a dream. in my dream I cannot remember the situation, but i began hearing a girl call my voice cheekishly. She called it over and over, then I was awakened to conciousness. I became aware of myself immidiatly (still hearning my name being called), but my eyes were not open. Then my vision began to blur into a static view, like a television. As this vision came in stronger my ears gained pressure. It was as if they would explode. The voice kept calling me. It got greater and greater and the vision seemed to have a face. Then, just when I thought I was about see something, or be told somthing, it all went away.",
  "This one event has confused,  scared and emotionally overwhelmed me. I was tearing, had goosebumps and felt entirely disconnected. Fright is all I felt. I dont know why I feel this. confusion is great. Was someone trying to tell me something, show me something? Were they a spirit? Could it have been someone meditating trying to contact me? When people are talking about you, theres a saying that your ears began to ring. My ears were booming. they felt like they would pop, like I was on a plane. Could the fact that my ears felt and heard a strong pressure have anything to do with the girl who was calling my name? I do not know. I'm truly at a loss of explanation. when I recall the event, my emotions give in, and I again feel the strange terror that I was exposed to. As scary as this is, I truly want it to happen again. Only hopefully in a way that will be more meaningful. Power and control over my body (ears eyes) is perhaps why I feel so frightened. If it happens again, I should be more comfortable with this odd over-riding of my senses. if, indeed thats what it was. It was so powerful to me, I had to get up and write about it. doing so has not just given me chilling flash backs of it, but has allowed me to gather myself. I can take this.",
  "Follow up: I just remembered the night before the night of the dream I had drank a wretched cup of tea brewed with dream herb (calea). The herb has been know to induce auditory hallucinations, and lucid dreaming. If this had any factor in what I experienced, why would the effects have been delayed? The night of the tea, I do not recall anything out of the ordinary. But today I did. I also did an 8 mile bike ride yesterday, so I was much more exhausted then the previous day. perhaps that could be a factor..."
 ],
 "erowid": {
  "id": "40540",
  "citation": " josh. \"On the Brink of a Vision: experience with Calea zacatechichi (ID 40540)\". Erowid.org. Aug 3, 2005. erowid.org/exp/40540",
  "substance": "Calea zacatechichi",
  "views": "4002"
 }
}
