{
 "title": "Letting My Inner Child Out to Play",
 "author": "OpenedEyes",
 "citation": " OpenedEyes. \"Letting My Inner Child Out to Play: experience with Morning Glory (Heavenly Blue) (ID 69908)\". Erowid.org. Oct 12, 2009. erowid.org/exp/69908",
 "substance": "Morning Glory (Heavenly Blue)",
 "bodyweight": "80 kg",
 "report": "<p>This was our first morning glory experience, and it was completely awesome!  I am a male in my early 30s and my friend is a male in his middle 50s.  We are both of average build, around 80 kg and 75 kg, respectively.  We are best friends and have taken many salvia journeys together over the past year.  My psychedelic experience is limited to salvia divinorum.  My friend had a lot of experience during the early 1970s with the classic psychedelics: LSD, mushrooms, and peyote.  We have both had extensive experience with alcohol and cannabis in the past, but rarely use either now.  The setting was perfect, a beautiful Saturday in spring at his house in the country.  Our mindset was upbeat, but a bit anxious because it was our first morning glory experience and because the preparation had been such an ordeal.  I will describe our experience first because it was so awesome, and then give details about the water/alcohol extraction that we used.</p><p>EXPERIENCE:</p><p>We took the first dosage of 133 seeds at 12:30 pm in the form of capsules, along with toast and orange juice.  By 1:30 pm our mood was elevated and we both agreed that 'something was happening'.  I had subtle visual tracers.  We agreed that if nothing dramatic happened by 2:00 pm, we would take a second dose.  At 2:00 pm things were still the same: very pleasant, but nothing too special.  I recall commenting that this could make an effective antidepressant.  We took our second dose of 133 seeds.  By 2:30 pm we were flying!  It was like being stoned out of my mind, but with less control over coordination, and a more lucid mind.  We could talk about serious things with logic and clarity.  We had very strong euphoria, giddiness, and uncontrollable giggles.  We didnt experience much body feel.</p><p>We were both very talkative, and our imaginations were very vivid.  Childhood memories kept popping into our minds.  They were so vivid that we didnt just remember them, we relived them.  This reliving gave us a whole new perspective on them.  It was like months of therapy compressed into an afternoon.  I think morning glory could have great therapeutic potential.  My friend had no visual disturbances.  When I closed my eyes, the sunlight coming through the window had a stroboscopic flicker.  I didn't have any hallucinations, but I would see things that sent my imagination running in an extremely vivid way.  The chair morphed into a cookie monster face with the cushion flapping like a big fat tongue as it started eating.  A knot in the table turned into a kitty cat face and she started 'meowing' at me.  Later when I took a shower, the drops of water turned into little goldfish that swam all over the shower door covering the glass completely.  The crease in my towel became a bald eagle, which squawked at me.  My inner child was running free.  Yes!  This is what being a child was like, I remember now!  I felt so free and curious.  The folds on my friends hands, and the contour of his face were fascinating.  I couldn't stop petting him (in an empathic way).  After a while we went outside.  The morning glory made being outside feel so good.  I noticed things about the grass and about the trees that I had never noticed before.  A neighborhood cat came over and almost revealed his secret identity.</p><p>The peak was broad and lasted from around 3:30 - 5:00 pm.  I would guess that taking two separate doses led to the extended peak.  After the peak, we had a serious munchie attack.  By around 7:00 pm we were mostly over the high of the drug.  We became very introspective and had very intense discussions about our childhood until about 10:00 pm.  At that time we were tired and plopped down to watch some TV to relax and decompress.  The whole trip felt pure and clean.  There was no vomiting.  During the trip we werent groggy or out-of-it.  We didnt feel any crazy energy or excitability.  The high was giddy but smooth and remarkably lucid.  It was like being a child again.</p><p>We both slept well that night and felt great the next day.  There was maybe even a little 'afterglow' the next day.  I came away with a strong sense that the 'truth' is much more animal and instinctual, and much less intellectual and factual, than I imagined.  It left me a little scared of the truth  it is so powerful that it will change life completely.  Learning the truth isnt like a school lesson, its more like being shot out of a canon.  I got a glimpse of how much power, curiosity, imagination, and love resides in me.  If I could access this reserve and let my inner child out to play everyday, life would be so radically different in the most positive way.  It would begin to transform not only me, but even the people around me.  People and relationships are more important than Ive realized.  Everything that I need is right in front of me, but I have been too insensitive to notice.  Everything that I need to know, I knew at age 7; now I just need to remember it.  Fear has held me back.  The fear is that when I let go, everything that has become comfortable and familiar, everything that society values so much, will vanish below my feet.  The new level of existence is so much better that I have to go for it.  Every moment is a new chance for me to go for it.</p><p>We had been unsure about using morning glory because of the uneven results in other experience reports and because of all the vomiting that had been reported.  The preparation method was successful in that we had no nausea.  My friend had a little indigestion, but not bad.  We both experienced larger than normal bowel movements in the days after taking morning glory.  I can definitely say that morning glory worked for us, it was fun, and it was instructional.  We had no unpleasant side effects.  It is a real drug, unlike many of the herbs we have bought on the internet.  Use of morning glory for spiritual exploration is highly complementary to salvia.  Salvia shows me the universe.  It pulls me into a strange other dimension.  It kills my ego as my consciousness dissipates into the membrane.  Morning glory puts its hand around my shoulder and guides me deep into myself and my memory.  The revelations from morning glory are much more personal than those from salvia.  I had expected a full blown psychedelic experience.  I think that if I could have taken a larger dose all at the beginning, or if my threshold had already been lowered by alcohol or cannabis, I probably would have been talking to the furniture.  Because of the lack of coordination and the very personal nature of the experience, I dont think morning glory would be very much fun at a club or a party.</p><p>We used the water/alcohol type extraction described in the FAQ.  The preparation was a bit of an ordeal, but the wonderful trip totally made up for it.  Some people might enjoy the at home chemistry experiment, but since the extraction wasnt particularly efficient, I think in the future we would soak the seeds in water and manually remove the shells as described in the experience report where they make a cracker.  That sounds tedious, but ultimately quicker and easier.  Im sure we will probably use morning glory again sometime in the future.</p><p>PREPARATION:</p><p>1.  We ordered 2 oz (= 56.7 g, or 1500 seeds) of organic, untreated Heavenly Blue morning glory seeds from our favorite shaman website.  To get a sense of how much this is, the whole seeds filled a measuring cup to the 100 mL line.</p><p>2.  We put the seeds a plastic container with lukewarm water and a drop of dish soap, shook them for a couple minutes, and then rinsed them thoroughly in a strainer.  I put them on a tray to dry overnight and took the opportunity to count them  1522 seeds.  I also ran our glass jar through the dishwasher to sterilize it.</p><p>3.  The next day we ground the seeds in a coffee grinder.  We ground them in three batches, pulsing on and off for two seconds to keep the material from getting hot.  We stopped grinding when they stopped making crunching noises in the grinder.  We had a fine powder of light sandy brown insides and dark blue shells.  We put this powder in our 2 quart glass jar and filled it with 1 L of filtered tap water.  The jar was roughly half full.  We shook it and put it in the refrigerator.  We shook it 2-3 times per day over the next three days.  The liquid looked thoroughly disgusting, especially the first day when it had several different layers of gunk.  It looked awful, but it didnt smell like much at all.  It turned the color of strong black tea over the three days. </p><p>4.  We poured the liquid onto a tray through a fine wire mesh coffee filter.  This step took a long time, at least an hour, but stirring it with a spoon helped.  Despite the filtration, the water solution was thick like whats left at the bottom of a cup of coffee.  The tray was deeper than the usual cookie tray accommodate the liquid.  We discarded the seed material.</p><p>5.  We left the tray on the counter, and waited, and waited, and waited.  We didnt have a fan, and didnt feel like buying one, so we had to wait nearly two weeks for all of the water to completely evaporate!  We probably used more water than necessary, but we wanted a potent extraction.  The evaporation was hindered by an oily layer that formed on top.  I stirred it each night with a knife to break-up this layer.  Because it sat out on the counter so long, we were worried about poisoning ourselves.  When the water soluble solids starting precipitating out of solution, it sort of looked like bacteria colonies.  We figured the alcohol step would take care of any bacteria that may have invaded.</p><p>6.  Once the water had completely evaporated, we had a tray with a thin layer of dark brown morning glory concrete.  Scraping it off the tray was nearly impossible!  We poured the alcohol (400 mL of Everclear, 151 proof) onto the tray and scraped, and scraped, and scraped.  After about an hour and a half of scraping with a spoon, the tray was clean.  We poured the liquid and the chunks of morning glory concrete into a measuring cup.  We stirred it for a while trying to break-up the chunks of morning glory concrete and gave it 3 hours to dissolve.  Not everything dissolved, and I dont think it should have, so we filtered the alcohol through a paper coffee filter onto the tray once again.  Again the filtration step was very slow, it took about an hour, and we changed the paper filter several times as it got clogged by fine sediment.  The alcohol solution was a beautiful clear golden brown liquid, not murky at all.  There was no oily layer at this point.  This gave us hope!</p><p>7.  The alcohol evaporated in about 3 days, but we gave it a full week to be sure.  We were left with a dark brown sticky sludge.  It smelled smoky.  We used a razor blade to scrape it up and it filled four #0 gelatin capsules a little more than half full.  It was easy to scrape it up this time, but it was very sticky.  We kept the capsules in a plastic baggie in a drawer for a week until we were ready to use them.  The whole process took nearly a month, and we had this tray of brown yucky-looking sludge sitting out the whole time.  It made our apartment smell like morning glory  nutty and smoky.  Not an unpleasant smell, but not great either.  Im glad the preparation is over!</p><p>I havent read much about the efficiency of the water/alcohol extraction, but I think it is an important point.  Assuming the extraction was 100% efficient, each capsule should have been 380 seeds worth of morning glory extract.  That would mean each capsule should have provided a strong experience.  Handling the materials as we prepared the extraction, we had a gut-feeling that our preparation had an efficiency of about 30%.  Although we are inexperienced with morning glory, we felt that our experience was moderate to strong.  Using the guidelines on this site (50-100 = light, 100-250 = moderate, 250-400 = strong, >400 = extreme) and based other peoples experience reports, I would estimate the efficiency of our extraction to be in the range of 20% - 50 %.  It could not have been much worse than 20% or much better than 50%.  For the purpose of dosage discussion, I have assumed the mean value of 35% efficiency (which gives 133 seeds per capsule).  I hope this can help other people properly dose their preparations.</p>",
 "year": "2008",
 "id": "69908",
 "gender": "Male",
 "timestamp": "2009-10-12T07:00:00.000Z",
 "views": "12698",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  },
  "1": {
   "time": " T+ 1:30",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  }
 }
}
