{
 "id": 6991,
 "title": "The Cube",
 "date": {
  "submission": "2007-06-02T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Crack EEE McGee",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "My First Salvia Experience",
  "February 14 2005",
  "Crack EEE McGee",
  "First Time Smoking Salvia: February 13 2005",
  "Smoked 0.2 g of Salvia Divinorum of Extract 20x",
  "I was first introduced to the wonderfully complicated and mystical plant, Salvia Divinorum yesterday, by a friend of a friend, who was willing to give me a chance at an undescribable experience.",
  "My friend A. after just seeing a movie, invited me to come over to his friend Z.'s house to relax and to smoke a joint or two. I had met Z. before at my friend A.'s work, but I had never introduce myself formally. After proper introductions, and after easing into the environnment, also including Z.'s girlfriend N., and her sister, S., I was told that Z. would be willing to let me try some of the salvia he had purchased at the local head shop.",
  "I was a bit apprehensive at first having not really had time to prep myself, I had just found out I might try it earlier in the day. But after overcoming fears, I decided I would go ahead and try it. Z. prepared about 0.2 g of crushed salvia, it was a dark color, almost black, I had never seen salvia before. I was told this was the lighter dose in comparison to what my friend A. had taken recently, about 0.5 g. It was prepared in a nice glass water bong in the shape of a dragon. I was told to sit down on the futon, due to common dis-orientation, and to make myself more comfortable.",
  "I was told to inhale it all in one go, or two, and to hold it in as long as i could. I light the bowl and took a nice long hit, held it in, and instantly felt a nice buzz hit me, almost like being drunk, or on the start of a mushroom trip. Z. and A. told me to finish what was left in the bowl, so I took another long hit, the bowl was still lit, and I inhaled the rest of the smoke, holding it in with my previous hit. As exhaled not long after, and I was definetely having it hit me. I tried to place the bong on the table, but had trouble grasping the fact that the bottom of the bong was at a weird angle, or maybe it didnt. I eventually managed to place the bong down without knocking it over.",
  "I can barely describe the feelings produced, and the reality that seemingly was all around me, consuming this reality. At first, after exhaling, I broke into a laughter I couldnt control, and I felt very ecstatic, and the laughter hurt to a point of feeling very pleasurable. I soon after felt a pressure all around me, as I lay back into the couch, but there was a central point of pressure somewhere below me, but I also feel that the pressure was coming from somewhere inside me, perhaps my legs. It's very hard to describe. It was uncomfortable, I remember it pulling at my belt and hurting my stomach, so I began to hold my belt. I soon adjusted to this pressure, which shifted into a cube like reality I could discern, its very hard to put in words, but try and stay with me.",
  "What I can only describe as a cube liked pattern absorbed part of my reality, and shifted with what was in the room, though my ability to see everyone and everything in the room stayed the same. I can only describe this space as something emanating from within the salvia within me, but it also felt as though it were external, and on a separate plane of reality.",
  "This cube pattern focused around me, and absorbed a certain part of the room. N., Z.'s girlfriend, was playing a video game at the time, and it was apart of this pattern. As she changed the colors and shapes, it would make the most astounding movements, and the colors were visually enticing. She was creating courses in a golf game, and at one point I felt within the game, as she scrolled the environnment, a certain part of me felt like I was running around within it.",
  "I remember trying to stand up at one point, which was caused both visual and bodily confusion. I tried to speak, but my words were not coherent to me. The environnment behind A. and Z. changed to what I can only describe as the contours of my lips, I both felt this in my lips, the wall, and I saw it visually. I tried to describe this, but only babbled incoherently while touching my lips. They told me to sit back down, and I had no problems acquiescing to that request.",
  "Sitting back down helped me regain some compusure, as the previous feeling left me dazed. The cube pattern was still remnant, though to a lesser extent,and the pressure exerted from it, and from me, and from around me, had eased. I began to relax, as the plateau of the trip was over. and I felt quite a weird buzz, a feeling of drunkeness, due to loss of coordination, and the type of buzz I usually get, right before mushrooms really hit me.",
  "The pattern soon wore off, and Z. began to discuss certain possibilities, and things that are known to occur with salvia. I remember him saying something about reaching the highest level in astral projection, how sometimes entities are contacted, and how sometimes everything seems to diseappear. I felt at this point, almost like a presence, but a feeling like something encased the building we were in, I felt a weird type of wind, rushing in to the room, that seemed to feel like it encircled it. I only felt that this presence in itself was a different plane of existence or reality, that I was able to feel. I was a little fearful at this point, and I tried relaxing myself, just going with the flow. This helped, and soon the feeling went away. I woudn't say it was a bad feeling, nor necessarily good, but I didn't feel ready, this being my first time, for what was outside.",
  "I'm not sure as to timeframe of the whole experience, as it very intense, and there is alot of sensory experience going on at once. After the first deep inhalation, I was hit with buzz, about 30 secs. I would say my comin up was about 1-2 minutes. My plateau very intense, very visual, and I had a very powerful bodily experience. It felt like it lasted about 15 mins. I felt pretty buzzed, and a little distorted for awhile, I'd say my coming down period might have been more than 25 mins. I felt pretty tired when I got home, and I went to bed pretty early, no bad symptoms other than tiredness. I felt fine this morning when I woke up, no after effects the following day. I'm writing this the day after."
 ],
 "erowid": {
  "id": "40550",
  "citation": " Crack EEE McGee. \"The Cube: experience with Salvia divinorum (20x extract) (ID 40550)\". Erowid.org. Jun 2, 2007. erowid.org/exp/40550",
  "substance": "Salvia divinorum (20x extract)",
  "views": "3380"
 }
}
