{
 "id": 6992,
 "title": "Beautiful Night",
 "date": {
  "submission": "2008-05-20T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sapphire",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I have experimented with all the drugs I have ever wanted or planned on trying and I had done ecstacy but just half a pill while driving around with friends.  I recently met some really cool people in my dorm who I smoke pot with frequently.  I have ALWAYS wanted to go to a rave, I feel like raves are our generation's counter culture, our great attempt to find truth through drugs and music and dance.  My very cool new friends invited me to go a rave with them last night.  I was so excited but nothing could have prepared me for the actual experience.",
  "We made a long trip on two buses out to an unfamiliar area in our city and found our way to the tattoo parlor where they were holding the Rave.  When I first walked in the place I was visually blown away, black lights everywhere with huge florecent hearts dangling from the ceiling the music made my rib cage shake and there were people dancing in beautiful outfits that were colorful and unique.  There were glow sticks everywhere swirling and spinning.  There was another room packed with couches and pillows.",
  "We talked to a few people and managed to track down all the pills we needed.  This boy took me out to his car to get my pill and as he was getting it the cops cruised by and started asking a bunch of questions which gave me a nasty jolt.  The pill he offered me was white powder inside a gelcap.  I swallowed it with a few large gulps of orange juice as the acidity supposable magnifies the effects.  We chilled out in the garden out back where smoking was allowed and there was a bubble machine and black lights and heaters.  I began to feel the tell tale tingles up and down my arms and the anxiety in my stomach.  I felt like a shooting star just going up and up and up.  My whole body was tingling with pleasure and finally we went back into the warm rave and the music was pounding and I began to dance with wild, blissful compulsion.",
  "Seeing all the other bodies moving with so much energy in time to the music filled me with the most intense joy.  I felt part of some huge beautiful piece of art.  The music was tearing a whole in my chest so intense was my joy.  I sat on the couches for awhile and cuddled and then we had gum and vics vapor rub and mentholated nose sniffers which we blew in each others eyes.  As the high began to wear off of its peak a friend and I split another pill, this time a purple pressed will with a star on it.  We bit it in half and then crunched it up in our mouths even though it tasted nasty because we wanted the drug to hit our system as soon as possible.  We danced some more to the point where we couldn't stop, it was muscle memory.",
  "We found a highlighter pen on the floor and began to draw patterns all over each other.  Highlighter in black light on skin is the most beautiful thing ever.  The lines and patterns winked and wiggled at me.  Soon we were all covered with highlighter over every exposed part of our bodies.  We danced together in a circle of beauty.  We got a ride home to our friends apartment around 5 am.  We smoked tons of weed and danced some more.  At 7am we went for a walk to starbucks for coffee.  We were covered in highlighter that had turned a yucky yellow in the daylight.  My hair was dyed bright blue and styled into two buns with glow sticks sticking out to them.  We all had beads and braclets and glowy thingys and we walk into the starbucks and there is like Mozart playing in the starbucks and me and this girl start rave dancing to Mozart.  The atmosphere was just so good, we had all bonded during that night and felt more comfortable in each other presents than we probably are with our families.",
  "All in all I think ecstasy is a wonderful drug if used sparingly.  I wouldn't want to roll every weekend but once every couple months is probably what everyone in the world could use.  Also, so far I haven't experienced any crash.  The come down was nearly as pleasant as actually rolling.  I had a nice time sitting around reflecting about the night with a close group of friends.  I also think sitting around and chatting and getting cozy with friends after a night of rolling is one of the best things to do."
 ],
 "erowid": {
  "id": "40551",
  "citation": " Sapphire. \"Beautiful Night: experience with MDMA (Ecstacy) (ID 40551)\". Erowid.org. May 20, 2008. erowid.org/exp/40551",
  "substance": "MDMA (Ecstacy)",
  "views": "3615"
 }
}
