{
 "id": 6995,
 "title": "Living Fast, Dying Slow",
 "date": {
  "submission": "2008-05-21T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Jokers Kick",
  "gender": "Female",
  "weight": "112 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I am only 14, yet I have experienced the worst living hell: addiction. I was only addicted to it for about 6 months, but it was enough time for me to spiral down and hit rock bottom.",
  "My first experience with speed, was in early June '04. One of my best friends got her hands on some high quality crystals, and I snorted my first line on the floor of a public bathroom in a park near where I live. I instantly loved the burn of the tiny crystals hitting the inside of my nose. I loved the feeling of the drip sliding down my throat. I loved the intense way it made me feel like god. From then on, every extra cent I got, went toward my growing habit.",
  "Soon, snorting wasn't giving me enough of a rush, so I proceeded to start slamming it, injecting wherever I had veins. I had been injecting random drugs since I was 13, so I wasn't new to the cold prick of the needle. My veins proceeded to become bruised blue and purple, a little rosebud forming after each injection until they were scarred beyond repair. I can still see the scars today.",
  "I finally hit rock bottom after buying an $80 bag and splitting it with my friend. I looked like a skeleton. 97 pounds of skin and bone. I remember the last time taking it. In the bathroom stall of some run-down hall where they held shows. At this point, doing tweak was a chore. It wasn't fun anymore. The only way I could be normal is if I had it running through my veins. I had injected it previously at my house, and I didn't have a spoon or rig with me, so I had to snort it. I did about $35 worth in one sitting, and after I pulled my head up, I wheeled backwards and slammed into the wall.",
  "I didn't love the burn, I didn't love the drip, I didn't love the rush. It was like an old boyfriend whose turned his back on you. Both me and my friend made a pact with each other in that old bathroom: that we would never do it again. We knew that all we had to look forward to was a horrible come-down, that we'd pushed upon ourselves. I spent the next three days mentally exhausted, ready to die. I became sick because all of my immunities had been destroyed. I was sick for 2 weeks. Bed ridden, thrashing with fever, hallucinating for hours upon hours. Eventually I got better, and I didn't experience any cravings for about a month, which is amazing to me. Everything I had loved before about speed, I mentally gagged at.",
  "So far, I've been clean for 2 months, and the cravings have finally appeared. I know I'm going to do it again, but I'll never EVER let myself go like I did before. I'm not going to waste my money on that bullshit again. I gave too much of my life to it that time, and I'm not going to make that mistake again, yet I will always be addicted to it. I keep a composition book with me at all times, and write in it whenever I need to escape. This is an excerpt I wrote on 12/12/04:",
  "'with the stuff I do...you don't escape...you face all of your fears and weaknesses and you just beat 'em up. But the biggest weakness just gets bigger without you knowing it.'"
 ],
 "erowid": {
  "id": "40559",
  "citation": " Jokers Kick. \"Living Fast, Dying Slow: experience with Methamphetamine (ID 40559)\". Erowid.org. May 21, 2008. erowid.org/exp/40559",
  "substance": "Methamphetamine",
  "views": "5639"
 }
}
