{
 "id": 7,
 "title": "Feels Like Really Good Ecstacy",
 "date": {
  "submission": "2013-06-02T07:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "mombyday",
  "gender": "Female",
  "weight": 190
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "150",
    "grams": 0.15
   },
   "administration": "oral",
   "substance": "6-APB",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "My husband and I had a free night together and decided to parachute 150mg of 6-APB each.",
  "+30: Felt a slight change in reality. Knew it was coming.",
  "+1: Cool vaporub sensations on my arms and chest. Husband said it felt like a relaxing, tingling rug burn.",
  "+2: Watching a movie. Talked through most of it but was really surprised by how interested in the movie I was.",
  "+2:30: Lots of sweating. Out of the blue I started dry heaving violently, but it didn't hurt, I didn't feel nauseous and I wasn't worried. It passed with nothing coming up. Husband said his stomach felt strange but he was able to suppress the urge to retch.",
  "+3:30: Movie finished and we talked about how much we loved each other, our kids, our life. Went on to discuss previous loves in great detail with no sense of jealousy. Really interested in the hows/whys and how it made us feel.",
  "+4:30: More dry heaving out of the blue. Let it pass.",
  "+5:30: Moved conversation to the bed. Talked more about past experiences and emotions.",
  "+6:30: Sex. He couldn't ejaculate.",
  "+8: Sleep. I was told the next day that I was erotically moaning in my sleep.",
  "Got two hours of sleep before having to wake up and face the day. Feel tired and drained of serotonin. Was hungry for breakfast but regretted eating as my stomach was still queasy from all the dry heaving the night before. Husband seems more motivated to get up and go. I'm envious. :-)"
 ],
 "erowid": {
  "id": "100011",
  "citation": " mombyday. \"Feels Like Really Good Ecstacy: experience with 6-APB (ID 100011)\". Erowid.org. Jun 2, 2013. erowid.org/exp/100011",
  "substance": "6-APB",
  "views": "1139"
 }
}
