{
 "id": 700,
 "title": "The Sandman In The Land Of Nod",
 "date": {
  "submission": "2002-09-13T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sandman",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "oral",
   "substance": "Oxycodone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Amount: 40mg oxycodone (Eight Roxicets, 5mg oxycodone each) ingested oraly on an empty stomach.",
  "DOSE T+ 0:00",
  "Weight: 120lbs",
  "Note:",
  "Four 5mg Ritalin pills were taken earlier in the day @12:00. I also took Adderall (amphetamine) and Ritalin (methylphenidat) the last 2 days.",
  "Date:  Thursday, January 10th, 2002",
  "T+ 0:00 Dose taken",
  "T+ 0:10 Starting to feel the onset of it - just sitting here typing this.",
  "T+ 0:14 sitting here typing this. ahhhhhhhhh the rush is coming on I feel slightly in control, calm, peaceful.  But since I have done this before I know it gets more intense.",
  "T+ 0:16\tIm going to go sing along to music and play pool now as it is a  great activity to do on opiates. Feeling drowsy.",
  "T+ 0:20 Balance off, it feels wierd to walk, something is up with my eyesight but I can't quite put my finger on it, blurry would be the closest word I can think of, but it's weirder than that.",
  "T+ 0:23 Nose & face a bit itchy.",
  "T+ 0:25 I notice that my hands are shaky as I'm loading CD's into the CD player.",
  "T+ 0:26 Going to the bathroom, pupils are smaller than normal.",
  "T+ 0:30 I notice my motor skills and coordination are off as I finish loading up the CD player and select the the track I want to hear.",
  "T+ 0:31 Listening to Kid Rock's Devil Without A Cause. I'm feeling pretty drowsy :) and more itchy :(",
  "T+ 0:33 Mouth a bit dry, So I drink a Pepsi.",
  "T+ 0:35 playing pool with myself, just shooting around practicing shots. My aim seems to be better on oxycodone despite my semi-shaky hands and loss of coordination.  I'm not sure why this is.",
  "T+ 0:37 Feeling kind of nausea, but I'm not worried about throwing up.",
  "T+ 0:40 Shooting great pool, I'm making several shots in a row.\tI'm so happy right now, I would like to be like this all day.",
  "T+ 0:45 I'm begining to notice that I'm having slight audio hallucinations, like hearing small noises that aren't there.Also some slight visual hallucinations, thinking I see something move nearby but nothing alive is even close to me.",
  "T+ 0:53\tVery sleepy, starting to shoot worse, feely a bit ansy and jittery.  Possibly from that damn Pepsi I drank.",
  "T+ 0:57\tQuickly finished up my game of pool after getting irritated from missing some easy shots.",
  "T+ 0:58\tGunna put go play some slower songs.  I'm nodding now. 'Only God Knows Why' is playing right now.",
  "T+ 1:00 Wish my girl friend was over right now so I could cuddle with her by the fireplace as I nod off in her arms.  Yes oxycodone turns me into a pussy :-P",
  "T+ 1:05 Sitting by the Fireplace nodding and writting this.  I \talmost fell into a deep sleep, good thing I was able to wake myself up otherwise my parents could have found me \tpassed out on the couch a few hours later. :-P",
  "T+ 1:07\tPupils are small but I have seen them smaller on previous doses.",
  "T+ 1:10\tI'm feeling slightly paranoid with the small audio/visual hallucinations.  Occasionaly I get paranoid about ghosts while on this stuff.  Again this isn't the first time having paranoia or thinking about spirits while on a opoid/opiate.",
  "T+ 1:15\tNose very itchy, I'll have to put some Benadril anti-itch on my face in a little bit.",
  "T+ 1:25\tUneasy and restless for some reason, though I suppose I could fall asleep if I realy wanted to.",
  "T+ 1:35 I got hungry so I started to snack on some Original Flavored potato chips.",
  "T+ 1:40\tI'm not realy feeling the 'warm fuzzy feeling' anymore. This trip isn't feeling like the typical high I get, usualy I peak and feel the best 1 hour after taking it (45 minutes after I feel it kick in).  I think that taking Adderall (speed) and Ritalin (speed) for 3 days in a row including today might have something to do with it.  Possibly because my body might be low on dopamine with all the speed lately.",
  "T+ 2:15\tWent back up to my room, now I'm going to take a nap :) while I listen to a mixed CD that has a lot of soft rock and songs that aren't loud. I actualy named the CD 'The Land Of Nod'. I made this CD for the purpose of listening to while I nod off, so that I don't get distracted/paranoid about little noises in the house. I usualy am asleep for about 30 minutes or so but you can never tell for sure, I've been out for as long as 3 hours. :)",
  "T+ 2:47\tI didn't sleep as well as I would have thought or liked to have. I kept on falling asleep for about 2 minutes and then I would wake up again feeling kind of nervous and a bit agitated.  Plus I'm still feeling a little nausiated.  So I finaly decided to quite tying to fall asleep and finish this up.",
  "Opiods and Opiates are definatly my favorite drugs to do, though I would have liked the high to have been for 'full and wholesum' like it usually is, I still had fun.  That first onset rush in the begining where time seems to stand still while there is a defening roar in your head makes it all worth while.  If it would have gone the way I had wanted it to,  I would have felt the way I did when it first hit me the whole 45 minutes till the peak.  Well I hope that you enjoyed reading my trip report, and hopefully you even learned something.  Just be careful with this stuff.  I'm not trying to be all holy and stuff, but I have been addicted to this stuff and I still kind of am.  Sometimes I wish I hadn't even done it once, but most of the time I have no regrets about doing it.  Anyway try to not to trip every day that's how I got addicted.",
  "\t\t\t---===SANDMAN===---"
 ],
 "erowid": {
  "id": "11779",
  "citation": " Sandman. \"The Sandman In The Land Of Nod: experience with Oxycodone (ID 11779)\". Erowid.org. Sep 13, 2002. erowid.org/exp/11779",
  "substance": "Oxycodone",
  "views": "49048"
 }
}
