{
 "title": "A Manifestation of Psychedelic Experience",
 "author": "Nora ",
 "citation": " Nora . \"A Manifestation of Psychedelic Experience: experience with LSD (ID 70081)\". Erowid.org. Jun 16, 2009. erowid.org/exp/70081",
 "substance": "LSD",
 "bodyweight": "107 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2007",
   "70081",
   "Female",
   "",
   "Not Given",
   "Jun 16, 2009",
   "2818",
   " "
  ]
 ],
 "report": "<p>A Collection of Experiences</p><p>I can recall a specific moment, after a summers worth binge on hallucinogens, where I found myself crossed over that wakeful-dream border, having the thought, and with it, a sensation of tingling fright, Did I eat acid and forget? A realization that I had not, and the wonder if the wave of insanity had finally broken, and swept me to sea.</p><p>perceptive disarray</p><p>I have found it most interesting that upon my coming to University, everything that I had once learned to be Solid Truth has become unraveled into a mass and chaotic network of fraying and contradictory ends. I found that I must first purge myself, admitting that indeed, I know nothing about anything, I know nothing at all... to begin the ruminative task of questioning my own perception, beliefs, values, and conceptions of consciousness and mortality. </p><p>I had been made aware of a subtle disquiet lurking in the darker corners of my mind. More and more often, I was met with fleeting impressions of unresolved inconstancy. My brain might alight upon an idea, anew and incomplete, the same as the brief instant a bird appears on its perch, but one blink, and its gone. Unregistered, one cannot recall if it was really there at all; a spark of thought without subsequent firing. </p><p>The process began about a year or so ago. (I call it a process due a recent realization that those frequent and systematic dosings may have indeed made some notable impact on the Disarray [here I name myself] of Old Ideas.) </p><p>I began experimenting with several psychedelics, unknowingly preparing myself for a life of confusion, but of raw truth. I managed to stifle much of the awareness that reverberated just beneath the surface of my conscious, the conflicting stocks of knowledge that would soon overwhelm me completely. Yet the conglomerate I had once been, the symphony of ideas and thoughts and opinions, began exposing faint vibrations of a dull dissonance. Just as if I were anticipating some peak to this gradual crescendo, my holistic life (or conflicted perception of it) gave way to the unbearable Weight of Being, a cacophony of indistinguishable and inaudible frequencies. My collection of scattered knowledge, mismatched and unqualified, had been wound too tightly into the coils that frequent chaos. I found that I could no longer explain myself or my thoughts. The ideals of perception I had held gave way to Mass Confusion. Thus began the requiem that would conduct my careful descent down a flight of insanity, where each subjacent step grows longer in height and slimmer in width.</p><p>sober hallucinations</p><p>Auditory and visual hallucinations began to frequent my waking life. Sometimes I would be sitting perhaps a bit too still, staring perhaps a bit too hard into the screen or page or wall, just so I feel my eyeballs sink into my head, and my mind float up out my skull-box and sail away through different layers of dimension. My body slides out from beneath me. Imagine for a moment, how difficult it is to focus, much less get anything done, when my mind dissociates from its body.</p><p>Many times I will be immersed in some activity, my mind dissolves and I will hear in my head some background murmur of conversation, like the quiet roar of a restaurant. I could be washing my hands or walking home, any simple activity, and I drift to a state of blankness, where nothing is being paid any particular attention. Upon awakening, I find myself surrounded in silence, though I could swear upon the clear fragments of conversation that linger in my ears. I can so easily recall the words that were said, and remember the voices with such distinctiveness, that at times I have trouble discerning what is real. It is as if (Ive often thought) my brain, at resting state, begins to channel other frequencies, perhaps of that parallel universe, or perhaps my unfiltered mind has escaped its confines </p><p>patterns and patches</p><p>I am privy to the color-patches that Annie Dillard longed for, the meaningless forms of different saturations, the blobs and shapes of pigment. Colors appear more vividly and consume my field of sight. My brain has been re-wired, no longer able to instantaneously process the huge amount of information received at each moment. No longer do I find a book on a desk in a room, but cream and time-yellowed rectangle on a tawny orb, against a background of antiseptic white, where other color patches stretch beyond. I find myself presented with raw information, forms devoid of significance, for my brain has declined in its ability to cut out that information which is unnecessary. My eyes now adjust more readily to pattern and to color than to written language. I will stare at a word a full minute before it is married to any meaning. All the short cuts I have learned have been erased, stimuli presents no content or context, I see without understanding.</p><p>I often perceive (I no longer limit myself to the word see) a sort of aura or secondary glow, or even flashing neon imprint. Spots of blue light appear in my vision and life-like figures float before my eyes. I remember an episode earlier this year, during a physics discussion. I was watching my teaching assistant, taking notes for the upcoming final, when her twin negative appeared next to her, an animated image made out of green light. I no longer react to such apparitions; I have become accustomed to these shadow people, swishing by me, existing in their parallel universes. </p><p>shifting and morphing</p><p>Persistent dosings of consciousness-expansion have attributed to this re-arrangement of my mental processes, bottom-up and top-down, and I sometimes fear its permanence. The cream-colored rectangle, the book, morphs again. Now, instead of type or words symbolic of meaning, instead of the common experience and virtual reality of written language, a page will divide itself into organized sections of pattern. Before me I find staggered columns of space and color. Letters within the print and paragraphs shift, leaving pixel trails of green and ultraviolet up and down and in between. Uniform rows of printed text reveal a separate entity, one apart from any attributed meaning. A page easily separates itself into pattern groupings, organic and multi-layered, as effortless and efficient as a puzzle.  The spaces between the images become the veins that map the idea. To my sight, the colors present a story of that pages physical manifestation, regardless of its printed meaning. It is here that my eyes and mind cross in perception. I watch letters cascade down the page, shifting, sliding, morphing</p><p>purple haze, third eye gaze</p><p>I had heard the phrase purple haze but had never put thought into what it might mean. Destined to learn, I one night found myself in a friends bathroom, having eaten about 400 micrograms of LSD. [Erowid Note: Claims of measured microgram dosages for LSD are usually unsupported. Quantitative measurements for LSD are very difficult to do and cannot be done casually. Without further detailed information about how the measurements were derived, it is reasonable to assume that most statements of microgram dosages of LSD on blotter or in microdots are either misinformed or overstated.]</p><p>I am known to bore easily, so if given the choice, Ill choose spontaneity over the mundane. This warm spring evening was no exception. I believe it was last March, after finals, almost exactly one year ago, when three of us stopped to drop acid at a friends house. The trip was not totally planned, but needless to say, we all set up camp for the night. I had fried once before, on a single hit, and I believed it time for another psychedelic experience. I remember placing the blotter on my tongue, a tiny, half-centimeter square of plain white paper once soaked in LSD. </p><p>One basic rule of thumb I apply to psychedelics, is that the first dose should usually be the final dose. At that time, I had not had much experience with acid, so when the others began to comment on their come-up, I decided I wasnt feeling enough, and ate a half, and then another half of a second hit.  I ended up taking two sizable doses of LSD, timed in such a way as to intensify and prolong the plateau of my trip, the most concentrated and consciousness-expanding stage of acid (although this was not my intention). Its difficult to pinpoint, (especially since my memory, as of late, has become particularly imperfect) how exactly I ended up in my friends bathroom.  I remember falling into psychosis; laughing hysterically, forgetting that I had, and then wondering why there were tears in my eyes. My memory seemed to short out every five minutes, and my brain struggled hard to catch up. It came down to my ultimate understanding of the bathroom as my sanctuary. It existed as a mathematical expression that balanced the house and the positioning of the people inside it, on either side of an equals sign. For a time, I found serenity, which allowed the awareness of an eternal background that so effortlessly precipitates to the highest frequency of visible light: purple</p><p>We talk about the purple haze, and what the colors beyond ultraviolet and infrared could be, and how constantly we swim unknowingly in pools of radio color and sound light. We discuss the possibility of the haze as Truest Vision of the pineal gland: the vision of the third eye that contains a complete map of the physical eyes visual field, receptive to light. Ive once read that to activate this third eye, the pineal gland and pituitary body must vibrate together in unison..</p><p>I remember seeing his face, though its image was not a physical figure, but rather a metaphysical manifestation of his core energies, certain frequencies to which he was particular, networked in surging form against the backdrop of what has been described as Hindu labyrinths and geometric electro-layers of impossible color light.</p><p>Recognition was reduced to some base and remote concept of familiarity as I beheld, in transcendent awe, an ultraviolet-tinged vision. Breathtaking Wonder. This Other; Significant; revealed as a rippling fabric of energies, where the intensity of life achieves purest form. His visage appeared cloth-like, undulating as if blown by some esoteric wind. His beautiful presence: cosmically announced in splintering streams of unimaginable purple-colored light, the frequencies of his essence blazing with the sheer energy of pulsating existence. </p><p>of a sacred experience</p><p>It is to be understood that despite the greatest of effort it is impossible to relate the sheer magnitude and profundity of any sort of psychedelic experience, much less illustrate the unimaginable.</p>"
}
