{
 "title": "Watching the Trees Grow",
 "author": "vunit86",
 "citation": " vunit86. \"Watching the Trees Grow: experience with Black Widow Spider, Alcohol & Cannabis (ID 70096)\". Erowid.org. Dec 22, 2008. erowid.org/exp/70096",
 "substance": "Black Widow Spider, Alcohol & Cannabis",
 "bodyweight": "130 lb",
 "report": [
  "<p>It was in college. I was drinking with 3 of my good friends and my girlfriend at the time, and smoking some weed.  My ex-girlfriend wanted to get away to have sex in the woods; needless to say it was very easy to convince me.  As I lay in was mounting her in the dark woods outside of my friends mountain home, I put my hand in a spiders web that seemed extremely tough and springy.  I didnt think anything at the time because I was focused on the job at hand, until I felt something crawl onto my hand.  I reached to swipe it off, crushing the Black Widow Spider, but I felt a stinging in my hand.  I tried to continue having sex, but my hand was hurting so bad and I had to stop. ",
  "When I stood up I was very dizzy and disoriented.  My ex-girlfriend and I started making our way back to the house which was about 150 yards away (we didnt go very far into the woods) and about halfway there my legs gave out.  My ex-girlfriend gave me some support and we got back to the house.  It was kind of late and everyone was really drunk.  I looked at my hand and it was swollen where the bite was and there were red marks around it.  I was starting to feel really strange, and I knew that it wasnt just the alcohol.  I remember my ex-girlfriend wanting someone to take me to the hospital, an argument ensuing over why we shouldnt drink and drive, and where the nearest hospital was.  My best friend was on my ex-girlfriend's side and he said he didnt give a fuck and he would drive me to the hospital, which was about an hour away.  I had being lying on the couch for a while, not sure how long, and I tried to stand up, and fell straight down.  I thought it was hilarious, but inside I knew something was very wrong.  My ex-girlfriend and my friend carried me to his truck and put me in the back seat. ",
  "This is when the blackouts and hallucinations began.  The spider poison gave me a trip like I had never had before, and I have tripped on everything but mescaline, including DXM.  In the back of the truck I was looking out the window as my ex-girlfriend cried and my friend got on the CB radio, not giving a damn about anything.  There were parts of the trip where it felt like I was in a bubble, parts where I watched the trees grow really really tall and then shrink back to normal, and saying a bunch of random shit I dont remember.  I know that about 30 minutes in, my friends couldnt even understand what I was saying because my speech was slurred so bad.  We made it to the ER room where the nurse was waiting with a wheelchair, and they checked me in.  They asked me how bad it hurt on a scale of one to ten, and even with the beer and weed numbing the pain, I said it was an 11.  The doctor who treated me at 3 AM was drunker and nearly as fucked up as I was.  He slurred his speech really bad and all I could do was laugh in his face.  (I asked my friends what he was saying and they dont know to this day, we just do impressions of him, I think they laughed in his face because I was laughing)  He ended up giving me some shot, keeping me for 30 minutes, and releasing me with 20 10mg oxycontins (score!). on the way back, my ex-girlfriend and I finished our business in the back of my friends car, against his wishes.</p>"
 ],
 "year": "2004",
 "id": "70096",
 "gender": "Male",
 "views": "85793",
 "dose": [
  {
   "time": "0",
   "administration": "SC",
   "substance": "Animals - Black Widow Spider"
  },
  {
   "time": "0",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "submissionDate": "2008-12-22T08:00:00.000Z"
}
