{
 "id": 7009,
 "title": "Observed Effects",
 "date": {
  "submission": "2007-11-03T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Paxil and Hooch",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "80",
    "grams": 0.08
   },
   "administration": "oral",
   "substance": "Paroxetine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "glasses",
    "quantity": "10"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "I am a Mental Health Provider for the US Army.  As such I am called quite often when someone makes what we call a 'suicide gesture' (id est, taking meds and drinking, and then letting others see this behavior.)  I have some lenient views on recreational drug use, so this is by no means a diatribe against using psychoactive substances.",
  "Two weeks ago I was called to assist a Service Member (SM) who had ingested the above amounts of Paxil and Beer over a two hour period.  His stated reasoning was to be able 'to get to sleep.'  W/o going into details of his case (to protect patient privacy, etc) I will relate the immediate and longer term effects.  SM was almost immediately very drowsy, with slurred speech and clouded thought processes.  Of course, 10 beers in two hours will go a long way toward this, but I feel the combination also hit the SM hard.  SM had extreme difficulty staying awake, though pupils were still responsive, breathing was normal, and pulse was strong and steady.",
  "SM slept (under observation) for approx 11 hours.  Upon waking SM described sleep troubled by vivid, unremembered dreams.  SM expereinced significant lingering body load throughout the next day, muscle soreness, continued tiredness, lack of focus, some dehydration (no shit, 10 beers) and some joint pain.  SM experienced no long term effects from this combination, but the experience scared the shit out of the person."
 ],
 "erowid": {
  "id": "40613",
  "citation": " Paxil and Hooch. \"Observed Effects: experience with Paroxetine and Alcohol - Beer (ID 40613)\". Erowid.org. Nov 3, 2007. erowid.org/exp/40613",
  "substance": "Paroxetine and Alcohol - Beer",
  "views": "6712"
 }
}
