{
 "title": "Clusterfucktasticland (DOC land)",
 "author": "Geneity",
 "citation": " Geneity. \"Clusterfucktasticland (DOC land): experience with DOC, Amphetamines (Dexedrine), Doxylamine (Unisom) & Cannabis (ID 70098)\". Erowid.org. Sep 22, 2010. erowid.org/exp/70098",
 "substance": "DOC, Amphetamines (Dexedrine), Doxylamine (Unisom) & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  "DOSE: T+ 0:00",
  "8 mg",
  "oral",
  "DOC",
  " T+ 8:00",
  "10 mg",
  "",
  "Amphetamines",
  " T+ 0:00",
  "10 mg",
  "",
  "Amphetamines",
  " T+ 0:00",
  "10 mg",
  "",
  "Amphetamines",
  " T+ 14:30",
  "3 tablets",
  "oral",
  "Pharms - Doxylamine",
  " T+ 22:30",
  " ",
  "smoked",
  "Cannabis",
  " T+ 24:30",
  " ",
  "smoked",
  "Cannabis",
  " T+ 26:00",
  " ",
  "oral",
  "Pharms - Doxylamine"
 ],
 "report": "<p>[Erowid Note: 8 mgs of DOC is considered an extremely high dose, see DOC Dose Chart]</p><p>Okay so a few weeks ago, I received a sample of DOC (4-Chloro-2,5-dimethoxyamphetamine). 25mg. Now me and my BF were planning to trip the night of the day that my mom left for a few days for a business trip. That way we'd have the perfect setting and could do whatever the hell we wanted. Plus one for that. If I hadn't I would've been TOTALLY FUCKED. We planned 6mg doses (already high to start). I was going by 8mg for some reason being the super heavy dose.</p><p>So I get home after taking my GED's (and yay I passed!), and I go to pick him up. We're both in a great mood and ready to have a fun night of tripping. Ha. No. We got home, and dumped water into the bag, then back out because there was so little. Well DOC doesn't dissolve in water. I didn't know that and it appeared to have. I thought I did good research. Anyway I spilled some on the damn counter and we soaked it up after dampening a sponge and running more water through it. So we each take a dose calculated by the ml/mg (don't remember what it was exactly). We dropped at 8pm.</p><p>We go back downstairs and play Rock Band to wait for the effects to come on. In 40 minutes we don't feel much. A little weird, or off-kilter, but not much. 60 minutes we're back upstairs and I'm lying on the couch with ever increasing nausea. I begin to feel like something is wrong. In 80 minutes I'm puking what little of anything there was in my stomach, and hard (hadn't eaten for the whole day). I had no idea what I was in for, because after puking I tried to start having fun, but I couldn't. The body load was unbelievable. My muscles felt extremely rigid and it was all ridiculously uncomfortable, also very high blood pressure. This is the beginning of my restless stupor.</p><p>The visuals are enough to make me get nauseous once again, but then I get used to them and begin to enjoy them. Everything is flowing. It was really pretty. At one point everything glistened and it was like being under water. Colors were unimaginably intense. So bright in face that I closed my eyes and placed my hands over them quite a few times. Once I got up I realized how my physical senses were just as fucked as my visual and mental. I could feel ripples throughout my body, as well as a profound sense of poisoning. My body felt thick, clogged, and disgusting. It felt like my skin was inches think as well and numb. I was checking my heart often, and often couldn't feel it AT ALL. I had to have J check my pulse every now and then for me. It was all very strange but I was high out of my mind so I was enjoying the insanity of everything coming at me all at once. It's like all the things my brain silences normally, I started to notice, and that's a lot of shit.</p><p>We moved upstairs and I started to really lose it, I was still coming up. I lost my inhibitions and stopped giving a damn about anything. I decided I felt really, really terrible physically so since we had the house I may as well try and make the best of it. I puked two more times in between (It's now been 2 hours). The high my mind was experiencing made me not give a shit about the body load. I felt overwhelmed and helpless, really helpless. But I continued to move about restlessly. I filled up the bathtub with nice hot water to try and relax my muscles and dilate my veins a bit. It made no difference, but was nice to be in. I did feel relaxed mentally a bit from the overwhelming everything. We closed the door and had a cigarette because I didn't give a damn. He was not tripping like I was. He said he got some visuals but didn't get much overall. I couldn't see clearly because of the visuals for the first 6 hours.</p><p>The situation on the upstairs floor (just a floor at the top of the stairs and a rotunda. It's not very big.) was absolutely insane. Shit was everywhere. The tub was full of water, the lights were all on, clothes were everywhere (I was naked at this point because of constantly going in and out of the tub trying to survive). I couldn't care less about any of it either. I was laughing hysterically every 5 minutes or so for about an hour (3-4 hours in) about how ridiculous the situation was. Me overdosing, everything being a total wreck, ect. I got A LOT of my insanity on the camera because I wanted to remember it and because it was just retarded and I'm never going through that again. Anyway, by now I'm just running around the upstairs talking about whatever comes to mind with this random though flow. I needed to go downstairs to get the next memory stick, but I just ended up sitting on the floor (butt naked still) laughing about how ridiculous Sony was and their products were. Joey came down in a minute or so and I just laughed at how retarded I was and more about Sony and watched him do it.</p><p>I forgot to mention that the entire 8 hours sounds were flanging at some speed. And I was hallucinating A LOT of noises (sirens, children playing, grass in the wind, sunlit neighborhoods silence, really beautiful and peaceful) Visuals came with all of these.</p><p>At 4 or so hours in we were still mainly upstairs and I was still in and out of the tub, naked, and talking nonsense. We lit incense upstairs in the bathroom as well. I went downstairs again to get the camera dock and the wires and kept laughing about how ridiculous Sony products were. The same thing happened and I just said fuck it and sat down and laughed about the ridiculousness of Sony some more. He came down and we got the wires and went back upstairs.</p><p>After about the 8 hour mark (like 5 in the morning) I started to calm down enough to go make some ziti (I was trying to heal, lol). I ate a decent amount and J had decided we should do some speed (5mg dextroamphetamine tablets, Dexedrine). At this point (6am) I had lost enough of the high to notice how horrible the body load and the miserable stupor really was. I decided, though it was a bad idea, to do some speed to bring euphoria back so I wouldn't be so miserable. I did 2 tablets, felt nothing, 4 felt nothing, 6 felt a little bit of euphoria (normally 6 will get me flying). I decided to stop wasting the pills, it wasn't helping. That was the beginning of me taking drugs to fight it.</p><p>At 10 or 11 I took 3 doxylamine to try and sleep a bit so my brain could heal. Between the speed and the DOC it didn't do a damn thing. It just made me not care about shit even more and be even more stuporious. Which meant getting more miserable. Later on, at like 3pm I had to drive J to his interview. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] Body load as bad as ever, getting slightly worse the less high I am. Now I'm coming down from the amphetamine as well, so I'm incredibly miserable. I stopped to get a nice big Gatorade on the way to his interview. I waited for 30 minutes because we got there 15 minutes early. I was extremely pissed off, extremely miserable and at this point just wanted to die. I felt like an overworked donkey being worked even harder. It wouldn't let up.</p><p>By now the visuals had subsided (mostly), and I was left with a strange but mostly sober headspace, and an extremely bad body load. No words can describe how miserable it made me. I felt poisoned. I felt like all my organs had stopped and my heart was pumping lead. My muscles were almost painfully tense and I just wanted to die. We were going to get weed later that day. Sour D. Some good stuff to calm this terrible body load and my nerves that I'm not permatripping. After going through TONS of shit with calling and waiting for people to be available we finally get on our way (50 minute drive). With the agonizing body load I was extremely impatient and extremely quick to anger. I should mention I am still physically tripping at this point (and its terrible), visually nothing but slightly changed perception and odd headspace. It's about 4:30pm now. 20 hours.</p><p>During the drive my body slowly and slowly got more tense. My hands started to lock onto the steering wheel and I was almost unable to move my fingers. But I made it my first priority to maintain control and stay cool and not freak out. Fighting between these two made things even harder. The pressure started to get so bad I thought I might have a stroke right there in the car. I kept a mental note of that if I started to feel weird I would pull over immediately. The pressure capped off at just at excruciating. My entire body started HEAVY pins and needles. It felt like I was wearing a big metal blanket of pins. It was frightening. I started to freak a bit a few times and just tried to breathe slowly and fully.</p><p>We got into the town (its a dangerous place, a city in NJ) and drove around lost for awhile. This stressed me out but the pressure had lowered a little and then pins and needles now receded to random spots on my body. We finally got where we needed to be and pulled into a parking lot. Lots of scary guys making drug deals around us. J goes to get his laptop from the shelter he used to be in. We continue waiting. Things get even worse.</p><p>The cops knock on his window and tell him to step out of the car. I am in NO mental condition to fake not being high right now. I am still pretty retarded at this point (5:20ish). I'm asked to step out and they immediately start asking us if we're there to cop drugs. We say no and he has it straight and a good excuse. We say why we're there (to pick up his laptop) and they ask why we're parked and shit. I can't hold a thought for shit and they eventually trick me into telling them I was there to buy weed (pulled bags out of his pocket and shit. I was not quick enough to deal with this). So they threaten us a lot and scream at J and tell us to leave and never come back. So I just cooperate and we get out of the parking lot. We continue to try getting weed at this point. We were there to meet one of J's friends. She knows where to get it. She's real cool =). So after waiting for awhile around, driving around, and looking really suspicious (I had a 2 seat car, there were 4 people) we finally got to getting it, and hightailed it the fuck out of there.</p><p>The drive back was much calmer, possibly because I was happy the day was a success and I'd finally get to chill out. We got back to my house around 6:30pm and the pressure and rigidity were still quite bad. I was anxious to smoke. We smoked. I hadn't gotten to smoke good headies in a long time and it was really nice. I got quite high and so did he. But now I'm just high and retarded. The body load is still the same and the visuals are back full force. I feet 'doctarded' as I kept saying, and then saying how horrible that was and how it didnt explain the actual feeling. That and screaming 'DOC LAND!!!' throughout the trip. I was fucking insane.</p><p>I was happy that the weed made me a little happier and not notice the muscle problems as much. We chilled and watched the videos of mostly me being completely insane (the first 8 hours). The body load would not subside. In about 2 hours we smoked again. This time went by like nothing, but most of the time I had perfect track of the time, no dilation or anything. The visuals and basically the rest of the trip were back again. I began to fear that the DOC was some sort of MAO inhibitor as some others are, and after that high wore off I stopped smoking.</p><p>I continued to be extremely miserable. At this point J was asleep and I began to think about the future and if I really was permatripping. I thought about how I'd have to tell my mom and how I'd have to take anti-psychotics the rest of my life and they probably wouldn't make me completely normal. I started to contemplate suicide and how each type of suicide would effect the people I know and my mom. I always decided in the end that I had to wait it out for at least a few days before doing anything drastic, so that's what I agonizingly continued to do. I wanted to die, badly. I continued taking doxylamine all night long to try and sleep and I was just more miserable and in a 100% restless stupor as I had been for the past 26 hours. It seemed so very long since I had dosed, since I had been sober. I yearned to be sober again. I would cry and be happy as fuck if I would be sober again. I always hoped that I just taken too much and that it's gonna last longer then 20 hours. It lasted in all about 30 hours.</p><p>After running around the house and forcing myself to eat a tiny bit of fish and a half a pb&j, I tried to sleep on the couch. I couldn't sleep worth a shit between the amphetamine I was still coming off of and the ever present DOC. I smoked a few more cigarettes and tried to sleep on the couch a few times, and in my bed a few times as swell. I kept going back and fourth. I finally started to physically come down around 1:30am. The body load was ever so slightly less then what it had been, and I could finally lay still for 2-3 minutes at a time. I tossed and turned a lot but in what felt like an eternity, by 2:30am I estimate I was asleep. I woke up around 11:30am and thanked fuck I wasn't permatripping and went downstairs to tell J the good news. I hugged the shit out of him and we did stuff and then decided to smoke some more Sour D and get the spicy baconater from Wendy's.</p><p>All in all that was a scary ass 30 hours. I went through so much shit. There's no chance I'm going to overdose any other psychedelic, that's for sure. I think I ended up dosing around 8-9mg.</p>",
 "year": "2008",
 "id": "70098",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-09-22T07:00:00.000Z",
 "views": "6976",
 "dose": {}
}
