{
 "title": "Induced Flashbacks?",
 "author": "Dr. Johnson",
 "citation": " Dr. Johnson. \"Induced Flashbacks?: experience with LSD & Cannabis (ID 70126)\". Erowid.org. Sep 30, 2008. erowid.org/exp/70126",
 "substance": "LSD & Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 repeated",
   "smoked",
   "Cannabis",
   "",
   "1 repeated",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2008",
   "70126",
   "Male",
   "",
   "Not Given",
   "Sep 30, 2008",
   "7044",
   " "
  ]
 ],
 "report": "<p>Lately, I have been experiencing mild to intense LSD flashbacks when I smoke cannabis. Not only recent LSD use seems to trigger this, but also recent MDMA use.</p><p>I first noticed this after new years 2006, when I ate quite a few strong pills of E. 5 or 6 i believe. I rolled hour hours and hours, hallucinated, and dreamt vivid, realistic dreams. For days or even a week or two afterward, I would experience an intense, usually uncomfortable high when I smoked marijuana. A couple times, it felt like I was rolling again, which was nice, but gradually it dissolved into a cloudy psychedelic-like stoning that would knock me on my ass every time I smoked.</p><p>Then I ate some acid. First one hit, then one and a half, then 2, each spaced a couple weeks apart. Smoking pot the first few days after these experience led to intense visual distortions and a body load equal to or greater than the one I had experienced on the acid, believe it or not. I would continue to experience somewhat regular flashbacks even when not smoking pot, but the weed would bring it on completely. Keep in mind, this would not (and will not) prevent me from smoking just as much pot as I ever did. I just 'trip' when I smoke, and I smoke multiple times per day. </p><p>These experience are managable for the most part, but there have been 2 distinct flashbacks where I was genuinely concerned that I had been dosed with LSD again, unknowingly, and was experiencing the come-up of a very long, intense acid trip. My mind raced around the possible ways I could have injested some LSD recently...I was sure I had been dosed by a friend. On both of these occasions, after 5-15 minutes or so, I would regain normal thought and bring myself back down to baseline, only after experiencing intense closed and open-eye visuals and other sensory distortions, as well as that distinct head-in-the-clouds acid body high. These experiences would become less and less intense, untill eventually I could just get stoned again.</p><p>Then, I ate some more E. 2 'blue mahjongs'. Very trippy pills...maybe 2c-b or a similar psychedelic in them? I experienced better, more significant visuals on these pills than I had on acid or mushrooms before. This experience triggered a new, maybe more intense period of flashbacks when I smoke. The flashbacks do not take me back to the wonderful experience I had on these pills, though, they take me straight to LSD space, where my head feels disconnected, and all I can see through closed eyes are endless fractal patterns. It seems, to me, that my brain has made a solid connection between smoking marijuana and LSD, and when intense psychedelic experiences are fresh in my mind, it is very easy for me to slip into that state of mind - even if it wasn't acid that got me there. Without smoking pot, I can do it at my own will, somewhat enjoyably. But when I get really stoned, I have no choice - I am forced into acid space for a little while. </p><p>I am assuming that this effect will again gradually decline untill I can become comfortably stoned again. Maybe I just should smoke less? Sometimes one hit is all it takes. It doesnt bother me all that much - I love tripping, so being able to trip when I smoke is a bonus, but at the same time, I love getting high all the time, and I definitely don't want to be tripping all the time.</p><p>It should be noted that I have never experienced flashbacks from mushrooms, which I have the most experience with (and which I tend to favor the effects of the least).</p>"
}
