{
 "id": 7012,
 "title": "Lost Inside My Own Body with No Identity",
 "date": {
  "submission": "2006-04-14T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Escaped",
  "gender": "Male",
  "weight": 12
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "Having newly discovered Salvia from my local head shop and had a couple of strange but fun experiences, I decided to get some more and let my friend try some. Im pretty new to hallucinogens and had only tripped accidentally (and unpleasantly) from the combination of MDMA and weed before.",
  "We went round to my friends house and went into his room. The lights were low and there was a red glow on the walls (this may of lead to the fleshy walls I mention later) and after a few beers, maybe five or six, we got out his home made bong. I let him go first but he couldn't manage to hold the smoke in and didn't get the full effects and instead felt like his body was moving and he felt disorientated. He wouldn't try it again after that so I decided to have my turn. I was feeling good and not nervous and completely ready so I took a big hit and held it in and sat back on the couch.",
  "I quickly got the complete loss of identity and knowledge of where I was I normally got but this time there were no giggles. I then must of slumped downwards as I was looking at my leg but I was still continuing to fall, losing my body at the same time and then I seemed to melt into my thy. I was familiar with the 'melting' as I had merged with whatever I was close to before but this time I couldn't grasp that it was my thy as I was inside whereas in past experiences I had just been stuck to the object. Inside it was similar to when in cartoons someone gets swallowed by a whale (Pinocchio?) complete with fleshy walls and bone structure. Colours to begin with were vivid but not in a fully psychedelic way but then the thought of other entities around me, this might be hard to explain, created psychedelic imagery of characters.",
  "I say imagery as they weren't visible as in I could picture them in a 3D way and touch them but they were there and I had an image of them. There were about three horse riding men who seemed Mexican in what they were wearing and the way their psychedelic colours were gave me the impression of a scorching desert. They, without words or sound, explained to me that they were here to help me remember my true identity, purpose and place. Without any real explanation from them things started coming back to me (I guess the Salvia wearing off). I firstly grasped that I was inside my own body and that these 'guides' were a part of me, although I had yet to discover who 'me' was.  This knowledge was enough to get me out of my thy and left me in my friends room but I had no idea what this place was and why I was here. It came to me that this was not how I normally feel and that left the same question of 'why is this happening' and who am I normally going round my head. I also felt like my brain was trying to fit back into my body but it kept missing and couldn't lock on to it and that left me feeling like I was spinning and with each rotation my brain would miss. This made me feel quite dizzy. The whole time I had a feeling of fear of never being able to get back to where or who I was before and the whole prospect was daunting.",
  "Finally it hit me that I had done this to myself and that this was a voluntary experience. This thought helped my identity come back as the thought that I actually had some control over this was a sobering one. The spinning slowly subsided and my brain locked back on to my body. Even being fully aware of where I was and why it still took a while to get sentences out as I tried to explain to my friend what the hell just happened. The dizziness stayed for a while, longer than I had previously experienced. I think the alcohol had an affect on this.",
  "I have done it a few times since and have never had a stranger trip as this. I would of thought the alcohol would of dulled the effects. In a way the strangeness seemed dulled as it seemed less psychedelic and the objects were physical ones (like my leg) and I think the alcohol had maybe grounded the ability to completely abandon the physical world. In all Id say that the alcohol prolonged the experience but didnt hinder it at all nor did it make feelings of anxiety disappear."
 ],
 "erowid": {
  "id": "40631",
  "citation": " Escaped. \"Lost Inside My Own Body with No Identity: experience with Salvia divinorum & Alcohol - Beer (ID 40631)\". Erowid.org. Apr 14, 2006. erowid.org/exp/40631",
  "substance": "Salvia divinorum & Alcohol - Beer",
  "views": "4742"
 }
}
