{
 "id": 7013,
 "title": "Quite Funky",
 "date": {
  "submission": "2007-06-27T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Eugene Oregon",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Cyclobenzaprine",
   "form": "pill/tablet"
  },
  {
   "time": "1:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Cyclobenzaprine",
   "form": "pill/tablet"
  },
  {
   "time": "1:00",
   "amount": "4 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I got 8 pills of cyclobenzaprine and took 1 of them at around 7 o'clock that night. ",
  "After an hour, I started to feel a body high coming on, so I popped 1 more pill.  After that, I felt pretty relaxed, but I was unable to form complete and audible sentences.  I then smoked 3 or 4 bowls of marijuana, and for the rest of the night I had the weirdest feeling.  I have some experience with LSD, and the effects of this cyclobenzaprine were close to that of the coming down off of LSD.  There were no visuals, but my mind was not completely in reality.  I was in a trance walking back to my place, and was unable to keep myself awake for very long. ",
  "I slept for 9 and a half hours, and when I woke up, the feeling was still there, just diminished.  I tried going to class, but was unable to focus for any period longer than 5 minutes (usually I'm good at taking notes).  I felt generally fucked up until about 4 o'clock.  By 4:30 I was fine, so I decided to smoke.  This brought me back into the same mindset I had had the night before.  I stayed in that mindset for about 2 hours.",
  "Cyclobenzaprine is a very odd drug.  It is not fun, but it is not all together unenjoyable.  I personally do not want to take it again. Cyclobenzaprine just did not provide the kind I'm used to and like."
 ],
 "erowid": {
  "id": "40641",
  "citation": " Eugene Oregon. \"Quite Funky: experience with Cyclobenzaprine & Cannabis (ID 40641)\". Erowid.org. Jun 27, 2007. erowid.org/exp/40641",
  "substance": "Cyclobenzaprine & Cannabis",
  "views": "45521"
 }
}
