{
 "title": "When Light Exists in Darkness",
 "author": "Jungle Girl",
 "citation": " Jungle Girl. \"When Light Exists in Darkness: experience with Mimosa hostilis & Syrian Rue (ID 70143)\". Erowid.org. Jul 2, 2008. erowid.org/exp/70143",
 "substance": "Mimosa hostilis & Syrian Rue",
 "bodyweight": "150 lb",
 "report": "<p>Nearly seven years ago, in July of 2001, a dear friend prepared ayahuasca for me in his California home.  I was quite an experienced and confident entheogen user, so when my friend handed me the sealed jar containing about 4oz. of muddy looking liquid and said, Take this at night.  Avoid foods x, y, and z (he gave me a list).  Come back and tell me what happened, I simply said, Okay.  Knowing that he lovingly and caringly provided and prepared this mystery mixture, I was excited to see what was in store. </p><p>A different friend and I drove to King Range in coastal Mendocino County, also known as the Lost Coastthere are no lights at night and its very difficult to access. My experience was profound.  Every living thing I tuned into, the trees, the bushes, people campingthey all told me a story.  I was telepathic. The colors were vibrant and when I closed my eyes, my vision split into 4 quadrants.  In the center sat a serpent, coiled, and it looked like we were moving through space at warp speed.  In the upper left quad, I saw an old man who looked to be a native Indian man.  In the upper right, he was standing in a cave, preparing something in a cauldron-type pot.  In the lower right corner, he was now with others who were seated around the fire and he was teaching them.  In the lower left corner, there was a jungle and I could see plants and animals moving.  It was a very nice and positive experience that lasted about 4 hours. </p><p>When I returned to my friend who made the drink for me and told him of my experience, he said, Did your visions look like this? He showed me ayahuasca artwork that looked strikingly like what I had seen and told me that people had been having these visions for thousands of years and that South American native Indians would take it as a means to understand the earth consciousness- that the plants could teach the humans how to use them for their benefit and survival in the Amazon jungle.</p><p>It is important to note that I believe our minds create our reality.  If our world is one of fear, then we shall know fear.  If our world is one of love, then we shall know love.  I have no problem letting go of who I think I am to embrace the belief that I am (and you are all) everything a Universal Consciousness of One.  So with that, its probably true that I allow myself and fully expect to have ALL mind-expanding experiences through entheogens.  In other words, it might be important to come from a good place in ones mind.</p><p>This past week, March of 2008, I had the opportunity to take ayahuasca again.  I visited the same friend who, this time, did not prepare it for me.  He gave me instructions and enough for two doses the ratio was 5 to 1 with 15g of mimosa hostilis root bark to 3gm of syrian rue seed (in this case the amount was doubled for 2 doses).  I ground the seed into a fine powder using a coffee grinder.  Some people seem very particular about the utensils used to prepare ayahuasca.  In this case, I used a 2-quart cast iron pot.  In the pot, I added the root bark and the syrian rue powder to enough boiling water to just cover the top of the root bark.  I brought it all to a VERY slow boil and then I simmered it for about 15 minutes, stirring gently and deliberately like I was making a delicate family recipe.  I envisioned myself being the shaman I saw during my first trip seven years ago and put a lot of energy into the process.  After the first boil, I poured the contents into a French press coffeemaker.  I poured out the liquid into a glass and put the solids back into the pot where I repeated this process for a total of three times.  On the 4th boil, the solids were removed and discarded and I took all the liquid collected from the first three boils and simmered it over a low/medium heat until it reduced down to an ingestible amount of approximately 4.5oz of liquid per dose for a total of about 9oz.  The entire process from start to finish lasted about 2 hours.</p><p>This time, I was located on top of a mountain in the Redwoods at a friends home.  Because ayahuasca is visually active in periods of darkness, this seemed like an ideal location.  I must state that most people fast before taking ayahuasca because it tends to be difficult for the body to digest and can cause some intestinal distress.  A lot of people believe that theyll vomit if they eat.  This doesnt have to be true.  It easily can be true, but is not some categorical imperative - I would say it depends on the individual. </p><p>I began to feel the effects within 15 minutes after the initial ingestion.  The taste and smell, as one friend said after sampling it, was like roasted barley.  It had the consistency of chai tea (might have been good with cinnamon and cardamom!) and I strongly recommend using the French press as a means of filtering the water during the brewing processit did a fantastic job of keeping the solids out and was clean and easy.</p><p>Since I made two doses, the friend at whose home I was staying also shared some of this brew.  He was sitting at the mountains peak, watching the clouds creep into the valley, as the moon allowed him to see every droplet of water that passed before us, eventually engulfing us in a fine, wafting mist.  I was drawn away from the house and anything manmade, I could feel the forest calling me.   I didnt like the way metal feltwhatever makes metal, metal just didnt seem like something with which I wanted to commune. </p><p>I could hear female voices whispering in the trees, Is she coming? Will she come?  This was unfamiliar territory and once belonged to bears and is still home to wild cats, so I was frightened that my wobbly legs would give out and I would plunge off the side of the mountain.  I come from the east coast where the land is flat until about 60 miles inland, so tripping on a mountain is a bit awkward to say the least.  I asked the forest to be kind to me and protect me, to guide me.  There were cement pavers that created a walkway to go down.  A tree that was very definitely a female energy started dancing in the moonlightshe was graceful and her long, thin arm reached for the sky as she arched her back, showing her form (Go Girl).  And as I descended down the mountain and into the darkness (the only light was from an excruciatingly bright, almost full moon that I wanted to escape), I turned to see an enormous redwoodthe vibration of the redwoods is so, so deep.  They move slowly and deliberately.  There is no wasted energy.  I was brought to my knees as my trip came in full force. </p><p>Im 32 and have been tripping for precisely half my life.  Never in my life have I experienced what happened to me the other night.  In fact, no amount of LSD (or any of its derivatives), mushrooms, peyote could ever compare to the strength of ayahuascaat least in my opinion.</p><p>I was literally brought to my knees and all I could say was, Oh my God, repeatedly for about a minute.  I started to thank the trees and especially the old man tree standing in front of me, a mere second growth baby in the world of the Redwoods, but huge compared to other trees.  I could see his facehis old eyes, his mustache and hand that was tucked, compacted into his enormous form.  He didnt talk like you or I, but I could hear his voice.   I could hear and feel a vibration that came through as a kind of speech.  But the voice is not audible like when talking out loud; rather, it was felt.  It was a vibration that hit me in the chest and top of my head. After recounting this story to a quantum physicist friend, he related the vibrations to sound waves.  And EVERYTHING vibrates!  I am now completely convinced (if only moderately prior to this experience) that these vibrations and waves are what create the material universe. The tree was embarrassed that I would bow to him and he asked me to get up.   He wanted me to know that we are equal.  Once I paid my respects and gained my composure, I felt safe to enter the forest where skeletons waved at the side of the path, telling me where to go.  I thanked them.  They were wicked looking; with smiles on their faces and bright, vibrant colors, lines and patterns composing their forms.  The designs were the brightest, most intricate, most beautiful, amazing colors that I have ever seen.    </p><p>The skeletons showed me where to go and I walked in complete amazement and surrendered myself like a child in the arms of her mother.  And suddenly, I looked up and was under the canopy of a circle of redwoods that formed the most beautiful cathedral that I had ever seen.  I was standing in a church and could see stained glass, walls, corridors, an entire architectural masterpiece of interwoven, superfine lines that were creating material and non-material space right before my amazed eyes.  I was speechless and kept whispering, Wow There are simply no words to do this justice.  Im trying my best, but I think its impossible to give to a fair representation through verbal means and if I were a better artist, maybe I could hope to come close. </p><p>I wanted to find my friend, but I couldnt leave.  As my friend said later when we did find each other, Its like were more aware of the Earth.  But the difference is that Earth knows we are aware and its excited!  Its so true.  At one point, we were discussing the idea that this material world we all share is like a kind of meeting place for interdimensional beings who are really scattered throughout the cosmosthis is our Universal chat room- a physical meeting ground for our spiritual selves.  How incredible is that idea?  Well, it makes a lot of sense to me, especially when I relate it to dreaming.  Tell someone in your dream that they are simply a manifestation of your mind and I promise you that person will tell you that youre crazy.  That person in your dream, who you are dreaming, is as real as you or I.</p><p>Forced to the ground by the most spectacular visions of my life and overwhelming feelings that Everything was in perfect balance, I huddled into a fetal position and hid my face from the light beneath my hooded, black sweatshirt with a peace sign that forms when its zippedah, my refuge.  Because even in the thick of the forest, that pesky moon follows like a little kid, teasing the dark, Nyah, nyah, here I am!  You cant catch me! I started laughing hysterically and was fully convinced that I no longer had the ability to walk. </p><p>Now, in the darkness of my mind there was an entirely different world- a digital, multi-dimensional world of infinity.  Wow.  My laughter grew louder and I said to myself, Youve really outdone yourself this time, Kiddo.  But where was my friend?  He had to see what I was seeing!  Suddenly, I heard him calling me, Is that you?  Its me!  I mean, I think its me Who am I again?  Oh right, I am Everything too.</p><p>My friend sat with me and lay on his back.  I told him to close his eyes and he replied, No, Im not quite ready to go into the darkness!  He told me that looking at the bright sky as the clouds passed over was a much safer place to be.  No, no, no!  Bring the darkness!  Its Wonderful!  I placed my head to the side of his head and closed my eyes.  A flash of red light that looked like a small sun shot into the center of my brain and I could see a larger light inside of my partners brain- these lights merged into one, great light that shot out from our heads and into the sky.  I felt this beautiful male-female energy that made me feel like we were the embodiment of the Earth Father and Mother.  Im fairly certain that this was a shared experience of an exchanging, yet combining great moment of Love.</p><p>When we sat up, I moved my hand from in front of my face and then quickly outward to try to see what the trails would look like.  With LSD, the trails end where the movement stops.  On DMT, time is slowed and the trails continue on into space, creating matter as they float on, endlessly.  I was convinced that the Universe is a giant fractal image.  An infinite number of recursive functions that shoot off into super-fine lines of brilliant colors creates screen-like images that are like a maze of mirrors, opening up and moving, sliding all over, everywheremaking up the whole of everything.</p><p>We composed ourselves and laughed our way back to our friends who acted as our more grounded observers.  I was mad with emotion and excitement and begged my co-captain to journey back into the forest.   The Earth is funny once it realizes that you realize.  Some people say the Earth is angry that we have abused it and beat it into submission- I believe the Earth bears no hostility toward us what-so-ever once we realize that we are all equal.  Our abilities as human forms allow us to help protect our friends who do not have the luxury to uproot and find a new place to live. </p><p>Funny to me at the time was how the redwoods do not move for us, but how they move for the fog.  They drink from the moisture in the fog, the need the fog.  The trees have a different relationship with the air than we but everything works like a sleek and efficient machine all of its parts moving in unison, dancing and vibrating to a Universal Song.</p><p>My friend and I continued into the forest and our grip on our physical bodies was much more firm.  We winded down the mountain, listening to the smaller trees shout out to us.  They were youthful voices that wanted us to pay attention to themntheir branches extending to greet us like hands in a crowd of people who are waiting to catch a glimpse of someone famous who, if they were lucky enough, might get a handshake.  But there are SO many voices!  Come deeper!  Come see us too!  So, like any person who is overextended in obligations to others, one must apologize to the others and thank them for their hospitality.</p><p>One particular tree called out to me.  What kind of tree is this?  She is so very sweet.  She wants us to touch her.  My friend replied, Ahh, weve had a relationship with this tree for thousands of years.  Its a Laurel Bay tree. </p><p>One of our sober friends, the physicist, once asked a question several years ago as to how he could fuck nature senseless.  Well, I decided in that moment, that in order to fuck nature, you do it literally.  My tripping partner thought it a good idea to French kiss this little cutieso I joined him.  Our scientist friend informed us that leaves have little mouth-like receptacles called stomata that allow for the passage of water and air into the plant.  When we placed our hot, wet tongues on the leaves, the plant seemed to be quite receptive to thisshe had never been so intimate before.</p><p>My first ayahuasca experience in 2001 lasted about four hours.  This time, we tripped HARD for 9 hours.  The intense visions would come in waves of very calm to 40ft crushers that pounded me into the ground and completely flattened me.  Though neither of us threw-up, there were times when I found difficulty in relaxing my stomach and felt tensebut a little human touching in the form of a back rub, a warm blanket, and cuddling made all the unpleasant feelings fade away.</p><p>I forced myself to sleep only to be awakened by the morning sun that beamed down into the large windows and the clear, beckoning blue sky that promised a new perspective into the nights affair. </p><p>When taking ayahuasca or any life-mind-altering substance, its important to be with responsible people who have their heads together.  The right setting is also imperative and the redwoods seem to be idealor any place where one can be Free to Be.  Another thing is that I was prepared to trip for 4 hours.  9 hours took a toll on me by the time the 7th hour rolled around, because I hadnt bargained with myself that the length and strength could be so intense and persistent.</p><p>But most of all remember that darkness is our friend.  Without the darkness, we would know no light.  There is much to be explored in and out.</p><p>One last thing</p><p>I offer my ever-living gratitude to my cosmic family for allowing and helping me to be Free.  I hope that one day we can all have a group mind-melding orgy with the Universe.</p><p>Love.</p>",
 "year": "2008",
 "id": "70143",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-07-02T07:00:00.000Z",
 "views": "29685",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "15 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "(tea)"
  },
  "1": {
   "time": "",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(tea)"
  }
 }
}
