{
 "title": "Electro-Neuro-Psycho-Plasmic Jungles",
 "author": "Gilead",
 "citation": " Gilead. \"Electro-Neuro-Psycho-Plasmic Jungles: experience with DMT & LSD (ID 70215)\". Erowid.org. Dec 30, 2009. erowid.org/exp/70215",
 "substance": "DMT & LSD",
 "bodyweight": "143 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "",
   "LSD",
   " T+ 7:00",
   "1 hit",
   "smoked",
   "DMT"
  ]
 ],
 "footer": [
  [
   "2007",
   "70215",
   "Male",
   "",
   "Not Given",
   "Dec 30, 2009",
   "3901",
   " "
  ]
 ],
 "report": "<p>The following is (most of) a letter to a friend, recounting my first experience with DMT, written the day after.  </p><p> _____</p><p>I guess I'll have to take what I can get, given that my telephone isn't working, and write you this message. This letter is going to take on a strange narrative quality as a result, but I'm sure we'll speak about it in person at a later date anyway.</p><p>I had an opportunity to try DMT yesterday. It kind of came my way unexpectedly, after I'd assumed that the night was over. I've had a great week, due to a few things, all unrelated to DMT, and mostly unrelated to each other. But that particular night had been kind of disappointing up until that point. So I'm sitting there, previous plans totally failed, outside my dorm, smoking cigarettes just because I'm bored. I get a call around 11:30, and a friend of mine tells me that she'd gotten ahold of some DMT at Langerado, two weeks ago, and she and a couple others had decided to get into it.</p><p>But enough with the backstory, off we go!</p><p>There's an oil-burner hooked up to a dry bong. I'm holding a lighter underneath it's bulb and watching the vapors collect as I draw them into the main chamber. I'm the fourth person to be sent off. I'd later lose track of how many people try it (six, I think), but four of us were first timers, and it was nice to be able to share that. I've got alot of anticipation about it, especially considering how unexpectedly this turn of events has come about, but I realize that no amount of reading or self-education could fully prepare me for what I'd hoped was about to happen.</p><p>So: fwoooosh! I inhale and oh jesus christ this shit is harsh. It tastes like sweet-n-low mixed with mothballs. Fuck man, my lungs are totally rejecting this shit. I exhale, start coughing uncontrollably, and start to wonder if I'd been able to hold the vapors in long enough. Before that thought could even be processed, though, I get hit in the face by a sledgehammer made of space and time. Everything starts bending and warping around itself and I fall backward, unwittingly, from my seated position and find myself prone on the carpet.</p><p>At this point, I'm still aware of what's going on around me, and I want to get away from the people talking and dim lights. I want total silence and darkness. So, and I have no idea how I was able to do this, I take off my shirt (who knows why man, it just felt good), get up, and go into the next room where I can get just that.</p><p>Once there, I get back on the floor, close my eyes, and then it really starts. It takes me a few seconds to realize just what is happening, but I'm in a dark electric jungle, pulsating and alive with intelligence. Even amidst all this, what fascinates me is the way that my mind is completely open to the effects of this substance. Maybe it's because it already occurs naturally in the human brain, but this substance definitely exists on the same wavelength that I, daresay, we as humans, do. And unlike the shift in reality that's caused by an LSD or mushroom experience, this is a complete replacement of my mental reality. I no longer have a body. I am mind without borders.  Intelligent vines wrap around themselves, bent to the laws of a new physics, welcoming me.  The negative space that I occupy is saturated with intelligence, and it belongs to me as much as I belong to it.  I pass through several such spaces, each as indescribable as the next, until I make my way back to where I began.</p><p>And, what seems like minutes later, I'm back on earth. Things still aren't quite the same.  Of course, some of that may be thanks to the acid I dropped about seven hours ago.  I made a decision to bring a familiar light with me while I basked in the afterglow of a new one.  I am extremely happy with the way my post DMT acid trip has gone, as I feel I've been able to reconcile alot of my differences with psychedelic culture, but more importantly, with myself.</p><p>I am no longer afraid. There were moments, the truth and beauty of which were so great that I am almost sad that I have to be alive for any times but those. But in those moments, I was ready to die, and now, I'm ready to live.</p>"
}
