{
 "id": 7023,
 "title": "Natural Anxiety Relief and Pure Bliss",
 "date": {
  "submission": "2006-03-15T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kitten5",
  "gender": "Female",
  "weight": 58
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  },
  {
   "time": "0:00",
   "amount": "2 tsp",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  },
  {
   "time": "1:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Kratom",
   "form": "(dried)"
  }
 ],
 "report": [
  "This is a report regarding Kratom as an aid in calming anxiety.  I am currently taking Prozac (fluoxetine) and am experiencing jitters.",
  "I have suffered many years of depression and anxiety, and realize it's in my physiology to be this way.  I have turned to drugs too many times in the past to escape my problems.  By the time I was 22 I was addicted to pain meds (oxycodone specifically) and had tried cocaine numerous times. The cocaine sent me to the ER numerous occasions on the come down, when I thought I was having a heart attack (each time it was just a full-blown panic attack).",
  "I recently started Prozac and have just upped my dose to 20mg.  I am very sensitive to antidepressants and have tried all of the different types to help with my illness.  Prozac is so far, so good, and it is only my 3rd week.  The only problem is insomnia and anxiety...which should go away.  And a minor headache.  I took my last 5mg oxycodone the other day and found it helped my side effects greatly.",
  "I have heard many things about Kratom and wanted to give it a try.  I don't want to take anything addictive as I become way too consumed in things quickly.  I ordered 12g of premium powdered kratom online, and decided to make a tea.  Since I am new to the prep process, I simply put a cup of water in the microwave for 2 1/2 minutes and brought it to a slow boil.  I mixed 2 teaspoons of the kratom powder in the water and let it sit. I also squeezed two lemon wedges into it. The mix was VERY gross looking, kind of swampy.  I noticed the smell to smell like catnip, lol.  I stuck it in the microwave and reheated it after about 5 minutes.  I let it sit for approx. 15 minutes.  By then I was so anxious to try it that I started draining it into another cup via a coffee filter.  It looked like a light brownish green color, and smelled like green tea.  ",
  "I drank it with lemonade as a chaser, and the taste wasn't SO bad.  Very bitter, kind of dried my throat (which may also be the prozac).  As a side note I had taken my prozac about two hours earlier.",
  "Within 5 minutes, seriously, I knew it was the real thing!  I kind of was afraid, not sure what would happen with prozac in my system.  It almost felt like I was about to trip, like a mushroom trip.  After 15 minutes I felt sort of drunk, and didn't feel any of the euphoria I was expecting.",
  "After 45 minutes I feel great!  I have no more jitters and am pleasantly relaxed. I will surely do this again.",
  "About an hour has passed and I have tried smoking a small bowl of it by itself. It has helped the feelings persist without the initial jitters."
 ],
 "erowid": {
  "id": "40681",
  "citation": " Kitten5. \"Natural Anxiety Relief and Pure Bliss: experience with Kratom & Fluoxetine (ID 40681)\". Erowid.org. Mar 15, 2006. erowid.org/exp/40681",
  "substance": "Kratom & Fluoxetine",
  "views": "11140"
 }
}
