{
 "id": 703,
 "title": "Biggest Negative Was an Itching Sensation",
 "date": {
  "submission": "2004-11-23T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SirDawg",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablets",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "Codeine"
  },
  {
   "time": "2:30",
   "amount": {
    "unit": "tablet",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Codeine"
  },
  {
   "time": "0",
   "amount": {
    "unit": "glass",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "I was hanging out at a friend's house (call her Friend A) who had invited several of us over to watch a movie. Another friend of mine (call him Friend B) was looking in the cabinets and found a bottle of codeine pills (which I later found were leftovers from Friend A's wisdom tooth surgery). He grabbed two for each of us and we took them about 45 minutes before we watched the movie. I was cautious about taking codeine, especially two pills, but he was more experience drug-wise than I, so I trusted his judgement.",
  "I could definitely feel the effects setting in. They started about the same time we sat down to watch the movie, about 45 minutes. The first thing I noticed was a tingling sensation in my legs which then spread to my body. Friend B and I were both soliciting backrubs from Friend A because of how much more sensitive the drug made us feel. I also found myself to be more vocal than normal, and in an overall uplifted mood.",
  "The biggest negative effect which was prevalent the entire time was an itching sensation which, once again, was most noticeable in my legs.",
  "Later I was sitting in a recliner and felt a strong buzz or 'zoning' feeling come over me, almost like I could sink into the feeling at will. What I found strange was that if I stood up and walked around, I felt extremely alert and active.",
  "Around T+2:30, we agreed to each take a third pill although we were still feeling the effects of the first two. This did not create any new or astounding effects, but it did keep the buzz going longer. We then drove to my home after about 30 minutes. Surprising, once in the car, I didn't feel quite as sober as I thought I was. Nevertheless, we got home safely. :O) [Erowid Note: It is extremely dangerous and irresponsible to drive while under the influence of a psychoactive substance. Don't Do It!] ",
  "Once home we drank a beer apiece and were surprised at how it gave us a noticeable buzz. I feel asleep still feeling quite good, almost 5 hours after the first two pills.",
  "The only other thing I would note is that I found myself craving the drug the day or so after. I would do this again, but only periodically."
 ],
 "erowid": {
  "id": "11789",
  "citation": " SirDawg. \"Biggest Negative Was an Itching Sensation: experience with Codeine (ID 11789)\". Erowid.org. Nov 23, 2004. erowid.org/exp/11789",
  "substance": "Codeine",
  "views": "25848"
 }
}
