{
 "id": 7031,
 "title": "Setting off a bomb in my head",
 "date": {
  "submission": "2000-12-04T08:00:00.000Z",
  "experience": "1998"
 },
 "author": {
  "name": "The Trippin' Jew",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "9 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "I was sixteen at the time, and had been selling weed and acid for three months or so.  I was doing well at it, making quite a bit of money, and smoking herb for free, and was quite happy all around.  So, it came to pass that one day I had a sheet of KISS acid laying around.  I had tripped eight or nine times before, but I had only taken three hits at most, and hadn't really experienced the intense visuals I had heard and read so much about.",
  "So, on a Saturday before I went to a large concert with some friends, I decided to test my limits.  I took out the sheet (it was called Darkstar, because it had the Darkstar skating logo on the back) from my stash and cut off nine big hits, and promptly ate them.  It was one thirty or so.  My mindset at the time was one of anticipation, although once I had eaten the hits there was a bit of anxiety.",
  "I smoked a joint and waited for the acid to kick in while I watched cartoons.  It was about two in the afternoon when I felt the first tingle of acid.  I started tap my feet while I watched tv, and then the jaw clenching started in.  I could feel that this was this was going to be a big one.",
  "The last time I checked the clock was at three thirty.  At this point, my mind was starting to turn over at itself.  I was pacing back and forth in my room, muttering to myself, thinking about my life.  All the small petty lies I had told and the stupid betrayals were coming back to me, and I was cursing myself for being such a piece of shit.  My friends were supposed to come pick me up at four, and I decided to go outside and smoke a cigarette and wait for them.  I had been in a dark house until this point, and when I walked outside, it was like getting hit in the head.  The sun was incredibly bright, and the asphalt and concrete seemed to bubbling under the heat.  I stood for a moment, unsure of what to do, and then decided to stay on the porch and smoke for a while.",
  "As I sat on the porch, the street started to squirm back and forth.  I had gotten a few visuals like this before, and I watched, enjoying it.  Then a car drove by, and the noise hurt my head.  The sun reflected off the side window of the car, and the light stabbed me in the eyes.  My friends arrived after a while, and as soon as my friend Ryan saw me, he knew I was tripping.",
  "By this point, I decided that there was no way I could handle a concert in the sun today.  I told Ryan I wasn't going, and he asked if I wanted anyone to stay with me.  In retrospect, this would have been a good idea, but at the time the mere idea of having to relate to anyone seemed terrifying, so I declined.  They left (the metal on the car dripping off as it drove away) and I went inside to my room.",
  "At this point, I started losing touch of where I was and what was going on.  I kept on closing my eyes and decending (acending?) to some different level.  Inside my head, my thoughts had turned from self-critical to simple curiosity.  I spent along time thinking about losing my virignity, and then suddenly began to think about my bar mitzvah.  I wondered mostly about what exactly these things meant, and how they had changed me.",
  "Finally, I couldn't stand it any longer, and I had to get out.  So I ran to my backyard and laid down in the grass (at this point, it was almost dark outside).  This was a bad idea, as the grass seemed to crawl all over me, full of bad vibes.  I got up and walked to my front yard and looked down the road.",
  "This is when the first real hallucination started.  The road was neon and shimmering, and along it raced numbers and letters.  The numbers would approach me, and as they passed I would feel a soft breeze go over me.  The world had transformed itself.  I looked at the road and could taste it.  Once again, I retreated to my room.",
  "My room became both my sanctuary and a symbol of everything wrong in my life.  I wanted so badly to leave, but at the same time felt that the world was a dangerous place.  So I stayed in my room and watched the walls.  The walls were convulsing, like a muscle, and small shapes kept popping up, like they were directly under the paint.  Then a grinning demon face came up from the wall, and looked at me.  This demon wanted to kill me, I understood.  At this point I had forgotten I had taken the acid and simply watched in horror.  As I looked up, the celeing contained a body, floating slowly back and forth.  I retreated to a corner and watched as my room continued to meld and morph itself.  It reminded my of a Disney cartoon, when everything is kind of dancing.  I was sure I was losing my mind, sure that there was no way my mind could handle all of this without breaking.",
  "Finally, at some point, I decided that I needed music.  With much difficulty, I selected a Pavement album (Crooked Rain, Crooked Rain) and started listening to it.  I don't remember the CD, but Pavement did get me started thinking about weed.  Suddenly, I remembered that I had a half pound of the stuff sitting in my closet.  Weed was the answer, I suddenly saw.  I grabbed my purple bong and loaded a bowl, again with much difficulty (the weed squirmed under my touch, and it was very hard to get it to go into the bowl).  I don't know how many bowls I smoked, but I smoked a lot.  I smoked like it was the only way to survive, which I felt it was.  Finally, I felt like I was returning to reality.  Things were still squirming a bit when I looked at them, but I knew that this was just because I had taken acid, and that there was a fundamentally solid reality beneath this.",
  "I looked at a clock and was shocked to see that it was nearly eleven in the morning.  I had been tripping for twenty hours or so.  I got up and called my friend Ryan on his cell phone.  He has been out partying all night, and I went and picked him up from a kid's house, and then we went and grabbed some breakfast.  The food was actually incredibly good, and I felt extremely good.  The world was no longer dangerous, but a warm and gentle place.  After I ate, I went over to Ryan's for a while, and ended up falling asleep over there.",
  "That was two years ago, I have never taken that much acid again.  I've also never lost contact with reality that degree again.  I've candyflipped since then, which fucked me up a lot a more and was much more enjoyable, because I also felt so fucking good and loved up.  In the future, I may try to test my limits again.  However, this time I will have a friend I know I can trust with me, and remember to have my bong out and ready for duty."
 ],
 "erowid": {
  "id": "4072",
  "citation": " The Trippin' Jew. \"Setting off a bomb in my head: experience with LSD & THC (ID 4072)\". Erowid.org. Dec 4, 2000. erowid.org/exp/4072",
  "substance": "LSD & THC",
  "views": "11889"
 }
}
