{
 "title": "The Edge of Reality",
 "author": "Zenbedouin",
 "citation": " Zenbedouin. \"The Edge of Reality: experience with Mushrooms (ID 70346)\". Erowid.org. Jun 11, 2010. erowid.org/exp/70346",
 "substance": "Mushrooms",
 "bodyweight": "132 lb",
 "header": [
  "DOSE:",
  "1.8 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>I have begun to call this last shroom trip, The Trip. Being the fifth time Ive ever tripped, over the course of 6 months, it was as if I was doing the drug for the first time. It was like a different drug, as if all the other trips didnt count. This was definitely due to all of three major factors: The extreme potency of this particular batch of mushrooms (I am in the belief they are from a strain aficionados call Reality Benders), the fact that the trips setting, the campus of Florida Gulf Coast University on an empty Friday, was so unfamiliar to me, and the fact that this was the first time I tripped without a sitter, and with only one person, my beloved girlfriend, Camille.</p><p>This was the best and also most intense of all of my shroom trips, and it met and exceeded every desire I had ever hoped to experience on mushrooms. It was so different and separate from my other trips because for the first time, I couldnt pass off the things I was seeing as effects and visuals caused by a drug; I was firmly of the belief that either reality had actually changed or I was seeing reality as it had always been.</p><p>I drove up from Miami to Ft. Myers on that Friday at noon to meet my girlfriend and have the shroom trip. It turned out to be at first a little bit of a cloudy afternoon, but we went and found a nice grassy spot under a tree by the lake on the Everglades campus anyways. Having been warned to eat less than 1/8 an ounce of these particular shrooms, we each started with half-eighth of finely chopped shrooms in a tuna sandwich and a chicken salad wrap. Camille didnt really enjoy the tuna sandwich, saying it didnt really mask the taste or texture very well, but I personally recommend a chicken salad sandwich like the wrap I had made, as the mushrooms were barely noticeable and it was delicious.</p><p>At any rate, we finished every bite, and settled in to listen to some Debussy on my portable speakers and meditate. At this point the extreme potency of these shrooms started becoming apparent. We very quickly felt the first effects of the mushroomswithin 10 minutes we both felt the common tingling sensations and a similar high. Another 10 minutes and we had returned from a quick walk to a nearby bathroom back to our picnic area, and were starting to feel the intensity of it all. This is where I would make my first important assumptions about what I learned on this trip.</p><p>As we sat there, the intensity continued to rise, but the disorientation and slight nausea of the shrooms were giving me a bad vibe and uncomfortable disorientation that I trusted from previous experience would dissipate very soon. However, the discomfort continued to rise and I found myself turning in on an intense introspection, which is not the right direction to take to enjoy shrooms. At this point, I was in the midst of a not uncommon phase of the shroom trip that my friends and I have started to refer to as The Stacking. This is a stage that occurs, not every time but occasionally, usually earlier on in ones shroom trip, where the mind seems to become sticky or choppy, and every thought leaves an afterimage that stacks above the last, creating an uncomfortable clutter in the mind. This also feels like every time you try to internalize a thought it gets chopped or deleted before you can finish it. I had changed the music from Debussy a bit too soon; I chose upbeat music that would be better suited for the later blissful and euphoric stages of the trip, and listening to Bassnectar now was just a little too intense.</p><p>It was Camille who, feeling similar discomfort, made me realize this important assumption about the shroom tripping process. She noticed my tension while I actually started to pull into a fetal position on the ground, and discouraged me from pulling so into myself and not focusing on what was around me. She finally solved our feelings of discomfort by the end of the hour when she made me try changing positions and looking at different things to observe instead of pulling in. When she made me turn in the opposite direction and face across the lake, we started to feel our tension lighten, and right when we had finally relaxed, something I did made us both chuckle, and this seemed to free our spirits and connect us with joy so that as one, we broke through to the other side of the dimensional barrier and it felt like we were finally there. This was the true beginning to the mushroom trip. Everything before had just been a challenging digestion.</p><p>As quickly as it had come, although I never noticed it happening, all feelings of intensity and discomfort were gone and the trippiness of it all became the focus. We were smiling, laughing, and entering a very euphoric state, and the immensely pleasing visuals began to take form. Now, the assumption I have made is that every shroom trip experience takes you to a metaphysical gateway in the mind or spirit, a barrier of the psyche between the layer of reality we commonly experience, and this deeper one. So, the stronger the mushrooms, the thicker the barrier between the worlds, and the harder the push it is to break through it. Where I was as far as my social energy state during the first hour when Camille and I were tense and overexcited was stuck in between the barrier of both states of consciousness, or stuck between dimensions if you will. It seems we could only break through this time if we opened our minds to each other and went together, thus activating the true happy shroom trip and leaving the lower perception of reality completely.</p><p>Coincidentally during this moment of opening up, although I was not aware of it till later, the cloudy skies had cleared up into a beautiful open blue sky with white clouds and bright sun. This rise in light certainly did its part to make the surroundings more beautiful in magnificent light and brighten our spirits with energy. At this point things started changing from our normal perception drastically, and weve confirmed for the most part that our visions at the time were the same, as we were very connected from then on. The tall swamp pine trees, we noticed, started all moving and swaying around in a very animated dance like way. It was very precise and repetitive, and this greatly pleased my senses and added to the euphoria I was starting to feel.</p><p>It was like I had suddenly become one with the entire universe and could feel it all as if it were the parts of my infinite body, all in harmony and unison, and the treetops were dancing to express my joy. I FELT it. This was very strange and powerful, as my feelings began to grow. My visual perception of my environment and of reality in general, began to change into a very clear and simple one, yet one very powerful and complex.  Words come to mind to describe my senses at those early stages, such as digital, liquid, energy, and even computer-animated. The way those trees were moving seemed unreal, yet there it was.</p><p>One thing that I had said powerfully different about this trip was that the things I saw and experienced didnt seem to fit into the realm of hallucinations. The term visuals just didnt seem to encompass what was happening this time. Going into my first trip, I had heard many descriptions from friends whod had powerful experiences, such as seeing plants morph back and forth through their birth-death cycle, seeing clouds forming faces and moving like kaleidoscopes, etc. And meanwhile, my first four trips, while all very powerful cognitive and emotional experiences of the mind and senses, all contained visuals that like I said, I could for the most part ascribe to the effects of a drug. These included seeing still photos of space and of artwork become briefly animated, seeing Camille draw artwork that would also temporarily become animated, or seeing objects distort slightly in size or position, only to return soon after. All those glimpses were extremely captivating and enjoyable, but seemed to lack meaning, and would usually occur for a fleeting period later on in most of my trips (not to say I dont still think all of those trips were crazy and amazing to this day).</p><p>Now I was already clearly seeing everything around me dancing with living spiritual energy by the time less than an hour and a half had passed, and it wasnt fading away or stopping once until I came down 6 hours later. In fact, after this began, all of visual reality seemed to lose its solidity in my senses. Solid, liquid, and gas seemed to lose meaning, as I felt one with the world around me, and everything seemed to be made of pure energy, to be shaped by the active will of God and all living things together in unity. Change was constant and nothing was necessarily static or constant from one moment to the next.</p><p>The next few visuals I experienced were all lovely and beautiful to the psychedelic mind. All of the repeated patterns started emerging in the shapes of everything around me. The fractals were more evident and prevalent in everything than ever before. Also, the visual patterns of the long grass we were sitting in and the pine needles all around would often warp my vision into very mechanical perfect zigzags. The sense of aesthetic perfection in everything kept rising until I began to see symmetry everywhere, from our faces, to the trees, and even the sky. Looking at the sky triggered an overwhelming sense of wonder and oneness, and for a time it seemed that all the clouds had been cut as if from the same cookie cutter. I began to truly believe that M.C. Escher himself were a god or higher being, and that he was actively painting us on his canvas right then, in one of his perfect tessellations. This lasted for a time, until the constant change took over again, and lying helplessly and rapturously  on my back with Camille in the grass, I saw other patterns; more symmetry, faces and shapes emerging from the clouds, and mirrored effects like the sky was a giant kaleidoscope.</p><p>Camille eventually led me on a few adventures to walk around and inspect the surrounding buildings, one of which happened to be an art building, filled with exciting stimuli for my ever distorted mind. Every single moment and event was changing and exciting. When we got to the bathrooms of the arts complex, my euphoria was still plateauing, and the unfamiliarity of a school that wasnt my own wasnt even on my mind. Being in an interior for the first time in 2 hours was a very rich and complex experience, and stimulated my perception immensely after being in the expansive sunlit day. While in the bathroom alone (Ive always found bathrooms to be the most interesting places while tripping, dont ask me why) I became extremely amused, and started laughing. Nothing about the dimensions of the place was staying the same.</p><p>At this point, my mind and focus were very clear, although lacking any sense of ego, but to me it seemed that the distance from the sinks in the bathroom to the stalls had doubled between my walk in, and my walk out. Also, on my way in, I swear I saw only one or two sinks, and when I returned there were four. The walls were certainly moving, and my reflection in the mirror was enticing. Meeting Camille out in the hall once more, she wondered what had taken me so long, and was amused I guess by the similarity and strangeness of the experience. Voices from some theatre workshop down the hall were drifting in, and seemed artificial, as did really everything around me at that point. I could certainly relate to Alice, or any other adventurer or psychonaut who has tried to describe the trip to Wonderland.</p><p>We further amused ourselves by reading aloud and laughing hysterically at the many different artistic and literary flyers on the walls in this hall. One had some kind of rhyme about Tchaikovsky that was especially amusing and trippy.  Anyways, we continued our exploration of the constructs around us, and the experience still continued to intensify and accelerate. I wondered if the logic and sense of reality would continue its dismantling forever, or would we someday return to what had previously been called normalcy? Time seemed to have no meaning, since there was no difference anymore between what was supposedly real and what not, so how could I trust that the sun would still spin regularly around the earth? But of course, I had forgotten it was, in fact, the other way around.</p><p>We arrived at a curious empty room with glass walls and windows to the outside, and decided to walk upstairs to get a better view to investigate it. But we were held up in the stairwell. Many people have noticed that perception of sound is already very echoey while shrooming, and this stairwell certainly amplified that exponentially. It was the kind with one floor of stairs halved into two flights, and it had stark white/grey concrete painted walls, and metal railings. The sound was so unreal here, that we were mystified, and sat down by the door on the top of the stairwell, contrasting the silence and the amplified sounds. I thumped a rhythm that reverberated through the entire metal railing, while Camille documented the incident on video with her digital camera. The rhythms and the sounds were keeping me speechless and in a trance, because it caused disorienting distortions in my perception of time. The most shocking thing is, that upon viewing the unedited video of that moment later, the quality of the sounds on the recording did falter and distort temporally and then return to normal for a brief moment. It excites me dangerously close to claiming that here is factual evidence that what we experienced was real, but I will abstain from claiming anything that far-fetched.</p><p>We finally left the stairwell after a few minutes, and sat in some sofas in the mezzanine upper-level of this building. This was definitely the most intense moment, cognitively, of the entire experience, as I delved inward and my sense of self evaporated completely for half an hour, making me wonder if I were really just an imaginary consciousness in someones dream, or if I was in the mind of an insane person, not actually experiencing anything real my whole life but living as a dream figure on the inside of his imagination. The room and building around me swirled in my eyes and lost form, and I assumed it was really just an illusion to begin with, only held together by our belief in it, or by a more complex, self-sentient karmic energy which only the Buddhist monks fully understand. I pondered with my feelings over the meaning of a sense of control, and decided that it was only an illusion caused by isolating ones ego from the rest of reality into one individual point of view which thinks it is making decisions.</p><p>The fractal patterns from before had also taken effect of my mental processes, and I felt as if the shape of reality was some multi-layered multi-dimensional infinite fractal. It felt like my mind was a complex replication of many other minds within a single consciousness, and that within my reality were many other replications of itself, within every particle and spiral center of each fractal. Infinity went on in every direction, and I could feel the existence of other spatial dimensions beyond the 3 we know. It was all very complex and I dont think I did a good job just now conveying the feeling of it all in words. Our brains and bodies are not meant to perceive of such things, and our language has no means of expressing them.</p><p>We continued our walk for an hour or so more, and all the while, the trees continued their bewildering dance, and stood out as one of the most interesting things in our environment. Meanwhile, the sun set, and we gathered our things and made our way to a long boardwalk in the swamp which connected the area we were in to the parking lot. In the center of the stretch of boardwalk, immersed in the tall pines, there is a bench built into it, with lights all around it. Here we tripped out some more, and recollected parts of our day, still not really out of the trip yet, and still euphoric. The beautiful moon rose, and Camille recalled an amazing thing she had experienced alone the night before.</p><p>She was walking over the boardwalk to her car after class, and a huge owl the likes of which shed never seen flew over her through the trees, making a wonderful and eerie hoot. Camille is obsessed with birds, and loves things like this, so of course she was very excited. A short while later, the most unexpected thing happened, but of course, not one, but TWO of the great birds appeared out of nowhere from the trees, and settled into a branch high above us, making their sound so we could watch them in awe. As if the day didnt have enough strange occurrences, here was one more. Still deep in the effects of the drug, I wondered to myself if we had simply caused this strange thing to happen with a subconscious decision in our collective mind, like all the other shared experiences that day. They flew off and left us pensive, but blissful and content with our magical day. We wondered what would happen next.</p><p>The trip dispelled fairly quickly after that, though I didnt really notice the change until a while after it had passed, and we were back to normal. We spent the rest of the night with some close friends, and then went to sleep.</p><p>This trip, more than any other I have experienced, changed the way I will experience the rest of my life. I dont think I will stop thinking about some of the things it made my mind believe, and I think I am more aware and open to the possibilities of what this great contraption of reality really is now. Uncertainty is still paramount, but I can say that the magic and insight I experienced that day was limitless and eternal, and it went beyond satisfying my desires and curiosities about shrooms. My eagerness to plan the next trip has abated somewhat from my previous trips, now that I have reached this level. Im still excited for the next potential journey to that realm, but the things I took back with me this time are enough to keep me content even if that is not for a long while.</p><p>I suppose I am a relatively inexperienced psychonaut, but no one can read minds or memories, so theres no way to ever know for sure whether this experience was the most extreme type or not, nor is there really any way to measure such qualities. I believe the possibilities are limitless, and extreme trips are incomparable. But this was the most extreme I have ever experienced, and, while I might be surprised next time, I dont think I could conceive of a more intense dismantling of reality on this particular drug. It may require trying acid or DMT to find anything more startling, or maybe not. Either way, I am firmly against doing anything in excess, so I dont think I could benefit at all from trying a higher dose of mushrooms. Ive taken between an eighth and half-eighth every time, and Ive never had a bad trip. I dont see the point of every changing the effective dose. I certainly feel very fortunate to be blessed with such an amazing chemistry as to be compatible in such a way with a drug that will cause so much joy.</p><p>Ultimately, I would call this experience the most successful Ive had in my life. Ive always said I wanted to explore to the very edges of the universe. I feel as if Ive done that, yet at the same time I believe in a way there are none. Beyond the edge is just more.</p>",
 "year": "2008",
 "id": "70346",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-06-11T07:00:00.000Z",
 "views": "2582",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.8 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
