{
 "title": "Why Am I So Sick?",
 "author": "Soy Boy",
 "citation": " Soy Boy. \"Why Am I So Sick?: experience with DXM (ID 7035)\". Erowid.org. Aug 27, 2002. erowid.org/exp/7035",
 "substance": "DXM",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "4 oz",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "report": "<p>I found out about 'robo-trippin' from a friend at school, I decided I had to do it. I  tried it, and I loved EVERY time, except my last.</p><p>This was my last robotrip. I had done it 7 times before (every weekend for the past 7 weeks) and it was always great. One night, I was heading to a party and I picked myself up a bottle of Robo. At around 7:00 I drank the bottle. About 30 mins later I started to feel the standard body buzz/drunkedness. I was really excited for some reason, and it made the buzz more intense.</p><p>At around 10:00 I went to the party and I still wasn't tripping very hard. No visuals, drunkedness was wearing off, etc. When I got to the party I was feeling a little sick to my stomach. (normal occurance), but when I went inside, people freaked out. They were staring at me and asking if I was ok. Someone said 'you're pale as a ghost, I've never seen anyone so pale!' At this point I got a little worried and the slight sickness had gone from irritation to extreme pain. I was holding my stomach and wandering around in pain.</p><p>Everything at the party started to get hazy, I couldn't stand and listen to anyone talk, or stay in one place at all for that matter. I guess I showed up to the party a little late, because there was a small fight earlier, which casued people to go home and the party to end shortly after. So I decided to leave also. On my way out to my brothers car, I got really nausous and stopped to vomit on a tree. I swear I puked up my last three meals! Less then 30 mins after ariving I went home and crashed into my bed to sleep this trip off.</p><p>I quickly realized I couldn't go to sleep and I stayed in the bathroom trying to vomit up the rest of the robo to stop the pain. I couldn't vomit so I tried to go to sleep again.</p><p>At this point I starting tripping...HARD. I was lying in my bed and it felt like I was floating around on top of my sheets, and levitating slightly off my bed. Everything had a strange but inviting glow to it. My room looked very strange, and although I knew where I was, I felt like I was in a different world. I started to doze off into a dream-trip, where I was still awake, with my eyes closed and I was DREAMING (about what I cannot recall). It was very intense, but my connection to this 'dream world' wasn't very good, I kept waking back up and dozing off. I could close my eyes and still see everything in my room. I know I have got more intense visuals off LSD and mushrooms, but these were, without a doubt the strangest visuals ever. At this point I was enjoying my trip very much. And I had all but forgotten about the Pain.</p><p>Then it came back like a train, pain was slamming my stomach so hard I thought something had burst inside me. I shot out of my bed and headed for the bathroom. I leaned over the toilet trying to puke, but again I couldn't. After about 20 mins the pain had subsided and I stood up, looking into the mirror. I was very scary looking, my face and chest were as white as paper and my eyes were bloodshot. I stumbled back to my room and layed back down.</p><p>After 5-10 mins the dream-trip started coming back. It was the same as my last dream stage. Then the pain came back, and I once again ran to the bathroom. This time, for some odd reason I forced myself to puke, and all that came out was gross chunks with BLOOD! I was scared out of my mind, I thought I was vomiting up my organs. But to my surprise, besides the intense fear, I felt much better. I got up again and looked into the mirror, this time I looked much better, and the fear sort of faded off.</p><p>I figured it was all over, and I went back to my room and layed down, hoping to fall sleep this time. The dream-state started again, but this time the visuals where less intense, as were the 'other-world' feelings.</p><p>The pain came back three more times before I finally fell alseep. I didn't vomit again, and I no longer entered the dream-like state once the pain had died down for another short period.</p><p>I layed in bed between the episodes of pain and wondered what I had done to myself. I thought I would have to go to the hospital in the morning and get myself checked out. When I woke up I felt fine, there were no after effects and all my color hard returned to my face. To this day I still can't figure out what made me so sick, as this was my regular dosage.</p><p>To wrap-up this experience I would like to say a few things. First off, I was not on any medications at the time. Secondly, I did not do any other drugs that night, only DXM. The last thing I would like to point out is that I had done DXM in the exact same dosage and even higher every time I had done it before, but this was by far my most intense and painfull trip. Sy my final thought would be, even if you've done it before, DXM can sneak up on you and bring you for a painfull ride. I thought I knew what I could handle, and I was wrong.</p>",
 "year": "2000",
 "id": "7035",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-08-27T07:00:00.000Z",
 "views": "15447"
}
