{
 "title": "Weakened Heart",
 "author": "Oki",
 "citation": " Oki. \"Weakened Heart: experience with DXM (ID 70443)\". Erowid.org. May 17, 2010. erowid.org/exp/70443",
 "substance": "DXM",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "300 mg",
  "oral",
  "DXM",
  "(capsule)"
 ],
 "report": "<p>I have been trying dxm for a few months, once a month, increasing the dose, hoping to have an awesome experience. I'd usually use gelcaps. I have taken the Robitussin gelcaps before, 300 mg worth and was okay, except for one instance when I thought I was going to pass out, however, this time it was entirely different. I took 20 gelcaps as usual and expected the drug to take its effects, which it did very soon.</p><p>45 minutes: I felt myself getting more tired and dreamy, but my heart was just beating faster and faster.</p><p>1 hour:I kept getting more tired, palpitations started coming up, I could feel my heart beat into my head at a great intensity. I thought dxm was a bad idea this time, so I made myself vomit (I have never vomited before from DXM) to curb the trip, maybe. Turns out I kept getting worse, not like the other times I've tripped.</p><p>1.5 hours: My blood pressure went way up and my eyes wouldn't see straight. I started feel faint, but thank god for my parents, they got very worried and gave me some heavy sedative to slow down my heart, since it was going into tachycardia. Feeling absolutely terrible and lost, my mind wandered around the room, as I couldn't feel my body, which stayed on the couch, next to my mom.</p><p>The sedative helped only for a few minutes, before my heart went out of control again. I was praying to stay alive, I have never felt so close to dying before.  I kept thinking how stupid I was and how much I loved my parents. I couldn't stand, walk, or think. She got me dressed and took me to the ER, where they had measured my vitals and stuck me in a wheelchair. My heart was stopping from only 300 mg, and only after I was telling myself that 300 mg have never hurt anyone.</p><p>-I lost track of time around here-</p><p>After the sedative not helping at all, the heart muscles seized up, or so I was told and passed out, still praying for my life and fucked up. They used the defribbilator on me and washed my stomach with liquid charcoal.</p><p>I stayed in the hospital for a few more days, trying to hold on. I was always having closed-eye hallucinations, constant palpitations and extreme nausea and vertigo. A few weeks after, I'm still weak and unable to do most physical activity, my heart has become very weak and I can only sleep with lights on.</p><p>I didn't think this would happen to me, since I have had experience with the drug before, but something unexpected has happened, even though I took a calculated dose and was thinking I'd expect what was coming.</p>",
 "year": "2008",
 "id": "70443",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2010-05-17T07:00:00.000Z",
 "views": "3845",
 "dose": {}
}
