{
 "id": 7045,
 "title": "Fun Complications",
 "date": {
  "submission": "2007-06-14T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Pappa",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Anadenanthera colubrina",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>Well, well, well. What an incredibly bizarre evening it's been.",
  "I put about 20 Anadenanthera colubrine seeds in the oven on gas mark 9. After about 5 minutes, they began to pop (the smell of cooking Cebl seeds is beautiful). After another 5 minutes, I took them out and left them to cool. I thoroughly ground them in a coffee grinder and added about a third of their volume of Sodium Bicarbonate; making a mixture 25% NaHCO3 and 75% Cebl seeds.",
  "At about 5pm myself and B snuffed approximately 0.75g (judged by eye) of this powder each. [Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active as such a small dose, eyeballing is particularly unwise. See related article]",
  "About 1 minute later the phone rang and stupidly I answered it. It was unfortunately necessary for me to quickly go and meet/collect someone.",
  "I left the house and soon began to have a strong visually hallucinogenic experience. My mind was clear and I had no trouble crossing roads etc, but I was tripping hard. I saw vivid colours and patterns superimposed over my visual field, which were very impressive. Just before I got to my destination, I began to get paranoid about my appearance (I was sweating a lot) and what I would say when I got there.",
  "Also, I had no idea how strong this was going to get, so I was a little apprehensive about that too. I walked around the block a few times to decide what to do, and realised my motor skills were a little affected (I wobbled on the pavement once and knocked off someones wing-mirror, sorry). Once I realised the experience was going to be primarily visual, I stopped worrying and headed off to my destination to meet/collect the person.",
  "I arrived at my destination and dealt with the situation without incident and headed home. I was sweating profusely and tripping hard at the time, but well within my capacities for ensuring we were safe.",
  "Once home, I realised B was hiding under a blanket upstairs (I still don't know whether he's had a good time or not), and I had a fairly amusing time just mucking about for about an hour. After that I began feeling an almost uncontrollable urge to sleep. I checked on B and realised he was sleeping. Around 7 pm I had a cup of tea to keep myself awake and slowly progressed to normal again.",
  "It's now 8:30 pm and other than a bit of tiredness I feel totally normal.",
  "All in all, the experience was positive. Even though I had the complications of unexpectedly having to go on an urgent errand, it was pretty enjoyable, and the visuals were impressive. Other than the visuals and the subsequent tiredness, there were no other effects. None of the mental rollercoaster so typical of LSD for example.</p>"
 ],
 "erowid": {
  "id": "40790",
  "citation": " Pappa. \"Fun Complications: experience with Anadenanthera colubrina (ID 40790)\". Erowid.org. Jun 14, 2007. erowid.org/exp/40790",
  "substance": "Anadenanthera colubrina",
  "views": "5361"
 }
}
