{
 "title": "Better than Booze",
 "author": "Don",
 "citation": " Don. \"Better than Booze: experience with Kava Kava & Nutmeg (ID 7048)\". Erowid.org. Jul 14, 2002. erowid.org/exp/7048",
 "substance": "Kava Kava & Nutmeg",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Kava",
   "(tea)",
   "",
   "3 tsp",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>I have been reading about legal/natural highs for a few years on the net but when I actually have a few days to experiment I usually don't think about it.  Today I saw some Kava tea bags at my sister's place and since I had no plans till the next week I decided to try some.</p><p>9:30 PM</p><p>The tea says '25 mg per bag' so I decided to rip open 4 of them and dump them directly in the water rather then steep them to make sure I get all of the Kava, I figure 100 mg is as good place as any to start. So I drink down the whole mixture not leaving any grains in the bottom of the cup, really overpoweringly nasty.</p><p>9:40 PM</p><p>I sit on the couch and start watching TV, I don't feel anything at first but soon I get a mild buzz and feel a little 'off', I notice the TV show is much easier to laugh at then usual. I started to think this might just be a placebo effect but going out to smoke I felt slightly wobbly, and I got a HUGE buzz off of the cigarette which isn't normal for me.</p><p>I go back in and my sister asks me why I was smiling so wide, I hadn't even noticed I've had a huge grin for the last few minutes. </p><p>10:40 PM</p><p>The buzz remains, it feels like coming off of weed or having a weak hit, but with happiness mixed in, very mellow and not bothered by anything, I had been having a boring day but I find I am totally satisfied with watching TV at this point.</p><p>11:20 PM</p><p>I have also wanted to try Nutmeg and I figure, what the hell, I have a whole week to sleep off any ill effects so why not? I dig through the pantry and find ground Nutmeg that hasn't ever been opened, I have no idea if this is the right form of nutmeg to get a buzz off of but I figure I will try it.</p><p>I have one tsp of it and, holy shit, the stories about the taste are true, go dump an ashtray in your mouth and now you know what nutmeg tastes like.</p><p>12:20 AM</p><p>No effects from the Nutmeg yet, I still feel odd from the Kava though, but it isn't really intense, I decide to drink 4 more bags to enhance the effects, also to try more nutmeg, I take 2 more tsp and wash it down with the Kava, I almost puke the whole disgusting mixture back up.</p><p>Decide to go play some Half-life on the net.</p><p>12:45 AM</p><p>Now THIS I like, not only do I feel great but my game playing skills aren't affected at all.</p><p>Also, music sounds better then normal, not in the 'I want to sing every song I hear' way I can get on weed but definitely boosted appreciation, I flip through a bunch of Autechre, Moby, Plaid, Nine Inch Nails, and Aphex Twin every song sounds cooler.</p><p>That second cup is having an effect, slightly more buzzed , feel slightly drunk but still clear headed, I wish I was at a party, I would be having a blast.</p><p>1:00 AM</p><p>Checking my email and all of the sudden I start to get a headache. Damn.</p><p>Not unbearable but it is bringing me down a little, I think it is the Nutmeg since almost every Nutmeg trip I have read about involves a headache, wish it was actually making me feel something else. [Erowid Note: Kava is also associated with headaches upon come-down.]</p><p>Thinking about drinking some alcohol but I am worried it will kill the euphoria.</p><p>2:00 AM</p><p>Decide to see how much of a buzz I can get, use 5 more teabags in a cup, drink it as fast as possible only stopping to breath.</p><p>Don't really notice any effect, I am pretty exhausted at this point, and my headache has gotten worse. I sit down on the couch and start watching some murder mystery and trying to notice any new effects.</p><p>10:00 AM</p><p>Wake up on the couch, go to my room to sleep on my bed.</p><p>2:45 PM</p><p>Wake up, no headache and no ill effects, actually I feel great, slept a long time though.</p><p>All in all this was a great experience. Not as good as weed but better then booze by a long shot.</p>",
 "year": "2001",
 "id": "7048",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-07-14T07:00:00.000Z",
 "views": "21747",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  }
 ]
}
