{
 "title": "No Pain No Gain",
 "author": "Djd791",
 "citation": " Djd791. \"No Pain No Gain: experience with Morning Glory (ID 7052)\". Erowid.org. Jul 14, 2002. erowid.org/exp/7052",
 "substance": "Morning Glory",
 "bodyweight": "175 lb",
 "report": "<p>First off let me begin by saying I am a well experienced tripper.  I've done it all...  I mainly stay within the realm of LSD and shrooms though.  I've had many very cool experiences on both.</p><p>Anyhow, recently I was trying to aquire a few hits of acid so I could trip on the upcomming weekend.  I searched and searched, but none of my sources could come up with anything.  I was just about to give up when a friend of mine suggested I try some MG seeds.  I was skeptical because I heard that MG seeds cause nausea.  I have a pretty weak stomache and I try to avoid anything that creates a syptom of nausea. I was really craving a trip so I thought what the hell I'll give it a try.</p><p>It was a Saturday afternoon, my broter, a friend and I went to the local hardware store and found an abundance of MG seeds for sale at .99 a pack.  We decided on the Burpee Heavenly Blue.  We each bought 4 packs each.  My brother is a seasoned vet. of tripping on LSD and he had never heard of tripping on MG seeds, but he was open to all suggestions...considering he hasn't been able to fine any acid over the past few months. </p><p>We went back to my brothers house and followed some basic cleaning porcedures.  Some people recommend using dish soap to clean them off.  Trying to keep the whole process as natural as possible I purchased some of the new fruit and vegetabel rinse at the local supermarket.  This worked nicely.  We eached rinced out seeds about 4 or 5 times till we thought they we reasonablely clean.  We blotted the seeds dry with paper towel, then let the seeds air dry for an additional 10 minutes. </p><p>After the seeds were completly dry we each took turns with a coffee grinder, ginding our seeds up into a fine powder.  My friend and I took the seed powder and dumped into some yogert, mixed it up and ate it down.  My brother decided to make a tea out of his MG powder.</p><p>My friend and I quickly consumed the yogert/MG mix and my brother found it very time consoming to strain the seed powder and make his tea, but withing 15 minutes after we had ate the yogert he was drinking down a muddy looking mix.  It made him gag everytime he took a drink of it and halfway through his drink he dicided to stop on behalf of the taste and also because he didn't think it was going to work any how.</p><p>We went into the backyard and started up a bon fire hoping that soone the effects of the seeds would set in.  I started to feel really full, like I just ate way too much food.  Both my brother and friend complained of the same symptoms.  After about 20 minutes the fullness feeling in all of us turned into fill blown nausea.  It was a very unconfortable feeling.  We all thought we made a huge mistake.  My brother ran inside and vomitted for about 15 minutes.  My friend followed my brother up with his own trip to the bathroom, though he says he never threw up... just a lot of dry heaves.  I was left alone at the fire trying to combat my nausea.  I walked around for a bit, then just sat back down.  I started to feel a bit funny, a little dizzy and kind of tired.  My stomach settled down a bit and I was now concentrating more on how I felt.  My brother and my friend both cam back to the fire, both staing that they felt much better.  My brother said he was definatly feeling high and my friend said he didn't know what he felt, but he thought the whole thing was a very bad idea.  We sat around the fire for about 10 more minutes and then I became very nauseated.  I ran for the house and the camped in the bathroom.  I dry heaved a few times then felt a little better.</p><p>I went a laid down on the couch and tried to relax a bit.  The Matrix was on TV and I just concentrated on watching that.  After about 20 minutes my friend came and checked up on me.  He sat down and started to watch the movie too.  Right then I noticed that the seeds were really hitting me. (about an hour and a half after I conxumed them)  I was totaly mezmorized by the movie. </p><p>My brother came in the house and also admitted he felt really high.  We all sat in front of the TV watching the matrix.  After about another 20 or so minutes I felt like I was in a full blown LSD trip. Both open and closed eyed visuals.  The walls appeard the be breathing, shapes seems to be shifting.  It was a really cool experience.  I felt really mellow.  Unlike LSD though, it made me feel like I was really drunk. </p><p>To make a long story short after the nausea all 3 of us had a kick ass trip.  Everything we could have hoped for.  We took our seeds around 10:30 at night and we we up till around 6am.  I found that it was a lot easier to fall asleep on MG then it is to fall asleep after an LSD trip.</p><p>The moral of the story for thoes people curious about trying MG seeds is to stay within reasonable limits.  DO NOT do more then 5 or 6 grams.  I would imagine that 3.4 or 4g would hit pretty hard.  If you can deal with an hour of nausea then the whole MG experience is well worth it!</p>",
 "year": "2001",
 "id": "7052",
 "gender": "Male",
 "timestamp": "2002-07-14T07:00:00.000Z",
 "views": "14603",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Morning Glory"
  }
 ]
}
