{
 "title": "Absinthe Recipe Competition",
 "author": "imp",
 "citation": " imp. \"Absinthe Recipe Competition: experience with Absinthe (ID 7055)\". Erowid.org. May 26, 2001. erowid.org/exp/7055",
 "substance": "Absinthe",
 "bodyweight": "215 lb",
 "report": "<p>   Recently, my friend and roomate challenged me to a competition of sorts.  Homemade absinthe, who could come up with the best recipe through the standard process of trial and error?  So several batches later, I have come up with a collection of flavors which I think works best.</p><p>Keep in mind the primary purpose of making absinthe was to capture the active ingredients in an alcohol extraction, not a difficult process in itself.  Anyone who has gone this far knows what the next problem encountered is.  'What in the name of all that's good and holy can I do to get rid of that taste?'  So from that point my efforts mainly centered on what I could do to keep each area of my tongue from experiencing the vile and putrid bitterness of the wormwood.  So here are the major components in my recipe.  I try to avoid any strict formula for ratios and amounts, as I believe that the individual should have the pleasure of finding their own perfect balance.  If you really need exact numbers though, read some other recipes out their and grab some measurements.    To be nice though, I grouped the ingredients roughly by the amount and/or  step during which they should be used.</p><p>So, here we go:   Just remember, if an ingredient can be made into smaller pieces, why not?</p><p>Procure a gallon jug and insert:</p><p>Wormwood (enough to cover 3/4 to 1/2 inch at the bottom of the jug while fluffy)</p><p>Licorice Root (10-15 sticks, but more than the wormwood)</p><p>Cardamom Seeds (10-15 pods worth)</p><p>750 ml of 152 proof neutral grain spirits</p><p>1 liter of cheap 80 proof vodka</p><p>Leave this in a warm dark place for three days, periodically shaking and admiring.</p><p>then add to the mixture</p><p>somewhere between .5 and 2.0 tablespoons each of:</p><p>Angelica root</p><p>Corriander seed</p><p>Anise seed</p><p>Fennel seed</p><p>Whole Cloves</p><p>Black and White Peppercorns</p><p>Lavender (4 tbsp.)</p><p>1/2 Whole Vanilla Bean</p><p>a little more wormwood</p><p>some lemon peel</p><p>a pinch of Blue Green Algae (for color and vitamins)</p><p>1 small ginseng root (unless your yang is fine where it is.)</p><p>and let the mixture sit for the remainder of the week in a warm dark place.  Once again periodically removing it from hiding to agitate, carress, coo, and speak fond words to it.</p><p>At the end of the week remove it and filter and re-filter the liquid from the solid materials (I've never been able to eliminate all of the sediment) Save the vanilla bean if you can because it looks nice at the bottom of the bottle.  So once you have decanted and filtered your way down to as clear a liquid as you can imagine getting, take those three empty bottles,  the ones I hadn't mentioned yet.  Find three bottles each holding about 750 ml,  empty and wash them and as the final stage begins, add about a half a cup of honey to two of the bottles while they are still empty, and a quarter cup to the third.  Using your bar funnel, pour the liquid into the bottles according to their amounts of honey and seal them up.  Then shake each bottle vigorously to mix the honey with the liquor.</p><p>   By the time you finish, the proof should be between 100 and 110 and you should have a quite servicable Absinthe liquer.  As I said, almost every ingredient is to cover some part of the wormwood, either in the nose or the tongue.  So the true flavor and aroma doesn't become apparant until after you've had the first shot.</p><p>   This recipe is about a month old, and I've drank maybe a liter and a half in that time.  The only notable side effects I'm having are a certain amount of listlessness the next morning that I don't always associate with alchohol.  Beyond that,  I can tell there's a little something else that my body has to filter out, but it's barely different from alchohol.</p><p>The effect: I personally don't find the effect to be noticably different than alchohol until the fifth serving or so.  Granted, the alchohol content is stronger than most.   If I had to identify the feeling precisely, I would say that I feel some of somatic and kinesthetic displacement which I used to associate with dextramethorophan.  Other than that it's like drinking liquor.</p><p>Helpful tips:  For extra fun, throw 1/8 oz. each of mariajuana and cubensis into the original mixing.  not enough to take over the drink, but definitely a kick in the spine after a few rounds.</p><p>Also:  I've found the best mixers, besides the traditional method, are lemonade and a nice dry hard cider.</p><p>have fun!</p><p>imp</p><p>I'd also like to thank Anthony, who will kick my ass if I don't mention him.</p>",
 "year": "2001",
 "id": "7055",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-05-26T07:00:00.000Z",
 "views": "35953",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 }
}
