{
 "title": "Better than the Competition",
 "author": "Johnsonbiscuit",
 "citation": " Johnsonbiscuit. \"Better than the Competition: experience with Ethylcathinone  (ID 70604)\". Erowid.org. Jul 6, 2008. erowid.org/exp/70604",
 "substance": "Ethylcathinone ",
 "bodyweight": "12 kg",
 "report": [
  "<p>Ive had experience with a wide range of psychoactive herbs and chemicals over the years and cat is definitely up there as one of my favourites. I have worked my way through at least 7 grams of the stuff in the last 6 months and found it to be a very useful stimulant.",
  "The substance itself is a pale brown clumpy powder. It has a very bitter, extremely unpleasant taste. It comes from a very reliable supplier and I believe it to be quite pure, and definitely not adulterated (the nature of the powder would make it obvious if someone had cut it with something). The dose range is from 100 to 300mg. Onset is much like amphetamines, between 20 and 60 minutes depending on stomach contents. Peak effects are attained around 40 minutes after ingestion on an empty stomach.",
  "Dose for dose I pay roughly the same amount as for what is known as base-speed in the UK, which is basically very low purity d-amphetamine. I far prefer the ethyl-cathinone for its superior effects and also its reduced side-effect profile.",
  "I have mostly used it as a study aid, as with most stimulants it increases drive and focus, and actually makes me want to work. I have trouble with attention and focus (which may or may not be ADHD, Ive never been tested) and it certainly overcomes that at quite low doses, 100mg will usually suffice. It is very useful for studying and also helps maintain focus for overnight essay binges when theres an assignment due sooner than Id like.",
  "I have also used it socially (though far less often) and found it an excellent social lubricant as it raises mood, stimulates thought and is conducive to conversation. I also find that it has this effect at doses subjectively lower than amphetamines. With speed, for me at least, a dose that will make me sociable and talkative will also mean that Im going to spend the next 12 hours as a maniacal face-chewing insomniac. That said I do get a fair bit of OCD, teeth grinding, lip-licking and muscle tension, but I can sleep far sooner and it leaves me feeling slightly less strung-out. The people I have given it to have all enjoyed it as well and there have been no bad instances yet. Alas like most stimulants it makes me completely impotent!",
  "At 250mg+ it is easily as strong a good dose of amphetamines (which I have taken only as UK street quality base-speed) and in my opinion preferable to cocaine (although i prefer amphetamine to cocaine). At no dose I have noticed any properties that significantly distinguish it from amphetamine but it doesnt keep me up as long after a dose and doesnt have as much of a comedown. Although I only get a mild comedown from speed anyway (I never do in huge amounts) I dont feel anything more than a bit tired after ethyl-cath, particularly if I got to bed at a reasonable-ish time. Benzos will of course help. Caffeine seems to offset any tiredness / comedown type feelings pretty effectively if I do notice any.",
  "At first a dose of 100mg would have no discernable effect on me but now that I am a bit more familiar with it I do notice a small amount of stimulation, even a mild euphoria, at this dose. It is pleasant and makes me slightly more talkative, focused, etc.",
  "At about 200mg orally it feels like a classic stimulant. Urge to talk, excitation, euphoria, stimulation, and of course anorexia, muscle tension, teeth grinding etc. Upping this dose to 300mg makes all the above effects stronger. I have not taken more than this yet and I dont feel the need to.",
  "I have also tried the substance rectally and via vaporisation and insufflation. As for the nasal route I gave it a go myself. I sniffed around 50mg, which after maybe 15 minutes did produce very mild effects. I would say this was milder than 100mg oral, and it was also less pleasant than the oral route as it felt more dirty and jittery. The worst thing was the pain it produced, which was up there with 2cb: utterly excruciating! I would actually say it is worse than 2cb, not in the pain itself (which was probably slightly milder than 2cb) but as it felt like I had done real damage to my nose! The next day I could feel a line of rough and very sore tissue where the drip (which was also disgusting and I actually enjoy coke drip!) had gone down.",
  "Rectal was very much like oral, though the onset was quicker and the effects perhaps slightly stronger. It took maybe 15 minutes to come on. As for dose efficacy, something I am finding with rectal administration is that it is far less predictable than oral. The effects attained via this route were at best only slightly more pronounced than they would have been if ingested, but on some occasions a rectal dose has done very little. Also I have twice now been forced to evacuate a dose because I couldnt hold it in any longer, wasting the entire dose once and most of it the second time (not because I put it back in there but simply because I still got some mild effects).",
  "As for vaporising I couldnt really tell if it did anything. I used eagle bills vaporiser, which is a lot like a homemade light bulb vaporiser. The substance melted and boiled producing a thick grey smoke. It was hot and acrid and quite painful on the lungs. I used about 50mg but it was very hard to take much at a time and it took me around 20 minutes of continuous smoking before there was no melted cat left. The only residue was a small circle of translucent brown film, which was cleaned off with hot water.",
  "I can see that this substance could potentially be very addictive as there is a strong urge to re-dose quite soon after taking it. A feeling of loss, or simply a desire to take more, occurs in much the same way as with cocaine or amphetamines (perhaps even more so than amphetamines) but as with them I dont feel any desire to take it the next day.",
  "I have mixed it with several other drugs but found no incredible combinations yet, although it seems to go with most things reasonably well. One I did find quite useful was a particular occasion where I had been up for around 40 hours and the muscle tension was getting really bad. I had an assignment desperately in need of completion. I took 1g of phenibut and 2-3g of valerian root (in capsules) and also kept a steady flow of around 0.75ml of GBL every hour or two, which kept the muscle tension and anxiousness to a minimum.",
  "One more thing to note is that it ALWAYS gives me bad breath and a horrible taste in my mouth, and even brushing my teeth only works for around 1.5 hours.</p>"
 ],
 "year": "2008",
 "id": "70604",
 "gender": "Male",
 "views": "12305",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Ethylcathinone",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Smarts - Phenibut",
   "form": ""
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "GBL",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2008-07-06T07:00:00.000Z"
}
