{
 "id": 7061,
 "title": "What It Feels Like to Die",
 "date": {
  "submission": "2007-04-08T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Gladtobealive",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "Let me start this off with saying that wasnt prepared for what I was about to do.  My best friend told me about it about a day before I tried it.  He sent me a link to check it out and I searched for a few more to verify that it was legit.  I glossed over most of the info, primarily looking for warnings, dangers, and side effects.  I didnt see anything much more than to prepare of an amazing out of body experience and such.  I figured that I had experience with many types of hallucinogens and could handle them.  Now I realize that Salvia divinorum is not like ANY other hallucinogen.  I should have read the information a little more in depth to see that others say the same thing.",
  "Some more background infothe day I tried it was just over a year since my mom had passed away.  I had been thinking about dying and what happens in that exact moment.  This fascinated me, because my sister was there as my mom passed and she told me how my mom knew that she was dying at that instant.  Anyway, on with the trip.",
  "We didnt have an accurate scale to measure out what we had, so we just split it in half.  I decided to go first.  I sat on my couch and had the floor cleared in front of it incase I needed to lie down.  I smoked it out of a 3 foot bong and pulled an entire bowl.  I held it in for a count of 20.  By the time I had blown out the smoke, it happenedI cant give an exact representation of what I felt, but Ill try.  My hands were in front of me from holding the bong and they started feeling strange.  By the time I felt that, I felt as if I was slowly and purposely being pulled back into the couch.  Not just into the couch, but through it and into another plane of existence.  The pulling it was so intense I felt as if my soul was being ripped from my body and this world.  The room and my surroundings began to look like I was viewing them on a movie screen.  The screen was a plane of existence.  On the one side was my friend, my living room and the world as I knew it.",
  "At that point, I thought I was dying and being pulled into the other side.  I had no idea that I was on a drug, I forgot that completely.  The pull was getting stronger and I didnt want to go to where it was leading, I didnt want to die.  I sensed people behind my doing the pulling.  I pulled against the force pulling me back.  I was told later at this point that I crawled onto the floor. As far as I could tell, I was still on the couch.  I couldnt stop the pull into the abyss, so I lunged my soul forward, at this point, my friend told me that I did a front somersault.  Again I thought I was still on the couch.",
  "The pulling became more intense, and I was thinking to myself, damn, it really takes a while to dieit should be quicker.  I though Id help the people pulling me and to make my dying go quicker, so I let go of this world and threw myself back into the other.  My friend told me later that I did a back somersault at that point.  This didnt help me get to the other side any quicker.  While I was moving around, my friend was telling me everythings going to be alright, let it go or something to that effect.  In my mind, he was acting as the Grim Reaper, guiding me into the other side.  I could hear let it go, its going to be alright from both in front of me, and behind me (from the people pulling on me).  He grabbed my hands and guided me back to the couch.  To me, this felt like he was pushing me through the other side because I wasnt going on my own.  I kept thinking, man this is so strange.  Is this how everyone dies?  Is my friend the grim reaper and does this to everyone?  Does the grim reaper just jump into the body of whoever is closest?  I asked himwhy are you doing this?, Why did you let me do this?",
  "I was getting pulled into the other side and was almost all the way through.  I felt like how Hans Solo looked when he was frozen at the end of Empire.  Just my hands and the front of my face were left in this world.  I wasnt freaked out at this point, I was very calm and peaceful, just confused about how long death was taking.  I could almost feel the people behind me and was curious if they are there the entire time.  I wondered if they watch our world just like a movie and at any point can come in and pull us out.",
  "At the point where I was almost entirely through, I was able to pull myself back into our world.  I pulled up and out and ended up back onto the floor.  I started to get my senses back and crawled around the floor, happy to be back and to be alive.  At that point, I remembered that I had taken a drug and would be ok.  I felt hot and a little out of breath.   It took me about 30 minutes to really feel normal again.  I couldnt believe what I had felt and gone through.  During my come down, I talked with my friend about what I felt and he filled me in on what I did.  I didnt believe him at first that I had moved around.  As far as I knew I was always on the couch.  I was so weirded out about feeling like dying, that I wouldnt let him do the rest.  I didnt want to watch him go through what I had just done.  I put the rest of the Salvia down the sink drain.",
  "Now, the next day, I can reflect on everything.  It was a good experience, and Im glad that I did it.  Now that I know what Im in for and that it isnt real, I think that Id enjoy it more if I do it again.  Im going to be a sitter for my friend now.  He deserves to try it."
 ],
 "erowid": {
  "id": "40863",
  "citation": " Gladtobealive. \"What It Feels Like to Die: experience with Salvia divinorum (10x extract) (ID 40863)\". Erowid.org. Apr 8, 2007. erowid.org/exp/40863",
  "substance": "Salvia divinorum (10x extract)",
  "views": "5278"
 }
}
