{
 "title": "A Delusion",
 "author": "Euphoriamanic",
 "citation": " Euphoriamanic. \"A Delusion: experience with Methylphenidate (Ritalin) (ID 7076)\". Erowid.org. Jul 18, 2002. erowid.org/exp/7076",
 "substance": "Methylphenidate (Ritalin)",
 "bodyweight": "60 kg",
 "report": "<p>I have always had some symptoms of ADHD and at the age of 21,I decided to consult a psychiatrist. He gave me Efalex and later Xanax (alprozalam) in case it was anxiety. When both failed he prescribed Ritalin (methylphenidate) for me.</p><p>The first time I took 10mg and after 30 t0 60 minutes, I started feeling my heart beeting a lot and after some time I felt euphoric. Everything seemed so good. I was doing exams at the moment and under the effect of Ritalin, I succeeded to study an entire four hours without stopping. I actually found studying a very pleasurable thing while under Ritalin ' s effect.</p><p>The next day I felt the same with a 10mg pill. On the third day, I</p><p>again took a 10mg pill and felt the same. However when it's effect</p><p>finished I decided to take another one and it worked as well. The following morning I took another pill during the exam. It worked fine.</p><p>However starting from the fourth day, Ritalin never produced its miraculous effect again. Instead of feeling euphoric, it started to make me anxious and restless. I increased dosages up to 60mg but it was even worse. I have tried paroxetine with it, alcohol, benzodiazepines, but it was all in vain. Ritalin never worked again!</p><p>I started taking paroxetine everyday, and occasionally after having taken paroxetine (20mg/day) for a long time, I stop it suddenly. After a day or two I start feeling dizzy, and like having a fever. To my amusement during this SSRI withdrawal syndrome, sometimes Ritalin starts making me euphoric again (not as much as the first times).</p><p>Can anyone explain this ?</p><p>All I know, is that Ritalin intially seemed to be a panacea and the ultimate drug, but it turned out to be disappointing.</p>",
 "year": "1999",
 "id": "7076",
 "gender": "Male",
 "timestamp": "2002-07-18T07:00:00.000Z",
 "views": "21768",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate"
  }
 }
}
