{
 "title": "This Really Works...",
 "author": "IndianPotHead",
 "citation": " IndianPotHead. \"This Really Works...: experience with Piracetam & DHEA (ID 70772)\". Erowid.org. Nov 7, 2008. erowid.org/exp/70772",
 "substance": "Piracetam & DHEA",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "4800 mg",
  "oral",
  "Piracetam",
  "",
  "50 mg",
  "oral",
  "DHEA"
 ],
 "report": "<p>So I get my package with a months supply of melatonin, DHEA and Piracetam at 3:00pm. By 3:05pm I've ingested 4800mg of Piracetam and 50mg of DHEA. I've got to work from 4:00pm to 6:00pm at the office.</p><p>I get to the office and when I sit down to work, I'm feeling very different already. I've had a tiresome day and haven't slept properly the night before, but suddenly the mind-fog created by the mentioned issues completely clears out. I can focus much better and my mind just feels very very clear. I sit at the computer and my girlfriend sends me a text saying she wants to talk and is having some problems. So I go online and AIM her. I spend around 20 mins trying to make her feel better and successfully so (which I will NOT attribute to any substance as this happens more often than not). What I will attribute to the substances is my ability to finish up all my work by 5:20 pm, even after screwing around for the first 20 minutes. I've always wondered how one can actually measure cognitive performance, given the infinite different variables that actually determine performance. But this was clear evidence. I am overly skeptical of the placebo effect and it is very difficult for substances to convince me of their effect. This definitely works though.</p><p>Note, however, that this was the 'attack dose' and I plan to take much smaller doses, which might have a diminished effect. But effect indeed.</p>",
 "year": "2008",
 "id": "70772",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-11-07T08:00:00.000Z",
 "views": "25944",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4800 mg",
   "administration": "oral",
   "substance": "Piracetam"
  },
  "1": {
   "time": "",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "DHEA"
  }
 }
}
