{
 "title": "Heaven in a Breadcrumb, Hell in a Minute",
 "author": "Gonzo",
 "citation": " Gonzo. \"Heaven in a Breadcrumb, Hell in a Minute: experience with Crack (ID 70797)\". Erowid.org. Feb 20, 2009. erowid.org/exp/70797",
 "substance": "Crack",
 "bodyweight": "230 lb",
 "report": "<p>The anticipation, the preparation and the rituals involved are what draw me near to this well of insanity. The burning flame that ignites as my thumb rolls off the lighter's drum, the smell of the burning butane and the glare of the dim flame as it reflects upon the glass pipe that I hold between my fingers.</p><p>The moment that the flame makes contact and the crackling sound reverberates throughout this empty room, I bring the potion closer to inhale with much joy. As the fumes travel within, I sense my heart beat anew, and all my senses explode with pleasure and indescribable joy.</p><p>It is heaven in a breadcrumb, and hell in a few minutes as the moment inescapably fades to memory to only torment me from beyond the grasp of my feeble mind.</p><p>Oh how fruitless and purposeless is this pursuit of mine; how wretched and ambitious is this goal at hand. To attempt to cohabitate at the side of the almighty, to be in all places at all times. Such is the consciousness and the overwhelming truth that comes upon me that I am left drained and long to have more. Time and again I pay the price for a shot at the divine, time and again it tolls my soul and mind; as I slowly fade out of reality as Ive known it, a pure state of lies.</p><p>It is the price, the heavy toll, my only life that I leave on the table, my life and my all that I leave behind to spend a minute up in heaven, and peek into the divine. Who knows if Ill be back someday to visit, who knows if someday Ill be saved, but now Ive seen it with these eyes of mine, Ive touched it with my soul, Ive sensed it with my mind.</p><p>If its so real, as real as a dream; if the mystery so deep as the depths of the seas, then it defies all logic to have proven oneself right, to now insist in going back to this mental state of grind.</p><p>I was told that the path to heaven started on my knees, I had learned to seek the great Spirit in silence and stillness, till someone came along and opened up a shortcut, a fast lane, a straight up approach with a toll lane that carries a heavy price, a price to pay to be; if only for a brief moment, by His side. As I come down from the mountain to see my older self once more, a graying matter that counts down until one day it is no more.</p><p>I have been clean for over 2 years. I just think and forgive and love myself and God.</p>",
 "year": "2006",
 "id": "70797",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-02-20T08:00:00.000Z",
 "views": "30336",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(freebase)"
  }
 }
}
