{
 "id": 7081,
 "title": "Almost Lost My Life",
 "date": {
  "submission": "2008-01-01T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Female",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "administration": "IV",
   "substance": "Heroin"
  }
 ],
 "report": [
  "I started out doing heroin about 4 months ago. I only did it on the weekends to start with but that changed quickly. The only thing I looked forward to was the next time I was going to do heroin. I started out snorting small lines at a time then gradually doing more and more because my tolerance builds very quick. After snorting it got old I decided to go on to shooting it so that way Id have to do less. Shooting it is way different from snorting it.",
  "So this one night I decided it would be my last night to ever shoot it because I wanted to quit. So my boyfriend got the needle ready, put 1/2 pack in, stuck it in my vein and shot it in. This big rush came over my body, this big warm tingly feeling throughout my whole body, almost too overwhelming. I didnt have a care in the world. Just felt extremely relaxed without any pain. After about 2 hours the feeling was totally gone so I decided to do some more only this time I did double the amount.",
  "After my bf shot me up again the rush was way more intense, I began to get really dizzy and passed out. I stopped breathing and turned blue. My boyfriend had to give me mouth to mouth for about 10 minutes before I started breathing again. The ambulance came and took me to the hospital where I had to stay over night. They told me I would of died if my bf was not there to save my life. That was the worst experience I ever had. I could be dead right now just because I wanted to experience the feeling of H. I will never do heroin again."
 ],
 "erowid": {
  "id": "40957",
  "citation": " Anonymous. \"Almost Lost My Life: experience with Heroin (ID 40957)\". Erowid.org. Jan 1, 2008. erowid.org/exp/40957",
  "substance": "Heroin",
  "views": "34774"
 }
}
