{
 "title": "Interferes with Hallucinations",
 "author": "ZoloftShroomer",
 "citation": " ZoloftShroomer. \"Interferes with Hallucinations: experience with Sertraline (Zoloft) & Various (ID 70865)\". Erowid.org. Jun 6, 2008. erowid.org/exp/70865",
 "substance": "Sertraline (Zoloft) & Various",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Pharms - Sertraline",
   "(daily)",
   "",
   " ",
   "",
   "Various",
   ""
  ]
 ],
 "report": "<p>I have been on daily doses of Zoloft (100 mg) for about a year now, and recently began experimenting with new drugs.  I first tried mushrooms, and have taken half an eighth of mushrooms three separate times.  I never experienced any hallucinations of any kind, and at most was influenced by the atmosphere into feeling slightly high or euphoric.  I even tried a half eighth of golden caps and ended up simply falling asleep on my couch without experiencing any psychedelic effects. </p><p>After shrooms I sampled DOB, starting with a dose of two hits.  I didn't feel anything after taking those, so I tried again a few days later.  The second time I took four hits under the tongue and smoked one.  I initially felt euphoria after smoking the last hit and became very giggly.  Soon I was back to normal, but a few hours later I seemed to feel a slight amount of highness and euphoria because of the previous hits.  I never had any hallucinations though, visual, auditory, or otherwise. </p><p>Finally, I tried LSD.  I was tired of psychedelics being ineffective, so I wanted something stronger.  First I took one hit of acid, the same dose as my friends who had experienced obvious effects.  The acid supposedly wasn't very 'visual,' but just made you think differently and feel euphoric.  After the first hit I felt absolutely nothing.  About two hours after taking the first hit I took two more and smoked a large bowl of weed.  I definitely got high off the weed, but didn't notice the acid for a while.  About 45 minutes after dropping I began to feel happy and giggly, and my sense of space was distorted.  I felt the need to lay or sit down and couldn't seem to stop thinking.  I was immersed in my thoughts while I contentedly smoked a cigarette outside on the porch.  My LSD experience was quite pleasent.</p><p>I'm certain that SSRIs interfere with hallucinations, but they don't make it impossible to trip.  I think higher doses are just required for those on SSRIs.</p>",
 "year": "2008",
 "id": "70865",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-06-06T07:00:00.000Z",
 "views": "11328"
}
