{
 "id": 7088,
 "title": "Quasi-Traditional Extraction",
 "date": {
  "submission": "2007-02-25T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Geo",
  "gender": "Male",
  "weight": 98
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  }
 ],
 "report": [
  "Having done quite a bit of reading on Morning Glory (having a bulk organic seed distributor down the street helped peek my interest) I came to a few conclusions.",
  "#1  Most extractions start with the idea that a polar/nonpolar wash is a good idea and seek to concentrate the alkaloids.  I think these are unnecessarily complicated and outside of lab conditions are probably wasteful and often use chemicals to remove products that could be avoided by avoiding a layer of extraction mechanically.",
  "#2  Most of the aklaloids present in morning glory seeds are strongly polar.  Pure water (RO+DI) is an awfully potent polar solvent.",
  "#3  Most traditional preperations and home recipies involve mildly acidic conditions in the polar (water) wash.  It probably won't hurt anything AND the resultant wash is going to be acidic enough that it won't foster much in the way of bacterial growth if sitting in less than ideal conditions for a while.",
  "#4  Ingestion and upsets seem to come either from fungicides or as a result of the oils and fibers from the seeds themselves.  Most fibers should settle out to the bottom of a water wash.  Most oils are either going to be heavier than water (settle to the bottom) or lighter (float to the top) and can be likewise avoided.",
  "Well I thought about all off this and came to the conclusion that perhaps simple was better.  I obtained around 3000 or so seeds from the place down the street from my house of 'Heavenly Blue' packaged for the 2005 planting season.  I then slowly ground them to a fine flour using very slow pulses on a coffee grinder over approximately 3 hours.",
  "A half cup of seeds was added to the grinder and then pulsed for 2-3 seconds with 30 second breaks in between.  After 4-5 pulses the resulting flour/chaff mix was put through a fine sifter and the finer ground material sifted into a large glass bowl.  The remaining material was returned to the grinder and pulsed again with the same breaks until all material could pass through the grinder.  This process was continued until all seed matter was consumed and able to pass through the sifter.",
  "A gallon of RO+DI water was obtained (ppm around 10) and a quart was added to the flour mixture.  This was then placed in the fridge on the lowest temp setting (34-35 degrees) after an hour enough citric acid was added to bring pH to approximately 3 (just under a tablespoon).  Over 1-2 days the solution was stirred up every few hours and then allowed to slowly settle.  The water was then drawn off with a filtered syphon, being careful to not take up any of the oils floating on the surface or any of the fiber mass at the bottom of the bowl.  A glass bowl greatly aids in this because it allows you to get a side veiw of where your syphon is.    The resultant liquor has the same color as earl grey tea and if allowed to settle for a week or more quite a few tannins percipitate out of the solution.",
  "The idea here was to maximize exposure of the actives to solvent.  The fine flour maximizes surface area and should in theory aid in extraction.  Most solvents have a definate 'limit' to how much solute can dissolve in them.  By adding fresh solvent in batches we should at least reduce the amount of solute left behind.",
  "Total amount of water/solute recovered was just under 3/4 of a gallon.",
  "The resultant mixture had a slightly tangy sour taste no doubt due to the use of citric acid.  It was very reminiscent of 'crystal lite' gone bad and blended very nicely with said beverage.  Dose was variable between users but seemed to equate down to 3/4 of a cup to 1 1/2 cups per person.",
  "Onset was around 30 minutes with the trip peaking at about 3 hours and fading at around hour 6-8 depending on the person.  Some people with the higher dosage had visual 'tracers' well into the next day (12-14 hours later).  No one reported any nausea or stomach upset but a few people did become dizzy.",
  "The individual descriptions of trips look like a carbon copy of those already repeated on this site so I'm not going to go into excessive detail.  Everyone involved found it a very positive experience and I think doing it as a group really helped.  I would recommend this extraction as a group project."
 ],
 "erowid": {
  "id": "40971",
  "citation": " Geo. \"Quasi-Traditional Extraction: experience with Morning Glory (ID 40971)\". Erowid.org. Feb 25, 2007. erowid.org/exp/40971",
  "substance": "Morning Glory",
  "views": "10221"
 }
}
