{
 "id": 7090,
 "title": "She's My Narcotic",
 "date": {
  "submission": "2007-05-19T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Jordan F",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(tea)"
  }
 ],
 "report": [
  "TRIP # 1",
  "DATE: 2/26/05",
  "TIME: 9:30 AM",
  "I took two whole nutmegs and crushed them up with a pair of pliers. I tried every way thinkable to down these. I dumped them in water, I tried putting nutmeg on top of bread, everything. Every method just resulted in a sandy bitter taste in my mouth .A very gross trial. All in all, I probably downed 1/2 of a whole nutmeg.",
  "T + 1:50 First threshold effects become apparent, numbness in fingertips. Groggy, clouded thinking.",
  "That was as far as that trip went and it died about 15 minutes after jotting down the 1:50 report.",
  "----------------------------",
  "TRIP # 2",
  "DATE: 2/26/05",
  "TIME: 1:05 PM",
  "I try to ingest some more nutmeg, this time I try a different method. I crushed up 3 1/2 seeds with a pair of pliers. I put in a pot with 1 cup of water. I let simmer for 35 minutes (it was ready at 1:00 PM). When it was ready, I strained out the big nutmeg chunks, and I drank it in one gulp (the 1 cup of water evaporated into about a half a cup). It was a very spicy minty, bitter taste in my mouth. I immediately followed it with a swig of mouthwash and some ice water. It overall went down pretty easy. Something I could do again.",
  "T + 0:40 Defiantly relaxed, no real noticeable effects as of yet.",
  "T + 0:50 Mild stoned feeling. However unlike pot, I had no racing thoughts, no visuals but a profound lethargic numb feeling.",
  "T + 1:00 This is when I said to myself, 'I wish it was a tad bit stronger'",
  "After about two hours from ingestion, the trip died very suddenly.",
  "----------------------------",
  "TRIP # 3",
  "DATE: 2/26/05",
  "TIME: 8:00 PM",
  "Throughout the day (this trip took place about 5 hours later) I tried to figure out what went wrong. Something was definitely wrong. I thought the trip would last 24 hours. I was obviously misled. I decided that the reason my trips were very subtle was because of my method of preparation. I ran out to the store to buy a cheese grater and one more bottle of whole nutmeg. I figured that when I crushed up the 3 or so nuts, because they were still fairly big, all the oils weren't extracted into the water. This time I would grate the nutmeg very finely. I boiled about 2 1/2 seeds",
  "(very ground, they produced about 4 tablespoons after being grated.) I added all the freshly ground nutmeg to 1 1/2 cup of water and it simmered for about 45 minutes. While it was simmering, I could look at it at an angle, and see a oily substances bubbling around the top, something I didn't see in my last brew.",
  "T + 0:30 Very relaxed, the movie I am watching for the night is Die Hard with a Vengeance. My black lights are on and the glow from my black light posters remind me of the state I'm in.",
  "T + 1:00 I am very stoned right now, No real visuals, but a few tracers. No Auditory experiences like I would get with pot. But I was very happy with the way my trip was going.",
  "T + 1:50 The stoned feeling (colors seem brighter, people are more interesting) went away, and by now I am feeling very drunk. The movie has about a half hour left so I pause the DVD and head for the bathroom. I can't really walk straight, I feel drunk and any attempts at talking result in 'sloshed words'.",
  "T + 2:50 The movie just ended and I decided to go to sleep. I still am feeling drunk and I'm thinking that hopefully I will have some intense dreams.",
  "T + 3:00 I can't get to bed, my mind is filled with crazy thoughts, My whole body seems paralyzed, I really couldn't move if I wanted to. Very lethargic.",
  "T + 3:30 (estimated) Finally I fall asleep, too bad though I can't remember any dreams that I might of had.",
  "Thats when the trip ended for me. On the contrary to what reports have said, I had NO hangover the next morning. This was a very pleasurable experience. I had a great time. To any one thinking about trying nutmeg, I would offer some advice. Make it as a tea. It is so much better than trying to muscle it down all ground up. I am not too sure but mabey the fact that I was taking Stacker 2 at the time of these trips, might have had some effects.",
  "The next time I try nutmeg, which probably will be in about a month or so, I am going to add about 5 nuts to the tea. Because; Nutmeg, she is my Narcotic."
 ],
 "erowid": {
  "id": "40977",
  "citation": " Jordan F. \"She's My Narcotic: experience with Nutmeg (ID 40977)\". Erowid.org. May 19, 2007. erowid.org/exp/40977",
  "substance": "Nutmeg",
  "views": "26959"
 }
}
