{
 "id": 7092,
 "title": "The Man Who Controls Everything",
 "date": {
  "submission": "2008-07-13T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Pseudonymph",
  "gender": "Male",
  "weight": 13
 },
 "dose": [
  {
   "time": "0",
   "amount": "125 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "I had recently tried 5x extract of salvia divinorum and thoroughly enjoyed it, there was just a feeling of exaltation and intense relief from any pressures. So, having enjoyed the experience immensely I went for 20x extract which I picked up from the post office along with some san pedro seeds. With the package in hand I went straight to the local park with a friend who had never tried salvia. There was snow everywhere and I immediately sat down and took 2 pipe fulls of the salvia extract, my friend wanting to wait before he tried it.",
  "After holding the smoke in for about 20 seconds I breathed out and immediately felt the same effects I remembered from the previous salvia experience. There was a feeling that I was falling, or rather being pulled to the ground, my arms fell down and I had a sinking feeling. With my first salvia experience on 5x extract this feeling led me to believe that the walls were dragging the bong I used to smoke it away from me, quite weird but I told them to fuck off and they did. After the described sinking feeling my vision began to be affected, but I could still see the scene in front of me. I was told later that my eyes were rolled back into my head, but I could still see everything around me, even objects moving. Then the visions came. Everything in my current field of vision that I could or couldn't see began to separate into segmented strips and slid sideways adjacent to each other, as I examined them what they were became clear. The sliding visuals were simply what I could see at that time, but they all seemed to be connected to a point in the middle, a strange black haired head. The sliding segments of vision were all connected to him, and as I looked down at myself I noticed that I was a part of him also.",
  "It was then that the trip started getting even more fucked up. The head in the middle was shouting at me, repeating the words 'I am the man who controls everything' over and over. Believing myself and every other part of the world to be a part of the Man who controls everything, I was obviously quite freaked out. At this point the friend I was with started to laugh, and I did as well, though I am not sure why. But I could see the word 'Laugh' in black printed font appear from the face of the man, and every time the words touched my friend he laughed, the same applying to me. I felt as if I my body was split into the segments I could see in my vision, and all of them were moving in different directions, probably making me twitch a bit.",
  "Coming down from this was very confusing, I didnt know whether the world was just as I had always know it, or if it (and I) was in fact part of the Man who controls everything. Dazed and confused, I took another hit. This time a monk who seemed to be made up of shadow unzipped in front of me, in a similar way and movement of a coat unzipping, spreading outwards. The monk then spun within itself and took me with him. He then explained everything to me, every human being is wrapped up in the Man who controls everything and I had become unwound. In another world entirely, I was laid down on a bed and saw the world winding around me.",
  "I hasten to add that though the experiences were quite disturbing, I never at once in the experience felt afraid of what was happening, I was just accepting all of this and believed myself enlightened, unlike everyone else. After about 20 minutes the confusion had worn off and the world was the same again. My friend then had a similar dose to me, but was completely unaffected. I was quite worried by the schizophrenic belief that I was being controlled by a man who was at the same time me and the world. And as there is a history of schizophrenia in my family I thought that perhaps salvia experiences are linked to the mental stability of the user, my friend being quite a dull person. So I decided against taking any more salvia.",
  "Then I took some more and it was great."
 ],
 "erowid": {
  "id": "40985",
  "citation": " Pseudonymph. \"The Man Who Controls Everything: experience with Salvia divinorum (20x extract) (ID 40985)\". Erowid.org. Jul 13, 2008. erowid.org/exp/40985",
  "substance": "Salvia divinorum (20x extract)",
  "views": "2409"
 }
}
