{
 "id": 7094,
 "title": "Meditative Aid",
 "date": {
  "submission": "2007-05-23T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Gauis Valerius",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "900",
    "grams": 0.9
   },
   "administration": "oral",
   "substance": "Valerian",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I've used a lot of psychedelic drugs, including LSD, mescaline, DXM, DMT, LSA, shrooms, etc., etc.; I've also used a lot of tranquilizers and anti-psychotics (Ativan, Clonapin, Valium; Seroquel). I feel very qualified to analyze psychotropic effects of drugs.",
  "Looking for something to combat anxiety attacks and insomnia (instead of benzodiazepams) I picked up some Valerian Root powder (in 450mg gelcaps).",
  "Taking 2 of these pills produces seems to have the same anti-anxiety and sedative properties as 1mg Ativan or 10mg Valium. I would highly recommend it as a replacement for these habit-forming prescription drugs.",
  "Thinking that MJ might open gates when used in combination with Valerian Root, I decided to try smoking a bowl (or even just a few hits) of MJ and then take 2 caps Valerian Root for meditiation.",
  "Once the valerian kicks in, there are very diffrent psychotropic effects from just weed. It is very easy to enter a waking dream-like state; that is, it is much easier to visualize during meditation with this combination than with either drug alone. CEVs take on a new, distinct character: they are more colorful, more intense, more geometric. Valerian Root and Marijuana allow me to enter a visual dream-state very similar to what I have encountered on a low 2nd plateau DXM trip or with a rag of ether. These characterizations are very imprecise; Valerian Root is not something that will throw me into a different conscious state, it just allows those gates to be broken down a bit easier.",
  "I enjoy the MJ/Valerian Root combination. I enter a controlled dream state, a relaxed and introspective state, and then I fall asleep to vivid dreams. Not a miracle by any means, but decent for someone looking to stay away from 'hard' psychedelics but still looking for a nice, clean, relaxing, pre-sleep meditation.",
  "Very useful for coming down from speed/coke. With everyday use the drug seems to be much less psychologically active, but still sedating.",
  "-G. Valerius"
 ],
 "erowid": {
  "id": "40995",
  "citation": " Gauis Valerius. \"Meditative Aid: experience with Valerian & Cannabis (ID 40995)\". Erowid.org. May 23, 2007. erowid.org/exp/40995",
  "substance": "Valerian & Cannabis",
  "views": "23028"
 }
}
