{
 "title": "Seeking the Correct Dosage",
 "author": "LENZ",
 "citation": " LENZ. \"Seeking the Correct Dosage: experience with Ethylcathinone, 4-Methylmethcathinone & GHB (ID 70966)\". Erowid.org. Jul 7, 2008. erowid.org/exp/70966",
 "substance": "Ethylcathinone, 4-Methylmethcathinone & GHB",
 "bodyweight": "80 kg",
 "report": "<p>N-Ethylcathinone trip report</p><p>Substances: N-Ethylcathinone HCl (orally), GHB.</p><p>The N-ethylcathinone is very fluffy powder. It's hard to make lines of this compound, too fluffy. When the pile is compressed, it forms a single platelet which can be lifted</p><p>up holding on the edge.</p><p>GHB was made by hydrolyzing 200mL of GBL by adding it to a solution of ~1,3289mols (53,154g) of NaOH and  equimolar amount (74,55g) of KOH. Boiled for 15 minutes, diluted to 1L.  pH slightly over 7.</p><p>Bioassay subject: Male, 25yo, body weight 78kg.</p><p>Chronic GHB use for past 2 weeks (redosages every 4 hours or so).</p><p>Medication: MSM (methylsulfonylmethane) 3 x 8g a day, spaced 8h apart. </p><p>Setting: sitting with a friend. He is administering nasally and partially sublingual while I take only oral doses.</p><p>T-48:00h \t25mg 4-OH-DET (orally) (+++, baseline in 4 hours or so)</p><p>T-05:00h\t10mL (~3.4g worth of) Na&K-GHB</p><p>T-02:00h \tGood lunch - 2 small spiced herring files with spiced up potato wedges.</p><p>\t\tDone in oven. Sour milk to drink.</p><p>T-01:30h\tCup of coffee (~2,5dl - finished by T+00:29)</p><p>T-01:00h\t10mL (~3.4g worth of) Na&K-GHB</p><p>T 0h\t\t30mg N-ethylcathinone\t(orally). Friend decides to take same amount nasally.</p><p>T+00:15h \tNo noticeable effects</p><p>T+00:21h\tBP 126/80mmHg, pulse 98bpm\t</p><p>T+00:26h\tSome alerting feeling, which subsided.</p><p>T+00:36h\tPalms and soles of feet sweating, BP 128/81mmHg, pulse 108bpm.</p><p>Slight pressure feeling in head. Focusing easy. Calm, yet alerted feeling.</p><p>T+00:44h\tNo changes to the last comment</p><p>T+00:49h\tGood conversation, slight excitement and mellow feeling. Desire to dose GHB has been around for a while. Also thinking of boosting the N-Ethylcathinone. Feeling: Slightly stimulated, +1, no actual euphoria.</p><p>T+01:00h\tTook a leak, 10mL (~3.4g worth of) Na&K-GHB and a glass of water.</p><p>Pupils weren't dilated but they didn't respond to light 'normally' either. This dose seems very appropriate for studying or when having intense conversation. Quite clear head, but not nootropic qualities.</p><p>T+01:07h\tBP 132/89mmHg, pulse 117bpm. Slightly jittery/jumpy feeling, but not nervous. Don't like the pulse rate at all. The effect is similar than when stopping few week GHB binge.</p><p>T+01:14h\t50mg booster down the hatch in a bomb along with a half cup of water.</p><p>T+01:24h\tSlight stimulated feeling, maybe a small rush even. Still +1, but rising. Warm feeling on the solar plexus, building to some kind of a euphoria. Breathing feels euphoric, smooth and deep. Euphoria comes from N-Ethylcathinone, definitely not from GHB.</p><p>T+01:28h\tBP 135/81mmHg, pulse 120bpm.</p><p>T+01:37h\tEntactogenic qualities: skin feels smoother. Touching myself feels euphoria and gives similiar positive shivers than MDMA when focused. No sexual</p><p>stimulation however. Dreamy feeling.</p><p>T+01:43\t\t+1, Sitting eyes closed - this is the place to be! Music sounds good, slight change in audio perception. Feeling: I want to roll, actually I am rolling! This is way better than MDMA which makes me always to negatively space out even in 80mg dosages. Mouth is starting to dry out, but no jaw clenching. Kai Tracid sounds excellent. Brings back good memories. Heart seems to pound quite fast, but feeling about it is neutral.</p><p>T+01:50\t\tFriend suggests to terminate the actual plain N-Ethylcathinone test and</p><p>spice up the feeling with 50mg of 4-methylmethcathinone HCl. This feels a good idea. Thinking negative ideas manifests some paranoia, which is easily diverted to positive thinking. I could do this again with the same setting or when going to party. I think no-one could notice I'm high. I'm feeling warm and euphoric. +2.</p><p>T+01:57\t\tNegative physical manifestations - not really jaw clenching, but spit \tconsistency change, seems to build up typical stimulant negative effects. Took the 50mg of 4-methylmethcathinone HCl in a bomb. Small burp right after swallowing the bomb. Tastes exactly the same as it smells.</p><p>T+02:08\t\tSeems to peak or something. Very</p><p>T+02:14\t\tEuphoria subsides really fast. At this moment I would want to take more N-Ethylcathinone. BP 153/83, pulse 135bpm. Should've boosted ~15mins ago if I wanted to keep the roll on. At the same time I feel I shouldn't take any more.</p><p>Conclusion: N-ethylcathinone is great material when going out. Short acting. To take some at the club, dance, have a good time, go back to the lounge and socialise with people, then some GHB or favourite alcoholic beverage. When I feel like rolling again, take some more of the N-Ethcathinone. Good starting dose: 80-100mg. For spaced out roll, 150-200mg orally.</p><p>T+02:22\t\tCotton mouth. Sweating. Playing around with my tongue, but no jaw clench.  Don't like the feeling. I want to focus on this test, friend constantly</p><p>tries to conversate and I cannot focus really on anything.</p><p>T+02:29\t\tTook a leak. Basic Eyes slightly dilated. Thirsty feeling. Took half a cup of water. Now I clearly remember why I don't like stimulants: cotton mouth and playing around the mouth. It's annoying. Hoping I don't get mouth ulcers I usually get after stimulants. A good friend suddenly pops up. I feel again I'd like to boost with some GHB.</p><p>Friend looks at me suspiciously. The paranoidic feeling is because I don't want to show I'm high to anyone.</p><p>T+02:41\t\tDry mouth. No other effects. Slightly annoyed feeling. Can't focus my thoughts clearly.</p><p>T+02:52\t\tBoosted with 50mg of 4-methylmethcathinone orally in a bomb. Peripheral</p><p>stimulant effects, such as jaw clenching suddenly went away along with the half cup a water.</p><p>T+02:57\t\tBP 143/88, Pulse 132. General feeling. Talking in the phone very easy, no one could notice I had took anything.</p><p>T+03:19\t\tOpened a beer. Tastes extrordinately sweety - actually horrible. Asked for a sip of friend's sweet cider - HORRIBLE. A test: honey. Rich and full flavour but interestingly not so sweet taste. Snack food tastes excellent, but anorexia is present. Testing with several snacks. Reckon that dosing less than 100mg at once won't give any rushy feeling. Perhaps some stimulation.</p><p>Hearing is somehow focused, everything sounds more sharp. Friend is rolling with the same dosage, partially nasally, partially sublingually, says +++.</p><p>T+03:31\t\tExtrordinadely calm feeling. Cottonmouth. Foul beer taste lingers. I</p><p>usually drink beer only for the taste of it. If I want get drunk, I drink hard liquour. Best to drink only water. BP 145/97, pulse 133.</p><p>T+03:44\t\tTime goes really fast. I wonder why I haven't boosted any more to get</p><p>some noticeable euphoric effect. Head has felt funny for a while. In my tummy I can feel the same feeling when MDMA starts to build up, but that's it. Anticipating feeling. Barely at +1. Can't drink the beer.</p><p>T+03:50\t\tTook 10mL of GHB. Threw a leak. Pupils still similar than before. Nothing new on the feeling side.</p><p>T+04:09\t\tTook 20mg of alpha-pyrrolidinylcathinone. [Erowid Note: No idea what this is.]</p><p>T+04:22\t\tTook a leak. I have sexual desire. Drank water. Slightly euphoric feeling when closing my eyes. BP 133/86mmHG, pulse 135. Old familiar tunes sound like new ones. Music with deep TB-303 lines feel resonating.</p><p>T+04:30\t\tIngested another 15mg of alpha-pyrrolidinylcathinone. Music sounds great, fairly stimulated feeling, still quite euphoric. +. Beer tastes great! Very focused feeling. Feeling is almost comparable to very small dose of pure d/l-amphetamine on the euphoric side. Good humour.</p><p>T+04:54\t\tLoads of talking, still stimulated, but not too much. No side-effects.</p><p>BP 135/77mmHg, pulse 137bpm.</p><p>T+05:06\t\tAlmost baseline. Disappointed, since I have been expecting +++ experience. Took a leak and drank water. 10mL GHB. Again. Pupils dilated.</p><p>T+05:21\t\tThe test is completely ruined - friend decides to inhale some ether. I feel the test is quite complete, slight headache. A tune, which normally gives good shivers is annoying. Feels like MDMA comedown, but I could easily take a nap, thanks to GHB. All in all, even the GHB hasn't worked euphorically.</p><p>I'm regretting I haven't closed my eyes since the last test. If I were in a party, I would either leave home, or take heroic dose - preferably N-ethylcathinone. Feeling empty.</p><p>T+05:34\t\tListening different types of music I normally listen. I feel I should go to work or do some routines or chores. Feeling energized.</p><p>T+05:52\t\tPhone conversation with a stranger was extremely easy and joyful. I do not usually like talking on the phone. Friends are inhaling ether. Our mutual buddy who came here at T+02:29 took 40mg of a-ppp nasally and he says inhaling ether feels different to the nostrils. Slight euphoric rush from the GHB.</p><p>T+06:00\t\tBoth of friends are about to leave.</p><p>T+09:00         Sleep.</p><p>On the next day, feeling was fine.</p><p>My recommended dosage: 3-4mg/kg orally. I tried the anal way also few days after this experiment. Same dosage, twice much the euphoria, eye dilation was extreme and lasted over 12 hours after initial come down.</p><p>In my opinion - GHB somehow interferes with the 4-methylmethcathinone.</p>",
 "year": "2008",
 "id": "70966",
 "gender": "Male",
 "timestamp": "2008-07-07T07:00:00.000Z",
 "views": "19062",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "3.4 g",
   "administration": "oral",
   "substance": "GHB"
  },
  "1": {
   "time": "",
   "amount": " T+ 3:30",
   "administration": "1 cup",
   "substance": "oral"
  },
  "2": {
   "time": "Coffee",
   "amount": "",
   "administration": " T+ 4:00",
   "substance": "3.4 g"
  },
  "3": {
   "time": "oral",
   "amount": "GHB",
   "administration": "",
   "substance": " T+ 4:09"
  },
  "4": {
   "time": "20 mg",
   "amount": "oral",
   "administration": "Unknown",
   "substance": ""
  },
  "5": {
   "time": " T+ 4:30",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Unknown"
  },
  "6": {
   "time": "",
   "amount": " T+ 5:00",
   "administration": "30 mg",
   "substance": "oral"
  },
  "7": {
   "time": "Ethylcathinone",
   "amount": "",
   "administration": " T+ 6:00",
   "substance": "3.4 g"
  },
  "8": {
   "time": "oral",
   "amount": "GHB",
   "administration": "",
   "substance": " T+ 6:14"
  },
  "9": {
   "time": "50 mg",
   "amount": "oral",
   "administration": "Ethylcathinone",
   "substance": ""
  },
  "10": {
   "time": " T+ 6:57",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "4-Methylmethcathinone"
  },
  "11": {
   "time": "",
   "amount": " T+ 7:52",
   "administration": "50 mg",
   "substance": "oral"
  },
  "12": {
   "time": "4-Methylmethcathinone",
   "amount": "",
   "administration": " T+ 8:50",
   "substance": "3.4 g"
  },
  "13": {
   "time": "oral",
   "amount": "GHB",
   "administration": "",
   "substance": " T+ 0:00"
  },
  "14": {
   "time": "24 g",
   "amount": "oral",
   "administration": "MSM",
   "substance": "(daily)"
  }
 }
}
