{
 "id": 71,
 "title": "Never to Smell that Horrible Licorice Again",
 "date": {
  "submission": "2005-07-12T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Arys",
  "gender": "Female",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "7 shots",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ],
 "report": [
  "I had just gotten back from Spain with a bottle of Absinthe that my friend, Michael had urged me to buy. It seemed fine and he told me that we would have immense amounts of fun. Well, not the case at all. My cousin decided that we should take a couple of shots before Michael arrived. When Michael met my cousin and me at my house to start drinking, I felt wonderful.",
  "As the night progressed I would continuously want cigarette after cigarette as with regular drinking. As I went outside, 5 shots later, I felt a little different. My yard was not the same as it usually was and I ran back inside to ask my cousin what she thought. She came out and agreed with me that it was different. I finished off my cigarette and returned inside. I started flirting with Michael a little more than my taste usually allows. After a while I realized that I needed to be supported by him because I could no longer hold myself up. He said that we should all go take another shot. And another. By this time I knew I wasn't feeling well because Michael's head was so blurry and weirdI couldn't focus in on anything.",
  "I remember saying 'uh-oh' and had him carry me to the bathroom where I would remain most of the rest of the night. I made my cousin and Michael hold my hand as I threw up uncontrollably for the next couple of hours. I actually passed out at the toilet. I decided that I was probably going to die, I wasn't even a rock star and I was already passing out at the toilet. Finally, Michael carried me into my parent's room (luckily they were gone for the night) and laid me on the bed. I remember moving around and just holding my stomach all night. In the middle of the night I woke up leaned over my cousin, who resided next to me, and puked right on the floor. I didn't even care.",
  "I went back to sleep and woke up early and puked for the whole next day. My boyfriend came over and told me how horrible and 'unalive' I looked. I felt very dead. I had to go out that night, unfortunately, but when I was out in public I puked right in front of everyone. Absinthe is not fun at all, and I hope I never have to smell that horrible licorice smell again."
 ],
 "erowid": {
  "id": "10050",
  "citation": " Arys. \"Never to Smell that Horrible Licorice Again: experience with Absinthe (ID 10050)\". Erowid.org. Jul 12, 2005. erowid.org/exp/10050",
  "substance": "Absinthe",
  "views": "26317"
 }
}
