{
 "title": "Ooh the Deception!",
 "author": "Sleepyhead",
 "citation": " Sleepyhead. \"Ooh the Deception!: experience with Caffeine (ID 7101)\". Erowid.org. Aug 27, 2002. erowid.org/exp/7101",
 "substance": "Caffeine",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Caffeine"
 ],
 "report": "<p>This is just to tell you about what happened to me when i was made to stop having any and all caffeine, and to perhaps warn all of you people so the same thing wont happen to you.</p><p>I am a musician, and of course i have a great deal of auditions to prepare for and to stress over. Everyday, i would have one mountain dew (or jolt if i could find it around here) in the morning, a couple cans of it when i got home, and maybe a vivarin stuck in there someplace occassionally. This certainly seemed to help get me through the 14 hour days and such, but it takes it's toll on you. You can't get to sleep when you need to, and when you wake up in the morning incredibley tired from n ot being able to sleep, you just have some more.</p><p>Well, I went to the doctor one day to have a check up or something and he told me to stop drinking so much of the stuff. I figured, ok, this should be fine. I knew that you could have withdrawl from it, but I never though that it would land me in the emergency room. I didnt know that it speeds up the whole dehydration process, and of course i wasnt drinking enough of anything. I ended up with a headache and it progresively got worse to the point where my mom thought i was having an anuerism. They gave me painkillers told me to SLOWLY work my way of it and drink a lot of gatorade and water. I'm trying to let you know NOT to do this, though you should never have to have as much caffeine as i've had.</p>",
 "year": "2001",
 "id": "7101",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-08-27T07:00:00.000Z",
 "views": "21249",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Caffeine"
  }
 }
}
