{
 "id": 7102,
 "title": "A Rapid Fire Slideshow",
 "date": {
  "submission": "2006-05-26T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Dream Drifter",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Valerian"
  },
  {
   "time": "0",
   "amount": "4.0 mg",
   "administration": "oral",
   "substance": "Melatonin"
  },
  {
   "time": "0",
   "amount": "900 ug",
   "administration": "oral",
   "substance": "Vitamin B-6"
  }
 ],
 "report": [
  "As a seasoned neuronaut currently interested in dream exploration, lucid dreaming, and out-of-body experiences, I decided to try the above combination, as I had heard about its potential for dream enhancement.",
  "9:40 PM: I ingest the aforementioned substances, do some net surfing while waiting for them to kick in.",
  "10:10 PM: Have begun to feel very, very sleepy. I retire to bed and fall asleep rapidly. As I am falling asleep, I note frenetic activity of mental 'proto-images' forming and dissolving, as if I were watching a multiple slide-show of various semi-hallucinations flickering on and off at great speed. I use the term 'proto-images' because they are not as strong or fleshed out as the kind of hallucinations one might get from 'real' psychedelics, more like a form of rapid mental activity. Its a bit like a feverish state, without the sense of pain or strain, as if my brain is working itself into a frenzy but I'm calmly laying back and observing. This doesn't last long as I quickly enter a deep sleep state.",
  "10:15 PM (?) - 1:30 AM: I sleep and experience several vivid dream cycles. The dreams seem fragmented and incoherent. I have one semi-lucid episode where I realize I am dreaming and attempt (successfully) to levitate my dream-body for a brief period. But it does not maintain the coherence of a good lucid dream; the episode is over quickly and I shift in and out of a rapid dreams that don't have much coherence or real story lines.",
  "1:30 AM: Wake up, feeling quite thirsty and groggy, go to urinate, drink some water, and return. I can note semi-hallucinatory trailer/tracker images, but they are very light; again, nowhere near the intensity one would get with more serious psychedelics. I feel slightly 'out of it' and would not really call the experience pleasurable.",
  "1:35 - 7:00 AM: I return to sleep and enter a more normal dream-and-dreamless cycle, without the frenetic, cut-up quality of the first few hours. Several vivid dreams, but not necessarily anything out of the ordinary. Again, coherence, story line, and lucidity were lacking. I woke up feeling groggy and with a slightly sour stomach. (Whether this latter is due to the substances or to the fact that I drank a lot of coffee and ate greasy foods the day before is unclear.) In a few hours any lingering effects have completely worn off and its back to business as usual.",
  "Overall impressions: Although 'something happened' for sure, I can't say I found the experience particularly meaningful, pleasurable, or useful. The rapid-fire nature of the image formation in pre-dream and dream states was interesting, but a bit disorienting and not especially pleasurable; I'd rather have a 'normal' lucid dream or detailed non-lucid dream any day. I doubt I will ever repeat this, and while nothing horrible or even particularly negative happened, I can't say I found much spiritual value or euphoria from this experience."
 ],
 "erowid": {
  "id": "41037",
  "citation": " Dream Drifter. \"A Rapid Fire Slideshow: experience with Valerian, Melatonin & Vitamin B-6 (ID 41037)\". Erowid.org. May 26, 2006. erowid.org/exp/41037",
  "substance": "Valerian, Melatonin & Vitamin B-6",
  "views": "20083"
 }
}
