{
 "id": 7103,
 "title": "An Incredible Balance with the World",
 "date": {
  "submission": "2005-06-27T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Particle16",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "80 mg",
   "administration": "smoked",
   "substance": "DMT"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "",
   "substance": "smoked"
  }
 ],
 "report": [
  "Having experienced the death of a beloved pet, and several other upheavals of late, I didn't think any substance could really offer me any release. To be honest I longed for the cold bare void of ketamine with its dark spectrum and sharp lines, but found myself intrigued in a deeper trip into DMT.",
  "Filling my water bong with cold water, I added a light sprinkling of damiana under and on top of a larger dose of DMT, 2 of my lower trips to be exact. I sat outside in the backyard and removed my articles, putting them on the table next to me and having another drink of water. I breathed deeply and lit my dose, feeling slightly worried at the size of the dose, and at being completely alone should I wander around or do something silly during my trip. I dismissed this, and breathed quite deeply but was unable to hold what I was smoking too long. The DMT dissolved very quickly and before I had a chance to realise it, the world around me had gone very still. It was very dark with only the moon shining around me, and finishing off the last remnants I sat back in my seat.",
  "Very quickly my eyes closed, involuntarily as I simply wanted to view the world around me in a new light, I was moved into a strangely designed venue, with checkered walls, ceiling and floor. I was convinced that i sat in the corner of this plane, as quickly lights shifted back and forth and over me. The place looked like an empty swimming pool, but had the feeling of plush. The colours coming forth at me where quite dull, and my mind convinced me that it was too dark outside to be truly enjoying the DMT. I turned the thoughts off and the colours shifted until a mist rose around me. I bounced up instantly and my eyes opened, the bounce was so strong that i moved forward into the yard, where the solar lights were shining brightly like little illuminated mushrooms.",
  "I rushed along the path and every tree looked larger yet further away, like my whole form had shrunk. Looking up at the sky quickly I noticed the stars had a new intensity, and the moon itself was beaming directly at me. Its power overwhelmed me as I looked up and absorbed its beams, and looking around me the whole place where I lived looked foreign, yet beautiful.",
  "I crouched transfixed at this vision and thoughts flooded into my mind as the world around me slowly re-appeared. A hundred messages flying at me, with the over-arching feeling, 'the world you see looks different, the world you see is not the way you perceive it, the world you see is shaped by you, the world you see can be understood in many ways'.. the insight left me with a lasting feeling of awe even as I write this, a balance was restored, what seemed wrong can be made right, and what cannot be made right, may never have been wrong. An incredible balance with the world has entered me."
 ],
 "erowid": {
  "id": "41038",
  "citation": " Particle16. \"An Incredible Balance with the World: experience with DMT & Damiana (ID 41038)\". Erowid.org. Jun 27, 2005. erowid.org/exp/41038",
  "substance": "DMT & Damiana",
  "views": "6285"
 }
}
