{
 "title": "My Ten Cents",
 "author": "Girl",
 "citation": " Girl. \"My Ten Cents: experience with Methamphetamine (ID 7107)\". Erowid.org. Aug 27, 2002. erowid.org/exp/7107",
 "substance": "Methamphetamine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>You know, nobody can really tell you what you'll be like on meth or that you'll be a horrible person b/c of it. I, personally, have had wonderful experiences with the drug.</p><p>The first night I did it was the best. It was about 7pm when I snorted my first line just a couple of months ago. I was all by myself too. I only started b/c I wanted to lose weight and I was desperate...165 lbs at the time. Anyway, after going on my daily run and running a mile over what I usually did, I got home and decided to clean the crap out of the kitchen. I cleaned it for about 6 hours straight and it wasn't even that dirty! I was very thirsty the whole night though and kept biting my lower lip til I got some gum.</p><p>I did my research on the internet before I started using. Web sites told how you'll get these sores all over your body, bags under your eyes, rotting teeth, twitches and all sorts of other stuff. All I've had were some sores that are just like pimples and go away after a couple of days and a little paranoia worrying that everyone knew what I was up to. I'm not addicted by any means. I can go days w/o doing any or even wanting any.</p><p>In my opinion it's best to do it in the morning and then maybe a little more at noon. I like it that way b/c I'm focused and energetic for work and not hungry all day and I can get to sleep at night also. But anyway, I just wanted to share a little bit b/c I don't want everyone thinking it's all evil and all that. Like almost anything, take control and don't over-do it. Have respect for the drug and don't take advantage. Just please be careful and be smart about it.</p>",
 "year": "2001",
 "id": "7107",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-08-27T07:00:00.000Z",
 "views": "21112"
}
