{
 "title": "Not What I Expected At All",
 "author": "Itchy",
 "citation": " Itchy. \"Not What I Expected At All: experience with DXM, Yohimbe & St. John's Wort (ID 71084)\". Erowid.org. May 11, 2008. erowid.org/exp/71084",
 "substance": "DXM, Yohimbe & St. John's Wort",
 "bodyweight": "300 lb",
 "header": [
  [
   "DOSE:",
   "450 mg",
   "oral",
   "Yohimbe",
   "(daily)",
   "",
   "300 mg",
   "oral",
   "St. John's Wort",
   "(daily)",
   "",
   "885 mg",
   "oral",
   "DXM",
   ""
  ]
 ],
 "report": "<p>I did some research on dxm prior to trying it, but did not consider possible drug interactions. Hence, I took yohimbe and St. John's wort in my usual daily amounts in the afternoon. Around 8:30 P.M. I took the dxm. Setting is my apartment; I am alone.</p><p>t+1 hour- I start to feel a slight buzz.</p><p>t+1.5 hours- Intensity increases; as it does so my face begins to itch. Itch spreads to chest and back; I look in the mirror and see a bright crimson rash on most of my upper body. I feel slightly feverish. I have diarrhea, and shit four times in the next hour. My heartbeat is somewhat erratic.</p><p>t+2 hours- I feel very manic; I am filled with energy. This is not what I expected at all; the experience resembles more than anything else my few cocaine experiences. It would even be pleasant if it weren't for the diarrhea and rash.</p><p>t+2.5-3 hours- The diarrhea stops, thank God. The rash also subsides, though I have an occasional itch for hours to come. Sadly, the manic euphoria dies down as well. I am left with a feeling of peace and contentment. I don't feel high anymore, exactly, I just feel good. Happy and relaxed.</p><p>Conclusion: This was not what I expected at all. I felt nothing remotely psychedelic or even dissociative. Probably this was a result of unforeseen drug interaction. Overall, despite some unfortunate and even frightening symptoms early in the experience, I enjoyed myself. I will probably experiment further with dxm, but in the future I will use more care.</p>",
 "year": "2008",
 "id": "71084",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-05-11T07:00:00.000Z",
 "views": "8502"
}
