{
 "id": 7122,
 "title": "A Mexican is Coming",
 "date": {
  "submission": "2008-08-25T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Cafoof",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 6x)"
  }
 ],
 "report": [
  "My salvia trips are all similar in many ways. I begin with hitting the pipe, putting it down, and closing my eyes while I hold the hit. By the time I exhale, I am fully tripping. Usually, my ego becomes very fragmented at this point, and I sometimes try to communicate recursively with my self. I promptly get confused X-), so I open my eyes to see where I am, and everything is different.",
  "Usually, everything is arranged in 'logical' rows. For example: lighter, left hand, feet, bed, head, right hand, soda, nightstand, pipe (this roughly parallels what is in my field of vision). For some reason, at this point in the trip I _always_ think that a Mexican is about to show up and make everything better; I then proceed to think about what it is I screwed up that needs to be made better. Or maybe the lighter did it. He was supposed to be to the right of left hand... and where did soda go? There he is between head and bed. How did he get there? Well, I'm a fence, and this is clearly not my fault. Can the Mexican get this all sorted out? I wish he'd get here soon. Maybe I'm the Mexican? No, I'm pretty sure I'm white. Hmm. Anyway, I'm tripping, and this is all horribly funny. Whee!",
  "After a minute or two of this, I break out in a cold sweat and come down a notch. At this point, things start to make sense again and I can talk to people, eat, play video games or write trip reports. I'm still experiencing reality in a way quite different than normal, but my ego is whole again and knows how to operate my body. This part feels sort-of like a medium DXM high, but without the nausea, and the dissociation is of a somewhat different flavor (also, I'm much more active than on DXM, and I don't slur). Watching things can be fun, and I'm surprisingly good at concentrating on simple tasks, like playing Katamari Damacy (I play that game better on salvia than sober). Music is fascinating, like on DXM. I sometimes get rather intense tactile hallucinations in this phase of the trip; they're not really describable in terms of normal tactile sensation. One of the more common ones is a sensation like of lying with my bare back on fake plastic grass (astroturf?) and at the same time like itching everywhere at once.",
  "I gradually come down over the next 30 minutes to an hour. It's hard to say exactly how long the trip lasts, since in my experience the effects can be rather subtle, and I'm not always sure what I'm just imagining and what is a product of the drug. I think that imagining is really the key word when it comes to salvia.",
  "Note: I've been taking prescription antidepressants for over a year (fluoxetine, aka prozac). My current dose is 40mg/day."
 ],
 "erowid": {
  "id": "41130",
  "citation": " Cafoof. \"A Mexican is Coming: experience with Salvia divinorum (6x extract) & Fluoxetine (Prozac) (ID 41130)\". Erowid.org. Aug 25, 2008. erowid.org/exp/41130",
  "substance": "Salvia divinorum (6x extract) & Fluoxetine (Prozac)",
  "views": "4834"
 }
}
