{
 "id": 7124,
 "title": "Acid Reflux, a Tad Giggly, Horrible Sleep",
 "date": {
  "submission": "2006-10-24T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "doppleganger",
  "gender": "Male",
  "weight": 159
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Propylhexedrine"
  },
  {
   "time": "0",
   "administration": "20 mg",
   "substance": "oral"
  }
 ],
 "report": [
  "First off, I am a recreational Marijuana smoker and am currently on Trileptal (300mg) [an antiepileptic] twice a day an Paxil (20mg) once a day.",
  "The Benzedrex Inhaler was acquired at a CVS pharmacy. They keep them behind the counter but I don't know if there is an age reqirement to purchase them. The top of the inhaler screws off like I was supposed to eat the cotton inside or something. I was kind of leary of the idea of eating cotton, however since it is already saturated in the Propylhexedrine it is quite easy to consume if torn into pieces.",
  "After consumption it took me a while to be able to keep a straight face because of the horrible taste that came with acid reflux. The burps were bitter and almost nuaseating. After drinking a Mt. Dew and smoking a few cigarettes I began to start getting a tad giggly, like after smoking maybe half a bowl of decent weed. The more I moved the more I seemed to become intoxicated. The high peaked with odd bursts of energy and then climbing back down from stoned to sober at a faster rate than it climbed. After I thought I had sobered up and was feeling a tad fatigued I sat with my mom and chilled out in the living room to read. However I was still talking a mile a minute and fidgeting.",
  "Id say this experience lasted for about three and a half hours. That night however I had horrible sleep. I went to bed at eight pm, woke up wide awake at one am. I could barely go back to sleep at close to five am. Upon waking at six am I was still disoriented.",
  "The next day I had a constant headache, but no blurred vision though. The headache was bearable, but I still had to take a few Ibuprofen to stand school. It wasnt a dirty high like I have experienced with other OTC medications. It's one I definatly would like to experience again to fully understand it."
 ],
 "erowid": {
  "id": "41141",
  "citation": " doppleganger. \"Acid Reflux, a Tad Giggly, Horrible Sleep: experience with Propylhexedrine (ID 41141)\". Erowid.org. Oct 24, 2006. erowid.org/exp/41141",
  "substance": "Propylhexedrine",
  "views": "15273"
 }
}
