{
 "title": "Best and Worst Experience Ever",
 "author": "Eqlon",
 "citation": " Eqlon. \"Best and Worst Experience Ever: experience with 2C-T-7 (ID 71249)\". Erowid.org. Sep 22, 2008. erowid.org/exp/71249",
 "substance": "2C-T-7",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "2C-T-7",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "71249",
   "Male",
   "",
   "Not Given",
   "Sep 22, 2008",
   "2753",
   " "
  ]
 ],
 "report": "<p>Me and 2 friends startet off buying 2 blotters of LSD and 2 Microdots. As we thought the microdots were also LSD (The day after,  i found out that the microdots were not LSD, but 2C-T-7) I was the only one to take a microdot, while th other 2, took the blotters we bought. I am only 15, so i know that experimenting with psychedelic drugs, may not be the smartest thing to do at my age.</p><p>We were waiting for the onset, and was playing ludo while doing it. And as the effect startet to take shape on my friends, i startet thinking 'What? Why cant i feel anything?'. Another 15 minutes went, and i startet to feel more and more confuzed about everything.</p><p>Then after some more time, everything just kept getting very funny, everything was just the most funny thing, i had ever seen. The corlours startet to change all the time, and small waves of light kept comming like a scanner infront of my eyes.</p><p>When the scanner thing stopped, the room was very bright, and the cornors of every object, kept changing corlour all the time. This is VERY hard to describe, so i am doing the best i can. Thats when i realized, that i was blown very far away from reality. This was the greatest experience of my life! The faces of my friends was also much more colourfull. </p><p>And like on LSD everything was soft and wavy, i first realized this, when i was looking at the curtains.  I was thinking, 'This is like uncooked reality' 'This, is the real world, this is how it really looks like'. Now EVERYTHING, and i mean EVERYTHING i looked at, was totally fucked up, I was yealling and screaming about how fucked up this was. </p><p>It was like we were trapped inside time, the time didnt go. We sat and talked for 30 minutes, but on the watch, only 1 minute had gone! I was getting scared, that this might never end. This was the start of the bad part of the trip.</p><p>Now i really felt bad, and my friends did too. I litteraly thought that i was insane, that this would never get an end. And i just kept feel that way, untill we had to call another friend for help. We called him, and he came just 30 minutes after. (tho it felt like a whole year!) When he came, he asked if we got any weed. Doh! why havent we thought of that earlyer? He made 3 joints, and they got smoked. </p><p>But as i thought, it didnt work. I was getting more and more paranoid, so i startet thinking of killing myself, just to get out of this insane world. They one of my friends got an idea, he had some Zopiclone in the kitchen, and we took one each. I should NEVER have done that. That was the start, of the most terryfying thing i could ever think of.</p><p>The Zopiclone startet to take its effect, and things got even worse. I Got in coma-like state. No one could get in contact with me, i was just lying on the floor laughing and crying at the same time, i had my eyes open, but couldnt see anything at all, just hallucinations flying all upon me. </p><p>After 30 minutes it got better, and i fell asleep. When i woke, all of the effects were gone, and i couldnt remember most of it.</p><p>All of the things just came back to me today, so thats why i wrote this report.</p>"
}
