{
 "title": "Methadone Hell",
 "author": "Mimi T.",
 "citation": " Mimi T.. \"Methadone Hell: experience with Methadone (ID 71288)\". Erowid.org. Feb 28, 2010. erowid.org/exp/71288",
 "substance": "Methadone",
 "bodyweight": "195 lb",
 "header": [
  "DOSE:",
  "100 mg",
  "oral",
  "Methadone",
  "(daily)"
 ],
 "report": "<p>I have used drugs recreationally since I was 16 years old, even used the needle for a few years on and off back in the 70s. My daily narcotic habit started back in 1990, when I had my first back surgery. I started out on Lortab, Tylox and Percodan and then graduated to Morphine tablets, Oxycontin and the Fentanyl patch when my resistance to the others became apparent.</p><p>I used Oxycontin 20 mg three times for about a year before I ended up breaking or crushing them, and taking my prescribed dose to soon, only to stay in a state of slight withdrawal until I could get more. I ended up being  placed on 80 mg Methadone tablets by my doctor ( taking two 20 mg twice a day ) This worked great at first for my pain and I  did not have any bad side effects at the time of the switch from the oxys. I took this high dose for over a year before my doctor had a major heart attack. My prescription was due to be refilled at the time and I could find no one to give it to me!</p><p>Trying to stop an 80 mg a day methadone addiction at home was the worst thing I have ever experienced in my life. After three days my withdrawal became massive. My blood pressure went sky high, my ankles felt like they were busting apart, I am not sure if it was from the high blood pressure or what. Every part of my body was in severe pain. I felt like I was coming out of my own skin, and even a sheet was painful to the touch. I could not even drink water, only suck on crushed ice. I could not sleep, eat, get comfortable or function at all for almost 2 solid weeks! I literally prayed for death.</p><p>After 2 weeks I was finally able to be carried to a chair in my living room wrapped in a a blanket but I barley remember it. I do remember watching Braveheart the movie three times in a row one time and never really saw or heard any of it. I was able to walk outside and sit on the grass after almost 3 weeks.</p><p>The bad part was someone told me about a methadone clinic new in town and I begged them to take me, as I felt like I was slowly going to die if something didnt happen soon. I had lost over 20 lbs in three weeks and I looked like death warmed over.</p><p>The clinic started me on a dose of 30 mg right from the start, and within 2 hours I was feeling so much better that it was unbelievable. The way it works at the clinic is you can increase your dose every 3 days by 5 or 10 mg. until you reach 100 mg. If you need more than that you see the doctor, have some blood work and get the increase.</p><p>I of course went to 100 mg as soon as I could. Unlike the tablets I had taken the liquid methadone has affected me differently. The first year I was at the clinic was a great one, as I felt normal but over time things about me started to change. I have turned into a recluse, not even wanting to talk on the phone. I feel like I am in a stupor all day, just existing, the worst is I have no sex drive at all and I have gained over 60 pounds since I started there. I have no motivation, and I sit or lay like a slug all day. I sweat a lot, cant sleep over 3 hours a night and my vision is screwed up. I am so afraid of the withdrawal that I have been going to this clinic for over 4 years straight now.</p><p>Two years ago I started decreasing my methadone by 5 mg every month or so. I finally made it to 5 mg six weeks ago and I am now at 2 mg which started two weeks ago. Let me tell you that the decrease from 5 mg to 2 mg has been horrible. To think that this stuff is that strong is mind boggling.</p><p>I sweat horribly at times, I feel like I have a  bad flu which includes diarrhea most of the day, my ankles hurt and I have now developed heart palpitations that I now take  medication for. The feeling of jumping out of my skin is an every day occurrence just not as severe as the first time. I am irritable, moody, depressed and feel like I someone who has a terminal cancer or something. I feel so tired that walking across the floor exhausts me.</p><p>I am picking my weekly take out in the morning and I have decided this will be my last week.  I dread what it will be like, but now that I have made it to 2 mg I have to see this thru. The first withdrawal was not by choice this one is, I am praying that will make a difference. Hopefully others will read this and stay away from this horrible drug, and for those who are maintaining hopefully they will see that if you decrease your dose very slow there is at least hope of becoming free of it.</p>",
 "year": "2008",
 "id": "71288",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2010-02-28T08:00:00.000Z",
 "views": "18293",
 "dose": {}
}
