{
 "title": "I cant believe this is legal!",
 "author": "H-Town Chris",
 "citation": " H-Town Chris. \"I cant believe this is legal!: experience with DXM & Salvia divinorum (ID 7130)\". Erowid.org. Jul 14, 2002. erowid.org/exp/7130",
 "substance": "DXM & Salvia divinorum",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "4 oz",
  "oral",
  "DXM",
  "(liquid)",
  "",
  "2 hits",
  "smoked",
  "Salvia divinorum",
  "(extract - 5x)"
 ],
 "report": "<p>I had already been trippin on the cough syrup for about 5 or 6 hours.  Me and two friends were chillin in his apartment and we get a call from his neighbor saying, 'Hey man i ordered this Salvia divinorum shit and it doesn't even work. do you want it?' My friend immediately left and came right back with a handful of Salvia extract.  I watch him load a bowl in the 2 ft bong.  He took 1 fat hit, then another. then he smiled and handed me the bong. He stared off into the air and actually started drooling. I thought he was messing around. I asked him if he felt it and he tried to talk but a blob of drool fell out of his mouth.  A few minutes later he came back to earth and said 'I cant believe this shit is legal!'</p><p>I loaded a bowl for myself and took a big hit, held it. Then another, and held it.  I handed my friend the bong.  I remember certain spots on my body feel like they were being pushed to the right with a lot of force. I almost actually moved along with it. Then I became really confused. I forgot where I was and who my two friends were. i could see their faces but everything around it seemed to sort of melt to the right side like a Jacob's ladder. Pretty crazy. I remember my friend saying 'Is it working?' and it was sooooo hard for me to spit out the word yes. I said it really slow. Then finally I looked around the room and figured out where I was. I looked at the bong in my friends hand then I remembered what happened. </p><p>This was the most intense trip ever. the peak was probably about 5 minutes. i would love to get some more of this.  this was a great experience and i think potheads and mushroom fans would dig it.</p>",
 "year": "2001",
 "id": "7130",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-07-14T07:00:00.000Z",
 "views": "9073",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 oz",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
