{
 "id": 7133,
 "title": "Infinite Lightness",
 "date": {
  "submission": "2007-06-24T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ad",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Codeine",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "Codeine gets boring with habitual use, and the dosage runs up too fast. Tramadol on its own is a bit weak and just does not get me the desired calm. Surprisingly enough, mixing the two gets one really, really, really messed up.",
  "Moscow, Russia. February 2005. I'm withdrawing from mixing anything and everything with opiates I can get my hands on. Quality codeine is a bitch to score these days. Most locals eat over-the-counter crap with other dilutants (toxic as hell). The experienced junkie learns to extract these, but when a med contains 5 different ingredients, that can be a bitch. Especially if barbiturates are in the mix. Some even IV the shit.",
  "A couple people recommended getting Codipront, a mix of time-delay codeine and a tiny bit of antihistamine to counter the adverse effects of codeine. No real side effects. No need to mess around with the crap, just eat and enjoy. Otc, too, but very hard to find, the moment it appears somewhere it gets bought up, spent half the day, and visited about 20 pharmacies, but in the end got two packs of 10 for the ludicrous (for Russia) price of 15 bucks each. Scored some tramadol+paracetamol mix earlier in the morning (prescription but like any old junkie Ive got my crooked pharmacy. I hate paracetamol and know Ive gotta extract the shit, but what the hell, it was cold and I was withdrawing, ate 400 mgs worth in a goddamn porta-potty.)",
  "When I got the Codeine, the Tramadol seemed to be wearing off. But fuck me... ate some and went to university. Couldnt stop chatting with everyone. I loved everyone and everything. Very fucking euphoric... Walked a girl to her dorm, and had one of the most amazing conversations of my life. Even walking alone in the cold seemed orgasmic...",
  "After this I just had to mix the stuff again.",
  "On a nice side note, I can be fucked to all hells on this mix but my eyes look ok, and I look slightly drunk at the worst... Thats cause codeine alone makes my pupils go to pinpoints, but tramadol alone bumps them up to saucers.",
  "The next day I got the paracetamol out of the tramadol, drank down the nasty shite (400 mgs) and went to university. Once I got there, bought me a beer and slugged down 5 codipronts (150 mgs codeine) with it.",
  "Felt nice. Our local stoners noticed and started asking me about it. This stuff makes me generous as hell. So I got em both fucked up too.",
  "Both had used heroin once or twice, but weren't really the opiate type. I gave the hallucinogen fan 240 mgs tramadol + 90 mgs codeine because he had more experience, and 180 mg tramadol + 60 mgs codeine to the speed-fiend. Two hours later I envied the bastards. We were all fucked up beyond belief. But those two were just gone. The speed fiend kept on falling asleep. The hallucinogenic one kept on saying things like 'dude try walking it is so fun or 'man breathing feels like sex'.",
  "Cigarettes go great with this stuff. Coca-Cola is nice for some reason, prolly because it contains caffeine but no tannins (those cancel codeine out almost entirely). Eating is impossible. The idea alone makes me ill. Every once in a while I feel like Ill throw up, but it doesnt bother me in the least and I never do in the end anyway. We just sat in the cafeteria chugging cola, and making bathroom runs every 20 mins (also typical for some reason).",
  "Doing this stuff with other people can sometimes not be so fun, though. Tramadol is very speedy.",
  "Coming down is sleepy, but irritating. Nothing horrid, just a feeling of tired loss. There was to be a party in the cafeteria in the evening, so there were balloons everywhere. We appropriated three pinks (pink seemed right and comfy), sat around and stared at the buggers and stroked them like they were cats or something. Makes for a calm and comfy feeling (yeh, I know it sounds strange, hell it feels strange to me, but it was right). For some reason everyone just thought we were stoned or something, no one cared. Also helped that there was a dead-drunk professor a couple tables over, staring at his food with a fork in the air but unable to concentrate enough to move his hand. Thinking back, we should have been more careful. It was mostly the amateurs looking silly though.",
  "This stuff allows for self control as much as needed, with a bit of effort I can act fully adequately, although I look a bit gay (yes, gay, as in excessively sweet to eveyone, so caring and nice that I seem either gay or a bible-junkie).",
  "Gum does kill everything for some reason. Because today, just today, in this vacation from reality, everything and everyone is just lovely and perfect.",
  "This stuff is addictive as hell. The codeine has a physical addiction, tramadol doesnt seem to be that bad, and at this 2-1 ratio, the brunt of the addiction is tramadol, which I find is kickable with 24 hours of sleep, and a couple nights of light beer therapy."
 ],
 "erowid": {
  "id": "41175",
  "citation": " Ad. \"Infinite Lightness: experience with Tramadol & Codeine  (ID 41175)\". Erowid.org. Jun 24, 2007. erowid.org/exp/41175",
  "substance": "Tramadol & Codeine ",
  "views": "36128"
 }
}
