{
 "id": 714,
 "title": "Why I Am Never Touching It Again",
 "date": {
  "submission": "2004-12-03T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Brendan",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I wont lie I have smoked serious amounts of ganja in the last 15 months probably about 20 or 30 ounces but the experience I had last night has put me off that shit for life. The day started normally I phoned my friend E and we bought some cigarettes and a 10s of skunk, went back to his house and smoked a joint. I was really stoned after that felt fairly anxious and nauseous something which has got gradually worse over the time Ive been smoking puff. Anyway we smoke another joint later on and I dont feel so buzzing so I figured it would be cool to smoke a fat joint and fly off into my own world something I usually do on Saturday nights so we smoke the joint and then bang! I was totally out of it.",
  "Ive been really stoned before and have never been sick, Ive smoked a half ounce to myself in a night and felt fine, but this buzz was different. I became gradually more disorientated, nauseated and paranoid. I kept saying where the fuck am I? and help me. I couldnt breathe and had a panic attack. This is when I knew my relationship with cannabis was very much over. The buzz became very psychedelic and as I was feeling sick and dizzy this just made it worse I felt very trapped. I looked at a window and the world turned upside down, and stayed that way. I managed to stumble to the toilet and vomited, very painfully and noisily waking Es mother who questioned me why I was feeling sick I managed to mumble something about eating too much. I return to Es bedroom and continued to feel very sick and disorientated for another 2 hours or so and had some mad visuals, I thought I was going mad.",
  "When I woke up this morning I felt fine and thought I had just smoked too much too quick so stupidly decided to smoke another joint, I felt those feelings of insanity return and decided that this was it, Ive had good times and bad with puff but why bother getting high and spending money just to feel insane!"
 ],
 "erowid": {
  "id": "11832",
  "citation": " Brendan. \"Why I Am Never Touching It Again: experience with Cannabis (ID 11832)\". Erowid.org. Dec 3, 2004. erowid.org/exp/11832",
  "substance": "Cannabis",
  "views": "5358"
 }
}
