{
 "id": 7144,
 "title": "Short and Comfy, Potentiated Low Dose",
 "date": {
  "submission": "2005-08-26T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Z.",
  "gender": "Male",
  "weight": 132
 },
 "dose": [
  {
   "time": "0",
   "amount": "42 ml",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "0.125 ml",
   "administration": "oral",
   "substance": "5-MeO-MIPT",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "3 oz",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ],
 "report": [
  "All times 24-hour clock",
  "(5-MeO-MiPT @ 25mg/ml @ 67% Ethanol)",
  "(Syrian Rue 4x extract, powder)",
  "This is a log of all food, and etc.",
  "17:00 fish sandwich, French Fries, sugar-free cola.",
  "21:00 1-2 cups kettle corn",
  "22:00  1/3 of a 1/4tsp measure of Syrian rue put in glass.",
  "0.125ML 5-MeO-MiPT solution added.",
  "1/2 oz 99% ethanol added and mixed well.  Soak 1 min.",
  "Added 2-3 oz Maker's Mark brand Whiskey.",
  "4 OZ Sweet and sour mix added.",
  "2 US standard tray-style ice-cubes added.",
  "22:10 begin drinking slowly.",
  "23:00 Finished not too long ago. Slightly giddy.  Some visual after-effects.  Similar to camera-flash blips.  Slightly woozy. Rush comes fairly quickly.  It feels like it takes 30+ mins, but it was more like 10.",
  "Peak was different than last time.  Rather than a fast spike, it was more like a slow flood, waters rising to a little bit lower level.  It was much more enveloping.  Speech became difficult for a while.  Subjective time was another 30-40 mins.  Real time was probably about another 10 mins. Body load was VERY noticible during peak.  Vibration and a feeling my arms, hands, etc. just weren't right.  I get this from time to time IRL, and from other weak trips, and this was the same but amplified.  This might not make sense to everyone.",
  "25:53 OMG, It's not even been an hour!?!?  It felt like it had to be at LEAST 2 hours.  Everything's manageable and good.  Having lots of fun with friends-on-pot and SO-on-alcohol.  We're talking about all sorts of things, from sex, to poop, to the internet.",
  "01:43 99% baseline for a while.  This 99% baseline contines for a while also.  Faint recurrances at 25% for a few seconds, off and on.  We all went to sleep not too long after.",
  "Sleep was good.",
  "Stayed in bed late.  Woke up normal.  Happy mood, normal appetite.  No impairment whatsoever.  Normal day activities followed normally as normal in the normal manner, normally."
 ],
 "erowid": {
  "id": "41214",
  "citation": " Z.. \"Short and Comfy, Potentiated Low Dose: experience with 5-MeO-MiPT & Syrian Rue (ID 41214)\". Erowid.org. Aug 26, 2005. erowid.org/exp/41214",
  "substance": "5-MeO-MiPT & Syrian Rue",
  "views": "8261"
 }
}
