{
 "id": 7146,
 "title": "An Unexpectedly Perfect Trip",
 "date": {
  "submission": "2005-04-11T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "R",
  "gender": "Female",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I had been toying with the idea of eating mushrooms for a year or so before I finally had the chance to experience them last week.  I was amazed at how much I liked them!  But, I'm getting ahead of myself already.  I had never tried any sort of hallucinogin before, though I've been quite intimate with marijuana for some time now. ",
  "I began to get ready for my trip a week in advance.  I did some fairly extensive reading online and talking to friends about their experiences with mushrooms.  This did a lot in the way of calming my nervousness about the mushrooms, even when I was reading or listening to 'bad trip' accounts.  I also made a point to prepare myself the day before and the day of eating mushrooms.  Some things that were helpful to me were eating fresh and healthy foods, getting enough sleep, maintaining a positive attitude, and--most importantly--really making a point to deal with any sort of stress or negitivity as it arose, then dispel it, and move on.",
  "I had heard from several sources the importance of set and setting.  I think I chose wisely in both regards.  My mind set was good from the preparation I had done.  And the setting was just right.  I was on a break from college and had gone to stay the week with two of my close friends, E and B.  Another friend from school, W, was also staying at their apartment.  E, B, and I ate the shrooms together and W volunteered to be our 'sober friend' for the evening.  Having W around turned out to be a fantastic addition to the trip.  I really should send him a thank you card!  The night proceded as follows:",
  "At 9:00 p.m. E, B, and I eat our mushrooms in the form of crunchy peanut butter and honey sandwiches.  Delicious!  W got out his guitar and played for us.  I was really enjoying the live music.  In a half hour or so I started yawning a lot.  This, according to E and W (the more experienced trippers), was a sign that I would begin to feel the effects of the mushrooms soon.  Sure enough, ten minutes later I was working on a nice body buzz and my trip offically began.  I was experiencing some fun visuals--intensified colors, interesting patterns, a shimmery quality to lights.  Almost everything was amusing and usually humorous.  I was giggling at lighters, oranges, my hair.  Watching W make a sandwich was beyond entertaining!  I couldn't believe it when I saw him tear a paper towel off of the roll.  It was like he was performing a magic routine.  But W wasn't the only one being tricky; I had a strong sense throughout the experience that everything around me was, in a very pleasant way, slightly mischevious.  I loved the feeling of not knowing what to expect next.  Who knows what that wall or the pictures on the fridge are up to? ",
  "We smoked marijuana throughout the evening, which served nicely to keep my trip going strong.  Around 11:30, W took the three of us for a drive.  B sat shotgun, with E and I in the backseat.  B was in charge of music and I was pleased to discover that he and I were in exactly the same places on what to listen to.  I just made myself comfortable and enjoyed the show.  The lights along the streets were spectacular!  When we arrived back at the apartment we had to park several blocks away.  This was fine by me, though.  It had been snowing for a few hours and there was a beautiful white blanket over everything.  It felt wonderful to walk on.  E and I were laging behind.  He was having some difficulty lighting a cigarette.  We were then further delayed when we had to stop for a moment upon our mutual realization that we seemed to be walking through an oil painting.  The scenery was so surreal that that was the only explanation.",
  "Back at the apartment we packed another bowl and settled in to watch a movie.  I was happy to have it on, but there were too many other things happening for me to pay much attention.  I was quite busy making the flame of a candle dance with my fingertips, playing with my reflection in the mirror, and following my urge to spin around in the kitchen.  After the movie, B and W went to sleep, so E and I went to his room.  Well, some combination of the low lighting, the music, the orange I was snacking on, and the hookah smoke began to make me feel very...primal, I suppose.  And so, acting on that most primal of urges, I went (at 4:00 a.m. or thereabout) to wake up W to see about some physical contact.  Like I said, I should send him a thank you card!  My trip was coming to its inevitable end, but some nice kissing and caressing helped to bring me down easy.",
  "I woke up (late) the next day feeling refreshed and absolutely pleased with my first experience with mushrooms.  I hope that this account will serve to entertain, and intrigue, and inform you.  My advise to anyone who is thinking of trying mushrooms is 'Do it!'  That being said, also do some research and some preparation.  Mostly, though, enjoy.  Follow your impulse to laugh or cry or announce to your friends that you suddenly can't believe how ridiculously tall you are.",
  "Peace, B"
 ],
 "erowid": {
  "id": "41217",
  "citation": " R. \"An Unexpectedly Perfect Trip: experience with Mushrooms & Cannabis (ID 41217)\". Erowid.org. Apr 11, 2005. erowid.org/exp/41217",
  "substance": "Mushrooms & Cannabis",
  "views": "5539"
 }
}
