{
 "id": 7148,
 "title": "Sun Opener Sore Chest",
 "date": {
  "submission": "2007-06-05T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Ibis",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Heimia salicifolia",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Heimia salicifolia",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Heimia salicifolia",
   "form": "(leaves)"
  }
 ],
 "report": [
  "I ordered 56 grams of Heimia salicifolia from an online vendor in hopes of a pleasant expansion of an important meditation session I had planned.",
  "The first try: I boiled 5g of loose leaf herb in about 2 cups of water for around an hour. Being somewhat hasty, I drank this concotion off without letting it ferment in the sun. The effects were very subtle - mild body relaxation, some sense of 'buzzing,' but nothing near an auditory hallucination or sense of cold. The next morning I was very tight and sore in the chest.",
  "The second try: Boiled 10g of loose leaf herb in about 2-3 cups of water for 30 minutes then set in the sun to ferment for 6 hours. Drank this nasty brew about an hour before going to bed and had similar effects to the first dose. Fell asleep. Later that night woke up with severe soreness and tightness in the chest and a mean headache.",
  "I hope to try again for one last shot to see if there is any difference. In the meantime I have been smoking the loose leaf herb. When smoked it has a pleasant, relaxing effect. I often will smoke 1-2 cigarettes before hiking as it puts my mind in a good mood and resonates fairly well with the wilderness."
 ],
 "erowid": {
  "id": "41225",
  "citation": " Ibis. \"Sun Opener Sore Chest: experience with Heimia salicifolia (ID 41225)\". Erowid.org. Jun 5, 2007. erowid.org/exp/41225",
  "substance": "Heimia salicifolia",
  "views": "13378"
 }
}
