{
 "title": "Strange Hallucinations",
 "author": "J Foxx",
 "citation": " J Foxx. \"Strange Hallucinations: experience with DXM (ID 71581)\". Erowid.org. Jun 5, 2008. erowid.org/exp/71581",
 "substance": "DXM",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "220 mg",
  "oral",
  "DXM"
 ],
 "report": "<p>I took 220mg of DXM around 2am. I stayed up keeping myself busy. I hardly felt different and was a little frustrated so I decided to go to sleep around 4am. I had some insomnia and eventually fell asleep around 6am. I woke up at 8am and went on with my day. I had some minor vertigo and dizziness. My eyes seemed a little dilated throughout the day. At the end of the day I decided to go to bed early because I was very exhausted. At 9pm I turned off my lights and closed my eyes. I thought DXM was out of my system, but I was wrong. I was having closed eyes visual. Very spacious patterns what were black and white moving downwards and left and right.</p><p>I grabbed my phone and turned it on. The light was trailing off from it and it looked like it was a straight line. I waved my hand passed the light and my hand seemed as if it was being shadowed by another hand. I closed my eyes again and the patterns were much different. All the shapes seemed as if they were scrunched together and they were indistinguishable. I turned my light to my room back on. Everything seemed normal and I wasn't hallucinating anymore. I looked in my mirror and my eyes were dilated. I returned to my bed with my lights turned off again. The closed eye visuals were so vague I couldn't hardly notice them. They eventually stopped and this whole hallucinations process only lasted for ten minutes! </p><p>I think DXM has very strange effects when used in complete darkness.</p>",
 "year": "2008",
 "id": "71581",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-06-05T07:00:00.000Z",
 "views": "4752",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "220 mg",
   "administration": "oral",
   "substance": "DXM"
  }
 }
}
