{
 "title": "The Consequence of Ignorance",
 "author": "Shiggidy Shlade",
 "citation": " Shiggidy Shlade. \"The Consequence of Ignorance: experience with Datura (ID 71660)\". Erowid.org. Mar 13, 2010. erowid.org/exp/71660",
 "substance": "Datura",
 "bodyweight": "220 lb",
 "report": "<p>Before I begin the actual story of the trip, Id like to give you, the reader, a look at what happened leading up to the time of ingestion. It wont take long, but gives you a better understanding of how my entire personality changed due to the ingestion of the drug.</p><p>I was at my cousins house with a friend. For now well call my cousin Mark and the friend Moe. We showed up at Marks house at about 9. I met Moe there and we ended up taking turns at playing Socom in the living room, ripping on each other for no apparent reason, and eating what was left of the food in the house. Me and Moe went into the bedroom because there was cable in there and he wanted to ask me something. He asked me if I was down for getting fucked up. I was always down, but we had to walk somewhere to get them. We then walked out, rode our bikes down to Main Street and picked a few seed pods of something we had no idea the origin of.</p><p>We headed back to the house, throwing caution to the wind I took two pods full of seeds with a glass of water, him being much smaller and never having any experience with any kind of drugs only took one. Moe weighs only about 140 lbs. it only seemed right that he took a smaller dose than I. I then laid down on the bed and stared up at the spinning ceiling fan. From this point on, Im going to tell you what I remember and what witnesses told me had happened.</p><p>About 20 minutes after ingestion I started feeling strange. I felt good. I thought it was similar to the effects of smoking marijuana, but it wasnt. The only similarity between the two is all of the sudden I had bad cottonmouth. I got a glass of water and went outside to check if my uncle had any snuff in the truck. He did and I put in a pinch of Copenhagen. At this point I felt very odd. I was stumbling around, slurring my words, and sweating more than usual for the current temperature. I couldnt handle the small chew I had and started to gag because of the extreme lack of moisture in my mouth. I took it out, stumbled back into the house and grabbed another glass of water. I went back into the bedroom and laid down on the bed and watched the ceiling fan once again. All of the sudden, a hazy purple spot started appearing on the ceiling. I was intrigued by this so I stayed and watched them for a while.</p><p>Time after ingestion: roughly 1 hour</p><p>Moe entered the room and asked if it was ok to turn the lights off. I had my fill of the purple haze, so I agreed to the black out. I closed my eyes and it was like a laser show. Images of random objects drifted in and out of sight while circular designs danced in the background. From here on, what I remember will be in quotes and what happened that I have no recollection of will be in stars. The following will be in chronological order to the best of my abilities.</p><p>*At this point I was drenched in sweat so I was inclined to take off my shirt. I then went to the bathroom to splash water on my face and ended up completely undressing. I have no idea where Moe was, nor what he was doing. I was naked in the bathroom and I started throwing punches. Hard punches. I was boxing anything in the bathroom that wasnt bolted down. According to Mark, my uncle was awoken by the noise and got up to check.*</p><p>I was all the sudden shirtless in the living room, sitting on the couch, looking up at Mark and my parents. I was disoriented.  Not sure of where I was. All I did was what my parents asked me to, which was put on my shoes and shirt and get in the car. I got up to walk out the door.</p><p>*I was driven back to my house in the country. Im not sure what words were exchanged between me, my mother, and my father, but I doubt there were any.*</p><p>I came to on another couch. Mine. Looking up at my father, who didnt look particularly disappointed, but more amused at my odd and silly behavior. I kept on having this sudden urge to get up, yet every time I attempted to, my fathers stern voice chimed in saying Stay down, dont get up. I kept trying and he started to laugh as every time I got up, Id sheepishly sit down. I felt like I was 9 years old, doing as I was told or Id be sent to my room, or worse; the corner. After many attempts, I thought Id go at it at a different angle. I have to pee, I said. He looked at me with a warm smile and took my hand and helped me to the bathroom. I felt secure for some reason.'</p><p>'I wasnt able to stand so I sat as my dad snickered in the doorway. I looked up at him again, wondering why I kept feeling younger and more helpless as the time passed. I cant go. Stop laughing, I said. He then helped me up and put me back on the couch. I sat and strained my ears for the conversation that went on between him and my mother in the other room. I kept hearing horrifying words like die and hospital and overdose. Its important to note at this point that in the crazy religion my family is apart of, we dont go to doctors. They believe in healing through prayer. So if there was talk of a hospital visit, something bad was happening. I remember my father coming back in from the kitchen and taking my hand. I blacked out once again</p><p>*I was rushed to the neighboring towns hospital. Moes parents did the same and we arrived around the same time. I was rushed in and had an IV stuck in me. Well, they tried to stick me anyways. After the fifth attempt, the floor was spotted with blood and I had something being pumped through my veins. I was being extremely violent. At one point I punched a doctor in the face and broke his glasses. This is when they decided it would be best for my and other peoples safety if I was restrained. I was tied to a bed and force fed charcoal. It was not an easy task but after about an hour they had it done. I was given a new IV with some other kind of medical bullshit in it to calm me down. With my face, chest and neck covered in black coal residue, I finally found sleep.*</p><p>I came to with people surrounding me. It was a new day and peculiar things were happening. My grandmother, who does NOT smoke, was holding a lit cigarette. I had my sister lean down to ask her if she was smoking. She responded with a simple no jackass, gramma doesnt smoke. I looked around the room to see where I was and why I was tied down. A white board on the opposite wall read Youre in the hospital, youre ok. It is (current date) and no one is going to hurt you. The nurse apparently did this because during my blackouts, I was violent, quixotic, and angry. I looked around the room for some familiar faces and I found them. My whole family was there. While restrained I was able to look under my blanket. I was naked and there was a tube coming out of my penis. I found this odd, because Id never been to a hospital and had no idea what a catheter was.'</p><p>'I looked up at my IV bag and it was an ear of corn. It started growing features and it soon became an ear of corn with a face. My father then asked what I was looking at and I turned to address him confidently. Cornhead I said with a very serious look. I looked around the room at all the odd things happening. A money clip with a ten dollar bill in it was laying next to a small fish on the ceiling. I thought this was amazing so I had to tell the nearest person. My sister again. She looked up like the dumbass she is and said there was nothing there. I asked my mother if the sexy bondage was really necessary. She laughed and untied my hands. My feat were still restrained.'</p><p>'All of the sudden the room fell away around me and I was back at Marks house. I had a ps2 controller in my hand playing socom. 5 minutes of playing had passed and the controller melted into a soft, cotton material and I kept on apologizing to Mark saying Im so sorry over and over again. I opened my eyes and I was back in the hospital. The controller was now a blanket, which I was clutching very tightly in my hands. I felt scared, vulnerable. I wept.</p><p>*Every one that was close to me came and bid their well wishes, chatted with me (or tried to chat with the nonsense coming out of my mouth), and promptly left.*</p><p>I came to and it was dusk. My sister approached me, gave me a hug, and took my shoes off of me. She had to lift the blanket a bit to get to them and I thought she was going to expose my naked body to the few people still in the hospital room. I said NO! Dont look under there! They took my clothes and stuffed me in a dark tube! She had her laugh, said she had to go, and did just that. It was dark now. I drifted in and out of consciousness for the better part of an hour. My aunt was at my bedside and all of the sudden, large centipedes and bugs started coming out of her ears. I was distraught, so I turned my attention to anything but her. The bugs had filled the room and were crawling all over everything. I screamed for help and my mother came to comfort me. She embraced me and told me to close my eyes. I cried. Hard. Then, I slept.'</p><p>'I woke up a bit later, no more than a half hour had passed. Then something caught my eye. A naked woman outside my window, dancing. She was beautiful. I remember telling myself, as soon as my moms asleep, Im going out there and fucking the shit out of her regardless of this catheter. I passed out before she did, and now I realize it was obviously a hallucination. I awoke the next day to more well wishers. Then there was Boxy. Boxy was a gnome about the size of my thumb. He had climbed down from the curtain around my bed and posted up on my shoulder. He reminded me of the Travelosity gnome. I was captivated. I had the most excited look on my face as he smiled at me. Then he winked and mouthed watch this. He then started to jump up and down on my shoulder. I was overjoyed and started chanting Jump, Boxy! Jump! to the enjoyment of my current audience.'</p><p>'I was out of it. I said things to my family that Im not proud of. I told my grandmother to eat a dick, I told my aunt she needed to get fucked HARD, and I called my other grandmother a whore. I then went out of it again. The walls melted away and I was in my room holding my guitar. I started playing and once again, it melted into a blanket. I was angry. I threw a fit. I kept repeating FUCK! FUCK! WHAT THE FUCK!?!?</p><p>*More well wishers, more cards, more bullshit*</p><p>I came to and it was night. I looked to the window and the woman was gone. In her place was a large man in a long trench coat and fedora. He looked at me and pulled out an old 50s Thompsan. He began firing through the window and I lost it. I hesterically started crying, again my mother was there to comfort me. I fell asleep in her embrace.'</p><p>'I awoke the next day. I felt normal again. No hallucinations. No mad psycho-babble. Just normality. The nurse came in, deflated the balloon in my catheter, and pulled it out (which hurt like a mother fucker). I was able to clothe myself, get up, walk to the bathroom, and take a shit. I looked in the mirror and I had black all over me. I looked like I passed out first at a party  and someone had found a Sharpie. I met Moe at the facilitys shower and he looked like hell. He then told me all the bad things that he saw. At one point, he awoke to his room full of dead bodies hanging on nooses from his ceiling. I felt bad for him. I felt bad for both of us.</p><p>We had taken Datura, or jimsonweed, without researching it first and we payed dearly for it. Id lost 3 days of my fall break and hours of my life that I have no recollection of. The reason I was in the hospital for so long is because my heart almost exploded because of how high my heart rate was. I hope that by writing this Ive helped inform you.</p>",
 "year": "2005",
 "id": "71660",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-03-13T08:00:00.000Z",
 "views": "13137",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Datura",
   "form": "(seeds)"
  }
 }
}
