{
 "id": 7166,
 "title": "Alternate Reality",
 "date": {
  "submission": "2008-07-14T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dawson",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "Last night I tried mushrooms for the first time. I had a lot of expectations, but I figured it wouldn't be like I expected, as was the case with every other drug I've taken. I was of course correct. The two friends I was with had both done it once before and both had only had mild visuals with moving textures and such. This trip was also not like what they had expected.",
  "We gather at Mike's place. His parents were pretty chill. They knew we smoked up there and didn't seem to care. We were never blatant about it. Mike was still a little worried that they'd freak about the mushrooms so he wanted to keep it quiet. I think this was the first step in the wrong direction for him. We were also supposed to have a trip-sitter come and keep an eye on us, but something came up and he couldn't make it. This was another major problem of the night.",
  "Cory and I showed up at Mike's place around 2 in the afternoon and we smoked half a blunt before heading out. We had some plans for the night so there were some things we wanted to pick up. We got some food and then picked up a black light at a nearby Spencer's. I think we also picked up some poster board and markers to draw while tripping. This whole trip of getting stuff is a little fuzzy in my memory. I'm not sure why since it was before we actually ate the mushrooms.",
  "When we got back at 5, we split up the shrooms and began eating. It wasn't as bad as I expected considering I despise regular mushrooms. I was told it would take 60-90 minutes to onset, but I was definitely feeling things 30 minutes later. We tried the drawing thing and actually drew some funny stuff. I recall 'I feel purrrrrrple' being written somewhere. Not long after this I had some major hallucinations and was way to incapacitated to draw anything. I just sat in my chair and watched light pour in through  the window and dance across the ceiling and walls.",
  "I'm not sure what the other guys were doing, because I sort of blanked out between 5:30 and 8. I think I remember not being able to comprehend time and space. Like I couldn't tell what time it was or what day. I couldn't tell if I was still in the room. I remember just seeing lots of colors and nothing else. At 8 I started looking around the room. I wasn't really freaking out, but I kept checking my watch and being dismayed at how time was not progressing. It seemed like it was 8:30 forever. I do believe that this is in part to the fact the the TV was on TBS and the same episode of Seinfeld was on 3 times in a row. Cory was babbling about reality and how we were in another reality and now we were coming back to this reality. I wasn't sure what he was talking about since I was swimming in color.",
  "At around 9 we all sort of snapped out of it. Not entirely, we were still tripping, but we seemed to get a grasp of reality better. We had difficulty making the journey out of his room to go to the bathroom since Mike's parents were out there, but I think it was fine. During my whole absence in time, Mike was bugging out about his parents and being worried that we'd get caught, but he seemed to snap out of it at 9 as well.",
  "We just chilled for a while to some music and tried enjoying the rest of the evening. We finished the blunt and smoked maybe 1 or 2 more bowls, I don't remember. Cory got real hyper and excited, so Mike and I tried calming him down. This made Mike worried and he began freaking out again. I tried calming him down, but since I was still tripping, there wasn't much I could do. This is why we really should've had a trip-sitter.",
  "We eventually passed out around 1, I think, and woke up the next morning around 10. We all felt as though someone had gone through and beaten the crap out of of us. We cleaned up and got some breakfast. After getting a shower and some food in my system I think we all felt a lot better. We're still not real sure why this shrooming was so much more intense in comparison to Cory and Mike's previous trip, but we're pretty glad nothing real terrible happened. It was scary, but we did learn a lot.",
  "I think if I ever shroom again, I am definitely making sure it's a very comfortable place with a trip-sitter is present."
 ],
 "erowid": {
  "id": "41306",
  "citation": " Dawson. \"Alternate Reality: experience with Mushrooms & Cannabis (ID 41306)\". Erowid.org. Jul 14, 2008. erowid.org/exp/41306",
  "substance": "Mushrooms & Cannabis",
  "views": "2904"
 }
}
