{
 "title": "So Happy, I Almost Cried",
 "author": "Dim-Lit",
 "citation": " Dim-Lit. \"So Happy, I Almost Cried: experience with Mushrooms (ID 71674)\". Erowid.org. Jul 9, 2010. erowid.org/exp/71674",
 "substance": "Mushrooms",
 "bodyweight": "145 lb",
 "report": "<p>To question reality is but human nature. I felt that I needed to question it in the most perverse way possible. I would induce myself into a state of intoxication through the chemical known as psilocybin, which is the main active chemical found in shrooms.</p><p>I awoke that Saturday morning happy and sober, which was quite stifling seeing as how I'm always stoned! This Saturday marked the first day of summer and the only thing on my mind was when the call would come. I showered, I ate, I watched T.V., just like any other day. I sat there staring at the screen, clenching onto my phone, and then it came. I received the call from my friend and the words that came out of his mouth were as follows, 'I've got the shrooms dude! We're going back to my house, so meet us up at the top of the hill.' No good byes were needed, I just said, 'For sure', and it was left at that.</p><p>Leaving my house, I wondered how great it would be, to just trip. It's the first day of summer, and it's already going so great! I took the turn off my street, and started up the hill. This treacherous hill, it looked as if it were never going to end. I continued on and on and I finally reached the top. Luck would have it, just as I reached the top, my buddy and some people were walking up the other side of the hill, to a three way intersection of doom. We said, 'What up', to each other and started our descent down the third side of the hill.</p><p>We reached his house, this big, quiet house. There were five of us total, three of which were about to shroom. We turned on the old idiot box and layed the shrooms upon the table, staring at the magical fungus. 'We need something to chase this down', I remember someone saying. 'Orange juice increases the trip', is what I believe I said to my friend who was peeking into his fridge. 'Sweet! We got some O.J.!', he yells to us in the living room. The perfect chaser and trip enhancer, orange juice!</p><p>You know when people say, 'I'm never gonna eat that! It looks so disgusting!'... Shrooms are so disgusting looking and yet people WANT to eat them. And the sight of watching people eat shrooms is just grand! Their faces squint as they try and chew up the nasty tasting caps and stems. I ate a few, one after the other, and then realized that I should just eat them all at once, to avoid the taste. So I grabbed them into one handful and chugged em down. I grabbed my o.j., waiting to swallow a bit of shrooms before taking a sip. The Exorcist was on and everyone sort of looked at each other and thought about if they really wanted to trip and watch such a messed up movie... so someone changed it to some gay movie called, Ice Princess.</p><p>Fourty-five minutes passed, and I realized that I had stopped thinking about how gay the movie was. I realized that I had overall stopped my thinking process, or moreso, it had halted. As I realized that my thoughts had halted, I noticed something in the T.V. that sort of creeped me out. The pixels... the pixels are growing! 'Holy shit', I think to myself. They lined up in rows of yellow, red, and blue. There was no more picture on that screen, for me at least. It was just a few rows of red, yellow, and blue. I smiled and looked about the room, awaiting a response from the other two.</p><p>After this mild hallucination, I noticed that one of the people had left and in his place, another stood! It was perplexing at first, and then I remembered that he had said something about having to leave for baseball, and then I remembered someone stating that this other person was gonna come over. A few more minutes went by, and soon, we were all about the house. Walking in and out of the house; following each other with the greatest curiosity. Me and my original shroom buddy walked into his back yard and got onto this weird terrace place with stairs that went to a little dirt path. The dirt path had stones in it, like a little walkway. We walked around up on that terrace, laughing our asses off, 'Dude! I'm tripping so good!', I remember one of us saying.</p><p>'Hell ya man! Shrooms are THE best drug ever.', another said. I looked around and felt the shrooms take over... I felt this pressure on the upper part of my neck, right in the back of my head. It hurt and felt good all the same time; or maybe it didn't hurt, maybe it was just a different feeling than I'm used to. Whatever it was, it kicked in even harder. We laughed and laughed and turned back to head to the patio area below. As I turned, I noticed a lizard, and a giant lizard at that! It looked ready to pounce on me and devour my flesh. Then I came to a realization that the lizard was porcelin! 'No wonder it had a sun and clouds painted on its back', I thought to myself.</p><p>As we walked back to the stairs, I leaped from stone to stone, down the path. I pretended that I was leaping over lava and landing on rocks, saving myself. When I reached the stairs, I jumped and my pants fell clear down! 'Damn, I forgot my belt', I laughed to myself. I pulled them back up and laughed a little more. I took a seat and started staring; I stared at this odd looking tree in the distance and then resumed consciousness of what was going on around me. All at once, the four of them came out of the house and giggled about, and sat down in some chairs around me.</p><p>'Dude! What are you staring at?', one of them asked me, with a rather curious tone. They all start to giggle and look around. I kept staring and answered quietly, 'The trees, the nature, the colors... I dunno... I'm just trying to trip and enjoy myself.' Everyone calms themselves, and they all start to stare around them. All of a sudden the laughing erupts yet again! I can't help but join in on the laughter. We were cut short of pissing our pants of laughter, when we heard the front door open. Four people walked in; his mother, his father, and their friends.</p><p>'Not chill!', whispers one of the shroomers. We all stare and I decide that staying here would be WAY stupid. So I get up out of that chair, look around at everyone and say, 'Peace out guys, I think I'm gonna hike up through the hills.'</p><p>Walking along the side of his house, I started stumbling and almost fell over a few times. 'Where's he going?', I heard someone exclaim. I reached the side gate and turned out onto the street, and life never seemed so good. I was caught in a flurry of happiness, unexplainable happiness. Looking around at the trees and bushes, they seemed so much more alive. The world was there, and I was ready to explore it!</p><p>I was walking up this unbelieveably steep hill, and I remembered having to walk up it back in the day. After middle school, I would walk all the way down Monterey and then have to walk up this gargantuous hill. Today, I didn't feel like it was that gargantuaous... as a matter of fact, I quite enjoyed this walk. I reached the peak of the hill where I had met up with the shroomers, and walked on to a side street that lead to some marvelous views. These hills, these trees; people... It's beyond explanation how I felt and what I saw. Everything was just so beautiful and I was so happy!</p><p>My happiness reached its peak as I made it to the first view. I looked off to the distant hills, with all the bushes and trees on them. They were swaying about like... imagine if you had a bucket of water and poured some paint into it, the paint would float around within the water and just sort of swirl. The trees and bushes did the exact same thing. Their colors swirled around and just looked so amazing! I must have sat there for an hour or so, under the hot sun, happier than I had ever been in my life... and then it happened...</p><p>People talk about 'bad trips', and how they can happen at any moment. Some people believe that someone is trying to kill them, and others just feel trapped. Hearing these stories really made me scared to take shrooms. I got to a point of such happiness, that I was sad at the fact that it would all be gone soon. All of a sudden, I sat there under the sun staring off at the view, and I almost started to cry. 'It's gonna be over soon, and I can't do anything about it,' I thought. Imagine it, being happier than you have ever been, and knowing that it's just a matter of time before the happiness is gone. This thought disrupted everything, I stared at the view, but no satisfaction came from it.</p><p>I get up in a last effort to save myself from a bad trip, and I think, 'Just move along, the longer I sit here thinking about this bullshit, the worse I'm gonna feel'. So I got up and started to head out. I took no more than ten steps before catching sight of a hilarious spectacle. There was an old man on an old-school exercise bike, a half-naked old man on an exercise bike! I passed him, staring with great intensity at this funny situation. He glared back at me, arms crossed, peddling away in his tighty-whities and robe. I let out a little laugh, and a sigh of disgust... but the fear, the pain that I had felt before was gone.</p><p>The hills, oh the hills... this was my favorite place to just walk through and think. These endless views to the south and north, east and west! All I could think about was how much more there was out there, in each direction, town after town... city after city... state after state... all the people, the life, the movement of this ongoing civilization. Through it all lies nature, in her mystical, everlasting beauty. Even in this age of pollution and smog, she can sprout new life and inhabit the Earth. Pardon my French, but Mother Nature is one tough bitch!</p><p>All I had to do on this day, was walk, walk and walk... and walk some more. I made sure that no matter how good I was feeling, that I would stay to the side of the road. I didn't want to end up on the news, ruining it for everyone else.</p><p>*imagined* 'Breaking story! A kid on shrooms felt so good, he decided to challenge a car to a game of chicken... and lost... full details at 11'.</p><p>I could only imagine it... the bullshit they would say to make it seem as if shrooms were bad. Well, I didn't let that thought stop me either, I just headed on down the road. At some point I noticed a dad and his two sons passing a ball around, enjoying their first day of summer. I'm guessing they noticed something amiss as I passed, because the dad told his kids to walk back onto the driveway and he sort of stared me down. It pissed me off sort of. I mean, to think a guy like me: a poofy haired blond kid, with an enormous grin on my face, to be dangerous? I'm sure most people would think a box full of newborn, baby kittens to be more dangerous than me!</p><p>I lost thought of it as I continued on my journey of greater self awareness. I reached the next view that I had planned to go to, and it seemed to be exactly like the first time I had seen it on shrooms. You see, on my first shroom trip, I had ended it here at this ill lit side of the hill. I pledged that day, that I would continue to visit this glorious destination, of sheer brilliance. Now I was back, on shrooms once again, and it was great. The view was of a hill, that was in front of another hill, which was in front of another, and these hills just rolled back. one after the other, they were like an ocean of green, rolling on to the horizon. There was no vibrance to these colors here though, because the sun was set at a position too far to the east. Never the less, this view was still amazing.</p><p>I ended up making a big circle through the hills, ending up at the middle of the hill that I had walked up to meet my friends originally. As I walked up, I realized the thirst that had built up over the past few hours. My mouth felt like sandpaper; all I could think about was water. I happened to glance to the side of the road and to my amazement, there sat something that just blew my mind away. It was a water bottle! I bent over to pick it up and as luck would have it, it had been unopened! AND! It was sitting in some shade! 'What a coincidence' , I thought... no way, it couldn't have been coincidence. This water bottle appeared, because I wanted it to. I had THE power! Next I found myself wanting a hot chick with big titties and no diseases to pop up and give me a nice time... at that point I realized that the water bottle must have just been a coincidence.</p><p>I reached the peak of the hill, yet again, and had nothing to do and nowhere to go. I sat up against a wall, right next to where there is a 3-way intersection. Nothing funnier than staring at 3-way traffic, especially on the top of a hill with rather narrow streets. As people drove up to the stop sign ahead of me, they stared at me like mad! I almost caused two or three accidents in those couple of hours. I finally got bored of sitting there, possibly about to cause an accident, so I left. I knew of a party that was going to be going on later...</p><p>Me and my original shrooming buddy planned it out like this: trip the day away and end the night off at the party. It then occured to me that I had NO idea where he was, so I called him up. He told me he was at the Library, waiting for one of the other trippers to get picked up. I told him to start walking, and I'd walk towards him and we should run into each other. 'Alright', he confirmed. So I got up and started walking. I planned everything out while taking a shortcut that I knew. My train of thought crashed ubruptly as I gazed out upon another magnificent view. Beauty in the form of nature; wonderous sights, sounds, and smells everywhere I looked.</p><p>'Get it together!', I tell myself. I continued on my most excellent journey and tried to piece together the tracks from my earlier train of thought. I awaited the crossing signal to show the little guy 'walking', and started across. As I made my way to the other side, it felt as if the whole worlds eyes were glued on me. 'They know!', I think to myself... I started getting worried. I reached the other side and my anxiety vanished and a thought befell on me, 'We see so many cars pass us each day, and you never really get to see the driver. I wonder how many times in our lifetime we will run into each person that passes by us?' Perplexing, I know...</p><p>As I walked towards the Library, I decided to call up my buddy and see where he was. 'Eh, where are ya dude?', I ask him. 'On Monterey', he answered. 'Which side of Monterey fool?', I retorted. 'On the... right... side...?', he answered in a questioning tone. 'Your right can be my left dude! What intersection are you...', I stopped mid sentence as I spotted a guy on his phone, walking towards me on the other side of the street. 'Wait, I see you!', I scream into the phone. 'I see you too,' he screams back, 'wait... why are you walking away from me?', he adds.</p><p>I look behind me, utterly dumbfounded by what he said. I look back across the street. 'What the fuck are you talking about dude? I'm walking towards you, on the other side of the street!', I tell him. I was about to start waving, until I saw someone walking towards me on the same side of the sidewalk. It was HIM, and he was looking off to his left across the street, at the same guy I had mistaken him for. 'Dude... look in front of you', I tell him. He turns his head and spots me walking right towards him and laughs as he realizes what just happened.</p><p>'Oh man! You have NO idea how bomb my trip was!', I exclaim as I approached him. 'Mine too dude!', and he starts telling me the story, 'after you left my house, we went to snake trail, and the other two fools started tripping out bad. One of them remembered that they had to go to a dinner thing and the other one had to go home soon. So we got outta there and started walking down some street, and there was one drive-way that was all high, and the drop off of it landed in the next drive-way.' I started visualizing the scene in my head. He continued, 'I ran and jumped off the higher one and then as I was coming down, I perceived myself falling back to the ground, from the ground's perspective!' And that was as much of his story as I remembered.</p><p>I went on to tell him what I had done since leaving his house earlier that day. We proceeded on to go to the 'party house', and saw a mass of cops drive by us on the way. We freaked out a bit, since we were still trippin' a bit, but kept our cool as best we could. We saw some skater guys that didn't look too familiar walk our way. As we got closer, I SWEAR ON EVERYTHING I OWN! One of the skaters looked EXACTLY like one of the cavemen guys from the Geiko commercials... You know, 'So easy, a caveman can do it.' After we passed them by a considerable distance, my buddy leans over and whispers to me, 'Dude... am I just trippin'... or did I just see a monkey?!' I couldn't resist but laugh at that remark. 'I dunno man... I saw it too, but then again... we are on shrooms,' I responded, still laughing a bit.</p><p>We turned onto another road and continued on our journey. I spotted a trail off to the side that I had never been ... I asked him if he knew where it went, but he had no idea, so we just took it. That day we discovered, for the first time, a jogging trail. It led under the freeway and ended up right at the soccer fields where I used to play soccer.</p><p>As we stepped onto the field, I had a sudden feeling of deja vu. 'This right here; this place, these people, this smell, this vibe... it seems so much like a dream I've had before,' I tell him. 'Dude... trippy,' he responds. As we reached the end of the soccer field, passed the play ground, and neared the baseball fields, he received a call from his mom. I took that opportunity to take a nice long drink from a nearby water fountain. I sighed and thought to myself, 'How refreshing!' After he finished the conversation with his mom, we continued on with our last hundred yards or so of walking.</p><p>This guy's house was a little farm place. It was painted a worn out reddish color. As we approached, we noticed a little old hispanic lady, sweeping up the back porch. She yells something in Spanish, and out comes the fool we came to see. 'A bunch of people cancelled man!', he exclaims, all disappointed. We looked at him, somewhat unresponsive, and then finally said, 'That sucks dude.'</p><p>'Well, whatever... The pizza and brew are on the way. So what do you fools wanna do till then?', he asks. Instinctively I ask, 'Do you have a cig man?'</p><p>'Ya', he replies. We go to the far back of the property, so as not to be in the old lady's view. I spark up my cig and sigh. 'Ah, nothing better on a comedown than a nice, warm cig', I think to myself. After we finished, we sat there for a few more minutes talking about the 'party', and then we got up and went back to the house. He turns on his X-Box and hands us each a controller, then asks, 'Do you guys want anything to drink?' 'For sure', we both answered. We sat and played the video game, and all of a sudden, I got the distinct feeling that someone was sneaking up on me. I peak behind me and see him tip-toeing up. He gives me the 'Shhh' signal with his left index finger, and in the right hand, he was holding a bright orange snake! He puts it on my tripper buddie's shoulder, expecting him to freak out. What happened was quite the opposite! Instead of freaking out he just said, 'Whoa... a snake. CHILL!'</p><p>The snake slithered about, and we were all fixated upon the mystical orange serpant. We hung out there for a little while longer until the host got a call from the dudes who were bringing over the brew. They were outside, so we went out, got the brew and they said they had to leave right away. We didn't question it, and the host took the brews over to this small little play house. I suppose it was his little sisters, seeing as how it was very girly and had a bunch of miniature horses in it and what not. Next arrived the pizza. We had ourselves a feast, with a couple of Coronas to wash it all down. A few more people came over to the 'party', but it was truly lame. So a couple of us decided to go off and find another shindig.</p><p>We got word that there was a party going on at this one guy's house, but we weren't allowed over because it was his cousin's 21st birthday.. or some shit like that. At that point, me and the original shroom buddy decided to head off home, since we lived in the same general direction anyway. It must've been around 8PM or so by now, the sun had just gone down and a question popped into my head. '</p><p>'Would you prefer to trip in the day? Or at night?', I asked him. 'Shrooming at night is really chill.' He continued, 'It's really an adventure and you usually have a crazier trip. Like... you actually hallucinate and see shit pop up out of the shadows and shit.'</p><p>'That's what I mean.  It seems scarier, colder, lonlier, as opposed to the day when you get to see all the bomb views and colors', I retorted. We were consumed by silence as we walked. My high was, for the most part, gone.. although I still had a heightened sense of things around me. I thought about my question and answer that I had given about tripping. Then we reached his house, and I said, 'Peace out dude, and thanks for the trip!'</p><p>'For sure dude. Peace', he answers back. I kept hiking up that hill... that same hill I had walked down and up after his parents got home earlier. As I reached one of the cool hills with a nice view, I tried to visualize those colors again, but it was no use in the darkness of this tree lined hill.</p><p>The moon was... MAGNIFICENT! So much so, that I had to stop at the peak of the hill to look up at it. I started down the hill I climbed earlier that day, to meet up with my friend, before we took the shrooms. As I walked down, I looked at the curb that I had found the water at earlier on, and then turned my attention to the last great view. A sea of lights, extending as far as the eye could see. Milllions of little bulbs, flashing that faint, orange glow. I kept on walking, and realized that it must've been pretty late, and it amazed me that I hadn't received a call from my dad all day... Out of nowhere, a loud noise erupts... it was my ringtone. Sure enough, it was my dad.</p><p>'Where are you?', he asks me, rather calmly. 'On my way. I should be home in a few minutes', I responded coolly. I reach the corner where the hill street hits my street, and I look back. 'Today was a good day', I think to myself. I take a right onto my street, walking up that little hill. I make it to the drive-way and start to walk to the stairs to my house, when I hear a door slam. I look and my dad is at the back of his van, putting away some tools for work the next day.</p><p>'Hey dad!', I exclaim. He looks around puzzled, then finds me in the darkness. 'Oh, hello Dominic', he says back. I go into the house, walk down the hall to my room, close the door behind me and sit down... All I could think about at that point was, how to express my day to everyone.</p>",
 "year": "2007",
 "id": "71674",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-07-09T07:00:00.000Z",
 "views": "2006",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
