{
 "title": "One of the Best Days of My LIfe",
 "author": "junctionalfunkie",
 "citation": " junctionalfunkie. \"One of the Best Days of My LIfe: experience with LSD (ID 71689)\". Erowid.org. Aug 1, 2013. erowid.org/exp/71689",
 "substance": "LSD",
 "bodyweight": "170 lb",
 "report": "<p>I've taken LSD hundreds of times but the one experience that stands out and that I will cherish for the rest of my life was one of the last times, about eight years ago. I went with my father for a weekend trip to a small village in western England (I'm American) called Ludlow, where there are three restaurants that have received Michelin star ratings and are considered among the best in Britain. My dad is a diehard foodie and invited me along to hit this culinary mecca out in the middle of nowhere.</p><p>It was a seven hour drive from London through tiny towns that didn't appear on maps and where the locals' accents were so thick they hardly sounded like English at all. We finally arrived and found our hotel -- a great little place that had been an inn since the 1600's. We settled in and discovered that they were filming a movie in the street right in front of the hotel, and Rupert Everett and Kathy Bates, who were both in the film, were staying there! (The film is called Unconditional Love. It's okay.) We went to dinner at the first restaurant, then turned in around midnight, exhausted from jet lag, a day of driving, and some really good wine.</p><p>I awoke before dawn, my sleep pattern a mess, and went out to explore the village. I found a little shop open where I bought some rolling papers and a 'Walker's Guide to Ludlow.' It was March and a bit chilly but as I sat in the courtyard of the inn drinking coffee and looking over my new book the sun began to rise on what promised to be a beautiful day. I had brought along some weed and three hits of strong liquid, dropped onto a business card tucked away in my wallet. I rolled a few joints and wrote a note to my still-sleeping father saying I'd be back by mid-afternoon.</p><p>Ludlow is surrounded by hills with a couple that are quite high. I started strolling through the town, seeing shops opening, schoolchildren walking, housewives chatting, and farmers feeding their sheep. It was such an incredibly quaint place; you could tell that life in Ludlow hadn't changed much in centuries. I began to feel really good (still completely sober), smiling and saying 'good morning' to everyone I passed, glad to be on vacation, up early on a gorgeous day, and simply being alive! Consulting the map in my new book, I selected a route that led out of town and toward the tallest of the surrounding hills. At the edge of Ludlow, I stopped at another store and bought two large bottles of water and munched my business card.</p><p>As the sun rose in the sky, I rose on the hill. I had my Discman blasting the Smashing Pumpkins' 'Machina' disc, which had just come out, and it fit my mood perfectly. I still think of that day when I hear any song on that album.</p><p>Anyway, as the acid took hold, I was hiking along a trail that zig-zagged up the hill. The sun beat down gloriously and the wind raged all around me, making the hillside a swaying mosaic of tall grass and trees. I began to think about my life and my plans for the future. I had been through a rough couple of years and had kicked a heavy cocaine and heroin habit just a couple of months before. As I walked, I became overwhelmed with confidence that I could stay clean and continue to improve my life and my mind raced with plans of the possibilities my future held. I thought of the various relationships in my life -- family, friends, co-workers, and began to realize how much I loved everyone, and, more importantly, how much I loved myself.</p><p>The hill was very high and steep in places. At times the strenuous climb left me pleasantly out of breath and I stopped often to smoke weed and look down on the village spread out on the valley floor below me. Never before had I felt so exhilarated, happy and alive. More than once I was reduced to tears, absolutely blown away by the beauty of the world. The acid was magnificent and enhanced perfectly the rollicking riot of color and beauty surrounding me. At one point I heard a deafening roar coming from the sky. I looked up just in time to see a fighter jet zoom right over me. Later, I learned that there was a US Army base nearby.</p><p>About halfway up the hill, I passed an elderly couple walking in the opposite direction. They were holding hands and they seemed so happy, I very nearly started crying again as we exchanged pleasantries and observations of the day's loveliness. They seemed quite unfazed at the appearance of a weepy and wild-eyed young American on the hillside they apparently had lived on for many years. There were tiny clusters of houses here and there on that hill and I wished I could live there too. I wondered how anyone could live in such a beautiful place; it was too much to imagine.</p><p>It took me four hours to reach the summit. At the hill's peak, I had already passed the peak of my trip and had entered the phase of heavy visual distortion. As I stood atop the hill, I looked down on the other side and saw another village lying in the floor of another valley, like jewels glistening in the relentless sun. Then, I noticed that that side of the hill was covered with a purplish stuff that I couldn't quite identify. The acid made it hard for me to focus on the stuff, so I went down a bit to get close enough to see it better. It turned out to be a seemingly-endless slope of wild rosebushes: tangled thatches of thorns and vines topped with brilliant purple roses, as far as the eye could see!</p><p>I turned around and headed back to Ludlow, dirty, deleriously exhilarated and joyfully exhausted. Gravity sped my return journey and I was back in town in less that two hours. I walked through the streets of the tiny village as people were bustling through the shops and everything buzzed with energy. I found a pub and sat outside with a pint of Bass, reflecting on the incredible experience I'd just had.</p><p>I realized then that I had just experienced a turning point in my life and that in some small way, that day had changed me forever. The sun had given way to clouds, and large drops of rain began to fall as I made my way back to the inn and a hot bath, before meeting my father for another magnificent meal at a world-class, yet humble, restaurant called Mr. Underwood's.</p><p>Mr. Underwood was a 19-year old, enormous cat that belonged to the proprietors and he sat at my feet as we ate dinner, the only diners in the place.</p><p>That was one of the best days of my life.</p>",
 "year": "2000",
 "id": "71689",
 "gender": "Male",
 "timestamp": "2013-08-01T07:00:00.000Z",
 "views": "850",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
