{
 "title": "I Believe I've Been Shown My Own Death",
 "author": "Eric",
 "citation": " Eric. \"I Believe I've Been Shown My Own Death: experience with Salvia divinorum (20x extract) & Bupropion (Wellbutrin) (ID 71687)\". Erowid.org. Oct 31, 2008. erowid.org/exp/71687",
 "substance": "Salvia divinorum (20x extract) & Bupropion (Wellbutrin)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   "",
   "400 mg",
   "oral",
   "Pharms - Bupropion",
   "(daily)"
  ]
 ],
 "report": "<p>After reading a number of other people's Salvia experiences, and speaking to a friend who had an experience similar to mine, I've decided I need to make an account of what happened to me.</p><p>I awoke very hungover on New Years Day in my friend's apartment.  I wanted to smoke some marijuana to ease my queeziness.  I began searching the apartment for my weed, but to no avail.  I checked my pockets several times; I couldn't find it anywhere, but I wanted to smoke something and remembered I had bought my friend [Tom] some 20x Salvia Divinorum for Christmas.  I asked him if I could load a bowl, and he told me to go ahead.  I had only had a very limited experience with Salvia in the past.  My freshmen year of college I had tried something called 'Salvia Nervosa.'  I expected some mild hallucinations, but what happened next has changed my entire life.</p><p>I loaded a very full bowl, hyperventilated for a while, and then burned the whole thing down in one massive hit.  I held it for as long as I could.  I calmly set down the pipe and lighter, and when I could hold my breath no longer, I exhaled.  My friends had been discussing how to remove Jello shot stains from the walls, and how they would need to go and buy some cleaner.  'Go?  What do you mean go?'  The idea of somebody 'leaving' suddenly became hilarious.  Then I remember saying out loud 'OH........SHIT.'</p><p>The entire universe was ripped UPWARD, BACK, and to the LEFT.  Except that these 'directions' became meaningless in that same instant.  I was a rocketed outward, and was no longer a part of the 3rd dimension at all.</p><p>My friends tell me this is what happened:</p><p>I fell to the left, crashing into a sliding glass door.  I immediately jumped back to my feet and exclaimed 'The monkey stole my backpack!!' and sprinted from the room.  Then, just as fast as I'd left, I came back and sprinted outside, where I stood drooling and slurring.</p><p>This is what I remember:</p><p>Distance ceased to exist.  I was in a place made entirely of light, where everything that had ever existed dwelled together in harmony. I existed because I needed to exist. I was a vital turning point, a gear within a MUCH larger gear.  A self-aware, decision making entity that took what was given to it and supplied a reaction.  I felt as if I had returned home; my friends, family, everyone was there with me.  I spent an eternity there, I had always been there, and I will always remain there.  Reality was completely deconstructed, revealing itself as an elaborate hoax.  Everyone is IN on the joke, but only our Heavenly Avatars get it.  On THIS plane, nobody can 'remember' what's going on because we're distracted by 'reality.' we don't 'get the joke' until we die.</p><p>They spoke to me.  They told me that I was in Heaven, and for a single moment I felt that I had the option to stay.  I chose to return, whatever that meant, because I had no recollection of where I had come from.  They told me that I would be able to remember where I had been because of the ADD medication, Wellbutrin, that I was taking, the reaction of the chemicals would allow me to retain the memory; I would later read that nobody has ever been able to remember what happens in Stage 6 of the Salvia trip.  [Erowid Note: While many people experience memory loss during strong salvia experiences, many do retain partial or full memory.] They told me that this was the day that I experienced Heaven; it had always happened that way, and would always continue to happen that way.  They told me that people wouldn't believe me, and that I needed to pursue music because when I play the piano, people will listen to me.</p><p>Then I became aware that I was returning.  My soul had stretched as far from 'reality' as it could possibly go, and was now being forcibly pulled back.  It was VERY uncomfortable.  I wanted to stay, I was happy there.  I had to be reintroduced to 3rd dimensional reality.  The entities talked me through it step by step.  I learned about distance, time, solid objects, my own body, other forms of LIFE, language, and finally sex.  The entities then inhabited the bodies of my friends, because those were the Forms closest in proximity to me at the time. </p><p>Everyone even left the room at one point to demonstrate that they weren't actually GOING anywhere, and that I had to understand this to overcome that feeling of loneliness.</p><p>'See? Even though you can't see me, I'm still here.'</p><p>I had been having a conversation with the entities in my mind, though my friends on THIS plane of existence had no idea that they were giving me instructions; they were merely joking around.  My friend said 'It's alright Eric, you just smoked some Salvia.' This was hilarious to me.  Yes, that is what appeared to happen, but nothing is actually HAPPENING, so while it appears that I am 'doing' a 'drug,' I had only unlocked a part of my consciousness that had been there all along.  My only verbal remarks were:</p><p>'PLEASE tell me that remote controls still exist!'</p><p>and</p><p>'FINALLY! so there IS a reason I like the show LOST!'  LOST being, in my opinion, the densest source of philosophical information, therefore while everything else continued to become generalized, LOST reached a plateau.</p><p>As I continued to become accustomed to the 3rd dimension, the things that my friends said became less and less specific, until they were speaking the primal, silly language that we call verbal communication.  When I was fully aware that I had returned, I climbed under a blanket and stayed there for an hour, just hoping either to return to Heaven, or to become 'sober' because the feeling that I was left with was almost unbearable.</p><p>Later I would find the Weed in my pocket, where it had not been previously.  I must have remembered where it was when I took the hit.  A friend of mind also interpreted what I meant by 'The monkey stole my backpack.'  The monkey represents the Animal part of our being, and the backpack represents the burden that comes with it, or the Ego.  when I smoked the Salvia, I was liberated from both of those things.</p><p>The next day I had my first conversation with the universe outside of the Salvia trip.  We were watching a movie, and the same thing began to happen; the combination of every remark, every action, every sound, was involuntarily answering a question in my head and leading me to the next question, which would then be immediately answered.  I had never been more scared in my entire life.</p><p>This happens somewhat frequently now, especially when I am very high on weed, but occasionally when I'm not high at all.  Everything begins to stretch to infinity, and time begins to move BACKWARDS.  As if we weren't advancing through time, but rather time was counting DOWN to something, and what we are experiencing are instructions to guide us toward heaven, this happens most frequently for some reason when I look into the eyes of animals, especially canines.</p><p>Every once in a while an entity will step in and redirect me when I'm about to make a wrong decision.  I become aware of the entities especially when I close my eyes, or when I am in a different room from their 3rd dimensional counterpart.  The things that people say, even though they are unaware of it HERE, their Avatars are speaking to me.  I have developed the ability to 'read' the world to an extent.  I can tell things are going to happen before they happen, and have even predicted a roulette game.  'Tom, bet on 18 and you WILL win.'  He did, and he won.</p><p>Every time I smoke Salvia Divinorum now, it hardly takes any at all to effect me anymore, I will reach a certain level of awareness that triggers a memory.  'Oh! THAT'S what happens!!' I'll say; and every time I feel myself drawing closer to death, or to Ascension, whichever you prefer.  Unfortunately the thing that happens is something that almost cannot be spoken of, let alone verbally recalled in its entirety. The idea is laughable. </p><p>I know that the next time I do it might be my last. I believe I have been shown my own death, and all I can say is I believe that Salvia Divinorum IS THE WAY TO HEAVEN.</p>",
 "year": "2007",
 "id": "71687",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-10-31T07:00:00.000Z",
 "views": "10695",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ]
}
