{
 "id": 7170,
 "title": "Like LSD Without the Side Effects",
 "date": {
  "submission": "2008-07-14T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Mod",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "284 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "This is a recount of what I did to trip off of Morning Glories, but first I must give you a little background about myself.  I have taken several hundred doses of LSD in my younger years (just to note: I am 29 years old now) including the fabled LSD-25.  I have also taken several hundred pills of Ecstasy, as well as been high from marijuana several thousands of times.  Now that you know about my previous drug experiences, let me tell you now about the night I ate seeds of the morning glory.",
  "This all started yesterday afternoon (03.10.05) when I looked online because I was curious of the morning glories.  I read in the past a little about them and knew they contained LSA.  So, around 1:45 pm I went to a local garden center and only found a few packets of Heavenly Blues.  Then I decided to head to another garden center where I found many packets of the amazing seeds.  I went a little crazy and bought 25 packets each containing around 75 seeds for about $28.  I went to the store and picked up an electric coffee grinder for about $15, some Dramamine, a metal strainer, some green Palmolive dishwashing soap, some dishwashing cloths, and a big jug of apple juice.  These were going to be my supplies and the tools I would soon use to take my first dose of LSA.",
  "When I got home I cracked open 4 packets and they totaled 284, not quite 75 per packet, but no biggie - I chose that number because I wanted a strong trip.  I washed the seeds in the strainer with the soap, dried them slightly, then ground them up, put the powder on a piece of paper, and put it into the refrigerator.  That night I went to play Poker with some friends, losing quite early without buying back in.  I said goodbye to my friends and went home to continue the extraction.  Now, I must tell you that I read several articles on how to trip from the seeds; so I felt I was thoroughly prepared.  Taking the powder out of the refrigerator would have been about 10 hours later.  I don't know if this is really necessary to chill the seeds, but I couldn't trip at 3 pm when I finished grounding the seeds since I needed to be my best at cards that night.  Now it would have been around 1:30 am.",
  "After eating the powder and taking a Dramamine to counteract nausea I started playing a game on the computer and about 30 minutes later I started feeling a tingling in my stomach.  About 15 minutes later things started to melt.  About an hour later, I was having a full blown trip.  It was to me EXACTLY like LSD in every aspect except much cleaner.  I looked outside and the trees looked like they were moving around in a way that the wind could not do.  Colors were brighter and much more profound and everything looked extremely beautiful.",
  "Also I should mention, I learned a long time ago how to not have a bad trip after experience a few I didn't like.  Here's the secret I use:  If things start getting dirty, ugly, or my mind starts telling me that I'm gonna die or something; I just say to myself 'Everything is beautiful, I feel good, I am having a great time.'  I repeat that until the color and brillance comes back.",
  "I closed my eyes and listened to some good electronic music, Ambient or Chill-out in particular.  Stuff like Orbital, Future Sound of London (there better stuff), or Loop Guru, on my mp3 player.  I was seeing geometric patterns and swirly colors in my head.  I did this for probably 3 hours.  Then I looked outside and watched my neighbor's decorative windmill spin around in the wind.  I swear, I was making it spin with my thoughts.  I could even make it stop, speed up into a blur, or make it spin backwards - with my mind.  I don't know if this really happened or if I hallucinated it.  Anyways, I fell asleep around 9 am and woke up around noon still slightly feeling the effects.",
  "I would like to say that I loved the experience.  My body had no aches or pains of any kind, and I hallucinated quite heavily.  Again, I will say it was exactly like taking good acid without the nasty chemical taste or side-effects.  Also, I think I know why they are called morning glories; although this is just a guess.  That morning I felt glorified, not in a God way but inside, in a way that made me feel good; that made me realize just how much a part of the universe I am and everyone is that everything is energy and we are all connected."
 ],
 "erowid": {
  "id": "41315",
  "citation": " Mod. \"Like LSD Without the Side Effects: experience with Morning Glory (Heavenly Blues) (ID 41315)\". Erowid.org. Jul 14, 2008. erowid.org/exp/41315",
  "substance": "Morning Glory (Heavenly Blues)",
  "views": "4419"
 }
}
