{
 "id": 7171,
 "title": "Mild But Effective",
 "date": {
  "submission": "2009-10-28T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kay",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 tablets",
   "administration": "oral",
   "substance": "Valerian",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I found some valerian tablets in a nature shop some day last week and bought some just because I found it interesting. I have previously heard that valerian used to be used in folk medicine etc. and bought some impulsively.",
  "I usually sleep relatively bad, so yesterday I wanted to test some of these just before going to bed earlier than normal. I would normally have no chance to fall asleep as early as I wanted to go then, because I have a (partially?) reversed sleep rythm. I fall asleep very late and have to wake up very early to go to school. Well, I actually didn't expect these 'medicine' to have a very substantial effect so I took 15 tablets. The package says that not more than five should be ingested under the course of one day. It also says that each tablet contains 200mg of '6:1 valerian root extract'. I don't know what this means. The tablets have a special odour, almost with a hint of feet (!!!). I actually chewed the tablets which didn't taste too bad. They had a relatively fair 'herb' taste. I had only had an easy evening meal before taking the tablets consisting of cereals with milk.",
  "The first effects came after some 40 minutes. I noticed that my pupils dilated and since the mirror is situated just under the lamp in the bathroom, I could see that they were not normal since they changed size constantly but irregularily.",
  "After about one hour and 20 mins I felt the effects stronger, it felt almost like having taken a few shots of alcohol. The head felt a little heavier than before and I felt a lot more sleepy than I use to be this 'early'. I'm not sure if I possibly had been able to legally drive a car at that time since I didn't feel too alert.",
  "I actually expected these tablets to have far stronger effects than this, but they actually didn't seem to do more. After one half hour I think I felt the effects to cease, but I don't know if this was because I actually was pretty sleepy, or if they just work for so short a time.",
  "Something interesting about these tablets was that I actually dreamed that night. I usually dream very seldom, or at least don't remember anything next morning. Also, I tend to have very 'incoherent' dreams. I don't think this is unnormal, but this night I dreamed very coherently and in greater detail than I usually do.",
  "Next morning I awaked as sleepy as I always do, but probably better than most days this week. I could not feel any hangover, or residual effects.",
  "All in all my conclusion is that these tablets actually aren't that strong as I have heard that for instance benzos are. I can, on the other side not neglect the fact that they do work, and they do contain some hypnotic (sleep-inducing) substances."
 ],
 "erowid": {
  "id": "41316",
  "citation": " Kay. \"Mild But Effective: experience with Valerian (ID 41316)\". Erowid.org. Oct 28, 2009. erowid.org/exp/41316",
  "substance": "Valerian",
  "views": "15070"
 }
}
