{
 "id": 7174,
 "title": "Withdrawal is Horrendous",
 "date": {
  "submission": "2005-03-11T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "UK Patient",
  "gender": "Female",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "10",
    "quantity": "10"
   },
   "administration": "oral",
   "substance": "Kratom"
  }
 ],
 "report": [
  "I initially began use, and provided a glowing recommendation of Kratom as a tool to ease the pain of RX opiate withdrawal. The down side is that it makes me feel great (for a while). As doses begin to edge up, and believe me they do, I teeter about feeling a wee bit strung out. Another issue I noticed is that it can easily increase my physical energy enough that I can run myself readily into the ground. But it is just a plant, not even a 'real' opiate so big deal, I should just be able to stop.",
  "Not even close.",
  "I've 'withdrawn' from opiates before. The first few days are almost identical to serious hydrocodone withdrawal. But it is days 4-14 that catch me off guard. Fatigue sets in. Followed by 2-3 days 'lost' to relative detachment from my surroundings. Then I am welcomed back by a CRIPPLING depression. And as with most other opiates, I know what would fix the problem. Just a wee pinch of a rather innocuous leaf. Yes I tapered, yes I planned for it, and nonetheless, total devastation.",
  "It is the same old story. We should all have the right to feel as good and pleasant, and happy as we do when thoroughly opiated. But that is a fool's venture. We know it can't last. It is not worth it. Use it once and I'll simply be upset that it can't always be that way. Use it for a while, and I'll lose what little contentment I once had. And the worst part is I will know where it went.",
  "Cheers"
 ],
 "erowid": {
  "id": "41322",
  "citation": " UK Patient. \"Withdrawal is Horrendous: experience with Kratom (ID 41322)\". Erowid.org. Mar 11, 2005. erowid.org/exp/41322",
  "substance": "Kratom",
  "views": "18278"
 }
}
