{
 "id": 7178,
 "title": "Permanently Messed Up",
 "date": {
  "submission": "2007-03-06T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 tablets",
   "administration": "oral",
   "substance": "Diphenhydramine"
  }
 ],
 "report": [
  "<p>As I am writting this, I cannot sleep from the fear of hallucinating and extreme paranoia. This is almost a year after going on my last trip of Diphenhydramine. I cannot remember exactly what happened the three times I took it, but I will do my best. Honestly, I don't even want to remember, but this may help somebody out there.",
  "The first night I took Diphenhydramine, I went into another world. I itched, I had cotton mouth beyond control, and worst of all, I was afraid to open my eyes due to hard hallucinations. Most of the hallucinations were bugs and spiders. These scared the hell out of me. I saw them everywhere. The reflection of my friend looked like a lion. This seems fun, but it wasn't.",
  "To this day, I still hallucinate. I often wake up in the middle of the night and see snakes, spiders, and other bugs. I constantly jump out of the bed 3 am in the morning because I'm hallucinating. I will dream these hallucinations and when I wake up, the object is still there, but the surroundings are not that of my dream rather what I'm actually seeing. I'm messed up for life. I lie in bed closing my eyes still I see shit. I'm fucked up permanetely. I would do anything to have my old self back. Anything. I thought life was hard before I used drugs, well, it's a lot harder now. I'm paranoid over stupid shit. That tweaked up guy who sits in the corner resembling a drug addict you see in books and TV, that's me.",
  "Many are okay from it and I'm aware of that. I'm not overdoing this. I've done plenty of Meth and I've never been like this since I've done this drug. I regret it. I could cry and that pisses me off that I'm this low in life.",
  "Stick to Weed and Alchohol. That is, assuming you just want to get fucked up and your not a speed freak or anything. It's worth it in the end.</p>"
 ],
 "erowid": {
  "id": "41339",
  "citation": " Anonymous. \"Permanently Messed Up: experience with Diphenhydramine (ID 41339)\". Erowid.org. Mar 6, 2007. erowid.org/exp/41339",
  "substance": "Diphenhydramine",
  "views": "16289"
 }
}
