{
 "title": "Not a Toy",
 "author": "Miss Yu",
 "citation": " Miss Yu. \"Not a Toy: experience with 5-HTP (ID 71846)\". Erowid.org. Nov 4, 2011. erowid.org/exp/71846",
 "substance": "5-HTP",
 "bodyweight": "170 lb",
 "report": [
  "<p>Over the course of several years, I have used 5-HTP to self-regulate depression. I found it after having had a horrible experience taking Zoloft for a month, and searching for something far less potent.",
  "I started with a dosage of 50mg daily. Over the course of several years, that seemed to have a less noticeable effect, so I eventually upped my dose to 100mg daily. I'm not exactly religious about taking it; I probably forget about once per week, and I don't pay much attention to whether I take it on a full stomach or an empty one. Still, it seems to be getting the job done.",
  "I suspect if I were to quit cold turkey now, I would likely have some noticeable withdrawal symptoms. When on vacation, or when falling in love (limerence) I have neglected to take it for several days on end, and this always leaves me feeling low, so I'm sure my serotonin receptors have habituated themselves to this substance. Still, it is a much gentler (and less expensive!) way of avoiding depressive episodes of self-loathing and hopelessness than prescription anti-depressants, so I shall continue to take it into the forseeable future.",
  "Other information: When starting this drug, I had the oft-reported mild nausea and its accompanying lack of appetite. Though that was long ago, I don't think this effect lasted much more than a week or 10 days. I have, on rare occasions, taken doses as high as 150mg, however (such as an attack dose after not taking it for a week), and a sudden higher dose does cause the nausea again. I have read others' reports of taking huge doses, up to and over 300mg, and cannot fathom the nausea that would cause me!",
  "I am not a regular user of marijuana, and so am something of a lightweight in that department. Still, on those rare occasions I've smoked while self-medicating with 5-HTP, I've found my highs, even off of a couple of very small hits, to be much more vivid. I also notice an increased incidence of paranoia, but since I am paranoid whenever using drugs to begin with, it's probably just an intensification of my normal reactions.</p>"
 ],
 "year": "2008",
 "id": "71846",
 "gender": "Female",
 "views": "6729",
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2011-11-04T07:00:00.000Z"
}
