{
 "title": "AMT and the Brain",
 "author": "Leprechaun",
 "citation": " Leprechaun. \"AMT and the Brain: experience with AMT (ID 7184)\". Erowid.org. Jun 2, 2001. erowid.org/exp/7184",
 "substance": "AMT",
 "bodyweight": "67 kg",
 "header": [
  "DOSE:",
  "30 mg",
  "oral",
  "AMT"
 ],
 "report": "<p>GENERAL NOTES: AMT has so far had many faces for me. I have taken it in quite a few situations. From raves/parties, to home trips with good friends. It has given some interesting insights into the mind, myself and the world around me, and my friends and I find that this substance, of all psychoactives is a very fun/enjoyable and interesting psychoactive substance.</p><p>TECHNICAL NOTES: Alpha-methyl tryptamine seems to work in the mind in very many different aspects. It seems to affect many receptors and most probably has agonistic and blocking/antagonistic effects. This can be felt by the wildy varying degree of effect, both mental and physical. It is known that AMT is a mild MAOI, but it seems to either be a very dirty receptor agonist/antagonist or a very dirty MAOI. By dirty I refer to the specifics on action towards the Central nervous system. With the very little research performed on this substance, and the varying degree of effect, this substance can make you feel very interesting and aware of varying effects. In the same respect, it most likely does the same harm of those many substances. So do not feel that doing AMT is better then having Amphetamine/MDMA/LSD all at once, it most probably follows a similar course of action as those substances in unison. Yet this is purely speculative.</p><p>LIGHT NOTE: Whatever concept you have of existence at this moment. My words about all substances are, Apathy, Empathy, Hate, Love, Fear, Desire. We all stem from the foundations of reality, all things are part of it. All things seek to end suffering, is that our motivation? Whatever yours is, relax and be tense! ;)</p><p>EXPERIENCE:</p><p>Set: I have been thinking about many things this night. Some heavy some light. My words seem to bring thorth a caring arrogance. I feel I am above the others, yet I feel I have not as much worth as they do. I feel the need to have fun, and seek many pleasures. But I feel that currently I am unable to feel the pleasures I seek. I tripping partner, and long time friend, sometimes lover, are ready for tonight. We seem tense, yet subtly so. I am doing a dose of 30 today, although mostly I have done below that, only 20.</p><p>Setting: The place to ascend is at a castle. One of new make, one of fresh energy. It was constructed by a open-minded, psychedelic fellow, in Australia about fifty years or so ago. A dark place where I had a very overwhelmingly dark 2c-t-7 experience. One I mistook as a bad trip, one I failed to learn from, yet that is another story.</p><p>12:30 - 30mg is ingested. High anticapation, everyone else is rolling(MDMA) or doing whizz/speed. I feel arrogant, yet alone. The place is packed with people, I feel this is good. My tripping partner ingest and immediately split up. We exchange words, and continue on our merry ways. Waving to each other a hidden love.</p><p>1:00 - The experience is comming on. A mild anxiety builds, as I usually find on AMT. So many people I know. So many friends. Are they truly friends? What defines a friend for me? These types of questions constantly re-iterate within my awareness. A gentle motherly love for all whom I love begins to form.</p><p>1:30 - I need to run, jump dance. I am stuck with a friend who is on his first MDMA experience. He feels so good, I feel his joy, his new open feelings. Or are they just the drugs fueling a different reality to the one around us. I am torn between him and the curiosity to explore the world and the mind. I feel his words are empty, they wash over me like water, dried up by the sun. Evaporating into lost awareness, meaningless.</p><p>2:30 - Intensity builds, I finally tear myself away with much difficulty. I dance and run, I fall in and out of love. I see beauty where in an older lady. Not much sexual arousal as I had before. A loving caring feeling appears seems to continue and build. I talk and meet with many friends, too much goodness to be good, too many compliments. I feel it hard to define myself as others see me. I feel I am not worth their love, and their experience, yet I still feel caring of them. Finally, things begin to move...</p><p>3:00 - The world begins to take a new form. Colours are new, the world is new. I enter a room and dislike the music. But indeed I face myself. A poster sitting against the wall, a with the word Agony below it. I find myself disgusted and find it hard to understand. I spend the next while working through myself, attempting to understand what 'agony' really means. I find I have no concept of the word. I have been from from such a concept, or have? Things are difficult to understand at this time, yet they still seem clear. Physical stimulation is high because I fortunatly slightly sensitive to this substance  and I look forward to the peak.</p><p>4:00 - The night is well, many people, many conversations and many laughs. I finally find myself overwhelmed by all the effects and curl up in a sitting position. The visual aspect is profound. I see many things, with a difficulty in placing a significance to them. I see tracers like I have never before.</p><p>5:00 - The overwhelming euphoria, psychedlia, stimulation and empathy have subsided. I feel very strong and confident, no one can touch me, and if they do, I'll adapt to the situation at hand and be able to work with it. I am not afraid of death...</p><p>6:00 - The feelings of invicibilty continue, though the arrogance seems to subside. I feel less cracked out then everyone. The air is cold. I feel a mild MDMA fuzzy touch to everything with a slight over-stimulation and a growing wired feeling. The MAOI properties seem to still be working at this point.</p><p>8:00 - Day is in full bloom. The MDMA calm is strong, most other sensations have beneath the noise of awareness. I am enjoying everyones company, though they all look quite cracked out. I most probably look it too. Though my tripping partner whom I meet again look quite un-cracked. We talk and laugh, things are good.</p><p>10:00 + The day ends on a very tense note, driving home I had a bananna. I feel hypertense, not a good sign. I am unable to breath properly. I get home and attempt to sleep. For the first time in my life I am unsuccesfull. Normally on a high dose of amphetamine I can usually bring myself to an unconcious state. I would not call it sleep, as I find I awake as if I had no sleep.</p><p>END NOTE- After I sleep I usually go for a jog as I find the stimulation quite present.</p><p>The days following the experience seem to be a combination of the down-effects of MDMA, LSD and AMPHETAMINE. Though all a lot milder then down-effects of the actual drugs themselves.</p><p>Still, this is the most enjoyable recreational substance I have tried. Please treat it with respect, if so, more respect that I do.</p><p>Enjoy life! But only if you want to! :)</p><p>CIAO!</p><p>Leprechaun</p>",
 "year": "2001",
 "id": "7184",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-06-02T07:00:00.000Z",
 "views": "10325",
 "dose": {}
}
