{
 "id": 7187,
 "title": "Reality phased out of existance",
 "date": {
  "submission": "2007-08-25T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Demonhunter",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "March 11, 2005",
  "First off, I made a couple of mistakes:",
  "1) My choice of a sitter. I chose possibly my dumbest friend to be my sitter, I told him he was supposed to be my sitter but he smoked some of the salvia as well. That pissed me off because nobody was sober and it was my salvia, I dont have a lot of it and he smoked it without asking me if he could.",
  "2) I smoked it while my parents were home, they were asleep but home, which means I had a chance of waking them up",
  "3) I put too much in the bowl, I was going for a hit but I put in like 2 or 3 hits. This isnt really that significant except for if I had put just one hit in my friend wouldnt have been able to smoke any",
  "It was approximately 12:20 A.M. when I began my odyssey. I was sitting on my bed next to my window with approximately 2/5 of my bowl filled with salvia divinorum 20x. I took a hit and I was holding it when I saw my friend trying to grab the pipe out of my hands. I tried to tell him not to, because he was the sitter, but since I was attempting to hold the smoke in I couldnt talk.",
  "I have read that salvia begins to fuck your mind in about 20 seconds, but I was still amazed with how fast it came on. I was starting to feel the initial effects before I exhaled. Actually, I dont remember exhaling. When I was coming up I got slow vision and I started to lose control of my motor skills. One thing that surprised me was how clear I was thinking. My body felt high but my mind felt sober. I was only coming up for about 30 seconds.",
  "I was peaking somewhere around a minute after I inhaled the smoke. This is when my memory gets fuzzy; I will try to decipher the details to the best of my ability. I have been piecing together this story from the fragments of it that I remember. There were 2 distinct parts to this trip. The first part was in the 3rd person, it was like my soul was overlooking the actions of my body, of which I had no control. My body was standing on some train tracks and there was a train coming. I just kept standing there and looking it in its figurative eye. When the train was coming towards me I wasnt frightened, I wasnt in fear for my life at all; instead I was curious, I wanted to know what was going to unfold.",
  "I have been trying to remember what colors the train was. I know that they werent the colors of an ordinary train, but multiple colors blended together to make a wide spectrum of color. My body stood on these train tracks, watching this psychedelic train while I watched from above. This is when the trip did a 180 and completely switched the setting. I think I got hit which is what caused the change.",
  "In the second part of my trip the train tracks, the train, and my body were gone. I was no longer watching myself stand on the tracks; I was in first person view now, only I had no control over my actions. It felt like I was flying, everything was white so maybe I was flying over a giant blanket of clouds. This wasnt a smooth flight, it was really jerky, and it almost felt like I was being tossed around, being thrown by some giant invisible hand. I felt like I was a slinky because when I was being thrown my path made a perfect semicircle. I would be on this blanket of white clouds then I was catapulted in the air, making a perfect parabolic path through the air and landing farther down.",
  "The weird thing that happened was behind me I was leaving a trail of shimmering light. This light was made up of many different colors intertwined to give the stream of light a psychedelic look and feel to it. This is more or less the second half of my trip; being tossed about, leaving a trail of psychedelic light. At first it felt like I was aimlessly being thrown but towards the end of my trip I felt that the direction in which I was going had some meaning to it. Suddenly I got a top view of what was going on and the trail of paint behind me was spelling out words. It was like I was being used as some paint brush to spell out a message.",
  "At this point in time the peak is coming to an end. Also, my friend told me that I was screaming something. I immediately thought to hide my pipe, which was lying out in the open in case I woke up my parents and they came to see why I was shouting. So I grab my pipe and run to my closet and hide it somewhere. I was still high so when I was running around. It didnt feel like I was running at all; it felt like I was being thrown around like I was earlier. When I tried to put my pipe in my closet the trail of light was still behind me and instead of going in a straight line to my closet it felt like I spelled out the letter H and wound up at my closet somehow. Right when I got to my closet I was catapulted back to the real world. I was no longer flying through the air spelling messages; I was in my room.",
  "This is the part I found the scariest. After putting away my pipe I sat down on my bed, the peak was over and I was coming down fast. I looked over at my clock and it was 12:45. I freaked the fuck out. What in Gods name happened in the last 20 minutes? I had absolutely no memory of smoking salvia or what happened in those 20 minutes. Then it hit me like a brick wall, I had smoked salvia 20 minutes ago and didnt remember anything. I sat down on my bed and repeated to myself I just smoked salvia, it doesnt last long and it will go away soon. I said that to myself out loud about 3 times. There is just something unsettling about having no recollection of the past 20 minutes.",
  "Right about now is when I started to realize that I was drooling. I remembered to swallow my spit and I calmed down a little bit. I was still coming down, I felt similar to when I was coming up, only I didnt have slow vision. My thoughts were extremely clear, maybe even more so than when I am sober but my motor skills were still impaired. When I tried to walk it felt like I was drunk, like I was stumbling around. I was really thirsty and wanted to go get something to drink, but I waited in my room until I was, for the most part, sober. Coming down lasted maybe 10 or 15 minutes, which is not very long, but its still long compared to the few seconds it took to come up. I experienced no aftereffects. I felt completely fine, like I just woke up from a long needed sleep.",
  "After thoughts:",
  "The thing that surprised me the most was having no memory of doing this drug. The last thing I remember was hitting the pipe and saying, Im high. The weird thing about the train part is that somebody who I work with was telling me about how one of his friends got hit by a train while he was on acid. It is almost like my imagination recreated that story in my head. I tried to find a connection between the two different parts of my trip and I believe that I have found one. I had an out of body experience and saw through the eyes of my soul. I saw my body get hit by a train so I tried to spell out a message for somebody to come help him. I think that the word I spelled in the air was HELP",
  "As for the part about me yelling, I have no memory of saying anything during the entire trip. The person I was with said I yelled, OH NO! That would make sense, seeing as a train hit me, but I still dont think I shouted anything. My parents didnt wake up which also leads me to believe that I wasnt yelling. Right now I think that the salvia was messing with the auditory center of his brain and that I might have said oh no but it was amplified in his head and gave him the impression that I yelled it.",
  "When I put away my pipe in my closet my friend said that I took the pipe stumbled to the closet put it in there somewhere, shuffled back across to the other side of the room, got a can of axe that was on my desk and put that in the closet as well. I thought I had a relatively good memory of where I put my pipe; I tried looking for it 10 minutes later when I was sober and it took me 25 minutes to find. It was in the most obscure place ever, completely different than where I had imagined I put it. Also I have absolutely no memory of taking the axe to my closet. I dont know why I would think to hide deodorant, but apparently I did. I found the axe inside of one of my shoes in my closet.",
  "I dont know what I was doing during those 20 minutes. I dont know if my eyes were closed or open. I didnt see my room at all during the peak. I was whisked away to an imaginary land that I created and my room faded out of existence. This was very similar to a dream, only I was conscious the whole time and I couldnt wake up if I wanted to. I think that it was a dream. My eyes might have been open but I could have been sleeping with my eyes open. I think that the salvia catapulted me into REM sleep causing me to experience vivid dreams. Once the drug wears off I exit my dreamlike state and reenter the real world. This makes sense because salvia and REM sleep last for 15 minutes. Another thing I found interesting was the time dilation. At first I felt like no time had passed since I hit the bowl, but later I felt like I was dreaming for 5 minutes but it was really 20 minutes.",
  "I plan to try this again only with a few minor changes. I will have a different person be my sitter. I will make sure no authority figures are around or going to be around for an hour. I will put the right amount in the bowl. I would also like to put on some relaxing music in the background, maybe some Pink Floyd, and then do this salvia and see if my hallucinations emulate the song. All in all it was a fun experience and I recommend trying it."
 ],
 "erowid": {
  "id": "41388",
  "citation": " Demonhunter. \"Reality phased out of existance: experience with Salvia divinorum (20x extract) (ID 41388)\". Erowid.org. Aug 25, 2007. erowid.org/exp/41388",
  "substance": "Salvia divinorum (20x extract)",
  "views": "2995"
 }
}
