{
 "title": "A Glimps Of Paradise",
 "author": "Eli F.",
 "citation": " Eli F.. \"A Glimps Of Paradise: experience with Cannabis (ID 719)\". Erowid.org. Aug 1, 2000. erowid.org/exp/719",
 "substance": "Cannabis",
 "bodyweight": "130 lb",
 "report": [
  "<p>My best friend, his brother, two of his friends and I were sitting in his garage passing around several joints. After finishing the joints we decided to go back into the house where it was warm and comfortable. After about 10 minutes, I began to feel disapointed; I was  not the least bit high.",
  "I walked upstairs into a dark room and turned on a lava lamp. The second my eyes hit the lamp I felt this huge surge of energy shoot through my body. It was very unexpected but felt great none the less. My overwhelmed body collapsed to the floor. My legs and arms began to move every-which way as I lay on my back gigling. I had no control...NONE. Then, as sudenly as they began, my muscle spasms stoped. I was curious as to how much time had past since I walked into the room. I stared at my indeglo watch. Instead of the usual #'s, I saw strange lines moving up and down the face of my watch. For some strange reason this didn't surprise me at all.",
  "Then my friend walked into the room and suggested that we turn on the strobe light. Having tripped out on that thing before, I agreed. He turned it on, slow at first. I picked up a small baseball and threw it up in the air. It seemd to suspend in the air for several seconds before comming back down into my hands.I got such a kick out of it, that I kept on just throwing the ball up and down for about 10 minutes. My friend then turned the strobe light to fastmode. I put it up to my face and looked directly into it (never do that...very bad for eyes). I saw the rear view of a space ship as it made its way through space. Then my friends bro walked in and sprayed cold water in my face with a water pistol. this caused me to immediately lose my high.",
  "This was a very interesting trip from which I learned two things:",
  "1)A lava lamp and a small dark room make an excellent combo.",
  "2)Sometimes a high kicks in relatively late, so be ready.</p>"
 ],
 "year": "2000",
 "id": "719",
 "gender": "Male",
 "views": "6151",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2000-08-01T07:00:00.000Z"
}
