{
 "title": "Entheogenesis",
 "author": "Sophos",
 "citation": " Sophos. \"Entheogenesis: experience with Cacti - T. peruvianus, Harmaline & Cannabis (ID 71953)\". Erowid.org. Sep 1, 2008. erowid.org/exp/71953",
 "substance": "Cacti - T. peruvianus, Harmaline & Cannabis",
 "bodyweight": "160 lb",
 "report": "<p>In order to boost the alkaloid absorption of this Elixir, I procured freebase crystals of a Peganum Harmala seed extract.  As you kitchen alchemists know, Peganum seeds have perhaps the highest concentration of MAOIs in one of its active compounds (Harmaline).  Now, I have tried every mode of Peganum I know: raw, ground up seeds, a water extract, and a 5x alcohol extract.  The raw seeds produce an unfathomable nausea and convulsions of stomach pain, all while the MAOIs rise up to crack open the cerebral connections.  Highly unadvisable.  The freebase crystals are by far the easiest and most concentrated form of taking Peganum as an MAOI.</p><p>Medicine was prepared according to standard alcohol extraction.  Poured ~30grams of dried Peruvianis powder into a large canning jar, which I gradually filled with Everclear (95% alcohol).  After 24 hours, Cactus infused alcohol was suctioned out using a turkey baster, and then placed into a round pyrex glass dish.  Rather than allowing the 24-48 hours of evaporation, I let it evaporate for about 12 hours, filtering the solution and putting the alcohol-only portion in one glass, while leaving cactus powder in another glass.  Not allowing the full evaporation, as well as ingesting the actual powder, proved to be immense gastrointestinal mistakes that consumed most of the journey.</p><p>After a ritual bath, MAOI crystals were imbibed.  All dietary restrictions for MAOIs respected  do not ignore this!!  I then choked down the sludge of soy-milk/cactus powder, followed by drinking raw, unadulterated Cactus-infused-Everclear.  Hands down, this is the most profoundly bitter and overwhelmingly harsh herb to drink on goddess green Earth.  Time: approx 8 PM, PST.</p><p>Things get bizarre.  I live on the edge of a forest in the beautiful hills of central Oregon  an amazing place for these journeys.  Nausea  good god, sweet gods, what pain.  I lay outside, accompanied by a small pipe with pouches of tobacco and cannabis.  Dusk descends.  Id listen to random music  Gregorian chants, Native American folk music  chant along, sometimes sing, cry, and the beauty of whatever melody poured forth from my body was heartwrenching.  Eventually inner silence would envelop, and the subtle winds would course thru my flesh along with the towering reeds, billowing Douglas-firs.  I felt no more special than soil or grass.  Humbled joy  perfection.  </p><p>Keep in mind that while these epiphanies arose, the most excruciating nausea and stomach pain humanly possible racked my body, due to ingesting the actual cactus powder.  I forgot to get water, usually tobacco/cannabis give me bad cottonmouth, but I somehow discovered pore breathing in which I absorbed the water particles in the wind and air.  This went on for an hour or two, continually smoking the herbs to help with my stomach and to ground the journey, while never feeling dehydrated at all.</p><p>Back inside, the convulsions of stomach pain.  Somehow I cant vomit though.  Forcing myself would have invoked that, but that felt not right.  I lay on the ground, dazed.  I then chew 2 teabags of Coca as part of the shamanic infusion.  Delicious taste of Earth and nitrogenous soil in my gums.  Any sensory input was overpowering, ecstatic, bewildering, like an infant perceiving life for the first time.  Moving a few feet equals a journey of 10,000 miles.  Walking  a mile near the forest is interstellar.  Suddenly when my thinking stops, I leave my body and am fluidly traveling through astral space.  Anyone with tendencies towards astral projection, out of body experiences, lucid dreams, etc. will find their etheric/subtle body drifting away effortlessly.  Points in space/time traversed at speed of thought.</p><p>The Elixir seems perfectly attuned to the nervous system of whoever She flows through.  The most subtle, mundane fact of my life would manifest for me to notice, or a random comment spoken by a friend years ago would shake my body with gentle laughter.  Moments later Id directly receive information about the holographic and metaphysical nature of the cosmos that defies the intellects ability to comprehend.  The presence of ascended masters and long-dead Shamans scintillated in the air, the sky, the walls of my bedroom, in my flesh.</p><p>Be still  surrender.  Be as simple as waving grass.  Know  the frogs dusk song.  Be the pain, sorrow, torment and ecstatic joy of the entire cosmos at the same moment, cosmically ebbing in unfathomable crescendos.  This is what the Cactus Spirit sings, and to be the simple mouthpiece of that Song is a bliss that fills my every cell.</p><p>My reflection in the mirror quite frankly was a bit scary.  Around dawn, the shadows meeting the dim early light would create bizarre movements and eddies.  It still invoked a deep humor rising from my belly.</p><p>The Cactus, mythically brought to Earth by Saint Peter, is a medicine of astonishing power.  She always invokes a kind of psychic death, and there are times I am rather convinced Id physically die.  This Power is said to cleanse the blood, the physiological system, as well as the psychological and spiritual circuits interwoven thru this microcosm of the Universe encased in living flesh.  Much of the journey is simply unspeakable.</p><p>5:27 PM: nearly 24 hours later, and still no sleep.  That may come some day.</p>",
 "year": "2008",
 "id": "71953",
 "gender": "Male",
 "timestamp": "2008-09-01T07:00:00.000Z",
 "views": "12313",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Harmaline",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "30 g",
   "administration": "oral",
   "substance": "Cacti - T. peruvianus",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(plant material)"
  }
 }
}
