{
 "title": "My Life Changing Epiphany",
 "author": "Tammie",
 "citation": " Tammie. \"My Life Changing Epiphany: experience with Ketamine & MDMA (ID 72013)\". Erowid.org. Aug 24, 2009. erowid.org/exp/72013",
 "substance": "Ketamine & MDMA",
 "bodyweight": "57 kg",
 "report": "<p>Before taking the MDMA that led to my amazing epiphanies I had taken Ketamine, which disassociates me from everything. I was walking from the tents to where the car was parked with a few people but saw a horse across the field on the way. I went over to it, it was getting really dark. I talked to the horse like it was a person for about 20mins, then suddenly I felt like I was on another universe. Everyone I knew were a dark tunnel away in another universe. Then it started raining badly and my phone died. When my phone went I felt like the last means of communication with another human had slipped away forever. I felt I would be a universe away from any other human for eternity. I then took MDMA for the first time in my life on this Thursday afternoon in a festival camp field. At first I didnt feel anything and didnt think it was working so took a bit more and a bit more (to just over quarter of a gram, then took the other quarter of a gram around 3 hours later) and then suddenly, BOOM the white tee pee I was in suddenly lit up so brightly it was so intense and then there were waves of real pleasure.</p><p>I went and sat near someone in a tent. I sat crossed legged and closed my eyes and then the drug kicked in really strongly. Suddenly, my whole life was laid out on a really strongly brightly lit rectangle slab in my mind. There was literally a line splitting the important things and the non important things in life and how important it is to actually connect with other people. Then I literally entered my mums body and could feel everything she felt. I realised so strongly that every action she had done against me was because of forced situations out of her control. I felt so so vulnerable being her; I hated the vulnerability of her so much it felt like she could just fade away with her silence. I then so strongly felt a massive strong wave of forgiveness for her with so much peace. There was an intense powerful light that flowed through my body. There was literally a strong message urging me to phone her for the first time in almost 6 months in which we havent been speaking and I promised myself that I would the next day.</p><p>The lit up slab also very clearly divided all the genuine, decent people I have ever met in my life from the selfish shallow people with other agendas, so much, and it made me so at peace to realise this about certain people. It made me accept that I have no control over how other people behave and that I can't impose my thoughts and ideas on other people, only give them an opportunity to agree or believe or feel something.</p><p>I have never felt really empathetic with someone else as if I actually was them before, so Ive seen from their perspective but never literally cared about them as if they were actually me or my child so much, like literally felt their hunger when they were hungry and been able to see straight through them to what they were thinking. N was in the tent and hungry and not at ease and I literally felt her pain.</p><p>I think it was because of the Ketamine that I had taken earlier combined with the fact that it had suddenly got really dark and cold, as well as there being a really down atmosphere because the festival had just got cancelled and I was soaking wet but I suddenly fell into the feeling of being all alone in the universe. I felt I was at the end of my life, wishing Id talked to people and I couldnt get out of it. I thought it would last forever; it was an everlasting, impending, very dark doom. Then T came over and had a go at me for just sitting there freezing cold but not wanting to get changed, saying, right thats it, were going home. T went off in a stress, starting to pack and I managed to sort my wet clothes out.</p><p>What happened next would not have happened the same without the ketamine first. I would not have had such deep realizations if it wasnt for going through my version of hell first. Thats what gave me the wakeup call in life. Then M came over and pulled off my soaking wet boots and the whole M persona at that point just cheered me up so much, I have never been cheered up so much before in my life, I just burst out laughing in such a freedom way it was so funny. Like a child being made to laugh by something so simple. I have not laughed so freely like that, just thinking about the thing I was laughing at since I was about 6. I didnt know where I lived, I thought my tent was my house, the other tents were my neighbours houses and all my possessions and life ever were in that tent. The fields around us and the people around me were the only things Id ever known.</p><p>Then S came over, I cannot believe that he actually understood everything my mind was going through, it was unbelievable and I would no way remember it so strongly if he wasnt there, my normal rational me would not write this all down which is why I am as the final bits of the drug fade away, I want to hold onto it so much and so strongly. I have never in my whole life told anyone my true feelings about stuff that really upset me, but I did to S and it came so easily without any bad feelings, with so much peacefulness and acceptance. I never normally accept anything and always strive so hard to change things but material things or present situations just did not matter anymore.</p><p>I have never ever met anyone before who has actually listened to me so much, like not just literally listened to me but actually meant it and it would not have been such a powerful experience without him confirming my thoughts. It was so weird that just the right person to tell everything to came over at just the right point. The best thing he said was that the experience really was real. I said things to him that I didnt even realise I thought, things that I didnt even realise were in my mind, which is why I felt the experience was because of him. Then he said that it had all come from me. I suddenly realised everything that had happened were my thoughts that I never knew I had. Things I actually knew the answers to in the depths of my mind, but that would never have come over to my conscious mind with such definite, strong clarity, a shining truth that could not be battered down, if it wasnt for the MDMA.</p><p>Something that was amazing was how S looked at me and took me completely seriously even as I was majorly tripping, not quite being able to get the words out or stopping to find something amazing or laughing. If I could go back in time I would tell him a lot more and I would sit him down to tell me more as well. But in the blur everything whirled so fast and we just spun off to the festival. (At this point I took the other quarter gram of MDMA making it a total of half a gram).</p><p>I went off into the festival with J and W and was so ecstatic from my experience, happy and at complete peace with everything and had so much energy, I went into a rave tent and danced on the stage like mad from around 3am to just gone 5am. I sweated so much and talked to so many really nice people and near the end I drank about 4 pints of water from the tap outside the tent. I was really concerned about other people being thirsty so got 2 of the people I had been talking to drinks of water too. On my way back to the tents I told this all to a random really nice woman and she told me that what I had experienced was called an epiphany, meaning a sudden realisation of clear, absolute truth. I dont believe in God, I wouldnt rule out the possibility of God completely, but Im not a believer. However I would equate the whole experience with discovering God for the first time in a sudden rush of light, clarity and truth. For a split second as I was feeling the light and intensity of clarity I did feel it was God but then believed it was my own thoughts being enlightened to me.</p><p>Another woman I randomly met said now I had opened up tunnels in my mind I would be able to return to the thoughts Id had without ever using the drug again. I was just like, how!!! I really need to know!!! When I got home, I had the mixed feelings of the drug still in my system mixed with reality and I realised that I cant ever ever forget what I learnt from the trip the night before which is why I have decided to write it down, it feels too close to escaping forever. Back home, as I was slipping back into pure reality I broke down and cried as I realised how amazing the experience has been and how important it is for me never to forget it. It has actually changed my life forever in such a positive way. If I never experience such clarity and truth with the drug ever again, I will never ever forget it and I know I can always tap into the thoughts I had, however far back in my mind they are. I had never cried with happiness in my life before this point but I just cried with complete euphoria.</p><p>I only usually cry about once a year and that has always been in arguments on the phone to my Mum. This time I could not stop crying but it was a crying I should have done years ago but I was too scared to. Scared that if I had given in to my emotions that I wouldnt have survived my parents divorce, scared that I would never get out of the house I was growing up in. I had to put it all to the back of my mind and become cold to my emotions until I was in a safe place in my life, which I guess is just about now.</p><p>In fact I think the drug has completely faded away now, but I am still left with fuzzy good memories of what I discovered, its a blurry pleasurable haze, as a reminder of what feels like just a dream, as if my mind is not letting me forget it because I need to remember what I learnt. It would be so easy to just forget it as if it didnt really happen and that really really scares me, so thank god I told someone everything that happened or I might not believe it was actually real.</p><p>Thinking back, it was all really suppressed things in the back of my mind that I really didnt even know that I could still remember. I would never have had such clarity and such clear eureka moments to all my troubles and worries without it though. I would also never have realised how much I was still devastated about my parents divorce, 13 years ago. I had always never talked about it because my Mum would never let me without getting really stressed with me. I had always kept it inside me, forcing it to the back of my mind, never letting it all go completely, believing it would go away if I didnt think about it, but it was still actually all there, and it took about 36 hours after taking the drug for me to actually realise everything it had brought up, cry about it but then actually feel so at peace, knowing that there was completely nothing left at the back of my mind. Completely not scared of going to the back of my mind ever again. Not having to stop at a certain point of my thoughts ever again. I have lost the demons of my mind and lost a weight off my shoulder forever. Two days later I am left with feelings of freedom, purity of mind, acceptance and knowledge that it is not possible for me to ever forget this. Im not scared of it slipping away anymore.</p><p>To think that I took the MDMA simply for a high and for fun when the festival got cancelled and it was tipping down with rain and ended up getting so much more from it, so much more than I could ever have imagined. The most worthwhile thing I have had for ten pounds in my life! Although I had taken the other half of the MDMA around 4 hours later for a boost, it was the initial ten pounds worth that gave me the epiphany rush experience, the best ten pounds I have ever spent!! Compared to this I never want to have alcohol or ketamine ever, ever again with their associated bad points. This is the best therapy of my life that solved the answers to any questions I had all at once, crystal clearly!!</p><p>I dont feel that people are against me anymore, only institutions and government laws but other people are caught up in it just as much as anyone, and its not their fault, even the people that symbolise power over individual thoughts. I used to be so cynical of human nature when I was about 19 and so into all the conspiracy theories of society that Id just got so stuck into. So I felt the world was against me at the time when I felt everyone at home was against me too. It was so dark but this MDMA trip has lifted darkness off my life and although the government and systems may be against me I no longer believe that the people within these systems in life are. They may be ignorant of it all but they are not consciously against me, and as I was walking through the streets today I suddenly realised this.</p><p>I Feel like a new born child placed back on earth with no emotional crap weighing me down. I felt reborn as I walked down the road. Like I had been placed back to reality knowing I had the knowledge of what I had learnt on the most amazing spiritual trip ever. This knowledge will last me a lifetime. I no longer hate myself in anyway at all now because deep down, I no longer blame myself for conflicts at home, rather than just rationally like I did before. I didn't even know that I did hate anything about myself but deep down I did until I'd forgiven myself and really accepted deep down that it hadn't been my fault. I dont see the point of doing things just for the point of doing them, only if they have an actual meaning behind them. Spontaneous things I really want to do, I wont feel guilty for cancelling something else over because its a short life and theres no point doing something routine for no real reason when you could be doing something you love that means a lot to you.</p><p>I am so much more understanding of other peoples situations now. It has made me see I need personal meaning to everything and has made me realise what it could be like at death if I dont make up with people, alone and in the dark. This all happened thanks to the MDMA and telling someone everything! I wouldn't ever feel the need to take this more than every couple of months or much longer because the whole experience was so intense and brought up so much that it really is enough to last a long while!! After sending my epiphany to E from Uni, I was thinking about what he had said about the present being all that exists and the past not actually existing anymore, which is very true. Then I crashed and slept really deeply for 2 hrs because I was absolutely knackered and I had this really vivid dream.</p><p>I was back in the field, having the epiphany happening, I remembered it all, but then it carried on, things were added to it. I was absolutely in the present, that he had made me remember about and I realised that the only thing that proves that the past actually existed are peoples memories and photos, without those, if you were on your own, without anyone alive that remembered something, then maybe the past didnt really happen the way you thought it did and I realised I have no photos of between the ages of 11 and 21 at all. No proof of that past, and its too late, its gone forever! I realised how much of an absolute twat my Mum's boyfriend was for ripping up every photo of my Dad in the house, including the ones of him with my brother and myself. I had completely forgotten that had happened, and I had never realised the significance of it. It also made me realize that no-one can ever do anything like that to me ever again, and how important photos are for memories and links to the past.</p>",
 "year": "2008",
 "id": "72013",
 "gender": "Female",
 "timestamp": "2009-08-24T07:00:00.000Z",
 "views": "4913",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "",
   "substance": "Ketamine"
  },
  {
   "time": "",
   "amount": " T+ 0:30",
   "administration": "0.25 g",
   "substance": "oral"
  },
  {
   "time": "MDMA",
   "amount": "(powder / crystals)",
   "administration": " T+ 3:30",
   "substance": "0.25 g"
  }
 ]
}
