{
 "id": 7202,
 "title": "Banshees and Henry Winkler",
 "date": {
  "submission": "2008-07-15T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "650 mg",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "This tale is of a awkward and frightening experience I had on cannabis.  At the time, my only experience with psychoactives was limited to cannabis and alcohol.  Things have changed a little since then, but that's another story. :)",
  "Twas the summer of 2004, school had just let out about two weeks earlier, and I was having a grand ol' time partying.  And like any normal summer night, a few friends and I were on a quest to get stoned.  We made several phone calls that all ended up being dead ends, and as the light at the end of the tunnel seemed to be fading, my counterparts started dropping out of the search one by one.  In the end, it was up to me and my friend F to somehow acquire some bud and smoke.",
  "We made one last phone call to C and met him across town.  Just as eager to smoke, he pulled out a small piece of paper and started to call his suppliers.  Once again, we were having no luck.  However, we scored on our last possibility.  We walked over to the guy's house to purchase a gram, and then we were en route to a fairly popular smoke spot hidden by the railroad tracks.",
  "It was a fairly long walk down the railroad tracks, but the presence of a random squad car lurking behind some bushes forced us to break course.  We decided that 3 rather eccentric-looking individuals, all of whom had some sort of run-ins with the police at some point, was rather sketchy.  I shielded the rather intense spotlight from my vision, and we hopped down a small ledge, walking in the direction of F's house.  Conveniently, his mother was not home.",
  "Safe and sound inside F's house, we decided on the instrument of smoking: a gravity bong.  F retreated to his room and returned with a bucket and a soda bottle with the end chopped off.  No preparation necessary. :)",
  "Now, I'm sure it's important to note that the setting was completely new to me.  I had never seen F's house before in my life, nor been inside it at all.  So subconsciously, smoking pot in an entirely new location was a bit awkward.  Also, I had never smoked with C before nor had too many previous interactions with him that lasted beyond 5 minutes.  So his company was also new.  And to top it all off, it would be my first venture into the wonderful world of gravity bongs.  All of this in mind, I suppose I set myself up for a wild ride.",
  "Being the newbie of the group, I let F and C take their hits before me so I could observe the proper technique.  After all the trouble I went through trying to get the damned bud, I was very eager to get as high as possible, so I had C light the bud and pull up the bottle because he gave me the impression of being somewhat of a veteran in the arts.  I unscrewed the bottlecap off the top, placed my lips over the opening, and inhaled what felt like the largest, most barbaric hit I'd ever had.  And there was still more smoke left in the bottle afterwards, so I had another one or two 'clean-up' hits.",
  "We repeated this cipher maybe 5 more times before I realised how incredibly fucking stoned I was.  I decided to retire from the festivities quite early, to my chagrin.  Being the only one with free hands, I was awarded the duty of calling our friends and arranging meeting place.  All the while, C was making disgustingly silly remarks and eliciting some very feverish laughing fits from myself.",
  "I leaned on the wall for support and realised using my phone was too difficult.  I wish I would've realised that I was slowly drifting to my left, but I got the notion shortly after I knocked over a large picture frame that was hanging upon the wall.  I accepted the fact that I was wasted, and decided to grab a Coke, sit down in the living and relax.",
  "The living room was quite dark; the only light penetrated in from the kitchen where my two friends were finishing up the rest of the bud.  I watched them out of the corner of my eye and noted the fact that they were constantly talking, but I cannot for the life of me remember one damned thing they said.  I began to focus on random objects in the room when I realised that the curtains and the television seemed to be swirling.  I closed my eyes for a few seconds, thinking that it was just some mild fatigue.  It didn't go away when I opened my eyes.  I blinked a few more times, a few dozen, hundred, thousand?  Eventually, every time I blinked, it felt as if it lasted 10 seconds.",
  "I began having some very intense CEV's.  I saw hundreds of banshees in a circular pattern flying towards me, screaming, laughing.  I felt my heart beating faster with every passing second.  To put it more simply, I was freaking out.  One of the flying monsters beneath my eyelids gave me such a scare that I flew back into the seat and kicked the glass table in front of me.  Since the bud was done, and so was I, the three of us decided to go meet up with the crew at a nearby convenience store.",
  "The walk was more of an odyssey than a 3-block stroll.  Homer was rewriting that street before my eyes and it was total Hell.  Eventually, we reached the rather brightly-lit parking lot where our friends and a few new faces were conversing.  Watching one of the new faces talking to C, I slowly noticed that I couldn't comprehend a single thing that they were saying.  It all sounded like silly, alien jabber.  Weirder still, I noticed that when I blinked, I began having more CEVs.  Not as frightening as the aforementioned banshees, but I saw visions of Arthur Fonzarelli (Yes, the guy from 'Happy Days') walking around and talking.  This was so weird that it creeped me out as much as the other CEVs I had.",
  "After maybe an hour of very strange conversations, I decided that I would be able to make the two-block drive back to my house.  I hopped in my car and went home, avoiding too much contact with my parents.[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  I sat in my computer chair and thought I'd be able to chill out, being in my own home and all.  But after all the frightening and strange visuals, and the lot of other happenings that night, I had an eerie sense of paranoia that simply would not be shaken.",
  "Too lethargic to fetch some food from the kitchen, I climbed into bed and desperately tried to sleep.  Closing my eyes was very difficult.  Though the visuals were gone, the paranoia seemed to intensify when my eyes were not open, as if I were afraid that they could reappear at any moment.  After a while, I eventually drifted off to sleep.",
  "For a long time after that, I swore that the bud we smoked was laced, even after conferring with F and C and finding that they did not have an experience like I did at all.  After doing a lot more reading and becoming much more educated about the mind and the effects that psychoactives can have on it, I realised that it was all just a combination of setting and mindset.  I consider that night a potentially enlightening experience that was limited only by my ignorance and general lack of knowledge.  Since then, I'd had several very interesting experiences, hallucinations and all, with cannabis, so to all who underestimate its strength, I advise you to think again."
 ],
 "erowid": {
  "id": "41448",
  "citation": " Anonymous. \"Banshees and Henry Winkler: experience with Cannabis (ID 41448)\". Erowid.org. Jul 15, 2008. erowid.org/exp/41448",
  "substance": "Cannabis",
  "views": "2431"
 }
}
