{
 "title": "Week of Binging",
 "author": "SX2BDWN",
 "citation": " SX2BDWN. \"Week of Binging: experience with Methamphetamine (ID 7205)\". Erowid.org. Jan 17, 2003. erowid.org/exp/7205",
 "substance": "Methamphetamine",
 "bodyweight": "150 lb",
 "report": "<p>  I'm 18 yrs. old and I've done Meth quite a few times, but after this last week I think I've crossed the fine line between recreational use and addiction.</p><p>It all started last monday (memorial day) when my ex-girlfriend called me up and wanted to hang out.  We did and she told me all about the fun time she had at the three day X-Fest.  We smoked some speed and she told me that she had some to sell.  So I purchased an quarter-gram and that was the beginning of a week long binge.</p><p>A very good friend of mine was going to be at her old house all week.  She doesn't like to be alone so I stayed over there with her.  I pulled out the quarter-gram I had and we stayed up all night smoking it.  We were lit out of our minds all night well into the next day.  The following morning we went 50/50 on a half-O of bud.</p><p>I went to work and when I got back home I went over to her house and we both decided to purchase a half-gram of speed.  Now this shit was diffrent and it got us both spun as hell.  She said she was tripping ouy, seeing shit and stuff.  This was some damn good crank I must say.  A huge half for $40.  Again we stayed up all night.  Now it's thursday and we went half and half on another half-gram.  Same good shit.  Spun all night again.</p><p>  Then on friday while I was at work It finally hit me.  I was feeling so depressed.  I drive and make deliveries for my job and while on the road I was feeling so terrible.  I was actually balling my eyes out.  That song 'crawling' by Linkin Park was stuck in my head all day.  I had extreme feelings of emptiness and lonliness.  I felt that my life was going nowhere.  I felt almost semi-suicidal.  This was my first true glimpse into what TRUE addiction felt like.  I remember laying in my bed and thinking to myself 'wow, you've really done it now'.  I was thinking that now I've become hooked on the shit.  I never thought that I would ever be addicted to hard drugs.  I was really scared.</p><p> I should have known that doing all that speed every night would have had it's consequences.  I knew that meth was a dangerous drug.  I was being really naive.</p><p>  Alot of people talk about that their first time was all it took.  Not me.  I've done it alot before.  But I never smoked a half-gram every night for a week straight.  And that's what it took.  When I started thinking to myself that maybe I've got a problem, it was already too late.  I should have known that you can't do this shit all week and then just stop abruptly.</p><p>  My friend's boyfriend has a bunch of warrants for his arrest, and thus the cops were always watching her house.  Somehow, the cops found out that they got back together and he was staying at the house.  Throughout the week, I noticed that she was becoming increasingly more paranoid.  When I visited her on friday night, All the lights in the house were turned off and all the blinds down.  It seemed like Randy Weaver's place or something.  Like a standoff was imminent.  Her beautiful self was huddled in a corner with blankets.</p><p>The house is getting sold on tuesday, so it's completely empty except for a small television set placed on top the dryer which is used as some sort of ghetto heater.  I felt sorry for her.  She is so fine.  I love her as a friend.  She's like a sister to me and I hated to see her this way, living in fear.  Her house is at the corner of an intersection.  With so many cars coming by stopping and going, it's driving her nuts.  I can tell.  She looks out the blinds every other minute.</p><p>  But we'll be okay.  I know it.  We both have just graduated from high school early and things WILL work out.</p><p>  Anyways, i'm gonna close by saying that when you binge on crank for a week, be prepared for some consequences.  There's nothing funny about this kind of addiction.  You won't know it till it's too late.  Later.</p>",
 "year": "2001",
 "id": "7205",
 "gender": "Male",
 "timestamp": "2003-01-17T08:00:00.000Z",
 "views": "35842",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ]
}
