{
 "title": "Social Focus without Amphetamine Lunacy",
 "author": "AvoidBeingFiredADD",
 "citation": " AvoidBeingFiredADD. \"Social Focus without Amphetamine Lunacy: experience with Amphetamines (Vyvanse) (ID 72063)\". Erowid.org. Jul 30, 2010. erowid.org/exp/72063",
 "substance": "Amphetamines (Vyvanse)",
 "bodyweight": "205 lb",
 "report": "<p>Vyvanse, or Lisdexamfetamine is a newish ADD treatment.  After trying Stratera (Atomoxetine), Focalin (Dexmethylphenidate), Concerta (Methylphenidate), Methylin ER (Methylphenidate), and Adderall XR and IR my doctor decided that something new had to be tried.  Stratera was the best I had tried in terms of managing ADD symptoms, but the worst when it came to side effects. Imagine a moderately painful ejaculation without any pleasure or orgasm happening about once a week without notice.  Adderall was a close second, but caused my heart to go at 113 bbm for two months solid, neither was acceptable.  The Ritalins were just worthless, grinding teeth, no concentration, terrible come downs.</p><p>Because the drug was new I was slightly apprehensive.  My doctor gave me a relatively low dose to start with, about 30mg, and told me to come back in a month and tell him what I thought.  It's been a week and I can say right now that it's the best ADD treatment I have ever, I repeat EVER, tried.  It doesn't have a sharp come up like adderall, it doesn't have any kind of terrible trough like ritalin, and my penis doesn't leak like Stratera.  I can compare the effects most to Stratera though, in terms of treatment.  I feel focused and aware of my environment, time is very manageable, and when I start to work on something I can work on it for a while, pause, and then immediately pick back up where I left off.  This is much better than how I am normally (work on something for a while, stop, never start again), and much much better than adderall where I would start to work on something and then be incapable of doing ANYTHING else until it was done.</p><p>That's that for ADD, Vyvanse is just beating it silly.  But that's not ALL that Vyvanse does!  Also like Stratera music, especially mellow music, takes on a totally different side, I feel very emotionally invested in it, even when there are no lyrics at all.  Unlike Stratera, which left me feeling like a bit of a loner, Vyvanse actually makes me seek out social interaction.  I find myself talking with people I would otherwise ignore, and getting very involved in conversation with them.  Social flow will probably diminish as I get used to the effects of the drug, but for now it's a nice bonus.</p><p>As an experiment I took two of the 30mg caps that my doctor prescribed, I didn't actually notice much of a difference.  The effects were probably slightly more noticeable, but not meaningfully more intense.  The real outcome was that the effective life of the drug seemed to be multiplied by about 1.5, longer, but not too long.  Next time I go in to seem my Dr. I will probably try to get a slightly higher dose as Vyvanse seems to kinda run out of steam round 3:30 for me.</p><p>I have tried other ADD treatments and didn't like them, Vyvanse is the one for me.</p>",
 "year": "2008",
 "id": "72063",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-07-30T07:00:00.000Z",
 "views": "18974",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(daily)"
  }
 }
}
