{
 "title": "No Trip Is Worth This",
 "author": "Maureen",
 "citation": " Maureen. \"No Trip Is Worth This: experience with DXM with CPM (ID 72064)\". Erowid.org. Jul 5, 2008. erowid.org/exp/72064",
 "substance": "DXM with CPM",
 "bodyweight": "115 lb",
 "report": "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]</p><p>While it is true that I experienced the hardest trip of my life, it was the most terrifying experience I have ever endured. It began with my entire body becoming numb and my pupils dilated. Over the next hour I began experiencing some disturbing symptoms. My mouth became heavy and I could hardly talk. My eyes crossed over into the center of my head and rolled back. They would quiver and I was nearly blind. I began shaking and my body temperature rose to an extreme, my heartrate was out of control and I was hyperventilating. Whenever I tried to walk I felt unable to understand my surroundings. Most bizarre of all, I thought I became a lizard and I tried to climb the walls, and I became hostile to my boyfriend and friend who tried to stop me.</p><p>Once I calmed down, I experience the sensation of my legs dissolving into sand. By the time it was all over I felt paralyzed. And here I am, three days later, and still suffering the consequences. I am still experiencing blurred vision, speech problems, and confusion. And worst of all I haven't been able to urinate. It wasn't until yesterday that I realized I haven't used the bathroom at all. I drank three glasses of water and in the following couple of hours I finally urinated eight times, but each time I couldn't control it and nearly peed my pants. And each time I felt like I needed to go more but it hurt too badly and so I couldn't. This morning I wet my bed for the first time in FIFTEEN YEARS. I'm sorry, but this is just retarded. No trip is worth this.</p>",
 "year": "2008",
 "id": "72064",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-07-05T07:00:00.000Z",
 "views": "9690",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6 tablets",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 }
}
