{
 "title": "Time to Die",
 "author": "Clenbuterol",
 "citation": " Clenbuterol. \"Time to Die: experience with Clenbuterol HCl (ID 7208)\". Erowid.org. Jun 4, 2001. erowid.org/exp/7208",
 "substance": "Clenbuterol HCl",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "6.5 mg",
   "oral",
   "Clenbuterol",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Ack what a nightmare.</p><p>1 gram Clenbuterol was obtained, later it was measured and dissolved into water to make the proper amount ratio per ml.</p><p>But looky here:</p><p>Some clenbuterol, what seemed to be very little stayed on the tool which was used to move the clenbuterol from one container to another.</p><p>Hey there (I thought in stuper), why dont I taste the remain and see what happens. (Can you think of something more ingeniues?--looking back, it was one of my most stupid and dangerous decisions of my life)</p><p>Apparently an amount of approximately 5 - 8 miligram of clenbuterol was sublingually ingested, possibly more. (normal dose is at the microgram area), for those who dont know Clenbuterol is active at even 100 mcg.</p><p>with the ~5000-8000 mcg that was ingested, some 50-80 times stronger the active dose, some unwanted effects might occur if you plan to live a healthy life, dont mistake where I have.</p><p>T+30: Strange feeling, as if consciousness had changed, but not similiar to anything I ever felt.</p><p>T+1h: Feeling somewhat better than normal (if only I would know what was ahead of me....) Is this clenbuterol i thought?</p><p>T+2h: Heart rate is higher, but not alarming.</p><p>T+3h: Eyes are open wide, and face is feeling stretched, something is building up, and fast.</p><p>T+4h: Eyeballs seem to receive some greenish color besides the normal white... and quite amount of axienty had built up, dizzyness and nausea, but somewhat consciousness enhancement, certainly not a good time.</p><p>T+5h: feeling quite ill, heart begins to speed up, and for the next 24 hours the heart rate stays at a steady alarming 125-135 beats per minute (WHILE LYING DOWN WITH HEAD ON PILLOW), i could hear my heart with my ear as the vains in my head and the entire body are all swallen up and beating, I can feel the blood pumping intensively, and I feel as I am ready to explode.  My girlfriend urges me to get an ambulance, but I disagree, hoping its going to be fine and reassuring her i'm 'okayyyy.'</p><p>My entire body was dancing to the beats of my heart; and it was the worst tune you could ever imagine.</p><p>T+6h: From here on after for the next 18 hours, intense pressure in my head and limbs had built up, eyes got more wide open, and skin more stretched.</p><p>T+12h: It feels as if my heart cant take it anymore as i feel it loosens in some fraile way, and begins to irregularly beat, which is extremely uncomfortable, and quite dangerous.</p><p>T+13h: I get dehydrated rather easily, and my tempeature is 38 degrees celceus.</p><p>T+15h: for the past hour the tempeature has risen +1 degree.  I am now considering the ambulance theory (in my head), as I feel I cant take much more of this.</p><p>T+16h: The pressure in the head is unbearable and keeps on increasing, the pain arises as if the skull pressures the brain and there is a psychological feeling as if brain fluid is frying the brain, from the temperature :)</p><p>T+17h: A cold shower really helped ... ALOT.</p><p>T+19h: Another shower helped.</p><p>T+20h: I'm quite tired and exhusted, but in agonizing head pain fearing taking any sedatives since i dont know what interacts with this and how; i take 750mg Paracetamol.</p><p>T+21h: Feeling a bit better, but still -- headache is anguishing, I am utterly exhusted and afraid to fall asleep, although possibly, i can.</p><p>T+24h: Heart rate down to 120 per minute, and tempeature had decreased by two degrees the past two hours, a nice opportunity to get some sleep</p><p>T+32h: Woke up.... (Thank God, I'm alive!) heart rate is still at a steady 120 beats per minute while lying down #!$#!$#!$!%</p><p>T+42h: heart rate down to a steady 105 beats per minute</p><p>t+70h: 65 beats per minute, lying down.</p><p>For the following week, intense vain, skin, and eye pain was felt, besides the utter exhustion and the sharp pain in the center of the head.</p><p>Thank God, For He saved me from my stupidity :) That only my faith kept me going, thougout this living nightmare.</p><p>There were many side effects during the experience, of pseudohallucenogenic nature: closed and open eye visual effects, very hard stimulation; food was tasteless and meaningless, and would result in vomiting; nothing could be drank besides water, or heartburn would occur, and it did, from drinking Cola, alone.  Increased sweating, and increased resperation, hard amphetamiine-like jitterness which lasted throughout the entire horryfing experience, highly-extremely increased metabolic rate,</p><p>tempeature changes, general change in consciousness, ear popping, and some more things.</p><p>Overall, This was my first experience with this pseudosteroidical</p><p>substance, which i didnt take seriously, and i paid the price, and i'm lucky i'm alive to report it.</p><p>Dont be stupid.  If you cant measure something properly, and or not sure of its potency - DO NOT DO IT: as tempting or curiousing as it may be, you might not be as lucky as I was.</p><p>What a nightmare</p><p>Thank God its over.</p>",
 "year": "1998",
 "id": "7208",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-06-04T07:00:00.000Z",
 "views": "44983",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6.5 mg",
   "administration": "oral",
   "substance": "Clenbuterol",
   "form": "(powder / crystals)"
  }
 ]
}
