{
 "title": "Arthritis Relief",
 "author": "Snarky",
 "citation": " Snarky. \"Arthritis Relief: experience with Kratom (ID 72134)\". Erowid.org. Sep 26, 2008. erowid.org/exp/72134",
 "substance": "Kratom",
 "bodyweight": "115 lb",
 "report": "<p>Two years ago I was diagnosed with moderate Rheumatoid arthritis.  I suffer from severe joint pain and stiffness, crippling fatigue, and occasional bouts of depression.  Since the diagnosis, I have experimented with many substances, both legal and illegal, to combat the pain and mild depression related to the disease.</p><p>In addition to Methotrexate to treat the disease, I began on traditional painkillers (Lortab), to which I quickly (and I mean scarily quickly) became addicted.  After about nine months of a pathetic, non-functioning life, I broke the addiction with the assistance of Suboxone.  I was then able to taper down off the Sub, leaving me narcotic free, but with all the misery back, and fearful of seeking relief.</p><p>Luckily, I have recently discovered Kratom.  I order it online about four ounces at a time.  I simply put about 6 -7 grams of regular ground Kratom leaves in a big coffee cup with a teaspoon of good chai, pour boiling water over it, and steep for about three minutes.  I add honey and drink up.  At first I found it unbearably bitter, but have come to accept the taste as a necessary evil.  I even look forward to it!</p><p>I find decent pain relief and a wonderful mood lift from this brew.  I feel like my old self again; happy and relaxed.  This seems to carry over, and I feel good the next day as well, if not longer!  Occasionally I also get mild euphoria, which is most welcome.  I never feel 'trippy'.  Right after I drink it, I sometimes do some very gentle yoga stretches if I feel up to it, and about 5-10 minutes of meditation.  Then I talk to my husband, watch a favorite movie, whatever I feel like doing that makes me feel good.</p><p>I do have small children, so I do not take Kratom unless they are in bed, and my husband is awake to take care of them in case they get up.  I do not take so much that I feel impaired or unable to help them, but better safe than sorry where little ones are concerned.  One night, my five year old did get up, and came out to the living room where I was lying on the couch (hubby sitting in a chair).  She laid on my chest and we all watched TV together for awhile.  It was beautiful just to hold her, and marvel at the love and connection between us - Kratom amps up my normal 'warm fuzzy' toward my family.</p><p>I drink it three times per week or so.  My husband, who formerly was against pretty much any and all drugs, is totally supportive of my Kratom use.  The relief and happiness it gives me, however transitory, is priceless. </p><p>Prior to Kratom, I tried marijuana for relief, but its' illegality made me uncomfortable, plus the effects aren't very conducive to family life.  I felt paranoid the entire time that the kids would get up or something would happen, so that I was unable to relax and get any good out of the experience.</p><p>I plan to keep my Kratom use at this level if at all possible, never taking it more than three or so times per week.  I can feel that it flips the same switch for me that Lortab did, but in a far gentler, more organic way.  I am still able to function while obtaining some relief.  I thank the earth for this gift, and pray that people use it responsibly.  I worry that too many boneheads will abuse it and end up in the ER, thus eventually causing those who use it responsibly to suffer from the consequence.</p>",
 "year": "2008",
 "id": "72134",
 "gender": "Female",
 "timestamp": "2008-09-26T07:00:00.000Z",
 "views": "18215",
 "dose": [
  {
   "time": "0",
   "amount": "6.5 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  }
 ]
}
