{
 "id": 7216,
 "title": "Low Dose",
 "date": {
  "submission": "2005-07-15T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "metasyn",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "13 mg",
   "administration": "insufflated",
   "substance": "AMT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Last night I had my first AMT experience.  While I am well versed in various psychedelics, I have been relatively clean for a couple years and have recently felt the desire to revisit the realm.  I am lucky enough to have a little AMT I kept from when it was still unscheduled, and even though it was a few years old, it seemed to retain its potentency well.  Since this was much first time in a while, I wanted a relatively low, background dose.",
  "I didn't have much AMT so to make the most of it my friend and I decided to snort 10-15mg at 3:30pm.  We were also somewhat apprehensive about a 20 hour trip and reasoned snorting would shorten the trip at least a little bit.  This stuff burns a bit is is quite unpleasant in the nose for 20-30 minutes afterwards.",
  "Very shortly (whithin a half hour), I start to feel the familiar psychedelic buzz.  A beautiful sense of warmth, mellow energy, alertness, and well being.  I take a shower and the water feels incredible. ",
  "T+3:00 I play music with my band, which both sounds and feels amazing. I am at a solid plus one.",
  "T+5:00 we head to a friend's house for a predominately alcohol-oriented gathering.  I feel fine with this since the trip isn't very intense and I am comfortable with everyone there.  At this stage I feel very empathic, relaxed, and talkative, but all still distincly psychedelic.  Confirming what I've read previously, this feels like a combination of LSD and MDMA, although in my situation, a low dose of each.  Everything is very mellow and easy to take, with a wonderful sense of well-being that I've missed from psychedelics.  I am able to ignore it and concentrate on other things if I desire, but it is clearly there and positively effects my interaction with others all night. ",
  "When I finally go to bed at T+12:00 I am still going strong, having experienced plus one for over 10 hours.  I am tired (from the day and from the trip), and I am able to sleep without much problem.",
  "I wake up at T+18:00 still feeling effects!  I wouldn't even call it a plus one anymore, but it is definitely still there.  The rest of the day gradually blends into normality. ",
  "Being initiated to psychedelics on mushrooms and occasional LSD, I was slightly unprepared for this long of a trip.  However, at this low dose it was easily manageable and pleasant throughout.  I would imagine that at a higher dose the length might begin to grow tiresome."
 ],
 "erowid": {
  "id": "41542",
  "citation": " metasyn. \"Low Dose: experience with AMT (ID 41542)\". Erowid.org. Jul 15, 2005. erowid.org/exp/41542",
  "substance": "AMT",
  "views": "6266"
 }
}
