{
 "title": "Definitely a Worthy Compound",
 "author": "WR",
 "citation": " WR. \"Definitely a Worthy Compound: experience with 2C-D (ID 72200)\". Erowid.org. Sep 22, 2008. erowid.org/exp/72200",
 "substance": "2C-D",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "65 mg",
  "oral",
  "2C-D",
  "(powder / crystals)",
  "",
  "1 repeated",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>This was my first experience taking a higher dosage of 2C-D.  I've had somewhat extensive experience with the 2C-x family of compounds as well several substituted tryptamines and a host of natural entheogenic materials.  My life's focus is the academic pursuit of understanding the phenomena of consciousness, just so you have a little background.</p><p>I'd played around with 2c-d in the lower dose ranges as a cognitive enhancer and once with 2c-e taken at T+1:00 which resulted in a notable increase in the plasticity of the visuals.  The melting and warping typical of 2c-e was exaggerated many times resulting a shimmering sheen of flowing bands of waxy color wafting as if in a breeze.  But, that was a different experience.  This experience was of 2c-d alone.  I had heard it started to get interesting above 50mg and in PiHKAL there is mention of a 100+mg dosage, so I knew the versatility was wide.  The dose I settled with my companion, D, was 65mg HCl.  We also smoked pot intermittently through the night.</p><p>In about forty five minutes, I sensed more 'presence' to my environment, which was in an outdoor garden at about 11:00 at night; it was unseasonably cool for June, being in the low 60's.  The feeling I got was just a closer connection to and awareness of my surroundings, there were no visual changes yet, but I could sense them around the corner.</p><p>I was hoping that because 2c-d's action is shorter, its onset time would be shorter, but this didn't end up being the case.  It wasn't until about two hours after we took it that we could really feel something building and it wasn't until the three hour mark that it was fully developed.  Once it was fully developed, it was an incredibly clean and easy feeling experience.  The visuals were much stronger than expected, but it also left us feeling incredibly clear-headed; little of the confusion and disorientation typical with a stronger trip.  It was also very comfortable on the body.  I had heard 2c-d can be stimulating, but this wasn't the case.  There was nothing in terms of neck, back, jaw, or stomach tension, and I was able to sit comfortably or stand without getting fidgety or feeling restless.</p><p>We spent the entire night (from about 12:00 to 4:00am) talking and laughing; I can't remember what about exactly, but probably the usual topics.  I do remember hitting on the obligatory topic of 2012, the poles shifting, etc, etc; and I try to avoid what I consider to be largely alarmist speculation.  But we didn't dwell on the topic and ended the night with tv.</p><p>This is definitely a worthy compound that I look forward to exploring more.  I will likely go higher with the dose next time because it so comfortable, warm and non-threatening feeling.  </p><p>It seems like 2c-I and 2c-d would make a good combo with each other leading to a highly visual experience that is psychologically non-threatening.  The doses that immediately come to mind would 20mg of 2c-I followed by 30mg of 2c-d an hour later- a short, intense, highly visual experience.  This non-threatening nature of 2c-d makes it distinctly different, IMO, from its close-cousins 2c-e and 2c-p. </p><p>This experience I would rate as a +++ on the Shulgin scale and an A+ on the DOSR scale.</p>",
 "year": "2008",
 "id": "72200",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-22T07:00:00.000Z",
 "views": "9403",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "65 mg",
   "administration": "oral",
   "substance": "2C-D",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
