{
 "id": 7224,
 "title": "Convenient Pleasure",
 "date": {
  "submission": "2005-09-27T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Choops",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "7.0",
    "quantity": "7.0"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "liquid"
  }
 ],
 "report": [
  "Background:  I am very experienced with both legal and illegal substances.  I have recently been looking for a nice legal herb that would bring me great pleasure.  Salvia divinorum was too intense, blue lotus was mearly placebo, and finally I came across kratom.",
  "After reading all the reports I could find, I decided to purchase 50 grams of 'Super Kratom'  My research showed that 6 grams was the dosage for a strong experience.  I mixed 6 grams of the finely ground powder into a malt shake and drank it.  After waiting for nearly two hours for any feeling to kick in, I gave up and went to sleep.  I decided to try a different method.  I put 7 grams of the powder in the bottom of a 6 oz cup.  I then filled the cup with water.  Next, I mixed the kratom and water together with a fork.  I consumed the entire contents of the cup (without heating or filtering) within one minute.  The taste and texture was bearable.  I filled the glass up with water and drank it again to get the remaining powder from the glass.  After 20 minutes I began to feel frequent waves of euphoria.  I felt slighly warm and very happy.  At 30 minutes I felt like doing nothing but lying down and listening to music.  I felt very content and satisfied.  I felt floaty, spacey, yet focused and able to function normally if needed.  I would compare the feeling to a light dose of DXM mixed with Marijuana.  I was able to relax and enjoy the expeirence for about two hours before I was unable to keep my eyes open any longer.  I had very vivid, pleasant dreams, and awoke with a slight headache. ",
  "Conclusion:  Kratom is a very pleasurable and convenient shaman tool. The effects were highly enjoyable."
 ],
 "erowid": {
  "id": "41590",
  "citation": " Choops. \"Convenient Pleasure: experience with Kratom (super kratom) (ID 41590)\". Erowid.org. Sep 27, 2005. erowid.org/exp/41590",
  "substance": "Kratom (super kratom)",
  "views": "6319"
 }
}
