{
 "id": 7225,
 "title": "Thizzing and Rolling",
 "date": {
  "submission": "2008-07-15T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mistress K",
  "gender": "Female",
  "weight": 48
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "rectal",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "500 mg",
   "substance": "Methamphetamine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "To give you a rough idea of how high my tolerance to E and meth is, I've been doing meth on and off for about four years, and I've probably rolled around 20 times in my life, 19 within the past year.",
  "This past week I had gotten half an 8-ball of meth for a nice little 'tweakend,' and my friends took me to this place in the wonderful land of the REAL oc called the Irvine Spectrum, basically a place where all the gay ravers go and suck each other off.  I can say that cause I'm a gay raver. I decided that it would be a good time to test tweaking and rolling at the same time, since Ive heard it produces the best roll of your life. So I BOOTYBUMP (yes that's right, I stick pills up my goddamn ass, give it a rest) a red piranha while thizzing on my 2nd day, and it produced THE MOST intense roll of my life. Honestly, that shit was ALMOST too intense. It was so intense to the point where I began to actually get worried about my health and believed I was actually going to pass on into the afterlife because my body was being overwhelmed by the dopamine and serotonin, and wouldnt be able to handle it. It reminded me of when I got a pill that I believe to have contained way too much 2CT7 and made me freak out and feel like I was on the brink of overdose.",
  "I've always believed ecstasy to be totally mellow and very safe for the body, but when I tweaked and rolled at the same time, I actually kind of felt how harmful the changes are in the brain. The first sign was when I felt my brain melting into liquid, like a puddle waiting to be smoked (haha just kidding, Im not that big of a fiend), and I felt the liquid drip surging from my brain and flowing all throughout my body. I knew I was sort of getting dumber, I've never been that 'e-tarded' before in my LIFE, and my roll was actually so intense I could barely walk or talk.",
  "There began a point where I felt myself actually nodding off because the rush was just going too fast for my body to keep up, and two bright lights, whom I assumed to be angels, began talking to me. They were telling me that it was my time to leave this world, so I was actually getting prepared to leave my body and move on into the next life, until I realized: OH HELL NO, THERE IS NO FUCKING WAY I AM DYING BEFORE APRIL 2ND, I HAVE BEEN LOOKING FORWARD TO THE HOW SWEET IT IS RAVE FOR TOO FUCKING LONG!!!!!!!!!!!!!!!!!!! So I forced myself back to life, I wonder if that's the reason I'm still alive?  How sad is it that a RAVE is what saves my fucking life, just sew my eyes shut and call me a PLUR kid why don't you.",
  "HEALTH CONCERNS: My heart beat super loud and fast when I mixed the two, probably because both extremely raise your blood pressure. I do NOT suggest that anybody who doesnt have a lot of experience with BOTH meth and E try this combination, until they develop more knowledge and tolerance to both drugs. Considering how I felt even with all the tolerance that I've built up from both drugs, I can EASILY see it becoming dangerously overwhelming for somebody."
 ],
 "erowid": {
  "id": "41600",
  "citation": " Mistress K. \"Thizzing and Rolling: experience with MDMA (Ecstasy) & Methamphetamine (ID 41600)\". Erowid.org. Jul 15, 2008. erowid.org/exp/41600",
  "substance": "MDMA (Ecstasy) & Methamphetamine",
  "views": "9019"
 }
}
