{
 "title": "3 Months of Hell",
 "author": "Ala",
 "citation": " Ala. \"3 Months of Hell: experience with DXM with CPM (ID 72273)\". Erowid.org. Dec 17, 2008. erowid.org/exp/72273",
 "substance": "DXM with CPM",
 "bodyweight": "94 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "DXM",
   "(daily)"
  ]
 ],
 "report": "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.] </p><p>It all started in February, where I tried them for the first time. I was hooked.</p><p>I don't really remember what else happened, but I remember around April it got really bad. I was taking 8-11 pills everyday, second period in school. At the end, I would always run into the bathroom and puke out the pink shit in triple c's. I just kept doing them and doing them, almost every other day, and it almost ruined my life. I went from fairly average grades, to getting D's and F's in almost every class. I just didn't care anymore.</p><p>One day I skipped school with my friend, and took 14 pills. I was trippin balls, and we got back to my house around 10 am. Soon after that, I got texts from everyone saying I was fucked and I had to come back to school. In panic, me and my friend hitched a ride with my cleaning lady and went back to school. We had a long, which seemed almost forever talk with my principal, while trippin. It was actually only an hour, but it seemed like 3. After that, I got sent home early and that was that.</p><p>The next day, my other friend took 8 pills and was carted out of school in a hospital stretcher. Unfortunantly, I had a sheet of triple c's on me and got searched, getting suspended for 10 days. My life hasn't really been the same anymore. I got sent to drug counseling, not a stay in rehab, but 3 days a week for 3 hours.</p><p>I haven't touched triple c's since May 28th, but Ive had to suffer the consequences. My memory is almost shot, every time someone tells me something, most of the time I forget it 20 minutes later. I repeat things or stories over and over again to my friends, because I dont realize that Ive already told them. Theres something wrong with my heart, yet I still need to figure out whats up with it.</p><p>When I ask my friends what I was like when I went through my heavy usage, they said 'You looked pale, you didnt look like you were there, you looked dead.' And I just remember feeling dead, all the time. Triple c's arent something you should be playing with, I lost almost everything, I had to appeal 2 credits, I almost flunked freshman year because I skipped every day. I just lost my ability to care. Triple c's were always on my mind.</p><p>Its been 2 months since Ive touched them, but I still think about them every day, and I still miss the way they used to make me feel. I can say I was addicted, and still am. But I know if I started again, Id just go right back down the same path I did before.</p>",
 "year": "2008",
 "id": "72273",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-12-17T08:00:00.000Z",
 "views": "16539",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "DXM",
   "form": "(daily)"
  }
 ]
}
