{
 "id": 7228,
 "title": "Shrimp and Nothingness",
 "date": {
  "submission": "2007-07-17T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Salvia Warrior",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "Background: Ive smoked salvia and its extracts before and gotten their full effects. I've done other hallucinagins before, experienced LSD, Mushrooms, DXM. I've smoked cannabis for years, done ecstacy, smoked opium, drank alcohol. I dont take any perscription drugs, antidepressents or anything like that.",
  "Setting and Mindset: Outside of a concert, my friends band just played. Feeling very good, good night of rockabilly and hanging out.",
  "This was definatley the most interesting thing that has ever happened to me on salvia, or any drug for that matter. I had ordered salvia off of my normal site I order it off of, but this time I decided to go for the 20x extract. The site said it was for experienced salvia users only, and considering I had done salvia many times before, everything from the leaves to 15x extract, I felt I was ready. I had gotten the stuff a few days earlier, but had no chance to do it. So I decided to bring it to my friend's concert. After he played, he was really tired and did want to have his first salvia trip that night. So I just grabbed my friend, J I'll call him, and went out to his car to smoke this shit. I had my bong out there, butane lighter, we were ready to go.",
  "I packed a bowl of the sticky like extract into the bong, the normal amount of the 10 or 15x I'd normally put in. Now I must note that J had never done or seen anyone do salvia before, so he had no idea what to expect. I guess I probably should have warned him, oops. I lit the butane lighter and began to suck in the smoke from the bong till it was all gone. I held it in and waited for that familliar feeling of complete meditation and thought that salvia had always brought upon me. I held the smoke in for the normal apprx 30 seconds, and right when I was about to exhale, something that had never happend before on salvia did. I began to HYSTERICALLY laugh. It was uncontrollable. There was nothing funny at all, yet I couldnt have stopped laughing if somebody put a gun to my head. The laughter has come to me every time I've done salvia since this experience.",
  "I lost any touch whatsoever with my normal reality. I didn't know if I had stopped laughing, but it didn't matter. My feild of vision became lego like. Everything appeared to have been make of blocks. Then the strange part happens. After about probably 1 minute, although it could have been years for all I know, of the lego vision, everything abruptly faded away. My vision just went to black. I thought for a moment, could this be the end? But no, something happened.",
  "I began to see a red line, and like a movie, the line began to move towards me, and then turn onto its side. What it revealed when it turned over, it was not god, not eternal wisdom, relaxation, knowledge or anything. I saw shrimp. A really big plate of shrimp?!?!? I had no idea what to do. Anything remotely close to this had happened before. I thought I had gone crazy. I thought my mind had just fried up and gone away. I was, for a few moments, absolutely and utterly terrified. This was insane. But just as abruptly as it started, the experience stopped. I could all the sudden see the car again, the outside, and J staring at me like I was crazy. There were a few people outside the parked car staring in at us as well.",
  "According to J, what happend went as follows: I took a really big hit of the extract and held it in for about 30 seconds. I then began to uncontrolably laugh and spit every where. This laughing excaladed into about a minute of terrified screaming. When the screaming stopped, I guess I had pushed the seat of the car back till it was flat and curled up into a ball and just mumbled to myself for about 2 minutes. J says the whole thing was about 5 or 6 minutes long."
 ],
 "erowid": {
  "id": "41618",
  "citation": " Salvia Warrior. \"Shrimp and Nothingness: experience with Salvia divinorum (20x extract) (ID 41618)\". Erowid.org. Jul 17, 2007. erowid.org/exp/41618",
  "substance": "Salvia divinorum (20x extract)",
  "views": "4034"
 }
}
