{
 "id": 7230,
 "title": "Happy Erotic Antidepressant",
 "date": {
  "submission": "2005-09-08T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Kazzybear",
  "gender": "Male",
  "weight": "205 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "5-MeO-MIPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "5-MeO-MIPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "This report is not about a specific experience, but more of a documentation of what this drug does to my mind, body and spirit. I do not prefer large doses of any psychedelic...I'd much rather do a litte bump and calm my thought processes and get to a nice place rather than solely use a drug to forcefully propel me (hopefully) to a nice space. With that said, I've have had 100's of psychedelic experiences with every drug available and this one is one of the best...and here's why.",
  "MIND:A quality of 'sheen' slowly comes over me...things in the external world are seen with soft lively glow...things become clearer and with more color....the space between me and another diminishes....faces and bodies take on surreal appearance...nobody appears ugly....conceptual thinking and fantasy becomes expanded...I notice I get what I give, a smile will speak volumes... I notice every moment is an interaction between real beings.. I and another or I and myself...time slows allowing the world to appear manageable. Moxy can help make my place in life a little more meaningful...BUT IT GOES AWAY...",
  "BODY: There is a particular vibration in the body... Ifeel it in all the muscles...a pumped up warm internal glow eminating outward from the inside....and oh my god the eroticism and fantasy with this chemical is...well OH MY GOD!...nothing comes close in this department. Comedown is gradual..Moxy can bring meaning to what my body can feel and pleasure to others...BUT IT GOES AWAY...",
  "SPIRIT: If the other two selves aren't allowed to dominate, the spirit has the opportunity to soar...this can be seen through the small things I notice that I normally don't notice...clouds...holding a door open...a smile back...Moxy may help bring my blue sky back...BUT IT GOES AWAY.....",
  "After ending up in the hospital for 3 days with my heart rate at 160 BPM...I may not want to use this moxy (and others..esp. Phenethylamines) every day or at high doses. I purposely did not compare this chem to other chems because that has no meaning for others. This tool to me has been useful...but it will eventually also need to go away...take care with you..."
 ],
 "erowid": {
  "id": "41620",
  "citation": " Kazzybear. \"Happy Erotic Antidepressant: experience with 5-MeO-MIPT (ID 41620)\". Erowid.org. Sep 8, 2005. erowid.org/exp/41620",
  "substance": "5-MeO-MIPT",
  "views": "17196"
 }
}
