{
 "id": 7231,
 "title": "My First Divine Time",
 "date": {
  "submission": "2008-07-15T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bilbo Baggins",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "tablet"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "My friend had told me that he was going to turn 21, and he had wanted to make it a special occasion. He had asked if I had ever taken ecstasy before and I told him that I haven't but it was one of the things that I have always been curious about.  So the following weekend, I would venture on the ride of my life.",
  "It had all began when my friend had come into town around 4:00 pm. Only one other time have I seen these 'magical' pills that I've heard of, that can do so much for you physically.  So a quick nap for the both of us before we decided to get the party started. Around 8:00 pm, another friend had come over to join in on the party as well. So a little before 9:00, we had swallowed one pill each, and anxious as I was, I didn't know what to expect. About 15 minutes later I had started to feel what I thought was gonna be all that it was, which was a warm, but subtle feeling throughout my body, nothing to go screaming about. When I think about ecstasy, I think about raves, and how much dancing and how good the music would sound, and at that moment, it didn't live up to the rumors. So about an hour passes, and I start dancing a little bit. Then all of a sudden the biggest rush of adrenaline filled with positive energy fills my entire body within seconds. Then all I could do is put a big smile on my face, and keep on dancing, by this time my other friends have already let it hit them, and they were rolling nicely. So as the night progressed, we had listened to many trance cd's and had talked about endless topics that never seemed to get old.",
  "Then as a lightbulb appeared above my head, I had suggested to go to the strip club about half an hour away.  It seemed that they were more intrigued with this idea than I was.  So we would then soon head off the land of dancing naked women. Before this trip was made, we were notified that one of my friend's friends from a different state had come down and wanted to hang out for a while before they had to depart.",
  "So a few bowls of cannabis later, we were gonna go venture on into our trip we had decided a couple of hours ago.  By this time our roll was slowing down a little bit, so we had decided to take another pill. Before we had left my friend that had come up earlier, had left the keys in the car with the car running, I guess mdma really does make you forget your short term memory (haha). So we were delayed as we had to wait about 45 minutes for the locksmith to come.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "So finally after hours upon hours, which seemed like an eternity, but in a good way, we were finally off to what we had started a while back.  So on the way there, I had blasted the good old trance and was listening away. I think this could actually become a new hobbie to listen to music, talking up a storm, and driving all at the same time.  This seemed to be such an enjoyable experience to do all three at once, at that time I really couldn't ask for anything more. ",
  "As we got there we had to pay alot to get in, but it was all worth it. We all seemed to enjoy it quite considerably.  We all got our lap dances, and then by that time the club was closing. So we had almost ended the night around 4:00 am or so. When we had came back we spent the rest of the morning talking, without getting any sleep. I know that my body needed sleep, but I know that my mind was elsewhere, and didn't really care to. ",
  "So as my first experience of taking ecstasy, it seemed more than I had ever imagined. Now it's been over a month and a half since then, very soon, I'm planning on doing it again."
 ],
 "erowid": {
  "id": "41622",
  "citation": " Bilbo Baggins. \"My First Divine Time: experience with MDMA & Cannabis (ID 41622)\". Erowid.org. Jul 15, 2008. erowid.org/exp/41622",
  "substance": "MDMA & Cannabis",
  "views": "3155"
 }
}
