{
 "title": "A Nice Warm Saturday Night",
 "author": "LSDelicious",
 "citation": " LSDelicious. \"A Nice Warm Saturday Night: experience with DXM (ID 7243)\". Erowid.org. Jan 28, 2003. erowid.org/exp/7243",
 "substance": "DXM",
 "bodyweight": "225 lb",
 "report": "<p>Set: Nice warm Saturday Night. A rainstorm had just passed and the sun was coming back out.</p><p>Mindset: Experienced with Pyschoactive chemicals of many varities. Had tried DXM twice. This was to be my highest dose yet. I made sure there was nothing to worry about, I had nothing to do for the night, I had the house to myself, and I had some good music to listen to.</p><p>Experience: Around 5:30 I drove to the local drug store and tried to find some cough syrup containing only DXM. I couldn't find any and was almost ready to go when I spotted Robitussin Maximum Strength. I Bought two bottles and went home.</p><p>I began drinking the first bottle at about 6:00. The method I used was hold my nose, take a huge drink, drink an entire glass of water, then let go of my nose. This was a good method and I finished the bottle in about 3 gulps. Then I drank the second bottle the same way. I immediately felt nauseous and just sat on the ground and it was passed in about two minutes.</p><p>Now I decided to take a relaxing bath while the effects came on. I exited the bathtub at 7:05. By this time even the slightest light grabbed my attention. When I looked at lights they all fracteled and I chase beams of light with my mind for a while. I made my way outside and it was like I was flying. I would look down and I could see the ground, but my brain couldn't process the infomation.</p><p>One of my friends then called and it was very hard to understand what he was saying and I could barely talk to him. I felt as though I had gained enormous insights into a world that exists just outside of ours. A mental world where thoughts lived and the body had no business being there. It was at this point I left my body completely for the rest of the night. I existed only in my mind.</p><p>I experienced astral projection and put my mind into my dog and looked back at myself. It was here the OEV's started really kicking in. I was listening to music and I saw my computer desk would lift up in the air and vibrate to each bass note. When my computer desk returned to the floor something else would rise to the air and the curtians would envelop everything.</p><p>Everything in my field of vision was extremely small and 2D. The neck on my guitar looked about 1' long. I closed my eyes and opened them but this didn't change. There was a feeling of being taller than everything else and looking down on objects that were clearly bigger than me.</p><p>An intresting note: I didn't have any physical side effects like people talk about such as itching or nausea. I really felt wonderful during the trip.</p><p>At around 8:45 my mom called and said she would be home early in about an hour! I knew I wouldn't be straight by then and there was no way I could act remotely straight. If she saw me she would see a lunatic. I started to get really nervous and forced myself to throw up to try to abort the trip. It didn't happen.</p><p>My mom never came home. I found out later that she had actually said she wouldn't be home until 5 o'clock the next day. I stopped worrying about her coming home about 10:30 and enjoyed the rest of the trip until I fell asleep at 12:00.</p><p>The next morning I woke up feeling dreamy and the walls were breathing a little. I didn't feel sick the next day, in fact I ate a larger breakfast than usual and it tasted like an orgasm feels:) I felt a little tired but I felt as though I had been reborn and even today I look at things completely different. I have a greater appreciation for everything and I enjoy things much more. I can also tap back into the world just beyond our vision if I concentrate. I also have a deep spiritual bond with my dog. Before this experience I was a hardcore atheist, but now I'm open to a spiritual world.</p><p>I have heard a lot of horror stories about this chemical so I'm not gonna reccomend it. Try it at low doses and see if it's for you  before you journey too far. I just feel I'm one of the lucky people that has had a wonderful experience with this chemical.</p>",
 "year": "2003",
 "id": "7243",
 "gender": "Not Specified",
 "timestamp": "2003-01-28T08:00:00.000Z",
 "views": "7132",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "754 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 }
}
