{
 "title": "Sadly, I Ignored Precautions",
 "author": "Psilocybe_420",
 "citation": " Psilocybe_420. \"Sadly, I Ignored Precautions: experience with Morning Glory (Heavenly Blue) (ID 7244)\". Erowid.org. Feb 10, 2003. erowid.org/exp/7244",
 "substance": "Morning Glory (Heavenly Blue)",
 "bodyweight": "160 lb",
 "report": "<p>I ignored several precautions that should be taken when preparing the seeds for ingestion.</p><p>My trip took place several weeks ago, but it is still vivid in my mind, both the good and the bad. The whole trip was not really planned out, it just happened.</p><p>I was with my friends, who Ill call T, R, and S, at S's house. We were bored outta our skulls, until I mentioned that we could all fry if we wanted to.</p><p>Well, to make a long, boring story short, we ended up driving over to K-mart and stealing 21 packs of Martha Stewarts Morning Glory seeds of the Heavenly Blue variety. We then returned to S's house, and I emptied 6 of the packets into a spaghetti strainer thing, lined with a paper towel so that the seeds would not slip through. I only rinsed them briefly in warm water, a mistake that I would later regret. Then, I placed the seeds into a blender, and made myself a kind of chunky smoothie. I quickly gulped it down, (very good, but the seeds were not very well chopped!) and then sat down to await the trip.</p><p>I had done real LSD one time prior to this, so I thought that I knew what to expect. Sadly, I was poorly prepared for what I experienced over the next several hours.</p><p>After consuming the milk shake, I sat down and tried to focus on the high that I expected to get. But, to my great alarm, all that I was getting was a VERY uncomfortable nausea. To relieve this, and also as an attempt to make the seeds kick in more quickly, my friend T gave me a bowl of fairly good herb, which did calm my stomach.</p><p>After I finished the bowl, T and R began inquiring whether or not I felt anything. I couldnt really concentrate on them though, because the carpet was just so damn interesting to look at. There were thousands of patterns in it, that only now had I began to notice. Then, I briefly listened to what they were laughing about, and quickly caught on that I had not eaten 6 packs of the seeds, but had in fact ingested a significant amount more.</p><p>While I wasnt watching, they had slipped in another 8 packs of the seeds, without washing them or anything. It was then that I became frightened, since I remembered from other articles that the seeds shells may have poison on them. I became petrified. I was afraid that I was going to die from poisoning. Also, I wasnt totally confident that I could handle that much LSA, since I remember from somewhere that 10 grams of the seed was equivalent to 4 hits of acid. I became more frightened by the moment, despite their efforts to calm me. Eventually they had me convinced that they didnt really put in all those extra packs, so I calmed down a bit.</p><p>About two hours after eating the seeds I had wandered (I dont remember what happened between hour one and 2) over to the coffee roasting club, which is one of the stoner haunts in my town. While there, a friend of mine approached me, and asked if I could get some bud for him. Agreeing that I could, I half-walked half-stumbled (I was very nauseous by this point) over towards my hookups house with 3 of my friends, and left them at the corner.</p><p>I was hailed over by this Mexican gangster guy that I only vaguely know, who immediately started to fuck around with me. At that point, my pupils were quite dilated and he eventually stopped, and I continued to my hookup, and purchased a twamp of chronic. My friends and I then smoked several bowls, which immediately escalated my trip to a peak that lasted for the next several hours.</p><p>After leaving my friends, I walked back towards S's house, and was elated by the visuals and, well, feelings I guess, that I was experiencing.</p><p>As I was walking down the street, (the sidewalk was too narrow a surface for me to remain on) I felt that I was walking IN the asphalt. I dont know how else to put it. I felt as though only my head was above the surface of the street. I could feel my chin bump on the rough surface of the road, and when I lifted my foot to walk, my neck was above too. Finding this to be the most amusing thing ever, I began to snicker uncontrollably to myself. An elderly couple across the street in their garage looked at me suspiciously and pointed, so I stopped and glared at them for what seemed like a minute, but was in reality only about 10 seconds. When they looked away, I laughed again, for no real reason, and then I continued on towards S's house, and was let inside.</p><p>When I got inside, the first thing that I did was go to a mirror, I wanted to see just how dilated my pupils were. I was astounded. They were completely dilated. My pupils filled the entire colored part of my eyes, leaving only a thin crescent of green on the outermost edge.</p><p>T and S were the only ones there at this point, R left to go I dont know where. Upon seeing my pupils, the both looked at each other, and laughed uncontrollably. (I forgot to mention this earlier. I ate the seed around 2:30 PM, it was now about 7:00 ) I followed them into the living room, and sat on the couch, and immediately began to complain that I was sinking. Soon, I was frantic with the sinking sensation that I was feeling, which amused T and S considerably.</p><p>After about twenty minutes, (shit, maybe more I dont totally remember) I got up and sat down on a chair next to a glass table. On this table, were some smudgy finger prints, that I found were incredibly fascinating. I bent down to inspect them more closely, and immediately bonked my head on the glass. I jerked my head up, bewildered. Then, I noticed the finger prints again, and once again tried to get a closer look at them. I quickly discovered, (like 20 minutes and 60 head hits on the table later, but it seemed quick) that I had no depth perception. This spectacle was watched by both T and S, who couldnt figure out what the hell I was doing. Then, when I told them (about halfway through) they looked at each other, and tried to stifle their laughter. After realizing that all I was going to accomplish through trying to look at the fingerprints was bonk my head, I gave up and looked around for something else to discover.</p><p>The first thing that I noticed was that it was 8:10 and I was supposed to be home in 20 minutes. Saying goodbye to my friends, (they offered me a ride but I declined, preferring to walk home and look at everything) I walked home, and was disappointed when I noticed nothing that was worth observing, until I reached my street.</p><p>As I walked down my street, I noticed some of my friends standing around in J's (my neighbor across the street) driveway. I walked over to them, eager to see them, for what reason, I do not know. When I got over there, the only person that I recognized was J, so I said whats up, and told them I was frying balls. Upon hearing this, another person said whatsup to me. I reeled around and faced him, but in the darkness, I didnt recognize him. I demanded to know who he was and how he knew me. He responded by telling me he was C from my school, but I didnt believe him. So, for the next minute or so, I closely examined him from several different angles, namely the side of his head from about 6 inches away. I was finally convinced that he was who he said he was, when my Dad hollered at me from across the street.</p><p>In response to his calls, I walked across the street, received the necessary lecture from him for being 10 minutes late, and retired to my room for the duration of my trip. I lay down on my bed, with the lights on, and began to stare into my open closet. Almost immediately, all the shirts which were hung in it, melted. It was as if they were, dripping onto the carpet, and, when they had all puddled there, regrouped themselves and re-hung themselves. For about half an hour, I watched this amusing spectacle, but then, My stomach began to churn again, and I decided it best to sleep. But before I could go to sleep, I started to worry about the poison that may have been on the seeds. I quickly turned my thoughts away from that, and drifted off to sleep.</p><p>The next day when I awoke, I was in a terrible amount of pain, which I would describe as being very similar to gas pains, only they came from my stomach. For the next hour, I worried about the poisoning, and then went into the bathroom and vomited up the remains of the morning glory seeds. It was very uncomfortable, as there was almost no liquid in my stomach at the time, so it was like throwing up solids. I regained some of my strength afterward, and for the rest of the day was in a great deal of discomfort.</p>",
 "year": "2001",
 "id": "7244",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-02-10T08:00:00.000Z",
 "views": "21073",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
