{
 "id": 7250,
 "title": "Through the Portal",
 "date": {
  "submission": "2007-12-29T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Ak105",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "A little background.  I have wanted to try Salvia for quite some time.  I was very interested in these powerful experiences I had been hearing about, and not doubting the magical herb, managed to get my hands on some.",
  "I purchase around .75gm from a friend and saved it until later that night.  The friend who would be joining me on this trip this evening would be my friend who I'll call 'K'.  A few nights before, we had experimented with Salvia for the first time.  I had had a somewhat defined trip, but I was looking to have more of a satisfying trip.  At first we were somewhat sketched out about our setting.  We were at a campfire halfway up a mountain in the darkness.  Knowing very well that the darkness is the key to a full blown trip, we walked up the road about 200 yards from the fire.  It was considerably dark and we found a spot that looked suitable. ",
  "K was the first to go.  He layed down and I put about a small pinch of the 20x into a glass pipe and handed it to him.  He took the hit and handed me the piece and layed back onto the grass.  After around 30 seconds he blew out his hit.  Nothing unusual happened while he layed on the ground, just the occasional hand movement.  Then he snapped out of the deep salvia trance and got up.  He started walking around flailing his arms and walking very goofy.  After he came down, he told me when he was flailing his arms and walking strangely, he actually thought that he was floating.",
  "I was the next to go.  I was in a great mindset, however I got a bit nervous before takeoff because I did not want to have an overly intense experience.  I layed down in the exact place as my friend and put about the same amount of salvia into the glass pipe as I had done for which I'll remind you, is not that much!.",
  "I took the pipe and inhaled a decent hit and held it deep in my lungs for what I thought was 25-30 seconds.  I was unsure if I had taken too little.  I closed my eyes and put my hat over my eyes to make it even darker. I then noticed patterns and swirls forming in my closed eye vision.  This happens on the start of every salvia trip.  The patterns start and then turn into a spiral, or a 'portal'.",
  "Now, it's not always easy to gain access into the portal.  Setting, mindset, and deffinitely how long I hold my hit all contribute to the experience.  If any of these are flawed, I will normally just see subtle patterns and usually try again.  However, if everything is good, the portal starts spinning and I will start traveling into and through the portal.",
  "On this particular experience, I did breakthrough.  I entered the portal and things started traveling very fastly.  Then I broke out into the salviaverse.  The inside of the hat was truly another universe.  When part of my face would touch the inside of the hat, it was such a strange sensation.  It was like a vibrating warmth almost.  I was touching the outskirts of the salvia world.",
  "Shortly after, I went from laying on the ground, to being behind, or under it.  I was behind the mountain wall.  Everything behind the wall was blue.  Just a endless blue like if I were to look into the sky.  The best way I can describe this, is glitching.  In video games when you get behind the structures and you can see out of them, but people cannot see it.  Then I went to being half and half in the mountain wall.  The left half of my body was protruding out, into the real world, while my right half was still engulfed in the endless blue salviaverse.  I then left the universe and this is where I awoke from my trance.  I immediately got up and looked around frantically.  I could vaguely remember where I was and who I was, but I had no recollection of what I had taken.  I kept saying to K, 'What did I take?!'",
  "When I came out of the salviaverse, The hat I was wearing had a blue forcefield that protruded straight ahead and straight behind me.  It would always be perpendicular with my hat.  It devided straight down my body and then straight forward and behind.  This continued for a couple minutes until it dissappeared.",
  "I couldn't grasp the fact I had been behind the wall.  I looked back to where I had been laying and it looked very dark, and almost had a swirl to it.  I was still very much influenced by the Salvia at this point.  I made my way over to where I had been laying and started looking for the way into the wall.  I kept saying 'What is this?!?! What is all this!?!?'  I was moving rocks and was trying to find some possible way of enterance back into the wall. ",
  "After I had come down, and returned to baseline, me and K conversed about the experiences.  When I first come out of a salvia trip it's impossible to speak.  It's like trying to recollect and say everything I saw and experienced at the same time.",
  "Overall, this was a very productive experience.  I'm glad I got the chance to experience salvia in the way I did.  I was amazed that it was as powerful as I had read."
 ],
 "erowid": {
  "id": "41719",
  "citation": " Ak105. \"Through the Portal: experience with Salvia divinorum (20x extract) (ID 41719)\". Erowid.org. Dec 29, 2007. erowid.org/exp/41719",
  "substance": "Salvia divinorum (20x extract)",
  "views": "3402"
 }
}
