{
 "title": "Mitsubishi Makes This Too?",
 "author": "Selekta",
 "citation": " Selekta. \"Mitsubishi Makes This Too?: experience with Unknown ('mCPP') & Salvia divinorum (ID 72603)\". Erowid.org. Jan 25, 2009. erowid.org/exp/72603",
 "substance": "Unknown ('mCPP') & Salvia divinorum",
 "bodyweight": "50 kg",
 "header": [
  "DOSE:",
  "1 tablet",
  "sublingual",
  "Unknown",
  "",
  "0.5 bowls",
  "smoked",
  "Salvia divinorum",
  "",
  "1 ",
  "smoked",
  "Tobacco - Cigarettes"
 ],
 "report": "<p>I'm a psychonaut in my twenties from Europe. I've experimented with a wide range of psychoactive substances within the last 4 years on a semi-regular basis. The most notable drugs I've tried - regarding this report - are MDMA, MDA, BZP/TFMPP and Amphetamines.</p><p>[the following part of the report was written a bit less than nine hours after ingesting the substance]</p><p>I was coming home from an oldskool jungle party. The night had involved quite a bit of drinking and dancing so I was rather tired when I got off the train. I was initially planning to go straight to bed but for reasons unknown I phoned my neighbor (lets just call him 'M'). He invited me over to a house party near the train station and I chose to accept his invitation.</p><p>At the door I was greeted by a happy dude who was bleeding a bit from his forehead but told me he was okay before I had a chance to ask. M told me they had been snorting ecstasy all night and judging by the looks of people I didn't really need to doubt it.</p><p>I'm not a great fan of snorting drugs which are also orally active so I decided to ingest the small white pill sublingually. The pill melted and crumbled quite rapidly in my mouth and didn't taste too good either so I ended up crushing it with my teeth and swallowing it fast to get rid of the unpleasant taste.</p><p>The rush began within 15 minutes after ingesting the pill. I felt a bit overwhelmed by it and all I wanted to do was to slouch on the sofa with my eyes closed. After another fifteen minutes as it peaked I was feeling a lot more sociable than usual. I asked M if he'd like to come to my place to smoke some salvia. M thought it would be a good idea so we left the party.</p><p>As we got to our apartments he decided to go sleep instead. I didn't really mind as at this point I had realized that the pill didn't really contain MDMA but something else instead and I thought it might be a good idea to reflect on the effects without other people around.</p><p>At about t+1:00 I was feeling very good although a bit nauseous. The nausea went away as I ate a tiny piece of bread and drank a bottle of energy drink. I decided to smoke a bowl of salvia leaf.</p><p>I had smoked this particular batch of salvia before with effects ranging from none to just slightly hallucinogenic but nowhere near as the usual mindfuck resulting of smoking some 10x extract. I managed to smoke half of the bowl on one inhalation but couldn't smoke the rest of it as I was sent to the ninth dimension (+++ on the Shulgin Rating Scale) without ever expecting it happen on a single toke of regular salvia.</p><p>The next 10 minutes I felt as the music I was listening 'wanted' me to change it constantly. I got quite nervous at this point being in a very disassociative state. I rolled on my bed and my couch for a while before beginning to realize what was actually going on in the reality we know. Getting some of my sanity back almost immediately calmed me down and I managed to get to my balcony (not necessarily the smartest move while still on salvia, I admit) to smoke a cigarette.</p><p>I'm not sure about whether the drastically increased effects of salvia had something to do with the adulterated ecstasy I had ingested but I'm not willing to experiment further without a trip sitter.</p><p>I did some research on the internet about the possible ingredients of the pill and became quite certain I had ingested mcPP instead of MDMA.</p><p>At about t+5:00 the peak of the mcPP had tapered off quite a bit but I still had the distinct piperazine-specific feeling of being cold and warm at the same time. Rolling in bed while listening to some chilled out music felt very satisfying. I also noticed an increase in tactile sensations.</p><p>It's now t+8:30 and I doubt I could sleep yet. I'm quite sure I could eat a light meal if I wanted to which is almost never possible for me while on MDMA. I haven't had the headache mentioned on many online reports regarding mcPP, but I guess I still got a few hours left to wait for it...</p><p>[summary written a day after the experience]</p><p>Overall I have a positive feeling of my first experience with mCPP. A more appropriate setting (not as tired and not after 3 hours of dancing and drinking) and knowing it was mCPP beforehand would've probably made it more enjoyable though. Compared to MDMA, mCPP was less euphoric and a bit more psychedelic.</p><p>I think it's worth mentioning I had hadn't eaten anything but a light lunch during the whole day. I also had discontinued using Citalopram (10g per day) five weeks prior the experience.</p>",
 "year": "2008",
 "id": "72603",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-01-25T08:00:00.000Z",
 "views": "6154",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "sublingual",
   "substance": "Unknown"
  },
  "1": {
   "time": "",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum"
  },
  "2": {
   "time": "",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  }
 }
}
