{
 "title": "Hallucinating But Not Tripping (HPPD)",
 "author": "TooLate",
 "citation": " TooLate. \"Hallucinating But Not Tripping (HPPD): experience with LSD & Various (ID 72627)\". Erowid.org. Jul 29, 2008. erowid.org/exp/72627",
 "substance": "LSD & Various",
 "bodyweight": "210 lb",
 "report": "<p>I should probably start by stating that I have read many reports of people experiencing HPPD after having used LSD only one time.  I am not certain how many times it took for me to develop HPPD, nor am I certain if it was LSD.  From age 15 to 23, I was a psychonaut - a proud psychonaught.  I have eaten more acid than I could every count, but far more than 100 trips.  I have taken AMT countless times.  MDMA was one of my favorite substances.  And of course I was a pothead for the entire time, smoking pounds of cannabis over the years. </p><p>Over the last 2 years, with the last 6 months excluded, I really started getting into LSD.  I would take it almost weekly if it were available, with gradually increasing dosages.  I must admit that I first noticed some of the HPPD effects back then, but believed them to be effects which were short lived and which would go away once I stopped using.</p><p>After eating about 15 hits one night, I finally had the 'bad trip' - truly an experience from Hell which I do not feel comfortable enough talking about even to this day.  For that is not the purpose of this submission.  The trip got me off drugs, which I am somewhat grateful for.</p><p>The thing is, the visuals never stopped.  Text would move slightly, I can still read, but I have to blink continually to stay focused.  Faces morph - slightly, but noticeably.  There are halos around objects.  And occasionaly I see white spots which move slowly in every conceivable dimension.  I have heard many people say that they experience such an effect at night.  Almost all of my visuals come in during the day, with full daylight.</p><p>My vision is whack.  And it was been 6 months since I have touched any psychedelic, and weeks since I have smoked weed.  Until recently, I would have said it was worth it.  But I am not so sure anymore.  It may be hard to understand, but I have read that many people forget that their vision was ever normal.  I understand that thought.  I think what really turned me on to the fact that I was not seeing normal was when I tripped with an old friend some months ago.  He pointed out that his vision had not yet returned to normal, that he was still seeing color spots and some shifting of images. He also was understandably amazed by the visual element of the trip.  I was not, and looking back, I think the first real obvious sign that I was suffering from HPPD is when a low amount of psychedelics did not really make me hallucinate even though my friends were.  It may be that I was hallucinating, just not more so than normal.  I sort of habituated to the vision issues.  But I remember the first time I hallucinated I could not believe that stationary items could move.  And geometric patterns on walls which bore a solid color were intriguing and awesome.  At this point, I think it would be awesome to just see a damned wall.</p><p>But I do want to point something out for all those who suffer from HHPD.  I do not think its right to say we are always tripping.  Tripping is a state of mind which involves hallucinating.  I am not tripping.  I can think and act normally.  I do not have insanely intense random thoughts and I am able to concentrate.  I do not have escapes from reality where I cannot tell what is real.  I do not think of HPPD as a flashback because I never feel like I am tripping, but I am continually 24/7 hallucinating - albeit slightly - similar to the effects of a mild acid trip.  But I do have a significant visual impairment.  And I am only 24.  I of course wonder if it gets worse or better over time, but I am too young to know that personally.</p>",
 "year": "2008",
 "id": "72627",
 "gender": "Male",
 "timestamp": "2008-07-29T07:00:00.000Z",
 "views": "20862",
 "dose": []
}
