{
 "title": "Gathering of Mad Hatters",
 "author": "Mr. Punch",
 "citation": " Mr. Punch. \"Gathering of Mad Hatters: experience with Mushrooms (ID 7262)\". Erowid.org. Feb 10, 2003. erowid.org/exp/7262",
 "substance": "Mushrooms",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1.77 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>I distinctly remember that, before actually ingesting the shrooms, my friend G said 'There's nothing like shrooms; they stand on their own'. After my first time... I can agree.</p><p>It was me and three friends. We all ingested the shrooms at about 6pm (right after I got home from work). S and G and I took the shrooms one at a time (there were about three, plus two stems) and chased them down with juice (they taste like crap). My other friend C, however, stuffed them into his mouth and swallowed. We glanced at him and he said 'Should I not have done that?' ... in retrospect, no he shouldn't have. I'm not going to say this experience was a bad trip... just one that made me realize just how intense my friends are and how intense my mind is. Cool.</p><p>My first mistake was the pot. We smoked a lot of pot before the effects of the shrooms kicked in. This was bad for me, because my state of mind wasn't what I wanted it to be when I tripped. I'm very susceptable to the paranoia that pot causes. Under normal conditions, I remind myself that it's all in my head and I usually deal with it, no problem. On shrooms, however... that paranoia is elevated 100 fold. Very bad.</p><p>My second mistake was tripping with C. He's my brother forever and I love him to death - but good lord... what a madman. He started tripping before all of us. I mean, he was in an absolute wonderland. The whole trip, he started talking in low voices and growling, saying things like:</p><p>'I am Hunter S. Thompson!'</p><p>'You're in league with the bat people, aren't you?'</p><p>'GOD DAMN I HAVE TO GO TO CANTERS!'</p><p>'I'm trying to imagine how you must see me. I'm up above here, trying to see you.'</p><p>Creepy stuff, coming from C. I started tripping about an hour after I took the stuff. Someone asked me if I was feeling the effects (there was music playing in the background) and I said 'no'. Immediately after I said that, the music in the background started playing backwards (and it was in french, so it was really trippy). Then a Frank Sinatra song came on and his voice started slowing down and speeding up - that was cool. I focused in on the shadows in my room and noticed them pulsating softly... now I'm definately in the groove. Then C and I both went mad...</p><p>He started walking and screaming and shuffling and howling and talking jibberish. I started worrying about him, then I thought he was going to harm someone, then I thought that he was convinced I was his enemy. I went from different states of terror to sadness when I was around C. But then, everything was beautiful. The music, my surroundings. Things breathed and every intricate surface was important and interesting and divine. I remember walking to the Liquor Store and seeing an old couple crossing the street - but they weren't walking. Kind of hovering and jittering... talking at high speeds. It was funny - kind of reminded me of a Terry Gilliam Monty Python cartoon.</p><p>G left early cause he had to go somewhere (he didn't trip with us...) and S didn't feel the effects till' 3am in the morning (when we were all trying to sleep). He started laughing and going on about how beautiful the moonlight was. He drew with a pen for hours on a piece of paper so I sat with him and talked to him about music and art and life. C passed out.</p><p>When asked about my trip, I simply say 'it was a horrible, beautiful experience and I'd do it again at the drop of a hat. Though, that's a place I can't visit again for awhile, yet.'</p><p>The thing about my friends, is that there's never any drama and if we have a beef about something, we talk to eachother about it, straight up. C and I had a casual conversation about how we were tripping off each other, and we ended up laughing in the end because the both of us were misinterperating each other's trip. Lack of communication - I suppose we were on different wavelengths which is ok.</p><p>... and remember - ALWAYS remember: It's all in your head.</p><p>Shrooms, I salute you.</p>",
 "year": "2001",
 "id": "7262",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-02-10T08:00:00.000Z",
 "views": "8406"
}
