{
 "title": "Do Not Eat with Cheese",
 "author": "pukeahontas",
 "citation": " pukeahontas. \"Do Not Eat with Cheese: experience with Yohimbe (ID 72626)\". Erowid.org. Jul 28, 2008. erowid.org/exp/72626",
 "substance": "Yohimbe",
 "bodyweight": "67 kg",
 "header": [
  [
   "DOSE:",
   "0.5 tsp",
   "oral",
   "Yohimbe",
   "(tea)"
  ]
 ],
 "report": "<p>I bought some yohimbe from the local pipe shop, because I was curious to see if it would have a viagra-like effect on a woman and if it would affect my boyfriend, in a positive sense!</p><p>The guy that sold me it didn't seem to know what dose to take, so I thought I would just try a teaspoon-full of the powder, which I made into a tea with some honey as the taste was overwhelmingly bitter. I took it at about 6 o'clock in the evening and only managed to get about half the cup down as it tasted so vile! My boyfriend had a couple of sips, as thats all that he could manage due to the taste. I was cooking in the kitchen at the time.</p><p>About 20 mins after ingestion, I began to feel very 'speedy' and my sight became slightly blurred. At times it actually felt a bit like mdma or ectasy. It was quite enjoyable, though I felt a bit jittery. I was running around the kitchen cutting up vegetables super fast and my heart was racing. When I had finished cooking, I sat down on the sofa and began to fell pretty nauseous. I went to the toilet to throw up, but I couldn't easily vomit. I kept burping loads and feeling awful and eventually, I stuck my fingers down my throat as I felt I needed to get rid of it. By this time I was having palpitations, hot flushes and cold sweats. I was panicking slightly. I threw up violently, with spasms coming from my guts. I felt awful and had a chill going through me, although I did feel a bit better having vomited.</p><p>I went to try and eat some of my evening meal and couldn't manage much (not like me at all) and sat feeling like I had the flu-this was about an hour after ingestion. I had blood shot eyes, which my boyfriend and flat mate both commented on. My boyfriend was slighly more energetic than usual, though not so much sexually inclined. And neither was I! I felt like crap. I was still shivering and sweating. Nice.</p><p>It is now 2am and I am still feeling a little wired, as if I have drank to much coffee. It is very annoying! When I think about how little I took and the effect it had on me, an explanation may be that I ate some cheese about two hours before ingestion. I had read somewhere that yohimbe is an mao inhibitor, but when I asked the guy in the shop from where it was purchased, he laughed at me. I have since found out that it says all over the internet not to eat cheese/red wine/drink red wine when taking it due to hightened blood pressure and other adverse effects. I should never have listened to that guy!</p><p>I didn't feel my sexual appetite was particularly increased by taking yohimbe, but perhaps if I took a little less and followed the instructions, I might have a better time! I won't be doing so for a wee while, mind!</p><p>Thanks for reading.</p>",
 "year": "2008",
 "id": "72626",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2008-07-28T07:00:00.000Z",
 "views": "20262"
}
