{
 "title": "Ott's Assertion - Mimosa without MAOI",
 "author": "Curious George",
 "citation": " Curious George. \"Ott's Assertion - Mimosa without MAOI: experience with Mimosa hostilis (ID 72680)\". Erowid.org. Jan 26, 2010. erowid.org/exp/72680",
 "substance": "Mimosa hostilis",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  "25 g",
  "oral",
  "Mimosa tenuiflora",
  "(tea)"
 ],
 "report": "<p>After reading Otts and Aardvarks assertion that mimosa hostilis is psychoactive without MAOI, I performed the cold water extraction exactly as Aardvark describes it in the article, even noting the same eerie, magic potion effect of the root bark dust floating out of my herb grinder. I soaked the material in sterile water for an hour, filtered and repeated with new water and combined the results into a beautifully wine-colored brew.</p><p>It was more bitter than I had expected, but not really nauseating, maybe like drinking Turkish coffee without any sweetener. Nonetheless it took me about 15 minutes to get the stuff down, chased with a bit of water.</p><p>Maybe I drank it too slowly, because my results differed greatly from Ott and Aardvark. After sitting with the brew in my stomach for 30 minutes with no event I decided to smoke a small amount of marijuana  two puffs of good stuff. It set something off, and in a minute I was expelling the bitter fluid off the back porch.</p><p>Afterwards I felt fine, but a bit drained.</p><p>I was hungry; I hadnt eaten all day and Id been up for several hours. I had a small meal, then had a few beers with my friends and smoked a bit more pot. There was a moment there where I felt a little different, but under the circumstances I would blame the beer-pot-nearly empty stomach, although it did seem like there was something else there. But</p><p>While I was sitting with the brew in my stomach, before I threw it up, I felt a bit stimulated, but once again this may have been my excitement as much as any effects of the drug. All in all I would say that no effects worth mentioning were experienced that I couldnt explain through more mundane means.</p><p>After my experience I read Dale Pendells chapter on mimosa in Pharmako/Gnosis, and saw that he had had similarly disappointing experiences with mimosa without MAOI. It makes me wonder why Ott and Aarvark were so lucky  maybe some metabolic fluke? I dont think theyre lying, and I dont wish to imply that either party is full of shit, but obviously the matter is more complicated than they indicate in their writing.</p><p>I agree with Dale Pendells assertion that, were mimosa reliably effective without MAOI the web would be flooded by reports of its use this way. The silence is indeed deafening. But perhaps a few lucky folks out there have the right metabolism for itI myself, for instance, am very sensitive to psilocybin mushrooms, whereas my friend isnt; I can enjoy, and learn from 1 gram of psilocybe cubensis. He needs 3.5 grams for threshold effect. You tell me.</p><p>My advice  use your mimosa in ayahuasca, dont waste it this way. (Disclaimer) That is, of course, unless you live in the United States; I would never endorse the use of any illegal drug within the boundaries thereof.</p>",
 "year": "2008",
 "id": "72680",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-26T08:00:00.000Z",
 "views": "6173",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "25 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "(tea)"
  }
 }
}
