{
 "id": 727,
 "title": "Calm Feeling; Far Away from My Surroundings",
 "date": {
  "submission": "2004-12-06T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Synesthesia",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Lotus/Lily - Nelumbo nucifera",
   "form": ""
  }
 ],
 "report": [
  "After years of waiting, I finally enjoyed Blue Lotus wine.  I uncorked a nice red brought back form Rioja and added the Blue Lotus [5g Nymphaea caerulea, dried, granulated blossom].  After mixing it thoroughly, I recorked it and refrigerated it for three days to allow both water soluble and insoluble constituents time to diffuse.  After letting the wine warm to room temperature, BN and I poured separate glasses, leaving the plant matter unstrained.  After drinking approximately 4oz, I realized that BN couldn't hack the plant matter in his drink.  To attempt to make it more palatable, I prepared his into a mulled wine.  I heated  his entire portion of wine over a gas burner for 4-5 minutes, careful not to boil. A small amount of the essential oils of clove and cinnamon was added for flavor before I strained and discarded the blue lotus mush.  He found this even less palatable.  We switched drinks instead.  All in all, I ended up consuming about 7 more ounces than BN did.  He weighs ~170 lbs.  We were both calm, but looking forward to getting to know Lotus, as well as excited about seeing friends we had not kept company with in a very long time.",
  "Fifteen minutes later, in the company of friends, I noticed what felt like a dull mental hum across the surface of my mind, so I suggested that BN and I pack an empty clove with White Lotus [Nelumbo nucifera, whole dried blossom].  After sharing the first cigarette, I remained only sporadically conscious of my surroundings and was briefly disoriented (the latter likely caused by residual nicotine, to which I'm not accustomed).  As I sat with my friends, I felt very much not present.  I suppose that could be called 'a feeling of calm'.  I couldn't see any reason to worry if I didn't feel present.  The sensation was very much like one of extended trance, the sensation after becoming the breath.  I forget the breath. ",
  "While I was able to pleasantly listen to the discussions around me, I decided to smoke a second packed cigarette to intensify the effects since I was not experiencing any of the empathogenic or ecstatic effects.  After a couple seconds of disorientation, I found myself further away from my surroundings than I like.  Though I still appeared sober, I was no longer able to follow complex discussions, making conversation frustrating--if anything could frustrate in that space.  I had to work to interact, and was no longer able to sit back and experience. The very strong effects lasted two hours, the strong for two more before I slept.  In the morning, I felt slghtly 'different'--not precisely an afterglow, more a feeling of mental contentment, which faded by afternoon.",
  "I understand now why it is called a psychodysleptic--the experience is very like a marijuana head-space.  However, unlike marijuana, there was no effect on memory recall.  I could not follow the conversation not because I could not remember the train of thought, but because I was not present for most of what was said.  This makes me suspicious that it works on the GABA pathway of the mind, demonstrating a novel sedative action; I don't yet know.  Perhaps alone, or in smaller amounts, Blue Lotus may be more profound.  BN, however, experienced nothing more than a light wine flush and an unpleasant aftertaste.  The difference in dosage and body weight, though significant, can't totally explain the differences between our experiences."
 ],
 "erowid": {
  "id": "11865",
  "citation": " Synesthesia. \"Calm Feeling; Far Away from My Surroundings: experience with Blue Lotus, Nelumbo nucifera & Alcohol (ID 11865)\". Erowid.org. Dec 6, 2004. erowid.org/exp/11865",
  "substance": "Blue Lotus, Nelumbo nucifera & Alcohol",
  "views": "27596"
 }
}
