{
 "title": "The Ultimate Chill",
 "author": "The Unknown Comic",
 "citation": " The Unknown Comic. \"The Ultimate Chill: experience with Tramadol (Ultram) (ID 7270)\". Erowid.org. Jan 26, 2003. erowid.org/exp/7270",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "220 lb",
 "header": [
  "DOSE: T+ 0:00",
  "150 mg",
  "oral",
  "Pharms - Tramadol",
  "(pill / tablet)",
  " T+ 4:59",
  "100 mg",
  "oral",
  "Pharms - Tramadol",
  "(pill / tablet)",
  " T+ 5:30",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>I recently a small prescription of Ultram from my doctor for my migraine headaches. Being an experienced and responsible drug user for several years now (Marijuana, Salvia, Opiates, Sedatives, Amphetamines, Hallucinogens, etc) I couldn't resist checking out it's recreational uses. The prescription was somewhat small though, only 30 pills, and for this reason I decided I wouldn't use more than 5 just for fun, because I would more than likely need the rest for when I when I get my migraines.</p><p>Upon receiving the bottle from my neighborhood pharmacy I eagerly popped three (150mg total) on the way home. Within 20 minutes I felt the effects. My body gets sluggish. I feel very relaxed and decide to just chill out and watch an old movie (Lust for Life, starring Kirk Douglas, about the life of Vincent Van Gogh, very interesting, I highly recommed it.) After about an hour I felt it quite strongly. The feeling is almost identical to that of a 20-30mg dose of hydrocodone. Very euphoric and relaxed body high. I was incredibly comfortable and had no desire to do anything but keep sitting and watching my movie, but unfortunately I had to go to work.</p><p>I arrived at my job approximately 2 hours after taking the pills. I think I was probably just getting over the peak of the high at this time, my body felt great and, even though I would have rather stayed home watching television, I was in an incredibly great mood. The comedown was very gradual and not bad at all. I remained in an excellent mood the entire 4 hours I was at work and I had no problems whatsoever communicating with people or doing my job, the ultram simply made me feel really good while I was doing it. The body high itself lasted a good three to four hours before fading completely.</p><p>By the time I arrived home I was completely sober, but I was still in a great mood and was very relaxed. After thinking about it a while, I came to the conclusion that anything less than 150mg wouldn't be very effective recreationally. Since I was only allowing myself 100mg more and I was still feeling relaxed and happy from my initial dose five hours earlier, I decided to take them after eating some dinner.</p><p>Now, as I stated earlier, the high from ultram is almost identical to hydrocodone (the active drug in vicodin). Something I happen to find very interesting about hydrocodone is how well it mixes with marijuana. Smoking while on hydrocodone changes the high significantly, you are even more euphoric, the body high is stronger, and there is a strong sense of psychedelia.</p><p>So, to make a long story even longer, 30 minutes after taking the 100mg I decided to smoke a bowl and see what would happen. I was definitely feeling the ultram quite strongly (again a strong body high, even a slight numbness in my limbs) when I took my first puff. I slowly puffed away at the bowl for about 15-20 minutes, taking 5 to 6 hits over that time. Once I was plenty baked and feeling extremely relaxed, I decided to lay down on my bed and just chill.</p><p>What followed was one of the best feeling body highs I have ever experienced. It wasn't necessarily the strongest body high, but I think it was definitely the most comfortable. I felt incredible, it wasn't intense at all, it was just amazingly relaxing. I stayed on my bed daydreaming for about two hours and just enjoying how good I felt. Eventually I dozed off to sleep and took a short nap. When I woke up it was about three hours after taking the 100mg (8 hours after the initial 150mg for those of you who aren't keeping track.) The body high was much milder now, it was slowly fading, but I was still somewhat euphoric and still in an incredibly happy mood.</p><p>I highly recommend trying ultram to all you responsible users out there, especially if you enjoy any type of opiate, as the effects are very similar. Furthermore, it is quite easy to get because it isn't yet scheduled, so doctors prescribe it more readily. Much easier to get a prescription for it than any kind of opiate. I'd also like to mention that I have since used it to treat a migraine. 50mg took care of it in about 20 minutes or so and left me with a very very mild euphoria that lasted about an hour and a half. So anyone looking for a good pain killer to treat migraines might want to look into it as well.</p><p>Peace all.</p>",
 "year": "2001",
 "id": "7270",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-01-26T08:00:00.000Z",
 "views": "266631",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 4:59",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 5:30",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
