{
 "id": 7272,
 "title": "A Classic Mistake",
 "date": {
  "submission": "2005-04-04T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "echo",
  "gender": "Male",
  "weight": 76
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "5-MeO-AMT"
  },
  {
   "time": "1:00",
   "amount": "14 mg",
   "administration": "oral",
   "substance": "2C-E"
  },
  {
   "time": "26:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Diazepam"
  },
  {
   "time": "26:00",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Hard"
  }
 ],
 "report": [
  "0 Hour",
  "I took 30mg of AMT orally.  I was alone in my home; a comfortable space with many distractions.",
  "1 Hour",
  "I made the classic mistake: I thought that since nothing had happened yet, I needed to take more drugs.  At this point I was apparently sober, and have no idea how I could have been this stupid. I took 14mg of 2C-E orally.  It is a substance I am familiar with and find very easy to control and enjoy.",
  "1.5 Hours",
  "I start to feel the onset of both psychedelics.  I feel a nasty stomach cramp and think that I will need to vomit at some point.",
  "2.5 Hours",
  "The stomach cramps escalate to extreme gastrointestinal pain.  I want to vomit, but my stomach is so knotted that I can't contract the muscles at all.  I also feel a huge need to defecate, but am unable to because of gastrointestinal pain.  I also become very cold and start to get waves of chills. My vision becomes altered fairly heavily, but that takes a back seat to my discomfort.",
  "6 Hours",
  "The gastrointestinal pain is still excruciating, and I am unable to move much.  I am still very cold and put on warm pants, a sweater, winter socks, and turn the heat up to 26C (about 80F?).  The entire physical unpleasantness continues to become harder to deal with, so I call a friend and we start looking into the literature to find bad combinations of the two drugs. I am only able to distract myself from the pain by concentrating on the task at hand.  We find no obvious reason there would be a contraindication for the two drugs.  However, AMT is an 'effective' MAOi, which is inadvisable to mix with a huge host of drugs.  Unfortunately, we can find no reference to a bad combination of MAOi's with any of the hallucinogenic phenylethylamines, and our research tools run out.",
  "9 Hours",
  "Finally, the pain subsides, and my body slowly starts evacuating itself of all solid matter.  Yuck.  But thank God. I still feel uncomfortable, but less like food poisoning and more like influenza. I'm still cold, but I'm finally able to turn the heat down to my usual 21C.  I remain rather jittery and unpleasantly stimulated.  Around this time I realize that I have actually been seeing and hearing amazingly distorted things, with a great variety of recurring themes for several hours.  It hadn't been important.",
  "11 Hours",
  "I am so stimulated that I need to take a long walk, so I venture outside.  I take a 2 hour walk and have a fine time.  My vision is still novel, but not overpowering, and my mind is alive with wonderful ideas.  I was reminded of years spent in Germany as a child and the German tradition of long walks on weekends (Voltzmarch).  I was in great spirits and as long as I kept walking the discomfort was slight.",
  "26 Hours",
  "I spent a number of long hours feeling like I had taken too much speed (which I've never done).  I was completely restless, but unable to concentrate enough to play music or write.  I watched a number of movies, but sitting still was hard and uncomfortable.",
  "I ended the experience with a Valium and a glass of brandy and was able to force myself to sleep.",
  "Afterthought",
  "I slept 15 hours and awoke feeling okay.",
  "This was easily some of the most pain I've ever felt.  I was pouring sweat with cold chills for 7 hours.  My insides felt I had drank a bottle of Drano.  I've had food poisoning once in the Philippines, and it was horrible - but this was possibly worse.",
  "This is a warning, these are both research chemicals, and they have not been studied throughly enough.  Had I taken a large amount of Prozac with the AMT would I have started convulsing and died?  I have had 'bad trips' before, they are usually mental, and not so physical.  This may just have been my 'bad trip,' but I strongly warn anyone against taking this combination of drugs."
 ],
 "erowid": {
  "id": "41799",
  "citation": " echo. \"A Classic Mistake: experience with AMT & 2C-E (ID 41799)\". Erowid.org. Apr 4, 2005. erowid.org/exp/41799",
  "substance": "AMT & 2C-E",
  "views": "17855"
 }
}
