{
 "title": "Hexagramic Wonderland",
 "author": "Coruscating Patterns",
 "citation": " Coruscating Patterns. \"Hexagramic Wonderland: experience with Mescaline, MDMA(pure), LSD, Cannabis, and Cubensis (ID 72731)\". Erowid.org. Jul 22, 2010. erowid.org/exp/72731",
 "substance": "Mescaline, MDMA(pure), LSD, Cannabis, and Cubensis",
 "bodyweight": "145 lb",
 "report": "<p>So, a friend and I decided to take a trip down a nearby river on his inflatable raft.   It was nearing the end of August, and the current was rather leisurely.  Thus it was concluded that eating some powerful enthneogens was a prudent idea.</p><p>With this in mind we proceeded to our departing point, humped the raft and accompanying gear to the edge of the river, and got to work.  Once the raft was good to go, out came the bags of various substances.  My companion only ate about a gram and a half of cubensis as he was to be the pilot for this excursion, and I was going to be totally out of my mind.  I eyeball what Ive got with me and decide that, well, fuck it Im taking it all.  So first down the hatch are the mescaline/MDMA pills,  each contain 200 mg mescaline and a  o f a hit of MDMA.  I took two.  Next down were the two grams of cubensis, not much but those Amazonians do pack a punch!  Finally, after washing the mushrooms down with a nice IPA, I put the tab of acid in my cheek.  This was equivalent to what I would classify as one smaller hit.   I held the tab in my cheek as we prepared to disembark, and then just as we were about to leave I swallowed it. </p><p>As we pushed off down the river, my friend (J) offered me a cannabis cookie or two.  I obligingly took the proffered cookies and munched them down post haste.  I find that edible cannabis products make a trip a bit more profound in both the visual and mental aspect.  The THC also tends to calm the paranoia inherent in taking large doses of a plethora of enthneogens.  I took a few deep breaths, focused myself, and prepared for the wild ride.</p><p>J attempted to teach me some basic rowing techniques, but I was already too far gone.  Mind-expanding compounds tend to hit me hard and fast, today being no exception.   Thus, J decided that he would take over sole rowing duties, except in special situations, I heartily agreed.  </p><p>About a half an hour after taking the cocktail I began to feel flushes in my cheeks, as if the capillaries were made of electricity (or dopamine).   I looked over at J and told him it was going to be a long day.  The body high came on hard about fifteen minutes after the initial flushes, and some mental elation and amusement were bubbling forth from my psyche.  The giggles were omnipresent the first half hour of the trip, and as soon as they began to fade I began to notice patterns in the water and trees.  All was lit with a light as if inner energy were ripping forth from every fiber of every living thing.   Needless to say I was awestruck.</p><p>About an hour in we stopped at a beach so everyone could relieve themselves, smoke some ganjha, and bullshit.  So I make my way down a path to go to the bathroom.   As I emerge from the brush and river trees, a sandy clearing opens up before me.  Now, as soon as I step foot onto the sand little dimples start forming symmetrically across the clearing, and strange cacti shaped like flowers start folding up out of the sand.  The cacti were colored very strangely, yellow, blue, green, and red sections blended into each other as they ascended.  I was a little freaked out to be honest, and nearly relieved myself elsewhere.   However I decided to go with it, and did my business. </p><p>Just as I was about to turn around and go back to the boat, I noticed the dimples were turning into vortices, as if something were trying to climb out.   Sure enough, on the opposite side of the sand, a giant cartoon wasp crawled its way out of the sand.  Immediately fixing its eyes on me, it began to fly over towards me.   I was frozen in place as the wasp landed on my shoulder. It began to whisper incomprehensible things into my ear in a horrible grating, sliding, scratching language.  Just as the whispering ended, I looked back and noticed that each section of the wasps compound eyes had a pupil and iris.   It then zipped away, as if in fast forward, back into the sand. </p><p>I stumble-ran to the boat, and we pushed off.  As I lay back in the boat, J threw some tunes on his portable speakers, and my mind turned a bit inward.  As I looked up at J he manifested this strange blue energy about himself, and his clothing turned electric.  For lack of a better description, he looked like Raiden from Mortal Kombat on a Hawaiian vacation.  Very trippy shit to say the least.  So, I started looking around, and began to notice that everything was a hexagram.  When I say everything, I mean everything was composed of hexagrams interlocking or all by themselves.   The boat, myself, and my companion excluded.  Every leaf was a hexagram, and every tree a complex geometrical shape. </p><p>Contemplating this development, I looked down at my right arm as I felt a tingle.   Much to my surprise, smoke began to manifest itself out of my tattoo.  Even stranger was the fact that organized into lines that swirled into my palm.  As it collected there, it then began to funnel towards my fingertips, where small vortices of smoke began to form into hollow spheres.  When the spheres had fully formed, each suspended two inches off my fingertips, bobbing up and down, I got the urge to play.  As I thought this the spheres spun off into the surrounding foliage.   Bummer.</p><p>Things kind of mellowed out after this for about twenty minutes.   Then a vision came down upon me.  I saw many people that I know dancing to the music on Js speakers.  However they were all flat, black cut out versions of themselves, and they all had crazy orange nimbuses of energy around their heads.  Now as they continued to dance these nimbuses shot lines upwards, and these lines began to curve in towards each other.  Until all were connected as one, by this umbilical orange-blue energy.   I must have been zoning, because J had to snap me out of my state.  This vision left me feeling elated and whole.  </p><p>As we neared the end of our river journey, J offered up even more cookies which I gobbled on down.   Bringing the total to six cookies eaten.   I was transcendent at this point, and was a little bummed that I would have to leave the comfortable surroundings of the river for civilization.   However, J struck on the idea of an adventure in the woods after dark. </p><p>We packed up the boat, stowed our packs, and took off for the entrance to the forest.   As we arrived, night had set in fully, and I started to get a little paranoid about the darkness.  However J seemed pretty confident, and I was still more than a little fucked up so I decided to go for it. </p><p>I stumbled around, fumbled through bushes, and all around bumbled my way to our destination.  We had a great view of the surrounding country-side and decided to smoke a fat bowl of some Alaskan Thunder-Fuck and Purple Indica.  Taste the rainbow I say!  As we were finishing up the bowl I looked out across the valley below us, and saw a giant castle made of smoke suspended in the sky.  There was a similarly ephemeral bridge extending from the cliff to the castle.  It was a beautiful apparition, and I really wanted to walk out towards it, however I wasnt THAT fucked up! </p><p>We then made our way back to the car, and home to warm beds.  This was definitely one of the more powerful, insightful, and awe-inspiring journeys of my life.  I learned many things about myself, and my connection to others.</p>",
 "year": "2007",
 "id": "72731",
 "gender": "Male",
 "timestamp": "2010-07-22T07:00:00.000Z",
 "views": "5356",
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Mescaline",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": ""
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": ""
  },
  {
   "time": "0",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": ""
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(dried)"
  }
 ]
}
