{
 "title": "Quite An Adventure",
 "author": "C-Rizzle",
 "citation": " C-Rizzle. \"Quite An Adventure: experience with Kratom (15x extract) (ID 72756)\". Erowid.org. Nov 9, 2008. erowid.org/exp/72756",
 "substance": "Kratom (15x extract)",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "0.5 tsp",
  "oral",
  "Kratom",
  "(extract)"
 ],
 "report": "<p>Dose:  Teaspoon Kratom 15x Extract</p><p>Previous Experience: LSD, Cannabis, Amphetamines, Hydrocodone, Poppy Seed Tea, A Few Legal Drugs  Had never taken Kratom before but had heard good things.  My last substance use was one week prior when I smoked some Blue Lotus.  No caffeine, alcohol, tobacco or anything else in my system since then.</p><p>Preparation: My girlfriend and I decided to split a drink.  Took exactly 1 teaspoon of the powder extract and added it to a mango/orange drink.  Didnt have any other mixer on hand and figured the citrus taste would mask the bitter flavor.  The drink was bitter, but was not unbearable by any means.  It tasted like a really odd, borderline disgusting flavor of green tea.  Total dosage was approximately  teaspoon per person.</p><p>0:00  K (my girlfriend) and I decided to head to dinner and a movie for the night.  We planned it so that our dinner spot was right next to the movie theater in case this stuff hit us harder than we expected and we were unable or unwilling to drive.  We began drinking the mixture on the drive there (I know, Erowid Note: Driving while intoxicated is not a good idea.  We werent intoxicated yet so all was fine).  Downed it in a few minutes.  We were both on an empty stomach so we expected results quickly.</p><p>0:05  Parked the car and began feeling the first hints of a slight buzz.  Felt a very happy mild alcohol drunkenness.  We were a little giddy, a good bit buzzed and a good bit stimulated from the early onset of the Kratom.  This stuff definitely is speedy at first and I immediately knew this was not a placebo effect.  Things seemed very clear.</p><p>0:15  Walked around the shopping complex for a few minutes to get a feel of things.  There was slight social anxiety but nothing unbearable.  I think it was just us not knowing what to expect.  After I got used to the feeling, I felt completely comfortable in social settings, though I doubt this would be a very good thing to do at a party.  The initial stimulation would be great for interacting with other people but the later stages wouldnt.</p><p>0:20  K had to run into a nearby restaurant to see when she had to work.  I sat at the front and waited on her.  I was very aware of everything around me, but seemed to be in my own world.  I was thoroughly enjoying taking everything in.  K was feeling the same stimulation as I was.  Let me add, there was NO nausea or stomach discomfort.  Even after eating dinner, there was still no discomfort present.  Could have been that we drank it on an empty stomach, couldve been that we drank it with a citrus fruit drink (possibly the Calcium or citric acid eased the stomach) or couldve been that this stuff just doesnt upset our stomach.  Who knows.</p><p>0:30  This is when the effects started to change from stimulating into the mellower, more relaxed stages.  We entered the restaurant and sat down.  I found it difficult to concentrate on the menu.  We were at a Japanese restaurant that had a huge selection of dinner items and I could not motivate myself to read through each one to find out what I wanted.  Luckily K and I decided to split something so she took care of the ordering.  It wasnt that I was unable to read or focus; it was that I just didnt feel motivated enough to do so.  I started to feel very thirsty and began drinking water like crazy.</p><p>0:45 - As we sat and ate, the effects began to strengthen exponentially.  Ive taken Hydrocodone that was given to me for a prescription.  Ive never done more than 10 mg at one time so I cant really compare, but the effects from the Kratom were maybe 3 times stronger than the effects I felt with Hydrocodone.  Very similar effects from these two drugs and I can definitely see why some use them as a painkiller.  Dinner was quite a neat experience.  The food tasted fantastic.</p><p>1:00  The effects were great.  A lot of euphoria.  K began to get worried though.  She had never done any psychoactive substances before and is avidly against using illegal drugs.  I was lucky to convince her to do this with me.  The fact that its legal was the biggest selling point.  She probably took too high a dose for her first time.  She began saying she felt like she was going to pass out and that she felt light headed and dizzy.  I was worried that this might be an adverse reaction to the Kratom.  We tried to remain calm and relaxed and wanted to quickly finish up dinner in case she did indeed pass out or something.</p><p>1:20  We paid the bill and left the restaurant to go sit outside for some fresh air.  For me at least, everything just felt right and looked right.  K didnt feel weird anymore.  She wasnt sure what she was feeling, but it was different to her.  Having taken Hydrocodone and Poppy Seed Tea, I assumed what she was feeling wasnt bad at all, just different for her.  The Kratom began to make her feel slightly dizzy and light headed.  Her body had that wavy, empty feeling to it.  The painkilling properties of this drug made her feel disconnected with her limps.  She mistook this feeling for sickness, when it was simply the Kratom doing its thing.  After I got her to understand that the way she felt was what was supposed to happen, she began enjoying the experience more.</p><p>1:45  We entered the movie theater to wait for the movie to start.  We were about 30 minutes early so we decided to sit in the lobby and wait for the doors to open.  Everything around us seemed much brighter.  Everything had a happy glow around it and the neon lights in the theater looked amazing.  K and I both felt very happy.  I felt very connected to her and could definitely see this as being one of those love the people around you sort of drugs.</p><p>2:00  We were finally able to go into the movie.  We sat down and claimed our spot for the two and a half hour movie.  I still felt very happy and relaxed.  I had a bit of a tingling all over my body and would imagine that sexual stimulation would be easy at this point.  K commented the same thing.</p><p>2:00 to 4:30  We sat and watched the movie.  I was intently focused on it the whole time yet very relaxed.  It was like I was just happy to be experiencing such a fantastic thing.  I started to feel quite warm after awhile.  I wasnt sure if it was the theater being hot (as the movie was sold out) or if I was simply feeling the heating effects that some have said they feel while on Kratom.  K said she felt the same way.  After leaving, we decided that it wasnt us and that the theater was probably too hot from all the people crammed into it.</p><p>4:30  Mental and physical effects began to slow down.  We left the movie still feeling very happy but definitely with decreased effects.  I was really thirsty and had a minor headache.  K said she felt the same way.  We went home and chugged a lot of water.  Both of our headaches seemed to dissipate after that.</p><p>5:00  With hardly any effects from the Kratom still present, K and I decided to go to bed.  My headache was gone by that point.  I think if I stay well hydrated, I can virtually eliminate the hangover.  Sleep was very easy.  My mind was relaxed and empty of distractions.  My body was equally relaxed and I drifted right off to sleep.</p><p>Next Day  Awoke feeling a bit groggy.  I slept great but was having a tough time crawling out of bed.  After I forced myself to get up, ate some breakfast and drank some more water, I felt like normal again.</p><p>Conclusion: I will definitely do Kratom again.  I intend to reorder some of the 15x Extract as soon as possible.  I may try some of the other extract strengths, but I see no reason to mess with something I know works.  I would like to mix the powder with something different next time though to find a way to mask the bitterness more.  Taking the Kratom right before dinner on an empty stomach is definitely the way to go.  No nausea or stomach discomfort and the effects were felt almost immediately and lasted most of the night.  This is great to take to simply relax and feel right with the world.  Taking it with my girlfriend made it that much better too.  It had feelings very similar to opiates after the initial stage of stimulation had passed.  I would highly recommend this product.  I may never experience that same feeling again, but I would sure like to if possible.</p>",
 "year": "2008",
 "id": "72756",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-11-09T08:00:00.000Z",
 "views": "70037",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 tsp",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(extract)"
  }
 }
}
