{
 "id": 7276,
 "title": "A Trip Into Reality",
 "date": {
  "submission": "2008-07-20T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ChemistryNerd",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "4 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 10x"
  }
 ],
 "report": [
  "I was experienced with this combination on a few occasions, and the other times I did it was similar, though only in some aspects.",
  "My day started off with smoking some kif, which was from a pure sativa, followed by a hitting a few nitrous oxide canisters. This went exceptionally well.",
  "A few hours later, my friend and I proceeded to repeat the process with the addition of salvia. It felt like a train hitting me, an extraordinarily fast rush and then the experience itself felt as if I was in a carnival almost. Everything was real but it was a 'fake' reality. I was not imagining this either. Everything was clear and sharp and normal in a sense, I was basically on the borderline of breaking through. It was also very fragile, and I had the potential of having a very bad trip. Luckily, I did not.",
  "We watched a movie, by the end of which the effects of the salvia wore off. I went home and this is where the real trip happened. I arrived home, two hours after the original ingestion of the drugs. I am still high but under no influence of the previous substances. Another hour passes before I began to experiment alone. I had a rather large bowl of kif. I was by all standards high at the end of it. I then had Skyy vodka to dull the effects of the body and help me 'focus' (as much as one can focus on alcohol) my mind. ",
  "I turned on some nice 'calm' music and began to wait 15 minutes until I began to peak, before hitting the salvia. I packed a small amount, with some difficulty. The alcohol was kicking in, I felt the buzz and slightly inebriated. The salvia was burned for 2 seconds by a standard BIC, sucked in, and held in for about 20 seconds. I placed down the bowl and my lighter. I sat down, put on my headphones, and started up some visualizations in Winamp and waited for the show to start.",
  "And start it did. I immediately felt the 'salvia wind' as I describe it, a feeling where my mind begins to get torn apart from my body. After another minute, I was totally under the grip of salvia. My mind was trapped in my body but free. I felt all the controls to my body. My mouth, my tongue, my hands, each had its own place in my body and I felt the individual controls. It was very interesting. I was still 'aware' of what was REALLY happening, but I felt that more interesting things I could see if I traveled out of my body. I had to 'step' over the controls of my body. In fact, last time during this process, I accidentally activated my voice and began mumbling to myself. I almost spoke, because I tripped over my voice 'controls.' A good way to picture this is the way you are now, in a big room with controls scattered everywhere and a door somewhere.",
  "I locked my body into a sitting position and left. I became one with the visualizations, I understood what it was to be infinite. I realized what reality was. I cannot really put it into words. It was definitely an enlightening experience. This feeling pursued for about 30 minuets, probably due to alcohol. After the feeling wore off I was simply high/mildly intoxicated. I went to sleep. I slept wonderfully. The next day I woke up feeling slightly burnt, but it went away quickly after I reflected on my trip.",
  "I feel now that my highs, no matter what they are off of, will be much more personal and meaningful. I will understand much more. Addition of any other drugs into this experience would definitely make this a much more intense experience. I will definitely try this again when I am ready. Perhaps nitrous will be added."
 ],
 "erowid": {
  "id": "41806",
  "citation": " ChemistryNerd. \"A Trip Into Reality: experience with Salvia Divinorum (10x), Cannabis & Alcohol (ID 41806)\". Erowid.org. Jul 20, 2008. erowid.org/exp/41806",
  "substance": "Salvia Divinorum (10x), Cannabis & Alcohol",
  "views": "2861"
 }
}
