{
 "title": "Disappearing Ice Cream",
 "author": "Bman",
 "citation": " Bman. \"Disappearing Ice Cream: experience with Diphenhydramine (ID 7279)\". Erowid.org. Feb 7, 2003. erowid.org/exp/7279",
 "substance": "Diphenhydramine",
 "bodyweight": "124 lb",
 "report": "<p>I have done Benadryl a lot in the past, but never have I ever had a experience this strong in my whole drug life. I have never done Acid, or shrooms, but I have done weed, Duster, and inhalants, and catnip, and nutmeg. Anyways I woke up yesterday at 8:00am. I ate a little breakfast, and at 8:30am. I closed my bedroom door and took out the bottle of Benadryl, and counted out 13.</p><p>T+ 00:00</p><p>All 13 pills have gone down with a Pepsi. That's 325mg. of Diphenhydramine gone. I told myself that once the effects started to kick in I would take the last 12 for a total of 25.</p><p>T+ 00:52</p><p>I am starting to feel the weird stoned like feeling I get when I take this. My mouth was starting to get dry, so I figured I needed to get the rest down, so again with the rest of the Pepsi I downed 12 more. And told myself to get ready. I was started to notice minor breathing of the walls and objects I looked at, and i began to feel a strange feeling in my stomach almost as if it was not there, and that was not that pleasant.</p><p>T+ 01:14</p><p>I get the first hallucination. As I was taking a piss in the bathroom, I looked down the vent next to my toilet, and I saw a stream of ants parade out of the vent, I quickly zippered my pants up and ran out of the bathroom. But on my next trip to the bathroom which was like 5 minutes later, (one more thing I really have to pee a lot while your on this stuff) the vent was closed, and there was no way that any bugs could have got up there, but it semmed so damn real.</p><p>T+ 01:35</p><p>I think the effects of the 12 more pills started to kick in. I Looked outside my window and into the tree in my yard, and there was a squirrel climbing up and down the limb of the tree, it was running back and forth, and then it just vanished. After watching the animal for what seemed like hours my head turned into the direction of my T.V. It was off and I could see all the stuff in the reflection from the screen dance and jiggle, and one time my arm came up and scratched me nose, but I seriously did not remember scratching my nose. I wanted to listen to music but I couldn't even seem to get my arm over to the player, because my arms felt like they weighed 100 pounds each. So i think in my drug induced thinking I forgot all about music and just sat there on the edge of my bed tripping out.</p><p>T+ 02:20</p><p>My friend from school walked into my room and said that my house was on fire, and I almost reacted until I somehow found out that there is no way my friend could have just came into my house, let alone my room, especially when the door locks from the inside. That kind of scared me a little so I went over to the door and opened it just to make sure my house wasn't on fire, but because I was tripping I actually couldn't tell what was real or what wasn't. Some time later I was sitting against my bed and I kind of dosed off, and had a dream that I was eating ice cream, Suddenly i woke up and I was holding a spoon in my hand and I was reaching with it down to the floor where there was a bowl of ice cream, but before I reached it the spoon and bowl dissapeared righjt before my eyes. I was so fucked up in the head that I got up and started asking myself 'where the hell is the ice cream at?' I actually thought I had Ice cream, And then my mom comes into my room and says who are you talking to and I think I say I must of had a dream, but it sounded more like 'must of dreamed i had did' She looked at me wierd and then I swear to god she dissapeared!! I was like what the fuck and then I think around noon I fell asleep.</p><p>T+ 03:20</p><p>I fell asleep.</p><p>T+ 10:02</p><p>I woke up with a strange feeling still with me, and I went to go the bathroom and I remembered that my mom was in Arizona, and that she wasn't coming back until a week later.</p><p>All in all the experience was not that bad, but I have had better. That was Though one of the most strong drug experiences I have ever had, but there is some downsides to taking benadryl: it made me real tired, and I got the worst cottonmouth ever. The hallucinations were usaully so real that I couldn't tell the difference. And there is a hangover, so watch out and be carefull. personally I think for my weight I took too many pills (25 pills = 625 mg.).</p>",
 "year": "2001",
 "id": "7279",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-02-07T08:00:00.000Z",
 "views": "62996",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "325 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 0:52",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 }
}
