{
 "title": "Antidepressant Effects",
 "author": "Bran Man",
 "citation": " Bran Man. \"Antidepressant Effects: experience with Cannabis & Effexor (ID 72845)\". Erowid.org. Jul 29, 2008. erowid.org/exp/72845",
 "substance": "Cannabis & Effexor",
 "bodyweight": "170 lb",
 "report": "<p>Over the past 8 years or so, I have smoked cannabis fairly constantly, and have also used various SSRI and SSNRI antidepressants on and off. </p><p>When I recently stopped taking my daily dose of 10mg Celexa for depression, it was the first time in nearly a year that I wasn't taking anything daily except cannabis.  After only a week of going without Celexa, I'm finding that when I smoke very high grade Cannabis (fresh cali stock), my depression is no worse than it is when I'm on prescription antidepressants.</p><p>My main reason for writing this report is to remind people that no matter how long you've been on antidepressants, and no matter how much you feel that you need them, you really can let them go when you get to the right place in your life.  I was on 225mg of Effexor (Venlafaxine) for over a year, and I honestly thought I would be taking it for the rest of my life, but time can do wonders.</p><p>Cannabis can be an amazingly powerful antidepressant, and although it doesn't give me that painted on smile that most antidepressants do, it's a lot easier to put down for a few days without crazy side effects. </p><p>These days I don't even mind so much when I run out of my grade A smoke, as it lets my tolerance drop a bit and gives me a heightened appreciation of Cannabis when it's around again.</p><p>I can not describe the joy I feel every time that I get an ounce of buds in the mail (yes, I can mail small quantities of drugs quite easily when they are vacuum sealed), it's much more fulfilling than a bottle of pills.</p><p>peace</p>",
 "year": "2008",
 "id": "72845",
 "gender": "Male",
 "timestamp": "2008-07-29T07:00:00.000Z",
 "views": "10254",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " flowers",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(daily)"
  }
 ]
}
