{
 "title": "Nice But Short Rush",
 "author": "Banglassie",
 "citation": " Banglassie. \"Nice But Short Rush: experience with 4-Methylmethcathinone (ID 72881)\". Erowid.org. Dec 22, 2008. erowid.org/exp/72881",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "64 kg",
 "report": "<p>I have recently started to experiment with this substance, first I bought 0,5 g, and liked it enough to order 10 g more.</p><p>Now 10g is a huge amount, and to measure up exact amounts is quite a problem without a good scale. but I tried to put it up in 20 different piles, and start from there.</p><p>Now this time I took about 250 mg I think, perhaps a little more.</p><p>I hooked up with my friends and swallowed a bomb of about 200 mg and waited for the first effects to kick in. About 10-15 minutes later I was feeling quite light-headed, a bit like the upcome of MDMA. At this point I decided to snort a line of approximately 70 mg or so. Now this tastes pure shit! If you have been snorting speed this is many times more foul tasting, not too hard though, just be prepared for the burning in your nose and the taste in your throat and you'll be ok.</p><p>Now perhaps 2 minutes after the nasal ingestion a warm rush washed over me and a tingling sensation was felt in my entire body. This was the peak of the MDMA-like feeling. Very nice and noticeable. My vision got a little blurred, still very focused. I sudenly got the feeling 'perhaps I took a little too much now', as the rush just kept intensifying. But just a few minutes after that thought I was already falling down again.</p><p>Now this is the problem with Mephedrone if you ask me. The rush that I like the most is very short. Indeed the drug acts for many hours, but the rest of the rush feels quite dull after that empathogenic floating feeling. And this makes people want to take more. Now that doesn't necessary have to be a bad idea. That depends on the dose I took before, and if I've been on any other stimulants recently. Amphetamines potentiate Mephedrone, but they also increase the risks, and that's something I wouldn't wish my worst enemy! So be careful and stay away from mixing.</p><p>I would describe it as the first 40-60 minutes being very similar to MDMA. And the rest of the rush being somewhat like the feeling between Methamphetamine or Methylphenidate (ritalin). this isn't a bad rush either, but it will not feel that special after the nice MDMA-like feelings. Now I don't have much experience with methamphetamine exept from Thailand where I have been ingesting 'Yaba' or 'Crazy Pill' as it would be translated, and I don't feel that's very pure. But the feeling is very similar to smoking those pills.</p><p>Anyway I was feeling great the whole rush out. Smoked some nice Northern light Buds on top of the comedown and that kept the feeling staying a little longer (or at least it made me focus more on what was happening). Not as good as MDMA, not as good as Amphetamine, but very good to be a legal substitute!!</p><p>This event took place in Sweden where 4-mmc is quite popular at the moment.</p><p>[Reported Dose: 250-300 mg]</p>",
 "year": "2008",
 "id": "72881",
 "gender": "Male",
 "timestamp": "2008-12-22T08:00:00.000Z",
 "views": "14515",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "",
   "substance": "4-Methylmethcathinone",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
