{
 "title": "Brushing the Common Decency of the Human Soul",
 "author": "Symptom6",
 "citation": " Symptom6. \"Brushing the Common Decency of the Human Soul: experience with LSD (ID 72952)\". Erowid.org. Nov 15, 2013. erowid.org/exp/72952",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "report": "<p>It's been a long night.</p><p>My last submission to erowid was at the age of 17. At that time I was determined, through the use of psychedelics, to unlock secrets of the universe, and while I have had my share of transcendental experience and startling revelation, I am now, seven years later, content with brushing up against the common grace of the human soul.</p><p>I hadn't had a good strong trip with lsd in many years, due to the consistently poor quality and low dosage of what was available to me. I recently moved back to the Seattle area from Portland, where, during my last few weeks it seemed there a was a large amount of synchronicity leading up to this experience, as I've always found the case when coming close to an intense encounter with psychedelics.</p><p>This particular evening, after spending the day sharing drinks with an old friend I hadn't seen in over a year, I had caught the bus to the closest place to my current home as possible and had just embarked on a seven mile walk to get home when I ran into my somewhat recently ex-girlfriend, with whom I had spent five years and we had a pleasant conversation during which she informed me she had eight hits of good acid with her that she'd be willing to sell me at a bargain. I bought all eight and intended to save them for later in the week, but a few miles into my walk I decided that, as I had no obligations for the next few days and would have the house to myself for the night, I should sample it.</p><p>I had been told that one was enough for a strong trip, but I've been the recipient of a lot of dubious dosage information, and so I ate two with plans to take a third if I didn't feel much within an hour. I ate the initial two around midnight, and the third around 1 am. Within a half hour I was beginning to feel it, and ended up getting a little lost on my way home.</p><p>Eventually I found my way, and being hungry, I ate a bagel, after which I proceeded to the back deck to sit and think about my life, my friends and the woman that til recently I had thought was the love of my life.</p><p>I am the product of a decidedly tumultuous adolescence and young adulthood, but from what better cloth are writers cut? I've recently become more confident and sure of myself than perhaps at any time in my life, and I came to the conclusion that in the different phases I had passed through, I had been attempting to define particular aspects of myself and then attempting to define myself as that aspect alone. It has only been recently, and especially after this experience, that I've been able to see the whole picture and truly come to terms with who I ultimately am.</p><p>I listened to the albums of The Books on my ipod all night, and decided that the path I was embarking on, to get a certification as an audio technician and take music classes in college is by far the best that I could have chosen for myself, and was amazed at the amount of work and passion that these two men had put into making such beautiful music with sounds most others would consider the noise of a normal day.</p><p>I came to the conclusion that the real importance of a life is whom one chooses to spend their life with and with what dynamic they interact. I am exceedingly grateful to have been able to share almost a quarter of my life (and certainly the majority of my adulthood) with someone so strong, caring and graceful as my ex, and while I miss her I know what would happen if we gave it another shot. I cried for the loss (albeit due to my own decision and action) of someone who was so important to me, but ultimately am glad that we may be able to still be good friends and hopefully spend some time together now and then.</p><p>I felt immense gratitude for the two other friends in my life who had played such important roles, and resolved to tell them and my ex how much they mean to me and to thank them for having been there for me when my own life wasn't going particularly well.</p><p>I'll be the first to admit that I have my share of vices. I've been known to occasionally drink and smoke to excess, and I am guilty of occasional lust, but tonight I've taken the first steps toward tempering those. I decided that, as I've recently been smoking far less marijuana than I had in several years, due primarily to lack of money and a quality supply, and had been grateful for the clear-headedness that relative sobriety provides, it seemed pointless to be drinking as much alcohol as I had been over the last year, and that if I wasn't driven to smoke something that has positive effects, then I should make an effort to smoke fewer cigarettes, which only provide a fleeting satisfaction, as well.</p><p>Regarding lust, which was large factor in the ending of my most recent relationship, I realized that there is nothing wrong with sex, as one is only sharing oneself with another person in a way that borders on boundary dissolving, but that due to the intimacy of the act, it's unwise to be frivolous with it, and ultimately was glad that, though the opportunity had been available, I hadn't made love to anyone since my ex. I thought about my unfortunate preoccupation with pornography and, while I understand this preoccupation and can define its origins, it is no longer of any use to me, and ultimately is only detrimental to the possibility of having another romantic relationship.</p><p>As all this was going on it came to be about 4:30 in the morning, and having finished off a pack of cigarettes in an effort to satisfy an oral fixation and alleviate my unconscious tendency to clench my jaw, I decided to go for a walk to find another pack. I reached the nearest gas station at about 5, but they weren't open yet, so decided to try the nearby Safeway. They didn't open until 6 am, so I wandered around the complex, appreciating the fading visuals and being moved by the sight of the rising sun and the sounds of The Books.</p><p>When the safeway opened I went in to buy my cigarettes, but after a lengthy and particularly awkward conversation, found out they were charging over $7 for a pack and so decided to walk further down the road to the next gas station.</p><p>After a half hour of walking, I realized just how far I would have to go to get to the next gas station (being on the sammamish plateau), and after appreciating the view of seattle from in front of the city hall, decided to head back and try the first gas station again.</p><p>I should mention, having read the books of carlos castaneda, that I was surprised to find that in the early light of the morning, and with the mild visuals that remained, I took note that the crows in the area, while flying, appeared white. I wasn't even sure they were crows at first, until I saw them land and heard them caw.</p><p>Eventually, around 6-6:30 am, I got back to the first gas station, bought a pack of smokes and walked back to the house, where, as my visuals had quickly been receding and my state of consciousness returning to a more and more grounded place, I smoked another cigarette (wishing I instead had a bowl) and laid on the couch to watch tv in hopes that I might be able to fall asleep.</p><p>It is now 6:30 pm, and even though I've come down to pretty much baseline, it's been 18 and a half hours since I took the first two hits and, while I felt particularly tired about 7 hours ago, having spent quite a bit of time lying on the couch seems to have been plenty restful, as I could easily stay up til much later this evening with no trouble. My body, however is quite fatigued and so I'm going to go lay down and see if I can't catch some shut eye.</p><p>Hopefully this was helpful for someone. I know a large number of the trip reports on here are focused on serious psychonautical exploration, but as I've grown older I've found my trips taking on much more of a grounded character that serves to reaffirm my beliefs and passions and help to solidify my goals and the path I've chosen to take to reach them.</p><p>Thank you for your time and your attention,</p><p>-Symptom6</p>",
 "year": "2008",
 "id": "72952",
 "gender": "Male",
 "timestamp": "2013-11-15T08:00:00.000Z",
 "views": "587",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
