{
 "title": "Mapping the Territory",
 "author": "Bhairava",
 "citation": " Bhairava. \"Mapping the Territory: experience with 4-HO-MET (ID 72983)\". Erowid.org. May 18, 2010. erowid.org/exp/72983",
 "substance": "4-HO-MET",
 "bodyweight": "69 kg",
 "report": "<p>After experimenting with this substance with careful 10mg doses, as I had a day off from work, I decided to give it a try with a larger dose to map the area of this new compound for me. With 10mgs I had experienced familiar, very psilocin-like mild effects.</p><p>It was a rainy and gray sunday, I was at home with my girlfriend and wondered how would it be to try a psychedelic in this casual setting. Usually I take some time to work the set & setting in some particular way and trip with certain friends. Now I decided to try tripping with my girlfriend around, although she's not into this kind of mind-searching herself. I sensed it could be a beneficial thing to do, to dispose myself to her for exploring our relationship on this sensitive state. So I explained her my plan and she was ok with it.</p><p>As I woke up, I was starving, so I ended up having a light breakfast of coffee and croissant. Then I waited for about an hour for the digestion. Next I weighted 15-17mg of this white powder, put it into a gel capsel and swallowed it.</p><p>00:00 - Ingested 15-17mg of 4-HO-MET</p><p>00:10 - Decided to take a shower. Very enjoyable.</p><p>00:25 - Out of the shower. Feeling some processes in my body.</p><p>00:30 - Some visual effects: surfaces breathing. Feeling a bit light-headed. Feeling the effects building.</p><p>00:45 - Developing fast. I visualise the gel capsel melting in my stomach and the substance hitting the digestion. Probably in a quite different manner than for example waiting for fungal matter to digest.</p><p>Feeling physically unstable, but not too nauseous. I take Shulgins' book Pihkal to my hand but I'm not in a mood for concentrating on reading.</p><p>01:10 - Cold sweat. Familiar psychedelic chill. Light nauseous feeling coming and going in waves. Feeling very sensitive. Need to take it easy and slowly.</p><p>Visuals are building. Surfaces breathing and moving. Reflection in the mirror seems very mystical and alive.</p><p>01:20 - Something seems to have been settled. Not feeling such a rush anymore. I smoke a little bit of cannabis to get rid of the nausea that's left. It helps. Gives a more stable feeling.</p><p>02:00 - Extreme sensitivity. My mind also feels like a one more sense, and my thoughts and emotions as sense impressions among others. Every impression feels amplified by ten.</p><p>My girlfriend puts some electronic music playing. Very soft and chill, very enjoyable. Nice synergy - the visuals are starting to move with the phase of the music. The plants around the house start to dance with the music - very groovy - inviting me to their party.</p><p>I have lots of thoughts and feelings of insight. I'm considering this particular setting for tripping and see some drawbacks. I feel some disturbances as I didn't explain enough my girlfriend this sensitive state I'm putting myself into. I feel like she could be more considerate with me as I can sense her occasional negative feelings easily, but then again this was my own choise so I decide just to surf through it.</p><p>02:05 - Feeling some pressure in the head. Like the blood would be packing there. Maybe there's some tension at my neck and shoulders that cause it. I decide to go to the balcony to cool my head a bit.</p><p>I notice that the visuals are fully developed now. This is one of the most visual trips I have been on. Classical psychedelic visuals. Things make patterns that dance with the music. Not imposed but created from the visual information around me.</p><p>02:30 - I'm surprised by the seeming clarity of the experience. Feeling somehow very clear-headed, but I feel also that there are some processes going on under the surface. Very clear, but very mystical and confusing at the same time. In a surge of inspiration I start describing my thoughts on this clarity to my girlfriend, just to see the futile attempt to form some coherrent and intelligent thought-constructs collapse into a sensless mass. Ok, leaving too complex speculation for later.</p><p>03:00 - Three hours gone of this gray sunday noon, and it already feels like that it's been the whole day. Time dilation. The wildest ride seems to be over, but I feel that there is very much some process going on still in my mind and body. The immersion is there, like in mushrooms. I can already concentrate in performing quite normal things quite sensibly, but can also easily sink into whatever I concentrate to.</p><p>05:00 - Friend comes over. I'm still high but it's quite light. The effect slowly wears off through the day as we spend the day by discussing excited philosophy and jokes about psychedelics and the reality.</p><p>I was surprised about the strength of the trip. I was lucky not to go straight into 20mgs, which passed my mind. This seemed to be a fully active dose already. Not too much to handle though. The substance seems very friendly, just like psilocin. I like it and think that there could be diverse uses for it.</p>",
 "year": "2008",
 "id": "72983",
 "gender": "Male",
 "timestamp": "2010-05-18T07:00:00.000Z",
 "views": "6863",
 "dose": [
  {
   "time": "0",
   "amount": "16 mg",
   "administration": "oral",
   "substance": "4-HO-MET",
   "form": "(powder / crystals)"
  }
 ]
}
