{
 "id": 7301,
 "title": "Interaction with Zyban / Wellbutrin",
 "date": {
  "submission": "2000-12-14T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Jennifer",
  "gender": "Female",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:45",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:15",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>I had been taking Zyban (a.k.a. Wellbutrin, a.k.a. Buproprion Hydrochloride, an antidepressant/ stop smoking aid) for about three weeks when I developed a strange skin reaction (severe itchiness).  At the time I thought the rash was related to the Zyban so I stopped taking the medication immediately.  I wasn't able to reach my doctor to talk to him about, so I didn't think about the effects of abrupt antidepressant withdrawal, and just went on with regular routine.  About three days later, I was at a club where several friends started taking Ecstasy.  I took one pill, and about forty minutes later I still felt nothing.  Every single one of those friends, all seasoned Ecstascy users, said they hadn't had such a good dose as that in a really long time.  Since I was disappointed with my response to it, I took another pill.  I started to feel something about twenty minutes later, but it was still not to the degree that my friends felt it.  I ended up having to take three pills instead of one.  I guess the antidepressant was still in my system.  Looking back now I know that I probably shouldn't have risked the drug interaction.  I started looking on the internet, and I can't find anything written about the dangers of Buproprion Hydrochloride and MDMA's interaction.  Since I am neither a chemist nor a psychiatrist, I can make a guess as to what happened, but I can't figure out the actual possible chemical reactions.  My trip was still great, and the next day I felt the familiar fuzzy, tired E hangover, which I happen to enjoy as part of the whole experience. However, about three days later I crashed soooo hard, like I never had before.  I couldn't stop crying; it was worse than any other depression I had ever had before.  It lasted for about two days, and I had to keep telling myself, 'it's just the drugs'.  I ended up finding out the the rash I originally had was due to a change in laundry detergent and not the Zyban, so I started taking the Zyban again.  I love taking Ecstasy, but I don't suggest taking it while taking Zyban / Wellbutrin.</p>"
 ],
 "erowid": {
  "id": "4190",
  "citation": " Jennifer. \"Interaction with Zyban / Wellbutrin: experience with MDMA & Buproprion (Zyban/Wellbutrin) (ID 4190)\". Erowid.org. Dec 14, 2000. erowid.org/exp/4190",
  "substance": "MDMA & Buproprion (Zyban/Wellbutrin)",
  "views": "11619"
 }
}
