{
 "title": "Visitation to the Spirit World",
 "author": "Emmanuel",
 "citation": " Emmanuel. \"Visitation to the Spirit World: experience with 2C-T-7 (ID 7305)\". Erowid.org. Jun 8, 2001. erowid.org/exp/7305",
 "substance": "2C-T-7",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7305",
   "Male",
   "",
   "Not Given",
   "Jun 8, 2001",
   "13445",
   " "
  ]
 ],
 "report": "<p>\n0:00 drop 3 gel caps filled with 20mg 2C-T-7. myself and a freind of mine decided to try 2C-T-7. Having done heavy doses of shrooms and lsd we felt up to an experiment with 2C-T-7. This experience was one that has changed me forever.</p><p>2:00 Visuals start. They were like nothing I have ever seen before holograms rising out of the floor. solid objects start to flow as if they where not solid but liquid. </p><p>4:00 at this point I start to lose time I am having difficulty seeing due to the psychedelic soup as it has been refered too.</p><p>After this, time ceases to exist all together and I am completely thrown into a world that I am going to attempt to describe to the best of my ability. I was told by my friend that I started to repeat the same statements over and over again. I remember bits and pieces of this but it seemed more like a dream then reality. I remember lying on a bed and I can't move. There are many strange voices around me I do not recognize them as human. The language I do not understand. next thing I know I am in a room with my father my friend and his mother and many other people. there are 4 clocks in this room each reflecting a different time but all the clocks are moving at a accelerated speed. As I look around I realize that I am under water. There are bubbles coming from everyone's mouth as they speak and as people move its as if there is a stobe light going. but the room is perfectly lit. every inch of mass and air  has a grid  so to speak. perferated boxes all perfectly aligned. I look at my father and those around me. They ask me to lie back on this pod and relax. everyone's pupils are diamond shape instead of circular. One of the people present hands me a drink of this nasty black stuff. I drink it and black out.  at this point I felt what I believed at the time to be my soul leaving my body. I felt my soul fall backwards out of my body and I felt free. I could feel a comfortable coolness blowing through my soul and I saw beams of light. my spirit started to move towards the lights as they got closer. I blacked out again. </p><p>At this point I am convinced I am dead. I could actually feel my blood running cold. Then I am taken to a place where my father and all my loved ones are present they tell me that they have the power to revive me but I have to take an oath to change my life around if I am to be rewarded my life back. I am brought to particular points in my life where I had made bad decisions and was told how I could reverse these things. After agreeing to change my life, I wake up and my dad is looking down at me and told me I had overdosed on some bad drugs. I was in a hospital. The trip all together lasted 20 hours or so. As far fetched as this all sounds this is exactly as I perceived it.  After coming out of this I consider myself lucky to have held on to my sanity. When I was blacked out I was drinking out of empty cups smoking unlit cigarettes and doing some pretty crazy stuff. If anyone decides to experiment with this drug proceed with caution. As unpleasent as this experiance was I do not regret having experienced it. I learned alot about myself and my life.</p>"
}
