{
 "id": 7305,
 "title": "Clarity is Orange and Hard to Swallow",
 "date": {
  "submission": "2001-12-25T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "FluxJunkie",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "4.5 mg",
   "administration": "oral",
   "substance": "Hydergine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>Being a second year student at a very trying university, I feel no qualms in enhancing myself by any means possible.  Recently I ordered from my local overseas unapproved pharmaceutical re-seller, Piracetam, Hydergine, and Vinpocetine.  The Vinpocetine I am yet to fully explore, but the Piracetam and, in particular, the piracetam with 4.5mg of Hydergine combination, I am now somewhat experienced with. ",
  "(To those not aware, piracetam is a cognitive enhancer, or 'smart drug,' not available in the US (but none the less obtainable)  it is reported to increase communication between the hemispheres of the brain, increase memory and recall, and increase creativity.  Hydergine increases cerebral blood flow and metabolism and is said to have a synergistic effect with piracetam.  Vinpocetin supposedly increases short term memory)",
  "Setting:  In my dorm, in front of my computer, about to write a paper (due tomorrow).",
  "Time: Approx 6pm",
  "Dosage: Piracetam 800mg, Hydergine 4.5mg, Red Bull Energy Drink 250ml x 2, PowerBar (Vanilla Crisp Flavor) x .5 (too disgusting to finish)",
  "Effects:  Approximately 30-40 minutes after consuming the nootropics, my ability to compose a paper subtly but noticeably increases.  Words flow easier, my sentence structure becomes more complex, and I feel more lucid.  That 'on the tip of my tongue' feeling I often get while composing a paper is non-existent.  I feel like I know just what to say, and the logical process of forming my arguments and recording them is noticeably easier than normal.  Improved word recall is the most apparent effect, as well as a general clarity and 'sharpness.'",
  "Around midnight, as I wrap up a very satisfying philosophy paper (on the role of strife as central to human nature, and the incongruity this theory faces with Platos theory of the Forms, for your information), my physical and mental tiredness catches up with me.",
  "One side effect of the nootropics that I (I know no one else who has used these chemicals, so I cannot speak generally) experience is a mild nausea / headache feeling.  I feel this with Piracetam generally, but it is more pronounced with the Hydergine / Piracetam combination.  It is minor, and not enough of an effect to interfere with the performance-enhancing effect of this combination, yet it is enough of an annoyance that it has so far precluded me from taking these drugs daily.",
  "I have only just begun to experiment with these chemicals, and I am hoping that with regular use the side effects will diminish.  Additionally, I have read that taking a choline supplement with Piracetam can diminish side effects, and is generally advised on a cognitive-enhancing regiment, anyway.",
  "'Evolution favors those who favor themselves.' - FluxJunkie</p>"
 ],
 "erowid": {
  "id": "4192",
  "citation": " FluxJunkie. \"Clarity is Orange and Hard to Swallow: experience with Piracetam & Hydergine (ID 4192)\". Erowid.org. Dec 25, 2001. erowid.org/exp/4192",
  "substance": "Piracetam & Hydergine",
  "views": "35053"
 }
}
