{
 "id": 7307,
 "title": "Sheer Craziness",
 "date": {
  "submission": "2008-07-20T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "MaryJane",
  "gender": "Female",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0:00",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "2:00",
   "amount": "0.5 tablets",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "2:00",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0:00",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(plant material)"
  },
  {
   "time": "0:00",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "4:20",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I should note that I had taken 10mg of adderall in the morning. Friday night my freinds and I decided we were going to roll. While waiting for the ecstasy to arrive I drank 4 beers. We all went to my friends house and dropped the rolls around 10:40p.m. They were green champagnes. Shortly before swallowing the roll my friend C gave me a medium sized line of cocaine.",
  "I was rolling hard by 11:10 and went about talking extremely fast and running around. My whole body was undulating with waves of pleasure and I felt pure bliss. I proceeded to lay with some friends on the couch and just talk and touch each other. About 2 hours into it I could feel the waves of intensity diminishing and I proceeded to snort another half of a pill and share the rest with my friends. It burned really bad and I remember my eyes watering and my nose just on fire. Then within a minute or two I was rolling full speed again.",
  "Over the next 1-2 hours I proceeded to drink around 4 more beers, smoke a couple cigs, and also a couple bowls and bubblers packed with nugget. The boys I was with and my one friend F decided to go back to the boys house since it was after 3 am at this point. Upon arriving there I proceeded to smoke a large bubbler packed to the brim with marijuana, and a couple bowls.",
  "Then they whipped out the cocaine. They cut up huge lines that were at least .3 - .4g's each. At this point I was extremely intoxicated already and was just CRAVING another burst of euphoria. I then proceeded to blow the fattest line on the mirror and inhale so deeply that I felt a bitter drip in my throat within seconds of inhalation. I collapsed back on the couch as my body began to tingle. Then the boys brought out a huge gravity bong. I proceeded to take an absolutely montrous hit and clear the whole thing. Within minutes my whole face was completely numb. I did not have a face. I had a pacifier in my mouth for grinding teeth and I couldn't feel it.",
  "I started to hear the voices in the room be really loud or really quiet and very distorted. I was slowly losing my grasp on reality. I have done a lot of drugs before, pretty much all of them, and in relatively high dosages, but never had I ever felt like this before. I suddenly felt like something was wrong, I was too fucked up. I was sitting next to a girl friend who realized something was wrong with me. I skipped twice on the joint going around and suddenly I was non responsive and out of it. She dragged me to the bathroom where I proceeded to barely even walk and fall several times. I was told that I sat on the toilet and she repeatedly asked me questions about how I was, and what I was feeling, and I just stared at her with a terrified expression on my face.",
  "Finally I said something like 'I need to go to bed' I then got up off the toilet and lay down on the bathroom floor. My body was pulsating with intense strange bursts of pleasure and then paranoia. My heart was racing a hundred miles per hour and I had no control over what was going on. My friend eventually got me up and went and laid in a bed with me. After the lights were out I started having full on out of control hallucinations. I saw people in the room who definitely weren't there. I was floating through space at one time richoching out of control. I couldn't move. My heart was pounding in my chest. There was a pulsating, intense, euphoric, yet almost scary sensation that was running up and down my body. I was scared that I had overdosed or mixed too many drugs and had completely lost my sense of reality and what was going on.",
  "My friend kept me awake for a little bit trying to talk to me and make sure that I was ok. Eventually she went to the bathroom and I had to go HORRIBLY but I could not move. I could not lift myself from the bed. I was completely immobilized, very euphoric and intoxicated, and also very very scared. I have no idea why I experienced this. I have a lot of experience with all of these drugs and I have never felt the sensations that I witnessed last night. It was very overwhelming and kind of scary to not be in control of whats going on and to be having full out visual hallucinations off of drugs that don't normally do that. I would not recommend the combination because it was just way too much."
 ],
 "erowid": {
  "id": "41935",
  "citation": " MaryJane. \"Sheer Craziness: experience with MDMA (Ecstasy), Cocaine, Alcohol & Cannabis (ID 41935)\". Erowid.org. Jul 20, 2008. erowid.org/exp/41935",
  "substance": "MDMA (Ecstasy), Cocaine, Alcohol & Cannabis",
  "views": "45255"
 }
}
