{
 "title": "Fun Until I Took It Too Far",
 "author": "KYMS2EVIL4U",
 "citation": " KYMS2EVIL4U. \"Fun Until I Took It Too Far: experience with GHB (ID 73081)\". Erowid.org. Aug 24, 2011. erowid.org/exp/73081",
 "substance": "GHB",
 "bodyweight": "138 lb",
 "header": [
  "DOSE:",
  "15 g",
  "oral",
  "GHB",
  "(liquid)"
 ],
 "report": "<p>[Erowid Note: 15 grams of GHB is considered an extremely high dose, see GHB Dose Chart]</p><p>I had begun to enjoy the benefits of GHB with my boyfriend. The fat burning muscle enhancing attributes GHB has lead to our usage. It started off as a weekend adventure, I found it to be very euphoric and fuzzy feeling.</p><p>As with all substances in my past, I have always had problems with recognition when enough was enough. Either I do not feel effects as quick as I expect or after a tolerance built up the amount necessary to get where I wanted was greater than the physical body can handle.</p><p>It started out as 1/4 to 1/2 of a 2liter bottle cap was enough to make me very lucid. After our weekend became every other day and over a year had passed, I found myself doing about 3/4 of a cap and when the effects weren't as strong as I had expected i started adding another 1/4 cap on top.</p><p>I found that knocked me out cold. I had awaken to many times of my boyfriend hovering over me shaking or slapping me awake. At one point I had passed out and started to</p><p>vomit, thankfully my boyfriend was present (and brave enough) to 'hoop and swoop' the particles from my airway to prevent aspiration. After many (20+) times of passing out or close call situations, my tolerance had increased and I found myself unable to sleep at night.</p><p>So, I did what normally I would do and took another cap... then another...etc... I'm still unsure of the actual amount I had ingested. I have no recollection of going to</p><p>bed that night, only what was told to me the next day.. I had went to sleep in bed as usual, and in the middle of the night I started flopping like a fish out of water. My boyfriend thought I was awake, when he realized I wasn't he knew exactly what was going on even without knowing the extreme amount I had taken to ward off my insomnia. He tried the usual tricks of slapping splashing and shaking me out of my coma like state. He said he was relieved when the convulsing had stopped and figured everything was going to be ok.</p><p>Within 15 min my breathing had become extremely labored then went into an almost undetectable state. He must have panicked because I awoke to the interior of an ambulance with its medics asking me the typical what's your name type questions (I had guessed the president of the US wrong and for the life of me could not remember Bush being elected) that was about the only memory I had from the whole hospital experience. The next day I was groggy and quite 'blah' but amazingly enough unable to sleep. The weirdest side affect I remember having was hallucinations of scorpions and other bugs, small but very real to me as I screamed for someone to do the squishing of my imaginary friends.</p><p>Needless to say that was the last time I allowed myself the capability to overdose, I had to end what I could not control. The great benefits of quality sleep and a toned</p><p>body were not worth the risking of my life in the fate of my own hands.</p>",
 "year": "2002",
 "id": "73081",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2011-08-24T07:00:00.000Z",
 "views": "5677",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "15 g",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 }
}
