{
 "title": "Algorithmic Gristle",
 "author": "Anonymous",
 "citation": " Anonymous. \"Algorithmic Gristle: experience with LSD (ID 731)\". Erowid.org. Oct 18, 2000. erowid.org/exp/731",
 "substance": "LSD",
 "bodyweight": "190 lb",
 "report": "<p>Over a period of four years I took LSD frequently, usually in the company of a close friend , occasionally solo. I was not on a sacred quest for 'truth,' nor did I have any scientific curiosity to test. My motivations were boredom and the desire to be entertained.</p><p>I'd had anxious moments on acid; questioned by police at 3am in the blackness of Snowdonia wilderness, nausea and paranoia, terminal depression at lowly self after backfiring tape 'experiment' ( really exercise in vanity--what did we expect to hear, erudite scholars??!!). Whether belief was actual or deluded, there was always a semblance of 'control.'</p><p>This one time I was working in a deli, finished at 7, summer night, scored some skunk, went to this friend's. Dropped a tab, chain smoked three big fat skunk bombers. Sat there, stoned before I'd finished the first. Put some music on headphones, can't remember what, this was about 9. Thinking, this is pretty strong. Something panoramic kept insisting itself. Felt like a Neanderthal. Felt saturated by the tremendous excitement at the epic scale of existence. The more intoxicated I felt, though, the more a kind of treacle-like animation came to me. Felt like I was sitting in the bottomless universe, not a room. The acid started kicking in--makes my jaw feel anaesthetised. My friend had been tripping for a couple of hours and was ok (we get pretentiously philosophical when we're on acid, possibly a bad idea--like navigating white water rapids on a sheet of sugar paper!). The conversation must have bent round that way; I really forget the details.</p><p>Well into the peak I was beginning to feel dangerously overloaded. I was gripped by something, I could hardly hear the music in the background. I wasn't panicky at this stage, but I was beginning to feel like I was heavily tripping and it was getting stronger and stronger, faster and faster. I started to struggle at this point.</p><p>Then I looked up. This was the peak of the trip. Orbiting above was  (I was convinced and am still reluctant to deride) an 'Awakeness' --a mindfulness, an empty awake, as indescribable as it was 'unformulated.' A molecular cathedral, not just structural but conscious. It was like watching a vast supertanker come into harbour--silent, majestic, powerful. The Secret tapestry, the first amphibian eye, the algorithmic gristle of consciousness.</p><p>I recall my friend sat at my side, indiscernible, a smudge through a broken lens. He must have stood up and decided to turn on the lights. At the instant the lights came on I panicked, horrifically. I don't really know what happened. In my sensitive state, the sudden influx of visual input...I don't know.  I was hosed down with alarm.  You know the glass chambers with a rubber glove in the side used for handling dangerous materials ? I felt like my existence--my self--had been slipped into something like the rubber glove. Visually everything was two dimensional. Reaching my hand out into no depth, perspective foreshortening seen as literal shapes. Everthing shimmering and changing in a visual soup of colour fields. My friend instantly saw I was in a bad way, and stuck with me and tried to comfort me through it. I found myself drinking water, the sensation just numbness at the point on the painting where my mouth was. He tried to cook something to take my mind off it, but I couldn't eat and I got mildly hung up that he was offended by this. He showed me a photograph of his baby niece; I remember thinking, 'that's just part of the process, nothing to get cute about.' Cycles of panic attack were hitting me, felt like they were going to explode. It was horrific, I felt completely mis-wired, the fit was too tight.</p><p>Come dawn I was still panicking badly, but felt like I could just keep on top. I cycled home at about 7 in the morning, still going. It took me till 3 in the afternoon to sleep, which I did briefly for about 40 minutes. Upon awakening, I sensed something had been irreparably alterered. I didn't feel 'out' of the trip, it wasn't like a comedown. Any comedown I had was like the abatement of a swelling after something new has been grafted on. I remember seriously thinking, 'I can't live like this.' For the next six months I was plagued by panic attacks--they'd seize me anywhere, and anything would set them off. If I stared at anything for long enough I would panic. I cannot touch anything that is mildly hallucinogenic, even weed,  otherwise I start tripping again for hours, and it's always horrific.</p><p>Thinking about acid now. Surely, it's a tool, a means to reveal that there are other ways of thinking and examining perception. But what are we going to do with that knowledge? Brains are going to change. Maybe acid won't affect them one day.</p>",
 "year": "2000",
 "id": "731",
 "timestamp": "2000-10-18T07:00:00.000Z",
 "views": "6851",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD"
  }
 }
}
