{
 "title": "Is This Smart Drug a Smart Buy?",
 "author": "Psycogenesis",
 "citation": " Psycogenesis. \"Is This Smart Drug a Smart Buy?: experience with Aniracetam (ID 73124)\". Erowid.org. Jul 10, 2010. erowid.org/exp/73124",
 "substance": "Aniracetam",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Aniracetam",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I found myself temporarily exhausted from my commonly researched drugs and decided I would do some reading on the so called smart drugs or nootropics. Due to the lack of information one researching these drugs can face, it can become hard to make sound conclusions about making a first purchase of one of these products. To help with this information ambiguity I became interested in adding to this section of drug experience literature, not to mention I and most other people could use a little boost to their memory.</p><p>My first and only purchase so far was some aniracetam. I chose aniracetam as my choice racetam analog to purchase after some research. I decided to purchase aniracetam which is reportedly longer lasting and widely available on the web for as cheap as 30$ for 100g. The recommended serving size is 1.5g a day making for a total of 67 standard doses in a 100g bottle.</p><p>For the first 3 days I poured 2g of the fluffy white, glistening, nearly tasteless, slightly bitter powder into my mouth, aiding the swallowing process by chasing with a flavoured drink. At no point during these three days could I notice even a hint of mental or physical alteration, positive or negative. The next four days I continued the dosing procedure but with 3g and with the same results, nada. The next week determined to feel anything from this smart drug I up the dose again to a large 4g sample for 7 straight days. What did I feel? You guessed it, NOTHING! It is now the 15th day of the aniracetam regimen and still not feeling any results, with one last token of hope I heap a staggering 10g into my mouth swallowing every last bit one hour before commencing this article. WOWwait, ummm, hmmm, yes, oh wait, no, still can't feel S**T.</p><p>If you look on the bright side at least there is no side effects or effects for that matter, so if your into wasting you money aniracetam is a good choice. It is important to note that the aniracetam was taken with meals and without meals in order to rid my curiosity of whether prior food consumption is a variable on the drugs absorption and effects. I also tested the variable of dosing size, and with the same result, no dose even up to 10g produces a noticeable effect on me. Maybe the drug needs to be taken for longer periods of time to become effective. I seriously doubt it will start working but I will continue to eat the powder like a meal until the bottle is empty, hopefully then I will feel a speck of something.</p><p>Despite this one set back I will not hinder to try another nootropic drug. Hopefully in my quest to find an effective smart drug I find an affordable option. The next drug I am planning on purchasing is the MAOI-B Deprenyl (selegiline). I truly hope deprenyl or any other nootrpic can be held high up on a pedestal like the claims behind aniraetam, or at least be good enough to put in my medicine cabinet.</p>",
 "year": "2008",
 "id": "73124",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-07-10T07:00:00.000Z",
 "views": "15881"
}
