{
 "title": "Very Good Experience Overall",
 "author": "Swifty14",
 "citation": " Swifty14. \"Very Good Experience Overall: experience with 2C-E (ID 73193)\". Erowid.org. Apr 4, 2010. erowid.org/exp/73193",
 "substance": "2C-E",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "10 mg",
  "insufflated",
  "2C-E",
  "(powder / crystals)"
 ],
 "report": "<p>I have experienced 2c-e once before, using 15 mg's. That time, I put it in a peice of tissue and swallowed it. This time, I decided I'll snort 10mg's as I figured it'd be a nice, mellow night to smoke some pot and have a nice trip.</p><p>0:00</p><p>-I put 10mg's on the table, crush it as much as I could (It was very flakey) and railed it. HOLY! What a burn. Right away I knew I was never going to snort this again, it burned sooooooo bad. And when I mean bad, I mean it was the worst kind of burn you could imagine to have in your nose. Never snorting it again. Ever.</p><p>0:10</p><p>-Already feeling the effects. My vision starts to vibrate a little, lights get brighter.</p><p>0:15</p><p>-Me and 2 other friends, one who was sober, other who snorted 10mg's aswell, get ready to go smoke some weed. We go to a spot about 5 minutes away, deep in the woods so we'd have no worries about cops.</p><p>0:20</p><p>-Me and my friend feel sick.. and just really bad. Very uncomfortable feeling. I assured him that after we smoke some pot, we'll be perfectly fine. He drank a few beer before he did it aswell, which would add to the stomach pains he was experiencing.</p><p>0:30</p><p>-After our sober friend rolled a joint, we smoked it. Now here was when both of us started feeling it getting stronger and stronger by the minute. It was getting so intense, and the stomach pains were gone. We got back in the car, blasted music, and just enjoyed being high. It was amazing.</p><p>0:45</p><p>-We decide to smoke more pot. Right now is about where we started peaking. We couldn't even look at the sky we were so high, all we seen was blur. Trees looked like a picture with an infinite backround. Everything looked different.</p><p>0:50</p><p>-We smoke 2 more joints, and this is where it gets really messed up. We got back in the car, I went in the back seat, and EVERYTHING looked like a pattern, EVERYTHING. Windows, the top, the front, everything. It was all so cool, it reminded me of ancient drawings. Fantastic. Colors were changing now to, in my peripheral vision, the windows changed color from purple, clear, to green, back to purple. Reminded me of acid.</p><p>0:50 - 4:00</p><p>-All we did was smoke weed, blast music, hotbox the car, and enjoy life. Visual still were amazing, but we decided soon that we should go back to the apartment. Euphoria was steady, especially when a few particular techno songs were played.</p><p>4:10</p><p>-We arrive back to the apartment, but its really starting to wear off. Visuals are still there, but not as intense. We decide to roll one more joint, smoke it, play house of the dead 2&3.</p><p>5:30</p><p>-I am wide awake, can't sleep, but my 2 other friends decide to go to sleep. I was in/out of sleep for about 6 hours till I had to get up. I literally felt like I was awake the whole night, but I wasn't. Next day I didn't feel to bad.</p><p>Overall, it was very good experience.</p>",
 "year": "2008",
 "id": "73193",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-04-04T07:00:00.000Z",
 "views": "2513",
 "dose": {}
}
