{
 "title": "A Newborn Third Eye Opens",
 "author": "The Wandering Soul",
 "citation": " The Wandering Soul. \"A Newborn Third Eye Opens: experience with LSD (ID 73201)\". Erowid.org. Dec 25, 2012. erowid.org/exp/73201",
 "substance": "LSD",
 "bodyweight": "115 lb",
 "report": "<p>First of all I must say I was very nervous. I had no idea exactly what to expect and I really didn't have time to process or question. I learned of the substance that morning and within about a hour I found myself sitting in front of My Love with two Sweet Tarts in hand (Matrix-style with a red in one hand and a blue in the other), asking which would I choose.</p><p>My Love ended up letting me take both while he stayed sober (well more sober heh) to be a sort of trip-sitter, a solid ground if I ever needed it, which was quite a sacrifice and I'm very grateful.</p><p>He placed the two in my mouth and I realized there was no turning back now. I sat there and a flood of questions started coming to mind. When would I feel it? How long will it last? What will be the first sign? ...blahblah blah... My Love answered a few of my questions and then told me to just calm down and get ready to go. We were planning on going to our destination to meet up with M and trade a sack of marijuana for the 2 hits that were left.It was about I'd say 5 or 6 in the afternoon by now. The sun was still high in the sky and my experience had just begun.</p><p>The car ride down the Interstate 40 was nerve racking. I was constantly moving and hyperaware of any sensation, more due to the nervousness more than anything else. I tend to be a nervous person when dealing with anticipation and this experience was no exception.</p><p>My Love wanted to stop in at the liquor store on the way to our destination to buy a bottle of wine, and I was to purchase it. By this time, about 30 minutes into it, I really didn't feel any different and started having my doubts. I got out of the car and walked across the parking lot. There was a surprisingly large amount of people at the liquor store and it made me feel weird about going in. I just played it cool though, and walked right in past all the rednecks and frat boys and on to the wine isle. I noticed right away that the reflection of the bottles on each other tripped me out. The labels bending around the refractory of the liquid inside seemed strange and slowed. I quickly looked away and walked over to My Love's side so as to not bring unwanted attention to myself. I whispered to him something strange had happened and he just smiled and picked out a bottle and handed it to me. The line up front was concerningly long, but then a opening suddenly presented itself. I didn't want to look the guy in the eyes, since I could feel my pupils were stretching much larger than necessary. Both me and My Love noticed me acted weird and stated a halfhearted 'Wow.' when I approached. It seemed like he could tell something was up but I'm pretty sure he was way off with whatever he assumed.</p><p>We finally left and headed on to our destination. I told My Love to put on Jefferson Airplane, I've grown a fondness for classic rock since starting college. I had stated if I ever came across doeses I wanted to listen to 'White Rabbit' and I finally got my wish. We turned it up and I laughed the whole time and My Love even sang along which only made it even more perfect. I like to think back and refer to that moment as the moment I knew I was beginning to trip. The windows were down and the music was perfect. The trees and grass surrounding the road were a vibrant green and seemed more alive than usual. I could do nothing but smile.</p><p>We finally arrived at our destination. It had been about an hour since I had taken them. We drove up to M's apartment and went in. He greeted us with a nice welcome and invited us in. He soon figured out I had already taken them and was beginning to trip. He seemed to get excited about tripping almost instantly. And quite honestly, I was ready for someone else to join me on my journey. Though I'm not exactly very close with M, I was open to experience it with him.</p><p>So now it got more interesting. We went into his room and I sat on his black and white striped couch...you might remember it, it was in the old Russellville house. We smoked a bowl or two and I sat back and just watched the manifestations of my creative brain.</p><p>At first the visuals were subtle. The carpet seemed to move within itself randomly when I concentrated on it, but for the most part the effects had not brought forth their full potential just yet. M proceeded to put on some fuckin' CRAZY music, some kind of techno shit that quickly sent my brain into overdrive. I folded the paper sack the wine bottle had been in into a series of folds and started making shapes and random, strange folds with it. I think I probably fascinated myself with that for almost an hour. The folding was more of something to occupy my hands while my brain went on strange tangents about all kinds of subjects, most of which I can't recall. I was actually very surprised at how intellectual the experience was. I spent most of the trip thinking of all kinds of things.</p><p>By now the trip started to show its true colors and M started tripping as well. I went down the hall to find the wood door to the bathroom to see what would happen. I looked at the wood grain, and it was amazing. It was shifting and melting everywhere. I felt that I could touch it and it would have rippled like water. I stared at it for a little while, but then someone needed the bathroom so I shifted my attention else where. I went back to the bedroom and listened to more crazy music. By this time my trip was in full swing. The carpet was moving, shifting; the posters on the walls had their own life about them; the striped couch continuously created all kinds of optical illusions. Everything in the room had a life about it and every texture created a new experience. Time and space lost their hold on my mind as well.</p><p>I eventually asked for a piece of paper to draw on, and M handed me everything I needed. I meticulously drew a humming bird approaching a flower, and worked on that for a while. I noticed that there were two pieces of paper on top of each other, and I kept seeing pictures behind the one on top as if drawn on the other piece of showing through the thin paper. I saw eyes mostly, eyes of a dragon or just decorative eyes with no real identification. I tried to follow the sketching of one of these eyes but soon the image shifted into something else. I then drew my 'power' animal with the eye I had draw which supposedly is a deer. The deer ended up having peacock-eye feathers at the ends of its antlers and were meant to give the aire of a unisex animal.</p><p>I drew for a long time and everyone eventually left the room. I was so involved in my drawing that it was no concern of mine. I actually liked the alone time. I was able to explore my surroundings without anyone there to cause me to feel self-conscious and I was so involved with trying to create the expressions showing themselves to me I didn't even really feel alone at all.</p><p>All of this was a crazy experience for me. It was my first time, and I tried to keep everything as positive and light-hearted as possible so as not to trigger any kind of 'bad' trip. If I ever get the opportunity again I will explore the deeper side much more than I dared this time though not to say I didn't have some real revelations.</p><p>When everyone came back into the room I suggested we go for a walk around the block. They seemed a bit reluctant but then warmed up the the idea. We went outside when the the sun was just setting so I would say it was about 8:30. The dusk sky looked amazing. I had trouble taking my eyes away from it actually. We walked for was seemed like forever even though in actuality it was about 15 to 20 minutes. I specifically remember M handing me a strange little white piece of gum while walking down the road. I put it in my mouth and suddenly was overwhelmed with all kinds of crazy sensations of taste, texture, and strange simple movements of my jaw all combined was almost too much for my brain to process and walk at the same time. I literally gasped with amazement and almost fell over in the middle of the street.</p><p>I then decided to go walking through someones yard with tall vibrant green grass. The grass was so strange. I had no real concept of how tall it actually was and it seemed the more I walked through it the taller it got or the smaller I became, both seemed equally plausible at the time. M soon followed and thought it was equally crazy.</p><p>We got back and I walked around a little bit more before going inside. Being outside was a wonderful experience and I didn't really want to be inside but it was dark and the night is not the time to walk around such a place especially tripping balls on acid. So I eventually went inside and back to his room to smoke a little more and chill. At this point I can't really remember anything specific. I mostly sat back and explored my thoughts and more strange visuals for I guess a few hours. I remember watching people talk among themselves and almost feeling as if I wasn't actually in the room with them but just observing from some third party perspective. The intellectual side of the trip came into full swing now and I was lost in thought for at least an hour or so I believe.</p><p>The next thing I know it's 1 or 2 in the morning and My Love started to express his want of heading back to my residence since he had to work in about 5 hours. I didn't want to leave. I was completely awake and mentally engaged with no sign of comedown any time soon. I soon realized we needed to go though and we said our parting words.</p><p>The ride back I become extremely self analytical suddenly. It was a cycle of self doubt, self comfort, and self realization. It never became a true negative experience but I did learn some personal patterns and 'flaws' of my personality. When I look back it helped me come to terms with myself on a very real and personal level. I am a better understood person because of this experience and I was able to see things clearly about my personality for the first time in a way. During all of this, My Love let me know I was probably coming down a little and things tend to swing toward the negative if you allow it. I doubted my actions throughout the night and questioned if I expressed the right energy towards the people around me. I became slightly disgusted with myself at one point but then realized the negative energy was completely unnecessary and I was determined not to ruin this experience with shallow thoughts of social anxiety.</p><p>After the nice long talk, we finally arrived at the house. my Love was very tired by now and suggested we put on 'Blue Planet', an animal documentary of ocean creatures. I've been fascinated with animals my whole life so I have quite a collection of such entertainment. I watched 2 episodes with 'wide-eyed-wonder' haha. I have watched all the DVD's at least 3 times each but it was like I literally was seeing it for the first time again. I was completely amazed at the sights in front of me. There were millions of shinny silver fish all swimming together as one massive organisum with the ability to mold and shape itself. There were massive whales diving slowly into the deep and strange translucent creatures with huge dark eyes and glass like fins floating about the darkness of the deep ocean. All kind of things! I was blown away for a good hour just watching this show.</p><p>By this time My Love was asleep and I was trying to occupy myself. The wood floor no longer shifted like it did when I first arrived so I knew I was coming down. I ended up watching an 80's music infomercial for a ridiculous amount of time but I finally snapped out of it and changed the channel to man that was telling a story of being bitten by a diamondback rattle snake in the middle of the wilderness. He had an amazing story and I hung on his every word of the ordeal.</p><p>I also watched a CNN special call 'Tibet's warriors' on the Tibet monks dealing with the oppression of the Chinese government. A small part of me became Buddhist I must say. Their story was one of honor and courage that I rarely see in our contemporary society.</p><p>I ended up not resting my eyes until about 6 in the morning. I say rest my eyes because I never really fell asleep. My mind was still engaged but slowed due to the 10 hour trip. I woke 4 hours later completely refreshed and ready to see what the day would hold. I felt I had an after glow almost and I was extremely content. I went all day feeling very mentally alive and almost having an aire of rebirth. The next night was when I finally got a true night's sleep.</p><p>When I look back I had one of the most amazing experiences of my life. I was able to look at life unbiased and open to interpretation. My mind felt clear and revived. I realized I am the master of my reality and I can always choose how to react and to react negatively is both detrimental and unnecessary in most cases. I feel more alive, really. I've been sleeping in a normal daily routine for so long I didn't even realize, but now I am awake. The main difference is I've been exploring the spiritual side of myself again. I used to be Christian but that idea slowly grew stale and impersonal. Buddhism is one of the ideas I will explore more now though to be solid in one way of thinking is not my goal. All in all, I had a wonderfully profound experience and I will hopefully never forget it.</p>",
 "year": "2008",
 "id": "73201",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2012-12-25T08:00:00.000Z",
 "views": "11893",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
