{
 "id": 7320,
 "title": "As I Go to Bed",
 "date": {
  "submission": "2005-04-04T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Tetan Han",
  "gender": "Male",
  "weight": "88 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "6 leaves",
   "administration": "smoked",
   "substance": "Coleus",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>After hearing that this shrub has a mild halucinogenic effect, I decided that it will help me get on my very first journey into the depths of my mind. I have never tried anything that is really psychoactive, except for cannabis, but it turned out that I'm immune to it(?!) Coleus seemed to be the perfect, lite and legal ticket to 'the other side'. So it was really easy to find this plant, it is quite popular 'round here. I picked a few (6) leaves, put them on 50^C (122^F) to dry. When they got dry I crushed and smoked them. That was a very unpleasent process. The smoke was burning my mouth and nose and air pathways....so harsh....just painful. Anyway, when I finished it I needed a lot of juice to wash the taste down. So I sit on the sofa and wait, and wait....",
  "Nothing. What a load of crap. I was so excited, adrenalin was pumpin' yet nothing, not a vision blur....just nothing. I threw the rest of the leaves away. 'What a day, I'll go to bed early', I thought. And as I fall asleap, relaxed and tired aprox. 4 hours after my failed journey to where 'no man has ever been before', I begin having those strange dreams that you have a little before you are quite asleep. I did not find this to be unusual, so I proceed with my sleep.",
  "In less than three hours I'm wide awake, in my bed and trying to remember what the hell happened. I don't dream a lot nor often, but I just had about three hours of very intense dreams. Still, I refuse to belive that this is caused by Coleus, and I fall asleap again. Then came a period of about 6 hours of unusually intense and very realistic dreams. The things I dreamed about were quite usual, but they looked very real. Very real. I found this interesting, and the next time I woke up I was sure that this is in fact my very first and very mild ...trip. It's not much, in fact it can't be called a trip at all, but it seems that this plant is worth experimenting with. And the dose was quite low, the smoke was terrible, so I took small hits. Anyway, the next morning, I was in a perfect mood, not tired at all, inspite the fact that I was waking up all night.",
  "So Coleus has something hidden, and it is my task to find out what it is. Next time I'll try eating some. I do not have a lot of experience, so I'll be careful.</p>"
 ],
 "erowid": {
  "id": "41989",
  "citation": " Tetan Han. \"As I Go to Bed: experience with Coleus blumei (ID 41989)\". Erowid.org. Apr 4, 2005. erowid.org/exp/41989",
  "substance": "Coleus blumei",
  "views": "13694"
 }
}
