{
 "title": "Dumbarse Double Doses",
 "author": "McA",
 "citation": " McA. \"Dumbarse Double Doses: experience with H.B. Woodrose (ID 73250)\". Erowid.org. Dec 10, 2012. erowid.org/exp/73250",
 "substance": "H.B. Woodrose",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "26 seeds",
   "oral",
   "H.B. Woodrose",
   "(ground / crushed)"
  ]
 ],
 "report": "</p>[Erowid Note: 26 H.B. Woodrose seeds is considered an extremely high dose, see H.B. Woodrose Dose Chart]</p><p>I've been meaning to transcribe this from memory for a while.</p><p>Well, in my neverending quest to transcend reality I discovered that not only are HBW seeds cheap but they are effective and easy to get my hands on.</p><p>I bought 50 off of Ebay for a reasonable price and had them rock up in my letterbox about 3-4 days later. I could barely contain my excitement at getting my mitts on these isoergine laden seeds of the gods and the pantheon of the soul.</p><p>Having scrupulously read the entries for them, I decided that as an experienced psychonaut with uber willpower (ha!) a good starting dose would be 13 seeds. I placed them in a plastic bad, smashed them into a powder with a hammer and then finely ground them in a mortar & pestle. To this I added about 45ml of water and the juice of half a lemon and let it sit in the dark for about six hours. When I believed the LSA/ergine extraction was complete I poured the slush into a glass, added some water for volume and downed the lot.</p><p>Well, despite being excitable and having prepared well for the experience I only noticed a small amount of Mayan-Paisley hybrid patterning on the carpet, and was totally overwhelmed by fatigue less than two hours after consumption and was unable to stay awake. I passed out and awoke 12 hours later covered in sweat after some reasonably vivid dreams involving floods and me running for my life.</p><p>This, I decided, was wholly inadequate for my needs (and wants). So two days later, on a Saturday, I, being the intelligent individual that I am thought 'Well, why not simply double the dose and go balls to the wall? It can't be that strong'. This was the decision that resulted in me being in total kill-me-now-please-god mode for the next three days afterwards and I swear to Kali and Vishnu that I will never do such a recklessly stupid act again.</p><p>The same procedure was followed, except I pulverised 26 seeds (following the same preparation method). After leaving them to sit in the dark while I went out and did some errands I returned, dumped my shopping in the cupboard, put on some Nina Simone and sculled the lot with a quick soda chaser. Things went smoothly for the next hour or so; I had some powerful nausea but a quick spew fixed that - for the time being. I don't have the best recollection of what happened but I'll give you the gist of it.</p><p>+1:30 - Fast-onset strong drunk feeling, followed by dissociated and super duper random thoughts. Couldn't concentrate or even remember what I was just thinking - or doing.</p><p>+2:00-2:30 - The shit has hit the fan. The carpet seemed to be extruding itself in pulses, or waves. Objects in the room such as the television swelled and deflated at an extremely uncomfortable pace. The horizon line I had firmly established to avoid nausea (the windowsill) decided to tilt 80 degrees from left to right in rapid succession. With seconds of notice from my belly, I ran to the toilet and performed the most sickeningly powerful chunder I have ever done. Imagine gastroenteritis spew multiplied by 20. I remained hugging the bowl with my eyes shut for what seemed like hours but was in fact only about half an hour.</p><p>+3:00-X:XX - After I stumbled away from the toilet and washed my mouth out with listerine I managed to hobble around the house in total bewilderment. Any pattern, any pattern at all be it the spackle on the walls, the tiles in the kitchen, the fabric on my jumper - it all started moving inwards on itself like hundreds of black holes had suddenly appeared and demanded a sacrifice of cheap, shitty materials. Coupled with the extreme nausea I still felt I realised that I had gone way, way overboard and was going to be paying for it in a big way. I recall falling over on the grass on the back lawn and curling into a foetal ball for at least several hours (it was dark when I managed to stumble back inside), spasming violently from stomach cramps and throwing up sporadically all over myself.</p><p>+X:XX-X:XX - I dragged myself into bed, covered in my own stomach acid and for several hours laid there, curled up wishing I would die but simultaneously debating whether or not to call an ambulance to avoid that seemingly very real possibility. By the grace of Yahweh I did eventually fall asleep to imagined sounds of metal being cut with some kind of power tool, and other things I cannot clearly remember.</p><p>I awoke the next day with no visual effects but to my chagrin I had shat myself and also vomited all over my once-prized Sci-Fi book collection. When I went to stand up I realised that my knees and ankles felt like they were on fire, literally burning white-hot. I screamed, freaked right the fuck out and ran into the shower to douse myself in cold water. For the rest of the day I attempted, in between violent vomiting fits and what I can only describe as excruciating pain in my leg joints, to clean up the filth I'd left plastered everywhere but I didn't get much done.</p><p>Repeat symptoms and fast forward two days; My knees and ankles had swollen to almost double their original size so I finally gave in to the unbelievable shame and went to see a doctor. The doctor examined my legs, looked in my ears and eyes and told me that I had a case of acute Gout. I didn't believe him - Gout was what pissheads and old women get, right? Wrong. Being an inquisitive and not too gullible man the doctor asked me what I'd taken, and being honest (and in too much pain to lie) I told him a shitload of HBW seeds. He told me (in kinder words) that I was a fucking idiot and that thanks to my quest to get off I had probably done some maybe temporary, maybe permanent damage to my kidneys and that I was now essentially pissing into my legs because my kidneys weren't working properly. Un-fucking-believeable.</p><p>Fast forward two more days (and a shitload of ibuprofen later), mid-week. The ibuprofen (and much Gatorade) has worked wonders on the gout and lucky days, I'm in the hospital having a blood and urine test performed and experiencing the joy of getting fluid taken out from under my kneecap (it hurts like you can't imagine) to determine whether or not I'd really fucked up my kidneys or whether it was temporary. Apparently they measure the uric acid content in your knee joint fluid, urine and blood to get an indication of whether or not you've done your dash.</p><p>Fast forward to a few days later, maybe early the next week. With an unbelieveable sense of relief I discover that no permanent damage has been done, and that my problems were caused most likely by three things:</p><p>1) Being an idiot;</p><p>2) Taking way too many HBW seeds;</p><p>3) Not drinking enough or any fluids during my 2.5 days of nauseous hell.</p><p>That was about three months ago. I am not a religious person but the feeling of imminent death I felt was almost enough to tempt me to beg YahwehChristVishnu for salvation.</p><p>Don't do what I did. It's demented. I still freak out a bit when I think of what the seeds, and my idiocy, did to my body and mind. Vomit, vacated bowels and violent body pains. Dum der dah dum dee.</p><p>I hope this all makes sense and that you get the gist of what I am trying to express.</p>",
 "year": "2008",
 "id": "73250",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-12-10T08:00:00.000Z",
 "views": "3186"
}
