{
 "id": 7326,
 "title": "The Wrong Sitter",
 "date": {
  "submission": "2007-06-11T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mud",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "1:00",
   "amount": "5 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  },
  {
   "time": "1:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I was in Tortola in the British Virgin Islands vacationing with my family and a friend who we will call Dick. We had rented a boat and were moored in some bay just messing around on the beaches, we go up to the Rastafari's and they treat us well because they know we are not gringos; they treat us like neighbors and good people because we are not American (we originate from Boricua, la isla del encanto... Puerto Rico). So we have some money, we spend $20 for some weed. The Rastas were nice and gave us a generous amount, we would have to pay $40 or more back home for what they gave us.",
  "So we were supplied with weed. A few days later, we tell my parents that we were going to the beach to chill out onshore. They had just had a fight and we wanted to escape from the hectic feel of the boat. We took a dingy to shore and tied up at a small dock. As soon as we disembark and reach terra firma once again, another friendly Rastafari, this time clad in jewelry and a small backpack, calls us neighbors once again and offers us some magical mushrooms. This is more than we had expected, and it would be my first time trying shrooms. The fight my parents had really hadn't had an emotional effect on me, I am quite callous seeing as they do it very often, so I decided I was sound of mind and capable of handling the trip.",
  "We hand over our last $40 and he gives us the entire bag of freshly picked psylocibin shrooms. We check for blue bruises, and everything is as it should be. Dick had already had his share of psylocibin experiences, and he would remain sober save for two beers to check up on me. We store the shrooms in the dingy seeing as the sun had not yet slipped and fallen, it was somewhere around 7:00pm. I decide I would smoke a joint, so we walk around town for some time and I light up. Once I am done with the precious herb, we go to a small bar and make friends with the tender and have a beer.",
  "We go outside and see that the skies are a pleasing dark blue and the sun is no longer up and about, so we make our way back to the dingy and uncover the shrooms. Sitting there in the boat, Dick picks out the finest of the batch, cleans them of a bit of the muck they have around the stems, and hands them over to me consecutively. I look at the first one, smell it, touch it, then slowly bite into it. The taste was pleasing; I put the whole thing in my mouth, ground it, and savored its unique flavor. It was quite enjoyable for me, even though I had not thought it would be.",
  "I take about 5 caps and stems of varying size, but most of them are small. They were all very fresh; I could feel the moisture emanating from them in my mouth, it was sort of refreshing. I down that with plenty of water, and then prepare myself for whatever might come up next. The time is about 8:00pm. Dick and I then leave the dingy and step upon terra firma once more, I decide I would like another joint since I am feeling sort of tense, so we go for me to smoke it on the farthest side of the beach.",
  "After the joint we lie down and talk for a bit. Dick says he wants another beer, so we decide to head to another small bar. The time is 8:30pm or so. I look down into the sand and I see words written in it, but I keep walking and the words keep re-forming while I walk. I tell Dick that the shrooms are beginning to take effect and that my body feels like it's made of a million snakes. We walk into the bar, and he has another beer but I just sit and stare at the floor. I see a pattern like the ones that bandanas have on them, only it is everywhere I look, slowly morphing.",
  "I look up to Dick and see that his body is sort of slug-shaped, and I look behind me but I am frightened by what I see: There are girls dancing, and there is a large man standing over them. I jolt back around immediately and calmy inform Dick that I would like to leave. He says 'Fine, give me the money'. I reach into my pocket and hand him a dollar, this makes sense to me. I have given him the money. 'What the fuck, Mud? Are you telling me this is the only thing was have? What the hell is going on? Reach back in your pocket and give me the rest of the money!'",
  "Why are you agitated? Calm down, we can get more money if we need it. Don't stress out, everything will be fine! 'We don't have any money, and I'm not going alone to the boat, what the fuck?' Chill out you idiot. I reach back into my pocket and I find the rest of the money and I hand it over. 'Don't ever fuck with me like that again, Mud!' I don't know what you're talking about. I honestly didn't think I had any more money. I was really upset that he had gotten so excited over something so stupid. My friend is an idiot. I think the people in the bar are looking at us, and paranoia begins to set in. Let's leave the bar, Dick, let's get out of here.",
  "'Ok, let me finish the beer'",
  "Once he's done with the beer, I have a hard time getting out because there are more people coming in. We sit down outside on some chairs that were on the beach. My face feels like it's melting, and I am uncomfortable. I look at structures and see people there, people that couldn't possibly be there, so I look again and they are gone. They remind me of the 'shadow people' that tweakers see. However, I am not scared.",
  "I am sleepy Dick, let's go back to the boat. At this point, Dick is messing with me. He is trying to make my eyes go sideways and I get pissed with him. Stop fucking around, asshole! I want to go back to the boat! Also at this point, around 9:30pm, I am having memory problems. I ask Dick various times 'What just happened?', and he became very agitated. I felt frustrated because I thought we had fought or killed someone. I had realized that Dick is an asshole and that I don't ever want to see him again.",
  "Dick becomes frustrated with me, after trying to explain that my parents are still awake and we will get caught if we go back to the boat like this, but he gives up stupidly and decides to take me back.We get in the dingy again, I'm not sure how, and Dick drives us to the middle of the boats and turns of the engine. He plucks a joint from his pocket and tries to hand it to me, and I resist furiously. No! I'm not going to smoke it, fuck NO! I've already had ENOUGH! I JUST WANT TO SLEEP!!!",
  "He tries to calm me down, but at the same time he tries to give me the joint. I hate him, I want him to go away. He is more than just a simple annoyance and brother (not by blood), he is now a threat. He gives up again, so he starts up the engine and takes us back to the boat. It's around 10:30pm now, and we have come back extremely early. I ask him 'What is going on?'. 'We're going back to the boat and you need to tie the fucking knot, that's what's going on, goddamnit' I hate him. Can't you see I'm on a trip? Can't you fucking calm down? Why the fuck are you acting so retarded?",
  "We get back to the boat and I tie the knot perfectly even though I had just learned how to tie them earlier that day. I go up the stairs and onto the top deck, and my parents are sitting and drinking right there. My father asks me the million stupid questions he always does; 'Hey how are you?' I'm pretty good, just tired. I'm going to go in for some sleep. This should be the end of the conversation, but no. 'Where did you go?' Just around, to bars and stuff. I'm spacing out and looking into the distance as I respond. 'Did you eat?' Yeah. 'What did you eat?'",
  "At that point, I am frustrated with his interrogation. He doesn't speak like a normal father, he speaks like the insane vietnam marine vet he is, so I turn around and go inside. 'Mud! Come back! I'm talking to you!' Dick says: 'Mud! Your father is talking to you!' No.",
  "I go inside and I lay down in my bed, with my sandals covered in sand, I dirty the entire room. At this point, I set my mind to go to sleep and that's what it's about to do, my father comes in the room and continues the interrogation. I black out, and give generic nonsensical responses to all questions. 'Yes, no, I don't know, What? What just happened?'. At this point my entire family comes to see me and they all bitch at me about how drunk I am, and my father comes and gives me a bottle of water and some advils. I down them like they're candy, but I hardly drink any water. It feels like I've spilled all the water all over me, but this did not happen.",
  "This is where the fun begins. Time unknown. I go from this world into the next. I hallucinate various situations, but I am engulfed in them and I believe them. I hallucinate that I am speaking to my parents. I tell them that I feel like I want to die. 'What? What is wrong with you?!?! Do you need to talk? Why do you say that?' Nothing, it's just that I feel I want to die, there's nothing wrong with that, is there? 'How could you say such a thing!?!?'",
  "Next hallucination: I am still with my parents, only the conversation changes. I tell them that having sex with my girlfriend is nothing wrong and that they could fuck off if they didn't like it. I have various fetishes, and I live them out as I wish.  'How could you?!?! What the hell is wrong with you?!?!'",
  "Next hallucination: I am still with my parents, and I somehow think I am gay. I tell them that being gay is nothing wrong. 'Oh no, don't worry about that, hahaha!' But you guys won't love me, you guys hate gays, how will I ever be accepted? 'No no no, don't worry about that! It's nothing wrong!'",
  "Next hallucination: I dream up the situation that Dick and I are in our bunk and that my parents have caught us rolling up a cannabis joint. 'How long have you been doing this?' A couple of years 'Why do you do it?' It's nothing to worry about, it doesn't do me any harm, I like it, I'm not addicted, I won't get addicted, this shit isn't addicting. 'Liar!'",
  "At that point, my auditory hallucinations became very exxagerated. I could hear their voices screaming at me. They would insult me in spanish: '!Cabron! !Que idiota tu eres! !Ya tu llevas un buen tiempo haciendolo, te jodiste, moron!'",
  "At this point I look up at the ceiling and I am transported outside. I'm floating in the water, I am looking up at the stars and the ships, and it is very beautiful. However, my ceiling had four lamps in it, so they mix with the image, and I am convinced that UFO's are hovering above me. I am not scared. I then begin having very harsh emotional feelings. I am convinced I am crazy. I look up to the ceiling again and I see the word 'SCHIZOPHRENIA' spelled out in clear black font. I begin to feel very sad, like my mind has been erased and I am talking to my family but I can't remember them. I ask them if I am crazy, then I re-assure myself I am insane.",
  "After this, the most intense depressing feeling I have ever felt in my life overcomes me and encompasses everything, the hallucination is so thick and realistic that I am completely convinced it is the truth. I am a 40-year-old heroin addict and I have wasted my life away with my vice. I am talking to my parents and they are crying, I am crying as well. I look at the veins in my arms and see they are horribly mangled. I cannot remember my past. I don't know who I am. I have wasted myself away to a shell of a man, and there is no returning. I apologize to them, to myself. 'I am sorry for all the pain I have caused you and I regret it all. I love you and I cannot express it enough. My shame is so great that I wish I could die right here and right now and that the world would just bury me in it's strength and I would be forgotten in time.'",
  "It was a catharsis so beautifully painful and enlightening that I now know I will never do hard drugs. I am grateful for the power of shrooms showing me this. My trip just turned off after that. It wasn't gradual, it was as if I woke up from a dream. I look at my watch and it's 4:00am. I look at my hand and it sort of warps. I try to wake Dick up but he pushes my hand away.",
  "I go outside and the air is fresh and cool. I look at the sky and the sunrise is coming up, I watch it. It is the most beautiful day I can remember in my life. Everything is silent and beautiful.",
  "This is the end.",
  "AFTERMATH",
  "After having a long talk with my parents, they give me varying speeches about the troubles with drugs and alcohol, blah blah blah. I've heard it a million times before, let me play with the fire.",
  "I have a heated argument with Dick. I call him an asshole and he gets upset. I haven't seen him or spoken to him after the trip. We had known each other for two years and had been in two bands together and we had embraced each other as brothers, but this trip taught me that he is an evil person. Everyone who used to be around me got away from me when I was with him, so I said 'this must stop.' I got away from him. That was the last time I saw him, I hope I never see him again.",
  "Make sure you know who you trip with. That bad experience would have been diverted by simply having a good sitter, my parents would have never found out. I thought that he was a person I could trust in a situation like this, but I was wrong. Be careful.",
  "After all of that, it was still a very spiritual experience for me that brought out everything in my subconcious. All those hallucinations have deep inner meaning for me and they have helped me in dealing with my family in one way or another. Even though the trip was supposed to be horrible, I found it enjoyable and I wish to take shrooms again soon."
 ],
 "erowid": {
  "id": "45589",
  "citation": " Mud. \"The Wrong Sitter: experience with Mushrooms, Cannabis & Alcohol (ID 45589)\". Erowid.org. Jun 11, 2007. erowid.org/exp/45589",
  "substance": "Mushrooms, Cannabis & Alcohol",
  "views": "4416"
 }
}
