{
 "id": 7327,
 "title": "Interesting Combo",
 "date": {
  "submission": "2009-05-29T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Varch",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "10"
   },
   "administration": "oral",
   "substance": "Diazepam",
   "form": "pill/tablet"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "oz",
    "quantity": "5.5"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "1:30",
   "amount": {
    "unit": "bowls",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Experience starts now:",
  "Setting: After school, at my father's house, in the basement, alone on a friday afternoon, bored out of my mind. I had just scored some dope earlier that morning (just Valium and Cannibus) and had planned to 'relax' after my classes were over. My mindset was positive going into the experience because I had just finished my first week of college and felt proud of myself, though my body was quite exhausted.",
  "Step one: Ingestion of two 5mg Diazepam pills (lowest strength)",
  "Step two: Consumption of 5.5 ounces of fine Merlot",
  "Step three: Sit and wait for effects, delay the cannibus",
  "T + 0:30: To the already full effect of the alcohol, comes the first wave of effects of the Valium. The first thing I notice is a slight distortion in my visual focus, but only when I turn my head to look to either side, not when I'm just looking ahead. My anxiety about the onset has diminished and I'm feeling confident and looking forward to the experience.",
  "T + 1:00: The Diazepam has nearly doubled in strength, and has comfortably mixed with the effects of the alcohol. My muscles feel extremely 'warm' from the inside out. As if there is physical energy moving in and out of every pore on my body. Every time I move my back, my spine sends tingly sensations throughout the rest of my body. There is absolutely no nausea. On the other hand my mind feels extremely clear, almost too clear. It seems as though I can only focus on one thing at a time (no multi-tasking) and when I do so I do it very well. Every care and worry of mine seems to be forgotten.",
  "T + 1:30: I have just finished smoking two relatively large sized bowls of some Canadian beaster (I was hoping for that funk, but none was available). Overall, I can say that smoking cannibus after injesting 10mgs of Valium and drinking a large glass of wine is not a wise idea. My vision is absolutely horrible. It is about equivalent to drinking a pint or more of hard liquor, while my body feels more like a DXM high (very numbing, intensly slurred speech, and very poor motor skills), there is a very slight nausea but not in vomitose form. I am able to function and walk around but I feel very uncomfortable and disoriented.",
  "At this point, I cannot write anymore. It is hard to focus on the computer screen. But overall I can say that this combination is intense but not completely terrible. I haven't felt too sick to this point, just very very 'out of it' if you may call it. I do wish to repeat this experience again at some point."
 ],
 "erowid": {
  "id": "45592",
  "citation": " Varch. \"Interesting Combo: experience with Diazepam (Valium), Alcohol (Wine) & Cannabis (ID 45592)\". Erowid.org. May 29, 2009. erowid.org/exp/45592",
  "substance": "Diazepam (Valium), Alcohol (Wine) & Cannabis",
  "views": "12046"
 }
}
