{
 "id": 7330,
 "title": "Caught with My Pants Down",
 "date": {
  "submission": "2007-09-17T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mushroom_john",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "11"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  },
  {
   "time": "0",
   "amount": {
    "unit": "glasses",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "This was my first day experimenting with the salvia divinorum plant, and I'm concluding that it has interesting powers but I'd like to further my ahem, research.",
  "This morning I went to a local headshop and purchased a gram sized glass bowl for a plastic Islands of Adventure cup I had found in my room whose shape I thought would make a good looking bong. I also picked up a quarter of salvia leaves, I was hoping to buy extract, but at $50 dollars a gram I didn't feel compelled. My friend and I then went to a small park not far from the headshop and built the bong. I've been doing some research about salvia use and I heard that it should not be done in the wrong setting or wrong mood, I'm pretty familiar to this topic from my mushroom use :) It was rainy and windy, but I decided to go ahead anyway seeing as we were there.",
  "I smoked about a bowl and a half, probably weighing around 1.5g and I felt nothing but a very sharp pain at the sides of my body for a few seconds after one particularly harsh hit. A bit of dizziness and a very tiny lingering essence of a bud high for about 2 minutes, then I was back to normal. My friend who is a great deal smaller bud smoker than me blazed about the same amount and said he had a cannabis like high for around 20 minutes, but nothing out of the ordinary, nothing amazing either. Later tonight I was sitting around with still about 4 grams left and decided to try again since I'd read reports that some people really trip out after smoking this stuff.",
  "(T 0:00) - After turning on Atom Heart Mother by Pink Floyd, I packed two large leaves in a small metal pipe I have and toked it up in about 3 hits, lay back on my bed and for a second waited for the effects to kick in, feeling nothing I grabbed my pipe and packed a bit more in, 4 separate bowls with a small leaf in each, hitting it out my bedroom window with a clock beside me to count 30 seconds and 30 seconds exactly to hold each hit. While hitting the first leaf I felt nothing, but as the seconds passed I already felt like I've been smoking for a long time, nothing I realized until after though.",
  "(T+0:10) - While I paused to make a small adjustment to my pipe somewhere during the second bowl, I spaced out and started listening to the music. I realized the salvia present. It was at the very moment that I had really forgot about getting high off the salvia and simply packing and igniting the leaf in my pipe when the salvia caught me with my pants down. The music seemed to be dictating my life, but not just during this moment, but rather like it has been doing so my entire life. Every note seemed to wring an action in my life like it was in perfect synthesis to what I was doing that very second. While smoking steady bowls of salvia in my pipe I heard an army marching with no point solely because that's what they were told to do, and that's what I saw myself doing with the salvia. After this however I made the mistake of stopping smoking for a bit and leaving my room to get a towel from my washroom and shove it under my door, which basically killed the buzz I was floating on.",
  "(T+0:15) - I smoke the other two small leaves in the pipe, over the course of around 2 minutes, then close my window, put away the pipe and sit back zoning into the music. After the pipe was put away I started to concentrate what it is the salvia was doing to me, and I found it difficult to figure out exactly although I could tell I was not sober. This is why I am intruiged by salvia, because after the session I sat back and I knew I was pretty baked, but when I would think of how to describe it I would realize that everything is still perfectly normal, even though I knew I was f*cked. This was the main part of my experience, sitting back listening to the trippy sounds of Floyd coming through my speakers in atom heart mother.",
  "I couldn't place my finger on what exactly it was though, although I felt completely out of the ordinary. I was having very strange thoughts, reminding me of a mushroom effect, no visual changes, except for visualisations on iTunes being a hell lot trippier than usual. My hearing was slightly warped I felt the music inside me but nothing as profound as mushroom trips, although highly similar to weed smoking.",
  "(T+0:45) - I decided to finally leave my chill area, which over the past half hour has really become my only true home, and I grabbed a beer. Drank that within a minute or so due to my thirst.",
  "(T+1:00) - Sat back after having finished the Floyd album and I turned on The Chronic by Dr. Dre at around. As soon as the first notes of rap hit my ears my mind felt like it did a complete backflip, like someone just turned the lights on in a pitch black basketball stadium and it was full of millions of screaming fans. I sat back slowly coming back to myself surfing the net, not anything I would call 'high' but my thoughts were strangely altered. I was really understanding all the words of the rap and feeling the beat, basically normal although thinking about everything a lot deeper.",
  "Somewhere during the chronic I realized myself finding new ways how to handle things, I felt in a way that I had just aged a year, gotten bigger, and then it happened again. Suddenly beer was simply 'that thing you drink' rather than an alcoholic beverage. A hot pipe with lit plant became a simple finger warmer, rather than a hot device to be cautioned with. After realizing that I was thinking about these kinds of things I knew that the salvia had definitely done something to my head.",
  "(T+3:00) - Out of boredom I went to the fridge and got another beer. The effects of salvia have pretty much completely worn off, replaced with a typical burnout, tired dragged out body, fried feeling head and squinty red eyes. I started to write this entry while finishing the beer.",
  "(T+3:45) - Finishing up the entry, strangely feeling very different now. At the same time my body feels burnt out and tired, along with an incredible soreness of the eyes, and an irritating feeling on my skin, my mind feels like it isn't even a part of me. It feels like the most renewed rejuvenated fresh clean mind after a cold shower after 20 hours of sleep on a warm n' sunshiney day.",
  "The total amount of leaf smoked during my night session was 11 hits. I can definitely say that I experienced some of the effects of salvia in a small way, and I am very intruiged at the different approach this plant has on my mind. A fact to add is that I used only a regular cigarette lighter to smoke the salvia, and this may have been a cause to the decreased potency, as I have read that a hotter flame such as that from a jet lighter is recommended. One of these next few days I'm going to finish off the salvia with the same friend. We're planning on both chewing a roughly 2 gram quid for half an hour, experimenting with oral dosage."
 ],
 "erowid": {
  "id": "45608",
  "citation": " Mushroom_john. \"Caught with My Pants Down: experience with Salvia divinorum (leaves) & Alcohol (ID 45608)\". Erowid.org. Sep 17, 2007. erowid.org/exp/45608",
  "substance": "Salvia divinorum (leaves) & Alcohol",
  "views": "3839"
 }
}
