{
 "title": "SRNI Effects on Psychoactives",
 "author": "EuphoricMarine",
 "citation": " EuphoricMarine. \"SRNI Effects on Psychoactives: experience with Venlafexine (Effexor) & Various (ID 73324)\". Erowid.org. Aug 26, 2008. erowid.org/exp/73324",
 "substance": "Venlafexine (Effexor) & Various",
 "bodyweight": "170 lb",
 "report": [
  "<p>I am writing this report on the SRNI antidepressant venlafexine, brand name Effexor, and it's effects when taken with psychoactives. ",
  "I started taking Effexor earlier this year, around June, for depression and anxiety.  Although, it took a week or more for the medicine to start working I used various psychoactives during that time and continue to use them. The Effexor itself has done nicely to level me out.  It has improved my demeanor to life and also has slowed my thoughts down to think through my anxieties.",
  "Alcohol consumption was a big part of my depression and I stopped drinking and am still free of alcohol to this day.  I know that this had a big part to play in my recovery as well.  However, I used DXM in the form of Robotussin cough gels recreationally while taking it and have noticed that the trips are a little less than what I am used to feeling.  It may also just be my tolerance for the dextromethorphan but it seems to have lost some of it's magic.",
  "Another substance I frequently take is Kratom, mostly extracts, and I find that this antidepressant has lessened some of the euphoria associated with this psychoactive.  I also find myself having to use more of it to get the desired effect.",
  "No effect on caffeine or nicotine, on which I frequently use.  Which is good for me because I love my coffee, energy drinks, dip, and chew. ",
  "Overall the positives of taking Effexor have outweighed the negatives and the lessened ability of DXM and Kratom and I will continue to take it.</p>"
 ],
 "year": "2008",
 "id": "73324",
 "gender": "Male",
 "views": "10325",
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Various",
   "form": ""
  }
 ],
 "submissionDate": "2008-08-26T07:00:00.000Z"
}
