{
 "id": 7336,
 "title": "Lost & Disappearing",
 "date": {
  "submission": "2005-10-13T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fup Duk",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "333",
    "grams": 0.333
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "liquid"
  },
  {
   "time": "2:30",
   "amount": {
    "unit": "mg",
    "quantity": "333",
    "grams": 0.333
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "liquid"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "It's been six days, and I'm only now beginning to resemble something like the 'normal' me.  Reading other's accounts has been my only comfort from the nightmarish reality I've found myself trapped in.  Discovering that I am not alone was possibly the turning point.  Now that I've started to think I might not be permanently damaged after all, I feel compelled to share what I've been through, possibly offering consolation to some other soul worn thin, helping someone feel a shade or two better when nothing else seems to. ",
  "To put recent events into perspective, my MDMA history started off with a bang eight years ago at the age of 21.  I continued experimenting with it once or twice a month for the next six months culminating in the realization that the destructive effects were increasing and overtaking the beneficial effects with each new visit.  So I stopped doing it and never considered it again. ",
  "That is until six days ago when a buddy of mine asked if I would enjoy going on a hike and injesting some MDMA along the way.  I hesitated, thinking, 'I love hiking, and it's been eight years since the last time, maybe enough time has passed that the good would outweigh the bad.'  Trekking through a beautiful forest on a warm and sunny summer day, waterfalls, and a good company--what could go wrong?   ",
  "It was in powder form and I honestly have no idea how much we took.  My friend said he bought 2 grams and did a third of it with another friend the week before.  He also vouched for it being purdy good stuff.  So we split the rest (a gram+ ?), mixing it into flavored water, two bottles apiece.  We each drank a bottle at 12:47pm and then hit the trail.  It must have been because I hadn't done it in so long, but I watched my friend blast off while I was still feeling excited/nervous/giddy, yet with my feet still on the ground.  But then twenty minutes later I caught up and seemingly surpassed him, becoming something like his kite for the next eleven hours.  Needless to say, I had the best MDMA high ever, but later, the worst comedown.",
  "Five miles and two or three hours into it, we found 'our spot,' settled in, and drank the rest of our vitamin water, doubling our dose.  Our spot was the top of a roaring waterfall--it doesn't get any better for set and setting.  Before long I was floating in the river, completely and utterly content.  My friend sat on the rocks next to me and our string of conversation was the only thing keeping my soul from fusing completely to the waterfall's.  We had no complaints. ",
  "Since we hadn't planned on staying overnight, but sure wished we had, we knew we must head out before the sun set or risk getting stranded unprepared in the dark forest.  So around 6:30pm, or six hours deep, we reluctantly gathered our stuff and headed back.  It seemed as though we made it to the car in no time at all.  Warp walking.  Almost exactly as we reached the trail head and parking lot at sunset, a sense of loss and sadness overwhelmed me.  I wondered if it was the beginning of the comedown and if it was somehow magnified from our break with the forest's healing energy field.  Beginning our slow journey back into the city, I became aware of the tiniest seed of emptiness germinating in the core of my being, growing larger and darker the farther we drove from the forest and stars.",
  "That night darkness took me over completely.  Darkness and the beginning of a five-day hangover and electrical brainstorm that had me wondering if I would ever be the same again.  Unpredictable flashes surged through my senses--felt, seen, and audible--like bursts of electricity coursing through my nervous system, doubling back in my tongue and fingers.  The little sleep I've managed has been anything but restful, with vivid thoughts similar to lucid nightmares of things like standing on the side of some godforsaken highway in the middle of pure darkness, enveloped by despair and surrounded by the most intense silence imaginable, only to be broken by invisible motorcycles exploding by in split-second flashes two to three times a second, often driving me to thoughts of suicide.  The more I tried to relax and calm myself,  the more anxious I felt and the stronger the electrical storm raged.  The storms lead to panic attacks and the panic attacks lead to a loss of all hope.  The second night going into the third day I reached the darkest and lowest realms of the entire experience.  I was helplessly overwhelmed and lost, scared I would never recover when I had no choice but to go to work the next day.   Throught the day I felt as though I might either pass out, have an epilectic seizure, disappear into the void, or all of the above. ",
  "Day Four was no better, no worse.  And by yesterday, Day Five, things finally began to turn around. ",
  "Today I feel better than yesterday, and I'm grabbing on to this as a hopeful sign for tomorrow.  I was desparately able to find some peaceful sleep last night, in between the diminishing night terrors.  Clearly, it was not worth it.  The possibility of a lifetime of anxiety, severe depression,  and near-epilepsy were not worth half a day of profound insight, ineffable emotional beauty, and a deep understanding of myself and people in general.  I knew I took way too much.   ",
  "However, my buddy's hangover was nothing compared to my own, as his was limited to a mild laziness lasting several days, but nothing more than that.  So the point is, we are all so different.  We all come from the same spiritual source, yet we have different chemical circumstances and baggage.  Some of us will have limited negative effects taking MDMA, and others of us will be knocked outside ourselves left searching for the pieces of our body/mind/soul without a flashlight, compass, or map showing the way back.  The worst part of my experience was not the sudden fits of crying, or the endless electrical storms raging behind my eyes tormenting my soul, the worst part was the possibility that I might not be able to collect myself or find my center ever again.   That peace of mind would forever lie beyond my reach.",
  "If anyone is reading this right now and going through a similar experience, hang in there, don't give up.  Give it some time, you just might pull out of it.  If you've never taken MDMA, please be cautious your first time and start with a small amount so you'll know how your body will react.  Personally, I'm sticking to what has worked best for me in the past.  From now on when it comes to transcendental, meaningful, and life-altering experiences with entheogens,  I will trust only psilocybe mushrooms.  The 'hangover' comes first and they have been used by humans for thousands of years.  But we're all different, and what works for me might not work for others.  If you are serious about entheogens, take them responsibly and show them the respect they deserve.  Otherwise you risk losing a part of your soul.  For me, MDMA is a dead end.  Please take care."
 ],
 "erowid": {
  "id": "45623",
  "citation": " Fup Duk. \"Lost & Disappearing: experience with MDMA & Cannabis (ID 45623)\". Erowid.org. Oct 13, 2005. erowid.org/exp/45623",
  "substance": "MDMA & Cannabis",
  "views": "4596"
 }
}
