{
 "id": 7340,
 "title": "Passing Experience",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nokia",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(daily)"
  }
 ],
 "report": [
  "I found myself in front of the DHR, explaining me that one of my 'workmates' had accused me of using cocaine the previous night. Being a Poker player, I volunteered to pass a test, but it was 'not necessary'. I got fired anyway, just like in the movies, with the security guard behind me to collect my stuff. Nevertheless, I had to justify the 'incident' to more people than just the DHR, so the test was 'socially' inevitable.",
  "Last use: Sunday night. (snorted about 0.5-0.7g), with drinks.",
  "Before: Consistently during the previous 2 weeks 1/2, about 0.5/day.",
  "I read everything I could find about testing and how to 'clean up'. I ate double meals 2 days on a row, ran as much as possible to increase the metabolism (I read that could increase it by 1000%!). I went to the sauna to burn toxins and tested myself on 'watering' to see if that could eventually help but I desisted on that path thinking about the 'counter-test' to check a sample for dilution.",
  "Test day: Wednesday (about 63hrs after last use.) My 'sample' was collected at a regular doctor's office, not in a lab, where it was way easier to 'cut' or cheat on the test. On the morning, I did drink a bit more liquid than usual, but just enough to go a couple of times an clean up the 'sample' a little bit.. Then in place (following something I read), I filled it normally, then before I finish, while washing my hands, in a quick move I filled about 1/4 of the cup with temperate water.. (yes! it was just a regular bathroom! they let the door open, waiting outside without looking inside). The test was looking for the 7 standard drugs traces (including the coke metabolite.)",
  "Four days later: Negative, Sample normal (not diluted)",
  "Considering the 'consistent' period of use and the borderline detection time, I wasn't sure it was going to work, but it did."
 ],
 "erowid": {
  "id": "45629",
  "citation": " Nokia. \"Passing Experience: experience with Drug Testing & Cocaine (ID 45629)\". Erowid.org. Jun 25, 2007. erowid.org/exp/45629",
  "substance": "Drug Testing & Cocaine",
  "views": "9886"
 }
}
