{
 "id": 7341,
 "title": "Nutmeg Bombing",
 "date": {
  "submission": "2001-12-26T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "J",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 Tbsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "I decided to try it even though I was well informed of the possibility of sickness or a bad trip. I was on my Christmas vacation with no parents around for hours and a sister who would keep me company if anything bad happened, but she had no idea what I was up to. So, I put two tablespoons in water and thoroughly stirred it, but the shit wouldn't dissolve, so as fast as I could I gulped it down. Not even ten minutes later I had a sort of trippy, odd feeling arise in me. Right then I thought, I'm fucked, I ruined my life because if it was kicking in already, heaven knows what would happen three hours from now.",
  "Then the fear eventually wore off. I decided to relax and watch some T.V. That's when I got a lightheaded feeling, which was the slightest bit uncomfortable. It eventually went away. After that I started having an enjoyable change in perception, very nice feeling. That's really as good as it got. So I took another 2 tablespoons, in tea this time. I don't recommend this method - the hot water makes it sink to the bottom and at the end of the tea, it's sitting there all clumpy. Very horrible. I thought the heat would activate the psychoactive chemicals even more, enhancing the experience.",
  "After that I was starting to peak. So, I called my friend E and he brought over a bowl of some poopy weed, and he brought over a nice sized roach of his dad's kill. We smoked it in a very hard-hitting tinfoil bowl I made. I was really fried after that, then hours later, which seemed like 20 minutes during this high, I was a walking zombie, but still had a clear head, surprisingly, and tangible outbursts of energy and laughter.",
  "Around 4:00 P.M. I thought the ride was over. I was still slightly messed up though, but this was a very weird high. I could make myself high and sober on cue; I was perfectly straight around my parents too. I could actually talk to them without using two and three letter words. Which is very difficult when I smoke pot, to actually talk to them and not act all messed up. So time passed and it passed fast. I was zonked and went to bed around 10:00 P.M. I thought I was burned out, little did I know. I felt weird. It's like I could make myself high when I wanted. On pot, when my high is gone, I seclude myself in a dark area and get a nice clear-headed, trippy feeling. Well, on nutmeg I really started to trip. Close by objects seemed miles away and in a different realm. My vision was pieced together like a pointilist painting (art of dots). I really experienced the void at that moment. Also, a feeling of deja vu came over me. I remembered childhood memories, traces back to old feelings I'd had. I get the same thing when I'm really stoned. I also got pictures of the same people in my head. I couldn't really call them people - they had blockheads and always had goofy grins on their faces. I would see the same people over and over again doing different things all the time, like sitting down and meditating in a Japanese atmosphere, or picking up a date to the prom with a suit on and flowers in hand, yet with the goofy grin. I had no control over what they decided to do in my head, they just popped out of the hidden tunnels of my subconscious to say hello.",
  "Then I had slight paranoia. I thought people under the influence were more prone to spiritual torture. I never really believed in all this shit, but now it seemed so real. So, I got up and went downstairs to play with my dog. Note: I was feeling sober now. Then I watched some T.V. and was very amused. After the fear settled I went to bed. Then in the morning I didn't feel like doing anything so I talked my Mom into believing I was sick, so I stayed home. That was 5 days ago and I'm still fucked up. I've been experiencing dissociation, very real too, like when you're dreaming but you know you're awake. I'm also very happy and peaceful. O yeah, I experienced no vomiting or sickness. Thank God."
 ],
 "erowid": {
  "id": "4563",
  "citation": " J. \"Nutmeg Bombing: experience with Nutmeg (ID 4563)\". Erowid.org. Dec 26, 2001. erowid.org/exp/4563",
  "substance": "Nutmeg",
  "views": "11029"
 }
}
