{
 "id": 7346,
 "title": "Opposites and Disbelief",
 "date": {
  "submission": "2007-11-27T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "T-bird",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.0",
    "quantity": "1.0"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "48:00",
   "amount": {
    "unit": "g",
    "grams": "4.0",
    "quantity": "4.0"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I came across about 6.5g of shrooms early this June.  This was the second time I'd shroomed.  I started chewing little caps at my friend D's house and had a few in the car on my way home as well.  I tried to eat only a gram or so because I didn't have time for a full-blown trip.  I also wanted to gauge how much to take next time.  For some reason I was intent that my housemates M. and J. not know I was tripping, so I went outside by myself, listening to some drum and bass by Roni Size.",
  "Soon the others were in bed and I was starting to feel very mild but very pleasant effects.  I retreated to the couch inside with my journal and started writing sporadically.  The first thing I noticed was that everthing was slightly more interesting than normal, and that my awareness was heightened somewhat.  Quick changes in the music or on the TV caught my attention in a new way.  I felt like a squirrel with wide eyes, looking for anything interesting or threatening in my environment.  It was a hot Texas night, but I had no desire to make myself more comfortable, which is very unusual for me. ",
  "I was sitting, monitoring my mind, when J. came out and started talking to me about things that seemed very mundane.  I tried to continue writing, but his speech commanded my attention.  I felt it was very important that I write down, 'No one knows'.  My thoughts were speeding by so fast that I thought I'd be wasting time trying to form initial thoughts into speech in my head.  I always think, translate into speech, edit my speech, then actually speak.  I was able to force myself to write a little, but i had no patience for proper grammar.  I began to notice very faint patterns of light laid over my vision.  J. left.",
  "I put on Deftones and felt an exhilarating sense of having Fun.  The music brought back good memories and I thought of my ex-fiancee L.  It felt good to write her name down, which was interesting because I've been very bitter toward her.  I felt generally excited about life, but was experiencing a series of doubts about it as well.  I was very afraid that someone would come out again and infringe on my alone time.  I think this desire for solitude came more from me than the shrooms though.",
  "I left my journal and went outside again.  It was only 1 or 2 am and yet I felt that the sun was about to rise.  The sky was graced by great, fast moving cumulus clouds that were reflecting the city's light back to me as a wash of red, purple and orange.  I thought it looked very beautiful.  I had strange thoughts that I didn't believe what time it was because of the brightness of the sky.  Whenever I was inside, I insited to myself that it was 5pm and not Summer but Fall.",
  "I started to feel like I was coming down and took a small hit of cheap bud.  The shrooms seemed far superior to me and I thought that weed isn't worth it.  It made me at once more impatient and less driven.  These small changes set in and I calmed, thinking about love.  I realized that I wasn't as down from the shrooms as I thought, and realized further that I wasn't even as depressed about life as I had thought I was prior to the trip. The last thing I wrote before turning in was that it had been a sneaky nite that had barely even let me know it was there.",
  "Two days later I took maybe 4 or 5g at about 2:30 pm.  I fully expected plenty of nausea this time, so I retreated to the shower and our whirlpool tub to wait it out.  The slow rise of the trip in my head and the nausea in my guts made the shower too crazy to be in, so I lay in the tub and let the water run down the drain.  I began to see patterns in the light coming through the window made of thick, ornamental glass blocks.  This provided some interesting prismatic effects.",
  "I felt laughter and excitement bubbling up, and even my nausea seemed amusing.  I realized that by the time I peaked there would be no way to hide this second trip from my friends.  I got out of the tub, dried, and let it fill with hot water in case I needed the stimulation of the bubbles later.  Because I wanted the option of getting in and out at will without closing the door, I put on my swim trunks.  I lay in my bed cringing with nausea, and suddenly, it passed.  I knew I needed to tell my friends I was tripping, which I did.  This launched my trip into full gear, because now I felt safe.",
  "The next number of hours were characterized by the inability to choose what to do.  My mouth started spouting my stream of strange thoughts and I kept trying to make everything into a joke.  M. told me the best comedians know when to get off the stage, but I couldn't help the intense feelings of amusement that everything gave me.  Later I told him, 'If all the world's a stage, how can anyone ever get off?' I thought it was gangbusters at the time.  I started laughing at my inability to decide anything and started this mantra and its variations: keep going, stop, go left, go right, stop knowing, keep knowing, know more, know less, everything keeps going and then it stops.",
  "And for a while, this was my world.",
  "I went to the kitchen (eat, don't eat, keep drinking, stop) got some water and stirred some Emergen-C into it.  I didn't know what difference a shot of vitamin C would make on shrooms, but I figured it couldn't hurt.  I impulsively bit into the little powder packet and laughed at the way it fizzed in my mouth.  I had heard of a guy eating rocks on shrooms before and realized that doing something like that could make sense to someone feeling as impulsive as I was.  My friends' skin wouldn't stay still, but that was about the most visual distortion I got.  Otherwise everything was just interesting and beautiful both in concept and tactile reality.  I realized how wonderful it was that the world around us 'keeps going' and how wild it is that eventually it will all 'stop'.  The trees, grass, people, animals were all very vivid and very REAL, and even the stove seemed to have a life unto itself.",
  "At some point I got my journal out and wrote: ",
  "'Can't decide.  Everything and nothing.  This is 20 billion thousand eleventy-one million times past where I was [two days before].  YOU know what I'm doing.  not too.  stop knowing keep knowing  know more know less  I thought but then I stopped.  Everything makes me laugh and then it stops.'",
  "It took a good number of days for me to feel totally normal again, and a few times I felt like I was back there with it (meaning on the shrooms obviously).  All in all, two good trips but very little concrete insight into the world other than that it will stop.  Of course, I happen to know that life goes on."
 ],
 "erowid": {
  "id": "45645",
  "citation": " T-bird. \"Opposites and Disbelief: experience with Mushrooms & Cannabis (ID 45645)\". Erowid.org. Nov 27, 2007. erowid.org/exp/45645",
  "substance": "Mushrooms & Cannabis",
  "views": "3063"
 }
}
