{
 "title": "Seeing the Divine and More",
 "author": "First timer",
 "citation": " First timer. \"Seeing the Divine and More: experience with Mimosa spp. & Syrian Rue (ID 73489)\". Erowid.org. Feb 15, 2011. erowid.org/exp/73489",
 "substance": "Mimosa spp. & Syrian Rue",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Mimosa spp.",
   "(tea)",
   "",
   " ",
   "oral",
   "Syrian Rue",
   "(tea)"
  ]
 ],
 "report": "<p>I first heard of Ayahauska from a friend and he said it was a very spiritual drug. I ordered some mimosa and syrian to try it out. I tried it the first time by my self and it was a very good expierience, I had everything from vortexes to lizards walking around the living room. I had 14 grams of mimosa that night.</p><p>2 Days later I made a batch for me and my brother in law. It was a even stronger dose I made for myself. I used 20 grams of mimosa [and 4 g syrian rue] not thinking what it could do to me. Later on that day we go out fishing by this river and decide to have a journey. This batch I made was exspecialy good. 15 mins after drinking we both started getting body rushes and my bro goes and pukes it up. It hit him extra hard. Hes tripping. I decide we should drop our stuff off at the truck and he agrees with me. We start walking through the woods and it hits me a good bit by now. We stop by the truck and I take some puffs of herb and we both decide on taking a walk/journey.</p><p>Its been a good hour now and it just hits me. I tell him I have to sit down and we do. Then all of the sudden I see a bright white light and start going trough vortexes. I started all of a sudden started flying over the world watching all these armys fighting and men dying. I started talking in a strange voice that wasnt me and was telling my bro what I was seeing. I stated going off on how America was getting invaded by Russia Red Dawn style and yelling we got to get home. The vision just got worse, I started talking about the year I would have a child and when I die and the day WW3 starts. I kept saying 12 12 12 9 9 9 3 3 3. Over and over and the whole time I'm saying this I keep going through my vision. I kept telling my bro to give me cigs and he said I kept ripping off the filters saying there evil and that I am gods warrior.</p><p>Then I hear this voice say 'Puke and you can see more' so I puke up the brew and time just stopped. I then seen the universe with a white light on one side and a red light on the other and earth was in the middle of the Universe. I then went through another vortex and saw this lady standing in front of me and 2 children running around a well and I see green fields and I thought I was in heaven. Just as I thought that I passed out and woke up about a min later in reality. My bros freaking by now and so am I. He said I was saying some crazy stuff. I was stilling seeing energy but I was scared and had cold sweats and couldnt stop thinking what I saw. It wasnt till the next morning that I soaked it all in. I now am a believer in god. I suggest not overdoing this plant.</p>",
 "year": "2008",
 "id": "73489",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-02-15T08:00:00.000Z",
 "views": "3195"
}
