{
 "title": "Changed for the Better",
 "author": "Chris",
 "citation": " Chris. \"Changed for the Better: experience with 2C-E (ID 73487)\". Erowid.org. Oct 14, 2008. erowid.org/exp/73487",
 "substance": "2C-E",
 "bodyweight": "140 lb",
 "header": [
  "DOSE: T+ 0:00",
  "16 mg",
  "oral",
  "2C-E",
  "(capsule)",
  " T+ 1:00",
  "16 mg",
  "oral",
  "2C-E",
  "(capsule)"
 ],
 "report": "<p>It was the end of summer 07 and little did i know my life was about to be changed forever. My story begins with me hanging out with my friend ill call chuck, which lived a far distance away whom i had met under very strange circumstances. He had mentioned to me he could get this drug 2c-e, which i had strangely heard of from another friend of mine ill call austin who lived locally. Austin had told me of his experiences with a similiar drug called 2c-i which he had once sold me but had little effect, so i decided to give it another try and i purchased 6 capsules of white powder presumed to be 2c-e.</p><p>Now i had tripped before on a few different substances like mushrooms, salvia, extasy, amanitas, and DXM, and i had done almost every other drug in the sense of narcotics from marijuana, to heroin, to pcp, cocaine and the likes, so i thought i was experienced. Boy was i wrong, nothing i had ever done even came close to comparing to the intensity of 2c-e.</p><p>The next day after purchasing the 2c-e, i decided it was time to experiment with it. I was in a good mood, just a little anxious and courious about what the 2c-e would do. I had chosen to trip in my friend austins house since he owned his own trailer and was fimilar with the effects of 2c-i, which i suspected was similar to the 2c-e. We had planned to trip together, however on my arrival i learned he had already been doing heroin that night so we both decided to wait until the next day to trip to avoid any bad reactions between the two drugs..... but i could not wait.</p><p>At about 11:00 pm i took one of the capsules i was told to contain 16mg of 2c-e, popped in a movie, and waited for the effects to begin. About an hour into the movie i decided i still didnt feel anything, nothing at all, not even slightly high or anything, so i made the mistake of taking another capsule. About 5 minutes after taking the second capsule i felt something in my stomach, it was like a feeling of eating too much without the food actually being there, and at the same time the first effects began.</p><p>It started with the normal effects of tripping, the weird thoughts tripping gave me, a body buzz, and my vision was crowded with black sgwiggly lines. It was nothing special, nothing like i hadnt already experienced with previous hallucinogens, but the drug had not fully kicked in yet. I looked in the mirror and my pupils were HUGE! way bigger than they had ever been from anything else i had ever taken. Also, i looked more dead than i had ever looked when looking in the mirror while tripping, this kind of scared me and i fled to the couch.</p><p>It was about an hour and a half from when i had taken the first capsule and i thought the effects were fully developed, i didnt think the second capsule was going to make the experience any stronger than it already was. I walked around the house trying to enjoy my trip making fun of my friend who was nodding out on the seat in the living room and making funny comments about the meaning of life and what was going on with my vision and such. A little after that my friend went to sleep and i was left alone lying on the ground in the other room.</p><p>I dont know what happened next but i must have blacked out, the last thing i remember was my friend going to sleep about two hours after i had taken the first capsule. I woke up and it was very early in the morning, must have been about 6 hours after the first dose, and JESUS CHRIST! i was tripping HARDDDD!!! Harder than i had ever tripped in my entire life and i was not ready for it. I remember awakening on the floor and i rolled over, the first thing from my mouth was, oh my god, all these thoughts and feelings. The thoughts were fimilar, it was the same thoughts mushrooms and dxm gave me, but they were coming and going FAST. I could literally SEE my thoughts splitting apart inside my head at a rate so fast it was hard to take it all in, but i had no choice, this freaked me out.</p><p>I felt like i was learning so much, i knew everything and everything made sense to me... the fact that this was a chemical MADE to make me trip and not just something from the ground or anything. I looked in the mirror and i looked even more dead than previously. Suddenly i realized i had been wasting my life doing nothing, roaming the streets doing drugs and making nothing of myself and this is not what my parents had given me life for... i was meant to make something of my life. And this feeling has stayed with me ever since. I stopped doing drugs all together and started going to college and reading books, trying to better myself. Ever since, it feels like a little of the 2c-e is still with me... or maybe it just made me see the light, I dont know. Whatever it is i feel like i was meant to have that trip that one night.</p><p>To anyone looking to experiment with a psychedelic chemical, I urge you to take caution. I can easily see how dangerous it is ingesting these chemicals and they deserve the upmost respect. My trip was good and what stayed with me has changed me for the better, but it could have easily been the other way around.</p>",
 "year": "2007",
 "id": "73487",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-10-14T07:00:00.000Z",
 "views": "5550",
 "dose": {}
}
