{
 "title": "Black and White Precursors",
 "author": "Thezimmermanproject",
 "citation": " Thezimmermanproject. \"Black and White Precursors: experience with Cannabis (Northern Lights) (ID 7355)\". Erowid.org. Jul 22, 2001. erowid.org/exp/7355",
 "substance": "Cannabis (Northern Lights)",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "1.0 g",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>I consider myself fairly educated in cannabis and so was somewhat caught off guard by this event.  Two weeks ago, I and four other close friends decided we would spend a Friday testing the limits of cannabis and its potency.  At about 9:30pm we decided we would blaze. We each had a dub.  I smoked a full dub, and after about 10 minutes began to feel my body warming up. My knees became very loose and I soon had to watch my step because controlling the amount my knees bent was becoming very difficult.  As we headed back to the car I became aware of a very intense full body feeling, my knees were now just like Jell-O, and my fingertips felt as though hundreds of tiny hands were slowly pulling them.</p><p>As we got into the car, we got into a long conversation on the depth of the seats and how our bodies had 'melted' into them, giving us all an odd unison with the vehicle.   We conversed on subjects ranging from the simplest thoughts to the deepest of emotion, as time became an infinite realm of thought and divine right.  The stars glowed, and the wind brought full body orgasms at the slightest breeze. Vision became like the shot of a 35mm camera, sequences of beauty flashed in my mind and I could relate to my youngest childhood memories once again.  As we exited the car and began to walk up the steep driveway of my friend's house, it began to be a struggle as the floor would convulse and grow beneath us.</p><p>In his kitchen, we found two cartons of mocha ice-cream, which we polished off in a matter of minutes, the flavors being more intense than imaginable, as though our tongues were now holding a small world of impossible reality and depth.  We made our way to his room and watched TV. I began drawing and soon had come up with some very interesting sketches, most of them, although drawn with a blue pen, appeared to be sketched with black charcoal.  My trip was in full effect, for some reason which to this day I am still unsure of. I decided that black and white were the precursor to reality.  The lines that defined good and evil, truth or lie. I began to question the world around us and the false charade that had become of it.  Everything to me was a media and I used every medium near me to explain this. On the sketch I wrote 'Novus Ordo Seclorum,' a phrase used on the back of the one dollar bill, signifying revolution and the dawn of a new day.</p><p>At around 2am we decided we would all take a break and get some sleep, and just as with my reality, the dreams were altered.  When we woke the next day we were all groggy although we agreed the night before had given us some of the most pleasant dreams imaginable.</p><p>I HIGHLY suggest to anyone to try cannabis at least once,  it is not very addicting, and no, it is not going  make you go 'crazy' and  regret the night you have. I'm not saying that YOU HAVE TO SMOKE WEED  or that you won't get out of control if anything happens to you, it's your problem, not mine, but I do suggest trying it once.</p><p>-thezimmermanproject</p>",
 "year": "2001",
 "id": "7355",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-07-22T07:00:00.000Z",
 "views": "9076",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
