{
 "title": "I'm behind the Underneath",
 "author": "Unoanimo",
 "citation": " Unoanimo. \"I'm behind the Underneath: experience with Ayahuasca (ID 73580)\". Erowid.org. Jul 15, 2010. erowid.org/exp/73580",
 "substance": "Ayahuasca",
 "bodyweight": "135 lb",
 "report": "<p>The Second Night</p><p>(IMO) = In my opinion.</p><p>I was a more apprehensive on this second night after having recorded the physical and emotional effects of last night, the fragmented stories of others experiences and my own to some degree: the physical payment of vomiting and bodily soreness wasnt it, nor was it even the actual experiences, instead, it was the pending-feeling they delivered of something about to happen next, an intuitive sensation of not having enough actual proof from the events to say No to proceeding and possessing just enough curiosity and feeling of right fate to proceed (Damned if you do and damned if you dont. is a very strange emotional place to be). </p><p>Last night was haunting the back of my mind as a kind of Introduction of sorts (A cliffhanger ending & beginning coming into existence all at once).  I was unreconciled so far as what it was that I was looking for to help me with The Bottom of the Barrel, though also confusingly at home in ayahuascas clinic: it was this that took me a bit by surprise, because Id never experienced such a strong inner sense that something unknown, from my very core-self, had somehow been unconsciously opened, collected, compressed, tensioned and was awaiting to be unlocked, catapulted and let out, only by this ceremonial means.  [Also, I cannot now leave out the very strong sense of group-journey-ism, i.e., that this brought a quiet urgency to what I sensed was a once and a lifetime event for me: its not that I felt obligated to them as people I knew or identified with as a family I needed...  It was that thing on my back calling and the ayahuasca mood as well...] </p><p>No amount of debate, story sharing, psychoanalysis or dreaming could reveal to me the slightest hint as to what it was that seemed to be pressing itself against a door that had been unattended for, how long?  I couldnt imagine  Time simply didnt fit into the feeling; it was a very pure and simple sense, with no thoughts or emotions associated with it or arriving from it: like a bottle of compressed air, waiting to be let out and no physical proof of anything there  Now looking at this mood I was in, I could say that I was a child completely immersed in a very familiar jungle without a left brain (or my spirit-faculty was simply not up to trusting its daily-logic completely, particularly after what Id seen and felt last night, emotions and a pending dark place that I had no idea was inside me being created, i.e., the inner-graveyard): it seemed that many people were trying to deal with what had been brought to them as unplanned and very unexpected worlds of being with themselves, seeing mirrors who stepped directly from an un-dismissible level of conscience...  Everything was right and yet haunt-like.  </p><p>The second night formally began the same as our first; with the rules and considerations, the cleansing ceremony, tobacco snorting and the drinking order: only, that night with the feather and incense ritual a man did it, whereas the first night the wife (one of the owners of the property where we were stationed) performed it.  Also, another shaman from South America and his friend had come to visit and partake of the ayahuasca ceremony.  That night had many different people than the first; some traveling very long distances to attend.  Newcomers would share in those stories rolling over from the previous night; it seemed to be a kind of litmus test or testing of the waters...  Though ultimately this kind of inquiry is futile (IMO) because ayahuasca follows no predictable pattern or atmosphere, every night was an original painting...  I will say that deep healing is an utterly difficult and soul wrenching process; this part of ayahuasca is predictable... There are no corners or secrets it cannot access... </p><p>                                                  ______________</p><p>I noticed that the groups tension level seemed higher that night, though I may have been projecting my own out onto the group portrait: I myself was stirring a bit more than the first night, leaning forwards, cracking my back and breathing deeper.  As my turn came, I walked over to the shaman and noticed that he had just stirred up the mixture, something he had not done since before the first person drank, which was perhaps ten people ago: I sat down and drank the cup full of ayahuasca, then a half-cup of water and went back to my station and sat down, taking a few deep breaths, thinking about the unknown sensation in me and waiting. </p><p>The space/time waiting/meditating on its arrival and all the questions or blockages your feeling about your life wish assistance with that occur in between drinking the ayahuasca and the onset of the effects is indeed a high vibration(al) mood: because I understood that Ive signed an agreement to see myself for all that I am (even if I dont even know anything about the are); I could sense the contradictions attitudes and egos wrenching around, squirming under the thumb of a level of conscience thats normally not accessible in an everyday lifestyle or certain mental excuses and justifications for my contradictory actions and attitudes.   </p><p>While waiting, the traditional deep yawning didnt arrive; then I felt that being outside near the fire would be better than sitting inside, so, unexpectedly I had to gather up all my gear so to be outside in the cold for hours: I put on my layers of clothing and went out...  At the entrance of the tent was where we all stationed our shoes (on a bookshelf)...  I knelt down and put mine on and began walking to the campfire I was hearing that some people had already began vomiting and moaning a bit around the tent; I estimate that it was about eleven oclock when I made it from the yurt-entrance/exit to the In-Between Space, that piece of yard between the campfire and the yurt.</p><p>I looked down and immediately the ground started to take on the traditional, three dimensional geometric grid-work, spanning everywhere...  I then looked up and saw the firelight, its pixilated flames: I walked near the campfire and knelt down, the visuals were a bit too much so I closed my eyes and then felt a bone chilling cold come over me, a sort of catching of a chill (that stayed) and which the campfire couldnt penetrate (it was as if the campfire was simply an image of a fire without its emanating elements), while a sudden sense of doom opened up on the landscape surrounding me, even the air I was breathing seemed to have a sort of dread-incense about its essence...  I closed my eyes.</p><p>I opened my eyes and looked around, I could feel the environment around me breathing, pulsating: I looked at the people, they seemed deeply deathly, not able to help me (if I needed); I seemed unseen by them, fatally invisible, a complete abandoned identity rose up in me: I felt the atmosphere turn colder although I was all the while near the campfire.  I looked and realized that the fire was not big enough and simply didnt have the physical energy to make it larger, I was frozen in place; a sudden eerie-ness swept over me, I felt it coming, as though the entire natural environment was stalking me like an omnipresent predator, I could only embrace the emotion embracing me, one of extreme, psychotic-mind-raping danger, painfully-cold-abandonment and utter helplessness, while all along I sensed something deadly was about to happen and though I knew it was arriving I had no clue as to how long I had to stay in this eternally-seeming state of anticipation, it was driving me into a sort of panic-madness:</p><p>I immediately began uttering one word, this word was the first name of the shaman, I kept saying it over and over, like an auto-alarm; then I opened my eyes and felt my legs walking, my feet moving (kinda without my consciousness); a voice said, Yes, I have you, lets take you inside the tent, come, you can make it... here, wheres its warm.  This was the shamans helper (thank you Yon Fred).</p><p>Once inside the yurt, I recall that I was lead in front of the wood stove were I collapsed on the carpet (the entire yurt was carpeted): then began my awakening in Hell, my hell, I immediately knew this, that it was my owned Plot of Territory in the World of Hell, perhaps this is what was underneath the Inner-Graveyard shown the night previous. </p><p>Exactly where in the sequence of events belonging to that nights journey that this experience took place is a bit confusing, it could have taken place next to the campfire (I recall feeling that the hell experience took place outside), though its my recollection that the shaman told me that I had been in the tent the entire time of the journey (lasting about seven hours total) and that Id spent the total experience while on the tent-floor: I did not vomit this night, nor defecate...  (It is said that in some cases the plant spirits decide to keep the substance in the person, to work deeper and more intensely on certain issues)  This, some people said, was how my experience lasted so long, so far as the intensity remaining very much at the same level with no change until the last half hour of the total seven hours.</p><p>So, I recall, that the descent or awakening into hell came first, though it is possible that it came in between the first introduction of the force which my consciousness had awakened into and was, once I was brought into the tent.</p><p>At the point of now being in the tent, the first thing I recall was suddenly opening my eyes and noticing strange shadow-shapes and faces above me: immediately I began to growl and roar fiercely while showing my teeth in an extremely defensive and fearful way: deep, forceful rage issued out from between my clenched teeth for what seemed to be a half hour or more, yet time was not something I sensed then, only segments of actions and reactions, emotions and the actions of others.  All of the seething rage and anger was taking place from the collar bones and up; my neck and facial muscles, jaws and teeth were completely possessed by this full blown emotion of extraordinary rage...    </p><p>I remember intervals between the growling and roaring through the teeth sessions, where people where not moving and things sort of slowed down and became quietly tense for me: as soon as those of the male sex began stepping by my head and generally moving about, I would turn just my head and growl and hiss in a feline way at their movements and close proximity.  At first, everything from my neck down seemed to be there, though invisibly pinned down in some passive way; it was as though the mood was quartered off in my head and neck...  For the moment I was sorta emotionally paralyzed from the neck down.</p><p>Additionally, during this arrival time into the tent and while on the floor, I opened my eyes and recall hearing voices and the door of the yurt abruptly opening and closing several times, (The yurt door was located directly in front of the stove where I lay, about ten feet away and still, to this day, six months later, whenever I hear a wooden door close against a hard surface, I am transported right there again: its good though, because I can measure a certain place in my emotional growth to some degree by this bell.) </p><p>With this coming in and going out occurring, I could feel the cold rush of air blast across me as though my entire skin had been torn off, exposing my organs and muscles to the freezing air: the sense of mild, distant warmth from the woodstove and the tent door opening and closing three or four times, letting the coldest feeling air I can recall experiencing in my life (beyond the Russian winters), was nerve wrecking to my instincts and raging emotions, of which, I was total instinct and had no sense that this sort of treatment would ever end, I also felt trapped and very threatened and confused; because, as soon as I opened my eyes I knew deeply in my consciousness that I was a tiger or more honestly Tiger was I: never, through the entire seven hour experience did I sense or think otherwise, in other words, my entire consciousness was that of a tigers, while the only things that seemed familiar was my particular individual presence, only I-presence and I-emotion.  My personal identity of both that of being a human being and having a name and life-history was utterly ripped away and simply not there for the whole seven to eight hours. </p><p>Lying on the ground, it seemed at first that I could only move my head and make extremely enraged sounds at those who were knelling or standing over me: later I was told that many people had gathered round me that night, giving supportive energy and playing music.</p><p>I recall at the introduction of awakening and knowing that my total consciousness was that of a tigers, four distinct things that seemed to set my rage and fear off: one was the opening and closing of the tent door which let in the cold blasts of air, compromising the small bit of warmth experienced there that I knew was about three feet away (if stillness and a shut door would allow it to travel back over to me); another were the sounds of people talking towards me, seeing their faces moving, expressing emotions and certain thoughts that I sensed were not sincere, some triggers (buttons pushed in me) later would be by that of a small episode of laughter from a man concerning my behavior (Though this was only one very quick incident and the shamans assistant moved this person away from me).  Another phenomenon was that of a dog barking outside, sometimes it sounded like two distinct dogs and other times as if one of the dogs was actually on the inside of the yurt growling in the background (the owners had four dogs on the property, all of who freely stayed around during the ceremony).   [Four months after this ceremony I read that its customary for certain villagers in the Amazon to muzzle their dogs before an ayahuasca ceremony because its rumored that the sound of barking dogs during a session can drive a person insane.]</p><p>Some part of my consciousness knew in the moment of hearing the dogs growling and barking that they were responding to the arrival of me, the spirit or presence of the tiger This sensation of being suspected and worrisome for the dogs heightened the experience of being surrounded, inside and outside the tent by threats and respondents of something threatening, that is, my loud roaring through the teeth, hissing, etc.  I kept up this growling fiercely through my teeth, as the shaman and his assistant moved around me with the sounds of the tobacco fan, (a rattlesnake sounding device) and chanting; while the visiting shaman was singing in the background and smoke was being spread over me</p><p>        The Awakening in Hell Journey</p><p>I recall awakening in this hell (most likely this journey took place before the tiger) This was the most difficult part of the experience for my human consciousness because once therein, I knew that what I was experiencing was human emotions and only things that could have happened to a consciousness while incarnated as a human... (I experienced it with a human consciousness and relationship to the things being performed upon me and was not in the tiger-consciousness here; it is because of this that I mostly sense that this hell experience came before the tiger awakening).  Although, this awakening in hell may have begun before the first awakening of myself as the consciousness of a tiger or in between the first incarnation and the rest of the tiger-journey continuation: this may clarify itself at a later date.  [This still hasnt become clearer, some 6 months later; I still do not know exactly where this fit into the evenings unfolding.  I can say though, that both were distinct segments or (lives/livings) and didnt blend into the ending of one and the beginning of the other.]</p><p>This was the Awakening in Hell Journey  ~  I awoke and felt as though I were frozen or being used like a doll, tossed around in a muddy, balmy-slow-motion-vicious place and handled one hundred percent by forces of the most horrendous and diabolical of evils</p><p>The first episode was that of what seemed like an eternity of handling; I had no sense of an ending and actually it felt as if it would continue indefinitely (eternal): the feeling of this indefinite continuance was a huge magnification of the terror, for even in dreams I understand that there is a time table or an expected episode-lifeline (Its part of the dream sensation.), points of reference, even at times the dream world can semi-connect with my conscious-worlds sense of a next moment-time perception in beginnings and fading away, yet here, it was an endless stream of handling with no ticking clock-world to rely upon (or take for granted)...</p><p>In this first episode I was constantly raped by men, defecated upon, pissed on, soaked in vomit, diarrhea, sperm and tossed about between those administering the treatment: I could hear voices saying that, Hes eating it, really!  Others were stating that, I did!, exclaiming that they had copulated with my mouth, etc., also exclaiming the fact that I was eating my own shit: I could feel in this Awakening in Hell all the bodily sensations as though I myself were also truly defecating and pissing throughout this first episode, that I was eating the most disgusting and vile of substances, both that of my own and others: of being constantly copulated in the mouth by the males and from the rear: though never, in this awakening, did I myself have sex, it was all being done to me  I could hear the explicit sounds of long farting, the liquid squirts of diarrhea, its splashing upon my back and being soaked in my hair, the pissing on my body, my face and in my mouth, the sounds of excretion oozing out of people, the sounds of bowel movements and digestive blurbs and pops: my whole body being riddled with raping and being humiliated beyond what I thought I could ever imagine enduring the feeling of</p><p>In this experience, the emotional humiliation and desperation was of such a quality that I felt indeed dead; that my consciousness was trapped in this static un-dead doll, a dead body with a consciousness watching, receiving the emotional signals and feelings, though not feeling any physical pain, only heat and cold at times while being used and abused to the height of human depravity and rottenness. </p><p>I could sense my death beating, a kind of inside-outside saturation-ing of my Inner Graveyard; I couldnt conceive where such treatment could originate from, though knew that it belonged to me, that it was all my shit  In this experience a recording of my voice in conversation was played (A conversation sample with another person from my actual life (my reply only and not their voice) prior to this journey and the taking of ayahuasca...  To fix an example in my mind of the realness-connection to this place?)  In this voice recording was a sample of some debate I was partaking of: in this moment it was deeply impressed upon me that the nature of this sort of conversation, the type or kind of self it invested in and took from others was some key contributor to the shit and rape I was being submitted to  (Aka, the doubting Mr. Know it All.)</p><p>I later thought examples of this could be of doubting others through comparing my impression of them to being sure of myself, and the ensuing righteous disappointments and using them as self-crutches for right advice and spiritual advocacy, expectations of them, so to hide my own most subtle hypocrisies, extreme judgments of them through personal desires not being met, justifications through comparison, defensiveness, paranoia of loosing, etc.  All these or similar qualities showed up in my conscience as blueprints for this hell, among other psychological investments and inner things; particularly around the subject of the sexuality Ive been given or have had.   </p><p>Once I realized that it (the voice recording and the mood or slant that the ayahuasca spirit was showing it as it really was, via a third party hearing/receiving it with feeling) was this (the one or main contributing aspect to this Hell) something odd occurred: it was as if that section or place in my brain or mind where the attention rested upon this aspect was suddenly, with the white hot precision of some electrical device, singed or administered to by an electrical current to the state of disappearance, ash.  I could hear it sizzling and sensed the deep white hot heat within the physicality of my brain and skull.      </p><p>The Awakening in Hell continued as I was seemingly pressed through Hells intestines to the next stomach or digestion</p><p>I arrived at a room or outdoor courtyard; it was semi-dark, four to five men were standing near me and began raping me, shitting in my mouth and covering me with defecation, piss and sperm, while handling me with cold hands.  This scene blended into the next ~</p><p>I found myself standing upright (since the Awakening in Hell I had been only on my hands and knees) and alone, in a room: limply I stood next to a filthy dirty bed, the room felt abandoned, like that of belonging in a deserted building or motel  I looked to my left, a faint light shone through the window and onto a bed to my right (it was contemporary times on Earth), and laying there was the dead body of (what I sensed was) my brother (The half-brother that was born four years before me and who lived to be only 15 minutes old, also given the same first name as myself.)  He was grown though and looked to be twelve or thirteen years old (15?).  His body was covered in blood and dirt: he seemed to be rotten, putrid and of the stillest of possible objects.  There was a sense of cold, timelessness, eternal death-pause-ness: the room, again, had a sense of abandonment; the walls were dark and greasy-like, the body lay in a straight position, I stood about three feet from it, staring and standing.  It was as if this room was isolated from all connections, but one, a place to visit and look and be  I had no sense of how it was that he had died, that is, what the circumstances might have been, etc.  The environment was filthy, absolute death stillness, and was like a concavity in a geode, protected from time and the transformations of understanding, feeling and love.  The closest comparison I can now apply is that of leaving someone who is paralyzed from the neck down to slowly die in an abandoned motel room with the doors locked, no electricity, no returning  [One of the strongest impressions for me about him was that his body was dead, though growing old, like an undead-being growing, maturing, etc., i.e., although the body was decaying and lifeless, it was aging...]</p><p>On and on I moved through this hell: suddenly I awoke in a crib, as a baby, an infant freezing cold, laying flat upon the cribs covers soaked in piss and wet waste matter: I felt completely covered (like frosting on a cake) in the cold, freezing paste of piss and waste mixed together, like a second layer of skin: I lay in this crib and was looking straight ahead, no eyelids blinking, no side to side peering; I felt the most horrifying sense of abandonment and filth, of a deep, vivisection-impending doom and timeless, stretching, round and round suffering, a sort of vast emotional sensation that this environment and condition would be my fate forever, for an eternity, that I was it, a sort of icon for such conditions and way of Hell-being</p><p>The room was semi-dark, the air was bone chilling cold: alone, fear, no one There was a sense of my worthlessness and total relinquishment of love, care and trust.  The totality of this crib experience was so overwhelming that I knew that I was being slowly killed or would will it slowly through all these experiences (or the experiences intelligences will would) Yet I had no sense of when: it seemed that death was not a part of this places process.  I couldnt understand how it was that I was still alive; it was as if Life and Death were of only One place I used to know, not of Hell, not of this place: that in this place the laws of passing time, exhaustion, blacking out or dying of a cardiac arrest were simply non-applicable, non-existent</p><p>Then, I found myself being ushered out, like through a tube of some sort: seemingly defecated out of the bowels of hell, and from a background point of view, (being now up in the air) I saw myself (my body) floating in a vast river, broad and grey, semi-polluted waterway, I was dead...</p><p>I watched as my body floated down and bumped up against a stone wall and stopped: vaguely I recall it lying on a cobblestone street of some sort or on a flat place near the river, in the motionless grasses.  [It was as though this place was either like Black and White photography or painted in sepia tones of much grayed blues, browns, etc.] </p><p>I was suddenly tossed/transported into outer Space, where I stood (my presence was suspended in black, black Space) like a star and there I simply looked and knew that I was the beginning and ending of all that ever was I: and the phrase I am behind the underneath came to my consciousness: I could hear incredibly beautiful music being played (this music I believe was being played by those in the yurt-tent: Icaros?) and I began to glow of a golden light; I could see this golden light radiating like a mini-sun from underneath my viewing presence, as if it were rising up from underneath my chin, though in outer Space I couldnt discern having a body: I can call it from an under-my-looking view. </p><p>I felt as though I were being born and found myself slightly lifted or quietly transported a bit Then, simply lay in space, as if I were lying under a tree after a picnic, simply looking at a single burning star: I felt the coldness of Space and realized that this coldness was also mine, that It was  I lay staring at this starlight for a very long time while the shamans assistant tried to revive me to no avail  My body on Earth was dead (Unconscious; though half or 1% of my presence, like a mini-video camera left behind, was still On, looking out and I could see myself as the camera-lens-presence-looking-out, while registering it in outer Space): I recall knowing that he was picking up and letting fall my arms and legs, they were totally limp: I also remember him joking a bit and placing my index finger in a pointing up position, though dont recall what it was that he said  Hed yet to understand (or connect) to the depth of what was happening, IMO...</p><p>I awoke, (with more consciousness now invested on Earth in my body and brain, though no thoughts) and staring at the wood stove area, I was in my eyes only, no mind activity, though I could hear voices, no emotions, no decision making capabilities; I sensed someone was knelling over me, they were saying, Youll come back, you will, you will  A damp hand pressed over my face, saturated in some sort of sweet, musk smelling oil A voice said I am with you  The person put this oil in my hair and gently on my face and possibly neck or chin.</p><p>All of a sudden the tempo of the moment picked up, I could feel a sort of frenzy in the air; vaguely I heard someone saying, Is he breathing?, Will he die?</p><p>I could feel someone opening my shirt and checking for a pulse on the side of my neck A half-laughing voice said, _________we didnt mean to kill you, really.</p><p>My solar-plexus convulsions began again  I could see someone peering over my face, looking down at me: some part of me recognized people though knew not the context, throughout this whole experience I had no recollection of having taken part in an ayahuasca ceremony and how it was that these people were all around me  I was inhuman looking at humans...</p><p>The face I saw didnt look like a human face and in my consciousness there began a sudden terror because two pictorial reality-worlds were colliding; the first was that of thinking I knew who it was that I recognized, then, realizing that it had the face of someone I had no idea or recollection of...  This face looked like a combination of a human-fleshy muscle surface (a normal face) and that of geometric shapes and grids, yet still forming the symbol of a faces qualities  It was a very powerful face, similar to those seen in Aztec or Mayan/Incan motifs  It terrified me and I roared with the deepest fury my human body had ever produced, this went on for some time.</p><p>I was there but another part of me was still in Space, my consciousness was all around, excepting the receiving flesh body that my presence starred out of: the person kneeling over me was the shamans helper, I heard and felt him blow water onto my face from having held it first in his mouth; it dripped and slid off my eyeballs (I couldnt blink) and flowed down my neck and cheeks, no response  Deep convulsions in my solar plexus continued and went off and on for several hours  He pulled up my shirt and blew another burst of water on my sternum/plexus area and began to make grabbing gestures and slight pulling and releasing gestures on my skin in that area and on my stomach (As if he were pulling seaweed out of a barrel or weeds from a garden)  He blew water in my face several more times trying to revive me, trying to contact me by the sound/sentences of his voice; I simply starred, with my head slightly tilted sideways to the right, the convulsions began to get very severe and quicker, I recall that they were so strong that my body flip flopped around on the yurt-tent floor in total, like that of a fish out of water   </p><p>I came back a little more from the pure consciousness-blank state of awareness in outer Space: I recall gazing at a small candle burning in the dark, placed on a wooden upright log near the wood stove, I awoke within awakening. </p><p>While I was in this Space-like state (Staring off into the expanse, I recall having the sensation of something missing or not having ever been able to do; a thought coming to me that I had never gotten to say goodbye to my mother, I cried a little, yet, something fell out of the bottom of this emotion, this examination or revelation, something else was arriving: this Not being able to say goodbye feeling was much deeper than that of the contemporary story of my mother and myself being separated at the age of one year and a half</p><p>I could sense that it was a flimsy association and not the core; it simply felt vague.  [It arrived though, (IMO) seemingly from my logical human mind, the left brain region that had somehow tried to associate an episode or likeness to the emotion/issue, to pin it down and label it, so to be able to be with it...  There was even a slight whisper of an Aha, though this was very distant from a gut feeling and blowing away from it self like a puzzle in an oncoming storm.]</p><p>I awoke as the tiger: people were sitting next to me, I began growling again, I could hear people exclaiming, as if in disbelief that it wasnt over  I found myself backing up on all fours, just as a cat does from a dog or some danger larger than its confidence</p><p>I recall being absolutely knowing in my presence that I was a tiger (tiger was I) and that any image of the male (man) angered me intensely, though, just as I saw a female human arrive and sit down near me, something within me relaxed and I wished to be near her; a sort of kindred-ness slightly opened up in me and I understood that she could be trusted.  I didnt feel protective of her, only curious and slightly distant in regards to making physical contact or acknowledging my wish for a kindred connection.</p><p>I drug/crawled myself backwards on all fours and bumped up against cushions and peoples feet where there were those lying in their sleeping bags, I felt cornered and extremely defensive, though mainly fearful with no sense of being able to do anything, simply on the defense though not attacking, watching intently one particular man-human looking at me and beginning to laugh; he and another were sitting in front of the wood stove  (As I mentioned before, I recall seeing him being spoken to by another man and getting up to leave).  I stayed in a position where my buttocks and back legs remained flat on the ground, while standing only with/on my front arms/hands, with my torso perched up: I was staring at him, while he smiled, for a very long time, peering through my own hair that had fallen down in front of my face  I was in total anticipation, distrust, confusion and anger  </p><p>I recall one woman coming over and laying down beside me and I tried shyly to touch her sweater; a little dangling ornament of cloth was there...  When I slightly pulled on it, she felt it, rose and moved away: with the extreme convulsions in my solar plexus, after a session of these, I would oftentimes collapse and close my eyes or stay still, within the space of feeling, though not seeing (I may have experienced mini black-outs).</p><p>I also remember that while lying next to the wood stove and simply staring, that another woman placed her hands outstretched and in front of my face, like those of someone trying to communicate some gesture of safety or relative-ness to me, i.e., it was cat-like in gesture and placement</p><p>It was during the seeing of the first female human that I instantly knew that I was a female tiger and that the image of the male of their human-species made me recklessly nervous, extremely enraged, fearful and defensive.</p><p>Few people ever touched me during this incident: people played music and the visiting shaman chanted and perhaps did some sort of ritual: the story of others actions I have yet to receive, though know a little involving the others. </p><p>I recall awakening once again (still as the tiger), to another image, that of two young Russian men sitting by the wood stove; I found that my leg had gotten close to his or vis-a-vis, I moved it away quickly and began to try and curl up a bit, watching them all the while with great distrust and anger: also I could feel within myself that I hadnt the will to move them away with my foot, to shove away: I lay there building up in rage as they kept talking and suddenly an incredible something occurred</p><p>There appeared in my consciousness an emotional thought that said ~ How dare you pretend to be normal in the face of my danger!  How dare you challenge and try and take away my void, my emptinessetc. </p><p>I recall that this emotion of How dare you! built up and up and up till I began to loose my stillness again and began to growl through my teeth and fixedly stare at them: I moved around a bit and the solar plexus area began convulsing allot, while somewhere in this continued ayahuasca session someone handed me a large wolf pelt to hold...  As soon as I felt it, I pressed it (keeping it turned upwards, i.e., the fur side away from my bare chest) all along my front and lay it lengthwise down over me and began stroking it profusely</p><p>People in the yurt began playing music (I assume it was them; I heard it nonetheless) as I moved about on the floor in a snaky, dance-like sensual way, laying on my side rubbing and sensing that indeed, this was I touching myself, enjoying myself, my own body and tactility for the first time since the trauma/episode was born (whatever that was)  That I was accepting, loving deeply the sensation and lushness of my fur, me, mine</p><p>The music stopped when I ceased moving serpentine-like on the floor and in the throes of more convulsions; I recall that they tried to treat the shaking on at least two occasions and with no success, so they went, jolting me about, off and on for several hours  Sometimes, while stopping for a little, even my consciousness would sense they were over till another trigger would arrive, like that of seeing a dark robed figure sitting near me with its back turned toward me or a shadow on the tent wall whose body I couldnt see or locate  At one point I recalled sensing that Death herself was sitting nearby, as though the shamans had an unexpected visitor or someone there on business not of the same kind as their healing trade  [The figure just sat and didnt move, nor did it approach me with any communications whatsoever; it simply was, like a totem of a sort or dark partner or attachment.]</p><p>The convulsions suddenly erupted in a series of extreme flip flopping of my body and I began breathing at a very fast pace, while making a cat-like gargling sound from deep within my throat, like that of a sort of very loud, panting purring noise  This very rapid and heavy breathing went on for a long time and suddenly I absolutely knew that I was experiencing (re-visiting) a memory (though in this realization, I was actually there, within the time-frame itself, living, being); the quick heavy breathing stopped  I took the fur-pelt upon my lap and held it in front of me and opened my eyes and found therein the fur-pelt-jacket, with my searching hands, a shape of a great sized tiger ear (that was in essence the short sleeve of the pelt) and began stroking it...</p><p>It was here that I understood, that He was gone, my he, that I was experiencing the episode of the last time we were together, that we were being chased by hunters or something of this sort: that hed been killed while I kept running and that I never got to see him or acknowledge a goodbye to his open eyes, to feel his spirit departing its body, his body heat leaving, its existence against me for the last time, etc.   </p><p>I stopped and realized (at some point in the last two hours of the ayahuasca experience) what it was inside this human body experiencing the solar plexus convulsions, what it was that was jolting the human body about the tent, seemingly banging against my solar plexus wall (cage door), was that of a trapped tiger, fiercely swiping the inside walls with its claws; trapped, angry, round and round within circles of anger, resentment, depression, lonesomeness, rage and possessed by its human-minds desperate occupations to fill the emptiness, the void, etc.  I could envisage the paws filled with outstretched claws, tearing away at the, until soon, unmovable, impenetrable wall</p><p>As I grasped the pelt closer to my face and neck I sensed with the totally of my consciousness that I was with his dead body, that I was giving him my love and that I was at last saying goodbye: I recall the agony of my love for him as I began to receive vivid pictures of his face in my minds eye, whole body images and the memory of walking next to him, playing with him, hunting in the grasslands, etc.</p><p>The touching and placing of my face in the pelt went on for a very long time  As this realization of his death and my unresolved trauma-atmosphere connected to it, it sunk deeper within my spirit, I realized many things, particularly how it was that I was so enraged with the other human men; (that it was occurring on the symbolic level) because I had hated the sight of that which I hadnt been able to say goodbye to and could not accept under any fragment of a dose, a hello from them (the human men or male).</p><p>I also remember, as I lay on the floor, that the sensations of hot and cold, the depth theyd penetrate my body, changed from time to time depending my emotional state: while dancing on the floor I was warmed through to the core, other times I felt deathly cold.  It was during this stage that the back of my neck and head seemed to seize; it was as though I felt something was in my head  I started to hit my head on the ground and  move my feet in a grinding gesture on the carpet, like that of digging in  I began to frantically shake my head around, over and over, finally resting down, while the plexus convulsions began again  Within this experience the shaman grabbed my head several times and clutched it with his fingers, massaging it a bit and the back of my neck, I vaguely recall that he may have put some sort of scented water in my hair and on those areas...</p><p>I lay on the floor and envisioned myself settling down next to a stream (perhaps where He died, my tiger mate): I sensed that I had made peace with this void within myself; I could clearly see the image of his face and body moving about within me, filling that void... </p><p>I also sensed that Id never stood on my own since that fateful evening (On the realization of his death.) and slowly I raised myself up on two paws  I recall looking down and seeing my human fingers bent downwards, in a claw-gesture, supporting my weight, with my head drooping  (A fellow ayahuasca-journeyman would later tell me that it looked like I was carrying the weight of the world on my shoulders.)</p><p>I recall at this moment of feeling an enormous weight pressing down on my head and shoulders as I raised my head, I could see with my minds eye an image, that of a tigers head raising up in the rain and looking out over a sparkling, nocturnal landscape and making the clear decision to go on, of being able to now go on without him.</p><p>Again, I could clearly feel him walking around, behind my thoughts, behind my mind.  It is as though, to this very day, I can feel him living inside of me.  [Today (nightly) I perform a ritual involving this totem-spirit.]</p><p>I felt that something was over (or through to the other side, a revelation, a death and a continuance from where once lay a stoppage-point) and that I had made my peace with the memory of him, with my love desire for him; that my conscious love could go no deeper than that which I was now experiencing and sending towards his existence, honoring him as only my risen, revealed, healing self could</p><p>I remember clutching the pelt for a very long time, stroking it and staring at it, seeing it as the backside of his head, stroking his great sized ears and sensing with all my being that of saying farewell, I honor remembering, I honor, I honor</p><p>After this, feeling slowly the state of reconciliation and connective-ness flowing through me, I began to sway and move forwards and backwards slightly with my head, shoulders, and torso: I distinctly felt as though I were flying upwards, though had no vision of any particular bird-shape, simply flying forwards, upwards and along a road of air.</p><p>As I was now sitting up, I noticed a change in my opinion of the male humans, that now I saw them as related to He: I understood (intuitively and with a kind of humble omniscience) their In-Nature-predicament and their very special essential differences in nature to that of the female; I could now relate to them, I could forgive them, though most importantly, myself for having made them unknowingly some sort of resentment symbol via my loss of He</p><p>I reached out to the shamans helper and he took my hand; I recall placing my forehead against his and resting its total weight forwards into his: at this point someone opened the wood stove to check it: it was then that something odd happened ~</p><p>As our heads were pressed together the fire began to rage and I heard someone exclaim, Look at the fire!  Look, oh my god.  I could sense that the fierce love I had and have reclaimed/reconnected to my long departed mate was being transferred to his (the shamans assistants) spirit through this forehead gesture/connection; that I was sending my lover (Out there somewhere, yet here) my most ardent and most intense love-energy possible; the wood stove fire raged and then someone closed its hatch...</p><p>We slowly parted and I reached out and touched the shamans helpers face, closed my eyes and ran my hand down his face and neck, down his collar bone and onto a spot above his right breast and began to press deeply there with my forefinger, I reached around to the other side of his back (directly behind this spot) and continued to press and massage there This lasted about a minute; he thanked me and later the next day asked whether I ever did any energy work with my hands, I mentioned that I had, a bit, though no professional training or knowledge: he said that I had found exactly his spot and should pursue the using my hands talent in a joyful way.</p><p>After this I stayed sitting upright and was still totally in the consciousness of being a female tiger: I recall sniffing the air and looking around, quiet, getting used to being centered, standing, reconciled as being on my own, alone, myself without the need of context</p><p>I saw, to my right that one of the young Russian men was sitting next to me: I was still in a state of merging with the saying of goodbye and the accepting of continuing now without him (the male tiger) and the unfolding perceptions being applied towards the healing of my relationship towards the male-humans in the room:</p><p>I recall taking his hand and finally laying my head in his lap and beginning to cry deeply, feeling his male nature merging with the memory of that belonging to my male-tiger mates and the surrendering feeling of my own female tiger-nature outwards, to the whole world of Male, of acceptance, understanding, peace</p><p>I lay across his lap and he rubbed my back, neck and head and held my hands; I couldnt see his face, though did tell, by the gesture of his hands, that he was looking at them inquisitively, my hands seemed like those of a small childs in the size of his: shortly after I began crying, another male-human brought a blanket and laid it across me</p><p>While laying across his lap, the first thing the young Russian said to me was ~ I will not forget (Thank you for remembering)  Which I immediately took as being said by him, the tiger now walking behind my thoughts, I continued to cry</p><p>I also remember him saying ~ I know; its not easy being a son.  After hearing this, I knew that this wasnt the issue or experience I was having, that he was simply associating my experience with one of his (IMO)</p><p>I recall laying back down by myself and closing my eyes: then suddenly opening them as if my human consciousness/identity was tossed back into the ceremonial human-mix by some celestial hand: it was a very odd feeling, it was as if a switch was thrown inside my head and I returned, settling behind my eyes, nearly double-looking through my eyes, recognizing people, meanings, the subject of the day, the night, what had occurred</p><p>The yurt was silent: I lay down and could feel some slight expectation of throwing up: this soon took on the image of an inner portrait/picture scene ~ </p><p>I was in another place (not the yurt) looking at a large bed whereon there was pictured a huge ball of flesh, like that of some giant placenta (It was big enough to fit ten to fifteen people in.): there were people surrounding it, ancient looking people (their dress and demeanor), they were playing songs that seemed to be getting higher and higher in expectation and crescendo, like a drum roll before shooting something out of a cannon: I could tell that theyd congregated there to perform a special ayahuasca ceremony of throwing up, I could even sense the sacredness and semi-seriousness of it having to be done, although it never happened, I never actually threw up</p><p>This drove a part of my instincts into a sort of desperation, because this image and drum-roll-nature music, along with my throat and body language pointing to a huge vomiting session, went on and on, replaying itself three or four times, till it simply ceased and calmed down.      </p><p>I recall going to take a shower and washing my body: looking down and touching areas and beginning to cry deeply, for my own bodys sex suddenly triggered a strong recollection of his (the male tigers) and that my human body was suddenly both, while my upper part (breasts) reminded me of myself with him (the female), while the lower, of him.  I stayed in the shower a very long time absorbing the heat and sensing my experiences, my lessons given by the spirit of Ayahuasca.</p><p>The rest of that morning and afternoon passed slowly; people did not speak much, I felt a little bashful; it had been a long night for everyone and I had been a definite handful; though I understood, as with the man who in the first session was wailing most of the night and getting sick, that this process, everyone understood and accepted: none made fun or seemed to be indignant or resentful about anything: the lessons transmitted by the ayahuasca journeys were the main priority, i.e., to become more conscious through their transmissions and those feelings and perceptions achieved.</p><p>I sense at this time those lessons were ~ </p><p>1.  Make a ruthless choice between serving the negative and the positive: and just</p><p>because you are depressed and utterly abandoned and alone doesnt give license to</p><p>serve a little bit of both worlds, that of Hell and Love.  And, although this occurs</p><p>in everyones daily life as normal, it may not be the end of ones predicament and</p><p>journey out of contradictions, opposites and extremes; that perhaps the agony and</p><p>ecstasy arent attributes of a conscious state-goal reached, but rather, theyre  </p><p>indicators of an oncoming death, away from such ups and downs.    </p><p>2.  Watch more deeply what I say and write; what I transfer out into the material,</p><p>Human-incarnation-sphere, that it has its own sort of Hell, that the depravities one</p><p>suffers are the perversions and corrupted thoughts that have entered into ones void</p><p>as an atmosphere to act from (mind) and not the self, the pure finding-ness of the</p><p>I am.  Too, that developing a certain kind of energy towards rebellion or protest</p><p>against certain descriptive sins can possess one as unresolved shadows, shadows</p><p>that oftentimes find exhaust routes through not the discussions concerning the</p><p>source of the moods evil, but simply the common days events; that protesting</p><p>issues that oneself cannot actually touch and effect in a verifiable way, these</p><p>subtle, soft- resentments of final-solution-helplessness can color my spirit of</p><p>things-mood.</p><p>3.  That death is wisdom and opportunity, not eternal punishment and remembrance of  </p><p>sins.</p><p>4.  The void often felt within me, the sore spot which reacted to rejections,</p><p>argumentative possibilities, things not going my way, abandonment, etc. were all</p><p> radiating from an unresolved trauma of not being able to say goodbye to who seemed</p><p>to be my first love and soul mate.  That once I relived the experience, went back there</p><p>emotionally and in total, spiritually, psychologically, emotionally and physically,</p><p>touched him, rubbed his ears and grieved, accepted his death upon my being-ness, that</p><p>the void then filled with the image of him: I can still envisage him walking there,</p><p>behind my thoughts (Also, it could be that the image is that of my own, yet, when it</p><p>arrived within me, I distinctly sensed that it was He and not simply a reflection of</p><p>I.)</p><p>5.  That I was born in space and not on Earth.</p><p>6.  We may have several consciousnesses overlapping within us at any given point in</p><p>time and definitely remembrances recorded of these lifetimes as the same presence</p><p>as an I Am via other incarnations not human: while as a female tiger, I absolutely</p><p>knew that I was exactly that (though there was no mind in it so to be it); there</p><p>was no concept or percepts of being/having been a human being, having a name,</p><p>career, etc.  And that towards the end of the experience, my consciousness</p><p>as a human being with a history and an ongoing story was switched on, like an</p><p>electrical toggle and I-With-A-Name appeared, began associating and filling in the</p><p>blanks, so to speak.</p><p>7.  There may also be animal and elemental spirits who assist the plant spirits in their</p><p>ceremonial work and that music, heat and cold and emotional extremes played a large  </p><p>part in my receiving of the lessons; though, taste and the actual compartmentalized</p><p>sensation of physical pain or pleasure was never experienced...  (Instead, it was a</p><p>total, emotionally perceived unfolding/living alongside my Conscience and self: it was</p><p>an ultra emotional reception of either torment or safety, acceptance or fear, on a level</p><p>Ive never experienced so crystal clear in its definition and eternal(istic) of the causes</p><p>and effects within me, in normal life)...  This is based on the two experiences Ive had</p><p>so far; they were all perceived through the heart or pure instincts: the warm and cold</p><p>were perceived as either emotionally expansive and secure-warm or emotionally</p><p>terrifying and the bringer of destruction and an undisclosed time period of torture and</p><p>entrapment.   </p><p>8.  There is an underlying and above-lying order and dynamic: that we walk upon a</p><p>shifting geometric grid work: that there are teachers above those on Earth in human</p><p>form and of a type that doesnt equate or compare to those souls described by or to</p><p>be conscious beings or ascended masters.  [That all of our ideas of awakened</p><p>beings are within the limited framework of a human context (and rightly so), though</p><p>this is just a snowflake on the tip of the iceberg.]   </p><p>9.  The reason I have bitten my finger nails for my whole life seems to stem from a deep</p><p>resentment of no longer being able to touch him and to be touched by him (the male   </p><p>tiger).  Also, there is something there concerning the dulling of a certain extra level</p><p>of tactility and fingertip-sensation or intimacy.  This dulling seemed to feed a loss-    </p><p>identity of sorts, a victim identity; also, now that I am writing, I am also feeling that</p><p>it is related to not being able to kick away with my feet those Russian men sitting</p><p>next to me: one might say that its relative to having laid down and given up to some</p><p>degree, an identity of defensive-less-ness and I as an abandoned-I identity, i.e.,</p><p>having lost my claws or emotional courage.      </p><p>10.  Watching certain kinds of movies, laughing in a knowing way, writing with</p><p>  Tongue in Cheek, using certain forms of psychological argument, judging and</p><p>  blaming, etc., were ways to act from the atmosphere of the void (and what it was</p><p>  filled up with or the elements of my hot air) and not the clearer self.  That I filled</p><p>  the void with the external worlds circumstances (Its opinions of me and mine of its</p><p>  opinion) and not the primary presence of myself, totaled in the present now and</p><p>  reconciled.</p><p>11.  Unresolved emotional traumas can be totally unrelated to this lifetime and</p><p>  hidden away in a portion of our soul/spirit that weve lost the way and means to</p><p>  access through modern day religion/lifestyle and the use of common medicine and</p><p>  psychological treatments: that the drugs/drinks that are most harmful and addictive</p><p>  are those which are used for recreation or to fill the void or to numb its inner</p><p>  atmosphere (mind)  [Or the soul on the drug of its human incarnation.]  While the</p><p>  plant-medicines that are on the exact opposite of the hell drugs, that showed me</p><p>  further access to conscious love and the unknown investments in an inner graveyard</p><p>  within me, are the least known socially/culturally and those least prescribed to help </p><p>  people with all sorts of grievances/illnesses and spiritual/practical ignorance.</p><p>12.  Being utterly disappointed in this life may not be at all stemming from the</p><p>  proofs actually available from this current life itself; instead, it may be stemming</p><p>  from the glasses Ive worn via an unresolved emotional trauma.</p><p>13.  There are intelligences and powers the world is suffering from not having</p><p>  kept the acknowledgment of.  (IMO; although perhaps this vacancy is</p><p>   right and necessary for some purposes I cannot yet see or understand?)</p><p>14.  That no one wants to really be the source of another persons joy or sadness based on</p><p>  what they do and do not do in regards to the attached persons relation to those</p><p>  actions: it is subtle and often not acknowledged, while people suffer immensely by</p><p>  not attempting to journey differently with one another, still, too, this is a stage and</p><p>  not the final normal way of soul-participation with itself and the world...  (IMO)     </p><p>15.  People working towards heaven, could just as well be working towards their</p><p>  inner graveyards as well, in their recreational time.</p><p>16.  The plant spirits can use actual recordings of ones voice from a previous life-scene</p><p>  lived as a sampler to show a lesson when its coupled with a series of sufferings</p><p>  and scenes, to give conscience-proof to the terror of the context: this sort of hint </p><p>  was stronger than any actual, literal telling or explaining could have been; that the</p><p>  ayahuasca spirit used conscious implication as a teaching tool; there are emotions</p><p>  and perceptions that my daily-presence in/with this human-mind doesnt experience</p><p>  on Earth in the normal context of my life, though, nonetheless, brand new</p><p>  not human-like perceptions can happen and be worked out by the human mind</p><p>  and applied in a right way in my life, so to be closer to the soul inside the human</p><p>  condition and not primarily the condition itself as a subject matter or matter in the</p><p>  subject (or) a souls presence in the context of its incarnation suit exclusively.  </p><p>17.  That the plant spirits have a direct connection with my true level of conscience;</p><p>  while consciousness simply is...  They can do as they please with what your</p><p>  consciousness is relating to in order to give a lesson or purge (If you surrender to</p><p>  the sense that its indeed yours; if you cannot, they often take you through a</p><p>  process of shedding till you do/can.)  Theyre the master painters of both the</p><p>  hearts Hell and Love: there are no greater painters as they upon this Earth, because</p><p>  their paints are both literal, emotional and of the sort that reveals the most subtlest</p><p>  of hypocrisy within or surrounding a humans conscience and ones true deeds</p><p>  individual-definitions, their hidden meanings, intonations, ulterior motives, etc.</p><p>18.  That the lessons dont stop once the ceremony does; they continue in the form of</p><p>  emotions, re-relating with the same circumstances alongside the lessons learnt</p><p> and still unfolding in dreams, coincidental life happenings, visions, etc.</p><p>The day after the ceremonies I rested allot: I believe it will take at least four days to settle into my body in a more balanced way, though, even on the third day I cannot say this for sure; I still awake at night with the emotional sensation that a particular disturbing emotion will not end, that it will be forever  These emotions and depth of perceiving them were gathered from the processes brought into my consciousness via The Awakening in Hell.  Theres an inheritance thats taken place; the sensation of Eternity.</p><p>(I am on my fourth day and experienced last night events where it seemed that people had given me ayahuasca without my knowing: again, the difficult feelings of certain dark emotional perceptions, coupled with the eternal-feeling visited me and woke me up many times. It seems that the ayahuasca is still circulating in my system: my body is very sore, I have a sore throat and am somewhat instinctively vulnerable, my bodily energy is odd, in that muscle wise, I am weak and numb, though mentally and emotionally I am very alive and sensing a certain kind of balance Ive not experienced before.)</p><p>On the first day after the ceremony I was laying down on my bed; a clear vision came to me ~  It was that of a great sized owl (possibly a Great Horned Owl) landing upon my stomach: it began pecking at my solar plexus and revealed a chunk of meat, looking rather like a tumor mass  I recall feeling that I had to trust the owl totally, not add, debate, ask questions or even wonder anything concerning the story of this event unfolding: it took the mass up in its beak, clinching it, and flew away.</p><p>The night prior (Sunday night) I had many visions and woke up numerous times experiencing the same flashes of cold and emotions as where gathered in my Awakening in Hell  One such image was that of having the normal fleshy head of a human being, completely healthy looking, though from the neck down was a total skeleton, all bone.</p><p>Another was that of being an infant, seen from the point of view of vertical, yet laying down, as if the horizontal position was turned or floated into the vertical for the visions purpose: in this portrait it showed me with wide opened eyes, from the neck down being completely plastered with waste matter.  The portrait-picture was shown in a frozen, mummy-like pose.</p><p>Ive also had several dreams dealing around the issue of arguing or debating, accusations, etc.  Last night I had many short dreams, with many awakenings from sleep due to intense emotions, etc.  One of the dreams involved my being (in human form) with perhaps two to three lions or tigers and eventually locking or barricading myself in a room; not that they tried to attack me, only, that I sensed some sort of apprehension towards one particular tiger who was walking with me or following me.</p><p>[Two weeks later Id attend my third and final ayahuasca ceremony in Holland before going back to the United States.]</p><p>                  _____________</p>",
 "year": "2008",
 "id": "73580",
 "gender": "Not Specified",
 "timestamp": "2010-07-15T07:00:00.000Z",
 "views": "2323",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.5 oz",
   "administration": "oral",
   "substance": "Ayahuasca",
   "form": "(tea)"
  }
 }
}
