{
 "title": "Magnifying (Tunnel of Dots)",
 "author": "Balloon Cup",
 "citation": " Balloon Cup. \"Magnifying (Tunnel of Dots): experience with 5-MeO-DALT, Methylone & Nitrous Oxide (ID 73649)\". Erowid.org. Sep 18, 2008. erowid.org/exp/73649",
 "substance": "5-MeO-DALT, Methylone & Nitrous Oxide",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "30 mg",
  "oral",
  "5-MeO-DALT",
  "",
  "",
  "50 mg",
  "oral",
  "Methylone",
  "",
  "",
  "10 mg",
  "oral",
  "Pharms - Diazepam",
  "(pill / tablet)",
  "",
  "6 carts.",
  "inhaled",
  "Nitrous Oxide",
  "(gas)"
 ],
 "report": "<p>T+0:00\t30mg 5-MEO-DALT</p><p>T+5:00\t50mg Methylone</p><p>T+6:00\t6 carts N20</p><p>A small group of close friends came to visit for a party weekend, and we decided to try out a new substance.  We also had a copious amount of nitrous as well.  Is there anything that nitrous doesnt go with?  None of us had previous experience with 5-meo-dalt, so Friday night we all tried what was figured to be a light to moderate dose.  I seem to have sensitivity to hallucinogens, so I took one of the smaller doses, about 12mg.  Everyone had similar comments to make.  My experience was mild and I felt in control the whole time.  My recollection is that after about an hour, an effect was clearly noticeable.  The ride seems to have two parts to it.  The first half of the trip had energy, good feelings and few visuals.  There were maybe 90 minutes to 2 hours worth and then a shift to more trippy thoughts, more introspective and more visuals; perhaps 2 more hours before it seemed to fade away.  It was so mild as to be fairly uninteresting.  </p><p>Late on Saturday night, after a little bit of sleep and a few doses of Methylone, two of us polished off the remaining DALT.  I had approximately 30mg and this time, the experience was right on the border of expending mental energy and focus to stay comfortable in the experience.  I suspect that had I not been tired, I would not have had any difficulty.  The trip profile was similar to Fridays trip, extroverted rushy-energy grin on my face morphing into introverted thoughts and mildly trippy visuals.  Toward the end of the trip I was tired and fighting the experience to either fall asleep or wake up.  My body felt somewhat uncomfortable.  I took 10mg Valium to help sleep, but other than making my body feel like it is heavy and sinking down into the floor, it did not help me become unconscious.  With the lights off and laying flat to try to sleep, I had freaky closed eye visuals.   Every few seconds I would imagine something, peoples faces, scenery, random stuff like dreaming, but whatever I saw, would age and decay in just 2 or 3 seconds, followed by a shift to another scene which would decay and so forth.  If I opened my eyes, it would all disappear and the room looked mostly normal, but once I closed my eyes, it would be right back to the always morphing, decaying dreaming-while-awake state.  </p><p>This state lasted maybe two more hours before it let up enough that I was not fighting the experience anymore and I was a little less tired, but it was clear that I wasnt going to be able to go to sleep with the closed eye stimulation.  So I got up and went to hang out with some of the other partiers.  I took 50mg Methylone.  I discovered that a small does of Methylone can get me through uncomfortable parts of an AMT ride, and it seemed to do the same this time.  45 minutes or so later I felt more awake and sociable.  A kind soul had saved a few nitrous chargers, and passed me the bong and I took a nice full lungful.  I leaned back in the chair and closed my eyes, and put my hand over my eyes because the light in the room was still too bright.  I saw some faint blue dots scattered in with the normal dark red blobs and as my eyes adjusted, the blue dots stopped being random, grew in brightness and formed a circle.  Then inside the circle, another circle of dots formed and so on making the appearance of a tunnel.  Next thing I know my perspective starts accelerating down the tunnel and the blues change to yellow and finally, as I think I need to take a breath, turns white.  I open my eyes and exhale.  The room looks normal. </p><p>I take another hit, cover my eyes, relax my mind and defocus my vision.  The dots coalesce again, and form the same tunnel.  I am distracted for a moment and a face pops into my head, but then I concentrate on the trip into the tunnel, and I see the face painted like a texture onto one row of the dots.   The next hit of nitrous and I am open minded and focused on the vision.  It happens faster this time, and I am down the tunnel to the white dots.  I feel like I am moving in the same way watching a plane flying in IMAX makes me feel.  The white dots go on longer than the blue or yellow, but then switch to red the color of blood an then suddenly I am through into inky black space filled with small floating blobs of nearly black violet.  I am still flying forward and my sense of how big the space is around me is telling me I am deep in outer space.  I get a few moments to ponder this change of scenery, and then I am accelerating again into the dark blobs.  Maybe 5 to 10 seconds of this and in the middle of the blobs I am abruptly stopped with a very bright, yellow while hovering presence that roughly resembles the shape of a butterfly.  Until this point, the experience has been emotionally distant and observational, but now I feel overwhelmed with beauty, joy and awe.  I cry from the shear beauty of everything. </p><p>Other than this fantastic movie playing in the holodeck of my visual space, I felt normal.  Time seemed to pass normally.  I was able to hear and understand the other people in the room and communicate my experience as it was happening.</p>",
 "year": "2004",
 "id": "73649",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-18T07:00:00.000Z",
 "views": "10786",
 "dose": {}
}
