{
 "title": "No MAOI Experiment",
 "author": "anonymous",
 "citation": " anonymous. \"No MAOI Experiment: experience with Mimosa tenuiflora (extract) (ID 73670)\". Erowid.org. Feb 4, 2011. erowid.org/exp/73670",
 "substance": "Mimosa tenuiflora (extract)",
 "bodyweight": "240 lb",
 "report": [
  "<p>This report is my effort to shed some light on the topic of rectally administered DMT, and whether or not an MAOI is required. I've read a lot of conflicting reports on the matter, and even more conjecture. I feel that my experience may help others who have had trouble finding information on this matter, and for various reasons are considering rectal administration of DMT without an MAOI.",
  "To begin with, I am a healthy male who has experienced quite a variety of psychedelic drugs throughout the past dozen years. Smoked DMT was my favorite of all of these, but I had only one oral experience with the drug, since I didn't enjoy the prospect of taking MAOI's. For the past year, I haven't used any drug other than very infrequent alcohol consumption.",
  "I decided to try this method one day, hoping to experience DMT without the use of an MAOI and without extracting freebase. I had just received some Mimosa Hostilis Rootbark from a reputable vender, so I can only assume it was relatively fresh. I weighed out 10 grams, which I guessed would contain about 100 mgs of DMT. I figured this would be a safe dose. I combined the powdered rootbark with a few cups of water and two spoonfuls of white vinegar and brought it to a simmer in a pot. After a half hour, I poured this into a coffee filter and let it slowly drip through. An hour later it the water had filtered through, but there was too much liquid so I put this on the stove again and reduced it. Some time later it was reduced to about 50 ml and I was ready.",
  "I took a large needle-less syringe and pulled the extract up into it, and then squirted this into my anus. I laid down on the floor and listened to music and waited for anything. There was slight discomfort from downstairs but nothing major. Within fifteen minutes, I felt a warmth begin to spread over my chest and abdomen. It didnt feel like the body sensations Ive had on DMT before, and it was more akin to a DXM or opiate buzz. I also felt very relaxed and separated from myself, with little mental noise, a real meditative state. These feelings persisted for perhaps a half an hour, then faded.",
  "Over the next few hours, I experienced some visual distortions, including blurred vision when changing focus, persistent after images, color changes and heightened details. However, there were no trails, fractals, or anything remotely similar to the visuals Ive come to associate with DMT. The effects I experienced werent interesting, but they werent subtle either. For this reason I believe there was some activity with this method.",
  "I fell asleep six hours after taking the drug, and awoke an hour later. I looked out my window and I wasnt sure what I was seeing. Their was a large green creature/statue/structure standing in front of a building across the street. I focused on it longer and it morphed into vines. I was very confused since the building didnt have vines covering it, but I was relieved that there wasnt a giant standing there and I went back to sleep. Im not sure what to think about this, since I had just woken up, but the effect was very familiar to tryptamine hallucinations. The next morning I looked out the window and realized I had been looking at a tree.",
  "Overall I would claim that rectal mimosa does indeed prove to be active on some level, its just not what Ive come to expect from DMT. Since the experience was very mild, Ive come to believe some aspects of it were my imagination. One the other hand, some aspects were very pronounced and not what I was expecting, leading me to believe that there was some actual activity. If I were to try this again, Id start at 30 grams of mimosa hostilis. This seems wasteful to me and perhaps its just better to take it with a MAOI.</p>"
 ],
 "year": "2008",
 "id": "73670",
 "gender": "Male",
 "views": "5414",
 "dose": [
  {
   "time": "0",
   "amount": "10 g",
   "administration": "rectal",
   "substance": "Mimosa tenuiflora",
   "form": "(extract)"
  }
 ],
 "submissionDate": "2011-02-04T08:00:00.000Z"
}
