{
 "title": "Anxious Relaxation",
 "author": "Dkid",
 "citation": " Dkid. \"Anxious Relaxation: experience with 2C-C (ID 73698)\". Erowid.org. Jan 10, 2010. erowid.org/exp/73698",
 "substance": "2C-C",
 "bodyweight": "210 lb",
 "report": "<p>Sunday September 7th.</p><p>I weighed out 40mg of 2C-C and ingested it at 22:37 and sat down a read the paper from the morning. Being impatient, I watch the clock for the next hour hoping it would kick in quick than the last time. At 23:18 I weighed out another 10 mg and without and hesitation I snorted it right up my nasal cavity. The BURN was insane and irritating for at least twenty minute or so. As that subsided, I was able to sit back and feel the waves of relaxation take over. At 00:32 Monday the 8th I put in Pitch Black to settle into a fixed area for the night. Waiting for the visual aspect to kick in, I became very lethargic and sleepy. I am not sure when it happened, but I fell asleep within an hour of the movie starting.</p><p>03:18 I arise with this weird sleep-like energy, very restless and still very sleepy. I decided to go get into the bed and cuddle with the wife. This substance seems very erotic at times, but I'm so relaxed that I could go to sleep almost instantly. I still had a body buzz so sleep was difficult as it was 04:23 now. I have decided to massage my wifes back and feet to release some of the energy and it works. Within 20 minutes I am ready for a peaceful slumber.</p><p>07:24 I wake up alert but still very lethargic, the compound is still at work as my body feels as if it had worked through my few hours of sleep. 07:38 I put my daughter onto the bus for school and go back to the bed. I have some more erotic energy so I decide to massage the wife again, as she is still sleeping. 08:00 the wife gets up and showers as I get up and wake my sons up. One of which refuse to go to school, I was empathetic with him and let him stay home. It is 09:35 now and I still have a body buzz, but feel very much drained from the whole experience.</p><p>My overall summary of this substance is not very positive. For the longevity and lack of mental and visual stimulation, I would have to say that I will not pursue this substance any further alone. I had some brief CEV tracers, but they diminished very quickly and did not progress into anything of true structure. Its relaxation, body buzz, and erotic note were nice even though I seemed extremely tired most of the time. At higher doses or combined with another compound, it may be more stimulating due to the visual aspect, but it would not be pleasurable to me to take a higher dose due to the fact that I fell asleep within the first two hours of ingesting it.</p>",
 "year": "2008",
 "id": "73698",
 "gender": "Male",
 "timestamp": "2010-01-10T08:00:00.000Z",
 "views": "4935",
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "2C-C",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:41",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "2C-C",
   "form": "(powder / crystals)"
  }
 ]
}
