{
 "title": "Invisble Me",
 "author": "Amanda",
 "citation": " Amanda. \"Invisble Me: experience with Mushrooms & Cannabis (ID 7370)\". Erowid.org. Feb 27, 2003. erowid.org/exp/7370",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 ",
   "oral",
   "Mushrooms",
   "(dried)",
   " T+ 1:05",
   "2 ",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   " ",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "footer": [
  [
   "2000",
   "7370",
   "Female",
   "",
   "Not Given",
   "Feb 27, 2003",
   "11811",
   " "
  ]
 ],
 "report": "<p>Note: I had this trip in June 2000 late at night. After this I tried searching for people with similiar trips. I haven't found one yet. Maybe this will touch someone who's been there as well.</p><p>I was with my boyfriend, my sister and 3 other close friends. Early in the day we all decided we wanted to eat shrooms and would go out that evening to get some. We also had a few dry ones as well. That night I wasn't feeling all myself so decided I would only eat a couple of dry ones as I didn't want any of the full fledged effects.</p><p>After about 1 1/2 hours of feeling nothing at all I went and ate 2 more small dried ones. I went to my bedroom and talked with my sister. I wasn't sure why it wasn't effecting me. I felt a little cold and happy but that was about it. I was laughing and distinctly remembered saying 'Wouldn't it be funny if I was tripping this whole time and didn't even know it?'</p><p>So I went into the next room to hang out with my boyfriend and my sisters husband and to smoke a little weed. I was feeling fantastic listening to A Perfect Circle. All of the sudden I guess the weed hit me and I got dizzy (of course)... then I thought 'What if I'm tripping and don't even know it??' Then all hell broke loose.</p><p>I started to rock back and forth because I was trying to logically justify where I was in my mind. I started to cry because I was scared, but at the same time didn't want to ruin anyone else's time. Then I just couldn't help it anymore. I just remember 'no, no, this isn't happening.. this can't be happening, I'm not even tripping'.</p><p>Luckily, everyone was there for me and was able to calm me down on the outside although little did they know the hell I was going through in my mind. I thought that I was in some kind of alternate reality and that my whole life was a dream. I was fake, everything around me was fake and I had nothing to hold onto. I could feel myself with this invisible barrier all around me. I could see out, but inside I was screaming. I just wanted to sleep. I knew I was tripping and even though I thought it was real, I think I had just a slight grip that I might be able to sleep it off.</p><p>Of course I couldn't go to sleep for about 3 more hours. But my sister stayed and just brushed my hair and kept touching me so that I could feel I was still alive, which helped a lot.</p><p>1 year later</p><p>Needless to say this has been the most horryfying experience in my life. I don't think I will ever do a psychedelic drug again. BUT, I wouldn't change this experience for the world. I've learned a lot from it, about myself and things around me. I have a brand new outlook on life.</p><p>This has happened to me quite a few times 'sober' now and I've learned to incorporate it into my life not as a fear, but maybe a new vision that most don't get to see. To be able to look at things like I AM not there and things become so much clearer.</p><p>Sometimes it makes me a bit nervous but that's okay because I learn to cotrol MY reactions a bit more. So rather than freak out, I just lay down, close MY eyes and breathe deap. I just know that it's just me now and that it's not a horrible dream.</p>"
}
