{
 "id": 7376,
 "title": "My Love Crutch",
 "date": {
  "submission": "2007-06-21T07:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "Bbandaid",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active as such a small dose, eyeballing is particularly unwise. See related article]",
  "At the point I purchased the 2c-e from the Internet I had done a few other drugs due to the limited supply in my small town. I had smoked weed and done DXM, both of which I had problems with. Paranoia with the pot and insomnia with the DXM. I had stumbled across prescription amphetamines not long before I bought the 2c-e, and like many people I have talked to, my first go with the amphetamines was subliminal. I felt as Rob Zombie would put it 'more human than human.' The speed made everything better. As such I stayed the hell away from it knowing the incredible potential for addiction.",
  "I had always been fascinated with psychedelics, but the only one I was able to get a hold of before the 2c-e was morning glory seeds. They were interesting but nothing visual.",
  "I went into the 2C-E with little respect for the power of the chemical. As far as I could tell it was the closest thing I could get to a 'real psychedelic.'",
  "The first time I tried the 2c-e I did it orally, but the only thing I noticed was were some tracers and the fact, which I was a bit antsy. So much so that the person I was with noticed it even though she didn't know me very well.",
  "For god knows what reason, for the sake of simplicity we will call it carelessness I decided to insufflate it along with two friends.",
  "I have had six friends try it and what we all agree on about snorting 2C-E is that the peak is intense fast and unpleasant. The 2C-E would come take affect and we would lose touch with reality for 15-30 minutes. The visuals and nausea were so intense that we would usually spend it over the toilet trying to figure out what was going on.",
  "I believe this was because we were eyeballing lines of the stuff I would imagine our doses were too high and the part of the trip we were enjoying was the come down.",
  "I later began using 2c-e in a binge manner at the same doses and this peak was the only part I noticed, after that it just felt as if the drug was done with its course.",
  "After the peak the drug would mellow out. For me this meant a sort of bending of everything visually that made everything look like it was being viewed while underwater. Colors would shift around as I looked at them and art was phenomenal to look at. On the first fun insufflated me and my other two friends just walked around the town having amazing conversations. The drug seems to increase one's insight.",
  "For me the method through which I gain insight on the drug is a sort of detachment from my emotions. When I get high on it makes me not feel my emotions but note them and analyze them.",
  "Another affect of the drug was a sort of stimulation during the peak, the drug made me feel a little better about everything, and a little more energetic.",
  "This stimulation combined with my ex-girlfriend leaving me caused me to start using the 2C-E everyday in a binge fashion.",
  "I started by doing a line before school, then I became curious as to whether one could smoke it. So I tried by putting a small amount in a spoon and capturing the smoke with a bic pen tube.",
  "The first thing I realized about smoking 2C-E was that it increased the nausea significantly. While the smoke didn't bug me, I would always notice an extremely strong nausea as soon as I was through smoking it.",
  "I began doing this every day then doing lines between my high school classes. Thats a line every 50 minutes, and by about 30 minutes I would notice the drug starting to wear off.",
  "While in normal use of this drug the main feature is its enhancement of everyday things like art and conversation, under binge use I was using it as a stimulant/anti-depressant. When I got high on it, it was like being ok emotionally. It would temporarily lift my depression through the detachment from my emotions, and give me the energy to function through its stimulant property.",
  "The drug also made me unbelievably tired when I came down so that I was either high or sleeping due to the down.",
  "I eventually had the sense to beg a friend from out of town to take the drug from me, she enjoyed it very much for the reasons I enjoyed it at first, without ever going through what I did.",
  "I didn't notice any withdrawals besides sleeping too much for a day or two after it was gone."
 ],
 "erowid": {
  "id": "45762",
  "citation": " Bbandaid. \"My Love Crutch: experience with 2C-E (ID 45762)\". Erowid.org. Jun 21, 2007. erowid.org/exp/45762",
  "substance": "2C-E",
  "views": "13669"
 }
}
