{
 "title": "Like an Airhead Candy",
 "author": "J",
 "citation": " J. \"Like an Airhead Candy: experience with LSD (ID 7379)\". Erowid.org. Apr 24, 2003. erowid.org/exp/7379",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  "DOSE: T+ 0:00",
  "1 hit",
  "oral",
  "LSD",
  " T+ 3:30",
  "1 hit",
  "oral",
  "LSD"
 ],
 "report": "<p>I had been wanting to take acid for a LONG time and I finally got my chance. It was sort of a last minute thing....</p><p>One of my friends got a hold of 2 hits of acid and he sold them to me. I went to work with my two hits at about 3... and at 7 I ate one of them not expecting to take the other one. I felt a bit light headed right after i took it... not sure if it was because i was nervous about the idea of it being my first time, or if it was from the actual drug. Well i got out of work at 9 and i still wasnt tripping, so i called my friend 'E' and i went back to her house.</p><p>At about 10:30 i took the second hit, figuring i might not even trip at all. Around that time i had been starting to see the walls sort of breath in and out, not very STRONG.... not enough to say i was really 'tripping'. We went into the kitchen and ate some food. I started staring at the table, and it started to sort of wave. The more i stared at it, the more it would wave. It made the same type of motions as the ocean would. I looked down at my hand... and the tips of my fingers kind of waved out like each of them were made of candle wax... bending up and down like they were slowly melting into long streams of color. I was facinated with it... i must have been staring at my fingers for a good ten minutes. Then we got up and walked into her room. Suddenly the walls and the floor and the celling looked like the table did, except waving much more. This time the waves pushed in deeper, and pushed up higher.</p><p>It was about maybe... 1 AM. I layed down with a blanket. Each wrinkle of the blanket rippled out like water. It was crazy. We lit a candle, and it kept pulsing in and out, as if it was actually breathing. Everything looked so real. I left to go to the bathroom. I got in there, and stared at the counter where the sink was. It slowly just sank from the middle all the way to the floor. With a blink of an eye it went back to normal. I flushed the bathroom toliet and freaked out. The sound was so loud it scared the fuck out of me. For some reason i kept having to go to the bathroom after that. I made E go with me and stand out side the door. When i was finished i'd open the door, and then flush the toilet. It sounds funny right now as i read that over, but really it was a scary thing. For a few hours we were up just talking about everyday shit. We started talking about reality bullshit. From there i came up with an interesting theory about reality. I decided... there was no such thing as reality... but only the one you are given.</p><p>'Pick a color, E'</p><p>'Blue'</p><p>'What if the you're seeing isnt the same blue that i'm seeing? Blue is a cold color. We both know that. What is a cold color? How do you describe it exactly? Words dont mean anything, they're all made up. You cant really describe what you are seeing to me with words, because they arent descriptive compared to what we see. Everyone who uses communication based on words is ignorant. You cant tell what something IS using words because everybody interpets them differently.'</p><p>That thought depressed me for a little bit, but i eventually got over it. I tried to figure out a different way to communicate without using words. I thought it would be a great way to express communicate. I did think of some different ways... but now that i think of them they didnt really make sense at all. E got a little bored of the topics i was talking about. Of course, i knew... eventually E got tired and wanted to sleep. She blew out the candle and i freaked out.</p><p>That was the point where it started getting bad. I felt so alone. All she wanted to do was go to bed, and for some reason i didnt understand why she would want to do that to me. I kept thinking she wanted to ignore me and just go to bed. I sat there in the dark crying for about a half hour. Her wall is covered in prints of paintings. I looked at a portrait of some guy and it felt like he was just staring at me. His eyes kept blinking real fast. The other picture i looked at was a picture of the ocean with clouds above and thunder bolts coming from them. As i stared at it, the coulds started to move and the rain drops sprinkled down on the ocean. It was crazy, but i was afraid of it. The water motions were still very intense. I just wanted them to stop. I looked into a full legnth mirrior of myself. All of the features on my face kind of melted together. The mirrior would wave back and forth. I admit that was pretty fucking cool, but still... scared the shit outa me. I layed down and tried to fall asleep, but whenever i opened my eyes the trees outside the window looked like big giant black ants. Not really ants, but... creatures... i can best describe them looking like ants. The would blink at me, and just stare at me. That was probably the most terrifying thing that i could think of. I smoked a cigarette. The cigarette looked like it was melting into my head... kind of forming over my two fingers. It reminded me of when you tear an airhead candy apart and it sorta draaagggsss down to your fingers. Thats how the cigarette looked. Evetually i was out of cigarettes, E was still asleep, and i got a little bored of the hallucinations. I tried to sleep. It was hard. I closed my eyes and i saw these red lights springing around my eyelid. They looked much like the hallucinations you would recieve from robotripping (DXM). At some point though, i did fall asleep.</p><p>I woke up at about 10 am. I saw the hallucinations that i saw in the very beginning of my trip... the mellow breathing in-and-out on the walls, floor, and celling. I was mentally okay, but i felt as if the night before never took place. I felt like i dreamt it all. It wasnt an exactly bad feeling... it just made me feel really weird. I went to work at 12. I smoked a butt on my cigarette break and the hallucinations came back... full blast. I was afraid they would last a while... but they only lasted about 2 or three minutes.</p><p>It may sound really corny, but ever since ive tripped... that one stupid time... i have felt different about lots of things. Things that mattered to me before dont matter anymore. I look at life differently. I feel its a positive outlook, maybe it isnt... but i like what it has done to me.</p><p>Over all i'm glad i had the chance to trip... and i would most definatly do it again. If i had to do it over again, i wouldnt do it at night. Tripping at night can be fun as long as the person you are with doesnt fall asleep on you.</p>",
 "year": "2001",
 "id": "7379",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-04-24T07:00:00.000Z",
 "views": "8817",
 "dose": {}
}
