{
 "title": "So Clear, So Simple",
 "author": "rizla303",
 "citation": " rizla303. \"So Clear, So Simple: experience with Hashish (ID 741)\". Erowid.org. Oct 17, 2000. erowid.org/exp/741",
 "substance": "Hashish",
 "bodyweight": "70 kg",
 "report": "<p>The mindset was serious ecstasy depression since 3 months back with serious thoughts on taking my life or/and some of my friend's lives. Added to that in synergy was an LSD psychosis/neurosis from a bad trip 3 weeks prior to the ecstasy (they were mitsubishi turbo, I hate mitsu, they are a waste of money and 'E time,' mitsu do NOT seem like mdma).</p><p>I have smoked hash since I was 15, multiple-a-day-user since I was 16 until I was 18 (Im 19). Apart from just having fun, I have always considered my drug intake as a search for something that would heal me up. I want to tell you about the time when I got a breakthrough.</p><p>The setting was a park, alone. I lit up and got high, walking away towards the city, still feeling fine (the last 6 months I always got psychotic on hash, feeling really bad), then all those thoughts came flying, I started working on them in a sort-of-metaprogramming way, but I was so fucked up, slipping into a psychotic reality, a bit disoriented, with nasty, threatening auditory hallucinations (I don't know if they really were hallucinations, but I think so. Wherever I went people were shouting at me, like, 'There he is again!', they were completely real for me at the time. This is whats characteristic for a psychotic state, not being able to differentiate between a hallucination as 'not really there, Im the only one seeing it' and a hallucination that you think of as reality). Well, long story short, I managed to get home, having to take three, four different transits to get there instead of taking the bus which takes me direct to my house (doh!). When I got home I managed to unlock the door after staring at the lock for 15 minutes trying to figure out what to do with it (minor LSD flashback, it would have been fun if it was fun, you know what I mean).</p><p>When I get inside I position myself spontaneously into a medative position, knees to chest, hands on head, elbows on knees, thinking how to solve all my problems. Sitting there I notic this sensation on my head. I feel it as some sort of entity, god or something. He makes clear to me that he wants to take my head over to, heal it. I think, what the fuck have I to loose?', so I take my hands away from my head, indicating that I accept. The  sensation gets stronger and I can feel the entity investigating different parts of my brain subconsciously, then it talks to the concious part of me. He asks me what powers I want, to be able to deal with the problem. I tell him I don't know; he tells me that I do know. I search for the answer; CONFIDENCE, I tell him. OK, he says.</p><p>Suddenly I can feel this red light (red light is the color of raw energy in the human aura, I later discovered, maybe a connection) all around my head, filling up the room, and he gives me the power of confidence. He gives it to me by beaming energy right into my subconcious and I'm filled with confidence. When he leaves me, he tells me it will be OK. He also shows me some valuable insights, clearing up the situation.</p><p>I put on a record, feeling real up, the solution is so clear, and so simple, so simple. I start to cry out of joy and tension. I found peace, at last.</p><p>This is the most powerful emotional experience of my life. It's really personal, I haven't told it to any of my close friends. It felt as if I was touched by god, but I'm leaning towards that it was not god (I'm an atheist), but that, through the cannabis, I got a powerful channel to my subconcious, communicating with it and trying together to solve the problem between us. But, Im not sure.</p><p>I have now taken a more respectful attitude towards cannabis, smoking it for more meditative purposes.</p>",
 "year": "2000",
 "id": "741",
 "gender": "Not Specified",
 "timestamp": "2000-10-17T07:00:00.000Z",
 "views": "9197",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis - Hash"
  }
 }
}
