{
 "title": "P. Harmala Tweak",
 "author": "Seadolan",
 "citation": " Seadolan. \"P. Harmala Tweak: experience with P. harmala (Syrian Rue) (ID 7415)\". Erowid.org. Jun 13, 2001. erowid.org/exp/7415",
 "substance": "P. harmala (Syrian Rue)",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "1.5 Tbsp",
  "oral",
  "Syrian Rue",
  "(tea)"
 ],
 "report": "<p>I had a rather unpleasent experience this weekend with P. harmala, and would like to get a little feedback before continuing my investigations w/ this substance.</p><p>I ground up 6 tablespoons of p. harmala and extracted 3 times by boiling w/ 1/3 lemon juice over the course of one hour (as recommended by Ott in Analogues... Does anyone think the 8 hours simmering (per DeKorne) is neccesary? From my experience I don't.) Filtered through a coffee filter and T-shirt.</p><p>I was extracting towards a potential future experiment w/ P. viridis (another question... does this need to be simmered for 8 hours at a time, or will a quick 3x boil and strain work? + dosage suggestions would be helpful also).  I thought I would try a little of the tea for psychoactivity (since I wasn't sure whether my short extraction would work).</p><p>I ingested a little less than 1/4 of my resulting tea, equivelent to 1 1/2 tablespoons ground rue (you see my mistake already, hmm?) What I thought was @ 3 grams.  I *will* buy a scale before I try this again.  I was expecting maybe slightly noticeable effects, and was actually planning to go out for dinner.</p><p>Within 30 minutes I started to feel somewhat sleepy/somewhat trippy.  At 45 I was disoriented and feeling a little nausea.  My heartbeat started to accelerate rapidly, and I worried that I might be having a slight hypertensive crisis.  I had drunk a fukola cola (w/ ephedra) the day before.  I thought with the small amount I was ingesting, it wouldn't be a big deal.</p><p>At 1 hour I told my girlfriend that I felt sick and didn't think I could handle going out to dinner. That handled, everyone else left and I lay down on my bed.  Felt strong 'presence'.  Steady noises sounded phased or warbled.  Heart-rate was worrying.  Began to feel strong sensations of moving backwards, drifting, faint visuals under my eyelids.  At this point I knew I would vomit (didn't really feel sick, just knew it) and ran unsteadily down the hall to the bathroom. Where I spent the next 2-3 hours heaving water every 15 minutes, which I would then replenish, and lie on the floor and trip until it was time to heave again.</p><p>I was very sedated and somewhat disoriented. I was having dream-visions (like intense day-dreams), these visions would go for a while then begin to get really intense/confused and... yuck.  Quite often I had the experience of looking at the wall in the bathroom (and seeing it quite clearly) and realizing I was in fact curled up face down with my eyes closed and my head in my hands.  Fairly dissociative, I often lost track of my body (except when it was time to vomit).  I also several times had very clear still images of being outside looking up a the stars.  I had the impression that, where I not constantly being drawn back into nausea, I could have gone out-of-body fairly easily.</p><p>After an 3 hours, (and it peaked towards the end of this period) I finally felt like I was not going to be sick anymore, and went to sleep, to very intense and strange dreams.</p><p>So... I know several things I did wrong (tablespoons are definately not teaspoons, I think I actually ingested closer to 9 grams worth of tea), I should have prepared better with diet (though I had the, perhaps misguided, impression that a 3 gram dose would be barely noticeable). Would my overdose explain the heavy emetic and cardiovascular reaction? Would this be the case even on a proper 3 gram dose? (all I could think during the whole experience, was 'and I'm going to throw a 2 hour dmt trip on top of this? shit').  Or was it more likely an MAO interaction or perhaps even an allergic reaction? How the hell are people taking huge doses of this stuff without getting sick?</p><p>I'm going to make sure I can properly handle rue alone before combining with anything else.</p><p>PS. This experience put me very much in the camp of harmala not merely being a potentiator of other plants, but a powerful spirit/ally in its own right.</p>",
 "year": "1996",
 "id": "7415",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-06-13T07:00:00.000Z",
 "views": "48091",
 "dose": {}
}
