{
 "id": 7416,
 "title": "Making Blotter",
 "date": {
  "submission": "2007-10-08T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SalviaJay",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "",
   "substance": "Salvia divinorum",
   "form": "extract - 6x"
  }
 ],
 "report": [
  "I found out about the Salvia Blotter method just yesterday, and figured that since I had some Isopropyl alcohol and 2g of 6x Salvia, I might as well try the method.",
  "The method required 5g of regular crushed Salvia. I substitued that with 2g of the 6x Salvia I had to see if I could get a stronger effect. I wasn't sure about the solubility of Salivorin A, so I doubled the solvent to 200ml just in case. I waited for about 10 hours as instructed. The other thing I changed about the directions is that I strained the mixture through the tea stainer before I added the water. This is because I figured if I formed the precipitate and then put it through the strainer, the pile of spent Salvia leaves at the bottom would soak back up the Salivorin A as it was going through. Anyways, pretty much everything I did afterward was the same as the directions, added twice water (since I doubled the solvent), filtered it through a coffee filter, and dried the filter in an oven.",
  "So, I cut about 1/5 of the filter, and stuck it under my tongue after gargling Listerine. In about 15 minutes, I start feeling a pleasant stoned feeling. Listening to music was more pleasurable, and I was taking everything in stride. I don't know how this experience compares with the quid method, as I always have smoked it before. But I can testify that this method actually does work. The only drawback is that the filtering process took a long time. I think it took a total of 4 hours of preperation, not counting the 10 hour soaking time. Maybe doubling the solvent wasn't a needed procedure, I'm not sure. If it still does work with the original 100ml of solvent, then that would probably cut the time by an hour or so."
 ],
 "erowid": {
  "id": "45926",
  "citation": " SalviaJay. \"Making Blotter: experience with Salvia divinorum (blotter) (ID 45926)\". Erowid.org. Oct 8, 2007. erowid.org/exp/45926",
  "substance": "Salvia divinorum (blotter)",
  "views": "14749"
 }
}
