{
 "title": "On The Precipice of Addiction",
 "author": "Cracker1234",
 "citation": " Cracker1234. \"On The Precipice of Addiction: experience with Crack (ID 74175)\". Erowid.org. Dec 23, 2008. erowid.org/exp/74175",
 "substance": "Crack",
 "bodyweight": "200 lb",
 "report": [
  "<p>This is the tale of the night, well actually 2 days, when I realized I had a crack problem and needed to quit.",
  "It still feels bizarre to say that I have a crack problem. How the hell did I get to this place? Im a white professional 20 something. I started doing coke when I graduated college and fell in love with it quickly. Than one Saturday night about 2 months ago I was doing what I usually do, sitting at home blowing through an 8-ball. I was already in a grips of a healthy coke habit. None of my usual party buds was around and I was horny as hell (Im gay as it happens) so I went online to find a dude who was partying and wanted to fool around. I found a guy, went to his place and started chopping up my lines when he whipped out a burned looking glass stem and a bag of rock.",
  "I should have ran, but I was already high and my curiosity was piqued. Besides I was getting a bit bored with sniffing coke and figured why not, something new. I screwed up the first few hits and didnt get much. Finally he lit one for me.WOW. What a high. I was into it immediately. It's tough to describeas close to a full body rush as Ive ever felt. I took a long blast and held it in, as much as my lungs could absorb. I didnt feel it instantly, but as I blew the smoke out the crack hit. I tingled all over, my heart raced, waves of energy and euphoria rushed through my body. I lay back on his bed and couldnt move for a minute or two. It was unreal. It wasnt speedy the way coke is, I didnt get the urge to run around the block like when I sniff coke. I just felt totally energized and somehow relaxed in a weird way. And after about 5 minutes I really, really wanted more.",
  "Crack, I soon discovered had one big difference for me from coke. When I would binge on coke I would always reach a point where it just didnt do anything for me. After 6, 7, 8 hours of partying, each new line just didnt get me high and I would really feel like shit and stop. Crack was different. Each hit got me high. Only as the night goes on the high last for less and less time each hit. But each hit holds the promise of a new high. Thats what makes it so addicting. That and somehow after smoking rock I feel better the next day than when I sniff coke. No crap in my nose, no congestion, I dont feel great, but not a shitty as after a coke binge.",
  "So I left this dudes apartment with a number for his hook up. Soon I was smoking crack every weekend. I didnt stop using powder, but every time I blew a rail my mind would instantly leap to my pipe and want a hit. I quickly started to smoke rock on weeknights, something I never did with coke because of the morning after effects. But I could smoke a gram on a Tuesday night, be on the top of the world for a few hours and go to work the next day without looking like I had the flu!!! Awesome, right?",
  "So 2 weekends ago I scored an 8-ball Friday night as usual. Scored some crack in the middle of the night. Stopped partying around 6AM Saturday. Met up with my best party buddy around 4 on Saturday and started skiing again. Finished around 1 Sunday morning. Woke up on Sunday feeling like total shit and thinking man oh man have I got to quit doing this crap. But I had 3 twenty bags left over. I couldnt resist so I swore up and down These are the last hits for a while and I railed one of them and freebased the other. I pledged that was the last coke I would do for at least two weeks (can you imagine two weeks being a lofty goal?? HA!). I got high at about 3:30PM. Around 4 I get an email from a buddyhe was smoking some seriously good crack and wanted company. Shit. Fuck. Put on my jacket. Paced around my apartment. Should I go? Looked at my pipe. Had one more hit in there plus some powder left. Railed a line. Took a hit. I was screwed. Pretty high, craving more, excited, energetic, feeling dangerous. I have to stop but I cant fucking resist. Promised myself Ill go there, have a few hits and be home by 10 at the LATEST. Out the door I go.",
  "I get home at midnight. Stoned out of my mind. We smoked I dont even know how much. We ordered more. I bought 3 rocks (baggies) for myself. Took a giant hit when I left and I run into my apartment to start hitting my rocks. Fuck. Where did my night go? So Im at home in the wee hours of a Monday morning glued to my coffee table hitting my pipe. I quickly finished off one rock (in about 20 mins) and start in on the second. Finished that in an hour. It's almost 2AM and I realize Im going to be out soon. FUCK. I call my dealer, no answer. I keep on smoking. Im getting paranoid, I keep looking at the clockso lategotta workbut just one more hit, just one morefuck. I realize I can't stop. I load up the last of my rocks for a big ass hit a little after 3. I hit it and feel amazing. But Im out. I panic for about 15 minutes, try unsuccessfully to jerk off. I sit on my couch depressed, wired, coming down. Unable to sleep, unable to jack off, wracked by quilt, craving more but vowing to myself that this is the last time.",
  "About 3:30, maybe 3:45Im crashing hardtrying to get to a place where Im ok to sleepto my gigantic astonishment my cell phone rings. MY DEALER!!! Instantaneously my heart racesmy palms sweet, my mouth dries up like the Saharado I answer? Do I score more?",
  "The decision takes about 3 seconds. Hey man. You got any? Yeah I can go to your place. Be there in 15. FUCK. Im disappointed, guilty, excited all at once. I rush into the bedroom, throw on a sweatshirt, throw on my big hooded coat (it was fucking freezing out)heart racing I scrape the remainder off my mirror into a little lineinhalecheck my pipescrape & pushI hit itfuck yeah! To my surprise a pretty good hit. I run out the door, zip up my coatman it was freezing. My heart pounding, palms sweating, my mind going a mile a minute, chain smoking, out of my head with a slight high and crazy anticipation and wild cravings. Im a middle class white 20-something walking through the ghetto at 4 in the morning looking disheveled and out of place in a thuged-out parkaparanoia creeps inman I look suspicious!!!",
  "I get to the dudes place, go upstairs, he looks pissedmaybe hes high too? Probably. I can't tell and dont really care. I buy two rocks, ask if I can do a hit there. He has a seedy, nasty apartment but I dont think twice. I sit on his couch, break half a rock and load up my pipe. My hands are shaking, he is staring at me. I hit itgiant hitI lean back deep into the couchstill inhaling until I can't take any more in and I let it out slowly. With each breath escaping I feel higher and higher,and something I never felt beforeoverwhelming relief. I got my fix. Im fuckin flying. Leaning back on my dudes couch, sinking into the fur lining of my hood, feeling warm and electric.",
  "I manage to get back up and load the rest of the rock into my pipe without even thinking. My dealer goes Oh man thought you was doing only one hitI gotta sleep I say Just one more than Im gone. No sooner do the words escape than I realize I only have 1 rock left. I reach into my pocket and get some cash. I buy another rockI take my hitIm fucking FLYINGIm shaking, energy and euphoria are washing over me in wavesmy dude looks at me and says Man you got a serious problem. I just ignore him, thank him and leave. I think to myself I got at least 5 or more good hits left in my pipe so I walk down instead of taking the elevator. I stop halfway and have a blast. On the first floor I stop. I need a blast before the torturous walk homeparanoia againI could get caughtbut I want itfuck. I flatten myself against the walllook around over and over and hit the pipe. Big hit. Nice. I walk out into the ice cold night. Chain smoking, high as a freaking kite, I start heading home.",
  "Walking home, in about 10 minutes, maybe 15, Im feinding again. Gotta get home and hit. Gotta get that next big fuckin hit. I instinctively walk a block out of my way to a quieter, more industrial street. Nobody around, can I take a hit here? Fear and excitement and paranoia wash over me and mix with the crack high. There is a deep-ish, unlit doorwayI duck into itpressed against the wall. Im fucking terrified. I could totally get caught but I want it bad, bad, bad. I zip my coat all the way up, my hood is huge and it's inside out and when I look over my shoulder I can't see past it. I feel like Im going crazy. I think I should just go but I reach in my pocket for a cigarette and feel the pipeFUCKwaves of cravingsI pull it out and hit ithit it againthan I hit it one more time. And I turn to go. I did it!!! No cops. Im a fuckin bad ass and higher than Ive ever been. Its amazing. Its thrilling. Im strangely freezing as I light a cigarette, tug the fur of my hood around my ears and think to myself This is perfect.",
  "It's absurdly early on a Monday morning, Im smoking insane amounts of crack and feeling amazing, nobody is out, Ive got the city to myself and Im untouchableI cant get caughtIm on top of the world. This is what Ive always looked for, this is how I want to live the rest of my life, I think to myself man, Im totally hookedIm a total crackheadhow did I get this way? Thinking Im addicted makes me aroused somehowIm living totally dangerously and all I want to do is get home and have my next hit.",
  "I get homedont even bother to take my coat offI break up the second rock and start hitting big, giant hits. 2, 3, 4, 5, 6 hitsIt's after 5 now and Im feeling super paranoid and starting to feel sick. This has never happened before. My eyesight is blurry, I cant talk, can't think straight, heart poundingIm terrified that Ive ODed. I try to think how much Ive done but I can't rememberit only makes me feel sicker. I get a bucket from the kitchen and dry heave for 30 mins. Than I pass out.",
  "I wake up in a few hoursfuck! I have to go to work!! What did I do??? Im in my living room, still wearing my jacket!!! Almost instinctively I reach for another hit. Still got a rock left. I feel awesome again. I manage to shower, have another hit, go to work, get home and finish off the rock. I manage to make it to bed at 1 on Tuesday morning. I called in sick on Tuesday. I must have slept 13 or 14 hours. I have no idea how much I smoked, or if I really did OD. Sure as hell felt like it. It was a crazy experience. I felt terrible for the rest of the week. Ive vowed to never smoke crack again.",
  "That was two weekends agoI havent smoked crack since. I did 1 gram of coke last weekend but that was it. It's Sunday night and Ive been clean of any coke whatsoever this weekend for the first time in 3 months. But Im craving it really, really badIm horny and turned on writing this and thinking about it. Im going to do some shots, jerk off and go to bed. Hopefully Ill get through the next month clean.</p>"
 ],
 "year": "2007",
 "id": "74175",
 "gender": "Male",
 "views": "75559",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(freebase)"
  }
 ],
 "submissionDate": "2008-12-23T08:00:00.000Z"
}
