{
 "id": 7418,
 "title": "Soul Departure",
 "date": {
  "submission": "2001-12-28T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "nEUROSIS",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "dried"
  }
 ],
 "report": [
  "Well, where do I start..I recieved 1 gram of Salvia Divinorum from Oaxaca, Mexico. I had been anticipating this day for quite some time, and I was in for an experience I will never forget. I called two of my friends over to try this out with me and they agreed and came over as soon as possible. I explained to them that this was a sacred herb used by the Mazatec Indians and should be treated with great respect. They agreed.",
  "I put on a CD by a band called Tribes Of Neurot to help set the mood, which it did and we began to smoke Salvia. My friend was the first to inhale. I told him to make sure he held the smoke in for 30 seconds and he did. Next it was me, I took a hit standing up and held it in for as long as I could and exhaled. My other friend repeated the step, and we kept smoking. I felt nothing but mild effects that marijuana produces and my friends did too. I was disappointed, because I had expected much more, but that was yet to come. So, time passed and my friends left and that left me all alone.",
  "About 2 hours later I decided to smoke the rest of the gram, but this time sitting down in a comfortable position. I packed a bowl and began to smoke. After holding the smoke in for quite some time, I started to feel the effects, and these effects were MUCH different than what I had experienced earlier in the day. I felt as if my soul had left me and I forgot who I was, that followed by an overwhelming feeling of fear and terror. I put my bong down, and was unable to think positively. After moments of this overwhelming fear, I started thinking why I was feeling this way, and I came to the conclusion that the Gods were punishing me for taking Salvia in vain. I sat in the lotus position, bowed my head and closed my eyes, and began saying a prayer to the Gods to forgive me for forgetting that Salvia was a sacred herb and not to be taken in in vain. After repeating my prayer over and over I opened my eyes, feeling 'normal' once again. The experience was nothing like I had experienced before! I mean, LSD isn't as intense as this is! At least with LSD I know who I am and don't feel an overwhelming feeling of terror. I hope to try Salvia again in the near future, but before I take that jouney again, I have to remind myself that it is a sacred herb and it should be smoked for the effects of marijuana that I had felt previously in the day time..."
 ],
 "erowid": {
  "id": "4593",
  "citation": " nEUROSIS. \"Soul Departure: experience with Salvia divinorum (ID 4593)\". Erowid.org. Dec 28, 2001. erowid.org/exp/4593",
  "substance": "Salvia divinorum",
  "views": "6135"
 }
}
