{
 "title": "Life Long Side Effects",
 "author": "Big D",
 "citation": " Big D. \"Life Long Side Effects: experience with 2C-I (ID 74199)\". Erowid.org. Feb 16, 2010. erowid.org/exp/74199",
 "substance": "2C-I",
 "bodyweight": "145 lb",
 "report": "<p>My experience with 2C-I can be easily described as the worst time of my life.  It was 2005 and I was a junior in high school. I loved drugs(anything I could get my hands on) and was a daily pot smoker and recreational drug user.  I was searching one night for ecstasy when my hookup told me he couldnt get his hands on any, but he had something else that was very similar.  I then made the dumbest decision of my life actually agreeing to buy some and try it. </p><p>He said it was called 2C-I and a chemist friend of his had just made a batch and he wanted to see if people liked it.  I snorted it in his care, off of a cd case, and then proceeded to get into my brothers car and drive to a friends house.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>About 10 minutes later it all started to happen.  First the snorting of the powder made my brain feel like it was stuck in a oven.  My whole face burnt and I started getting nauseous.  Right about that time I began to feel these unbelievable rushes of adrenaline going through me.  I had never felt this feeling before, despite having taken tons of uppers downers and all arounders in my life.  My body didnt even feel like it was my body.  It basically mind fucked me. </p><p>Total confusion and panic were the next things that I experienced.  I was so high, that I couldnt think or comprehend anything.  After my brother and friend realized that I was tripping balls they then tried to talk me into going home. I dont remember what I said, and honestly cant really remember the thoughts going through my head because I was in a state of all out confusion. </p><p>The high felt very synthetic and dirty, unlike what I've experienced with mushrooms and marijuana.  Geometric shapes were very vivid and colors of things were constantly changing, as if my whole field of view was a light show.   I tried laying down and going to sleep but I couldnt stop moving or pacing back and forth in my room.  They tried to get me to smoke a bowl and help me calm down.  I went through about a dub in one sitting AND DIDNT FEEL ONE THING. </p><p>At that time I also started to forget things, things I should never forget. I couldnt tell you who I was, or what I was.  My name was a mystery and everything was a  mystery.  Hell Am I even real?  I spent what seemed like an hour pondering the very idea of existence.  The trip lasted about 4 hours and I spent about 2 hours of it sitting on my bedroom floor naked having a panic attack and speaking jibberish nonsense to myself. </p><p>Before this day I had never had a panic attack in my life.  After this experience I have not had a single week where I didnt get anxiety.  Ever since that day, I have never been the same.  Even the slightest stressful thing to happen can send me into a full out panic attack.  2C-I ruined my life and I would not wish this feeling on anyone. </p><p>Sorry for not being very descriptive, this trip happened years ago and I try my hardest everyday to forget what happened and move on with my life.</p>",
 "year": "2005",
 "id": "74199",
 "gender": "Male",
 "timestamp": "2010-02-16T08:00:00.000Z",
 "views": "9485",
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ]
}
