{
 "title": "Extraordinary, But Not Again",
 "author": "Scarmani",
 "citation": " Scarmani. \"Extraordinary, But Not Again: experience with 2C-T-7 (ID 7425)\". Erowid.org. Jan 5, 2002. erowid.org/exp/7425",
 "substance": "2C-T-7",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "17.5 mg",
   "insufflated",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Four days after my first experience with 2C-T-7, I decided to give it another go.  The setting was my appartment at about 5pm with a close friend, who had decided to try 20 mg orally; and my roommate who was going to hang out with us and make sure nothing bad happened.</p><p>My mindset was very positive, with a strong rememberence of my first, gentle and positive experience.  After this unqualified success with an 8mg total dose, I felt I wanted to explore the stronger side of the compound.  I had not seen any hints of threat in my first experience, nor read the warnings on the internet about insufflation as the route or doses above 5-8mg with this route.</p><p>After weighing out the 17.5mg dose, I felt a surge of adrenalin.  Was this really wise?  I wondered.  I decided I was 'ready.'  I insufflated the powder, half in each nostril, and this time the sting was definately in evidence.  Some of the powder felt like it had gotten into my sinuses, and there was a warm throbbing vise-like pain/sting combined with a foul tasting drip.  I sat down to wait and in about 90 seconds I felt something rising, very, very fast.  I went into the bathroom to check out my face--it was red and swollen.  I'd had no idea I looked like that--the pain wasn't that bad, was it?  I looked like I'd just been smacked.  My eyes were teary. </p><p>Suddenly my thoughts started becoming very, very trippy and the silences between breaths seemed to be utter and eternal.  I had to vomit--no discomfort, just an imperative.  I leaned over the toilet and vomit gushed from my mouth and nose.  It smelled like woodsmoke.(?)  I stared into the water, retching, aware of the energy vibrating around me, fractal swirls in the water to the point where I couldn't tell that there was vomit there... the silence from the other room was experienced acutely and over very long times.  'Holy... shit...' I heard myself saying, thoughts twining in between the words, which I was later told were said at a normal speed.  I wondered what my roomate and friend in the other room were thinking. </p><p>It took me about five minutes (their time, not mine!) in the bathroom to get a sense of footing.  I was in awe.  Physically I did not feel bad, despite very strong waves of nausea, but I was filled with energy tremor and everything seemed to take so long...  The visuals were everywhere, the walls were throbbing in sync with my sinuses.  Nothing seemed quite real.  Finally I told my two companions that I was ready.  'That's why I won't snort the shit,' my friend told me, and by this point I could smile.  Despite a sense of uncertainty pervading everything (evaluation hanging in the balance, subjective experience being overridingly signifigant) I began to feel admiration and joy that 'this was it, I did it, i am there'  I went down the vibrating stairs, again feeling unreal, and out into the cold air. </p><p>As it had last time, the outdoors quickly turned all uncertainty into exhilaration and the nausea vanished.  As I walked, still somewhat overwhelmed at the power of the effects, all I could insist on was that the experience was 'incredible.'  I kept desperately searching for words to describe what I was feeling to my friends, but ended up inanely repeating the same superlatives over and over.  My expression had changed to one of abstracted fascination, of incredulousness.  Eventually I came up with 'a thousand approaches to every moment,' which was probably the best that could be done--it definitely seemed true.  I was experiencing each step stuttered a thousand times with an evolving vinework of thought as my foot reached the ground, and again, and again... </p><p>I felt like I was smeared out over some kind of sensory matrix/grid, that all the trancendant emotions ever experienced by human beings were washing over me in unbearable waves.  Longing, homecoming, agony, ecstasy, the somber blue tones of midnight and the terror of the vault of heaven, spinning crazily in an infinite universe.  It was truly religious.  Our walk was short.  We returned to my appartment and I lay on the floor, travelling and acheing with beauty.</p><p>By the eight hour, after experiencing the obligatory lifetime, I was back into the flowing mode.  I walked my friend to the train station, feeling cleansed, wonderful.  I don't know how long it took me to get to sleep, but spent the whole time thinking over the extraordinary event that had taken place, still stunned, with pride at having visited places so far out and gratitude for the complexity and depth of human sense and emotion.  I felt fine the next day, aside from a slight residual irritation of the nose.</p><p>Soon afterwards I read the warnings about insufflated doses and decided that I would no longer use this route.  Upon reflection, I realized that the discomfort of the sting and bad taste would probably increasingly dominate my thoughts--not to mention the health risks.  The fact that I vomited through my nose was unsettling--I suspected that with a dose slightly higher than the one I took might have been a disaster, or even potentially fatal.</p><p>Still, although my first two extraordinary experiences with 2C-T-7 were through insufflation, I remain truly happy with these two decisions.  I feel 2C-T-7 has been important to my emotional health and personal growth.</p>",
 "year": "2000",
 "id": "7425",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-05T08:00:00.000Z",
 "views": "8302",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "17.5 mg",
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  }
 ]
}
