{
 "id": 7425,
 "title": "This Thing Is a Secret",
 "date": {
  "submission": "2005-10-20T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zoop",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "14 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(daily)"
  }
 ],
 "report": [
  "A little background... I am 34 years old and have had some pretty bad problems with drug addiction in the past.  I started with smoking marijuana when I was around 13 or 14, and it rapidly progressed to alcohol, then prescription opiates, then cocaine, then lsd, then 'shrooms, a bit of ecstasy, then prescription amphetamines, then IV heroin, IV amphetamines, IV anything I could shoot.  The last time I did any hard stuff was in September of 2000, though.  I went to rehab (for the second time) at that time, and have stayed totally alcohol free, and free of all those 'bad' substances, including pot, too, for (right now) almost five years.  My life has improved immensely. Now, I am married, have a young son, a good job (with the Federal Government - imagine that!) and friends who are not junkies and freaks like I used to associate with.  I have an active spiritual life too as a result of getting involved with Alcoholics Anonymous. Anyone who has an alcohol or drug problem should definitely check out this wonderful fellowship.  The only requirement for membership is a desire to stop drinking/using.",
  "What I want to tell people about is my experience for the last nine months. Right at the beginning of this year (2005), I started to experiment with Kratom. I thought it was a very mild way to relax in the evening, and since it's not 'drugs' (or so I thought at the time), it would be o.k. for me to use.  I was wrong about that.",
  "In January 2005, I ordered some on a whim from an online vendor and tried it mixed with some chamomile tea. About twenty minutes passed, and I was thinking, 'this shit isn't shit.' Then it kicked in. Wow. Just like a good hit of hydrocodone, or oxycodone, propoxyphene or plain codeine. Definite opiate effect. I became very interested in this plant right away. I kinda wish I hadn't done that.",
  "Since Jan. '05, for better or worse, I have been constantly every day taking Kratom, and my dosage regimen has increased and stabilized at around half an ounce a day (about 14g), spread out in 4 or 5 doses, in tea.  I have tried all kinds of ways of mixing up this vile stuff so it's palatable, and I must say that the absolute best way to take it  is to mix the powder with some sort of instant 'chai' tea beverage mix.  I can hardly taste the Kratom mixed with some chai. ",
  "Well, anyway, I am hooked on Kratom. Sometimes, when I screw up and forget to place my order in time, I have to go a day without it.  This has happened four times this year. It is very unpleasant and is just like when I experienced withdrawals from a heavy hydrocodone/ambien habit back in 2000 right before I went to rehab.",
  "The withdrawal symptoms begin about 12 hours after the last dose and consist mainly of a runny nose, fatigue, yawning, watering eyes, anxiety, irritability, and generally feeling like crap.  I am totally worthless in this state. I actually called in sick from work when this happened once. One of the other times I went in to work while in full-blown withdrawal, but was pretty much not doing anything until I went down to the shipping office to pick up my overnight express delivery of Kratom.  Then I was better.",
  "That being said, I must say that Kratom is a pretty good substance. I does what I want it to do.  Makes me feel real nice. Maybe I'm just one of those people who needs 'a little help' to get through the day (if you're one too, you know it).  I still attend 3 or 4 AA meetings a week because I don't want to drink. My alcohol problem was pretty bad. If I pick up the first drink, nobody knows (including me) what is going to happen, but it is probably going to be bad.  Naturally, I don't go around blabbing to my AA associates about how I am using this plant every day. They are some of the best people I have ever met and cherish their friendship.  We have a saying in AA, 'your secrets keep you sick.' This Kratom thing is a secret.",
  "My wife doesn't know about my Kratom habit. Nobody knows really, except the people I order it from every ten days or so. I think I am their best customer. Thankfully, I have a job that pays well enough to cover the Kratom bill without attracting too much attention. I do feel guilty about spending family money on this stupid stuff, but I guess not guilty enough to actually stop doing it!  Man, I don't know, maybe I'll quit some time, but for now, things are maintaining.  It's better than shooting heroin or oxycontin or any stuff like that...",
  "Just though I'd let ya'll know about what this plant can do. It's no joke.  I mean, coffee is addictive too, right? and that causes physical withdrawal symptoms (headache), but not quite as bad as kratom withdrawals. ",
  "Peas."
 ],
 "erowid": {
  "id": "45954",
  "citation": " Zoop. \"This Thing Is a Secret: experience with Kratom (ID 45954)\". Erowid.org. Oct 20, 2005. erowid.org/exp/45954",
  "substance": "Kratom",
  "views": "34232"
 }
}
