{
 "title": "Poor Luck with Newer Atypical Antipsychotic",
 "author": "far2farside8",
 "citation": " far2farside8. \"Poor Luck with Newer Atypical Antipsychotic: experience with Apripiprazole (Abilify) & Quetiapine (Seroquel) (ID 74305)\". Erowid.org. Jun 15, 2009. erowid.org/exp/74305",
 "substance": "Apripiprazole (Abilify) & Quetiapine (Seroquel)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Pharms - Quetiapine",
   "(daily)",
   "",
   " ",
   "oral",
   "Pharms - Aripiprazole",
   "(daily)"
  ]
 ],
 "report": "<p>Moving away from a harsh drug like Seroquel, Abilify sounded like a sure bet. It was weight neutral, less chance of developing TD and it was new. I ate the stuff right up along with my Seroquel and waited for the hypomania to kick in. In the first week of March 2008 I moved out of my apartment, drove around feeling great and impressed my girlfriend's family for the first time in months. I knew what was happening. I knew that I was experiencing drug-induced hypomania, but I rode it out. I knew it wouldn't last for long.</p><p>The idea here was to switch over from Seroquel to Abilify [5mg-20mg]. After a couple of weeks on Abilify we started back off the Seroquel with horrible results. I was taking 300mgs of Seroquel at night, which we dropped back to 250mg. The result were uncomfortable feelings of mania. I wouldn't be able to sit in a classroom, all of my senses were Lit and anything that passed was an agonizing distraction. We went back to the 300mgs of Seroquel and decided to up the Abilify as well. We continued this trend into the early summer, until I was tired literally of the time. I slept fourteen hours a day and lost my relationship with my girlfriend due to my psychological distance.</p><p>My doctor and I decided to quit the Abilify and run solo with the Seroquel. I felt a lot better being off the Abilify. The results were noticeable immediately. I had more energy, I felt more involved, I had a passion for literature again. All of this lasted about a week and half, until the nasty manic dragons returned. I ended up spending the rest of my summer on differing doses of Zyprexa.</p><p>Some people swear by Abilify but I seem to be in the minority that does not. Any of these drugs (the atypical antipsychotics) are worth a shot. There are about six of them and they are all very different. Shop around, if you're lucky you might find something that you can tolerate.</p>",
 "year": "2008",
 "id": "74305",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-06-15T07:00:00.000Z",
 "views": "10048",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "(daily)"
  }
 ]
}
