{
 "id": 7436,
 "title": "Effect on Humans",
 "date": {
  "submission": "2007-12-09T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Julian",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "After researching Mgs, I decided to study the effect they have on humans. After trying them several times, the following are my conclusions.",
  "Before doing Morning glory seeds, I researched them quite thoroughly. I purchased the Mgs at a local greenhouse, I bought the Heavenly Blue type. They cost about five bucks for over a thousand seeds. they are very cheap.",
  "My Background:",
  "I have been smoking marajuana daily for about a year and a half, I use cocaine and alcohol frequently. I have tripped on mushrooms and cough syrup several times each. I also have done meth and speed.",
  "Procedure:",
  "I washed 300 seeds in a tuppaware full of soapy water. after washing I let them dry by a fan. I used bottled water. I chew about fifty seeds until they were a paste, and then wash them down with bottled water. They did not taste bad at all, I liked them in fact, and this method was extremely easy.",
  "Trip:",
  "I smoked a bowl of cronic marajuana immediately after swallowing the 300 seeds. I smoked the weed to prevent Mg nausea. Many reports speak of nausea at the beginning of the trip. After smoking, I experienced mild nausea, nothing I couldn't handle though. I have a history of having panic attacks with drugs, but most people do not, so they will not react the same, but I did experienced a panic attack at this time.",
  "I layed in my bed for only 15 minutes and I began to feel extremely high, I knew I was tripping. I felt nervouse, but then very euphoric. As I layed there, the walls began to breathe and the trim and such was melting. I could see shapes and colors when I closed my eyes and I felt very happy and comfortable.",
  "As I layed there, I began to feel strange, I closed my eyes and it felt good, then, my brain told me that if I moved or opened my eyes, I would die. so for about 60 minutes I layed in the fetal position motionless. when I found the courage to open my eyes, everything was surreal. The walls and anything I looked at wavered all around. I saw little white dots blinking in everything. I began to think that maybe this is how the world actually looks, but I can't see the true world unless my eyes are opened by hallucinations. My mind spun and I thought in circles.",
  "When I first attempted to walk, it felt as if my body was floating and my legs were streamers in the wind, I could not feel them. at times I felt as though I was watching myself from above, like my soul had risen from my body and it was watching me. As reported before by others, my joints hurt, when I walked my knees hurt real bad, this made me panic, even though I knew it was safe. I fell down a couple of times from blacking out only briefly, so I decided that I should stay in bed for now.",
  "I noticed that I had developed diarreah, another common side-effect of mgs. I listened to music and it was amazing, the sound took on shapes and faces in my head, I imagined every sound buzzing around in a sphere in my head. I listened to Pink Floyd's meddle.",
  "I had no sexual appetite at all, the mgs took away any sign of horniness in my body. I had millions of auditory and visual hallcinations, I kept on thinking I heard the cops outside my window or my parents coming up the stairs. I saw people walking down the street when I had a smoke but then they would dissapear all the sudden. I kept seeing weird animals outside. I also was easily startled. I heard high pitched noises all night long, but later I realized it was crickets. When I looked in the mirror, my pupils were dialated, they were huge, usually I cannot see anything with my lights off, pitch black, but because my eyes were so dialated, I saw everything clearly with the lights off.",
  "At about 3 or 4 I sat in my bed and stared at my alarm clock, I was entranced with deep thoughts about relationships and problems, everything seemed peaceful and serene, my problems were small. when I awoke from my trance, it was around 6 in the morning, I was still sitting in the same position and still staring at my alarm clock. I finally went to bed, I cannot recall what happened between 3 and 6, but I believe I may have been thinking the whole time. the trip lasted till twelve the next day, but I felt nausea the whole morning until it ended, I also was very tired and I felt depressed.",
  "Setting:",
  "I suggest that when tripping, the lights are dark. I always trip in a calm safe place, that way I can stay relaxed and will not have a bad trip. Unfamiliar places make me panicy. I usually have some dull christmas lights on, I cannot stand bright lights when on mgs. I also have a fan that blows cold air on me, it keeps me relaxed also. I have water, cigarettes, weed, medications I take and anything else I need next to my bed where I lay and trip."
 ],
 "erowid": {
  "id": "45994",
  "citation": " Julian. \"Effect on Humans: experience with Morning Glory & Cannabis (ID 45994)\". Erowid.org. Dec 9, 2007. erowid.org/exp/45994",
  "substance": "Morning Glory & Cannabis",
  "views": "2934"
 }
}
