{
 "id": 7437,
 "title": "An Experience I Won't Soon Forget",
 "date": {
  "submission": "2008-03-03T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "A Universe To Come",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "0:10",
   "amount": {
    "number": "3.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "extract"
  },
  {
   "time": "0:15",
   "amount": {
    "number": "1.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms"
  },
  {
   "time": "0:20",
   "amount": {
    "number": "10",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "tea"
  },
  {
   "time": "1:05",
   "amount": {
    "number": "2",
    "unit": "bowls"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "Setting:",
  "I was at my friend F's house with other friends D and S. It is in a rural neighborhood with many trees around.",
  "F, D, and S are all experienced with acid, shrooms, ecstacy, and other psychedelics. I assume they will be great company on my trip.",
  "I have been wanting to make Ayahuasca for a long time, since I'd been reading up for several months. I finally ordered some syrian rue seeds and jurema root bark, and when F's parents went out of town for the night it was finally time.",
  "I hadn't intended on taking the LSD, and it was also my first time with it. I also had only taken shrooms once before this (2.5g). I had tried other psychedelics, but not to this extent. This was esentially my first real psychedelic experience.",
  "I followed dietary precautions for a day before the trip, and I didn't eat anything the day of.",
  "Story:",
  "I was at C's house with F and D. They were drinking a few beers, and around 10:00 we headed over to F's. It was completely black outside because of the new moon. We headed through a forest trail which none of us could see our path, but F had a cell phone, so that helped a bit. Eventually we got to F's house, where we were suprised to see S's blazer. We went inside and F yelled at S for coming here without F being around. (F and S get into bitchy quarrels like this alot, especially when consuming alcohol.)",
  "I got to making my syrian rue and mimosa extracts very promptly, as it was already after 10. I ground up 21g syrian rue in a coffee grinder and put 2L distilled bottled water in a pot with about 600mL lemon juice and 500mg acorbic acid (vitamin c). I did the same with 10g jurema.",
  "After an hour of boiling I strained them with a t-shirt, kept the very discolored water, and put roughly the same amounts of water, lemon juice, and vitamin c in the pots and reboiled each.",
  "The syrian rue water was very yellow-brown and glowed VERY strongly in a blacklight. I allowed S to drink a spoonful and his mouth glowed very brightly as well. They were amazed it did this (though I'd explained before that it would). The jurema water was an earthy dark red color.",
  "After boiling these each 2 more times (not as long as the first), the water seemed to be not as colorful each time. Eventually the rootbark looked colorless and I threw the used up bark and seed away. I boiled the Jurema extract down to 250mL and the syrian rue extract down to almost nothing. Then I poured the now very syrupy rue extract into a glass container and put it in the oven at 300 degrees (F) until it was very thick. I scraped this up and rolled 2 small balls of it (I'm assuming about 3-4g total).",
  "It was now 12:15 and D suggested that I eat my mushrooms. He also suggested that I take this low-dose acid that he had at home (he lives a few houses away from F).",
  "T- 0:10: Acid paper is put on tongue to dissolve.",
  "T+ 0:00: Ingested the 2 balls of syrian rue extract.",
  "T+ 0:05: Ingested the 1.5g shrooms over a period of about 5 minutes.",
  "T+ 0:20: Started sipping from 50mL cup of jurema juice.",
  "T+ 0:45: Feeling a bit weird, I think it's probably the effects of the rue.",
  "T+ 0:50: S and F get into another quarrel, and I tell them they definitely should not start that right now, and that we should smoke some weed and chill.",
  "T+ 0:55: 2 bowls are smoked.",
  "T+ 1:10: I am starting to see spiral patterns everywhere in my vision. I ask S what he thinks about it. He tells me it's probably the acid doing it's work on me.",
  "I begin to lose my concept of time after that point, so I'll explain the best I can (although it may not be in order).",
  "S and I decide to go outside. I look at the stars and am greatly amazed at what I see. The sky is full of motion! There are gigantic red and blue and orange balls flying around everywhere!! There are shooting stars and everything! I was astounded at how all this looked. There was one star in particular that looked amazing to me. It was bright red/orange and HUGE! Actually, now that I think back to Astronomy class, that must've been Mars I was looking at.",
  "As we walked around the block I saw a house I remembered from my childhood. My best friend from elementary and middle school used to live in that house. After that I started vividly remembering things about my childhood, and this kid. It was amazing how I could remember things I hadn't thought about for several years.",
  "When we returned to F's house we went down to F's room and visited him and D. We listened to some music and chilled for awhile. I was enjoying the spiraly visuals still, and my hands were glowing in the blacklight from the rue. It was pretty neat.",
  "Eventually I got tired of that and went upstairs to lay down on the couch. I realized I was cold, so I went to get a blanket. S was watching a show on Animal Planet about elephants. He thought it was very interesting, but I constantly wanted to turn it off because it was far too intense. Eventually he let me shut it off, and he started to fall asleep.",
  "This is where my trip went bad. I became very dehydrated so I drank several cups of water. I tried falling asleep, but I would become very uncomforable. At some points I started to feel like I was going to die. It was very uncomforable, and at this point I just wanted it to end. I kept telling myself it was only the drugs and that it eventually would wear off. However, I couldn't get it out of my head that I would be stuck like this forever. I thought I was going insane for a while.",
  "Then I was very concerned about my parents finding out about it. I don't know how they would, but at that point it didn't matter.. They would find out. This worried me greatly for a long time.",
  "Eventually I needed to pee really bad because of all the water. I got up and did this several times, each time filling up my then empty cup of water.",
  "Finally around 5 I started to feel a little back to normal, but I knew I couldn't sleep so I turned the TV on. Around 6 I was back to reality for sure, but I could not fall asleep. I watched TV for what must have been about 4 hours, when finally S woke up and talked to me. We cleaned up our mess in the house, and at 10:30, he brought me home.",
  "We played Resident Evil for a few hours and I was definitely back to normal. I wasn't even tired, although I knew I should be since I didn't sleep at all.",
  "I ended up not falling asleep until 12:30 that night, which means I'd been up for 38 hours. What a day.",
  "Looking back, I believe I underestimated the rue's effect on acid, and I think that part was a bad idea. On the other hand, it was an experience I wont soon forget, both good and bad of it."
 ],
 "erowid": {
  "id": "45998",
  "citation": " A Universe To Come. \"An Experience I Won't Soon Forget: experience with LSD, Syrian Rue, Mimosa Hostillis & Mushrooms (ID 45998)\". Erowid.org. Mar 3, 2008. erowid.org/exp/45998",
  "substance": "LSD, Syrian Rue, Mimosa Hostillis & Mushrooms",
  "views": "14506"
 }
}
