{
 "title": "Weird Lacerations in the Neuro-Tapestry",
 "author": "Grinsburg",
 "citation": " Grinsburg. \"Weird Lacerations in the Neuro-Tapestry: experience with Mushrooms (ID 74386)\". Erowid.org. Aug 23, 2009. erowid.org/exp/74386",
 "substance": "Mushrooms",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  "2 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>Note:  The accuracy of the chronology and content of the events in this experience report is tenuous.  The trip occurred several weeks ago and I doubt that I could have accurately described it even the day after.</p><p>ANYWAY:</p><p>Some weeks ago, I had my first mushroom trip.  Id been very anxious to try these mystical fungiform for some time.  Ever since junior year of high school, Id been itching to look into the unexplored spaces in my brain and see what Id been missing.  Id done the prerequisite reading (The Doors of Perception, The Electric Kool Aid Acid Test), listened to a lot of Terrence McKenna lectures, seen Fear and Loathing a few times, and smoked a lot of plant matter of dubious legality.  I was now a freshman in college and I knew a guy who had some shroomage.  Awesome.  I felt ready.</p><p>It was very satisfying to finally have a quarter ounce of little brown stems and caps in my pocket as I got back on campus.  The plan was to trip with my girlfriend and two other friends.  Four trippers sounded like an ideal number and we had enough fungal shit to go around.  It was a long weekend, so I wasnt worried about homework or responsibility.  It was raining that day, and I had spent the afternoon in a major city purchasing a hookah.  I was feeling pretty good and was very excited.</p><p>However, things dont always go as planned.  My girlfriend has contracted some bronchial infection (which she passed on to me - I was a bit stuffy throughout the entire experience) which was exacerbated by her smoking.  She was not in good spirits:  cranky, upset, sick.  Not good shrooming conditions.  She forfeited her share.  Another friend also decided that he wouldnt be tripping with us that evening.  He felt that a generic college party was more interesting than ego dissolution and neoshamanism and all that stuff.  This was mostly just frustrating because we were going to use his room to trip in.  Despite his copping out, the situation was salvageable: he still lent us his room for the night.</p><p>So as it was, at perhaps 10pm that night, we were down two trippers, it was raining, and I was stressed.  Probably not the best tripping conditions.  I still wanted to trip that night and so did my buddy, so we wandered around his floor, looking desperately for people to take mushrooms with us.</p><p>We were afraid of frightening people with our requests:</p><p>Here are 2 grams of highly psychoactive fungal matter!  Would you like to join us in the regression to a state of dumb animalism?</p><p>Im calling the cops and locking my doors!</p><p>Damn.</p><p>. . .</p><p>But yeah, we found a guy who was willing to trip with us.  At 10:30 that evening we took the shrooms.  I took two grams, staggering the dosage over the evening.  I took the majority within the first hour and ingested a stem maybe four hours after T +0.  I found the taste to be very pleasant; nutty and earthy.  I usually detest mushrooms.  I remember wondering if psilocibin mushrooms had ever been used as an ingredient in fine cuisine.</p><p>We were listening to Shpongle and watching the visualizer on my friends laptop.  About 20 minutes in, I started to feel weird.  The visualizer suddenly assumed new dimensions and a feeling of impairment began to creep over me.  I started to panic slightly, because the feeling somewhat resembled the onset of a powerful ripped-to-your-tits cannabis experience.  My fears were unfounded.  Instead of disappearing into a vortex of fractalized visual distortions, I just began to feel slightly, subtly weirder.</p><p>In this case, weird is the only word that is capable of describing the sensation.  Everything became unfamiliar.  It wasnt the sort of discovering everything for the first time unfamiliarity that cannabis usually has.  It was a what the fuck is this and why is this here sort of unfamiliarity.  Not scary, just weird.  It was like a sixth sense (or third eye?  hmm...) revealed itself:  A sort of weird-factor.  Vision because shroom-vision:  Every object appeared to be physically congruent to its sober-world counterpart, but the shroom-proxy was more stylized and idealized.  Everything looked like it could be a piece of art.  Everything that I saw was reaesthetisized.  Weird.</p><p>Theories of meaning usually state that when a symbol is meaningful, it possesses intentionality, or the quality of being about something else.  In this way, all of our symbols (words, pictograms, lewd drawings, photographs), are meaningful insofar as they are connected in some abstract, metaphysical way to objects in our environment.  During my mushroom experience, I felt these connections dissolve.  Rather than experiencing little flashes of quickly-forgotten insight (as I usually do while on cannabis), I was unable to establish a connection between the physical world and the symbolic system within my brain.  It seemed that I was experiencing things in their rawest state, rather than experiencing them with all sorts of second-hand symbolic information attached.  To restate, the shrooms trimmed the bullshit.  If I were to look at a guitar, I wouldnt think of how the guitar affected me in daily life, or my personal attachment to the guitar.  Instead, Id think of all of the base, archetypal things that the guitar represented.  I might think things like lyre of muse or song of humans or something like that.  It was like cultural regression.  It was interesting.</p><p>Anyways, as to what I was actually doing:</p><p>By the time that the trip had begun, the random guy that we were tripping with had disappeared somewhere, and I was completely unable to make sense of what was going on.  Just trying to do anything was a challenge.  Decisions were the worst:</p><p>Hey, man, Im hungry.</p><p>Okay, that's cool.. Im really tripping</p><p>No, seriously, do you want to get food?</p><p>Um, okay</p><p>Okay</p><p>... there would be silence as the room breathed in time with our dumbfounded cortices.</p><p>Um, do you want to go outside?</p><p>Its raining out.</p><p>Well we have to go outside to get food</p><p>I guess</p><p>Want to see whats up in my room?</p><p>Sure</p><p>We eventually resolved to wander around, and had several awkward social encounters with sober people.  We collected some food from my friends room and ate some jalepeno poppers as the trip intensified.  Eating while shrooming is barely advisable.  The trip sure intensified the experience, but it opened all of the bizarre neural paths of gustation and it very much felt like my mouth was eating itself.  The whole thing was alien.</p><p>Throughout the trip, my thought patterns were screwed and chopped.  I am a person very interested in cognitive science, and I am usually very aware of the conscious machinations of my mind.  While tripping, I was incapable of integrating my thoughts with the world and the world with my thoughts:  I experienced my surroundings, found truth in those surroundings, but could not verbalize these truths.  The closest that I could come to describing the truths revealed by my experience is the explanation of my inability to explain those thoughts.  This was most frustrating part of the experience.  I must note, however, that even if I were to remember my truths, they would be irrelevant to anyone who has not used psychedelics.  They would also be only barely applicable to other psychedelic users.  Its vain to think that the burble produced by the introduction of a whacked-out psilocibin invader into my neuro-cognitive soup could ever be meaningful someone with a different neuro-cognitive soup.  That is to say, I dont think that it is wise to generalize an inherently subjective experience.</p><p>At the peak of the trip (at maybe 2:30 am.. time had lost all meaning and relevance), we set out to walk in the rain.  We originally thought that it would be unpleasant, but it turned out that it was the most enjoyable part of the evening.  As we walked up an incline, the rain flowed down in little rivulets and it was very poetic.  Every tree looked like the perfect image of a tree; halos of light appeared in the water vapor around streetlights.  Somehow my body felt separate from the dampness and coldness of the evening.  I didnt feel my wet jeans; I felt only the weird-factor of my environment.  Its a very subjective thing, very difficult to exegete. </p><p>When my friend returned to the tripping room, I kept wandering like a dumb animal, staring at tree and puddles.  I felt very connected to my childhood.  I felt a sense of nostalgia; I could imagine (naively, maybe) the simple beauty of childhood.  At this point, a cop car drove past me.  I wasnt entirely coherent, but the prospect of making conversation with an authority figure with a head full of chemicals didnt hold much appeal.  My nostalgia dissolved and I practically ran into my building.</p><p>Having experienced that scare, and listened to sober people gabbering about meaningless stuff, (I actually heard someone talking about Dungeons and Dragons.  Crazy while tripping!) I continued wandering around the campus, experiencing things in shroom-vision.  I encountered my girlfriend a few times, but she was sick and her presence was oppressive.  I did experience some very interesting visuals while in her room:  while looking at the carpet, symmetrical death-metal logos appeared in the patterning.  I think that the logo depicted a word that started with H:  Halloween, Haunting, Human.</p><p>For the most part, being indoors was oppressive.  Throughout the trip, I had certain goals.  If these goals were fulfilled, I felt calm.  Otherwise, there was a feeling of anxiety and wrongness.  These goals included:  going outside, getting food, changing clothes, seeing the sunrise (I never accomplished this), and avoiding cops.</p><p>Its interesting that all of these primal goals seemed very important to me while tripping, whereas social and academic goals take precedence when sober.  I see this as  evidence (if hugely subjective and incomplete) of the social deprogramming that occurs during the psychedelic experience.  I suddenly found no interest in empty (or at least they seemed that way) societal objectives.  Upward mobility, wealth, social standing: all that tripe seemed secondary to gathering food, finding shelter, not being killed, and other things that primeval man cared about.</p><p>Ive since regained my will to complete my education and get a decent job and such.  I chosen not to integrate that little awakening into my daily life.  Perhaps it was something that was already present in me, and also present in all of us.  It was maybe just buried too far under the semiotic bullshit to be accessed from the surface of the mental rubbish heap.</p><p>Once I got tired of waiting for the sunrise (at around 5 am), I went to my room, undressed, and passed out.</p><p>Aftereffects:</p><p>I usually get hit by aftereffects of drugs pretty badly.  Cannabis usually makes me dumb for a few days, and I get persistent HPPD from clinical administrations of dextromethorphan and diphenhydramine.  At the time of my shrooming, I had flushed all cannabinoids from my system and I was experiencing transient HPPD from a prior salvia experience.  Everything was functioning normally, more or less.  After the trip ended, my HPPD was worse than ever:  everything maintained the shroomed out aesthetic (everything seemed sharp and artistic) and afterimages were (and continue to be, two weeks after ingestion) very dramatic.</p><p>In addition to visual disturbances, my cognitive abilities were shot.  Thoughts that usually came easily were labored.  Thinking in high levels of abstraction became almost impossible.  Whenever I tried to think exhaustively about something, I experienced a twinge of cranial pain.  My short term memory is still somewhat impaired, although I appear to be making a slow recovery.</p><p>In summary, the mushroom experience offered some very interesting insights into philosophical questions that had been bugging me (motivation, meaning, societal programming), although the experience cant be considered philosophically useful if it always fries my cognitive circuits.  I may not repeat this experience in the near future.</p>",
 "year": "2008",
 "id": "74386",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-08-23T07:00:00.000Z",
 "views": "2547",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
