{
 "title": "Opiate Dreams",
 "author": "Mr Dizzle",
 "citation": " Mr Dizzle. \"Opiate Dreams: experience with Dihydrocodeine (ID 74388)\". Erowid.org. Nov 11, 2011. erowid.org/exp/74388",
 "substance": "Dihydrocodeine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "180 mg",
   "oral",
   "Pharms - Dihydrocodeine",
   "(pill / tablet)",
   "",
   "60 mg",
   "oral",
   "Pharms - Dihydrocodeine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Background: I am sixteen, British and live in Southern England. I have frequently smoked cannabis since I was fourteen and have also occasionally done coke. I had come into contact with DHC a few months ago, due to my Dad taking it for back pains. I have had one binge (6 pills) previous to this experience and had been eagerly awaiting my next one. When the opportunity came, I was happy to grab it...</p><p>Story: It started around 7 PM when I took four pills; I relaxed and smoked for a while and soon began to feel the first relaxing wave of warmth and comfort. It was this that I had been anticipating and it gave me great pleasure to be sinking back into that blissful state.</p><p>I chilled out for about an hour, listening to music. Then, as I began to feel a little less docile I decided to be a little more active. I began by doing some exercises; press-ups, crunches and sit-ups. I then went outside and kicked a ball around for a while. The adrenaline and out-of-breath feeling was much more enjoyable than usual. When I went back inside, the chilled buzz of the DHC peak hit me; I slumped in front of the computer and listened to some music.</p><p>I was interrupted by my Mum who had brought back Chinese food for myself and my Dad. I enjoyed their company but I was conscious of how frequently I was having to scratch my face and I wasn't able to eat very much.</p><p>I went back onto the computer and watched Zeitgeist Addendum (on my previous DHC session I had watched the original Zeitgeist so it felt right to watch the sequel now); the documentary's chilled-out atmosphere and interesting view on society was both fun and relaxing to watch and I felt like the information was entering my head better. By the end of it, I could barely stay awake (the time was now about 10:30) so I went to bed. I didn't sleep as such but I snoozed for about an hour until I heard the sound of my sister getting back from a birthday party she had been to. I went downstairs to talk to her for a while and had a cup of tea. Conversation was very enjoyable; I went outside with my Dad for a smoke. The night sky looked very big and very beautiful; I couldn't stop looking at it. Dad was talking about his job but I wasn't really listening, just zoning out looking at the sky.</p><p>I went back to my room and did two more pills and was soon back in bed. The heaviest peak yet hit me as I lay half-asleep. I found myself slipping quickly between dream and consciousness; there was nothing worrying about this and I found I could pretty much control it. However, I was very spaced out and didn't want to move. At this point I got some CEVs; patterns and coloured clouds swirled very quickly and attractively and soon began to merge with the confused dreams I was falling in and out of.</p><p>After what seemed like many hours of something close to meditation, I fell asleep. I awoke this morning with a slight headache and rather aching body. However, a shower and some exercises woke me up and I felt rather good. Since then I have done four more pills with many left to go; I'm looking forward to some more opiate dreams.</p>",
 "year": "2008",
 "id": "74388",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-11-11T08:00:00.000Z",
 "views": "5342",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "180 mg",
   "administration": "oral",
   "substance": "Pharms - Dihydrocodeine",
   "form": "(pill / tablet)"
  }
 ]
}
