{
 "id": 7439,
 "title": "Overwhelmed",
 "date": {
  "submission": "2008-09-18T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bloke",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "At a squat party, well, more of a club without a proper licence, in central london, and a friend of a friend gave me a capsule containing an unspecified ammount of 2ce. No effects for  ages, at a guess about one and a half hours. Not knowing hardly any people at the party and having only recently moved to the London may have contributed to my feelings of detachment from everyone else at the party.",
  "I eventualy got chatting to a mate's sister and her friends but never felt completely comfortable. Decided to leave the party about two hours later. Having thought I was coming down I caught a bus. I was only just coming up! My mind raced and was accutely aware of the city around me outside the bus. The financial and political power of the city seemed strong but also fragile, one nutter with a bomb, one tidal wave, one virus could bring it all crashing down. What had taken hundreds, if not thousands of years to form could die out in a matter of days. This could be applied to any city in any country of the world.",
  "I alighted to change at Leicster Square and the lights of the huge neon coca-cola and TDK ads seemed brighter than the sun. A huge sickly monument to consumerism. Managed to find my bus and took a seat upstairs near the front. Rowdy Jamaicans on the back seats yelling to eachother, scary stories of stabbings, gangsters and guns. NOT what you want to hear whilst tripping your socks off alone in an unfamiliar city, me bieng the only other person on the bus. So I concentrate on outside. This bus route goes right through the financial heart of london then right past the ancient tower of London then through Westminster and past the houses of Parliament, it was like bieng on a surreal tourist bus but at four in the morning on a sunday.",
  "I realised how artificial and unnatural the city is, how much we, humans, have altered the surface of our planet. What was once forest, heathland, marsh and mountain is now concrete, steel, tarmac and glass. The city is a well oiled machine, each driver, cleaner, guard and office worker are cogs. But how much longer before the house of cards falls to the ground, we are living on borrowed time and virtual wealth. Streets and streets of banks and not a single shop selling bread. We can not eat money!",
  "Well, I finaly made it home at about five and into the arms of my lovely girlfriend. I was almost in tears, scared and shocked by what I had been feeling - it was that profound! And I was still tripping hard. Lay on the bed, couldn't sleep and could feel all the organs in my body working away, especialy worying was the sensation of my heart muscle contracting and relaxing. The white walls of the room became a pulsating rainbow in the most vivid halucinations I have ever experienced. Finaly managed to sleep by about ten.",
  "Extremly profound and interesting. But NEVER again!"
 ],
 "erowid": {
  "id": "46004",
  "citation": " Bloke. \"Overwhelmed: experience with 2C-E (ID 46004)\". Erowid.org. Sep 18, 2008. erowid.org/exp/46004",
  "substance": "2C-E",
  "views": "3273"
 }
}
