{
 "title": "The Control Panel of the Universe",
 "author": "Lethargy",
 "citation": " Lethargy. \"The Control Panel of the Universe: experience with DMT, Hydrocodone & Cannabis (ID 74478)\". Erowid.org. Nov 16, 2013. erowid.org/exp/74478",
 "substance": "DMT, Hydrocodone & Cannabis",
 "bodyweight": "117 lb",
 "report": "<p>Mindset: Spiritual, Calm</p><p>Setting: In a dimly lit room, somewhat small with a very comfortable bed which would be used in turns for the dmt.</p><p>Preparation: I meditated approximately 30 minutes beforehand to clear my thoughts and prepare my mind for the trip that awaited me, I also set up a very comfortable spot to lay down, which I highly recommend doing, being uncomfortable can make trip somewhat less enjoyable.</p><p>The Experience:</p><p>I have had little experience with entheogenic hallucinogens, I've done lsa a few times, and DMT once before. About a week ago my dealer, who I will call Mav-cake for identity purposes, ordered some DMT and tried to smoke it, but to no avail, so he decided to share it with me and my friend who I will call Daytona and see if we could get anything out of it, we smoked 100 mg that night, and we all experienced a true dmt trip and quickly agreed to it again in a few days.</p><p>Yesterday was the day we decided on, and I wanted to try DMT mixed with something, so I bought a couple of pain pills early that morning, took them around 8:00 am, I had eaten nothing prior to this, and I ate nothing for the rest of the day. I got the general opiate numb euphoria, which lasted all night.</p><p>We arrived at my friends house (BGs house) at about 8:30pm, to trip at his house since we left our meth bong there. We do not smoke meth, but we needed that bong for the dmt. Mav-cake pulled out the tiny 100mg packet of dmt labelled D-100. After weighing out some weed we decided to go ahead and smoke the dmt, I opted to go second so I could have some time to meditate before I smoked. Mav-cake loaded about 40mg into the meth bong and began heating it up. He took three massive tokes and attempted a fourth but was unable to hold the pipe long enough to get another hit. I started meditating at this point, which was about 8:45pm. Mav-cake came back from his trip,  disoriented and talking about colors or something, I couldn't make out what he was saying, but it sounded fun.</p><p>I continued meditation until 9:15. I loaded the pipe, heated up the dmt and began to inhale. The smoke was harsh and plasticy, it tasted sort of like a burning rubbery substance, it was bearable, but it wasn't good. During the first hit my body started to tremble and I could hear a low buzzing noise, I coughed out the smoke and immediately took a second hit, my body started to go limp and it was getting harder to hold the pipe. I exhaled and again took another toke, this hit is always my favorite, I was unable to hold the meth bong for the entire hit and Mav-cake had to take it and hold it while I hit it.</p><p>After the third hit I layed back and looked up at the ceiling, my body melted into the bed and as I watched the spots on the ceiling they changed hue. They became gold and pink. I closed my eyes and put my hand on my face, my hand melted into my face, then my face melted away. I could no longer feel my body and it felt like I wasn't breathing, but I knew I was. Triangles began to form and change colors while creating an impossibly complex structure that could not be man-made, it looked like someone thought it into existence. As I looked closer at the colorful triangles I felt like I could crash through them. I was no longer in my body at this point, it felt like my body dissolved into my soul so I could move around freely in this new dimension.</p><p>I floated and crashed into the massive triangle complex, and when I went inside they disappeared, or rather became something else. I looked around and saw what looked like very short elf-like creatures, it seemed like they were pointing at me, and talking about me but I couldn't understand what they were saying. As I focused on them they became blurry and almost two-dimensional and eventually disappeared. I looked around and saw an incredibly complex machine, and I instantly knew it was the control panel of the universe, being manned by indescribably strange looking entities and it seemed like they were just running the universe  like it was part of their everyday life. Upon seeing this, my friend began playing Ukelele de Chocobo on his iPod. I heard this and was immediately drawn back into the real world, and was unable to go back into that other dimension that I was in.</p><p>My body still felt like it was melting and I felt amazingly euphoric. It was approximately 9:20 by the time I was up. My brother called and asked me to bring him a joint, so I drove to the gas station that was literally only 20 seconds away, and gave my bro some pot. I do not recommend or condone driving right after smoking DMT, do NOT do it. It is a horrible idea.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>We went back and rolled a beautiful joint and smoked it. After smoking the joint, I felt amazing, enlightened and euphoricly high, with some really vague open and closed eye visuals, and the room had a golden-pink hue to it for about 30 minutes after smoking the DMT. All in all, a good day. DMT is probably the most amazing thing I have ever experienced in my entire life, it makes everyday life boring and sad, but it is definitely worth it.</p>",
 "year": "2008",
 "id": "74478",
 "gender": "Male",
 "timestamp": "2013-11-16T08:00:00.000Z",
 "views": "637",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Hydrocodone"
  },
  {
   "time": " T+ 13:15",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "DMT"
  },
  {
   "time": " T+ 13:25",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
