{
 "title": "Asperger's Syndrome and Psychedelics",
 "author": "Thrillhouse Steel",
 "citation": " Thrillhouse Steel. \"Asperger's Syndrome and Psychedelics: experience with LSD, MDMA & DOI (ID 74470)\". Erowid.org. Oct 31, 2008. erowid.org/exp/74470",
 "substance": "LSD, MDMA & DOI",
 "bodyweight": "",
 "report": "<p>I have a moderate case of AS. I have never really felt true empathy in my life. I have cared for and about people, but I never understood how my actions impacted others. My lack of development socially delayed my development with maturity. When i was smoking weed, I started understanding how my past actions impacted people, but couldn't help with current actions. It also wouldn't stop me from and possibly drove me to more dopamine-driven hyperactivity. One day, I did mdma. I felt complete empathy and while I was on it, I did not feel like I should ever smoke again (the comedown changed that). But for the next week or two after my first roll, I did not have AS. At all.</p><p>Then acid comes in. Acid made me feel every emotion in such a powerful, euphoric way. It turned off homicidal fantasies that my lack of empathy triggered. It let me let go of the guilt of what my AS caused me to do, while still realizing that it was bad. I was able to move forward. Based on misinterpreting something my friend said, I completely learned how to hold conversations with people and listen and not just wait for my turn to speak or speak about whatever.</p><p>I also did DOI. I freaked out on my first trip and my guilt returned. However, when I was in school (don't ask) I could hold conversations with people better than I usually do. I think DOI did help, but not to the degree of acid and mdma.</p><p>I still have AS, but it is a lesser case now. I truly understand how my actions and words impact other people. I believe psychedelics have made me into a better person, one who is more considerate and empathetic to other people's needs. I still avoid conversation sometimes, but that's probably because my personality is so bizzare that it's hard to find people to relate to. (seeing as that I have a near obsessive love of movies).</p><p>In conclusion, even though I still have a way to go with psychedelics, AS, and social interaction, I believe that psychedelics, and drugs in general, have made me into a better person with a lesser case of AS.</p>",
 "year": "2008",
 "id": "74470",
 "timestamp": "2008-10-31T07:00:00.000Z",
 "views": "14804",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "LSD"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "DOI"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "MDMA"
  }
 }
}
