{
 "id": 7447,
 "title": "Juiced Baseball Player",
 "date": {
  "submission": "2010-02-15T08:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jake",
  "gender": "Male",
  "weight": 98
 },
 "dose": [
  {
   "time": "0",
   "amount": "10ml repeated",
   "administration": "IM",
   "substance": "Steroids",
   "form": "liquid"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "When I entered college, my main goals were to find a college that I could go to and play baseball at the same time.  I chose to go to a junior college so I could get more playing time.  Playing junior college baseball was my first direct contact with anabolic steroids.  Out of a 30-man roster, I would say that at least 12 of my teammates were on some form of steroids whether it be testosterone, Winstrol, or Deca-durabolin.  I witnessed some roid rage, but not directed towards me.  I also witnessed how much the guys who were juiced crashed after they came off of them.  Their bats became slower, and they lost all of the weight that they gained.  I also came to realize that anabolic steroid abuse in junior college baseball is rampant.  Every team that we would play had at least a couple of guys on the juice.  They do not drug test in NJCAA.",
  "Anyways, three years later, I was at a 4 year university and I decided I wanted to try steroids to see what all the hype was about.  I bought a cycle of Ara-test 2500 aka test 250.  This bodybuilder I met told me exactly how to do a cycle.  So I followed his directions injecting every 6 days with different amounts according to what stage of the cycle I was in.",
  "A day after my first injection, I felt immediate results.  I stepped up my lifting regiment as well.  It really made a difference while I was hitting.  I felt like He-man.  When I would swing the bat, it felt like I was barely swinging, and then I would watch the ball skyrocket out of the ball park.  I was able to hit the ball farther than I ever had before.",
  "My goal was not to gain weight because I was already a big guy at the time. I was 215lbs.  I just wanted that extra power to hit the long ball.  I stayed pretty much the same weight, but I slimmed down a bit, turning fat into muscle.  The weight I was benching increased about 40 lbs in 6 weeks!",
  "Now the drawbacks.",
  "Steroids made me very angry.  I already had a short fuse before I got on the juice. It made that fuse almost non-existent.  I would blow up on my best friend, my girlfriend, and my teammates for seemingly little reasons.  I would be over at my best friends place, chillin smoking pot, and I would get fired up over nothing.  My friend would tell me constantly, 'Take it easy man.'",
  "With my teammates, on the road it got ugly a couple of times.  One time my teammates were just messing around wrestling and such.  This skinny pitcher (I am a catcher by the way) decided it would be smart to go after me. Bad idea.  When he came at me, I litterally picked him up off the ground and choke slammed him to the ground.  Steroids made me feel like I could take on anyone who would pose a threat, no matter how small the threat. ",
  "People talk about your nuts shrinking when you are on steroids.  My nuts did not really shrink, they just were pulled up all the time, kind of like when I get out of a cold pool. My face also became puffy from the water retention.",
  "After I got off the juice, my nuts went back to normal in about a week.  I also went from 215 to about 208 when I got off.  Ironically, I actually played better that season when I was off of the juice.  I think it had to do with the psychological effects of the juice.  I did not enjoy the constant on edge, or wound up feeling that it gave me.  I had a harder time focussing at the plate on the juice.  In fact in order to cut back on the roid rage and the feeling of being on edge, I would smoke pot before we would go to the game.  I was by no means still stoned by the time the game rolled around, but it took the edge off of the juice.",
  "I do not see how anyone could take juice and not smoke pot.  The constant rage and anger started to eat at me, the only way that I could mildly chill out was by smoking more pot.  I still was angry, but not near as angry as I would have been without grass.",
  "Steroids made me superhuman.  Little things like walking up stairs, made me feel like I was so much more powerful.  My whole body just felt lighter. ",
  "I would never do steroids again.  I am already angry enough, and I do not play baseball anymore, so I dont really have a reason to do them again."
 ],
 "erowid": {
  "id": "46019",
  "citation": " Jake. \"Juiced Baseball Player: experience with Steroids (ID 46019)\". Erowid.org. Feb 15, 2010. erowid.org/exp/46019",
  "substance": "Steroids",
  "views": "15699"
 }
}
