{
 "title": "Falling to the Sound of Ten-Thousand Birds",
 "author": "Get Up Kid",
 "citation": " Get Up Kid. \"Falling to the Sound of Ten-Thousand Birds: experience with Morning Glory (ID 7451)\". Erowid.org. May 25, 2002. erowid.org/exp/7451",
 "substance": "Morning Glory",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "9.0 g",
   "oral",
   "Morning Glory"
  ]
 ],
 "report": "<p>In a long chain of experimenting with home-made / legal drugs, I finally got around to my second time of using morning glories. I used heavenly blue, 9 grams in fact. The preparation was very tedious because I wanted to produce an effect as close as possible to acid. I was in a very very good mood (thanks to the x I had taken last night)</p><p>First, I washed the seeds to remove any pesticides. After they dried I ground them up in a coffee grinder and put it in a coffee machine, where I had about a cup of morning glory tea. I decided that it wasn't potent enough yet so I put the grinds in it and let it sit for about 2 hours. After that I filtered it and put it through the coffee machine about 2 more times. I added some sobe : green tea to the concoction (which now interestingly enough looked like coffee) and downed it. It tasted horrible. Then I ate the grinds. It tasted even worse.</p><p>Now, I began talking to some friends on the internet when I began to have a pleasant 'going up' feeling of pure euphoria. This was only about 5 minutes after I downed the tea and seeds. I began to think to myself about nothing and I got off the internet and put on some music. I watched this weird visualization thing with winamp and just sat there for about 2 hours staring at this starfield type thing. I wish I had a picture of myself because I know I had the biggest grin on my face in the entire world.</p><p>The whole experience was unbelievably mellow. Everything felt good and I felt happier than I ever have in my entire life. As if that wasn't enough, the visuals kicked in, and it was amazing.</p><p>Suddenly from my bedroom I felt a warmth from nowhere. I looked outside and it was almost bright as daylight (what at 1 o'clock?) I stood up and walked to my window, I think I knocked over my computer but didn't even notice. When I looked out my window my view of my modern suburbia was replaced by a giant plain of green grass and trees. I walked out my window and looked back, my window was all that was left of my house, inside I could see myself staring out. I waved, I waved back and smiled, then turned around and walked into the field.</p><p>Everywhere there were birds and butterflies. Flowers that bloomed with the most vibrant colors I had ever seen. Everything was blurry, and things moved with the most unbelievable tracers I had ever seen. Then with a large flash, I was standing back in my room, staring out my window to my quiet neighborhood at night, still hearing the birds. I moved to my bed where I fell asleep. I have never slept so soundly in my life.</p><p>I know people will say morning glories don't work, and that this would be outright impossible, but I know what I saw, and forever ill carry this piece of heaven with me.</p>",
 "year": "2001",
 "id": "7451",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-25T07:00:00.000Z",
 "views": "10137",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "9.0 g",
   "administration": "oral",
   "substance": "Morning Glory"
  }
 ]
}
