{
 "id": 7452,
 "title": "Don't Plan on Sleeping",
 "date": {
  "submission": "2001-12-28T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fed",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40",
    "grams": 0.04
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "mg",
    "quantity": "10",
    "grams": 0.01
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "12:00",
   "amount": {
    "unit": "mg",
    "quantity": "40",
    "grams": 0.04
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "17:30",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "18:30",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "19:30",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Well I started off the day with a pretty positive mindset. I had taken Adderall orally before and this time decided to snort it. (rationale is that I find snorting produces a greater peak and more pronounced effect for any drug). I had injested 9 10mg tablets in one 3hr block of time a couple months ago, but I was on a bunch of other drugs that night as well, so I didn't have a distinct feel for A+ as other pharms (mm....ritalin).",
  "So anyway, me and my friend R. went out and got some of the 20mg tablets. I crushed up 2 for myself and 1 1/2 for R. The time was around 6:30 pm. The fine powder didn't burn, but it had a trickle that was almost like a nasty sweet taste. A strong increasing head/body buzz started at the 10min mark.",
  "The effects still were going strong hours later when we found ourselves just walking around the mall. On the car ride to and from the mall we had a good conversation about why drugs should be legal, and how we should feel this way all the time. I think R. was having more fun than me though. I prefer the feeling of snoggin' 50mg of ritalin a little better. I had R. drive me home at around 7:30 and I was still fucked up. When I got home I snogged about 1/2 of a tablet. I read the first 200 pages of Dune in a 2 1/2 hour period, watched tv, read another 75 pages (!) and then tried to go to sleep at 2am.",
  "NO LUCK. I didn't sleep AT ALL. I took a shower at around 5:00am and snorted about 2 more adderalls before I had to be in class at 7:45am. I was really buzzed in class, but we didn't do anything that I needed to concentrate on so I just enjoyed the feeling. Around noon I started on another 3 tablets (I snorted one every hour or so) and ended at 3:30pm.  Writing this all down now.. I finished that Dune book (530 pages total) and on page 60 of the sequel and now its 6:30, wonder if ill sleep tonight... I think ritalin is more comparable to coke than adderall. A lot of energy, body / head buzz, alertness, and coming down no appetite (haven't eaten much past 2 days) and a definite effect still preventing sleep for many hours after the last dose."
 ],
 "erowid": {
  "id": "4603",
  "citation": " Fed. \"Don't Plan on Sleeping: experience with Amphetamine (Adderall) (ID 4603)\". Erowid.org. Dec 28, 2001. erowid.org/exp/4603",
  "substance": "Amphetamine (Adderall)",
  "views": "35924"
 }
}
