{
 "id": 7455,
 "title": "Disassociative Techniques & Castaneda",
 "date": {
  "submission": "2005-10-03T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Luke",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "DXM"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Dizocilpine"
  }
 ],
 "report": [
  "<p>When reading the Carlos Castaneda books and applying the lessons that he had written I have encountered some really interesting spiritual & psychological territory.  Especially with the help of using substances, or in the Castanedian language, allies.  Dextromethorphan, DXM, has been my most useful helper, or ally, throughout the development of my spiritual awareness.",
  "I could say that  my learning began whenever I was born.  But that wouldnt seem to fit in with the direction of this report.  Those early memories of my life wouldnt have ever even be accessible to my conscious awareness without the use of DXM.  Carlos Castaneda described in The Art Of Dreaming that our memories are stored in a place, similar to being stored in a vault, at a position in the assemblage point.  He called the assemblage point a point where our perception is put together, or assembled, and consequently is what is observed in our cognitive awareness.  He said that to access those stored memories, one must simply have the necessary energy required to shift the assemblage point to the corresponding position as the position in which the assemblage point perceived the stored memory.",
  "This procedure, in my practice, was the only workable explanation of what Ive witnessed when using DXM.  Memories unaccessible were at my immediate disposal when Ive taken DXM, because to me, DXM seemed to give me enough 'dark energy' to allow access to places in those 'hidden vaults'.  The memories uncovered were actually relived like I was again experiencing them. The memories surfaced seemed to always have a profound importance on my life at the time of surfacing, and a new outlook on the design of my entire life process.  The specific events that Ive remembered were based on what Ive intended to remember, at the specific time that Ive dosed; and the experience also seemed to give itself over to an intelligence on part of the DXM. What Ive uncovered with remembering had always  given me a desire to want to uncover more, strengthening a developing and more complex relationship with DXM and what it showed me.",
  "Another way that the uncovering of memories compares to Castanedas writings is whenever he wrote about recapitulation and its importance.  Castaneda wrote that it was important to recapitulate in order to build up personal power, and to aid in dreaming exercises, among other things.  He explained that there is a dissolving force in the universe, and the dissolving force eats awareness.  In order to have the necessary energy to live to ones potential, one must recapitulate ones life.  The recapitulation feeds this dissolving force, therefore allowing ones awareness more freedom. ",
  "This exercise in recapitulation relates to another disassociative experience on MK-801.  Because the lack of much needed information on the internet about this disassociative, I overdosed on this drug and suffered long lasting brain damage.  I have no business taking a drug that I know nothing about, and this was altogether my fault too.  It is not me to put down any drug, and please dont think that Im putting down this drug.  Im putting down the lack of information about this drug and my own irresponsibility.",
  "If anyone comes across MK-801,  I urgy them to take supersmall doses.  The doses are small like acid.  Under 1 milligram to a couple milligrams is probably right.  However Ive never accurately weighed my dose(s), which of course is what lead to brain damage.",
  "MK801, to me, is up there with ecstacy.  Its an incredible drug.  It had me walking on my knees, running across great distances like a giant with my dog, and seeing into molecules so that my fingers actually went into trees and allowed me to pull myself up them so that I didnt need branches to climb.  I just put my fingers into the tree. I took MK801 for 3 or 4 days and ended up tripping for 3 to 4 weeks.  I gave one dose to a friend and he tripped for two days.  It is an amazingly good drug and the vibrations and body high are so good, & the sex.  But it also almost killed me because of my stupidity, or my stupidity almost killed me.  After not being able to stop tripping for about one week in, I began pissing and shitting blood, I became retarded.  Flashing and strobing couldnt quit making my field of vision come toward me, to the point that it was actually devouring me.",
  "The lesson about recapitulation that Castaneda had written about is the only thing that consoled me.  The last thing that I wanted was to go to a hospital and get put into a Mental Health, because thats what would have happened if I didnt stick this out.  So, I recapitulated.  I laid down and closed my eyes, turned my head from side to side, and memories freely flowed, like liquid, into my conscious awareness.  Long forgotten memories were relived.   Time didnt seem to matter.  I would experience a childhood memory, then an adult memory, and then Id uncover a teenage memory. As I relived these memories and recapitulated, the strobing that seemed to actually be killing me was actually being fed by the memories that I relived.  This strobing and flashing was only explained to my rationality as what Castaneda defined as the dissolving force, or in easier terms, to me, Death.  And my reliving memories, recapitulating, was the only thing that slowed down the strobing, and actually gave me some balance and peace.",
  "If anyone runs into any difficult territory on MK801, I ask you to remember the recapitulation technique.  It would no doubt work with or without drugs or on any psychedelic substance I suspect.",
  "Id like to get into one other thing that isnt much talked about.  Ive discovered that by putting on my headphones and getting into a lukewarm  bathtub while on DXM, I can go on fascinating journeys, or boatrides.  It can be speculated that Marilyn Mansons Portrait Of An Amarican Familys Willy Wonka introduction has an angle on the boatride experience. Whenever I put on my headphones and got into my bathtub and closed my eyes on DXM, I would seem to almost immediately go out of body and go on journeys.  The size of things, like my shower curtain would get incredibly large and I would start to float down rivers, or be on a speeding locomotive going on journeys through Purgatory or Hades, or be in an airplain, or traveling into space.  My bathtub would start floating and sometimes get ripped out of  my wall.  Almost all the time my bathtub would end up vertical and upside down, and I would fear being dropped from the ceiling onto the floor.</p>"
 ],
 "erowid": {
  "id": "46040",
  "citation": " Luke. \"Disassociative Techniques & Castaneda: experience with Dizocilpine & DXM (ID 46040)\". Erowid.org. Oct 3, 2005. erowid.org/exp/46040",
  "substance": "Dizocilpine & DXM",
  "views": "13791"
 }
}
