{
 "id": 7458,
 "title": "Difficulty Sleeping",
 "date": {
  "submission": "2001-12-28T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Altered",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ],
 "report": [
  "Recently, with a friend, I ground up about 60 grams of morning glory seeds in a coffee grinder. We put the powder in a large plastic bag. We let that soak in water overnight, and afterwards we filtered it through a pillowcase and let the brown liquid drip onto a pan. We put this pan over low heat for a couple hours (extremely low heat) and afterwards, all that was left was a dark brown crust on the pan. This was scraped and soaked in about an ounce and a half of alcohol (stale, old gin) and the resulting mixture was filtered once more through paper towels, drop by drop. I was told that this would make the effects instantaneous after putting the alcohol on one's tongue. Everyone present had smoked cannabis earlier.",
  "When they put the mixture on their tongues, they said they saw the various articles of paraphenalia on the kitchen table were 'moving.' I wanted this experience, so I tried it. Unfortunately, either for some reason it wasn't working with me, or I couldn't feel a difference through the cannabis high. I was disappointed.",
  "A couple weeks later, my curiosity got to me again. I got 8 packages of Heavenly Blues from Fred Meyer, 1.5 grams each. That's about 50 seeds in a pack. I heard that they were coated with poison and this could be washed off with water (may or may not be true), so I washed them. At 4:10 I crushed them and ate a package. At about 5:00 I was feeling a mild and very pleasant high. Euphoria. I ate another package. An hour and a half later, I was feeling about as if I had had a couple hits of cannabis. My muscles were lazy. I felt like just sleeping. At 9:30 I crushed three more packets and consumed them. By 11:00 I felt them taking hold. I felt good watching The Man Show. But I was tired, so I went to bed.",
  "I had a hell of a time sleeping. I was very very uncomfortable. First of all, my muscles ached, notably my groin. Second, my chest cavity and stomach felt collapsed. I later attributed this to a distorted sense of hunger. If I trusted my natural functions to breathe for me, I would take short gasps that were placed too chronologically distant for comfort. I thought of and feared suffocation in my sleep. So, I had to make an effort to breathe as deeply as I could. This made sleeping quite impossible. I tried to get to sleep by reading some Gonzo journalism. But my attention span was depleted, so I just lay there, shifting positions and not getting any more than half asleep. Through experience with many different substances, I have found that they seem to hit hardest when I lay down and attempt to sleep. LSA is no exception. With my eyes closed, I experienced many crazy and wild visuals that I had never thought my imagination was capable of. I just wish there was a quick and easy way to record these on VHS.",
  "The strangest thing that happened to me that night happened as I tried to sleep. With my eyes closed, it seemed the boundaries between my mind (my consciousness) and the surrounding environment of my imagined room were no longer. The bedpost, the lamp, my pillow, the wall, and me all became one entity. This is extremely difficult for me to put to words, and there is no way to properly convey this sensation.",
  "I woke up at about 1:00, from a nightmare (or something of the sort... Hunter Thompson's words 'catatonic despair' hung in my mind). In the dark my digital alarm clock, which comprised of green LEDs, had a rainbow around it. Cool, I thought. What's next?",
  "I turned on the light and found faint colors in strange moving patterns all over every blank surface. This, I suspected was a result of retinal feedback. I'll explain. hen a bright light is looked at, the image is superimposed or 'burned' into one's retina. I'm sure everyone has had this experience. Traces of the light can be seen for a significant time afterwards. This is the fuindamental concept of tracers, of which I saw many. When under the influence of Morning Glories, these retina burns can occur with much more sensitivity. When looking at a white wall, its image is 'burned' and superimposed on the retina. If the wall is still in the same location in the field of view, its image and the image of the superimposition are retained, and a new image is burned onto the retina of both these elements. This is the 'feedback' process I speculate on. It results in the visualization of colored patterns.",
  "At this point, my eyes were very red, even though they had been closed for a couple hours. I suspect I was dehydrated.",
  "Throughout the night, every now and then the top 10% of my field of vision would be subject to a strobing effect, whether my eyes were open or closed. Also, various textures (such as wood and paint) were ever-so-slightly moving and distorting. I walked to the bathroom and urinated, and I observed that, I apologize for being so graphic, but my member had retracted. It seems that the drug acted as an anti-aphrodisiac. I looked down at my stomach. 'Holy Christ,' I thought. Or did I speak? 'I didn't think there was that much hair on my stomach.' I looked again in the morning. There wasn't.",
  "I managed to sleep until about 6:45 when my alarm woke me. I was exhausted, mentally and physically, and had a mild hangover. But school wouldn't attend itself. I knew I was starving, so I crammed a bowl if special K down my throat. Usually I love this cereal, but it was difficult to eat. However, without it I would have collapsed. But after I polished off a bowl of it I felt better... Once the glucose hit my blood stream I had energy, and was ready for the day's activities.",
  "I noticed that while intoxicated, annoying little songs that I heard got stuck in my head quite easily. Also, all I felt like doing was staring at things.",
  "These observations and theories may or may not be correct... keep in mind I was chemically disabled while observing them.",
  "Overall it was an enjoyable experience. However, next time I will wash the seeds with detergent also. I suspect that water doesn't completely remove the coating. Also, I will make sure I eat a large meal first, and I won't try to sleep during the trip. I will grind the seeds in a coffee grinder for greater potency, and have a good, trustworthy friend with me.",
  "Until then, this is Altered, signing off."
 ],
 "erowid": {
  "id": "4605",
  "citation": " Altered. \"Difficulty Sleeping: experience with Morning Glory Seeds (ID 4605)\". Erowid.org. Dec 28, 2001. erowid.org/exp/4605",
  "substance": "Morning Glory Seeds",
  "views": "14801"
 }
}
