{
 "id": 7467,
 "title": "Inside the Fabric of the Room",
 "date": {
  "submission": "2007-09-19T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Plum",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "The residual drowsiness hangs on me like during the end of a dream. My eyelids fall toward the computer screen before realizing they're attached to my head, and settle for a groggy slump. They're pissed at me for writing this right now. They want to sink into the down feathered pillow that sits just to my left near the head of my bed. Its light blue coat calls from the blue sheets. But no, I must get this out. Then I will walk around in the remaining sunshine listening to the sounds of the street, the sounds of life.",
  "I think I got one-and-a-half hits in before blacking out. I left my body, must have just climbed right out, and my consciousness spread out against the three walls surrounding me. I sank into the wall behind me, which became the ceiling and the back wall at the same time. All the walls melded together with me in the middle, and I was stuck. I woke up stuck to the wall, stuck IN all the walls really, and I had no control over my body. There were two 'others' in this world I now inhabited even though I was alone before I smoked, but ha, I had no recollection of anything at the time, and they were laughing at me in my stuckness.",
  "One was on my left and one was on my right but I couldn't see them because I couldn't move my head. I didn't have a head as I was by now completely soaked into the fabric of the walls, a deep hypnosis inside the fabric of the room. I became terrified and tried to jump out of the walls but couldn't, and realized that I no longer had any body, and I was quickly forgetting what a body even felt like. Had I ever even had a body? Wait, what's a body? Is this some kind of joke? Am I dead? Has it always been like this?",
  "I mustered up enough will to get back into my body just long enough to stand. I heard a thump on the ground, which I later realized was my iPod falling from my hand and crashing against the floor. I stared down at the table before me, which contained the yellow bong and a bottle of mescal, also yellow, and suddenly I was spinning in a circular motion from the bong to the mescal, from yellow to yellow, spinning round and round like a ferris wheel, three feet in diameter with me trapped inside, inside my own room. All the while the two evil beings surrounding me laughed and laughed. It was then I realized that I had done something to cause this, that I had eaten something, or drank something, maybe it was that yellow bottle down there, or smoked something to put me in this state. And then I remembered 'SALVIA'--the green goddess.",
  "I remember thinking that there was someone on the other side of this woven blanket of unconsciousness that I had asked to help me but didn't. DAMN HIM, if he had been there he would have never allowed me to stand up and my iPod never would have dropped and crashed to the ground. My iPod! Damnit, it probably broke, wait a minute, I'm sinking back into my body now, hold on, sit down, relax, take this weird shit off my head, what is this, oh, a blindfold, so much for that, I must have tried to throw that off my head when I first stood up and it must have gotten caught on my ears. OK, just close your eyes and look at the colors. Shoot, the colors are all gone, I wasted this whole trip freaking out over being stuck inside the fabric of the room. Well, if there was ever a good cause for freaking out, that's it.",
  "I'm going to go catch the last bit of sunshine now."
 ],
 "erowid": {
  "id": "46088",
  "citation": " Plum. \"Inside the Fabric of the Room: experience with Salvia divinorum (17x extract) (ID 46088)\". Erowid.org. Sep 19, 2007. erowid.org/exp/46088",
  "substance": "Salvia divinorum (17x extract)",
  "views": "3253"
 }
}
