{
 "title": "Captain Acid Hat's Amazing Acid Aventure",
 "author": "Mister Weever",
 "citation": " Mister Weever. \"Captain Acid Hat's Amazing Acid Aventure: experience with LSD & Cannabis (ID 74690)\". Erowid.org. Jul 15, 2010. erowid.org/exp/74690",
 "substance": "LSD & Cannabis",
 "bodyweight": "180 lb",
 "report": "<p>First, a little background. I am not your typical psychonaut, well, at least not stereotypical. I am a high technology major in University; Id like to consider myself relatively well adjusted, and relatively safe in most of my endeavors. Prior to this experience, I had done no other drug other than ganja, I found the concept of psychoactive substances frightening, and didn't consider myself ready for the experience.</p><p>This past summer, a good friend who I had lived with in a Dorm that year contacted me about going to a rave, a music festival really. On a sparsely populated island legendary in the area for the open-minded populace, and frequent drug use. I agreed to go, as did three of my other good friends.</p><p>We went to this festival, a three day affair, the previous week I had been preparing myself for it, reading all I possibly could about LSD. Bolstered by my newfound knowledge, I arrived to the event, and set up camp. Being as that this was a three day affair, we agreed that we should plan our trip. That night we partied, enjoyed the good music, didnt really sleep, but had a good time. The next morning, we all awoke and started to make preparations, we agreed to eat these little sugar cubes a friend had acquired, liquid locally produced, pack a bag with supplies, and then set off down the beach. We ate the sugar cubes, all joked nervously, packed a bag with water, pot, and a camera and set out. There were four of us, only one had tripped before, we really had no idea what we were in for.</p><p>About 45 minutes later, the rocks started to sparkle. We where walking down the beach, enjoying the beautiful weather, when we started to point out the beauty of the stones, their place, their job, their perfection. At this point, we knew it was starting to kick in.</p><p>Tripping steadily, we ducked into the forest, a likely sheltered wooded path providing the perfect venue in which to experience our newfound expanded perception. I felt truly alive, I had embarked on this trip to try to find something I didnt know I was missing, it quickly became evident that my truth was lying just beyond the horizon.</p><p>The forest was beautiful, more beautiful than anything Ive ever seen before in my life. Plants were not just plants... they where an extension of the planets beauty. Bees buzzed with a purpose, not simply diving and weaving aimlessly, but traveling with duty. Realizing most of the plants around us actually stinging nettle (think poison ivy but Canadian) we returned to the beach, rounding the corner to possibly the most confusing situation we could have.</p><p>There stood, on the beach, a cabin. Keep in mind, this is NOT a city. This is a beach that requires 20 minutes of off-road travel to simply reach, electricity ending 30 or 40 kilometers back up the island. And here lies a cabin. Approaching the building warily, I felt like we werent ready for it. Like it was not our place, it was not the right time for this building, however, we entered cautiously. The cabin was furnished, not only with the standard couches, but a television, vcr, and stack of movies, quickly becoming apparent that a generator was required for full operation. Relics of past trips lie all around us. Here a picture, there a stack of beer cans, carved in the wood of the walls lie the reminders of previous adventures. Walking over to a side table, I picked up a curious scrap of paper, yellowed with time, it read:</p><p>Would you rather step in quicksand?</p><p>Or spend your entire life</p><p>Avoiding it</p><p>This rang deep. Deeper than three lines should, looking at each other in wonder, we decided that we needed to keep moving. The empty place seemed too large for us, seemed too hard to comprehend. Hoisting our bag of tricks high, we left, staring back at the tiny house, wondering what other secrets it held.</p><p>By this time, in the hot sun, we had finished two bottles of water, having no pockets due to shorts; I tied the empty containers to the corners of a bright green bandanna, letting it hang from a belt loop. Suddenly I felt the need to complete it, picking up a stone; I tied a third corner off, a bright red lighter completing the fourth. Holding my creation aloft I placed it upon my friends head, and there he stood dubbed: Captain Acid Hat.</p><p>Onward Captain Acid Hat and his band ventured, walking down the pristine beach, leaping from rock to rock, enjoying the experience of having our senses unleashed.</p><p>Here we diverge from pure narrative and into theory. When experiencing such emotions, I pondered, what could possibly cause such a shift in reality? Was Captain Acid Hats amazing adventure simply fantasy? Were we all experiencing random synapses firing that caused the plants to seem so alive, the bees to seem so committed, and the water to sparkle like the light of a thousand suns? Or was it something else, deeper.</p><p>Spiritual? Unlikely. I am a man of technology, I entertain few delusions of theology, in fact, one of my greatest fears was the possibility of experiencing a spiritual vision, what if Im wrong? What if Im faced with the reality of a Christian theology? How would I deal with my entire worldview being shattered? No, this was more. Spirituality was minor in the world I experienced, where there a god he would be humbled by the beauty present in everyday things.</p><p>My theory is this: To assume and assert that our five senses represent the culmination of the universes experience is not only arrogant, but dead wrong. It has frequently been suggested by far smarter men than I that we exist in a tiny bubble of reality, our brains are wired through evolution to handle only so much input, so much feeling. But we take it all in, our eyes see everything, our eyes see radio waves, our eyes see other crossing dimensions, our eyes take in everything that exists, but our brain filters it out.</p><p>LSD is not a harsh chemical, it is not a brutal taskmaster, forcing me into an altered state of consciousness, its a switch, flicking it opened my mind, and I believe, reduces the filters placed between me and reality. For the first time, when I looked at those sparking rocks, I saw them for what they were, without the muddling filters of my brain blocking it.</p><p>But back to the story.</p><p>Rounding another bend, we spied the end of our journey. The beach ended, curved up into a rocky bluff, impossible to climb in our state, but affording an amazing vantage point, shaded as it was by the thick tree cover on the hill. We made camp, opened our bag of tricks, and started to talk. About everything, about life, about our experience, we related it quite strongly to simply being stoned out of our gourds, the lot of us surprised at how gentle it was. Our minds were not addled nor chained, we could think, we could talk, hell, Im sure that given the right motivation we could dance, had we not other, more important things on our minds.</p><p>Packing a bowl took an hour and a half, but we didnt notice, the slow process of grinding passed between us all, rotating seemingly in an organized pattern. Three members of the group would engage in deep discussion while the fourth would be off on their own, watching the water, or the trees, or the rocks, or the weed, never really becoming detached, simply orbiting, it reminded me a lot of a solar system.</p><p>We discussed the note from the cabin, its significance, possible theories for its meaning and the place it was found in. We evolved, we became stronger, and on that beach, sitting in the shade, staring and trying to comprehend a tugboat moving across the strait, I found what I was looking for, the missing piece to my life. To a stranger it is unexplainable, but rest assured, I needed to find it.</p><p>The sun rose in the sky, becoming mighty at its zenith, and started to descend as the afternoon wore on. Our shade retreated, becoming brighter and brighter, until our cool perch became hot. We decided it was time to head back to the camp. Walking back to the cabin, I noticed the only downside to the entire weekend, in my eagerness to set out, I had forgotten to apply sunscreen to my left arm, the skin was bright red and obviously sunburned. I took captain acid hat back, drenched it in seawater, and placed it over my arm, tying it tight and keeping the sun off it.</p><p>We once again reached the cabin. But now it was different, it wasnt hostile, it was inviting. It had judged us, and finding us worthy, became a happy place to be. It became our cabin, our place of refuge from the sun, we explored it, laughed at its jokes, its quirks, doubling up in hilarity as we discovered the foil packets arranged on the table contained dried magic mushrooms, we left them, had no need of them.</p><p>We packed a bowl, and then I stood, looking over to the tv that couldnt possibly turn on, spying a drawing on top of it. It was beautiful, simply patterns in crayon, and on the back. Tripping in the cabin, lots of love, john and Marcy, new years 2006. I realized we needed to leave our mark, looking back at my friends, laughing on the old dusty couch, it came to me:</p><p>You will never know what youre seeking</p><p>Until you find it.</p><p>-July 2008</p><p>Placing the note down, we smoked a bowl and decided to set back, braving the unforgiving sun once again to arrive home, the music of the stage reached us first, bounced over the water, and we started to see tents again, people. Interacting with humans again was peculiar, I felt enlightened, strengthened.</p><p>We discovered (much to our delight) that the beach we tred upon was actually a nude beach, and the tanned flesh of dozens of beauties lounged about, smiling to ourselves we made our way back to our campsite, to bottles of water, and the end to a wonderful experience.</p><p>LSD Changed my life. It wasnt huge, I didnt drop my major and live in the forest, nor did I freak out and swear it off forever, I simply realized how Id been going about things wrong. I am a changed man due to this wonderful chemical, and a stronger human being from that beach.</p>",
 "year": "2008",
 "id": "74690",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-07-15T07:00:00.000Z",
 "views": "16226",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 ",
   "administration": "oral",
   "substance": "LSD",
   "form": "(cookie / food)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
