{
 "title": "Psychedelic Roller Coaster",
 "author": "Sari",
 "citation": " Sari. \"Psychedelic Roller Coaster: experience with Cannabis (ID 747)\". Erowid.org. Oct 18, 2000. erowid.org/exp/747",
 "substance": "Cannabis",
 "bodyweight": "",
 "report": "<p>I am a high school student who usualy smokes with friends, but one night I was alone in my house and bored with a nickel sack of bud just waiting to be smoked.  I smoked the whole thing by myself in my garage out of a pipe I had made out of the mouthpiece of a trombone.</p><p>I realized I was extremely stoned when a chair in the garage started floating, and I stumbled back into my house to put away the pipe.  After doing so, I went to the kitchen and stood there, just staring into space, thinking.  My entire body felt like it was on fire, and my spit tasted thick and bittersweet. </p><p>Hoping to get rid of the taste, I picked up a cookie sitting on the counter and attempted to eat it.  I felt the crumbs sprinkle down into my stomach as I swallowed, and they felt as if they fizzled out of existence as they hit fire.</p><p>That's when my 'religious experience' started.  My friends laughed when I told them because they know I don't believe in heaven or hell or organized religion.</p><p>Everything from the cookie to my stomach became symbolized.  The cookie was a sinner, and there were specifics for what made it a sinner that I can't remember anymore.  My tongue was coal, like purgatory almost, burning the 'sinner' and preparing it for the next level.  My heart was fire, and it felt like the cookie crumbs went straight through my heart and burned as they did.  That prepared the 'sinner' for the final stage, my stomach, the pits of hell.  It fell into the pits of hell and then disappeared into oblivion.</p><p>I stood in my kitchen just preaching and preaching about this to absolutely no one, and I wish like hell there had been someone there to listen to me.</p><p>I realized that, although I was hungry, there was no way I could burn any more sinners, so I went to lay on my couch.  I laid there for what seemed like hours, just thinking and thinking and thinking.</p><p>I closed my eyes and suddenly was taken inside my own brain for a psychedelic roller coaster ride within my mind.  It's hard to describe, but I'll try my best.  It was like a series of colorful tubes I was sliding through extremely fast, they were three dimentional and attached to other tubes.  Attached to parts of the tubes were childhood memories, but not actual memories, more like memories of dreams I'd had as a child or things I had imagined. </p><p>It was intense.  I remember screaming and holding my head and rolling around the couch and yelling 'oh my god!' over and over.  During this experience I had the most vivid understanding of imagination, childhood, dreams, memory, how the human mind interprets information, and just life in general.</p><p>After the trip was over I passed out.  I didn't realize that marijuana could be that intense.  I'm glad I smoked it alone that day because otherwise my friends may have disturbed my understanding.  I have never tripped out that bad before or since, and it changed my life and my perception of myself.</p>",
 "year": "2000",
 "id": "747",
 "timestamp": "2000-10-18T07:00:00.000Z",
 "views": "16571",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
