{
 "id": 7477,
 "title": "Interesting Alternative to Normal Tea",
 "date": {
  "submission": "2011-04-11T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "J.A. Hatfield",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "cups"
   },
   "administration": "oral",
   "substance": "Catnip",
   "form": "tea"
  }
 ],
 "report": [
  "I've been interested, as of late, in this 'legal high' thing, as in, getting high off of different herbs in a legal and safe manner. So, I read online and found an article about how a man made a tea from catnip. I decided that, after ordering a two dollar bag (one ounce) from an online herbal store, I would put it to good use. Smoking a joint from it didn't do all that much, even when I mixed tobacco with it.",
  "I boiled a pot of water, put catnip in a coffee filter, tied the bag with a thin rubber band so that none of the catnip herb would fall out, and I gently slid the bag into the boiling water to let it 'cook'.",
  "Time: 06:26 - I just started boiling the water and making the catnip tea. I'm sure my father will be interested in what I'm doing. Telling him that it is simply 'herbal tea made from catnip' (which is the truth, actually) would suffice. He might even try some, who knows? I also got some sugar ready, because I'm guessing this stuff doesn't already come sweetened. :)",
  "Time: 06:29 - I took the water off to stop boiling and put the bag in. The water is quickly turning a distinct brownish red color, something common in tea. I'm surprised, really, to see such a thing. I didn't know catnip would make hot water turn brownish red. I guess I was wrong. I smushed the bag with a spoon against the side of the pot every once and a while to 'squish' out some of the soaked up juices, which quickly made the water turn an even darker shade. I'm going to leave the bag in there for a few minutes to make sure that plenty of the filtered herb liquid comes out into the water.",
  "Time: 06:36 - I took the bag out and put it in the refridgerator, in case perchance I might want to reuse the bag in a new pot of tea. I poured about half of the small pot into a coffee mug, and here it sits with a small amount of sugar added next to my mouse pad. I'm letting it cool off a bit before I attempt to digest it. The fluid, upon further inspection, seems to be a light brown color, or a caramel color. It looks a bit like apple cider, and smells like normal tea.",
  "Time: 06:42 - I'm slowly drinking the catnip, where it is still extremely hot. The taste isn't amazing, probably because I only put about two and a half teaspoons of sugar in the pot. But, it's pretty easy to get down. I reccomend trying to down a whole cup, once it gets cooled off where you can do that without scorching yourself. When the rest of the pot cools off and I finish this cup, I'm going to try that.",
  "Time: 06:54 - I got tired of getting my tongue burned, so I put it in the freezer for a few minutes while I played Xbox. I came back, and the tea was nice and warm. I downed the whole cup in a little under five seconds. I immediately noticed a relaxation of my muscles and a warmth in my body as it went down. Even now as I type this, my fingers don't really feel like typing, more like just laying down on the keys lazily. I went to go play some more San Andreas and test out what the effects are like.",
  "Time: 07:14 - Nothing major happened with the cup of catnip tea. I did notice my vision, for some reason or the other, becoming sharper. When I was playing the game, it was like my eye-to-screen accuracy suddenly boosted up. The effects didn't last that long, though.",
  "Conclusion: Catnip didn't get me high, but it's definitely a nice drink to relax to. I suggest after a hard days work, you come home, pop in your Office Space DVD, get out some of that catnip tea, and have a cup or two. I propose that catip tea is an interesting alternative to normal tea, and it tends to be cheaper, as you can reuse the backs about three times over."
 ],
 "erowid": {
  "id": "46141",
  "citation": " J.A. Hatfield. \"Interesting Alternative to Normal Tea: experience with Catnip (ID 46141)\". Erowid.org. Apr 11, 2011. erowid.org/exp/46141",
  "substance": "Catnip",
  "views": "7131"
 }
}
