{
 "title": "Hard to Completely Give Up",
 "author": "jetgirl",
 "citation": " jetgirl. \"Hard to Completely Give Up: experience with Adrafinil (Olmifon) & Milk Thistle (ID 74830)\". Erowid.org. Apr 22, 2009. erowid.org/exp/74830",
 "substance": "Adrafinil (Olmifon) & Milk Thistle",
 "bodyweight": "150 lb",
 "report": "<p>First I'd like to mention, that at least in my experience, milk thistle, when taken in concert with *anything* causes it to have a much longer tail.  In other words, taking milk thistle causes any drug to stay around in my system for a period of several days, instead of the hours that would be experienced by the average user.</p><p>So, I've discovered that combining milk thistle with olmifon allows me to take only the tiniest fragment of a pill and still reap the benefits as if I'd taken the whole thing.</p><p>Like most stimulants, it gets me to gladly engage in tedious work, like programming or sorting things or cleaning the apartment.  But unlike other stimulants, it doesn't interfere *as much* with falling asleep.  However, unlike other reports, maybe because of the milk thistle, I find I don't sleep as well as I would like.  In fact, after stopping it, I find I need to sleep heavily for several days afterwards, like 20 hours a day heavily.  But there's nothing like a deep sleep with snoring and deep deep slow breathing, so it's okay.</p><p>About 3 hours after taking it, I notice that my eyes and nose feel cold.  I don't like that feeling, I can counteract it a bit with a decoction of warming herbs like ginger and cinnamon.  That feeling goes away after 6 hours. </p><p>I feel this is a premiere stimulant with none of the irritability or negativity caused by caffeine.  But it does have the same soul-sucking side effects of other stimulants that causes me to feel emotionally hollow.  After several days of using it I become quite wound up so that an unexpected random noise will cause me to be startled and shiver deeply.  Social relationships get strained without me being aware of why.  Ultimate I wind up too tense to relate to anyone naturally, but it is so great for tedious tasks as mentioned, that it's hard to completely give it up.</p>",
 "year": "2008",
 "id": "74830",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-04-22T07:00:00.000Z",
 "views": "23026",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Adrafinil"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Milk Thistle"
  }
 }
}
