{
 "title": "Unpleasant Synergy",
 "author": "Meat_Bag",
 "citation": " Meat_Bag. \"Unpleasant Synergy: experience with Paroxetine & Piracetam (ID 74852)\". Erowid.org. Mar 6, 2009. erowid.org/exp/74852",
 "substance": "Paroxetine & Piracetam",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Paroxetine",
   "",
   "800 mg",
   "oral",
   "Piracetam"
  ]
 ],
 "report": "<p>First of all please excuse my harsh english, due to it is not my native language.</p><p>Being interested in usage of psychoactive substances I've always considered myself to be in a 'responsible' position with both legal and illegal substances, but sometimes the information is just missing. Especially information about synergy, even if substances are well known and studied.</p><p>I'm 20 years old male,75 kg. weight, well experienced with varios types of legal and illegal substances.</p><p>Once I and my friend S had a rough weekend on methamphetamine, its important to mention that she is prescribed paroxetine because of depressive states. Last ethamphetamine ingestion was at 10 am in the morning on Sunday, of course I didn't slept the whole day, and had some disturbed sleep in the night.</p><p>The problem was my university class was early in the morning, and at 7am. On Monday I decided to take 800mg of piracetam and 20mg. of paroxetine to deal with the-day-after hangover. Approximately at 8.30 am I felt a little nauseated, twenty minutes later I felt really fucked up, my vision was sharped and kind of blurry, my hands were shaking really bad, I was covered with cold sweat and shivering. I tried to throw up, but I couldn't. Worst of all was causeless anxiety, like when I have too much caffeine, but much-much worse. Feeling between something is wrong and something REALLY bad is going to happen. I called my friend S and ask if she experienced something like that (she had taken only 20mg. of paroxetine without taking piracetam or any other medication) and she assured that she felt perfectly normal, and has absolutely no any unpleasant reactions, even doesnt felt normal methamphetamine hangover. Id reached home at 11am, fall asleep and slept  till the next morning. Felt much better, but still had that stuff with my vision. Next day (Wednesday) I felt perfectly normal.</p><p>A week later Id asked my friend S to take same amount of piracetam and paroxetine, without taking any other legal or illegal substances during the last week (maybe except some tea and coffee on a daily basis), and she experienced EXACTLY same reactions,  with less anxiety reaction.</p><p>It was awful experience, but Ive learned my lesson.</p>",
 "year": "2008",
 "id": "74852",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-03-06T08:00:00.000Z",
 "views": "11250"
}
