{
 "id": 749,
 "title": "Well Worth It",
 "date": {
  "submission": "2000-10-16T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sir Tripalot",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "7 nuts",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "I have recently taken nutmeg a few times.  I have eaten it raw, after grinding.  I have also made tea, and boiled it in milk (following various recipes I have seen on this site).",
  "The best preparation method for me was to grind about eight nuts (start with a smaller amount, and note that I am about 210 lbs).  I then put it into a measuring cup and filled the cup up to 2 dl of milk.  After stirring it to mix it into the milk a bit, I put it on the stove and slowly bring it to a very soft boil.  I use an electric stove and watch it carefully, as others recommended not to let it burn at all. ",
  "As it heats up, you can see what appears to be the nutmeg oil being released into the milk.  I assume that it is this oil that gives the high.  I let it simmer just at the soft boil for about a half-hour. The idea is to let some of the milk evaporate or steam off.  I would imagine that cooking it a little longer would likely increase its potency, so experiment a bit. ",
  "When it's done, I pour the whole thing back into the measuring cup and add enough fresh milk to bring it back up to the 2 dl mark.  You can add more milk if you like, because the milk is only to cool off the mixture and cut the strong taste. ",
  "I then chug down the whole mixture, usually without too much trouble.  It's the last swallow that is the hardest, because it's loaded with nutmeg, but occasionally one must suffer to get a buzz. You can also put some honey or suger in it.  Try hot chocolate, or whatever you like.  Have some water or a soda nearby to flush it down.  Your throat may feel a little numb by the time you're done ingesting the goop.",
  "My experiences have all been positive.  It takes about an hour or maybe two for the noticable buzz to take effect.  Then a very pleasant pot-like state came over me, and it lasted for several hours.  I found that the next day or two was pretty cool too.  I liked the mild feeling of disorentiation.  Be sure that you don't have to do anything like give a speech or participate in important meetings.  I have a wife and three kids, none of whom knew that I was taking the nutmeg for a high (they thought it was a potpourri kind of thing for clearing a headcold, which it also does while it's boiling). ",
  "Give it a whirl, but as with all drugs legal and otherwise, start with a small dose and do it a few times to get comfortable with it.  I had long heard about the nutmeg high, but had never really tried it.  I intend to try some of the other interesting ingestion methods too.  I see Nutmeg as yet another of nature's gifts. Peace."
 ],
 "erowid": {
  "id": "1195",
  "citation": " Sir Tripalot. \"Well Worth It: experience with Nutmeg (ID 1195)\". Erowid.org. Oct 16, 2000. erowid.org/exp/1195",
  "substance": "Nutmeg",
  "views": "51857"
 }
}
