{
 "title": "Long Term Effects of Prescription Speed",
 "author": "Mindbodysoul",
 "citation": " Mindbodysoul. \"Long Term Effects of Prescription Speed: experience with Amphetamine (Adderall) (ID 7505)\". Erowid.org. Jun 27, 2001. erowid.org/exp/7505",
 "substance": "Amphetamine (Adderall)",
 "bodyweight": "145 lb",
 "report": "<p>I am twenty three years old and had been using prescription Adderall fairly responsibly for the last 4 years.</p><p>The first two years were a dream. All of a sudden, i was able to accomplish everything i set out to do. I was just as motivated to do the dishes as i was to go out and party. Talking became easier, being out in social situations wasn't stressfull anymore, I lost weight, looked and felt better and when it came to work or school i just kicked ass. I felt so happy and in control all the time. After taking a pill, i would wait and when i started to feel the heart palpitations and sweating that signal the drug is kicking in i would want to begin dancing for joy. I knew the next few hours of my life would be good, productive ones. The come down period wasn't too bad and i ended up graduating school early. I had found the personality i had always wanted to have and it came in a little pinkish-orange pill.</p><p>Fast forward to a few months ago....every time i took my 20 mgs i would wait for that euphoria, that sense of empowerment to kick in and it wouldn't. I knew how potent Adderall was. I knew that for all intents and purposes this was a powerful amphetamine that i had been taking on a regular basis for the last 3 1/2 years so i was very wary of upping the dosage. I could already feel the effects long term use of speed was having on my body, my poor insides were being abused and my heart had probably beat as many times as a 90 year olds. Other bad things were happening too, i had been gaining the weight I lost back and then some. Speed makes you wanna smoke cigarettes and that was fine except now i felt nauseous every time i lit one up. I would take the Adderall and still feel tired, unfocused, pissed off. Basically, Adderall stopped working for me and now i am screwed because as much as i tried to keep from becoming addicted i probably am still a little physically addicted and i know i am extremely psychologically addicted. I am now in the worst place a drug can take you: when i take Adderall i feel like shit and when i don't i feel like shit. Now i just need to figure out where to go from here....</p>",
 "year": "2001",
 "id": "7505",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-06-27T07:00:00.000Z",
 "views": "71690",
 "dose": {}
}
