{
 "id": 7508,
 "title": "Pastures & Blue Sky",
 "date": {
  "submission": "2007-10-23T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "P-girl",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "MY THOUGHTS:",
  "- use a sitter (can't stress this enough)",
  "- ask sitter to hold bong for you (and lighter)",
  "- take one hit and wait at least 30 seconds before hitting again",
  "- no tv ... ambient music or no music",
  "- a COMFORTABLE, FAMILIAR setting where you won't feel threatened or nervous... or under a time constraint",
  "MY EXPERIENCE:",
  "- No other drugs involved",
  "- Sitter = my boyfriend",
  "- Location = my home / on my couch",
  "- Music = Brian Eno / Ambient 2",
  "My sitter held the bong for me, something I requested after hearing various reports from friends familiar w/ Salvia.  I took one hit -- tasted very green, plantlike, a little bitter -- held for about 15 seconds.  I specifically remember my sitter holding the bong out for a second hit and thinking 'I shouldn't do another one'... not because I was tripping, but because I figured I probably didn't need it, I'm a light-weight.",
  "The trip: most of the my experience I really believe I blocked out -- or blacked out.  From what I remember, I 'woke up' in rolling pastures, under blue skies and a hot sun... looking at a farmhouse in the distance.  It felt like heaven, really... just a little bit too hot.",
  "And then I was jerked into another dimension by voices; one my mom and one my sitter.  I think I heard 'you're ok...' or similar.  My mind tried to make sense of the situation and I deduced that I must have fainted, fallen on the floor and my mom/sitter were waking me up.  I was certain it was a different time and place.",
  "As I 'woke up' (again), the couch and the air conditioner on the wall behind it were the prominent colors / textures and they were almost being duplicated on an axis around me... think kaleidescope.  I noticed that the color of the couch was the color of the pasture... and the shadowed air conditioner was like the farmhouse.  They were kind of spinning and blurry but over a short time slowed and came into focus.",
  "I started to regain a sense of reality and 'come down' at this point... I saw my sitter and thought to myself 'I'm just tripping, it's ok.'  I really felt 'real' again when I was conscious of my body temperature: I was sweating.  I think I said something like 'Whoa, shit... I'm way too hot' and got up to turn on the a/c & fan.  I stumbled a bit... like being tipsy.",
  "MY SITTER'S ACCOUNT:3",
  "Basically my sitter told me that my hands were twitching after halfway through hit 3, I got very sweaty, my eyes were wide and I was mumbling 'Oh my god' or 'Holy shit' over and over... and then he said I was trying to communicate with him but was slurring.  He worried that I would freak about not being able to communicate clearly but later said it didn't seem to bother me that much.  He also said he wasn't sure if he should touch me while I was upset... and instead kind of cooed and told me 'everything's ok.'",
  "My immediate reaction after coming down was 'I don't think I'll ever do that again.'  But I have to say, now that I have an idea what it's about and how strong it is, I'd like to explore again.  After all, it did feel like heaven for a little while and I'd like to re-visit that place.  I'd also like to remember or re-experience the come-up since I have absolutely no memory of it.",
  "I recommend this drug only to people who have done a psychadelic in the past... these Salvia experiences all seem to stress the same important point:",
  "Salvia is a drug that should be respected and used in the appropriate setting for exploration of consciousness.  If you are not a particularly introspective person, this may not be your drug of choice... and it is NOT a party drug.",
  "Good luck and enjoy responsibly."
 ],
 "erowid": {
  "id": "46251",
  "citation": " P-girl. \"Pastures & Blue Sky: experience with Salvia divinorum (ID 46251)\". Erowid.org. Oct 23, 2007. erowid.org/exp/46251",
  "substance": "Salvia divinorum",
  "views": "2847"
 }
}
