{
 "title": "Reality Bubble",
 "author": "Xanthine",
 "citation": " Xanthine. \"Reality Bubble: experience with Caffeine (ID 7509)\". Erowid.org. Mar 31, 2003. erowid.org/exp/7509",
 "substance": "Caffeine",
 "bodyweight": "",
 "report": "<p>I thought I'd drop this note about a caffeine related hallucination(?) I had a few years ago.</p><p>Myself and my best friend, A, Used to regularly get a bit spaced out on caffeine and generally run around doing silly things. As I had an espresso machine, we used to go back to mine and have a few double espressos. There's probably still a couple of head prints in the upstairs ceiling at that place...</p><p>One evening we decided to camp out in A's conservatory and stay up all night to listen to the tribal gathering on the radio (Tribal dance music stuff -- pretty cool). It was very much a spur of the moment decision, as most of them were. We decided that in order to stay up all night we'd have a bit more coffee than usual and eventually thought 'What the hell' and took a couple of pro plus (caffeine pills) as well. Sat in the conservatory, we were talking about garbage (as we often do) listening to the radio when A went to get a drink and left me for a few minutes. I was just sat listening to the radio, feeling the beat of the music when suddenly it hit me.</p><p>We sat with the conservatory blinds drawn and I couldn't see anything from where I was sitting other than the interior of the conservatory. I grew convinced that there was nothing outside. Nothing at all. The universe ended on the other side of the blinds. Although this sounds scary I felt completely indifferent to it. I just sat there, staring at the edge of reality while the music filled my mind. In fact, I felt quite content with my tiny universe. Suddenly A came back with a couple of cups of tea and I woke from this weird trance. It had seemed like he was gone hours, but he'd only really been gone about 5 minutes. We laughed at my little 'panic attack' if you can call it that, although I was still feeling mildly paranoid. I wouldn't regard it as a bad experience. It was interesting. Very surreal.</p><p>I've had a few similar experiences and even a couple of mild visual distortions since (only from ridiculously high doses) but this was my first. Caffeine trips are almost always fun and I find that my more random thoughts can be quite inspirational. I've written lyrics and even whole songs while spaced on caffeine before.</p><p>Thanx for letting me share,</p><p>Take it easy.</p>",
 "year": "2001",
 "id": "7509",
 "gender": "Male",
 "timestamp": "2003-03-31T08:00:00.000Z",
 "views": "29817",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 ]
}
