{
 "title": "Not Invited to the Party",
 "author": "Jana",
 "citation": " Jana. \"Not Invited to the Party: experience with MDMA & Cannabis (ID 75135)\". Erowid.org. Nov 25, 2012. erowid.org/exp/75135",
 "substance": "MDMA & Cannabis",
 "bodyweight": "230 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Cannabis",
  "(cookie / food)",
  "",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)",
  "",
  " ",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>A friend of mine from my old hometown was visiting for the weekend and wanted to smoke some pot with me. We went over to another friend's house with the intention of having an awesome time.</p><p>I began the night by eating a brownie with a low dose of pot in it. The effects of this began to kick in after a while, making me very giggly and silly. While experiencing the onset of the effects of pot, I decided to try ecstacy for the first time. A friend of mine had been suggesting it for a while for me, but I had not yet had an opportunity to try it out. So I took a 100mg pill of what was probably mostly pure E. About 15 minutes later, my friend wanted to go out into the backyard and smoke some pot, as that's what we had come here to do. I had never smoked a bong before, so I went out to join her.  We all sat outside in the back porch and smoked the bong for a bit.</p><p>I began to come up on the e just as we finished the bong. My friend has some pretty color-changing LEDs strung up around her place, including some behind her TV. As I began to come up, I noticed these lights out of the corner of my eye and was struck with how surprisingly pretty they were. As each color came fully into itself, it looked like there was this delicious gem sitting right there in my vision. I told my companions that I was really liking those lights.</p><p>Then I started to see everything around me as pretty. The sky, the fence, the bong, the people. I told my friends all of this, sharing how beautiful the experience was.  They laughed and told me to get inside as I was coming up on the e. This distressed me a little, because I felt like I was in the absolute perfect spot where I was. I didn't want to move! But they managed to coax me inside with a bit more prompting.</p><p>Upon going inside the house, I began to feel very strange. I walked into the kitchen and started to giggle madly. Everything was really pretty and interesting! The toaster! The microwave! The refrigerator! The sensations were overwhelming, and I began to collapse onto the floor into a ball of insane giggling madness. I began to flop around as I experienced the sheer joy of everything around me, just laughing and making silly animal noises about it all.</p><p>At least, that's what I figure I was feeling. As I entered the kitchen and started to giggle like this, I experienced an incredible amount of dissociation, to the point where I felt like I was standing over my body watching it flail about on the floor in what appeared to be pure bliss. I myself was feeling absolutely nothing except boredom. I wanted to go and talk to my friends or do something else. I really was bored of the floor. But my body stayed on the floor, just writhing and laughing. It was like my body was having a party, and I wasn't invited.</p><p>I don't know how long that lasted, but after a while, I finally seemed to get control and went to go hang out in the living room with everyone. Although I was beaming and laughing a lot, still, I really didn't feel all that happy. I felt completely emotionless, actually. And again, bored.</p><p>A little while later in the evening, I was sitting talking to my friend who was visiting from out of town. I was holding her hand and gently caressing it, and then noticed how wonderful that felt. Then I started to rub my cheek on her arm and then slowly began to move towards making out with her. She stopped me and reminded me that she had a boyfriend.</p><p>This stunned me. Although I'm bisexual and polyamorous, I don't date women that are already in monogamous relationships. And furthermore, I don't hit on people that are very clearly my platonic friends. I recoiled from her and was very upset for the rest of the night. I felt that I had lost control of myself to such a degree that I was violating my own personal boundaries. It was very unpleasant. I spent the rest of the night in high-analysis mode, trying to make sure that I was watching both my boundaries and the boundaries of other people. This did not help with the dissociation, as I felt even further away from my emotions now.</p><p>This continued for most of the night. I basically just felt totally disconnected. I was aware, on some abstract level, that my body was experiencing some sort of extreme bliss, but I was completely disconnected from it the entire night. All my conversations, sensations, and experiences were being experienced by someone else, and I was completely jealous of that person. I was bored out of my mind. I wanted to go play a video game or read a book or something like that. I wanted to actually do something instead of just looking around at everything making happy noises. I suspect that this was a result of mixing the pot and the e, as later experiences with e were much much different.</p><p>The experience did not actually become truly pleasant for me until much later in the evening, once the effects of the pot started to wear off. As I started to get the munchies, I was offered some tater tots. They tasted like the best tater tots I have ever eaten. I was loudly extolling their virtues to all assembled as I hungrily ate into them.</p><p>The next day, I was still feeling some of the effects of e while I left my friend's house to go on a date with my boyfriend. Touching him was an absolutely exquisite sensation, and I could hardly keep my hands off of him. I also found that talking to him was a lot easier than normal.</p><p>Even the day after that, I was still experiencing some sort of afterglow. As I was walking to work, I was dancing and twirling in the breeze, looking at all the trees that I was walking past and just loving every moment of the experience of walking.</p><p>In conclusion, I really enjoyed the e, but not when combined with pot. I won't be doing those together again.</p>",
 "year": "2008",
 "id": "75135",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2012-11-25T08:00:00.000Z",
 "views": "1276",
 "dose": {}
}
