{
 "title": "Want to Try Again",
 "author": "psionic",
 "citation": " psionic. \"Want to Try Again: experience with Mushrooms & Cannabis (ID 7519)\". Erowid.org. Mar 31, 2003. erowid.org/exp/7519",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "105 lb",
 "report": "<p>Well, it was a nice weekend in sunny May and me and my friend decided we wanted to try shrooms. So my friend ('R') got about an 1/8th of shrooms and a gram of weed. We went to his house at about 6:30pm and smoked a bowl or so of weed. We sat down for a while, and watched TV. About an hour later, we decided to eat some shrooms. At first only R was going to eat them but I said screw it, and ate some. It was a while before the effects hit (maybe 1/2 hour), I don't know if it was the weed or not (I only smoked it for anti-nausea purposes) but I started feeling really slow and screwed up.</p><p>We watched TV for a while longer, and went downstairs (where his mom was) to get a couple ice cream floats. We tried talking, didn't work well, and I shook hands with his mom's friend, and I somehow introduced myself. We got our floats and somehow made it back up to the attic. We kept watching TV and eating our floats. I had a spoon with my float, and when I stuck it in my mouth I felt like I could stick it all around in my mouth and it felt cool.</p><p>I think we watched ST: Voyager and maybe Stargate but I don't remember.</p><p>Well, after watching a trippy episode of Voyager, we ate more shrooms.  I think this was around 9pm. We tried smoking more weed, and this worked to an extent because we could still handle the pipe. The only problem was that when I had to dump the ashes of the weed out the window, I had to hold the window open and knock the pipe against the roof. Too bad I couldn't do it by myself. So I got R to help me and it really was a sad sight, two completely baked guys trying to dump out a pipe out a small window....</p><p>So anyways, we spent most of the night watching TV on beanbag chairs. Sometimes when I watched TV, I stopped watching the show and I had really depressing thoughts about my future and the path that drugs were leading me down, and just odd thoughts about my life. Also the wall had weird wallpaper with patterns, and if I looked at it weird I could see people, sometimes Indians sitting in front of teepees and stuff like that. When I stood by the window, there was a inflated alien strung from the light. When I looked at it from below, it looked like one of those views when the camera moves around something in the Matrix or whatever.</p><p>Well anyway, I didn't really trip out heavily, just felt really messed up the whole night. I watched TV in a intoxicated stupor till 5am then fell asleep. The next day we were kinda depressed and walked around aimlessly.</p><p>So basically the moral of the story is I'd like to try maybe a whole 1/8 to myself sometime, but this time I know kinda what's coming so I won't freak out. And also less weed so I can feel *just* the shrooms cause I think sometimes we were twitching and stuff and I do that sometimes just on weed.</p>",
 "year": "2001",
 "id": "7519",
 "gender": "Male",
 "timestamp": "2003-03-31T08:00:00.000Z",
 "views": "7060",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "1.77 g",
   "administration": "oral",
   "substance": "Mushrooms"
  },
  "2": {
   "time": " T+ 2:05",
   "amount": " ",
   "administration": "oral",
   "substance": "Mushrooms"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
