{
 "title": "An Unstable Mind",
 "author": "XSL",
 "citation": " XSL. \"An Unstable Mind: experience with LSD (ID 752)\". Erowid.org. Oct 9, 2000. erowid.org/exp/752",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>As a person prone to extreme behaviors and depressed states, it was a bad idea for me to expirement with LSD.  Nevertheless, having grown bored with Marijauna after 2 or 3 months, the only other drugs available were acid and heavier substances such as cocaine and opium which I had no interest in.  2 years later, I have come to decide that LSD is in some ways one of the strongest substances available, but at the time I was unaware.  I had done acid a few times prior to the one I am about to describe, but only at very low, purely 'recreational' doses.</p><p>Set and setting are key, and so by dropping acid before class, I was setting myself up to fail in many ways, but I did not know any of this at the time.  I swallowed 3 'hits' of acid about 4 hours before I had to go back home.  ABout 40 minutes later, I became aware of a sensation of reality 'swimming' around me.  Anywhere that I looked, the walls would buckle and breathe, swelling and bulging, and any surface that I observed that was broken into small pieces (IE, carpets, TV static, gravel, etc.) were textured with pictures, images straight from my subconcious, almost exclusivly faces. </p><p>My whole body felt alive in a way that I had not before expirenced.  I had an extremely diffacult time keeping exactly what I was supposed to be doing in focus, and I became convinced that I had done something horribly wrong.  I then became aware of 3 levels of error:  peers, family, and the law.  I was totally convinced that everyone around me must know that I was tripping, and hiding this fact became my primary goal.  Everyone who passed me seemed to be looking at me, looking down on me.  At this point the visual and audial distortions were no longer 'fun' or 'interesting'; the psychological barrier that let me keep everything in focus was gone and I just wanted to come down.  Somehow, I managed to get home, (although someone had to remind me which stop to get off at: the visual stimulus of traveling in a vehicle at 35MPH was too much and I went into some kind of trance state that I barely remember) and I remember feeling like I was going to vomit.  I didn't though, and I went into my house and lay on my bed, closed my eyes but instead of seeing the normal blotchy-black, I saw brillent geometeric patterns that cascaded and grew until I saw a sheet or pure blinding white, and on some level I realized the drug's effects had reached their peak. </p><p>I ran outside, blinding into the woods, and felt that I was the One and Only:  all external stimulus was being interpreted as a manifestation of internal forces:  it wasn't that I was at one with the universe, I WAS the universe.  This was a terrifying proposition which faded almost immediately, and then I realized I was just a player in the game of life, a game that I suddenly decided was very much worth playing, and I became convinced I had forfeited, that I was going to die.  This also faded, and then I was aware that I was me, and that I had taken LSD, and that this was a terrible thing that I was going to be punished for.  I started to come up with excuses, ways I could fool the authorities, and then I went insider and collapsed in shame.  For some reason I called my mother and told her that I was on LSD.... my parents were products of the 60's, and she knew how to deal with the situation, made me realize that it was just a drug and that it was going to wear off.</p><p>Nevertheless, it was a harrowing, unpleasent expirence.  It was mind-blowing enough that I saw the creative, constructive, enlightening potential of the drug, but it had none of these effects on me.  All in all, I would say that LSD can be wonderful (this was neither my first nor my last expirence with it, only the most intense) but it was not for me.  As anyone who knows anything about psychadelics would also say, if you're going to trip, make sure the setting is appropriate, have a clear mind beforehand as any residual negative emotions are likely to be intensified, and never trip alone.</p>",
 "year": "2000",
 "id": "752",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-10-09T07:00:00.000Z",
 "views": "7193",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
