{
 "title": "Content to do Nothing!",
 "author": "Sweatyb",
 "citation": " Sweatyb. \"Content to do Nothing!: experience with Poppy Tea (ID 7522)\". Erowid.org. Jun 25, 2001. erowid.org/exp/7522",
 "substance": "Poppy Tea",
 "bodyweight": "190 lb",
 "report": "<p> A couple of nights ago I tried my first batch of poppy tea. The poppies were called Persian Gold Variety I believe. They ranged in size from a large walnut to about the size of a tennis ball. I was surprised at how big they were. They ranged in color from a light creme to dark brown/black. The lighter colored pods were more pliable and seemed fresher, while, the darker ones were much drier (possibly burned from kiln drying?) and easily crumbled.</p><p>I used 7 large pods for the brew. After passing them through the cofee grinder I had about 10 grams of poppy powder. I brought 2 1/2 cups of water to a boil, dumped the powder in and immediately removed the pot from the flame to let the brew 'steep'. I let the tea steep for 10-12 minutes occassionally stirring the mixture with a wooden spoon. I then passed the brew through a metal strainer seperating the liquid from the poppy sludge. I made sure to squueze the sludge dry of all the liquid I could with the back of the spoon.</p><p> The time was 5:00PM and the tea was imbibed over the next ten minutes, the taste was pretty nasty but bearable. Next time I'll try dress it up with some honey or sugar. I first started to feel some effects at the 20 minute point. They came in the form of a nice warm body relaxation an mental realxation typcal of opiates. I was watching T.V. and was extremely content to just sit there and do nothing but enjoy the warm flush. (NOTE: I am a person with little or no opiate tolerance I did use 30 percocets for achillies tendon surgery about 1 1/2 months ago, but, nothing since then.)</p><p> At about the one hour point the effects grew in intensity to about two 5mg percocts. I was very relaxed with that all over warm body buzz and euphoria. Very nice! I did experience some slight stomach cramping but no naseau. The intensity seemed to level off at the three hour point at that same 2-3 percocet high. I had a little difficulty urinating at the 3 1/2 hr, point. Had to stand there for a minute or two longer before things started to flow!</p><p> Things were still going quite nicely at 9:00PM (T+4). But, I could tell I was beginning to come down. I stayed up until about 11:00pm (T+6) and was pretty  much baseline and feeling pretty washed out and tired so I climbed into be thinking I would drift off with no problems. Only I couldn't fall asleep! I tossed and turned all night in and out of half awake dreams. I was also ithcing all over like a bastard. The itching acually was sort of enjoyable in a weird way. I don't know if I acually ever fell asleep that night. Luckily I had no plans the next day because I felt very tired and unmotivated for the majority of it. I layed on the couch falling in and out of conciussness the whole day and slept like a baby that night.</p><p>Aftermath:</p><p>This was a very enjoyable experience if you like the opiate/painkiller high. There was very little physical discomfort except for a little stomach cramping and extreme , but, enjoyable itchiness. I also had sweaty plams for a while which wasn't even a discomfort.</p><p>I would reccommend drinking the tea early in the afternoon or even in the morning due to the difficuly getting to sleep. Next time I plan on trying 10-12 pods which would be equivelant to about 15 grams of the powder. I think it will be quite a dream!</p>",
 "year": "2001",
 "id": "7522",
 "gender": "Male",
 "timestamp": "2001-06-25T07:00:00.000Z",
 "views": "41851",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Poppies - Opium",
   "form": "(tea)"
  }
 ]
}
