{
 "id": 7524,
 "title": "Cured My Alcoholism",
 "date": {
  "submission": "2007-10-03T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sadskills1987",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "From april 04 through january 05, I experienced a heavy period of alcoholism which climaxed with large scale abuse of pure everclear which left me unable to stop for more than a day or two without being hostile, flustered, incredibly shaky and feeling like my head was crushed with a sledgehammer. These effects would continue for approximately two weeks after they began before beginning to subside. Some say that the anti-anxiety med (effexor) I am rx'ed made it worse, and I wouldn't be surprised if it did.",
  "Anyway, a friend of mine was horrified by the effects of ritalin psychosis, so he gave me his ritalin. I crushed them up and blew some in hope that it would offer some escape from the withdrawal. Upon insufflation, many of the psychological effects that plagued me were greatly dulled to a functionable level. I was safe to drive again, I could think, I wasn't hostile, the headache felt more like a normal hammer than a sledgehammer. I was a human being again, no longer an animal fed by alcohol's hand.",
  "I kept at medicinal doses until the alcohol's effects had subsided enough that I could deal with them, and when this time came, I quit the ritalin without a hint of trouble and lived life again. I hope that anyone else who reaches the state I did can benefit from this and recover without relapse."
 ],
 "erowid": {
  "id": "46346",
  "citation": " Sadskills1987. \"Cured My Alcoholism: experience with Methylphenidate (Ritalin) (ID 46346)\". Erowid.org. Oct 3, 2007. erowid.org/exp/46346",
  "substance": "Methylphenidate (Ritalin)",
  "views": "10651"
 }
}
