{
 "title": "Psychedelic Entree",
 "author": "Mr. Scientist",
 "citation": " Mr. Scientist. \"Psychedelic Entree: experience with 2C-E (ID 75314)\". Erowid.org. Feb 16, 2010. erowid.org/exp/75314",
 "substance": "2C-E",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "15 mg",
  "oral",
  "2C-E",
  "(powder / crystals)"
 ],
 "report": "<p>This is a report for 3 separate trials with 2C-E.</p><p>10mg: the first trial was done with a friend of mine at the local beach/woods. I believe that a better reference point for comparison, for those of you who have done them, is mushrooms, rather than LSD. The visuals were similar to maybe 2g of cubensis mushrooms, but there were practically no mental effects, and for me (but not my friend), more nausea than mushrooms. It should be noted that I drank the night before and that may have contributed to the nausea. Pepto Bismol helped to alleviate it.</p><p>So mild were the mental effects that we sometimes forgot we were on the drug at all, especially if we were not in a visually rich area and/or not focused on looking at our surroundings.</p><p>There was a definite stimulating effect, with easy flowing conversation and an inability to go to sleep until t+10.</p><p>15mg: more pronounced body high, with a slight feeling of dissociation, but still no real 'mental' effects. Getting away from the city and sober people didn't seem to be necessary (as it tends to be for LSD and mushrooms for me...), as later in the trip we socialized with sober friends and had an easy and good time of it. I noticed a slight empathogenic quality at that point. Had nausea again, but had drank the night before this time as well.</p><p>25mg: strong visual effects, still no mental effects, at one point when walking I felt like I was floating, so there was a definite body high. First time I've experienced tracers. Visuals like mushrooms, things take on a glowy, breathing quality. Music is slightly nicer. No nausea, probably since I hadn't drank the night before this time. The come up was very stimulating and I couldn't remain motionless.</p><p>Overall, if LSD or mushrooms is the full course meal, 2C-E is like a psychedelic entree. I get some of the experience, but not all of it. This is my first experience with a phenethylamine, and perhaps they all have much milder mental effects than the tryptamines? However, that doesn't mean 2C-E isn't useful, just that perhaps it should be done in a different context. Socializing is a lot easier on it, and a large group experience might be in order.</p><p>Personally, I prefer the full-course meal of LSD and will probably not seek out 2C-E again.</p><p>Finally, it should be said that I had a slight change in bowel movements the day after; 2C-E might have a slight laxative effect.</p>",
 "year": "2008",
 "id": "75314",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-02-16T08:00:00.000Z",
 "views": "3007",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 }
}
