{
 "title": "Once in a Lifetime",
 "author": "Fortysixandtwo",
 "citation": " Fortysixandtwo. \"Once in a Lifetime: experience with DOC (ID 75326)\". Erowid.org. Sep 22, 2010. erowid.org/exp/75326",
 "substance": "DOC",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "DOC",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2008",
   "75326",
   "Male",
   "",
   "Not Given",
   "Sep 22, 2010",
   "6146",
   " "
  ]
 ],
 "report": "<p>Until about a month ago, I had only heard of the hallucinogen known as DOC. Never would I have guessed that I would actually have an opportunity to try it, because obtaining it isn't exactly cake. When one of my buddies told me that he had a chance to pick up enough DOC for the both of us, I was unsure if it was really something I wanted to try. Even after researching it until I was satisfied, it was hard to compare reports of its effects to other psychoactive drugs I've gotten my hands on such as acid, shrooms, LSA, ect. But being me, I decided to give it a go.</p><p>Each dose of this stuff came in powder form, about the same quantity as a very small bump of coke. The stuff tasted pretty much like everything you shouldn't be putting inside yourself - chemical-esque and bitter. I read that the come on for DOC could take up to two hours, alot longer than acid or shrooms. After we dosed, we each had some things to do before we started the trip, and decided to meet up in about 1.5 hours.</p><p>I noticed that I started feeling different after those 1.5 hours, and got a pretty funny phone call from my friend right before we met up. Basically he was starting to come up to, so I ran back to my dorm to meet up with him. Our trip setting was difficult-at times there were lots of people around us who weren't tripping, so we moved around alot. The come on for this shit is unlike alot of other hallucinogens. Its almost hard to explain. Instead of feeling happy I was extremely nervous which is unusual of me on the come up of a trip. The first thing I noticed most was that my coordination was a little off and my heart was pounding from the amphetamine. I almost felt like I was coming up on DXM, but not as strong. I told myself the paranoia and nervousness was probably from the amphetamine part of the drug, and after about another hour I started to relax. At about 3 hours after dining the DOC I was slowly losing control of my thoughts in a complete mindfuck, as the visuals were getting stronger and stronger. I could hardly see the color in my eyes.</p><p>The visuals were very different from shrooms, but somewhat similar to acid. I could compare the visuals similar to taking 5-6 hits of good acid, but the way my brain was working it felt like I had taken a 10 strip. Walls were alive, the posters on them even more. Some of the most subtle things I saw out of the corner of my eye were almost scary. It also seemed to give rooms and different areas a 'themed' tint; the most abundant colors would rub off into the air. For me, lots of things seemed green. That was something that was very different from acid, along with the fact that the trip wasn't always happy. At times I had extreme difficulty comprehending what was even happening; I couldn't distinguish up from down. Noise seemed louder, like it was all rushing in at once through my ears and blurring together. The drug had a much more chemical trip/feel to it, if that makes sense.</p><p>Overall, the visuals lasted strong for about 10 hours, but I was fucked up for half of the next day. At times it was difficult. I'm glad I had the experience of trying it, because I'll probably never see it again. But even if I had the choice of doing it again I don't think I would, I'll stick to dropping tabs.</p>"
}
