{
 "title": "Near Orgasmic Bliss",
 "author": "Tricky",
 "citation": " Tricky. \"Near Orgasmic Bliss: experience with 4-Acetoxy-MiPT (originally believed to be 4-Acetoxy-DiPT) (ID 75353)\". Erowid.org. May 15, 2009. erowid.org/exp/75353",
 "substance": "4-Acetoxy-MiPT (originally believed to be 4-Acetoxy-DiPT)",
 "bodyweight": "86 kg",
 "report": "<p>32mg +20mg 4-aco-mipt [Editor's Note: at the time of ingestion, the author believed the substance to be 4-AcO-DiPT, see Follow-Up Note at the end of the report.]</p><p>35 Year old male 86kg </p><p>Religion: Neo Pagan- Wicca</p><p>Meds: None</p><p>Alternative Meds: 333mg St Johns Wort (standardised extract 1000mcg hypercin), Vitamin tablet (100% RDA of all major Vitamins, plus some minerals), Fish oils 600mg (All taken daily, AM)</p><p>Previous experience: Including the following, LSD, Mushrooms (liberty cap), 2c-x of various types, others including unknown pills, mdma, various amphetamines and 4-aco-dipt.</p><p>Reasons: Trying out higher dose of this substance, previously taken in doses up to 20mg, where it showed promise.</p><p>Set & setting: Excited about the experience, looking forward to this.  Comfortable location, that is quiet and peaceful. No chance of being disturbed. Laptop computer, music library, and headphones available. Laptop will be used to take notes, either via microphone, or typed. No one else present, but telephone, and trip aborting meds at hand. </p><p>Preparation: Fasted for 9 hours prior to first dose. Meditated, and performed cleaning ritual (showered, burned incense etc) to remove negativity.</p><p>Drug identification: Certificate of analysis was provided with the substance indicating >98% 4-aco-dipt, method unknown at this time. The powder was measured on a laboratory scale, +/- 0.1mg accuracy. The powder was dissolved in distilled water to give a concentration of 10mg per ml. Doses where then measured using a calibrated measuring pipette. The combined accuracy should be (much) better than +/- 1mg.</p><p>Note: Audio notes are prefixed with (a)</p><p>T+0:00 22mg 4-aco-dipt taken in liquid (water) very revolting taste noted</p><p>T+0:30 maybe first warning of something? +- Not sure yet, feels ok, so will top up dose.</p><p>T+0:38 another 10mg dissolved in water. Cant get over the vile taste of this chemical, it is disgusting. Looks like full steam ahead for a strong experience.</p><p>T+0:45 Tingling and strong body feel, things are underway, +</p><p>T+0:57 Intense! ++ very very quickly, body tremors slight, but interesting, they seem to bounce round my limbs like ripples on a pond. Overall the feeling is pleasant.</p><p>(a)T+1:30 Got into listening to music for a bit there, and got lost in it. Time has gone all out of whack. It all happened so fast, 3+ for sure.</p><p>(a)T+4:00 The above is nothing, the effect intensified, up to this point. People consider having sex on this compound, Id possibly die from the sheer ecstasy, its good enough as it is. Could this be verging on ++++?</p><p>(a)In fact what the hell was that? Im almost glad its over, it felt like more than anyone should be allowed to feel. Pure, next step infinity.</p><p>T+4:30 plenty of OEV now, CEV is a landscape of shifting colours. Little detail on the closed eye stuff, but the keyboard is quite happy to dance and jiggle? I have a surprisingly clear head at this point, taking these notes is, however hard work.</p><p>(a)Now I want back in to what went before, even though I thought it might be the end of me (or the beginning?). In fact it is quite disappointing, though I have genuine fear that something bad(?) would have happened if it had gone on much longer.</p><p>(a)I have decided the only way to describe the experience above (T+4:00) would be to use the whole universe and every tiny thing in it, all in minute detail, and even then?</p><p>T+5:00 Slightly lower intensity as above, OEV ripples and squares, sometimes roots and / or branches show up as well. Most of the body effects have gone now, mild shivers from time to time.</p><p>T+5:30 Apparently re-dosing works to extend trip, so 20mg taken in water.  Why? To see if it works, and hope to see a bit more visual stuff.</p><p>T+6:00 nice body feel, less than previous, but now wild OEV.  A lot of substances have tolerance at this stage, there appears to be none here.</p><p>(a)T+6:30 This stuff hits hard, and fast.</p><p>(a)T+9:30 +++ from previous entry till now. CEV very intense, some of everything, from photo real images, to weird trip stuff. OEV have gone fractal or raindrop falling onto water. Also a few times the entire field of vision became pixelated and shimmered and warped, some false colours (red and blue mostly) from the edges of text and objects. Sometimes the feelings of warping extended to the body, a most bizarre sensation. Listening to Pink Floyds Saucer Full Of Secrets, with the lights off, and laptop screen off, CEV and body warping sensations are all in time with the music, this is awesome!</p><p>T+9:45 Taken time out from the music, as it was quite wearing, now quiet, and mediation / reaching inwards. This works very well, and is surprisingly easy to achieve. Quite a bit of inner stuff brought up, I may have learned a few things here.</p><p>T+10:00 Starting to tail off now, this may be the most intense, but not the longest experience so far. That is discounting the T+4:00 event, as I dont know what to make of it at all.</p><p>T+10:30 Still some effects, coming in waves. The waves arrive quickly and slowly fade to what feels like baseline, each slightly lower in intensity from the last.</p><p>T+10:45 Sleep comes reasonably easily, still some effects but that doesnt seem to cause a problem. I feel quite tired, but not uncomfortable.</p><p>Next day I feel ok, a slight hangover, but nothing particularly noteworthy. I visit friends, and they dont notice anything in particular. I have a mild headache, but it is low level, and doesnt intrude much.</p><p>In retrospect:</p><p>This was an overwhelmingly good experience. I would be happy to repeat this at the same dose, maybe a little higher. Lower doses may still be effective for inner work, and even recreation.</p><p>The onset of this substance is extremely rapid, next time I would consider eating a light meal before taking the dose. In light of the complete lack of nausea, this should not pose a problem; hopefully it will slow the onset a little.</p><p>I have gained some insight into myself from the experience, learned of some fears that where previously hidden, as well as some strengths that I had forgotten about.</p><p>Using a pipette to measure doses works very well, and is easy as setting the volume, and pressing a button.</p><p>-------------------</p><p>FOLLOW-UP EROWID EDITOR'S NOTE:</p><p>Case of mistaken identity; subsequent to the original submission of this report, the author wrote in 'The substance is incorrect, and is actually 4-aco-mipt, this was recently discovered, due to sending a sample to be tested.  This is either an error on the part of the vendor, or myself, it is impossible to say.'</p><p>No other information is provided, such as information about via what analysis method the substance was positively identified.</p>",
 "year": "2008",
 "id": "75353",
 "gender": "Male",
 "timestamp": "2009-05-15T07:00:00.000Z",
 "views": "8455",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "22 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-MiPT",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:38",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-MiPT",
   "form": "(liquid)"
  },
  {
   "time": " T+ 5:30",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-MiPT",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:00",
   "amount": "333 mg",
   "administration": "oral",
   "substance": "St. John's Wort",
   "form": "(daily)"
  }
 ]
}
