{
 "id": 7538,
 "title": "I Wrote a 5 Page Novel",
 "date": {
  "submission": "2007-06-19T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Charlee",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 ],
 "report": [
  "My knowledge on this drug was of a small proportion. Every Friday night my friends and I had a gathering, the usual teenage drunkenness, doing what we do best. At 1am or so, the party was broken up by the host's mother. I was to stay at one of my very good mates house, but instead I ditched him for a night I would never forget. As we where leaving the party my friend M said to the three of us in the car: Datura taking time.' My first reaction was no way, as I said I have little knowledge of this drug. As the good friends they are, they changed my mind within minutes.",
  "We went to one of Ms friends and made a very potent yellow tea and had twenty times of what we should have. By the way, I have never tripped before. The glass was tall and seemed forever to drink. After 20 minutes of sitting with M, A and I, A said I have to go home. He wasn't thinking straight after 16 beers and 1 large cup of Datura. M and I started our treacherous walk to the car. Within the space of 20 meters it felt as if I gained 20 kg. I told my fellow intoxicated friend how I was feeling and he agreed and we both struggled to make it up the stairs. We both had the dries like a mo fo, so we stopped for refreshments. I bought m n ms and M got a drink of lemonade. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] We drove for another 5 minutes and got to my friends Alexs house.",
  "Out of the three I was the first to trip. We stopped the car a house away and told Alex to get out. Whilst they were talking I was looking at a house lit by the moon light and I saw an old lady spinning wool. I blinked and thought fuck yeah that looks sick. As soon as I blinked and looked at her again she was standing. I told my friends and they just laughed. I was all wowed out at the fact that I was tripping. I rubbed my eyes and then she was walking towards me with cats in her hands and on her back. I turned to the person who was driving (I) and said drive man GO GO GO. They had no idea what was happening. We turned around ready to go home when we heard a let me out we said oh fuck Alex hasnt gotten out yet. He got out and ran home. We drove home got out and went to bed (this wasn't a good idea). I almost fell asleep when my friend M flicked the light on and said shu up (he couldnt say his ts). I don't think I was even talking. As soon as he turned the light off I passed out. And a few days later this is what I was told I did:",
  "1. Dropped a pair of glasses. My friend picked them up and I said don't worry, you can keep them Indiana Jones, don't worry about the price",
  "2. Looked at a photo album with no photos in it and complimenting my friends mum on how swell the photos where.",
  "3. My friends mum was asking me for the time. So, I reached into my pocket and pulled out a pocket watch, I looked confused and just put it away. (I didn't have a pocket watch.)",
  "4. My Datura takers brother was looking after me and I kept lighting a cigarette and then saying oh Im sorry Im not supposed to smoke inside. I didn't have smokes.",
  "5. Slapped the walls and laughed.",
  "6. Kept on insisting that I go home. My home is 20 kilometres away and I was going into a cupboard thinking it was the front door.",
  "7. Consistent talking to my self, and when my friends mum asked if I was ok, I just laughed at her and carried on talking.",
  "Those where only few things I did for six hours before my father came.",
  "I was found by Ms mum in the kitchen at 2 oclock in the morning with the light off talking to myself. After me entertaining them for those funny six hours she called my dad. He came and took me to the hospital. On the way I was talking about a party and saying stuff like dad did u have a wicked time there. . . . Well I did. I can't remember walking into the hospital but I do remember me keep getting in and out of my bed and walking around. I remember me talking to a little black girl and when I tried to get out she would always say no you have to stay here or youll get in trouble. I also wrote a 5 page novel, I didnt have any utensils to write it with. Then I realized that I had no paper and then said wow that was wicked. I was still holding my pen at this point in time and for some reason I threw it down. A few seconds later I wanted it back so I went looking for it. It was no where to be seen.",
  "I had my friends come in and talk to me but they just kept on going under my bed and disappearing. I went out and asked my care taker if there was a door under my bed, he looked at me and said no youre hallucinating again. I replied with an oh yeah and walked casually off to my room.",
  "When the doctor came in to measure my heart rate, he asked me to take off my tee-shirt. I didnt want to because there where two girls in my room sitting down. And I said nah I dont want to (Im a skinny little white bitch and I didnt want them to see it). He then said theres no-one in the room. I looked behind me and they where gone.",
  "So I did what the doctor asked. He put these little stickers on my chest and put wires on the ends; after he was done I asked if I could have the stickers. He replied yeah sure. I put them on my shoes. I remember me talking to my shoes. I said to my shoe man whats wrong with your face my shoe gave me an evil look and I realized that it was just the stickers making a face. I laughed and continued staring and I continued talking to them. I brushed my legs as if someone was sitting on me and I said man what are you doing, get off me.",
  "Then I think my doctor came in and asked if I wanted to watch foxtel. I said yeah sure and I walked in, sat down and flicked through the channels as fast as I could because there was nothing but sport on. Then my two good mates P and Gordo came into the room. I said oh man Ive waited so long man where have you guys been they sat down and asked how are I was. I said yeah good and we casually talked for 10 or so minutes and then we started arguing about the channels. They looked at me and walked off. I ran out to the front desk and asked if they saw two guys walk out of this room and if so, which way they went, they replied youre hallucinating again. Oh yeah I replied and walked off to my bed. They came in and said youre going to have to stay another night. I really didnt want to, like, really didnt want to. So I thought hmm play it straight. It was so hard but I kind of pulled it off, and they let me out. I remember my dad coming in but I dont remember walking out.",
  "Dad and I where on our way out of the hospital in the car, when, I started hallucinating again. I started eating noodles that werent there. I also started smoking and then I dropped the cigarette and wiped it off me. At this point my dad was like what are you doing? I apologized, oh sorry dad and for some reason I craved coffee. The strange part was that I thought it was out side of the car, so I went to pull the door open. We where driving around 130kph down the highway when my dad shouted at me. I realize what I was doing and locked the door.",
  "The day I got out it was my best friends birthday party. I wanted to go but my father wouldnt allow it. So, I made a deal and I could only go for ten minutes. On the way down I was still tripping out. I saw Dementors, you know, the ones out off Harry Potter. They where flying behind trees. I also saw old ladies in the middle of the road. I told my dad to slow down, but they just seemed to disappear a meter away from the car. I went into the party to see my friends; they asked the usual questions like are you ok.",
  "I was talking to my friend P and I saw a man behind him. I said I thought I saw someone behind you and after saying my hellos and goodbyes I left to go get some pizza. My dad left to go in and get it whilst I was still sat in the car. I looked in an antique store and there was a little ghost of a girl. She was black and white and walking towards me with a knife. I wasnt scared but more intrigued. She kept walking towards me, still starring. She walked into the car and vanished.",
  "Oh and when I was in the hospital I started eating my hand.",
  "I wouldnt take what I did back; it was a great experience also a great story. What I would take back would be me getting caught."
 ],
 "erowid": {
  "id": "46419",
  "citation": " Charlee. \"I Wrote a 5 Page Novel: experience with Datura (ID 46419)\". Erowid.org. Jun 19, 2007. erowid.org/exp/46419",
  "substance": "Datura",
  "views": "8347"
 }
}
