{
 "title": "Death and Brain Decay",
 "author": "Bancopuma",
 "citation": " Bancopuma. \"Death and Brain Decay: experience with Mushrooms - P. semilanceata & Cannabis (ID 75387)\". Erowid.org. Oct 7, 2010. erowid.org/exp/75387",
 "substance": "Mushrooms - P. semilanceata & Cannabis",
 "bodyweight": "70 kg",
 "header": [
  "DOSE:",
  "3.5 g",
  "oral",
  "Mushrooms - P. semilanceata",
  "(dried)",
  "",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Recently I had one of my deepest experiences with the mushroom.</p><p>Two close friends and myself had each ingested 3.5g of dried Liberty caps, Psilocye semilanceata. This would equate to a few hundred individual mushrooms, and was no doubt a high dose, and definitely one of the most intense mushrooms sessions I have every experienced. I have a special place for Liberty caps. They are small, but very potent, and they are our own indigenous psychedelic mushroom, harvested from the wild just a few miles away.</p><p>I consider mushrooms my number one ally, on a level of their own beyond that of any other plant and drug, the mushroom has always clicked with me in a very special way. The more Ive used them, the more respect I have for them, and to this end myself and my friends have begun to incorporate ritualised, Mazatec shamanic elements into our mushroom sessions. We lit a pure beeswax candle while preparing and ingesting our doses, and then blew Copal incense smoke over the mushrooms and ourselves before the start of the ceremony. This was the first time I have used such ceremonial methods, and from my experience it seems very beneficial to approach mushrooms in this way, as sacred plant teachers.</p><p>The experience took place in the living room of my friends and was a beautiful tripping environment, with old beams, many plants, cool artwork, and comfy sofas for curling up on. Once effects began to manifest we retired to the sofas and let the mushroom spread its liquid tendrils through our brains.</p><p>I started to yawn a lot, and feel at peace, no euphoria as such, just a calmness that would reside with me for the rest of the trip. My friend remarked, just as I was thinking it, just how much like DMT visuals the first mushroom trips were, exquisitely detailed down to what seemed like a molecular level.</p><p>As the mushroom realm enveloped each of us, we became introverted and didnt talk to one another for a few hours. My trip continued to deepen. I spent most of my time huddled up with my eyes closed, enraptured with thoughts and visions. Even a little light seemed to bright, so I kept my eyes closed. My thoughts drifted onto some of my current demons and faults, and my direction at university, and made me examine them in detail, as I suspected would happen before the ceremony. My friend vocalised, which had an amazing, expanding effect on my trip behind closed eye lids I highly recommend people experiment with vocalising while on psychedelics  in particular mushrooms and DMT/ayahuasca. Simply experiment with droning noises by using your mouth to imitate a didgeridoo, and then incorporate any sounds you can make to see how it deepens and rives to visions. The effect is nothing short of profound.</p><p>There was no joy in this particular experience, the cosmic joy and bliss was simply not present. Post trip I would learn my friend was in a similar mind state, and spent some time on his own examining his issues in more detail, rather than shying away from them.</p><p>A few hours into the trip, I underwent the most intense part of the experience by far. It came quite suddenly, without any prior thought. In this experience I felt like I was actually dieing. Now, I know mushrooms are incredibly safe, and death from direct toxic effects is simply not known. Yet, under the influence of the mushroom, they took me through what I really feel death to be like. It almost felt like a physical presence, like a shadow had descended and enveloped me, reminding me somewhat of a prior unusual homebrewed ayahuasca experience.</p><p>I felt death in my brain. My consciousness, level by level, started to decay and shut down. I have no doubt in my mind that this is what the actual process of the brain death feels like. And yet with the intensity of the experience, feeling parts of my brain decaying and shutting down, I was completely calm. The experience was out of my hands, being driven by a power outside of myself, or my control.</p><p>I must say that during the entire experience, I was in a realm of the most beautiful, other worldly visions, and yet these didnt really seem important compared to the message and thought component the mushrooms were producing, the visuals seemed more like part of the dcor of the experience.</p><p>Its hard for me to estimate how long this utterly bizarre state of purgatory lasted for, but it was for quite a while. Not long after this, myself and my friends started to drift back to reality. I had a glass of water, which struck me as pure, divine ambrosia; my enjoyment of the glass of water was ineffable. I had an insight into meditation, and being completely in the hear and now, and thats what it felt like.</p><p>On the return to normal consciousness, we had a chat about our experiences. I was surprised to learn that my friend had also had a trip heavily focussed on death; he was more exploring the questions around it, while I seemed to actually undergo some of the stages of it. He describes feeling down, and wanting some alone time, never having experienced a bad trip  which we both agree is a very shallow, two-dimensional way of describing such an experience. However, he did not shy away from some of the darker aspects the mushroom was confronting him with regarding death, and a result all of us experiencing a very rewarding, fulfilling session. I felt invincible, and that many doors of possibility had been opened. We shared a few joints of organic, home grown Silver Pearl marijuana, which was delicious, and discussed some of our experiences and insights of the proceeding few hours, to close the session,.</p><p>Psychedelics have taught me to be less in fear of death before this day, but this experience has made me try and lose this fear altogether, as well as almost all other fear. Fear is such a powerful emotion that controls a lot of our time alive, and yet it is just a feeling, and we can choose not to feel it. One time out of ten fear may be an ally, keeping you out of harms way, but all the rest of the time it severely limits us and controls us. Living without fear is the path to freedom.</p><p>It has been three days since the experience and I am still feeling very positive, and the importance of what occurred a few nights ago has remained with me. My respect for mushrooms has increased further. The whole experience was an incredible therapy session. The mushroom is like an ancient and wise therapist that is willing to sit down and work on whatever problems I have personally. Even if I'm not sure exactly what those problems are, the mushroom will find them and show me. Mushrooms are a spiritual mirror.</p>",
 "year": "2008",
 "id": "75387",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-10-07T07:00:00.000Z",
 "views": "2135",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. semilanceata",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
