{
 "id": 7549,
 "title": "Hard to Achieve Effects, But Works",
 "date": {
  "submission": "2007-12-28T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dan Different",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  },
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "plant material"
  }
 ],
 "report": [
  "Me, and two of my closest buddies are daily smokers of marijuana. About a month ago, me and my fellow psyconauts ran up on some money unexpectedly.  We heard all the tales of it, read all we could online, and decided we'd purchase 1 ounce of foilage (not extract).",
  "Purchase the foilage for $17.  Everyone is eager to try it.  After a week the big bag of what appeared to be dried leaves arrived.  We all begin to smoke it, taking turns sitting each other.",
  "Nothing happens.  None of us are able to achieve any effects beyond 'a little weird feeling', except for myself.  The first day, I smoked down on a whole bowl (about 2g of foilage), puff after puff, as hard as I can.  I was standing up, dropped the pipe out of my hand, started laughing at the world spinning around me, and that was that.  We were all very disappointed.",
  "The bag of salvia remains largely untouched for another month.  We try it a few more times here and there - never achieving more than a buzz.  Still disappointed.  Up until then, all the high we could get off of it was 'something was about to happen' high.  It felt like the substance could do something - but for some reason didn't want us to.  I guess we had to earn its loyalty.",
  "Snap back to 2 nights ago.  I'm alone (for the first time in a while).  I had only smoked pot once earlier that afternoon, and was completely sober.  I wanted to trip on morning glory seeds - I've grown several large morning glory plants this year and have yet to try them - and that night seemed to be the night.  But, where are the seeds?  I looked and looked, couldn't find the baggie of seeds.",
  "Screw it, I don't know what possessed me to, but for some reason I picked up the dusty bag of salvia.  I took the loaded .38 pistol beside my bed, unloaded it and returned it to the gun cabinet.  Don't want that near me during any of this.  It's about 3AM, I'm a bit sleepy, restless, but in a fairly cheerful mood.",
  "I laid down in my bed, first time with all the lights on, staring at a blank TV.",
  "I pack the bowl.  I used a clay, all-natural unfired (no kiln, just air dried to bone dry, made from creek clay) pipe.  The first time I packed a layer of salvia, followed by a thin layer of self-grown tobacco leaf, followed by another hefty layer of salvia. ",
  "I didn't think it would do much to me.  It had never done much to me before - even with twice the quantity.  I don't know what condition, what component is required to trip, but there is some variable there.  I hit the bowl as hard as I can...starting to feel something...hit it again and again...",
  "A wave of intense 'on end' feeling came over my body - like an adrenaline rush.  My heart was beating really fast, and I was very alert.  And then, the salvia struck me like a train, like so many other's have described.  I was instantly blasted into another world, and staring at my blank TV, _I found myself waiting for the circus to arrive_.  You cannot imagine how sure, and how much for a split second, I was so sure that a small circus was about to walk through my back door and the 'trip would begin'.  I waited for hours it seems, but it was only for maybe 3 seconds for this circus.  When they did not arrive, I realized I just had my first real salvia experience.  After the realization, I snapped back and was left with a very deep body intoxication.  It reminded me of the body intoxication I get from DXM.  It lasted for about 2 more minutes, and I stood (wabbled) up and sat down for a minute to get my head together.  A few minutes later I was barely above baseline.",
  "That was fun. Roughly 8 minutes after the first time hitting it, I want to try it again.  Lay back down, same method this time (salvia, tobacco, salvia).  I also crushed the leaves down a bit more this time.  Hit the pipe...this time, I had no salvia peak.  I was just back to the weird, heavyness feeling body intoxication, with a harder mind high.  I remember having a few mind hallucinations, seeing the wall in front of me move closer and further away.  I closed my eyes, and instantly was at peace.  At this point, it reminded me of the high you get from opiates, minus everything but the mind clarity. ",
  "I calm down and shake it off.  10 minutes later, It's time to give it one more try.  This time, I turn off all the lights in the room, and am left completely dark.  I do not add any tobacco in the bowl this time - 100% salvia.  I hit the pipe.  Hit it and hit it.  I lay my head back and begin to see ambient white lights fly around the room.  They were telling me: welcome to the salvia world.  Do you like the salvia world?  You need to invite your friends.  The salvia world is great.  Come closer to the salvia world.  At first, I was afraid of the ambients, but within a split second, I realized like a lucid dreamer that it was all a trip, and continued to be amused by these little creatures.  I tried to get up and hit the pipe again, but when I tried to lift up on my body, it was instantly pushed back on by the salvia gravity.  I decided that this wasn't such a good idea, and watched the remainder of my trip.  10 minutes later I was back to baseline and finally satisfied with salvia.  At this time, it was almost 4AM, and was time to try to get some sleep. ",
  "No sleep came.  I don't recommend this stuff anytime before bed, it may of not been caused by the salvia, but I'm pretty sure it was.  I didn't get to sleep until 7AM, but it's OK because I got plenty of things sorted out in my head between those times."
 ],
 "erowid": {
  "id": "46486",
  "citation": " Dan Different. \"Hard to Achieve Effects, But Works: experience with Salvia divinorum (leaves) & Tobacco (ID 46486)\". Erowid.org. Dec 28, 2007. erowid.org/exp/46486",
  "substance": "Salvia divinorum (leaves) & Tobacco",
  "views": "3910"
 }
}
