{
 "title": "Strange Relaxation",
 "author": "Tricky",
 "citation": " Tricky. \"Strange Relaxation: experience with 2C-C (ID 75523)\". Erowid.org. Jan 10, 2010. erowid.org/exp/75523",
 "substance": "2C-C",
 "bodyweight": "86 kg",
 "report": [
  "<p>35mg 2c-c, substance confirmed as 2c-c >99% via COA.",
  "35 Year old male 86kg ",
  "Religion: Neo Pagan",
  "Meds: None",
  "Alternative Meds: 333mg St Johns Wort (standardised extract), Vitamin tablet (100% RDA of all major Vitamins, plus some minerals), Fish oils 600mg (All taken daily, AM)",
  "Previous experience: Including the following, LSD, Mushrooms (liberty cap), 2c-x of various types, others including unknown pills, mdma, various amphetamines and 4-aco-dipt.",
  "Set & setting: Slightly anxious, also exited about the experience.  Comfortable location, that is quiet and peaceful. No one else present.",
  "T+0:00 35mg 2c-c taken in liquid (water) bitter and unpleasant taste.",
  "T+ 0:35 First alert? Some pupil dilation, very mild nausea. Peppermint tea taken.",
  "T+0:45 Maybe the above is due to expectations? Nothing so far, other than very mild nausea.",
  "T+1:00 Now something is happening. Slight jaw clenching, strange metallic taste in mouth. Peppermint tea is strangely oily tasting. Very happy feeling, laughed a little at stuff on the internet, possibly normal though. +-",
  "T+2:00 Now things are starting to take off, some euphoria, mild nausea is passing. Feel something like relaxed, but awake. Strong + to ++",
  "T+2:30 There is some sensory enhancement. I am starting to see things I would have missed before, vision seems clearer than normal. Slight feeling of drunkenness. Sense of smell is also much greater. There is euphoria sort of, but also great relaxation.  Definite ++",
  "T+3:45 Food is good, no hunger (not like the muchies) but taste, smell and texture of food enhanced. No great suppression of appetite, eating is even enjoyable, if a little intense. Strong or challenging tasting food is unpleasant, for example salt a vinegar flavour crisps are quite disgusting.",
  "T+4:00 Some incense burned, in the hope that it will add to the experience. Tried to meditate / relax, and go inwards, its not happening, to much distraction. I can smell most of the ingredients of the incense, and also the overall sent, this is quite fascinating for a while. Still ++. Typing is relatively unaffected, though the keys feel weird. No visuals noted, though things have taken on a brighter more sparkly edge. Light on frosted glass is more interesting than it should be.  Pupil dilation noted, but not extreme.",
  "T+4:30 Reading internet forums is easy, posting isnt so easy. At least it takes what seems a long time.",
  "T+5:00 Some additional effects noted. Visual pulsing while concentrating on computer. Not much else is happening, back to +",
  "T+6:00 Relaxing feel continues, listening to music enhanced.",
  "T+6:45 Effects starting to lessen noticeably, pleasant feel still.",
  "T+7:00 Sleep. Fairly easy, some distraction from CEVs, they seemed to suddenly appear, having refused to earlier.",
  "T+12:00 Awake again. Back to baseline? Maybe, or maybe not. No after effects noted as such. A little bit tired, and maybe a little dreamy and chilled out, nothing that can be pinned down. The rest of the day passed in a slight fog, mostly due to lack of sleep as far as I can tell. ",
  "Experience written up a week afterwards, from notes taken at the time.</p>"
 ],
 "year": "2008",
 "id": "75523",
 "gender": "Male",
 "age": "35",
 "views": "5803",
 "dose": [
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "oral",
   "substance": "2C-C"
  }
 ],
 "submissionDate": "2010-01-10T08:00:00.000Z"
}
