{
 "title": "Why Hello Adam Corrola",
 "author": "Vandel",
 "citation": " Vandel. \"Why Hello Adam Corrola: experience with Ketamine (ID 7553)\". Erowid.org. Jul 14, 2002. erowid.org/exp/7553",
 "substance": "Ketamine",
 "bodyweight": "140 lb",
 "report": "<p>At about 10 o clock I was looking at the needle.. can I do it now?? I asked my friend. He was already high on weed and he said sure, but once you done, lets go to my basement.. I injected .5 ml's of Ketamine into my right arm and relaxed. Right before I put another .5 into my left arm, it kicked in in about 3 minutes. It was hard but I finally got it in. *relaxation of another kind* We were listening to loveline and Adam and Dr. Drew's voices combined with my friends.. I actually saw and spoke with Drew and Adam. I do not suggest listening to voices while on K tho. It might spark a bad K hole if the voices say something that brings up bad memories. Perhaps some Radiohead would be best.. Anyways, my arms got weird looking and everything formed in the shape of a triangle. Mini squares of light and color swirled about. I was aiming to go into an out of body experience.. it never happened but it was definately the best drug experience of my life.</p><p>Later I went into the basement stumbling about. While in my K hole my words splurged out yet were not potent enough to make any sense at all. I didn't even know wat I was saying half the time. I then injected .2 more and went with my friend to a shed so he could smoke weed. I couldn't smoke weed becuase of my drug testing. The K didn't show up in my tests at all. Clean as a whistle.. I smoked a ciggarette and it was the best cig of my life, the smoke was elegant and flowed perfectly. After that I stumbled about inside the house. Running made my stomach hurt though, and I almost threw up. Thank god I didn't eat be4 or after the K hole. Well, I plan on doing it again and again.. a great time in the end.. later</p>",
 "year": "2001",
 "id": "7553",
 "gender": "Male",
 "timestamp": "2002-07-14T07:00:00.000Z",
 "views": "7628",
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "IM",
   "substance": "Ketamine"
  },
  {
   "time": " T+ 0:03",
   "amount": "50 mg",
   "administration": "IM",
   "substance": "Ketamine"
  },
  {
   "time": " T+ 1:00",
   "amount": "20 mg",
   "administration": "IM",
   "substance": "Ketamine"
  }
 ]
}
