{
 "title": "Clueless Blondes Shouldn't Do Speed",
 "author": "Lyssa D.",
 "citation": " Lyssa D.. \"Clueless Blondes Shouldn't Do Speed: experience with Methamphetamine (ID 7556)\". Erowid.org. Mar 31, 2003. erowid.org/exp/7556",
 "substance": "Methamphetamine",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>It all started after I had to stop doing pot. I was going to get drug tested for a new job, so I needed to get clean. I still wanted to do drugs. Even though all ive ever done is pot. My stoner friends know that im inexperienced and looking out for me they'd never hook me up with anything other then pot.</p><p>Well, I got to talking to another friend of mine, who I thought I could trust and hung out with alot. I said I wanted a drug that got out of my system fairly fast, and wasnt too addictive. He said he'd get me speed (since he couldn't get acid). I read a little about it but I never found out how much I should be paying for it (I still dont know anything) and what colors were good, and what ones were bad.</p><p>The last day of school at lunch I slipped my friend the money ($20) and he gave me a little sqaure packet. Or something like that. Inside was an orangy-slightly pink powder. I didnt really know what to do... but I was very anxious to try it. I went to the bathroom and snorted  half of it. I didnt feel anything. It slightly burned. But not bad at all, nothing like what I thought it would be. I then went outside to hang with my other friends.</p><p>After that I got alot of energy, i even jumped around and kinda sang a little. But I just felt hyper. Nothing special, and I was dissapointed. Then the bell rang to go to class and finish the semester tests. Right before I went in I did half the speed of what was left. Then I started my last test, Spanish, the only subject I was flunking.  About 5 question into it I got bored and I guessed at the rest of it. I didnt really care.</p><p>After the class ended, school was over so I went home. I think it had been around 2 hours since I took the speed. When I got home, I felt really weak, so I laid in bed. The next thing I knew, I had gone to sleep 3 hours. I felt so stupid!</p><p>This wasn't a traumatic experience. I didn't get hurt. But I could've because I dont know jack. I seriously think one should not take speed unless they know its good, and they're not wasting their money. I did. I havnt talked to my friend since I bought the stuff. That leaves me suspicious. I hope you can benefit from this, because Ill feel even more dumb if I get nothing out of this experience at all.</p>",
 "year": "2001",
 "id": "7556",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-03-31T08:00:00.000Z",
 "views": "23552"
}
