{
 "title": "A Trip in Every Pot",
 "author": "Atharkiz",
 "citation": " Atharkiz. \"A Trip in Every Pot: experience with Cannabis & Fluoxetine (Prozac) (ID 75596)\". Erowid.org. Jul 26, 2010. erowid.org/exp/75596",
 "substance": "Cannabis & Fluoxetine (Prozac)",
 "bodyweight": "135 lb",
 "report": [
  "<p>Having done a bit of research about the state cannabis seems to induce in me, I've only heard of flashbacks and panic attacks being triggered by cannabis and panic attacks being caused by high doses of cannabis. My situation is a little different. Every single cannabis session is a trip, with fairly prevalent OEVs and CEVs (mainly tracers and fractal patterns on sufaces, warping of edges and text 'dancing' in terms of OEVs, CEVs amount mostly to intricate fractal patterns that can turn into dream-like visions, as fractals morph into animate objects in the mental plane. In terms of past drug experience, I've had one 'breakthrough' dose of 2C-I (certainly the most intense trip I've yet had), an oddly introspective and gut-wrenching HBWR trip in which the cannabis actually removed the haziness from the experience, a moderate amount of cannabis use and inconsequential recreational experiences with painkillers and stimulants. For medical conditions, I've recently been diagnosed with OCD (Obsessive-Compulsive Disorder), hence the Prozac, and many of my friends suspect that I have Asperger's (I'm not sure what I believe about this).",
  "Before taking Prozac, I had pretty typical reactions to cannabis.. mainly a stoned feeling, a body high and the munchies, with the occasional light visual. The first time I smoked pot after taking prozac, about two weeks into treatment (I think it was only 10mg/day then), I had a fairly intense experience in which the moon-lit sky opened up and manifested itself as a false entity, and I could see beyond the veil of the stars into the true meaning of the universe. For the most part, however, I seem to encounter psychedelic 'waste' from these experiences.. nothing too introspective, just highly disorganized thoughts and visuals. The intensity of psychedelic experiences is also mostly lacking, though music definitely sounds much wider and I can detect even slight upsets in the rhythm of the song. In a more recent experience, I noticed that the speakers playing music actually began to ripple and pulsate with the beat of the music.",
  "Each time I smoke it seems as if the psychedelic effects of the drug continue to grow stronger, as if I had some kind of negative tolerance to the drug. Recently I saw an entire civilization in the head-rest of a car, which I couldn't distinguish from reality, and then thought that the entire night had been a dream, feeling deja-vu eveywhere. Even after people confirmed that it was not, in fact, a dream minutes later I'd be convinced that they were part of the dream too. I don't smoke insane doses of pot either, my friends who have taken similar doses don't encounter any psychedelic experiences from it, leading me to think that it's not laced weed (also the same results have been noted in 3 different batches from different sources).",
  "Being an amateur pharmacologist, I consulted the literature. My current theory about these effects comes from a recent paper from Nichols, in which he proposes that traditional psychedelic drugs acting on the 5HT-2A receptors cause a release of 2-AG, an endocannabinoid. If Prozac causes activation of the 5HT-2A receptor without triggering the release of 2-AG, then it's possible that smoking pot would activate the same receptors 2-AG binds to, namely CB1/2 (I think), causing a psychedelic experience to take place. I'm hoping this is the case, as I've heard anecdotal reports that tripping from pot is a sign that one may be latently schizophrenic? So I'm hoping for the best, and worrying that this may be a warning of nasty mental issues to come.</p>"
 ],
 "year": "2008",
 "id": "75596",
 "gender": "Male",
 "views": "9378",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2010-07-26T07:00:00.000Z"
}
