{
 "id": 7560,
 "title": "Midnight Escapade",
 "date": {
  "submission": "2007-12-28T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "RLK",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0:45",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "My first time experiencing shrooms is an unforgettable one. It all started around midnight when I was spending the night at my friends house. He was asleep but my other friend and I were fully awake. He had shrooms on him so I convinced him to take them with me, being that I was really curious and wanted to try them. So I ran home to get some orange juice because my friend told me that increased the effects or something of that sort. As soon as I got back we ate the shrooms. They didn't have a pleasing taste, but it wasn't too bad. As soon as I consumed them I anxiously awaited.",
  "15 minutes passed. Nothing happened.",
  "30 minutes passed. Nothing happened.",
  "Soon after that, something happened. As me and my friend went outside to smoke a cigarette, my friend told me to look at the outside wall. He seemed pretty interested by it, but it had no effect on me. I could tell my friend was starting to trip, and I just went along with it wondering if anything would happen.",
  "I went back inside, disappointed. My friend suggested we smoke a couple bowls and I agreed. This is when things got strange. I noticed the closet began to bulge out a little. I couldn't tell if I was just imagining this or if the mushrooms were really working. I'm not sure if the weed enhanced my trip or if the effects were just starting to wear in.",
  "Me and my friend both wanted to take a walk so we did. Before we left I began to feel the effects a little more. My thinking was a little blurry from then on, and I couldn't keep a straight, focused thinking pattern. We jumped the fence and was off to journey into the world. As we walked through the canals I started to feel amazing. Not just good but euphoria in the true sense of the word. The body high I got was incredible. I didn't care about any of my problems I would have to deal with in the future, everything was bliss.",
  "At this point I started talking a lot. I felt really connected with my friend and enjoyed just having conversations with him. I was being a little loud considering it was pretty late, but I didn't care. My friend and I sat down on the sidewalk next to the canals and I felt like I was one with nature. There were lots of trees and bushes and I felt like I was at home, just enjoying being with other forms of living things. It felt natural and calm and serene.",
  "After a couple minutes we trekked down to the deserted beach. Cautiously we approached the sand, being sure to look out for cops because we were both minors and it was after curfew. We lolled upon the cool sand gazed up at the stars. There were millions of them. Living in L.A you never see much stars at all so this was amazing. Additionally, all the stars were connected with beams of light like connect the dots. Patterns emerged. Galaxies swirled. I wasn't quite sure what to think of all this or how to comprehend or grasp all that I was feeling and experiencing. I felt as if the world was a piece of clay in my palm and I, with enough focus, could shape and mold it in any way I wished. It's an amazing feeling. Concentrating, I could make the sky move with my mind. I can't even describe it.",
  "My friend was feeling a bit paranoid, and I couldn't understand the degree of his paranoia, being in this total mind bend, so we decided to leave. As we walked back through the canals I pretended it was the amazon and found great pleasure just exploring through the bushes. We both took our shirts off and I felt the cold, damp air press against my skin. It was nice. When we arrived at my friends house I still felt amazing. I wanted to stay out in the alley outside forever. My friend said we'd have fun inside so we went it.",
  "Music sounded amazing. During this time I just couldn't figure out how to use his computer. It was perplexing the hell out of me. The screen would strech and bulge and I couldn't comprehend what was happening or what I was doing. It's all a blur and it was if I wasn't doing any thinking. My mind was on auto-pilot and I was just watching though my eyes.",
  "The room felt alive. As I stepped on things on the floor I felt a prescence in the room of some sort. As if it was a dark jungle and hidden thing's were alive somewhere in the room. Again, this feeling of nature was a good feeling. My friend, really tired, went to sleep in the other room while I decided to go home. The sun was beginning to rise and I was still tripping ever since I initially took the shrooms at midnight.",
  "The world looked different. Everything was a little blurry and out of focus. Object's were a little out of size too. I sat in an alley waiting for my mom to leave for work. As I was looking at the wall it began to warp. It slowly swirled and then would stiffin back into place. The more I let my mind loosen up, the more it would bulge out and swirl into sort of a hieroglypics pattern. It was enjoyable yet a little uncomfortable because I was really tired and wanted to go to sleep.",
  "When my mom left I went inside. As I looked into my mirror I was shocked at how huge my pupils were. They were the size of pennys. As I looked into the mirror I could see the other mirror and they would bounce off each other and it was sort of like looking into another dimension. Strange. I crawled into bed and had a hard time falling asleep for about 15 minutes but finally did.",
  "Overall the experience was unbelievable. I learned that the environment and conditions greatly affect the trip. When I was this my friend exploring the world it was awesome. When I had to wait in an alley, lethargic and cantankerous, and then trying to sleep (which by the way was pretty weird) was less satisfying. I defiently want to do shrooms again and see where my mind takes me. It's as if a new spark is ignited in one's imagination. The possiblities are infinite."
 ],
 "erowid": {
  "id": "46533",
  "citation": " RLK. \"Midnight Escapade: experience with Mushrooms & Cannabis (ID 46533)\". Erowid.org. Dec 28, 2007. erowid.org/exp/46533",
  "substance": "Mushrooms & Cannabis",
  "views": "2807"
 }
}
