{
 "id": 7563,
 "title": "Understanding Reality Through Someone Else",
 "date": {
  "submission": "2007-12-18T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Doyle",
  "gender": "Male",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "3.5",
    "quantity": "3.5"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "2:30",
   "amount": {
    "unit": "shots",
    "quantity": "6"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "2:45",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I have been preparing for this experience for awhile and was hoping to do it with my friend A, but she got sick so I decided to just go to another friends house where my two friends were just smoking pot.  Ive done shrooms once before and I'm relatively experienced with dxm, weed and other types of psychedelics",
  "11:00 pm  I ate around 3-4 grams of shrooms in my kitchen and proceeded to finishing watching a movie. I called my friends and headed over to Cs house where J was too.",
  "12:00 midnight  I arrived at my friends house only to find out I couldnt come in because her parents were awake. At this point I was starting to feel mild affects of the drug and was only getting more and more anxious.  After being told I couldnt come into my friends house for another good half hour, I went into my next-door neighbors huge empty front lawn. I brought a backpack full of stuff, including a drawing notebook, set of pencils, camera, bottle of vodka, pot, cigarettes, and tons of music. I called my friend Cami and she said she was going to pick me up and bring me to Ts house for the rest of the night because she didnt want to leave me alone in the forest.",
  "12:15am  I feel as if it's daylight out and I'm walking down an empty gravel road street trying to reach for the sky which looks pink and purple and blue. Cami picks me up and we headed to Ts house. On the way I started drawing in the back seat. All these drawing were already on my paper but when I would turn the page back to the picture it would change or it would be gone completely. Fascinated by this magic book I just started to outline all the drawings thinking maybe I can keep the magic with me forever. I stuck my head out the side window and saw all the streetlights flash and collide into a collage of beauty.",
  "12:45am  we pulled into Ts house, but he wasnt there yet, only Camis boyfriend was.  We all waited in the stoop and I then started to hear some weird echoing of music coming through the cracks on the side of the wall. It was simple jazz line and I watched as hieroglyphics played instruments and told a story on the bricks. Ts showed up with his friends Justin and Tia.",
  "1am  we all headed inside and went into the basement and started the movie ghost ship. Everything was just getting really fuzzy and I was constantly drifting towards the computer monitor.  Barely being able to pay attention to the movie, I laid down and just listened to music.",
  "1:30am  I headed upstairs with Cami and her boyfriend where we just sat around drinking.  I had 6 shots of vodka but I was convinced it was water.  We all shared our ideas of reality and got into a really deep conversation of understanding human connection and what reality and the world actually mean. I looked at everyone and everything in the room and all the colors on people and objects that made them who they were, were wearing off and getting sucked into something else in another room.  Intense shadows were all over the place at this point that didnt even belong to people there.  C called me and told me that her and J would be awake if I wanted to come back to her house and go hang out back at my house from their and I said I would call her back soon but I never did and I found out they eventually just went to sleep.",
  "1:45am  Cami, Justin, and I all headed out to the back of the house and packed a bowl. I didnt smoke that much because I'm getting drug tested in the next week or two by my job.  I started to feel drunk but I had never been so comfortable in my life. I would open my cell phone and everything else would go black and I would get stuck in this cell-phone world. I saw dreams I had dreamt in the past week, I saw the future, people I have never met, people I loved, I saw everything for what it was. Lies were non-existent, only the truth behind the world.",
  "2:15am  after they had finished smoking I was already on my 10th cigarette. It became a necessity for me to have one at all times, like it was life support for me.  We all shared stories of being on acid or shrooms.  We all discussed the meaning of life.  Around this time I felt like my body was being cut in half through jagged lines. At first I thought I was having a stroke but then I had just begun to have the most life changing experience of my life. I was thinking so much about what everything meant to me and what my friends meant to me.  I went through what I thought was over 20 clips of 3 second dreams where the whole scenery would completely change and Justin and Cami werent there anymore. I would blink my eyes and come back, take a breath and dive back in.  It was like I kept attempting to reach for something. Everything was bright full of color. It wasnt a new place I was in; it was another universe where the only thing was bright colors and an empty white checkerboard.  This all ended abruptly and was hoping to enter this place again.",
  "3am  after Justin, Cami, and me were all done talking to each other I felt as if I was there for years and bonded with these people like no other. It was one of the more emotional experiences of my night.  Camis boyfriend came out and was yelling at us that we were all pathetic and lame. Somehow T got upset and left the house in a rampage. We all headed back downstairs and Camis boyfriend, F, wasnt feeling too great. The night went from beauty to sadness and I felt as if my life where I was had ended out of nowhere. I laid on the kitchen floor for what I thought was hours. I talked to Justin about what was going on and neither of us understood what just happened.",
  "3:30am  went downstairs and asked Tia for a ride home as if it was time to return home. I proceeded to get into her car and we listened to sigur ros while driving in the warm fall night.  After getting lost repeatedly because I really just didnt want to go home, we made it back to Cs house where I picked up some stuff I had left there earlier. I tried banging on her window, but they were sound asleep.",
  "I walked to a local pond in my neighbor hood and sat down to draw the scenery. I continued to lay where I was, doing whatever I felt like till the sun started to come up and I then headed home only left with the sad feeling of the night I had experienced, its life was over.",
  "My experiences felt as if I had brought a new person to life and was living his life that night, but when I headed home I left him to die. The experience overall felt like one of coming home and understanding who I was and what reality was.  This was by far the greatest experience I have ever had with any drug."
 ],
 "erowid": {
  "id": "46540",
  "citation": " Doyle. \"Understanding Reality Through Someone Else: experience with Mushrooms, Alcohol & Cannabis (ID 46540)\". Erowid.org. Dec 18, 2007. erowid.org/exp/46540",
  "substance": "Mushrooms, Alcohol & Cannabis",
  "views": "3369"
 }
}
