{
 "title": "Against the Advices",
 "author": "-Westmount-",
 "citation": " -Westmount-. \"Against the Advices: experience with Hydromorphone (Dilaudid) & Alcohol (ID 75657)\". Erowid.org. Jun 19, 2009. erowid.org/exp/75657",
 "substance": "Hydromorphone (Dilaudid) & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "4 mg",
  "oral",
  "Hydromorphone",
  "(pill / tablet)",
  "",
  "0.5 glasses",
  "oral",
  "Alcohol - Hard",
  "(liquid)"
 ],
 "report": "<p>Last summer, I have been prescribed 1 mg hydromorphone because of my severe back pain. As you probably know, one milligram is the weakest dose therefore I often used more than recommanded.</p><p>It was a normal friday night : me being alone at home. The events took place around 8 pm. I was about to take my 8 pm dose when I noticed a precaution note on the label : ''Never take with alcohol''. And of course, I wondered what it'd be like to do so. That's how stupid I am. Though I went on the web to have an idea of what I should be expecting. After reading tons of warnings about hydromorphone combined with alcohol, I finally decided to do it. I popped four milligrams and swallowed them with half a glass of vodka.</p><p>I was all excited and happy with the thoughts of the high I was about to feel. But the joy didn't last too long : the more I was waiting for a rush, the more I felt down. Opiates usually give me a soothing feeling but it wasn't soothing at all. 35 minutes after the ingestion, I was so down that I wasn't even able to think or feel anything. Seriously, I felt tired at the point where I wasn't even able to end my cigarette. This was scary. I immediately went to bed, knowing that my mind could turn off by any moment. I probably got asleep instantly because I don't remember anything from that moment.</p><p>I'm glad I only took 4 mg! In conclusion, not fun at all, and very dangerous because of respiratory depression. Please follow the notes on your script.</p>",
 "year": "2008",
 "id": "75657",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-06-19T07:00:00.000Z",
 "views": "11134",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 mg",
   "administration": "oral",
   "substance": "Hydromorphone",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "0.5 glasses",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 }
}
