{
 "id": 7567,
 "title": "Not Very Impressed",
 "date": {
  "submission": "2005-11-08T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Epoch93",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "amount": "350 mg",
   "administration": "oral",
   "substance": "Piperazines - BZP",
   "form": "pill/tablet"
  },
  {
   "time": "0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Piperazines - TFMPP",
   "form": "pill/tablet"
  },
  {
   "time": "2:00",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "8:00",
   "administration": "oral",
   "substance": "Diazepam",
   "form": ""
  },
  {
   "time": "8:00",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": ""
  }
 ],
 "report": [
  "My partner and I were in a seaside town on a warm, but breezy sunny day in late summer. After lunch in a local hotel around 1pm we decided to take the Piperazine cocktail, which consisted of two tablets each, allegedly one containing 350mgs of BZP, and the other 100mgs of TFMPP. We thought this would be a good way to spend the day as we were going walking in the forest and mountain which backed the town park. We had never taken these substances before, but from my research I was led to believe that the effect was more or less similar to MDMA. The combination of BZP and TMFPP is supposedly a booster of  Dopamine and Serotonin levels within the body, much like MDMA. These drugs are perfectly legal in my part of the world.(Ireland) ",
  "After taking the dose we went for a walk around the seafront in the town, this took around an hour. We then headed back to the park where my car was parked, and made our way up the trail that led up through the forest onto the mountainside. By this stage we could feel a very mild not unpleasant effect kicking in from the Piperazines. We walked for around 20 minutes up into the forest finding a pleasant spot beside the river, where we pottered about for another hour or so. It was then decided that I should return to the car to pick up some drinks and tobacco as we were going to spend the afternoon up there.",
  "Whilst walking back to the car I could feel the pills really starting to come on strongly, I felt sweaty, thirsty, shaky and had very unpleasant heart palpitations, all in all it had a nasty chemical feel, like badly made speed.  By the time I reached the car I was feeling very queasy, confused and self conscious at the sight of throngs of people in the park. I decided I wanted a drink of fruit juice to perhaps make me feel better and spent minutes in a state of confusion and indecision on where I would be able to purchase such a thing. In the end I opted to grab the supplies from the car which consisted of a bottle of water and a few beers, then I returned back toward the mountain.",
  "By the time I reached my partner she was feeling a similar effect, but not as unpleasant as my own. We walked for around half an hour then drank a beer which made me feel a little better. We basically spent the afternoon paddling about in the water and walking further up the mountain.",
  "The feelings of nausea and illness eventually passed into a more pleasant effect which did on the surface, resemble MDMA very strongly, but without the sparkle and zing typical of Phenylethylamines, such as Amphetamines or MDMA. The effect seemed very superficial, without the feelings of empathy, euphoria and conversation stimulation typical of pure MDMA. Like MDMA also, coordination, and intellectual ability were negatively affected, I almost slipped badly on the rocks in the river a couple of times. I decided that I would wait until the effects had come down before I would attempt to drive. Missing completely was the jaw clenching tendencies so common with MDMA and Amphetamines. Vision didnt seem to be enhanced much, or any closed eye visuals, but my partner reported that she found it quite trippy.",
  "The peak of the trip lasted a good 7 or 8 hours, so it was the evening before we were able to return home. Throughout the experience I had an ongoing feeling of anxiety and uneasiness, whose source or cause I was unable to ascertain. This was unusual because I am experienced in using huge quantities of psychedelics in one go, and my training as an occultist and lay-psychologist usually make me totally immune to bad trips. I had been in a perfectly happy frame of mind before talking the drugs. Also lacking was any sort of inspiration and introspective thinking which I usually expect from a good psychoactive substance. The was a constant diuretic affect, so we pissed a lot, and drank a lot of the pure clean river water coming off the mountain which seemed to make our auras a little brighter.",
  "When we got home around 9pm the drug was still working. I took a few valium, and a few shots of whisky to try and ease me down, but their effects seemed to be dulled by the residual effect of the Piperazines. There also didnt seem to be any aphrodisiac quantities.     ",
  "To summarise the effects, I was not impressed, Im not a big MDMA fan anyway these days, preferring more cerebral agents such as LSD and Psilocybin. The Piperazine cocktail could more or less be described as a second rate version of MDMA, nothing more, nothing less. Perhaps though if I had of been in a different environment, such as a party situation with alcohol and friends I might have been able to appreciate their effects more?"
 ],
 "erowid": {
  "id": "46545",
  "citation": " Epoch93. \"Not Very Impressed: experience with Piperazines - BZP & TFMPP (ID 46545)\". Erowid.org. Nov 8, 2005. erowid.org/exp/46545",
  "substance": "Piperazines - BZP & TFMPP",
  "views": "33425"
 }
}
