{
 "id": 7572,
 "title": "Chi Town's Bromo Boom",
 "date": {
  "submission": "2005-09-29T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "OB",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "Bromo dragonfly came to the Chicago area recreational market around Christmas 2004.  At first it was claimed to be acid, but after a few people who had actually taken LSD in the past tried it, it became obvious that bromo is NOT LSD.  A few people thought it could have been DOB because of its duration, but the chemist revealed it to be something called bromo dragonfly.  My experiences on bromo are in no way indicative of its effects because of how differently I've seen dozens of people act on similar dosages.  I've seen people having the time of their life on 2 blotters, in another universe on 19; my best friend thought he was having a heart attack off of 1!  My experiences are as follows:",
  "It lasts a LONG TIME when it works (some people don't even feel the effects at all while others trip hard).  Onset for most people is about 90 mins.  This can put someone in a couch-locked frame of both body and mind.  Smoking pot greatly boosts the effects in the beginning, but for a majority of the 18-24 hour trip it calms the amphetamine like jitteriness and muscle clenching.  The ego nearly vanishes.  It becomes very difficult to follow social cues or hints people try to drop.  Anything can be confusing and it was nearly impossible to give directions any of the 5 times I tried it.  Articulation of thought becomes extremely difficult and my speech can begin to resemble someone spun off a high dose of LSD (i.e. words can come out stuttered and mixed up).  Bromo is not too visually impressive, but is probably the most scattered and mentally and physically grueling trips I have ever had. I feel completely detached from my old ways of thinking and am much more analytical of people and situations.  There is no such thing as sleep on bromo so if I plan on sleeping at night I better dose in the late morning.  The day after has been affectionately named the frizzle fry by my friends and I because of the way our thoughts feel scattered and incoherent, the body is exhausted and uncomfortable feeling. ",
  "Throughout the entire trip and day after I am on an emotional rollercoaster from euphoria to nearly bad trip-like vibes.  It is a much more introspective than a 'big picture' oriented trip.  If this report has been hectic that is because the drug itself is chaotic.  It is very inconsistent and wavy in its effects and at one moment I can feel like I'm on a smooth trip but the next feel coked or speeded out of my mind (with a psychedelic mindset the whole time).  The craziest thing is that while my circle has been experimenting with bromo for almost a year, the way we all react to it differs more than any psychedelic any of us has ever tried."
 ],
 "erowid": {
  "id": "46574",
  "citation": " OB. \"Chi Town's Bromo Boom: experience with Bromo-Dragonfly (ID 46574)\". Erowid.org. Sep 29, 2005. erowid.org/exp/46574",
  "substance": "Bromo-Dragonfly",
  "views": "11753"
 }
}
