{
 "id": 7580,
 "title": "Searching",
 "date": {
  "submission": "2007-09-17T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Jotul",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ],
 "report": [
  "First a little about me.  I'm 38, happily married, two beautiful kids, absolutely hate my job (presentation technology). I've smoked pot off and on for years, and fooled around with other 'stuff' in my younger days. I've had some amazing mushroom trips. I'd like to do more but I don't like the time involved with mushrooms or LSD. I don't want to be around my kids in these states of mind. For me, it is a very personal time and I don't want them to ever be frightened of how I might be acting.  I'm a relatively happy guy but still like to 'experiment' every so often.  My wife doesn't do any drugs and only occassioanlly drinks.",
  "While driving by the only head-shop in my town, I noticed they had a small hand-written sign on the door, 'We have Salvia'.  I stopped and picked-up a small bag.  I had already read-up on salvia, so I thought 'why not'. The owner told me it was 'pretty crazy stuff' but it only lasted 10-15 minutes. Later that evening I was in my workshop, my wife and kids were sleeping, and decided to do a 'bucket'. This was probably NOT the best thing for a 'first-time' experience, but hey, I figured I could handle anything for 10-15 minutes. I put about two grams in my bowl and filled the 2 litre pop bottle with smoke. Leaning over, I inhaled the whole thing and held it for maybe 20 seconds.",
  "I was surprised how much smoke I exhaled. During that time, I tried to fill it again with smoke but there wasn't much as I burned-up most in the first draw. While inhaling this second dose, I suddenly felt like a freight train was coming, this lasted maybe 1-2 seconds, then it was as if my entire jaw and teeth were pulled and stretched to the left of my face. I thought I could see this happening, the room was moving and I felt like I was trying to get up. I knew my body was in my garage but my 'being' was moving somewhere else. I could hear voices, maybe my wife, I'm not sure, it seemed as if someone was with me. To be honest I was quite scared at this point as what was happening was far beyond anything I had ever expected or experienced.",
  "The fear did not last long. I felt someone or something calming me. It was as if a reassuring hand had been placed on my shoulder. Suddenly I realized I was sitting on the floor and still trying to get up. I eventually was able to stand but I needed to hold-on to something as the room was quite tilted still. At this point I could feel something sharp in the hand I was using to brace myself. I was holding onto the edge of my drill-press. It was not sharp itself, but the feeling in my hand seemed very intense. I must have been 'coming down' as I kept thinking what the owner of the headshop told me, it lasts 10-15 mintutes, lasts 10-15 minutes, lasts 10-15 minutes. The urge to get out of my garage/workshop was also extremely intense. I wanted the outside and see the stars.",
  "Perhaps it is just a memory conjured up by writing this 'report', but I now seem to have a very vague memory of traveling, flying or seeing planets and stars up close as if I was in some other universe. Things cleared up pretty quick and the next thing I knew, there I was alone, standing in my garage, sweating buckets. I assume this may be a side-effect as I tried smoking much smaller amounts on two other occassions with no real effect other than feeling very warm. I don't know for sure how long I was gone for, but I think it wasn't more than 5 minutes in total. Once back in the house I vegged in front of the TV feeling somewhat relaxed but odd in a way that I couldn't exactly account for. I honestly believe I met someone or something more happened.",
  "I do want to do this amount again. Smaller amounts, smoked in a pipe, didn't really do anything at all for me. I like the idea of fasting for a day or two first, but I will not do this right away. Outside on a starry night, in front of a small bon-fire will be my next attempt."
 ],
 "erowid": {
  "id": "46603",
  "citation": " Jotul. \"Searching: experience with Salvia divinorum (leaves) (ID 46603)\". Erowid.org. Sep 17, 2007. erowid.org/exp/46603",
  "substance": "Salvia divinorum (leaves)",
  "views": "2544"
 }
}
