{
 "id": 7581,
 "title": "Of the Interaction of SSRI and Psychedelics",
 "date": {
  "submission": "2006-04-16T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lizard Prince",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "daily"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "liquid"
  }
 ],
 "report": [
  "I have done weed most of my life since 18 (Im 27 now), Datura, Brugmansia (4 times each. Didnt like it at all any of the times), codeine based cough syrup (loved it), and SSRI for 2 years for bipolar depression to which in combination with Trichocereus Pachanoi is this report related.",
  "The first time I tried trichocereus I was NOT taking SSRIs at that time) I put in a blender the green tissue of a 35 centimetres long cut of San Pedro. Pureed it, mixed with lots of a kind of bottled artificial lemon juice (it read 4% acidity, and the ingredients read: Citric acid, ascorbic acid, sugar and artificial flavouring). Boiled this cactus + pseudo-lemon mix for 1 hour. Strained the solids, discarded them. Let the syrup cool and proceeded to the most horrible experience of my life: Swallowing 250 cc of the most unpleasant textured, most horrible tasting thing I could have never imagined in my life. About an hour later the trip started. It was what I guess is called a Full blown psychedelic experience. EXTREMELY intense. Lovely from the beginning to the end. Totally life changing. Never, ever did I go into bad trip feelings.",
  "A year later I started taking sertraline at 50 mg/day. One year after (a year on SSRIs already) I took San Pedro again. This time due to pure laziness I took the green tissue of around 15 centimetres of the plant and put it in a blender... spines and skin included. Concentrated it without any acid and drank it. About an hour later the trip started (this time I was with a friend). The trip lasted around 9 hours (same as the previous one).",
  "A couple of weeks later took a larger quantity by myself (while still on SSRIs). And again had a full blown psychedelic experience.",
  "The conclusion for my own particular case is that being on sertraline didnt affect the experience that much. Id dare to say that didnt affect the experience at all. What influenced the most all of the experiences was the surrounding ambience, the light. Exposing myself to intense light such as daylight or fluorescent tubes always inevitably stopped the experience, then when getting back to low or red coloured light the experience burst again.",
  "But the absolutely MOST determining factor of both intensity and quality has been being by myself or accompanied. Im quite a lonely person, and tripping alone lets me flow a lot more, I enjoy both ways of tripping but being alone goes for intensity while being with somebody else goes for fun and conversation but always with less intensity."
 ],
 "erowid": {
  "id": "46605",
  "citation": " Lizard Prince. \"Of the Interaction of SSRI and Psychedelics: experience with Sertraline (Zoloft) & Cacti - T. pachanoi (ID 46605)\". Erowid.org. Apr 16, 2006. erowid.org/exp/46605",
  "substance": "Sertraline (Zoloft) & Cacti - T. pachanoi",
  "views": "20184"
 }
}
