{
 "title": "Felt Like I Was Dying (Hospitalization)",
 "author": "WayTooMuchh",
 "citation": " WayTooMuchh. \"Felt Like I Was Dying (Hospitalization): experience with DXM (with CPM) & Various (ID 75812)\". Erowid.org. Oct 15, 2010. erowid.org/exp/75812",
 "substance": "DXM (with CPM) & Various",
 "bodyweight": "120 lb",
 "report": "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.] </p><p>I'm writing this experience while still shaking and having mild seizures from a horrible DXM trip last night. I have taken DXM (in the form of Triple C's) before twice. The first time, it did nothing. The second time, I had trouble seeing and everything was a bit 'weird,' but no major trips. So, yesterday, me and my friend set out to get fukced up. At around 3:30-4PM, we snorted a Vicodin and some cold pills that were a combination of Acetaminophen, DXM, and something else that I don't remember. Well, that didn't do too much, so we each had some beer. I had 4 cans, she had 3.  I was a bit buzzed from the Vicodin (I'm a big fan of Opiates in general) and the beer, and then we decided, at about 6PM, to go get some cigarettes and some Triple C's.</p><p>After finally getting to the store (we had to walk, due to our license's being suspended) in the freezing cold, we bought two boxes. One was Coricidin HBP Cough and Cold, and the other one was Coricidin Flu. There was only one box of the HBP, so we had to buy another kind (which only had 15 mg. of DXM in it.)  then went to go get some food, and after we were done eating, we preceded to take the pills. I took 8 of the Cough and Cold, as did my other friend, and my other friend took roughly around 12 of the 15mg DXM pills. I was wanting to get to the 2nd Plateau of DXM, so I took about 5 more of the 15mg pills. We walked home, and just chilled for a while.</p><p>At around 8PM (I don't remember the times too well), the pills started kicking in. I noticed the first side effect quite well: nausea. (I've had other bad experiences with pills, alcohol, and stomach problems in the past, so this was nothing new to me.) We sat on her bed for an hour in the dark, listening to trippy music, taking pictures, and such. It was very hard for me to sit up, because every time I did, I would get extremely dizzy and nauseous. I wrote a blog, which I like to do sober or fucked up, and I figured I should write one then. Towards the end of my blog, something creepy started happening. I began feeling insane, and like something really wrong was happening, like I needed to get out, and up, and not be there, but I felt stuck. My friend (although I did not realize this at the time), began having convulsions, and, ultimately, a seizure. In my blog, I stated, '[blank] is freaking me out. something bad is going to happen. wait, no it's not. nopenopenope. oh God. hehehehe. something bad is going to happen. remind me never to take DXM ever againn.'</p><p>I then ended my blog. I tried to get up, because my friend was still having a seizure, so I think I tried to get up and get some water for me and her to drink. On my way there (this is the part where my memory gets really foggy), my whole body movement was sooo messed up! It felt like electronical waves of energy were hitting my body and zapping me, and I couldn't walk straight. My legs felt very heavy, and my heartbeat began to get out of control. On my way to get water, I think that I fell, and I recall hitting my head on the floor.</p><p>That's when it really hit me.</p><p>I thought I was gonna die.</p><p>I felt like I was dying, and it was sooo scary.</p><p>I contemplated dialing 9-1-1, for fear of causing an uproar, but then, I suddenly remembered learning in Health class awhile back the women's symptoms of a heart attack, which were: Rapid heartbeat, sweaty skin, pains in the back and the neck. I suddenly did get a pain in my neck and back, and that's when I knew I couldn't just sit there and wait it out (like I usually do when drugs/alcohol trips go wrong). I called for someone else in the house to call 9-1-1, and they did. I got to the hospital at around 11-11:30, or, at the latest, 12AM. My friend was admitted, too, but got to leave at 4AM. I had to stay until my heart rate got down to at least 100 or 105, which was not until around 1:15PM today.</p><p>I cannot convey how much this has ruined a part of my life. Mentally, emotionally, and physically, this has fucked me up. If you're going to do DXM, DON'T DO CORICIDIN HBP! PLEASE! Do something like Robitussin, which won't make your heart as fucked up as Triple C's will.</p>",
 "year": "2008",
 "id": "75812",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2010-10-15T07:00:00.000Z",
 "views": "8249",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Hydrocodone"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": "4 glasses",
   "substance": "oral"
  },
  "2": {
   "time": "Alcohol - Beer/Wine",
   "amount": "",
   "administration": "",
   "substance": "315 mg"
  },
  "3": {
   "time": "oral",
   "amount": "DXM",
   "administration": "(pill / tablet)",
   "substance": ""
  },
  "4": {
   "time": "2500 mg",
   "amount": "oral",
   "administration": "Acetaminophen",
   "substance": "(pill / tablet)"
  },
  "5": {
   "time": "",
   "amount": "34 mg",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate"
  }
 }
}
