{
 "title": "Unexpected Encounters",
 "author": "DemonSeed",
 "citation": " DemonSeed. \"Unexpected Encounters: experience with 4-HO-DiPT (ID 75917)\". Erowid.org. Feb 16, 2009. erowid.org/exp/75917",
 "substance": "4-HO-DiPT",
 "bodyweight": "150 lb",
 "report": "<p>Weight :\t150 lbs</p><p>I have been experimenting with iprocin during the last month. I have tried it at 2, 7, 14, 25 and 30 mg. In the threshold range, it didnt produce any significant effects. 7 mg was not interesting; 14 produced a good euphoria but it was not such a visual experience; 25 mg produced great euphoria and insight into psychedelia; and finally, at 30 mg, it was breathtaking in all way, the visuals were very interesting. I decided to push it farther in the presumably high dose range for iprocin. I was seeing all of those Buddha Third-Eyes and beautiful patterns around me and I was quite amazed. It was quite taking and I felt like I was about to enter another dimension. This is why I took 40 mg last friday (two days ago). Heres my trip report.</p><p>Friday night was the only time in the week I could have a psychedelic experience. I was free the next day for recovery and to enjoy the after-glow. That day I had smoked weed before noon and I was working in the evening and just slept in the afternoon. I had a good time at work and this is when I thought it would be nice to trip this night. I made my mind. Someone call me at my workplace; its one of my friend, lets call him J, and we agree to watch some movies together. At eleven, he comes grab me after being intercepted by the cops for some dump shit and we go to my home. In my room, I take a nootropic regimen: 1200 mg piracetam, 4.5 mg hydergine and 250 mg centrophenoxine. I suspect it may have played a role in the intensity of my experience. I then weight out 40 mg of 4-Ho-Dipt and parachute it. I feel disgust just knowing this stuff is in my stomach because of the taste of it. I almost immediately feel an alert, a tiny feeling in the stomach that keeps growing.</p><p>We leave for my friend room. Just before we go see one of my friend at his night job. We stay there about thirty minutes and by the time I am leaving, I have started smiling for nothing and being quite lively yet a little uncomfortable. J and me leave and go to his place. He shows me different movies parts and Im quite enjoying the visuals. I can hear the music and both of us breathing. It makes me uncomfortable because I feel I am breathing loudly. I tell my friend and he just doesnt seem to care so I relax. Nothing particular happened I felt a chill and a bit of nausea. I smoked some weed while we watched his stuff. At a point, just before 1:00 AM, it became hard sometimes to understand what I was watching on the screen. At the same time, I felt like that watching a movie was preventing me from entering the visionary state. Hopefully, I left around 1:00 AM because my friend was working the next morning. It was fine with me.</p><p>I was hoping to enjoy walking in the snow like I had two weeks before on another trip with iprocin. Too bad, it was so cold I had to play being in survival mode and felt the heat I was producing. I was having vivid hallucinations but was still able to stay in reality. The sight of a big snow blower coming from my back, passing right by me was quite amazing. This felt so much more real and almost scary. To get to my home, I take a shortcut in the woods. It was dark and yet I saw so much light. I was scared at a point because I felt there was something like a ghost behind me. I laughed and walked faster. The hallucinations could get so intense reality shattered for the spit of a second. I had to concentrate to navigate in the world or it could have been dangerous.</p><p>Back at home, I go in my room and just decide to put my earphone; I lisen a cd-rom of Enya and lay down on my bed. At 25 mg I felt great euphoria but I had to concentrate on the body buzz I was getting to feel it. Only then it became euphoria. Beyond 30 mg, I cannot ignore the amazing euphoric body buzz and I keep telling myself: this is so good, this is so good. My legs feel so relaxed and my whole body is radiating and its bliss by itself. I had kept a small light on. I was watching the World Map on the wall next to my bed. The different colours of the frontiers lines were very bright and obvious, in bold with a lot of depth. And then inside the map, I was seeing complex geometric patterns moving around. It didnt look like a map. Its also very hard to describe as the experience mostly faded off my head.</p><p>I couldnt use my recorder because my family was asleep and I was too lazy to take some notes. It is not an easy task to find the words to describe this. Two days later, its hard to remember the deepest moments and impressions of my trip. When it happened, I thought I would be able to remember this because it was so filling me, so noticeable. Its something I would love to be able to communicate more. The only thing I seem to be able to say is that it was amazing, incredible, and so beautiful. Thats all I could tell my friend J about it. There are not much people to who I can talk about psychedelics I just wanted so badly to tell people about what I lived. This is why I decided to write a trip report.</p><p>I am watching those beautiful patterns, I feel very euphoric, the music is giving me good vibes but this isnt the most interesting thing. I easily become hypnotized while watching the World Map and the patterns on it and suddenly I see eyes and there is a green structure around it, looks like green lianas. It looked exactly but it was different than the visual work I saw in some psychedelic movie about DMT. I remember that when it happened, I completely quit my room and was in another dimension. I saw maybe two different creatures. One of them felt like it was gigantic, like I was only seeing his head, and that his whole being was made out of the world. I am left with the feeling that the whole world itself is alive.</p><p>I entered this visionary state a couple of times, almost at will, just by allowing myself to lost focus on reality. Maybe all of this happened inside me. Could it be a part of my unconsciousness manifesting itself? Could it be my Yidam? Is it an inhabitant of the Bhardo? Is it only a hallucination or an illusion? I first think that if it doesnt really exist, its not important, because I am still experiencing it and it is the most amazing thing I ever felt on a psychedelic. I suddenly enter the state again, and then I knew all of this is real. But then again, I come back in my room, I feel totally amaze, and I would want to remember what happened and I know I cant so at least I tell myself I want to remember it was the most beautiful thing ever. Thats the only thing I remember clearly.</p><p>I did not only enter a new realm and saw pseudo-cosmic entities in some visions, I felt like I was floating around and I felt completely content about everything. I thought about my life and I was happy because things have been going good lately. I also thought about how things have been going wrong. I had new perspectives and thought about how much it is important for me to talk to people and girls if I want to meet people. This is because I have a problem with communication and I am working on that. This is not easy and a slow process and it just seems my use of iprocin lately is helping me. I started to think about things I could say and I wrote some when I was coming down that was at about 3:30 AM. This is one of the most amazing voyage I ever had. I am getting so interested by entities and wasnt expecting to have a glimpse of them on 4-Ho-Dipt! I havent tried DMT and I cant wait to extract some sometimes this summer.</p><p>When I started coming down, I still felt a good body buzz and was still having swirling hallucinations. I played a multiplayer shooter video game and I had to focus to concentrate I owned for a while and it was fun talking with people. I told someone about my experience because I needed to. I decided to go smoke marijuana and met up with my brother who couldnt sleep. We smoked together; I didnt talk much, because I dont want my brother to know I use other drugs. I go back to my room play computer until around 5:00 AM.</p><p>I feel so hungry and I go get some cheese, bread and other good stuff. It was yummy! I then proceed to take 1 mg risperidone and felt asleep almost immediately. I wasnt expecting that. I woke up four hours later, felt asleep for another three hours. I open my eyes in the middle of the afternoon. I am a pothead and I smoke everyday. Usually, on a free day, my pattern is shower, breakfast, smoking. That day I decided to go for a walk outside before smoking because I knew it would be nice and would do some good to me. I was getting a nice after-glow and just felt good and happy and still amaze by last night revelations. Since I have been using this tryptamine, I started smoking less cannabis and have been going for a walk before doing it, usually the day after tripping.</p><p>At around 5:00 PM, I fall asleep in my bed. I wake up an hour later for supper and I feel quite weak. I eat my meal and I lay down in front of the television. I fall asleep and stay there for more than two hours. I wake up again I still feel weak but less. I go smoke weed and decided to call it a day. I was working today and I still felt a bit out of it mentally but I am in shape and I did my day. I woke up early at 6:00 AM and couldnt sleep. All the day, I thought about how great it would be to talk about entities but I think its a bad idea because I have trouble communicating and what would I say, that I saw entities and that they felt real? Admitting to doing psychedelics drugs? I would never do that at work. I cant tell my family and I dont have much people to tell this so I wrote this. I wish I could tell more. This is one of the best psychedelic experience of my life, I was somewhere between +3 and +4. I may just push it even farther next time. For now thought, I muss continue to study, work, eat, and sleep and when the time comes, I will be having another communion with the divine.</p>",
 "year": "2008",
 "id": "75917",
 "timestamp": "2009-02-16T08:00:00.000Z",
 "views": "4555",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "4-HO-DiPT",
   "form": "(powder / crystals)"
  }
 }
}
