{
 "title": "No Thanks...",
 "author": "ZoneOneOni",
 "citation": " ZoneOneOni. \"No Thanks...: experience with Propylhexedrine (Benzedrex) & Caffeine (ID 75930)\". Erowid.org. Jul 26, 2010. erowid.org/exp/75930",
 "substance": "Propylhexedrine (Benzedrex) & Caffeine",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "250 mg",
   "oral",
   "Pharms - Propylhexedrine",
   " T+ 0:45",
   "3 tablets",
   "oral",
   "Caffeine"
  ]
 ],
 "report": "<p>I've had experiences with certain amphetamines such as Adderall, Cocaine, and MDMA. My girlfriend and I were bored one day and I heard about how the Benzedrex high is similar to a adderall high and I figured hell, why not try it.</p><p>My whole experience started like this...</p><p>4:45 - I open the inhaler, pop the cotton in my mouth and just swallow it whole. Wow does this thing taste horrible. At first it was easy to ignore for me, but after the whole experience, I'm never gonna touch this shit again.</p><p>5:30 - I start to 'feel it'. I also popped a Stacker 3 diet pill with it to see if it would feel better or speed up the process. I am feeling wired, and a little excited.</p><p>6:00 - I realize what I was feeling earlier was just the Stacker pill that I took and I was kind of just psyching myself up.</p><p>7:00 - My girlfriend and I take a drive down to her house, still not feeling much, rather tired and out of it.</p><p>8:30 - I figure this stuff is bunk, doesn't work, etc. Oh man, I was in for a surprise.</p><p>9:00 - We headed over to a friends house so I could do a little work on his computer. Out of nowhere, I realize I'm fucking around with my tongue just like I do when I'm on Adderall. I go to take a piss and bam, I'm totally feeling it, raised hairs, pretty euphoric, feeling good.</p><p>11:00 - We head back home to my house after I finished the computer work. Still feeling good, just talking and cleaning a little with my girlfriend.</p><p>12:00 - Ok, right about now everything went from 'O.K.' to 'Holy shit I don't even wanna move cause I'm so nauseated.'. I feel so horrible and sick that I run to the bathroom and begin to throw up. This vomiting was literally the most painful vomiting I've ever experienced in my life, not to mention that I was throwing up the awful tasting cotton balls still and it was just totally unbearable.</p><p>12:15 - Start to eat some crackers and calm down a little. My girlfriend is rubbing my back and calming me down. I begin to relax because I feel like it's finally over.</p><p>12:20 - Hell no, this shit just came back and I feel like I just got punched in the gut by the fist of a angry god. I'm STILL puking and it hurts ALOT.</p><p>12:45 - I'm finally done hunching over the toilet and return to my room to write this.</p><p>My advice to anyone who wants a cheap and easy amphetamine high, don't even fuck with this shit. Save yourself the fucking trouble. It's worse than eating a ton of spicy food and then barfing it up after your stomach boils it down. I've NEVER had a vomiting experience this bad and the high wasn't even that great. Fuck this 'drug' it's literally not even worth touching, don't fuck with it.</p>",
 "year": "2008",
 "id": "75930",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-07-26T07:00:00.000Z",
 "views": "14313",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Pharms - Propylhexedrine",
   "form": " T+ 0:45"
  }
 ]
}
