{
 "title": "It Killed My Personality",
 "author": "ElektricTripper",
 "citation": " ElektricTripper. \"It Killed My Personality: experience with DXM (ID 75989)\". Erowid.org. Oct 15, 2010. erowid.org/exp/75989",
 "substance": "DXM",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "DXM"
  ]
 ],
 "report": "<p>To start off I have used dxm recreationally somewhere around 20-30 times throughout my life so far. The past 2 months I have used it more than I ever have before in that short of a period of time (about 10-17 trips). Usually tripping 1-3 times a week at doses from 150-375mg but usually between 300-360mg per trip. I haven't tripped on dxm in about 11 days and I don't feel right in the head anymore. The past month or so I have been feeling very anti-social, people say something to me and it's very, very hard for me to think of what to reply to them. I don't remember how to talk to my family or friends normally anymore I think I am going insane. Everyone says I am acting different and not my normal goofy self always making jokes, nothing seems funny to me anymore or seems to entertain me. I have been avoiding my family as much as possible, people in general scare the fuck out of me, I can't stand being around people unless they are constantly talking to me but I don't know what to say to them. Silence makes me scared too. I have NOT ever had these feelings before the 'binge' of dxm I've been on the past few months or so.</p><p>I came home one night tripping on 300mg and my dad told my little 2 year old sister to come kiss me goodnight and I was afraid to let her but I did. I had a thought going through my mind, do I hit her or do I kiss her? I didn't know what to do so I let her kiss me and just tried to smile and act normal. DXM has affected me far too much I will never touch it again. I hope whatever my brain is doing stops soon I really can't take it much longer nothing's fun to me anymore. I highly discourage the use of dxm or any other dissasociative. Keep it clean, keep it green!</p>",
 "year": "2008",
 "id": "75989",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-10-15T07:00:00.000Z",
 "views": "5096"
}
