{
 "title": "Shrooming in the New Year",
 "author": "steer",
 "citation": " steer. \"Shrooming in the New Year: experience with Mushrooms - P. cubensis (ID 76037)\". Erowid.org. Oct 6, 2013. erowid.org/exp/76037",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "180 lb",
 "report": "<p>It was New Years Eve, and I ended up having a house to myself for a few days because my family went away. I didn't really feel like having a party because I knew a lot of people would show up and I prefer having a smaller get together. Originally, me and two of my friends were going to trip, but then three more of our friends heard about it and wanted in, which was great news. I spent the day contacting my dealer to see if he would come through, since we needed 3/4oz (3.5g each). Around 6pm, everyone started to come in and we smoked some pot in my basement and played some video games as we were waiting for the dealer to stop by. Finally, at around 9:00pm, we hear a knock at the door, and it's him. He comes in with a handful of baggies with our mushrooms, and we pay him, he wishes us a good trip and heads out to get really fucking high. A few of my friends wanted to stop by a nearby party for the sake of showing up, and would return. During this time, I created the lemon-tek in individual cups for us. 3.5g ground in a coffee grinder, into a cup with some lemon juice, and the rest of the cup with orange juice. I've had experience with the lemon-tek before, and it provided me a mind blowing trip (and that was with 1.5  2.0g). I had all 6 cups ready sitting on my counter, and when everyone was back we immediately had a toast and drank the concoction we called swamp water. It actually didn't taste too bad, just like regular orange juice, but the smell was a bit discomforting.</p><p>Immediately after downing the juice, we all headed down into my basement for another smoke session. Slowly, we were becoming more giddy and joking around a lot more. After a few bowls and a blunt, we headed into my living room, which seemed to be the best spot in the house to chill out. However, on the walk up from the basement, we already were feeling a little spacey. We all felt a strange drunk-walk out of nowhere. There are a bunch of very soft leather couches in my living room that my friends say you can just melt into because they're so soft. A few of them wanted to play some COD4 on the Xbox, so they tried to connect controllers/start up a match. This failed miserably as we were already becoming very forgetful, and slowly nobody could play any video games because we were coming up so fast (as expected with the lemon-tek). I remember one of my friends turned around to me, and asked Are they supposed to be kicking in already? I feel it, and I just smiled and said I was totally feeling it too. I noticed that my perception at this point completely changed. I could no longer feel the high from the pot, and reached a whole different level of high that I think I haven't felt before on any of my trips and I've done mushrooms about five times, acid twice, salvia once. It was a very lucid feeling, almost clear-headed, which I didn't expect.</p><p>I decided it was a good idea to turn off the lights and put in the new Animal Collective album Merriweather Post Pavilion on the surround sound system, as I had been listening to it for the past few nights and it's an amazing album. I also turned on the Xbox 360 visualizer for music on a big screen tv, and we all set back into a couch ready to take on the trip. The first track, In the Flowers is an amazing start to such an album, and has a very mysterious feel that coincided with us coming up. It was perfect. It immediately caught everyone's attention, and we were all getting into the music. It was interesting because only two of us were familiar with the album, while everyone else had never even heard of Animal Collective before. I'm sure they won't forget after this night.</p><p>After listening to a few tracks and coming up some more, I could already feel myself getting completely immersed into the music. All I could do was bob my head and talk to my friends about how they were feeling. After another track, one of my buddies suggested we go back to the basement and smoke another blunt. Some of us were already too messed up to consider smoking more, but others wanted in, so we went back down. When I was in the basement, I couldn't really get comfortable or sit, I had to stand up and walk around. I was getting crazy visuals. I looked at the walls of my basement, and saw 3D fractals that were holographic in the foreground of my vision. It was absolutely amazing. We were all complaining about how cold it was down there, and it seemed like everyone wanted to just get back to the living room as we were getting closer to the peak. As you may know, it's very hard to make a decision while on mushrooms, especially in a group, so I decided to just suggest that we clip the blunt, and head back upstairs. Everyone seemed to agree, and we all walked back upstairs. This time, the walk up was even more strange, and we felt an even heavier drunkenness with our walk. We piled back into the living room, and I started the album from the beginning. This time, we started to peak.</p><p>I felt like I was getting lost into the music, I would look into the visualizer and it blended perfectly with the music even though the music wasn't playing on the Xbox, but on another CD player. It was absolutely beautiful. Again, the first track blew me away, especially now that we reached the peak. It was probably one of the most intense peaks I've ever had on any drug. Everything was starting to become a blur, and I closed my eyes and bobbed my head to the music. I remember specifically during the bridge of the song, where Panda Bear sings To hold you in time with that echo effect, the vocals felt like it came out of the TV screen with the lights and swirled around my being. I felt like I was riding his voice into oblivion. Absolutely moving, I almost teared up. We listened to about 6 or 7 more tracks, and everybody was euphoric and completely in love with the music. We also noticed that when we squinted our eyes, the lights from the visualizer would stretch across our field of vision and take up the entire room. I felt like I was in another universe with all of the lights, and the music that perfectly massaged my soul. Absolutely breathtaking moment, and I'll never forget it. Other memorable tracks were Lion in a Coma with the interesting didgeridoo and crazy effects on the vocals that make them sound backwards and jumbled. My Girls with the wonderful beat that gets you pumped, Also Frightened with it's amazing effects used in the chorus of the song, Brothersport with its uplifting feel, and Bluish with the very moving background vocals. Another interesting thing is that I thought a lot about my house when listening to the music and peaking. The way I thought about it was different than I usually picture my house in my mind. It was sort of foreign, and I felt like I had to get to my safe room which was my room. I envisioned getting up and running up the stairs into my bed, but somehow still being able to be in the living room at the same time.</p><p>After listening to those 5 tracks, one of my buddies was starting to feel overwhelmed and wanted to avoid getting sucked in to the trippyness. Everyone else was enjoying it, and had no problem, but it seemed like it was too much for him. I think everyone got much much higher than anticipated. We had to turn off the music, and the visualizer, and then he turned on the lights. He wanted to keep in touch with reality, at least a little bit. I call this the anchor that sort of keeps your sanity safe. But I've learned over my experiences with psychedelics that fighting to do that will only hinder the trip, and it's much better to lose yourself. Anyways, he was getting concerned and wanted to basically abort his trip. One of our friends that came with him was also starting to get a little concerned because if that kid thought it was too intense, then it must be as he usually keeps his cool when it comes to drugs and all that. However, I felt that we had a long night ahead of us, and we should just relax and watch a movie or something. The kids who were concerned disagreed, and thought that we should just leave the lights on (which bothered me, as it was much too bright, even when you're sober that light is too bright for the room) and I could also see pictures of my family all around the room, which I do not like to see when I'm tripping. But oh well, I just had to face the other way.</p><p>We all started talking like madmen. Everyone wanted to sort of slow down the trip, and wait for our bodies to digest the psilocin. This was sort of funny, because we would burp every now and then and taste the juice, which is always an indication of digestion, and thus is good news for those concerned, haha. What I usually tell people who are concerned about never coming down is Do you have a digestive system? Okay, well then you're going to come down. At this point, we were slowly coming down off the peak, but everything was still wild and confusing. At this point, it was fairly early, about 11pm. Two of my buddies had plans to go meet up with their girlfriends to watch the ball drop, and were planning on how to do it. I kept suggesting them to just stay the night at my house, and not to put themselves in danger with having to drive and possibly getting pulled over. However, they felt guilty about neglecting their girlfriends, and were contemplating an array of methods in getting to them. I didn't want to get sucked into their madness, but in a room of six trippers, how could I avoid it? We all started talking about what they should do and all that, while the rest of us had no real responsibilities or place to go, and were content.</p><p>We completely lost track of time, and the concept of it was fairly ridiculous. Every now and then someone would read the time and give a reality check to pull us out of the rapid mind wandering. We were still getting obvious closed and open eyed visuals. One of my friends was wearing a leather jacket, and my couches are also black leather. It looked like he was apart of the couch, and when I looked up at his head, it looked like he had a third eye on his neck which was oozing down. Not very scary, but just weird. Everything else in the room was still alive and the patterns in the carpet were 3D. We all felt contradicting thoughts going on in our minds, and it was very hard for us to make any set plan as to who is going where for the 12:00am ball drop. We were still tripping pretty hard, and ended up just watching it at my house. It was very bizarre because I felt like I wasn't on Earth, therefore it was irrelevant to see Earthlings celebrate such an event. Strange, I know.</p><p>At this point, some of my friends called their parents and were wishing them a happy new year, which I thought may have been a bad idea, but it wasn't too bad. One of my friends seemed to talk a little too much to his mom, which has happened to me before. I become very social, whereas usually I may keep the conversation short and end it. He became paranoid and thought his mom would think he was drunk, and his car was at my house. He ended up getting a ride home, which was good. I knew that the kids who had to go to their parents house wouldn't really get into trouble, as drinking was expected for New Years Eve, and mushrooms can come off as being highly drunk once you get your sanity back. The two guys were pretty bummed about their girlfriends, and I think their girlfriends were too drunk to come drive out to my house anyways. We spent the time from 12:00am to 1:45am slowly coming down and talking about our experience, and how the peak was totally nuts. Everyone was mentally and emotionally drained at this point, and I just wanted to lay back and do something simple. We all looked pretty malnourished, as we didn't really eat or drink the entire trip, as it's fairly impossible. My hands felt very strange and clammy, and my lips were chapped. I think we all got some blisters on our hands right after, or during the peak. They went away though, I'm not sure if that's normal with mushrooms or if it was a hallucination. I couldn't shake anyone's hands or anything because of it, and I decided to just wear a pair of gloves, which made it much better. Eventually, most of my friends left and one stayed to spend the night. We talked a bit about what just happened, and were still tripping steady, although we had our minds intact. We decided to smoke the last joint of the night, and listen to some more Animal Collective with the visualizer. Again, we were coming back similar to how we felt right after the peak, and were in awe of the music and visuals. After a few tracks, we got tired, and put in a DVD of Stella, which we both enjoy very much. We watched that for a bit, and then finally fell asleep around 5am.</p><p>The next morning, after my buddy left, I cleaned up a little bit and called up my parents. They were well, and were having a good time at my Uncle's house, and wished me a happy new year. Usually, after a crazy trip, I appreciate reality and want to just get back to my everyday regular life. I sort of missed having my family at home, and I was alone all day. I finally ate something and took a nap until about 6pm, and now I am writing this. Very memorable experience, and an interesting way to start off the new year. A+ trip.</p>",
 "year": "2008",
 "id": "76037",
 "gender": "Male",
 "timestamp": "2013-10-06T07:00:00.000Z",
 "views": "562",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": " T+ 4:00",
   "administration": "3.5 g",
   "substance": "oral"
  },
  {
   "time": "Mushrooms - P. cubensis",
   "amount": "(extract)",
   "administration": " T+ 4:00",
   "substance": " repeated"
  }
 ]
}
