{
 "title": "Codiene Fun",
 "author": "The Lorax",
 "citation": " The Lorax. \"Codiene Fun: experience with Codeine (ID 7604)\". Erowid.org. Jun 4, 2003. erowid.org/exp/7604",
 "substance": "Codeine",
 "bodyweight": "65 kg",
 "header": [
  "DOSE:",
  "64 mg",
  "oral",
  "Codeine"
 ],
 "report": "<p>A few weeks ago I was looking through the bottles of medicine we have lying around and I found the bottle codiene I had for my broken arm. I was talking to my friend and told him about the codiene. He suggested to look on the internet for info and i found a codiene extraction method. I have been smoking weed for about 5 years and i was looking for something a bit cheaper and much more easily available. When i found the extraction method I was amazed that i could get such large amounts of codiene from OTC products.</p><p>So last week i went and bought a pack of Panadiene (8mg Codiene/tablet) and set about extracting the codiene. I used 8 pills in 50ml of water to get about 64mg of codiene. I then had to wait until the next weekend to try it, as although it was tempting, my school life takes priority over drug use on weekdays. (an attitude that has really helped my grades in the last two years)</p><p>So yesterday I called up my friend and took the codiene. I was sitting on the couch when i took it and i had it at about 8:30pm. I hadnt eaten since 430pm so i had an empty stomach. I had mixed it with coke but it still tasted like crap. I was talking to my friend for about half an hour before i tried moving at all. I tried to reach for the remote and i could hardly move my arm. It was hilarious. I was laughing so hard i couldnt tell my friend what was happening. My right arm, i soon found out, was completly numb from the elbow down and i was feeling extremely relaxed. I didnt want to move or do anything at all. I felt more content than i ever have before. I was on the phone to my friend until about 11pm, I don't remember talking for that long though. My friend said i kept trailing off, starting to say something and stopping mid-sentence.</p><p>After he hung up i sat up. It was as if i was being held down against the seat. After a bit i struggled to my feat and swayed over to the computer and went on the net. It felt very odd to look at the screen and even moving my fingers to type and move the mouse required a huge effort. It was great fun. Moving my eyes even slowly caused my vision to swim and brought me out in fits of laughter. At about 12ish i felt queasy for about half an hour but sitting still and thinking about other things made it go away.</p><p>I found i could concentrate for only short periods of time and reading was extremely hard as i had to move my eyes. At about 1 am i went to bed but i didnt sleep for a while. I was just staring at the ceiling thinking about nothing. I woke up today at 11:30 feeling like i had just had a really good nights sleep.</p><p>I found codiene to be a relaxing drug, and as said in a few other comments it is great for relieving boredom. My friend and I are going to make more and use it whenever we have nothing to do. Much better than smoking weed by yourself.</p>",
 "year": "2001",
 "id": "7604",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-06-04T07:00:00.000Z",
 "views": "28624",
 "dose": {}
}
