{
 "title": "Reality, What's That Again?",
 "author": "Jacob",
 "citation": " Jacob. \"Reality, What's That Again?: experience with Salvia divinorum (ID 76043)\". Erowid.org. Oct 6, 2013. erowid.org/exp/76043",
 "substance": "Salvia divinorum",
 "bodyweight": "130 lb",
 "report": "<p>I consider my self a pretty regular drug user, smoking pot on the daily and drinking the occasional beer or two. I love to experiment with psychedelics, but my lack of access to them therefore limits my intake of them.</p><p>I have a small psychedelic background, including Acid, DXM, and Morning Glory Seeds, and probably a few others I can't recall at the moment. The only I have heavily experimented with is DXM, which I continue to regret to this day.</p><p>I have known about Salvia divinorm for several years now, reading many reports upon it and talking to many friends who have tried it. Hearing about it's short duration, and watching some humorous videos of people under it's influence, led me to believe it might be a mildly intense psychedelic experience which deserved my attention.</p><p>Well, my lucky day came when I went to a friends house to buy some grass, and he pulled out a bag full of black plant matter.</p><p>I immediately knew what it was, Salvia, 10X I believe, and the goofy smile on my friend's face assured me I was gonna try it.</p><p>My friend packed a good hit into a glass pipe, and I hit that thing like a champ without hesitation. I inhaled as much smoke as I could, released the carb, and held it in. </p><p>The taste certainly wasn't unpleasant, but not nearly as 'spicy' and flavorful as beloved Cannabis.</p><p>The instant I exhaled the Salvia smoke, was when I realized how wrong I was about the power of this spiritual plant. A very powerful buzz came over me, it felt almost as if I was having a cold sweat, but with no sweat, along with an odd metallic feeling. I quietly say 'whoaaaa', and then my memory gets hazy.</p><p>The instant after I felt the initial effects, I completely was deprived of the comforting knowledge that I had ingested a psychoactive drug, and that what was happening wasn't real.</p><p>I was having the most intense experience of my life, EVER. Acid in no way shape or form compared to the power and complexity of what I was feeling. I was completely unaware of my body, the fact that I existed, the fact that I was sitting in a friends apartment tripping balls. I guess I could call it loss of ego.</p><p>My reality began to change completely. I'll try to explain it as best I can.</p><p>Everything I was perceiving, or thinking, seemed to be moving on a 'film strip' before me. Everything that had happened and was to come right before my very eyes, moving like a galactic conveyor belt. This 'film strip' then began to conform to a shape, like putting wrapping paper around a present. Eventually I realized that there was a massive abstract shape, and everything that was going on in the universe (the 'film strip') was conforming to the shape of this massive figure, as if our whole reason of being was just to cover up some kind of large celestial mass.</p><p>At this time, although, I was absolutely terrified. I vaguely recall my friend trying to talk to me, and I saw this as his face coming out of the film strip and trying to speak to me, trying to help me come to terms with the fact that for eternity I was going to be observing the movement of time across across this galactic plane.</p><p>There were many other strange perceptions like this one, but it's hard for me to recall, and that was the most profound.</p><p>Well, during the whole extent of this experience, my friends tell me I was making odd noises and moving my arms in very strange ways. After the real 'tripping' I was left with a very intense body high and still a feeling of fear and confusion. This eventually left, and I found myself drooling like a damn baby.</p><p>My friend knew I had had quite a hard time, so we smoked a bowl of Cannabis, and I felt much better.</p><p>I wish I could have recalled this experience better, or explained it better, but quite honestly, the things I experienced on this plant can not be explained with concrete words. Language dwelling on tangible items just cannot describe the journey I took.</p><p>I was terrified, and it affected my mood negatively for the rest of the day, but later reflection of the experience has led me to believe it is a key to an otherwise unattainable part of our psyche, and due to it's short length and minor health effects, I recommend it to any informed psychonaut.</p>",
 "year": "2008",
 "id": "76043",
 "gender": "Male",
 "timestamp": "2013-10-06T07:00:00.000Z",
 "views": "536",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
