{
 "id": 7604,
 "title": "Kava Trance",
 "date": {
  "submission": "2001-03-06T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Divalion",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "423 mg",
   "administration": "oral",
   "substance": "Kava",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Well, right now I'm returning to a (semi) normal state of being. I wanted to try a megadose of kava, so I took 7 capsules each containing 110 mg of kava root (60.5 mg kavalctones).",
  "I basically entered a euphoric trance sort of a state about half an hour after taking the kava. I was calmer than ever, and I felt completely at ease.",
  "There was no mind trip, no hallucinations, and no general 'stoned feeling.' However I felt very different than normal. I felt like I was very light and easygoing. Someone could have been talking shit to my face and I would have smiled back. Then I decided to smoke a nice bowl of greens. After that, things turned even more incredible. I was so content with myself that I wanted to cry. All my questions were answered and I learned that deep down I am actually a lot happier than I thought. It was one of those life-changing epiphanies that I will never forget.",
  "Now (about 3 hours later) I am finally coming down. I was literally sitting in front of my computer staring at the screen listening to FSOL (their Lifeforms CD) with a smile on my face for the better part of the last 3 hours.",
  "The amazing part is, I was completely at peace. Normally I am worrying about this and that, and I am very uptight. Sometimes even when I am stoned. But I believe the kava acted as an enhancer to the other drugs in my system. Perhaps this is how it is best used? To maximize the effect of marijuana and basically guarantee a blissful high? I believe I will experiment with this mixture furthur and I promise to keep you posted with the results!"
 ],
 "erowid": {
  "id": "4672",
  "citation": " Divalion. \"Kava Trance: experience with Kava Kava & Cannabis (ID 4672)\". Erowid.org. Mar 6, 2001. erowid.org/exp/4672",
  "substance": "Kava Kava & Cannabis",
  "views": "36515"
 }
}
