{
 "title": "A Shortcut to Death",
 "author": "Bran Man",
 "citation": " Bran Man. \"A Shortcut to Death: experience with Fentanyl & Cannabis (ID 76065)\". Erowid.org. Feb 5, 2009. erowid.org/exp/76065",
 "substance": "Fentanyl & Cannabis",
 "bodyweight": "170 lb",
 "report": "<p>I've used fentanyl many times over the course of my career as an opiate/opioid addict, and it's definitely the strongest opioid I've used, and I've used them all.  I've had some very strong heroin in my days, but fentanyl is stronger.  I've seen people with no opioid tolerance pass out after smoking only 2 hits.  I've seen a heroin addict with a life-long tolerance nearly die from smoking fentanyl after drinking alcohol (he was revived by paramedics).  My good friend Richard died because he smoked fentanyl with alcohol.</p><p>A few hours ago I talked a friend into loaning me $80 so I could purchase a Duragesic Fentanyl patch.  In the past I've smoked as much as 2.5 patches in one night, but that was when I was very addicted.  I'm not physically addicted at the moment but I have been using a lot of opioids lately.  I've done about 600mg of hydrocodone, 240mg of oxycodone, and about a half-load of heroin (15 bags, $35 each) in the past 6 weeks, so I have a decent tolerance.  I haven't had opioids in about 48 hours and I'm not dope sick, so naturally, I'm going to celebrate by getting high. </p><p>As usual, I've been smoking a lot of high grade Cannabis daily, but for the past few days, I've ALSO been eating cannabis capsules each day.  I start by taking almost-empty containers of very potent hash oils, and then I fill them with sesame oil to absorb the hash.  I cover the tops of the containers so the oil doesn't evaporate, and I set them in a cool dark place for 24 hours.  I then shake the containers, or stir them if the top doesn't have an air-tight seal, and then I use an oral syringe or an eye dropper to add the oil to capsules of powdered low grade cannabis, mostly seeds, stems, leaves and low grade buds.  Even though the bud is pretty low quality, the sesame oil makes it quite effective in making a high more intense (any high), and it's even more effective when I add hash oil like I did this time.  When I eat these capsules and smoke Grade-A Cannabis, my opiate high is much more intense.</p><p>I used to just put the gel on foil, and 'chase the dragon' the same way one does with heroin, breathing in the smoke through a pen tube, but a few months ago one of my veteran junkie pals showed me a much more effective way to smoke it.  I take a piece of tin-foil, run a lighter over it to remove some of the chemicals on the foil (I have no idea if this works), then I put a small amount of fentanyl gel in the center of the foil, I then take a small bottle (10 oz - 1 liter), cut off the bottom of it, then wrap the foil around the big open end of the bottle, so that the gel is in the center of the inside of the bottle, and put a rubber band around the bottle to secure the aluminum,  with the edges sealed.  Then, I simply put flame to the outside of the foil, and inhale through the top, being careful to cover the top opening when I'm done so that I can inhale again to get any remaining vapors.</p><p>Well here we go.  I started by putting my cat out of the room so she won't get any second hand fentanyl smoke, and I'm about to start my smoking some top shelf medicinal cannabis as a warm-up (Jaws strain), then I'll start smoking fentanyl out of my 10oz bottle-pipe.  After smoking a few hits of very good weed, I loaded a glob of fentanyl about the size of 4 match heads, or the size of 1 large grill-match.  I then put a bit of tape over the small hole I've made in the patch, so that the gel doesn't dry out, then I put it in a zip-lock bag and put it in a cool dark place.  I put my mouth over the opening so the smoke doesn't excape, then I hold a lighter under the foil for 2 - 3 seconds, and then I take a full deep breath AFTER the flame has stopped.  It's important to breathe in very hard since the pipe should be almost air tight if made correctly.  I smoked the glob in about 3 hits.</p><p>After the first hit, I mostly just feel a bit funny, and mildy relaxed, and after the second hit, I feel quite good, and very relaxed.  After the third hit, I start to feel very hot, and my stomache starts to knot up a bit.  I always know I'm getting high when I start to feel like I'm hot, I even run a fever sometimes when I'm high on opiates/opioids.  Fentanyl isn't the most euphoric opiate in my opinion, but it's definitely one of the strongest.  I'll be getting drug tested soon, which is partly why I'm doing fentanyl instead of heroin tonight.  Fentanyl is also more cost effective than heroin in my area (Arkansas).  There was a time when I always got so high on opiates that I would vomit, but lately I've realized that it's often more enjoyable to just get high enough to be very relaxed, without all the hassle of vomiting and hangover.</p><p>It's been about 15 minutes since I started smoking fentanyl, and I feel very relaxed.  Part of me wishes that I had someone to share it with, so that I'd have some company, but the junkie in me quietly reminds me that If I share it I would regret it when it's gone.  I'm starting to think of my history of recreational opioid use, and how my tolerance has gone up.  When I first used opioids, I could get very high from 15 - 20mg of oral hydrocodone, and these days it takes me at least 50mg of hydrocodone to get high, or as much as 200mg when I get addicted.  In my opinion, physical opioid addiction really doesn't take effect as quickly as most people think it does.  I snorted a fairly large amount of heroin each night for 9 nights in a row, with some oxycontin mixed in as well, and I really didn't have any withdrawals except for a bit of pain in my legs and trouble sleeping at night.  After 48 hours I still wasn't feeling physically dopesick, but I'm obviously exhibiting some signs of 'mental addiction' since I've spent about $1,000 on opioids/opiates in the past 6 weeks.  Well thats enough pondering for now, I'm going to smoke some more cannabis and fentanyl.</p><p>Well I just smoked some more high grade cannabis and it brought my high back very quickly.  Sometimes I don't realize how high I am until I smoke pot, since I smoke pot all day every day.  I guess I'll wait a bit longer to smoke more fentanyl.  I'm very glad that I can now enjoy getting high on opiates without getting so high that I feel like I've been poisoned.  Even though the intense euphoria of opiates quickly goes away when a person uses them on a regular basis, the relaxation and sense of well being is still there.  My stash lasts a lot longer when I do smaller doses, obviously, and delays addiction to some degree.</p><p>After the first night was done, I had smoked about half of my fentanyl patch.  It's now the second night, and of course, I'm going to smoke the rest of the fentanyl.  I started out by smoking a larger glob this time, then I took .5mg of Xanax (quarter of a bar) and I'm going to watch Fear & Loathing in Las Vegas while I enjoy my fresh Dank Cannabis. (OG Kush x Snow strain), which is every bit as enjoyable to me as the Fentanyl.  Wow!  I just remembered that there was .7 grams of hash included with the dank I picked up, and luckily I dug it out of the trash before garbage day.  Silly me!</p>",
 "year": "20052008",
 "id": "76065",
 "gender": "Male",
 "timestamp": "2009-02-05T08:00:00.000Z",
 "views": "32488",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Cannabis - Hash",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Pharms - Fentanyl",
   "form": "(liquid)"
  }
 }
}
