{
 "title": "My Ideal World",
 "author": "yoman",
 "citation": " yoman. \"My Ideal World: experience with MDMA (ID 76171)\". Erowid.org. Dec 25, 2012. erowid.org/exp/76171",
 "substance": "MDMA",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Not too long ago my sister and I attended a big event (a rave, if you will) in Los Angeles. We picked up the pills (two blue Mercedes) at a hotel about a mile away. I already had one molly (pure mdma powder) and a pink gun. The rave started at 7:00pm, and my sister and I decided to start walking there around 5:15 to get in line since it was such a big event. As we were walking, we already saw plenty of ravers walking there too, wearing the big baggy pants, beads, and giving light shows while walking down Figueroa. We finally arrive, and we saw much less people standing in line than expected. Id say there were about 200 people in front of us, give or take. So I thought to myself, Sweet, well get in super early. So we patiently waited in line, smoking cigarettes, while people watching.</p><p>These events are all about freely expressing yourself, so you see a wide range of people. You mostly see the kandi kids, who wear tons of kandi (beads) and suck on pacifiers; however, anything you could possibly imagine youll see. As were standing there a group of people came and stood behind us. A tall girl with blond 80s rock hair came and she stood out for some reason. My sister and I were standing, minding our own business, and I hear a flamboyant gay guy talking behind us, so I turn around to find out it was the tall blond girl we had seen. Also while standing in line I noticed a guy wearing a tutu, he was obviously rolling (it was easy to tell); all of a sudden he started running and I noticed another guy wearing a tutu. They run up to each other from opposite directions, jump up, and hug each other. It was quite a site to see, but we just looked at each other, shrugged, and minded our own business.</p><p>Now its about 6:30pm and Im wondering why they were letting people in yet, since the event started at 7pm, and the opening act from was supposed to be amazing. A homeless black guy was pushing through the crowd saying Hash and Opium, trying to make a quick buck off some gullible e-tard. Everyones smoking cigarettes, some weed. The predominant age group of everyone I say was about 17-20, a lot of younger than one might expect. The line has barely moved. Some people are rolling. This one girl was walking up and talking to random people, while feeling herself and having involuntary jaw movements/teeth grinding (total signs of being on ecstasy). She even came up to my sister and complimented her hair, which is ironic because my sister was complaining about how bad her hair looked the whole day. Another guy was standing close to us, stomping his feet and chewing his gum fiercely. We could hear the rushing bass on the other side of fence and eagerly wanted to get through the gates. </p><p>At this point more and more people are starting to roll, while in line, and so people start giving light shows. For some reason, these two small Mexican girls dressed as princesses really caught my eye. They were both wearing tutus and tiaras, and every once in a while Id make contact with them but theyd look away really quickly. I couldnt tell if they were rolling or not. At this point the line keeps growing and people are starting to get angry, including me. I was sick of being stuck in a crowd of bunch of annoying drug addicts, where I literally couldnt even move my arms. I honestly wanted to leave at one point.</p><p>Eventually its about 9pm, and I think Ill be inside the gates within in hour so I decided to take my first pill, the molly. I knew it was cut with pixie stick (yes, the sugary candy) so I figured I would be fine, given that Id feel anything at all. For the next hour Im waiting to feel something, asking my sister repeatedly if my eyes had dilated at all. Its just a little before 10pm, were still in line and I start to feel a little different. I give my 33 year-old sister a big smile for no apparent reason. My sense of touch has changed. Being stuck between all these people is no longer annoying, but actually somewhat pleasant and comforting. I ask my sister, Are my eyes dilated? She replies, Ohhhhh yeahhh. Im rollin.</p><p>I ask her to massage my neck, and the harder she massaged the further the eyes would roll to the back of my headthats how good it felt. I closed my eyes while she was doing it and I felt like I was in a completely different world, it was like nothing Ive ever experienced. It felt amazing. I told her, I feel like Im a little kid again. And this Hispanic guy right next to us wearing a bandana over his mouth and those creepy looking contacts (the cat ones) looks at me and just nods his head, knowing exactly what Im talking about. I feel great and probably peaking at this point, but its killed because we still havent even gotten into the rave yet!</p><p>Finally I get checked by a security guard wearing a yellow jacket, he says to go on through. Next thing I know I see two other people standing in front of me wearing yellow jackets, one this short, stubby black female. I thought they were more security guards so I was extremely confused, and peaking, and tripping out. Im just standing there rolling balls, not having a clue what to do. Ummm, your ticket? says the short black lady, followed by a loud burst of laughter only black women are capable of. I smile and think to myself Oh god, Im pretty fucked up right now. I give her the ticket, and catch up with my sister and we walk down this passage between to chain-linked fences. We were finally here.</p><p>The first thing my sister and I do is light a menthol cigarette and look around. Such a crazy atmosphere. Walking through the entrance was like stepping into a whole new world, especially from standing in line right outside for 5 hours. Everyone you see is on ecstasy, or whatever preferred substance, but most likely ecstasy. I see people dancing intensely, horribly in fact, but no one cares. People are just feeling the music and dancing freely by themselves. Other people are sitting on the ground getting light shows, some massaging each other, some just totally zoned out. The music at this point is sounding so intense and amazing I cant but help but put my arms up and literally just feel the music. I look around, everyone is smiling. Some people, random strangers, stop and say hi before walking to whatever their destination may be. Theres no hate. Everyone is respectful of everyone else, no matter how crazy he or she might be perceived in the real world. The energy and atmosphere I feel at raves like this is something Ive never experienced anywhere else and doubt I ever will.</p><p>At this point I need to hit the bathroom and get some water. So my sister and I enter the arena which is swarming with drugged up kids. We head to the concession stand which I expected to be packed, but there were only one or two people in front of us. We get two waters. Then I go to the bathroom while my sister waits and then vice versa. While shes using the restroom and Im holding the drinks, I decide to sit against the wall, which felt pretty cozy. As Im waiting there a boy comes up to me and asks, Want a lightshow? I, still rollin' hard, get all excited like a 5 year-old on Christmas, my eyes light up, and I say yeah! like a little kid. The lights looked like nothing you can ever imagine unless youve experienced a lightshow on ecstasy yourself. You literally become in a trance. Im just sitting there looking all googly-eyed, looking like a complete retard to the hundreds of people walking by, but I didnt care. Eventually he said Alright man, Im getting tired. I immediately say Thank you like I mean it and smile, shake his hand, and he walks away not knowing (actually, Im sure he does) what a crazy state he just put me in for that minute or two.</p><p>My sister finally makes it back and we finally walk up the steps into the arena where the main dj was spinning the whole night. My sister, who wasnt on anything at this point, let out a fuck yeah! once we got to the top of the steps. The lights and lasers and music was almost overwhelming  it was all so beautiful. Tons of people are up and dancing in the stands, some just sitting, looking dazed, probably coming down. People are getting light shows. People are giving light shows. People are massaging each other. People are hugging, smiling, just having the best time of their lives. I felt so at home with these thousands of strangers. The vibe was such a positive one and thats what I loved so much and wish I could feel in everyday life. My sister and I find a good seat where we can see everything, and I give her the pink gun pill and she pops it. Out of the blue these two girls sitting behind us put one of those electric hand massagers on my head and shoulders, and at this point, the colored lights lights, the music, the positive vibes and people...this is ecstasy. This is where the name came from. This is the experience people are looking for. Youre happy, everyone around you is happy. Not a worry in the world. What could possibly be better?</p><p>After the amazing massage I ask the girl what her name was and she said Bear. I said What? just to make sure I heard it right. Bear. Like the animal.  Oh cool!  What about yours?! My names Apollo. Nice to meet you! Isnt this awesome!!!  Then we turn around and dance some more, get more amazing massages from them. Then I ask them if they want to trade kandi. You trade kandi my holding each others hand, and then sliding your bracelet onto their arm while youre holding hands.  She replied with excitement, Yeah! Let me find a good one!  She digs through the endless number of bracelets on her arms and says Heres one with a star, because youre a star! *smiles*  And then I say This is my sisters first rave! and she looks for another piece of kandi and says to my sister Heres one with a bear claw, that way youll always remember me. Smiles everywhere. I get a text from my friends cousin who took me to my first rave...he wants to hang out. So I turn around, say It was so great meeting you guys! Have a great night! Gave them a hug. And went on our way. It felt as if we all had just instantly bonded on such a deep, profound level. As Im writing this it still blows my mind how connected this drug made me feel to these complete strangers.</p><p>Now I go to find Ryan and all of his friends, whom Ive hung out with at the other two raves Ive been to. Theyre a bunch of awesome people. So my sister and I walked up the stairs in the very back of the arena, which had the best view of the lights. I see Brian standing up and waving to me, and I smile and walk past a couple sitting down and give him a hug. Then I say hi to the rest of the group, everyone welcoming and nice as usual. My sister and I sit down, enjoying this new, better view of the lights, the music still sounding heavenly.</p><p>Occasionally during the buildup in songs (almost to the climax), thousands of strobe lights would go off, and my eyes would go out of focus and roll to the back of my head. It was such an intense, awesome feeling. During one song I held on to my sister and yelled, Holy shit! I cant handle this! Then I was given countless numbers of light shows, all of which were absolutely amazing. Ryans friend Timmy gave me a lightshow with an orbit and I was in a total trance, in a total world. My eyes just focus completely on the lights (then blur out), the feel of the bass rushing through my veins, and the high pitch of the synthesizers flowing so smoothly. It was indescribable. Ryan was sitting next to me looking at me get the light show, though I was so in a trance I didnt know he was there and until Timmy said holy shit, this guys already fucked up! and then Ryan yelled thats called over-stimulation!!! Nevertheless, it was all amazing. Timmy or Ryan, I honestly dont remember which gave me an incredible neck and head massage where he would rotate my whole head and then do lots of meticulous things with his fingers that I could feel in detail. It felt like I was visiting a chiropractor. Every touch felt so precise, not to mention, so damn good.</p><p>Unfortunately I didnt enjoy the massage as much as I possibly could have because at the time I was trying to coordinate meeting up with a friend I had made online named...Gloworm. Yes, thats all I knew her by. It took a while but finally in the concession stand area I see her turquoise sweatshirt and we immediately hug each other and smile and say how nice it was to finally meet, and continue hugging. She introduces me to her friends, one of which was sucking on an ornately decorated pacifier, the other guy chatting non-stop. Theyre names were Brunho and Hack, respectively. Hack, a black gay guy probably around 20 years old, shook my head and ask me to squeeze his nipples really hard. He lifts his shirt, and as requested, I squeeze his nipples. Harder, he says, and I follow, just laughing and frying away. Gloworm keeps looking at me, saying Youre so cute, and continues hugging me. Then her friends were ready to be on their way and they start to leave, and she just keeps hugging and says Wait to her friends. We continue hugging, which felt so comforting, we look at each other and kiss on the lips for a few seconds, which also felt great. We then trade our kandi that we made specifically for each other. I show her the one I made her before I slide it onto her arm and she looks at me in the eyes and goes awww.  Then eventually her friends convince her to leave she apologizes for having to go so soon. We kiss again and then we each go on our own separate ways, happy as can be for finally having had the opportunity to meet.</p><p>The rest of the night I hung out with my sister and Ryans group again, doing the same as wed been doing all night. I remember looking at my phone and realizing everything was about to end in 15 minutes and told my sister, I dont want this to end! and she replied They should just keep it goin. Finally it was over. No more flashy lights. No more intense music. The arena we were in was once again just that. We left and I was still happy and feeling the drug, but it was definitely slowly dissipating. It didnt help that almost everyone else was pretty much down at this point. We walked back to the hotel at 4am. We head up to Ryans room where my sister and I use the restroom and then head to our car. At this point Im coming down and feel extremely physical tired, but my brain...the best way to describe it is, it felt like there was a storm in my brain. Just like 1314230423 things going on at once. At this point I realize Ive been on a drug for the past few hours! We then attempted to drive to my brothers apartment in Orange County. My sister, who was no longer under the influence was driving. She kept smoking cigarettes in the car, and that made me feel nauseous, even though Id been smoking a lot throughout the night. Then she turned up some trance on her radio real loud and I just had to turn it down cuz it made my head throb with pain. I got this super horrible headache right smack in the center of my forehead. I had this weird feeling like taking 3 that night might have been too much, but then I told myself that I just needed to go to bed. It was all in my mind. We finally arrive to my brothers place and I immediately hop in bed and try to sleep, even though my head was still ringing. Coming down on e is when you realize, Damn, this is a DRUG. It aint pot or alcohol. My brain felt used.</p><p>The next day I was extremely tired and just wanted to lie in bed all day. Occasionally I would get another headache in the center of my head. Unlike the previous times Ive taken ecstasy, the worst days were 3 to 4 days later. I just felt super depressed, and it wasnt one of those feelings you could just snap out of. I also had a short fuse and would get angry at things pretty quickly. Its been a week now and Im finally feeling normal and happy again. But the comedown and after of this experience were by far the worst Ive had.</p><p>Was it worth it? Yes. Each time Ive taken ecstasy at a rave setting its really been an amazing experience thats taught me a lot. When Im on it and at a rave I feel so connected to people and I just love how everyone is nice to each other and theres no judging  you just feel like you can be yourself without any restrictions. And youre just so optimistic about everything. Everything about it  the music, the lights, the people, the shift in perspective  are all worth the holes in the brain, in my opinion. Its an experience that youll never understand unless youve done it, and I know that lots of people are gonna judge me because its a drug, but I dont care. Its not like Im doing it every weekend, and in my opinion the experiences are worth it. If only everyone could be as nice to people as they are on ecstasy as they are in real life. I guess thats the depressing thing once the drug is over. You realize youve been living in an ideal world for the past few hours, and now youre back to this.</p>",
 "year": "2008",
 "id": "76171",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-12-25T08:00:00.000Z",
 "views": "1397",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
