{
 "id": 7618,
 "title": "Go Really Well Together",
 "date": {
  "submission": "2007-09-23T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Jaronzello",
  "gender": "Female",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": "4:00",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  }
 ],
 "report": [
  "One Saturday afternoon my friend called to tell me she was getting some footballs, and wanted to know if I wanted any.  I got 6, and we took them early, at about 6:30 pm.  I had the typical 'barred out' experience.  My friend went home around 10.  Another friend stopped by at 11, with a bottle of Robitussin 8 hour cough gels.  I decided I might as well join him, the night was still young, and went to buy a bottle.  I took them around 11:30.  I should also add that I have a LOT of experience with DXM.  The cough gels are time released, so it took about an hour to hit me.",
  "I don't remember a lot of the trip because I was barred out, but I remember being very speedy, and I was having hallucinations.  They were not unpleasant or scary, nor were they vivid.  It was just geometric patterns spilling out of the corner of walls, off my friends face.  I was having a good time.  I also had VERY vivid closed eye hallucinations.  I would go into my own little place for 15 minutes or so, spiraling through colorful tunnels or walking down a road lined with colorful trees.  It was a very enjoyable experience.  I guess the xanax and the DXM go really well together.  I never felt sick, or dizzy.  I don't know how it would be if you took them both at the same time, but staggering the ingestion was very nice."
 ],
 "erowid": {
  "id": "46794",
  "citation": " Jaronzello. \"Go Really Well Together: experience with Alprazolam & DXM (ID 46794)\". Erowid.org. Sep 23, 2007. erowid.org/exp/46794",
  "substance": "Alprazolam & DXM",
  "views": "12677"
 }
}
