{
 "title": "Not Too Sure What To Think About This Drug",
 "author": "Nik",
 "citation": " Nik. \"Not Too Sure What To Think About This Drug: experience with 2C-D (ID 76197)\". Erowid.org. Jan 25, 2009. erowid.org/exp/76197",
 "substance": "2C-D",
 "bodyweight": "74 kg",
 "report": "<p>First a little background info about me. I am an experienced MDMA user for about 15 years now (wow, time is running...) and had so far only one psychedelic experience with magic mushrooms which I enjoyed but rather dont want to do again. Other than that I tried amphetamines and cocaine several times. I'm physically in good shape (doing sports) and live a healthy life (food wise).</p><p>I ordered 1 gram of 2C-D online. The powder is white and looks like almost any other drug.</p><p>The day I tried it out I woke up at around 10 o clock on a saturday morning. I took a toothpick and dipped it about 1cm into the powder and swallowed this much of it. After ingesting the powder to my empty stomach I went to the supermarket to buy some food. Around 1 hour later I first felt some effects. The only effect I noticed was that I had a blurry vision. I did not feel any nausea or discomfort. First I thought the blurry vision comes from the cold air (we have minus degrees at the moment) but the blurriness did not subside in my apartment. I unloaded the purchased food and dipped the toothpick about 1cm into the powder again twice. After ingesting it I left the house again and headed to another supermarket to buy the rest of the food I needed. I would assume that I took about 15 to 20mg of 2C-D in total  although I really cannot confirm this (I yet have to buy a precise scale).</p><p>Around half an hour later I returned home from shopping. Thats when I definitely felt the effects. The blurriness of my sight got stronger and stronger. It was like I was heavily farsighted. Every close object was hard to see blurry. If I focused something in a distance I could see it crisp clear. Driving a car in this condition is absolutely not possible (I went to the supermarket by bike)! I also noticed that I started to sweat. My hands were pretty wet and I felt a raised body temperature. The sweating was through the whole experience.</p><p>I sat in front of my computer and listened to some trance tunes. I felt like the music completely consumed me and I literally was in the music. The effects started to get stronger and I began to feel uneasy. I guess I was not really prepared for a psychedelic trip! The sweating increased and the blurriness of my sight, too. I felt kind of fuzzy and had to concentrate more to focus on anything. But once I got the focus on something I could keep it. I chatted with some friends on MSN when I noticed that my hands sort of had their own movement without my actively controlling them. But I was glad about this because my thoughts seemed to be kind of clouded. I absolutely do not believe that 2C-D is a smart drug at all. I got distracted by little things and because of my blurry sight I could not really do anything which needed a lot of my attention.</p><p>Whenever I sat still for a moment I started to float above my head. It kind of felt like my mind was flying a few centimetres above my head. But as soon as I focused on something the floating disappeared. After a while I started to feel a nice tingling under the skin in my entire body. It felt very nice and almost had a bit of an erotic feeling. My skin felt very warm and nice. The second I did not think about my body (especially my arms) I started to feel like I was floating above my head again. My arms felt extremely light, almost if they would not exist. I had the absurd fear that I might lose control over my arms. At this moment it felt like they were not a party of my body.</p><p>In terms of visuals I did not have any altered perception of reality. I neither saw any vivid colors nor did I see the walls breathing whatsoever. It just felt like the white was slightly brighter than usual.</p><p>I decided to go out to cool off a bit because I felt a little uneasy. Took my bike and drove downtown. When I was with a lot of people I realized that I was kind of introverted. I did not notice the people around me and was lost in my own thoughts and actions. It was like I mentally was in my little world and no one could distract me. However, the coldness seemed to lower the effects of the drug.</p><p>About 5-6 hours later most of the effects seemed to disappear. I still felt that there is something in my body. The sight is still a little blurred, especially close objects are hard to focus.</p><p>My retrospect:</p><p>Not sure if Im a fan of psychedelic drugs at all. The blurriness of my sight was very unpleasant. While on the plateau (I assume) I really had a hard time to see anything close to me at all. Other than that I sometimes felt uneasy but never was scared, though. I guess the compound is okay for a psychedelic beginner since the effects were pretty mild and I easily knew that they came from the substance and were not real.</p>",
 "year": "2009",
 "id": "76197",
 "gender": "Male",
 "timestamp": "2009-01-25T08:00:00.000Z",
 "views": "9686",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "2C-D",
   "form": "(powder / crystals)"
  }
 ]
}
