{
 "id": 7620,
 "title": "One Step Forward, Two Steps Back",
 "date": {
  "submission": "2005-11-09T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "22 mg",
   "administration": "oral",
   "substance": "Mirtazapine",
   "form": "daily"
  }
 ],
 "report": [
  "Nearly a year ago, two weeks before thanksgiving, I decided that life wasn't worth living; that I'd lived to the fullest and thrown it all into the toilet with the methamphetamines. That the antipsychotic stupor of the risperidone, prescribed to combat schizofrenic symptoms, was worse than death at my own hands.",
  "I took a bottle of Lorazepam, the generic benzodiazepine solution to expensive name brand drugs like Ativan, lit some candles, ate a small last meal of tortillas and sour cream and prayed they'd meet the LD 50. I woke up in the hospital, reeking of urine and being told that I was lucky that I'd only had half the dose required to kill me.",
  "I was treated to a state sponsored stay in the psychiatric ward on a 302, put on round the clock surveillance, no visitors, no smokes, nothing to drink but decaf coffee and rust-tainted city water. Given my case history presenting aural hallucinations from a lengthly crank addiction, the doc decided on Remeron (Mirtazapine, 15-30mg/daily), not an antipsycotic, but effective in schizofrenia case studies.",
  "A year later, and the new doc says that Paxil is the way to go. I agreed because I was sick of feeling tired all the time, old habits die hard, and the meth fiends come knocking on my door every three months like the period from hell.",
  "I haven't slept since the night of my last dose of Remeron. I'm running on three or four hours of interupted sleep each night. Hypomania was great the first few days, the body buzz, heat flashes. Now I'm tired, hungry, and unable to sleep. Haven't eaten in days, constant belly aches, feeling queasy. Dry mouth, fatigue, and back pain.",
  "Remeron kept me alive, but it wasn't the breakthrough I was hoping for."
 ],
 "erowid": {
  "id": "46798",
  "citation": " Anonymous. \"One Step Forward, Two Steps Back: experience with Mirtazapine (ID 46798)\". Erowid.org. Nov 9, 2005. erowid.org/exp/46798",
  "substance": "Mirtazapine",
  "views": "14706"
 }
}
