{
 "id": 7625,
 "title": "Legal experiences with Fentanyl",
 "date": {
  "submission": "2006-07-18T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Soren",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "25600 ug",
   "administration": "buccal",
   "substance": "Fentanyl",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "200 ug",
   "administration": "transdermal",
   "substance": "Fentanyl",
   "form": "daily"
  }
 ],
 "report": [
  "I was diagnosed with a brain tumor in 2002 after having very severe headaches and vision changes.  My neurologist ran the gamut of Rx options for headache management, with very little success, and ended up beginning opiate therapy.  As with all the other medications, I developed a quick tolerance for the medications - we quickly ran through Oxy- & Hyrdo- Codone & Morphone, Demerol, and Morphine.  Exasperated, I started using the 800mcg Actiq lollipops four times a day in 2003.  Once again, tolerance kicked in quickly.  Additionally, my neurologist moved and my GP ended up handling my medication dosing - and all he did was increase the dose every month.  In December of 2004, he had enough of prescribing potenitally lethal doses of fentanyl (which I took to remain functional and go to work, provide for my family, etc.) and told me I needed to see a pain management specialist to get these medications.",
  "The pain management doc was frustrated - by that point, my GP had added the Duragesic patches to the mix to level out the overnight withdrawal I was ending up in.  I was taking 16 1600mcg Actiq a day, and wearing 2 100mcg/hr Duragesic patches - BUT, I had no problems with pain and was fully functional.  The big question was, did the fentanyl make the headaches stop, or was it some other treatment I had done in the meanwhile.  (At this point I was on 43, yes, forty-three, separate prescription medications - several just to manage the side effects of other medications.  So there was some question as to what was actually 'doing the trick').  The decision was made to taper off the fentanyl and see what the base level of pain was, and then re-assess.",
  "Let me tell all you recreational users of Fentanyl out there one thing - DO NOT get physically dependant on Fentanyl.  I have been through opiate withdrawal in the past from other narcotics, and let me tell you it was a walk in the park compared to stopping Fentanyl.  I'm writing this in October of 2005, during my first full week without any fentanyl, and let me tell you - my life since December has been a living hell.  I never got a 'high' from any opiate I've ever taken at any dose, so I'm not normal, or maybe it's just my liver problems, but don't take this stuff for long if you have any plans of stopping it.",
  "As my pain management doc says - this stuff was designed for terminal cancer patients (which, by the way, I'm not - I'm expected to live a long life with my little friend in my head).  Anyway, most of the patients, unfortunately, die before having to stop the medication, so no one ever bothered to study how physically addicting this crap was.  Let me tell you - after one month of 800mcg 4 times a day, I couldn't stop if I wanted to.  If it hadn't been for some understanding doctors, I could have easily been knocking over a pharmacy to stop the freakin' withdrawal symptoms.",
  "Here's the humorous postscript - after stopping the fentanyl, the headaches came back.  So, my new neurologist tells me, maybe we just put you back on the fentanyl.  I gave him that blank stare for a few seconds and finally told him that he had better be damn sure, because I wasn't touching that stuff again unless I was going to be on it until the day I die.",
  "So, I guess my point is, have fun, but don't have it too often - it's not worth the price."
 ],
 "erowid": {
  "id": "46825",
  "citation": " Soren. \"Legal experiences with Fentanyl: experience with Fentanyl (Lollipops & Patches) (ID 46825)\". Erowid.org. Jul 18, 2006. erowid.org/exp/46825",
  "substance": "Fentanyl (Lollipops & Patches)",
  "views": "30961"
 }
}
