{
 "title": "Unique Psychic Difficulties 14 months After",
 "author": "DJ2008",
 "citation": " DJ2008. \"Unique Psychic Difficulties 14 months After: experience with Ayahuasca (ID 76251)\". Erowid.org. Jul 16, 2009. erowid.org/exp/76251",
 "substance": "Ayahuasca",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Ayahuasca",
  "(liquid)"
 ],
 "report": "<p>I am posting to Erowid for some *clinical* input and guidance involving Ayahuasca, which I took in ceremonies nearly 14 months ago.</p><p>A little over a year ago, I attended an Ayahuasca workshop  my first  in the southeastern Peruvian Amazon. I went with the core intention of seeking healing work, as I had been suffering from daily dizziness, fatigue, anxiety and some depressive symptoms since the fall of 2001 [I have since learned that these symptoms were due in large part to chemical imbalances resulting from chronic stress, worry and masturbation, despite not being fully clear on causality prior to preparing for Ayahuasca].  Since that workshop and my experience with the plant medicine, I have endured the hardest year of my life due to not only the original symptoms remaining unresolved, but continuing anxiety, depersonalization, very heavy panic and depression  levels of which I have never felt before.  I have been unable to focus on critical tasks, let alone earn a living, due to said conditions and am at a loss for what to do.  I was urged to post a report by someone familiar with the plant medicine on a medical help website in order to understand why my experience with the yage differs so much from those of others (at least as far as I have read), as well as how I can heal.</p><p>I am a nearly 38 year old male, and took Ayahuasca while 36. I do not have any other experiences with hallucinogenic drugs/agents, have never smoked, rarely drank alcohol, and was not/am not on any SSRIs.  I had heard about Ayahuasca from a family member who had been partaking in ceremonies for a few years prior, and swears by the yage for not only helping him tackle his chronic depression, but for achieving multiple spiritual breakthroughs and illuminations.  Prior to committing to go the workshop in Peru, I read many articles online  both from popular press (including that National Geographic article everyone else did), as well as portions of Benny Shanons book, Antipodes of the Mind.  I watched videos showing the ceremonies on the internet.  I found all of this personal research on Ayahuasca to be generally reassuring, nay motivating.  I shifted my diet and followed other instructions as provided by the staff of the workshop.  I had also written to said workshop (as requested) with as thorough a case of my motivations for wishing to attend its leg in the Amazon, and got a clearance and invite to attend afterwards.</p><p>The ceremonies  particularly the third of three  was incontestably the hardest experience Ive ever been through in my 38 years.  The effects of the yage lasted for nine hours, and I was unaware that they could go that long.  Thus, I felt a terrifying sense of being stuck in that nether-state of loose consciousness, and the presiding Shamanic practitioner had to bring me back to my room and perform what I sense was a soul retrieval on me while trying to calm me down.  Nonetheless, the day after this third ceremony, I felt a horrid sense of loss and depression, things seemed generally much darker, and these moods/feelings havnt lifted since (this was, again, late November 2007).  Notedly, this same young Shaman urged me to come back for further work, as he sensed I needed it.  I am not confident after these very difficult 14 months to revisit Ayahuasca, yet am seeking healing from its aftereffects.</p><p>Nearly three weeks after arriving back from the workshop in Peru, I started having severe panic attacks, heavy depersonalization, otherworldliness, and a feeling that I was in Hell.  Pretty regularly thereafter, I experienced feelings of very heavy darkness, where life just seemed/seems like it is void and meaningless, lacking compassion.  All very new and shocking moods and sensations to me, despite my having dealt with much milder and less sustaining bouts of anxiety and depression in the past.  No, this feels morbidly permanent.  I sense that the most disturbing perceptions and sense of hopelessness I experienced during that third ceremony with the yage has been continually looping itself over the past 14 months, in a form of Post-Traumatic Stress Disorder.</p><p>Ive seen three separate therapists/psychologists, done yoga, meditated with binaural beats-containing CDs, and, for the past three months, committed to an intensive vitamins/supplements regimen to try and right my brain chemistry.  This has been under the guidance of my latest therapist, as an alternative to taking SSRIs or anti-depressants/anti-convulsants.  I went this latter route only after having the very worst panic attack Ive ever had on October 6th, which felt like it was an outright seizure.</p><p>The evenings get difficult.  Its like a cloud of depression hovers over me when the sun goes down.  This never used to happen before I took Ayahuasca.</p><p>I also went to a reputable Shamanic practitioner who is local to me, and who told me that I had indeed sustained soul loss in Peru.  He subsequently performed a soul retrieval in early November 2008, yet I am still dealing with these heavy symptoms (although I havent had an outright panic attack since starting the vitamins, it feels like I could go there with enough heavy anxiety once again).  Every day is a vigilant battle to prevent spiraling anxiety.</p><p>Two acquaintances  one in his mid-60s and one in his late 20s  shared their experiences with hallucinogenic agents, which somewhat have mimicked mine.  The older one took peyote 44 years ago as part of a college psychology class experiment, and subsequently sustained a yearlong sense of heavy depression and psychic devastation.  The younger friend took LSD six years ago and also had a yearlong sense of heavy depression, where his personality significantly changed, and the streets he lived and worked on since childhood didnt look or feel the same.  The descriptions from both resonated with my current experience.  They both eventually recovered their psyches and reassured me that things would improve with me as well.</p><p>However, Im still lacking in energy, regularly dizzy, and anxiety-ridden, and often experience disturbing thoughts... all nearly 14 months after the Peruvian workshop.</p><p>Questions:  What couldve happened?  Is my current condition wholly abnormal to the Ayahuasca experience?  Again, I do not have a history of experimenting with any other psychotropic, psychedelic or controlled substances prior to taking yage thrice over three separate nights.  I understand that it is a sacrament in Shamanic cultures and I approached it as such, as best as I could.  Due to uncontrollable anxiety, Im just very frightened over the sense that I have permanently damaged my brain and mind, and need some clinical guidance.</p><p>I am not willing to go on SSRIs/anti-depressants, despite certain friends and family members urging me to do so in order to be able to work again.  The whole point, ironically, behind going to Peru was to avert any reliance on SSRIs/pharmaceuticals.</p><p>[Reported Dose: 1st session -full cup 2nd session-quarter cup 3rd session-quarter cup.]</p>",
 "year": "2007",
 "id": "76251",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-07-16T07:00:00.000Z",
 "views": "18779",
 "dose": {}
}
