{
 "title": "Living in Ecstasy",
 "author": "Pookyhead",
 "citation": " Pookyhead. \"Living in Ecstasy: experience with Ecstasy (ID 763)\". Erowid.org. Oct 12, 2000. erowid.org/exp/763",
 "substance": "Ecstasy",
 "bodyweight": "108 lb",
 "report": [
  "<p>My best friend Goku, whom I have known for years, had been rolling a long time, and would always call me up in the midst of his trip, begging me to try it. We have been through just about every drug together. I was always terrified of X, though, and since I had heard it makes you horny, I was convinced he wanted me to do it so he could take advantage of me (even though I have a boyfriend). Well, I don't know what happened to change my mind one day...I was having deep problems with my boyfriend, and when Goku called up, he finally got the answer he wanted: yes. And let me tell you, that was the best decision I have ever made. I have become a completely different person, all for the better. I achieved a dream I have always dreamed about. I have been rolling about seven months now, and I have had experiences from mind-blowing to scary to crappy, but as you all know, nothing beats the first time. And now I will tell you how it all came about.",
  "Goku was very excited, and got some 'Orbiters' from his dealer. They were relatively small, with no symbols, and had light little spots. I picked Goku up from his house in Homestead at around 9 p.m. and we immediately dropped. I took just one pill. We then drove to a Wal-Mart on the other side of town to get glowsticks. The whole time, I did not know what to expect. I had only heard it was incredible. Goku kept asking me how I was feeling, and all I could say was that I didn't know. By the time we got to Wal-Mart, I had a huge grin on my face, and I didn't even know why. I didn't feel anything, and I was starting to get a little disappointed, but I just could not stop smiling. Goku instructed me to stop grinning at everybody. After we bought the glowsticks, we were walking back to the car, and BOOM! I suddenly felt kind of high. I clearly remember saying 'Uh oh, I think this is it...' and getting in the car. It faded for a moment, but then Goku put on a good high energy trance tape. We were driving down the highway and a particularly good song came on.",
  "And then it happened: that higher knowledge. I said 'Oh my God, I finally get it.' I kept saying this and laughing, a laugh of pure happiness. I was sitting indian style in the passenger seat, and the car ride felt so smooth i thought we were floating. As I said to Goku, it felt like we were on a magic carpet, and that we were visiting this world from another galaxy, and even though we could see everyone, they could not see us. It was just me and Goku in our little world full of music inside my car. Thus we dubbed that song the 'Magic Carpet Ride'. It just felt so incredibly beautiful, I had no idea. I looked down at my hands and did not recognize them. I decided that I had left my body and the rest of the world behind, and that this was my soul in the car, watching over everything. I touched my face and legs and stomach, and they all felt like silk; this made me excited and I made Goku touch me too, asking him over and over how soft it was. It just kept getting more intense, and I was beginning to feel uncontrollably affectionate and ecstatic.",
  "Goku had predicted that I would wind up thanking him, and I did; he turned his blue eyes on me with a look that was priceless, I cannot even describe it. We were headed towards Coconut Grove; I do not remember most of this part of the car ride, but I assume I was blabbering on and on about how it felt. What I do remember is what happened when we got there. There was a lot of traffic, and there were people milling about everywhere. The trip had been getting more intense all this time, and I actually was starting to get a little panicky. Goku was afraid I'd freak out in public, so he made a turn to get out of there. We were already on our way out when I remember blurting 'Oh my God it's so COOOOOOOOOLLLLLLLD!!!' and making a weak attempt to scoot closer to Goku. I felt totally weak, and I started to shiver and chatter. I had no idea what was going on, but I was not scared. Goku just said 'Damn girl, you're beaning your ass off!' and put his arm around me. I vaguely remember getting to Goku's house. I had shutter vision by this time. The peaks were so intense that I felt I wanted to cry, but then they would be over and I was back to smiling again.",
  "We were parked in Goku's yard and couldn't go inside because his parents were home. I can't remember if I was inside or outside the car, but I had my first and only real hallucination at this point. I thought I saw a little gray kitten, and it looked so real I squatted down and called to it. Suddenly, though, I could see grass through the middle of it, and little by little it disappeared, leaving me confused and a little disappointed. Goku then opened the glowsticks, and i could not believe my eyes. I literally watched with my jaw hanging open as he danced, creating flowers and all sorts of braided looking shapes in his hands. I don't remember being in such awe in my whole life. A little while later I started zoning out. It felt like I was falling asleep, but Goku said my eyes were just rolling back.",
  "And that's pretty much the physical aspect...what is truly priceless is the emotions you feel. I felt so close to Goku I asked him if he would be my brother, since all my other siblings are at least ten years older than me, and Goku is only three years older. I found myself telling him all sorts of deep secrets, things I kind of regretting telling him merely because I was embarassed about it. But what was incredible was that for once in my life, everything felt ok. Sure, a lot of things had gone hideously wrong, and it felt like my life was going numb, but for once I felt so alive, innocent, born again. I felt i could forget what my enemies had done to me. Peace, at last...",
  "For those of you who have never done ecstasy, you are missing out big time. I remember clearly wanting to strangle myself for not having started sooner. It's an experience that words cannot describe, but I can definitely say that no other drug comes close. And you will never forget it, either. The next time you hear trance or something along the lines of that, you will remember your roll so vividly it will amaze you. Your newly acquired points of view will stay put as well. Listen to the song 'Gamemaster' by Lost Tribe and you'll see what I mean.",
  "I was fortunate to have been brought in to 'the real world' by someone with a lot of experience, and I cannot imagine rolling without certain props. So for those of you who want a most enjoyable experience, here are some tips that I've acquired over the past seven months:",
  "don't roll alone. you'll feel lonely and sad. the more people, the merrier.\rif you know someone who can dance with glowsticks really good, be sure to have them with you\rALWAYS drink plenty of water [but not TOO much]\rsmoke a Newport menthol to boost your shit really good\rhave a vicks inhaler handy \rvicks vaporub under the nose and eyes boosts your shit good too\rget massages, they feel incredible\rknow someone who knows how to 'blow you up'\rhave great music. my top picks: Paul Oakenfold's 'tranceport', and DJ David Padilla 'the mix afterhours'. music is the drug, and you'll see what I mean.\rdon't eat a lot beforehand, don't drink alcohol, and don't smoke too much, or you may throw up\rhave warm clothes handy",
  "</p>"
 ],
 "year": "2000",
 "id": "763",
 "gender": "Female",
 "views": "8405",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2000-10-12T07:00:00.000Z"
}
