{
 "title": "Not What I Was Expecting",
 "author": "Kina",
 "citation": " Kina. \"Not What I Was Expecting: experience with 4-Fluoroamphetamine (ID 76313)\". Erowid.org. Jul 27, 2009. erowid.org/exp/76313",
 "substance": "4-Fluoroamphetamine",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "75 mg",
   "insufflated",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   " T+ 0:00",
   "75 mg",
   "insufflated",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   " T+ 0:00",
   " ",
   "oral",
   "Caffeine",
   "(liquid)",
   " T+ 2:00",
   "50 mg",
   "insufflated",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   " T+ 5:00",
   "200 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2009",
   "76313",
   "Male",
   "",
   "Not Given",
   "Jul 27, 2009",
   "38901",
   " "
  ]
 ],
 "report": "<p>Age:  19</p><p>Sex: Male </p><p>Smoker: avg.  a pack/day</p><p>Weight: 75 kg (about 165 lbs)</p><p>Health: No health problems  </p><p>Medication: No medication</p><p>Previous experiences:</p><p>This is my first experience with this compound. Pretty much a novice in the area, Ive tried DPT, mephedrone, weed,  4-ho-met, DXM, MDPV and now 4-FMP. As you can see, I dont have much to compare the feeling of this drug against, but I will do my best to describe what I felt during this experience.</p><p>Getting started:</p><p>I had waited for my order for 4 days and when it finally arrived. I was alone in the apartment and had the day planned: relaxing and just enjoy life. I was in a good mood, excited about trying this new substance and I felt well rested. I had heard much good about 4-FMP; that it lasted up to 10 hours, that it was comparable to MDMA according to some reviews and I had also heard that it was a light version of amphetamin. During the first 4 hours of this experiment I also consumed a 1.5 l bottle of Coca Cola. I have no idea if the caffeine will influence the effects of the 4-FMP.</p><p>Preparation:</p><p>I emptied the contents from the bag onto a piece of toilet paper and used my scale to get the correct amount, this time 150 mg. I divided the 150 mg pile into two smaller piles as I had heard it hurt a lot to insufflate it and I didnt want more pain than needed. The powder is completely white and just about all of it is in the shape of small stones of the substance. I crushed these stones with the end of my lighter to avoid unnecessary pain as I was going to insufflate it and I thought that a fine powder would stick in my nose better than big pieces. Before beginning I also turned off my phone and put it in another room, since I dont want calls from parents etc. where I act weird. I also want to avoid the temptation of calling people at random and just rambling on, it would seem quite weird since Im not that sociable normally.</p><p>Time while beginning the experiment:  15.30 (3.30 PM)</p><p>T+0: When I had divided the pile in two I insufflated the first pile. I felt a faint smell of lemon as I insufflated it. Shortly afterwards I felt a sharp, burning sensation in the nostril I had used. Putting words to this pain is hard, the best I can do is the following: Imagine dropping a jar of vinegar, cut yourself on the glass and then accidentally put your finger in the vinegar. Imagine that, but in your nose. Thats the best I can do, now try to imagine it . Im sure that everyone can endure the pain, it isnt as bad as I make it out to be, but its a different kind of pain.</p><p>The pain subsided after about 30 seconds. I changed nostrils and insufflated my last 75 mg pile. I was prepared for a nasty taste in my mouth because I inhaled too hard this time. Surprisingly, I felt no taste at all. Surprised, I stick my pinky into the pile that was left and lick it. It was really nasty, like an extremely sour lemon, so sour it almost wasnt sour, it evolved to super sour. I sit back in my chair, watch Louis CW standup and just enjoy life, waiting for the drug to do its thing.</p><p>T+5: Im already feeling the effects. A slight, pleasant tingling in my entire body, I also feel lighter and I feel good. My mood is noticeably affected to the better. No increase in the size of my pupils.</p><p>T+30  T+60: Now it really kicks in. Im sitting in front of my computer and cant help but to write to all of my friends, its like a primal urge that I cant fight (think guys+sex). The social boost I got from this was perfect. Not too much, and not too little. I never ran out of subjects to talk about, my brain was always ready to supply me with something new to ramble on about. Now, afterwards, I feel like I might have been too much, but that thought didnt occur to me while the 4-FMP was doing its job.</p><p>The feeling of being light has increased a bit and I feel more energetic. I notice that when I write to my friends I type faster than usual, often missing letters and having overall problems writing. I simply want too much in a too small amount of time and I find it hard to slow down. The euphoria has also increased, I feel quite good, but not at all what I had expected from reading others experiences. The increase in  mood is very subtle.  I also notice that, contrary to what I thought, Ive had a hard time doing one thing for too long. For example I cant watch the standup for more than five minutes before I need to do something else, and I change my playlist all the time, never satisfied with the music that is playing.</p><p>I also keep pinching my chin and chewing on my lip (I do not know if chewing on ones lip is a sign of bruxism or not), which I know is normal. I have no bruxism though, which I feel as a relief since I dont have any gum or similar thing to chew on at home. A note to self worked with mephedrone but with this I find it really hard to stop pinching or chewing my lip. It isnt bothersome though. After one hour, my pupils remain normal.</p><p>T+2:00: I have finally gained more control over my raging fingers that want to do everything at the same time, and Ive also managed to calm down with the lip biting and pinching. ( I wonder if all novices have such big problems to stop with their undesired actions during a the duration of the drug :p). Im not happy with the results Im getting so far, so I insufflate another 50 mg. This time it didnt burn half as bad as the first time and I dont know why. I felt that I hadnt reached the peak of this experience yet, I thought it could be so much more, based on what I had read about it.</p><p>T:+2:30: The extra 50 mg that I insufflated seem to have no effect. The first two doses began their work in a matter of minutes and now a total of 30 minutes have passed. I do not know if resistance builds fast on this compound or if it was just too small of an amount to make a difference in my case.</p><p>T+3:00: The euphoria remains the same, maybe a bit more prominent than before. Imagine the first time you went on a roller coaster, not the fear, but the joy. Thats what it felt like for me. I have now gained full control over my fingers and I dont get bored as easily as before, which was a relief for me. I have also stopped pinching my face but Im still chewing on my lip.  Still talking to friends and just relaxing as time goes by way faster than I would like it too. I would really like a remote control to control time right now.</p><p>T+4:00: Very suddenly I feel nothing at all (from the drug that is), not the slightest thing remains. Im simply back to normal without even noticing the downward slope Ive probably been in for some time. I do not know if it is the caffeine from the Coke that is messing with the experience or if it usually ends like that with 4-FMP.</p><p>T+5:00: I was disappointed with the duration and the effects, since I had read that it should last about 6-10 hours with a large dose (ie >150 mg with no consideration for weight). I decided to give it one more shot, even though I knew it might be dangerous with a relatively unexplored chemical like this. I ingested 200 mg wrapped in a bit of toilet paper and washed it all down with a glass of milk. I chose oral administration this time because I hadnt eaten for over 24 hours, and I thought I might get more out of the experience this way. My empty stomach is starting to demand attention and food now that the first dose was finished, so I decide to take a walk to the store.</p><p>T+5:15: After showering and getting dressed, Im ready to leave. I still dont feel anything from the latest dose. Hopefully itll kick in soon.</p><p>T+5:30  T+6:00: When I enter the store, I come to think of my pupils. I forgot to check if they were big or not... I instantly start feeling a bit uncomfortable, thinking that people might notice that I am under influence of some drug. I walk and take a sandwich, walk up to the counter while looking down at the floor. I pay for the sandwich, still looking in an awkward position that makes it look like I try to see his genitals. I then begin to walk home, lighting a cigarette.</p><p>When Im about halfway home I start to feel that tingling sensation (seems like this is the starting shot, at least for me) I felt the first time and I cant help but to smile. This tingling sensation made my wool sweater feel extremely smooth as it slid against my skin for some reason. Think a newly bathed baby with lotion on its belly, thats quite close to what my whole sweater felt like, only even smoother. Best sweater I ever wore :). It was a funny feeling, like nothing Id ever felt before. I walk with a little smile on my face all the way home. I feel more energetic than after the first insufflated dose(s) (150+50 mg), which makes me think tolerance isnt built as easily as I first thought.</p><p>When I come home, I feel very cozy and Im happy to be back. This time I could feel the increase of the drugs effect much more clearly than the first dose. I walked faster as I felt my energy increase and, magically, walking faster was not one bit more exhausting! It was actually a cool feeling, being able to increase my speed at the cost of nothing.  I could literally feel myself getting a boost while walking, and by the time I had closed the door to my apartment I felt like a Duracell Bunny, fully charged and ready to go.  When I reached this point the time was about 22.00 (10.00 PM) and I felt that there probably wont be any sleep tonight. The first thing I did was walk to the toilet to see how big my pupils were. They were quite big, so it was probably the smart thing to do to use some caution at the gas station, I tell myself.</p><p>T+6:15: I open up the plastic around my sandwich and pour a glass of milk. I thought that I would have a hard time eating, but surprisingly I didnt. Although did I find another, vital, thing rather hard to remember: swallowing! I just kept chewing the same piece of bread until it was a gooey mass which I had a really hard time swallowing. I repeated this process with great trouble just to get something into my growling stomach. I havent noticed any further improvement of my mood or energy anymore. I cant help but to sit in front of my computer and giggle even though theres nothing even remotely funny on there. Im still not 100% sure that this is the peak of it all, at least I dont hope so. I hope this feeling will last for the promised 6-10 hours now.</p><p>T+6:45: I have finally eaten my sandwich, and forgetting to swallow with each bite, I just kept chewing like a cow until I noticed it didnt taste that good anymore. The effects are as intense as before, nothing has changed.</p><p>T+8:45: Ive been chatting with a female friend for the last couple of hours. Im glad people dont seem to think Im too talkative and/or annoying which I myself feel that I might be. I also feel that I speak my mind easier while under the influence of 4-FMP. I dont feel a heightened need to communicate with people compared to the first high, but all of the other effects (tingling, lightness, energy) are definitely more noticeable this time around.</p><p>T+11:00: Im on the eleventh hour of this experience (6 hours since redose), the time is past 03.00 (3.00 AM).</p><p>My only talkative contact went to sleep some minutes ago so Im pretty bored right now, I dont feel like doing anything else than just talk to someone. I think that I might have enjoyed this experience more with a close friend here to talk to as I find the social boost of this drug the most enjoyable part, as I am pretty reserved normally.</p><p>I am now satisfied with the duration of this dose, and it feels like it could work for one more hour at least. Im not very satisfied with my thinking though; because of the redosing I do not know if empty stomach and oral ingestion is better than insufflating or not. Im hardly an expert in the area of chemistry, but it sounds possible that the residue of the first dose just gave my second dose a boost. </p><p>T+13:00: Almost all of the effects are gone, just as abruptly as before. I dont know if Im just slow to notice the change or if it really is that sudden, just gone with the wind. Im not energised as before, but Im wide awake and the time is 06.00 (6.00 AM). I now have three unpleasant side effects:</p><p>During the time from which I came home and sat down after buying the sandwich, Ive constantly pinched my legs together very hard. Now it aches quite badly in my groin and legs, but it is not as bad as the aftermath of a couple of hours of jaw clenching though.</p><p>I also have a slight headache, but its barely noticeable compared to the pain in my groin.</p><p>And last the worst, that is actually making me worried; when I focus on objects they start to wiggle (think jelly). When I focus at a piece of text, it almost seems like they are floating on waves, bobbing up and down in irregular patterns. I do not know if this is because my lack of sleep, or if theres some 4-FMP left that is messing with me or, worst case scenario, HPPD.</p><p>I dont recommend exceeding 200 mg per occasion and day, just to be on the safe side if these symptoms with my vision continue.</p><p>Pupils still dilated.</p><p>Conclusion:</p><p>This drug wasnt what I expected. Unfortunately I do not mean that in a good way. I thought I was going to experience something more. If Im going to compare this to any of my other experiences, mephedrone is closest. If I disregard the tingling sensation that I got from 4-FMP, it is almost identical to a weak,  very long mephedrone high, although the social boost is as strong in 4-FMP as in mephedrone in my opinion. I found it relieving that the need to redose while using 4-FMP was non-existent, it was only my own stupid curiosity that get the best of me.</p><p>I also got a much longer and more pleasant effect after consuming the drug orally on an empty stomach than I got from insufflating the same dosage. Im speculating if the caffeine was the reason for the short duration of the first dose. Next time I wont drink any caffeine and see how that works.</p><p>A good thing for to do while using any central nervous stimulant is to put post its on my monitor (if I sit in front of my computer, of course :) that say Dont clench your teeth and other useful things that I want to remember while Im at it.</p><p>All in all, 4-FMP sounded extremely promising when I read about, but it didnt even come close to my expectations I'm sad to conclude. The best experience from these hours of my life was the smooth sweater, it was a really weird, but super-awesome, feeling.</p><p>!PLEASE READ!PLEASE READ!PLEASE READ!PLEASE READ!PLEASE READ!</p><p>I do not recommend anyone exceeding 200 mg per dose and day. After this experience, my vision is altered (read above Conclusion about the side effects I encountered), hopefully not permanently.</p><p>!PLEASE READ!PLEASE READ!PLEASE READ!PLEASE READ!PLEASE READ!</p><p>I wish you the best luck and hope you find something you like in this substance!</p>"
}
