{
 "title": "First Taste of Ego Loss",
 "author": "Cosmic Elf",
 "citation": " Cosmic Elf. \"First Taste of Ego Loss: experience with 4-AcO-DMT (ID 76382)\". Erowid.org. May 29, 2009. erowid.org/exp/76382",
 "substance": "4-AcO-DMT",
 "bodyweight": "130 lb",
 "header": [
  "DOSE: T+ 0:00",
  "17 mg",
  "oral",
  "4-AcO-DMT",
  " T+ 4:00",
  "1 bowl",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>Last night I had my first experience, along with my roommates, with 4-AcO-DMT. While the lot of us are experienced with numerous psychedelic drugs, the sheer intensity of this particular experience took us all by surprise. I had educated myself prior to the first experiment, but no amount of reading could have prepared me for the actual thing. The experience transcends words and thought, so any attempt to interpret and express what happened to me last night will fall short of how it actually was. My memory of it is but a vague impression, like trying to remember a dream. As I drift further away from the place in time where I was in that realm of awareness, it becomes increasingly more difficult to recall, so I must get it out!</p><p>9:50pm  Myself, O, and N ingest 17mg of 4-AcO-DMT. G takes 19mg. First effects are felt almost immediately (count-down to lift-off). We proceed to go out to our favorite place to trip, around the fire outside. O starts the fire, and N gets busy splitting wood while I set up some chairs.</p><p>T+20m Were settled in, although quite cold as the fire is small. Im shivering, but drifting away all the same. Impossible to speak at this point, O and N are more vocal, and I can only manage to giggle. I feel good, there is an initial rush of energy in my solar plexus radiating out to the rest of my body. A warming euphoria from the core. Its difficult to tell exactly what is happening. My visual field is altered in an unfamiliar manner, and my nose is running uncontrollably, I have to keep swallowing fluidI imagine this is due to the coldness around me, but possibly increased by the drug. My fellow travelers and I are quite silent, looking to each-others eyes for reassurance that someone else is feeling the same.</p><p>Time is lost.</p><p>Closed eyes are quite comfortable, and it feels as though something is slowly creeping deep into my psyche, like a snake crawling through the crevices of my brain. Theres a high-frequency buzzing sound from within, I did not hear it with my ears. Any visual qualities are unnoticed as I go deeper into trance, unable to move. A train in the distance is deafeningly loud, and other outside noises seem as though they are right beside me. Its slightly distracting; I wonder how this would be in total silence? I cannot comprehend what the outside world might be doing, nor can I comprehend normal human functions. I am somewhere else, existing outside of space and time and thought. I can only refer to this as the void (I now understand this term). I notice resistance of this within myself, and an attempt to grasp onto familiarity. A voice inside of me wonders, why the resistance?  The shadow regions of my mind are making themselves known, emerging from the dark forgotten corners. I continue to shiver from the cold, which reminds me of my physical body, keeping me tethered to this world. I open my eyes for a moment, but quickly go back inward.</p><p>T+1.5h  N has retreated indoors, not sure of when exactly this happened, but the rest of us follow suit. Walking is a challenge; my body feels stiff and zombified. I collapse onto my bed and it seems it would be easy to drift off into sleep. I hear G and O ranting and raving in Os bedroom.Himelayaaaasssss!!! O keeps shouting in his raspy voice.I change my pants and this is an extremely difficult task, then make my way across the hall. Im still altered at this point, at a ++ Id say, getting those first wiffs of reality which seem to come in waves (this reminds me of mushrooms). Im unsure of what just happened to me, looking at the clock and unable to account for the past hour and a halfis that really how long Ive been floating around the void?? Im still unable to express myself, listening to the boys talk is grounding. Slowly the waves of reality become longer as the waves of space become shorter, but perceptions of time are still extremely altered. Gradually my ability to speak returns to me.</p><p>T+4h  N joins us for a moment to discuss the experience, and we all are still quite blown away by the intensity of the night. We smoke an unnecessary bowl of marijuana, and eat some of Ns delicious soup. Im nearly baseline by now.</p><p>T+4.5h  We retreat to our separate quarters, and my boyfriend G and I make love prior to drifting off into dreamland.</p><p>Afterthoughts:</p><p>As I said in the beginning of this report, theres nothing that couldve prepared me for the rocket ship ride I experienced last night. This is the fastest onset of any orally ingested substance Ive done, and it carried me further than Ive gone before. I wouldnt go as far as to say that this was a ++++ experience, but it was certainly a milestone in my tripping career.</p><p>I have no point of reference to compare this, so perhaps with an introduction to this compound under my belt, future experiments may be more easily understood. One thing I must note is the euphoria that came with this experience, there was no fear associated with anything that went on, though there was some confusion. It was also totally physically benign in the body, except for a slight increase in heart rate. I found this to be an *extremely* powerful chemical, and it wasnt a recreational good time, its for exploring. These 4-position substituted DMT molecules pack a punch!</p><p>Thanks for reading my report, I hope I was able to offer some insight.</p>",
 "year": "2008",
 "id": "76382",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-05-29T07:00:00.000Z",
 "views": "24037",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "17 mg",
   "administration": "oral",
   "substance": "4-AcO-DMT"
  },
  "1": {
   "time": " T+ 4:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
