{
 "title": "Asymmetrical Wonder",
 "author": "LucidStudies",
 "citation": " LucidStudies. \"Asymmetrical Wonder: experience with 4-HO-MET (ID 76397)\". Erowid.org. Mar 2, 2009. erowid.org/exp/76397",
 "substance": "4-HO-MET",
 "bodyweight": "160 lb",
 "report": "<p>I had gotten my hands on a sample of 4-ho-MET, otherwise known as methocin or methylpsilocin. I had read that the N-methylated analogue of psilocin was a longer lasting but less intense version of psilocin itself, with a wide dosage spectrum and appreciable effects at a variety of dosages. I decided I would try it out in a series of trials starting at 14 milligrams, and increasing the dose by 4mg each time until I felt that I had reached a full appreciation of the drugs effects.</p><p>---------------------------</p><p>Trial 1  7-04-2008 -  14 Milligrams</p><p>1:30 PM: My pulse is at 80 beats per minute. I smoked a hit of pot about an hour ago but I am sober now. It is the 4th of July. I am almost ready to start.</p><p>1:40: I swallow two capsules containing 14 milligrams total of 4-ho-MET. I turn on some lights in the apartment to infuse it with a bit of color and I try to take my mind off of work or anything else that might negatively distract from the coming experience.</p><p>1:50: Im listening to some industrial music and getting in the right mood for an adventure. Do not yet feel anything from the 4-ho-MET.</p><p>1:58: I'm feeling the energy from the drug coursing throughout my body. Pulse is accelerating. It feels positive. Not nauseating and no fear or anxiety. I can't wait for the psychedelic effects to descend.</p><p>2:10: The symptoms so far are emotional openness, alertness and wide-awakeness, with subtle enhancement of color and depth perception. Very friendly and nice, but a little too light visually; I wonder if I underdosed. Better give it some time, as the effects may still be deepening.</p><p>2:20: Pulse is up to 90; very very mild effects on heart rate and breathing, and no nausea. Very hallucinogenic at this point, but primarily emotionally so. There are noticeable visuals, but they are light. There seems to be a common feeling to the assymetrically-substituted tryptamines. Something about the body energy in this one feels familiar from experiences with 4-substituted MiPTs.</p><p>2:25: Drifting attention span. Sensual body energy and great curiosity. The need to move around and find something to do.</p><p>2:35: I stopped in and talked with my girlfriend about my experience. I think it's gone as far as it's going to go, and it's still not very visual. Sensual in and of itself, but with little enhancement of external sensuality- such as the touch of a significant other. It's an experience in and of itself. Stronger visuals with eyes closed than open; very colorful flowing waves and organic landscapes.</p><p>2:40: I smoke a hit of kush. It helps bring out the open-eye visuals significantly, and soon the details in wood-grain textures and interesting fabrics are swimming about in the way I've seen again and again from 4-substituted tryptamines and psilocin analogues. After the shower I look at myself naked in the mirror with great love and unrestrained sensual attraction... the egotistical effects of mushrooms are in full swing. I feel like a god, powerful and attractive.</p><p>2:50: I get dressed in the nicest shirt and pants that I can find. I want to look fabulous. I think my girlfriend and I are going to go out.</p><p>3:00: My self-esteem is through the roof. I have never felt more self-assured, more appreciative of my own humanity or brighter in my feelings about the future than I am right now. Who cares about visuals- what more could I want out of a drug than just this?</p><p>5:00: We're back from a trip to the mall and the substance is starting to fade. But boy has it been gorgeous. We coasted through the mall with ease in our best clothes, feeling like the finest people the mall had to offer. We got food at the food court, and milk chocolate truffles from a chocolate store for dessert. We stopped in the pet store and played with a cute Corgi puppy, although she peed herself from too much excitement. While I was there I bought a new mp3 player to replace my old one where the screen had chipped and broken. It was very easy to handle myself in the store.</p><p>6:00: Im working on the computer now. The psychedelic effects were beginning to enter a decline, and in an attempt to draw them out a little further, I smoked some pot, as well as eating a little bit of a cannabis-infused rice crispy treat. The cannabinoids will keep me feeling special and satisfied for the rest of the day, carrying the positivity of the brief but beautiful 4-ho-met (which has now almost completely faded) with me for the rest of the evening.</p><p>I got back from the Fireworks show at about 10:00, still slightly high from the oral cannabis but no longer feeling any effects from 4-ho-MET at that point. Unfortunately, the cops were being jerks around the area where the fireworks went off, yelling and threatening to tow peoples cars if they tried to get anywhere near the show. We had to drive to the parking lot of a University a couple miles away and watch the explosions in the sky over the edge of a hill.</p><p>Trial 2- 7-12-2008  18 Milligrams</p><p>4:00PM: My stomach is empty. I havent eaten anything yet today. I have 18 milligrams of 4-Ho-MET prepared in three pill capsules (10mg + 4mg + 4mg). I swallow all three caps with a sip of root beer.</p><p>4:15: I feel a preliminary head-buzz, some sensations of energy creeping around in my stomach. Im listening to music. There are no hallucinations yet.</p><p>4:20: A little bit of tactile hypersensitivity can be felt.</p><p>4:30: It fully strikes.  A powerful, yet somewhat lopsided-feeling, a psychedelic head rush.  My breathing and pulse are normal. So why does this feel so unbelievably intense? Because it is acting directly on my mind. Not my eyes or my body, but my mind itself. Everything I perceive is being run through some kind of elliptical machine that spins it in a joyous, continuous figure-eight pattern.</p><p>5:00: I emerge from the shower. Im still a bit overwhelmed by the sheer intellectual and emotional effect of the drug. My pupils are fully dilated and Im trembling. Vision is throbbing, the world is pulsing with life.</p><p>5:20: I go out for a long walk. I have the feeling that time is slowing down and then speeding up again. I sense artificiality to the movement of the cars on the streets, and to the entire world around me.</p><p>6:40: There are strong visuals with eyes either open or closed, geometric and colorful. No feelings of anxiety whatsoever.</p><p>7:30: I go out to eat with my girlfriend and a mutual friend of ours. In the wood grain of a table, I can see little spinning disks, colors being repeated and looped into swirls. The edges of the table are flowing like amebas in search of food. The food that I eat tastes better than anything I can remember eating in quite some time. I seem to be able to talk and behave fairly normally, never drawing attention to my intoxication during the meal, despite the fact that my friends face is warping into surreal postures as I talk to him.</p><p>9:00: Dinner is over and the three of us are back in my apartment now. Still high, with a positive, uplifting energy in the body, but the visuals are now mostly gone. We watch TV together, but I seem to have a difficult time relating to any of the images on the screen.</p><p>10:00: My friend leaves the apartment and the effects of the substance seem to have totally subsided. They lasted for about six hours.</p><p>Trial 3- 8-02-2008  22 Milligrams</p><p>2:00 PM: I wake up late in the day. It is a Saturday. Im still tired from a lack of sleep over the few previous nights. I wander into the bathroom to pee, then back into bed to cuddle with my girlfriend who is also still pretty tired.</p><p>2:30: Cuddling turns into sex. My girlfriend has been sick with a stomach infection and we havent had sex for almost a week. Were both extremely satisfied as I bring her to two orgasms while she tells me how good I make her feel.</p><p>3:00: Im in my office. I think this will be the right day for another 4-ho-MET trial.</p><p>3:30: Im hesitant to get started. My pulse is elevated about 15 beats per second above normal and Im not sure why. There are no drugs in my system, and Ive not gotten any exercise for the last half-hour.</p><p>3:45: My pulse is down to 85 BPM now. I think I can start. I have a ten milligram capsule, and three different four milligram capsules in front of me.</p><p>3:50: I swallow them all down.</p><p>4:05: Feeling a bit apprehensive. I sense that whats coming is going to be strong, but I cant yet decipher the nature of what will unfold.</p><p>4:10: Im putting some music on. Theres a heavy feeling in my head. The air is breezy and cool against my skin, comforting me as I slowly begin to slip away.</p><p>4:15: It begins to strike already. Wonder with a hint of revulsion. Strong energy all over the body, and a bit of upset in the stomach.</p><p>4:25: Im trembling in every inch of my body with the intensity of the substance. It isnt so much a visual intensity, though colors are deepening and emboldening. It is just a feeling that something tremendously powerful is lurking right underneath my skin. Im warm all over and I feel almost as if my body might just dissolve into a mass of warm liquid at any moment. No real pulse elevation despite the feeling of intensity flowing through my blood and flesh. Pupil dilation is mild despite visuals that become more noticeable by the second.</p><p>4:40: Some of the initial intensity is dying down. Im starting to feel fairly relaxed. There is significant intensification of color and detail, but little open-eye visual movement. Not much in the way of closed-eye visuals, yet. Physical and emotional effects are the most noticeable. Feelings of awe and wonder are strong, as are physical sensations, especially in the skin.</p><p>5:00: I just took a shower. Thoughts flowed to and fro, from what I want out of life, the various things a human being wants in their heart and in their spirit, to thinking about the human heart and its relentless beating in and out, to thinking about sex, to thinking about how different organisms impregnate each other, and imagining hypothetical alien organisms and how they would live on other worlds. Its all just me, my mind going out into the universe and exploring. Pupil dilation is full, now. Closed-eye visuals consist of ovoid patterns, wavy and rippling. Open-eye visuals are color enhancement and just a hint of rippling motion through everything in the room. The overall feeling is one of tremendous awe. Pulse is about 105. This is a +++.</p><p>5:30: The universe is like a great tapestry that God sees from one side while human beings look at it from the other and we can no more see Gods view of how the tapestry connects than he can see our individual views of it, looking from the other side. I discuss this with my girlfriend as we sit on the couch.</p><p>7:00: I watched a Monty Python episode while cuddling with my girlfriend.</p><p>7:30: The cuddling once again turns into very joyous, wonderful, and erotic sex.</p><p>9:30: The visuals are wearing off and the trip comes to a close as I eat my dinner, a lightly cooked beef steak.</p><p>---------------------------</p><p>Conclusions:</p><p>For me, 4-ho-MET is an unusually friendly and recreationally-inclined tryptamine. It has very few side-effects, including no nausea whatsoever, and it produces a generally pleasurable feeling in the body that lends itself well to eroticism. The same things could be said for 4-AcO-DMT at low doses, however 4-AcO-DMT is prone to extremely powerful mental and psychological effects that consume my attention span so that I'm limited in my choices for what I can do during the intoxicated state. 4-ho-MET is less mentally overwhelming, and it is easy to interact while under the influence.</p><p>Something about the visual and sensorial aspects of the drug seem to call attention to the asymmetrical composure of the molecule.  I would often see spinning motions in my surroundings, with an emphasis on figure-eight patterns. It was as if the extra weight in the ethylated side of the amine had unleashed an unbalanced, circularly looping flow of motion into the world. Emotionally, the drug speaks of pride and awe. It is a self-esteem booster and an enhancer of appreciation for the innate wonder of the world around us. For these reasons, I call 4-ho-MET The Asymmetrical Wonder. It does not dig as far into the realm of deep psychedelic thought as the DMT cluster of drugs does, with mental effects that pale in comparison to mushrooms, 4-AcO-DMT, DMT or 5-MeO-DMT. But when searching for an enjoyable, recreational psychedelic experience I would find this useful at any reasonably-chosen dosage. In fact, it is among the greatest successes to emerge from synthetic drug design within the tryptamine family that I have had the opportunity to witness.</p>",
 "year": "2008",
 "id": "76397",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-03-02T08:00:00.000Z",
 "views": "14517",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "22 mg",
   "administration": "oral",
   "substance": "4-HO-MET",
   "form": "(capsule)"
  }
 }
}
