{
 "title": "I Don't Think It's Entirely 'Herbal'",
 "author": "Erd",
 "citation": " Erd. \"I Don't Think It's Entirely 'Herbal': experience with Smoking Blend ('Genie') (ID 76419)\". Erowid.org. Mar 9, 2009. erowid.org/exp/76419",
 "substance": "Smoking Blend ('Genie')",
 "bodyweight": "64 kg",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Products - Smoking Blends - Cannabis-Like"
  ]
 ],
 "footer": [
  [
   "2008",
   "76419",
   "Male",
   "",
   "Not Given",
   "Mar 9, 2009",
   "8342",
   " "
  ]
 ],
 "report": "<p>I stumbled upon 'Genie' herbal smoking mixture in a local head shop, and decided to buy a 3g packet for 20 (approx $35). At this price, it's more expensive than normal grass, but with my supply of MaryJane drying up, I thought I'd take a chance.</p><p>It comes in a little foil packet and looks just like rolling tobacco. The ingredients on the back contain the ambigious term '..a blend of herbs and extracts including Galanga, Alchemilla, etc'. This implies to me that it contains other, unknown ingredients, and there doesn't seem to be much information about it online. It also smells of pot-pouri.</p><p>My flatmate and I are both experienced smokers and immediately built a joint each, putting in slightly less of the Genie than we would have grass. It tastes and smells different from grass, but not in an unpleasant way. We were slightly skeptical of its effects, but after one joint both concurred that this stuff is very very similar in effect to grass, providing that familiar red eyed feeling and subtle head buzz. Great!</p><p>Over the course of the next few hours, we smoked perhaps two or three joints each, which would be standard for us both, being daily heavy cannabis smokers. I began to notice that I felt much more stoned that I would if it were just cannabis we were smoking - perhaps as if I'd smoked twice the number of joints that I had actually smoked. Whilst it wasn't bad, it certainly wasn't a comfortable feeling. Much like the feeling I get when I've smoked more than I should. Sweating, being aware of increased heart rate (nothing serious or intense), etc.</p><p>My flatmate confirmed the same feelings. Whatever's in this stuff, I don't think it's entirely 'herbal'. Amongst the various snippets of information I could find online, there are rumours of similar substances containing synthetic cannabinoids. From what I can make out, Genie is manufactured by the same people who make the Spice range of smoking mixtures. </p><p>The effects wore off within a few hours, but the potency of this stuff took me by surprise. Worth noting, also, is that it's officially sold as an incense, which makes me more wary of its actual active ingredients.</p>"
}
