{
 "title": "Eliminated Gag Reflex",
 "author": "AnonymousF",
 "citation": " AnonymousF. \"Eliminated Gag Reflex: experience with MDMA (Ecstasy) (ID 76434)\". Erowid.org. Jan 21, 2009. erowid.org/exp/76434",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "MDMA"
  ]
 ],
 "report": "<p>I am a 35-year-old woman who discovered that MDMA eliminated my gag reflex during oral sex.</p><p>I've had a couple of previous experiences with MDMA and quite a few more with oral sex, but had never combined the two.  I am not on any other medications or supplements and did not take any other drug along with the MDMA.  On the evening in  question, about two hours into an Ecstasy trip, I was performing oral  sex on my companion when I became aware that the gag reflex that  normally would kick in at a certain point was simply gone.  My partner's  entire and substantial penis was comfortably all the way down my throat,  and I had no uncomfortable or unpleasant physical sensations whatsoever  -- to the contrary, I felt perfectly comfortable.  No special effort was  required to keep this up, and I comfortably continued on for about 10  minutes (and could have continued longer, given the opportunity, but  other activities beckoned). </p><p>Within several hours, my voice became noticeably hoarse, which I suspect  was due to the act.  We also noticed that -- although he didn't have an  orgasm during that particular act -- for the rest of the night after  that, the usual MDMA-induced inhibition of orgasm was gone on his side,  and I've speculated that my (our?) achievement was responsible for that.</p><p>I will note that while I consider myself not unskilled in this area,  I've never been able to achieve this previously.  I intend to conduct  further study to attempt to replicate my results.</p><p>COLLABORATOR'S ACCOUNT:</p><p>I am the male companion referenced in the report above. I am also 35  years old, and had only taken MDMA a few times prior to this experience.  Prior to the incident in question, we had had sex twice that night, once  right after we ingested Ecstasy, and once perhaps an hour later after we  both had begun to feel the effects of the drug. I did not achieve an  orgasm during the second session of sex. Approximately 20-25 minutes  later, my companion began to perform oral sex on me. After a couple  minutes I became aware of an unfamiliar sensation -- I looked down and  my companion had swallowed the entirety of my phallus. She appeared to  notice at the same time, and we agreed her gag reflex appeared to be  suppressed by MDMA.</p>",
 "year": "2009",
 "id": "76434",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-01-21T08:00:00.000Z",
 "views": "38228"
}
