{
 "title": "True Happiness",
 "author": "Mike",
 "citation": " Mike. \"True Happiness: experience with Oxycodone (ID 76439)\". Erowid.org. Nov 22, 2013. erowid.org/exp/76439",
 "substance": "Oxycodone",
 "bodyweight": "125 lb",
 "report": "<p>Hello, the name is mike. I am submitting this to inform you all that opiates, in particular oxycodone, can be a wonderful drug of choice so long as it is used once in awhile. Everyday use of these is essentially a joke because of how quickly tolerance developed and the there will not be much of a high associated with it.  </p><p>I have an extensive history of opiates. I have used hydrocodone (10mg/325mg tablets, usually around 40-60mg at a time), percocet (10mg/325mg tablets, 40-50mg at a time), hydromorphone (4mg-8mg tablets usually up to 24mg at a time), codeine, methadone, Demerol, bupronorphine, and of course morphine. The most frequently used though are the hydros the oxys and the hydromorphone. Opiates are my drug of choice. They have no negative side effects for me except the occasional itch, which is easily relieved by a couple benydral or hydroxyzine, both of witch can be potentiators.</p><p>This particular experience, I was in a rather stressed and worn out state of mind. I just had gotten back home from a long day of classes and was looking forward to the euphoria and warmth that I knew I was going to be experiencing. The setting was my room. It is rather small but it is a very comforting place to me with what I would call a good vibe.</p><p>The only real preparations that I made were getting out the CDs and placing them in my stereo. The music of choice was Dark Side of the Moon and Animals by pink floyd. I also put in a CD of various artists mostly of 1965-1975 rock. I always enjoy listening to music while under the influence of anything.</p><p>I had a bunch of 5mg oxy pills which I got at a relatively decent price ($100 for 60 tabs). It also helps that I am good friends with the person too. Since this was my first time dosing on oxy in about 3 weeks I decide 40 mg would be nice. I took the pills orally due to the fact that I have a cold, otherwise they would have been insufflated.</p><p>The effects occurred rather quick since I had only eaten a slice of half ass pizza about 5 hours prior. The pills are also IR so they hit me quick even if I don't blow them. After about 15 minutes I felt a profound euphoria. The best way to describe it is an explosion of happiness all throughout my body. Any aches were gone. Any pain was wiped out. My spine tingles with warmth and my head feels like a balloon filled with warm air. I have waves of heat that pulsate through my body. These effects generally last, for me at least, about 3 hours. Then they diminish but I still feel relatively nice for good 6 hours.</p><p>The only downside however is that any opiate gives me the strangest sensation when I sleep, even hours after ingestion. Once I get to the point that I'm about to fall asleep I start to hear things. I'm not sure if it would truly be auditory hallucinations though because when I sit up and open my eyes it goes away immediately. I also get closed eye visuals when I'm just to the point of slipping out of consciousness. Sometimes it's pretty wild. Yet again it is always remedied by opening my eyes. It is strange because I have never read an account where this has occurred to anyone. Also when I do fall asleep I have the most vivid dreams imaginable. This can  be somewhat undesirable if I have to be up the next day at en early time, but it is in no way such an issue that I wouldn't use these blissful little pills.</p><p>All in all I love opiates. I'm not physically addicted however. There is obviously some psychological addiction but it does not interfere with my life. I do not use day after day after day. If I acquire a reasonable amount I will use about every three to five days to ensure that not much of a tolerance develops and that I don't become physical addicted.</p>",
 "year": "2008",
 "id": "76439",
 "gender": "Male",
 "timestamp": "2013-11-22T08:00:00.000Z",
 "views": "2213",
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  }
 ]
}
