{
 "id": 7646,
 "title": "A Space City Amphetamine",
 "date": {
  "submission": "2005-10-21T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "bluedolphin",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "DOI",
   "form": "(powder / crystals)"
  },
  {
   "time": "4:15",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "7:00",
   "amount": "repeated",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  },
  {
   "time": "7:00",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "9:00",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": "13:30",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  },
  {
   "time": "13:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "First I should say this report is mostly intended for people with some psychedelic experience. I don't really have time to delve into each and every insight.",
  "2:00pm",
  "I ingest 2mg of DOI by licking it off a credit card. Then I go on a few quick errands.",
  "3:00pm",
  "Back from my errands. First alerts? Maybe slightly. Feels like very early onset of a generic phenethlamine, maybe a bit amphetamine feeling but not pushy at all. I guess this was to be expected.",
  "4:00pm",
  "Not much difference. Got a decent body buzz going on now. Feels amphetamine/phenethylamine. I mean 'amphetamine' because the energy flows throughout my whole body. I mean 'phenethylamine' because, at least at this point, this is clearly not the God-Energy that certain higher order psyhedelics (LSD, mushrooms, 4-aco-mipt) can produce. Overall it feels very easy on the body and very easy on the mind. At this point I'd call it a plus one and a half. Not yet 'psychedelic'.",
  "4:30pm",
  "Okay, here come the visuals. First I noticed colors shifting on the walls. Orange and other pastel colors seem accentuated. Some of the colors will change and bleed into other colors. I checked for tracers, and noticed they were not typical 'long-blur' tracers, but more like a delayed snapshot tracer, if that makes any sense.",
  "5:00pm",
  "I felt compelled to clean my apartment. It was a bit dirty and getting things clean gave me satisfaction and a way to expell my energy. I must say though, had I taken 20mg of Adderall I would have had a lot more amphetamine-type energy. DOI was actually smoother than 2C-I in this aspect as well.",
  "5:30pm",
  "I played guitar for a while, which I found was enhanced very nicely. Normally on psychedelics I think of new and original things to play, and normally on amphetamines I can play with increased speed and precision. Sometimes the difference is pretty amazing. Anyway, DOI, being both psychedelic and amphetamine, captured both these qualities very well, and I had a very satisfying jam.",
  "6:00pm",
  "Now I notice some shifting in the carpet. Other visual effects are difficult to explain. They were subtle, but beautiful. My relatively calm state of mind (considering I was tripping) combined with the relatively calm state of visual disturbance -- as opposed to high dose LSD, mushrooms, where everything in your visual field goes nuts -- allowed me to relax and enjoy the subtleties of my current trip. I remember finding DOI useful for working out logistical / situational problems that were going on in my life at the time. However I can't exactly remember what that was all about.",
  "6:15pm",
  "My annoying and schizophrenic neighbor from downstairs comes up to 'see if I wanna do anything'. I tell him it's a bad time. I turn on The Simpsons and smoke a bowl with my friend who's just stopped by.",
  "Smoking the cannabis significantly changed the experience. Since I don't usually like to smoke on amphetamines.... and I don't usually like to smoke on phenethylamines, I'm not surprised. Basically it turned a fun, clear-headed, good humored trip into something a bit more confusing and turned inward. By no means was this something I couldn't have dealt with, so I just regretted smoking a little and waited for it to ride out.",
  "7:00pm",
  "My buddy had to leave for a bit and my annoying and schizophrenic neighbor came back up, this time bringing up some really schetchy crack-head lookin' dude I've never seen before. This dude asked me to smoke him out, and I said 'no'. Then he asked me if I had anything to sell, and I said, 'No.' Then I gave my neighbor a nasty look and kicked them out of my doorway.",
  "So this put me in kind of a bad mood for the next couple hours, which I spent just watching TV.",
  "Until...",
  "9:00pm",
  "My boys roll up with a bunch of quality beer and three boxes of whippits! So needless to say the next couple hours were spent hittin' the bulbs. Of course the entire time we were smoking blunts and bowls of only the finest Maui Waui x Skunk homegrown.",
  "I also drank some beer during this time, and ate 10mg valium in hopes that I would eventually be able to sleep that evening. I probably would have ate more benzos but that was all I had left.",
  "10:00pm",
  "No change in effects. Still at a strong ++. Though very clearheaded, I could interact with people just fine and they didn't know I was tripping (I asked later to verify).",
  "11:00pm",
  "No change. I went outside to have a cigarette and check out the night sky. I saw what looked like comets shooting across the night sky, and the dark color of the sky would pulsate. The treetops were glowing at least 10 feet away from the trees. The occasional firefly going by always caught my interest.",
  "12:00am",
  "No change. Medium ++ now.",
  "2:00am",
  "Sittin on my couch watching TV, drinking beers. Sleep doesn't seem like a possibility, but then again I rarely fall asleep before 3:00am anyway.",
  "3:30am",
  "I ate 12mg melatonin. My body still feels slightly tense and a bit 'up' but my mind is pretty worn out. So I smoke a fat bowl and go lie in bed.",
  "During this period I got probably the best visuals of the whole trip. Aztec-looking creatures formed radial patterns on my ceiling, which reminded me very much of what I've seen on 2C-I. The difference was that my ceiling turned into a kind of scene from space, and these creature-patterns seemed to be projected from this space.",
  "Soon after that the melatonin made me pass out, and I got about 4 hours of restless sleep before waking up. At least I slept!",
  "....",
  "11:30am, The Next Day",
  "Still feeling slightly stimulated, but definitely not tripping. This wore off by mid-afternoon.",
  "....",
  "Conclusion?",
  "Well, first I should say I consider 2mg to be a low dose of DOI. I think Shulgin lowballed this one. I also know plenty of friends who have experimented with this chemical in doses much higher.... up to 15mg, and have not suffered any obvious health problems.",
  "However, it seems that imore than 4mg is asking for a full 24 hour trip. Unfortunately, it seems like 4mg is the kind of dose people need for a full +++ experience. I have heard of people entering completely alien and unrecognizable worlds on higher doses. My feeling is that DOI is suitable as an 'entry-level' trip at low doses, like 2mg. However it appears to get very intense and long-lasting at double that, or higher. Doses above 2mg extend the length of action up to 50 hours or so. This is all based on what my companions have told me, and I've observed on a few occasions.",
  "Onset varies between 1 hour to +++ to 3 hours to ++. I suspect at a higher dose it kicks in quicker.",
  "A 2mg dose lasted about as long as LSD, except with a longer comeup. The comedown might also last a wee bit longer.",
  "In summary.... a pretty pleasant chemical. If someone likes mescaline and 2C-x chemicals they might love this. It was surprisingly easy on the body considering it's amphetamine structure and length of action.",
  "This chemical also seems to provide a positive push, or motivation, to get things done. This is not a bad thing. However someone OCD or severely manic/depressive might want to avoid this.",
  "peace"
 ],
 "erowid": {
  "id": "46861",
  "citation": " bluedolphin. \"A Space City Amphetamine: experience with DOI (ID 46861)\". Erowid.org. Oct 21, 2005. erowid.org/exp/46861",
  "substance": "DOI",
  "views": "21063"
 }
}
