{
 "id": 7649,
 "title": "The Hitchiker's Guide to the Galaxy",
 "date": {
  "submission": "2007-06-16T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Bluedolphin",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "450 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I probably only write about 1/4 of my trips or less. I've eaten lots of LSD, mushrooms, morning glory seeds, 2C-alphabet, AMT, mescaline, DOI, 4-aco-mipt, and lots of others. I just got stoned so I'm sure I'm leaving quite a lot out. I've spent a fair amount of time as a cog behind the wheels of some biomechanical who-knows-what machine in Salvia space. I've been directly confronted by dozens of strange entities on DMT. Shit, a couple days ago I accidentally smoked DMT in an attempt to vaporize some weed in an old lightbulb vapo.",
  "I have so many theories about the workings of the universe, our own consciousness, the meaning of life, etc. -- most of which have been formed directly as a result of psychedelic drug use -- that I basically have my own religion.",
  "So after all this drug use, I have to admit that I am becoming less and less impressed with lackluster trips. The other night I ate 200mg of 2C-D within the course of an evening and didn't get nearly as high as I was trying to get. You know, light trips can be fantastic if given the right set and setting. Psychedelics can be great party drugs (well, some can, depends on the party of course) and also great to enhance concerts, art-work, or whatever creative stuff Im into.",
  "I used to get so much more out of my trips. I could get so deep inside my mind and travel across space and time.",
  "Oh yeah. Did I mention my second psychedelic drug ever (after a few light morning glory seed trips) was DXM. DXM is the fucking shit, therefore I went through a two year period where I used the stuff on an almost weekly basis.",
  "DXM is psychedelic heroin. Other psychedelics off visual distortions and insights. DXM offers out of body experiences, full OEV/CEV hallucinations, can provide astral projection with rarely any anxiety at all. Taking most other psychedelics drugs aren't really a 'trip'. So what if the carpet patterns a bit and colors change.",
  "There are a few limiting factors which prevent DXM from being the ultimate trip.",
  "1. Many people complain of a drunken feeling, double vision, 'robo-itch', nausea, skin flushing, diarrhea, etc. I have done a lot of DXM and barely ever experienced these side effects. I've done DXM in a few forms.",
  "Pure DXM powder: Fuck that shit. The only times I ever got nauseous or had 'bad trips' on DXM was with a batch of pure powder. I don't know if it's an absorption issue, but whatever.",
  "Robo-brand Cough Gels: There is some shit in there that gives me liquid shits. The time I tried that stuff I had to take a liqui-shit ever 30 minutes. Fuck that shit as well. Another product to avoid are Sucrets. I have to eat so many of those nasty oversized 'hard candies' to get a decent trip, it's not worth it. And it's more expensive. Finally, I avoid generic Robo-Max-Cough rip offs. For some reason they just don't seem to hold as much magic. I get Robo-name-brand Max Strengh Cough. It's in a blue box. No Cold. Just Cough. That is the best way to get DXM. The flavor isn't that bad, it's relatively inexpensive, and it's always given me the best trips.",
  "3. One main negative of DXM is that even though the OBEs are fun as hell and feel great and are beautiful to watch and experience, they seem kind of random. Also it is hard to remember exactly what happened after the experience. It's tough when Im sucked into so many different worlds and realities from so many perspectives to get much out of it except a few select memories of the things I thought were extra cool and tried hard to remember.",
  "I ate four grams of mushrooms.",
  "I spend a couple hours with my eyes closed listening to music and floating through alternate dimensions. During this time I experienced the act of building a city from scratch. I experienced, with my eyes open, astral projection. That is, I rotated upwards and floated above my body looking down on my room, which didn't look exactly like my normal room because of the extreme visual distortions, but it was still my room. I spent a lot of time floating, flying, and warp-speeding through and past various trippy spaces. I sunk down into a fucked up trippy version of hell and watched all of Satan's slaves bustin' their asses in the fiery pits. But I was floating above them and had zero fear of becoming part of this scenario.",
  "So many other out of body experiences occurred that there's no point in describing most of them. Anything can happen. I can travel through time. I can become a stone in the road in ancient Rome. Or part of some crazy machinery used on another planet.",
  "Some people think DXM isn't psychedelic. I strongly disagree. But the combination of DXM and mushrooms is more psychedelic than 500ug of LSD or ayahuasca. And a hell of a lot easier to handle.",
  "I personally saw lightning bolts on the wall. Very vividly. The carpet was rising up, in sections, like 6 inches above the normal carpet height. The mushroom visuals mix with DXM's power to shift my perspective and distort my visual point of view.",
  "Around this point I went to my bedroom to smoke another spliff and have some more OBE time. I ended up talking to my girlfriend (who was shroomin' on a lower dose, no DXM) for a while and according to her I was pretty coherent. I definitely felt like I was in another world though.",
  "So I smoked that spliff, turned off the lights, and, wow. It didn't matter if my eyes were open or closed, even though I could see pretty well with the lights off. My room was constantly transforming itself into something different. So many random things I can't even describe them. At one point my room stretched out way longer than it really is, and I was looking down into a sunken garden. Of course it was fully light outside, I was seeing this all with perfect daylight clarity and photorealistically. Then I went up the steps of some ancient temple at the other side of the sunken garden (by floating over there, of course, it's the best way to travel!) and at the top of the steps was a big bright light. All of this with my eyes open in a dark room. I walked through the bright light and into heaven. Unfortunately I can't remember exactly what heaven was like, only the area outside heaven which resembled an ancient sunken garden. Oh well. Then I probably snapped out of that and flew off somewhere else.",
  "Now it was probably 4:00am and at this point I was thinking the comedown, which was still very strong (DXM and Shrooms make each other last like twice as long, it's great!)... anyway I was thinking the comedown reminded me of MDA, at least visually. A high dose of MDA. But then I checked my pulse and it was perfectly normal. My body felt great and I didn't really feel all that cracked out. So I would say the comedown off this is very enjoyable because I am still able to feel all floaty and watch my room transform into different things in the darkness.",
  "I personally chose to take some Valerian root extract at around 4:00am. This put me in an even dreamier state, something which I would consider using earlier in the trip next time.",
  "Then around 4:30am I smoked a small bowl, brushed my teeth, ate 1mg Xanax and 0.5mg Klonopin. I drifted off into sleep very peacefully.",
  "And woke up at 2:00pm the next day feeling like a million bucks!"
 ],
 "erowid": {
  "id": "46864",
  "citation": " Bluedolphin. \"The Hitchiker's Guide to the Galaxy: experience with DXM & Mushrooms (ID 46864)\". Erowid.org. Jun 16, 2007. erowid.org/exp/46864",
  "substance": "DXM & Mushrooms",
  "views": "12762"
 }
}
