{
 "title": "The Power of Control",
 "author": "The Lizard King",
 "citation": " The Lizard King. \"The Power of Control: experience with LSD (ID 7650)\". Erowid.org. Jun 23, 2003. erowid.org/exp/7650",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "2 drops",
  "oral",
  "LSD",
  "(liquid)"
 ],
 "report": "<p>Have you ever 'controlled' acid? Well, not only did I, but I taught two others as well.</p><p>My friend Rob did it for his first time this weekend.  Buddy Jeff and I took him to the hills.  It hit fast, we took it at 9am, and by 10 - the trees were waving.</p><p>Several weird things happened during this trip, and might I say that this trip is the best time I've had in my entire life, never have I felt such joy.  By the way, I'm the guy that done it over 300 times (yeah a lot of good times in highschool).  I'm 25 now.</p><p>Rob handled it perfectly.  Not even a hint of any possible apprehensive feelings.  The clouds came out and put on a fantastic display of vibrant colors, a brilliant array of spectrum in the clouds by the angle of the sun.  The hawks flew around us, sometimes pausing in the spectrum as if they knew we were watching.  Also, even though it was Rob's first time, and time flies when you're having fun - he was TELLING TIME correctly.  It boggled us, he would be exact to the minute as far as telling how long it's been or what time it was at any given moment.  He was at one with time.</p><p>After spending a few hours out there, we headed back to have my girl pick us up so we could go to my house.  On the way back, the first BREAKTHROUGH #1 happened.  As I'm walking, I accidently dropped the plastic wrapper of my cigarettes.  I continued walking and HEARD the hills hiss at me.  I don't know if I heard the hills hissing at me, or if I actually heard the sound of the little plastic hitting the leaf that it landed on.  Seems unreasonable for a human to be able to detect such a minute sound, but who knows?</p><p>At this point I will give all my fellow trippers a wonderful present, here you go:  This is a method that Rob, it being his first time, brought to my attention.  You know when you're trippin' real hard and it starts to get kinda intense?  Well, a lot of people may get a worried look on their face that can set off a bad trip.  Here's the NEW solution, and it works!  Rob did this a million times, and it was PERFECT!  You know what he did?  Simple.  When it got intense, or when something awesome happened, he would whistle.  Yup.  Just a plain little 'Whew' type of whistle.  That sound and the act of doing just lets you 'wash' the intensty and absorb everything, while maintaining yourself.  MAKE A NOTE OF IT, REMEMBER IT, and try it next time.</p><p>Now for the house.  My girl took some and we took more so we could experience the night.  We did, and off we went, into Wonderland.  I lead the night, being our guide and host of the show.  I talked us through everything and took us on many mental journeys.  A funny thing was pointed out by my girl.  She said that I 'spoke with the weather', meaning every time I got more intense, the wind would pick up.  Anytime I would shut up, the wind would DIE completely.  This happened four times that she could recollect.  I personally think that the breakthrough here was that I must have been feeding off the wind myself.  BREAKTHROUGH #2.</p><p>Back in the house, we were seated.  I began to explain to my girl and Rob how they can control the melt.  I told them to focus on whether the walls are melting down or up.  Then I told to tell the acid to STOP melting, and turn around and go the opposite direction....it worked!  Both of them were able to dictate whether they wanted the wall to melt up or to melt down.  BREAKTHROUGH #3.  I gave both of them a new power.  And powerful they did feel.  We felt like Gods, we could do anything.</p><p>The grand finale of the night was when I was telling a funny story (forgot the story, sorry).  The funniest thing is this:  As I'm getting to the punchline of the story, I begin to laugh, I laugh so hard it literally buckles me, and sends me bending over and that was it.  I come back up with tears in my eyes, and no story to tell.  Just a big smile on my face telling both of them that I've never laughed so hard in my life that it actually BUCKLED me.</p><p>Acid is my personal treasure.  Some people are afraid of it, and they should be, because obviously they have problems with themselves.</p><p>If your soul is pure you have nothing to fear.  The only bad trips come out of doubts about yourself, if you have not yet cleansed yourself of the sins YOU feel you are guilty of.  Release yourself, free your mind, and fly.  I am clean and reborn.</p>",
 "year": "2001",
 "id": "7650",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-06-23T07:00:00.000Z",
 "views": "8763",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 drops",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 }
}
