{
 "id": 7650,
 "title": "I Was Really Impressed",
 "date": {
  "submission": "2006-12-13T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bluedolphin",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "pill/tablet"
  },
  {
   "time": "0:00",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "2C-C",
   "form": "powder/crystals"
  },
  {
   "time": "0:30",
   "amount": "63 mg",
   "administration": "oral",
   "substance": "2C-C",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Allright I should warn you right off the bat. I'm on a bit of 2C-C, cannabis, clonazepam, and a couple shots of rum. So bear with me if this isn't the most professional of reports.",
  "Where to begin... well, how about with the fact that I am pretty biased against phenethylamines. They just don't seem to tap into that universal consciouness like mushrooms or LSD can, they seem to offer fewer insights, and the euphoria feels chemically false, or over-stimulating.",
  "With 2C-I, which I tried many times, I was impressed at first. But now, in hindsight, I think that stuff is pretty much useless eye candy with weird body feeling and indigestion.",
  "2C-D seemed promising but after doing 200mg within a short time span, like 4 or 5 hours a few weeks back, I think that even huge doses of this chemical lacked any depth. It's just eye candy, and not even that great of eye candy either. It's stimulating nature made me spend most of this trip, even at 200mg, chatting with people online and such. A 2 gram mushroom trip would have taken me much deeper.",
  "2C-E,.. well I never really had the balls to try a full dose but after my 100mg 2C-C dose I might have to reconsider!",
  "I think 2C-B is over-rated garbage. I think it's the worst thing a phenethylamine can become. Pure hedonism and self-destruction rolled in to one. It is a rare example of a psychedelic drug that has pretty much no benefits besides some pushy euphoria.",
  ".............",
  "So tonight I tried 2C-C. I happened to have preloaded with about 1.5mg Klonopin.... which is just slightly over the amount I take each day, although sometimes switching to lower doses of vallum.",
  "But anyway, I am really trying to get at the 2C-C. At first I took 40mg and as soon as I saw it start to manifest I immediately ate the remaining 63mg I had stashed away. [Erowid Note: 100 mgs of 2C-C is considered a very high dose, see 2C-C Dose Chart]",
  "What followed can best be equated with a 300ug LSD trip... except with less paranoia and a clearer mind.",
  "However! I was really impressed with the 2C-C's ability to trick my mind and convince me of alternate scenarios, times, and places until I snapped out of it and both the drug and I had a good laugh.",
  "The effects on sound are like nothing I've ever heard. Music would go from surround sound, to lo-fi, to computerized beeps and bloops, to static, and back to normal music. It was totally bizarre and unpredictable.",
  "Also I was able to change the sound of the internal voice in my head.... you know just your normal (I hope) thinking-narrative-reading-along internal voice... anyway I could make that sound like anything, mostly weird robots.",
  "The visuals were absolutely stunning. Easily on par with 300ug of LSD, but with its own character. 2C-C is certainly well defined visually compared to other PEAs I've tried.",
  "Also, I felt/saw the presence of a guiding force over my shoulder thoughout the trip. As I write this it still returns occasionally.",
  "........",
  "At least based on my first trial I can only conclude:",
  "At 100mg my body functions felt totally normal, and my pulse was raised maybe 10-15% above normal. Now that I'm very much on the comedown (the trip only lasts about 4-5 hours, it's biggest weakness!) I notice a bit of tension and jitteryness in my body, but it's relatively mild compared to almost any other psychedelic except mushrooms.",
  "....",
  "This stuff really is the shit. I hope more people get a chance to see for themselves."
 ],
 "erowid": {
  "id": "46865",
  "citation": " Bluedolphin. \"I Was Really Impressed: experience with 2C-C (ID 46865)\". Erowid.org. Dec 13, 2006. erowid.org/exp/46865",
  "substance": "2C-C",
  "views": "10374"
 }
}
