{
 "title": "Spiritual Japan Experience",
 "author": "Heiwa",
 "citation": " Heiwa. \"Spiritual Japan Experience: experience with Mushrooms - P. Cubensis (ID 7662)\". Erowid.org. Feb 27, 2003. erowid.org/exp/7662",
 "substance": "Mushrooms - P. Cubensis",
 "bodyweight": "80 kg",
 "report": "<p>This took place in Hokkaido, Japan, where mushrooms of any kind are legal.</p><p>Once again I dove into the depths of spirituality, this time cubensis imported from Amsterdam took me there. </p><p>The setting: Kaguraoka Park, a little bit of wild Hokkaido preserved atop a hill and next to a river within my city.</p><p>After ingesting at my house, we set out down the river trail toward the park.  I was already somewhat out of it from the St. Johns Wort we took (MAO inhibitors make shrooms stronger) so we jollied are way slowly, and they already started kicking our ass while we were still pedaling there.  Under the train bridge we went, Kaguraoka gleaming before us.  At then a most magical thing happens: a small, two car passenger train passes, illuminating through the trees, leaving us mystified.  On to the park, the hill of tall trees breathing over us.  At this time it was dusk.</p><p> Most people could hardly hold up to voyaging into a dark forest in our state as it grows totally dark.  Ryan and I are full exceptions to this.  That is not to say that I didn't have my fare share of second thoughts, thoughts that I might end up running out of this darkened hell screaming in terror, but for the most part these thoughts were small and short lived. </p><p>A mysterious sense swept over us as we first entered the lower part of the park along a sparsely lit trail.  Then I looked up.  The canopy was in fractal slowly expanding, expanding, pulling my head with it, then whack, it all contracted and hit my head, almost knocking me over.</p><p>And that was only the beginning.  We continued along the trail, then to the hill trail, up into the unlit unknown.  Nothing like the eerie feeling of this.  Again, not for the faint.  At that point something moved on the ground and made me jump 5 feet back, but I kept it under control.  Onward we continued, looking for a place to lay down our newly bought tarp and truly trip.  Along the next trail, we could still see the lights of humans, of the city in the distance, so we ventured until we found a spot where almost none were visible.  This is where we set up our temporary camp.</p><p>We layed down, talked little, and let our minds take over.  More fractals in the canopy, swaying back and forth, I could control them with my hand.  Suck it all into my palm, throw them all back out.  Other people in the park were drumming the old Japanese kodo drums adding a great deal to the spirituality, Ryan kept seeing all the monkeys in the trees.  He had a full out of body experience in which he truly got in touch with his inner soul.  Soon after that he began to hate the working of mankind, and dawned an idea to build our own tribe in rural Canada. </p><p>We then left our camp and ventured deeper into the forest to get closer to the plants and animals we felt infinitely connected to now.  The reflection and insights we then made about the world were priceless.  My entheogen of choice.</p>",
 "year": "2001",
 "id": "7662",
 "gender": "Male",
 "timestamp": "2003-02-27T08:00:00.000Z",
 "views": "7045",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  }
 }
}
