{
 "title": "Too much, too much!",
 "author": "Dr. Shock",
 "citation": " Dr. Shock. \"Too much, too much!: experience with TFMPP, LSD, & Cannabis (ID 7668)\". Erowid.org. Jun 26, 2001. erowid.org/exp/7668",
 "substance": "TFMPP, LSD, & Cannabis",
 "bodyweight": "180 lb",
 "report": "<p>The prior week, I had tried TFMPP for the first time. The 100mg dose I took then didn't do much to me. In response a week later I decided to double the dose. The first experience was so mellow that I was completely shocked by what happened to me later that night.</p><p>Around 7:00 PM I weighed out 200mg of TFMPP on my electronic scale and packed it into a small gel cap. Down the hatch it went. I had decided to take it on an empty stomach to avoid nausea.</p><p>At 8:00 PM I'm beginning to feel the effects. Its almost as if you can feel your blood burning through your veins. At times it can be euphoric, but otherwise its uncomfortable. There is no real change in thought pattern at this point in the night.</p><p>8:30- Some friends drop by for a visit and offer me a hit of acid which I gladly accept. My common sense is getting a little fuzzy at this point and I'm beginning to get really nauseous whenever I move. However, if I stay still I seem to be okay.</p><p>9:30- Trying to help, fiance/tripsitter decides to pack a bowl of weed to keep me from throwing up. The nausea was becoming intolerable. The marijuana killed the nausea but, my God, I was so stoned I couldn't move after 3 hits! I guess TFMPP really does lower your tolerance to THC a LOT. Unfortunately, its not pleasant as the body high is beginning to become physically painful as the LSD creeps up on me.</p><p>10:30- After getting lost in the bathroom for half an hour I feel so lethargic I decide its best just to sit still on the couch. I can't seem to keep myself from talking, no matter how hard I try, and at least my trip sitter is trying to keep up with the conversation which has become a little off the wall by now. Despite being inside in a temperate room, my body doesn't seem to be able to keep a constant temperature. Every time I feel that surge through my veins every 10 seconds or so I get a nasty chill. My trip sitter decides to take my temperature which ends up reading to only be 94.6 (I'm usually about 96 or 97). The effects of the LSD are almost completely unnoticeable through the intense body high from the TFMPP.</p><p>12:00- The effects from the TFMPP are beginning to taper off, although the LSD seemed to be sustaining the high. The cold flashes have subsided for the most part but my body aches like I've been pumping iron all day.</p><p>1:00- The TFMPP is barely noticeable but I'm physically very tired and can't sleep. The rest of the night I spend staring at the ceiling wishing for sleep to come.</p><p>In short, I won't ever take this much TFMPP again with any combination of substances. Its just not a pleasant experience at this high a does.</p>",
 "year": "2000",
 "id": "7668",
 "gender": "Female",
 "timestamp": "2001-06-26T07:00:00.000Z",
 "views": "24296",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Piperazines - TFMPP",
   "form": "(capsule)"
  },
  "1": {
   "time": " T+ 1:30",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "2": {
   "time": " T+ 2:30",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
