{
 "id": 7670,
 "title": "The Music and the Void",
 "date": {
  "submission": "2005-11-09T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Mr. Trichocereus",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tsp",
   "administration": "oral",
   "substance": "Syrian Rue"
  },
  {
   "time": "0",
   "amount": "T+ 0:10",
   "administration": "10 g",
   "substance": "oral"
  },
  {
   "time": "Cacti - T. pachanoi",
   "amount": "(ground / crushed)",
   "administration": "T+ 0:10",
   "substance": "19 g"
  },
  {
   "time": "oral",
   "amount": "Cacti - T. peruvianus",
   "administration": "(ground / crushed)",
   "substance": "T+ 0:00"
  },
  {
   "time": "repeated",
   "amount": "smoked",
   "administration": "Cannabis",
   "substance": ""
  }
 ],
 "report": [
  "It all started early in the morning (10:00). I ground up enough cactus tissue for 3 equal doses, and walked to my friend's place across town. We ate the Syrian Rue with orange juice to wash down the horrible, horrible flavour, then waited 10 minutes to eat the ground cactus powder.",
  "After what seemed like forever (time slowed down), the cactus started to work. Time ceased to matter, and the room was shaded darker. The walls and the ceiling blended together for awhile, and then the ceiling just started warping... then it started looking like an ocean. We all decided to go for a walk... we sat down at a secluded picnic table in the trees, and started smoking a lot of pot. This is when things really started kicking in...",
  "The two friends, who we will call A and B, started wearing face-paint. A looked reptilian, with a lizard-like armour on his face, while B looked really really sick... just like a cartoon drawing of a sick person. Purple nose, green skin... I could tell he needed some serious healing (he actually was sick).",
  "On the walk back to B's house, it felt like I was walking into another dimension. We got inside, and just layed on the floor listening to music for what seemed like a lifetime. The cactus really started kicking it up a notch... taking me places I've never been with any other psychedelic (and I've done a lot of them). Places I never bargained to go (not a bad thing); places I never knew existed. I felt EXTREMELY POWERFUL shamanic healing energies flowing through me. They were multicoloured, and radiated through my body like strands of rainbow electricity... but they weren't electric at all. They also had a lot of very strange Native-style designs on them. This is when I realized that a cactus is NOT a toy! Something was pushing me to send these energies out to my friends, who were in need of healing, but something inside me didn't want to take that step. It was a very new and powerful experience that I didn't fully understand at the time. I sat back up again, in total awe of what just happened to me.",
  "I layed down again, only to have more visions. This time I saw billions (and I do mean billions) of hands everywhere, flowing. Things got really mystical and magical. I realized I was seeing the true face of this cactus now, and before I had never taken it seriously enough. This cactus showed me things that I can't even describe in any human language. It was pure perfection.",
  "Next, my nose floated upwards to create the clouds, which in turn created a sky... my mouth floated downwards to create a grassy field with a river, and then a bridge just appeared. I was all of the aspects of this environment, and it was being dictated by the music. I started to think about my life... I saw myself at work, and just let go. Then I saw myself as part of other people's lives, and just let go. Then there was just me and the music. A song I now recognize as Juno - A Force Beyond from DJ Tiesto's Forbidden Paradise 3... which blended into the next 2 songs on the album perfectly. I was in this void with just music playing for what seemed like a lifetime. Time ceased to exist, and the short song seemed to span for hours, days, months... this was by far the most powerful song I've ever heard. It was so precise. I could see it visually, but not really... I felt a sense of green, but the music was white (this doesn't make any sense unless you've seen it). It was just a vibration... a very precise vibration. It seemed to be similar to an analyzer on Winamp/XMMS, but there was so much more to it. I could talk about it for years and never get my point across. It was just so precise... and it made me realize that mescaline is definitely up there with the most powerful of psychedelic substances... it may actually be the most powerful. I've never smoked DMT, but this definitely blows the socks off what everyone has said about DMT... I can't really make the judgement though.",
  "When I was in the void with the music, I was forced to face myself. I stepped over a line I've never stepped over before... I experienced what they call ego-death... oneness with God and the universe, clear white light, etc etc. It doesn't matter how I describe it, because it's all the same thing. Then I went further... and further... and further... until there was only one more line to step over (I've experienced ego-death with mushrooms... and this was much more; I've come to believe ego-death is only the beginning, and there are more levels that only a cactus can show you). I was given a choice in this matter. The cactus knew I wasn't ready to step over that last line... and so did I. I'm unsure of what might have happened had I stepped over that line. It could be anything from death, to insanity, to a permanent state of enlightenment. It felt like I was surfing on the edge of my own sanity. But I know one day I'll be ready to face that part of myself. I was shown enough to keep my mind occupied for years already. I will repeat this dosage when the time is right. It could be years from now.",
  "After that was all over, I sat back up. A and I left the house and went for a walk across town. The scariness of what just happened was beginning to fade. We saw some very dirty people, and they came up to us and wanted to sell us pot... we told them we had plenty. They figured we were on something... A told them it was mescaline. I told them it was mushrooms, because I didn't want these people knowing the secret of the cactus... there's no way they could deal with what I dealt with today. They were convinced it was mushrooms. As we walked, the one started yelling demonic screams... they echoed loudly across the entire landscape. That guy made a huge fool of himself. Everyone was watching him. He screamed something about magic mushrooms. I realized he would probably tell everyone he knew that he saw us like this. Those people had terrible energy and I could feel it the whole time... I was so relieved to be away from them.",
  "When I got home I just layed there, and thought about what happened to me. I finally came to grips with it, and then A got online and wanted to meet me outside... so I met him outside, and we went to the local conservation area with his girlfriend. I sat down by a tree and sorted out all kinds of things in my mind. I hugged both of them, and thanked them for being there for me in a time of need.\tI came home again, and just layed in bed... I couldn't sleep because I had way too much to think about. Eventually I just took a valerian root tablet and fell asleep an hour later.",
  "This cactus changed my life forever. I wonder who I'll be a year from now. I don't recommend this experience to any but the strongest of mind. I realized I have a VERY strong mind to handle what happened to me, but there's still more that I'm not ready to see. I'm not as strong as I thought previously... I have been humbled. A cactus is not a toy, it's a shamanic tool, and should never be abused. At lower doses it's only showing what's on the surface... but a cactus is much deeper than any human being, and when I saw that, I was pretty shocked. I had no idea."
 ],
 "erowid": {
  "id": "46938",
  "citation": " Mr. Trichocereus. \"The Music and the Void: experience with Syrian Rue, T. pachanoi, T. peruvianus & Cannabis (ID 46938)\". Erowid.org. Nov 9, 2005. erowid.org/exp/46938",
  "substance": "Syrian Rue, T. pachanoi, T. peruvianus & Cannabis",
  "views": "22768"
 }
}
