{
 "title": "My Medicine",
 "author": "Ziggie",
 "citation": " Ziggie. \"My Medicine: experience with Cannabis (ID 76703)\". Erowid.org. Apr 7, 2010. erowid.org/exp/76703",
 "substance": "Cannabis",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>I've been a fairly heavy pot smoker for the past few years, and I've suffered from depression for the last two or so, due to moving from the only place I've ever known and being cast out from my social circle.</p><p>I stopped smoking when my life went askew, thinking that I should pull my act together, and this sent me even deeper into the void. I was suicidal, angry, dangerous, and nearing psychosis. I began to exercise, and this took away some of the pain, and through this I met some of my closest friends who smoke bud, and they convinced me to smoke with them once again.</p><p>I took a few hits from the bong and felt my head clear... I felt normal again. I felt like I did when everything was good in my life. I wasn't 'stoned', I was just how I was before I became depressed. I took a few more hits, THEN I was stoned, but just those few tokes sent me back to a sanctuary of a stable and motivated mind.</p><p>After this sesh, for the next week or so, I felt quite good, but the anti-depressive effects began to wear off, so I smoked another bowl, and I was back in a a place of a normal mind.</p><p>Now, with the help of pot, I'm actually able to do work, have good friends, love my girlfriend, be on a sports team, and make some extra cash. This is a stark difference from where I was shirking all responsibilities, drinking alone, living in a delusion all the while being dirt poor. Pot turned my life around, and I thank God and whoever else is up there that this herb is on the earth for us to use, even though it is illegal in this great nation.</p>",
 "year": "2008",
 "id": "76703",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-04-07T07:00:00.000Z",
 "views": "4188",
 "dose": {}
}
