{
 "title": "Long And Depressing",
 "author": "Cyparissus",
 "citation": " Cyparissus. \"Long And Depressing: experience with Nutmeg & Alcohol (ID 7672)\". Erowid.org. Jun 24, 2003. erowid.org/exp/7672",
 "substance": "Nutmeg & Alcohol",
 "bodyweight": "240 lb",
 "report": "<p>I'd tried nutmeg several years before, but the experience was inconclusive enough (I certainly don't remember anything more than a very slight feeling of intoxication) that I kept open the possibility of trying again.  Well, yesterday I tried, and I'm regretting it.  I grated two nutmeg nuts into a saucepan of milk mixed with a little half-and-half (reasoning that the milkfat would help dissolve the essential oils), simmered for about ten minutes, and then decanted and drank it, flavored with chocolate syrup to help it go down.</p><p>I imagined that almost right away I was feeling a little intoxicated, but I'm quite prepared to believe that this was entirely psychosomatic.  The real intoxication came a couple of hours later.  It was like a heavy blanket settling on me; I felt 'defocused' somehow.  While it was coming on, I watched a movie and fast forwarded through parts of it; it was hard for me to keep my attention on things.</p><p>Drinking the alcohol on top was a mistake perhaps, but it speaks to how little I was getting out of the nutmeg; the nutmeg wasn't making me feel good, in fact I was feeling depressed, and hence I drank.  When my boyfriend came home, I felt distant and detached from him, and we ended up getting into an argument which fortunately didn't last long.  I kept doing stupid things, and forgetting things; my boyfriend sat down to dinner, finished and washed up, and then laughed when later I asked him stupidly if he'd eaten yet.</p><p>I had a very poor and restless night's sleep, and woke up feeling terrible.  Not _physically_ ill, no hangovers or red eyes.  But I still felt that 'blanket' of the nutmeg intoxication, heavy and oppressive.  The feeling has deepened.  When I tried to lie down and get a little extra sleep, I was restless, and tossed and turned a lot.  Right now, if I had any Valium, I'd take one, just to get me through the day.</p><p>I'm not doing this again.</p>",
 "year": "2001",
 "id": "7672",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-06-24T07:00:00.000Z",
 "views": "8971",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 nuts",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 }
}
