{
 "title": "For Opiate Wthdrawals",
 "author": "Danyv",
 "citation": " Danyv. \"For Opiate Wthdrawals: experience with Quetiapine (Seroquel) (ID 76767)\". Erowid.org. Jun 26, 2009. erowid.org/exp/76767",
 "substance": "Quetiapine (Seroquel)",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Pharms - Quetiapine",
  "(daily)",
  "",
  " ",
  "",
  "Opiates",
  ""
 ],
 "report": "<p>I recently found myself going through the absolute horror of full blown opiate withdrawal (for the first time) from morphine and hydrocodone and kratom tincture, used for 3 months solid on a daily basis. While searching the internet for ways to alleviate my suffering, (I didnt seek proffessional detox treatment), I found some info suggesting that benzodiazepines are useful for treating the intense anxiety and insomnia. So I got a prescription for for temazepam from my DR. (told him I was stressed at work and having trouble sleeping.</p><p>30 mg yellow capsule. the proper dose was 1 pill, but I had to take 3, sometimes twice a day to get relief and sleep, consequently, I ran out early and couldnt get anymore from my Dr. because he would think I'm a pill head. So, I'd taken seroquel before and It will make me check out like no other, deep sleep, sedation that I cannot resist. Its effects are not pleasurable like the benzo's, and medical professionals realize this and prescribe them freely because of their lack of abuse potential. I went back to my DR. and told him I still couldnt sleep well even with the temazepam, and that I thought I was having a manic episode (I have been diagnosed with bi-polar disorder) and that seroquel had worked in the past to bring me down from my agitated state.</p><p>Long story short, He gave me a shitload of physicians samples and I took them at 50 mg intervals eventually taking about 200mg a day at the end of 2 weeks, I was able to fall asleep. It really did help with the anxiety and agitation of my withdrawals. Its not a magic bullet, I still feel pretty bad, and I am really out of it, hazy foggy tiredness, but it really took the edge off for me. I'm writing this so that maybe someone else can find some relief from their own detox hell that we affectionally know as opiate withdrawals.</p><p>For the record, I truly believe that the withdrawals did send me into a highly agitated manic state, so what I told my doctor was not a lie, I just didnt give him all the information.</p><p>[Reported dose: 50-400 milligrams]</p>",
 "year": "2008",
 "id": "76767",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-06-26T07:00:00.000Z",
 "views": "21250",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "(daily)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "Opiates",
   "form": ""
  }
 }
}
