{
 "title": "Good but Frustrating",
 "author": "non3",
 "citation": " non3. \"Good but Frustrating: experience with 4-Methylmethcathinone (ID 76768)\". Erowid.org. Feb 10, 2009. erowid.org/exp/76768",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "72 kg",
 "report": "<p>Yesterday I tried out a batch of mephedrone (4-methylmethcathinone) for the first time. The powder has a consistency of flaky crystals that are very light. The powder is of pure white colour and without odor. The taste is very bitter and chemical. I have seen a batch of a friend of mine that was very smelly and was off white to yellowish. Doses of 200 mg were measured on a precision scale.</p><p>13.00 I split the first 200 mg package in four lines of 50 mg and insufflated a line. The burning sensation in my nose was very severe.</p><p>13.10 I definitely feel some amphetamine-like effects but very subtle and without any physical signs. There was a tingling sensation as I get with all stimulants.</p><p>13.30 I insufflate another 50 mg line. This time the burning sensation is even worse and my eyes start to get watery. I will not insufflate this ever again.</p><p>13.50 Feeling quite good but strange. There is definitely amphetamine like effects but there is also something else  a heavy head and mild euphoria. My heart rate by this time was 100 bpm. As the effects were not very strong I decided to take another 100 mg dissolved in orange juice.</p><p>14.20 Definitely feeling high, there is quite a lot of euphoria but there are no empathogenic effects from this chemical. For me the feeling would be best described as the coming down from MDMA, when I still feel good but am not loved up. Music sounded really good and I was happy to listen to anything without vocals. My heart beat rate was 120 bpm.</p><p>15.00 I had a feeling that I still didnt have a breakthrough with this chemical and decided to take another 100 mg in OJ.</p><p>15.30 By this time I felt quite euphoric but very empty. I didnt have any sexual desire as I do with amphetamines and MD(M)A. My heart rate was 120  130 bpm. My pupils were normal (I think). I am deciding if I should take another 100 mg but decide not to as I didnt get the effects that I like. I smoke a joint and feel much better.</p><p>16.30 The peak is slowly getting over and I start to see some strange visuals. I start to see things appearing in the corner of my eye but when I look at them they disappear. This happens to me when I am on a lot of amphetamines.</p><p>17.30 The effects are mostly gone but I still have a full head and a strange feeling. The comedown isnt really problematic and there is no crankiness.</p><p>At 19.00 I feel quite normal and am fully functional again. Sleep was quite light and I kept waking up the whole night but I am quite sensitive to stimulants so this wasnt a surprise.</p><p>All in all this is an interesting compound but it is quite mild. I would not be comfortable doing anything more than 300-400 mg but at that dosage the effects are just not worth it. If you like euphoria then this may be worthwhile, but for me this compound lacks something.</p>",
 "year": "2009",
 "id": "76768",
 "gender": "Male",
 "timestamp": "2009-02-10T08:00:00.000Z",
 "views": "36728",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 0:50",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "4-Methylmethcathinone",
   "form": "(liquid)"
  },
  "3": {
   "time": " T+ 2:30",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
