{
 "id": 7678,
 "title": "Fear and Loathing",
 "date": {
  "submission": "2010-01-27T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TrippyHippie",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "oral",
   "substance": "2C-I"
  }
 ],
 "report": [
  "It was a Friday and I was heading up my friends College to chill with and take 2c-i.  I wasnt too excited about it because I just recently was recovering from a overwhelming LSD adventure.",
  "We had 9 people who did 2c-i with us and only 1 trip sitter.",
  "7:00- 20mg of 2c-i was consumed orally in a gatorade bottle.",
  "7:45- Nausea was setting in and anxiety.",
  "8:30- Slight body euforia, visuals start...",
  "       'Oh man, look at that wall'",
  "9:30- Definite hallucinations, vivid colors, looking very similar to an acid trip. We head over to the football stadium, tripping crazy balls. We all fit into 2 cars. It was pretty ridiculous how messed up we all were.",
  "The stadeum was completly empty and utterly overwhelming.  We played football barefoot, down on the actual stadium grass. We used someone shoes as a football and ran around tripping harder every second.",
  "10:30- Arive at a small party.  I was nervous about coming here and had anxiety about it.  My close friend kept reminding me that I was just paranoid and nervous from the drug.  I need to 'ride the wave'",
  "10:31- I was in the house in complete and utter happiness.  I was a bit in all the coversation and overwhelmed but I didnt matter much to me because everyone there was on at least 2c-i.",
  "11:00- Old Pink Floyd albums played in the background and everyone was smoking weed and drinking.  I personally chose to smoke white and blue lotus flower out of a hookah. (You can smoke weed anyday)",
  "(White and blue lotus flowers are a powerful seditive and have similar feelings to opium.)",
  "11:30- This is the peak of the trip. Visuals were outstanding, and cognitive thought was moving very rapidly like an acid trip. The lights in the house went off and while glowsticks spun around on the fan, 'The Darkside of the Moon' album played in the background. My friend had to bring a blunt over to my mouth in order for me to smoke it.  I was so Oped-out from the white lotus flower I could even move my body.",
  "1:00- Alice and Wonderland was put on T.V. and we all chilled out",
  "7:00am- People sleeping in weird positions strewn around the living room. It looked like something out of Fear and Loathing in Las Vegas.",
  "Over 2 ounces of weed was lying around the room in various pipes, bongs, joints, blunts, and hookahs. Dozens of beers were scattered around the house.",
  "If the police walked in that night they would of been speechless. They would of taken pictures of the place before the even started making arrests.",
  "All in all, it was a good experience. I greatly enjoyed it. I dont think I will be doing 20mg doses for a while though."
 ],
 "erowid": {
  "id": "46955",
  "citation": " TrippyHippie. \"Fear and Loathing: experience with 2C-I (ID 46955)\". Erowid.org. Jan 27, 2010. erowid.org/exp/46955",
  "substance": "2C-I",
  "views": "3316"
 }
}
