{
 "id": 7685,
 "title": "DOChead",
 "date": {
  "submission": "2006-03-02T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "psychemon",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.5",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "DOC",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "I had heard that all the DOC that I had previously seen was nothing but 2C-I. I guess there was a mistake somewhere along the line, but regardless I now have had the opportunity to actually try some DOC. I have had previous experience with many psychedelics such as LSD, Psilocybin mushrooms, 2C-I, DOI, and an array of others, but I must say that this DOC was very unique.",
  "I believe it could possibly be one of the best as far as DOB,DOC,DOI, or DOM go. I was at a friends house which has always been the perfect tripping environment. The DOC was on blotter, and each piece was supposed to be around 2 mg. I took about 2 and 1/2, which is about what everyone else took too. Just like the other drugs in this class DOC takes quite some time to actually begin taking effect. Once I began to feel the effect which was about at the 90 minute point it got nothing but stronger for about ten hours. The visual effects of this particular substance suprised me greatly. It makes DOI look totally uninteresting as far as the visual aspect goes. I had read another report where the individual said he has found his new LSD replacement with DOC. I totally agree with this, because it is one of the funnest, and most interesting RC's I have tried. I maintained a very clear head the entire experience. I would also often have joyous euphoric effects. DOC really does last a long while just like the others in the class.",
  "The next day I felt lingering side effects pretty much the entire time until I got some sleep, but nothing I was not used to from other psychedelics. It doesn't seem to be just me either, because I have now seen lots of people try DOC, and everyone shares the same views on it. It has now been only 24 hours since the DOC has worn off, and I am already eager to continue experimenting with it. I do not want to make it seem addictive, because we all know that is pretty silly, but I must admit I have become a DOChead."
 ],
 "erowid": {
  "id": "46976",
  "citation": " psychemon. \"DOChead: experience with DOC (ID 46976)\". Erowid.org. Mar 2, 2006. erowid.org/exp/46976",
  "substance": "DOC",
  "views": "12216"
 }
}
