{
 "id": 7686,
 "title": "Microwaving My Textbook",
 "date": {
  "submission": "2007-12-28T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Doger",
  "gender": "Male",
  "weight": "230 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "2:30",
   "amount": "1.5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "When I was 16, my best friend suggested that I take a trip with her. I had never tripped before, but I was open to anything, and so I said sure. About 11pm, she came over to my house and we snuck back to my room. We dissolved maybe like 1/8th of the paper each into paper cups of water, and drank it down.",
  "Soon thereafter I began to feel excited and nervous and antsy all at the same time. Suddenly I was skeptical that she'd brought acid as I'd heard trips were different than this. 'Wait a few minutes, you'll see.' she said. School had just started up again and we were taking about how the year was beginning at our different schools when suddenly everything just seemed to change all around me. Everything was like a dream in that it never looked the same way twice.",
  "I collapsed back onto my bed and was simply mesmorized by the spinning ceiling fan, seeing shapes and faces inside the spinning blades. The trip hit her too right around this time, and after being mesmorized by my 'UFO lamp' (A 50s-flying-saucer shaped lamp with approximately 100 fibre-optic wires coming out of the top in a fanned-out pattern, with a spinning, multicolored translucent disk inside so the fibre-optic wires glow every colour imaginable), we decided to fuck.",
  "I had never felt anything so amazing as that sex on acid, so we took another trip of about the same size at maybe 1:30-2:00am. We entertained each other for a little while talking in funny voices (she talked in a twangy southern accent and called herself 'Kentucky Pete', etc.) and then I got into a deep intellictual discussion with my stereo, whose tape deck was its face. And she and I fucked again.",
  "The moon was waning at this point and as I recall it was maybe 2:30-3:30am and the moon was just rising, so we opened my blinds and let the moonlight be the sole illimunation of the room. As I recall I tried to read a book in the moonlight but couldn't make out the letters, and she decided to read my handhelt CD player and got something really deep out of it.",
  "By now it was approximately 4am, maybe later, and I decided I'd trip again. Cheryl advised against it, but I took about 1/4 of the paper's original size, and just dissolved it directly on my tongue. We then turned on the TV and were transfixed on a Madame Cleo Psychic Hotline infomercial (or maybe travel packages to Jamaica??)",
  "The next thing I remember it's third period at school the next morning (9:15am or so). I'm sitting in art class at my small Christian school trying to draw a still life. I look at the drawing in my book and the stick figure I drew is magically come to life and is dancing around on the page. I slammed my book shut and stared at the still life on the table in the center of the room. A small desk lamp has come to life, and alternately 'stares' at me or jumps around smashing other items on the still life. I rub my eyes and everything is in its normal place but is slowly changing colours! This time I smack myself thinking it will get my head in line and a miniature stuffed version of the school's mascot (an eagle) is laying on the table talking to me.",
  "'You need to shut up.' I told the stuffed eagle. 'What did you say?!' my art teacher responds back. Now my art teacher wasn't exactly athletic, but she still liked to wear somewhat tight outfits, and for some reason I suddenly see her head backwards on the body of a turtle standing up. She didn't understand when I explained that the stuffed eagle on the table was talking to me. Then I looked back at the stuffed eagle, and it was my art teacher! My art teacher had been shrunk by the eagle and the eagle was now her size!! Oh no! I next remember my art teacher having me sit outside where I closed my eyes and pretended to be asleep as strange figures and faces danced in front of my closed eyes.",
  "Suddenly it's lunch (11:30am). And I just want to microwave my mathbook to eat and some doofus can't understand that simple fact and is opening the book and explaining to me that the book is inedible. The words and pictures are slowly meandering about the page so I walk off still transfixed by the mathbook.",
  "Then I'm sitting in my study hall and am beginning to come down off the trip. My head aches and every sound seems to be amplifyed. (It was different than a booze hangover, felt kinda like reality was making up for lost time, if I can describe it like that.) It's 1:35pm and I have a notebook full of what I had thought was really awesome drawings but now just looks like random squiggles on the pages. I really had to piss, so I went to the mens room. Then I realized the condom from almost 11 hours earlier is STILL ON ME!! That was lovely as you can imagine.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "During my history class, I began to wonder what had happened earlier on that day, how I'd gotten dressed and gotten to school. As I went to leave, I realized that I'd DRIVEN to school!! I shouldn't have even been able to FIND that car let alone drive it. The local PD should have seen me wandering in the thick of morning traffic with a car key in my hand and a perplexed look on my face! Sure enough though, the car was there, it was parked kinda funny and the windows were down, but it was there. So at this point I realized I was really hungry, got myself a greasy lunch/dinner and went home and to bed.",
  "I've tripped only twice more since then and never as much as I did that time. Sorry I can't be more verbose with the dosages"
 ],
 "erowid": {
  "id": "46978",
  "citation": " Doger. \"Microwaving My Textbook: experience with LSD (ID 46978)\". Erowid.org. Dec 28, 2007. erowid.org/exp/46978",
  "substance": "LSD",
  "views": "4104"
 }
}
