{
 "title": "The First Hit",
 "author": "beautiful disaster",
 "citation": " beautiful disaster. \"The First Hit: experience with Heroin (ID 7688)\". Erowid.org. Jun 24, 2003. erowid.org/exp/7688",
 "substance": "Heroin",
 "bodyweight": "120 lb",
 "report": "<p>I had done drugs before, but they were cocaine and speed. Total opposite of what I was about to do. A 'friend' offered to get me loaded to repay a favor that I did for him. Well, I had heard so much about this stuff that I just couldn't refuse. So, I said I'd do it, and I also signed away some of my future. Although I didn't realize it at the time, this experience changed something in me.</p><p>Herion, when you cook it in preperation to shoot it, smells aweful. It reminds me rotten vinegar. Nor does it look like something that sould go inside my body. It is a garbage brown color, and looks like dirty brown toilet water after it is in liquid form. Really good herion will be almost black and non-transparent in the syringe.</p><p>After smelling it and looking at this disgusting stuff, I was a little tempted to back out of this deal. I so wish I still could back out. Anyway, I decided to not be a wussy, and just do it. Watching that brown ugly liquid flow in to my vein was one thing I'll never forget. That dirty brown substance put a worm in my head that won't ever leave.</p><p>The rush from a blast of heroin, I think, feels like the sick feeling you would get when you land in a 747 when you're drunk. It made me want to puke the first time. After awhile of doing it, my stomach will get used to that, and it didn't bother me so much.</p><p>After the initial rush, I got kind of warm. and really itchy. It's a painkiller, so if I scratch too hard, I'll cut yourself and not even notice. Sometimes, if I get really loaded, or mix heroin with presrciption drugs like valium, I'll nod.  It's like being narcoleptic. I just couldn't help falling asleep all over the place. I'm really glad I didn't try and drive anywhere that night.</p><p>Other than that, all I remember is I felt at peace with everything. I hadn't felt like that in so long, that I kept getting high on junk, and feeding that worm, even though I hated having to puke every other time I did it.</p><p>The worm is addiction, and no I didn't get addicted the first time I did it, but I began to build a foundation for it that never goes away. Herion withdrawls are the worst thing in the world, they are what make herion like oxygen or food to a junkie.</p><p>I regret walking down the tar covered road, it was fun at times, I won't deny that, but it's not worth the price I have to pay to join the junky circle and ride the herion highway to hell.</p>",
 "year": "1998",
 "id": "7688",
 "gender": "Female",
 "timestamp": "2003-06-24T07:00:00.000Z",
 "views": "24061",
 "dose": [
  {
   "time": "0",
   "administration": "IV",
   "substance": "Heroin",
   "form": "(tar / resin)"
  }
 ]
}
