{
 "id": 7695,
 "title": "The Trifecta",
 "date": {
  "submission": "2010-02-22T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Skinny",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 1:20",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 2:00",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>It all happened several monthes ago.",
  "It was March, my birthday had just passed, and I was preparing to go to my first rave. Im at a party the previous night, and decide not to drink, because of the number of brain cells that I had to save to fry the next day. Conserve!",
  "All of my friends are piss drunk, as usual, and a rather noble coke-fiend-turned-drug-pusher decided to sell me a couple of grams of mushrooms, mostly stems, but cheap, but hey- its really been a while.",
  "The next day I meet up with my e-tarded friends and take a bus to the arena. It wasnt hard to figure out who was raving, based on the amount of glitter makeup, and glow-sticks. I figure I should eat the mushrooms on the bus, hoping to plateau in a few hours, and then blast myself with my old pal MDMA.",
  "Anyway, I get to the rave, and Im feeling kind of out of place. Not jarringly out of place, and I wasnt noticeably different, uncomfortable, and ultimately a bit lonely. I walk into the shitty arena bathroom and my friend puts a tab of tabs of acid in my mouth. Free drugs, I thought- what the hell.",
  "I start dancing, lights are starting to get a bit fantastic. About twenty minutes later I take the other tab of acid, and continue dancing.",
  "Im really disoriented by this point. Dont get me wrong, raves are a fucking sensory overload, and Ive never taken these two together. I start panicking because I dont think I am going to find my friend, who was to arrive an hour later than me. The place is filling up fast, and I dont think in an hour Id find her. Anyway, I do, and what happens, I pop a cap of E.",
  "Well, this gets me dancing. By this point, I think that I am on an ocean, and am dancing on the water. I keep hearing orcas in the background, and am constantly pausing to stare at the lights or glow-sticks. Really anything shiny.",
  "I can touch the water on the ground and feel it, moving my hands back and forth. Obviously the water was the aged cement floor of the arena, but at that moment I really didnt give a shit.",
  "Pulse is going crazy, afraid of cardiac arrest. Cant stop dancing. Cant stop moving, I am the music and I am flowing through the cosmos (I cant believe I am spouting off this bullshit).",
  "Peoples faces look like they have mouths that open fourteen inches wide, and have eyes the size of nerf balls. Im starting to get scared at this point, and Im running around with my head cocked to the side and my eyes as still as billboards. People know that Im out of my face, and security is starting to ask questions.",
  "By the end of the rave I was still having sensory problems, visual distortions, but had lost the energy that the e had provided, and decided collectively to call it a night. The rave ends, and I feel terrible. Like a night without sleeping, and then being stomped and spit on. I felt terrible, and I felt terrible about myself. My whole body hurts, the internal monologue is on mute, and I want to go to sleep and wake up in a week. We taxi over to a pals place to crash, although we were all to spun out to even sleep. I just lay in the bed for hours breathing spaztically, and trying to shut off the pain of my limbs.",
  "It took a long time to recover from this, my heart still isnt back to normal. I can feel a squishiness in the arteries whenever I do physical activity. I dont think I deserve what happened, but it was a fucking retarded thing to do. My heart used to skip a beat, well lots of beats and it wasnt reassuring. It was like machine-gun fire, reload, machine-gun fire. Im not a doctor, but it doesnt seem normal.",
  "I can see static, like seeing a million translucent atoms flying everywhere, sometimes they are darker, and the size of insects. When you start seeing insects you are really in trouble Ive taken this all sorts of psychedelics and it seems that my awkward physiology finally got the best of me. My brother who is much more mentally fragile than me, ended up in a mental hospital on only two hits of acid. Seems I am one of the two percent. Everything has a wavy quality to it, as if everything is jellow and someone is flicking it from behind with their index finger creating circular waves. Gently disrupting.",
  "Will I ever do this again? You can answer that from reading the above. I realize that there is a limit to what my body can take.</p>"
 ],
 "erowid": {
  "id": "47017",
  "citation": " Skinny. \"The Trifecta: experience with LSD, Mushrooms & Ecstacy (ID 47017)\". Erowid.org. Feb 22, 2010. erowid.org/exp/47017",
  "substance": "LSD, Mushrooms & Ecstacy",
  "views": "3538"
 }
}
