{
 "id": 7698,
 "title": "Coke by Itself? I'd Rather Have Pepsi",
 "date": {
  "submission": "2007-01-31T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "NickAtNight",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "150",
    "grams": 0.15
   },
   "administration": "oral",
   "substance": "Methylone",
   "form": "powder/crystals"
  },
  {
   "time": "3:50",
   "amount": {
    "unit": "line",
    "quantity": "1"
   },
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Who: Myself and friends. I have experience with: MDMA, LSD, LSA, Shrooms, Methylone, DXM, Weed, nearly every Benzo and Opiate ever made, Amphetamines, Ritalin, 2C-D, 2C-I, Salvia, Aminatas, 4-HO-DiPT, Absinthe, Barbiturates, etc, etc.",
  "What: Three separate experiences. First was during a methylone trip, the second two were with cocaine alone.",
  "Where: My Apt. A friendly atmosphere with everyone in a good mood from what I can determine.",
  "Why: I have tried and enjoyed MDMA (I have been lucky enough to get very pure stuff in the past). It is illegal, so I'm trying alternatives. Chemically, Methylone is similar as MDMA, except with a carbonyl attached to the first carbon on the sidechain (check it out for yourself). In addition, I've never tried cocaine before, though I have been prescribed stimulants before for my ADHD, I do not take them regularly. I have read cocaine is just like ritalin; it blocks the re-uptake of dopamine and norepinephrine, but it acts much more quickly and therefore is much more euphoric. I do take ritalin on occasion for study sessions, perhaps a couple times a week, though I haven't taken it for several days before these experiences.",
  "Timeline:",
  "0:00 - 150mg methylone weighed out and taken orally on a relatively empty stomach.",
  "0:35 - Effects definitely setting in, very much like MDMA. Less of a rushing euphoria, more of a calm, collected euphoria. Everything feels amazing, very similar to MDMA thus far. Coming up was a LOT less uncomfortable. When I come up on MDMA, I'm somewhat jittery, and there are slight visuals, on this, there are none.",
  "2:35 - This has been a very interesting experience. Very much like MDMA, but milder, less energy, less compulsiveness, which I like very much (I'm normally a very hyper person ala my ADHD). I almost feel more calm on this than I would be normally, but I'm having a great time.",
  "3:50 - I feel as if I'm down significantly, so I decide to give the cocaine a try. 1 good-sized line later, and I'm feeling very, very euphoric. I can feel the energy all the way to my fingertips, this is by far one of the most euphoric combinations I have ever tried. Interestingly enough, I dont have too much trouble going to sleep 2 hours later, despite both of these substances being very strong stimulants.",
  "Second Experience, First Solo Cocaine Experience",
  "The next day I decide to try the rest of my relatively small quantity of cocaine.",
  "0:00 - 1 medium line snorted.",
  "0:07 - I feel somewhat euphoric and kind of stimulated. Nothing near last night.",
  "0:12 - I have read a lot about the urge to keep doing coke while on it, and I can feel the urge right now. As I do want to see the extent of this drug, I do another, slightly smaller, line.",
  "0:20 - Still fairly eurphoric, fairly stimulated, but nothing too great. I'd imagine this is what a good dose of ritalin with the euphoric of a good dose of oxycontin would feel like, yet without the sedation of the oxy.",
  "Third Experience, Second Solo Cocaine Experience. Last bit of cocaine lined up, a fairly large line and a medium line.",
  "0:00 - 1 larger line snorted.",
  "0:06 - Feeling fairly eurphoric again, but again nothing amazingly so. I decide just to do the last line just to see whats let of this stuff.",
  "0:20 - A slight boost to the euphoria and stimulation, but again nothing mind-blowing, and the urge to do more still lingers in the back of my mind, though I, fortunetly or unfortunetly, do not have any more.",
  "Results: My first experience was by far the best. Methylone was very enjoyable by itself, but the cocaine follow-up made it magical. I would not want to do cocaine again, at least by itself. The addiction potential far outweighs the effects from the drug. Be safe, research everything, buy pure, and have fun!"
 ],
 "erowid": {
  "id": "47024",
  "citation": " NickAtNight. \"Coke by Itself? I'd Rather Have Pepsi: experience with Methylone & Cocaine (ID 47024)\". Erowid.org. Jan 31, 2007. erowid.org/exp/47024",
  "substance": "Methylone & Cocaine",
  "views": "10150"
 }
}
