{
 "id": 77,
 "title": "Solid Plus Three on 25I-NBOMe",
 "date": {
  "submission": "2013-11-08T08:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "Yosefxp",
  "gender": "Male",
  "weight": "66 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 mg",
   "administration": "sublingual",
   "substance": "25I-NBOMe",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 2:10",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 6:18",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "<p>For the last month I have been waiting for my semester to be over so that I have time to trip. I have finished my last assignment today and only have lunch tomorrow with my family as a commitment so I am feeling very good and am in a perfect headspace. I am in my bedroom and I know that none of my flatmates will disturb me for the night. ",
  "This will be my first experience with this drug. My psychedelic history includes at least 20 mushroom trips, 6 with LSD, 3 with 5-MeO-AMT, 2 with LSA, and at least 10 with 2C-I and 2C-E, sometimes just one but usually together. I consider myself experienced and have been to plus four three times.",
  "1915hrs: Put one tab of 25i-NBOME 1500ug under tongue.",
  "1917: Swallowed some saliva",
  "1925: Very weak visual effects (after images)",
  "1931: Have been keeping the saliva in the front of mouth. This serves two purposes: to keep it in contact with the buccal area and to keep it away from the top of the tongue so as to not taste it. Sweaty palms.",
  "1935: Expelled saliva. Keeping the tab sublingual.",
  "1946: Removed tab. Numb mouth.",
  "1958: Effects noticeable already.",
  "2010: High now. Thinking patterns already becoming more psychedelic, objective.",
  "2030: Had a lie down in the dark for a while. No visual trails yet but everything is getting trippy. Playing with a laser pointer.",
  "2059: Trails have begun.",
  "2118: Went on 9gag for a while. Got sick of it.",
  "2125: Have just been thinking. I am very indecisive, normally a sign of being high for me so this is good. I have decided to have a hit of weed on my pipe and watch the movie 'Side Effects'.",
  "0133: At this point I am very very high. I tripped out hard on that movie which sent me into countless 'mind-loops'. This part of the trip was very cathartic and I thought a lot about my life, the world and the mind. Decided to have another smoke and do some psychological research for a book Im writing.",
  "0239: At this point, the never ending series of mind-loops has become tiring and I don't want to think anymore, just watch something. Another smoke here.",
  "0435: End of trip, and bed time. As I lay down and put my headphones on, the music created a massive psychedelic 3D landscape, full of fantastic colourful images and scenes. Everywhere I looked was full of trippy things, dancing shapes, people made of light etc. Made me wish I had tried music earlier.",
  "Overall I found this experience to be very positive. It hasn't been long enough since the experience to know what good it will do in the long run but it feels like it will be significant. Got to a solid plus three pretty early on (Shulgun Rating Scale, PIHKAL), about 2010 I guess and it didn't end until about 0300.",
  "There was no forcefulness in this drug, at least at this dose. Compared to, say mushrooms or high doses of LSD, in which I am forced to completely lose touch with reality, this drug made me feel high enough to have lost touch but it felt like I had the choice. It also made me think a lot where as LSD was more sensory in nature.</p>"
 ],
 "erowid": {
  "id": "100526",
  "citation": " Yosefxp. \"Solid Plus Three on 25I-NBOMe: experience with 25I-NMOBe & Cannabis (ID 100526)\". Erowid.org. Nov 8, 2013. erowid.org/exp/100526",
  "substance": "25I-NMOBe & Cannabis",
  "views": "531"
 }
}
