{
 "title": "Thought-Sucking Entity",
 "author": "J.H., CA",
 "citation": " J.H., CA. \"Thought-Sucking Entity: experience with Mushrooms - P. cubensis (ID 77004)\". Erowid.org. Mar 20, 2009. erowid.org/exp/77004",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "4.0 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)"
 ],
 "report": "<p>Citation: J.H., CA. 'Thought-Sucking Entity'. The Entheogen Review. Autumnal Equinox 1998;7(3):57.</p><p>Four grams of Psilocybe cubensis, eyes closed and immobilized in my camping tent. My inner vision revealed what looked like a dank moss-green hospital emergency waiting room. I was sitting on a bench in this room, and it occurred to me that it was odd that there were no patients being wheeled in or out of the room. Kinda quiet for an ER.</p><p>After some time, I noticed a few off-white football-sized larva floating about three or four feet off the ground in various spots. Following one of these with my eyes, I then saw a big insectoid entity (about the size of a small dog), whose back was turned to me. It had a long mosquito-type proboscis, that I could only partially see. Suddenly, it turned quickly, and--realizing that I saw it--it made a high-pitched buzzing/shrieking sound. (I got the impression that it was sending out some type of a warning alarm.)</p><p>Then the entity initiated telepathic communication with me. It explained that it was quite surprised that I could see it, as this usually didn't occur. It said that it lived by extracting human thought/emotion. It explained that human thoughts were both the currency of its kind, as well as their sustenance/energy source. (The needle-like proboscis was looking less friendly by the minute.) I was given the impression that different types of thought/emotion were valued differently; those with a more intense energy charge, such as fear or love, were worth more.</p><p>The entity explained that it existed in another dimension in order for it to be able to feed off of human thought unhindered. (I got the feeling that the relationship wasn't symbiotic; perhaps these 'thought drainers' actually somehow suck life energy from humans, as well as thought energy). The mental equivalent of an actual insect that feeds on human blood, skin, etc. Eventually, our conversation ended and the vision faded away.</p><p>I recall reading about a similar experience once (perhaps someone posted a trip report in an e-mail to the Visionary Plants List a couple of years ago that described this kind of encounter). The idea that there are entities feeding on our thoughts sounds pretty ridiculous in hindsight, but the entire experience was quite disturbing at the time. -- J.H., CA</p>",
 "year": "1998",
 "id": "77004",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-03-20T07:00:00.000Z",
 "views": "5033",
 "dose": {}
}
