{
 "title": "Jumping Ship",
 "author": "Rhompus, NM",
 "citation": " Rhompus, NM. \"Jumping Ship: experience with Mushrooms - P. cubensis (ID 77009)\". Erowid.org. Mar 27, 2009. erowid.org/exp/77009",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Mushrooms"
  ]
 ],
 "report": "</p>Citation: Rhompus, NM. 'Jumping Ship'. The Entheogen Review. Autumnal Equinox 1998;7(3):59.</p><p>The submission entitled 'Abandoning the Ship' (Vernal Equinox 1998) addressed some issues that I have been thinking about also. I understand the author's perspective, and have entertained the same notions myself. He writes, 'Entheogens have brought me too far, too fast. At these heights, it is just too incommensurably lonely for me for now.' Lately, it seems that the insight offered by the entheogenic experience ostracizes me. The situation is similar to that which is described through the allegory of Plato's Cave. One achieves an understanding about his/her environment that sets the person apart and aloof to it. At the expense of sounding arrogant, it becomes difficult to deal with mediocrity in the world. I work with educated people who do not partake in any practice of entheogen use--they are very linear; that is, in Dr. Andrew Weil's terms, they live in the topology of straightland. The most novel, effortless insights offered to me are light-years ahead of what many others ever will attain in their lives.</p><p>So, perhaps my peers share an open-minded and creative ideology... not so! It is unfortunate that too many people are not cognizant of the true power of the mushroom, et alii. The entheogenic experience keeps me on the fringe of our culture; my eclectic tastes in music, film and literature do not communicate well in many social settings, nor does my belief that spirituality and religion have little to do with one another these days. Additionally, the ego is much less an obstacle in my interpersonal relations than it is in others; often, I find that others are defensive, argumentative, and inhibited--personality becomes a facade. I can never talk about that which has influenced my life the most, and that to which I dedicate so much energy and time. Thus, very few people ever hear about my symbiotic relationship with the plants and fungi around us. Ironically, I envy those who have the liberty to talk on and on about their church! There is truly a mystery about these substances. If our culture were a room (i.e. cave), those of us who understand the infinite would not be confined by the walls and would exist outside, ostracized by that which is very clear to us. Sometimes, it seems that the use of entheogens is an existential pursuit.</p><p>As Oliver Wendell Holmes said, 'A mind that is stretched by a new experience can never go back to its old dimensions.' -- Rhompus, NM</p>",
 "year": "1998",
 "id": "77009",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2009-03-27T07:00:00.000Z",
 "views": "3149"
}
