{
 "id": 7703,
 "title": "Amplification of Physical Sensations",
 "date": {
  "submission": "2001-01-19T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "DevilnDetails",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "22.5 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "My partner and I decide to try 2C-B for the first time on a sunny sunday afternoon, in the safety of our home. We dropped at 3pm, 22.5mg, and began coming on strongly about 45 minutes later. The trip lasted 6 hours.",
  "The initial rush was accompanied by a strong sexual push, which was taken advantage of. The sex was short, intense, a projected kaleidoscopic CEVs onto our mental screens. Reaching orgasm felt like climbing a hill, a little tiring, but very rewarding, with great views at the top!",
  "We then settled back and simply enjoyed the utter physicality of this substance. It seemed that bodily perceptions were greatly enhanced. Missing from this experience was the characteristic speedy feel of MDMA or 2C-T-7. In comparison, 2C-B felt oceanic, flooding us with waves of sensation, suble CEV patterns, and full fleged hallucinated landscapes. Yet, the trip also seemed a little directionless. While this chemical was certainly enjoyable, neither of us felt it had much of a distinct personality. All in all we were nonplussed: fun, nice fireworks, good sex (although nothing spectacular), but no major insights. Also, on the plus side, absolutely no side effects the next day, not even the remotest trace of spaceyness.",
  "I think this would be a good drug to take in a safe social setting, and also great for a first psychedelic experience. The effects are managable, the duration relatively short, and the after effects, seemingly, absent.",
  "The amplification of physical sensations seemed to be the one interesting quality, which makes me want to experiment with this compound in the context of bodywork and somatic awareness techniques. While MDMA is undeniably useful as a tool for psychological insight, I feel that 2C-B may find future therapeutic outlets as a self diagnostic for physical and energetic imbalances."
 ],
 "erowid": {
  "id": "4704",
  "citation": " DevilnDetails. \"Amplification of Physical Sensations: experience with 2C-B (ID 4704)\". Erowid.org. Jan 19, 2001. erowid.org/exp/4704",
  "substance": "2C-B",
  "views": "14087"
 }
}
