{
 "id": 7707,
 "title": "Extreme Nausea and Other Unpleasantness",
 "date": {
  "submission": "2005-11-01T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "EatSomeLSD",
  "gender": "Male",
  "weight": "115 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 ug",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "(liquid)"
  },
  {
   "time": " T+ 3:00",
   "amount": "100 ug",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "(liquid)"
  },
  {
   "time": " T+ 4:00",
   "amount": "24 oz",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": " T+ 6:00",
   "amount": "100 ug",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "(liquid)"
  },
  {
   "time": " T+ 18:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "2 ml of .5 mg bromo / ml %40 ethanol was diluted in 8 ml of water to create a 100 ug / ml solution. Product was shared between 4 people; one 120-pound female at one 100 ug dose, and the other three (males, 115-140 pounds) at 300 ug doses (100 ug dose every 3 hours from initial dose).",
  "T+0 - First dose.",
  "T+3h - No effects noticed yet, second dose is taken.",
  "T+4h - Still no effects; 24 oz. of 5.5% ABV Bud Light is consumed over the period of an hour.",
  "T+6h - Last dose is taken...mild confusion, brighter colors are noticed. Slight stimulation begins to take hold.",
  "T+12h - Still awake, very light visual activity (warping, tracers, etc.) is apparent.",
  "T+18h - Approximately 4 grams of mid-grade cannabis is smoked between the three 300 ug-dosed subjects.",
  "T+19h - I begin sweating and my skin becomes very clammy. Heavy visual activity at approximately Level IV intensity; patterning begins pushing through the walls of the house and morphing, while green vines flow between them.",
  "T+29h - Visual effects begin degrading, stimulatory effects have now recessed.",
  "Extreme nausea was experienced for 48 hours after ingestion; also, severe vaso-constriction was imminent (but no lasting vascular effects have been noted). Very light visual activity through most of the experience...onset and peak were unpredictable. I recommend avoiding bromo dragonfly and would suggest 2-CB instead, which has a much more predictable timetable and much more intense visual activity."
 ],
 "erowid": {
  "id": "47046",
  "citation": " EatSomeLSD. \"Extreme Nausea and Other Unpleasantness: experience with Bromo-Dragonfly (ID 47046)\". Erowid.org. Nov 1, 2005. erowid.org/exp/47046",
  "substance": "Bromo-Dragonfly",
  "views": "10959"
 }
}
