{
 "title": "The Switch That Controls Perception",
 "author": "Crumbly",
 "citation": " Crumbly. \"The Switch That Controls Perception: experience with LSD (ID 7708)\". Erowid.org. Jul 21, 2003. erowid.org/exp/7708",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "1 drop",
  "sublingual",
  "LSD",
  "(liquid)"
 ],
 "report": "<p>Recently I had an experience with LSD that I will never be able to forget. It is the trip that all others will be compared to...the effects it has had on my view of reality are shattering, and I believe that, although it was a bit jarring at times, it was an invaluable learning experience..</p><p>First, a few thoughts on psychedelic drugs in general - I believe that everyone needs to experience a reality that is otherwise completely alien to the individual. There is absolutely no way to imagine the effects psychedelic drugs have on the brain without living through it. If we can exist in a completely different dimension for a few hours, we can objectively view 'normal' reality for the first time. It is freedom from the mundane, and it is a world where money, government, oppression, and all the pervasive aspects of the world can dissolve into the background completely and honestly.</p><p>So now that I'm done preaching, I'll get into the experience.  Me and my friend were bored one night, and put 10 dollars down on a bottle of liquor before coming home, with the intention of getting pleasantly inebriated and laughing at the television.  Well, this changed when a certain friend showed up with a vial of LSD.  Interested in jumping down the psychedelic waterfall, we got our money back on the alcohol and bought a hit for each of us, which was dropped on our tongue.  We quickly drove home, wary of drug effects hitting us while I was driving, and started to buzz a little as we arrived at my house. The effects I had experienced many times before had hit my brain, and we spent the next 6 hours or so laughing like idiots, smoking cigarettes and generally having a good time just looking at the curtains and house plants gently swaying in wind that wasn't there.  About 7 hours into our trip, we figured the experience was pretty much over, and sat down to watch a movie.  We couldn't have been more mistaken.  At one instant, my friend was flashing the lights on and off, and I was laughing.  The next instant, all hell broke loose in my mind.  It was as if the switch that controls my perception of reality was yanked out of my brain.  It must have both hit us at the same time, because suddenly my friend wasn't smiling anymore...he had the look that an infant must have on his face the first time he experiences a thunderstorm -fear and wonder.  The conversation that took place at this moment will shed some light on our state of mind..</p><p>Me - Oh my god, I think I'm blacking out..</p><p>Friend - The light.. looks different.</p><p>Me - What happened?</p><p>Friend - I was turning the light on and now it looks different.</p><p>Me - Did we go somewhere?</p><p>Friend - I don't know...everything is different..</p><p>This kind of quiet mumbling continued for another two or three minutes, until we both sat down on the floor and faced each other solemnly.  We were both so incredibly dumbstruck at the feelings that were pervading our minds that we could do nothing but stare at each other with a stupid kind of disbelief.  I stretched my arms out and stated that my mind felt as big as the room.  I had the very tangible and frightening feeling of melting into the floor and up the wall, and I when I licked my lips, it felt like I was licking someone else's.  All of a sudden I got up and started to walk around the house, which was a chore. The walls were groaning and breathing with life, and it was difficult to recognize my family members or even myself in the pictures hanging on the wall. We wandered around my home of 19 years as if it were an alien landscape.  I sat down in a chair and attempted to turn the computer monitor on, which I could not.  The button was jumping from side to side so quickly that my finger couldn't find it fast enough. I looked at my arm, and it looked extremely distorted.</p><p>I could see red and blue and green lines pulsating up and down my arm in rhythm with everything else.  Eventually I did get the computer on and managed to play a song.  I laid on the floor and listened to the music, which seemed to be coming from all directions at once.  As I closed my eyes, I felt my body rise off of the floor, and patterns and colors assaulted me.  I ended up listening to an Eels song over and over again.. one of the lyrics was 'my skin is melting off, i'm mopping up the sweaty drops..' This drove me nuts, it was fascinating and real.. I felt like I was connected to the earth in a way that I've never been before, as if I was not an individual anymore, but as big as the universe itself, engulfing the room with my mind and body at the same time.  For a while I got frightened, I felt like a deer with a rifle pointed at it; helpless and alone in a different dimension. Time didn't exist, and it is difficult to let go of yourself in that way.</p><p>I went and laid down on my mother's bed, thinking it would be comforting.  I curled into a fetal position in the middle of the bed under the sheets, which was incredible. I could imagine what a baby must feel like in the womb. Within moments though, I had the very strong feeling that there were other beings in the room with me, entities about 3 feet tall making strange noises and surrounding the bed.  This was frightening and I got up and went into the other room.  I spent the next hour staring at the close rack with some pants hanging on it.  The clothes were all swaying back and forth with such intensity. It was startling, I never thought one drop of acid could have such a powerful effect.  My friend had laid down in my brother's room and was meditating quietly, and I did the same thing.  I don't remember the hours after I laid down, but when I came to, the major effects were gone.</p><p>The next day I could barely talk. I was simply shattered from the experience. As I slowly gained my strength over the course of the morning, I began to realize the blessing that I had experienced; I had a new respect for my life, just *being* had a new meaning for me. As of now, I am exhausted, but I feel good for getting this off of my chest. I haven't had any experiences with LSD after that night, I feel like I've been there and felt the true effects of the drug.  Future exploration is likely if I can find a good source, but where I live it is damn near impossible.</p>",
 "year": "2001",
 "id": "7708",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-07-21T07:00:00.000Z",
 "views": "7769",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 drop",
   "administration": "sublingual",
   "substance": "LSD",
   "form": "(liquid)"
  }
 }
}
