{
 "title": "Specifically  Very Dull",
 "author": "uninventive",
 "citation": " uninventive. \"Specifically  Very Dull: experience with Smoking Blend ('Galaxy') (ID 77195)\". Erowid.org. Mar 9, 2009. erowid.org/exp/77195",
 "substance": "Smoking Blend ('Galaxy')",
 "bodyweight": "73 kg",
 "report": "<p>Description of mindset & setting: Comfortable surroundings, alone at home. Mindset normal</p><p>Details of any preparations made for the experience: none</p><p>Reported substance: (2 x) galaxy meltdown and then (1 x) galaxy rocket fuel</p><p>Dosage & timing information: 3 cigarettes smoked over a two hour period (50% tobacco, 50% 'blend' smoked). Timecourse of effects almost identical to that of cannabis, perhaps a little slower.</p><p>Notes on prescription or over-the-counter medications, herbs or supplements that were being taken at the time of the experience. None.</p><p>Something more than a description of how fucked up you were or what cool patterns you saw. I am not feeling fucked up. I am not seeing patterns of any sort. I am feeling factual.</p><p>I have been interested in these synthetic cannabinoids and their certain specificities for particular cannabinoid receptors. I have only tried one of the 'legal smoking blends' so far (now) and unfortunately it does not advertise what specific synthetic active(s) it contains. Nevertheless my experience has left me pondering this receptor specificity idea. This is because it seems that half of the cannabis experience is present and the other half is not only absent, but actively suppressed.</p><p>(edit: I have been reading up on these cannabinoid receptors and it seems that the majority/all psychoactive effects are mediated via CB1 receptor. I am unable to work out what I think about this.)</p><p>Similarities: I feel stoned. Peripheral effects are very similar to cannabis intoxication, a pleasant body high, blood shot eyes etc. I feel comfortable and physically lazy.</p><p>Not similarities: I do not have dry mouth. I do not have appetites (food, drugs, sex). I can eat, for example, but I derive no pleasure out of the nicest foods. Its like that centre in my brain which gets activated when I'm very stoned on cannabis and then eat chocolate cake has been completely shut off. I am focussed, very calm, slower than usual, but focussed. I am not losing my train of thought. Usually, when smoking cannabis, I cannot finish sentences, but instead the words and logic get all jumbled up and I find it very funny and I start giggling. Here, I am calm, focussed and motivated only towards intellectual activities. I think self doubt has been toned down. It also appears that I am repeating myself, perhaps memory is affected.</p><p>#</p><p>Essentially this is a specifically very dull experience. It is odd, however, as I am paying attention to details. I do not usually do this.</p><p>This entire report has been written and submitted while under the influence of these two blends.</p>",
 "year": "2009",
 "id": "77195",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-03-09T07:00:00.000Z",
 "views": "6062",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Products - Smoking Blends - Cannabis-Like"
  }
 }
}
