{
 "title": "I Regret It Every Day of My Life",
 "author": "Satsukamari",
 "citation": " Satsukamari. \"I Regret It Every Day of My Life: experience with 5-MeO-AMT & Cannabis (ID 77204)\". Erowid.org. Aug 20, 2009. erowid.org/exp/77204",
 "substance": "5-MeO-AMT & Cannabis",
 "bodyweight": "140 lb",
 "report": "<p>Ok where do I even start. Saturn 5 is what is was called by the people I knew, 'Its like acid' is what my friend was informed. I was excited because acid was very rare from where I was from. Me and my best friend both bought 5miligrams each and a quarter of pot. We took our dose a little after midnight and then smoked a bowl getting ready for what we had no idea.</p><p>We both knew that acid was intense but we both had done our research and was prepared for the worse.. so we thought. About an hr later we had both ran to the bathroom to vomit.. out stomachs were a mess but besides that all we had felt was just a cloudy high. We both vomited one at a time. When I did as soon as I lifted my head everything was different. The walls in the bathroom was not only moving.. they were alive. My body never felt so fake. And my life never felt so fragile. We both gathered back in my bedroom where we didnt talk much, our plans of watching trippy movies and listening to bands like Pink Floyd seemed very immature at this point. 'What have we done?' we both asked each other. We both smoked another bowl hoping for it to mellow us out. The pot had almost no effect at all. Whereas earlier it was very potent. My friend took off his shirt and was beginning to freak out. I was in amaze while looking at my blinds because they were moving or ..breathing like the gills of a fish. I tried to find music to calm us because silence was hell. I had a good library to choose from. I went from The Beatles to Air... everything seemed to be freaking us out even more. We finally stopped on Phish... for some reason it was just right.</p><p>After spending a couple hours and realizing it wasnt going anywhere we went outside. And I will admit that the sun was just coming up and we had a pond in the front yard... it was outstandingly beautiful... the grass was very neon and the trees and leaves were 'Alive'.  I would stare at a leaf and watch it suck inward back to a seed then slowly come back out to a leaf. My friend looked like a plastic doll. We felt like we were coming down a little bit so we decided to go to the nearest park. He drove as I never felt so weird being in a car. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  We went to a park and walked a trail to a hidden area by a stream. We sat there for at least 5 hours smoking bowls after bowls of pot... The drug was still very much in effect and enhanced terribly by the lack of sleep.</p><p>Soon after we had both took our own ways and finally slept that night. Sadly even after such a terrible experience I took it 2 other times and also recommended it some of my friends that still to this day will never trip on anything ever again. One of my friends even snorted it up his nose and later on pulled something that he described as a piece of pink lettuce outta his nose with outstanding headaches for years to come.</p><p>My final words for this 'Saturn 5' is 'SHIT!' Don't do this stuff EVER, this is a research chemical and don't be a test rat. All of the friends that did this including myself have never been the same since, some have had serious mental issues. Myself, I still seem to have minor visualizations when I look at my carpet or at the walls. Sometimes the carpet seems to look like its moving like carpet... years after doing this drug. I don't care what someone says to you. this is your life and your ONLY life and your ONLY body. Don't fuck your brain you up with this stuff because it WILL. I consider it highly dangerous and not recommended for first time trippers. If you love tripping so bad then stick to mushrooms. I am in no place to be a antidrug person and still love pot.. etc. But I would in a heart beat do anything possible to help keep this stuff off the street, kids dont need to have this and just think 'I'm just a kid..I'm experimenting' even an adult would almost want to kill themselves on this stuff. DONT TAKE IT!!!</p>",
 "year": "2002",
 "id": "77204",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-08-20T07:00:00.000Z",
 "views": "4964",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5 mg",
   "administration": "",
   "substance": "5-MeO-AMT"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
