{
 "id": 7723,
 "title": "A Brief Journey, a Competition",
 "date": {
  "submission": "2006-06-15T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Zero aka Headspace",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "80 mg",
   "administration": "smoked",
   "substance": "DMT"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "",
   "substance": "smoked"
  }
 ],
 "report": [
  "It is nearly impossible to describe an experience that transcends all language and thought. To try to explain the experience of DMT to somebody almost seems to lessen the experience, so I'm going to keep this short. DMT is the one and only substance that gets better and more intriguing every time I use it, so much so that at times during reintegration I really don't want to be back here, moving so slowly with all of this empty space to fill....",
  "1,2,3,4 puffs... hold...",
  "The room begins to transform, it shimmers with inconceivable colors like a billion jewels each reflecting their beauty off of one another. I look down at what I thought a minute ago to be a glass waterpipe in my hand, but I see this gem encrusted, glittering, serpentine object encircling my, wait... what? My wife takes whatever it is that I'm holding as I lean back in the recliner. The brilliance grows and permeates my vision until I am engulfed by the ever transforming patterns, my body vibrating in synchronicity with the patterns until there is no distinction between myself and the patterns, trans-geometric transdimensional indescribable glory, dissolving, I become the experience. The perimeter goes black, speckled with light and from the center the chrysanthemum machine begins to unfold from the distance, approaching faster, using every color and hue of the spectrum, brilliant metallic golds and silvers, morphing and coalescing to show me the most indescribable organic yet machine-like beauty, until once again, I become the chrysanthemum and am projected seemingly upward at an unimaginable velocity until I break through and all is silent.",
  "I'm in a childhood friend's backyard (an aspect of the Salvia I mix the spice with) but the scenery is overlayed by a million billion tiny vibrating cubes, each their own individual color, no two the same, and each revolution per microsecond of the vibration of those cubes is accompanied by a resounding audible click or bleep... millions, perhaps billions of them per microsecond... and then they appear. Two undoubtedly male entities. They are humanoid in appearence but they are wearing the most fantastic eyewear or goggle type apparatus on their heads. I can tell that in their dimension these are the coolest pairs of eyewear possible. I can tell by their demeanor that in their world, these two guys are the definition of hip, they're cool, no doubt, and before I can process that thought, they show me just how cool they are. They are vying for my attention, the taller one gets it and when I look in his direction, he gives me a serious look and telepathically says, 'Look at this!' He waves his hands toward the sky and tosses up a blanket or screen that unravels to become the sky and this thing, this pattern, this machine flower starts to coalesce that makes the chrysanthemum look like childs play. I'm stunned and I think that was the point at which, my wife tells me, I muttered 'Oh my god...'",
  "Then I sense the utter annoyance of the other male presence. He was irritated and said 'No, try this!' And he threw up his own little display into the phosphorescent vibrating sky, even more brilliant than his competitor. And that's what they were doing... they weren't concerned with what I was experiencing, they were competing, they were trying to out-do each other. This went back and forth 4 or 5 times, each display out-doing the previous one until I thought it was so beautiful that I couldn't possibly look directly at it for one more milli-second. That's when I felt myself being sucked back as they just stared, sort of smirking at me as if to say, 'Huhh, and you thought you knew what was up?!'"
 ],
 "erowid": {
  "id": "47094",
  "citation": " Zero aka Headspace. \"A Brief Journey, a Competition: experience with DMT & Salvia divinorum (15x extract) (ID 47094)\". Erowid.org. Jun 15, 2006. erowid.org/exp/47094",
  "substance": "DMT & Salvia divinorum (15x extract)",
  "views": "5170"
 }
}
