{
 "title": "A Change of Pace",
 "author": "Doomngloom",
 "citation": " Doomngloom. \"A Change of Pace: experience with 2C-I (ID 77257)\". Erowid.org. Jun 10, 2010. erowid.org/exp/77257",
 "substance": "2C-I",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "oral",
   "2C-I",
   "(capsule)",
   " T+ 1:45",
   "10 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>A few weeks ago I had come across a source for research chemicals and was intrigued by 2c-I and purchased some.  I had no experience with psychedelics, and despite this I felt quite comfortable I would be able to handle it easily.  My previous drugs include cannabis (done many, many times), dxm (also done quite frequently), and 2 experiences with diphenhydramine.  I took 100mg of the 2c-I and divided it into 5, 10, and 15mg piles before filling some empty gel caps I made.</p><p>+00:00  I debated whether to start with 10mg or 15mg and went with 15mg.  My stomach was full at the time and I wondered how much of an effect it would have. </p><p>+00:30  Nothing yet, though I wasnt expecting to feel anything at this point.</p><p>+01:00  Feeling nothing at all, I wonder how much the gels I put the 2c-I in are affecting the onset.  I am tempted to redose but decide against it.  I grab my headphones and listen to some relaxing music while watching milkdrop in winamp.</p><p>+01:30  Still no noticeable effects, starting to get annoyed and angry.</p><p>+01:45  Angry with the lack of anything, I break open a 10mg capsule I had made and pour the powder straight onto my tongue.  I allow it to sit there for roughly 1 minute before I chase it down with some water.  In retrospect this was probably a pretty poor decision, as the scale I had used to measure only went to 0.01g and I was unsure of how precise it was.  I could have ingested 30mg+ easily or more I guess, I have ordered a more precise scale since and will not be this careless again.</p><p>+02:15  Still nothing, at this point I begin wondering if I had been scammed.</p><p>+02:40  Feeling something, a little off mentally and starting to feel a slight upper effect, mood lift, energy boost.</p><p>+03:00  Definitely hitting me now, slight tracers visible, seeing other minor visual effects  random things appear to move in my peripheral vision as well.</p><p>+03:30  Only guessing on the time here, as perception of time seemed to be quite distorted over the course of the night.  At times it seemed as though it was barely moving and at others I wondered how so much time had passed.  The visual effects now were interesting to say the least.  I expected something a bit more intense but it was still quite interesting.  While trying to read an article on the internet, the words on the page kept shifting.  They would move left, right, up, down, and almost appeared to breathe as some words would get larger and then shrink again.  The letters such as S, L, J almost appeared to be bleeding as they would elongate as my eyes passed over them. </p><p>I was quite happy at this point and was laughing at random stuff to the point of tears.  I tried watching some anime and at that point realized that my thought process was far from normal.  It was quite difficult to stay focused (though having to read subtitles likely didnt help matters) and I got confused quite easily.  I started to be bothered by the only real negative effect of the night of my teeth clenching and grinding, so I set off to look for some gum.  The confusion became more apparent as it took me what seemed like 10 minutes to find the jeans I had worn earlier in the evening in my tiny bedroom.  I became somewhat saddened that I was stuck in my house in the winter and I really wanted to go ride my bike or play with my dog or something outside. </p><p>+04:00  Didnt expect the stimulant effect to be so strong, Im getting bored but know theres no way I could sleep.  I look to see what time sunrise would be to watch it.  I keep listening to my music and wait for come down but it doesnt seem to be coming.</p><p>+05:00  Its now 5am and I really would like to sleep.  I lay in my waterbed and bundle up - I had been freezing all night.  Sleeping is pretty much impossible, the second I closed my eyes I became overwhelmed with random thoughts and images in my imagination, it was as if I was getting lost in my own thoughts.</p><p>+06:00  I estimate this is about the time I finally fell asleep, and managed to sleep for about 4 hours.  I wake up quite tired but had fully come down and there were no lingering effects that I noticed.</p><p>Overall, it was definitely an enjoyable experience and I will definitely do this again.  I have been having issues with my job and life in general lately, and laughing all night and having a good time was a most welcome change.  Being alone and cooped up inside with nothing to really do definitely put a damper on how much fun it was  I would love to do this in the summer with a group of friends.  It was a learning experience as well; this isnt something Id care to do at night again  I like to be able to sleep when I want to, something I can do with dxm or diph.</p>",
 "year": "2009",
 "id": "77257",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-06-10T07:00:00.000Z",
 "views": "1992"
}
