{
 "id": 7730,
 "title": "Seizure / Blackout",
 "date": {
  "submission": "2006-12-19T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "randomgirl",
  "gender": "Female",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  }
 ],
 "report": [
  "I've been searching everywhere for someone with a similar experience, but havn't found anything.  So here goes:",
  "I was having a lonesome night, so I decided to smoke a small bowl and relax with a movie.  I would consider myself an 'experienced' smoker - smoked for about 5 yrs, regularly for about 2.  So this was no big deal.  I had a few drinks as well, but nothing over normal.  So I enjoyed the movie and everything was great.  By the time the movie was over, I noticed that I seemed unusally baked for how much I had smoked.  I didn't think anything of it, and decided I needed to pee and go to bed.  So made my way to the bathroom to pee.  When I was done, I must have stood up too fast, as my vision started to go as it sometimes does when anyone does this.  I steadied myself then realized that my legs weren't going to support me.  I feel to the floor, my vision and motor skills completly gone.  I started convulsing, but might not have even known it if it wasn't for my head which kept banging against the closed door.  I don't know if any/how much time passed after I stopped having this 'mini-seizure' or whatever.  At some point my vision came back and I stood up, very shaken but alright.",
  "I had seen this happen to a guy in Amsterdamn - the woman working at the bar gave him sugar water.  Remembering this, I grabbed a coke and headed for bed.",
  "I am wondering if anyone else had an experience like this, whether I did the right thing, or what should I do if this happens again.  (also, what causes it?  low blood sugar?)"
 ],
 "erowid": {
  "id": "47123",
  "citation": " randomgirl. \"Seizure / Blackout: experience with Cannabis & Alcohol (ID 47123)\". Erowid.org. Dec 19, 2006. erowid.org/exp/47123",
  "substance": "Cannabis & Alcohol",
  "views": "6609"
 }
}
