{
 "title": "Therapeutic High With a Speedy Edge",
 "author": "organicshroom",
 "citation": " organicshroom. \"Therapeutic High With a Speedy Edge: experience with bk-MBDB (ID 77339)\". Erowid.org. Mar 9, 2009. erowid.org/exp/77339",
 "substance": "bk-MBDB",
 "bodyweight": "89 kg",
 "header": [
  "DOSE: T+ 0:00",
  "220 mg",
  "oral",
  "bk-MBDB",
  "(powder / crystals)",
  " T+ 5:00",
  "40 mg",
  "insufflated",
  "MDMA",
  "(powder / crystals)",
  " T+ 6:00",
  "30 mg",
  "insufflated",
  "MDMA",
  "(powder / crystals)",
  " T+ 0:00",
  " ",
  "",
  "Nicotine",
  ""
 ],
 "report": "<p>Set: Clear mind, relaxed, but quite apprehensive.</p><p>Setting: In a garden setting with a close female friend</p><p>Subject: 88kg male with moderate amount of experience with MDMA, 2 months since any stimulant use. Medium natural tolerance to stimulants.</p><p>+0.00 Swallowed 220mg dissolved in water.</p><p>+0.15 First signs of a clean stimulation, increased heart rate.</p><p>+0.30 Same level of stimulation as before, not really much happening at all, a background warmth starting to develop. No feeling of 'coming up' or intoxication that is expected with MDMA. But unfortunately I had this pronounced anxiety, a 'panic' feeling that was felt in my chest.</p><p>+1.00 A subtle clean body high, no pronounced bodily sensations or dopamine rushes, or intoxication. It actually took me a while to release how high altered I actually was, the transition was so smooth that it felt like it was more a natural shift. Really starting to open up empathetically to my friend, anxiety starting to subside.</p><p>+1.15 Security guard almost caught us sneaky around in the gardens, which made both our hearts race and really potentiated the 'panic' feeling, I assume bk-mbdb has significant activity on the adrenaline hence this amplified fight or flight bodily response. But as soon as we started walking we calmed down real quick, and in fact walking just really stimulated this inner warmth and calmness that was like a quiet glow radiating outwards gently illuminating our surroundings with a soft positive light.</p><p>+2.00 Still walking by this stage, we were enjoying the walking so much we didn't want to stop. When we did stop, the anxiety would start to creep back in and as soon as we moved again it would disappear. We were having some very constructive empathetic conversations, but no real 'push' to hug or touch each other. I actually felt quite content in my own skin without the need to be touched.</p><p>+3.00 The empathetic warm feeling was still as consistent and solid as 2 hours ago, no coming down phase has been noticed yet. Stimulation is also still very persistent, hence why we are STILL walking!</p><p>+4.00 Over the past hour the inner glow is starting to fade, and it takes more conscious effort to keep it burning. Though compared to MDMA, its ramping down rather slowly and gently. No desire to take more, and very satisfied with our much loved conversations.</p><p>+4.30 Still quite simulated at this stage, but the serotonin system feels a little tired, yet still a mild 'warm' feeling present, no coldness or sadness as yet. Basically really enjoying it still!</p><p>+4.30 Insufflated 40mg of clean MDMA, the effects of this are expected to be significant. But unfortunately all that happened was it brought back my anxiety and added this intoxicated 'spaced out' feeling to our previous buzz. I believe an oral dose would of been more appropriate, as the come-up of the MDMA was a bit unpleasant and too aggressive. A contrast to the gentle onset of bk-mbdb.</p><p>+5.00 The peak of the MDMA settled into a warm pleasant high, but by this time our minds were getting a little tired and short term memory was half out the window. I felt like the MDMA brought back the 'dopamine' element of the experience, but did little with the serotonin as it seemed like it was already highly induced or we were just subjectively used to the feeling by now.</p><p>+5.30 The MDMA also faded out into a disjointed overtired sober state, even though it felt like our blood was still pumping with a stream of chemicals, it was doing little to how we felt subjectively. Another 30mg of mdma was insufflated with little to no effect, maybe just more stimulation if that.</p><p>+7.00 Sleep was difficult, but also due to our later consumption of nicotine in an attempt to stay awake and induce back any good feelings. (worked well temporary, but just made sleep more difficult).</p>",
 "year": "2008",
 "id": "77339",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-03-09T07:00:00.000Z",
 "views": "14518",
 "dose": {}
}
