{
 "id": 7733,
 "title": "Crack is What She Really Wants",
 "date": {
  "submission": "2001-12-30T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "jim",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Crack"
  }
 ],
 "report": [
  "Recently I have had to deal with a bunch of decisions involving crack and my girlfriend leah. Ive been going out with her for about a year and everything had been going really great. She has always been an exciting person and very lively and had dabbled a little in drugs as had I. She smoked pot and did a little coke every once in a while. I knew this and occasionally shared a joint with her.",
  "About two months ago though it came to my attention that she had been doing crack for some time, and i did not know it. I came home from work a couple hours early and found her in the bathroom sitting on the top of the toilet with a glass tube in her mouth and a lighter in the other hand. I startled her and she look confused but she didnt make any excuses . She glared at me for a few seconds. Then she raised the pipe to her lips and with the other hand she lighted it with her lighter. She concentrated hard on her pipe and got a good lungful then looked at me again and exhaled, a stream of smoke.",
  "I walked away into the bedroom and didnt talk to her the rest of the day. The next day was a saturday and I woke up to her smoking crack at the end of the bed. She said to me when she saw that I was awake 'Do I still have to hide it from you know that you saw me doing this'. I said no and she told me to come to the edge of the bed next to her. She held out her hand with the pipe in it and said 'just try it once' I refused. She looked angirly at me and quickly snatched it up to her mouth and continued to smoke as I walked away.",
  "Later that night as we were getting intimate she told me to stop and went to get her pipe and take a quick hit. She said sex feels better this way. She took her hit and just stood motionless with her eyes closed for like 30 seconds then she opened them and and told me that it would really feel good taking the pipe in her hand up to my mouth. I decided to give in and give it a try she sat behind me and held the pipe in my mouth and lit it for me. I would have to admit it was a good feeling and she proved that there was nothing like making love on the stuff. Ocassionally over the last few weeks I have been smoking crack with her before sex, but she no longer seems to be able to curb her habit, and stays up for nights at a time smoking crack, and never leaves her pipe behind, frequently bringing crack with her when we go to restraunts to take quick hit in the bathroom.",
  "She no longer hides her crack habit she is open about it to me and it is starting to scare me a little . She needs it to function. She use to claim she only did it after work and before and during sex when I questioned her but now she does it whenever. And I think that she is taking me down with her."
 ],
 "erowid": {
  "id": "4714",
  "citation": " jim. \"Crack is What She Really Wants: experience with Crack Cocaine (ID 4714)\". Erowid.org. Dec 30, 2001. erowid.org/exp/4714",
  "substance": "Crack Cocaine",
  "views": "13053"
 }
}
