{
 "title": "For Withdrawal",
 "author": "Sick but clean",
 "citation": " Sick but clean. \"For Withdrawal: experience with Neurontin (ID 77662)\". Erowid.org. Feb 5, 2011. erowid.org/exp/77662",
 "substance": "Neurontin",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Gabapentin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2008",
   "77662",
   "Male",
   "",
   "Not Given",
   "Feb 5, 2011",
   "8495",
   " "
  ]
 ],
 "report": "<p>I am writing to share my experience with Neurontin as a drug to help some withdrawal symptoms from alcohol and tobacco. In April of 2008 I was forced from health reasons to stop drinking. I had no health insurance to afford a detox program and did not really want to go though another official withdrawal anyway. I strongly recommend anyone who wants to detox from ANYTHING to do so in a hospital.</p><p>However since I have done this many times and knew the protocols and drugs they used I decided to do it on my own. I had ativan for a calming agent but that was it. After the first day the sweats began and I started to feel the first signs of the DT's. I have had severe delirium tremors in the past and was quite paranoid of going through them in a non hospital setting. I had lots of juice and cold water on hand along with plenty of good food and a multi-vitamin. I also have a back condition in which Neurontin was prescribed, but I did not like the effects and stopped taking them. However I saved them for a rainy day. They were prescribed for tremors in my legs from nerve damage due to back surgery's. I thought 'What the hell, might as well give er a try' and started to take 300 to 600 mg. every 6 hours or so. Well, I have got to say that in the next 72 hours was one of the easiest detoxes I have ever been through !! I not only had zero delirium tremors, but also had practically no sweating at all. Sure I sweated the alcohol out, but that was it. My sheets in the past would have to be changed every 8 hours for they were soaked. Not this time. my sheets were slightly damp.</p><p>I had read that some detox centers have fallen under new guidelines that prohibit the administration of benzos after a period of time and after the allotted time they only give you Neurontin. The author was so upset he left, as i would have most likely done as well !! The Neurotin in my opinion is not to replace benzos like Ativan or Valium but should be administered in  conjunction with them. Typical medical buffoonery !! The whole purpose of a detox center is to provide a safe environment and to make you as comfortable as possible while withdrawing from whatever !!</p><p>Just recently I have also had to quit smoking due to Heart disease. I am trying the Neurontin ativan method with this as well. So far so good. Without the Neurontin I was pulling my eyeballs out !! Now that I am taking it, I seem not to think of it as much and my cravings are all but gone. I have psychological cravings and I imagine I will have them for awhile but as far as the physical cravings they have been greatly minimized !!  </p><p>P.S. Remember, Alcohol and chemical detoxes can be dangerous and even kill. If you have no experience you should not attempt to detox on your own but seek a professional program that emphasizes a good after care program like AA or NA.</p><p>[Reported Dose: '300mg. 3-4 x a day']</p>"
}
