{
 "title": "A Decent Empathogen",
 "author": "Phoenix",
 "citation": " Phoenix. \"A Decent Empathogen: experience with bk-MBDB (ID 77700)\". Erowid.org. Sep 21, 2009. erowid.org/exp/77700",
 "substance": "bk-MBDB",
 "bodyweight": "65 kg",
 "report": "<p>The spacemonkey have some but limited experience of MDMA and Methylone. A slight hangover since yesterday night involving a couple of beers and drinks made me irresolute to do this trial but I went on anyway. Had b-vitamin complex in the morning and 360 mg Magnesium after dinner. Home alone in the sofa.</p><p>21:08</p><p>Swallowed a gel-capsule with 150mg butylone/bk-mbdb.</p><p>21:34</p><p>Lighter stimulating effects.</p><p>21:50</p><p>Mild empathogenic effects, mind is clear and my body begins to feel warm, slight restlessness.</p><p>22:25</p><p>The effects developed to a mild plateau from 22:00. This is ok, but I intended to get higher this night. I can imagine that it would be beautiful to add MJ on top of this, but I chose to supplement with 50 mg nasally since I'm having a break from MJ.</p><p>I tried to listen to Eat Static - Implant/De-classified which I usually consider as brilliant trance but was not in the mood, Zap Mama - Ancestry in progress gave more room for introspection, and so did reggae.</p><p>22:57</p><p>Ah, this is what I intended tonight. It is very pleasant, euphoric, this material has therapeutic potential, but it is not very tactile. Some jaw tension. Music sounds beautiful and introspection is honest and forgiving. Did some N20 but the synergy was less than with LSD.</p><p>23:26</p><p>Peak is over, still pleasant.</p><p>00:23</p><p>I feel uncomfortable speedy and wasted. Hydrating. Still pleasant in some way, but I understand why some might experience crashing at this point.</p><p>1:17 Start to get really hungry.</p><p>Went to bed at 5, slept bad, had brain-movies instead of dreams and went up at 9. I still feel the body buzz and pupils are slightly dilated, I didn't expected after effects to be that long lasting. I need sleeping pills/downers for this one. Felt somewhat unfocused during the day, but no hangover.</p><p>This material has a quite strong push, which is neutral rather than positive in its nature. I question if one can have real transcendental experiences on bk-MBDB, but I still think it behaved as expected except for the long tail. I will consume what I have left but not buy any more. I expect it to be excellent in social settings.</p><p>Personally, I always enjoy to get wasted but I also think it gave me valuable time to summarize my life and identify behavioural patterns which causes unnecessary stress and life force degeneration. Quite subtle things actually, and not any major insights.</p>",
 "year": "2009",
 "id": "77700",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-09-21T07:00:00.000Z",
 "views": "13241",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "bk-MBDB",
   "form": "(capsule)"
  },
  "1": {
   "time": " T+ 1:17",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "bk-MBDB",
   "form": "(powder / crystals)"
  }
 }
}
