{
 "title": "The Anger Within",
 "author": "DivaMama",
 "citation": " DivaMama. \"The Anger Within: experience with MDMA (Ecstasy) (ID 77733)\". Erowid.org. Mar 27, 2009. erowid.org/exp/77733",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "266 lb",
 "report": "<p>I am a naturally pessimistic person, am bipolar and have borderline personality disorder. I'm not a big drinker, rarely smoke weed, and really enjoy the feeling cocaine gives me more than anything else.  I was hanging out with my new boyfriend at home and we decided to get some pills. I had never rolled but he had.  We had plans to go to a bar later that night and meet up with friends.  I had plenty of water on hand at the house and before we popped them he made me promise to drink water after each sip of liquor and sip water throughout the night, so I listened to him. </p><p>I popped the first one around 8 p.m. and honestly, felt nothing. I take Paxil 30 mg and Zyprexa 2.5 mg regularly so I thought maybe that messed up my serotonin and I couldn't get high off of E.  We were generally okay at the bar until his baby's mom walked in. Whoaaaaaaa. They had a conversation and he came back to the table wanting to kill everyone in the room. He went outside to smoke and punched the wall.  He started talking smack about everybody in the place. He was scaring me.  He started asking for weed, saying that would help calm him down, but was really indecisive. If anyone offered to get him some he'd say yes, then no.  He'd order a drink but not drink it. His jaw started to clench so he walked across the street to the gas station to get gum and I thought he'd get in a fight on his way and it scared me.  He came back and took the second pill, thinking he'd start to feel better.  Nope.  We left and came home by 10:30 pm and I took my other pill. I had never seen him so aggressive, violent, or angry.</p><p>Then it hit me. I started spouting off to him about the girls he talks to, yelling at him about the situation he put me in at the bar, talking about how I'd kill this girl that he was talking to on the web. Totally aggressive!  Then I sat down and started BAWLING about how I missed my dead mom and sister. He finally got some weed and settled down. I got hot, burning up, was scared I was drinking TOO much water. Had the windows open and the fan on and almost passed out on the floor. He had to get me up and put me in front of the fan. I just wanted to sleep.  There were no euphoric feelings whatsoever. No wanting to touch things, no wanting to listen to music or feel lovey-dovey. I absolutely HATED IT! We both agreed we would NEVER, EVER again touch this crap. Ever. The next day I woke up and felt like crap. My entire body ached, from what I don't know. I was lazy, tired, unproductive. I felt guilty about what I did. He was embarrassed, as was I, for the aggressiveness that came out the night before.  It was hell on earth and I encourage and urge people DO NOT USE THIS DRUG. I don't know if it's just not good for naturally pessimistic people or people with hard lives but it definitely was NOT the drug for me!</p>",
 "year": "2009",
 "id": "77733",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-03-27T07:00:00.000Z",
 "views": "5556",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 2:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
