{
 "title": "Be Careful with the Dose",
 "author": "Akane",
 "citation": " Akane. \"Be Careful with the Dose: experience with 5-MeO-MIPT (ID 77742)\". Erowid.org. Jul 17, 2009. erowid.org/exp/77742",
 "substance": "5-MeO-MIPT",
 "bodyweight": "48 kg",
 "report": "<p>I would like to tell you my experience with 5-MEO-MIPT because I think its important to be careful with this substance.</p><p>On Sunday at 23:25 pm I ingested 5 mg of 5 MEO-MIPT in an oral dose like another three friends and my boyfriend (I have to say that I am thin, much more than the other four who took the same dose). Half an hour later I was getting high like an LSD trip but with a strange feeling in my muscles. We went out to the street because we had planned to go to a club. After walking for 45 minutes the cold came into my body and I couldnt talk. When finally we came into the club I felt oppression in my breast and I couldnt breath, so I went out and my boyfriend and me decided to go home in a taxi.</p><p>In the taxi I couldnt stop moving. My muscles didnt stop although I was trying to relax. At 1:00 we arrived home again and I decided to put comfortable clothes because I believed that maybe that was my problem... it wasnt. Every one of my muscles was contracting each second and the terrible cold didnt stop running into my body. I couldnt talk and I couldnt lie down either because I had convulsions. I tried to cover with a duvet but I couldnt stay placid because my muscles didnt stop.</p><p>My boyfriend tried to calm me saying me that I was more worried and it was only a bad trip, but although I wanted to believe him, I knew that something wasnt good with me.</p><p>At 4:30 am I started to feel the tryptamine. I started with visions, colors distortions and watching the energy around the room. We had put music and when it was relaxing I felt better, but the bad feelings in my muscles were still there. Also my jaw became a stone and I couldnt turn my neck or speak for moments.</p><p>I tried to relax several times, but the contorts didnt let me. He said to me that he didnt feel the same and repeated to me that I had to relax, but I didnt know how because all my muscles seemed to have their own life.</p><p>At 6:30 my boyfriend felt tired and he said that he even could sleep, but the effects in me didnt stop and I felt a lot of fear, so I decided to go to a hospital. Ive used a lot of substances in the past (two and more years ago, including ketamine) and Ive never felt like this before.</p><p>When I arrived at the hospital I said that I had ingested a hallucinogen and they tested my heart and my blood pressure. Everything was ok but my muscles, which didnt stop moving and to making me convulse. They gave me an Orifidal [lorazepam] and said that everything was supposed to stop in a while.</p><p>At 8:00 I went back home and lied into the bed. Thirty minutes later I felt asleep and I woke up three hours later with pain in my legs, back and hands. I was sleeping all the day. I just woke up once more at 20:00 pm to have dinner and I felt asleep again.</p><p>Now its Tuesday and almost 48 hours have passed since I consumed 5 MEO-MIPT, but I feel like shit and a lot of my muscles are still contracted and painful.</p><p>The other 4 that ingested the substance felt well in all moments and only two of them  felt headache the day after, so I think that I consumed an overdose for my weight and that I had to take 2 or 3 mg less to have enjoyed the experience. By for the moment I dont want to try it again, because I think its stronger than all the people say. I hope that this experience helps people that want to try it, because its necessary to consume a proportioned dose to the body weigh.</p>",
 "year": "2009",
 "id": "77742",
 "gender": "Female",
 "timestamp": "2009-07-17T07:00:00.000Z",
 "views": "13662",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "4-MeO-MiPT"
  },
  "1": {
   "time": " T+ 7:00",
   "amount": " ",
   "administration": "",
   "substance": "Pharms - Lorazepam"
  }
 }
}
