{
 "title": "The Beauty of a Chemical",
 "author": "Roffle",
 "citation": " Roffle. \"The Beauty of a Chemical: experience with 2C-E (ID 77744)\". Erowid.org. Apr 4, 2010. erowid.org/exp/77744",
 "substance": "2C-E",
 "bodyweight": "170 lb",
 "report": "<p>I like to consider myself fairly experienced in the world of psychedelics, yet Im no expert, so when a friend of mine texted me and told me she would be getting a hold of some 2C-E my interest was piqued to say the least.  I planned on getting the 2C-E and doing it on a Sunday with an old friend of mine who well call B.</p><p>Sunday rolls around and its finally time to take the plunge. I call B up and tell him to come over whenever is good for him. Along with B I had another friend who was going to join us as a sitter, well call him T. B shows up around 11:45 AM and I decide to take my 2C-E around 12:00. Right after I took my capsule I text T and tell him to come over and chill with B and I. About ten minutes after I take my capsule B decides to take his which is full of 13 milligrams of 2C-E.</p><p>B and I sit on my couch for about 15 minutes watching Fear and Loathing in Las Vegas and waiting for T to show up. We begin to lose interest in the movie and decide to take it out because we havent been following the plot and B, seeing as how hed never seen it before, had no idea what was going on. Right when we take it out T shows up at my house. We talk for a bit, the excitement was killing us and about 40 minutes into it I could definitely tell a difference. There was a definite bodyload, I couldnt find a comfortable position to rest in, along with the bodyload I had the slightest bit of nausea but it was building quickly.</p><p>Since T was not tripping with us we decided to watch Eastbound and Down because its a favorite of B and mines and we thought T would enjoy it to pass the time. About an hour and five minutes is when I begin to notice some visuals around the room, I had nothing to eat beforehand so my come up was a bit quicker than Bs was. I went into the bathroom to take a piss and when I came out I had noticed quite a change. I stood; staring at the carpet for at least 15 minutes, noticing distinct and intricate patterns of what seemed very similar to DNA strands on my carpet. The way the dark and light sections of my carpet appeared there were hexagons that lined up perfectly all over the floor.</p><p>I went back to trying to find a comfortable position on the couch and when I came to find one and rested my eyes back upon the television I noticed that the characters faces were not the same. The seemed much different, almost as if they had melted right there.  At this point the nausea was becoming quite pestering, a sudden urge to vomit took over me and I rushed into the bathroom and threw up.  Once I finished vomiting I went to wash my hands and when I went to dry them the towel felt extremely dirty and looked almost black but when I took a closer inspection the blackness vanished and the towel returned to its natural white color.</p><p>I returned back into the living room but not before first admiring the complexity and intricacies of the DNA strands on the carpet beneath me. I took a seat on the floor and continued watching Eastbound and Down with B and T. By this time B seemed to be also tripping but not nearly on the same level I was. Once again I felt to urge to vomit so I went into my bathroom again and purged, but this time it was a relief, a sense of cleansing throughout my body. After vomiting I felt great, the nausea had completely left me.</p><p>Now free of the restraints of my former nausea I decided to go sit on a barstool in my kitchen and stare at the granite that rested upon our counters. I felt as if I could control every little speck of the brown, black, and gold granite. I would see a piece of the counter as a three dimensional cube and suddenly the entire counter was made out of miniature 3-D cubes that were all at my command. As time went on the counter changed from cubes into a canvas for my mind, I had limitless possibilities at my fingertips. The counter then seemed to rise up in a conic shape, out of the flatness that had formerly constrained it, out towards my eyes. The cone retained its golds and browns yet it continued to reach out towards me until I ceased its journey outward.</p><p>My focus then shifted from the counter towards my arms. All up and down them were patterns, patterns I couldnt describe, even to myself. Now focusing on my arm I could see all my veins inside of my arm and with my continued focus they seemed to take the shape of a cross then suddenly they were strewn all about my arm and then suddenly they were a cross again. I then got up to go to the bathroom once more so I could piss. When I came back out I lay down on the floor and stared up at the ceiling. On the ceiling there were hundreds of faces, each one green and displaying either great joy or great sadness. Right at this moment I realized that T was on the last episode of the show which relieved me to be done with television for a while. I was snapped out of my fascination with the faces on the ceiling by my mothers total gym which I perceived to be someone standing and staring at me out of my peripheral vision.</p><p>By now the visuals were dimming and T, B, and I began watching a show called Chowder. The patterns on the show still were interesting but not at all to the degree of an hour or so before. We finished out the day by watching Donnie Darko. The next day I was completely fine, no aftereffects to speak of, no sort of hangover at all.  All in all 2C-E is one of my favorite, if not my favorite hallucinogen Ive done so far and I would definitely recommend it for anyone wanting to try something new. The only thing I would recommend is to take something for nausea after first taking the 2C-E or maybe smoke a little weed to counteract said nausea. Happy tripping :D.0</p>",
 "year": "2009",
 "id": "77744",
 "gender": "Male",
 "timestamp": "2010-04-04T07:00:00.000Z",
 "views": "2935",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ]
}
