{
 "title": "DMT Cleans My Clocks",
 "author": "The Reverend Raw",
 "citation": " The Reverend Raw. \"DMT Cleans My Clocks: experience with Mimosa tenuiflora & Syrian Rue (Anahuasca) (ID 77760)\". Erowid.org. Mar 27, 2009. erowid.org/exp/77760",
 "substance": "Mimosa tenuiflora & Syrian Rue (Anahuasca)",
 "bodyweight": "76 lb",
 "report": "<p>Anahuasca experience, 5 March, 2009 (20 g Mimosa hostilis with 5 g Peganum harmala)</p><p>Substance Preparation:</p><p>Purchased ayahuasca pack for 2 people at a smart shop in the Netherlands, containing 20 g M. hostilis and 5 g of P. harmala.  The M. hostilis came in a fine powder, but I had to powder the P. harmala with a mortar and pestle.  I prepared the two separately, adding the 20 g of M. hostilis to a pot with 2 liters of distilled water of pH 6 (Spa blue) with a tablespoon of white vinegar (to lower the pH) and the 5 g of P. harmala to the same amount of water and vinegar in another pot.  The pots were brought to a low boil, just below the heat where bubbles started to form, and stirred frequently.  When each pot had boiled down to about 300 mL of liquid, I strained the contents of each through a t-shirt into another pot, still keeping the M. hotilis and P. harmala separate.  Setting aside the sediment of each to be reboiled, I filtered the M. hostilis and P. harmala liquids through a t-shirt again four more times, using a new section of cloth each time.  I set aside the two concoctions and then repeated the boiling and filtering process two more times each, again setting aside the leftover liquid from each repetition. </p><p>All told this process took me roughly 8 hours, as boiling the liquid at low heat takes around an hour and a half to reduce, and the filtering process done alone was tedious.  I put all the M. hostilis liquid in one container, all the P. harmala in another, and stored them in the refrigerator overnight.  The next day I boiled each concoction separately on low heat until each had reduced down to about 100 mL of liquid.  I filtered each through a t-shirt again, put them in two containers and left them in the refrigerator again overnight.  The third day, the day that I planned to trip, I took them out and filtered only the M. hostilis through a t-shirt, throwing away the sediment that had collected at the bottom of the container overnight.  I then heated the P. harmala to the temperature of warm tea and drank it slowly.  When I was close to finishing it, I heated up the M. hostilis to the same temperature and began ingesting it as soon as I finished the P. harmala.</p><p>Physical Preparation & Ingestion:</p><p>The day before the trip I avoided all substances that conflict with MAOIs (I also hadn't been drinking heavily or using hard drugs in at least the several weeks leading up to the trip).  On the day of the trip I fasted, drinking only water and not even drinking water starting three hours before the trip, in hopes of keeping the anahuasca down.  I started drinking the P. harmala at  16:50, and sipped it slowly, taking about 25 minutes to finish it.  I sat quietly and cleared my mind after each sip, to try to minimize nausea.  It tasted quite bad, but I felt okay as I drank it.  During this time I had very light perturbations from baseline, a mild awakening feeling and lightness of mood.  I finished at 17:15 and immediately started drinking the M. hostilis.  It tasted horrific, like I was drinking pure tannins.  I drank the M. hostilis very slowly, meditating and staying still after each sip to avoid nausea, with a vomit bag sitting in front of me.  It took me 35 minutes or so to take it all down, and I felt a heavy body load in my stomach and had to stay still, clearing my mind, to avoid vomiting.  In the end, though I felt nauseous at several points throughout the experience, I kept the brew down until after I had finished tripping, around 00:30, at which point I vomited violently whatever was left in my body, and with it left the last vestiges of the trip.</p><p>Experience:</p><p>I started drinking the boiled down extracted MAOI ...it tasted awful...I drank it warm, sipping it slowly...I thought that this must be the vomit agent, since it tasted terrible, but I drank it over the course of 25 minutes, sitting still and meditating a bit to avoid puking...it wasn't too bad to hold down and I finished it at 17:15 and started the distilled jurema...fuck if I thought the MAOI tasted awful, it was nothing compared to the jurema...pure alkaloid/tannin taste...it was very hard to take down...I drank it very slowly, again warm, over the course of 35 minutes or so, finishing at roughly 17:50-18:00...I felt a bit of slow awakening, a slight expansion in consciousness, but very light and pleasant...it was hard keeping the jurema down and I sat quietly for 30-40 minutes, concentrating on letting my body acclimate to the brew and clearing my mind...I almost puked twice, but managed to hold it down...</p><p>At this point, 18:30 or so, I started feeling a little more normal, coming down from the initial warmth...I started thinking that nothing was going to happen, when I started to get nauseous again...I went to my bucket, felt a bit like puking, but didn't...after waiting 5 minutes or so until the nausea stabilized, I felt the first wave coming in and put on some music...then a nice, strong acidy trip, with lots of moving geometric patterns when my eyes were closed proceeded for about an hour...I started coming out of it around 19:20, feeling a slight dip as if I were now on the down swing...I felt like it was nice and got up and walked around a bit...about 10-30 minutes later, I'm not sure, I started feeling nauseous again...I went to my puke bag and sat there for a while, until I stabilized...then I felt the warmth of the trip coming back up, and I went to change music as the cd had stopped...it was quite difficult to change cds, but I did...and then...it began...it wasn't even like tripping, it was like madness, like religious ecstasy...</p><p>I felt a second consciousness enter my body, something alien...it was in me and dimensions expanded, my closed eye range of vision became 270 or so degrees...I started hallucinating intensely...there was a light behind the flowing geometric patterns over everything...trees grew red fruit which glowed and curled around...buildings melted, the sky changed colors...spatial dimensions started wildly expanding and contracting...I was looking out the window and the window of the house opposite became a mouth that spoke and exploded and screamed DMT and made all sorts of bizarre humming noises...it wanted me to understand its glory and it shattered my ego and left me broken in pieces...my body felt disconnected; I couldn't keep straight where my arms and parts of my head were...I took a blanket and prostrated myself on the ground...the rush was incredible...I felt like I had found my heroin...I prayed..it was pure religious ecstasy, the feeling of something else being inside me, not being alone for the first time...it was absolute, unadulterated madness...awe-inspiring, transcendent, and profoundly disturbing.</p><p>I'm not a religious person and won't change because of this experience, but DMT is not a drug, it's beyond a drug, it's religion...if there is a god, It is DMT...</p>",
 "year": "2009",
 "id": "77760",
 "gender": "Male",
 "timestamp": "2009-03-27T07:00:00.000Z",
 "views": "35313",
 "dose": [
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:25",
   "amount": "20 g",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "(tea)"
  }
 ]
}
