{
 "title": "Novacaine",
 "author": "Sirfrodo",
 "citation": " Sirfrodo. \"Novacaine: experience with Yarrow (ID 77761)\". Erowid.org. Jan 9, 2010. erowid.org/exp/77761",
 "substance": "Yarrow",
 "bodyweight": "155 lb",
 "header": [
  "DOSE:",
  " repeated",
  "",
  "Yarrow",
  "(roots)"
 ],
 "report": "<p>I have been working at summer camps for kids in Montana and Idaho for the last six years or so.  Being out in the outdoors working a job where my full description is something like, Have fun with kids, is an excellent, enriching way to spend time.  Being out on hikes I often run into large amounts of wild yarrow.  These plants, with their fern-like leaves and their little white flowers, have been, for one reason or another, a source of consistent interest to me since I first learned about them.  The range of effects noted with this plant are wide and varied and I want to put forward a report that will be a clarification of one specific effect that I have found to be almost completely undocumented. </p><p>Initially, I was told that the flowers were a laxative.  I wasnt too interested in achieving a laxative effect, but I ate bundle of the flowers anyway.  I remember them tasting like sun dried bitterness, and having absolutely no effect on me whatsoever beyond the imminent need for something to wash away the taste.  I was also told that the leaves were a mosquito repellant; I found that the leaves, when rubbed on the arms, or wherever, actually do work as a short acting repellant.  Regardless of these two experiences, the most interesting effect that I found yarrow can have is as a natural novacaine when the roots are chewed and pressed against the tongue.</p><p>Ive been eating yarrow roots for years, sharing this pastime with my younger campers.  Some of them become annoyed with the taste, but most find the bizarre tingling and numbing sensations that the roots cause to be very entertaining.  Not all the roots give this effect.  If a whole yarrow plant is pulledcarefully, to keep the root structure intactthere are usually two different kinds of roots:  brown, stalky, fibrous roots; and small, fleshy, bright purple roots.  As is quickly surmised, the purple roots are the ones in question.  Depending on the age of the plant, there will be greater or fewer numbers of these purple roots, with younger plants usually exhibiting more of this wonderfully colorful growth. </p><p>I get the best effect when I take a small, say one inch purple root, and begin crushing it in my front teeth.  Keeping my tongue firmly pressed against the plant material as it is crushed gives me the best numbing, tingling effect.  The taste is bitter, almost acidic, but earthy and not terrible.  After 30 seconds or so the front part of my tongue numbs and begins to tingle.  This tingling spreads a little on my tongue, but most especially if I choose to move the root around to touch other parts of my tongue.  Once the root is spit out, the pleasant numbing sensation remains for 5-10 minutes and then passes.  I once tried to store some of these roots and they dried and shriveled within a day or so.</p><p>I try not to pull large amounts of any plant in order to keep the environment healthy, but when I do come across a large patch of these plants I cant help but help myself.  Im not sure what causes this effect, nor do I know if it is beneficial for the health or otherwise.  I just know that I love chewing the purple roots and showing all of my budding nature enthusiast campers how to do it too!</p>",
 "year": "20022008",
 "id": "77761",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-09T08:00:00.000Z",
 "views": "8433",
 "dose": {}
}
