{
 "title": "Quite Enjoyable, But Be Careful",
 "author": "Nighthawk",
 "citation": " Nighthawk. \"Quite Enjoyable, But Be Careful: experience with Betel Nut (ID 77776)\". Erowid.org. Mar 27, 2009. erowid.org/exp/77776",
 "substance": "Betel Nut",
 "bodyweight": "175 lb",
 "report": "<p>So I go to a college where I get drug tested, so naturally I can't smoke weed. So I've been looking into alternatives. Some of them hard illegals that leave your system fast (kind of the irony of drug tests). I have also been looking into legal 'buzzes' not really 'highs'. I found Yerba Mate to be much better than Coffee. And as for legal intoxicants Kava Kava, and Kratom are excellent.</p><p>ANYWAY!</p><p>I got some baked and sliced betel nuts in the mail today with some edible lime (NOT the fruit, but the mineral).</p><p>Put in the nuts in my mouth, let them sit there and soak up some moisture and then chewed them to a pulp. Wasnt the most amazing thing I've tasted, oddly bitter and dried up my mouth. But I got used to it fast.</p><p>Once the nut was good soft and pulpy I licked the end of my little finger and dipped it into the lime, then tried to place it into the pulp. Kinda worked but I put in too much lime and some spread around my mouth. The lime stung but it wasnt horrid. Once it was all mixed I stuffed it between my jaw and my cheek, like dip. I kept it in for the next 4 hours. I found it gave me a great little buzz. Slightly giddy and talkative. Similar to coffee only smoother. When I found the buzz was going down I would chew on it some more then put it back into the dip position.</p><p>4 hours later when I took it out (it had lost all its flavor). I noticed that the lime had eaten away at my gums and cheek. It hurt a bit. I have a feeling it may take sometime to heal. However, shortly after I had spat out my first 'lip' I put in another, only this time after I chewed up the betel nut into a pulp I squeezed the juice out of it in my mouth and then took it out, mixed in some lime while it was *outside* of my mouth. Then I put it back in, I hardly had any lime burn... a little but much better than before.</p><p>OVERALL. I found Betel nut to be very nice. They were quite nice, but watch out for the lime burn! It's a bugger! I plan to do it again (seeing as I still have a rather large bag of it) but not anytime soon. Maybe on special occasions but I definitely have to wait for my mouth to heal some first.</p>",
 "year": "2008",
 "id": "77776",
 "gender": "Male",
 "timestamp": "2009-03-27T07:00:00.000Z",
 "views": "39670",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "0.5 ",
   "administration": "buccal",
   "substance": "Betel Nut",
   "form": "(dried)"
  }
 }
}
