{
 "id": 7777,
 "title": "True Thoughts of Going Crazy",
 "date": {
  "submission": "2006-10-11T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "A.L.A.",
  "gender": "Male",
  "weight": 43
 },
 "dose": [
  {
   "time": "0",
   "amount": "9 hits",
   "administration": "inhaled",
   "substance": "Albuterol"
  }
 ],
 "report": [
  "It was a normal day, just like any other. I had done nothing special that day, thus making it extremley boring. So I remembered laughing at something rather stupid, but unusually amusing. A friend at school, in the library, had takin his inhaler and put multiple puffs in his mouth without inhaling. And exhaled a large, white cloud of abuterol and acted as if it was smoke from marijuana. So, I went and got my own inhaler, and puffed maybe 9 or so puffs and I guess I held it in a little too long, because not very much abuterol came out, and I had cringed because the taste in my mouth was as if I had let some pills just sit there and melt. So, I took some water and swallowed what I had in the mouth.",
  "I then thought of another topic to 'cure' my boredom and grabbed a small knife from the floor of my room and filled a bottle with water.  I then put pressure on the bottle, and slowly puntured the bottle as the water sprayed all over my face. 'wow' I thought, 'this is unusually exhilarating...' And I did the same thing with 5 to 8 bottles until from the chest up, I was drenched in water. I then took a shower, and grabbed a few bottles of water with me, as well as the knife, and 'murdered' more bottles. Each after another, I felt a pleasing adrenaline rush until I realized what I was doing/thinking after the shower. But before I had realized that, I gave myself a lecture in the mirror about how broccoli juice will kill children. I walked out of the bathroom drying myself, and then actually started thinking about what just happened.  I though that I might go crazy, as the steroid abuterol rushed suddenly through my veins, releasing an ungodly amount of adrenaline, as well as making my heart beat harder and harder. I was going to go downstairs and see if I should go to the hospital, but I didn't know how to break it to my parents, so I waited instead. ",
  "As I was walking through the living room, I heard my dad wistleing and told him to stop in a very angry, hostile tone, because it was one of the most odd and scary things I heard while I was there. I walked outside on the patio while my mother was smoking a cigarette and sat down in a bar chair for about 15 seconds and then walked over to the chin-up bar and started to do a very large amount of chin-ups. I walked back to the patio and sat down again and told my mother that I was going to try and take a nap. I went upstairs and layed down, and then came a huge rush of thoughts  violently flowing through my head. I felt like I was going to puke, I thought I was going to become a 3rd degree killer on the run, I thought I would be put in a mental hospital, I thought about getting killed by police, and horrid thoughts kept entering my mind just like that. Then I thought about what would happen if I never got bored, and those thoughts were what about my future? Will I end up having a nice house and a beautiful wife after all? Will I live up to all of my childhood dreams? And then came the negative part, and I could just flush those positive thoughts right out of my head, because I had true thoughts of  going so crazy, I would die right there and then. I wanted to cry, but I coulden't because I was feeling as if it woulden't even matter. ",
  "I turned on the television as if it would help any, and it was the biggest relief of this horrifying experience. I watched a movie, triple x, and it had really helped because I like alot of vin diesel's movies. But it flew right by and went by slower than ever at the same time. I then went downstairs to listen to music, but It scared me as if it were yelling at me like it was somehow making me feel like the yelling woulden't go away, even after I took the headphones off. I went upstairs again and slept a whole night in about 10 seconds and woke up paranoid and very panicky. It was a long term effect, I had minor to major panic attacks every day for about 3 weeks, and it settled down to 3 days a week in a much more minor panic attack.",
  "I would never suggest inhalents like this, because I would feel most sorry for osama bin laden himself if he had experienced something like this. (lol) You may think I overreacted, or I had made this up as if it were a placebo, but I truly experienced this."
 ],
 "erowid": {
  "id": "47294",
  "citation": " A.L.A.. \"True Thoughts of Going Crazy: experience with Albuterol (ID 47294)\". Erowid.org. Oct 11, 2006. erowid.org/exp/47294",
  "substance": "Albuterol",
  "views": "9492"
 }
}
