{
 "title": "Winter Wonderland",
 "author": "BP Emissary ",
 "citation": " BP Emissary . \"Winter Wonderland: experience with Mushrooms - P. cubensis & Cannabis (ID 77799)\". Erowid.org. Jul 3, 2009. erowid.org/exp/77799",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "145 lb",
 "report": [
  "<p>BP Emissary",
  "Born 1988 (20 years old)",
  "Male",
  "Weight 145 lbs",
  "So much has changed since first hitting that little orange glass bowl in my friend's bedroom one hot afternoon. If I could go back in time and tell my elementary school self that I would be experimenting with psychedelic mushrooms and smoking weed on a consistent basis, my past self would have cried bullshit.",
  "Fast forward two years to early 2008. Smoking weed with my very close knit group of friends has become a regular pastime. My own curiosity coupled with a close friend's glowing recommendation led me to try mushrooms for the first time during the summer with three other close friends, which ended up being an amazing night in which we ended up on a five mile walk barefoot through the city along the Mississippi. Amazed at the experience, I vowed to try mushrooms again, but our group of friends agreed that to maintain their specialness and our own mental health to only do shrooms every six months. So I patiently yet excitedly waited for winter to rear its head.",
  "The landscape turned bitterly cold quickly; winter in Minnesota can be very brutal. My friend's mom was leaving for three weeks, which fell right in the middle of our winter breaks. His mom's house offered the perfect place to trip: it was WARM while being a safe zone with no possibility of interruptions. Additionally, the house is located right next to a huge city park that we planned to explore during our trip. Everything was falling into place.",
  "A few days into 2009, my friend R and I drove over the J's house. Shortly after we got there, we ate the mushrooms (Surely Cubes, some had broken the veils, others hadn't) around two or so on peanut butter and mushroom sandwiches and washed them down with lemonade. I ate a little over a half eighth (less than a full eighth however) while the others (A, J & R) ate half eighths. We then sat back and smoked a bowl of fine herb with our sitter (F) and put on Sgt. Peppers on J's moms really nice stereo and excitedly waited for the trip to begin. At first we were simply stoned off of the bowl we smoked, but the effects began to be obvious around twenty minutes after takeoff.",
  "I first noticed the shrooms setting in when I picked up a large picture book entitled 'Missouri' off the floor. In it were massive pictures of forests, fields, farms, animals and streams that were VERY immersive. I couldn't quite put my finger on what was different, but I could tell something about my perception was altered in a wonderful way. I handed the book to my friend J, who took one look and couldn't handle the pictures. He had started tripping the soonest and was already building (he had also not eaten anything, while I had eaten a small lunch).",
  "Then I realized that the music had changed, and 'Within Without You' wafted from the speakers. My perception of music was becoming altered: sounds were richer and fuller, as if they were coming from more than just two speakers. I especially became aware of the layers of music; George Harrison playing the sitar was a whole new auditory experience, and I remember being able to isolate each 'layer' of sound that made up the music. Sitting back on the couch with my eyes closed with the music filling my brain I felt the trip begin to set in.",
  "At some point we decided to go outside, which involved some serious bundling up to stay warm. We stumbled outside around threeish and made our way to the park, which covers a good square kilometer or two. The scenery was astounding!! The tall, naked trees stood tall in the snow and the fractal patterns their branches made were entrancing. We wandered the park, looking at everything around us in awe. At one point, my friend J described everything moving in very slow motion, and that he felt that everyone around us (not many people at all) were looking at us, which made him uncomfortable. About a half hour or so into our foray into the park, R and J began to get too cold but A and myself wanted to continue exploring the park. We compromised and J, R and F (our sitter) headed back but A and I continued on.",
  "The rest of our journey outside only got better. Feelings of intense euphoria set in and everything I saw took on a new life. My vision seemed to be deeper and clearer: I began to recognize patterns in things I had never noticed before, like tree branches and the sky. The bright sunlight made everything seem to stand out in my vision; the natural lines around us were crisper and colors were certainly more pronounced. As we continued to explore the park, the sun began to set, and the sunset was an AMAZING purple and orange explosion in the sky. The colors seemed to be freely combining and flowing in the sky. These slight visuals over the trees and freshly fallen snow coupled with the strong euphoria I was experiencing was simply astounding. We wandered around the skiing course, dodging the occasional skiers and snowboarders while staring at everything we could.",
  "At this point, we began to head back as we didn't want to be caught outside in the dark. The nice, blue skies soon darkened and the temperature started to plummet right as we got inside. R and J tell me that A and I burst in the door staring at them with wide, silly grins and very dilated pupils. Faint whiffs of pot smoke twined with the amazing music coming from the other room (Gal Costa? Something Brazilian). We smoked a bowl in J's room with the lights off in complete darkness and silence, with only the glowing cherried bowl for light hanging suspended in midair (one of the best bowls of my life so far). The weed and the heat of the house definitely took my trip to the next level, and I began to trip harder.",
  "I put on Gilberto Gil's '1968' and let the music flow over me. I lost all sense of time listening to that album, and thought some very weird and powerful things. I remember being taken aback mentally when I thought about the power that the idea of God holds over so many people's lives...it was almost too much for me to handle. I also minorly freaked out when I thought about what time it was [i] and I had no fucking clue! [/i] I had completely lost track of time entirely and couldn't even guess. When I saw that it was seven PM, the idea that it was even a time at all was very alien. These thoughts/realizations were accompanied by an intense rush of childlike wonder and joy.",
  "Then things started moving. This brown wooden cabinet in the livingroom began to wave, then the wood seemed to flutter. The best way I can describe it is it seemed as though the wood was being blown in the wind, like a flag. I stared at it, jaw agape with wide eyes, amazed and euphoric. Then the blinds began to move, with stripes of grey and brown moving rhythmically and patterns on artwork around the room moved gently back and forth. Everything was moving very smoothly and it was very gentle and soothing. I simply laid back, my mouth still hanging open, taking it all in. The music, the gentle movement of patterns, my friends which I have always felt a very strong connection to and the constant euphoria added up in my mind. I was so happy and very fulfilled.",
  "During this whole period, my friends were enjoying their trips too. A had curled up on the couch and spaced out, just listening to the music. He later told us he couldn't understand what we were saying, and when he saw us looking at him worriedly, he smiled and with his grin and wiiiiiide pupils told us that he was having a great time. J was listening to the music on the floor, but also writing on his computer the various things he was thinking about, which would be a treat later. R was simply laying down in a big chair, looking around, smiling and listening, pausing at times to tell us that he was tripping some mad balls, as he would put it. F, our sober (yet very stoned) sitter was smoking pot and occasionally talking to us about what we were experiencing.",
  "We ended up coming down around ninieish, maybe a bit later. After coming down, I noted how my body felt: I had never experienced nausea (maybe the weed kept it down?). I felt very tired, not only physically from the walking, but mentally, the way you feel late at night when you haven't gotten much sleep. But it was sort of nice after the intense afternoon, otherwise I was very clearheaded and retrospective. We finished off the night with hookah and a movie and all went to bed relatively early. The next day, I felt no noticeable effects, except some sore leg muscles but I suspect that was from the hours of walking we did.",
  "All in all, it was a grand time, truly everything I was looking forward to. I maintain that one should space out mushroom experiences every few months: it allows you to completely decompress from your trip and reflect on everything, yet gives you enough time to prepare yourself and look forward to next season's trip. I don't pretend to be an experienced tripper, but i believe that the more you look forward to your trip, the more enjoyable and fulfilling it will be. We have already started planning our July shroom trip: let's just say that it involves walking and BIKING!</p>"
 ],
 "year": "2009",
 "id": "77799",
 "gender": "Male",
 "views": "2606",
 "dose": [
  {
   "time": "0",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2009-07-03T07:00:00.000Z"
}
