{
 "id": 778,
 "title": "There Should be Vending Machines",
 "date": {
  "submission": "2001-02-11T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Outlore",
  "weight": 67
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Two very close friends and I drove 60 miles to attend a foam party at a seaside resort. We drank copiously - about half a dozen ?boilermakers? each.",
  "Resolve thus softened, a friend who met us at the party revealed that a selection of drugs was available for purchase upstairs. Briefly, we debated as to whether we would invest in a couple of lines of Charlie, or a few pills. (Acid was ruled out immediately; we all consider it a gutter drug on the basis of our experiences). We went for the pills - one each at R80 a pop (that's about $12).",
  "Being fairly responsible adults, and aware of the side effects of any drug before chowing it, we stopped drinking booze and went on to water and energy drinks for the rest of the evening.",
  "Well. Munching that little pill changed me from being a person who didn't enjoy rave music at all, to the friggin Energiser bunny.",
  "I have never felt so close to other people before - the two guys I was with are my best friends, but the addition of a little ecstasy just made me realise all the wonderful qualities they possess as if under a powerful magnifying glass. The whole setting became more intimate (there were about 40 total strangers who were also chowed up) - people were touching one another, sharing water bottles, Tiger balm and drinks. An absolutely incredible feeling of fraternity pervaded the club.",
  "My most remarkable observation was the feeling of absolute crystal clarity of all my senses. Drunk people suddenly seemed so oafish and clumsy. As soon as a drunk person bumped against me, I could feel, without looking, that that person was pissed - realisation dawned, that as a drug, alcohol is totally worthless in comparison to ecstasy.",
  "We walked down to a gas station in the early hours of the morning to buy some gum. The night air was wonderfully cool and soft and alive. We chatted about our intimate feelings and aspirations - such a rewarding experience. (All three of us are degreed professionals)",
  "Needless to say, after such a revelatory experience, we placed an order for a batch of another 20 pills for the coming weekend. The second experience - in a popular rave club, and with a dose of two pills each (staggered at a three hour interval) this time - proved to be every bit as satisfying as the first trip.",
  "My conclusion, after researching the product and its effects/side effects, is that certain elements in society - such as cops, various members of the legal and medical professions and other authority figures, is that a wonderful stimulant with apparently negligible side effects, has been demonised and shrouded in myth. This stuff should be available on demand from every cornerstore, just like cigarettes (I don't smoke) are."
 ],
 "erowid": {
  "id": "121",
  "citation": " Outlore. \"There Should be Vending Machines: experience with Ecstasy (ID 121)\". Erowid.org. Feb 11, 2001. erowid.org/exp/121",
  "substance": "Ecstasy",
  "views": "7785"
 }
}
