{
 "id": 7787,
 "title": "Stuck in a Dream, Trapped in a Bubble",
 "date": {
  "submission": "2011-11-03T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Amber",
  "gender": "Female",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 ",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "cookie / food"
  }
 ],
 "report": [
  "I seriously thought I was going to die.  I tried one and a half of my friends weed cookies, and felt nothing for a really long time.  And then it just hit me.  I was completely stoned.  My whole body felt like it had become part of the chair I was sitting in.  I was outside my friends house just hanging around when this happened.. We decided it was time for me to go home, so my friend Jamie walked me back to my house and I went up to bed.  As soon as I laid down and closed my eyes, my body felt like it was vibrating. All these thoughts came rushing back to me.. some of my most earliest memories that I hadn't thought about it years.  This happened every time I closed my eyes.  I also felt severe deja vu. I kept thinking to myself that this all had happened before, and it was like I almost knew what was going to happen before it did.  So I closed my eyes again, and the memories started up again; all in a huge flash. My heart pounded so hard.  I squeezed my eyes shut and just wished this would go away! ",
  "My cat was on the bed with me, and I could feel her moving around and I started thinking extremely weird things.  I thought that my whole life was a dream; I wasn't even alive.  I thought that all my life I had spent it right there; trapped in a coma, and I was just realizing it now.  You know in that movie 'Look Who's Talking,' well I felt something strange like that.  I thought that I was a sperm just floating around, like I didn't even exist, and my cat moving around behind me was one too.  Every step she took on my bed felt like it was so hard that it was making me rock. Again memories came flooding back, and I gasped for air and opened my eyes.  I was then convinced that I had just died and was revived.  I was so freaked out, I went to run down the stairs, which also made me think of deja vu again.  I ran into the computer room where my mom was and started rocking back in forth, telling her I was convinced I wasn't really real; it was all a dream.  She tried to calm me down, but every time I blinked, more childhood memories ( alot of them being bad ) would flash before my eyes. My mom told me to go back to bed, and I did.  I closed my eyes again, but this time I fell asleep.  I woke up with major munchies and was pretty much hung over all day."
 ],
 "erowid": {
  "id": "47321",
  "citation": " Amber. \"Stuck in a Dream, Trapped in a Bubble: experience with Cannabis (edible) (ID 47321)\". Erowid.org. Nov 3, 2011. erowid.org/exp/47321",
  "substance": "Cannabis (edible)",
  "views": "2607"
 }
}
