{
 "id": 7789,
 "title": "Extreme REM",
 "date": {
  "submission": "2008-01-22T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Man of Decency",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "pill / tablet"
  },
  {
   "time": "1:30",
   "amount": "1.5 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I had obtained six .5 mg clonazepam tablets and after a trying evening of work, I decided to ingest three of them. They were small, yellow pills and tasted chalky going down. I expected a similar experience to oral diazepam.",
  "In this sense, I was right. The effects were very similar. However, unlike valium, which I feel gives me a relaxed, benevolent apathy towards my surroundings, clonazepam made me feel quite stoned. The apathy was still there, but my mind was a bit cloudy. My motor skills were not greatly affected. I could talk reasonably intelligently and walk without difficulty.",
  "However, about an hour and a half after taking the first three pills, I decided to take the other three. I was quite affected from the initial dose but still intelligable. However, another hour past and I had extreme difficult walking and keeping my balance. My center of gravity seemed to fluctuate and although I tried desparately to maintain balance, I fell down frequently.",
  "I retired to my bed and for about half an hour, I writhed under my blankets, relishing the warmth, comfort, and safety of it. The next ten hours were one of the most intense dream cycles of my life. I spent nearly all sleep in my REM stage, epic dreams weaving fantastic images and sounds and feelings into strange and beautiful realities. The specifics of the dreams are not important, but the feeling of utter wonder from such powerful dreams was truly refreshing. Unfortuately, after ten hours of beautiful dreams, a wasp somehow managed to get into my room and sting me on the meat of my upper arm. I was not pleased. Neither was the wasp when I squished it (sorry to insect lovers).",
  "In retrospect, clonazepam certainly is a useful drug in a medical sense and an entertaining one in a recreational sense. The second dose of 1.5 mg was definetely not needed but I suffered no ill effects (minus a bit of slowness in the morning that was cured with a cup of coffee and a cold shower). I believe that even the first 1.5 mg dose was a bit large if one desired to venture out into public. This was my first experience with the drug and I feel that I should have started with just one pill (.5 mg) before jumping into benzo-land with such a large dose."
 ],
 "erowid": {
  "id": "47330",
  "citation": " The Man of Decency. \"Extreme REM: experience with Clonazepam (ID 47330)\". Erowid.org. Jan 22, 2008. erowid.org/exp/47330",
  "substance": "Clonazepam",
  "views": "64681"
 }
}
