{
 "title": "Go Outside!",
 "author": "Cactus",
 "citation": " Cactus. \"Go Outside!: experience with Mushrooms (P. cubensis) (ID 779)\". Erowid.org. Oct 16, 2000. erowid.org/exp/779",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  "1.5 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)"
 ],
 "report": "<p>Last July 4th, I went to my brother's house to barbecue, crack a cold one, and partake of some fungus that we had been waiting on for several weeks.  Upon seeing the scant quantity that my brother's friend had given him, I was rather deflated and told my brother that it wouldn't be enough to really give us both a good buzz.  I had previous experiences with mushrooms, and what we had appeared to be about a gram and a half at most.</p><p>Now, I have no idea how long it takes for dried mushrooms to lose their strength or what other factors may play a role in their effectiveness, such as how they were stored, wild or homegrown, etc., but my brother was quite content to let me have them while he smoked some MJ.</p><p>Well folks, I'm here to tell you, these suckers put me on a solid eight hour voyage. Is this an unusually long trip for that amount?</p><p>I had the usual anxiety, jaw-clenching come-on, and I did about sixty laps around the kitchen/living room area while my brother prepared some salmon for the grill.  After about fortyfive min. I found myself closely observing the intricate swirls of color in a print he has framed in the living room. My buzz was coming on so hard and fast I almost bashed my head through the glass in the frame. It was as if the color were sucking me into the painting.</p><p>Finally, I managed to sit down and relax and just sit and observe the changes that were taking place around me. Looking at the colors and textures of the paintings, fabrics and such that were around me gave the appearance that I was sitting in a giant, fantastic gem.  After a few hours, however, the variety of color and patterns became annoying and progressed to the point of being hideously offensive.  The garishness of every piece of furniture around me was like an assault to the senses, they were so intensified.  Unfortunately, the powerful oceanlike wave that was coursing through my body prevented me from being able to get up and walk. My speech was really slurred, and all sound and color seemed to be moving to the rythm of this wave.</p><p>Later, I managed to balance myself and stumble into the kitchen to eat something and then go to the back yard.</p><p>WOW!! Much better. The richness of the colors in nature seemed holy in comparison to manmade objects. The patio furniture by the swimming pool seemed like a nightmare out of a Tim Burton movie. I felt very strongly that their revolting plastic 'fakeness' had no place in this world and was only our pathetic attempt to soothe our misled minds that simply refuse to acknowledge reality as God intended. I felt as if I were part of the spectrum and that the wave surging through me was now frequencies of color, and I was a part of them. I imagined that if I cocentrated my will, I could simply point to the pool chairs and burn them from existence.</p><p>After I basked in the revelation of the power in the creation which is all around us, a friend of my brother's arrived.  He had just gotten off work and had had a really bad day.  He was in a real angry mood and began recounting an altercation he had with a customer in his store. But, all I could see was how wrong his anger was and how wrong it was to let such negative feelings rule you. In short, I felt as if I was seeing the true nature of a kind of sin. It became very important to me at that moment to beware of the trap of hatred and anger.</p><p>In summary, it was a great experience, but I would highly recommend a camping trip to really appreciate the altered state these caps put you in.</p>",
 "year": "2000",
 "id": "779",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-10-16T07:00:00.000Z",
 "views": "6691",
 "dose": {}
}
