{
 "title": "Blood, Sweat, and Hydrocortisone",
 "author": "glow",
 "citation": " glow. \"Blood, Sweat, and Hydrocortisone: experience with DXM (ID 7790)\". Erowid.org. Jul 28, 2003. erowid.org/exp/7790",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "7.5 oz",
   "oral",
   "DXM",
   "(liquid)",
   "",
   "2 bowls",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "report": "</p>\nThis was my third time trying DXM and my friend M's second. He has previously dosed at 4 oz of Robitussin max cough, and I have 4 and 6 oz. We both decided to do 8 oz, but ended up doing around 7  each. We drank the liquid quickly and then loaded the waterbong and smoked around 2 bowls. We then shut off the lights and began to dance/glowstick to some Frankie Bones. About an hour into the trip we just glowsticked back and forth at each other and it was the most amazing thing ever. The tracers were so beautiful and just the most mystic and interesting things we have ever seen. At about an hour and a half into the trip we decided to sit down and watch some TV. We still had tracers from the glowsticks the entire time we watched the comedy special and we were enjoying our trip.</p><p>Two hours into the trip it took a horrible, horrible turn. I sat on the bed and began to get the itch that I only out of my friends get. I was prepared with hydrocortisone cream and used a lot. When I didn't have time to get cream out of the tube I just scratched as hard as I could, not thinking of consequences. I ended up with a lot of cream and blood all over my face, which felt like burning. I then leaned over my bed to the bucket I kept handy because I started to feel sick to my stomach. It was then when a huge wave of fear, pain, uncertainty, anxiety, and panic came over me. It was the worst feeling I ever had. Then about 5 minutes later another wave hit, then another. I forgot to breathe for some time and then just gasped for air as much as I could. My friend just started to notice my problems and tried coaching me back to normal. It worked a little until I looked at the mirror where I saw myself, only I was a demon who looked so evil and horrible.</p><p>Waves just unloaded on me and I said 'Please don't let me die M!!!' I repeated this a couple times and he told me that 'It is a drug, don't worry.' I began to cry and all the blood/cream mix got into my eyes and it became difficult to see. At this point my friend said that he got sucked into the ground and couldn't move but was flowing through space. I then decided that I had to go upstairs and go to the bathroom. I began to climb the stairs with all my might, which wasn't much, because I felt like I was just a head floating. I got up to the top of the stairs, and then fell; right down the hard uncovered wood stairs. I didn't feel any pain, and decided to try again. My friend tried to stop me but all that he could say was, 'Please, don't.' in a whisper.</p><p>I made it up the stairs, and then felt a force just making me try to give up. I stumbled as much as I could towards the only light I saw. I thought in my mind 'This is it, give up, you are dead.' I then collapsed, and like the most pathetic thing in the world I laid with my arms and legs tangled up with one eye open. The one eye was just so lucky to see a large green eye come and slowly eat me until I died. I woke up about 6 hours later and I felt like I had the flu times 90. I couldn't bear to move, but I went to check on M. He was on my bed, turns out he didn't sleep at all.</p><p>He then told me that when he heard me fall, he struggled to come up, but he couldn't, and he burst into flames. He said he burned alive for about an hour and then got enough confidence to come check on me. When he was up checking on me I was on the couch somehow and he was holding my head in his arms with all the sweat and blood and cream and tears just terrified because he had thought I was dead. I can't even begin to explain how horrible I felt.</p><p>This might not sound so bad, but it was the worst psychological and physical torture ever and I would NEVER recommend this to anyone. I now though have an appreciation for life and still flu-like symptoms. DXM is not for everyone.</p>",
 "year": "2001",
 "id": "7790",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2003-07-28T07:00:00.000Z",
 "views": "28916"
}
