{
 "id": 7790,
 "title": "Spiders on the Wall",
 "date": {
  "submission": "2006-08-14T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Femmefatale",
  "gender": "Female",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I've been using Diphenhydramine as a sleep aid since 2003.  On any given night (most nights in sequence) I take between 10 and 20 of the 25mg pills to knock me out.  Diphenhydramine are the only pills I can afford and take regularly that still work for me after two years (I've been on most script sleep-aids (Ambien, Lunesta, etc.) and all stop working for me after a week or two).  I have chronic insomnia and so I started 'Extradosing' on Diphenhydramine after I accidentally took too many Benadryl one day and slept wonderfully. ",
  "I never experienced hallucinations on the pills until after having taken them for over a month.  I wasn't even sure what was happening the first time.  I had taken 20 pills one night (well, actually, at 4am-my bedtime) and woke up at 7am to be very confused when my ceiling and walls appeared to be moving.  I looked closer and saw what appeared to be thousands of clear baby spiders crawling everywhere.  I don't know if this particular hallucination is specific to the drug, or if this is a coincidence.",
  "I woke up my boyfriend and of course he saw nothing.  Still being really freaked out and feeling heavy from the pills, I decided to walk around the building.  I saw spiders everywhere...clear, baby ones and bigger, spindly ones crawling over each other and fighting.  I finally ended up sitting outside my apartment building on the curb and using my cell phone to call the janitorial staff about a spider infestation.  They didn't come for nearly 6 hours and I stayed outside until they did because everytime I would go inside, I would see the spiders.  I continued to see spiders on random nights for the continuation of that year but learned to ignore them once my boyfriend and friends convinced me that they really weren't there.  I didn't make the connection with the pills until nearly a month later (I've never used drugs before to 'trip'). ",
  "I still use the pills and still see the spiders...sometimes on nights and during days when I haven't even taken the pills.  I really believe I am addicted to them, because if I don't take Diphenhydramine now (even if I try another script sleep-aid), I don't sleep.  I buy a bottle of 100, 25mg pills every week, and every week, I finish it off and need to buy another.  I've noticed that nobody else has posted experiences with long-term effects...and so I wanted to. ",
  "I've had a mixed experience with this drug."
 ],
 "erowid": {
  "id": "47337",
  "citation": " Femmefatale. \"Spiders on the Wall: experience with Diphenhydramine (ID 47337)\". Erowid.org. Aug 14, 2006. erowid.org/exp/47337",
  "substance": "Diphenhydramine",
  "views": "13147"
 }
}
