{
 "title": "Talking to Plants and Hugging Trees",
 "author": "Dj Split",
 "citation": " Dj Split. \"Talking to Plants and Hugging Trees: experience with Mushrooms & Cannabis (ID 7795)\". Erowid.org. Jul 30, 2003. erowid.org/exp/7795",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "3.0 g",
  "oral",
  "Mushrooms",
  "",
  "1.0 g",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>An old friend from high school had come down and I was off to my buddies apartment.  He had brought with him a large smorgasboard of drugs and we were gung-ho, planning to devour every bit. I had been sick the week prior and was on some strong dosages of some unknown medications which may have added to my bad experience.</p><p>He had some of the strongest bud imaginable and a load of shrooms and E. We had planned on eating the shrooms and taking the E later but never got around to it. We went to the store and bought some ice cream sandwiches, being told that was the best way to consume the mushrooms.  We took the top off and piled the shrooms high and devoured the sandwiches quick.  The mushrooms tasted horrible, but the ice cream made it bearable.</p><p>We then went to the couch and smoked a bunch of bong rips of the bomb ass weed, which would have been enough to get me to trip anyways.  We sat around watching TV until the mushrooms had taken effect. We decided to go on a nature walk seeing as how the apartment complex was very large, lush and full of beautiful flowers and foilage. I was completely lost the whole time, my friends told me I was completely unreachable at all times, they continuously tried to talk to  me, not wanting me to have a bad trip, but I would just stare at them, sometimes angrily and walk off.  All I really remember is just sitting back and enjoying the show of lights and colors which were quite intense, and listening to them converse, even though what I was hearing was COMPLETELY different from what they were saying.</p><p>I began to wander off from the group and after several tries to keep me with them they just gave up as I was pretty much stationary and said they would come back for me later.</p><p>It was at this point that my whole world literally came to an end.  I passed out for some unknown period of time, partially in the street.  I threw my $150 sunglasses under a moving vehicle because a tree told me they were evil.  I was talking to plants and hugging trees, all the while my mind was racing a mile a minute.  I felt as if my whole life had been a dream and I was just now waking up, but I was a totally different person. At one point I thought I was dead, at another I saw god.  It was interesting to say the least.  But then the real bad trip started, after I sat and tripped out for awhile I felt the VERY intense urge to go home, I was scared and lost and could not find my way back seeing as how the place was very big.  I stumbled around loving on all the plants on the way, I later found out I was out for about 3 hours.  I finally found the apartment after having about 3 or 4 panic attacks, and almost crying because I was totally lost and the visuals were getting to be too much for me to take.  After I found the apartment I still did not feel at home, and could not sleep so I stole my friends truck and drove to my house and passed the hell out in the living room on a pile of dirty laundry.</p><p>I felt really enlightened the next day and I remember enjoying the time before I passed out immensly. I am going to try shrooms again soon, because I can tell that if I had a good trip they would be quite the awesome drug.  It seems as if they make you more aware of your surroundings and for a long while afterwards all the colors and plants seem brighter and more beautiful.  It was a lasting experience that I will never forget and I hope to add many more in my lifetime. Even though I almost got killed and lost my very expensive sunglasses it was worth it and I look back on the whole thing with a smile.</p>",
 "year": "2001",
 "id": "7795",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-07-30T07:00:00.000Z",
 "views": "12842",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms"
  },
  "1": {
   "time": "",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
