{
 "title": "Virgin Enlightenment",
 "author": "Psyke",
 "citation": " Psyke. \"Virgin Enlightenment: experience with 4-AcO-DMT (ID 78010)\". Erowid.org. Jan 24, 2010. erowid.org/exp/78010",
 "substance": "4-AcO-DMT",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  "15 mg",
  "oral",
  "4-AcO-DMT",
  "(capsule)"
 ],
 "report": "<p>4-AcO-DMT: An oxymoronic enigma of a trip.</p><p>This is the full account of my first encounter with this incredible psychedelic substance.</p><p>So it is St Patricks day, and the need to party is in the air. The original plan was to attend the parade with my girl friend and just get drunk. But when we get there it just seems blah, totally not our scene. So after grabbing a bite to eat we head back to the house to take this stuff we have had put up for a week. We each have 1 15mg capsule. We arrive at the house and drop them at 1:15 PM.</p><p>So we sit around watching some tv waiting for the come-up, for the first 30 min we both feel virtually nothing other than the feeling of having a head full of acid, all colors seem sharper more vibrant. Her room is tinted pink to me. At 1:50 my girlfriend begins to laugh uncontrollably. As soon as she can get her laughing under control it starts again. This goes on for about 20 min. I don't understand yet why, because I feel nothing other than the slight mental difference brought on by the initial kick.</p><p>Then suddenly she begins to cry, the come up is to strong to intense. She does not know what to make of it. She feels responsible for me not being able to feel mine. I take her in my arms and do my best to assure her she is going to be ok, and that it is not her fault. After about 15 min she calms down. It is now about 2:30 and I still feel nothing. I call my friend who I got it from and ask him whats up, he assures me that I will feel it sooner or later. Just try to change your environment go some where comfortable, he tells me.</p><p>So we go outside to the back by the lake but there are bees so fuck that we go back inside. My girl friend informs me she is trippin face, like nothing she has ever felt before. At 3:00 we go sit on the front porch and talk for a little while. About 3:30 we are still sitting there and I see the tree trucks begin to bend in a slow fluid motion, very subtle, slight wiggles. The colors enhance a more. Everything is beautiful out here. Visuals intensify a little bit.</p><p>We go back into the house, The visuals change when I walk in the door. While out side the visuals are more like mushrooms, inside they become more acid like. We go to her room and I realize I am coming up hard FINALLY.</p><p>T-3:50 We decide we really want to go get my girl friends check and go to the movies see something crazy and exciting. Who is going to drive? I say I can drive and bust out laughing. My girlfriend is like haha ok you cant drive. At this point I am still not going hard enough to have difficulty driving. Yet every time I try to stress to her that I can drive if we are going we need to go NOW. But every time I try to say this with any seriousness I begin to laugh uncontrollably. I was able to get the words I can drive out one time and thought I had done it, but then began to laugh after about 3 seconds.</p><p>While this is going on the visuals steady get stronger. Finally I give in realizing that I had waited to long and leaving at this point would insure that I hit my peak while driving. So we decide to smoke a bowl. We both take a few hits 2-3 a piece. The high is very subtle but I can feel the weed making the trip stronger every time I exhale my hit.</p><p>T-4:20 We are both laid on the bed just talking to each other. We are both trippin fuckin face at this point. I am propped up on my hand, about 6 inches from my girl friends face, just having a normal conversation. All of a sudden the visuals begin to peak, her face begins to change shape, colors morphing, wiggles and tracers, craziness. Then it all begins to blur and melt, going fuzzy fuzzy fuzzy, I can feel myself slipping off of reality. I shut my eyes tight and jerk back, shaking my head around as a scream WOAH WOAH WOAH what the fuck holy shit.</p><p>My girl friend begins to cry uncontrollably, I assure her she has done nothing wrong and try to explain what happened to me the best I could at the time. She does not understand thinks I saw something horrible in her, but that is not the case. After comforting her back to stability I feel as if I have to get out of this room, Its tiny I am beginning to feel trapped. The room is scary the trip begins to turn dark. I feel overwhelmed like there is a huge energy inside me that is going to explode any second. Everything is happening so fast.</p><p>I began to have an extreme flash of emotion and thought. Fear and anxiety, peaceful , calm, enlightened, scared, clensed, what is going on in my head. How can I feel these negative and positive things simutaniously like this. What a strange feeling. I feel as if I took to much while at the same time not enough. I want it to be over but never end. I am terrified, happy, refreshed, stressed, freaking, losing my mind. Clensed, renewed, weak and vulnerable reborn. I don't like it not at all, but I love it I cant get enough.</p><p>I am walking around the front yard in the grass and flowers, everything is so damn beautiful. I am amazed. This is so incredible. Everything looks wet but dry, so shiny and smooth. The colors morph and fade into different shades and hues. Geometric patterns sliding and shifting in and out of each other. Everything works together as one but on an individual level. As chaotic and intense as everything is, I feel as if I have discovered the big mystery to life. Like I have the little answer to the BIG question.</p><p>I return to sit on the porch with my girl friend and we begin to chat about this and that, watching the incredible show going on in the yard.  Her mom leans out the door asking one of us to get the mail for her. I jump on the opportunity for another adventure through the bright and colorful yard. When I return her mother is advising us to not get her check today (as if we could at this point HAHA) Because she would have to cash it at a money shark joint as we don't have a bank account ya know.</p><p>But it was reported earlier that week that a gang had an initiation for their new members. Who were required to go to there and shoot 3 white women. Hearing this deeply disturbed me, sickened me even. I begin to think about what if we were there and this really did happen, what if they shot my girl. I can see my self ripping through these gang bangers with my bear hands. How could anyone be so heartless.</p><p>It is about 5:15 now, I begin to wonder how to get out of going to work at 6. This stuff was suppose to be over with by now. I start freakin now, if it had worked on the time frame that had been given to use by the guy we got it from I would be fine to go to work in an hour. We sit around for about 30 minuets still tripping really hard trying to work an excuse. Because Im trippin it becomes complicated. I began to try to make these elaborate excuses that would never make sense if I wasn't fucked up, adding in extra details to the story that really make no sense.</p><p>Finally I get my story straight call in and tell them the car wont start I am about 30 miles away, you guys can send some one to come get me but I'm not walking. They accept and everything is all good again. We go in and lay down on the bed. My mind still racing with crazy thought patterns, visuals still going off everywhere I look. But they are beginning to calm down a little. Yet I feel as if I am still coming up hard, Like I am about to repeat the whole trip over again. This idea both excites me and scares me.</p><p>T-6:00 I begin to come down a little more quickly now but it is smooth and subtle still. I don't know the exact time in which I fully came off the trip. It was more like I was tripping one moment and not the next, but didn't notice that I was not until way after the fact.</p><p>Trip ended around 7:30 completely just a rough estimate though. After the trip I felt very refreshed. It had done its job, and very well at that. consciousness expanded</p>",
 "year": "2009",
 "id": "78010",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-24T08:00:00.000Z",
 "views": "8388",
 "dose": {}
}
