{
 "title": "MAO Inhibition and Dosing",
 "author": "Distorted, Australia",
 "citation": " Distorted, Australia. \"MAO Inhibition and Dosing: experience with Peganum harmala or Moclobemide & Various (ID 78044)\". Erowid.org. Apr 9, 2009. erowid.org/exp/78044",
 "substance": "Peganum harmala or Moclobemide & Various",
 "bodyweight": "",
 "report": [
  "<p>Citation: Distorted, Australia; David Aardvark; Keeper Trout. 'MAO Inhibition and Dosing'. The Entheogen Review. Vernal Equinox 1998;1998;7(1):4",
  "I have two friends, 'Andy' and 'Bob,' who used to take between three and six times as much (respectively) of any substance as me to get to the same level, and they still had a much flatter peak. We are all about the same size and weight, and lead similar life-styles.",
  "One day we were all going to partake in an ayahuasca experience. A double dose of Peganum harmala (just to be sure) and 30 mg DMT each. Bob got a few rushes and other physical sensations, but very little visually. Andy and I had the most amazing and scary time of our lives. (This was about a year ago.) Since then we have tried many other substances in minute quantities--like half a tablet of MDMA, LSD, mushrooms, etc.--but always with our MAO fully inhibited. For the time the MAO is inhibited, we have equal amounts of the substance to give each one of us equal effects. Even Bob is now on the same drug dosage; his problem was that even the double P. harmala dose was not enough. We now use Moclobemide, which is much gentler on the stomach, and easier to dose accurately. Caution: with MAO fully inhibited, one MDMA tablet equals about 8-10. It's worth mentioning that the comedown is equivalent to slightly more than the actual amount of drug taken, not equivalent to a comedown that would be expected from the experienced effects. -- Distorted, Australia\rThese comments regarding MAOIs and MDMA are interesting observations. One psychonaut we know of has tried the combination of moclobemide and MDMA 'four to five times without any favorable results.' We've also heard one report of severe adverse effects with this combination. It has been suggested that the order of consumption can dramatically effect the results experienced. However, there is evidence for a disparity of response based on many factors besides individual variation of MAO production. Frame of mind, physical condition, and environment can also play a part. K. Trout responds to this idea of combining MAOIs with MDMA:\rIt seems prudent to suggest preadministration of the MAOI and cutting the MDMA dosage to 10-20% of normal (i.e. 7-20 mg) if people are crazy enough to actually want to mix the two. The problem with making such suggestions is the automatic accusations that this potentially risky behavior is being advocated. Unfortunately some people may indeed try this after hearing about it; in one sense I really am being irresponsible to 'enable' something that I have never and would never try nor ever recommend. I do think it more important to help people minimize possible problems through education and awareness. I'll bet money that these two drugs have been mixed far more than has ever been reported. I certainly don't advocate the mixture, but if people are already planning on taking the mix they should know elements that might help them avoid adverse effects.\rKnow your MAOIs! MAO-a is inhibited by harmaline (Ott 1994) and moclobemide (Roche). While there is evidence that MAO-b inhibitors (and mixed MAO-a & MAO-b inhibitors) may be dangerous in combination with amphetamines (and possibly phenethylamines), we know of no evidence that either amphetamines or phenethylamines are contraindicated with MAO-a inhibitors. This does not mean that this combination is safe--only that we aren't aware of it being shown unsafe. Mescaline and 2C-B have both been combined with MAO-a inhibitors by a handful of psychonauts, and we are not aware of any problems or deaths associated with this practice. Moclobemide has shown a minimal potential for interaction with tyramine, yet hypertensive persons are still advised to avoid large quantities of tyramine-rich foods in their diets while taking moclobemide. We are interested in hearing from anyone who has combined MAO-a inhibitors with phenethylamines (or amphetamines).\rFor further thoughts on individual variation of response to different drugs, we recommend the chapter 'Idiosyncrasy and Pharmacophilia' in Ott's latest book Pharmacophilia or, the Natural Paradises (see review on page 22).</p>"
 ],
 "year": "1998",
 "id": "78044",
 "gender": "Male",
 "views": "9208",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MAOI"
  }
 ],
 "submissionDate": "2009-04-09T07:00:00.000Z"
}
