{
 "title": "Rubbery Abandon",
 "author": "Harmoniousaccord",
 "citation": " Harmoniousaccord. \"Rubbery Abandon: experience with 4-Methylmethcathinone (ID 78080)\". Erowid.org. May 27, 2009. erowid.org/exp/78080",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "85 kg",
 "header": [
  "DOSE: T+ 0:00",
  " ",
  "oral",
  "Alcohol - Beer/Wine",
  "",
  " T+ 0:00",
  " ",
  "oral",
  "Acetaminophen",
  "",
  " T+ 0:00",
  "86 mg",
  "insufflated",
  "4-Methylmethcathinone",
  "(powder / crystals)",
  " T+ 0:00",
  " ",
  "oral",
  "Codeine",
  "",
  " T+ 0:39",
  "146 mg",
  "oral",
  "4-Methylmethcathinone",
  "(capsule)",
  " T+ 0:39",
  "1 glass",
  "oral",
  "Alcohol - Beer/Wine",
  ""
 ],
 "report": "<p>Experienced with a variety of stimulents/empathogens, with perhaps a slightly higher tolerance than average (though it might be that I push it further, ie. I'm greedy). First time with this substance, so treading lightly.</p><p>Set: Had about half a bottle of wine (15%alc) and feeling good. A few jitters of anticipation. Also consumed three pain killers approx three hours before for a tooth ache - contained paracetamol and codeine phosphate (36mg of the latter all up).</p><p>Setting: Late morning, with my brother in a comfortable environment.</p><p>I've heard good things about this substance when insufflated, so I tried this route first. Measured 86mg and separated into two roughly identical lines. Also measured a further 146mg and readied it in a gel cap.</p><p>00:00 Insufflated one line. It burned a little, but I was expecting that having read a few reports. It wasn't as bad as I'd braced myself for.</p><p>T+00:01 Insufflated second line with other nostril. My eyes watered this time. I should point out here, that my nasal absorption rate seems low with cocaine, and that might carry over to this substance.</p><p>T+00:03 The taste has hit the back of my throat and my nose is running.</p><p>T+00:05 Ever so slightly off kilter. Feel slightly zonked, may be placebo.</p><p>T+00:09 Feel a noticable increase in the speed of my thought processes.</p><p>T+00:11 Was expecting more euphoria (imagining that it would hit pretty quickly with a nasal administration). Nostril burn still present though diminishing.</p><p>T+00:12 Notice a veering sensation, as if my mind is moving sideways without a corresponding movement from my body. Also notice that my toothache, which was coming back, has disappeared. Increased awareness of smell.</p><p>T+00:14 Eyes constricted if anything at this point.</p><p>T+00:15 Slight dizziness with a noticable shift in awareness. Feel slightly distanced from my physical self.</p><p>T+00:18 Urge to document this is quite strong. Loosening of the bowels. Thoughts are becoming clearer/sharper.</p><p>T+00:20 Nasal burn almost unnoticable now. Feeling comfortable at this stage. A relaxed stimulation. Still no euphoria or empathy.</p><p>T+00:22 Doing everything faster, not in a manic way, it feels normal and easy to move fast. I go have a shower.</p><p>T+00:28 Noticed an increase in tactile sensation whilst showering. Eyes are open wider that normal but still no dilation.</p><p>T+00:29 Not happy with my dose. No indication this will get any stronger. Will redose in ten minutes if no progression before then. Heart rate is faster though, definite CNS stimulation.</p><p>T+00:39 Decide to take the oral dose. I wash the 146mg gel cap down with a beer. Feeling a little disappointed with this substance at this stage. The early promise never seemed to eventuate.</p><p>T+00:50 Finished beer. Taste was ok, and reasonably enjoyable. I'm not too inclined toward conversation at this point.</p><p>T+01:12 Over the last few minutes I have noted a very good increase in euphoria and empathy. Feeling very nice. The skin on my forearms feels hot, but not uncomfortably so.</p><p>T+01:12-2:24 At this time I became incredibly engaged in free flowing conversation with my brother (who tells me my pupils are 'f'ing enormous'). Though he hadn't taken any meph, he was as forthcoming in the conversation as I was (contact high?). The feeling was comparable to my first MDMA experience at a lower volume (I have a feeling this is only due to the low dose). Completely in control, but completely open at the same time. There was no topic too taboo.</p><p>T+02:24 The come down is swift! I could actually feel it receding. It left me feeling a bit empty. One minute I'm as open and sociable as I've ever been, and the next I'm not far from my normal self. I was mindful of the many reports out there that claim fiending is a big part of the meph experience, so I consciously avoided any thoughts of redosing.</p><p>T+03:00 (approx) Still an underlying stimulation free of any 'higher calibre' effects. The decline is enormously more gradual for the stimulative qualities, but this residual is such a paltry substitute for what has been and gone that I find it hardly worth my attention/enjoyment.</p><p>Summary: A very nice substance for me overall. My elocution was remarkably enhanced, communicative centers were gaping wide, very comfortable and relaxed stimulation, empathy was significant (even though the 'magic' has long since departed my MDMA experiences). Comedown was not painful, just so swift it left a vacuum in its wake. I overindulged in MDMA when I was first introduced to it, and now I may as well have three caffeine drinks as take a pill. This substance feels (for me) like its effects could be similarly degraded with over-use. I'll be abstaining as much as my will permits.</p>",
 "year": "2009",
 "id": "78080",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-05-27T07:00:00.000Z",
 "views": "39794",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  },
  "1": {
   "time": "",
   "amount": " T+ 0:00",
   "administration": " ",
   "substance": "oral"
  },
  "2": {
   "time": "Acetaminophen",
   "amount": "",
   "administration": " T+ 0:00",
   "substance": "86 mg"
  },
  "3": {
   "time": "insufflated",
   "amount": "4-Methylmethcathinone",
   "administration": "(powder / crystals)",
   "substance": " T+ 0:00"
  },
  "4": {
   "time": " ",
   "amount": "oral",
   "administration": "Codeine",
   "substance": ""
  },
  "5": {
   "time": " T+ 0:39",
   "amount": "146 mg",
   "administration": "oral",
   "substance": "4-Methylmethcathinone"
  },
  "6": {
   "time": "(capsule)",
   "amount": " T+ 0:39",
   "administration": "1 glass",
   "substance": "oral"
  }
 }
}
