{
 "id": 7810,
 "title": "Aww...Nothing at All",
 "date": {
  "submission": "2005-11-10T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Amabir",
  "gender": "Female",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Lactuca - L. virosa",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:15",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Poppies - California",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:20",
   "amount": "3 joints/cigs",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": ""
  }
 ],
 "report": [
  "10:00pm - smoked a hand-rolled joint of Wild Lettuce. The smoke was quite harsh. I'm a smoker, yet it was almost impossible to hold the WL smoke in for even more than a few seconds. It also burned down very quicky. One well-packed joint only yielded only 3-4 long drags.  I waited a few minutes and nothing. Not even a buzz.",
  "+0:15 - smoked a joint of California Poppy. CP was supposed to sedate me. I should say it didn't do much. The smoke, compared to WL, was much mellower, but still somewhat harsh, and smelled very similar to WL. It burned like a normal cigarette, which was neat. A few minutes after I finished, I felt my eyes became a little blurry. Just a little. And nothing else. I was becoming quite irritated by the lack of results.",
  "+0:20 - smoked 3 joints of Calea Zacatechichi, one after the other (was getting ready for bed anyway)",
  "The smoke proved very hard to hold in. It was harsh, though the taste was not unpleasant. I could hear popping sounds from burning buds. It was weird.",
  "+0:15 - burned my throat raw and ready for bed",
  "I got into bed and closed my eyes. I wasn't feeling anything at all from the  combination. I hoped I'd have a good dream.",
  "Well, I'd hoped in vain.",
  "8:30am - woke up and recalled some of my dreams",
  "I showered and while doing so, remembered most of what I'd dreamed. It had been a normal enough dream, no lucidity, no special insights.",
  "In conclusion, I'd say I get more buzz from smoking the first cigarette of the day. The  feel of the nicotine coursing through my veins and numbing my head a bit.",
  "I'd hate to say Calea doesn't work, but I'd have to say it anyway. Perhaps, next time, I would try an extraction of it instead. As for WL and CP, I'd probably make tea from them in the future."
 ],
 "erowid": {
  "id": "47441",
  "citation": " Amabir. \"Aww...Nothing at All: experience with Lactuca spp., Poppies - California & Calea zacatechichi (ID 47441)\". Erowid.org. Nov 10, 2005. erowid.org/exp/47441",
  "substance": "Lactuca spp., Poppies - California & Calea zacatechichi",
  "views": "19643"
 }
}
