{
 "title": "Serenity, Tranquility, Peace",
 "author": "Sir Psychonaut",
 "citation": " Sir Psychonaut. \"Serenity, Tranquility, Peace: experience with DOM (ID 78100)\". Erowid.org. Oct 23, 2012. erowid.org/exp/78100",
 "substance": "DOM",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "DOM",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2009",
   "78100",
   "Male",
   "",
   "Not Given",
   "Oct 23, 2012",
   "2407",
   " "
  ]
 ],
 "report": "<p>So a few weeks ago I experienced DOM for the first time</p><p>This stuff is pretty heavy, a little rough but worth it. An overwhelming sense of placidity throughout though at some spots it can come off a little menacing. </p><p>At 11:00 a.m. I placed two hits under my tongue and started absorbing the bitter flavor, I waited until the blotter turned to mush then swallowed. At 12:00 a.m. I could feel the calmness begin to engulf me, I get the same feeling from LSD but with DOM it's the most pronounced aspect of the trip. I started getting very mild visuals but was more impressed with the blissful spell I was under.</p><p>I had a little herb on me and decided to head over to my friends place so we could smoke. When I got there we started listening to some music and talking about how I felt as the piece rotated. We switched seats and I was directly in front of the speakers as we started listening to some sped up meat beat. As soon as I sat down I felt like my body was stuck and I had that feeling of uh oh something's different now- suddenly the music started penetrating every pore on my head, chest and shoulders, (I had never expected something like that to happen and it definitely caught me off guard) the sounds then transformed into different neon colored lasers shooting out of the speakers blowing me away piece by piece, the sounds were totally annihilating me... It was amazing... I remember thinking 'wow... So this is what it's like to be assaulted by sound waves.' vibrations resonating through my tissue... Ohhhhhh</p><p>I've never experienced anything like that... It was kind of frightening at first but I relaxed when I told myself 'it's ok, you're fine, everything is alright.' </p><p>As the music continued I could not contain my laughter.</p><p>Stepping outside was glorious and a little walk was truly refreshing. Colors seemed brighter, or like they've always been that radiant I just take them for granted or fail to notice. </p><p>The visual distortions were still there but I didn't really pay them much attention... I was caught up in the overwhelming p e a c e</p><p>The sun started going down and I went home and took a shower which felt incredibly soothing... </p><p>I dried off and felt cleansed. The trip faded away as the night went on.</p><p>It was a good trip, I don't think I'll ever forget the 'Audio Assault' I received :)</p><p>DOM is unusual, like a cold chill that somehow makes you feel warm.</p>"
}
