{
 "id": 7818,
 "title": "Seamless Dreaming",
 "date": {
  "submission": "2007-04-05T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Simex",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "IV",
   "substance": "Lorazepam",
   "form": "liquid"
  }
 ],
 "report": [
  "I had been driven to the ER by my girlfriend because of some severe stomach pain I had been experiencing. The doctor thought I might have apendicitis, and told me I needed a catscan. For those of you that don't know, a catscan requires an IV so they can inject you with a radioactive dye that shows up on the scan. At the time, I was terrified of needles, so I told the doctor this, and he advised I be given a sedative, Ativan.",
  "The Ativan was added to my IV immediately after the IV was inserted, I didn't note the dosage since I was freaking out at the time. Within a few minutes the drug started to take effect and I had calmed down considerably. At first it was just a calming euphoria, no fogginess or intoxication, very pleasant.",
  "After about a half an hour things started to get weird. I fell asleep and had a very vivid dream. In the dream I was holding one of those orange phones the linemen use to test the lines. When I woke up from the dream the transition from dream to reality was seamless. It's hard to verbalise what this was like exactly, but after I was fully awake I could still feel the phone in my hand, then when I realised it wasn't really there, it dissolved from my grip.",
  "From this point on I felt like I was dreaming, and kept falling asleep and waking up in this seamless manner. At some point my parents showed up at the hospital, it seemed like they had just materialised miraculously.",
  "I don't remember being wheeled into the catscan area, but apparently I was. This is where the dream state turned bad. In the room outside the catscan room there were other patients on beds waiting to get their catscans. I thought they were zombies, I must have heard moaning, and I closed my eyes thinking that they wouldn't be able to see me.",
  "After the catscan I was wheeled back to my room where my girlfriend and parents were waiting to take me home. I insisted on driving myself home, even as I stumbled out of the hospital. At the time this was occurring I was not aware of my intoxicated state; Ativan was very much like my experiences with LSD in this way.",
  "The rest of the day is very foggy in my memory, and there's lots of blank spots. I don't remember being wheeled through the hospital. I don't remember putting my clothes back on after i took the hospital gown off. I had my mom get me a burger at Wendy's, but I don't remember eating it. I don't remember going to sleep, but the next morning I woke up in my bed with a pair of boxer shorts on over a pair of underpants.",
  "It was only the day after that I realised how screwed up I was. I also had an overwhelming feeling that I NEEDED to take Ativan again. The only time I've had a feeling like that was after I first smoked opium. Since this experience I've taken Ativan once more preceeding a surgical procedure, this was in pill form, and the effects were nowhere near as intense."
 ],
 "erowid": {
  "id": "47484",
  "citation": " Simex. \"Seamless Dreaming: experience with Lorezapam (ID 47484)\". Erowid.org. Apr 5, 2007. erowid.org/exp/47484",
  "substance": "Lorezapam",
  "views": "19776"
 }
}
