{
 "id": 7824,
 "title": "A Day of Double Dosage",
 "date": {
  "submission": "2006-07-07T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Funkee",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "4-HO-MiPT",
   "form": "(capsule)"
  },
  {
   "time": "6:00",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "7:00",
   "amount": "3.0 mg",
   "administration": "insufflated",
   "substance": "4-HO-MiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "7:15",
   "amount": "4.0 mg",
   "administration": "insufflated",
   "substance": "4-HO-MiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "7:50",
   "amount": "6.0 mg",
   "administration": "insufflated",
   "substance": "4-HO-MiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "8:15",
   "amount": "6.0 mg",
   "administration": "insufflated",
   "substance": "4-HO-MiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "8:15",
   "amount": "1.0 mg",
   "administration": "sublingual",
   "substance": "4-HO-MiPT",
   "form": "(capsule)"
  },
  {
   "time": "11:00",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "11:40",
   "amount": "1.0 mg",
   "administration": "sublingual",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Around 4 o'clock, Z, R and myself ingested 20mg each of 4-HO-MiPT. Others consumed theirs 30 minutes later.",
  "T+0:05 - Feeling a little odd, whether or not its placebo I can't identify.",
  "T+0:20 - Okay things are feeling quite weird possible +1",
  "T+0:30 - Visuals are starting, slight morphing and tingly body sensation, difficult to speak.",
  "T+1:00 - We head back to Z's room to smoke, we can't decide whether or not to smoke outside or inside and change our minds very often. Significant +2",
  "T+1:35 - We leave the room and head out to the forest where we smoke.",
  "T+2:00 - Looking back I think we were peaking here, kept hearing voices and cars driving by, getting paranoid. Perhaps briefly reaching +3 out in the nature, and soon drop back to a +2",
  "T+2:15 - We decide to go back as it was starting to get dark. I can't feel my hands, and my balance is askew.",
  "T+3:00 - Z and R go to their room and I join D and P at theirs. Some significant back pain and slight fatigue, we relax and put on some South Park DVDs. I'm surprised I can follow the story line.",
  "T+5:00 - Returning to base, visuals are pretty much gone, not much more significant than mundane hppd.",
  "T+5:30 - I have a strong headache, take 800mg Ibuprofen. Helps somewhat but doesn't relieve it entirely.",
  "T+6:00 - Have about 3 beers.",
  "I decided to see the effects of insufflated 4-HO-MiPT.",
  "T+7:00 - I open my last capsule and insufflate 3mg.",
  "T+7:05 - Possible alerts",
  "T+7:10 - Slight burn",
  "T+7:15 - +4mg to a total of 7mg. My ears feel clogged, when I speak the chair vibrates deeply.",
  "T+7:20 - My face feels numb. No initial burn after insufflated, drip burns, only lasts 4-5 minutes.",
  "T+7:22 - Definitely a +1",
  "T+7:30 - Slight nausea, could be in addition to the beer.",
  "T+7:50 - +6mg insufflated reaching a total of 13mg. Burn is significant, drip not yet noticeable.",
  "T+7:52 - Drip begins to burn. I gag a bit and have something to drink.",
  "T+7:57 - Reached a +2, visuals begin to appear",
  "T+8:15 - +6mg insufflated, for 19mg total, I guess the remaining 1mg weighed out was stuck to the walls of the capsule so I sublingually take the cap, and let it melt.",
  "T+8:25 - +3, visuals, not as powerful as earlier in the day.",
  "T+9:30 - Steady +2, brief +3 at peak around T+8:40. No body load as there was earlier, but I can't pinpoint it to the beer or the method of ingestion. Trembling noticed as earlier through oral ingestion.",
  "T+11:00 - Slowly edging back to base, smoke 2 hits of good pot and brings the trip back up to full scale.",
  "T+11:40 - Interesting but I am awfully tired with little sleep recently, I take 1mg sublingual melatonin to help me get to sleep tonight before I hit a quick shower.",
  "T+12:20 - WOW, fully immersed in the dark room visuals, slightly regret taking the melatonin, this takes me to a +3 and let's see if some music can it beyond it. Report in the morning!",
  "Overall it was quite a day, I don't think I reached a +4 but I was fully immersed in a cartoon-style world with amazing visuals, much different than earlier. Auditory hallucinations were significant, shower water felt really nice. Fell asleep probably around 6:30 AM. Long day.",
  "But smoking pot for me on a psychedelic produces some unique eye pain.",
  "I found it very fast and significant on 2 strong tabs of LSD and some other psychedelics. It wasn't overwhelming today, but the feeling sends shivers down my back and it really ,really hurts. Downsides tonight were back pain, fatigue, and my eyes!"
 ],
 "erowid": {
  "id": "47512",
  "citation": " Funkee. \"A Day of Double Dosage: experience with 4-HO-MiPT (ID 47512)\". Erowid.org. Jul 7, 2006. erowid.org/exp/47512",
  "substance": "4-HO-MiPT",
  "views": "13854"
 }
}
