{
 "title": "Light-headed and Shaky",
 "author": "lucy",
 "citation": " lucy. \"Light-headed and Shaky: experience with DHEA  (ID 78268)\". Erowid.org. Apr 20, 2009. erowid.org/exp/78268",
 "substance": "DHEA ",
 "bodyweight": "120 lb",
 "report": "<p>I am  a 43 year old female and generally in good health; I go to the gym and have a very good diet to which I add supplements. Unfortunately I have been experiencing  a great decline in my libido, something that is having an emotional toll on my life and although having consulted a doctor on my hormone levels to see if I was producing enough testosterone I was dismissed by him because I wasnt trying to have a child and evidently women dont need a robust libido (very old-fashioned indeed!). Consequently I stopped talking about it but I did continue to research over the internet and that is how I discovered DHEA.</p><p>There was so much written pro and con that it took some time to make a decision but it seemed many people were taking it with positive results so I purchased low dose capsules (5 mg) and tried it.  After my first dose I felt strange, I felt overheated but my skin was cold and clammy, I began to sweat.  I took my blood-pressure and it was normal but my resting heart rate was 104.  After some time it went away and then I began to feel cold but much better so I went for my daily gym routine and had an enormous amount of energy. Later when I tried to get to sleep I noticed that I was feeling light-headed and shaky even though I was laying down to sleep and I was awake as if I had taken some speed.  I called my mother who is a registered nurse and she informed me that I shouldnt be taking DHEA at all because I smoke and taking DHEA as a smoker can cause blood clots in women.  This was a piece of information I had not read in my research, I immediately took two aspirins and then vowed never to take the drug again unless recommended and monitored by a medical physician.  DHEA may indeed yield positive results but its not a harmless over-the-counter supplement as its being advertised, there can be dire outcomes even at low doses!</p>",
 "year": "2009",
 "id": "78268",
 "gender": "Female",
 "timestamp": "2009-04-20T07:00:00.000Z",
 "views": "11355",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "DHEA",
   "form": "(capsule)"
  }
 ]
}
