{
 "title": "Baby Steps Through an Infinite Barrier",
 "author": "Busrider",
 "citation": " Busrider. \"Baby Steps Through an Infinite Barrier: experience with LSD, Ketamine & Cannabis (ID 78287)\". Erowid.org. Sep 5, 2009. erowid.org/exp/78287",
 "substance": "LSD, Ketamine & Cannabis",
 "bodyweight": "125 lb",
 "report": "<p>Set and Setting:</p><p>A regional outdoor camping and dancing event. This group of people gathers every month or two to throw down a good party. The mindset was positive, fed by the good vibes projected by everyone present. The group of people was my burn family, and everyone knows everyone fairly well.</p><p>Experience level:</p><p>I regularly (once every month or two) participate in some form of psychedelic activity. Lately, I have been doing this mostly with MDMA (pure), but the effects have started to drop off just that little bit and I thought it was time to take a break of longer. I've done MDMA 18 times over the course of my three years of psychedelic use. LSD and DMT have been great to me the dozen or so times I have been able to get a hold of them. I have not had any notably positive experiences with mushrooms or heavy stimulants. Research chemicals remain mostly untouched.</p><p>The Trip:</p><p>At 20:20 on 18 April, I intended to take 250g of LSD to trip into Bicycle Day, in typical fashion. [Erowid Note: Claims of measured microgram dosages for LSD are usually unsupported. Quantitative measurements for LSD are very difficult to do and cannot be done casually. Without further detailed information about how the measurements were derived, it is reasonable to assume that most statements of microgram dosages of LSD on blotter or in microdots are either misinformed or overstated.]  By 21:00 I felt ill to my stomach, coming up hard, but I knew I had nothing to vomit. I drank some water, trying to quell my stomach, but this was instantly rejected. I 10 minutes or so, I tried to get fluids into my body but this repeatedly failed over the course of two hours. The world was spinning and I could not tell which way was up. All I could think about was that I needed to get fluids and electrolytes into my body, to give myself something to burn.</p><p>The headspace of the trip was fairly interesting with heavy spinning patterns and thoughts about evolution, survival and how we've come to this point in our existence.</p><p>I was still trying to make this a good experience, but the physical symptoms overwhelmed me. Starting to think I might just be 'that kid at the rave that dies from dehydration', but I pushed through it, trying to figure out the easiest way to get what I needed into my body. Switching into survival mode, the journey began to find tolerable liquids, something with substance, but light. I decided to take a walk, because I knew this was not going to come to me.</p><p>At 23:00 I ran into the person who had given me the '250 mics'. He hesitantly asked:</p><p>'Hey man, did I accidentally give you the white ones?'</p><p>'Yes, why?'</p><p>'And you ate all three?'</p><p>'Yes, why?'</p><p>'Those were my personal ones, I dosed those at 300 a piece'</p><p>'That explains a lot.'</p><p>After learning of the actual dose, I needed to find something to level me off. As I did not want to go to sleep in such a state of dehydration, sedation by xanax or trazodone was out of the question. I tried some marijuana, as this generally works for nausea. I cough and gag, take a sip of water and vomit immediately.</p><p>Vomiting another time against a tree at around 00:10 on 19 April, I was approached by one of the long-time veterans of the group, and asked if I wanted just a little bit of ketamine to relax my body and stop the convulsions. I felt that this was the best option out of the few I was considering. Ketamine is something I had little experience with, but the few times had been completely relaxing, and I could see how this would help my situation greatly. She takes me to the magic bus and measures out a 50mg bump.</p><p>About five minutes after the drip passed, I was overwhelmed by relaxation and was offered a quart of orange gatorade. Sitting down, the gatorade slowly makes it into my system, and I feel better as the ketamine begins to take effect. I find some company, talk through my trip, working out a lot of existential issues. I give my thanks to the orange gatorade bottle, as it is now empty. This is a good thing and my fears of death-by-dehydration dissipate. My body is fueled. The water bottle needed refilling and my companion suggests that we talk a SLOW stroll around the beautiful landscape.</p><p>Standing on my own two feet again, I feel like I have made it through the storm, and explore the positive side of the night. The K has made the soreness and discomfort in my body vanish, and I can walk and dance again. We go to the bus again because a large party had built up around it. Dancing for the first time after feeling so much in agony was refreshing to say the least, and gaining a new perspective on space, time, and movement was a rewarding experience. I could feel the way my muscles were moving through the space and time. Visually, I cannot explain what was going on, but it was a beautiful fusion of hybridisation of space-time and emotions.</p><p>I was comfortable and finally managed to get more liquids in me with a tiny bit of solid food (bread, cream cheese, and jam). However, the K is beginning to fade, and the nausea is returning. Seeing me start to clench my stomach, my friend offers me another dose, and I take it, as it worked so well the first time. Almost instantly, I'm back on the way to comfort, and we decide to check in with each other every hour or so. The visuals at this point are almost continuously reminiscent of an Escher woodcut, drifting between full black and white and full neon colours. Staircases and columns are imposed over everything.</p><p>Each time I hit the peak, I had new insights, one of which was very useful to my physics thesis. I've been working on this one problem in quantum mechanics of how to tunnel through an infinitely tall yet narrow boundary. A fellow physics major, who was hit by a car in September, and was remarkably able to walk (with the aid of a cane) had a method which had worked for him. 'Baby steps' he says. I though of how he had overcome his 'infinite barrier' of a shattered pelvis, concussion, and a whole mess of related problems. This was ironically the same solution to my problem. Modeling the boundary as a step works, and solves the problem.</p>",
 "year": "2009",
 "id": "78287",
 "gender": "Male",
 "timestamp": "2009-09-05T07:00:00.000Z",
 "views": "4306",
 "dose": [
  {
   "time": "0",
   "amount": "900 ug",
   "administration": "sublingual",
   "substance": "LSD"
  },
  {
   "time": " T+ 2:40",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": " T+ 3:50",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Ketamine"
  },
  {
   "time": " T+ 5:20",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Ketamine"
  },
  {
   "time": " T+ 6:50",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Ketamine"
  },
  {
   "time": " T+ 8:20",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Ketamine"
  }
 ]
}
