{
 "title": "Codeine is Chill",
 "author": "Pookyhead",
 "citation": " Pookyhead. \"Codeine is Chill: experience with Codeine (ID 783)\". Erowid.org. Aug 4, 2000. erowid.org/exp/783",
 "substance": "Codeine",
 "bodyweight": "108 lb",
 "report": [
  "<p>After doing a thorough research about codeine in Erowid's vaults, I decided to try out some codeine pills I've been stashing since I got my wisdom teeth pulled a while back. A friend called me up and wanted to hang last night, so I decided it would be a good opportunity to try it out in a safe environment. I had a mostly empty stomach and had not done any other chemicals for about two weeks. I took one and a half pills (~24 mg codeine) at 10:00 p.m. and was on my way to my friend's, about 30 minutes away. There were no immediate significant symptoms...the trance sounded really good and I was in high spirits, and it was a little hard to drive, but I'm pretty sure it was because I wasn't wearing my contacts.",
  "By the time I got to my friend's, however, I felt distinctly different, although I couldn't quite put my finger on what the feeling was. I suppose I felt more at ease, and a little giggly. I was also a little out of it, and when I went to call my friend to come down and let me in, I couldn't remember his number at first. I found this extremely funny; I guess I felt kind of high, but not paranoid. Buzzing a little. Upon reaching my friend's, I took another half pill (~8 mg codeine). I also promptly began to drink a moderate amount of Boone's, a strawberry flavored sparkling alcoholic beverage. The amount i consumed would not get me wasted had I drank it by itself, but perhaps would have buzzed me a little. My friend and I played several games of darts, during which point the shit really started kicking in. The feeling was similar to other things I've felt before, but at the same time entirely different. It was like being wasted drunk, but without the sloppiness and loss of balance. I was actually doing quite well at darts, beating my drunk (and more darts-experienced) friend two out of three times. I had never played darts before. There were no visuals or zone outs, although my surroundings seemed more interesting.",
  "Euphoric moments came and went a couple of times, very mild ones, nothing like with ecstasy. Within a couple of hours it was getting quite intense. It felt like I had a mad urge to close my eyes, but not to sleep...just to have them closed. We also began to talk about drug experiences, and i was finding it very difficult to articulate my words. Suddenly I found myself gong through what I guess was the 'peak' of the experience: I had slight tremors from what felt like nervous energy, I was a little cold, and my jaw actually started to chatter! I was excited because this moment was similar to the ones I frequntly encounter when doing X. It actually felt like quite an overload on my brain, like that 'I can't take it anymore' feeling one tends to get on LSD. The next thing I know, BOOM!, it was going down. I almost felt completely sober for a moment, but then i realized I was still very dizzy. Now it just felt like I was drunk. We were up for a little longer, and I passed out at about 4:00 a.m.",
  "I began to wake up around 7:00 a.m. but would keep passing out for a couple more hours. I finally woke up for good at around 9:30 a.m., feeling noticeably nauseous. I drove home and felt nauseous until about 1:00 p.m. I went easy on my stomach, drinking a little juice and eating small things, until I finally had soup around 2:00 p.m. and felt ok. As I am writing this at 2:30 p.m., I have a little bit of a headache and feel a little tired, and my stomach still feels a little weird, but nothing too bad. Overall, it was an interesting experience, but not one i would go out of my way to do again. Personally, I would always prefer a good roll. But if you want to get fucked up and relax, codeine is chill. Just watch the dosage, because I am under the impression that had i taken any more, I would have thrown up all over the place. Enjoy safely, peace out.</p>"
 ],
 "year": "2000",
 "id": "783",
 "views": "69002",
 "dose": [
  {
   "time": "0",
   "amount": "24 mg",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:45",
   "amount": "8.0 mg",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2000-08-04T07:00:00.000Z"
}
