{
 "title": "Don't Mess with Coricidin",
 "author": "Anonymous",
 "citation": " Anonymous. \"Don't Mess with Coricidin: experience with DXM (with CPM) (ID 7830)\". Erowid.org. Aug 12, 2003. erowid.org/exp/7830",
 "substance": "DXM (with CPM)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "240 mg",
   "oral",
   "DXM",
   "(pill / tablet)",
   "",
   "32 ug",
   "oral",
   "Chlorpheniramine Maleate",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>All right, I have done a lot of researching on the internet about DXM and stuff, so one night I decided to go down to our fry's and get some. I had done Robitussin and stuff before, but I couldn't handle the taste. I remembered somewhere it said one of the products was really bad for you but I couldn't remember; I thought it was the Contac cold tabs. So I got the Coricidin cause it had 30 mg of DXM in it. So I wait till 12 and pop 8 of them. I figure since I've had doses of about 200 mg of DXM before that this would just be like a tipsy, fun experience. I was wrong.</p><p>It didn't start to kick in till about 2 in the morning. I started to lose concentration while on the computer. I couldn't focus on anything for a long period of time. Then I went to go get a drink of water, and when I got up it still felt like I was sitting down. When I walked down the hall everything around me was just one big blur except for the object I was looking at ahead of me. So right now I'm thinking, Hell yeah, this is pretty cool.</p><p>Eventually the trip was beginning to get more and more intense. Suddenly my heart beat jumps up to twice it's rate, and my breathing is so heavy. Right there I thought I was gonna die. I tried to calm down by listening to some light music, but that only helped for a couple minutes. I needed to go to the bathroom really bad so I got up, and I still felt like I was sitting down. I walked to the bathroom, and I almost passed out. Everything got really fuzzy, and when I was standing, I heard this loud POP! I didn't know what it was. It sounded real, but it sounded fake. I kept hearing these metallic sounds, and by now I was freaked out. So I went back to the computer and was telling my friends how freaked out this was. By now I was at the peak of my trip and it was about 4 in the morning. I eventually calmed down a little bit, and thought I could sleep. So I told my friend I was all right, and I went to bed. I kept waking up, and then my room started to shake, and my mind was going insane.</p><p>I said I can't handle this and got back on the computer. My friend was still on, and I asked him how long I was asleep for. He said 5 minutes. I was like what the hell! Now I couldn't even move thinking that if I did, it would mess with something in my body and I would die. I was shaking like crazy, and I kept hearing all this shit. My room is really dark because I put aluminum foil over the windows to keep it cool, so at 5 AM I decided I would go out and get some water even though I thought I would die because I would pass out and stop breathing.  So when I went out of my room it was light out, and that all of a sudden made me calm. Like I was out of a bad dream. My heart still hurt but I made it to bed. It's 3 days after I did that and my heart still hurts, and it hurts when I take big breaths.</p><p>My advice to anyone is don't mess with Coricidin. DXM is fine in other forms, just don't go crazy with it. It seriously isn't worth it at all. The whole time I wasn't enjoying my high at all. I was worrying if I was gonna die. I hope that my body isn't really messed up because of that. I've read all the bad trips about the Coricidin before I did this, and I thought, Oh, their body just reacted bad. Everybody that I've known that has done that brand has the same story. My one friend thought he was dead. Stick to Robitussin and Vicks or whatever. DON'T DO CORICIDIN.</p><p>Thanks. Be safe and have fun.</p>",
 "year": "2001",
 "id": "7830",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-08-12T07:00:00.000Z",
 "views": "47784"
}
