{
 "title": "Psychosis",
 "author": "Some Guy",
 "citation": " Some Guy. \"Psychosis: experience with MDPV (ID 78382)\". Erowid.org. Mar 22, 2010. erowid.org/exp/78382",
 "substance": "MDPV",
 "bodyweight": "160 lb",
 "report": "<p>I found it odd there wasn't a vault for this chemical. That should have been my first clue about this stuff. It was so cheap though, I couldn't resist. A lot of people on the internet were saying it was weak and not to do it, so I thought it wasn't going to be a big deal.</p><p>Couldn't find anything really about IV dosing, so I decided to try that when the intranasal thing wasn't doing it for me. It gave me a rush, I was surprised! I was wired, and feeling really good. So I did more, a lot more.</p><p>In less than 2 days (even with sleep) I developed psychosis. I have a lot of experience with stimulants, and have tried over sixty types of drugs and RCs with only one psychotic episode (did coke every day for a year and took 3 or 4 phentermine tablets that night) I started seeing people, mostly police officers outside my windows. At the time, I was selling drugs and had just sold some to a friend of a friend. I started thinking that I sold to a narc and I was in deep shit. I've never been so paranoid in my life!</p><p>There were cops everywhere. Then a special forces team came in at night and put their guns to my head. There were a lot of auditory hallucinations such as police radios and people (sometimes people I know) talking to me very clearly. It all was very real and vivid. I think this stuff may cause brain damage. At the moment, I've been experiencing extreme short term memory loss and balance loss. It has affected my speech as well, with sentences coming out jumbled or not making any sense at all. There's a lot more that happened but it is very difficult to write at the moment.</p><p>In short, MDPV is incredibly addictive for me and caused horrible side effects at high doses. I've done pretty much every drug in the book, but nothing fucked me up quicker than MDPV.</p>",
 "year": "2008",
 "id": "78382",
 "gender": "Male",
 "timestamp": "2010-03-22T07:00:00.000Z",
 "views": "22490",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "IV",
   "substance": "MDPV",
   "form": "(liquid)"
  }
 }
}
