{
 "id": 784,
 "title": "Not Your Average Sleeping Pill",
 "date": {
  "submission": "2004-02-10T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Bella",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "  I began the night by taking one Ambien with a few beers. My friend had given it to me stating that it was 'not your average sleeping pill'. I was rather eager to try it since I have always been a 'pill-lover'; however, I was not expecting a great deal from a sleeping pill. In less than fifteen minutes, I felt a bit of a body buzz and a physical and mental calmness. Unfortunately, it was very mild so I decided to ingest 2 more pills.",
  "My body relaxed and I became somewhat 'wobbly'. It was decisively different than an alcohol high. After 2 more pills and several beers, I was somewhat upbeat but had a very soothing body high. My vision became more binocular and impaired; it was difficult to maintain fixed concentration on anything concrete. Instead, my thoughts migrated to other things and I felt peaceful. Not euphoric, but calm. My attention to the environment and my judgement were clouded but my thought processes as a whole were more active. I cannot imagine why this is a sleeping pill, because I had trouble sleeping, as my mind was too busy thinking."
 ],
 "erowid": {
  "id": "12125",
  "citation": " Bella. \"Not Your Average Sleeping Pill: experience with Zolpidem (Ambien) & Alcohol (ID 12125)\". Erowid.org. Feb 10, 2004. erowid.org/exp/12125",
  "substance": "Zolpidem (Ambien) & Alcohol",
  "views": "34073"
 }
}
