{
 "id": 7842,
 "title": "Tripping with the Nanny",
 "date": {
  "submission": "2001-01-20T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Catfish Rivers",
  "gender": "Male",
  "weight": 127
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "6.0",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "5-MeO-AMT",
   "form": "powder/crystals"
  },
  {
   "time": "7:00",
   "amount": {
    "number": "1.0",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Clonazepam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Having read about possible MAOI activity from 5meo-amt, a friend and I fasted for over 12 hours before taking the gel caps filled with the tannish powder. This began around 4pm. It was snowing very lightly outside, our moods were pretty good and the house was empty besides ourselves. Within 30-40 mins. I could feel my 'trippin' face,' begin to emerge. My cheeks felt as if they were being pulled upwards by invisible strings. A glance at my friend showed me that he too was starting to feel the first effects.",
  "At this point, the girl friend of my friend's roommate (who wasn't home) stopped by. This put my ACT-SOBER sub-routine into action, as I only met this girl once before in my life. So we all sat around the trance machine and watch two excrusiating episodes of 'The Nanny' in a row. Take my word for this, 'The Nanny' is the ultimate anti-trip. Hospitals should administer 'the Nanny' to ER overdose patients to bring them back to a sober state.",
  "Anyhow, it's around 5:30 when my friend and I decide to hide away in his room with some cds and Anime to watch. At this point we both described feeling extremely stoned/high from the drug, the mindset was definitely trippy (in that we could feel the chemical change, but little in the way of increased metal activity was noted) and euphoric but there were only slight visual distortions. Playing guitar came easy and fluidly throughout the evening, and was probably the only activity this compound agreed with 100% all night for me. I began to feel a mounting pressure in my head, as if my skull had a giant gas bubble trapped in it. It wasn't comfortable, but I could forget about it with some effort. This state lasted for nearly 5 hours before we decided to pop some clonazepam (1 mg. tab) to alleviate muscle rigidity in the face and neck (lots of jaw clenching).",
  "We stayed up for another two hours trading bong hits back and forth and finally gave in at about 2 am, still tripping but not really worth staying up for. All in all, I think the body load associated with this drug is a bit more than I'd like to deal with. I was dissapointed with this compound, although I will try it again at a slightly higher dose."
 ],
 "erowid": {
  "id": "4759",
  "citation": " Catfish Rivers. \"Tripping with the Nanny: experience with 5-MeO-AMT (ID 4759)\". Erowid.org. Jan 20, 2001. erowid.org/exp/4759",
  "substance": "5-MeO-AMT",
  "views": "14580"
 }
}
