{
 "title": "Before and After Prozac",
 "author": "DAVE",
 "citation": " DAVE. \"Before and After Prozac: experience with Cannabis (oral) & Fluoxetine (ID 78469)\". Erowid.org. Sep 12, 2011. erowid.org/exp/78469",
 "substance": "Cannabis (oral) & Fluoxetine",
 "bodyweight": "165 lb",
 "report": "<p>I have been using weed almost daily for the last year or so to deal with OCD, moderate anxiety and insomnia. Several weeks ago I was prescribed Fluoxetine HCL 10mg x2 daily (generic for Prozac) for these symptoms. This has moderately altered my experience with cannabis, which I will detail below.</p><p>Typical dose: About .8g of mid grade weed, made into hash oil, then baked into brownies.</p><p>Before Prozac I would get slightly intoxicated, slightly unmotivated and extremely tired at this dose. Moderate visual scrolling, moderate euphoria, time sense altered. Since I was depressed, I would get an intense shot of emotions ranging from paranoia to empathy to increased appreciation of things. Sometimes at higher doses I could get closed-eye visuals (kaleidoscope vision).</p><p>After Prozac I get moderately intoxicated, very unmotivated and only slightly tired. Visual scrolling, time dilation, closed-eye visuals and other psychedelic effects are greatly reduced. Almost no increase in emotions, and little euphoria. There's a new effect in that I feel pressure in my head. I feel as if it's made me stoned and stupid rather than high and mind expanding. There also seems to be more hangover (bad short-term memory, lethargy, lack of motivation) than before.</p><p>I don't smoke it often, but the one time I've tried so far it has had less effect than before.</p><p>Although the difference isn't HUGE, the lack of increased emotions along with the help that Prozac provides me has encouraged me to quit eating pot brownies on a regular basis. Prior to this I had never had trouble when withdrawn from THC, but from 3-5 days after discontinuing use I feel mentally distressed. Every time I return to it to finish off my stash I go through this withdrawal again, even if I only use it once. I think after this is gone I will stop for good, except possibly on rare occasions.</p>",
 "year": "2008",
 "id": "78469",
 "gender": "Male",
 "timestamp": "2011-09-12T07:00:00.000Z",
 "views": "8980",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  }
 ]
}
