{
 "id": 7850,
 "title": "Reality Split at the Doorway",
 "date": {
  "submission": "2007-05-26T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Hamilton",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "125",
    "unit": "mg"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "Reality Splits at the Doorway",
  "Let me begin this by telling you a little bit about me.  I have not beein using drugs for too long, and don't really consider myself a druggy.  I'm always interested in something new, particularly ethnobotanicals.  In the past i've used the following: marijuana, opium, poppy-pod tea, hydrocodone, oxycodone, codeine, propoxyphene, shrooms, iprocin (incredible), tobacco, alcohol, valium, lorazepam, xanax, ephedrine, caffeine (accidental overdose- don't keep caffeine pills in with yer sleepin pills, specially when you dose in the dark...), Kava (also very good), kratom, nitrous.  I'm sure theres somethings I'm forgetting.  I don't think this list will help you, but it seems mandatory now that so many posters include one.  But I feel a little more hardcore. heh.  I know I seem to use mostly opiates and other 'feel-good' drugs, but my main interest has always been in visionary drugs, not drugs to have a good time with.  Actually, I don't drink alcohol or most drugs today just because they lack intellectual properties.  Opiates, though, in proper doses, can be very 'visionary'.  But those doses can be dangerous, I guess.",
  "My first few attempts with salvia were utter disapointments.  In fact, I had mostly given up on it.  But even after 4 months of first trying it, I had high hopes for it.  Or at least for some lucky person who could really get off on it.  The problem was buying poor quality stuff.  Unextracted leaf did little to me.  Maybe nothing.  Still, reading all the reports assured me that Salvia was definitely a powerful, visionary class psychedelic.",
  "On sunday, I found a 10x extract for 10 dollars.  I figured I had 10 dollars to spare and would be paid soon, so I bought it (free shipping closed the deal, ;)  It arrived today, thursday.  Since I wouldn't be drinking (a social faux-pas on campus here), I decided to smoke it.  The friend (J) I thought I'd be smoking it with was going to see his girlfriend so I would be without him.  This would be the first time I would trip with another person who wasn't him.  When I stopped at J's house to find out when he was leaving, he was about to go, so I asked him if he had 10 minutes to spare [I made sure first that he wouldn't be driving.  Driving under the influence of salvia wouldn't be 'difficult' it'd be extremely dangerous].  He said he did when I offered some salvia.",
  "We pulled it out and I informed him that he would be smoking it, since there probably wouldn't be any left when he got back on sunday/monday.  J took two hits of it and tripped pretty hard from what I could tell.  He said he had good visuals, but that the gravity was weird as hell.  Since I had never gotten good effects from salvia, I couldn't understand.  As he was coming down, he said it was a terrible experience and that he never wanted to do it again.  This surprised me.  I'd never seen him have a bad drug experience.  I think he didn't take Salvia seriously.  This isn't 5 minute shrooms.  This is a 5 minute DMT type drug.  His girlfriend then drove me home.",
  "Fast forward 4 hours.  I call another friend S who is at J's house hanging with a roommate of J.  S said he was game to try it.  When I got there, I decided he should go first (okay, I was chicken after J had a bad experience).  He smoked one or two hits of it (small pinches, probably 50-60mg, of 10x).  He said he had a good experience, but not too strong.  I then was up.  I decided that if I smoked just a little, it wouldn't be too bad, I could have an experience like S's and just chill for a bit.  I think I inhaled a little more though and instead of a trip at his level, I went a little bit higher.",
  "Once I exhaled the first hit, I felt like I got hit in the head with a hammer or something.  My head was stuck on some kind of axis, and to move it was like trying to change the direction a gyroscope is spinning.  I wanted to have visuals, so I went and closed my eyes in the stair way.  Nothing, so I went outside where I experienced the salvia gravity.  I felt like I was part of a rubber band, one side pushing me towards the mailbox, the other pulling me to it.  I was pushed the same direction no matter which way I faced, making me question the possibility that its just muscles moving me in a direction involuntarily.  I could easily fight the gravity and walk the other direction, but it was weird.",
  "A little later T came over.  Once T and I smoked joints of unextracted leaf.  He was able to get 'S' or maybe 'A' level effects, so I thought he should try the 10x.  Two hits and he started laughing uncontrollably.  He said that with closed eyes he had crazy visuals, but nothing too intense.  I then decided that now I would take my biggest dose yet, and possibly ever.  I filled the bowl fuller than any time previously (I never ashed the bowl either.  I figured that there might be vape-able salvinorin a in it still, so i should try to save it).  I smoked it, and this time it didn't come on as quick, but it was coming on.  I figured I must have built a tolerance so I would have to take more.  T loaded me up another bowl which I inhaled quickly, but was unable to finish.  As I exhaled I was hit with a brick.",
  "BAM!",
  "Reality was totally different.  I was in a chair next to the walkway between the kitchen and the living room, and where the carpet changed between rooms, there seemed to be two levels of reality. In order to move between the two rooms, I had to move on the reality-plane that was waist high in the living room, essentially swimming in air.  I think this was a result of the salvia gravity that seemed to create a waterfall at that doorway.  I'm not sure though.  It was so incredibly intense.  When I got onto the couch in the living room, I tried explaining what was happening, but I'm sure they couldn't understand me.",
  "Somewhere in my mind I knew I had taken a drug and that was responsible for my state, but it seemed irrelevant, because this was reality and that other place, pre-salvia was not normal.  I remember then standing up and walking around the room for some reason.  The gravity was pushing me, and I remember uttering things like 'Wow, this is fucking intense,' and 'Dude, you gotta come visit me in this place, its fucking incredible.'   I don't usually swear much, but this brought it out of me for some reason.",
  "When I realized that, I also realized that I was no longer Hamilton, I was now the main charachter in Trainspotting.  I then sat down and closed my eyes.  Nothing.  Oh well I thought.  For a bit while sitting down I decided that I caused brain damage and now I'd be stuck in this crappy world forever.  Eh well, I figured if I was brain damaged no one could yell at me, and if they did, I surely wouldn't have to care.  Fortunately I kept coming down and realized how crazy that.  I would say it took another 10 minutes to taper off and then an hour to get rid of this weird tired feeling that came over me.  I think it was my minds way of trying to figure out just what the fuck happened to it."
 ],
 "erowid": {
  "id": "47639",
  "citation": " Hamilton. \"Reality Split at the Doorway: experience with Salvia divinorium (10x Extract) (ID 47639)\". Erowid.org. May 26, 2007. erowid.org/exp/47639",
  "substance": "Salvia divinorium (10x Extract)",
  "views": "2667"
 }
}
