{
 "id": 7854,
 "title": "Best Day of the Year",
 "date": {
  "submission": "2008-01-31T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Merlin",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "sublingual",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "0:20",
   "amount": {
    "number": "1",
    "unit": "repeated"
   },
   "administration": "smoked",
   "substance": "Tobacco"
  },
  {
   "time": "10:00",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "sublingual",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "10:00",
   "amount": {
    "number": "1",
    "unit": "repeated"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "10:00",
   "amount": {
    "number": "1",
    "unit": "glass"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "So, my boyfriend gave me these acid tabs that he had bought but decided not to use because of previous horrible mushroom trips. i had thought about taking it with him but as our shrom trips together had been bad (because he freaked out every time), i went up to portland and took it with a longtime friend of mine. the morning before my trip, i was nervous and excited. i was afraid of having a bad trip and/or throwing up, so i ate a small amount a couple hours before tripping and let it digest.",
  "my friend and i arrived at her house at 1130 AM and drank a glass of emergen-c, a multi-vitamin  drink mix. then we each put 2 tabs under our tongues and left them there for an hour or so, then swallowed them. for the first 20 min.  after taking the tabs we relaxed and smoked tobacco out of her hookah, talked, etc. i started to notice something different within 10 minutes after taking the tab. my body felt warmer than usual and when i shifted my eyes it was a bit shaky, a paisley tapestry on the wall also looked interesting.",
  "after the hookah, i was a bit more relaxed and 20 minutes later noticed my body was now producing excessive amounts of heat. i wasn't really sweating, just felt really hot. i started thinking, 'my body is producing a lot of heat. i just need to get though this state and go with the flow.' it was uncomfortable for a while.",
  "an hour after taking the tabs we went for a walk with a few friends of ours, two who were tripping too and one who wasn't. at this point, i started to really trip. being outside felt new, vibrant, radiant and full of life. i looked around at the trees and grass and felt a sense of deep connection with my natural surroundings. the weather was a bit cloudy. by this time the feeling od hotness in my body had disappeared and i felt slightly more energetic. moving my body felt really good.",
  "after our walk, we went back inside and decided to go for a bike ride. a friend of mine told me to wear her pink sunglasses, which made everything outside look so much brighter and happier. riding my bike wasn't that hard at all, which was a surprise to me. we rode to mount tabor and arrived at a grassy hill overooking the city at the base of the mountain. this place was the most beautiful thing i had ever seen at this point.",
  "the more i laid on the grass there, the more beautiful everything was.",
  "i looked at the formations of clouds in the sky and felt as if i could see everything all at once (probably because my pupils were so dilated). the sky was somehow a part of me at these moments and a few times while i was looking at it it turned into this prismatic image, as if i were seeing it through a kaleidoscope. looking up at the sky and down at the trees, grass and city, and taking each breath with my entire body (or so i felt), there also seemed like there was a spirit around me. i was at one with nature and it was the most amazing thing i had ever experienced. i was also sucking on a lollipop and i imagined i had the earth in my mouth. i also giggled a lot for no apparent reason except the sheer beauty of the experience.",
  "we rode further up the mountain and reached the top. the ride itself wasn't bad at all for me, as i imagined once again that i was breathing with my whole body. when we reached the top, we came to this mossy, grassy forest and another hill  overlooking more trees and city. we spent time at both the hill and the forest, most of the time just sitting there and giggling. my face hurt from laughing so much. i had a few thoughts running through my head all day: 'it's complicated, but it works'. this made sense in every aspect of what i was doing somehow. we watched these yuppies play frisbee and observed how 'painfully sober' they looked. i felt really sorry for them for not experiencing what i was.",
  "i remember feeling like every movement i made was affecting the work around me, like if i shifted my body, something else moved at exactly that moment. i looked around and thought about the evolution of the plants around me and how similar we were to one another. we had just evolved differently becuase of our environment. this experience made me cry a few times because of the sheer beauty and awe of everything i was thinking and experiencing around me. hugging my friends made me cry as well because of the intense love i felt for all of them and how well we all fit together.",
  "after 5 or so hours on the mountain (which felt like a whole day), we rode down the huge mountain and back to my friend's house. by this time i was talking more frequently and feeling slightly less tripped out. we got inside and i had to meet my mom for dinner, which i was then VERY NERVOUS about. i took the bus into the suburbs and tried to think as soberly as possible. we met for dinner with my brother and it went fine as i realized how caught up in their own worlds they were and how much i was in mine, which was FINE by me at this point. the food i had looked really good but i felt extremely full (even though i hadn't eaten all day) and ate a few bites. my mom and i had a talk about responsibility in life and this made me cry. this was actually a really nice bonding experience i wouldn't have had if not on acid.",
  "4 or so hours later, after dinner, i went back to the same friend's house and got there to find a huge party going on. there must have been 10 bottles of champagne going around, chill, trippy music playing in the background and bongs being passed everywhere. everyone there had been just drinking and smoking weed. i took another tab when i got there around 1130 PM and drank a glass or so of wine and had a few hits of weed and hookah. everyone was dancing and grinding on each other and i felt comfortable joining. then somehow people started kissing and touching one another (mainly girls with girls) and this looked like fun to me.",
  "within 20 minutes, clothing started coming off and i started tripping again on my 3rd tab. i had sex with a guy friend of mine there from brazil with everyone else around, getting naked, having sex, going down on one another. he went down on me and while i could feel it, i was more focused on the energies being exchanged between us. i giggled and enjoyed it and made out with a few other boys and girls over the course of the next couple hours. then eventually a few girls and i met in a separate room just to smoke weed and chill.",
  "we then went for a bike ride in the rain (which didn't feel cold at all, even though it was) and i felt so free and happy to be riding. we arrived at a dock by the willamette river and watched the tides flow all around us. this was an amazing thing to witness. the continuity and fluidity was inspiring and gorgeous. there was nothing like it.",
  "eventually my friend and i split from the group and sat on a pier and talked about life together while smoking a bowl. we hugged and laughed together and then when it got too cold, went back and to sleep.",
  "i found it incredibly hard to stop staring at the tapestry on the ceiling and fall asleep, and i think i slept a total of an hour that night. i woke up the next day and proceeded to sleep all day, my body and mind extremely worn out and tired from my experience. however, the bliss i had felt all day carried over into my dazed state the next two days and, 2 nights later now, i still feel extremely happy about my amazingly wonderful trip. there was nothing that could have made my first trip any better. it was sheer perfection."
 ],
 "erowid": {
  "id": "47666",
  "citation": " Merlin. \"Best Day of the Year: experience with LSD (ID 47666)\". Erowid.org. Jan 31, 2008. erowid.org/exp/47666",
  "substance": "LSD",
  "views": "4213"
 }
}
