{
 "id": 7860,
 "title": "No Effect on Me",
 "date": {
  "submission": "2010-01-08T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "J-mo",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 Tbsp",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "tea"
  },
  {
   "time": "0:00",
   "amount": "5 Tbsp",
   "administration": "oral",
   "substance": "Skullcap",
   "form": "tea"
  },
  {
   "time": "2:00",
   "amount": "5 Tbsp",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "tea"
  },
  {
   "time": "2:00",
   "amount": "5 Tbsp",
   "administration": "oral",
   "substance": "Skullcap",
   "form": "tea"
  }
 ],
 "report": [
  "I've on intensive probation right now, which means that I am on house arrest. I also have to pass 6 random drug tests, so I've been fiening for something to hold me over. I've always been a habitual user of marijuana and occasionally DXM user. Well as time took its toll on me, I was getting desperate for anything around the house. I remember my mom had these herbs she used to make tea. Well I wrote down the names of some and looked online, and Passion Flower and Skullcap happened to be potential psychoactives. They seemed like a last resort, but I was willing to try anything.",
  "I took about 5 tablespoons of each crushed up plant, and put them in a coffee filter. I add peppermint leaves for flavor. I made it hold together with a rubber band, sort of looking like a balloon and made the tea. I drank it at about 3:00 and waited for any noticeable effects, after about 2 hours, I decided to make another cup, using the same method I had the last time. I sat around and watched tv for awhile, hoping maybe this time, I'd feel something, but I was let down again. Maybe the passionflower and skullcap I had wasn't as potent as fresh, because I know my mom had purchased it at an alternative foods store, but drinking tea made from these plants had no effect on me that was noticeable."
 ],
 "erowid": {
  "id": "47691",
  "citation": " J-mo. \"No Effect on Me: experience with Passion Flower & Skullcap (ID 47691)\". Erowid.org. Jan 8, 2010. erowid.org/exp/47691",
  "substance": "Passion Flower & Skullcap",
  "views": "9678"
 }
}
