{
 "id": 7872,
 "title": "Cyclical Orgasm",
 "date": {
  "submission": "2007-06-14T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "I Mudd",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "report": [
  "<p>I had never tried nitrous so I was very cautious about the potential dangers. I wanted to start slow and see what the effects were. When I put the cartridge in the cracker and screwed it down, there was a slow leak and I decided to breathe in the steady slow stream while still getting oxygen from the air around me. Hypoxia is a good way to kill brain cells and I wasn't fond of depleting my precious few. I had attached a long plastic tube to the cracker to give the escaping nitrous time to warm up knowing full well the evaporating gas is extremely cold.",
  "I inhaled slowly and deeply, taking in nitrous mixed with air around me. At first I felt nothing and then suddenly I felt a slight rush followed by a faint orgasmic surge from my groin. The feeling grew and a pleasurable tingling filled my now erect penis. I couldn't resist gently rubbing and touching myself. It seemed like the nerves were more sensitive than normal.",
  "I continued to slowly breath the slow stream of nitrous coming from the cracker. Tingling started in my fingers and toes along with a slight amount of numbness in my lips. I then had another mini-orgasmic like surge followed by a noticeable slowing of visual responses. The tingling in my groin moved into numbness so I decided to back off the nitrous.",
  "Quickly things were back to normal so I decided to try and 'get into the zone' again. I again went back to the leaking nitrous and after a few deep breaths I had yet another mini-orgasmic surge, but this time it was intense enough to cause me to gasp slightly in surprise - so much so like being touched by a mild but intensely pleasurable electric current.",
  "I kept this cycle up for about 15 minutes until I couldn't resist the urge to 'finish the job'. About 10 seconds before orgasm, I inhaled a lung full from a balloon and held my breath until I climaxed. It was amazing and mind blowing in intensity. Time stretched out and the waves of orgasm seem to last 30 seconds.</p>"
 ],
 "erowid": {
  "id": "47743",
  "citation": " I Mudd. \"Cyclical Orgasm: experience with Nitrous Oxide  (ID 47743)\". Erowid.org. Jun 14, 2007. erowid.org/exp/47743",
  "substance": "Nitrous Oxide ",
  "views": "9742"
 }
}
