{
 "title": "Compared to 2C-T-2",
 "author": "MadScientist",
 "citation": " MadScientist. \"Compared to 2C-T-2: experience with HOT-2 (ID 78825)\". Erowid.org. Jul 17, 2009. erowid.org/exp/78825",
 "substance": "HOT-2",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "12 mg",
   "oral",
   "HOT-2",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>The original substance I had was 2c-t-2, which I put into conditions which led to the creation of the substance HOT-2. It was a long process, which I will not detail in this report, as I am a chemist and private researcher. At the end of the process, the resulting product was an off-white powder; now identified as HOT-2.</p><p>I then ingested 12mg of the HOT-2, a dose suggested by Shulgin in PIHKAL. I went into this new substance expecting it to be similar to 2c-t-2 with less visuals, and was rather excited to test it out.</p><p>Coming up began about 45 minutes after ingestion, it was relatively easy, much less nauseating than 2c-t-2 with some stomach cramps that I have experienced to be far more painful from 2c-t-2. After I got past them, there wasn't much of a body load for the rest of the trip, which was a pleasant change from aches / pains causing a lot of work to keep a 2c-t-2 trip from going in a bad direction.</p><p>The peak effects were quite pleasant, notable euphoria that I rarely get from 2c-t-2, though not as euphoric as LSD or 2c-e. OEV's were there, but not easy to focus on. In my peripheral vision, I saw certain areas of my room begin to shift or spin, all of which stopped when I looked in that direction. At times, there were geometric patterns, but they never seemed to last long. Overall, the OEV's were very disorganized, but seemed to be more in the 'real world' than 2c-t-2. CEV's were relatively simple as well, flashing colors and moving dots more than patterning. There was a high aspect of confusion, but it was easier to manage than the confusion of 2c-t-2 likely because HOT-2 is not nearly as dissociating as 2c-t-2. There was also more energy to it physically that was not present with 2c-t-2.</p><p>Coming down was relatively easy, which I really enjoyed because 2c-t-2 gives me the feeling that I am being squished, and is very painful. The energy lasted a few hours after I had come down, with difficulty sleeping in that time period.</p><p>Overall, I found HOT-2 to be more enjoyable than 2c-t-2, with perhaps more therapeutic capabilities than 2c-t-2 due to the lack of a miserable body load. I hope I have the opportunity to test out HOT-2 in the future, or even maybe venture into HOT-7.</p>",
 "year": "2009",
 "id": "78825",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-07-17T07:00:00.000Z",
 "views": "6172",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "HOT-2",
   "form": "(powder / crystals)"
  }
 ]
}
