{
 "id": 7883,
 "title": "Oh My!",
 "date": {
  "submission": "2007-03-06T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pharmapharmer",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "15",
    "grams": 0.015
   },
   "administration": "insufflated",
   "substance": "2C-E",
   "form": "powder/crystals"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "mg",
    "quantity": "5.0",
    "grams": 0.005
   },
   "administration": "oral",
   "substance": "2C-E",
   "form": "powder/crystals"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "repeated",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "7:00",
   "amount": {
    "unit": "mg",
    "quantity": "2.0",
    "grams": 0.002
   },
   "administration": "oral",
   "substance": "Clonazepam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Got a call night before last that a special young lady was visiting some friends and that she'd brought some 2c-e and 2c-I with her. My pal told me to bring some of my cannacaramels over and to pack for a long night. I arrived to find a couple of people just starting to come on to their doses so I bellied up to the bar for my dose. The young lady handed me a gelcap with a little white powder at the bottom. I asked her if the whole thing was too much to snort and she said yes but I snorted about 2/3 and swallowed the rest. It burned like hell and turned my face into a mess of tears and snot. After this cleared up I started to get a bit of nausea menwhile profound visual disturbances started to kick in. I felt like i'd taken a mild dose of MDMA and some weird LSD.",
  "My nausea built till I was talking in technicolor all over the back yard. The nausea cleared and I found myself tripping balls. We smoke a few joits and the bong was going non stop but we never got it together enough to make any music that night. We did fuck around a little but we were all way too out there to even dance without knocking shit over.",
  "I ended up taking a taxi home about 7 hours post dosing and i was still having minor visual disturbances. I got home and took care of my grow room and then hit the sack after popping 2mg klonopin. Woke up on my couch 24 hours later feeling none the worse!",
  "Probably done with this whole class of drugs (except MDMA) bur I'm glad I tried it."
 ],
 "erowid": {
  "id": "47781",
  "citation": " Pharmapharmer. \"Oh My!: experience with 2C-E (ID 47781)\". Erowid.org. Mar 6, 2007. erowid.org/exp/47781",
  "substance": "2C-E",
  "views": "3061"
 }
}
