{
 "title": "Going through W/D & Need Something to Help",
 "author": "chicano",
 "citation": " chicano. \"Going through W/D & Need Something to Help: experience with Gabapentin (Neurontin) (ID 78845)\". Erowid.org. Feb 6, 2011. erowid.org/exp/78845",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "295 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Pharms - Gabapentin"
  ]
 ],
 "report": "<p>This is my most recent experience with neurontin. I was going through opiate withdrawals because my script of D's ran out, and I was getting desperate. I called all my contacts & nobody had anything; not even a suboxone.</p><p>I have been on dilaudid for years from having chronic pain from multiple abdominal hernias and a ruptured colon that resulted in a colostomy (shit bag). I am prescribed only 100 8mg D's a month and go through them like candy. I never take them as prescribed. I almost always bang them or once in awhile, snort them.</p><p>Well, two days ago I ran out of my D's early because I had to get rid of some because I needed some extra money. I don't condone the selling or abusing of meds, but this is just what I do. So, I was withdrawing pretty bad yesterday morning and was running out of options. Thoughts of robbing the pharmacy was entering my mind, and that was out of the question.</p><p>Then, while I was laying in bed with terrible cold sweats and the shakes, I remembered that pain management gave me a script for neurontin with my last dilaudid script. The dr. told me that the neurontin would boost the effects of the dilaudid. Now, I've had neurontin before from a past surgery and had a decent experience from swallowing around 3000mg of the 600mg pills (not capsule  form). These I had now were the 300mg dose. I took the script to the pharmacy and got them filled and immediately after returning to my car, emptied 6 capsules into my mouth and took a large drink of pepsi.</p><p>On my way home I was feeling absolutely nothing from the neuros. But the good thing was, they were beginning to ease my withdrawals. I was still shaking a lil, but my cold sweats had stopped after about 30 minutes of taking the neuros.</p><p>After about 2 hours, I was laying in bed and feeling ok. My withdrawals had been pretty much curbed by the neuros, so now I wanted to get bent. So I grabbed the bottle of neuros, took out 10 more, and swallowed the caps whole without taking the powder out first. Again, these are the 300mg ones, so altogether I've now taken 4800mg over a period of 2 1/2 hours.</p><p>I drank a bottle of pepsi to help with the absorption process, and decided to play some Guitar Hero Mettalica on the Wii. After around another hour or so, I was feeling no effects of the neurontins. Neither bad nor good. My prior experience with them had been better. My past experience had resulted in quite a boost in my mood and slight euphoria. This time I was feeling nothing other than my withdrawals being stopped.</p><p>After another 6 hours I was starting to feel a bit tired and it was getting close to bedtime anyway, so I laid down and was out in a matter of minutes. I woke up this morning with slight withdrawals from my opiate use, and swallowed another 8 neuros. After 30 minutes, my withdrawals had ceased, but no other effects.</p><p>So, as far as recreational use, I wouldn't recommend neurontin to anyone that has a high opiate tolerance that is looking for a good buzz. But, I would recommend it for opiate withdrawals. I was quite amazed at how well it was able to curb my withdrawals so well.</p>",
 "year": "2009",
 "id": "78845",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-02-06T08:00:00.000Z",
 "views": "15304"
}
