{
 "title": "Learned Lesson",
 "author": "Dream",
 "citation": " Dream. \"Learned Lesson: experience with Ayahuasca (ID 78873)\". Erowid.org. Jan 24, 2010. erowid.org/exp/78873",
 "substance": "Ayahuasca",
 "bodyweight": "198 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Ayahuasca"
  ]
 ],
 "report": "<p>I have research a great deal about a specific psychoactive plant DMT and had learned much about the great healing properties of the plant for those with problems like addiction and other like issues. I have also known of the great profound experiences people have had with regard into religious experiences people have had. After 6 months of researching the topic and the compiled Knowles of a friend I had decided that I would like to try it. Taking it with a friend we both had a profound experience where I learned many life lessons about my problems with speaking in public and my strives to be perfect in all I do.</p><p>Not knowing the strength of such a psychedelic I decided to try it once again, but this time in hopes to help another friend who had an addiction with medication. The friend was unable to keep down the material but myself able to keep it down started to feel the effects I once felt before. I must note in order to get this extract I took it in the Ayawaska form from boiling it about 30 ounces down for over 6 hours. I would not recommend anyone doing that.</p><p>I had a wrist watch on so I was able to check the times.</p><p>40 Min-</p><p>Felt dizzy and felt a change in temperature, started to get a little woozy.</p><p>50 Min-</p><p>When I opened my eyes I started to see the walls and area around me look fake and as though space and time was starting to fall apart. Like the world around me was fake and that I was entering another place.</p><p>50-1.30</p><p>I had a profound experience where a being asked me if I had any questions. I ask him (or her) why I treated people so badly. It said to me that since I didn't learn the first time I had this experience that it was going to teach me the lesson this time (in a more than strong tone of voice) it put me in the position of a slave creature on another planet and left me there for a while, to feel how small I was and unimportant I was. I thought to myself that if I was left there for ever that it would maybe be the worst feeling I could ever have and would never be able to be human again. It brought me back and told me, ' See how it feels to be a slave, to be something so small that no one cares about you.' I said yes, I understand.</p><p>It then took me to another place by breaking down the fabric of what makes up everything we see, as though everything was made of energy even the guide. I could not see this type of energy but I could more or less feel it in some way. I still wanted to see what things look like and told the being I wanted to see what things looked like because I wouldn't understand other wise. It replied, 'You humans are so obbessed with what things look like that you do not understand anything besides what you can feel or see, there is so much more going on.</p><p>Fine, I will show you.' It showed me something that I saw before from my other experience but only for a moment. The last time I saw the face of a lady with a large head and yellow eyes, she was dominate but uninvolved with me. This time it showed me the big picture, the lady was not a lady at all but a octopus like being with a huge head of what seemed to be a feminine figure. Its tentacles were massive and rapped around the world and I could see bits of energy flying into the receptors of the being. The guide told me that this was what happened when we died and that the being learned from our experiences on earth this way.</p><p>The guide then went on to say, ' I don't understand why you humans treat each other so badly when your life is so small and when we die we have so much to look forward to.' It continued, 'You should treat others good for the time on this planet because your are all there and all are going to die and should live as best as possible while dealing with this experience.' I told the being that I understood and the intensity of the psychedelic started to die down.</p><p>1.30</p><p>I looked at my watch and noticed that the effects of the drug didn't last as long as last time since the last time it lasted for about 6 hours. I got up out of my bed and walked into the kitchen where my roommate was sitting and talked to her about some of the things that had happened.</p><p>1.40</p><p>Mid speech the walls started to show the same effects of before but this time much more intense and at a speed of which I never have felt before. I told my roommate that I needed to go lay down.</p><p>1.41-6.0</p><p>This is where all hell broke loose, where it was no longer fun, and the lesson was still being tough. Soon after laying down I noticed how intense things had started to get. Time started to fall part and I soon became the mud of the earth and could not move. I heard a sound like the sound of energy rushing over my body and faster than I knew it, I was dead. I could not move and I knew that I had died. I felt so sad and alone and that I was such a dumb ass for doing something so dumb that would destroy all my friends and my parents just to prove a point, to learn something that I already knew.</p><p>I tried to close my eyes and I could see through my eye lids. I put my hands over my eyes and could see through them. I gave up and could not blink could not do anything and everything was just peaceful but bland, all the pain gone but I was able to still think. I started to feel warm in my pants and though, 'am I about to piss myself? Oh god Im going to piss myself because Im dead.' I started to think about all that I had read and realized I wasn't dead, I was alive. I focused, clasped my hands together and managed to come back to myself and walk myself into the bathroom. I used the bathroom and manged to get back into my room at what point I realized I needed to get this out of my system. I tried to puke but nothing came up and as I did that I was transported in front of a being.</p><p>The being was so massive that word can not describe. The only thing that describes it is that it was as massive as god. It told me in the most angry voice and most fear dwelling way it could that I was nothing but a slave and that I was not allowed to be where I was. It asked me what I was doing there. I answered that I didnt know and that I would do anything for it to leave me be. It told me to never come back and never challenge it again. As I came back to myself I noticed that my knee was on the ground and I had it bent with my hand up in the air as though I knew how to be in that position all my life, like it was engraved into my body to know how to conduct myself in that situation with that being.</p><p>I laid back on my bed and knew that I was going to have to live with this experience and not be able to get it out of myself and that I wasn't going to die even though I felt like it. I realized at this point how much I wanted to live, how much everything in my body wants to fight to keep me alive and live to do something with my life even if that's just to live. I understood how important life is and how treating others good is important.</p><p>Over all I learned my lesson, and how much I needed to change the way I lived and hope that I never forget. I learned that my views of religion may have been right in the fact that I do not believe that any of them are right and that we have so much to learn as a species.</p>",
 "year": "2009",
 "id": "78873",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-24T08:00:00.000Z",
 "views": "2365"
}
