{
 "id": 7888,
 "title": "Relief",
 "date": {
  "submission": "2007-08-24T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Drew",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Methadone",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I noticed that there are no reports on here about Methadone being used for pain relief, only for maintenance or recreational use, so I thought I would give it a shot. First off, a little bit about myself. I have been using opiates and opioids for 2 years non-stop to deal with pain resulting from a kidney condition. I've taken hydrocodone, oxycodone, meperidine, hydromorphone, propoxyphene, codeine, and now finally methadone.",
  "As I was getting off work one day, I felt a tension in my back, which I usually feel right before an episode of severe pain. I headed home and as soon as I walked through the door, an almost electric-like shock of pain ran from by back down to my leg. I grabbed a bottle of recently prescribed 10 mg. methadone tablets, singled out two of them, and swallowed them dry. I laid down on the couch to await the effects. After 20 minutes, I began to feel a sense of warmth and heaviness in my legs. I sat up and got up from the couch, and as I stood up, I felt a rush go from the top of my head to the tips of my toes. I noticed my back didn't hurt at all. Despite having a large tolerance to opiates, the 20 mg of methadone had a profound effect on me. I had the basic opiate 'life is cool' feeling, but also a strong body buzz that reminded me quite a bit of morphine. The feeling remained for the better part of 8 hours, and afterwards I drifted off to sleep.",
  "I noticed no nausea, but opiates have never upset my stomach. Methadone is one of the strongest opiates used as a pain reliever, and with continued use it accumulates in the body, making the effects of a dose exponentially greater. I see quite a bit of potential for misuse with this substance, especially at higher doses. A few days after the date of this experience, I slammed my hand in my car door, and took 40 mg of methadone instead of going to the hospital. I could have sworn I had IM'ed a big wad of heroin. Treat this shit with respect, it is stronger than hell and could catch up with one fairly quickly."
 ],
 "erowid": {
  "id": "47805",
  "citation": " Drew. \"Relief: experience with Methadone (ID 47805)\". Erowid.org. Aug 24, 2007. erowid.org/exp/47805",
  "substance": "Methadone",
  "views": "24263"
 }
}
