{
 "id": 7890,
 "title": "Good Drug, Although Sometimes Unpredictable",
 "date": {
  "submission": "2006-12-08T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Cactushead",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 repeated",
   "administration": "oral",
   "substance": "2C-T-21",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>Background: I love to trip. I have explored LSD, mushrooms, mescaline, ketamine, 2c-b, 2c-I, 2c-e, salvia, DMT, 5-Meo-DMT, 4-HO-DiPT, DXM, harmaline, PCP (unfortunately), MDMA, and 5-Meo-DALT. I have found that I learn a lot from most of my trips and I try to incorporate the lessons I learn into my daily life. This is the second time Ive tried 2c-t-21.",
  "10:00  The night started at 10. I packed myself an unknown amount of 2c-t-21. The amount I put in the capsule was a bit more than the first time I tried the substance. I enjoyed my first experience, but felt that I could use to kick it up a notch.",
  "THE PROGRESSION THROUGH THE PARTY: As the night progressed many of my friends wanted to try 2c-t-21 and so I gave them each some. Each time a person took some, there was always a little that spilled on the table or counter, so I would lick it off. Over the course of 4 or 5 hours, I ended up eating probably the same amount that I initially packed into the capsule.",
  "At doses this high, the drug became much more amazing than the first time I had tried it. There are several effects it had on my feelings, and thus, on my behavior as well. I found that conversation flowed very smoothly at the party. I felt perfectly comfortable talking with strangers which is usually not the case.",
  "As I was leaving the kitchen, I saw a girl who had a cut under her eye and she had obviously been crying. I could see her pain so clearly, and I knew she needed something at that moment to remind her that things arent all bad. I went up to her (she was a complete stranger) and said, You look like you need a hug. Can I give you one? She nodded yes, and I gave her a big hug, putting as much love into it as I could. I said I was sorry there wasnt more I could do to make her feel better, but she told me that my hug helped her a lot. I could see that I had made a connection.",
  "I later walked into the living room and sat down next to some girl. We talked, and again, conversation flowed very smoothly. I felt like I was able to understand other people better, and express myself better as well. I looked across the room and saw an acquaintance of mine (baby-Paul) He was sitting in a chair and looked happy on the surface, but I could see pain in his eyes. I asked if he wanted to talk about what was troubling him and he said that he didnt because it would take too long. I pulled up a seat next to him and said that if he wanted to say anything, I was happy to listen. I wont go into the details, but he really opened up (he was sober that night) and told me about some of the difficult problems he was having. I understood his pain, and learned a lot about him. During the half hour that we talked, we got to know each other a lot better; both gaining a mutual respect and liking towards one another.",
  "By that time, I was feeling somewhat nauseaus. I went outside and puked a little bit. It didnt help much, and for the next several hours, I continued to feel mild nausea.",
  "During the party, I also became much more comfortable with revealing my feelings. There are two girls that I was interested in at the party, and unlike my usual self, I felt that it was perfectly appropriate to let them know that I was interested. I was really happy that I felt comfortable with expressing my emotions. I suppose this is another similarity to ecstasy, but yet again, its not nearly as empathetically powerful.",
  "Much later, I left the party and went to a friends house. I snorted a small amount of 2c-t-21 at this time. Everyone was so excited to see me, I felt so loved and appreciative of all the friends I have.",
  "SIGNIFICANT EFFECTS: I decided to head back home; this is where the trip really shifted gears. I smoked a hit of pot and began talking with my roommate. I started to become really happy. Not like ecstasy happy, but a happiness that consisted of contentment, gratitude for all the good things in life, and all the meaningful relationships Ive had (similar to the reports Ive heard of a Methylone experience, although Im just speculating). It became so intense that it started to feel similar to ecstasy, but more the feeling was more ecstatic than it was pleasurable. I was so thrilled with life that I could hardly contain myself. I decided to take a shower, and as I was in there, my thoughts started racing about all my interpersonal relationships. I began having some interesting insights as to how they developed, what they mean, etc. I was becoming increasingly grateful for my existence, and at one point I almost starting crying from all the beauty, love, and friendship that Ive experienced in my life. I realized that despite how bad life has been, there are innumerable things that I am grateful for.",
  "SECONDARY EFFECTS: There were other things that 2c-t-21 caused, but they werent as significant. There were mild visuals and some speediness. However, neither was pronounced. On a side note, I want to emphasize that 2c-t-21 DOES have the potential for very powerful visuals, and more stimulation than I am sometimes comfortable with. There was a different 2c-t-21 trip I had where I felt very spun and also had major color shifts (ie: the entire sky turned from blue to red.) One of these powerful trips also gave me a profoundly spiritual experience in which I prayed to God (after at least a decade of not doing so).",
  "CONCLUSION: Well, this is an interesting drug. On one hand, most common doses dont seem to offer much anything that is visually interesting; however, high-dose visuals are comparable to a 2c-e trip. The body high is certainly prevalent, but I cannot say whether its good or bad. It feels a little like a 2c-b body high, or perhaps a small MDMA dose, but there is also some tension which isnt always comfortable. This drug definitely has a positive mood push though, again, not to the same extent as MDMA, but certainly more than many other psychedelics. Overall, I enjoy it just because it has a unique character.</p>"
 ],
 "erowid": {
  "id": "47811",
  "citation": " Cactushead. \"Good Drug, Although Sometimes Unpredictable: experience with 2C-T-21 (ID 47811)\". Erowid.org. Dec 8, 2006. erowid.org/exp/47811",
  "substance": "2C-T-21",
  "views": "10641"
 }
}
