{
 "title": "Numb and Lucid",
 "author": "Scissorhands",
 "citation": " Scissorhands. \"Numb and Lucid: experience with Cannabis (ID 78918)\". Erowid.org. Mar 23, 2010. erowid.org/exp/78918",
 "substance": "Cannabis",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "smoked",
   "Cannabis",
   "(dried)"
  ]
 ],
 "report": "<p>About two years ago, I had a very interesting experience with Marijuana.  It was different, but certainly not enjoyable.  Unfortunately because of this experience I have a hard time smoking up without getting a little bit anxious.  This experience has manifested into a bad association that has been difficult to shake off.</p><p>I was about eighteen at the time, and my friend had invited me to smoke up with her and a couple of her friends.  I agreed wholheartledy, seeing that I had smoked a few times before and had some generally good experiences. The person I was with had only smoked one other time before, so naturally she was a bit anxious.  I told her it would be alright, even though I was not too familiar with her friends or the person she had gotten her stuff from. (Always make sure you know the person you get your stuff from, I cannot stress that enough!) </p><p>After school my friend and I went to her house, and then far off into a wooded area where all the potheads would gather secretly and quietly.  When I had arrived, the group consisted of my friend and I, as well as three other guys.  Even though I did not know the guys too well, they were nice and seemed to fit in with my kind of crowd.  My doubt had vanished when one of them complimented the Beatles t-shirt I had been wearing at the time. </p><p>I began casually talking to the group, not really paying attention to the person rolling the blunt.  (I am not blaming the person who rolled the blunt, nor am I blaming any of the other people in the group for giving me funny stuff, but I think it would have been better if I was familiar with the dealer this particular herb came from). After a few minutes of waiting one of the guys held up the blunt and grinned, indicating that it was time to smoke up and have fun.  I sighed deeply, feeling the same nervous feeling I always felt whenever I smoked weed.  It was a feeling that pestered me and first but would always go away within minutes of smoking.  I am a small girl, weighing 105 pounds and standing at a whopping height of five feet and two inches, so I figured about five hits would do me good. </p><p>After a few minutes, I felt the THC flood into my brain.  As usual, my feet went slightly numb and I began to feel that familiar warm sensation in my body.  After my body was warm, I began to feel things that were not too familiar, or too pleasant. </p><p>As I walked out of the woods the plants around me seemed to mix together; as if I had been walking through a giant green painting.  I walked out of the woods and saw the concrete parking lot around me.  My vision was hazy and weird, sort of like a TV channel with very poor reception.  I had a hard time figuring out exactly where I was, and felt as if I had entered into a lucid dream. </p><p>Suddenly, my friend gasps loudly and begins to take offrunning.  She yells out 'My dad is here! My dad is here!' So in a frenzy I took off running after her.  I suddenly felt as if  I had been running in slow motion, with time and the images around me moving at a very slow pace.  I could still see the giant green blot of trees next to me along with the sickenly gray concrete.  Next thing I knew my friend and I were inside of the bathroom of a nearby restaurant.  At this point my entire body had gone numb, including my mouth and my hands.  I was a bit confused as to how I had gotten into the bathroom; wondering how much time had gone by between the panicked run and now.    </p><p>I looked over and saw my friend hyperventilating next to me.  I asked her to please calm down, feeling as though I was on the verge of freaking out myself.  As we walked out of the bathroom, I heard my friend say to me 'I feel as if I'm in a dream, and my alarm clock is about to go off any second.'</p><p>I sat in the booth next to one of the guys I had smoked with, and I noticed that it was not just my friend and I who had felt the effects.  One of the guys was staring intently at a spot on the ground, with a sickening look in his eye.  Another guy sitting across from me was laughing, commenting on the fact that everyone in the room seemed like a cartoon character. </p><p>I grabbed my cell phone and began dialing my friend's number.  It took me a few moments to dial the number right, but I felt I really needed to speak to her. </p><p>She finally answered the phone and as I began to speak , she knew something was wrong.  I told her that I really wanted her to come pick me up and take me home, because I was feeling numb, and this dream-like state of mind was turning quickly into a nightmare.  She simply said to me 'Ok, I will be there in a minute.' I hung up my cell phone and looked across the booth.  One of the guys looked at me, and I began to hear him talking in my female friend's voice.  He was saying that he would give me a ride home, and strangely called me 'baby.' He began calling the guy next to him 'baby' </p><p>'What?' I said to him in a disoriented manner.  All of these words mashing together in a strangely feminine voice were making me even more anxious.  His face looked confused and in his regular masculine voice said 'I wasn't saying anything.' Suddenly I remembered that at times my female friend used the word 'baby', and my slow brain finally realized that I had been hallucinating, hearing everyone speak in her voice </p><p>I did not have the patience to wait for my friend, so I went up to the person I originally wanted to smoke with and told her I had to get the hell out of here.  We wandered around for a few moments, finally arriving at her house which was not too far away.  I felt the same slow-motion feeling I felt earlier, seeing more and more incoherent blobs of color as I walked. Thankfully her parents were not home, so we were allowed to relax a little bit.</p><p>She had brought some crackers and green tea.  I stuck one of the crackers in my mouth and tried to chew.  I felt as if my mouth had fallen off, and was completely unable to chew or even swallow any of the food that felt to be floating in front of my face.  I sat on the couch feeling completely disconnected from my body.  I felt like I was gradually slipping in and out of consciousness, while my numb body attempted to jerk me back into reality.  </p><p>After about five hours I felt my high come down; I was able to feel all of my body parts again, and I no longer felt as if I had been floating around in a dream.  But this feeling of soberness did not last long.</p><p>The next day I walked to school, and felt the same high feeling by the time I had reached my school's double doors. I wandered around the halls until I eventually found my classroom, and ended up failing the math test I had to take that morning. I did not understand the math problems, and I had accidentally written off the paper and onto the desk a few times.  Naturally, I got about a 15% on the test. I found my friend who I had smoked with, and saw my handwriting all over her binder. Apparently I had written some incoherent words on her binder with a pen, and did not remember doing it.   </p><p>I am not sure what it was I smoked that day, but I know for a fact it was not just straight herb.  When I tell people this story many of them say it was most likely PCP. I cant be 100% sure since I have never done PCP. All I know is that it is not something I would like to experience again.</p>",
 "year": "2007",
 "id": "78918",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2010-03-23T07:00:00.000Z",
 "views": "2733",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(dried)"
  }
 ]
}
