{
 "id": 7895,
 "title": "My Dog Saved Me",
 "date": {
  "submission": "2007-09-21T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Experienceseeker",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I have done mushrooms many times before but this was by far my most intense trip, which has probably turned me away from mushrooms forever because I don't feel that I can control the awesome power that they unleash. ",
  "A friend, let's call him W, and I decided to do mushrooms on a day we both had free from work and school. I hadn't done them in about five months after I'd had a really bad trip from taking too much. I took my share of the mushrooms and made a cheese sandwich which I warmed in the microwave and proceeded to eat. W and I packed a bowl of weed and marvelled at our luck for having chosen such a beautiful day to do mushrooms. I noticed something odd in the sky and thought it to be a bad sign. I began to feel the effects of them pretty quickly - about 15 to 20 minutes later. I immediately wasn't enjoying the high and told W that I wanted to leave my house. ",
  "As we walked outside I felt a bitter better; we made our way to our friend A's house. W was especially amused by A's new kitten. I went to the bathroom to urinate and took especially long because I kept looking in the mirror; I remember thinking that I looked very ugly at this time. I began watching TV but was too distracted to understand anything going on. I was still having trouble getting comfortable so W suggested that we go to another friend's (let's call him S) house who lived nearby. When we arrived at S's house I was getting closer to my peak and feeling like I had no control over my high at all. I did not like this and began to feel sick. I tried to sleep but just saw some closed-eye visuals which made me feel even worse. At this point I really didn't want to be high anymore and went to the bathroom and attempted to vomit, which I wasn't able to do. I thought that smoking some weed might make me feel better so S got ready and the three of us went to his car. ",
  "I reclined my seat and closed my eyes hoping I might be able to gain some control. I had some closed-eye visuals, patterns formed like a collidescope. When I sat up and watched the road, I marvelled at S's 'amazing driving skills' as pedestrians and cars seemed to be popping out of everywhere very quickly. I lay back down and began to feel a strong rush which I'm not sure whether I enjoyed. At this time I began to think that we might have gotten bad mushrooms and that I was nearing death; W on the other hand was fine except that he was very confused. I began making promises to God to improve my behaviour and never do mushrooms again if I made it through the trip. I comforted myself with the memories of getting over other bad trips and the fact that my peak couldn't last for more than a few hours. ",
  "S found a place to park to smoke the weed but he and W left the car because I had decided that I didn't want to smoke the weed anymore. I still had my eyes closed with the seat reclined and was praying to recover. At one point I wished for death and envisioned guns and knives wishing I could commit suicide. I proceeded to scratch my hand with my nails, with much strength, to induce pain hoping it might help me deal with my sickness. I began seeing images of my mom, dad, and sister and feeling much love toward them and began apologizing for all the drugs I had done and my current condition. Suddenly I had the urge to vomit and was barely able to gather the strength to open the door before I vomited. Once I vomited, I began to stick my finger down my throat hoping to vomit again. I wanted to urinate because it felt natural but I didn't have the strength to get out of the car. Against my own will I began to urinate in my pants. I gathered some strength and ripped my iPod and cell phone from my pocket and managed to suppress urinating further. Luckily I hadn't actually urinated as much as I thought I had and it was just a small amount. Vomiting had made me feel slightly better and I was beginning to think I was going to be okay.",
  "W and S returned to the car and I asked S to drop me home. When we arrived at my house W grabbed his things and left. I stumbled up the stairs and encountered my dog, who seemed genuinely concerned with my condition. I went to my room, changed my clothes, and collapsed on my bed, which is when I reached my highest peak. I continued seeing images of my family and members and having feelings of strong love toward them. I finally let go and left my body.",
  "I remember feeling weightless and seeing a bright white light. When I returned to my body I opened my eyes slightly to see bright fluorescent lights and had the feeling that I was being rushed into the hospital on a stretcher. I heard my family members running from their cars toward the ER. At this point my dog began to whine and bark in a worried manner almost calling for me. At this point in my trip I was beginning to gain control and every time I would begin to lose control my dog would whine and bring me back. I looked in the mirror and saw my head grow horns and the background changed from my room into a fiery inferno. My face had a look of deep evil upon it but I remember thinking how good I looked, on the contrary to what I had thought in A's bathroom. I tried to drink some water but ended up spilling most of it on myself. ",
  "At this point I felt in total control and was able to leave my body and 'fly around.' I felt as if I had all the power in the universe and was able to bring about any feeling upon my body (a series of different intense pleasures and adrenaline rushes) as well as make body parts (such as my arms) disappear entirely. I sometimes would fall too deep while inducing feelings upon myself and would lose grip once again but my dog would whine and bark loudly to bring me back. Once I was in control again, I was able to mentally comfort him. At one point I left the physical world completely and was having a conversation with God or the universe as a whole. I was able to freeze time for as long as I wanted. I remember 'knowing' that I had the power to change anything in the universe that I wanted but couldn't really decide on doing much. I would decide on one thing but then find a reason why I'd rather change something else.",
  "I was thinking about many choices that I had made in my life and felt that I could defeat any obstacle that arose in the future through perseverance. I felt immense love for my people in my life, including my family, and felt a great appreciate of everything in my life. I was then able to 'travel to the future' and view the success that I would obtain (as promised by God) if I stayed determined in school and other endeavours in my life. I began to weep out of appreciation and love which I continued to do for quite a while because it felt very good. ",
  "I knew my high was nearing an end so I induced a few more pleasures upon myself and left my body for a little while to explore the universe. I then let go and felt suddenly normal. I was still high but had dropped many levels from my highest peak. I got out of bed and looked in the mirror and saw my face drained of all of its life and I began to look like a zombie. My dog came to see how I was doing and as I began to pet him, I was overwhelmed with feelings of love and thankfulness for him from saving me from what I thought to be death.",
  "The weather had taken a turn for the worse and when I went outside I was lucky enough to witness a beautiful sunset in what seemed to be near tornado conditions, though my eyes probably had just exaggerated windy conditions. I was utterly dazzled by the beauty of the sunset and the patterns of the clouds, my eyes were making them move and make vibration patterns. I felt very empowered and still felt that I had some control over the universe. When I returned inside I continued to see some open-eye (patterning) visuals. ",
  "This experience has turned me away from mushrooms for a long time if not forever and was a real wake-up call about my life priorities for me. I'm glad that I've had this experience. I know I was never really near death but had just underestimated the power of these mushrooms and had taken too much. I also think me trying to control the trip instead of going with the flow accounted for the trip turning bad as my realization that I had no control over it scared me. As for my so-called 'psychic' link I shared with my dog I cannot explain; dogs seem to have an uncanny ability to sense the health of their owners. While I was in my train wrecked condition, my dog obeyed all of my commands quickly without being stubborn. He and I are closer than ever and I will forever be thankful to him for aiding me in getting through one of the hardest experiences of my life. I also gained a greater appreciation for all elements of my life and will act differently in the future."
 ],
 "erowid": {
  "id": "47834",
  "citation": " Experienceseeker. \"My Dog Saved Me: experience with Mushrooms (ID 47834)\". Erowid.org. Sep 21, 2007. erowid.org/exp/47834",
  "substance": "Mushrooms",
  "views": "3334"
 }
}
