{
 "title": "Tales from the Zebra Room",
 "author": "Shaggykid",
 "citation": " Shaggykid. \"Tales from the Zebra Room: experience with LSD & 2C-I (ID 78970)\". Erowid.org. Jan 15, 2010. erowid.org/exp/78970",
 "substance": "LSD & 2C-I",
 "bodyweight": "150 lb",
 "report": "<p>I have a good deal of experience with mind altering substances; I have tried almost every Substance except opiates. I have used LSD, mushrooms and marijuana ecstensivley, and am looking into trying more obscure psychedelics. A friend of mine who sells LSD had recently gotten a large amount of 2CI for a good price, and I had not tried it before.</p><p>I met up with my friend, CD, at his girlfriend's (BE) house at nine on a Friday night. He had used LSD several times before, but was unsure about trying 2CI. We portioned out the drugs so that CD took 2 hits of LSD and 10mg of 2CI, while I received 1 hit and 20mg. BE was offered, but refused to take part.</p><p>We dropped at 9:20 PM. Soon after we decided to make a pilgrimage to the video store, while still sober. On the way the first effects of the drugs became apparent. Odd chills, strange thoughts, and the numbness of the nasal cavity, the hallmarks of a good psychedelic. The onset of the 2CI was more rapid than expected. By 9:50 we arrived at the video store and were observably impaired. I was losing control of my voices volume, and slinked carefully away, as my pupils were very dilated.</p><p>We took alleys and residential streets on the way back. At this point the cars that sped by were complete blurs of primary colours. Crossing the highway was particularly parilous. We walked past a church whose towering cross that dominated the sky. Even as an atheist the sight of the massive cross was enough of a wonder to make me consider conversion.</p><p>We arrived back at BE's house at 10:15 and quickly retreated to her room. The room was the only room in the basement of the house. It had no windows, and the walls and ceiling were covered in zebra print wallpaper, with eyes scattered around in the stripes. The stripes seemed to come off the walls in various colours and angles, like a confused rainbow. The eyes seemed to shift and stare. The three of us lay on the bed, simply enjoying the room and the comfort of the bed and each other. There are no clocks in the room and no one has a watch, so time is not a factor.</p><p>A short time after BE receives a text message asking to meet her neighbour in an alley. We met in the alley at an old jeep. In the darkness and confusion of the trip I could not make out the features of the guy we met, but he was stalky and scruffy looking. He and I sat on top of the jeep smoking a glass pipe and conversing, while CD and BE stood below. It became apparent that the neighbour was a 'wake and bake' sort, and had been smoking since elementary school. Having tried LSD himself, he was rather comfortable with the frank conversation that tends to accompany psychedelics. After we smoked two large bowls, CD, BE, and I returned to the Zebra room.</p><p>Upon returning, truly deep and honest conversations began to apear. At one point BE received a call from her friend, KC, who I had been hanging around in the days and weeks prior to this. Originally she was invited to be tripping with us, but then went to a cabin to the north with her cousins and their friends. We all talked to her via phone, separately and by speaker phone. The only thing that was really discernable was the fact that she was with a large group, and they were all drunk. I wasnt sure why, but after talking to her it felt as if something was stabbing me from the inside.</p><p>Deep conversation continued until the early hours of the morning, at which point both BE and CD disappeared, leaving me alone in the zebra room. The room seemed to spin and constrict, like being inside a massive snake. I left all alone with nothing but a shattered sense of reality. I lay down and closed my eyes, and drifted off. Brilliant flashes of light and colour were seen in the darkness. A feeling of hurtling through space was enjoyed, and continued to accelerate to continually greater velocity, which began to feel terrifying. This continued until I fell out of the bed, landing on my face. It was then that, momentarily, I mentally and visually returned to reality. It was then that everything in reality seemed overwhelmingly wrong. So much in life seemed ridiculously trivial and idiotic, even disgusting, including myself. Almost immediately following this revelation, reality dissipated, and the entire world felt as if it was made of fat. A terrible, greasy, ugly mess. The walls seemed to drip with fat; my face had the texture of butter.</p><p>I met BE and CD coming out of a door that I had not known of, which really freaked me out. We then decided that fresh air would be good for everyone. There was a soccer field next to the house led directly to a 7-11. As we walked across the field the night sky seemed wondrous, the stars more bright and beautiful than anything in the universe. The night air was calm, and the suburbs were quiet. The convenience store was far too much stimulus to take in at once, and was somewhat frightening. It is a miracle that we were able to make it out without incident.</p><p>After returning to the zebra room, we settled down, turned off the lights, and simply talked in the darkness. We talked of life, family and relationships. Part of the magic of psychedelics is they give me the ability to realize and admit tings I would not otherwise.</p><p>The main things I took from this experience is a realization of how much I love the people in my life, and how trivial material things, mind games, and social manuvering actually are. Though there is no hangover or psychological damage, this trip has left me with a sense of how empty most people are, and a general melancholy view on the future. It is the painful truths that one discovers in these substances that make it remarkable.</p>",
 "year": "2009",
 "id": "78970",
 "gender": "Male",
 "timestamp": "2010-01-15T08:00:00.000Z",
 "views": "2751",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(liquid)"
  }
 ]
}
