{
 "title": "I Thought It Would Never End",
 "author": "sofiowka",
 "citation": " sofiowka. \"I Thought It Would Never End: experience with Salvia divinorum (ID 78989)\". Erowid.org. Jul 14, 2009. erowid.org/exp/78989",
 "substance": "Salvia divinorum",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "report": "<p>Trapped in a frozen moment. Turning like a fan, the moment repeated on the sound of the music, a syllable half uttered. I could see only blue, and a shadow. I was overwhelmed by horror that this perpetual dissatisfaction was all that was real. Life as a broken record. All that was and would ever be was the beginning of a sound, the half of a turn. I felt ashamed to have believed that the life I had been living was real, that I could be complete, could be aware on the level of full experience. That was not for me. I mourned the self I had once thought existed. Yet that such a life, a whole reality, could cease to exist even in thoughts so suddenly seemed wrong. It couldn't be so. I struggled to escape the inexorable rotation but was met only with ridicule from some unknown presence. I thought that I could escape the cycle? To whatever it was, I was a joke.</p><p>But I was desperate. There's always a way. This was no exception. I just had to think. How could I return to the fantasy world I had created? This reality was meaningless. Relief from it was the only reasonable thing to strive for. There was nothing but fantasy and the endless turning. Which would you pick? I put my mind to what was happening and I realized that I was not quite so small. I was more than a sound being made, more than a fan blade. I could see something now... it was me! I was a person! I was about to turn around and speak. This was progress. But still I ached for satisfaction. The pure physical sensation of completing the progression of a moment is something that cannot be appreciated until it is lost. I needed to complete the turn and leave the moment behind. But, wait. There was something behind what was happening. What was it called? Salvia... what is that? I needed to stop! I needed to feel this end! Wait. Wait. What was happening? Salvia? That's--</p><p>My vision zoomed back into my head. I returned to myself with a jolt. I was standing on my bed between a sign I stole from an eye wash station and an old lamp, supporting myself on the wall. I was staring at the blue wall. With some difficulty I ripped myself from it, scrambling away. I didn't want to get sucked in again! I groped around for the stereo remote and turned the music off. The beginning of the vocals was the moment that I had been trapped inside. (Though I later realized that what I then thought was singing was actually synth.)</p><p>I turned on the TV to calm myself down, then started to think. I recalled to myself who I was and that I had just smoked salvia. I tried to integrate what I had just experienced. I had ceased to exist for an indeterminate period of time. I had felt sensations and seen impressions, things for which I lacked words or the capacity to recall in any representative fashion. I thought back to before. What HAPPENED? I had taken a big hit of salvia and held it until I felt myself being wrenched out of reality, then I put the bong down... my memory stopped there. My lighter was in the middle of the floor. That was the only hint I had as to what had occurred, aside from the fact that I was up scrutinizing the wall when I came to. Whatever went down, I was glad to be back. I had just escaped a terrible death of monotony. How lucky I was to be real, to live, to be able to choose, to act. How blessed to be animate.</p>",
 "year": "2009",
 "id": "78989",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-07-14T07:00:00.000Z",
 "views": "2756"
}
