{
 "id": 7899,
 "title": "What the Voices in My Head Are Saying",
 "date": {
  "submission": "2009-10-10T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SpacyGecko",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "150",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Sertraline",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "number": "37.5",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Venlafaxine",
   "form": "daily"
  }
 ],
 "report": [
  "I think a lot of people are given antidepressants for the wrong reasons. Doctors, whether they are well-intentioned or get kickbacks from the drug companies, may prescribe antidepressants to someone who just feels sad sometimes. But that's a shame, since those drugs do have a legitimate use and can potentially help people.",
  "Real Major Depressive Disorder isn't anything like feeling sad. What I felt was almost like an omnipresent sense of boredom - like nothing in life was worth doing or even thinking about. Though I could get away from that by distracting myself. The worst part is the voices. They're always with me making comments.",
  "'Come on, Worthless One, are you going to sit there all day? You never get anything done! Go clean the kitchen if you can't make yourself useful.'",
  "'Hey, fat girl, you aren't really going to eat that, are you? Just drink some coffee, that's it.'",
  "'Look what you did now, stupid thing! You messed up! You always mess up!'",
  "Sometimes I try to defend myself, but it's never very helpful. Because the Voices can easily recite a long list of everything I've done wrong in my life. And it's so painful to hear, it's easier just to do what the voices say and try to get up even though my body is dragging. Once I drank a bottle of Nyquil in what a psychiatrist figured was a suicide attempt, but it was really just to make the voices go away. It only worked for about 4 hours then the voices came back and I had the worst hangover imaginable.",
  "When I finally was willing to take antidepressants (maybe not so much willing as I just didn't care), it took some time before they actually worked. At first they just made me tired and gave me diarrhea. I didn't think my mood was improving at all. But then several months later, I noticed that I actually really wanted to be alive. That was a change for me. And the voices in my head changed as well. Now they crack jokes (albeit no terribly good ones), make up songs, keep me company when I'm alone, and tell me what sort of recipes I should bake. ('It's your sister's birthday. You'd best make a chocolate cake with buttercream icing, methinks...') My friends tell me I always seem calm and cheerful.",
  "Although these drugs aren't for everyone, I believe that they were prescribed to me appropriately and that I stayed on them for a long time, they actually did help quite a bit. The only side effect that I still notice is that my pupils are always unusually dilated. I have never taken more than the recommended dose, so I've never had any of the symptoms associated with an overdose. Although I do know that Effexor is addictive. I am on a very small dose, so my symptoms were not as bad as some I read about. I foolishly went on a trip for the weekend without my meds and by Sunday I was feeling nauseous and so dizzy I had to lie down, but after I took my effexor and a short nap I was fine.",
  "I wish the best to everyone who is struggling with depression. There actually are drugs out there to help, but you need to give them some time (I know, easier said than done). But the voices in my head told me there is hope. And also they said I should bake some brownies, or maybe a pumpkin pie..."
 ],
 "erowid": {
  "id": "47843",
  "citation": " SpacyGecko. \"What the Voices in My Head Are Saying: experience with Sertraline (Zoloft) & Venlafaxine (Effexor) (ID 47843)\". Erowid.org. Oct 10, 2009. erowid.org/exp/47843",
  "substance": "Sertraline (Zoloft) & Venlafaxine (Effexor)",
  "views": "10956"
 }
}
