{
 "title": "Unnatural and Unpleasant",
 "author": "Dan",
 "citation": " Dan. \"Unnatural and Unpleasant: experience with Spice Product ('Gold') (ID 79039)\". Erowid.org. May 28, 2009. erowid.org/exp/79039",
 "substance": "Spice Product ('Gold')",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "report": "<p>I recently purchased a 3gm packet of 'Spice Gold' because, well, just because. I had heard it was surprisingly effective, and found it being sold at a reasonable price on the internet, so I decided to give it a whirl.</p><p>It just so happens that I am very sensitive to drugs. I wasn't so much as a teenager, but I have become so, I don't know why. As a result of this sensitivity, I get very high very easily. That might sound like a blessing, but it is in fact a curse. Imagine wanting to enjoy a nice cold beer and not being able to finish it because you are totally plastered. It is this way for me with drugs. I say 'drugs' because I mean I am sensitive to all the drugs I take, bar alcohol.</p><p>So, bearing this in mind, I loaded a tiny hit of 'Spice Gold' into the special tiny pipe that I have just for me. The bowl of my pipe would seat a pea very nicely, and I loaded it level, so that the amount of Spice in it was about the same volume of half a pea. A very modest hit indeed. What followed was in two parts;</p><p>Part 1; Around 9pm I smoked the Spice. I have read that it takes a little time to feel the effects, around ten minutes. This was not the case for me, and I felt the effects more or less immediately, as with MJ. The effects were incredibly similar to MJ, and in strength similar to 'good' weed, perhaps even stronger. In any event, I got very high, and felt a little discomfort at first, as will happen in those circumstances, but I settled into it and spent a pleasent few hours reading, watching TV, eating chocolate, and playing with the dog. </p><p>As I've said, the effect was very similar to MJ, but not identical. It does not have the full spectrum of effects of MJ, and I personally felt, perhaps because I'd read about the synthetic nature of the active ingredient/s, that there was something a little harsh or unnatural about it. I also found it a little more hallucinatory than MJ is, in that I was getting some pronounced visual and auditory effects from the Spice that I do not usually get from MJ.</p><p>The other notable effect was that after the initial high began to fade, around midnight, it revealed an underlying element of the intoxication that was quite different from a MJ stone. It was a feeling of being slightly seasick and dizzy, combined with both an opiate sort of feeling, and a weird, vague dissociative effect. The feeling itself was not pleasant, but manageable. What was very unpleasant was that it did not fade or wane at all over the next hour. I also recognized in it the base element of the overall 'spice' experience, and its persistance and unpleasant nature gave me a generally bad feeling about the experience as a whole.</p><p>Now, I can explain unpleasant feelings as being down to my hypersensitivity to drugs. I was also alone, aside from the dog, and of course that can make those feelings worse. Either way, I could have had this exact experience from smoking MJ, aside from some noticeable qualitative differences, and I would not blame Spice because I got a little too high. What I would blame on Spice was what happened in the second part of this experience;</p><p>Part 2: I went to sleep around 1am, more or less content. I woke up an hour later into a vividly dissociated and agitated state. I was pronouncedly hallucinating, visually, aurally, physically and psychologically. I had mostly lost the ability to interpret my environment through the medium of my inner monologue. I was experiencing every situation (head on pillow, lying on my side, sitting up, blinking, turning on the light) as the sum of my existence, with no before and no after. Each moment felt like any eternity trapped in doing something very small and uninteresting. The person who I know myself to be was more or less gone. Luckily he did not go completely, and I was able to maintain some basic understanding that I was in the grips of a drug mishap. I was also, as I have said, experiencing hallucinations; fractals, trails, echoing noises and strong flushes of an indescribable physical feeling in my torso, along with some pain in my stomach. Furthermore I was feeling chilled and feverish, which is not a symptom of any drug I have taken before.</p><p>It was not the hallucinations per se that bothered me, though. What bothered me was that I was having not only an ego meltdown which felt trifling, cynical and tinny, but that this situation had developed after I thought my experience was pretty much over. I have never, ever woken up higher than I went to sleep, and to wake up tripping quite hard was extremely unpleasant. Added to that the feverish physical effects and the pain in my stomach, I felt like I had poisoned myself.</p><p>In the end, I was able to stabilise myself by around 3am and I drifted in and out of delirious sleep until about 5am, when I was able to relax and finally go to sleep. When I awoke, at 9am, it was with the kind of hangover that one gets from drinking way too much- I had a headache, I felt dizzy and that the room was spinning, and I felt nauseous. I also still felt a little high.</p><p>To conclude;</p><p>I think that this stuff is pretty amazing in how it mimics the effects of MJ. However, the fact that the REAL active ingredients are not listed on the packet seems somewhat sinister to me in retrospect. It seems cynical that I should be sold something labelled as herbs which in fact contains synthetic chemicals, chemicals which can be chopped and changed at the will of the producer to get around the law. Now, I knew that the active ingredients were synthetic, so I can't cry about it too hard. However, having felt poisoned by some more-or-less untested chemical cocktail, I would warn any potential user of this product to bear in mind the nakedly commercial nature of its providence and the somewhat shadowy nature of its content.</p>",
 "year": "2009",
 "id": "79039",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-05-28T07:00:00.000Z",
 "views": "17822"
}
