{
 "id": 7907,
 "title": "Just What I Needed",
 "date": {
  "submission": "2006-05-31T07:00:00.000Z",
  "experience": "0401-01-01T08:00:00.000Z"
 },
 "author": {
  "name": "Rock N' Roll Chuck",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "200",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Modafinil",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I first tried Provigil in Jan. 2004.  I work in production running machinery & I live 32 miles from work.  I was moved to third shift & was having trouble adapting to the new hours, & one day I fell asleep at the top of my off-ramp & woke up just before smashing into the back of a pickup truck at 75 miles an hour.  I swerved & braked & managed to avoid hitting him by less than 6 inches!!!! ",
  "I had read about Provigil in a Reader's Digest article so I asked my doctor to prescribe it to me to keep me awake.  He had never heard of it before so he got out his book & read up on it.  He told me that it was a Schedule III drug but with my circumstances he had no problem prescribing it to me. [Erowid Note: Modafinil is Schedule IV in the United States] He gave me a prescription for one 200 mg pill per day as needed.  I took the first dose that night as I got ready to go to work.  I stayed awake all night & for the whole trip home with no trouble, yet didn't feel speedy or nervous at all.  It did give me more motivation at work, as well as making me more focused on what I was doing.  I now take it every day before I leave for work (I am back on first shift now & had a lot of trouble adjusting back to those hours after being on third shift for a year & a half).  It keeps me awake with no trouble for 14-16 hours but I can also go to sleep any time with no trouble at all. ",
  "I have tried taking two at the same time & didn't see any noticeable difference.  I have noticed, however that if I take it & then drink a 24 oz. cup of coffee within one hour it does tend to combine with the natural caffeine quite well to produce a somewhat speedy feeling.  Soda does not have the same effect, not even Mountain Dew, but caffeine from soda never has had the same effect on me as the natural caffeine from coffee.  However if I drink alcohol while I am on it it puts me out like a light.  I can smoke marijuana with it & it will take a little of the edge off the Provigil, but not enough that it doesn't do what it is supposed to.  I have also spoken with a pharmacist about Provigil & found out that it is not necessary to take it every day for it to work.  If I don't need it that day (like my days off) I can skip it, or if I know I will be drinking later he said to just not take it at all that day unless I take it early in the morning & drink later that evening (like 12-16 hours later).  This stuff is really great for doing what it is supposed to but I haven't taken more than two at once so I don't know what happens at higher doses, nor do I want to.  If I want a good buzz I will smoke a joint because marijuana is the safest drug known to man, in my opinion. ",
  "Here is a description : white caplet with no coating, says PROVIGIL on one side & 200 | MG on the other (the line in between being the score down the middle of the pill).  To my knowledge there is no generic available.  I pay a co-pay of $40.00 for thirty pills once a month.  No idea what the actual price is or the street value."
 ],
 "erowid": {
  "id": "47891",
  "citation": " Rock N' Roll Chuck. \"Just What I Needed: experience with Modafinil (Provigil) (ID 47891)\". Erowid.org. May 31, 2006. erowid.org/exp/47891",
  "substance": "Modafinil (Provigil)",
  "views": "10500"
 }
}
