{
 "title": "Maintaining Addiction with Snuff",
 "author": "Nico",
 "citation": " Nico. \"Maintaining Addiction with Snuff: experience with Tobacco (ID 79073)\". Erowid.org. Jun 4, 2009. erowid.org/exp/79073",
 "substance": "Tobacco",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "insufflated",
   "Tobacco",
   "(plant material)"
  ]
 ],
 "report": "<p>I've never been much of a fan of nasal drug administration because I've always had the idea that snorting in and of itself was a negative act, and it looked bad, especially in public. However, my friends had some minty snuff with them, and being a nicotine addict (cigarettes), I gave it a try. I liked it so much, I ordered eight different flavors of McChrystal's snuff to experiment with: rose, bergamot, lemon, menthol, eucalyptus, spearmint, violet, and camphor.</p><p>Tobacco Snuff, Photo by Earth Erowid</p><p>The first sensation of snuff in my nostrils can be a little painful and discomforting. It burns and feels as if it's eating away at my nasal mucus lining. Thirty to sixty seconds later the sensation fades away and I am left with an amazing aromatic sensorial experience and a growing, almost unnoticeable buzz that only nicotine addicts can relate to.</p><p>Nasal snuff packs quite a punch. I take a pinch between forefinger and thumb, and either lay it out on the back of my hand or make a little line on a flat surface, then introduce it into the nostril. I don't do this particularly slowly, but if done too quickly it feels like inhaling an arrow that awkwardly points out of my ear, or a sharp, burning ache in the sinus that oddly seems to come out of a random point in my head. Twenty to thirty seconds later, the uncomfortable feeling subsides and the nicotine buzz captivates my senses.</p><p>Fruity or floral snuffs usually tend to sting inside the sinuses for the first few times. Also, the nose can become a little runny and stuffed up if too much snuff is inhaled in a single sitting. Breathing through the nose is amazing after taking mentholated (also known as medicated) varieties, because it clears the upper respiratory passages and it feels like my internal air conditioning was suddenly turned on to a cool refreshing mode. I have found it my predilection to use cool snuff for everyday use, and the sweet, perfumed, aromatic snuff for special occasions and nighttime.</p><p>I've been a cigarette smoker for six to eight years now and have experienced negative side effects impairing my physical performance, endurance, and dexterity. Coughing in the morning, being easily exhausted, general slowness, and aversion to physical activity have constantly reminded me that I shouldn't smoke because it increases the risk of cancer and mid- to old-age health disorders. Ever since I started using nasal snuff, my craving to smoke has diminished by 90%. Where I would smoke half a pack to a pack of cigarettes a day, I rarely smoke more than a single cigarette anymore!</p><p>While other forms of tobacco carry their own health risks, I believe the majority of carcinogens introduced by tobacco products accompany combustion; tobacco smoke is oily and sticks to the walls of the lungs. Snuff has helped me maintain my addiction to nicotine while reducing the problematic physiological side effects of smoking. I am almost certain my dosage of nicotine has increased since I started using snuff, but I feel very comfortable with its powerful, aromatic effects, whereas I would feel endangered by health issues related to smoking. I am slowly regaining my physical endurance and vitality, and feel that while nasal snuff can be regarded as a nasty habit, it has greatly contributed to an improvement in my health overall.</p>",
 "year": "2007",
 "id": "79073",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-06-04T07:00:00.000Z",
 "views": "13477",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Tobacco",
   "form": "(plant material)"
  }
 ]
}
