{
 "id": 7909,
 "title": "A Bad Combination",
 "date": {
  "submission": "2007-11-30T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "750",
    "grams": 0.75
   },
   "administration": "oral",
   "substance": "DXM"
  },
  {
   "time": "0",
   "administration": "1.0 g",
   "substance": "smoked"
  }
 ],
 "report": [
  "I've been using DXM on and off for about a year now. My first experience was amazing to say the least. Each time after that it seemed to get less and less interesting and soon it was hardly an experience. So one night I figured I'd use up the last of my pure DXM and it was a pretty boring trip. I woke up really early the next morning, about 8 hours after taking the DXM, and was dissapointed that the trip was so dull.",
  "In my dissapointment and slight discoordiance I remembered I had a gram of pot on me so I took out my bowl and decided I'd make something out of this boring trip. About a minute after I was feeling the normal effects of marijuana, cotton mouth, tingliness, trouble focusing. However after few more minutes passed my cotton mouth changed to a sharp stabbing feeling in my throat, almost like I was choking on my tounge, it became very difficult to breathe and swallow. I could feel my heart pounding out of my body, as I was sweating but felt very cold. I managed to call 911 before having a seizure and collapsing on the floor. The rest is really not worth mentioning, I recommend not combining these 2 drugs.",
  "On another note NONE of the paramedics or doctors or nurses had any idea what DXM was and it came up as opiates in the drug test."
 ],
 "erowid": {
  "id": "47894",
  "citation": " Anonymous. \"A Bad Combination: experience with DXM, Cannabis & Drug Testing (ID 47894)\". Erowid.org. Nov 30, 2007. erowid.org/exp/47894",
  "substance": "DXM, Cannabis & Drug Testing",
  "views": "8519"
 }
}
