{
 "title": "Feels Good Man",
 "author": "Bob Loblaw",
 "citation": " Bob Loblaw. \"Feels Good Man: experience with 4-Methylmethcathinone (ID 79134)\". Erowid.org. Nov 19, 2009. erowid.org/exp/79134",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "123 mg",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)",
   " T+ 2:00",
   "100 mg",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)",
   " T+ 4:00",
   "115 mg",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>After reading about 4-Methylmethcathinone AKA Mephedrone, I decided I had to try some. I searched around, couldn't find anyone cheap enough in my area, so I put it off for awhile. Then one day, I ran into a great connect who had some. I bought a few grams, and went home.</p><p>I pulled out my scale and weighed out 123mg of Mephedrone. This powder is very fluffy and has a faint odor to it. It's damn near impossible to cut decent lines, so I just gave up on trying. I got everything ready, pulled out my glass rectangle and got my straw and razor. Made two very, very, bad looking lines, put the straw in my left nostril, and blew one of them. I then thought to myself, 'Oww, this stings a little.' 30 seconds later, the pain dissipated completely. It wasn't too bad, about the same as pure Ketamine. I tilted my head to the side for better absorption, and tapped the straw to get the excess powder out. I then noticed a physical change to my environment: I felt myself literally 'coming up' on this drug; everything seemed to grow a little. It was a very weird feeling that I hadn't ever felt before. I started to feel absolute bliss and euphoria, so I quickly blew the second line. I was coming up strong now, and I felt godly. I then flicked the straw, and scraped all the remnant powder together to form two smaller lines. Unlike most powders, the Mephedrone seemed inclined to stick to the interior of my straw.</p><p>After consuming all of my dose, I decided to take my shirt off as I was perspiring profusely. I then put an Altoid mint into my mouth to combat the dry mouth I was experiencing. I proceeded to kind of dance around my room and then log onto a forum. I experienced slight visual distortion and perceptual changes; I had to repeatedly re-spell my words (if I even bothered to do so) and fix my grammar. I posted a lot of nonsense as is common on stimulants. This glowing sensation lasted for approximately 2 hours before I felt compelled to re-dose.</p><p>I weighed out 100mg and proceeded yet again to cut two very sloppy lines. I repeated the snorting process exactly as before, and felt almost the same, though the 'coming up' feeling was less present. After this, I again took my shirt off (I had previously put it back on) and got some gum. I felt great again for about 1.5 hours, before I re-dosed once more.</p><p>My third and final re-dose consisted of about 115mg in two lines. I repeated the snorting procedure again and felt a little less high than before. I decided that I would not re-dose again because I needed to eat dinner and get to sleep before 1AM due to exams.</p><p>All in all, this experience was wonderful, and I have since used Mephedrone many times. I love this drug :D.</p>",
 "year": "2009",
 "id": "79134",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-11-19T08:00:00.000Z",
 "views": "16600"
}
