{
 "title": "What's The Story...Morning Glory",
 "author": "White Rabbit",
 "citation": " White Rabbit. \"What's The Story...Morning Glory: experience with Morning Glory Seeds (ID 7914)\". Erowid.org. Aug 11, 2002. erowid.org/exp/7914",
 "substance": "Morning Glory Seeds",
 "bodyweight": "130 lb",
 "report": [
  "<p>Well, this was to be my second time taking MG and the first actual 'trip' on it. Before, I only took 70 seeds with VERY VERY mild effects..but that's another story. Before eating them, I put them all in a small jar of water and some antibacterial soap and removed most of the fungacide on them. I wanted to crush them up in powder but they were very hard to crush so I just chewed them really well. That was at 9:00am.",
  "By 11:00, i was getting really nauseaus and thought I was going to throw up but didn't. The trick to stop the nausea is to sit in a comfortable spot for the next hour or two. At 1:00pm I was starting to feel it really well and the nausea was completly gone. My pupils were IMMENSE. It is very hard to describe the sensation. I had some confusion that at that time when I was thinking of how to describe the confusion, I came up with 'confusing confusion'. When your tripping, it will make sense. I was like the confusion on smaller doses of Xanax in that you think you are completly sober but to other people your actions are very strange. Then I decided to go outside. This is something I've never experianced before...everything looked SO bright and it was very hard to look at the sky for more than one minute. The high is very close to that of marijuana...although not as strong..at this dose anyway, but defenetly isn't something to do with parents in the house. Now in terms of hallucinations...I'd say try about 300-400 seeds for hallucinations because I didn't see anything except for the visuals that you get on marijuana like multicoloured layers around outdoor objects, traces on fingers in the dark, VERY bright lights and colours and that's about it.",
  "The feeling is a mellow kind of feeling...although still possible to freak out. If anyone's looking for a good legal high, this is a good high but the nausea is quite terrible and do not take gravol or dramamine since mixing a deleriant with a pyschedelic is not a good idea. Morning Glory and DXM would be a very interesting mixture...But do your research before trying them because if you do it a lot you can get ergotism and kill yourself. Anyway the nausea is the only downer of the high and make sure you wash the seeds.....enjoy!!!!</p>"
 ],
 "year": "2001",
 "id": "7914",
 "gender": "Male",
 "views": "8977",
 "dose": [
  {
   "time": "0",
   "amount": "170 seeds",
   "administration": "oral",
   "substance": "Morning Glory"
  }
 ],
 "submissionDate": "2002-08-11T07:00:00.000Z"
}
