{
 "id": 7919,
 "title": "Dilation All Around",
 "date": {
  "submission": "2006-02-14T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "lucid",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "14",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "5-MeO-MIPT"
  }
 ],
 "report": [
  "A review of this chemical provided some insight into the mipt class of tryptamines.",
  "My favorite compounds from shulgins books must be as follows: 2ce, dipt, 2ct7, 2ci, and mmda.",
  "Subjectively, this is best compared to the oral active 5-meo-dmt and 5-meo-dipt higher tuning. Visually, it is almost mute, aside from the visual display I get during a runner high that seems to permeate the vision for the entirety of the trip, along with some technicolor-like color huing. Some mild breathing, but again like a runners high. Greens seem to be enhanced. Closed eyed, just as ininteresting, though music sounds absolutely alive and vibrant.",
  "Auditory acuity is markedly enhanced, to the point of asking myself, was this compound well liked for military service? ...Due to its not unpleasant ridgidy in thought, and key muscular areas involved in prolonged walking. I can hear peoples foot steps, or murmurs at least 3x better than normal. As a musician, this is quite amazing. Unlike dipt, which produces psychedelia ( mind manifesting ) through its disharmony and discord with normal processes, especially those relating memory to sounds and interaction thereforeof, this seems associative and mind-clearing as a psychedelic.",
  "All around, I would proclaim this substance to be a dilator, in the pupil, time, depth perception and reception sense. I feel as though i can process 3x as much within",
  "reality's time, much akin to that of a low dose of mushrooms. Very valuble meditation tool, and conversation seems enhanced, especially that of a listener. This would be perfect for a psychologist to listen to the rantings and outpour of someone on mdma, I would imagine. I found myself thinking very, very objectively with little fantasy outside of when I sat and listened to music, even then I found myself objectively forced to hear how each chord was created, or how it could be skewed to my liking.",
  "I dont blame anyone who claimed this to be near stoning, though the mental aspects are like sativa, the body high is definitely a mix between a somewhat nauseating foxy and kali mist. 6/10, I definately like it but probably wont give it another try.",
  "This compound set in at about 45mins after ingestion, plateaued from 2 to 4 hours, and came down quite rapidly from that point with no need for any help in sleep."
 ],
 "erowid": {
  "id": "47940",
  "citation": " lucid. \"Dilation All Around: experience with 5-MeO-MIPT (ID 47940)\". Erowid.org. Feb 14, 2006. erowid.org/exp/47940",
  "substance": "5-MeO-MIPT",
  "views": "11663"
 }
}
