{
 "title": "Ambulance Ride",
 "author": "OG_kush7",
 "citation": " OG_kush7. \"Ambulance Ride: experience with Ketamine & Cannabis (ID 79219)\". Erowid.org. Aug 3, 2009. erowid.org/exp/79219",
 "substance": "Ketamine & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "125 mg",
   "IM",
   "Ketamine",
   "(liquid)",
   "",
   "125 mg",
   "IM",
   "Ketamine",
   "(liquid)",
   "",
   " ",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "report": "<p>Ill start off by saying that Ive done ketamine several times before. I started off insufflating it but with my recent depression I started taking it intramuscularly. I started off with reasonable doses: maybe 100mg, but then I started taking more and more. This experience is my worst (and last) experience on ketamine. [My bad experience starts later into the night, so skip the first bit if you only want to hear about my suffering o.O]</p><p>I was sitting in my room and had nothing to do tonight so I figured that I could do some ketamine. I went to my bathroom, rubbed with alcohol and injected myself with 125mg of ketamine. I then also smoked a bowl of some killer chronic (OG kush). I sat down on my computer and blasted infected mushroom music while looking at some visuals. All was good; I had a very upbeat, euphoric feeling at the time. What seemed like hours went by, but was only minutes... one song had finished. I sat there for another 20 or so minutes basically looking at my screen saver and listening to the music. After a while I started to get bored so I looked for some downloaded TV to watch. My dad downloads a lot of shows and I thought Id watch one Id never seen before. The show I came across was called The Unit, a military show about an elite squad who operates outside the law. I dont really remember anything from the first episode, I was still tripping balls. As I was coming down off the high, I continued to watch episodes 2 and 3 of the show. I was pretty much sober at this point and I thought I should give myself some more ketamine.</p><p>This is where it gets bad. I got the syringe, and injected myself IM with another 125mg of ketamine solution. I guess the effects from the first time hadnt completely worn off because I felt immediately more wasted than before. I could barely make it out of the bathroom and into my closet where I was going to stash the syringe. Its about 1:00AM at this point and I dont want my parents to know Im awake, so I kept the lights off. Now, Im stumbling into my closet. I feel a huge darkness surrounding me and I look behind me to see that my room is hundreds of feet below me. I know this is the drugs but I cant help but become frightened that I am so far away from my body. The last image I remember was the lights of my computer in what seemed like a great distance away.</p><p>The next thing I know Im looking up at a bunch of lights and theres a woman sitting beside me. I was incredibly out of it still and was really confused. I was holding my hands together really tightly and couldnt stop, but didnt really realize it at the time. I knew I was lying down but I couldnt see properly. I remember talking to the woman, answering questions in a very groggy manner and asking some of my own. I eventually figured out that I was in an ambulance. I thought it was a dream at first, but as I sobered up I could tell that I was actually in an ambulance, connected to machines and breathing pure oxygen. The woman (a paramedic) told me that my dad was following the ambulance in his car and that we were going to the hospital. She asked me if I was on any drugs and said that my mom had informed her that she had found ketamine in my room. I denied this because I was scared and I didnt want anything I said to be used against me later.</p><p>The ambulance trip cant have lasted more than 15 minutes but it felt like hours. The paramedic asked me so many questions, trying to assess my condition. I dont really remember much, but I do remember being transferred onto a hospital bed and hearing the nurses talk. The paramedic was joking with the nurse that she was glad I didnt piss myself, saying Its always a bonus when they dont urinate all over themselves.  I sat in that bed in a hallway of the hospital for a while  still surprisingly fucked.</p><p>The nurse comes over eventually, drags me into a room and connects me to a bunch of monitoring equipment. She told me that my dad would be there in a minute, and sure enough there he was, carrying some of my Simpsons comics to pass the time. While we were there (which was for like 2 hours because it was the middle of the night and there was only one doctor in the entire hospital) we talked about what had happened. Apparently my parents heard a thud in the middle of the night, knocked on my door and when they didnt hear a response, they opened the door and found my passed out in my closet. They called 911 and after five minutes I had woken up but couldnt see or hear them. I was clenching my fists and convulsing. The ambulance came and took me to the hospital, and that is how I got there.</p><p>I admitted to the doctor that I was using ketamine, although only saying that I was consuming it orally. He said that since my symptoms were 100% indicative of ketamine use he wouldnt need to run any tests and I was free to go. That ends my nightmarish last time with ketamine.</p>",
 "year": "2009",
 "id": "79219",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-08-03T07:00:00.000Z",
 "views": "7873"
}
