{
 "title": "From Darkness to Light",
 "author": "Tabitha H",
 "citation": " Tabitha H. \"From Darkness to Light: experience with Mushrooms - P. cubensis & Cannabis (ID 79234)\". Erowid.org. Aug 21, 2010. erowid.org/exp/79234",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "3.5 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(ground / crushed)"
 ],
 "report": "<p>I was told that my first mushroom experience would be special. All of the stories of experience in the world could not have prepared me for the truth of what would happen, however. It was the one year anniversary of my boyfriend and myself. I had begun smoking cannabis regularly that year thanks to him and enjoyed it very much. It being the only drug I had tried, Josh suggested to me that I try mushrooms. He enjoyed them very much and though I was nervous about trying something psychedelic, I was also excited.</p><p>I spoke to my father about it (being an experienced drug user from his youth I valued his opinion), and he suggested a method of consumption that he and his friends had often used. They would mix their mushrooms with orange juice in a blender then take the resulting slush as shots. When I told my boyfriend this, he thought it was a great idea. We borrowed a blender from someone and Josh brought back a quarter ounce of shrooms from Schwagstock, a local hippie festival which at that point I hadnt yet attended. The night we planned to do the mushrooms we were at his apartment. Josh had made me spaghetti to eat but I was too nervous and, not realizing the effects of an empty stomach, didnt eat much. Josh and I had smoked a few bowls of cannabis to loosen me up and prepared one for the duration of the trip. We never got to that bowl. Josh, who had tripped several times before that, dumped the entire bag into 4 shots worth of orange juice, 2 for each of us.</p><p>When I picked up the first shot and put it to my lips, I was washed in anxiety and nervousness but pushed through and took the shot anyway. It tasted awful, but I had known it would. I took the second shot, Josh seemingly having long since downed his. I went to sit down in the living room. After 10 minutes, I mentioned to Josh that the colors on South Park seemed to be brighter and vibrating to which he responded I was just nervous and wanting them to. He said there was no way I could be feeling them yet, that I had about an hour yet before they really kicked in. Five minutes later, a huge uncontrollable or erasable smile cemented to my face and I noticed that a sculpture of a dragon that Josh had sitting next to the TV was writhing. Josh immediately conceded that he was most definitely feeling it already and that those oj shots had really made the difference. At that point, we had no clue just how much of a difference.</p><p>Some events that took place in the next 20 minutes lack chronology and have blurry spots, but I remember enough. Somehow I decided that sitting up in a chair was too much stress so I lay down in the living room floor after removing all my clothes claiming that it was way too hot in his apartment despite the AC blaring. I looked up at the ceiling and was shocked by its absolute beauty. It seemed to be made out of thousands of iridescent bubbles shimmering and shifting in circles. I invited Josh to see and he did, just as amazed as I was. Josh sat up next to me still on the ground and looked around his apartment with sudden awe. His face was masked with what I can now recognize as the detachment/connectedness of tripping. As I watched his features shift with frightening rapidity between expressions varying from elated to confused to awed, I began to feel extremely overheated. My breathing sped and I was suddenly awash in everything all at once. It was too much. Far far too much.</p><p>The rooms colors began shifting uncontrollably and when I looked back at Joshs face, it was contorted into something red and frightening. I rolled to my side and curled into the fetal position as the muscles in my body tightened without release while shivering like I was in the throes of an awful fever. Closing my eyes, my breath was sucked from my lungs as I was projected at light speed through what I can only describe as infinite dark matrices. I was surrounded by and pushed through what seemed to be the rods and balls of 3d molecule models. It felt as if my entire body was being thrown through space and I couldnt stop the feelings within me or images before me. Opening my eyes after what seemed an eternity, I rolled to face Josh and whimpered to him that it was too much and wouldnt stop. He looked at me dazedly, lost in a trip as strong as mine, but not so dark. He said to calm down and not think too much about it to which I replied that that was of course impossible.</p><p>Every time I looked up at him, things got worse as all I could think was What if something happened? He couldnt help me at all. I was preoccupied with the fact that he was messed up and that frightened me very much. His erratic facial expressions bothered me. He suddenly began pouring out profound and deep philosophic thoughts which seemed to hit me one by one with enough weight to make me beg him to stop. I wouldnt allow myself to think about the things he was saying; it seemed that doing so would send me into an even deeper state of consiousness, something I wanted to avoid at all costs. I thought again and again What have I done? All horrible events which could possibly happen occurred to me and worsened my state by the minute. I felt as if there was evil inside of me. I became convinced that I could feel the dark energy that surrounded us both and it was absolutely terrifying.</p><p>I tried to focus on the passing of time, attempting to remain focused on the knowledge that I was just tripping and that must logically come to an end sooner or later. I went to the bed and closed my eyes again and was blinded by the colors that flashed before my eyes. It seemed that there was a subway train flying through my eyes sending blinding lights zooming past my vision. I lay there with my body and jaw clenched, sweating profusely as I was completely overwhelmed by the very existence of the universe. I was too connected and couldnt take it. Finally after what I was ABSOLUTELY POSITIVE had been at least 2 or 3 hours, I opened my eyes hoping to be comforted by the knowledge that it couldnt possibly last much longer only to discover to my horror that only a little over 15 minutes had passed.</p><p>With the knowledge that the mushrooms werent probably even fully diffused into my system yet, I went to the bathroom and forced myself to violently throw up. Even as I leaned against the bathroom wall having just finished, I felt somewhat better. I returned to the bedroom and lay back down next to Josh. As Josh continued to be completely detached and speak of philosophy, I couldnt shake the darkness that seemed to surround me. I felt with all my being that he needed to care about me and for me, something he simply couldnt do in his current state. Josh, who as genuinely concerned for me to the best of his abilities, made the difficult decision to give up the best trip of his life and went to throw up as well so he could care for me. After doing so, he returned to bed and pulled me to curl up against him. We both cried and held each other and prayed and promised that we would never do mushrooms again.</p><p>Suddenly, it felt as if out of nowhere a cool breeze washed over me and it was over. The evil as gone and everything glowed with purity and beauty. I suddenly took a deep breath and discovered that I felt connected with everything still, but I could take it now. I began to touch Josh and have him touch me because it felt so amazing on a completely non sexual level. I was touched by what I described at the time as complete and perfect knowledge of the universe. Though I cant remember what they were now, I too spouted deep philosophic realizations for the next 10 or 15 minutes, though it seemed like much longer.</p><p>At much the same time for each of us, our trip ended completely. Despite what had been possibly the most horrible and traumatizing experience of my life, I was left with a feeling of sadness at having lost the feeling. Josh, too, was very upset that he had thrown up. The last 15 minutes had somehow made me understand that what I had gone through may have been worth it. It made me wonder if such a deep realization of the universe had been granted me only through the price of seeing its evil as well. Though we regretted it in the moment, we fully understood that what we had done had been necessary considering what I had been going through.</p><p>Since that time, Josh has done mushrooms many times though he has never been able to find a trip as strong or profound as the one we experienced that night. I, myself, have since never been able to bring myself to try mushrooms again, and I dont think I ever will. I have come to the conclusion that my mindset is too damaged for mushrooms and the anxiety surrounding what happened would be enough to cause myself to repeat the experience. I still look back at the final moments of my trip as some of the most amazing and tangible I have ever experienced. I believe that some people search their lives for what I found, and I dont feel that I would be able to achieve it again if I tried. While I would love to repeat that feeling, something in me tells me that that was it for me.</p>",
 "year": "2008",
 "id": "79234",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2010-08-21T07:00:00.000Z",
 "views": "1704",
 "dose": {}
}
