{
 "id": 7936,
 "title": "8-Hour Layout",
 "date": {
  "submission": "2006-03-01T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "herr Duke",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 mg",
   "administration": "sublingual",
   "substance": "Buprenorphine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "0.5 mg",
   "administration": "sublingual",
   "substance": "Naloxone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "So a guy came to my room and offered some 'opiates.' It was a little orange hexagon with N8 on one side and a sword on the other. Suboxone, 8mg buprenorphine and 2mg naloxone. A lot of other people have reported positive experiences after taking 16mg but I had a negative one with 2mg. In subsequent trials I've found it to be a rather pleasant addition to alcohol or something else, but BE CAREFUL ABOUT MIXING, I only took 1mg at a time tops after this. I've also done hydrocodone, oxycodone and opium. Suboxone feels closer to opium in certain ways than oxy/hydro, but I like oxy/hydro more because of the euphoria.",
  "I jotted this down but clipped the long rants about drugs and politics that I launched into later in the evening. Also, I ate several grapefruits the previous day, so this could've helped to inhibit metabolization of the drug the next day.",
  "8:00pm\tSublingual administration of oh sweet lord this pill tastes like shit sublingual administration of perhaps 2mg buprenophine. In the name of science and recreation, lets see what this does I say",
  "8:18pm\tThis might have been a really bad idea",
  "8:30\tFor some reason everything is a lot funnier right now",
  "8:38\tAnalgesia and sedation noted, not very much like typical opiates, this is more sedated, a very different effect. I am a little bit nervous thinking about it because this is some high powered shit and if I overdose I am totally fucked, there is no antidote. On the plus side its supposed to be a lot harder to overdose on this than on heroin or methadoneof course, that isnt the most ecstatically reassuring thing I couldve heard. Im also a little wary of what the drug is doing because its not supposed to hit for an hour or two and will continue to affect me for the rest of the night and probably tomorrow.",
  "8:55\tHoly shitwowholy fuckdifficulty typing, analgesia and sedation very pronounced but without as much of a euphoric nod this is very enjoyableholy fuck I still have like  of a pill left and this does not produce tolerance. If I switched between this and opiates like hydrocodone and oxycodone every three daysoh my God I feel stoned out of my gourd.",
  "9:00\tIt is T+60 and I am feeling stoned. Not as euphoric and wonderful as other opiates but very nice in its own right. Furthermore, buprenorphine and naloxone will make sure that I dont do any more opiates this weekend because they wont have any effect. The great thing about that is that I can take them at full intensity within several days. Shit, I wish I had bought more of these pills from that guy, I only got two and the one is in use. I should be able to get at least two more doses out of this one pill. Holy shit, high powered narcotics. Not as euphoric though, strangely enjoyable but dissimilar from other opiods.",
  "9:14\tOh sweet mighty lord of fuck who art in the world, this is some mighty fine shit. Im watching Fear and Loathing in Las Vegas, circumstances dictate that this must be watched by me right now, it is highly necessary for the ambience, after all. Some symptoms of slight nausea.",
  "9:30\tEffects still intensifying, nausea increasinguh oh",
  "10:45\tThis is not a game, these are not playthings. All substances, including caffeine pills, beer and pot, can be extremely dangerous if used improperly or stupidly. Some substances carry far greater risks. What I just took is one of those drugs with a far greater potential for damage. I just spent the last hour wondering if I was going to die and I still feel sick. Symptoms: tremor, respiratory depression, intense nausea. Whenever I moved it felt so much worse but when not moving I was afraid that Id fall asleep and never wake up.",
  "The difference between these things is a difference of degrees, of calculation. The difference between certain drugs can be the difference between a gun and a pocket knife. A miscalculation with a pocket knife can mean a small stab wound in my leg or accidentally making a small cut on a siblings arm. A gun can mean instant death. The room for error diminishes. I made an error.",
  "Holy fucking shit, I couldve probably just licked that goddamned pill and been stoned for hours. I only sucked on it for a couple of minutes, just enough to dissolve about  of the pill. As I write this I feel sick and shaky, very nauseous and generally feeling like crap, I still might vomit. On the plus side I am able to move, even being able to type and open my eyes or sit upright is a vast improvement.",
  "(intermission)",
  "11:01\tEating a nacho pretzel thing did not help matters. I just threw up, a lot, Im talking projectile vomiting here. That helped, a lot. Im not supposed to come down for another few hours but at last Im past that shit. I still feel totally fucked, not in a good way, more in a delirious and unbalanced way.",
  "Shit man, this drug ought to be measured in micrograms. One of my biggest rules for doing drugs is to never do more than half the typical dose of a drug Ive never tried before. I did half of that, so a quarter of the dose. I should have done half of what I did at most, 1/8 of the pill. I cant believe heroin addicts take the whole fucking thing. It seems like something that would probably work very well for its intended use.\t",
  "Its 11:35, Im rambling and I still feel totally fucked up but without feeling very good. Its not euphoric so much as just delirious, nauseous and sedated. I wonder if I went through immediate withdrawal because of it, I may have taken enough hydrocodone and oxycodone for that to have happened. Shit, I may try this again but next time Im only taking a few licks off that fucking thing.",
  "12:11am\tNow that Im not retching or worrying about my life or anything I can study the effects of the drug on a non-overdose level. It feels very pleasant but its definitely not the all-out euphoric bliss of other opiate drugs. This is a much more subtle and refined sense of well being, none of the kitschy or loud or gaudy effects of your standard opiate. While I do prefer the other opiates this is just, I dont know how to describe it other than more classy, even though I just puked from taking too much. You can order a greasy pizza or burger and some Chinese food in all of its overindulgent goodness or you can get a nicely done steak served with a fine red wine. This drug is the latter in the world of opiates. The problem is that its so fucking intense and long lasting. I like hydrocodone and oxycodone a lot more. Im starting to feel sick so Im going to lie back down. Jesus, shit fuck, Im not going to come down for hours.",
  "12:30am\tThis drug totally ruined my evening.",
  "1:55am\tIm still stoned and somewhat nauseous, my night is totally wasted as I neither did work nor did I hang out with people. I wanted to spend the time with Hannah/Emily but shes probably asleep now. Im a fucking tool.",
  "5:03am\tAs expected I am still feeling some of the effects of the buprenorphine, by far the most powerful and heinous drug Ive ever put into my body. It was actually incredibly stupid for me to have done that, I seriously could have died tonight. Were not in candy country anymore kids. Christ, the guy came up and was like hey, anyone want any speed? and naturally I invited him into my office. He said yeah Ive got Dexedrine, Adderall and some opiates so I said oh? What kind of opiates? uh, this stuff (I forget what he called it but I dont think he said Suboxone) they give it to recovering heroin addicts, its pretty new. They told me only to take like half but goddamn, if I had known then what I know now I wouldve told them to be careful as fuck with that shit. Good for heroin addicts to kick their habit, more dangerous than maybe even smack for the typical recreational user.",
  "Afterwards:  One very odd thing is that I took two Vicodin Tuesday night after doing Suboxone Friday night. It was so weird, I could feel the hydrocodone gradually kicking in and then *click* something happened and it stopped dead in its tracks. Buprenorphine has a really long half-life. Several days later it was still affecting me and had stopped the Vicodin from working. I could feel the hydrocodone get knocked out of the receptors in my brain. I'd like for someone to do research on that because it felt like all of the receptors were used for the hydro but the meager amounts of bup knocked them out leaving a deficit. It sucked ass, I was ready for a great opiate high and then I got the opposite.",
  "I did lick the pill later on and it did get me high. Might just be me but I've done a fair number of drugs and it hit me harder than anything else I've ever done."
 ],
 "erowid": {
  "id": "47997",
  "citation": " herr Duke. \"8-Hour Layout: experience with Buprenorphine & Naloxone (ID 47997)\". Erowid.org. Mar 1, 2006. erowid.org/exp/47997",
  "substance": "Buprenorphine & Naloxone",
  "views": "44274"
 }
}
