{
 "id": 7939,
 "title": "Happy, Waiting For The Comedown",
 "date": {
  "submission": "2007-08-12T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "med",
  "gender": "Male",
  "weight": 58
 },
 "dose": [
  {
   "time": "0",
   "amount": "54 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "pill / tablet"
  },
  {
   "time": "0:05",
   "amount": "54 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "pill / tablet"
  },
  {
   "time": "0:50",
   "amount": "54 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "pill / tablet"
  },
  {
   "time": "2:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "plant material"
  },
  {
   "time": "2:10",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "plant material"
  },
  {
   "time": "2:20",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "plant material"
  },
  {
   "time": "2:35",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "plant material"
  }
 ],
 "report": [
  "The consumption:",
  "Today at school, during lunch, a friend of mine handed me three 54 mg pills which were dark red with a marking 'aiza 54' on them. I took one with my strawberry milk after eating my lunch (food is important here because I won't be eating till I am done with the effects of the drug) About 5 minutes later I took another pill and then in several minutes I began to feel the familiar effects: I was happy, and full of energy. It was like I was a kid again, with no worries. I also had the familiar feeling of wanting to do something really bad but not knowing what it was. I sort of love this anticipation/rush even though some people find it uncomfortable. I kept talking to my friends and had a pleasent time, then went back to class. I had half an hour in this class, Statistics AP, and I did very well on the problems we were given to complete. I was very focused and actually concentrated very easily. I went to my next class, English, and we watched a movie called 'The Pit and the Pendulum' with Vincent Price by Edgar Allen Poe. The plot seemed to move by very slowly, but I sat and watched eagerly while my friend just drew psychadelic pictures in her notebook. I managed to pay attention to both, and talked to her while paying attention to the movie as well. I popped another pill (This was about 45 minutes from the last one) and I soon felt  another unbelievable rush. My eyers darted all around the room and I was extreemly happy. Colors were vibrant, and I could notice the dull expressions of boredom on everyone else's faces. Soon after, the class ended and I had to go to Physics. Because I had work to turn in that wasn't yet completed, I decided to skipthe class and just stay in the bathroom the whole time. People came in and out, but when it started to die down I lit up a cigarette (This is two hours after the initial dose, and during the rush of all three pills) but someone came in and saw me a minute after I lit it. I rushed out the door and into the hall where I fled from the school out to this wall outside where I am hidden from everyone. My adrenaline was rushing a bit, which I also felt enjoyable. While outside, I smoked two cigarettes while reading The Pit and the Pendulum by Edgar Allen Poe. I wanted to see how the movie ended, so that is why I read the book outside. I was outside a total of 40 minutes, and I continued to feel great during that time. Next was the bus ride home and a cigarette once I got home. I noticed that my cravings for cigarettes can be increased while on this stimulant.",
  "Reflection:",
  "It is 5 hours since the initial dose, and I am just starting to come down from the Concerta. I still feel great, but there is a lingering feeling that like some times I do it (About 50% of the time for me) I get high and feel really good, but then go down to a low and I am depressed for about the same length of time. I don't feel like hurting myself or anything like that, but I do feel like I need a little but more Concerta to bring me back up. This is an addictive potential that must be watched out for. Another thing to watch is my dose; I only go with 2:1 your body weight in pounds with mg of concerta. This has worked for me.",
  "Effects:",
  "A summary of effects is that feeling of anticipation (also known as the 'rush', which is very different from a cocaine rush) and an occational burst of adrenaline, which will boost the rush and make my body feel kind of high, similar to the body effects of marijuanna. For me, there is also the 50% chance of a low afterwards which is likely to be more with other people. I think that the high is higher from normal than the low is lower from normal, so I don't find it too bad.",
  "Please be warned that I have seen some people, after using high doses, be on the verge of suicide during the low. I think this drug can be very dangerous, and should be handled with respect to your body and mind, as with all drugs. It's fun to do every once in a while, like oxycodone, but can be dangerous when used too often. I do it less than once a month."
 ],
 "erowid": {
  "id": "48017",
  "citation": " med. \"Happy, Waiting For The Comedown: experience with Methylphenidate (Concerta) (ID 48017)\". Erowid.org. Aug 12, 2007. erowid.org/exp/48017",
  "substance": "Methylphenidate (Concerta)",
  "views": "44264"
 }
}
