{
 "id": 7940,
 "title": "Recommended Combo",
 "date": {
  "submission": "2007-04-12T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ben",
  "gender": "Male",
  "weight": 85
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "162",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Methylphenidate",
   "form": "ground/crushed"
  },
  {
   "time": "0",
   "amount": {
    "number": "6.0",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Lorazepam",
   "form": "ground/crushed"
  },
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Lorazepam",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "My mindset prior to the ingestion of 6mg lorazepam tablets was relatively calm. Having Cyclic Vomiting Syndrom (CVS), I'm prescribed this medication through my psychiatrist and have had much experience with it, and its effects on the body at different dosages and routes of entry (IV in the hospital, for example).",
  "The drug itself is intended to be used for a number of symptoms, including nausea, anxiety, and muscle stiffness. However, I find myself, for the most part, using it as a recreational drug instead.",
  "*Note: Beginning at morning and continuing until the time I",
  "   consumed the lorazepam, I had taken a total of",
  "  162mg of methylphenidate by means of 3  54mg time-released",
  "  Concerta capsules (crushed to increase rate of reaction).",
  "Prior to ingestion, I crushed the tablets up and mixed them with a drink; might as well let it dissolve quickly.",
  "_________________________",
  "7:30 PM - I have taken the 6mg of lorazepam on an empty stomach.",
  "7:45 PM - Notice that my head is feeling a bit lighter and my muscules, tense from the methylphenidate, are beginning to become more relaxed.",
  "8:15 PM - I'm feeling completely calm and content, almost warm. My visual perception has been altered. When I move my eyes, objects leave a faint trail.",
  "8:30 PM - I insufflate another 2mg lorazepam. My vision is further altered (comparable to an alcohol buzz) and time seems to have slowed. Walking around, I feel completely free of all anxiety and a bit drowsy.",
  "9:30 PM - After an hour, I'm still feeling the same effects, but they are slightly diminished. I would assume that the methylphenidate allows for the lorazepam effects to be exhacerbated and extended to some degree.",
  "10:30 PM - The apex of the experience is just about done and I'm left still feeling relaxed as ever and I will for another 4 hours, given the half-life and properties of th medication. A general, recommended dose should last about 6 hours before readministration is needed, on average, depending upon the weight and type of the individual taking the drug.",
  "In retrospect, this was a well done and worth-while experiment. I highly recommend the combination of both the methylphenidate and lorazepam. However, just the lorazepam alone should be plenty to keep you occupied and interested. The primary benefit of using the methylphenidate and lorazepam together is that you can get the desired effects from the lorazepam, with the omission of the fatigue -- which is combatted by the methylphenidate."
 ],
 "erowid": {
  "id": "48019",
  "citation": " Ben. \"Recommended Combo: experience with Lorazepam & Methylphenidate (ID 48019)\". Erowid.org. Apr 12, 2007. erowid.org/exp/48019",
  "substance": "Lorazepam & Methylphenidate",
  "views": "31521"
 }
}
