{
 "title": "Awesome Body High",
 "author": "chicknlittle",
 "citation": " chicknlittle. \"Awesome Body High: experience with 2C-I (ID 79410)\". Erowid.org. Jun 30, 2009. erowid.org/exp/79410",
 "substance": "2C-I",
 "bodyweight": "130 lb",
 "report": "<p>So my experience with 2C-I was great! It didn't last as long as shrooms and it made me trip pleasantly. I took one scoop of my 100 mg (scoop was the tip of a new little cuticle pusher stick I had because I didn't want to take too much). I instantly felt warm but no tripping or 'mdma' type feelings. I was asked to go to the mall and I figured if I was around people it'd be better because I know myself  when I eat shrooms or roll.</p><p>Anyhow I snorted a little more because I just couldn't feel it and heard that it may be better that way. As soon as I did it burnt my nose a little and I got drainage but I've had worse with coke. As we were on our way to the mall I started getting an awesome body high and couldn't stop joking around with my friends who didn't know I was tripping. Almost an hour later I really started feeling the effects (This was TWO hours after I took it and only one hour after I snorted it). I saw how beautiful the colors in the store were and people started looking creepy like they normally do when I trip. I didn't realize it was so psychedelic! I thought it was a happy people drug (which it was) but I really felt like I was tripping my balls off! The colors in the store got too intense! Lol I'm shopping there as soon as I get paid because my memory was great on it and I remember every item I saw. Also a neat effect was the tracers I produced when we were driving back home, the sky looked like it kept having shooting stars and flickery type streaks.</p><p>It lasted just long enough. It was gone by midnight and even though I started drinking beer to calm myself down a little so I would be calm by the morning, I had a great time with my friends who didn't know I was tripping. I think it's more fun to be around people that don't know your tripping when it's not so powerful that you freak out.</p><p>I woke up this morning with a slight headache but I can't tell if it's the beer or the 2C-I. Either way I can't wait to go to the club with it!</p>",
 "year": "2008",
 "id": "79410",
 "gender": "Female",
 "timestamp": "2009-06-30T07:00:00.000Z",
 "views": "2963",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "2C-I"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "insufflated",
   "substance": "2C-I"
  }
 }
}
