{
 "id": 7941,
 "title": "I Must Play Before Work",
 "date": {
  "submission": "2006-07-10T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Miraculix",
  "gender": "Male",
  "weight": 110
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "4-HO-DiPT",
   "form": "(capsule)"
  },
  {
   "time": "2:30",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "4-HO-DiPT",
   "form": "(capsule)"
  },
  {
   "time": "2:30",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(tar / resin)"
  }
 ],
 "report": [
  "First dose was 20 mg and orally ingested. I had been eating food about three hours before. I was not aware of this substances existence before I got in my hand. The only thing that my humble friend new about it was that it had been a legal substance when buying it. But the person who had let us try this rare hallucinogen must have been saving it for two years or so.",
  "For the settings we moved us over to my apartment to get our self some chill time of our own with out my friends children and wife to see it happen.",
  "The onset must have been about one hour or so. The first feeling was similar to the light disoriented feeling some of the cheap acid we had done years ago. Almost like the brain puts in a pause to get all signals substances on a new task. And the chemical taste/feeling fills up the first sense just like acid does. (For me that is) Then ends similarly to the real thing. It takes me on a mild wobbly walk through a slightly more warm colored reality then the one we always like to escape. Nothing more of OEV than that. Other senses that gets a boost is changes between all basic things like taste, smell and feeling the bodys structures.",
  "Just when I connect that feeling to what it is it moves to the next. Like a shuffled playlist for senses. After about two and a half hours, we took the last cap of 10 mg. After about a half an hour the first time gaps appear. It kept standing still looking straight out at nothing. Then the phone rang. We started to do what we did before like nothing had happened. I mixed the music we listened to and he finished his phone call. After that more and more of our feeling got stabilized and the psychedelic trance got in to it for real. We had listened to it all the time but it was like the brain filtered it away before.",
  "Now we started to smoke hash to get it going on more. It did not gear it up like I thought it would. It just made my body more based in the room. And rhythmic in part they moved to the beat. Thats mostly the rest of the nights theme. We talked about all things came to, our minds and our souls were perfectly balanced and it was a nice comedown. When the suns first beams rose over the roof tops did we took some nice  fresh passion fruit for breakfast. Then around seven he left to walk home to his beloved family, and did a basic shower and shave. Got my worker clothes on and got on the bus to work. It was a nice afterglow on a fine day."
 ],
 "erowid": {
  "id": "48024",
  "citation": " Miraculix. \"I Must Play Before Work: experience with 4-HO-DiPT (ID 48024)\". Erowid.org. Jul 10, 2006. erowid.org/exp/48024",
  "substance": "4-HO-DiPT",
  "views": "6224"
 }
}
