{
 "title": "Can You Believe It's Not Cannabis?",
 "author": "skipper09",
 "citation": " skipper09. \"Can You Believe It's Not Cannabis?: experience with Spice Product ('Diamond') (ID 79428)\". Erowid.org. Jun 27, 2009. erowid.org/exp/79428",
 "substance": "Spice Product ('Diamond')",
 "bodyweight": "117 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(dried)",
   " T+ 1:20",
   "200 mg",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(dried)",
   " T+ 3:25",
   "200 mg",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(dried)",
   " T+ 4:10",
   "300 mg",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(dried)",
   " T+ 4:40",
   "200 mg",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(dried)"
  ]
 ],
 "report": "<p>After having previously tried other smoking blends (not Spice) I decided to try Spice Diamond, which seems to be believed as the strongest blend by many. I bought 3g of spice diamond to try. I decided to take it one day when I had nothing better to do and was relaxed.</p><p>T + 0.00 bonged approx 0.3g SD (spice diamond)</p><p>T + ~0.15 Begin to feel mild euphoria, head feels 'heavy' mild visuals such as trailers and flashes of colour occur</p><p>T + 0.30 Feels like having eaten cannabis, keep sorta day-dreaming then snapping back to reality. Still euphoric and has mild visuals including geometric patterns.</p><p>T + 1.20 Bonged approx 0.2g SD</p><p>T + ~1.35 Feels effects of second bong feels like lots of pressure on head</p><p>T + 1.55 Am very giggly and easily distracted, visuals very prominent.</p><p>T + 3.25 Bonged approx 0.2g SD</p><p>T + ~3.40 Effects of this cause myself to become a lot less coherant. Laughing a lot and thinking things in head but responding to them by talking to myself and not really aware of doing it much to partners amusement, euphoria is not really experienced now or onwards more a distancing from 'self'.</p><p>T + 4.10 Bonged approx 0.3g SD</p><p>T + ~4.25 I am now having trouble concentrating at all, easily distracted by visuals and thought mostly sit around staring at the walls laughing and getting audio halluncinations, this all is reminding me very much of eating cannabis.</p><p>T + 4.40 Bonged approx 0.2g SD</p><p>T + ~5.00 Can barely stay awake now keep closing eyes and drifting off, lost in thought and closed eye visuals, feel sick, eyes keep going out of focus and am hardly aware of where I am.</p><p>T + ~6.30 Last hour or so has been very hazy cannot remember much may have been asleep though I think I watched tv and laughed a lot. Feeling as though may vomit but may be due to the amount of crap having eaten due to EXTREME munchies.</p><p>T + ~7.30 May have been asleep again or may have just been sitting thinking to self not sure as thoughts are so vivid in mind. Still feeling sick but not so much.</p><p>T + ~9.00 Feeling a bit paranoid/anxious and slow. Severe memory loss for last few hours, somehow managed to break phone during this time -no idea how this was achieved. Eventually I fall asleep.</p><p>T + ~15.00 Wake up very confused and still feeling distracted and heavy headed, eventually manage to get back to sleep.</p><p>T + ~16.30 Wake up STILL feeling as if stoned, effects are basically identical to eating cannabis or smoking A LOT of it.</p><p>T + ~19.00 Still feeling stoned and still have munchies</p><p>I am very impressed with this smoking blend is almost the exact same as cannabis for me and is very reasonably priced though I feel I may have taken a little too much for first time.</p>",
 "year": "2009",
 "id": "79428",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-06-27T07:00:00.000Z",
 "views": "9505",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "300 mg",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids",
   "form": "(dried)"
  }
 ]
}
