{
 "id": 7946,
 "title": "The Happiest Turd in History",
 "date": {
  "submission": "2008-02-04T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "EdinburgHigh",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "rectal",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "This is kind of a 'non-trip' report, but I think it's worth sharing.  I thought I'd try 'plugging' an E (anal insertion) because of the supposedly higher absorbtion.  I'm moderately experienced with a wide range of drugs (K hole fun, Salvia not), but have only taken E twice before (both oral).  The first time could certainly be described as 'profound'.  I think you know what I mean.  Anyhow, I have a scale to gauge the E experience against.",
  "For the record, I tested one of the other pills in the same batch with my reagent kit, and it came out positive for the MDA group (includes MDMA).",
  "T+0: In a bit of a hurry, so just stuff it in to the second knuckle.  All comes out clean ;)  Go out for walk around town on a cool clear night.",
  "T+1h: Pop back home to grab some water and iPod.  Can see mild pupil dilation, feel virtually nothing.  Hmmm.  Annoyed.  Back out for more walking about town.",
  "T+1h30: Do I feel something?  Maybe, but this is no 'coming up'.  Just a mild colour and tactile enhancement, maybe.",
  "T+2h: This is crap.  The dissociative effect from an iPod and deep in-ear headphones is more profound than the E!  Suspect that the pill isn't being absorbed much.  Head home.",
  "T+2h30: OK, sorry 'bout this but it's in the name of science.  Get out some kitchen roll and do a crap on the floor.  Heh!  That's the problem!  I should have done a dump first, 'cos the pill is nicely embedded in you know what.  Extract remains of pill (about 1/3, a bit mushy), re-insert (waste not, want not).  Wash hands thoroughly.  Pupils are very dilated, however, despite weak effects.",
  "T+3h: A mild, gentle roll.  But I'm still not across that 'threshold' where the serotonin dam bursts.  Frustrating.  Very slow onset.  Body temperature all over the place.  Red glow from the bottom of my optical mouse in the dark room very nice!  Make more than the usual number of typos writing this, but can easily pass for straight (I think!).  None of the coming-up feeling or anxiety from oral administration -- just a gentle creeping upon you.  Music is nice but 'normal'.  But then Royksopp is pretty chill when sober too.  Could go to sleep if I wanted to, I think.",
  "T+3h20: Submit report.  I can tell this isn't going to go anywhere deeper.  Shame -- had high hopes!",
  "So what's the lesson?  Take a great big dump before you plug, because although it's a nice administration method, happy turds aren't the aim of the game."
 ],
 "erowid": {
  "id": "48039",
  "citation": " EdinburgHigh. \"The Happiest Turd in History: experience with MDMA (Ecstasy) (ID 48039)\". Erowid.org. Feb 4, 2008. erowid.org/exp/48039",
  "substance": "MDMA (Ecstasy)",
  "views": "6786"
 }
}
