{
 "title": "K-Rocked In Slumberland",
 "author": "RocKed",
 "citation": " RocKed. \"K-Rocked In Slumberland: experience with Ketamine, LSD, Mushrooms & Alcohol (ID 79472)\". Erowid.org. Nov 25, 2009. erowid.org/exp/79472",
 "substance": "Ketamine, LSD, Mushrooms & Alcohol",
 "bodyweight": "160 lb",
 "report": "<p>I had recently purchased a whole slew of psychoactive chemicals, among them, several sheets of weaker LSD white-on-white blotter paper, a quarter ounce of psilocybin mushrooms grown in Oregon, and two grams of some straight Ketamine Chloride crystals (some of the best Ive had ever, better than most festival quality K).</p><p>I am fairly experienced in the realm of psychedelics and anesthetics and spent most of the day hiking around Lake Champlain with some friends after we had eaten 5 hits of the blotter paper. We were moderately spun having good visuals and positive vibes. We started our trip around 3pm and finished our hike around 7pm. Upon returning to my abode, my friends and I cooked a delicious meal and had some psychedelic mushrooms for desert. After a couple hours and a couple beers we decided to blow a few bumps of our special K and take a walk around the town. We were thoroughly twisted at this point with pupils as wide as quarters. Feeling adventurous, my friends and I crashed a few parties and estranged some strangers.</p><p>At about 1am we took some more bumps in an alley, sketchy as could be, and began our stumble back home. When I returned my friend and I decided we wanted to watch an interesting movie and sink into the deep world known as a k-hole. We put on the kids film Little Neemo in Slumberland, which I recommend to psychonauts who enjoy a good cinematic psychedelic experience. Its all about a little boy going about in Slumberland, this dream world with nightmare land and all its becomes rather dark at some points and I liked the eeriness of it.</p><p>In my sloppy state, I made the mistake of dropping my small baggie with about  of a gram of ketamine left in it on my carpet and half it spilled out. Luckily I had just cleaned my apartment and vacuumed so I had a few choices: vacuum up the powder, scoop it up and salvage what I could, or just snort the whole pile. After contemplating my decisions for about 25 seconds, my friend told me he would go down the rabbit hole with me as I watched him finish his portion of his own quarter gram. Without hesitation I planted my face on the floor and filled my nose full of tranquillizer powder and prepared for an interesting ride. I was still tripping moderately on the mushrooms from earlier and having drank a few beers I knew that I had about 3 minutes to get comfortable and expect the unexpected</p><p>The movie we had on the TV could not have been more perfect; it sort of guided my mind and kept me in a very strange k-hole. Having snorted an larger amount of pure crystal ketamine, I began to become very numb and unaware of my surroundings. I had lost all sense of ego and had no idea where I was or who I was. The couch I was sinking into began to float through some sort of space while I was having the hallucinations of communicating with alien beings. They were trying to integrate my spirit into two separate dimensions at the same time and I felt as if my mind was being dissected and I was in two worlds at once. This ripping feeling wasn't unpleasant, just very, very odd in general.</p><p>My vision was extremely impaired and full of hallucinations and I began to feel that I had only one eyeball and absolutely no clue of what was happening. This went on for quite some time until I began to return to a more aware state. I knew I was a human after about a half hour and I knew I was alive, but the room I was in was slanted at a 25 degree angle and when I got up to explore, each room of my apartment seemed to be a different world altogether. Each room was tilted in a different direction and wanted so pull me into it.</p><p>It was extremely difficult to move about, and the object I identified as a refrigerator seemed to have a rubber handle and appeared to stretch every time I tried to open it (my arms were  too weak to open it). I wanted to find some water because my nose was clogged with crystals and I felt dehydrated and couldnt stop shaking. I made my way into the bathroom and I thought I was in a hospital bathroom and shrugged it off, sucking water from the faucet. I came back into the living room and saw my friend sitting in his chair still, in awe of the experience he had himself.</p><p>I became more and more aware of my surroundings but was still supremely intoxicated. I felt as if I still had one eyeball and couldnt focus on anything. I felt terrible and couldnt compose myself to do anything but stand and stare blankly at the wall for another ten minutes.</p><p>After all was said and done it was about 5am and I had made my way into bed sleeping of another bended day in the mad world I sometimes like to live in. All in all it was an extraordinary experience by far the most twisted Ive ever gotten from ketamine. I wont touch it for a little while because a break is always good, but Im sure Ill be digging k-holes again  someday soon.</p>",
 "year": "2009",
 "id": "79472",
 "gender": "Male",
 "timestamp": "2009-11-25T08:00:00.000Z",
 "views": "3757",
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 4:00",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 4:00",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": " T+ 6:00",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 10:00",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 11:00",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  }
 ]
}
