{
 "id": 795,
 "title": "MuSiC eNgInEeReD fOr WeEd_sMoKeRs,& MoRe",
 "date": {
  "submission": "2005-01-14T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "unWest-unEasterner",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "It's a well known fact that during cannabis experience one feels connected to music, but that's not all, on my opinion! But first from the beginning. When I got a big amount of weed (medium quality i guess) - I was hoping to use it throughout the period from western christmas till New-Years-Eve-by-old-Eastern-Orthodox-calendar (24 Dec 2001 - 14 Jan 2002) - it's just the period of time everybody celebrates straight through, in my country (east of polland, south of belorus, SW of russia ;). I intended, and I did, to use it by myself - as I feel that weed is something personal.",
  "First I was rolling joints - but then I figured it was too meticulous job & since I didn't have anything else, I used a souvenir-intended ethnic-looking HUUUGE tobacco pipe. Nevertheless I stuffed it to the top (Equivalent of 2.5 well stuffed joints) ! I wanted to get fucked up - and I did. I smoked it all in a smallest possible period of time - to get a better result. I turned the music on - 200 Hrs of playlist music on PC on random was good enough - I figured!!! First I was disappointed bcs I didn't seem to be as fucked up as I wanted to - but as someone noted in another report - everyone who thinks he's not fucked up enough - gets ironically fucked up PROPERLY!! Just for you to imagine - I couldn't even open the door of my room properly - I think I was staring at it for 5 minutes before even touching the knob, I couldn't walk or hold anything - it took a great effort to move around the room. While my mind was still trying to analyze the received info that happened 1 minute ago - I was already doing something else - which was eventually partially processed another 1 min later !! And so on.",
  "The interesting thing I noticed before and especially that time - is when I closed my eyes or imagined something - it was in cartoon form, and the trip always got more intense than with opened eyes! Damn weird! These imaginations happened and moved not by my will - as it should be - but by themselves - as if independent from me. I never really associated weed with visuals and serious stuff. But that time I saw such effects as in one of those graphic-editing programs - whirl-lense (the image whirls, as if through some lense in small circular or thread-like regions) in different parts of my visual field. Also sometimes I felt as if blood were coming up to the top of my head and I could feel the warmth and heaviness there. But all of it wasn't irritating or scary - but rather pleasant (if not VERY). MANY times I would lick my lip (you know, to wet the lips - sometimes when they get dry) and I could live through that 'lick' over and over for a minute - as if playing a stuck record. And more stuff like that.",
  "Back to visuals - bcs my brain analysed 'pictures' too slowly I had a 'smaller frequency' of visual perception - as if looking at a set of slides - but bcs my brain still had to connect everything together - the time between the clear images sort of smeared-blurred if not disappeared altogether!!",
  "Now to the SOUND part:",
  "1) I could almost trace the path of movement of sound from speakers - usually medium-low frequencies. I think I was never really aware of the really-low frequencies AT ALL.",
  "2) Being from Eastern Europe I mostly listen to cool electronic music (mostly jungle-kinda-step-up, d'n'b, and some weired new one- that's hard to describe or clasify like Amon Tobin, DANILKIN etc.)",
  "I started noticing that my favourite songs sounded DAMN different - absolutely different melody (but mostly the melodies didn't make much sense - even random at times). THEN I noticed that some songs that I liked did sound DIFFERENT - but also made sense - as if absolutely different but with a nice melody in the same song I know under normal conditions. And the name of one of those songs was 'TRUE VISION'. Even stoned I realised that the composers intended it to sound different but nice when listened to stoned!!!!! I was shocked - how much effort and observations did those guys spent!!! Unbelievable.",
  "3) If you think that it's complete BS get this:",
  "I also had a song of MUSLIMGAUZE - 'Abu Zeid' - it's German-Arabic band - and I had this song just to add variety - besides it had ok percussions. Also under normal conditions I didn't really like some sounds in this song - like some distorted Iranian-like flute or something that sounds like a 'saw scratched on metal tube really fast'. Well, GET THIS - being really stoned - instead of those sounds I heard some Guy singing in Persian !!!!! I wasn't mistaken - I almost perfectly made out syllables and words!(I mean I don't know persian - but I know how it sounds). That's amazing - do those guys put all that effort into analysing how would a high person hear the sounds????? That sounds like an incredible job to me - if you like you can d/l the song on the net and check it yourself - unless you already know about these stonedguys-oriented music engineers - I can't call them anything else!!!",
  "4) Even on the next day I usually cannot listen to music normally. Like sometimes I wake up, turn something on and all I hear is a random or weird collection of sounds - and I have to sort of shake it off - to perceive it normally again. That's some shit!",
  "That's it for now! Have a nice trip - but don't get addicted, bcs it should work (hard :) for you, NOT the other way around ;( ."
 ],
 "erowid": {
  "id": "12148",
  "citation": " unWest-unEasterner. \"MuSiC eNgInEeReD fOr WeEd_sMoKeRs,& MoRe: experience with Cannabis (ID 12148)\". Erowid.org. Jan 14, 2005. erowid.org/exp/12148",
  "substance": "Cannabis",
  "views": "6104"
 }
}
