{
 "id": 7956,
 "title": "Power Stoned",
 "date": {
  "submission": "2008-03-21T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ben",
  "gender": "Male",
  "weight": 11
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "12",
    "grams": 0.012
   },
   "administration": "oral",
   "substance": "2C-I"
  }
 ],
 "report": [
  "I woke up this Sat and decided it was time to try 2CI for real. Although I had 1 week earlier procured 1g from an online source I had only dabbled with about 5mg up until now. A friend was coming over for some beer, pot and Family Guy at 6pm, so decided I would clean the house.",
  "Ingested 12mg of 2CI at 11am and began cleaning. After about 45 mins I felt a huge rush of energy and I was off like a tornado; blitzing the kitchen, lounge, hall, bathroom and my bedroom by about 1:30pm.",
  "Felt really happy looking at the sparkling bathroom sink and realised that the 2CI was ramping it up. At this point I was starting to get the 'acid tingles' so I thought that some music would be a good idea; Something chilled but with a strong beat. I went for Snoop Dogg and Dr Dre and happily spent two hours in front of the PC smoking a joint or two and really, really getting into the music.",
  "3:30pm and things began to get difficult. I was having trouble rolling as my hands appeared strange to me and I had a case of the shakes. In hindsight this was due to me forgetting to put the heating on lol but under the 2CI I didnt recognise the sensation of cold at first. Rolling a joint, it was like I was using someone else hand, hard to explain but wierd!",
  "As I was running out of marlboros I decided to walk round to the corner shop, even though the thought of having to interact with people in my state was rather daunting. I left the house and walked round the corner to the shop. It was below 0 and the cold air felt really nice. Everything was covered in frost which leant a nice 'christmassy'",
  "feel to the area. However something about the fresh air started me tripping quite hard.",
  "As I stood in the queue in the shop (4pmish) I heard a loud vomiting noise. For a second I worried I had thrown up but a quick look down confirmed I hadnt. Wasn't sure though as trippy feeling was getting more intense. The world seemed much more intense and I now understand what people mean about the 'cartoony, visuals on 2CI. Definate clean lined, cartoony feel to the world.",
  "Got home with my smokes and watched telly, began to get rather anxious as trip felt like it could go either way. Realised my friend would be round in a couple of hours and that chilled me out somewhat. Spend rest of afternoon watching Joey and Friends which was good as it was nice familiar, gentle comedy. By 6pm I was very chilled, more stoned than 2CI but definately still some 2CI in there.  Chatted with friend, had a couple of beers and another joint, by 8pm I felt myself coming back to baseline, everything began to look normal and began to just feel stoned.",
  "Went to bed at 1:30am feeling tired and aching all over but happy. Slept till 11am. Woke up feeling good, very relaxed and refreshed.",
  "Overall I am really glad I didn't go straight to 20mg as that would have been way to much for me. 12 was just right and I think it would be excellent for a night out clubbing as it was a very energetic and trippy high and although I didnt get the loved up feeling some report I reckon I might've had I been out at a club.  Despite the short bad patch I really enjoyed this experience and am looking forward to experimenting 2CI further, perhaps on a night out next time."
 ],
 "erowid": {
  "id": "48069",
  "citation": " Ben. \"Power Stoned: experience with 2C-I (ID 48069)\". Erowid.org. Mar 21, 2008. erowid.org/exp/48069",
  "substance": "2C-I",
  "views": "3296"
 }
}
