{
 "title": "Those Evil Black Seeds",
 "author": "Mr. JJ",
 "citation": " Mr. JJ. \"Those Evil Black Seeds: experience with Datura (ID 79597)\". Erowid.org. Nov 8, 2012. erowid.org/exp/79597",
 "substance": "Datura",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "200 seeds",
   "oral",
   "Datura",
   "(seeds)"
  ]
 ],
 "report": "<p>Jimson weed apparently grows everywhere in our home town. It is so plentiful my best friend and I were able to get a large amount of seeds for free.</p><p>We took datura outside on a cold November night while his parents were supposedly out for a while. We each ate at least 200 of the little black seeds. My friend, as he swallowed his first pinch of the seeds, turns to me and says Hey, these taste like poison, before putting more in his mouth.  He chewed and ate his seeds quickly, but I started having a very difficult time eating them because my mouth got bone dry almost instantly after I swallowed my first bite. That was my bodys defense mechanism to prevent me from eating more, but I forced down the rest of the seeds anyway.</p><p>After the two of us went inside, the datura took about one hour to start showing its effects. The first thing we both noticed was that we both all of a sudden felt as if we were extremely drunk. Next we noticed an effect that I later learned is referred to in the medical community as urinary retention. My friend stumbles out of the bathroom and says to me bluntly, I cant pee.</p><p>At the same time I became immobile (even sitting up proved to be difficult to do), I noticed my first hallucinations. The dots on the popcorn ceiling of his room were jumping around and the ceiling started to get pulsating bumps that stretched down towards me. Quickly the bumps turned into pointy stalactites all pointing towards me as if to impale me.</p><p>Soon, the things I saw became even more intense. The first things I saw I knew werent real, but soon they all looked 100% real, and in my delirious mindset I thought they were. The most bizarre and recurring thing I saw through the entire trip was this: I would look at a surface like a wall and the paint on it would quickly dry up, crack , curl up, and all the chips of paint would fall to the ground, revealing old rotted wood underneath. It was just like what would happen to an old, sun-exposed fence over the course of a century.  This happened to anything I looked at, like a door, a bed, even a window. It was extremely terrifying to watch and it wouldnt stop.</p><p>Then his parents got home and immediately noticed our condition. They had concerned looks on their faces. My friend tried to talk to his mom but was slurring his speech so bad it was completely incoherent. He fell off of his bed and was unable to get back up. His dad ended up driving me home and from then on I remember very little. I do remember he was kind and thoughtful enough to pull over to get a bottle of water for my dehydrated body.</p><p>The next day I woke up in my bedroom unsure about how Id gotten there. I learned my friend was in the hospital. He had gone into convulsions, was foaming at the mouth, and thought he was being attacked by locusts. It took five men to hold him down to sedate him. He had to stay in the hospital for three days. For two of those days I was unable to visit him because he was still hallucinating. When I finally visited him in the hospital he showed me the tube inserted into his penis. This was not a normal catheter. His kidneys had completely shut down and this was a foot-long, 2.5 centimeters in circumference tube that went all the way to his kidney through his penis. Even with his insurance, he still had a hospital bill over $3000 to pay. The drug we got for free ended up costing my friend $3000.</p>",
 "year": "2008",
 "id": "79597",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-11-08T08:00:00.000Z",
 "views": "2565",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "200 seeds",
   "administration": "oral",
   "substance": "Datura",
   "form": "(seeds)"
  }
 ]
}
