{
 "title": "It Took Forever",
 "author": "Dr. Copious",
 "citation": " Dr. Copious. \"It Took Forever: experience with LSD & Cannabis (ID 7960)\". Erowid.org. Feb 9, 2004. erowid.org/exp/7960",
 "substance": "LSD & Cannabis",
 "bodyweight": "82 kg",
 "report": "<p>Last Friday night was the first time I had ever tried LSD. I has researched the effects and other information about the drug for a couple of years, but never succeeded in finding anyone who sold it. Anyway, I bought 1 trip, along with two other friends who were my fellow trippers for the night.</p><p>\tOn the night and leading up to the Friday, I was extremely anxious to try it and so damn excited. My mood was as good as it could get, I was ecstatic, along with my two other friends. In all, we had 5 people in the car, a driver, another guy and us 3 trippers who I will call #1, #2 and myself. For the majority of the night, we drove around, place to place, looking for things to do.</p><p>\tT+0:00 (8:00pm) I put the trip in my mouth and played with it with my tongue. #1 also dropped the trip the same time as me. We were both slightly nervous. 15 minutes later, we went and picked up #2 who then immediately put the trip in his mouth. T+0:45 we drove to a huge playground thing where I wasn't seeing any colours or anything, but I had slightly restless legs and this detached / hazy feeling, like from smoking weed, where I didn't really care what was going on around me; it wasn't strong though. I noticed my mood had changed slightly too. I now felt happier and tended to smile and laugh more than usual. My friend, #2 by T+1:30 was reporting to me that things were becoming distorted to him. Faces looked weird, the ground looked like waves were travelling through it.</p><p> #1 and Istill felt nothing except that stoned like feeling. By this time, it was T+2:00 and we were both wondering why it had hit #2 and not us. We were thinking that the Acid was inert, or maybe since I am 82kg, and  #1 85kg, it could have taken longer to hit us, compared with #2 who was just 55kg. We found out later that he chewed the trip, whereas #1 and I just sucked it.</p><p>T+2:05 (10:05pm) we headed back closer to town where we went into Pizza Hut where some of our other friends were working that night. My friend (#2) was now fully going off, he looked so happy and alive (mentally) and I knew he was really being affected by the Acid now. I seriously started to doubt the power of this Acid, so the two of us who weren't being affected as much went to the house where we got the stuff. It was now 10:30 (T+2:30) and I could only feel that stoned (detached) feeling, but it was a little stronger. My mood was not as happy as before because of the rate at which the acid was working. We all went outside, I smoked 1 cone of weed, and then we went back to Pizza Hut where #2 tripper was. My friend, who gave me the weed, informed me that it might not be hitting me quick because I did not chew the trip. He told me to relax because it will come. My body in the car felt so warm and beautiful. I knew it was the weed affecting me, but something else was there too.</p><p>30 Minutes after smoking the weed, we all went to this girls house. Soon after T+3:30 (11:30pm) I had another cone and by that time I thought I saw flickers of light here and there but I wasn't sure. I still had not seen any weird colour or hallucinations. My mood was still down slightly, until Tripper #2 who was pretty active and made me happy to be around told me to look at the wall. (The wall was wood-grain patterned). He told me to concentrate and think of what I wanted the wall to do. It was now T+:3:45 (11:45pm) so I stared and concentrated on the wood grain where it met as a circle. I wanted it to spiral. Sure enough, it did! I could not believe it!</p><p>My mood was lifted and now everything changed; I was happier and I had faith in the Acid. I could have sat there all night and been content with everything going on around me. I looked at the curtains behind me, it looked like there was a green & purple colour to certain parts of it, and at the same time, light waves were travelling through it.</p><p>T+4:00, we left that house and were driving around for some reason, which I cannot remember. I was in the front seat, there were 3 in the back, and we were currently driving through some fog. We had the music rather loud and at that time, the three in the back were yelling over somethinglike a friendly argument. Funny enough, people say your mood determines what you are like on Acid; true! A combination of the fog rushing at the car, the loud music and 3 guys raising their voices in the back, suddenly created these things, which popped out of the fog and jumped at the car. I slightly freaked out, but I knew it was the acid, so the scary feeling went away.</p><p>It all got better from here, especially when we went through traffic lights. They were so bright and vibrant, but the strange thing is, that I saw this purple colour coming from the traffic lights. I am not sure where exactly from, but it was there and there is no purple on this Earth that striking. One thing which amazes me since I am straight now, is when I was on the Acid, I knew I was seeing colours, but it sort of felt like it was an everyday thing; just normal, I wasn't too amazed by it. Maybe I was in denial of my senses.</p><p>At 1:30am, (T+5:30) I was dropped off home and the acid started to hit me even more. My parents were in bed as walked inside and looked at my face in the mirror to see if my pupils were dilated as they were supposed to be. They did not appear to be dilated but my eyes were different. I cannot say what was different about them, but it was as if my eyes represented my state of mind; they were a little strange. Suddenly, looking at myself freaked me out and then my face started to twist, then slowly melt.</p><p>At this hallucination, I was intrigued and directed my attention to the floor where this beautiful purple, once again, came back and formed a liquid like river, which electrically flowed around. I knew I was hallucinating, but I felt relatively normal, except for that stoned-like feeling. I was still able to communicate with my friends, and if my parents were to come out, I could confidently chat to them too.</p><p>T+5:45, I looked at the walls with a cheeky grin and saw strong waved flowing through them. My tablecloth, of blue, yellow and green ran like a river of rainbows.</p><p>My computer desktop, which caught my attention for about 10 minutes, had this beautiful blue glow coming from somewhere, and yellow was jumping from the edges of the icons and taskbar. This was about 6 hours after the trip was initially taken. I went to bed soon after, with doubt in my mind about sleep. I think I went to sleep, and I say I think because in one part of my mind, I felt awake. This was just after 2:15am. I laid there thinking, and then looked at the clockit was 6:25am. I think I went to sleep because the time felt like 10 seconds, but something told me I didn't sleep at all.</p><p>In conclusion, if you have read this far, Acid is a strange but interesting and beautiful substance. I recommend it but I want to tell you what I learned.</p><p> I now know how important mood and settings are when you are on Trips. Tripper #1 was sceptical of the Acid all night and was complaining a lot, which bought my mood down. Acid is all about the power of the mind. I did not hallucinate much without wanting to do it. If I wanted something to look like it was breathing, it did. I thought acid was a much stronger drug than what I felt. Psychologically, I felt somewhat normal, except for the mood lift and tendency to laugh at more things than usual, but I didn't really know how out-of-mind I was until the next day. Here is some advice for any first-time trippers out there:</p><p>- Be in a happy mood before you trip</p><p>- Be around only optimistic people, who you like best out of any of your friends</p><p>- Use mind power to initiate hallucinations</p><p>- Be patient, it will work</p><p>Be safe and always have a non-tripper around you, even though you think you didn't need it. We didn't, but it was the peace-of-mind thing.</p>",
 "year": "2001",
 "id": "7960",
 "gender": "Male",
 "timestamp": "2004-02-09T08:00:00.000Z",
 "views": "6090",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
