{
 "id": 7961,
 "title": "The Creepy Feeling",
 "date": {
  "submission": "2006-11-22T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Wrek Head",
  "gender": "Male",
  "weight": 51
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Me, my brother and 2 good friends of mine went to an illegal rave at the weekend as per usual to have fun! My brother had some 2C-E from weeks back, but we didnt take it until late in the night. As soon as we got to the party I was straight on the MDMA and a small amount of Ketamine along side. From previous experience I knew this was a fairly good combo....I continued to enjoy myself smoking the 'occasional' Weed joint, and after hours of partying hard I decided to go back to the car were I found my brother and friends.",
  "I then snorted a small line of MDMA Ketamine and 2c-E, although it sounds like a bad idea now it wasnt so bad. 2c-E annihilates the nostrils, very stingy! It took a good 30 mins-hour to come up of the drug and I found it really quite pleasant! a sense of well being and mild visual hallucinations struck me first and I made my way back to the speaker system. Some really good tunes were playing and the vibe took me away with all the other party animals!!",
  "I then started to feel different, like I was physically connected to all the others dancing around me, as if we all danced as one, Unity...we were all so perfectly coordinated it was untrue. It then started to feel as if I was the heart and soul of this motion...leading the pack to dance as one. Very strange, yet satisfying feelings.",
  "I decided to come away from the system for a while as it all started to get too much for me, some negative feelings when I was sitting around groups of people was as if everyone was looking at me or I felt the odd one out? I had no serious bad feelings but it was uncomfortable for a duration of time. I didnt know what to say to my friends as I could not describe what I was going through, I tried to sleep in the car but I couldnt. Things came in and out of focus, making them feel like they were coming towards me and backing away, dots of colours appear randomly.",
  "I have a fairly level head and knew it was just this crazy drug inside my system doing this to me. I dont have much experience in psychedelics, Ive done mushrooms a few times but nothing compares to 2c-E."
 ],
 "erowid": {
  "id": "48094",
  "citation": " Wrek Head. \"The Creepy Feeling: experience with 2C-E, MDMA & Ketamine (ID 48094)\". Erowid.org. Nov 22, 2006. erowid.org/exp/48094",
  "substance": "2C-E, MDMA & Ketamine",
  "views": "7901"
 }
}
