{
 "title": "Profound Peace Ala MDMA",
 "author": "Uniter",
 "citation": " Uniter. \"Profound Peace Ala MDMA: experience with Methylone & Piracetam (ID 79654)\". Erowid.org. Dec 10, 2009. erowid.org/exp/79654",
 "substance": "Methylone & Piracetam",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.5 g",
   "oral",
   "Piracetam",
   " T+ 4:00",
   "2.5 g",
   "oral",
   "Piracetam",
   " T+ 8:15",
   "2.5 g",
   "oral",
   "Piracetam",
   " T+ 9:00",
   "135 mg",
   "oral",
   "Methylone",
   " T+ 9:30",
   "1 hit",
   "smoked",
   "Cannabis",
   " T+ 14:00",
   "2.5 g",
   "oral",
   "Piracetam"
  ]
 ],
 "report": "<p>Methylone+Piracetam</p><p>Set&Setting:  At home at night, did 25mg of 2C-B the night before.  Feeling kind of tired but not terrible.  I really like what the MD class of psychedelics does for me.  Ive found methylone to be very lacking in the spiritual effects compared to other MD drugs as well as having a jittery effect and short duration.  I am hoping that piracetam does to methylone what Ive read of it doing to MDMA (making it deeper, smoother and longer lasting).</p><p>Dosing:  Took 2.5-3 gram doses of piracetam at 2pm, 6pm, and 10:15pm.  Took 135mg of bk-MDMA at 11pm.</p><p>Trip:  Started to come on half an hour after dosing (11:30).  I found this rather quick compared to previous experiences.  I spent some time posting on BL and just hanging out.  At T+1 I tried listening to music but I found music just aggravated me and was an impediment to my trip.  I was also starting to feel jittery so I figured I would sit outside, smoke a little pot to see if it would mellow out the jitter and increase the mental effects.</p><p>I took one inhalation from my bong.  Pot often gives me anxiety and I was afraid thats what it would do.  It was starting to give me this effect but 5 minutes later the anxiety faded and I plateaued into a state of peace.  I still had some pleasant body energy so I decided to go for a walk up the road.  Along the road I met a car coming the opposite direction.  It is a very strange occurrence around here to meet a guy walking up the road dressed in black after midnight.  I felt this tension between me and the person in the car; as if there was something to fear and that being on guard was good for my safety.  I suppose this is somewhat logical as they are in a machine hurdling at me at a high speed and passing by me within 10 feet.  This was however an insight into the everyday dynamic of social fear.</p><p>When I got back to my house I went to sit by the water for a bit.  The peacefulness of the scene was breathtaking.  The stars were out in full force, not a ripple on the water, fish were jumping, loons were calling.  My breathing was very calm and deep, incredibly anxiolytic, a profound connection to nature was felt.  This was the peak, it was incredible.</p><p>Afterwards I smoked another bit of pot and went inside, I tried listening to music again but like before it just got in my peaceful way.  I feel that when Im having a profound trip Im most comfortable with the sound of silence and just being with my thoughts and senses.  I felt I was coming down and was a little bit anxious but nothing serious.  I started watching some Simpsons; my go-to program for psychedelic comedowns.  I Took another 2.5 gram dose of piracetam (about T+5) and 100mg of 5-HTP.  I also took one 3mg pill of melatonin, a 40mg pill of valerian extract, and a 1 ounce shot of tequila.  Fell asleep about half an hour later, woke up 7 hours after having vivid dreams and felt great.  I took more piracetam, about 2.5 grams every 6 hours and rode an afterglow all day long.  No hangover whatsoever.</p><p>Conclusion:  Piracetam made methylone more entactogenic and MDMA-like.  It also smoothed out the side effects, extended the duration, and eliminated the hangover.  Throughout the trip there was still some jaw clenching and stimulation but nothing serious.  I usually get a hangover from methylone but there was absolutely none.  The timeline went: 1 hour to come up, 3 hour plateau, 1-2 hours of comedown, sleep. Pretty much the same timeline MDMA gives me.  I also feel piracetam made my thoughts and emotions more smooth and efficient.  Im going to continue to use piracetam on a daily basis for this purpose; it feels like a great anti-anxiety/anti-depressant.  Im also going to experiment with piracetam combinations with other psychedelics.  I feel it will probably smooth out the tension I get and help me break through to a peaceful plateau.</p><p>I felt my methylone stash was next to useless.  Piracetam just gave it a whole new life.</p>",
 "year": "2009",
 "id": "79654",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-12-10T08:00:00.000Z",
 "views": "11482",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Piracetam",
   "form": " T+ 4:00"
  }
 ]
}
