{
 "id": 7965,
 "title": "Helped My Insomnia",
 "date": {
  "submission": "2006-06-14T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "B",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "daily"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Methylphenidate",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "0.1",
    "grams": 0.0001
   },
   "administration": "oral",
   "substance": "Clonidine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "oral",
   "substance": "Clonazepam",
   "form": "daily"
  }
 ],
 "report": [
  "I was prescribed Clonidine to assist falling asleep, about 6 years ago or so.  I remember the first time I took one, around 7 PM and I remember lying on the ground face first, just feeling all good.  My mom was sort of laughing at me.",
  "Im like 'ha....I feel goooood'",
  "I went from 0.1 mg,   to 2 x 0.1 (0.2)  then finally 3 (0.3)",
  "This medication was meant for short time use, to get my sleep schedule back on track. It was intended for 1-2 weeks use, to take early at night, say, 1-2 hours before a decent bed time. Well that didn't last very long, then I just ended up staying up late, and taking it to fall asleep because I couldn't without it (as easily)",
  "My sleep schedule is so outta whack, on days I don't have early classes, I just stay up the night before until pretty much 5-6 am, then sleep until class.",
  "On weekends forget about it, Ill be up all night especially being vacation.",
  "I was also taking Adderal or Dexedrine at the time or methylphenidate earlier in the day, so this sort of brought down the hyperness at night.",
  "Well, 7 years later, I took it on and off.  I'm still just naturally wired at night time.  Must have been a cat in a past life LOL.  I will be good at the night shift if I become a police officer. I ran out of clonidine, I would like some more.",
  "I currently take Clonazepam 1mg.  1mg is no longer effective at aiding in sleep, so it became 2.",
  "I find it hard to physically get out of my chair and go to bed even when my eyes are closing on me.",
  "I'm going to save this Clonazepam for certain social events (class presentations this semester and next), maybe a job interview, etc etc."
 ],
 "erowid": {
  "id": "48122",
  "citation": " B. \"Helped My Insomnia: experience with Clonidine  & Clonazepam (ID 48122)\". Erowid.org. Jun 14, 2006. erowid.org/exp/48122",
  "substance": "Clonidine  & Clonazepam",
  "views": "30591"
 }
}
