{
 "title": "Really High for a Really Long Time",
 "author": "kratoman",
 "citation": " kratoman. \"Really High for a Really Long Time: experience with Spice Product ('Arctic Synergy') (ID 79674)\". Erowid.org. Jul 28, 2009. erowid.org/exp/79674",
 "substance": "Spice Product ('Arctic Synergy')",
 "bodyweight": "135 lb",
 "report": "<p>I quit smoking weed about a year and a half ago. I started getting bad grades in college so I decided that pot was interfering with my life. When I stumbled upon Spice on the internet, I was curious to see if it lived up to the hype so I got about 3g of Spice Arctic Synergy (a minty version of the original Spice) off the internet and had it delivered 4 days later. I read that it contained synthetic cannabis-like chemicals, but was legal and did not show up in a drug test, and was eager to try it.</p><p>On the day the stuff arrived, I separated about a gram into a big joint and decided to go in my car for a smoke session. The herb burns very quickly, and I was almost done with the joint in about 5 minutes. The one thing I didnt like about Spice is the horrible smell and taste, but that would be my only complaint.</p><p>About 10 minutes in, I started thinking that I had been ripped off and that this stuff was complete bullshit. Until all of a sudden, I start feeling this warmth over my body, creeping  over my back, then my legs start to buzz with energy.  Very intense body high, and I was nothing less than impressed. My depth perception became distorted and I started to stare into nothing for a while. Everything felt very cloudy and it felt like a dream. I was really high for about 2 hours, just completely relaxed and in a trance state, and came down for about another 3 or 4 hours. The effects I got from Spice were almost 100% identical to some good marijuana; I got cottonmouth, red-eyed, time distortion and bad munchies. Music sounded amazing. I was able to fall asleep on it no problem.</p><p>The next day I woke up at around 2PM feeling a little dizzy, like when I get hangover from weed. I felt a little off for the entire day, definitely unmotivated and just tired. Thankfully I had nothing important to do. Overall, I could say that Spice is very strong and could easily be addictive, and will very soon be declared illegal everywhere. I will be smoking it until they decide to stop shipping the product.</p>",
 "year": "2009",
 "id": "79674",
 "gender": "Male",
 "timestamp": "2009-07-28T07:00:00.000Z",
 "views": "14289",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 g",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids",
   "form": "(dried)"
  }
 }
}
