{
 "title": "Addiction: Begining to End",
 "author": "Matthew L H",
 "citation": " Matthew L H. \"Addiction: Begining to End: experience with Buprenorphine & Naloxone (Suboxone, for Heroin Dependency) (ID 79712)\". Erowid.org. Jul 10, 2009. erowid.org/exp/79712",
 "substance": "Buprenorphine & Naloxone (Suboxone, for Heroin Dependency)",
 "bodyweight": "140 lb",
 "report": "<p>Heroin and pill use at an early age, (14) till sixteen, then I was sent to rehab/ boarding school for year and a half... Started using immediately after exiting the program, so from age 18 to now (20) I used heavily. Off and on I can say I have been solidly addicted, (as in, need to consume an opioid every day or withdraw begins) for about a year and a half. In the last six months my habit has been where I needed to dose first thing in the morning, and again at some point in the evening or minor withdraw would begin. I had had withdraws plenty of times before, but normally after going for a day with nothing, so this was a real shock and eye opener when I discovered I wake up sick and must score, and then must do so again in order to sleep that night.</p><p>It's hard to accurately gauge my use/habit/tolerance (Too many factors, quality mainly) but to give you an idea, I did a whole gram of the best dope I have ever had in two shots one night, and walked away from it... I was fucked up, but I did not come close to ODing... Obviously I could not afford a gram a day, but through middle manning and the ol' selling enough to cover what you just bought routine, I was able to stay well, if not even a little high, every day for a six month bender. And juggle a full time job too... As long as I wasn't sick that is... There of course were those failure days where I was unable to scheme anything up...</p><p>I will be keeping a documentation of my getting clean using Suboxone. I will document my dosing, mood, physical and mental state, pro's and con's, and over-all cost.</p><p>This morning I felt terrible, was vomiting, sweaty, aches, fever, normal withdraw symptoms, and was still feeling ill from giving myself cotton fever.</p><p>Received script from doc, three a day, eight milligrams, twenty-one tabs, one week's worth... I go back to see him next wednesday...</p><p>So far, I feel great... A little jittery, wired, definitely cannot sleep, but my mood and attitude is positive, temptation totally gone, mind and physically. Main issue right now is extreme boredom and loneliness. Weighed in at the dr. Today, 140lb. Blood pressure was high, 138 over 84... I think... The dr. Said it was a little high...</p><p>Cost thus far: Consultation visit was $165, Today's Induction visit was $290 (No charge for my next follow-up visit for some reason? That's what the nurse told me... That the $290 covered today's and next week's, but that every other time after that it will be $200) and to fill the script was $161.99 (Qty 21) at CVS.</p><p>Grand Total: $616.99</p>",
 "year": "2009",
 "id": "79712",
 "gender": "Male",
 "timestamp": "2009-07-10T07:00:00.000Z",
 "views": "13462",
 "dose": [
  {
   "time": "0",
   "amount": "24 mg",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "6 mg",
   "administration": "sublingual",
   "substance": "Naloxone",
   "form": "(daily)"
  }
 ]
}
