{
 "id": 7972,
 "title": "Seizure/Convulsion",
 "date": {
  "submission": "2007-03-22T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Jay",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Vitamin C"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "3.5 g",
   "substance": "oral"
  },
  {
   "time": "Mushrooms",
   "amount": "(dried)",
   "administration": "",
   "substance": " repeated"
  },
  {
   "time": "smoked",
   "amount": "Cannabis",
   "administration": "(plant material)",
   "substance": ""
  },
  {
   "time": " repeated",
   "amount": "smoked",
   "administration": "Tobacco - Cigarettes",
   "substance": ""
  }
 ],
 "report": [
  "Some background information for this story: my 3 friends and I had purchased these mushroom chocolates and had set aside a day (yesterday) to take them.  One of my friends said that taking ascorbic acid before consuming the mushrooms would intensify the effects, so we all ate a pill at the beginning of the day and parachuted another one right after we ate the chocolates.  The trip started no more than ten minutes after eating them.  For the first three hours, everything went according to plan.  We sat around talking, listening to the new System of a Down cd that had come out the day before, and enjoying fat bowls and menthol cigarettes left and right.",
  "Three hours into it, two and a half hours after the effects had settled in, I was having a fantasticly happy and insightful trip.  A little while later we all decided to go outside and smoke yet another cigarette.  There wasn't enough room for everyone to sit down, so I stayed standing for the entire time.  Half way through the cigarette, I felt a sudden fight-or-flight sensation, where if I didn't get inside and away from all the people and the cold of this frigid november night, I was going to either puke or faint.  I made my way inside, and the last thing I remember was feeling extremely dizzy and being maybe three feet from the couch that I was trying to lay down on.  At this point I couldn't feel, see, hear, touch or smell anything; All 5 senses had seemingly cut off.  I suddenly had the most intense rush of auditory and closed-eye visuals I have ever experienced from any substance I have ever taken. I wouldn't even begin to know how to explain them.  I was completely convinced I was either dying or already dead, because all I could hear were the words 'it's ok' being repeated over and over, and the feeling of ascending to somewhere, in addition to seeing things beyond my wildest imagination.  Of course, the voice was that of my good friend, but it sounded nothing like her.  It wasn't even distinctly male or female in sound. ",
  "When I awoke, which was a very intense and emotional experience, C told me I had collapsed and started convulsing.  I've never heard of anyone having a seizure during a trip of any kind, and I have never had a seizure of any kind up until yesterday.",
  "I still haven't been able to wrap my head around the entire experience, what happened to me or what caused it, but in the end I think it was a positive experience. I felt wiser, because when I finally snapped out of my trance, I was completely all-knowing, or at least all-understanding as far as myself, my friends and how we interact, and my everyday surroundings.  I would never want to relive that, although I wish I could tap back into that knowledge and understanding from the last hour or so of my trip, but I know it will come back, bit by bit, right when I need it, as it always does."
 ],
 "erowid": {
  "id": "48191",
  "citation": " Jay. \"Seizure/Convulsion: experience with Mushrooms, Cannabis & Tobacco - Cigarettes (ID 48191)\". Erowid.org. Mar 22, 2007. erowid.org/exp/48191",
  "substance": "Mushrooms, Cannabis & Tobacco - Cigarettes",
  "views": "12438"
 }
}
