{
 "title": "Internal Thoughts Projected Into Setting",
 "author": "Wendy",
 "citation": " Wendy. \"Internal Thoughts Projected Into Setting: experience with Lorazepam (ID 79764)\". Erowid.org. Aug 3, 2009. erowid.org/exp/79764",
 "substance": "Lorazepam",
 "bodyweight": "160 lb",
 "report": "<p>History of user: 29 y/o female. Experimented with a variety of psychoactive agents in college (LSD, mushrooms, ecstasy, ketamine, cocaine, marijuana, etc.) both recreationally and as psychoactive growth opportunities.</p><p>Currently: Sitting in my bedroom alone with feelings of anxiety, restlessness, inability to concentrate/sleep, racing thoughts, mild panic, doubt, worry and fear following the death of my father. Researched web and found dosage commonly used to induce sleep and anti-anxiety. Generally dislike pharmaceuticals of any kind (and very rarely take them), but rationalized taking this agent to aid with anxiety and document its effects for scientific and experiential purposes. Reported onset of action for oral doses is considered rapid by may take 30-45 minutes, of which I will document.</p><p>12:30am Ingested two 1mg tablets lorazepam. Immediately felt a sense of calm.</p><p>12:35am Feeling a heaviness in the head and mind. When I close my eyes, there is a sense of stillness as if I could sit here for a long time. There is no urgency to keep moving. During anxiety, the thoughts of the mind are like a million people with a million voices constantly at battle. Now, as multiple thoughts arise, they are pushed down by another force that does not let the thoughts arise in the first place. Yet, it allows for a single thought to be heard  as I am still able to write this.</p><p>12:40 The body is heavy, slower and slightly uncoordinated. It takes deliberateness to complete a bodily action. Pulse rate is 68bpm. Breathing feels slow at 7 breathes/minutes.</p><p>12:50 Becoming distracted with other things on the internet. Feeling some pressure in my head like a headache. Feel guilty about taking the medicine in the first place. Wondering if I just poisoned myself  how does my body feel that I just gave it a drug to alter its sensations? Was that ultimately helpful or not helpful? Was there any underlying issue I was trying to cover up by using this substance? Or was I just looking to get some sleep tonight?</p><p>1:00 Had a thought about relationships  how the people that I loved, never seemed to like me much and the people that loved me, I didnt care for that much. I am wondering if balance can be found in the universe.</p><p>1:05 Decided to try standing and walking around the room. The movements were like walking through thick air. I saw a shadow on the wall and immediately wanted to capture the shadow so I taped (clumsily) up some paper to trace the shadow on, but the mere act of adding paper to the wall, changed the shadow and then I became aware that I, as the shadow capturer, became another element in the shadow, light, reflective surfaces. I could not capture it unadulterated. I tried to press the paper down so it would be MORE real (more like what I had seen) but ultimately, it was not the same. My participation has changed the outcome. I thought about relationships like that  where one person pushes the other person back to what they thought they saw. I was disappointed that my drawing of the shadow was not what I had originally seen, but delighted to realize nothing can be acted on without change.</p><p>1:15 More difficulty in typing. Head feeling more heavy, like thick mud. Decided to go to sleep.</p><p>1:30am Laying in bed and looking at the room in dim light. Arrangements of furniture seem to come alive with a pulse. Its as if all the mental activity has now been projected into the room  the room objects are moving instead of the internal mindscape. I can visually see the minds movements. Objects rotate on one axis so side-to-side or up-and-down or rotate on a pivot. The furniture resembles stuffed animal like-creatures and looks as if it is coming toward me, but I know I am safe in bed. I sleep soundly.</p><p>1:30pm  Next day out of bed  missed three alarms. Still feel heavy and woozy. The half live of this agent is 11-18 hours so I am not surprised.</p><p>3:30pm Still feeling disoriented and sluggish.</p><p>I imagine many of the effects/feelings/experiences above can be paralleled with meditation and the next time I have similar feelings, I will document the use of meditation and compare its effects with lorazepam.</p>",
 "year": "2009",
 "id": "79764",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2009-08-03T07:00:00.000Z",
 "views": "59964",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 mg",
   "administration": "oral",
   "substance": "Pharms - Lorazepam",
   "form": "(pill / tablet)"
  }
 }
}
