{
 "id": 7976,
 "title": "Preloading and PH Play",
 "date": {
  "submission": "2007-07-19T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Speed Prophet",
  "gender": "Female",
  "weight": "110 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Amphetamines"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Piracetam"
  }
 ],
 "report": [
  "<p>There are several reports online stating that pre-loading with Piracetam before taking MDMA, or taking the two together, significantly enhances duration, intensity, and other positive qualities of MDMA. Piracetam on its own and in this combination does not reliably produce any subjective effects for me.",
  "I happened to find a box of Piracetam in my room a month or two ago, and proceeded to try, over time, various doses and timing of Piracetam with regular d-amphetamine (or rather, mixed salts of d-amph). I've tried pre-loading with as much as 3 grams of Piracetam (a pill is 800mg) and I've also tried taking 2-3 pills interspersed with my usual amphetamine re-doses. My amphetamine doses are usually 10-40mg at a time and I redose every few hours, taking from 80mg - 300mg depending on effects I'm looking for. I've taken a break from the Piracetam experiments and used amphetamine alone, then after another break (breaks are at least a week - I don't do amphetamine more than that, usually) tried with Piracetam again, in order to gauge any difference without the confounding variable of amphetamine tolerance.",
  "The result: nothing. No difference. As far as I can tell, it's the same good old speed, with no variation in subjective effects regardless of how much Piracetam is taken. It's not longer, it's not stronger, and it's still not meth.",
  "Thus, all in all, I have only found 1 thing to reliably enhance speed by increasing potency of any given dose: baking soda/regular antacids. Taken before and then with amphetamine, it increases the amount of amphetamine retained & metabolised by the body - and it shows! Research shows that urine pH (which baking soda greatly increases, alkalising the urine) can alter the amount of amphetamine excreted in urine.",
  "Of course vitamin C also affects amphetamine, in the opposite direction by lowering urine pH and ensuring that more will be removed from the body untouched. It's a moderately useful method in quickly reducing the amount of amphetamine in your bloodstream if you think you've taken too much.",
  "I've also found coffee and strong black tea to interact negatively with amphetamine, by upping the unwanted peripheral nervous system effects (jitteriness, racing heart, etc) without increasing any of the desired effects (mental clarity, euphoria, alertness).</p>"
 ],
 "erowid": {
  "id": "48211",
  "citation": " Speed Prophet. \"Preloading and PH Play: experience with Amphetamines, Piracetam (ID 48211)\". Erowid.org. Jul 19, 2007. erowid.org/exp/48211",
  "substance": "Amphetamines, Piracetam",
  "views": "15388"
 }
}
