{
 "id": 7978,
 "title": "Potent Mood Enhancer",
 "date": {
  "submission": "2008-02-17T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "EdCrane",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 bowls",
   "administration": "smoked",
   "substance": "Leonotis leonurus",
   "form": "(flowers)"
  }
 ],
 "report": [
  "I bought a decent chunk of salvia the other day, and the vendor threw in a sample of 'lion's tail.' Ordinarily, I wouldn't bother trying something of its description, as I've been disappointed by virtually every substance claiming to be a legal alternative to marijuana. But of course, this was free, so once I had a little time to kill, I decided to smoke the entirety of the sample bag.",
  "The bag itself contained dried flowers with a faint scent. I packed the first bowl and was pleasantly surprised by the agreeable flavor of the smoke. After eight minutes, and another bowl and a half, I was in more or less the same state, though I did notice that things started smelling very good to me. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "Fifteen minutes later I left to pick up my girlfriend from work. Turn signals from the cars in front of me were noticeably brighter and more annoying than usual, but nothing else seemed different. On the other hand, when I actually reached my destination and started talking to my girlfriend, I noticed my mood had improved vastly, and I was thinking much more clearly than usual (and consequently talking faster, and with more precision). Where I ordinarily would be grumpy (the topic of our conversation was a family problem that seems to never go away), I was now a buddah... detached, but emotionally invested. The rest of the evening went nicely, though the primary mood effects probably waned after a couple hours.",
  "Conclusion: Very enjoyable substance to smoke, with unexpectedly potent mood-enhancing qualities. I will be ordering a large quantity of this in the near future."
 ],
 "erowid": {
  "id": "48216",
  "citation": " EdCrane. \"Potent Mood Enhancer: experience with Leonotis leonurus (ID 48216)\". Erowid.org. Feb 17, 2008. erowid.org/exp/48216",
  "substance": "Leonotis leonurus",
  "views": "23266"
 }
}
