{
 "title": "Pink Bitches",
 "author": "Billy B.",
 "citation": " Billy B.. \"Pink Bitches: experience with Oxymorphone (Opana) (ID 79832)\". Erowid.org. Oct 17, 2009. erowid.org/exp/79832",
 "substance": "Oxymorphone (Opana)",
 "bodyweight": "200 lb",
 "header": [
  "DOSE:",
  " repeated",
  "insufflated",
  "Pharms - Oxymorphone",
  "(ground / crushed)",
  "",
  " repeated",
  "IV",
  "Pharms - Oxymorphone",
  "(ground / crushed)"
 ],
 "report": "<p>[[Erowid Note: IV injection of crushed pills/tablets can be very dangerous due to unknown binders and fillers present in the tablets.]</p><p>The problem with this drug is that its high is surpassed only by its speed of tolerance. </p><p>I started by snorting one pill 10mgs (only after a three year daily oxy habit), it was an incredible rush of warmth and euphoric security unprecedented by my past opiate/opioid use such as handfuls (rather nosefuls) of oxycodone, hydrocodone, and as much Fentanyl as I could beg, borrow, or steal.  The rush seemed to start in my brainstem and very quickly cover my head including the tongue and then my entire body inside and out.</p><p>It took only three days to work up a tolerance of thirty mgs just to get the most minimal high- very little rush.  After only two weeks, I was trying to jam 8 of these pink bitches up my nose, to no avail.</p><p>So I have been IVing for the past two months; I started with half a pill 5mg and now I have to put 4 full pills 40mgs in a 3cc rig to get that rush but ooh that fucking rush! The nod is not much to speak of; basically I am puncturing my veins multiple times a day in anticipation of a two or three minute rush.  When IVed the rush is more of a warm, beautiful specter overpowering me from behind and before the needle is empty she has wrapped me in love, peace, and, happiness, but by the time I catch my breath (literally) she is gone to leave me wanting Bitch.</p><p>The only grace I have if at all, is that I always run out before my new script so I suffer, terribly suffer, for a week or two until I can hit the Doc.  I stay the withdrawals by taking suboxone (wearing a fresh 100mcg Fent patch wont even help). I gave half a pill 5mg to a low tolerant friend and he was sick for three hours puking, lethargic, wishing he was dead.</p><p>As for my drug experience; over the past 18 years, I have used almost every substance reported to get you high (even banana peels), I have been to raves and Dead shows alike, as a connoisseur of not only drugs but the various cultures.  Over the past year I have been prescribed Opana 10mg 4xday and 100mcg Fentanyl every 72hrs (usually bump it to 200 or 300) also I did a couple of ounces of cocaine (several thousand dollars), and some pot (when free), and a few doses of morning glory seeds (nice) and once mescaline (what can I say) and DXM (use only when needed) and lots of alcohol.</p>",
 "year": "2009",
 "id": "79832",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-10-17T07:00:00.000Z",
 "views": "15323",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Pharms - Oxymorphone",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "IV",
   "substance": "Pharms - Oxymorphone",
   "form": "(ground / crushed)"
  }
 }
}
