{
 "title": "Quite Trippy, and Amazing",
 "author": "AcidChild",
 "citation": " AcidChild. \"Quite Trippy, and Amazing: experience with Gabapentin (Neurontin) (ID 79845)\". Erowid.org. Jan 3, 2011. erowid.org/exp/79845",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "900 mg",
   "oral",
   "Pharms - Gabapentin",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2009",
   "79845",
   "Male",
   "",
   "Not Given",
   "Jan 3, 2011",
   "21077",
   " "
  ]
 ],
 "report": "<p>I've experienced quite a few drugs in my time. From Marijuana, to Vicodin. But if I could choose a drug that I could label 'The Perfect Drug' Gabapentin would be my first choice. </p><p>A friend of mine gave me three 300mg capsules of Gabapentin that he has been using for legit pain. I noticed them in his apartment and he had told me the story of why he uses them and what they do, and what not. He knows that I experiment with Pharms quite often, so he offered me three of his capsules to do with them as I wished.</p><p>That night I had done my research on them and felt fairly comfortable with them. I decided I would down all three with a glass of water. </p><p>0:00 - I felt pretty good. Decent mind state. It was around 10pm or so. Downed all three with said water. </p><p>0:30 - Feeling similar to before. A little more relaxation than before however.</p><p>1:00 - After about an hour I could most definetly feel effects now. I felt a pretty mild euphoria. But it was for surely there. </p><p>1:30 - I got a call from my Grandma telling me that she had fallen and that she needed help getting back up. Note that it was midnight. Luckily, we live close so I rushed down there. As soon as I entered their back door it hit me. I opened the door and pattern after pattern zoomed at my face. I entered their house and it was pitch black. Time seemed to drag on. I remember pushing the door open and color after color filled my brain as the door slowly creeped open. I soon realized I should get to my Grandma and stop tripping out in her garage. </p><p>I helped her up and everything was all good and done. I had to use the restroom before I left. Here's where it gets strange. I saw myself in the mirror and I had so many emotions running through my body. It was almost as if I was attracted to myself for the first time. Very odd. I later arrived at home and had the most amazing urge to hear 'Snowblind Friend' by Steppenwolf. I have no idea why. I had only heard the song maybe twice before. I quickly searched it up online and fulfilled my urge. </p><p>2:00 - I sat there in my computer chair staring at nothingness. Total Nothingness. And loving every fucking second of it. Giggling like I had just seen the funniest thing in the world. Why? Who knows. All I was doing was staring at the blank wall. I never really saw any visuals at this point. But the fact that I was just so freaking content with life was almost overwhelming to me and just made me laugh for about 20 mins. straight. </p><p>2:40 - I decided I would go to bed. I was pretty tired. I slipped in bed and I felt so euphoric it was amazing. Every breath I took made me feel more and more great. I eventually slipped away into dreams. I slept very good that night with fairly odd, but pretty cool dreams. </p><p>I would definetly consider doing Gabapentin again. Not only did it improve my mood greatly, but I felt the effects even the next day and night.  </p><p>And remember don't get frustrated if this doesn't happen to you. Because this was my first time and I am a quite skinny guy. I honestly didn't expect nor did I even realized that taking Gabapentin could be such a Psychedelic Experience. </p><p>Cheers, and Happy Tripping!</p>"
}
