{
 "title": "Visionary Antidepressants?",
 "author": "J.C.E., Utah State P",
 "citation": " J.C.E., Utah State P. \"Visionary Antidepressants?: experience with Sertraline (Zoloft) (ID 79863)\". Erowid.org. Jul 11, 2009. erowid.org/exp/79863",
 "substance": "Sertraline (Zoloft)",
 "bodyweight": "",
 "report": "<p>Citation: J.C.E., Utah State Prison. 'Visionary Antidepressants?'. The Entheogen Review. Summer Solstice 1998;7(2):31.</p><p>I am writing from a maximum security cell in the Utah State Prison--one of the many P.O.W.s in the United States brought down by America's 'War on Drugs.' I am currently serving a one-to-fifteen-year prison sentence for possession of a stolen car. Yes, that's right, fifteen years for possessing a car that didn't belong to me.</p><p>I've had many experiences with LSD and mushrooms, but there is one experience that I had with a psychotropic drug called Zoloft (sertraline hydrochloride).</p><p>A friend of mine in here has a prescription for Zoloft and one day he gave me a couple of them because they have a kind of 'speed' effect to them. When I ate them, I got extremely wired. It was unlike any kind of amphetamine high though. One of the effects that I noticed was that I felt as if I was about to start tripping on LSD. It was a very subtle feeling. Over the course of one week I increased my dosage until about the seventh day I consumed 19 pills in that one day. And yes, I reached a psychedelic level. It is very hard to explain how it was, but I will try.</p><p>The patterns, auras, and 'trails' associated with LSD were all present in this trip, but it was as if they were all manufactured by a computer. (All of the geometric patterns in my vision seemed as if they were constructed of very tiny neon lights.)</p><p>I reached a state that I've never reached on LSD or mushrooms. When I laid down in my bed and shut my eyes, I was able to see very clearly with my Ajna Chakra all that surrounded me. (My prison cell and some other dimensions.)</p><p>Tiny people that resembled very small gnomes (I guess that's the best way to describe them) ran up to my face and stood on my chest--peered right at me--and started to talk to me. I telepathically 'spoke' with them for about five minutes. Then I opened my eyes and realized that I had been having a conversation with a very small being standing on my chest, and said to myself, 'Wow!' I thought at first that I was just hallucinating the whole experience. As soon as I shut my eyes, my mind's eye would automatically open up, and bam! The little people would run back up to my face and resume the conversation with me.</p><p>I can not remember any of the specifics of the conversation, but I do remember that the conversations were based on the subject of Zoloft. -- J.C.E., span style='font-variant: small-caps;'>Utah State Prison\rWe've heard that a 'psychedelic' response to various antidepressants is not uncommon. Regardless, it seems like a bad idea to increase the dosage of Zoloft so dramatically. Zoloft comes in 25 mg, 50 mg, and 100 mg scored tablets. The standard dosage is 50 mg once daily. The maximum recommended dose is 200 mg. Other than '19 pills,' J.C.E. made no mention of the dosage. This could be 475 mg, 950 mg, or 1900 mgs. In 1992 there were 28 nonfatal acute overdoses involving only Zoloft; these overdoses were in the range of 500 mg to 6000 mg. (There were 79 total Zoloft overdoses reported in this year, meaning that 51 of these were a combination of Zoloft and other drugs and/or alcohol.) As well, there have been four known deaths from overdoses of Zoloft combined with other drugs and/or alcohol. MAOIs are contraindicated with Zoloft. Caution must be taken by patients using Zoloft who have liver disease; high doses are to be avoided for those with impaired liver functioning (Medical Economics Company 1998). It strikes us that Zoloft is best left as an antidepressant; its use in high doses as a visionary agent may not be too safe.</p>",
 "year": "1998",
 "id": "79863",
 "gender": "Male",
 "timestamp": "2009-07-11T07:00:00.000Z",
 "views": "51728",
 "dose": [
  {
   "time": "0",
   "amount": "19 tablets",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(pill / tablet)"
  }
 ]
}
