{
 "id": 7987,
 "title": "Tumbling Through the Abyss",
 "date": {
  "submission": "2007-03-07T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Blue Runner",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "",
    "quantity": "14"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "fresh",
   "specific": "P. cyanescens"
  },
  {
   "time": "24:00",
   "amount": {
    "unit": "",
    "quantity": "7"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cyanescens"
  },
  {
   "time": "24:00",
   "amount": {
    "unit": "g",
    "grams": "2.0",
    "quantity": "2.0"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "seeds"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "in",
    "quantity": "8"
   },
   "administration": "oral",
   "substance": "Calamus",
   "form": "roots"
  },
  {
   "time": "0:00",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I'm an 18 year old college freshman from the Pacific Northwest and though I regret my exposure to substance use at such a young age, I am a very experienced tripper who often likes to push things beyond his personal limit to 'see what happens!'",
  "The following report took place over a three day period:",
  "Day 1- After romping around my college campus looking for mushrooms for about an hour, I decided to wrap up the hunt, ending my expedition with a bounty of about 30-40 beautiful P.Cyanescens and 9 kind of beat-up P. Azurescens.  At my apartment, I cleaned my goods and put them in the food dehydrator to dry, but not without sharing my fungi with my roommate.  We both ate about 12-15 fresh P.cyanscens, and I ate one fresh P.Azurscens.  In less than ten minutes we were feeling an extreme anxiousness that I thought was just placebo, but I was proved wrong when we started into the peak at t+50min.  It was almost too much psilocybin for our bodies to handle physically.  Don't get me wrong, I love mushrooms, and I love tripping really hard, but at times the fry was so intense that I felt like I was getting sunburned, and it's really cold in my house.  The visuals were most excellent, to the point that I was frustrated trying to play video games, because I couldn't see anything properly, everything on the screen would disassemble itself back into the pixels from which they were formed.  So we watched A Clockwork Orange instead of playing video games, a very excellent call on my part.  Only at the very highest point of the trip was it too hot inside my body to be comfortable. ",
  "After the trip ended, I sold my now dried P. Cyanescens to a buddy for $50, he got about 7 strong trips worth of shrooms.  I saved the P. Azurscens for another time.",
  "Day 2-In the morning, me and a friend went out to the sand dunes along the coast to pick some P.Cyanescens, word was they were poppin' huge out there.  After about 2 hours of picking mushrooms we ended up with about 130-150 absolutely gorgeous P.Cyanescens.  We cleaned them and put them on the rack to dry, and I invited some friends over to trip.  We waited for my roommate to get home from work to join us.  When he finally arrived, he held a package for me in his hands that he had picked up on the way inside...it was my ethnogens I had ordered 5 days earlier. ",
  "I decided to see how much P.Harmala affected a mushroom trip, while everyone else just ate mushrooms.  My roommate and friend boiled 6 large P.Cyanescens in a pot and drank it while I ate about 7 medium P.Cyanescens and 2 grms of P.Harmala.  P.Harmala definitely potentiates the trip, more physically than visually in my case.  I was completely stuck in an extreme gravitational downward pull, while the other two were just chillin'.  We were watching Fear and Loathing in Las Vegas, which I've seen a million and one times, so I barely paid any attention to what was happening on the screen.  I was more interested in the walls and carpet in my house.  My thought process was very jumbled the entire time as well, and while my buddies returned back to reality 5 hours after eating the P.Cyanescens, I didn't return for another 3 hours after they were back to ground zero.  It was really physically intense though, not hot like the night before but that downward pull was enormous.",
  "Day 3-I awoke early this morning and decided to try the calamus experience.  I measured out an 8 inch section of dried root, took a bite and started chewin'.  It was damn spicy and tasted foul, like fish.  I decided to grind the rest with my mortar and pestal and swallow balls of bread with the powder inside.  3 hours later, I have tingles that feel really nice, but I'm feeling nauseous and I cant keep that nasty taste from coming back every now and then.  I'm not going to eat A.Calamus anymore."
 ],
 "erowid": {
  "id": "48262",
  "citation": " Blue Runner. \"Tumbling Through the Abyss: experience with P. cyanescens, P. azurescens, Syrian Rue & Calamus (ID 48262)\". Erowid.org. Mar 7, 2007. erowid.org/exp/48262",
  "substance": "P. cyanescens, P. azurescens, Syrian Rue & Calamus",
  "views": "8872"
 }
}
