{
 "id": 7988,
 "title": "Everything is Alive",
 "date": {
  "submission": "2008-02-17T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Billy Idol",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "3.5",
    "quantity": "3.5"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I had been wanting to try mushrooms for a long time. Ever since I heard how awesome it was from my friends. Finally, me and my friend planned the day, I gave her some money and waited for the time to come. The plan was for me to do the mushrooms and for her to be my 'trip sitter.' I guess I kinda made a big deal out of it, but I spent that entire week mentally preparing myself. The main thing for me was getting over the anxiety of not knowing what to expect. 'Will I freak out and run into traffic? Will I see something horrible and never be the same again?' All these questions and other such thoughts were running through my head and I knew that I couldn't think like that or else I WOULD have a bad trip.",
  "The day was finally here, I tried to supress all my bad thoughts as I took the bus to my friend's apartment. I just put my headphones on and relaxed on the bus. It was a typical November day in Vancouver. It was about 8 degrees with a steady rain. But I like the rain, so its all good. I got to my friend's apartment and she showed me what I was going to be eating. It wasn't really what I expected. There was just a plastic baggie of stems and caps. They had a milky colour and a rough-ish texture. I tried to eat one on its own, but I wasn't really digging that, so I pulled out some leftover pizza from my backpack and loaded up a piece with all of the 3.5 grams. The journey had begun.",
  "By the time I finished eating the slice of cold pizza, I felt strange. Not high...strange. I felt slightly elevated, like I was looking forward to something exciting. Soon, I began noticing things. Things that were there, and always were there, but would be overlooked in any other circumstance. Like the extension cord behind the TV or the reflection of the window on a piece of plastic. I lay down and waited for the full effects to come. My friend put on some music (Pink Floyd I think) and waited to watch me start tripping.",
  "After about 30 minutes, I had a very strong urge to go outside. It was a completely random idea. 'I have to go outside,' I said. So we put on our jackets and walked to a coffee shop to get some tea. On the way there, the mushrooms started to kick in. Colours seemed more vivid, sounds were amplified and, my favourite part of all, a huge fit of uncontrollable laughter. I tried to suppress the laughter as we walked into the coffee shop, but it was no use. I believe I caused quite a disturbance. I looked at a box of tea and was amazed to see that the little cartoon windmill on the box was very clearly turning. I became mesmorized and I just stared at it. Every couple of seconds, I would utter a tripped out 'Whhooaa...' and start laughing again. My friend bought me some tea, grabbed me by the arm and she dragged me away from my first hallucination.",
  "We walked to the beach, which was about 4 blocks from the coffee shop. Walking had become floating. I didn't feel my feet hit the sidewalk. Everywhere I looked, things were moving. Mailboxes, fire hydrants and even houses, they were moving. But they were no getting up and walking around, it looked as if they were breathing. 'Holy crap! Everything is alive!' I shouted in excitement. We got to the beach and the trees were warping. They were bending and shifting. The grass was ten times greener, the rain was a thousand times wetter and there were random shapes floating in the ocean before me. This moment at the beach was the single coolest moment of my life.",
  "We walked back to her apartment. Well, she walked, and I floated. When we got through the door, she showed me her new red light that was in the entryway to the apartment. There was also a mirror there. I looked into the mirror and my face started melting. I was sure my face was melting because of the red light, so I told her to turn it off. The next 2 hours were amazing. The floor was growing veins around my feet wherever I stepped, the walls looked as if they were on fire and a chair ate me. I went out onto her balcony with some paper and a pen and wrote the first things that popped into my mind. When I wrote, the ink looked like it bled down the page. When I was finished writing, it was 4 pm. 4 hours since I ate the mushrooms. The hallucinations were wearing down and it seemed like reality was sneaking up on me again so I decided to hit the road and bus back home.",
  "I got home and took a shower. It felt better than usual. I was very comforted by the warm water and felt at peace with everything. I looked into the mirror and noticed my pupils were still the size of quarters so I decided to get some rest. I woke up the next morning at noon and felt like a new man.",
  "I am definately doing mushrooms again, it was the coolest experience of my life. It was fun because I chose my place and time and I was with someone I would trust my life with."
 ],
 "erowid": {
  "id": "48264",
  "citation": " Billy Idol. \"Everything is Alive: experience with Mushrooms (ID 48264)\". Erowid.org. Feb 17, 2008. erowid.org/exp/48264",
  "substance": "Mushrooms",
  "views": "6426"
 }
}
