{
 "id": 799,
 "title": "Gates Of Heaven",
 "date": {
  "submission": "2004-03-04T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "anonymous",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "20 mg",
   "substance": "smoked"
  }
 ],
 "report": [
  "I had recieved the bag of 5-MeO-DMT a day before and had experiemnted with it a bit. The overall buzz and nausea it produced were too much to enjoy the experience and I was rather dissapointed. Then the next night while I was rolling I was given a divine command to smoke some. 30 seconds after inhaling 20mg of 5-MeO-DMT i was suddently proppeled into a blissful world that I would describe heaven to be. There is no way to describe it in words: its  just wow, beauty, bliss, everywhere. I experienced no nausea and was easily able to walk around my enchanted surroundigs. Throughout my body and everwhere around me was nothing but absoulute bliss. As I began to come down from the 5-MeO-DMT I found myself continuing to smoke more to prolong the feeling; it became almost addictive at the time, I kept wanting more and more; which turned out not being much of a problem as eventually I desired no more and was perfectly content to let myself drift away to sleep or a place like it.",
  "The combination of these 2 substance is by far the best experience I have ever had in my life. There is no need to do anything else; it all would be nothing in comparison. Ever since that night my perception on reality has changed for the better; everything seems more open and a part of me. I am amazed few others have reported trying this combination, as for me I experienced only the positive aspects of 5-MeO-DMT multiplied by 10."
 ],
 "erowid": {
  "id": "12173",
  "citation": " anonymous. \"Gates Of Heaven: experience with MDMA & 5-MeO-DMT (ID 12173)\". Erowid.org. Mar 4, 2004. erowid.org/exp/12173",
  "substance": "MDMA & 5-MeO-DMT",
  "views": "14958"
 }
}
