{
 "title": "A Beautiful Summer's Day",
 "author": "Uniter",
 "citation": " Uniter. \"A Beautiful Summer's Day: experience with 2C-B (ID 79928)\". Erowid.org. Jan 25, 2010. erowid.org/exp/79928",
 "substance": "2C-B",
 "bodyweight": "125 lb",
 "report": "<p>What a day :)</p><p>I woke up around 11 and slowly got out of bed around noon.  Got dressed, brushed my teeth, take my dose of multi-vitamin, piracetam (2.5g) and lecithin.  Head on upstairs, grab a breakfast of cheese and crackers and take some vitamin E and fish oils for that fat soluble antioxidant goodness.  At 10 to 1 I took a capsule containing 23mg of 2C-B that I weighed out last week but didnt take, I was going to take 25 but seeing as I already had 23 weighed out and I would have some possible contact with strangers I figured Id just take the 23.</p><p>I then got in the shower and cleaned the sticky, greasy gunk off of me and felt great afterwards.  I then went outside to find the front tire on my bike was flat.  I figured it had a slow leak because I was riding around the other day and it was fine.  I pumped it up, packed some water, oatmeal bars, and tire pump in my backpack and headed off to a spot I know thats about 45 minutes away, on the water.  Ive spent lots of time there in the past, its one of my frequent rendezvous points where I go and smoke a joint.</p><p>The bike ride there was tough.  Against the wind, and the island seems to generally slope in the other direction.  It was hot too, good, strong sun.  By the time I got there my legs were jello, walking felt so weird.  The shoreline here is all smooth, sloped limestone going into the water.  I got a nice spot underneath a willow tree and lied down for a bit.  Got some nausea but not too bad, just a part of coming up. </p><p>I had a desire to tweak the pickle which did not go unheeded but it was a tricky situation.  Its not completely private around there.  Theres the water, where a boat could go by, and the little laneway of a road where, by the off chance a car would go by or someone cruising around on an ATV.  I got up to go in search of somewhere more private.  Its a wooded area but theres houses mingled in with the woods so its not exactly good. </p><p>I notice this cool, hand painted, multi-coloured, cutsie mailbox that just made me feel so good, it was so vibrant and full of life.  The funny thing was the driveway beside that mailbox had a gate and a private drive sign on it.  Not a big, menacing gate but nonetheless a gate and a sign; which isnt too common around here.  Now when I see a gate and a private drive sign, that translates to me as Stay the fuck out!.  It was like total contrast; the most welcoming, happy mailbox with a gate and a sign.  Kinda struck me as odd.  At this point I was signing that song from the Five Man Electrical Band in my head. :)</p><p>As I was on my way back to my spot I see an SUV pull in off the main road.  Instantly Im thinking Oh shit, here it comes, this is what I was worried about having to deal with people. I was also quite altered by this point but still okay.  Im thinking the person is going to pull up and start asking me what Im doing wandering around so close to his driveway for and why Im down this little (public but secluded) laneway anyway.  Luckily the person just pulled up, I waved hello, he waved back and he just turned around and left.  I felt relieved but I was still a bit shaken, I was getting ready for a blast of ego.</p><p>I really got thinking about how we are such a territorial species.  Out here in the country we all still have our fences, no trespassing signs, people get pissed and nervous when youre close to their area, that kind of thing.  We all have our little domain, our spot, and we get nervous when others come close to it.  This makes it a bit inconvenient for a harmless, tripping young adult to just have a nice day by the water but I get by.</p><p>So anyways, after not finding an ideal spot to tweak the pickle (which I felt like must be done to relieve the tension and help the trip flow better and well I wanted to) I head back down by the willow tree, look around, make sure no boats are in the area, no one up by the road and somewhat quickly get the job done.  Not the most ideal of circumstances; I like to be in a completely safe place and be able to take my time with that sort of thing but cest la vie.</p><p>After that I was feeling really good.  I wanted to go swimming badly.  I was hesitant because the water is pretty cold (its been a cold spring/summer up here so far), I had my feet in but I wanted to immerse myself; I was drawn to it, but hesitant because it was cold.  Anyways, I slide down the mossy rock and Im in up to my waist.  Me oh my, getting into 70F water when youre tripping sure makes you feel alive.  When I was standing there up to my waist in the water I started getting those deep and dangerous thoughts (ie What is real?) and I started moving my hands in the water, felt the cold, felt the wind, took the sensory onslaught of the environment in and knew this is real.  Me at this moment in time, feeling this, is real; I am real.  All that mindfucky, trippy, dream/matrix shit can go suck the big one.  This universe is real and so is everyone in it.  We may not understand it, but we live it. :)</p><p>At this point I bit the bullet and went swimming, putting my shoulders in and swimming around.  Its like ice hitting your warm shoulders, shocker.  Following that, my head went under another shocker.  Being immersed in cold water felt amazing.</p><p>After swimming around for a bit I got out and lied down on the rocks in the sun.  The warmth, that life giving warmth.  That big ball of nuclear fusion in the sky was making itself known.  The giver of life was also the taker of life.  I could feel the radiation on my skin and knew that if left too long out in this blaze I would get one hell of a sunburn and if done repeatedly, cancer would ensue.  I love the sun.</p><p>After lying there for a while taking it all in I was warmed up, dried off and felt like moving around and getting a change of scenery.  The trip was on its way down as well so I figured Id just hop on my bike and make my way home.  My front tire was a little bit soft so I pumped it back up with my 20 year old, squeaky POS air pump that got the job done.</p><p>Getting away from the water and onto the main road, pedaling my heavy mountain bike reminded me of how hot it actually was.  My mouth was producing a yucky flavoured, warm, thick saliva concoction that I repeatedly spit out, this felt good.  I stopped halfway home for a drink of water down by the water.  Got back on the bike and kept going.  Made it home, feeling kind of hungry and in need of protein so I had a whey protein shake which was scrumptious and made me feel quite good.  I then felt a desire to communicate my experience so I grabbed my laptop headed out to the balcony to type it up; and thats where I am right now. :)</p><p>All in all, a beautiful summers day.  I think 2C-B just became my drug of choice.  It has the warmth and euphoria that I seek, and that raw, truthful depth is present.  A great and fun psychedelic in my book.  Its also nice to be able to interact with people if the need arises.  Taking a tryptamine in a situation like today would not have been as pleasant; Id have been more worried.  2C-B is great for day tripping in situations where you could come in contact with the outside world.</p><p>This is my first time tripping during the day ever and it was much more fun; this kind of thing with 2C-B will definitely be repeated.</p>",
 "year": "2009",
 "id": "79928",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-25T08:00:00.000Z",
 "views": "2378",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "23 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "(capsule)"
  }
 }
}
