{
 "title": "Fantastically Wonderful",
 "author": "Spider Salley",
 "citation": " Spider Salley. \"Fantastically Wonderful: experience with H.B. Woodrose (ID 7995)\". Erowid.org. Aug 28, 2002. erowid.org/exp/7995",
 "substance": "H.B. Woodrose",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  "8 seeds",
  "oral",
  "H.B. Woodrose"
 ],
 "report": "<p>This past weekend 2 friends and I decided to take HB Woodrose seeds.  I was the only one who had taken them once before, as well as the only one who had had any psychadelic experience (I have done mushrooms before).  Fortunatly my friends trusted my knowledge and previous experiences enough to try the seeds with me.  During our experience we were in an ideal setting - my friend's rental house in Tahoe. In all there were 4 of us, the 3 who were going to do the seeds, and a mutual friend who prefered to drink lightly instead.  The 3 of us took the seeds around 6:30 on Saturday night.  Instead of trying the elaborate extraction method, we simply scrapped the seeds clean of their outer casing, put them in a glass of water, and microwaved them for 3 minutes.  Although this softened the seeds enough so that we could chew them, I would recommend trying 3:30 next time. </p><p>After we chewed the seeds and chased them with M&Ms we sat down to watch LA Confidential, which none of us had seen before.  I warned them that we wouldn't come close to finishing the movie - it would be far too demanding to pay attention to once the seeds started hitting.  After about 30-45 minutes my friends and I noticed some nausea setting in, as well as increased sweating on our hands and feet.  Then I began to notice the waves.  My friends did not notice as much as I because they didn't know what to anticipate.  After another 15-20 minutes we all knew that something was coming.  We all smiled and laughed at the prospect.  I went into the bathroom and checked out my eyes - they were pretty dialated.  I couldn't remember how many visuals to expect so I asked my friends to come outside to watch the sunset.  We shut of the movie and sat down on the deck.  It was about this time that the visuals began to slowly set in.  I remember looking at the sky and watching it become 3-dimensional.  It would curve towards me, then away, in a figure-8 like motion.  Soon my friends began seeing similar effects.  As the sun began to fade, as well as the beautiful pink-colored clouds, we retreated into the living room.  At this point we were still in the in-and-out phase, so we were coherent enough to start a fire in the fireplace.  As the fire began to blaze we turned on Pink Floyd's Dark Side of the Moon. We turned down the lights and light several candles.  We found comfortable places to sit and tuned into the music.  I remember my thoughts racing, and my body beginning to feel the euphoria.</p><p>My friends had mostly gotten past the nausea as well, which eased my thoughts because 1 of them has a light stomach.  As time progressed we occasionally talked about what we were feeling, and what we could see.  I certainly wanted to talk the most, but I had to remember that this was a completly new experience for my friends.  We put on Paul Oakenfold's Tranceport album and about this time is when everyone peaked.  I continue to be amazed on how important music is for the experience -- it just takes you to another world.  I wouldn't say that I was completly at peace at this point, as I often am on E, but I certainly felt pleasant.  I checked on my other friend who was reading a book in the other room, and let me fellow trippers embark where ever their minds would take them.  I spent a lot of time with my non-tripping friend, which was cool because he's very mellow and intrigued about the whole experience.  I think sometime in the future he may be ready, but not yet. </p><p>It is hard to recall everything that happened the rest of the night, but I had amazing open and closed-eye visuals.  I remember sitting and staring at the bathroom rug, which was multi-colored and heavily textured.  It looked as if the rug was made of intertwining cork screws, each flowing over each other in a wave-like fashion.  I continued to feel wonderful inside, and I knew my friends were feeling the same. </p><p>The following morning we all felt quite good, besides the expected mental fatigue.  My friends reiterated how wonderful their experience was, and thanked me for getting them to try it.  Hopefully we'll have another opportunity in the future ...</p><p>Notes - On the web you will find other reports that discuss difficult, even frightening experiences with the seeds.  In my experience, if you are with good friends who you are comfortable with, and you are in a comfortable environment, you are bound to have a good experience.  I cannot stress the importance of this.  I highly recommend against taking any heavy drug if you are going to be around people you do not like ...  Also, my friends and I are all close to 6'0 and 175 pounds.  If you are less than this I would recommend lowering the dose to 5 or 6 seeds.</p>",
 "year": "2001",
 "id": "7995",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-08-28T07:00:00.000Z",
 "views": "15307",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "8 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 }
}
