{
 "id": 7996,
 "title": "Morning Glory Experience",
 "date": {
  "submission": "2000-08-07T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "[_eNiGmA_]",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "13.5",
    "quantity": "13.5"
   },
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Well, the experiment was an absolute success.  The LSA alkaloids did do as advertised.  However, I still find it to be a better idea to go and purchase LSD-25.  The fact of the matter is that the materials are about twice as expensive as the LSD-25 ($9.00), a tenth as potent, nausea isn't a problem with LSD-25, and it (LSD-25) doesn't require preperation.  But, the LSA alkaloids do produce LSD like effects with some intresting additions to that; i.e., tiredness, lethargy, nausea, slightly increased physical stimululation in comparison to LSD-25 (can be attributed to other alkaloids present in seed material), visual stimulation(hallucinations) to a lesser degree than LSD-25, 'afterglow' is quite pronounced (greater day after effects than LSD-25).",
  "LSA EXPERIMENT:",
  "13.5g Morning Glory 'Heavenly Blue'  Seed Material",
  "12:30 PM EST:  Seed material washed three times using dove liquid detergent and fine screened metal strainer.",
  "12:45 PM EST:  Seed material ground to a fine powder via coffee grinder",
  "12:55 PM EST:  Seed material mixed with approx. 10oz. of carbon filtered cold H2O.",
  "01:55 AM EST:  Seed material strained into 12oz. glass using fine screened metal strainer.  Resulting in thick seed pulp-like material in strainer and a heterogeneous mixture of seed and water inside the glass.",
  "02:05 AM EST:  Liquid material refridgerated (approx. 30 degrees F.).",
  "02:15 AM EST:  Half of the liquid material consumed .",
  "02:20 AM EST:  Approx. 1 gram of marijuana smoked to ease the nausea.",
  "02:25 AM EST:  Remainder of liquid material consumed.",
  "02:28 AM EST:  Vomited",
  "02:31 AM EST:  Very slight LSD-25 like onset symptoms.",
  "02:45 AM EST:  Pulp-like seed material consumed on toasted pumpernickle with butter.",
  "02:51 AM EST:  Intensity of LSD-25 like onset symptoms increased.",
  "03:45 AM EST:  Approx. time of LSA trip peak.",
  "04:46 AM EST:  Mild trip(equivalent: 1 good paper dose of LSD-25), very physical trip(numbness & tingling of limbs and body), Head is suprisingly 'clear'(thought and articulation of sentances), visuals, audio is only lightly affected, slight nausea is present."
 ],
 "erowid": {
  "id": "483",
  "citation": " [_eNiGmA_]. \"Morning Glory Experience: experience with Morning Glory Seeds (ID 483)\". Erowid.org. Aug 7, 2000. erowid.org/exp/483",
  "substance": "Morning Glory Seeds",
  "views": "110608"
 }
}
