{
 "title": "I Hate It!",
 "author": "SkankySkeezer",
 "citation": " SkankySkeezer. \"I Hate It!: experience with LSD (ID 7996)\". Erowid.org. Dec 23, 2003. erowid.org/exp/7996",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "oral",
  "LSD",
  "(blotter / tab)"
 ],
 "report": "<p>This happened awhile ago, I'd say in about the summer of 1998 or so. I was 22 and I'd just moved in with my boyfriend (now my husband), and his psycho little brother had moved out. So I was very relieved and happy (that the psycho was out of my immediate life). Our apartment was a crapheap, a former crackhouse, and they were remodeling it and the rest of the building for the entire year we lived there. But it was Sunday, and the workers claimed they'd have the day off. So me and my man took two hits of acid each.</p><p>I was feeling great when it started. I was happy and looking forward to painting, drawing, talking...just hanging out. For some reason I strongly needed to get naked as I was born. My husband started making out with me, then there was a knock on the door. The construction crew had been called in to work on the plumbing and to install our new sink. We of course told them it was a very bad time, so they set to work on the apartment directly below ours. I hid in the bedroom closet with the cat in my arms, scared out of my mind. My was heart was racing and I was afraid of being found out, and everything that may have gone with that. Arrest, parental disapproval, being abandoned by a severely judgmental friend. Basically, the trip was sent on a permanent negative course. And it lasted at least 12 hours. We ended the night by seeing an Aphex Twin concert and those giant bears really freaked my shit out.</p><p>All day I could hear the pipes being banged and I could never tell if the men were in our apartment or not. We actually checked the bathroom several times. I could hear everything all at once, and I couldn't tell where any sounds were coming from. People outside may have well been standing right next to me and whispering in my ear for all I knew. After awhile we went into the front room to listen to music. I believe it was Beck. He sounded so real. Like I could feel him. I don't know how to explain it. It's like I decided I knew exactly who he was just by the sound of his voice, and I dubbed him one of the few genuine good people on the planet. I watched the wood grain of the floor dance in sync with the music, and was quite amused for awhile, then I was horrified. We shut off the music and just lay on a futon by the window, watching the swaying branches of a huge tree outside.</p><p>I heard a woman yell at her kids, I heard a slap, screeching tires, swearing...Everything all at once and from everywhere again, but this time I all I heard was misery, evil, and pain. But when I looked outside I saw the beauty of the clear blue sky and the vivid life of the tree. The contrast between the evil of us and the beauty of nature seemed wrong and sick, and then I started crying for all of the idiots that make themselves and others miserable on purpose. I decided it was on purpose. There was no need for this diseased society after all. After my crying jag I followed my husband into our bedroom. I curled into a fetal position on the bed and starting whining, 'Make it stop. Make it stop.' Over and over. I held my hands over my ears but I could still hear everything. The cat jumped up with me and lay right against me purring as I sobbed uncontrollably for at least fifteen minutes straight. Then I looked at her face. It seemed concerned and confused. This somehow struck me as hilarious. I then proceeded to laugh hysterically and loudly for twenty minutes straight. Then the cat became frightened and ran off. This spun me back around to sobbing.</p><p>After awhile my husband decided he needed to have sex with me, I didn't really want to, but I just let him. It was horrible. I felt bent to suit someone else. Like I was being bent to unnatural shapes, like putty. I felt invaded, like a deflating balloon, like I was shrinking inside of myself, and being turned inside out. Like my muscles were shrinking and shrinking. Like I would sink into the mattress and drown in its fabric. I kind of wanted to. Then I heard footsteps. I paid them no attention, because I'd lost all ability to discern where a sound was emanating from. But I'm sure the front door opened, and I heard a man yell back up to someone. I heard laughter, and him amusedly inform someone, 'They're out of it.' Then the door closed. When It was over my husband was very clingy and apparently had a completely different experience from me. Later he said it was beautiful, close, almost ephemeral. He really doesn't like hearing my side of it.</p><p>I was starting to feel myself again. But I was still far gone. We for some reason we closed ourselves up in his brother's former room. I think because there was nothing in it really. The least stimulus available seemed the best amount. I leaned against the window. Suddenly I was afraid of falling through. I thought I was very fat, but I wasn't. Then I saw a drug dealer and I wanted to fall out and on him. It seemed funny somehow. I actually had to exert mental will and pressure on myself to not do it. I forced myself to the floor and away from the temptation.</p><p>Then we just stared at each other. We never said anything, or we did but didn't realize we were, and we had a conversation. We were convinced we were on a telepathic vibe. Finally it was subsiding to something very faint, and that's when we went out to the Aphex Twin concert. Afterwards some guy was talking to my husband. He congratulated him on having acquired 'someone like her.' And I was very confused. Mostly because I'm filled with quite of a bit of self-loathing. Which I now know, means I shouldn't do acid.</p>",
 "year": "1998",
 "id": "7996",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-12-23T08:00:00.000Z",
 "views": "7963",
 "dose": {}
}
