{
 "title": "Puh-puh-paranoia",
 "author": "Xanthine",
 "citation": " Xanthine. \"Puh-puh-paranoia: experience with Cannabis (ID 7997)\". Erowid.org. Feb 9, 2004. erowid.org/exp/7997",
 "substance": "Cannabis",
 "bodyweight": "",
 "report": "<p>Paranoia is a funny thing. At the time it seems seriously scary. Then later on, you remember what you were paranoid about and laugh about it.</p><p>I've seldom been seriously paranoid. Usually it's those times when I get stoned thinking I have nothing to do, then I realise that I have to go to some social thing and interract. I don't think I've actually experienced proper paranoia for about a year or two... But I digress.</p><p>My most paranoid moment was a few years ago. We used to have regular parties at my friend Keef's place. Myself, A, Wab, Phlo... occasionally Rolo would be there too. Basically, we just all sat around in Keef's lounge, smoking spliffs, drinking wine and having a laugh all night. As this sort of thing happened quite often, we were all fairly hardened smokers by this point. Amyway, at this particular point late in the evening, I was feeling seriously stoned. We'd had a serious amount each to smoke -- from a couple of blocks of resin that both A and myself had, and a bit of Keef's homegrown.</p><p>It was late in the evening. Probably about 10, and we'd all arrived around 7. A was debating something or other with Keef. The girls sat mostly listening, party talking to each other and giggling. Rolo was rolling another spliff. I was sitting in an armchair, facing the others. In the candlelight, the room looked dim. I suddenly had the unshakeable feeling I was being watched. Out of the corner of my eye, I could see the doorway to the lounge where I was certain a tall black cat sat watching my every move.</p><p>I felt rooted to the spot. I was certain this cat was evil. In fact, I began to grow more and more convinced that it was Satan himself. I started to be scared about having to eventually leave, because the cat would get me.</p><p>I was lost in all these turbulent thoughts behind my glazed eyes for what seemed like an hour.</p><p>'Wake up!' I was shaken out of it suddenly. Phlo was holding a spliff out to me, and I realised I'd been staring blankly for what turned out to be only a few minutes.</p><p>I took the spliff from her, took a drag and then laughed at my paranoia attack.</p><p>Paranoia is a funny thing.</p>",
 "year": "2001",
 "id": "7997",
 "gender": "Male",
 "timestamp": "2004-02-09T08:00:00.000Z",
 "views": "5885",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
