{
 "title": "Mother Nature and the Mountain",
 "author": "e is4 Pete",
 "citation": " e is4 Pete. \"Mother Nature and the Mountain: experience with LSD (ID 8)\". Erowid.org. May 29, 2000. erowid.org/exp/8",
 "substance": "LSD",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "report": "<p>\nTripping outdoors is always the best, letting Mother Nature personally guide you. This is how it went one night last summer.</p><p>Summer break was ending and my friends (Bill, Marcus and Jamal) were just getting back into Colorado from other states.  We had all simultaniously gotten into this drug thing but we had never tripped together.  There was nothing to do on campus this Friday night, but I had 8 hits of acid on me.  I ran into my friends outside our dorm and told them my plan.  To make a night of it we drove Bill's Cougar up towards Rocky Mountain National park at about midnight.  About half an hour after dosing we stopped in a small mountain town along the way to walk around and look at things, including a large dinosaur (triceratops) skeleton in a shop window that we could not stop laughing at.  After meeting this creature and realizing we weren't sober any longer we decided to head on up into the mountains.</p><p>Bill's car stereo is one of the best I have ever heard.  When it's turned up and the windows rolled down you can hear it from literally miles away, we were fortunate to have it with us that night.  As we were listening to DJ Dan while acending deeper into the forest and farther from the rest of the world we decided to pull over and explore.  The moon was full, and the entire forest was ours, it might as well have been some beautiful new green planet we were on.  We found ourselves in a little valley with a stream in the middle and forrested mountains on two sides, with the sky clear and every star shining.  Marcus and I decided to take a walk down to the stream while Bill and Jamal broke some new glowsticks and danced in the middle of the road.  After several hours (or minutes?  you can never tell on this drug) I was thinking that there couldn't be another human within 20 miles of where we were.  Right as I converted this thought into words, a car drove by, saw the glowsticks, hit the brakes and turned around and stopped. </p><p>Right as we were about to panic (we were in no condition to deal with other people at this point) two guys stumbled out of the car with two cartons of orange juice!  I can't remember thier story but they were tripping also, driving across the state.  They left us a carton of OJ and we smoked them up, and they went on their way. Analyzing the encounter, they seemed to be just a couple of farmer's kids out having fun like we were.  They came from such a different background compared to four little candy ravers, and we never would have met them, least make friends with them if it weren't for the drugs bringing us together.  Not long after they left we decided to continue up further into the mountains.</p><p>Several miles down the road we found the spot:  to this day I think of this little area as my spiritual home.  When I die I am sure this is where my spirit will go immediately.  It's simply a small parking lot on the top of a small mountain pass with overlooks on either side.  On the left there is the remainder of a mountain, on the right a small rocky hill that the road winds around.  One can see the lights of Estes Park (50 or so miles away) and possibly further from the overlook, thousands of feet higher than the valleys below.  We were two hours into our trip now, and everything was beautiful, too much so for words to begin to describe.  Huge green pine trees were all around us, concealing us from the world and the world from us.  I had purchased Paul Oakenfold's 'Tranceport' that day and had not listened to it yet.  We put that CD in the stereo and listened as the bass rumbled through the forest, through the valleys so far below and up past the high mountaintops.  I credit that music for creating the feelings felt that night.  We stayed in that spot and danced the night away.  The trees seemed to dance to it also.  At one point the four of us took a walk down the road to look down into the world.  Bill and I were leading with Marcus and Jamal trailing and having a wierd debate about TV commercials or something.  There was a tree laying on its side that apperently gave Bill weird vibe, so he approached it and asked no one in particular 'Are these trees?  I don't think so...'.  On closer inspection they were indeed trees.  All of us had the same perception problems and had a blast sorting things out, but not before engaging in an argument with the downed log.</p><p>Back at the car Bill and I decided we needed a campfire.  We had planned ahead and brought lighters, wood and newspaper to light, so we opened the trunk to get the materials.  'Wait, what were we doing again?' 'I forgot...I know we opened the trunk for a reason...hmm'.  Quickly forgetting everything, we danced for who knows how long before Marcus yelled 'Hows that fire comming along?' 'OH YEAH!  A fire!!'.  After forgetting what we were doing several more times the concensus between the four of us was that we were not of mental capacity to start and maintain a fire, and the idea was dropped.  In hindsight, we probably would have burned down the forest so its better that way.</p><p>I can't tell you the details of several hours where all memories are kida fuzzy, all I can remember is a feeling.  A feeling of joy, contentness.  More so than MDMA can ever give you.  My three best friends in the world, a different world perhaps, and I were all dumb as animals, trying to get a grasp on reality, but there was no hurry in getting to wherever we were going.  We had all night, and memories of school and the campus were so incredably distant as to be a dream.  It was amazing how much like a dream the past 18 years of my life were.  Reality wasn't reality at all, and I was finally awakened from it, into a far better place where reality is constantly changing at the touch of a thought.</p><p>As the sun began to rise we decided to climb the rocky cliff near the car.  The car!  It must have been 200 yards away  and twice as far below us but we could hear Tranceport as clear as ever.  I remember Bill and Marcus climbed up farther than Jamal and I, and watching thier silouhettes dancing against the brightening sky.  Rock climbing was dificult, and here we were conquoring the cliff, and proving it by DANCING on it!  We felt as if we had just climbed Everest and were on top of the world.  And the view from the top...  We were surrounded by miles of wilderness all around us and we could look down on it all and command it.  As supeior beings we watched the sun slowly rise and light the valleys below, feeling a bit like Zeus must have on top of Mount Olympus.  Unfortunately the drugs in our systems were waning, and Jamal and I started the long descent back to the car.  As we got to the bottom a park ranger's car was pulling up (oh no!  We were still too cracked out to string two words togeter in a fashon as to not scare a person not on this drug).  Talking to the ranger was fun as it turned out.  It felt like my mind was so expanded I could understand anything in an instant, while his was compressed and slow.  He was just checking to see if we were OK as it turned out, and gave off a good vibe.  Nonetheless, it was almost 8 am!! and we took it as a sign it was time to head home. </p><p>At the time none of us realized what had trancepired [sic] that night, I hope I conveyed it into words suitably.  It was the perfect trip.  We did everything:  traveled to new worlds, met mother nature personally, talked to her trees and rocks and mountains.  Practiced telepathy.  We met new people experiencing the same things as we were.  We danced.  We discovered new ways of thinking.  We bonded.  No matter what happens many years from now, The four of us will always have that night to look back upon.  Everything was perfectly synchronized.  We got into the mountains righ as we were beggining to peak.  We had just enough lsd in us to see the sunrise and try our hand at being immortal.  When it was time to call it quits and go home God sent that park ranger out to us.  Every time I listen to Tranceport I remember the feelings of this night, although they get fainter and fainter every time.  Still, I look back on it as the best night of my life.  If i were to die tommorow it would be OK because I was there, experiencing it, having more fun than anyone should be allowed to have, and knowing that only a fraction of a percent of all life on Earth has discovered what joy is.  What it feels like to awaken from the dream that was reality.  Thank you Mother Nature and Paul Oakenfold.</p>",
 "year": "1999",
 "id": "8",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-05-29T07:00:00.000Z",
 "views": "3739"
}
