{
 "title": "Unexpected Shift in Perception and Well-Being",
 "author": "G Donovan",
 "citation": " G Donovan. \"Unexpected Shift in Perception and Well-Being: experience with Kava, L-Theanine, 5-HTP, L-Tryptophan, Phosphatidylserine, Tea, Ginkgo biloba, Ginseng & St. John's Wort (ID 80020)\". Erowid.org. Oct 23, 2012. erowid.org/exp/80020",
 "substance": "Kava, L-Theanine, 5-HTP, L-Tryptophan, Phosphatidylserine, Tea, Ginkgo biloba, Ginseng & St. John's Wort",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  "900 mg",
  "oral",
  "Kava",
  "(capsule)",
  "",
  "400 mg",
  "oral",
  "Theanine",
  "",
  "",
  "100 mg",
  "oral",
  "Tryptophan - 5-HTP",
  "",
  "",
  "1000 mg",
  "oral",
  "Tryptophan",
  "",
  "",
  "100 mg",
  "oral",
  "Phosphatidylserine",
  "",
  "",
  "100 mg",
  "oral",
  "Ginseng",
  "",
  "",
  "2000 mg",
  "oral",
  "Tea",
  "(extract)",
  "",
  "60 mg",
  "oral",
  "Ginkgo biloba",
  "",
  "",
  "300 mg",
  "oral",
  "St. John's Wort",
  "",
  "",
  "10 joints/cigs",
  "inhaled",
  "Tobacco - Cigarettes",
  "",
  "",
  "1 ",
  "oral",
  "Caffeine",
  "(liquid)",
  "",
  " ",
  "inhaled",
  "Nicotine",
  ""
 ],
 "report": "<p>Initial Dosage (1800h): Kava Kava Capsules 900mg Kavalactones, L-Theanine 400mg, 5-HTP 100mg, L-Tryptophan 1000mg, Phosphatidylserine 100mg, Panax Ginseng 100mg, Green Tea Extract 2000mg, Ginko Biloba 60mg, St. John's Wort 300mg</p><p>1 Hour prior to bed (2200h): Multivitamin, B-100 Vitamin Complex, Lemon Balm 1580mg, Passion Flower 1400mg, Valerian Root 2040mg</p><p>Between 1800h-2200h: Drank a Coke, Smoked a Nicotine Vaporizer, and about 10 Cigarettes</p><p>It all started after I got home from work.  I had not slept the night before, so going on 16 hours without sleep.  Nothing about this or the night to come was intentional, though if I would have known the effects and feelings to come, I would have repeated the same dosages.  I decided to take a stack of various nootropics and other psychoactive substances to ease me into relaxation and relieve some of the stress that had accumulated throughout the day.  I took the 'Initial Dosage' (see above) simultaneously at about 1800h.  I just started experimenting with the Kava root and this is the first time that I've taken it with another substance.  I sat down and turned off the television and just stretched out across the couch.  Nothing exciting; I wasn't expecting to experience what I did later in the evening.  I took about a 30-40 minute nap, then upon waking, it began.</p><p>I went outside and began drinking a Coke and smoking a cigarette.  My roommate came outside on the apartment porch with me as a severe thunderstorm began to set in.  I felt very drowsy for the next 20 minutes or so.  50 mph winds began to scream and ruffled all of the surrounding plant life that was around the balcony of the porch.  It was then that I experienced the unexpected.  I reached my hand out past the shelter of the apartment balcony to check for rain and noticed a light blue fog surrounding my arms and hands.  I waved my arms back and forth and saw a translucent trail following all of my arm motions.  The light blue 'aura' was a see-through replica of my arm.  It was something like a Hollywood camera trick that you would see in a movie such as Bruce Lee when he does his 'cloud hands'.  I looked back at my roommate and said 'check this out...I think my body heat is making some kind of mist-effect on my arm when I move it in the cold air...'  He simply nodded.  I had no idea that this was actually my mind shifting its perception slightly.  I thought absolutely nothing of it at the time.</p><p>Soon after, I walked inside - I had a strong sense of well-being and mental clarity.  I had no inhibitions, yet I was completely calm, almost stoic.  My mind had the capability of racing and thinking quickly and critically, but I had this unique sort of control of my thoughts, which is unusual as I wasn't doing any sort of meditation or anything of the sort.  As soon as I entered the living room, I realized that I was being affected by the substances.  Even the slightest movement or shift in light would trigger a swirl of trailing colors and visual distortion.  Simply blinking my eyes would cause my environment to erupt in color change or changing/moving lights.  For some reason, the realization that these supplements were affecting me in such a way made me feel euphoric and excited.  I felt a sort of inspiring muse.  I was motivated and inspired to do anything from play guitar, to paint, etc. Unfortunately, I think the euphoria got the best of me and I just wanted to lay back and experience what was happening. </p><p>I went back outside.  At this point, the storm had completely calmed down and dusk set in; it was almost completely dark.  I ran back inside and took the '1 hour prior to bed (2200h)' dose.  I took the combination that I did hoping to induce more vivid dreaming whenever I ended up going to bed.  I began looking off into the distant tree-covered hills and saw a strange assortment of bright white small clouds that were creeping toward the house above the hills floating in from the other side.  It was very strange because these very bright white clouds were in complete contrast to the nighttime sky and the dark surrounding area.  I stared blankly at them, and soon they were 'morphing' into extremely realistic faces and shapes of various recognizable objects, many of them being large animal faces making dramatic facial expressions.  I was completely mesmerized, not to mention very happy and content. </p><p>The dreams that I had that night have stayed with me - images, emotions, and thoughts of what occurred in my dreams lingered the next day in my mind as if the dream was a part of the day.  Something like an engraving of my short-term memory.  The day after this night was very strange.  I was somewhat drowsy during the daytime (lack of sleep definitely contributed to this), and I felt very mentally 'clear'; I was content, and consistently in a calm, mellow, and bright mood. </p><p>To summarize the entire night, it was something like a surprise mild-psychedelic experience.  I felt extremely relaxed, euphoric, and happy/content for several hours; about 5-6 total before going to sleep.  It wasn't mild, per se, but it was like a combination of mild-medium effects in combination created an amazing synergy.  There was physical euphoria, mental stimulation, mental clarity, increased serotonin and overall improvement in mood, I felt mellow, completely calm consistently for hours, and there were psychedelic effects that were unique to my specific experience and perception. </p><p>I would not recommend to anyone to repeat these dosages.  I have been experienced in using all (besides Kava) of these substances, being a user of these supplements for about 2 years.  If you are, though, considering taking some or all of these supplements, please go online and look up a 'drug interaction calculator'.  This is a very useful tool that you can use to look up anything from coffee and cigarettes to Prozac and DMT.</p>",
 "year": "2009",
 "id": "80020",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-10-23T07:00:00.000Z",
 "views": "6484",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "900 mg",
   "administration": "oral",
   "substance": "Kava",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Theanine",
   "form": ""
  },
  "2": {
   "time": "",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP",
   "form": ""
  },
  "3": {
   "time": "",
   "amount": "1000 mg",
   "administration": "oral",
   "substance": "Tryptophan",
   "form": ""
  },
  "4": {
   "time": "",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Phosphatidylserine",
   "form": ""
  },
  "5": {
   "time": "",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Ginseng",
   "form": ""
  },
  "6": {
   "time": "",
   "amount": "2000 mg",
   "administration": "oral",
   "substance": "Tea",
   "form": "(extract)"
  },
  "7": {
   "time": "",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Ginkgo biloba",
   "form": ""
  },
  "8": {
   "time": "",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "St. John's Wort",
   "form": ""
  },
  "9": {
   "time": "",
   "amount": "10 joints/cigs",
   "administration": "inhaled",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  "10": {
   "time": "",
   "amount": "1 ",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  },
  "11": {
   "time": "",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Nicotine",
   "form": ""
  }
 }
}
