{
 "title": "A Comparison",
 "author": "potty",
 "citation": " potty. \"A Comparison: experience with BK-MBDB & BK-MDMA (ID 80052)\". Erowid.org. Jul 22, 2009. erowid.org/exp/80052",
 "substance": "BK-MBDB & BK-MDMA",
 "bodyweight": "67 kg",
 "report": "<p>First off, I have never used 'the real thing', aka MDMA, so I don't know what that's like. I've only recently opened myself up to using other drugs apart from Cannabis, which I've decided to stop using for various reasons. so my experience of other substances is limited to one-time tests of LSD, Kratom and Amphetamine.</p><p>But this comparison can be interesting in its own right I hope. i don't li</p><p>The first drug like this I took was BK-MBDB, so that's really my frame of reference.</p><p>Theese substances (BK-MBDB, aka Butylone & BK-MDMA aka Methylone) are similar in many respects, but the latter is way more enjoyable. Butylone seems nice at first, and is enjoyable in its own way, but has some disturbing aspects to it, at least for me.</p><p>I used butylone on several occasions and found that 100mg seems to be a good dosage allthough this amount only gives me subtle effects. The problem with taking more of it is that it makes me compulsive and confused. When I did Butylone I took 100mg's the first time, subsequent times I did more, most often 200mg with 100mg redoses after a couple of hours. With Butylone, I never quite feel as though I reach the top, there's always something missing, and if not familiar with the substance, one may very well think that a redose, or a larger initial dose, will do the trick. In my experience, that's not so.</p><p>I would spend hours on end trying to perfect something I was working with, getting lost in details, and then in details of details... In retrospect, the results where good, but I still wasted lots of time with things that should be considered of minor importance. This disturbed me even while rolling.</p><p>Butylone takes roughly 30 minutes before the effects started kicking in, then it gives me two nice hours or so, followed by many additional hours that could best be described as confusing. After two hours, I'd enter this compulsive state where I'd be engrossed in minute details, a fact I would be very aware of since butylone split my consciousness into two halves, one being my internal dialogue, which becomes very active and even loud, while the other can best be described as a 'silent part' of me, that was overlooking the internal dialogue. While this might seem interesting, it was really just disturbing for me. This duality led me to question my compulsivness and the work I was doing, but I couldn't do anything about it because I thought I was 'almost there', almost done with whatever I was doing, and then 3 hours would have passed. Id want to do something else for a long time, even simple things like taking a piss, but instead I would remain lost in details, just wanting to finish this or that 'little thing'. This compulsive behaviour would annoy the silent part of me, and it always became increasingly annoyed with my behaviour as the hours passed. It's a very hard experience to describe. The day after using butylone, the last thing I'd want to do is to be around other people.</p><p>In comparison, BK-MDMA makes me clear-headed, energized and in control, with a great appreciation for what I do. Everything is fun, and I have no problem working, being social or whatever it is I want to do. Most importantly, I don't get stuck with unimportant details like I do on Butylone, I Decide Myself! It doesn't split my consiousness in two, neither does it produce negative emotions. Simply put, as for it's mind altering properties, Methylone has all the good aspects of Butylone, and in greater abundance too, while having virtually none of the bad sides. Furthermore, Methylone has a way gentler comedown, it takes a shorter time after coming down before I can sleep, and I haven't noticed anything like the antisocial effects Butylone produces the day after on methylone, rather the opposite actually! Neither does Methylone make me as jittery as Butylone.</p><p>200 or 250mg's of methylone dissolved into a little water is the way to go... Snorting it really sucks i.m.h.o, tastes bad and burns my nose (that goes for both substances) and I have to snort too much too.</p><p>Since I don't know how to get a fine powder up my arse, I haven't tried doing it rectally ;-P</p>",
 "year": "2009",
 "id": "80052",
 "gender": "Male",
 "timestamp": "2009-07-22T07:00:00.000Z",
 "views": "32172",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "bk-MBDB"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "Methylone"
  }
 ]
}
