{
 "id": 8007,
 "title": "Back in the Gameshow",
 "date": {
  "submission": "2002-01-06T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Mobius",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "The story must be told now as my recollections are fast slipping away",
  "Time/Date - 11:30pm, 18/1/01",
  "Setting - dark, quiet bedroom in dark, quiet, otherwise empty house",
  "Subject - 19yo male, 190cm, 75kg, previous experience with LSD, cannabis, MDMA, many others,  approx 5 previous salvia experiences, highest dose 2 average sized cones of 5X extract",
  "Sacrament - Salvia Divinorum 5X extract, uncertain dosage (either 3 or 4 cones)",
  "****NOTE**** it would be useful for non-australian readers, and readers from australia too young to remember it, to know something about an old 80's gameshow on aussie TV called 'It's a Knock-out' (it's possible there was an american equivalent as well). In this show, there were 2 hosts, a man and a woman, and teams of 4 people dressed in coloured costumes would compete in different weird and amusing events, like rowing big inflateable rafts across a swimming pool etcOk now back to the story...",
  "Finding myself with an empty house tonight, and having recently received a bag of salvia divinorum 5X, I decided after brief deliberation that a meeting with the holy virgin shepherdess was in order. Just for background, quite important as it happens, I have smoked salvia on about 5 or 6 occasions over the past 2 months, the most memorable being the latest. This occurred late one night in my friend's backyard, by myself, still feeling the effects of some mdma I had taken earlier in the evening. The most important event of that journey was that I became a part of a giant machine, sort of like that old game show 'it's a knock-out' (for Australian readers), that was somehow manufacturing the fabric of reality (which was a bright white sheet embossed with hundreds of pictures of this character reminiscent of HR Puffin Stuff). This experience was, needless to say, overwhelming, but I always felt 'in control' to some extent, in that I felt I could lessen these effects, if not altogether stop them, if I had wanted.",
  "With this last experience in mind, I decided that I wanted to go deeper still into the mysteries of the diviner's sage, and so resolved to smoke 3 cones [bowls?] of the extract (2 cones having been the dose on the previous occasion). Simple kindergaten maths suggests that 3 large cones of 5X is equivalent to 15 large cones of ordinary leafa large dose by all accounts. Seated in a reasonably comfortable couch with lighter, bong and bowl of herb, and with only a single candle for illumination, I began to smoke. After pulling the first cone, I packed up a second while still holding the first in my lungs. After exhaling this smoke, already knowing that this was going to be BIG, I immediately pulled the second. At this point my memories become very blurred. I think I smoked the whole cone, but cannot be sure. The first memory I have in this period is of a sort of tunnel of people slowly building in front and to the left of me. This was astonishing at the time, because it was EXACTLY like a continuation of my previous experience described above. As I came to realise this, I was aware of a female presence standing in front of me (though I never actually saw her). This was not, however, the familiar 'virgin shepherdess' reported by many other users. This woman seemed a perfectly normal human - for a gameshow host. She spoke in a very pronounced Australian accent, and acted in a very stereotypically 'aussie' way (those who watch 'Home and Away', think of a female version of Alf Stewart and you'll be close). She acted as the host of this gameshow, welcoming me back (did I just imagine the malevolent note in her voice?) and taking me through various activities too bizarre and confused for me to describe herebut again they seemed to involve joining with these other people (the ones in the tunnel) in some sort of machine. I remember being quite reluctant to participate, but I kept at it regardless (I doubt I could have stopped even had I tried, such was the insistence of the woman). In keeping with the 'It's a Knockout' theme, there was also a male 'host' further to my right (again I never saw him) who seemed to take a more passive role, rarely speaking at all, though when he did it was with the same broad aussie accent.",
  "Up to this point I think I had had my eyes open the whole time, and I remembered something about closed eyes being the way to go with salvia. Rather than increasing my level of divine inebriation, closing my eyes seemed to drag me out of it, as I could tell myself it was all in my head. Although I had no special desire to return to the eyes open state, it seemed inevitable at the time and I reluctantly opened them, back into the gameshow again After opening my eyes I think I looked around me, and it was as if I was seeing in 2 ways at once, both equally real but fundamentally different in the way they presented themselves and the images being presented. The first was the relatively normal every-day sight of the couch and the wall and the curtain, suprisingly normal considering that only a few minutes ago (maybe a few seconds? Who knows) I had smoked a rather large quantity of hallucinogenic herb The other sense of sight seemed to come to me not by way of any sensory organ, but beamed directly into my brain from some point outside it, but inside it at the same time. This was how I viewed the gameshow. It is at this point that I may have smoked another cone and gone back into the more intense gameshow state, or maybe I just remembered what had happened when I smoked the first 2 conesit is all very blurredeventually, after an indeterminable amount of time, I had had enough of the game show and decided it was time to return to everyday perception. This turned out to be much more difficult than expected.",
  "As I tried to pull myself out of the gameshow by focusing my attention on my physical surroundings, a sort of emergency override seemed to switch on in my brain, saying (or rather thinking) 'but this is why you use psychedelics. This is it, don't waste this experience'. Sound advice to be sure, but at that time I wouldn't have a bar of it. I struggled with this thought for a while, thinking of all the nice things I would be able to do when I returned to normal. The experience had become cold and alien, but part of me wouldn't let go of it (or maybe it wouldn't let go of a part of me). I decided that a shower would be a good idea, so I somehow managed to stand up and walk, somewhat unsteadily, to the bathroom, undress and get in the shower. This helped in bringing me back, especially when I turned off the hot water and left only the cold running. I closed my eyes and experienced a beautiful, though not very vivid (damn the drugs are wearing off just when it's getting good, I thought to myself) scene of a waterfall in a rainforest.",
  "Getting out of the shower, I returned to the bedroom to find all traces of the gameshow gone, although I was definitely not 'down' yet I turned on the television, planning to put on a nice comforting video, and the first thing that came on was this commercial with a guy screaming 'SALE SALE SALE: ALL CLOTHING REDUCED TO RIDICULOUS PRICES' etc, with appropriate words being flashed up on the screen in big red letters. I don't know if the rest of the world has this screaming man style of commercial, but it is becoming disturbingly more frequent in Australiabut I digress this commercial seemed so absolutely ridiculous, especially when the guy began to stress that this was all LEGAL merchandise (usually goes without saying.sign of a guilty conscience perhaps?). I began to wave my arms in the air and cheer at each new, ridiculous thing the man screamed at me, recognising that only true genius could concieve such an inspired piece of ridiculousness (if that is not a real word, it should be) Sadly this soon ended, to be replaced by a man riding a lawnmower, saying it was just as good, if not better, than driving a car. This also seemed bizarre, but didn't come close to the preceding commercial. I managed to put on a south park video, predicting (correctly) that this was the closest thing I had to the sublime absurdity of that commercial. While watching, I thought about how pleasant some of my low-dose salvia experiences had been, and decided to smoke a small cone to try and take the edge off the previous 2 or 3 (twisted logic I know) This cone however had no noticeable effect.",
  "Its now 2am, the psychedelic effects are largely over, I'm left with a rather bad headache and a feeling of total exhaustion (though I can tell it will be a long time before I get to sleep). This was undoubtably the most intense experience of my life, and one I'm not sure I'd be willing to repeat in a hurry. All throughout the experience I felt uncomfortable with what was going on, and much of the trip was spent trying to come out of it. One unusual and interesting aspect of this experience was the way it seemed to be a sequel to my earlier experience, even though I only now remember certain aspects of that trip that were mirrored and continued in this one. This is one of the most interesting aspects of high-level salvia trips for me, the way it can affect the user's memories, sometimes to the extent of giving him/her a whole new persona and life. It is this interest that leads me to know that I will definitely be using salvia again, though probably not in this high dose, at least for a while. As an aside, I remember thinking as I was first coming out of the trip about whether or not I would prefer to have had another person there. At first I thought definitely yes, but then I remembered previous occasions where the other person's inability to comprehend what I was feeling further alienated me and made me more uncomfortable (not through any fault of the person, it was the fact that he had not smoked any herb). On the other hand, my most pleasant salvia experience has been sitting in my friend's backyard with two old friends all smoking one after the other (rather small doses) and having a seemingly timeless conversation about everything.",
  "So in all, a very intense experience, extremely bizarre, to the point of being disturbing and uncomfortable, though I'm sure somewhere in there were some important insights into myself and reality. It is to discovering these that my next few sleepless hours will be devoted. In comparison to my last experience, this was much more intense and uncontrollable. The combination of mdma with salvia was, for me, truly blissful and wondroussome moments of this trip were anything but blissful (but I'm sure once I've gotten over my uncomfortable feelings I will see this trip as no less wondrous) First time salvia initiates take note, salvia is not a recreational toy drugsalvia is not to be taken lightly, even in the way some people treat LSD lightly. No amount of acid experience can prepare you for what is a totally different experience. ",
  "Not always pleasant, but rest assured that it's over relatively soon. Try and make the most of it, for it is indeed a special experience, though one only to be undertaken by those who are truly ready for it."
 ],
 "erowid": {
  "id": "4834",
  "citation": " Mobius. \"Back in the Gameshow: experience with Salvia divinorum (5x extract) (ID 4834)\". Erowid.org. Jan 6, 2002. erowid.org/exp/4834",
  "substance": "Salvia divinorum (5x extract)",
  "views": "6313"
 }
}
