{
 "title": "The First Dance",
 "author": "Kitten",
 "citation": " Kitten. \"The First Dance: experience with Methylphenidate (Ritalin) & Heroin (ID 8011)\". Erowid.org. Jul 11, 2001. erowid.org/exp/8011",
 "substance": "Methylphenidate (Ritalin) & Heroin",
 "bodyweight": "150 lb",
 "report": [
  "<p>After the ins and outs of psych hospitals constrained by insurance benefits (or lack thereof,) it was time to return home.  Along the way both ritalin and heroin were obtained and prepared thus: 40 mg methylphenidate and somewhere between 1/8 and 1/4 a gram of our heroin were dissolved and injected. ",
  "It is first thing in the morning when I find myself in the embrace of a forbidden lover.  One whom I do not wish to repudiate.  The intoxicating rush as we come together, the gentle warmth that enfolds me as we embrace, even a bit of longing as we part.  She, (and she must be a woman, for only a woman's embrace is both so intoxicating and and dangerous at the same time) holds me, and as she does, I can't help but want to sink deeper into her embrace.  But, she is a fickle lover, and too much of an embrace leaves a painful parting as I found out.  I could feel the rush immediately, and the pleasure made it feel good to be alive.  I had to wake my partner, and share the pleasure, finally I had found a way to truly enjoy sex beyond a brief interlude.  The pain response was dulled, but the orgasms were incredible, and they drifted one into another for 30-45 minutes.  That by itself is way tempting.  But as I said before, the lady is fickle, and I paid dearly for my pleasure -- an incapacitating headache, paralyzing back pain, and the cold, cold emptyness when she left.  When she holds me again (and that line having been crossed, I will go back) I must remember restraint, and not let desire cloud my judgement. ",
  "However, it may be that she holds the key to addressing and unlocking my past from a safe(?) perspective.  In her embrace, it seems nothing is too painful to be addressed and somehow, her warmth seems soothing and comforting enough to tackle the past from.</p>"
 ],
 "year": "2001",
 "id": "8011",
 "views": "83267",
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "IV",
   "substance": "Pharms - Methylphenidate",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "IV",
   "substance": "Heroin",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2001-07-11T07:00:00.000Z"
}
