{
 "id": 8014,
 "title": "Been wrong to doubt you so long.",
 "date": {
  "submission": "2009-07-07T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Seven",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "2.5",
    "quantity": "2.5"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "capsule"
  },
  {
   "time": "0:45",
   "amount": {
    "unit": "g",
    "grams": "5",
    "quantity": "5"
   },
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "liquid"
  }
 ],
 "report": [
  "Background:",
  "I have now taken syrian rue with mimosa hostilis 4 times. The first time I did it I was fresh out of high school, and just looking to get fucked up. At that time I thought I could never have a 'bad trip'. This substance changed my mind fully. My first ayahuasca experience is the only thing I believe I have repressed in my whole life. However, it was too mysterious and irresistable. So I tried it again... same deal. After that, I tried it a third time, another frightening experience. However, there was only one factor common to all three of these trips: A hasty lack of respect for what I was taking.",
  "2 years later...",
  "The Trip:",
  "My life has changed greatly since the last time I took ayahuasca. With the help of plant hallucinogens I have conquered many of my old fears. I feel like I am a man now. I recently made a promise to a friend that I would eat mushrooms with her. However, as there is only one available dose of mushrooms, I decide to drink the ayahuasca I had ordered a while back and saved for an opportune time to find out what it is really about. I start by grinding 2.5 grams of syrian rue in a coffee grinder. I capsule the rue and swallow it. I then weigh 10 grams of mimosa hostilis and begin to tear it apart in a bowl of cool filtered water. I continue this until the water is too dark purple to see through anymore. After that I strain the liquid into a pot, and boil it off to a drinkable level. It has been about 45 minutes since I took the syrian rue. I have much apprehension of taking this substance so I decide to take it a shot at a time. I take the first shot and wait about 10 minutes until I feel something, then I take a second shot. Which brings me to a spaced out state of mind. After about 15 more minutes I take the third shot. Soon I am tripping. I am a bit frightened, but I resolve to remain strong. I estimate I only took 5 grams as there is half of the liquid left. I feel the presence of this mixture and for the first time I begin to understand it. It leads me through some sort of city behind my eyelids. My stomach is hurting, so I begin to meditate on the liquid that is digesting in my stomach with an old hebrew prayer that I find brings me closer to the heart of Adonai. Soon the pain turns into warmth and begins to pulsate through my body. I feel I am being purified. I feel full of holy love, however I feel there is negativity inside of me that needs to be dealt with. A friend I havent seen in awhile enters the house. Conversations happen, and as I am in an almost trance like state of mind, I rarely am able to join in. Soon the talk shifts focus to her best friend-  a girl that I care for a great deal. It is painful to hear about her substance abuse (as I spent too much of my life in the same position). Suddenly the warmth subsides and I feel the negativity again. I remain strong, but soon I realize it is time to purge. I get up and walk to the bathroom. I crouch by the toilet and begin to dryheave. I let the negativity out of my heart, as the ayahuasca guides me. I dryheave some more, useless emotions that only cause pain begin to leave my body in the form of bubbles (not hallucinated bubbles, some kind of bubbles from inside of me). I let go of selfish emotions that I have about the girl that was just talked about. I feel much love for her and everyone else, but it is foolish to hurt yourself for anothers deeds. When I leave the bathroom I feel free and pure. I have been so wrong about these substances for so long. They are here to help us, and teach us the proper way to live. It is impossible to fully explain what this experience can teach someone. Anything one can type, is just the tip of an iceberg.",
  "Suggestions For Taking This Combination:",
  "Go easy on the rue, Go easy on the Mimosa hostilis, Be respectful of the plants, Dose carefully and slowly, Have someone who makes you comfortable there with you (someone youve known for a long time), Do not take this to get 'fucked up'",
  "If you follow these rules I believe you will have a contenting and cleansing experience."
 ],
 "erowid": {
  "id": "48383",
  "citation": " Seven. \"Been wrong to doubt you so long.: experience with Mimosa Hostilis & Syrian Rue (ID 48383)\". Erowid.org. Jul 7, 2009. erowid.org/exp/48383",
  "substance": "Mimosa Hostilis & Syrian Rue",
  "views": "3768"
 }
}
