{
 "title": "Serenity",
 "author": "Daphne",
 "citation": " Daphne. \"Serenity: experience with Kava (ID 8019)\". Erowid.org. Mar 4, 2004. erowid.org/exp/8019",
 "substance": "Kava",
 "bodyweight": "135 lb",
 "report": "<p>I loathe and despise my job. I detest a majority of my coworkers and find them repulsive and sickening. Unfortunately I still haven't won the lottery nor struck it rich on a great stock so I repeatedly find myself at my job in order to pay for my great life that takes place outside of my job.</p><p>Lately I have been having alot of difficulty assuming my 'fake job persona'. That is where I smile when passing others in the hall and pretend to genuinely care about what others telling me, the current problem at hand, blah blah etc. etc. It would be great if people could handle my real persona which is much more functional in my belief: ie; iterate your fucking problem in as few intelligible words as possible then go somewhere else. But people, at least the ones at my job, seem to think that I need 'cheering up' or additional conversation or that they should stick around until they're sure that I'm happy. So I have found that it is  easiest to give them the personality that they want me to have so I don't have the added pressure of answering questions like, 'what are you doing?','how long will it take?', 'what's wrong', 'are you mad at me?' 'what can I do to make you happy?' when all I really want is for them to go away! For the record, I'm not anybody's boss.</p><p>Anyways.....the Zen Bhuddism approach is not working any more and I'm afraid that I may involuntarily blow my top! Not good. Recently I have read that people's experiences with Kava Kava have made them relaxed and friendly, and that the herb may make one more empathetic, so I left work and ran to the health food store and bought the strongest Kava Kava capsules that they had. I immediatelty downed four capsules 250mg each along with 200mg of 5-htp. Thirty minutes later I began to feel relaxed in a nice way. I ingested 2 more of the capsules (1 hr later) prior to having an interaction with someone that normally would have made me crazy. The interaction was markedly serene for me, I had no panic, no anger and was astonished to find that it was ALMOST pleasant. Approx. 3 hrs after the second dose I dropped two more capsules. To sum it up my body felt relaxed and warm, I was decidedly calmer than normal, remotely giddy but very able to concentrate and be lucid of thought. I am still trying to figure out if this was all in my head but I'm not the kind of person that thinks I feel something just because I am supposed to.</p><p>I am so excited! My formerly doomed coworkers may be spared! It is not a miracle but something that really may help me cope with my cynical and antisocial side. The only drawback that I can think of at this point is that I've heard that using Kava Kava can result in a buildup of toxins within the liver.</p>",
 "year": "2001",
 "id": "8019",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-03-04T08:00:00.000Z",
 "views": "22362",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1000 mg",
   "administration": "oral",
   "substance": "Kava",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP",
   "form": ""
  },
  "2": {
   "time": " T+ 1:00",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Kava",
   "form": "(capsule)"
  },
  "3": {
   "time": " T+ 4:00",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Kava",
   "form": "(capsule)"
  }
 }
}
