{
 "id": 8020,
 "title": "Warm Yellows and Cool Blues",
 "date": {
  "submission": "2010-02-23T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Brian",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 g",
   "administration": "oral",
   "substance": "Heimia salicifolia",
   "form": "(tea)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "SUMMARY:",
  "It was a pretty but mellow, short, and unexciting experience followed by intense discomfort.",
  "STORY:",
  "I've been very excited about sinicuichi ever since I found out about it. I grew a plant & harvested it, but lost the bag I had it in. Finally my friend harvested his & brought it over. The leaves from the plant weighed out to 10 g. We added the leaves and the chopped stems to 4 cups of water and put it on the stove on medium with a lid on the pot (but we adjusted the temperature many times throughout the cooking, from low to medium). 1 1/2 cups of water were added during the cooking process. After three hours I mashed the leaves up a bit with a big spoon, strained them out, and my friend and I split the remaining 2 cups of yellow-brown tea. It was really potently foul stuff and I didn't want to drink anymore after a while. But I just smoked some herb to calm my stomach as I drank it.",
  "The effects came on soon after I finished the cup. I felt heavily sedated and wanted to lay down, but I stayed out on the balcony and watched the sunset. Colors became very vibrant and more saturated, there was a distinct contrast of warm and cool colors... everything was very blue or very yellow. I saw the most intensely detailed pictures in one hovering cloud... a woman playing a violin followed by more esoteric images. I found out later that my friend had been staring at that same cloud for a while watching the cycling picture show. After maybe half an hour I was too tired & I had to go lay down on the couch. Most of the house was so warm and yellow but some places were blue. The alterations in perception soon wore off. Then the intense part came...",
  "About two hours later, my body was filled with a powerful soreness. Everything was incredibly sore, like someone had punched every inch of my body twenty times. When I closed my hand, the fingers, the knuckles, the palms, & the backs of my hands would all hurt in ten different places. I could feel the anatomy of the muscles in my body from the acute soreness coming from all over. I felt a long straight line of pain going down the whole inside of my thigh when I walked & I had a lot of small muscle spasms. It's pretty lame. We drank the tea at 5 p.m. it's now 4 a.m. and I am still really sore, though it's not as thorough as earlier."
 ],
 "erowid": {
  "id": "48412",
  "citation": " Brian. \"Warm Yellows and Cool Blues: experience with Heimia salicifolia & Cannabis (ID 48412)\". Erowid.org. Feb 23, 2010. erowid.org/exp/48412",
  "substance": "Heimia salicifolia & Cannabis",
  "views": "6625"
 }
}
