{
 "title": "Licking at the Fourth Dimension",
 "author": "Floatdownstream",
 "citation": " Floatdownstream. \"Licking at the Fourth Dimension: experience with Ketamine (Powder) (ID 80216)\". Erowid.org. Sep 4, 2009. erowid.org/exp/80216",
 "substance": "Ketamine (Powder)",
 "bodyweight": "145 lb",
 "report": "<p>To give you some background information, I would consider myself an experienced ketamine user. I enjoy using ketamine for its mind expanding and psychedelic properties that can be reached through high doses of the compound. Though I have used ketamine for some time now, it was not until recently that I began to undergo the practice of entering new worlds beyond ours. This was becoming a skill that I acquired through taking higher doses of the drug (usually more than 400mg).</p><p>This experience took place in my bedroom at approximately 12:30am during the week that my parents went out of town. Prior to my parents leaving, I was very excited and knew that this would be a great chance for me to freely trip without the ever-lasting concern of my parents catching me. To prepare for the week I decided to grab 5 grams off of my new ketamine dealer in the next city over. He was my only source and at the time was very reliable for good quality product. After picking up my weeks stash, I did as I always did. I filled up all the vials I had, and crushed up the rest into baggies.</p><p>The night started out with me getting ready for bed and putting on That 70s Show in my bedroom. This was my regular routine. Once I was settled in bed, watching television, I decided that a trip would be very enjoyable right about now. Having my pre-measured vials and baggies, I knew how much ketamine I would be taking. I poured out 500mg from one of my vials and made it into lines. I tend to do larger lines to get the burn out of the way quicker. From snorting these large lines a tear formed in my right eye because of the intensity in my nasal passages. Soon enough the vial was finished.</p><p>Within minutes I realized that I was quite intoxicated, and tried to enter my other world. How I would do this is by turning off all lights including my television and lying down on my bed under my comforter. I would then tilt my head back as to give the feel of sliding off of my bed, and into the next world. I closed my eyes, and prepared for the trip. Deep breathes, soothing thoughts, I was ready.</p><p>It didnt work! Yet. So after a few minutes of trying this routine method of entering the other world I decided that I had not taken enough ketamine. I know it sounds like too much already, but I had grown quite the tolerance. I reached down beside my bed to my drug case and fumbled to grab another vial. I poured out half of it into a fold sheet of paper to crush it, but I was too high to handle all this so I ended up spilling the 250mg on my bed. I quickly found myself licking it up and not long after had it all in my mouth.</p><p>I lay back down under my comforter. I could taste the ketamine in my mouth; a taste that I had grown to love by now, and could feel it dissolving. As I put my head back, I was getting higher and higher, and I knew that this time my trip would truly begin.</p><p>Fwooom! I was falling! Falling fast! Into my bed I sunk, further and further, and then all of the sudden; Black. The black disappeared in a flash of blue, and there I was, but not in my normal body. I was in the body of a human fetus. Was it my fetus? Someone elses? This was irrelevant. The fact was it was me. I was floating through this blue dimension. I was beyond our world, and I soon realized that I could see the lines that made up my room, but I was outside of them. To describe this to you, I would say that I was in a fourth dimensional blue-print, viewing my three dimensional room. It was amazing. I was floating around the Fourth Dimension! I was there! I had somehow reached a new world that has been co-existing with ours this entire time. Soon after I found myself back in my room, but my room was not the same. I was still in the fourth dimension. I continued to float. At first I was in the corner of my room above my bed, and then swiftly I moved up into the top of my closet. I hadnt even been there before in my normal body! This was the most incredible experience of my life.</p><p>Now I could start to feel the fourth dimension slipping away. But I didnt want it to. The reason for the fourth dimension slipping away was the ketamine wearing off, being my door to the other world. My feelings and thoughts were that I had opened a gateway from the third dimension to the fourth, for the first time ever, and I did not want to let it slip away for ever. I was afraid to lose it. I knew it was going away. I was now floating in the corner of my room opposite my bed. I was reaching out to the fourth dimension. I was saying to it something along the lines of: I welcome you to the third dimension! I didnt want it to leave for ever; the gateway was losing its strength. I wanted the two dimensions to live side by side, and for everyone to be able to experience this. But it was impossible. I started to let go</p><p>Gone As I pulled my arm out of its reach for salvaging the fourth dimension my eyes opened. I ripped back my covers as fast as I possibly could, and I was back in the third dimension. I sat in awe, and didnt sleep for hours after this. After this experience I tried several times to journey back to the fourth dimension. No matter how hard I focused my mind and meditated, I would never return. The gateway was closed forever</p>",
 "year": "2009",
 "id": "80216",
 "gender": "Male",
 "timestamp": "2009-09-04T07:00:00.000Z",
 "views": "5389",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "500 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  }
 }
}
