{
 "title": "Virgin's Low Dose MDMA",
 "author": "Legion Bob",
 "citation": " Legion Bob. \"Virgin's Low Dose MDMA: experience with MDMA (ID 8022)\". Erowid.org. Jul 11, 2001. erowid.org/exp/8022",
 "substance": "MDMA",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "85 mg",
   "oral",
   "MDMA",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Dose taken orally in early evening, gellcapped powder.   No real effects for nearly thirty minutes, then mild nausea, followed by onset.  It felt like the duration from onset to plataeu was only about 10 minutes.   The experience was, as one might expect, very mild.   I was a little tired when I took it and would agree with previous reports that, despite it's energizing effects, MDMA doesn't 'wake you up' the way caffeine does.  Rather, I would describe it as letting you ignore your fatigue.  </p><p>As the trip started hitting in earnest I felt light, as though my body were becoming simply an extension of my will.   Movement was effortless and almost unconcious.   I felt a little tense at first, this being my first try on MDMA, but I told myself 'just let it go...' and soon felt completely at ease.  There was no real euphoria, just a general sense of contentment and well-being.   I spent the first hour of the trip walking outside, feeling just a little high.  I semi-unconciously shook my hands back and forth, not out of nervous energy so much as a sense of being well rested and bored. No obvious sensory enhancement.  The rest of the experience was spent indoors with a friend.  I felt an impulse to clench my teeth, but the impulse was minor and infrequent enough that I could easily control it.</p><p> There was only a very minor increase in pulse and no measureable increase in body temp.  I felt unusually sociable and had an urge to communicate and express myself, but again, the effect wasn't overpowering--just a modest modification of normal behavior.  The general mild sensory enhancement of the MDMA began to be apparent about two hours in...I took a piss and found the experience oddly mildly interesting, as though I had never really stopped to notice the sensation before.    At one point I noticed a very faint 'glowing' effect to lights, including very short tracers.  Hardly even noticeable.   Bright and unusual colors seemed more compelling--I found myself particularly drawn to things with high visual contrast.   Music sounded more interesting, and food tasted better.    I had heard about MDMA keeping the iron out of your sword, so I pulled out some of my favorite porn as an experiment.   My reaction was pretty much mild amusement to the material...a sense that something SHOULD be happening, but no real arousal.  And that was just fine.  </p><p>The trip ended so gently and quietly that I could hardly tell you when it happened...I just started feeling tired again and noticed the pupil dilation had gone down.   In the days following, I realize that I really feel a bit better about myself, more able to let go of unpleasent things in the past.   A nice, curious drug.   I'll definately try a higher dose next time, but the low dose was a perfectly nice experience by itself, and so tame that you could trip anywhere and nobody would know the difference in your behavior (although the pupil dilation is a big giveaway.)</p>",
 "year": "2001",
 "id": "8022",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-07-11T07:00:00.000Z",
 "views": "53274",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "85 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  }
 ]
}
