{
 "id": 8025,
 "title": "What i needed",
 "date": {
  "submission": "2002-01-09T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Just a man",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "dried"
  }
 ],
 "report": [
  "Just last night i had a very impressive experiance.  I was hanging about with some of my closest friends smoking some top notch cannabis.  I have smoked many, many, many, many times before and last nights experiance was something special.  I have not taken any 'halucinogens' and do not particularly care to.  What happened last night was an eye opener of EPIC proportions, and i was surprised that i got the effect that i did.",
  "At Appoximatly 8:30 (t+00.00) we packed a (supposedly) average sized bowl.  I say supposedly because i was the one who packe it, and i didnt put that much in. However, the sample burned FOREVER.  Its a nice change when the bud sticks around for a while rather than going up in smoke so quickly.  There were 5 of us, and the pipe went around about 5 times!!!  about 3 times more than usual.  To re-itterate, this was a pleasant surprise.  Once the bowl was finished (t+.15) we were all quite high,  very happy high too, gigles and smiles all around.",
  "I went down stairs to watch some TV, unlike many of those who submit reports to Erowid, i thoroughly enjoy the boob tube, it tends to be nice to me, regardless of how i treat it.  In the middle of Titus(T+45), i began to get this smile.  Not on my face, but in my gut.  I felt as if i had been lifted.  My body got up and went down the hall to a small bed room where it put on some Bob Marley and lied down on a futon, legs crossed and eyes closed.....simply enjoying the high.  Once lying down my mind could fully wander.  The first thing i saw (!!!) was a tennis player...like the ones on super tennis on super nintendo. He was green orange and yellow....all very intense shades. It was as if i was on the level of the court looking up at him from about 15 feet away.  Then a tennis ball went careening through my feild of vision, covered in the saem blues yellows and greens. ",
  "I am, or was, afraid of halucinations, and still have no urge to try any other substance.  Curious?  yes... willing to try?   no. Im not sure why, it just doesnt seem right to me.  After seeing the tennis bit, i shot up.  Sitting straight as a board, my mind came back to zero. Then i realized what had happened, i was hallucinating.  It took me a moment to realize that i was SAFE.  Around friends, in a house with no worries to speak of.  I lied back down and tried to find that place again.  (t+1:15)  I found it!!!  it came back in full force and this time, willingly took a ride.  This lasted for about 15 minits more...until i could no longer keep my experiance to my self.",
  "I ran up stairs to tell my companions about what had happened.  None of them had gotten the same effects.  Maybe my 'set' had something to do with it.  I have just recently beaten a long time case of depresion and anxiety, and realized that i am the happiest person on this planet.  There is nothing that i cant do if i put my mind to it, and nothing can worry me.  Its a nice mind set to be in...let me tell you. ",
  "Anyhow, my friends mainly dismissed it as i tend to have very different experiences than they do. I went out on the back patio for a smoke, and then the world let me in on a little secret.  Its mine, and im sure that the rest of you know it too, so im not going to write it down.  Once this secret hit me, the world opened up.....i watched an appartment complex take off...like a rocket ship.  Then my attention turned to nature.  Everything was praising the sky....the trees, with each and every branch reaching up to touch it. In the snow on the ground i saw faces, mountains and other earthly bits and peices.  Never once did my attention sway towards the universe, i felt centered where i was.",
  "(t+2.45)  Comming down was unappreciated, i was having too much fun.  But all good things must come to an end. I went inside and joined my friends in a conversation. I tried to bring them outside with me, but no one was interested...i guess that this was a little gift from cannabis, to me.  I was thankful, and hope to be on the receiving end again soon.",
  "My perspectives change, maybe for the better, but most certainly not for the worse.  Take it in stride and all greivances will be lifted."
 ],
 "erowid": {
  "id": "4843",
  "citation": " Just a man. \"What i needed: experience with Cannabis (ID 4843)\". Erowid.org. Jan 9, 2002. erowid.org/exp/4843",
  "substance": "Cannabis",
  "views": "4064"
 }
}
