{
 "id": 8028,
 "title": "Addict's First Foray",
 "date": {
  "submission": "2005-12-28T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Andi",
  "gender": "Female",
  "weight": 67
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tsp",
   "administration": "oral",
   "substance": "Kratom",
   "form": "ground/crushed"
  },
  {
   "time": "1:22",
   "amount": "1 tsp",
   "administration": "oral",
   "substance": "Kratom",
   "form": "tea"
  },
  {
   "time": "1:22",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Diazepam",
   "form": "ground/crushed"
  },
  {
   "time": "4:35",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP",
   "form": ""
  },
  {
   "time": "4:35",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Diazepam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I have been an opiate user for at least 2 years - and my tolerance is quite high. Having read about the potential benefits of kratom, I decided to try some. My first experience which was recorded tonight was a good one, however, my next dosage will be more. =) My husband said there's no time like the present, however, as much as I would like to ride the bus again, I don't know exactly how long it will take for my system to be clean, so I shall re-dose tomorrow morning.",
  "6:45- Measured out about 2 teaspoons of the super kratom powder (3 grams) from a reputable Shamanistic online source. Mixed up the herbal powder with about  C Spicy Cider from Trader Joes. Excellent masking ability - the taste was slightly herbal, not unpleasant - but the texture was still like drinking thick pesto sauce. Starting mindset, hopeful, happy, talking to a good friend on the phone, who just makes me grin. Withdrawing slightly from hydrocodone (last taken 7 hours and 45 minutes beforehand), clammy hands, and a slight sweat are manifesting.",
  "7:04- Slight warming on the back of my head, feeling good, hoping for stronger effects. Understand the desire to take more, however, I am withholding.",
  "7:11- Heart rate, normal, pondering a cigarette, however, since I took the powder on an empty stomach, have no desire to encourage nausea. The sweat of withdrawal seems to be lessening.",
  "7:15- Perception definitely slightly altered. Vague fogging or shimmering effect around edges of my vision. I definitely feel as though I am altered, however, cant compare it to any one thing..most like a combination of MDMA/oxycontin if one were to combine them - but without the joyous feeling - just happy mellowness...and it's not as strong. I definitely feel the need to be productive. I ask my husband to drive me to the store, and he does. The store seemed more enjoyable than usual, however, according to him, I was only behaving slightly 'more goofy than usual'.",
  "7:51- Feeling slightly high, my heart feels as though its beating faster, however, when I time it, it is not. My opiate withdrawal symptoms are nearly gone! Im considering a second, small dose.  The pain in my side is gone! (I have a chronic pain condition for which I take hydrocodone) Nice!",
  "8:07- Feeling the stimulant effects, but want the opiate-like ones, so I have decided to take an extra 1 tsp. And 5 mg valium.  This will make for a total of 3 teaspoons, and total 4  grams of kratom 'super' grade. I decided to make a tea out of this one, so nuked about  C water in the microwave, soaked the teaspoon of kratom in it for a few minutes, then mixed in some apple juice and sugar. =) Now I wait.",
  "8:13- I have no withdrawal effects at all from the opiates now..this is a very promising thing! Yeah! One thing I was not anticipating was being hungry. I feel starving but am afraid that if I eat anything I will throw up, as I have read other reports of people experiencing stomach problems. This seems to be a very mental drug - think happy thoughts, and all is good. =) Then, isnt everything like that?",
  "8:18, I read that the speedy effects last for about 90 minutes.good - then they should be over soon and I can get on with the good stuff. I am currently munching slowly on jelly beans as I still want to see where I go on an empty stomach...but just can't contain myself. I hope the little batch of sugar doesnt come back to bite me. I know I always read these reports and say, Oh God, no, you didnt just do ______ (take a double dose after 10 minutes, drink liquor to calm an upset stomach, etc.). Lets hope my jellybeans dont fall under that category.",
  "8:22- Feeling slightly warm and sweaty then, that could just be the withdrawal symptoms coming back.",
  "8:27- When Im coming up on MDMA, I feel hot yet cold at the same time, and vaguely sweaty. Im experiencing the exact same feeling now, but with a calmer edge to it. I think Ill go inside and read a book.",
  "8:29- My heart rate is slightly increased. =) Time to lay down and enjoy the upping.",
  "8:44 (I had my husband write this for me from the other room) Eye lids heavy but still mentally alert, I'd like to sleep, yet dont. It feels good to lie down.",
  "8:55- Feeling much more mellow. My heart seems to speed up and slow down occasionally, but nothing that a cup of coffee wouldnt do. I really want to lie down and listen to some music..but first, some food =).",
  "10:45- Felt very sleepy, so turned off the light and listened to some music. The experience was definitely enhanced. I fell asleep.",
  "11:20- I have since woken up. I would have liked some stronger effects as far as the calming effects went, however, its always important to try something slowly, IMOHO, than hop in the deep end. One really good thing about the kratom was the pain relief I experienced, and the fact that I felt NO need to take hydrocodone- something I normally take 40-50mg of, 4 or 5 times a day- and for the first time in a long time, I missed a dose and felt fine! I've actually only taken 30mg now and feel fine. I believe Ill be doing this again....alot - experimenting with doses and helping myself taper from the opiates. I have noticed slight irritablity on coming down, so have taken 2 5-HTP as well as 10 mg of valium for sleeping purposes. A final note: the jelly beans, and subsequent chips and salsa and pasta stayed down just fine!",
  "Happy trips, everyone!"
 ],
 "erowid": {
  "id": "48442",
  "citation": " Andi. \"Addict's First Foray: experience with Kratom (ID 48442)\". Erowid.org. Dec 28, 2005. erowid.org/exp/48442",
  "substance": "Kratom",
  "views": "19435"
 }
}
