{
 "id": 8035,
 "title": "Once In Awhile, Maybe",
 "date": {
  "submission": "2006-05-25T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "ground / crushed"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "First time: 10mg methylphenidate (ritalin) snorted",
  "Second time: 20mg methylphenidate snorted, 15mg orally at T + 20 mins, 15mg orally at T + 1 hr",
  "This is not my first experience with ritalin, although I haven't used it in forever.  This is my first time snorting it.  I crushed the pill (a single 10mg) using my favorite method: placing it under a CD jewel case and pushing down.  It resulted in a very fine powder just perfect for snorting.  I used a rolled up dollar bill to snort the stuff.  I was expecting it to burn like hell, as all my other experiences with snorting pills have.  However, once it's up there, it really doesn't feel like much.  There's a funny feeling in my nose but it doesn't hurt.  There's no nasty drips!",
  "T + 10 mins:\tNo major changes in consciousness, but something is definetely different.  I feel a slight 'racing' sensation in my head.",
  "T + 15 mins:\tMy nose feels almost perfectly normal.  I can't even tell I snorted anything!  My mind is racing even more than before, and it's on the verge of nausea, but not quite.",
  "T + 25 mins:\tIt's almost like my peripheral vision is fading.  My attention focuses on whatever I wish it to.  It's like it's a magnifying glass for my attention.  Have you ever played with a magnifying glass in the sunlight?  It takes the energy from a large area and focuses it on a small area.  That's what my consciousness is like.  Not only does it focus it, it also gives me more.  It seems like, if I try, I can focus on two things at once, giving each the same attention I would normally give one thing if I were normal.  I am playing Pokemon (yeah shaddup, it's my favorite!  I've been playing it since I was 7 and it's a blast) on my emulator and conversing with my parents at the same time and doing so quite proficiently.",
  "T + 30 mins:\tMy mood is quite elevated.  I smile and laugh at most everything.  Fun!",
  "T + 40 mins:\tI think I'm at the peak.  I'm not drastically altered, but something is different.  I think I will go for 20mg next time.",
  "T + 45 mins:\tA strange feeling.  Stimulated, but lazy.  Almost apathetic.  I just now noticed that my heartrate was increased, although it may well have been that way for some time.I feel hyper, but my muscles feel weak and unable to move with any real force.",
  "T + 1 hr: I have leveled off, and, if anything, have started to come down.  Not a particularly intense experience, but one I will certainly repeat with a higher dosage tomorrow.  I have heard that with two ritalin doses one after another, the second is very diminished, so I will wait a day.",
  "T + 1 hr 30 mins: I am essentially baseline.  A fun experience, but not much to it. Again, a higher dosage is needed.",
  "Some five or six hours later, I decided to try again.  This time, I have two 10mg pills of Ritalin.  I have crushed them up into one line each and snorted them.  This time, it is much more painful than last time, although the pain goes away almost right away.",
  "T + 5 mins:\tI can feel it already.  This feels much more intense than last time. The racing/dizzy feeling is here already, and strong.  This time, there is a strange pain in the back of my nose/throat, but it's tolerable.  I also have a very slight case of the drips.",
  "T + 10 mins:\tThe effects are much stronger than last time.  I think that I'm already at the highest point of the previous experience!  Jaw clenches are starting, although they're controllable at this point.  I can feel my heart beating quickly.",
  "T + 20 mins:\tThe effects have slowed in their increase.  I have 30mg left, and I was planning to save them for tomorrow, but I am going to take them now and just get as fucked up as possible.  This feels awesome, and I want to top out.  I have no way to get any more of this later, which is good, because I love it so much I can EASILY see how I could turn into a junkie.  15mg ingested now, 15 saved for later.",
  "T + 45 mins:\tHaving a ton of fun.  I have an incredible desire to sing along with my music (Rob Zombie), and since there's no one to comment on my terrible voice, I'm going along with it.  I'm filled with energy.  I am rubbing my dog's ears, and I barely have to think about it.  I have been doing it for 20 minutes, my hands are sort of sore, but I have no desire to stop.  A little wierd, but my dog sure is happy!!  The jaw clench is here to stay, it seems.",
  "T + 1 hr: I figure that I might as well get rid of the last 15mg.  Taken later by themselves, they won't do much for me, especially now that I know what a real dosage is.  So, down they go!  My mouth is quite dry, but I have no desire to drink.  Still, apple juice tastes pretty good so I'm sipping on it a little bit at a time.  The jaw clench is pretty bad now.  I remember a long time ago when I was tweaking with Adderall(amphetamine) the jaw clench didn't hurt when I was doing it, but when I woke up the next morning my mouth hurt like hell. I suspect the same will happen here, so I'm doing my best not to clench. ",
  "Listening to music is awesome! I feel like a part of it. Fast music is the best.  Singing along, or humming when there are no lyrics, is a ton of fun.  It would be the shit if I could go to a club and dance, but that's not an option right now.",
  "T + 1 hr 30 mins: The rush now is incredible.  I feel like my mind is flying at light-speed.  I am full of energy.  My eyes are glued all the way open.  Looking at myself in the mirror, I can only laugh.  However, my mindset is too 'intense,' for lack of a better word, to really laugh.  I still find things humorous, it's just that I feel like there are more important things than laughing more than a chuckle or two.",
  "Tip: I have found that sucking and lightly chewing on my finger helps me with the clenching.  It doesn't stop, but it doesn't drive you insane and it will probably hurt a lot less in the morning.",
  "T + 2 hrs: Muscle control is wierd.  It seems like I give every move a little more than I meant to.  When I go to crack my back, it feels like I cracked it way too far and almost broke it.  I have to move carefully, giving a little less 'gas' than I would normally, and see where that gets me.  I bet I could lift a whole lot more than normal, but I would probably also really fuck up my muscles in the process.  The euphoria and hype still seem to be building a little bit, which is incredible.  I am having the most fun I've had in a long time just doing the things I normally do.  Again, I can really see the addiction potential and am very glad I won't be able to get ahold of any more because I am certain I wouldn't be able to control myself.",
  "I just went to take a piss, and I discovered something very strange...  My penis has shrunk!  It's the opposite of a boner!  This happened when I played with Adderall (amphetamine) as well.  Some people report hightened sexual arrousal on stimulants such as these, but the exact opposite happens with me.  Porn doesn't even do anything for me!  Sex is really the last thing on my mind right now.",
  "T + 2 hrs 30 mins: The experience seems to have plateaued.  The clench is actually decreasing, although I don't think it's because the drug is wearing off.  My sucking on the finger trick seems to have worked!  I still have the urge, but it is not as strong and can be staved off by the occasional finger chew.  It is 10:00 at night, and I normally go to bed before now, but I have no thought of sleep whatsoever.  I hope this continues for a long, long time.",
  "T + 3 hrs: The sharpness and euphoria are leaving.  They are about halfway gone, if I had to guess.  It seems like the really positive, fun effects are wearing off.  However, the energy and lack of desire for food, sleep, etc, is still here and going strong.  Then again, music is still pretty cool and the desire (compulsion) to sing along is still full force.  The 'hardcore' fun of the experience is gone, but it is still fun.",
  "T + 4 hrs: The fun part is totally gone.  Now, I just can't sleep. I almost wish I could sleep, because I have to wake up early tomorrow, and I'm not really enjoying myself anymore.  The clenches are still here.  My consciousness is essentially baseline, but I can't sleep or eat.  This sucks.",
  "Conclusion: This has been an interesting experience.  I did enjoy myself a bit, no doubt, but I also don't really want to do it again.  It seems like there's this 'perfect high' that I could reach with Ritalin, and I can see myself taking more and more in an attempt to reach it, but never getting there and instead turning into a junkie.  This is a drug I might use for function, like staying up late to do homework, but not for fun.  The crash sucks way too much to do it often."
 ],
 "erowid": {
  "id": "48471",
  "citation": " Anonymous. \"Once In Awhile, Maybe: experience with Methylphenidate (Ritalin) (ID 48471)\". Erowid.org. May 25, 2006. erowid.org/exp/48471",
  "substance": "Methylphenidate (Ritalin)",
  "views": "45202"
 }
}
