{
 "title": "Warm, Enjoyable and Sensual",
 "author": "Sabje",
 "citation": " Sabje. \"Warm, Enjoyable and Sensual: experience with Kratom (ID 80365)\". Erowid.org. Jan 9, 2011. erowid.org/exp/80365",
 "substance": "Kratom",
 "bodyweight": "65 kg",
 "report": [
  "<p>I'm a 31 year old woman from the Netherlands. I'm a very down to earth person and I don't suffer from depressions. I exercise a lot and I eat healthy. I use multivitamin and added vitamin B supplements because I used to get the flu often because of smoking cigarettes. I don't eat meat and the B supplements give me more energy.",
  "In the past Ive done my share of drugs like weed, speed, coke and Xtc. Occasionally Ive used lsd, mushrooms and smoked heroin a couple of times. Only coke was hard to quit, but the others I didn't feel addicted to. However, I've always felt the need to enhance my weekend somehow. I do have an addiction to some enhancer, but I don't care what substance.",
  "For years I didn't do any drugs until this summer. I took an interest in more exotic, natural drugs. And I quit smoking cigarettes. Unfortunately marihuana makes me very psychotic, paranoia and shy. In Amsterdam we have several smartshops that sell exotic drugs. I asked for something relaxing but not too overwhelming. The lady behind the counter suggested Kratom. She gave me a bag of 7 grammes and warned me about the taste.",
  "When I got home at about 4pm that Saturday, I tried to make tea with it, but the powder didn't dissolve at all. I ended up with a cup of witchbrew. The smell and taste were horrible, but I managed to get it down. After about one hour I felt mellow and euphoric, but still able to talk. I did feel slightly nauseus of the foul taste of the tea, but the euphoria sort of pushed that to the background. I took my bicycle and went cycling in the city. I felt absolutely terrific. I chatted with tourists and smiled at everybody. The comedown was about two hours later. The effects just gradually faded. The nausea stayed the whole time, but during the comedown I noticed it more. When I got home again, I still felt it and didn't eat anything the rest of the night. I didn't feel any mental hangover.",
  "After that, the next time I took it was with two girlfriends. We were going to the beach that day. I bought four bags of seven grammes each. We each took one bag and split the remaining bag which left us with over nine grammes. We decided to mix it with 500 milliliters of fruit yoghurt each. It mixed better, but my body seemed to remember the resulting nausea from last time. I had the hardest time getting it down. I gagged a couple of times, but managed. My friends had less trouble, but didn't like the taste either.",
  "At the beach we all felt euphoric. Again, I felt nausea and my friends did too, but less than me. I'm as hetero as a girl can be, but I felt a sexual interest in my friends. They said they felt that too. We spent all afternoon lying in the sun, swimming and running around each other like kids. It was great. When I was almost home, I felt so nauseaus I had to step off of my bicycle and I vomited in the grass. At home I vomited again a couple of times until I fell asleep. I didn't sleep well, my mind seemed to be in a loop, like with acid, but a lot less strong.",
  "Ever since then I did use Kratom every time I went out. It did get harder to get it down each time, but I didn't vomit again. I've come across an internet company that sells a 60x extract, that completely takes away the nausea. I noticed it doesn't mix well with alcohol. Alcohol seems to lessen the effects and increase the nausea. Another warning: Kratom is a serious pain killer. Sometimes I get home with bruises or scabs that I don't remember acquiring, because I didn't feel any pain. I do imagine it can help a lot for people suffering from migraine.",
  "When I'm high on Kratom, I do experience some craving for more during comedown. I don't experience this craving on other times when I'm not high. Kratom has become a regular drug for me and I enjoy it on pretty much every party.</p>"
 ],
 "year": "2008",
 "id": "80365",
 "gender": "Female",
 "age": "31",
 "views": "4358",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Kratom"
  }
 ],
 "submissionDate": "2011-01-09T08:00:00.000Z"
}
