{
 "title": "All the Hangover without Any Buzz?",
 "author": "AuralChaos",
 "citation": " AuralChaos. \"All the Hangover without Any Buzz?: experience with Yohimbe, Kava, Ginkgo biloba, & Tobacco (ID 8037)\". Erowid.org. Apr 22, 2004. erowid.org/exp/8037",
 "substance": "Yohimbe, Kava, Ginkgo biloba, & Tobacco",
 "bodyweight": "115 lb",
 "report": "<p>So I had heard somewhere that yohimbe was a mild stimulant and it would make one feel kind of warm and fuzzy. I went down to the herb store and bought gingko biloba leaf, yohimbe bark, and kava kava root. I had had kava kava before and it always was a pleasent warm sedated feeling. So I put a half a cup of each herb (more like 2/3 cup of gingko) into my roommate's french press coffee maker. I poured in the boiling hot water, and stirred the mixture, and let it sit for about 2 hours......I was waiting for my roommate to come home.</p><p>At about 9:30pm tuesday night I decided with the sun going down I should have a glass of tea. The french press has about 4 glasses of tea in it. I take one with some sugar. I proceeded to drink this while playing my acoustic guitar and watching the sunset. The glass of tea gave me the chills then warm like a strong shot of bitter alcohol will do. I wasn't looking to get fucked up, I just wanted to get a little altered, take a walk down to the park and then come back home and maybe DJ some crazed mixes together. About 10:00pm I start feeling a little hazy and out of it yet able to think clearly. About 10:30 it got more intense. I had also heard that yohimbe is a mild halucinogenic, so I decide it's time to take my walk.</p><p>I headed for the park, and after about 5 blocks I started hiccupping. I couldn't stop hiccupping until I got to the park. By the time I got to the park my side hurt a lot (because of the hiccupping), and when I sat down everything went back to normal.</p><p>The 'high' if you would call it that had pretty much dissappeared, and the hiccupps had stopped. Glad to be rid of the hiccups I smoked a ciggarette and hung out by the river that went through the park. I seemed to be more aware of the body of water as a whole, like I could see all the ripples and movements of it all at once.</p><p>I then went and layed down on the dock. I sort of fell into a light dream state for 20 to 30 minutes but about the same as daydreaming or meditation. I decided to go back home and try out the creative aspect. I started to walk back and after about 5 blocks the hiccupps came back. Lame. So now I have to go through this again. I get back home and the hiccupps go away after I have a cup of hot cocoa and a ciggarette. I have a kind of headache starting and I feel slightly dazed but out of it enough to not want to do anything but read stuff off of the 'net.</p><p>My roommate comes home and she drinks a glass of the tea, and goes to do something in her room.   I rolled a joint from blended yohimbe bark and tobacco, and even though it was non filtered and crappy tobacco it went down smooth and felt good. I was now in a pretty normal state and it seemed that joint of yohimbe did nothing. So it's 2am and I decide to go to sleep.</p><p>Little did I know how hard that would be. 9:30am rolls around....... my eyes hurt because they are really dried out, and I feel like I have been awake forever. I had random erections that hurt, and my body seemed like it was going through some sort of withdrawls. Shortly after 9:30 I slept until 2pm both me and my roommate have SEVERE hangovers. I feel like I drank rocket fuel last night and did a whole bunch of speed. It is now 2am thursday morning I slept from 6:30pm wednesday to 1am thursday. I still have a massive headache. I have drank tomatoe juice and water like mad along with eating food and fruits in particular. I think I did way too much and the effects canceled out or the kava neutralized the yohimbe or something because I didn't seem to feel much that night, and even the gingko didn't seem to be working. I will try yohimbe at a lower dose and by itself to see what it does to me, and I'll write in the details soon.</p>",
 "year": "2001",
 "id": "8037",
 "gender": "Male",
 "timestamp": "2004-04-22T07:00:00.000Z",
 "views": "25745",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:00",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:00",
   "administration": "oral",
   "substance": "Ginkgo biloba",
   "form": "(tea)"
  },
  {
   "time": " T+ 1:10",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(leaves)"
  },
  {
   "time": " T+ 2:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(leaves)"
  },
  {
   "time": " T+ 4:00",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(leaves)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Yohimbe",
   "form": "(rootbark)"
  }
 ]
}
