{
 "title": "Low Dose Giving High Effect",
 "author": "Londoner",
 "citation": " Londoner. \"Low Dose Giving High Effect: experience with Iboga (ID 80372)\". Erowid.org. Aug 24, 2009. erowid.org/exp/80372",
 "substance": "Iboga",
 "bodyweight": "85 kg",
 "report": "<p>I recently purchased some Iboga root bark from Holland, with the intention of taking small amounts, as an antidote to OCD. I'd had some experience with mescaline, but had read that Iboga would be more effective for my purposes. I decided to take 2 grams at about midday, thinking this would be a good test dose that wouldn't interfere with my day to day activities. I was quite wrong.</p><p>Firstly, a note on its taste. It came ready ground so I mixed it with water and downed it. It is without doubt the foulest tasting thing I have ever known. Peruvian Torch tastes like Chocolate Haagen Daaz in comparison.</p><p>Within half an hour I begin to be much more aware of the sounds around me and from outside. However I was having trouble in distinguishing exactly where they were coming from. It seemed as though the volumes of the individual sounds were out of whack and what was far was near and vice versa.</p><p>I soon felt like lying down, and was glad I did because I began to experience nausea and loss of balance. If I sat up my head swam, and walking was difficult. I lost my appetite, and my ability to speak became weakened to a croak. This was a little difficult as I was at my parents' house and so had to maintain a semblance of normality. I hadn't expected the impact to be this strong.</p><p>I was content to lie there, but had moments of panic, fearing I would 'trip out' and end up in hospital, bringing aggravation all round. I guess this emphasizes the usefulness of being in a completely safe setting. I began to feel like I'd made a terrible mistake taking this drug, and would soon be paying a terrible price for it. I was also having quite strong trails around movement and flashes of light in my peripheral vision. My heart rate at times raised up to about 120.</p><p>However I also began to have moments of clarity that I haven't had in a long time. I became introspective and more self-aware. I became clearer about things that had been troubling me, including a serious relationship split. I began to see that much of what had occurred to me had actually been caused by me, and my own foolishness. This was painful but also relieving, as I was coming to terms with the truth of matters, and so seeing the solution to behaviours that had brought me despair.</p><p>I felt the iboga was pulling me towards some sort of precipice, which I had to cross, some truth to face. I presume it was the truth of my own self, but the dose wasn't strong enough to take me in that direction and I was resistant to it.</p><p>Iboga is a very long experience. Late at night I was still buzzing (not tripping, it was too small a dose). The tracers and flashes were still there as well as the ataxia. I was able to get to sleep, but on waking the next day the iboga was still in effect, replete with the traces and flashing. I began to worry it was permanent, and called in sick to work.</p><p>For the next two days I felt pretty ill, and didn't get out of bed, slowly recovering my appetite. I also experienced constipation, which may be consistent with iboga working on opioid receptors in the brain, as heroin addicts also experience this same problem. I did however feel more centered, and more at peace. I'd gained a lot from the insight this small amount had given me.</p><p>I'd also found my OCD had decreased, I was less neurotic, less irrationally worried. This effect has continued, and in a small way I feel changed, altered, and in a good way. Iboga is used as an anti-addiction treatment and I certainly felt less compulsive in the days after use. I also could sleep more easily, felt less physically active, sweated more, and felt colder at night. This drug really affected homeostasis.</p><p>This wasn't a pleasant experience. To quote Shulgin, 'There is no question but that ibogaine is a rough trip, physically as well as mentally'. But I feel like the benefits are very worthwhile.  I would do it again, but only as a form of medicine. If there was an easier way to attain these affects I would take it. I would never consider this to be a recreational experience, and its use should be very carefully considered.</p>",
 "year": "2009",
 "id": "80372",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2009-08-24T07:00:00.000Z",
 "views": "21465",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Tabernanthe iboga",
   "form": "(roots)"
  }
 }
}
