{
 "title": "Smoked Shrooms",
 "author": "fiend",
 "citation": " fiend. \"Smoked Shrooms: experience with Mushrooms (smoked), Marijuana (ID 8039)\". Erowid.org. Apr 29, 2004. erowid.org/exp/8039",
 "substance": "Mushrooms (smoked), Marijuana",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "0.75 g",
   "smoked",
   "Cannabis",
   "",
   "1.0 g",
   "smoked",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2001",
   "8039",
   "Male",
   "",
   "Not Given",
   "Apr 29, 2004",
   "12248",
   " "
  ]
 ],
 "report": "<p>One night a friend of mine and I had nothing to do, we were just sitting around smoking a j when we had the idea to try smoking mushrooms.</p><p>I had a few grams that i had picked up ealier and decided to throw a G in for an experiment. Either of us have tried smoking mushrooms so we weren't all that sure what to expect. We broke up about a gram of mushrooms with about 3/4 of a gram of weed and rolled two nice fattys. I have done mushrooms before and felt all the normal effect of eating shrooms but never smoking. </p><p>We lit up the first reefer and started puffing on it. not a bad taste, not nearly as bad as eating them. I didn't think that much would happen so i would be satisfied with pretty much anything. </p><p>I was already pretty stoned, but about half way through the first joint, i looked down at the floor just to see an ant run in front of me. i thought it was real so i brushed it with my hand to get it out of the way but vanished when i did so. I also saw the regular visuals of a light shroom buzz, moving color patters, objects breathing etc etc. One other thing that was interesting was that when i went home, in my bed i was hearing punk music that was playing quite loud, i worried that it would wake up the rest of my family so i got up to turn it off, when i did i realized that i didn't even but any music on and that it was crazy to think that there would be music playing full blast in the middle of the night. then it was gone. it was pretty cool. I also experienced closed eye visuals and got some quite cool thoughts about life and everything that you would usually ponder while on shrooms and to a lesser effect weed. </p><p>All in all it was a good experience, in short i would describe it as a very intense weed high. I would suggest trying it to people if you like trying new ways of trying things, but if you really like to get screwed on mushrooms, just go with the traditional method of scarfing them down.</p>"
}
