{
 "title": "What It Did For Me",
 "author": "BLUhorse",
 "citation": " BLUhorse. \"What It Did For Me: experience with DMAE (ID 80428)\". Erowid.org. Aug 23, 2009. erowid.org/exp/80428",
 "substance": "DMAE",
 "bodyweight": "150 lb",
 "report": "<p>This report is in three parts. </p><p>-History, which is about me, in case anyone wants to see if they relate. </p><p>-The abbreviated eight week report of my personal DMAE experience. </p><p>-Ending with conclusion and advice on the chemical.  Skip to this part if you just want to get the general idea.</p><p>HISTORY:</p><p>Id never been a great student, mostly just coasting along with average grades.  Ive always had problems concentrating during lectures and memorizing concepts.  Procrastination is my worst enemy.  I consider myself an extremely scatter-brained kind of guy, always making it hard to motivate myself to learn anything.  But the difference between me and one with ADD is that I can actually get the work done, get the information memorized, get the paper written, and solve the problems.  Its not as though I cant function, its just a little harder for me to find motivation and concentration.</p><p>I got through high school with a C average and went off to community college.  College became very difficult very quickly.  Because school was no longer the center of my life and the bulk of my day, it became harder to study and learn.  I only had class three days a week.  Id put off math, delay writing papers, and procrastinate reading.  Plus all the freedom allowed me to fall into terrible habits of self-indulgence, like drinking, tripping, and smoking.  This didnt help my mind or my grades, it only made me more lazy and slow.</p><p>For a short period of time I could get a hold of adderall.  It was basically my save the day button.  Id take it and get everything done quickly and efficiently.  It got to the point where I could not do work without it.  Sadly I lost the only connection I had, which just made school even harder.  So with the thought of my future in mind, I decided to find an alternative.  It didnt take long for me to stumble across DMAE.</p><p>I bought some from a local health food store, one-hundred 130mg capsules for $15(USD).  It was still summer break and I had no classes for two more weeks.  I decided that these two weeks would be the testing weeks, to find if it would work for me.  As recommended by a few sources, I kept a log detailing my personal reaction.</p><p>DAY 1:</p><p>Took one 130mg tablet in the morning.  Chased it down with some black tea to wake up.  Within an hour I felt a feeling comparable to an amphetamine buzz.  A slight and subtle off baseline feeling of stimulation.  My thoughts werent as scattered as they normally are, I could follow specific thoughts from point A to B to C and so on.  It was much easier to read my novel, I could sustain my attention for a bit longer than normal.  I felt no different otherwise.  Within about two and a half hours after the initial dose, the feeling faded.  I took one more in the afternoon and got the slight buzz for about another thirty minutes. </p><p>DAY 2:</p><p>Took two in the morning and went to work at the drug store.  The first hour of work was great, I felt a slight speedy euphoria.  Talking and listening to customers was a bit more enjoyable than normal, though it faded fast.  After that first hour I just got annoyed a lot easier, though I did notice mental clarity for the rest of the day.</p><p>DAY 3:</p><p>Id been trying to abstain from marijuana during the DMAE trials, but found it once again difficult to fight off the urge to toke up with a good friend of mine who just purchased an eighth of indoor heads.  I took two tablets in the morning and smoked an hour afterwards.  It was amazing, but not quite as amazing as weed and amphetamines.  Though it did give me that wonderful feeling of stoned with motivation and awareness, just not as euphoric.  I took two more around noon and found it much easier to recover from a morning of pot smoking.  I found it hard to sleep that night, which is odd for me.  I normally fall asleep fast and stay asleep for a decent amount of time.</p><p>DAY 4:</p><p>I woke feeling oddly refreshed, despite the loss of sleep.  Took three at once in the morning and went to work.  It was really nice. The effects of the DMAE didnt change quite that much, but I did notice a slight change in my personality.  I had a positive outlook that lasted all day, verbal fluidity, clear-headedness, and an increase in my attention span.  Id always been a relatively introverted person, but with the help of DMAE I felt a bit more confident in approaching strangers and striking up conversation.  The feeling of the drugs presence were still subtle at best.  Even after the hours of initial affect, I still felt pretty good.  I took two more around 5pm and found it a bit difficult to fall asleep again.  This was the first night I noticed very vivid and memorable dreams.  Nothing significant, but it still felt great to wake up in the morning and contemplate my dreams. </p><p>DAY 5:</p><p>I decide to limit myself with 2-3 in the morning and 1-2 in the afternoon from now on.  It proves to be effective for quite a while.  Today I notice my emotions are a little weird.  Id be in a perfectly content state of mind for the majority of the day, but I would sporadically get irritated and annoyed with external things.  People making careless mistakes, thoughtless remarks, random little everyday annoyances bothered me more than normal.  My mind felt slightly condescending towards others, which is quite unusual for me.</p><p>DAY 6:</p><p>I got drunk that night.  I always loved drinking on adderall, it allowed me to maintain a sense of soberness no matter how much I drank.  Its not this way with DMAE.  I felt the normal buzz creep up on me after two to three drinks.  I was on my fourth when I suddenly got really dizzy and nauseous.  I put down my drink and reclined, but the feeling would not subside.  I felt much more drunk than I should have from three and a half beers in an hour.  A friend offered me a bowl hit, which I gladly accepted.  The nausea was gone, but I still felt dizzy.  After eating two hotdogs I felt better, but still a little muddled. </p><p>DAY 7:</p><p>Went without it today.  I didnt want to build a huge tolerance before school, plus I was interested to see if there was any withdrawal.  Yes and no... I felt pretty good in the morning, all the usual effect of the week were still fresh within me.  Around 1pm I felt a bit down, not depressed.  My attention was a little more unfocused and thoughts were going back into their old sporadic habits.  By the end of the day I felt notably normal.</p><p>WEEK 2:</p><p>I went without it for a few more days, just to make sure I could.  I did, but I really would have liked to be on it.  Much like a mild marijuana withdrawal if anyone can relate. I want it, but dont necessarily need it. I got back on my typical dose two days before school started.  It was great to have the subtle feeling of empowerment back in my life. School went very well.  I could remain focused on the lecture, take down lots of notes, not get bored as easily, and I didnt once feel tired or unmotivated.  I even started conversations with a few random people.</p><p>WEEK 3:</p><p>School has never been better.  The work is getting done, the studying is getting completed, and everything in between is going well too.  I can now smoke marijuana every now and then and not have to worry about its mind-slowing side effects.  I havent tried drinking more than a couple beers though, the last experience left a bad taste in my mouth.  Towards the end of the week I start to increase my dose.</p><p>WEEK 4:</p><p>The word tolerance starts to bounce around in my mind as I find myself not even feeling the subtle effects anymore.  I begin to take more, a lot more.  Some days Id take a total of ten to twenty just to stay ahead.  I started getting headaches and muscle aches very frequently, which just lead to further irritability.  It was sometime this week that I completely stopped all together.  I found myself staring down the slippery slope of addiction once again.  I threw away the bottle, knowing it was probably for the best. </p><p>WEEK 5-8:</p><p>Withdrawal wasnt bad at all.  My emotional state went from frantically manic to slightly depressed to normal within a few days.  School still remained rather easy for me, mostly because DMAE taught me how to prioritize work and take notes efficiently.  Of course it was much harder to focus in its absence, I still managed to pass with very good grades, making this one of the most successful academic sessions of my life.</p><p>Conclusion:</p><p>I felt as though I was chasing a state of mind towards the end of my DMAE use.  This is probably because of my addictive personality.  Overall it helped me tremendously, and I do believe it can help others too.  I did take it a few more times towards the end of the semester to help with finals, my friend took it as well and let me have a few.  I didnt do too much for me then, but I hope it will in the future.  Ive learned not to abuse these kind of things.</p><p>My advice: </p><p>-Its impossible to fight tolerance, so DMAE should only be used for a little while at a time, only when necessary.  If you abuse it too much and too frequently it will quickly loose its magic.</p><p>-Its a powerful ally, but you must have patience.  Dont expect immediate results, wait a week or so and start your dose out low, gradually increasing over time.</p><p>-Dont expect a completely amphetamine-like high. DMAE is much more subtle, it will effect you in a different way.</p><p>-DMAE is not intense like other stimulants.  Its widely accepted, and I somewhat agree, that it will actually reduce anxiety and stress.</p><p>-There are no known adverse interactions with other drugs, but still BE CAREFUL.</p><p>-Its best to dose in the mornings and in the afternoon, no later than 5pm.</p><p>-It may just be me, but I recommend avoiding a lot of alcohol.</p><p>-If you do get headaches or muscle aches, lower the dose.</p><p>Good luck my friends,</p><p>-D</p>",
 "year": "2008",
 "id": "80428",
 "gender": "Male",
 "timestamp": "2009-08-23T07:00:00.000Z",
 "views": "20932",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "DMAE",
   "form": "(daily)"
  }
 }
}
