{
 "title": "Is It Real or Placebo?",
 "author": "TheJiltedFairy",
 "citation": " TheJiltedFairy. \"Is It Real or Placebo?: experience with Nymphaea nouchali var caerulea (Blue Lotus) (ID 80421)\". Erowid.org. Aug 24, 2011. erowid.org/exp/80421",
 "substance": "Nymphaea nouchali var caerulea (Blue Lotus)",
 "bodyweight": "190 lb",
 "report": "<p>The setting was at home in the living room on a mid July 2009 afternoon. Participants were myself and my wife. We were both feeling pretty good without any outside distractions so we ventured into trying some of the blue lotus I had been waiting for the last few weeks (imported). I had gotten a 1/2 ounce before but had not experienced any effect from it and was of the mind that it might be placebo instead of any real effect.</p><p>My wife had no bias, had not heard of it before, and held no preconceptions.</p><p>I place 8 drops of the Blue lotus absolute oil in wine (6 ounces) 30 minutes prior to taking a preparation of 80 grams soaked in 16 ounces of Zinfandel which had soaked about 6 hours, we split the portions in half and then drank. Next we smoked an ounce of the dried leaf in a hookah.</p><p>I started noticing a slight buzz that would never have happened from wine alone **ever**. I was definitely under the influence of something.</p><p>The effects from the wine were very subtle and vanished quickly. The smoke from the hookah was smooth and relaxing and gave a slight buzz if the frequency and depth of the draw was increased. I suspect that the 25x leaf would be much better for smoking.</p><p>My wife noticed 'patterns' in the smoke (fish, galaxies, etc) about 30 minutes into our smoking and saw a lot of beauty. She was relaxed and enamored with the patterns. I only felt relaxed and interested in watching the astonishment on her face. We talked and smoked more. She was relaxed and 'didn't give a f*ck about anything, everything [was] just fine' she seemed disconnected, slightly drunk (bimbo' ish), and happy. I started noticing a slight buzz that would never have happened from wine alone **ever**. I was definitely under the influence of something. I felt pleasant and relaxed but nothing strong.</p><p>We had plans for a comedy show this nite and 4 hours seemed to just slip by and now we had to head out. She didn't care about going or the fact we parted with tons of money for front row seats (she's usually extremely frugal and not wasteful). I didn't care either but I knew getting out into the fresh air would be beneficial and we were not 'stoned/drunk'. The comedy and food was great and the walk home was extremely pleasant and talkative.</p><p>After some nice cuddling she fell asleep soon after getting home. I on the other hand found myself popping in and out of lucidity while sleep. I was in a 'place' while sleep conscious that I was not familiar with but had a quality to it that I relate to meditation. My mind felt a little rushed along a hum. Like a very quiet bee in the head and I was like a seed. I didn't explore it more at the time and I intend to in the future but I could tell that that consciousness wasn't going to allow me to wake up refreshed. It was good but came at a time when I had to be up and out early. I intend to do it again soon where I have more time.</p><p>Prior to going to bed we got a call from my wife's mother who can always pull her heart strings with a guilt trip as easy as a spider spins a web. For the first time EVER, it didn't work. There was NOTHING that could be said to her to upset her or manipulate her in the least. I think it might be great as a anxiety reducer in some.</p><p>No hangover or ill effects were experienced. I would definitely use it on occasion probably in combination with Kanna, passionflower, etc.</p><p>Happy hunting</p>",
 "year": "2009",
 "id": "80421",
 "gender": "Male",
 "timestamp": "2011-08-24T07:00:00.000Z",
 "views": "15394",
 "dose": [
  {
   "time": "0",
   "amount": "4 drops",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(extract)"
  },
  {
   "time": " T+ 0:00",
   "amount": "3 oz",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  },
  {
   "time": " T+ 0:30",
   "amount": "40 g",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:30",
   "amount": "8 oz",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  },
  {
   "time": " T+ 0:30",
   "amount": "30 g",
   "administration": "smoked",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(dried)"
  }
 ]
}
