{
 "title": "Strange but Effective",
 "author": "Sinnlos",
 "citation": " Sinnlos. \"Strange but Effective: experience with Scopalamine (ID 80487)\". Erowid.org. Apr 6, 2013. erowid.org/exp/80487",
 "substance": "Scopalamine",
 "bodyweight": "155 lb",
 "report": "<p>My drug history covers most of the standard substances over the years. Cannabis, alcohol, benzos, LSD, dipenhydramine, meclizine, mushrooms, opiates and a few non productive experiments with salvia. My recreational use of drugs has dropped since the start of my 30's. This was not due to bad experiences or addictions, but more from and drugs being less fun as an adult. I outgrew them to a certain degree. Been there, done that.  But I feel it's relevant to this report so the reader understands that I am not new to being under the effects of various substances.</p><p>Last year I was promoted to a position in my company that required a ridiculous amount of travel. I fly across the country at least twice a week, and may indeed have more flight hours than some airline crews are picking up according to a flight attendant friend of mine.</p><p>I never had a problem with motion sickness until I took this job. I was car sick only once as a child, and as an adult have only gotten nauseated (but not vomited) while driving in mountainous terrain. But when I began this job I started to develop a problem. I had assumed I would get my 'air legs'..the more motion you expose yourself to, the more tolerant you are supposed to become. This is is why newbies in the Navy get violently ill the first day or so, and then never again. The brain adjusts.</p><p>Not in my case. The more I flew, the more airsick I suddenly got. This developed to the point where even a smooth flight would end up with me throwing up in the airport bathroom if I was lucky..or if I was unlucky, into a barf bag onboard an aircraft in front of a group of disgusted strangers. This then carried over into my regular life. I began getting sick in movies or while playing video games.</p><p>At first, I began taking OTC motion sickness meds. Dramamine. Dramamine comes in 2 forms: Dipenhydramine (or dimenhydrinate) or Meclizine. Both work in a similar fashion by dampening the information the brain gets from the inner ear. Dipenhydramine's most inconveinient side effect is drowsiness...not an effect you want after you get off a plane and need to drive a rental car around a strange city. Meclizine has less drowsiness but made me somewhat paranoid, and it didn't always work. I began taking large amounts of dipenhydramine and this did work to stop the airsickness, but in large doses it has psychoactive effects..basically, it trips you out. I didn't want to be tripping balls while travelling.</p><p>I finally went to the doctor and got some prescription grade Scopalomine in the form of a gel that gets rubbed on the wrists and is absorbed through the skin. Patches are available but they are tailored more to people on cruises and ships who need it for days at a time. The gel would only work for 12 hours and creates less withdrawal..going off Scopalomine suddenly creates a rebound effect that causes nausea and vomiting and everything else it is supposed to cure.</p><p>The scope worked. I didn't get sick..but it is a strange, strange drug. It is a belladonna alkaloid and has similar effects to Datura. The doses are extremely small..higher doses induce delirium and its not like any other drug where you remember you are on a drug. The hallucinations on belladonna alkaloids seem utterly and completely real. They cannot be separated from reality. The normal dose, 1 ml, causes a very strange high that is difficult to put my finger on..not like acid, not like a benzo, not like weed...perhaps the best way to describe it is a mild euphoria followed by the general feeling of 'weirdness' that you get when and acid trip begins to come on. It feels like a drop in pressure behind the eyeballs and things seems slightly 'off'..but you can still function normally. It's not pleasureable.</p><p>Part of my routine for flying involves checking out the turbulence and weather forecasts. On a flight to the midwest a few months ago I discovered that there was severe turbulence anticipated for the duration of the flight, so I took more than the recommended dose. I doubled it.</p><p>I thought I was functioning fine..but somehow I wandered through the wrong gate area of the airport and had to find my way back. I was floaty, speaking slowly and feeling quite dizzy as I wandered through the crowds at the airport. I kept hearing friends voices as if they were behind my when they were not..I was alone. I finally managed to get on my aircraft and all I remember was being in some kind of trance, thinking the most bizarre thoughts.  I was getting second looks from just about everyone, as it was clear I was not in my right mind.</p><p>I have since changed my meds and now take Lorazepam and a small dose of dramamine instead..I fall asleep and wake up at the destination, with no memory of the flight and don't feel sick at all, no matter how rough the flight.</p><p>It works for motion sickness, but the strange edge to it is not a pleasant buzz. This is not a recreational drug and most docs don't worry about it being abused because the high is not fun..it is more like a delirious fever than a euphporic buzz. It stops nausea, even from things like flu or surgery, but it messes with your ability to discern reality from imagination.</p>",
 "year": "2009",
 "id": "80487",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2013-04-06T07:00:00.000Z",
 "views": "4761",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "transdermal",
   "substance": "Scopolamine"
  }
 }
}
