{
 "title": "A Dull Experience",
 "author": "Potty",
 "citation": " Potty. \"A Dull Experience: experience with MDPV (ID 80490)\". Erowid.org. Jan 24, 2010. erowid.org/exp/80490",
 "substance": "MDPV",
 "bodyweight": "67 kg",
 "report": "<p>All dosages are approximates.</p><p>Previous drug experiences: Longterm cannabisuser, I Recently did three trials with M1 / B1 each, also similar short-term tests with Etaquanol and JWH073. Discovering the online RC market has been interesting, tho most of what I've tried have been rather dissapointing, only exception being M1 and to some extent JWH073. Years back, I did one-time trials with speed & LSD at separate occasions, and also slipped into a completely unintended week of morphine use.</p><p>---</p><p>The Event;</p><p>Having taken no drugs for a week or so, yesterday I tried some MDPV for the first time. Extensive reading about this compound in the days leading up to the event had left me with a very diverse array of opinions concerning it's effects, as well as more than one cautionary tale about it's addictive properties and possible neurotoxic effects. I was very decided not to go haywire on this.</p><p>After a light meal at lunch, I snorted about 10mg's worth, and proceeded to sit down to do some work. I hardly felt it hitting, but after 30 minutes noticed slight stimulation. It didn't feel very good though, and soon killed all my desire to work. Despite my pre-determination not to redose, at T+0030 I snort another 10mg, to see if this will add anything further to the compound. I promise myself not to redose anymore.</p><p>After this, I still hate my work, and all I want to do is to write argumentative texts about various topics, which is what I wind up doing. Following redose #1 it wasn't long before I became clearly stimulated. Now I could asses the effects more easily. Closest resemblance in my book would be amphetamine. Major differences between them thus far would be that bodily chills isn't present here, some similar though much less pleasurable feelings. Neither is there any sense of improved mood or euphoria. Less jitters. I find the experience less rewarding so far. </p><p>As for mental state, the best description would be a feeling of clarity and complete awakenness during the initial stage, (6-7 hours) other effects are diffuse at best. Upon introspection, I found myself unable to determine my mood. With slight pendular motions between happyness and sadness, my mood still felt very centered and annoyingly detached. This is not a useful mood for my purposes, and the effects of this compound isn't particularily accomodating to me or my preferences.</p><p>Physically, effects are few so far. killed apetite, slight rise in body temperature and perspiration but negligable compared to M1 or B1.</p><p>---</p><p>At T+0130 I snort another 10mg's in vain hopes of experiencing something worthwhile with this compound. I don't.</p><p>At T+0700 I try to brighten my mood and fend of thoughts of MDPV-redose by opening a 3.5% half litre beer. Over the next 2.5 hours, I slowly drink another two. I hardly notice any effects from the beer, except for some minor circulatory changes I commonly experience at the earliest stage of alcohol intoxication. Any mood enhancement is negligable, so is other common effects of alcohol. I drink without much enthusiasm.</p><p>Now lets switch perspectives...</p><p>I may enjoy my pseudo-conversations while writing, but ultimately and on second inspection I wind up trashing almost everything I write between +0130 and +0900.</p><p>The reasons are many and not very interesting. At +0900 I notice a developing headache. Around the same time, I become very hungry and eat a little. It takes a short time before I loose interest, and the last quarter of what was a small meal to start with has to be forced down. Shortly after, I want to drink a fizz w. vitamins & minerals and start to notice how weird I feel.</p><p>It takes me forever to find my vitamins. I ignore the only place I ever keep them. I forget that vitamins is what I'm looking for. When I don't know what I'm looking for, I just search at random in very stupid places, hoping that what I find will jog my memory. Cross reference nightmare. Finally I find the vitamins, and put one in a glass, first w/o water, but I catch on soon enough. Leave the kitchen and soon forget that I have a glass of vitamins ready to drink. Imagine my surprise upon entering the kitchen again a while later. I start noticing other signs of memory impairment.. .  </p><p>At this time, I assumed that my recent meal indicated I had come down almost entirely. However, 6 hours later (T+1500) I was still awake. During this interval, I watched movies without being able to follow the storyline, my mind constantly wandering.</p><p>Elevated blood pressure and pulse noted, slight pressure on the inside of my skull. Slightly anxious, but still in this centered, detached mood. Still wide awake. So far, it would have been impossible to sleep. Furthermore... Mild feelings of stiffness in the body. All in all, the comedown was perceived as very gentle despite the weird effects on my memory, which I really didn't care that much about.</p><p>Slow and gradual decline, all symptoms perceicved as mild. No problems remaining still like on some other stims. Rather, it had a couchlocking effect. In comparison with Amphetamine, this seems very mild indeed while experiencing the effects.. No depression since feelings are largely whiped out. Thus no bothers about memory defects either, which in retrospect seems pretty fucked up. It is around this time I decide that, because MDPV lacks recreational merit I won't be doing it anymore.</p><p>By now I'm hungry and eat again.. As before, I quickly loose interest. Watch a little more of my movie, but as before I have to rewind all the time. At T+1900 I drift off into some semi-wakefull sleep, and wake up again at T+2400.</p><p>Upon waking, I wait a long time before having breakfast. No bowel movements at all throughout the day, though I eat as normal. Continued feelings of elevated bloodpressure / rapid heartbeat / preassure on inside of skull. / Easy to get couchlock when inactive. Slight Stiffness in my body. I've thought about the drug often today, and has imagined it's smell several times. At those times, I've felt the urge to redose but did not act on it. I Blew my nose and found my snot was red. I lack the motivation to do anything actively. Still very hard to follow the plots in movies, still have to rewind a lot.</p><p>The positive thing about this drug is that it's comedown feels really gentle, also it seems to be a strong social lubricant. The negative thing is that it robs me of my soul and feels very addictive. When I crave a substance I didn't enjoy taking @ +36 hours, at least that's what I assume.  Mental & emotional issues remain. No bowl movement. I go to sleep around this time.</p><p>At T+4800 I wake up again. I feel better now, bowel movement restored, memory and emotions seems back to normal, although lingering aftereffects may be impossible to assess.</p><p>This drug was completely worthless to me, it had no recreational merits and felt mostly like one longlasting side effect.</p>",
 "year": "2009",
 "id": "80490",
 "gender": "Male",
 "timestamp": "2010-01-24T08:00:00.000Z",
 "views": "16969",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 1:30",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "(powder / crystals)"
  }
 }
}
