{
 "id": 8049,
 "title": "Lifetime Depression Breaks!",
 "date": {
  "submission": "2006-03-12T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Dirge",
  "gender": "Female",
  "weight": "108 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.0 mg",
   "administration": "oral",
   "substance": "Hydergine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1200 mg",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1050 mg",
   "administration": "oral",
   "substance": "Aniracetam",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>I took an overdose of hydergene accidentally. I had been taking about 3 mg a day and then took 13.5 mg in one day. I took:",
  "4.5 mg hydergine",
  "800 nootropil",
  "750 aniracetem",
  "2 shots of minirin",
  "3 times a day",
  "I felt sick, dizzyness, trouble breathing, stuffed up nose, exhaustaion, insomnia, and more. But! My depression broke for the first time I was thinking logically, and making good decisions. I had a food of memories, and felt optimistic for once. I cut back to:",
  "2.25mg hydergine",
  "400 nootropil",
  "and 350 aniracetem",
  "3 to 4 times a day",
  "I have finally cleaned myself up, took my first shower in two weeks, washed my clothes. The first week I was on it I went on threee dates prior to that I had been  moping about my ex for 5 months. I was planning on killing myself this summer. I even drank the champagne I had intended for my last toast.",
  "I love this cocktail of drugs. FOr the first time I feel like a complete person. I think it is mainly the hydergine that is working it is fat soluble if I don't take it with fats I get depressed again. My libido's up and my anhedonia is gone I want pleasure. Thank you Sandoz you saved my life.",
  "23 in FLorida</p>"
 ],
 "erowid": {
  "id": "48523",
  "citation": " Dirge. \"Lifetime Depression Breaks!: experience with Hydergine (ID 48523)\". Erowid.org. Mar 12, 2006. erowid.org/exp/48523",
  "substance": "Hydergine",
  "views": "50294"
 }
}
