{
 "title": "Mild But Peaceful",
 "author": "N/A",
 "citation": " N/A. \"Mild But Peaceful: experience with Kava Kava (ID 8052)\". Erowid.org. Feb 14, 2003. erowid.org/exp/8052",
 "substance": "Kava Kava",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1750 mg",
   "oral",
   "Kava",
   "(capsule)"
  ]
 ],
 "report": "<p>In the past 2 weeks I had decided to purchase a bottle of 72 150 mg Kava Kava (standardised potentcy 30%) from the drug store. My decision came after having waited many months for some time and source for marijuana or mushrooms. Unfortunately, an excellent oppurtunity had just gone by and I was having no luck on getting a hallucinogen of any sort!</p><p>It was time to try SOMETHING at least, so I decided on the stress releif claimed on the side of the Kava Kava bottle. That afternoon, I took the regular dose, 2 pills (100 mg calculating in the 30% Kavalactones).</p><p>I kept stepping up the dose until about 800 mg of Kavalactone, when after 10 minutes I felt like I was covered in a nice blanket, and most profound was the simplicity of the world and not worrying about a few annoying problems I've been haivng lately.</p><p>The next week I decided to take 750 mg(15 pills). I swallowed them and lay on the couch...I got to thinking and decided to finish off the bottle which brought me to 35 pills (1750 mg).</p><p>I layed down on the couch and the warm blanket feel came about. My mind was purged of any stressful or depressing thoughts as I was just very content.</p><p>30 minutes afetr ingestion I noticed the world started to spin, as if I had been spinning around in a circle for several minutes. It was very dizzy, and my balance was poor but I didn't feel at all sick. I was quite happy and walked around laughing as I sort of half fell while I walked.</p><p>I fell asleep on the couch 30 minutes later and woke up after about 2 hours. I got up and I was no longer very dizzy, but I was still quite happy about nothing.</p><p>Unfortunately, the toxicity of the dose was apparent as I became ill-feeling into the 3rd hour. I was driven home and fought to keep myself from vomiting on the car.  I walked up to the bathroom and held myself over the sink and vomited quite hard. With nothing in my stomach, it was worsened by the enormous pressure on my forehead.</p><p>Kava Kava pills taste bad and as far as I've seen in my experiences, I have to take about 700 mg to feel anything at all. The pharmaceutical companies also standardise the potentcy and most likely leave the herb hanging around a warehouse for long periods of time. I wouldn't bother with Kava again unless it was very fresh. The bottled pills don't really do what they claim unless I take a lot more than I'm supposed to.</p>",
 "year": "2001",
 "id": "8052",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-02-14T08:00:00.000Z",
 "views": "21541"
}
