{
 "id": 8052,
 "title": "Not Worth the Taste",
 "date": {
  "submission": "2007-06-13T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Stuart J",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "nuts"
   },
   "administration": "oral",
   "substance": "Betel Nut"
  }
 ],
 "report": [
  "I am currently in Taiwan visiting some friends and having a holiday.",
  "Something I have noticed a lot of in Taiwan is the Betel nut stands with the girls selling them.",
  "I am a person who will try most things at least once and I decided to give it a go.",
  "I purchased 2 bags of nuts which cost $100 NT. I went back to my friends apartment and got ready. To begin with I decided to try one nut to make sure I had no bad reaction.",
  "I made sure I had a cup ready to spit into as I was told not to drink the juice straight up as it is 2 strong. I started to chew the nut and the taste was not so good. It was like kind of chewing a bunch of leaves this the only way I can describe it.",
  "After a few seconds I could feel my mouth filling with the juice/excess saliva. I chewed for another 30 seconds before I decided it was time to spit into the cup. The liquid that came out was a deep orange/red. I began to chew gain and went for another 30 seconds before spitting again",
  "Now that Id spat a couple times I decided Id swallow the juice and I began to chew the nut again and continued to do so for about 4 minutes.",
  "I started to feel some effects about 1 minuet after I spat for the 2nd time. My face began to feel very hot which was strange as the temp in Taiwan at the time I was chewing was 16 degrees. I began to feel a little happy and kind of punch drunk a minute after the warming had begun. These sensations continued for the next 3 or so minutes before I decided to spit the nut out.",
  "One of my friends suggested I try 2 nuts at once so I did. The reaction was much the same as it was with one nut and I did exactly the same as I did with one nut. After I had finished with the two nuts I decided to give it a break as my throat/chest was feeling a bit clogged from the juice. The effects wore of about 1 minute after I had finished with the nuts.",
  "Over all I'm glad to have tried it but the effects were too short and the taste was to bad to make we want to do it again as well as the orange mouth that I got."
 ],
 "erowid": {
  "id": "48534",
  "citation": " Stuart J. \"Not Worth the Taste: experience with Betel Nut  (ID 48534)\". Erowid.org. Jun 13, 2007. erowid.org/exp/48534",
  "substance": "Betel Nut ",
  "views": "8694"
 }
}
