{
 "title": "Research Chemical Poster Child",
 "author": "stake",
 "citation": " stake. \"Research Chemical Poster Child: experience with 2C-I, 2C-E, 2C-T-2 & 2C-T-7 (ID 80561)\". Erowid.org. Feb 22, 2010. erowid.org/exp/80561",
 "substance": "2C-I, 2C-E, 2C-T-2 & 2C-T-7",
 "bodyweight": "160 lb",
 "report": "<p>I am a 20 year old male who has taken more than my fare share of psychoactives, more so psychedelics than anything else. I am in good mental health, aside from the fact I have a fairly addictive personality. I started tripping when I was 16 years old and have been literally obsessed with every aspect of it since then. The first hallucinogen I ever experimented with was 5-MeO-DMT. I would binge on it, smoking quantities well above 35mg repeatedly for hours. Taking that into consideration, its safe to say that my brain can handle psychedelics fairly well.</p><p>I am writing this to warn people of the consequences of taking high doses of various phenethylamine research chemicals for extended periods of time and the effects they have had on my brain. Within an 6 month time span I personally consumed a combined total of well over 5g of 2c-e, 2c-i, 2c-t-2 and 2c-t-7. At least 80% of that 5g I ingested was 2c-e and 2c-i. About half of that amount was insufflated.  If you do the math that's ~27mg a day if I was tripping every day, which I wasn't. I would go on binges for few days and then quit for about a week so my mind could recover and then start tripping again. The most I consumed in a week was well over a gram. The longest binge was 6 full days of non-stop tripping on 2c-e and 2c-i. After the second or third day my body finally learned to fall asleep while I was still tripping so I was able to get some rest. On the sixth day I consumed anywhere between 300mg-400mg by the end of the night and my appearance was that of a methamphetamine addict (terrible acne/sores on face) and I looked as if I was dying. It took several days for my brain to even remotely recover.\r[Erowid Note: 300-400 mgs of Phenethylamines is considered an extremely high dose, see 2C-E, 2C-E, 2C-T-2 & 2C-T-7 Dose Charts]</p><p>I now have an unusual tolerance to phenethylamine chemicals and developed a mild tolerance to ecstasy before I even got the chance to try it. There have been multiple occasions, since I quit binging, where I would insufflate more than 30mg of a 2c-x chemical and would get absolutely no visuals.</p><p>I now suffer from mild HPPD. There have been two instances very recently where I will have a flashback and get very intense open-eye visuals that are extremely similar to those on 2c-i and 2c-e. I was completely sober at the time and I haven't done any 2c-x chemicals within the last 5 months, so this was kind of alarming to me, especially since I rarely get OEV anymore from tripping, let alone those chemicals. Also, I had extremely bad attention-deficit disorder as a child and it has gotten significantly worse. I am not nearly as intelligent as I use to be; I obviously have suffered irreversible damage done to my brain and my family and friends have noticed. I have a terrible memory now and have a hard time remembering what happened the day before. I also now black out from drinking alcohol much easier than I use to; a lot of the time it happens before I'm even drunk. Also my left nostril, the one I primarily used for insufflating research chemicals and nothing else, is torn up inside.</p><p>It now has been 5 months since I've done any of those chemicals and I can honestly say that the consequences are going to be life-long. I am never going to ingest any phenethylamine research chemical ever again because of what they have done to me. Please heed my warning and be careful.</p>",
 "year": "2008",
 "id": "80561",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-02-22T08:00:00.000Z",
 "views": "11185",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "27mg repeated",
   "administration": "insufflated",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "27mg repeated",
   "administration": "insufflated",
   "substance": "2C-T-7",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": "",
   "amount": "27mg repeated",
   "administration": "insufflated",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": "",
   "amount": "27mg repeated",
   "administration": "insufflated",
   "substance": "2C-T-2",
   "form": "(powder / crystals)"
  }
 }
}
