{
 "title": "Oblivion in the Worst Possible Sense",
 "author": "PluPlu",
 "citation": " PluPlu. \"Oblivion in the Worst Possible Sense: experience with Datura (ID 807)\". Erowid.org. Aug 4, 2000. erowid.org/exp/807",
 "substance": "Datura",
 "bodyweight": "",
 "report": "<p>I was with my boyfriend and two of his semi-outlaw friends in a motel room when I was told we were going to try jimsonweed.  I had absolutely no idea what to expect, but anticipated we might get a mild buzz from it.</p><p>One of the friends prepared a tea, using hot tap water and chopped-up stems of the plant, heavily laced with sugar to cut down on the bitterness.  He poured us each a glass, and told us to drink it as fast as possible.  I understood what he was talking about, because after I drank the first swallow, it felt like my throat was clamping shut and didn't  want to let me drink.  I managed to drink about 8 oz. of the tea.</p><p>The effects came on quick--10 minutes or less.  My memories of what happened are spotty.  The first thing I remember was standing up to make a trip to the bathroom, and finding that my legs seemed rooted to the ground, feet heavy as lead.  I don't know if I was eventually able to walk, or whether I gave up and sat back down. </p><p>As another person has reported here, datura is a delusional drug rather than a hallucinatory one.  You don't see patterns, trails, or any cool visual effects; you just actually believe in things that aren't there.  I remember sitting on the bed, playing with a pearl necklace, then suddenly realizing there was no necklace there.  I remember holding a glass for a while--but when I raised it to my mouth to take a drink, my fingers closed around nothingness because there was no glass there.</p><p>Apparently, eventually my boyfriend and I left the motel, drove to a fast food place to get a snack, then he took me home.  I remember none of that.  My boyfriend said that when he asked me what drink I wanted at the burger place, I argued with him insensibly about it. </p><p>I do remember coming home, making it to the living room, then managing to get to the couch to lie down.  My mother was there and apparently I said something incomprehensible to her before I crashed. It's the only time I can remember in my drug-taking career when I wasn't able to fake being straight.  Several hours later I was able to function somewhat normally, at least until bedtime when I could sleep off the rest of the drug.</p><p>Using datura is the closest I've ever come to death.  I believe it was trying to shut down my nervous system.  Although I was walking around, my mind was unconscious.  There was nothing fun about it--no euphoria, no beauty, no cool rushes, no socializing.  Just leadenness and isolation and unconsciousness.  Of all the drugs I've taken, this is the one that I'd be too scared to ever take again.</p>",
 "year": "2000",
 "id": "807",
 "gender": "Female",
 "timestamp": "2000-08-04T07:00:00.000Z",
 "views": "17366",
 "dose": [
  {
   "time": "0",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 ]
}
