{
 "title": "Good Plant to Pray With...",
 "author": "Whitepath",
 "citation": " Whitepath. \"Good Plant to Pray With...: experience with Salvia divinorum (ID 8070)\". Erowid.org. Jul 13, 2001. erowid.org/exp/8070",
 "substance": "Salvia divinorum",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "report": "<p>\nI sporadically do Salvia...and have been doing so for about a year.  Prior to using, I tried to read as much as I could.</p><p>I'm native american, and consider S. to be a 'sacred herb' and treat her as such.  I only use in a ceremonial context...generally alone, though on occasion with others.  Usually, I smoke the leaf.  First, I do a prayer to the six directions and ask both for protection and instruction, while singing and playing a gourd rattle.  I also use a copal or other herbal smudge while praying the four winds, and while doing the plant.  I also offer tobacco to the S. leaves before smoking, and blow smoke on them. I use a candle while getting ready, but once I start to smoke, I blow the candle out...and generally I have my eyes closed while sitting on the ground or floor for the 'walk.'</p><p>While my experiences differ, there are generally some similarities.  I often experience a twisting feeling, and sometimes this is accompanied by feelings of transformation into a plant, or other object.  As for visuals, at the onset, I often get spirals...usually of a green variety with red highlights or interior designs.  What happens next is what varies.  Sometimes I see and meet different entities, and sometimes I experience myself as various things or entities.  Sometimes I have full on 'journies' in which I am in various different places and settings.  Sometimes I get the feeling that the universe as we generally know it is just an illusion and the end of this world is here...  Maybe you could call this feeling/perception kind of apocalyptic.  Sometimes I get very clear instructions about things...teachings.  Often I feel like I have been destined to get to know this plant...and that circumstances have brought me to her...  I not infrequently get visions of what I'd call 'other peoples lives'...</p><p>I have only walked with her at night and in the dark.  I notice that afterwards, usually my vision improves and stays quite sharp for a while longer than the primary effects last.  I usually smoke tobacco and pray when finished, and I find the tobacco grounds me pretty good and gives me time to think about some of the things I've seen/experienced.</p>",
 "year": "2001",
 "id": "8070",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-07-13T07:00:00.000Z",
 "views": "20463"
}
