{
 "id": 8071,
 "title": "The Frog At The End Of The Rainbow",
 "date": {
  "submission": "2001-01-28T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Acid Matrix",
  "gender": "Male",
  "weight": "360 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  },
  {
   "time": " T+ 1:30",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  },
  {
   "time": " T+ 2:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  }
 ],
 "report": [
  "I would like to begin the way I always begin, with a quote or two that applies to the situation, for this particular experience, I have selected two from my library of useless information and profound statements.",
  "'He who makes a beast of himself, gets rid of the pain of being a man'  -- Dr. Johnson",
  "'Any road followed precisely to it's end leads precisely nowhere, climb the mountain a bit to be sure that it is a mountain, from the summit, you cannot see the mountain.'  -- Frank Herbert 'Dune'",
  "This was my first experience with LSD.",
  "I have smoked Cannabis and did for about a year, but gave it up because it honestly is no fun, it is a waste of time and money... Who wants to pay 10 bucks a gram to feel stupid, eat junkfood, and fall asleep?  Anyway, I have done nitrous oxide on many occasions, I have done Ether on several occasions and I have used Dextromethorphan (DXM) at least 15 times.  I smoked Salvia Divinorum about 5 times before, and only had noticible effects once.",
  "I have spent the last 2 years doing extensive research of drugs, because I never like to just do something, I like to understand it and have an idea of what to expect.  I have hundreds of hours clocked in the research of drugs, and 150 hours of that time was solely dedicated to LSD.  My research consisted of Erowid's resources as well as other web sites, many books, countless trip-reports on both Erowid and the Lycaeum,  I have interviewed about 15 people that have done acid and gotten all pieces of the spectrum.  Such things as, 'The worst experience of my life' 'The most enlightening experience of my life' 'I laughed at the walls alot'  to what I feel is the most accurate description of the effects of LSD, I am a lucid dreamer, I dream very rarely but when I do the dreams are lucid, I know I am dreaming, and I can control my dreams. and this description was very intrigueing 'You're a lucid dreamer, well, I would say acid is like lucid living.'",
  "None of this, my research, my interviews, my trip report reading, prepared me for what happened a few weeks ago.",
  "After months of searching, and failed connections and deals falling through, I finally was able to aquire some LSD from a friend with connections in a larger city.  I bought 10 LSD Green Gel-Tabs and sold 4 to a friend, as he had been searching as well.",
  "My and my best friend decided to do it wed,  I barely slept that night anticipating and giddy from finally going through with this experience, I had a very positive outlook on things.",
  "Wed morning I woke up at 9 am, and I had a leisurely breakfast and some coffee, showered and dressed, and drove over to Dave's house. I arrived at Dave's house at about 9:45 and we unhooked his phone and locked his doors, so we would not be interrupted or bothered.",
  "We each took one gel-tab at exactly 10 am, and started watching Titan A.E. to kill time.  After about 45 minutes it started to hit dave, and he was engrossed in the movie. well, after one hour, it hadn't hit me,  Dave had swallowed his, and I had let mine dissolve on my tongue.  after 1 1/2 hours, I was having no effects, so I decided to take another gel-tab, complaining that maybe I needed more because I was so heavy.  Dave took another one as well, I swallowed this one this time, thinking maybe that was the problem.",
  "The movie finished, and we were watching TV, at the 2 hour mark I started complaining that 'maybe I'm just the only mother f*&^er on earth that this doesn't work on'  ( a complaint I remember making the first time I did DXM ) so I took one more tab, and dave took one more as well, the last of our LSD.  thats a total of 3 green gel-tabs a piece.  I was bored, and a cartoon came on featuring a puppy wearing boots, he was running and stomping in puddles and such in a rain storm, and then a rainbow appeared, and he went to look at this puddle that the rainbow ended at.  A small frog jumped out of the puddle and just looked at the puppy.  The puppy said 'You can't live in a puddle, it's not deep enough.'  And he reached to pick up the frog, and it dissapeared.  Suddenly it appeared on the puppy's head, and the puppy looked up, the frog said to the puppy, 'You'll never catch me, I'm the frog that lives in the puddle at the end of the rainbow.'  This was not funny, or amuzing, but at that very moment, I burst out in a fit of laughter the likes of which I have never known, and kept laughing like a fool for the next 5 minutes, and when I came down, I was definitely 'Tripping'",
  "Dave, Pleased that things had finally started to happen for me, turned off the TV, and we put in Mr. Bungle. if you have never heard Mr. Bungle, I highly recommend them. So we started exploring his house, dave decided it'd be fun to clean.  While he cleaned the kitchen floor, I watched the shadows from his table and chairs morph and shift into faces and words, words like, 'Chaos' 'Joy' 'Fear' 'Love'  and then into more faces.  and at the back of my mind I had a thought, probably produced from watching fear and loathing too many times.  'We were somewhere around Ogdensburg, on the canadian border, when the drugs began to take hold.'   ",
  "Let me just tell you that, dave's whole house is very 70's and retro, from the furniture to the wallpaper, his mother hasn't redecorated since dave was born....  The wallpapers were doing all sorts of fun stuff.  Flowing like water and rippling, and then the ever present breathing...  We went to his basement, which was even more 70's than the rest of the house, and just sat around touching everything and looking at everything, and I played with his synthesizer and was totally digging it.",
  "About that time, 3:30pm or so, Dave's mother came home from her job.  So dave and I made small talk with her and then left, we went to mcdonalds and got some food, cuz we were hella hungry,  The Hi-C orange drinks we got, exploded with flavor in our mouths, and the food was full of amazing texture as we ate.  We parked my van near some factories and watched smokestacks putting off smoke and the smoke danced in patterns and shapes and faces.  Again the smoke formed the words, 'Chaos, Fear, Love, And Joy'",
  "Overall, I would consider the experience very very positive, with the only downside to the whole thing is that when I came down, I had a headache for 7 hours till I finally fell asleep,  I slept till noon the next day, and then bout 20 more hours when I got home.  And two weeks later, I still have incredibly vivid dreams, even better than before. ",
  "Dream Well everyone. There is still alot of beauty in the world."
 ],
 "erowid": {
  "id": "4863",
  "citation": " Acid Matrix. \"The Frog At The End Of The Rainbow: experience with LSD (ID 4863)\". Erowid.org. Jan 28, 2001. erowid.org/exp/4863",
  "substance": "LSD",
  "views": "12381"
 }
}
