{
 "id": 8080,
 "title": "Staying in the Moment and Remembering",
 "date": {
  "submission": "2008-01-11T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "peas of mind",
  "gender": "Female",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "tea"
  }
 ],
 "report": [
  "September in boston many years ago, on the back porch of their apartment looking over an alley we ate dinner (they supplied the food) and finished the meal with a steaming mug of shroom tea for each (we supplied the mushrooms)",
  "We sat around and waited, chatting nervously",
  "We came up and i was unable to speak, unable to move, stuck in my chair, following the vision in my mind-",
  "A male voice was narrating these visuals of a life cycle, ending not in the grave, but out out out in space (there is more to life than just this one, he said) and i struggled to stay in the moment and remember (i must remind myself of this)",
  "I was released from my chair and we all talked and giggled and snuggled on the couch. I had never bonded so quickly or closely with another woman before because of our womanhood, our sisterhood. It was a privledge to do so, and i relish those moments",
  "We left the apartment hours later to go walk along the charles- fortunely we knew better than to go swimming in it (although the impulse arose.) ---- wanted to go off and make out, but being sexual in any way was the last thing i wanted",
  "Dawn rose upon our coming down",
  "And i look back and feel so lucky that my first time taking mushrooms was in such a caring, safe setting, and that we shared such a wonderful experience",
  "And yet i am now at the point where even looking at mushrooms make me nauseous- and i am reconnecting with mushrooms, reconnecting with the higher state they can access- but i cannot do so without looking at where i have come from and where i have been."
 ],
 "erowid": {
  "id": "48659",
  "citation": " peas of mind. \"Staying in the Moment and Remembering: experience with Mushrooms (ID 48659)\". Erowid.org. Jan 11, 2008. erowid.org/exp/48659",
  "substance": "Mushrooms",
  "views": "2581"
 }
}
