{
 "id": 8087,
 "title": "Cocktail",
 "date": {
  "submission": "2008-05-28T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Rincewind",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Amitriptyline",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "120",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Pseudoephedrine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "60",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "60",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Last night I raided my parents medicine cabinet. This was the first time I'd done it, as Id always felt that pills were kinda scary. But I was incredibly bored, and there was nothing to do.",
  "After the raid, I checked my stash. I had three different anti-hystamine/cough-and-cold medicines, and some Amitriptyline that was my moms way back in the day. I decided not to take the straight pseudoephedrine, and went for the one with asprin and DXM in it also. I took 4 pills of that, 2 of the generic benadryl, and 3 Amitriptyline.",
  "I took them just before 1 am, washing them all down in a big gulp with some apple cider. I went upstairs to watch TV and smoke some weed. After about an hour, I noticed a tingly sensation in my legs. They felt warm and wooly, and if I tried real hard not to move, I could make them disappear (I could still see them, just not feel them). I started getting drowsy, so after a while, I decided to go to bed.",
  "When I got into bed, I immediately felt restless and stiff. My lower legs felt like they were cramping and un-cramping about 10 times a second. I tossed and turned for a few hours. When I closed my eyes, the world would quickly resolve into something very similar to the real world, but a little different. It was like having extremely realistic dreams, except that I wasn't asleep.",
  "Eventually, I did drift off, and I woke up about 7 am. I felt really hyper and jittery, but i stayed in bed to try and get some more sleep. After a half-hour or so, I fell asleep again, and woke up at about 11 am. I still felt nervous and jittery, and walking was odd. A quick check in the bathroom mirror before my shower showed that my pupils were slightly dilated. I felt like that until I got a cup of coffee and a pinchy-bowl of weed in my system.",
  "Overall, I wouldn't do this particular combination again. I was hoping the pseudoephedrine would counteract the sleep inducing properties of the Amitriptyline, but all it really did was make it hard to lie still. Also, the DXM didn't color the experience as much as I thought it would."
 ],
 "erowid": {
  "id": "48685",
  "citation": " Rincewind. \"Cocktail: experience with Amitriptyline, Pseudoephedrine with DXM & Acetaminophen, & Diphenhydrinate (ID 48685)\". Erowid.org. May 28, 2008. erowid.org/exp/48685",
  "substance": "Amitriptyline, Pseudoephedrine with DXM & Acetaminophen, & Diphenhydrinate",
  "views": "13981"
 }
}
