{
 "id": 8090,
 "title": "Trip to Heaven and Hell",
 "date": {
  "submission": "2002-01-10T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Marcus",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Kava",
   "form": "capsule"
  }
 ],
 "report": [
  "Setting: I decided to do my experimenting without a sitter (not sure that was such a good idea) in my bedroom with lights out and no sounds and lying in bed. ",
  "My first experience with the herb was a some dried leaves which really didn't have much of an effect except a good buzz.  Seeing I was interested in a journey and not just a buzz I decided to find a more powerful extract or extraction method.",
  "Sage Goddess Extract:",
  "I bought this strange green liquid and was so excited when I received the package.  That night I took it home and read the entire pamphlet on the dosage, effects, etc.  I had three attempts with the extract over the next two nights.  Each time I put a quantity on my tongue (3 droppers, 4 droppers and then 6 droppers.)  I used water as per the instructions to dilute the mixture because it burned my tongue big time.  I held the liquid under my tongue for the required 15 minutes.  Then I swallowed the stuff. The first two experiences were just buzz fests.  I was glad I started out slow because I didn't want to find myself in a full blown Salvia Journey without a sitter.  The third attempt was quite strange but no breakthrough.  After about 10 minutes of sublingual absorption I forgot why I had this liquid in my mouth.  I forgot what Salvia was for and why I was taking it.  I still held it in my mouth for the last 5 minutes.  Something in my head was saying that I needed to keep this liquid in my mouth for the required time even though I didn't know why. I spit it into a glass afterwards and I freaked.  I couldn't remember what Salvia was so I got up, ran across the room to the lights and turned them on.  I ran back to my bed and got out the pamphlet to read about what this stuff was.  I was reading the words but nothing made sense.  After I finally remembered what Salvia was all about, it was too late.  A failed attempt!!  I decided that sublingual at this time was not going to work for me.  I have had a lot of experience with LSD, but this stuff was weird.",
  "5X extraction:",
  "I finally decided to make an extract.  I figured if I smoked it I would be in Salvia space before I had a chance to mess it up.  I took 30 leaves, crushed them and placed them in a jar.  I poured denatured alcohol over them until the liquid covered the leaves.  I then sealed the jar carefully to prevent any sudden and unneeded explosions.  I let the leaves steep for about 2-3 hours.  I poured the liquid into a pyrex dish.  I crushed 5 leaves and put them into the dish too. I put a fan on it and opened the windows to let the liquid evaporate.  I was left with some mushy (watery) leaves.  I placed the dish in an oven, preheated to 250 degrees and shut off, for about 15 minutes.  I then scraped the leaves out with a razor blade and placed them in a bag.",
  "Experiment:",
  "I used my water pipe and loaded a small portion into the bowl.  After preparing myself mentally (like I was preparing for a space flight) I proceeded to inhale it in one nice big hit.  I'm in buzzville, ready for hit number two.  After hit number two I placed the lighter carefully on the night stand leaned back closed my eyes and waited.  I sensed a feeling of being lifted out of bed and up into this giant plant machine.  Roots were moving through my body and I was being carried away.  I forgot about Salvia again but I decided to just let it go and ride!!  I was moving in directions and at angles I could never describe to someone in terms of 3-D space.  I felt that if I ever gazed upon someone with their eyes closed again I would never be sure if they were traveling on the same machine as I was.  Half machine/Half Plant.  Terror took over my head.  I thought that I didn't want to go and leave everyone behind.  I opened my eyes and ran out my bedroom door into the hallway.  I could see part of the machine apparatus in the corners of the room and in the hall.  I realized after entering the hall that I did want to go on this journey and I went back in the bedroom.  The effect was gone so I did two more hits as before.  I was in the machine again, though it was slightly different.  I saw myself in the machine with what looked millions of other people. (Matrix?)  I ended up in the hall the second time, really freaked.  I decided that I was not going to cut another Salvia trip short again.  I went back in bent on going. ",
  "The third time was nothing like the first two. I was ripped out of my body and flung into Salvia space.  There was no way out.  I knew that I could never describe to someone what I was feeling or where I was.  All I could do was repeat 'There are no words for this!' a million times.  I repeated the phrase to mark the time, not describe it.  I had this overwhelming terrifying feeling in my head.  I thought I was in hell and I kept repeating that I was in hell.  I felt like I was repeating the same phrase for an hour.  I finally remembered that Salvia was a teaching plant and I must be open to her teachings.  I thought about it and realized that I was feeling intense fear, more fear than I had ever felt before.  Then it came to me.  I was feeling all the fear I had ever felt in life all at once.  Fear of not asking a particular girl out, fear of giving a speech, walking down a dark alley alone.  I then decided that I would never let fear run my life ever again. ",
  "Then a new feeling come over me.  I felt like I had become crazy.  I had this overwhelming anxiety for the first time in my life.  I thought that Salvia had driven my brain into Psychosis and I was destined to stay there forever.  I finally understood how the criminally insane must feel.  How they feel inside. I got up off the bed and started walking around.  I walked through the house thinking that I had to live with this anxiety the rest of my life.  I thought that I could deal with the anxiety and still get through life, but that I always will have this feeling.  I went back to bed and had this feeling for about 4 hours.  It finally went away and I went to sleep.",
  "5X and Kava Kava:",
  "The next day I was perfectly fine, but profoundly changed.  I looked at everything differently.  I thought about the last night and realized that I was a little stressed out from work before I went on the journey and maybe this had an affect on the experience.  Maybe Salvia magnified my feelings from the day before.  I decided to take some Kava Kava first in order to relax before using Salvia. I took a few Kava Kava caplets 30 minutes before departure.  After my two hits (out of a pipe this time) I was back in Salvia space.  The difference this time was I felt totally joyous.  I felt more joy then at any other time in my life.  I started to laugh when I was thinking to myself how I would explain this feeling to my friends and how my language would break down and the puzzlement that would be on their face trying to figure out what I was talking about.  I thought again that there are no words to describe where I was.  I had the impression that other beings were with me and they were pleased to see me.  They welcomed me back to Salvia space.  Did I pass some test the first time?  I felt like I could die and be content because of the feelings of joy I had.  It was extremely intense.  I couldn't imagine anything happening in normal life that would give me this pure joy.  It was approaching a feeling of what heaven must be like.  It lasted for about 30 minutes, which felt like hours.  It was wonderful.  I went out for some food and came back and took another trip.  Went to the same place with the same feeling of joy.  Amazing!",
  "I'm going back soon.  I think I like the goddess very much."
 ],
 "erowid": {
  "id": "4870",
  "citation": " Marcus. \"Trip to Heaven and Hell: experience with Salvia Divinorum & Kava Kava (ID 4870)\". Erowid.org. Jan 10, 2002. erowid.org/exp/4870",
  "substance": "Salvia Divinorum & Kava Kava",
  "views": "26636"
 }
}
