{
 "title": "Dear J",
 "author": "CEO",
 "citation": " CEO. \"Dear J: experience with 4-AcO-DET (ID 80902)\". Erowid.org. Mar 14, 2010. erowid.org/exp/80902",
 "substance": "4-AcO-DET",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "1.5 mg",
  "oral",
  "2C-E",
  "(powder / crystals)",
  "",
  "1.5 mg",
  "oral",
  "2C-T-7",
  "(powder / crystals)",
  "",
  "17.5 mg",
  "oral",
  "4-Acetoxy-DET",
  "(powder / crystals)"
 ],
 "report": "<p>This was supposed to be a threashold dose of several drugs (1.5mg 2C-E, 2C-T-7 & 4-AcO-DET.)  Well I was taking some 4-AcO-DET dissolved in ethanol and a screwed the dosage, I meant to take a threshhold 5 mg, I must have taken 15-20mg in retrospect.  The following is an apology letter to my not tripping darling who wasn't expecting me to lose coherence with reality.</p><p>Dear J,</p><p>I am profoundly sorry for the unexpected experience I imparted upon you last night.  I took a much larger dose of that brown liquid than I thought.  It turns out my straw measuring method wasn't so scientific after all :(</p><p>I only meant to have my senses altered a touch, but instead I had one of the strongest trips I can remember.  This chem was 4-AcO-DET, very similar to psilocybin (think shrooms).  I was pretty sure the apocalypse had happened.  I had the most memorable trip I have ever experienced.  I'm still tripping a bit, but the peak experience was breathtaking.  I could feel (and see) the programming of the hive insects which we are.  You know the scene in the matrix where they're in the 'fields' where the millions of people are wired up...  Well I was seeing one of those, and around me was you and my family and everyone I know. There was this radiant light peeing down through the fields, like an examining light.  As the light became closer I could feel everything that I reality unravel for what it is, programming.. layers of ego and learned behaviors, and so much more.  As the light came closer I felt as though god himself had touched me. </p><p>Right then you asked me how do you feel.  I said 'half'  I meant have way between my life, for at that moment the light had beamed upon me.  I was overcome with this feeling that all my actions need to be what in the best interest of my people.  I was confounded by the power of the connectedness, and my responsibility to the hive.  As the light left, I felt as though I was now amongst the 'old'  like a barrier that had just separated childhood from baba-hood had swept across me.  I have never remembered a peak experience so vividly.  I series of experienced ensued, I was imaging all people as amphibians in an amorphous muck, well right then boog (my dog) let out a gron, she was a frog for sure. </p><p>This experience was remarkable, I have never had a trip experience like it.  I was 100% sure that this was happening to all of mankind and that we were all experiencing the light of creation sweep upon us, and impart us with connectedness, a feeling that we are fosters of of species destiny.  Acid would leave me muttering off about circles, with no real memories, except for smeary beautiful scenes.  This left me thinking about human behaviors as fractals of behavior.  Then I would imagine the behaviors as sputtering off into fractyls...  I am still very high at this point, and my hands now look like little hobbit hands....</p><p>You were wonderful and understanding.  I won't scare you like that again.</p>",
 "year": "2009",
 "id": "80902",
 "gender": "Male",
 "age": "24",
 "timestamp": "2010-03-14T08:00:00.000Z",
 "views": "4685",
 "dose": {}
}
