{
 "title": "Worrying Circulatory Effects",
 "author": "Yargr",
 "citation": " Yargr. \"Worrying Circulatory Effects: experience with Methylone (ID 80908)\". Erowid.org. Feb 18, 2010. erowid.org/exp/80908",
 "substance": "Methylone",
 "bodyweight": "150 lb",
 "report": "<p>I have used methylone on a number of occasions, from the same supplier, and generally found the experience to be pleasurable and worthwhile. However, on the latest occasion, following the intranasal ingestion of over a gram of methylone in a night (an excessive dose, and a stupid and irresponsible one given the dearth of knowledge about this substance), deeply worrying circulatory effects became apparent. The skin around my elbows and on the sides and back of my inner arms became blotchy, progressing to an alarming shade of purple, with pink blotches that were hot to the touch. This was accompanied by a sensation of tightness of the skin, a tingly, 'pins and needles' sort of sensation.</p><p>Needless to say, I was deeply concerned, and recognising the symptoms as being similar to those experienced around the knees by some users of 4-methylmethcathinone, I examined my own knees. There was some degree of purple blotching, but not to a comparable extent to that on my arms. This condition persisted for some time before gradually subsiding, but not before scaring the proverbial out of me. I have used this same material from the same supplier before, and (I am ashamed to say) at similar doses, without any adverse effects of this kind manifesting. There is the possibility   that this reaction was caused by interaction of the methylone with codeine, paracetamol (acetaminophen), or cetirizine, all of which had been consumed over the course of the evening; however, this is only speculation.</p>",
 "year": "2009",
 "id": "80908",
 "gender": "Male",
 "timestamp": "2010-02-18T08:00:00.000Z",
 "views": "12226",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 g",
   "administration": "insufflated",
   "substance": "Methylone",
   "form": "(powder / crystals)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "Codeine",
   "form": ""
  },
  {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "Acetaminophen",
   "form": ""
  }
 ]
}
