{
 "title": "Bring It On",
 "author": "Anony Mouse",
 "citation": " Anony Mouse. \"Bring It On: experience with Salvia (ID 8090)\". Erowid.org. Apr 30, 2004. erowid.org/exp/8090",
 "substance": "Salvia",
 "bodyweight": "150 lb",
 "report": "<p>First of all, let me get this out of the way and admit that I'd never done a hallucinogen before I did Salvia.  I do not reccomend this at all.  I've talked to a lot of people after the fact and those who have tried it all agree that Salvia was the most intense experience they've ever had, and believe me - some of these people are extremely hard core.</p><p>I knew that the Salvia high was a very short one, so I allocated about an hour in my day in which I was going to try it out.  A couple friends and I went over to one of our apartments and began preperations.  Within a couple minutes the 2 foot bong was cleaned, filled with fresh water and packed.  I took a couple deep cleansing breaths, cleared my mind, lit the bowl and toked.  My first hit was fairly large, I filled my lungs with a good ammount of smoke.  I remember breathing the hit out and watching the smoke travel out my nose and down towards the floor.  Just then I started to hear a strange repetitive sound and I could feel something tugging on my body.  I handed the bong off to one of my friends and after that point things became a blur.</p><p>My friends tell me that after about 20 seconds I did a second hit, not as large as the first.  I have no recollection of this event.  In my mind the sound and the tugging motion had transformed into me trying to escape from a never ending line of closing garage doors, all of which were closing on me.  I tried to get away from them but I couldn't move fast enough to keep ahead of them.  My friends are relativly experienced trippers, I think one of them suggested that whatever was happening I should just let it happen.</p><p>Taking that advice, I collapsed onto the couch and let the garage doors catch up with me.  Soon I had been crushed by them, but it was okay because I was just spit out the other side.  The garage doors morphed into a rotating sprocket which spun off into oblivion.</p><p>It was then that I noticed I was floating above a vast plane upon which there was an infinatly large branching tree structure.  If you can imagine what a family tree looks like, except take that to the largest extreme possible that is what I saw beneath me.</p><p>I became aware of voices above me and looked up.  Above me I could see the faces of people from my lives, friends, family, people I'd only seen once or twice before in my entire life.  I somehow knew that these people were not themselves, they were just representations of higher beings from another plane of existance.  They were using images from my own mind to communicate with me in hopes that I would be more comfortable with those images than I would be with their true forms.  They explained to me that the structure I saw beneath me was the fabric of Time, that each branch was an event that caused a split in the tree.</p><p>The concept behind this is fairly simple, imagine that for each decision you make, no matter how minute, you inadvertantly create a seperate timeline where you made that decision.  At the same time there are parallel timelines where you made some other decision.  The beings explained to me that I had become detached from the fabric of Time and that I needed to search through the timelines and collapse them all into my own personal timeline so I could return to my body.</p><p>To acomplish this task I transformed my perception into a large zipper, which I used to collapse the timelines into a single line which become my life.  At this point I remembered that I had consumed a drug, which was why I was experiencing such strange things.  Before this point I had completely forgotten that I'd done any drugs at all.</p><p>Once my timeline was collapsed I was able to regain some control over my body.  I discovered that I was on the couch, which seemed okay except that for some reason I wanted to be outside.  I got up and walked out the back door so I could sit on the weight bench that's on the back patio.</p><p>At first my friends were concerned, they said that I'd just been sitting there for about 10 minutes with a glazed look on my face and that I'd been twitching and occasionaly I'd jump up and look around for something only to sit back down again.  I tried to tell them that I was okay and I just needed a breath of fresh air, but it was another 5-10 minutes before I could really communicate with them.</p><p>My experience on Salvia was easily the most frightening thing I've ever done in my entire life.  During the course of my hallucination I was absolutly convinced that it was real, that I had to fight for my very existance.  Once I realised that I was on a drug it became an epic battle for me to expel it from my system, I didn't like it and I wanted it gone, NOW.  Having said that, I'll also say that my experience on Salvia was one of the most enlightening and self-affirming things I've ever done.  I'm fully confident that I can handle myself in any situation now.  After all, if I can reconstruct my own timeline and expel demons from my body, there really isn't anything LSD or shrooms can throw at me that I can't handle.</p><p>Bring it on, I can take it :)</p>",
 "year": "2001",
 "id": "8090",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-04-30T07:00:00.000Z",
 "views": "4093",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
