{
 "title": "So Strange, So Funny",
 "author": "Rass",
 "citation": " Rass. \"So Strange, So Funny: experience with Salvia divinorum (10x extract) (ID 8092)\". Erowid.org. Jul 21, 2001. erowid.org/exp/8092",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "150 lb",
 "report": "<p>First attempt:</p><p>I took three hits from a small glass bong with no water. Felt an immediate effect. Laid on my back in the dark room, experiencing a VERY strange and powerful kinetic feeling. This was not comparable to anything I have experienced before. It felt like I was split all the way up through my left leg to about the chest, and then duplicated outwards, forming a star-like shape with my upper body as the center. At the same time, I had a closed-eye vision of this shape. At the same time, I was laughing hysterically for most of the duration of the trip and also sweating profusely.</p><p>This is impossible to adequately describe in words, but this is definitely the wierdest shit I have ever tried. I totally lost track of earth-time, but at the same time maintained some kind of connection with the consensus reality. My guess is that the peak was about 5 minutes with a come-down period of 10 minutes.</p><p>Second attempt:</p><p>When I had returned to almost normal, I took another hit, felt the immediate effect, and with my eyes closed, I felt another strange sensation in my body: It felt like something with an unlimited gravitational pull had been put on my chest, thus falling through me and pulling me down through this hole in myself. The sensation of this was so real that I asked my sitters if they could see this happening. I had a closed-eye visual of the shape of this pull: If you take a soft piece of rubber and put a heavy object on it, you will get a cone-like curved shape. In this shape I saw some pulsating streams going downwards. Thus looking down into it, I saw a star-like form. I saw this form in a three-dimensional way floating in a dark space.</p><p>What's really interesting is that this time I felt the presense of an alien intelligence or consciousness. I tried to communicate with it in my thoughts, but I recieved no reply.</p><p>A few conclusive words:</p><p>I had two sitters present, and at a time they exchanged a few words and opened a door, much to my irritation. Those few noises were extremely annoying and distracting, so I recommend for any sitter to be totally quiet during the entire trip. I also recommend that you keep your eyes closed and the lights off. This model worked fine for me.</p><p>I definitely didn't find the trips and the kinetic sensations unpleasant, nor were they really nice; in a lack of better terms, I'll say it was wierd and interesting, and I'm sure I'll have another go at it. Next time I'll try chewing the fresh leaves instead. However, it didn't appeal to me in the same way as Psilocybin did. While the mushrooms were gentler and very revelatory and showed a lot of potential, I can't say I feel that there is a purpose to the Salvia experience in the same way. Maybe it's just a matter of getting to know it better.</p>",
 "year": "2001",
 "id": "8092",
 "gender": "Male",
 "timestamp": "2001-07-21T07:00:00.000Z",
 "views": "8578",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.2 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
