{
 "id": 8096,
 "title": "Fast Headache Relief",
 "date": {
  "submission": "2007-07-07T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jonas Omar",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Pharms - Ibuprofen",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "65 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Ginkgo biloba",
   "form": "(extract)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I don't have headaches often, however; tonight I did.  Given it was only a slight headache and not even worthy of any soothing relief, I took relatively strong doses of pain relievers.  I did not do this to really ease the pain, but rather to experience relatively strong doses of pain relievers.",
  "I took 5 Ibuprofen pills at 200mg a piece.  I took 2 Excedrin Migraine pills each containing 250mg Acetaminophen, 250mg Aspirin, and 65mg Caffeine, which is odd because headaches are an effect of caffeine. I know now that caffeine is also an aid for analgesics.  I took a stronger analgesic containing 500mg Acetaminophen and 25mg Pamabrom, which is just a diuretic, per pill.  I also took 2 memory and focus pills containing various vitamins and minerals including 100mg of Gingko Biloba 24% extract per pill.",
  "I have always been skeptical of the actual efficiency of an analgesic.  Because painkillers are so gradual and faint, I have never felt their effects take shape.  If nothing else, I can now say that I have felt the effects of analgesics.",
  "About 10 minutes after consumption I could feel a satisfying (not irritating at all) tingling sensation capping my head.  There was a tense tingling wrapping from temple to temple under the jaw line. This lasted only temporarily and then nothing. That alone rid of the trivial headache without a doubt, although; I do not recommend this recipe for any general pain relief for the simple fact that Acetaminophen causes liver damage at high doses.",
  "30 or so minutes after that, the pharmaceuticals returned in full effect.  I found my entire body relaxed.  It was not the oversensitive, overwhelming kind of relaxation that I find while high on any kind of psychoactive.  Instead, it was a realized relaxation.  It was as though my muscles loosened and relaxed (which they probably did) and I was just comfortable.  Eyes open or closed, rather sitting up or collapsed, I was comfortable.",
  "Needless to say, it was weak.  Maybe the doses where not as superfluous as I had originally thought.  Then again (as I had said before) Acetaminophen at high doses causes liver damage.  Honestly, it is not near strong enough of a drug to begin making any type of health compromise what so ever.  I exploited as a trial in analgesic intensity.  I would smoke a bowl any day (or every day for that matter) instead."
 ],
 "erowid": {
  "id": "48717",
  "citation": " Jonas Omar. \"Fast Headache Relief: experience with Analgesics & Supplements (ID 48717)\". Erowid.org. Jul 7, 2007. erowid.org/exp/48717",
  "substance": "Analgesics & Supplements",
  "views": "28463"
 }
}
