{
 "title": "Tranquilizer Tea",
 "author": "Secret Shaman",
 "citation": " Secret Shaman. \"Tranquilizer Tea: experience with Passion Flower (ID 8099)\". Erowid.org. Jul 14, 2001. erowid.org/exp/8099",
 "substance": "Passion Flower",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "5 leaves",
  "oral",
  "Passion Flower",
  "(tea)"
 ],
 "report": "<p>I had read about passionflower having some tranquilizing proporties in a 'legal High' book, which sparked my curiosity as to whether it was true.  The article said to obtain anywhere from 3-20 passionflower leaves and make tea with them.  So I looked up a nursery in the phonebook and gave them a call. I informed (told) them that I was a highschool student doing an experiments on different plants to determine which plants had a higher concentrations of chlorophyl. The store manager was more than happy to supply me with free passoinflower leaves.  I took them home and made a tea by placing 5 leaves in a small pot of boiling water.  I boiled them five minutes and then turned off the heat and let them steep for another 20. </p><p>After that I poured out the tea into a cup and drank it (on empty stomach).  It tasted suprisingly good, it had sort of a sweet fruity taste.  I sat around for about a half hour and then I began to feel sluggish and tired.  Well that eventually overpowered my will to stay up and feel like I had taken 50mg of vallium.  So I dozed off rather fast and easily into a state of vivid, lucid dreaming.  I was asleep for about 5 hours and woke up able to recall my dreams and quite refreshed.  I now use this plant if I want some fun dreams or If I need to get a good night rest.  But it doesn't have much use as a 'party' plant.</p>",
 "year": "2001",
 "id": "8099",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-07-14T07:00:00.000Z",
 "views": "40732",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "5 leaves",
   "administration": "oral",
   "substance": "Passion Flower",
   "form": "(tea)"
  }
 }
}
