{
 "id": 8099,
 "title": "Very Peculiar",
 "date": {
  "submission": "2006-03-24T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Simpzon",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "5.6",
    "grams": 0.0056
   },
   "administration": "oral",
   "substance": "2C-E",
   "form": "liquid"
  }
 ],
 "report": [
  "Setting: At home, in my bed, lights out.",
  "Set: Curious, just got this chemical the day before, have read up on it a few months before getting it.",
  "Dose: 5,6mg, Shulgin: +++",
  "My weight is 61 kg, and 1.83m. height.",
  "In about 10 minutes to midnight, I consume my liquid (4 ml, each containing 1.4mg 2c-e). It tastes not particularly bad, as one might expect. In around half an hour, I can feel the drug coming on; feels much like MDMA. Around 1 hour to 1,5, I start noticing visual changes, and the silhouettes of my floor-lamp become in a way unfamiliar, yet familiar. It was a very peculiar feeling, yet beautiful. I an hearing music with my headphones on, and the music seems to 'tell me things' - not in the normal kind of way, but very subtle, and I get the feeling that I 'understand' not the music; but what the artists meant me to know, by making it.",
  "At around 7 in the morning, I fall asleep, and am awake at 10 again, perfectly awoken and fresh. The colours were rapidly morphing throughout the trip - but in a very strange way. For example, very light green morphed to very light blue, and dark green morphed to dark grey. You get the picture.",
  "I sweat a bit, though not uncomfortable, it's worth mentioning. Heart rate normal throughout. Visuals is very mild, and happening gradually, though I can't disregard it.",
  "I am somewhat suprised that this rather small dose, was as active as it was. If there's one thing I've learned (not especially from this experience, but in general) it's to build up one's dose gradually; after all, I'd rather be dosing too little, and sober, than dosing too much, and dead."
 ],
 "erowid": {
  "id": "48731",
  "citation": " Simpzon. \"Very Peculiar: experience with 2C-E (ID 48731)\". Erowid.org. Mar 24, 2006. erowid.org/exp/48731",
  "substance": "2C-E",
  "views": "3998"
 }
}
