{
 "id": 8101,
 "title": "Unexplained Urges",
 "date": {
  "submission": "2006-08-22T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Vegan",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Some backgroud: I have been diagnosed with bipolar disorder, acute panic disorder, and doctors are still curious as to whether or not I have a form of epilepsy, as I have frequent seizure-like attacks. Usually in these I am in intense emotional pain, more than anything I experienced with depression, and I occasionally stop breathing, start smacking, and even less frequently I loose all feeling in my body, and occasionally black out. With all of this, I've been prescribed trileptal, an anti-psychotic, which I still take daily, and xanax for when I have panic attacks(for me, hyperventilating, loosing all feeling, and almost always stopping breathing, but with more racing thoughts and thought loops instead of emtional pain).",
  "Last night I saw a psychiatrist, and was prescribed lithium, which I took last night, klonopin for when the attacks come on (I've taken klonopin before both for sleep and recreationally), and ambien (zolpidem), for sleep, as I'm a fairly bad insomniac.",
  "I decided I wanted to try something higher than my dosage the first night that I took it, so I would be able to experience it stronger, before I grew any tolerance. My prescription is 5mg a night.",
  "T+0:00  I take 2 pills, 10mg, and wait for the effects to come on. A friend who has had much experience with Ambien told me to wait 15 minutes, and then I would 'see the angels'.",
  "T+0:15  Exactly when he said it would come on, it did. Subtly at first, and then stronger. He mentioned I would experience amnesia, so I told him everything that was going on so I wouldn't forget. There are still thing people tell me I said/did that I can't remember.",
  "T+0:20  I become frantically concerned with finding a dog, but I don't know what dog I'm talking about. I go online and ask everyone whose name I could find where the dog is, but, clearly, no one knows what I'm talking about. Everyone tells me I'm behaving strangely(I kept the logs of every conversation), but I'm only concerned with finding this dog.",
  "T+0:25  I've forgotten about the dog completely, and am walking around the room enjoying the feeling from the ambien. It feels very good, like I'm enveloped in a euphoric blanket. I see my coat on the ground, and immediately develop an extreme urge to search it. After looking through every pocket, I find a small shiny dog figurine I bought for my girlfriend a few days ago for Christmas, because she loves dogs and upon seeing it I knew I needed to buy it. I stared at the dog for awhile, and tried to eat it at one point. I marvel at the fact that my mind connected two separate urges without me knowing, and my typing worsens.",
  "T+0:35  I develop an intense urge to go upstairs, and since I found the last one pleasant. As I wrote to one friend 'if one brought me a beautiful dog, what next?'. I stand in the kitchen, and absentmindedly take another 5mg of Ambien. Forgetting why I'd come upstairs, I go back down and tell my friend what I'd done, and promptly forgot about it.",
  "T+0:45 My ambien experienced friend tells me he's going to bed, and this is where I'm not sure what's went on anymore. The last few things I said to him, apparently, were that I was seeing shifting light patterns, I put on some jazz and it enhanced the high, and the last thing I said to him was 'camera camera camera', but I checked my camera and no pictures had been taken(I wouldn't have had the motor skills to attach the lense and set up the tripod anyway). He tells me I was very interested in not forgetting what happened.",
  "T+1:00?? Some time around an hour later, from varying friends' memories, I logged off of the computer. I have no recollection of anything after this.",
  "T+4:47  I woke up at 3:47AM(For some reason I remember this time very clearly. I usually have an incredible memory, but I would have thought the amnesia would've taken this out. Also note I don't remember any part of this, just the time.), got out of the chair I had woken up in(I know it was a chair, but I don't know what chair), and moved to my bed, where I'm assuming I fell asleep immediately.",
  "T+7:00  The alarm goes off, and I have an exceptionally easy time waking up and getting out of bed. It usually takes me 15 minutes, but I was out of bed immediately with no residual drowsiness, and no memory of the previous night after taking the pills."
 ],
 "erowid": {
  "id": "48736",
  "citation": " Vegan. \"Unexplained Urges: experience with Zolpidem (Ambien) (ID 48736)\". Erowid.org. Aug 22, 2006. erowid.org/exp/48736",
  "substance": "Zolpidem (Ambien)",
  "views": "35478"
 }
}
