{
 "id": 8105,
 "title": "Fighting the Hooch",
 "date": {
  "submission": "2006-06-16T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Jib Jib",
  "gender": "Male",
  "weight": "270 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Chlordiazepoxide",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Let me start from the beginning. Warning this is going to be long...",
  "I've been a drug user for years, constantly teetering between depression and addiction. I've done everything, pot, ketamine, heroin, coke, absinthe, benzo, meth, amps, acid, 2c-b, ecstasy, ambien, lunesta, barbs you name it. I've even done rare happy potions like mescaline or talwin. I have not met a prescription I havent fucked harder then a 3 grand prostitute.",
  "I've been an alcoholic for the past two years, following a heavy heroin addiction. The months after my withdrawal from heroin saw me shooting cocaine, ketamine, popping handfuls of pills, supplementing with oxycontin, and generally doing anything and everything to stay high.",
  "I eventually ran out of money, and lost my drug contacts through either constant badgering or because they started to rip me off. I settled with alcohol as a legal and readily available choice for a high.",
  "I fell in love. Alcohol was legal, everyone did it, you could drink in public, you had no dealer, and a bottle of premium vodka is never over 35 bucks, that beats a daily coke/heroin habit by far.",
  "Fast forward 16 months. Other then the occasional blow and valium combo, or the occasional ecstasy tablet, I'd pretty much been drug free, just boozing my way to victory. Then, I broke my knee.",
  "Not just a break, I split it in half, tore a ligament, and to top it off, I was drunk when it happened. A normal person would have given up the hooch...",
  "I start binging on opiates and was up to a quart/750ml/fifth a day of hard liquor, 4-6 mg ov dilaudid iv'd, 10-50 mg of percocet orally and I was so fucked up I was little more then a pile of fat on an easy chair. The doc cut me off, and started to rely on just booze.",
  "After a few more months of daily drinking, I started to hallucinate if I didnt get my fix. I started to black out, go on rampages, destroying property, beating the shit out of anyone in my way, and acting like a complete moron. My nerves were shot, I could barely see, and my acid reflux was so bad when I smelled vodka my stomach erupted like napalm.",
  "All was hopeless. I was damned to a life of addiction, once more. The fun days were gone, the friends were gone, and I was alone, in complete addiction.",
  "I decided to quit, but since I was DANGEROUSLY dependant on alcohol, I had to find something to get off the hooch. My dream was and still is to enjoy drunken binges without the fucking side effects...",
  "I saw a doctor, and started a detox. I left my state of Georgia for new jersey to visit my girlfriend, and detoxed for 17 days. My symptoms were all gone, and my friend Librium was helping me out.  However, when I stopped the detox, and my Librium went out, panic attacks became almost daily. Oh, and insomnia.",
  "My doc refused me sleep meds or panic atacks meds for fear of addiction. He wanted me to try 'breathing'. Docters aren't stupid, they know that most mild to moderate pain, anxiety and sleeplessness can be cured with placebo or mind-over matter. Former Drug abusers/users refuse mind over matter, knowing full well there are meds for it, and know if they can get them, they'll suffer or retreat to other drugs until they get them.",
  "So, I wasted no time in slamming a bottle of grey goose quicker then you can say 'fuck the 30 bucks'. And, 4 months later was in just as deep as before the detox.",
  "I fired my doctor. I remembered valium and remembered xanax from my days as an aspiring gonzo, and knew that either could be used for insomnia, alcohol withdrawal and anxiety. I also knew that they could be found online, if you know where to look, and trust me, I did.",
  "I had to pick one or the other, and could find little comparison on the two online. I knew xanax was stronger, so just went for it and ordered 100 1 mg pills.",
  "It worked for a few days but had no euphoria, so often I'd drink instead. And whenever I tried to cop a decent buzz, I'd either black out or be to fucked up and confused. It killed my panic attacks, and a few with a martinis made ambien feel like aspirin.",
  "However, it didn't supplement my drinking because drinking was more pleasurable, despite it's downsides. After my supply ran out, I resumed drinking even more.",
  "A month later, I decided I had to take a break from the hooch, so I decided to try valium  this time, and finally, it worked.",
  "I popped 40 mg, and was in dream land. I was relaxed, buzzed and happy. I had no desire for drugs or alcohol, slept like a baby and was finally cured for the night. It is euphoric unlike xanax, and much smoother. Not as strong, but that's a GOOD thing.",
  "I'm enjoying a sober morning. I can see, my reflux is gone and I feel relaxed and not worried because I have mother's little helper with me."
 ],
 "erowid": {
  "id": "48759",
  "citation": " Jib Jib. \"Fighting the Hooch: experience with Alcohol, Alprazolam & Diazepam (ID 48759)\". Erowid.org. Jun 16, 2006. erowid.org/exp/48759",
  "substance": "Alcohol, Alprazolam & Diazepam",
  "views": "60793"
 }
}
