{
 "id": 8112,
 "title": "Triple Header",
 "date": {
  "submission": "2007-07-23T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "BlackPanther",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "IV",
   "substance": "Pharms - Midazolam",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "300 ug",
   "administration": "IV",
   "substance": "Pharms - Fentanyl",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "IV",
   "substance": "Pharms - Promethazine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "This endoscopy started out like the others I've been through in the past. I showed up at the hospital at 1:00pm and checked-in. I sat around the waiting room for forty-five minutes; I was lucky enough to have my wife and mom with me to keep me company. The nurse called my name and led me back to a changing room. I took off my shirt and put on one of those stupid looking little hospital gowns, while my 'guests' waited outside. We all went to my prep room and I laid down on the bed. I chatted with my wife and my Mom as the nurse took my vitals and put in my IV. My blood pressure and heart rate were both high... I was nervous. Even though I'd been through the procedure three times before, it still made me a tad uneasy. The nurse started a saline drip. It sure wasn't dripping as much as I thought it should. After thirty or so minutes of waiting, and babbling nervously, the doctor's assistant came in and wheeled me down the hall.",
  "Arriving in the procedure room, I chatted with the nurse while she hooked everything up to monitor my vitals. It didn't seem like she was too interested in talking, so I gave up and turned to looking around the room at the medical equipment. The nurse handed me a form to read and sign which explained all of the risks of the procedure I was about to go through. I read it while I waited. The doctor came in and introduced himself; we shook hands. He asked me if I had any questions about the procedure, to which I said no. I told him I was nervous. He asked me to sign the form. I signed it and handed it to his assistant. While the doctor prepared the equipment, the nurse asked me to roll over on my left side. Looking back at her over my right shoulder, after rolling over, I could see her preparing to give me the medication. I'd been through this before, and I knew what to expect. I was looking forward to it. After a few minutes of fiddling around she hooked a syringe to my IV and squeezed its contents into my arm. It burned a bit... must have been the Versed. The second syringe of fluid went in without pain... the Fentanyl.",
  "I laid there quietly, waiting for the medication to take effect. A twinge in my stomach. A warm rush came over my body. Suddenly nothing really mattered. Bliss. Pure, bliss. I stared at the far wall, waiting for the procedure to start, not the least bit nervous. I love the feeling of a strong benzo. I love the feeling of a stro...",
  "Light. Dark. Recovery Room. Light. Dark. 7-Up. It's time to get up. Clear the field! Oh, Battlefield 2. Video game. 7-Up. Light. Dark. We need to go. Six o'clock. My Dad's here. Hi Dad. My wife's voice. There you are! I'll get out of the car. I'm ok. My parents house?! Ah, my couch. My step-daughters embrace. No, I can't hear anything you're saying. My wife and step-daughter are eating dinner. Need to go to bed. It's nine-thirty. Bed? Hungry. Soup? White, buttery, soft rice. Soup? Ghost in the Shell. The Major. Can't hold my eyes open. My stomach is cramping. Need to go to the bathroom. Need to make it to the bathroom. Don't worry... you're not worrying. Dark.",
  "Shit, it's black outside. It's 1:30am. I'm never going to go back to sleep. Dark.",
  "It wasn't until the next day that I learned what transpired during this period of time. Apparently, I was a tad agitated that the doctor was trying to put a tube down my throat. I struggled against him and he was forced to deeply sedate me so he could continue the procedure. They ended up giving me 12mg of Versed (Midazolam), 300mcg of Fentanyl, and 25mg of Promethazine (Phenergan). I had never been given this high a dosage of any of these medications in the past; certainly not combined. For the few minutes that I got to enjoy before my memory went blank, it was a very pleasant experience. It was interesting being as gone as I was after the fact - I'm glad I had someone there to take care of me. I felt like complete hell the next day. I don't know if it was the medication or the lack of food and water, or both. Always an interesting experience, though I wouldn't do it for fun. There's better stuff out there for that."
 ],
 "erowid": {
  "id": "48778",
  "citation": " BlackPanther. \"Triple Header: experience with Midazolam, Fentanyl & Promethazine (ID 48778)\". Erowid.org. Jul 23, 2007. erowid.org/exp/48778",
  "substance": "Midazolam, Fentanyl & Promethazine",
  "views": "53451"
 }
}
