{
 "id": 812,
 "title": "Sound Became Form and Light Became Life",
 "date": {
  "submission": "2000-10-04T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "DJ SmokeScreen",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill / tablet"
  },
  {
   "time": "2:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "pill / tablet"
  },
  {
   "time": "11:00",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "About eight of my friends and I were preparing for a Rave with a little pre-party.  We did a few lines of CK's and just sat around socializing.  At 8PM about four of my friends dosed on 2C-T-7.  I was driving the two hours to the rave and decided not to dose (in hindsight it was the smart choice).  I pocketed one hit of Ecstasy and one of 2C-T-7, and I drove while my friends began to battle the funk of the 2C-T-7 transition.",
  "11PM  : Entered club. Dosed 1 pill of Ecstasy",
  "11.5PM - 1AM: contently euphoric I raved for a few hours. The music was great (of course) and the energy of the entire club began to rise as doses were taking effect and people began to roll.  By now my friends who have dosed on 30mg of 2CT7 are really rolling (actually two of my friends never got anything out of their dose).  Their demeanor is mixed with states of confusion, blank looks, and euphoric reaction to the music and lights of the rave.",
  "1AM : dosed 30mg of 2C-T-7, I continue to rave and navigate in and out the crowd.  I begin to sweat profusely - partly due to dancing non-stop for the last few hours and partly due to the Ecstasy detoxifying out of every pore on my body.",
  "2AM : Feeling dehydrated and faint, I get a bottle of water.  It seems to evaporate the minute it touches my tongue.  I decide to find my friends up on the balcony and sit down for awhile.  After navigating the stairs and avoiding clusters of confused, hyperventilating kids huddled together, I find my friends sitting down in some foldout chairs overlooking the dance floor.",
  "2.5AM : I begin battling the funk of the transition.  I'm gulping air and holding onto the arm rests of the chair.  I begin to really sweat and can't keep my head up.  As the lights of the dance floor race across the crowd, my vision becomes muddled, my stomach churns, and I consistently forget to breathe",
  "3AM : I no longer recognize myself or the people around me.  The music crafts incredibly complex geometric patterns into the air.  They seem to pulse with the tones of the music.  The dance floor becomes a writhing orgy of people, occasionally some people morph into hideous beasts dancing in a tribal fury. Interestingly, specific colors of the light show produce repeatable hallucinations.  The color blue would reveal everyone on the dance floor without clothes on.  The color yellow would horribly disfigure people, either removing or adding new appendages to their bodies.  The color green would completely bring back my consciousness to sobriety.  It was during these interludes, that I would remember my name, where I was, and that I was rolling, tripping, and freaking hard!  As the light show returned to more complex displays I would be drawn back into a trance and hallucinate until I would black out.",
  "3.5AM-7AM :  My hallucinations absorbed my entire scope of vision.  It took great concentration to focus on someone.  I've tripped on heavy doses of mushrooms before.  During those trips entire dreamscapes would develop and I would enter them as if in a dream.  Tripping on 2C-T-7 was similar, but the dreamscapes were in the context of the rave. The scene never changed but the people, their actions, and my reactions were all crafted inside my dreamscape.  I could not tell the difference between my thoughts and reality -they were one and the same.  I never got back to the dance floor the rest of the night.  At one point though I remember finding myself standing, staring into blank space in the middle of the dance floor.  I couldn't remember how I got there - so I quickly returned to the refuge of my chair on the balcony.  Every time I think I'm peaking, the trip just gets harder and harder.  I ride the trip like a person tied to the mast of a ship in a storm. It's very rocky, shocking, and exhilarating all at the same time.",
  "7AM : The lights came on and security began herding us out.  I'm still tripping at full strength when I step out onto the streets watching families in their church clothes walking down the street to Easter Mass.  I find my friends and we get into the car and drive back. I'm in the back seat relaxed, feeling like a child who's never seen the sky and mountains before.  I begin a dialog with about 4 different personalities within my head and we argue the spiritual aspects of 2C-T-7. With mushrooms I treat my trip as a spiritual journey, I review my own philosophy from a third person point of view.  On 2C-T-7 I decided my trip would be purely physical, my philosophy wasn't invited to this trip - so I subdue the voices and enjoy the ride back.",
  "9AM : We all return to my friend's house.  We sit around discussing our 2C-T-7 trips.  Because everyone dosed way earlier than I, I was more a spectator to the after-party.  Attempts to talk produced stumbling, stuttering sounds from my voice.",
  "10 AM : I can actually talk again, the trance music playing on the stereo relaxes me and  the carpet becomes very animated.  We all do a line of K and most everyone passes out.  I get rejuvenated and my trip comes back in full force.  Without the lights of the rave to confuse and muddle my perceptions, I enjoy the trip and dance in the living room to the music.  The music becomes a life force, every transition of the beat changes alters my euphoric state.  Every now and then a bad transition is mixed in the beat - it agitates me for a few seconds and then I readjust to the tempo.",
  "11.5AM - 3.5PM : I passed out.",
  "3.5PM - 10 PM : I return home with a mild trip and watched TV for the rest of the night.  A tranquilizer puts me to sleep until the next day.",
  "My trip on 2TC7 was the most intense hallucinogenic trip I ever had.  Although I had a strong mindfuck, it wasn't as bad as a one half oz of mushrooms.  I recommend taking it early (like 4 hours prior to attempting to exist), that'll give you time to be digested through the transition. After that, steady yourself for an incredible experience."
 ],
 "erowid": {
  "id": "1222",
  "citation": " DJ SmokeScreen. \"Sound Became Form and Light Became Life: experience with MDMA, 2C-T-7 & Ketamine (ID 1222)\". Erowid.org. Oct 4, 2000. erowid.org/exp/1222",
  "substance": "MDMA, 2C-T-7 & Ketamine",
  "views": "11287"
 }
}
