{
 "title": "Great Legal Buzz",
 "author": "Sam",
 "citation": " Sam. \"Great Legal Buzz: experience with 4-Methylmethcathinone (ID 81233)\". Erowid.org. Nov 21, 2009. erowid.org/exp/81233",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "70 kg",
 "report": "<p>I recently encountered mephedrone as a legal and cheap research chemical online. Recently, at a festival, I found that this compound and methylone are at least as commonly available as ecstasy pills or MDMA.</p><p>I really enjoy mephedrone. It is much cheaper, and purer than 'street stimulants' such as cocaine, ecstasy or amphetamine, and it arrives days within making an order online. With all this money being made and people enjoying it, it won't remain legal for long...so make hay while the sun shines as they say.</p><p>At the festival I went to recently, I got to try methylone. Cross resistance with other chemicals may have been featuring, but I was unimpressed by methylone. It seemed more of a stimulant, I was chatty and stimulated, but with with little of the warmth or euphoria of MDMA or mephedrone. It also gave my friends some nasty hangovers, so I won't be seeking this out again.</p><p>Mephedrone is very 'user friendly'. I feel energised, open, chatty and euphoric. I am more clear-headed than when on MDMA however. It has some properties of MDMA, but also with cocaine or amphetamines. It would be great I think to enjoy in a rave or festival environment, but is also well suited to more chilled out affairs, such as party's and gatherings. It is a great catalyst for deep conversation between friends.</p><p>One word of warning...it is quite moreish, like cocaine. Boosting later is also quite effective at extending the state, but one should be careful not to indulge with too much of this largely unknown and little researched chemical...I certainly wouldn't recommend ingesting more than a gram of it in a night, or even a weekend. Boosting is however effective at drawing out the state for the better part of an evening. I also find I like to drink on it. However. the 'dreaded underdose' can be frustrating in itself...too small a dab gives me a slight stimulant push without the other more special effects...so I would rather keep dosings well apart, but generous.</p><p>One should be aware of not drinking excessively on this...the stimulant effects block some of the alcohol's depressant effects, allowing me to drink large volumes quickly. This will result in a nasty, nauseating hangover that is best avoided. However, if I don't drink much with it, I don't tend to have any hangover at all, and feel fine the next day. Unlike other stimulants, I also find it quite easy to fall asleep on the tail end of a mephedrone experience, and often experience vivid dreams.</p>",
 "year": "2009",
 "id": "81233",
 "gender": "Male",
 "age": "24",
 "timestamp": "2009-11-21T08:00:00.000Z",
 "views": "7026",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "150 mg",
   "administration": "",
   "substance": "4-Methylmethcathinone"
  },
  "1": {
   "time": "",
   "amount": "150 mg",
   "administration": "",
   "substance": "4-Methylmethcathinone"
  }
 }
}
