{
 "title": "Throat Swelled Up",
 "author": "Blackaz",
 "citation": " Blackaz. \"Throat Swelled Up: experience with Mephdrone, Tea & Sleep Deprivation (ID 81291)\". Erowid.org. Sep 21, 2009. erowid.org/exp/81291",
 "substance": "Mephdrone, Tea & Sleep Deprivation",
 "bodyweight": "",
 "report": "<p>One night after the pub I didnt feel like being alone. I also had a large quantity of mephedrone. I invited as many of my friends as possible to my house. It was a large gathering and an appropriate setting to share out the mephedrone. We had a superb time and enjoyed the drug experience. We stayed up all day and into the following night.</p><p>Eventually everyone had shuffled and the last to say goodbye advised me to get some rest. I was coming down hard as I had taken a large dose by anyones standards over the time. I had a bad attitude and plenty of mephedrone left over. I was in high spirits and cared nothing for that fact that I was shaking uncontrollably. My lips were sore, dry and cracked but that meant nothing to me. My head felt light and fluffy like cotton wool as I had the opposite of a headache. Over the month I had been taking it at weekends I had developed a strong compulsion to take it. I have come to consider it as great value substitute for cocaine with some effects like ecstacy. In the time I had been taking it I felt no compulsion to use illegal drugs. As I had nowhere to be the following day I decided to stay up and snort more lines whilst playing the computer and fending off the cat.</p><p>It grew light outside and I still had not run out of the new drug mephedrone which I have found to be extremely addictive. On my face I noticed my skin was weeping on my nose giving an external marker of where the innsufflated drug sits as it is absorbed. I realised that my recent mephedrone habit had to stop as there was a real threat of becoming facially disfigured. I resolved never to buy anymore but still could not stop myself from trying to finish all the remaining mephedrone. I happily made some tea as the morning grew into day. I amused myself by weaving a friendship bracelet in my favourite colours. As the tea was kicking in I looked at the next line I had racked up and realised I had to put it back in the packet. I had 1.5g remaining. I had done roughly 4g to myself in two days although I cannot say for sure as the party had been very indulgent. In direct correlation to the onset of the caffeine my throat began to tighten. I was on msn and started chatting to a friend of mine who lives nearby. I didnt feel very well and decided to tell him because I was alone in the house and I needed some sympathy.</p><p>As I was braiding the bracelet and typing I became aware that my concentration was concealing an increasingly sinister pain in my throat and back. It got to the point that I imagined I was getting rigor mortis in my back. I reached around to try to rub the point of pain and my fingers met a strange waxy texture which felt wrong. I asked my friend to come quickly because I needed to talk to him in person. I was getting paranoid that when he arrived I would be unable to speak to him because I would be floating from the ceiling as a ghost. I wondered if my nerves were malfunctioning because I had felt such a strange texture and nearly deliriously feared that some important bodily secretion was leaking from my skin from a wound I could not see because it was behind me.</p><p>In the time it took for my friend to get to me I thought to look up mephedrone overdose experiences. The most prominent type of overdose experience that we could read about was of poor circulation making the skin appear purple or green like gangrene. My friend looked at my back when he arrived and saw that it was purple. In the flurry of panic that came over me then, my friend and I between us realised that it was simply my purple hair dye running from my recently dyed hair. The pain in my back subsided as the reactions hold on my throat continued to tighten. My friend reckoned that my glands had swollen to their full capacity. I could not even swallow water or drain my own saliva without experiencing an agony I likened to habanero sauce. I felt like I was being strangled. The skin on my tongue stretched as the base of my tongue became increasingly swollen to the point that there was no room for it to swell anymore. I feared that the skin would burst under the pressure and that blood would spout from my neck and out my mouth. The sides of my tongue felt like blisters and rubbed constantly against my teeth. I joked to my friend that there would be less surface area for pain if they amputated my tongue.</p><p>I contemplated rushing to hospital and begging for a morphine injection even though I have never tried it as I could not possibly swallow any painkillers. I cried as for half an hour it had not stopped getting worse but I was too afraid to go to hospital because I feared the effect the incident would have on the legality of mephedrone if I brought it negative attention. At one point a strange smell hit my nostrils and in my state of fear I imagined that it was the smell of some fluid bursting into my bloodstream out of a ruptured organ. I felt such fear but we realised it was the smell of a cigarette that my friend had put in a tea light that still had wax in it. The sudden unexpected scent took me by surprise. Scarily as we trawled the internet it became clear that my reaction was one of a kind. It was a debauched and w</p><p>reckless fall into great pain for the sake of one article in a vast database. Though I cannot say for sure I think my reaction was far worse than the standard cases of overdose. I might have preferred to be hit in the face by a shovel. My tattoo was nowhere near as painful.</p><p>For two hours the pain peaked at a level far beyond any that I had experienced before. It was all I could do to sit and cry while my friend assured me it was not as serious as it seemed. I had learnt in my youth that a cigarette can pacify tears so I smoked through the only space in my throat that evolution must have miraculously provided. The smoke seemed to open my airway and the occasional swallows I had to make stopped becoming more painful. I felt that if I yawned my throat would split. My friend theorised that my pain was made worse by a lack of endorphins, a symptom of a long intoxicated weekend. Eventually my tongue reduced in size but was still sore. We knew that I was getting better. My mum came round. She theorised that it might have been the milk in my tea causing an allergic reaction but I had been drinking milk out of the carton all night very happily. I am sure that it was the cup of tea that triggered my ordeal. It was the most painful thing that has ever happened to me.</p><p>Even now, 5 hours on, my throat feels torn and is still excruciatingly painful. I estimate that in 4 hours from now, which will be 10pm on Sunday night, I might be able to consume a yogurt. My friend kindly brought me some. I have not eaten for two days so there is a mini storm in my stomach but I feel mentally alert and rather creative. The experience was terrifying and I would never have gotten myself into that state if I had known it was possible. I will never touch mephedrone again as I am now aware that it has the power to be extremely toxic. I have noticed that it brings a strange smell to my urine which must be from the chemicals not normally present in the food chain. Those same chemicals must be responsible for the disgraceful mark on my nose that I need to heal as soon as possible. I am too frightened to take a painkiller now in case my immune system flares up again. I think that if I had had the cup of tea an hour later I would have been stoked enough on mephedrone for the reaction to have killed me.</p><p>This has been the worst day of my life. It was so irresponsible of me but everyone has been really nice about it. It was my fault and Im sorry for the worry that I have caused. I was at the mercy of the drugs power to make me crave it and it is a ruthless drug. I sense that I am going to be awake for many more hours and will attempt to write a cv for the job I so need despite my agony. If I have any more time awake before I go into the deep sleep that my body needs to recover I will use it to make bracelets to give away as gifts.</p>",
 "year": "2009",
 "id": "81291",
 "gender": "Female",
 "age": "21",
 "timestamp": "2009-09-21T07:00:00.000Z",
 "views": "15833",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "(powder / crystals)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Tea",
   "form": "(tea)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ]
}
