{
 "title": "Shrooms Warp You to Another World",
 "author": "Shrooms",
 "citation": " Shrooms. \"Shrooms Warp You to Another World: experience with Mushrooms (ID 8129)\". Erowid.org. Apr 30, 2004. erowid.org/exp/8129",
 "substance": "Mushrooms",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 g",
   "oral",
   "Mushrooms",
   " T+ 4:30",
   "1 cig.",
   "smoked",
   "Cannabis"
  ]
 ],
 "report": "<p>Well, this happened a few months back in February or March.  Me and three other friends (Baz, Chris and Derek) decided to do shrooms one weekend.  I had done them about 6/7 times before, and was pleased with the high, but nothing could prepareme for what was about to happen.</p><p>We ate three grams of shrooms in Chris' room.  His room is the perfect setting for a psychedelic trip.  He has a black fury carpet, but his ceiling isnt finished (his room is in the basement).  From his ceiling he has old CD's hanging from string and has black, red, and green lights throubnout his room.  On his walls he has miniature pepsi signs painted on and a Molson Canadian logo which covers the whoe wall.  He also has a beer can plane hanging from his ceiling.</p><p>After twenty minutes of eating the shrooms I felt a little dizzy, so I lay down on his bed, then in about 10 min it hit me.  We started up with the usual gitty behavoir that a pre-shroom high always consists of.  Then, Chris played the 18 minute version of Dazed and Confused by Led Zepplin.  During the song the shrooms kicked in full gear and we were off ona psychedelic trip, by the end of the song we were all fucked beyond belief.</p><p>The colours in his room were reflecting off the CD's and into my eyes.  None of us could talk to each other because wehen we tried it sounded like endless echo coming from our mouths.  I put my head inside chris drawer and I felt like I was attached to it somehow.  Then I fell on the floor and went on for almost and hour about how 'nothing is always and the present is tomorrow'...just mindless ramble.  My friends had three mouths it looked like, and Baz was playing his guitar (we had just begun to learn so he wasnt taht good) but it sounded reqally cool.</p><p>It's too bad I waited this long to post this, becuase some of the cool stuff that happened I can't recall at this moment.  We ate the shrooms at like 9:00 pm and were high till about 3:00am, but only because we smoked a joint at around 1:30.  The experience was cool as well because it knocks down any insecurity I have and it lets me be myself completely.  All that aside, this was my only true psychedelic high, and I loved it sooo much that I want to try LSD ASAP.  So anyone who is thinking of doing shrooms, hang in there and take them a few more times, it took me 7 or 8 tries before it got really good.</p>",
 "year": "2001",
 "id": "8129",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-04-30T07:00:00.000Z",
 "views": "5496",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": " T+ 4:30"
  }
 ]
}
