{
 "title": "Nirvana",
 "author": "Freud",
 "citation": " Freud. \"Nirvana: experience with 2C-I (ID 81338)\". Erowid.org. Jul 21, 2010. erowid.org/exp/81338",
 "substance": "2C-I",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Cannabis",
   "",
   "",
   "90 mg",
   "oral",
   "2C-I",
   "(capsule)"
  ]
 ],
 "report": "<p>[Erowid Note: 90 mgs of 2C-I is considered an extremely high dose, see 2C-I Dose Chart]</p><p>I had spent my whole day with a friend of mine. We decided to smoke marijuana for a few hours. After which my friend brought out a bag of two smallish clear capsules. They were 2c-I capsules. Pure 2c-I. What my friend did not tell me was that they were, 90 milligram doses. Niether he nor I realized that we were each about to experience.</p><p>We took the casules at about 11 pm, however we smoked about 7 bowls of a blueberry sativa strain of marijuana out of his bong. We waited about 30 minutes and them</p><p>things get fuzzy for about 3 hours. Next thing I remember I am sitting in my car alone an I am hallucinating ridiculously. Colors began to change everywhere, plants and trees began to breath, lights danced in trails shaped like infinity symols.</p><p>I had the sensation that I was rolling (the experience one gets from MDMA) incredibly intense through out my body and I could not feel any pain whatsoever. My body convulsed and shivered violently and I kept talking to myself aloud, moving back and forth and side to side. I did nothing but play with my cars buttons for so long. I remeber staring at the clock in my car turn from green to orange to red to yellow, and staying at 505 for what seemed like 3 hours.</p><p>Time moved by very very slowly. I started noticing everything was off. I turned on my wind shield wipers and on the way back down I vividly remember Sounds were in colors that fell into each other. I was in a cemetary near my friends house when I got out of the car I realized where I was, I them proceeded to walk into the cemetary, but fret not, this cemetary is used mainly as a park or nature reserve, so it's filled with people often and I'm quite used to being there.</p><p>I went to the spicket and drank some water rather deep inside the cemetary, Which Is wooded and covered in parts by plants and trees, also the floor is all dirt and mulch. I started getting the sensation of being watched and boom! Out if nowhere I feel intensely powerful and enlightened. I discover that existence itself is an entity, I call it God.  Then that entity channeled the energy of the entire universe through me.</p><p>I began walking around, I removed most of my clothes and began to embrace nature. I forgot who I was, what everything was, what anything meant, I merged with nature, and I proceeded to hallucinate heavily and roll intensly for several hours. After a point I put back on my clothes. At around sunrise I, after several failed ;attempts, I reached my other friend whom I call in emergencies, I called him  because I was in absolutly no condition to drive. I then had him take care of me for another 16 hours while I continued hallucinating and rolling. My experience lasted for a full 24 hours.</p><p>I still hallucinate a bit, I can feel plants breath, and I feel much more at peace with my life. I have done LSD, exstacy, psilopsybin mushrooms, marijuana. Believe me, I had a religious expeience. I met and became god. I am permanently altered because of it. I did not eat anything, and I was a bit physically ill at the time, also, I slept only 6 hours the previous evening. I think I should have died, but I somehow lived.</p><p>My friend had told me the following week my friend told me when he found me my hair was amess and I was covered in dirt and mud. He tried feeding me but I could not bring myself to do it. I do not regret any of it. My conciousness has passed through several planes of existence. I wish I could say more, but I don't remember much from it.</p>",
 "year": "2009",
 "id": "81338",
 "gender": "Male",
 "age": "18",
 "timestamp": "2010-07-21T07:00:00.000Z",
 "views": "3548",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
