{
 "title": "Unsuspectedly Down the Rabbit Hole",
 "author": "skeeter",
 "citation": " skeeter. \"Unsuspectedly Down the Rabbit Hole: experience with JWH-018 (ID 81354)\". Erowid.org. Mar 22, 2010. erowid.org/exp/81354",
 "substance": "JWH-018",
 "bodyweight": "125 lb",
 "report": [
  "<p>I had spent an entire night working on a program for my Computer Science class. I was burnt out, but still had some Italian homework to do. I thought getting a little baked might make the Italian more bearable. I had smoked pure JWH (not Spice product) on several occasions with my friends, and its effects have been almost identical to more psychedelic strains of marijuana.",
  "However, this night, I took two hits instead of my usual one because I accidentally vaped more JWH than I meant to. At first, I was just really blazed. I was walking back with my friend, and we said good night, and first, on my way back, I realized I was experiencing time dilation.",
  "Then, the sidewalk began to crawl in a fashion very similar to LSD visuals. I was slightly taken aback, and surprised at this turn of events. I went to my room and sat down to listen to music and work. I realized that I was almost completely dissociated and was hallucinating wildly. My static background was animated, and my music was completely overwhelming.",
  "With the world spinning, I laid down and closed my eyes. The closed-eye visuals were very very intense. I became fearful, and said a prayer and made peace with God. At some point, I drifted off to sleep, but I don't know when. I 'came to,' about three hours later when my roommate's alarm went off, with a feeling that something profound had happened, but unfortunately I cannot remember much of it. Except for the sensation of falling down a hole into this state. Follow the rabbit, I guess.",
  "It was an extremely intense experience and not at all what I was expecting that night from a cannibinoid.</p>"
 ],
 "year": "2009",
 "id": "81354",
 "gender": "Male",
 "age": "20",
 "views": "18174",
 "dose": [
  {
   "time": "0",
   "amount": "4 mg",
   "administration": "inhaled",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2010-03-22T07:00:00.000Z"
}
