{
 "id": 8136,
 "title": "At a Rave Hold the Meth",
 "date": {
  "submission": "2006-03-17T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Halflight",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "liquid"
  },
  {
   "time": "0:45",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": ""
  },
  {
   "time": "0:45",
   "amount": "2 ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "1:15",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "3:45",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Lorazepam",
   "form": ""
  }
 ],
 "report": [
  "T+00:00",
  "I had been planning to attend a rave last friday for weeks. I've only been to one rave before, which quite frankly sucked. But I'd heard good things about the DJ, Lorin Bassnectar. I unexpectedly had to work friday night till 11pm. On the way over to the club, I drank a solution of 20mg of 2CI. My friends were already in the club when I arrived, save my friend A. who was waiting outside with my ticket. A. told me that my friends had been able to get some ecstasy that evening, and that it was very good. I was excited and decided to take some at the first opportunity. Waiting in line, I felt the 2CI coming up. It was very gentle and slow. I didn't feel significantly inebriated for an hour or so.",
  "T+00:45",
  "I took a large ecstasy tablet. It was colored a deep, saturated blue and had a dolphin on one side.",
  "As we listened to an opening DJ, I drank a couple beers and waited for the drugs to come over me. Time seemed to slow down. A half-hour passed and seemed like more than an hour.",
  "T+01:15",
  "I was being swept away. Lorin Bassnectar came on. He does breakbeats, house beats and who knows what else. The beat was fast and almost everyone moved towards the dance floor.",
  "I watched a few of my friends and go dance. Personally, I hate dancing in the club. But the ecstasy was hitting me more and more, and the 2CI was coming gently, but firmly. I danced for a half hour that felt like longer, took a break to drink a bottle of water, and went back out. Near the end of his set, I sat down with my friends. I realized that whether I was moving to the beat or sitting perfectly still, I felt perfectly calm and euphoric. I felt a sensation that I've only felt with pure MDMA; my breath is extraordinarily refreshing, I feel warm and content.",
  "I danced for another ten minutes, and then found my friends. The club was closing, so we went back to my friend J's house. Three others were on the same pills. I turned on some breakbeats and some downtempo, we played videogames and relaxed, talked about the night, and smoked weed. Everyone had an awesome time. The conversations were rich, relaxed and more honest than usual.",
  "T+03:45",
  "At 3am I took one ativan. They'd taken their e pills earlier in the night, so they were getting tired.",
  "T+6:45",
  "At 6am I came home and listened to some softer ambient music, watched the milkdrop visualizer and talked to my brother. I hadnt seen him in a few days, so we caught up. He went to bed, but I was high until around 9:30am. I walked around the house, thinking of what had happened in all the rooms, everything that happened this summer. I knew the feeling would be gone soon, but I didn't mourn it. The feeling of the hardwood floor on my feet brought back memories.",
  "I fell into a deep sleep that lasted six hours. I was woken by my brother watching tv.",
  "Two days later I feel no ill effects. I've been taking 5-htp and it seems to help. While I felt terrible after taking e with meth in it, I feel fine now, better than usual.",
  "All in all, this was one of my best drug experiences. The combination was perfect. I was calm and excited, blissful and grounded, euphoric and content. This is how MDMA should be. It was an amazing night, and I'll hopefully repeat it someday."
 ],
 "erowid": {
  "id": "48895",
  "citation": " Halflight. \"At a Rave Hold the Meth: experience with 2C-I & MDMA (Ecstasy) (ID 48895)\". Erowid.org. Mar 17, 2006. erowid.org/exp/48895",
  "substance": "2C-I & MDMA (Ecstasy)",
  "views": "6140"
 }
}
