{
 "id": 8143,
 "title": "LSD Psychotherapy Trip #1 - Deep Revelations",
 "date": {
  "submission": "2006-02-06T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "psilocybe",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "8 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter / tab"
  }
 ],
 "report": [
  "21 years old.",
  "Setting : My Condo in the mountains. Alone",
  "Dose : 8 hits of decent quality LSD",
  "Set : Deep depression for past few months and years. I was/am looking for peace through self exploration with LSD.",
  "This trip started off with the ingestion of 8 hits of decent potent LSD. By the time the effects started coming, I knew it was going to be an intense trip. I could not read the book I was reading anymore and I was directed to the couch from exhaustion and mental confusion as much as anything.",
  "At the edge of the couch I had my computer, loaded with 6 hours worth of archetypal chanting/meditative music. I also had eye shades to keep the experience as internalized as possible. I put the eyeshades on, and I started up the music and put the high quality headphones over my head. I planed to allow only material from my mind to be explored with absolutely no environmental distraction.",
  "It is about 5 days after The trip and I am already forgetting a large amount of the chronological order of things and whatnot, but I still remember the important parts of the trip so I will list them in no particular order here.",
  "Freudian Anal Stage. At a point during the trip I started seeing a flush of images relating to the feeling of taking a crap. I saw my whole life flash in front of me starting with potty training. In a Freudian sense I found out in a very intimate way that all my problems in life, seriously, all my real problems in life relate to the fact that I am fixated on the anal stage, anal retentive would be the appropriate description for my personality. These images came through my head so quickly, it was the biggest revelation I have ever had. All my excessive paranoia, obsessive-compulsive behavior, obsession with cleanliness, extreme fascination and disgust at feces, and the inability to let go and just have a good time suddenly made a ton of sense in a very Freudian way. Anal retentive personality!",
  "Then even more revelations. I am obsessed, completely obsessed, with control. Again flashing before my eyes at an astonishing pace was evidence from my life that supported this claim. I began to see how much life I was missing out by being so meticulous and un-adventurous and anal. I saw what life could be like just going with the flow and letting loose and it filled me with a desire that was as intense as 4 million suns to overcome this obsessive desire and just go with the flow living life to the fullest.",
  "Birth Trauma. The rest of the trip I think relates to Stanislav Grofs brilliant observation of the Birth Trauma being re-enacted in a Death-Rebirth process during high dose LSD sessions. I had some strong concentration camp imagery. Its intensity was beyond belief. I regressed into a small child during the holocaust with the gas chambers in sight screaming MOMMMYYYY and crying like a child who's scared shitless would. A child knowing nothing about anything except that mommy is the only thing that could possibly make this situation happy again. The feeling was strong. I screamed and cried mommy very self consciously (ther neighbors upstairs) but I wish I could have screamed my lungs out. It was very real.",
  "I was screaming, but yet as involved in this feeling that I was, I was able to change my viewpoint to that of the Nazi soldiers ordering the trainloads of people to their death. The lack of warmth of feeling, that really these people deserve this and they are somehow below human. And I could also see it from a detached observer with no feeling whatsoever. I have had much concentration camp imagery and scenes through my years of psychedelic use, and here was no exception of how powerful these images are. Its important to never forget it.",
  "I also had strange mystical divine feelings during this trip. I had feelings of being some sort of monk in the mountains in a very eastern sense of life, devoting myself to god. I stuck my arms out and felt at one with incredible warmth and feeling that left me smiling and bubbling up with warmth and love for all. These feelings were fleeting unfortunately, and I only experienced a little bit of it through the trip, (most of the trip was was my suffering of my birth trauma) and every time I experienced it I really wished I could have that feeling in my daily life.",
  "I also had images of being able to start over my life. Starting again from the moment of birth when I was out of the womb. Being free from all the biographical crap that I call my life, just a refreshing new start. It was a beautiful thought to say the least.",
  "There was also some complicated stuff like BPM II fiery hell, and BPM III sexual scatological and intense pain/intense sexual ecstasy moments. I realized that all my problems in life come from this scatological element of my birth (root cause of anal retentive personality?). I just have a severely big turnoff to biological materials including anything in or near a vagina. I know I need to go through these scatological parts of my mind to be able to approach a woman in a good sexual way, and to be able to overcome my own obsessive-compulsive anal tendencies.",
  "There were some confusing parts of the trip too. Like when the trip kind of just stopped on a negative note. I didnt know what to do to continue the trip. It was about 6 or 7 hours of hard tripping when this happened, and I just was too tired to keep on going. So I let the trip end on a bad note. Note that I was still seeing visuals everywhere, huge tracers and definitely tripping hard. But I took my eyeshades off and the music off and just stopped internalizing the experience and facing my inner world (its exhausting!). So I pretty much stopped the trip myself, not the best idea with ever more unconscious material to work through.",
  "Its a bad idea to let the trip end on a bad note by the way, because it can stick with you for weeks or months after the trip. I knew this, but I was just way too tired. I ended up tripping for about 24 hours which is a new record for me. This was a very powerful trip and it will set the stage for my future trips most certainly.",
  "I now know what I want out of life. I want to be a dog-owner. I want the personality of a happy fun loving dog who is spontaneous and unafraid to let loose and enjoy the many awesome things in life. Like just playing Frisbee or running or eating or anything can be so pleasurable, spiritual even. I want that. I am a believer that there is some small chance that I can overcome all the crap in my life by all this self-exploration. I know Im in a minority here because my friends and family and society worry about me doing all this LSD, but I wouldnt be doing it if I didnt think it could help me.",
  "I just want peace and love. Thats all. Just the simple peace. Time will tell if I get it."
 ],
 "erowid": {
  "id": "48915",
  "citation": " psilocybe. \"LSD Psychotherapy Trip #1 - Deep Revelations: experience with LSD (ID 48915)\". Erowid.org. Feb 6, 2006. erowid.org/exp/48915",
  "substance": "LSD",
  "views": "17577"
 }
}
