{
 "id": 8146,
 "title": "Waves of Intense Thought Attacks",
 "date": {
  "submission": "2006-02-15T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Xplorer",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "10",
    "grams": 0.01
   },
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "12",
    "grams": 0.012
   },
   "administration": "oral",
   "substance": "2C-T-21",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200",
    "grams": 0.2
   },
   "administration": "oral",
   "substance": "Piperazines",
   "form": "pill/tablet",
   "specific": "BZP"
  }
 ],
 "report": [
  "I am a experienced tripper with a number of substances under my belt, although I have had some rough LSD trips in the past and havent touched it since. But these LSD trips where nothing like what I experienced with this combo.",
  "Setting was in my lounge with my wife and kid asleep in the bedroom. Wife isnt understanding to my drug use and doesnt now that I dosed. This could have added to the experience's direction, because I was really conscious of not making to much noise during the trip.",
  "T 10:15pm - Swallowed the little pills",
  "T 1hr - Feeling like its coming on now, like the start of MDMA. Decide to watch a movie to help ease the onset but that didnt last as my mind kept drifting off.",
  "T 2hrs - Listening to enigma I got some awesome CEV, feelings of flowing in a vast swirling void that felt like complete euphoria. Also some very erotic fantasies which were very real in feeling and visually!! But then I would start to view my life from a very negative view. I was seeing myself through the eyes of other people and really judging myself harshly, like I have never done before. On other drugs like mescaline I might do this to an extent but I would always see what the teachings were and move on, as if it was a good thing. Not this combo though...It was if I had a split personality and it was constantly attacking me, calling me a loser and showing me that my lifes a joke and so on, not fun or useful! ",
  "I would try watching TV then listen to music, then would try lying down, sitting up and standing up just trying to relax and work through this barrage of negative waves. As time moved on the negative aspects were getting stronger. I was sweating and rubbing my hands together like a lunatic, pacing back and forward wondering if I was having a severe bad reaction, I actually started to feel like I was losing it and that this may be it for me, lifetime in the loony bin. I began to have panic attacks and it was getting so intense that my head was under extreme pressure. I would center myself but then the panic would set in again, it was relentless. This felt like and may have been a true psychotic attack!!",
  "I know reading this you may think why not clear the mind and think good thoughts, which I did try but the bad shitty thoughts came like a hammer to the head, it was just like wave after wave of the storm. I started to feel like I was on the verge of passing out and that if I did pass out then I wouldnt wake up. I was so concerned about this that I was just about to wake my wife and get her to take me to the hospital. I would then say to myself yo're not going to die its just in your mind. Then I would think its just my ego not wanting to admit I was in trouble and go through the shame of my wife taking me to the hospital (Again the split personality or a little devil on one shoulder and an angel on the other). The thing was that I was so confused on wether or not I was ODing because my heart rate was fine, breathing was ok, dose wasnt high, but I felt so wrong that I couldnt be ok, like the intense uncontrollable head pressure was a warning. This pattern would repeat for the next 3 hours!!!",
  "T 6hrs - Finally started to feel like I was getting control over myself and decided to drink some bubbly which helped relax me. Didnt sleep very well and felt very sleepy and stupid the next day, though I find BZP does this to me.",
  "After having a good sleep the next night I woke up feeling quite empathetic and happy. But not a good trip and would never do this combo again!!",
  "Not such a good write up and not suggesting that others will experience this but reading the other disasters on 2-CT-2 there is similarities and hope this serves as a warning.",
  "Be kind to your body and mind",
  "And happy trippin :D"
 ],
 "erowid": {
  "id": "48931",
  "citation": " Xplorer. \"Waves of Intense Thought Attacks: experience with 2-CT-2, 2-CT-21 & BZP (ID 48931)\". Erowid.org. Feb 15, 2006. erowid.org/exp/48931",
  "substance": "2-CT-2, 2-CT-21 & BZP",
  "views": "12937"
 }
}
