{
 "id": 8149,
 "title": "A Long Wait",
 "date": {
  "submission": "2002-01-06T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Denny",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Opium",
   "form": "(tar / resin)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I had been waiting to try opium for quite some time, and one weekend offered itself to the purchase and consumption of this enigmatic, and hard to come by opiate. It began when four friends traveled into the city of brotherly love to aquire five grams of this sticky black residue, smelling of a unique fresh flower. Once the drugs were secured and mouths filled with food for the evening, we went back to the dorm to smoke.  Myself and one other friend had never tried opium before, but I had researched a lot about it. The other two friends had only smoked it on top of some weed, so we decided to go at it straight. The bowl was packed with half a gram, and we proceeded to smoke it. The initial hit tasted almost confused in my mouth, as I had never tasted such a strong floral power in my mouth. The bowl lasted quite a while, for about 15 minutes, before it was ash.",
  "We looked at eachother, silently pondering what eachother was feeling and exactly how we were being affected.  It was determined then that we weren't high enough, so we smoked the other half gram in the same bowl. At this point i didn't feel anything except a loght marajuana buzz feeling. Even after we finished the gram, I only felt moderatly buzzed, My friends had various stages of buzzing. Only after we pack a nugget or two and smoked them did i feel the come on of a real opium high.",
  "Lying down, I began to lose the feeling in all of my limbs and my entire body as a whole. It felt as if the biggest, warmest blanket had been wrapped around, I was emersed in warm and comfortable. This feeling was constant for a few hours, and even into my sleep, i could feel heat engulfing me. So, for me, I think that I needed the weed to bring on the opium and only after that did i truly feel the power of this flower. I would recommended it to almost anyone."
 ],
 "erowid": {
  "id": "4894",
  "citation": " Denny. \"A Long Wait: experience with Opium & Cannabis (ID 4894)\". Erowid.org. Jan 6, 2002. erowid.org/exp/4894",
  "substance": "Opium & Cannabis",
  "views": "22127"
 }
}
