{
 "id": 8153,
 "title": "Diatribe",
 "date": {
  "submission": "2002-01-10T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "mistress jade",
  "gender": "Female",
  "weight": 34
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(daily)"
  }
 ],
 "report": [
  "I think the fact that I have nothing I would rather do on a sunday afternoon than go online to look at pictures of coke speaks for itself.  Of course, this is only after snorting the requisite nine lines of sweet-n-low -it has no discernible effect on body or mind, but the appetite for ritual is satisfied...  The ritual has always been imperative for me: The crushing, cutting, and transferring from jar to envelope to chanel compact is almost as vital as the actual snorting. ",
  "Today, twenty seven days off coke, I still need (and do not confuse desire with neccessity) to perform those acts, to feel the burn of something going up my nose, even if it doesn't get me high.  I still don't think im an addict.  I don't even remember the first time I did coke, it was years ago, and I wasn't very impressed.  It was just never something that made me hungry, that is, until about nine months ago.  I don't know what changed in me, but I remember the sequence so clearly it's as if I was watching it rather than living it.  Those first few months (weeks?) When a few lines made me feel so loved, made me so beautiful and so capable.  I would look at myself in the mirror (my second favorite coked up activity, after sex) and feel stunned at the beauty that I beheld.  But this was belied by looking at my same face the next day and seeing this grotesque thing, which I would pick at with my nails, tweezers, saftey pins, etc...  By the fourth month I was working as a dominatrix to support my habit, spending my nights in a dungeon dominating sad old men who paid me hundreds of dollars to beat them while clad in latex, etc.  If I wanted to get out of my bed, I needed exactly one gram (precision of measurement is another big thing for me)which I would cut into three lines before I went to sleep (a rarer and rarer occurence) and leave on a mirror positioned in such a manner that all I had to do was rotate my head and pick up my straw.  If I wanted to make it to the bathroom, across my apartment, that necessitated an additional gram, also cut into three lines, on my coffee table, exactly between my bed and my toilet.  To leave the house meant an eightball for every four-hour period I was up. ",
  "Most of my time was spent at the dungeon, where I did my client's coke, and lying in my bed, too wired to sleep but too weak to get up.  If I wanted to get high, I would have to sit down and do an eightball all at once.  The scene from scarface where he cuts the coke with the back of his hand no longer seemed ridiculous to me.  For thirty four days I did not shit, and in about three months I went from a 'recovered'-anorexic 110 lbs to a skeletal 74.  It was at this point that I stopped making money, due to my physical deterioration, and the coke started running out.  In six months I had made over 75 thousand dollars as a domina, and suddenly my income was gone.  I started fucking for coke (never for money - that would be degrading...), But who wants to fuck a paranoid 74 lb thing whose nose bleeds uncontrollably?  I was on my way up to riverdale to fuck my old dealer when I had a heart attack, on a manhattan street corner.  I have been told that I will not live past 35, even if I never touch  coke again."
 ],
 "erowid": {
  "id": "4896",
  "citation": " mistress jade. \"Diatribe: experience with Cocaine (ID 4896)\". Erowid.org. Jan 10, 2002. erowid.org/exp/4896",
  "substance": "Cocaine",
  "views": "15261"
 }
}
