{
 "title": "What the Fuck is a Mecimoore?",
 "author": "Jdubb",
 "citation": " Jdubb. \"What the Fuck is a Mecimoore?: experience with JWH-018 (ID 81537)\". Erowid.org. Jun 17, 2010. erowid.org/exp/81537",
 "substance": "JWH-018",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "JWH-018",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I discovered JWH 018 during the summer last year after trying the blend of herbal smoke called 'Skunk'- a new breed of weed. The smoking blend is nice because it's easy to dose, but the pure form is fucking so hard to dose if you are not careful.</p><p>I have been smoking the blend for awhile and finally decided to buy the pure form. It shipped from within the USA. The pure form is much more economically cheaper than the blend.</p><p>I was smoking this stuff with friends for about 3 weeks, getting high off it everyday, all day,....IT seriously lasts forever, I shared it between 5-6 different people several times per day.</p><p>Pure form of JWH-018</p><p>Pros: Cheaper, Legal,  Comes in Bulk, Lasts for ever, 1000mg or 1gram x 3-5miligrams lasts for fucking ever.</p><p>Cons: Hard to dose, Easy to OD, weird side effects after OD, fucking makes you crazy after OD.</p><p>Early in the day: I smoked some with my friends, they pressured me into smoking JWH018 during the day, I think it has some weird side effect that makes you addicted or it is addicting. Both times I smoked it this day, was via aluminum foil, chasing the 'J' dragon' As soon as I heat it up, it turns to liquid and then I inhale it. I probably took around 20mg in the middle of the day was the first time I  smoked it.</p><p>Later that night: I was pissed off because I had stuff to get done and felt totally lazy. After I got my things done I needed to finish I decided to smoke with one of my friends in his room. I didn't really want to smoke but was pressured into smoking again. We both took approximately 100-150 miligrams off aluminum foil. I felt okay for about 10mins then once it kicked in, it seriously kicked my ass. I was so sick.</p><p>I went out in the hall and was trippin mad balls. I kept having a thought in my head, that I was kinda of in the matrix, or a computer program. I think I lost my vision for awhile, I blacked out? Total out of the body experience. I could only think of one thing going through my head, and one thing only and it was to find out what a mecimoore was and why the fuck it was there? It made absolutely no sense.</p><p>Someone found me Trippin in the hallway and I tried to sober up like when you normally smoke weed and you can act sober when needed, but I couldn't, I tried to act sober because I was about to get in serious trouble with the law. They called the paramedics and took me to the hospital, I don't remember shit. They ambulance sedated me, and injected some drugs in me. I was getting pissed off at everyone because they wouldn't explain anything to me. Nothing made sense at all, I couldn't make sense of anything.</p><p>Next morning: I woke up in the ICU at a hospital and was like WTF? why am I here? I had no clue what happened last night. I found out that the cops confiscated my jwh018 and I got fucked. They charged me for possession of controlled substance, and ingestion of controlled substance but never actually convicted me.</p><p>The whole experience changed my life.</p>",
 "year": "2009",
 "id": "81537",
 "gender": "Male",
 "age": "19",
 "timestamp": "2010-06-17T07:00:00.000Z",
 "views": "13550"
}
