{
 "title": "I Owe The Man $10, I Owe The World A Lifetime",
 "author": "rosamumstarbreeze",
 "citation": " rosamumstarbreeze. \"I Owe The Man $10, I Owe The World A Lifetime: experience with LSD (ID 81591)\". Erowid.org. Dec 26, 2012. erowid.org/exp/81591",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "report": [
  "<p>I dropped acid last night. 1 hit. 1 strange cylindrical tablet that tasted exactly like a sweet tart.",
  "My friend had called me last night and asked if I wanted some. I knew that with the scarcity of this unique compound, this may have been my only chance to acquaint myself with such a strange edible device.",
  "I told him, yes, but I only have 10 dollars. No problem I'll spot you the other 10, we'll go out and have a blast.",
  "A blast he said. That was some fucking understatement. A blast might come from a pistol firing off...or my dad when he's taking a shit. But this...this was a night that didn't just blow up. I felt like I had imploded as well. Talk about stomach bloating ugghh...but that's another issue completely.",
  "I was randomly walking outside to ease my anticipation when my dealer's car roared in the countryside. Traveling at 50 miles per hour, his jet black chariot from hell stopped inches from killing me. 'Other side, man' he said as I put my hand on the shotgun side of the car.",
  "I get in, and I see most of my friends there as well as a bully from high school I remember from before. I ignore the bully and greet my comrades before embarking on an adventure that lasted roughly 13 hours and 2.5 nano seconds.",
  "We approach the gas station off the side of the road as my hungry friend (who is already tripping) had informed us he was going to steal munchies and drinks. That's fine, I needed a moment to properly assess the situation as well.",
  "I am miles away from home without a designated driver, with parents that cry at the mention of marijuana, and not only that, possessing the title of a son who had been grounded for quite some time now. It is 2:30 in the morning so I decide to say fuck it. This will officially be my going away party before I move out and and send a post card of my middle finger to the town and home that had fucked with me for so long.",
  "My friends outside the store are pelting a girl sitting on the park bench with questions. 'What are you writing?' said one. 'A letter to your editor?' 'Your boss?'",
  "Meanwhile my thieving friend approaches our direction with an arm full of food and a shit-eating grin on his face.",
  "We leave and go to one of their houses. Its out in the country and the night is more beautiful than I ever imagined it would be. We smoke weed and I do my best to ignore the bully's accusations that I was gay.",
  "I start to feel it. We all decide it's a fun time to go walking in the woods. We approach a house with an American flag flapping in the wind. It looks so strange to me. I see human body's form out of the flag having sex. In the night moving objects had taken on a more abstract presentation than the day time I assumed. I thought, 'how can I express this to my friends in the least weird way?'",
  "'That flag looks like a porno.' I manage to utter. For some reason talking makes my mouth feel good so I proceed to describe the 'American flag' porno flick that played in my mind. '...the stars are a blond...the stripes are a brunette.' this causes the whole group to burst out laughing. The bully tells me that I talk way too much. Surprisingly I am actually unable to feel agitated, sad, or bad in any way. The night that unfolded was pure bliss. Besides, I kept reminding myself, I successfully consumed all his weed.",
  "Other than the constant complicated question (how was I going to get home without a ride?) that occasionally bombard day mind, I was fine. I had chalked it up to only taking 1 hit. The next time I do this I will have to make certain that I am safe and already out of my parents house.",
  "Anyways, back to my story.",
  "The bully leaves on account of being 'too fucked up dude.' I think about him getting into a car crash and giggle to myself as we walk further up the road.",
  "'Let's chill at my house', one of my friends said. We go to his place and proceed up the driveway. For those of you not in the know. Most country driveways are treacherous paths that are unpathed unsafe and most definitely a tripping hazard.",
  "It was here that I had my second visual. As we walked it was getting increasingly difficult because I was charged not only with walking, but with carrying my friends xbox 360 too.",
  "It gets darker the more into his driveway we get. The rocks are taking on new shapes. Rock shaped lizards and crocodiles merge from the ground. This makes it harder to walk as I am trying my best to navigate through the shifting sea of animal rocks.",
  "I don't know how I managed to get out of there without tripping and falling (no pun intended) or dropping my dealer's xbox. But we made it to my other friend's house.",
  "And then we stop short of his garage and sit on the side. I proceed to play with the rocks, dirt and sand like an infant on his first day outside.",
  "I played in the dirt for what seemed like 3 hours and I looked at my cell phone and found out it was only 30 minutes. 'What the fuck is going on?' I asked before laughing stupidly. That is the one forbidden question to ask, my dealer says. 'What?' I respond. 'It's because to ask what is going on is to relinquish the content of our present situation and future to fate and not acknowledge the greatest gift, or curse, we have: choice.'",
  "'Dude,' I stammer, 'that is the smartest thing you ever said in my whole life, man.' We all laugh at my comment.",
  "We go inside to play video games. At this time I am out of my mind. My friends had nicknamed me little yoda because of all the weird as shit that I kept saying. Once inside I found myself sprawled across possibly the most comfortable couch in the universe with a curious looking pillow.",
  "The pillow had orange, baby blue, and pastel green stripes. It was the prettiest thing ever, every once in a while I would put my mouth on it when I felt no one was watching and I found the taste of the cloth to be amazing.",
  "I proceed to watch my friends set up the game system as I hug my pillow as if it were a care bear. 'Why are you sitting like that and hugging his pillow?' 'Because I feel really cute when I'm hugging this pillow.' 'Are you sure you aren't gay?' my dealer asked jokingly.",
  "At this time the game system is finished being set up. Let me just tell you that halo2 is the most bizarre fucking video game ever. I find it hard to concentrate due to all the colors. I am close to having a full blown seizure. This is soooooo fun. I had thought.",
  "2 hours later",
  "His mom is home at this time and we are forced to retire to my friend's room. This room, let me tell, you is the coolest ever.",
  "I had no idea my stonner friend was a music enthusiast. All over the floor is equipment. A kaoss pad, turn tables, microphones on stands and a huge 88 key yamaha motif.",
  "'Wwwwooooooaaaahhh.' I am blown away at his gear. 'Can I play with it?' I ask. 'Sure.'",
  "I start to play for my friends a few Regina Spektor songs I knew. My coordination is not ideal due to the drugs at that moment but my friends enjoyed it none the less.",
  "At this point my friend takes over the instrumentation. He is skilled at piano let me tell you this. As he plays the most psychedelic music I've ever heard we all lay on floor staring at the ceiling staring at the glow in the dark stickers of stars and moons.",
  "The night simmers down, and my friend gives me a ride home.",
  "Luckily my dad is on the couch laying down and I greet him 'hey dad, I couldn't fall asleep, so around 5 o'clock I took a walk outside, you're right the morning is really pretty.' My dad tells me he is thankful I was quiet last night.",
  "I am off the hook and safe from being in trouble. I get on myspace and some random girl posts a survey on the bulletin board. On a whim I send her this reply:\rIll be honest me and some friends tripping on acid stumbled on to this and its blowin my mind how easily you can create a bulletin at 6 am and not expect to see an insurgence of annoying questions. Why is she awake and how is that acceptable might come to mind. As a sorta just in case methodology developed recently by us 3, we came to see results to proved that you without a shadow of a doubt must be unreal. Yes its true. You might say, well I maybe busy posting bulletins but you're a crazy amped up man blowing his mind on a crazy concoction as LSD. Let's keep in mind 3 things as we go to sleep and free ourselves of the tyranny of dreaming backwards in order to grasp straws at a meaning that has already been revealed right here. That 1. I am responsible for you to have burned 1.345 calories to click aprox. 8 times with your mouse. 2. You are actively seeking a similar response from your other friends since we all have received the same bulletin the moment you had decided it was a decent and proper time to click post. 3. We are all angels who met in a dream and this bulletin is nothing more than another insipid thought of mine forced into creating a detergent for this thoughtless and scary night.",
  "I am impressed with my email. I also wrote this in wordpad:\rHolyshit im same whoa who would have thought it was a make of something Ive never quite succeeded at avoiding to annoy. Im safe and insane thanks to sterling and Ive had the initiation of james vershoyle to tank along with any not so sober inquiries his dad must be making of him at this momment. Questions such as where am I and why cant I find a place to sleep are as foriegn to james as it is to me. We cannat leave the world alone unless we feel its safe enough to blow up and blow in completely in the sactitiy and privacy of your own room. But a room must be perfectly spiff and permed for, not an upheaval, but as to serve as a suitable spot to relax and release in.",
  "What is what and what is ending up as a sentence born way too fast. I've had it without a shadow of a doubt. I've seen it more than any would or should ever want to try. Of what is the what in that previous sentence you ask. It's as trivial as an itch but still slightly more engrossing than a staple left lain on the table. Undone, unripe and unsuitable for use a a resting zone for these cute little musings. And musings are nothing more than just a generic brand of Draino for the endless churning and debacle of a perfect and neatly manicured home.</p>"
 ],
 "year": "2009",
 "id": "81591",
 "gender": "Male",
 "views": "1197",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "submissionDate": "2012-12-26T08:00:00.000Z"
}
