{
 "id": 8159,
 "title": "Adds Life",
 "date": {
  "submission": "2007-09-05T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Eryth",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "sublingual",
   "substance": "Coca",
   "form": "(leaves)"
  }
 ],
 "report": [
  "I somehow got the idea to try coca having never before tried cocaine.  I don't know why, it seemed mysterious and somewhat 'wholesome'.  Visions of Inca warriors I suppose.  Anyhow, after some scrounging about, I managed to get my hands on some Zurit brand coca tea from Peru.  Drinking it as a tea didn't do much for me and still doesn't. The most I tried as a tea was 5 bags (5g) at once.  A very slight but noticeable lift was all.",
  "Chewing it was altogether different.  This was totally fantastic.  I am now a regular chewer.  Usually 8 bags(8g) at a time, 5 is my min.  What I do is premoisten the leaf-tea powder after removing from the bag.  Just a bit of water.  Then I add lime paste, available from East Indian stores where it is sold for use with betel nut, just a few small dabs and mix.  This to alkalinise the coca (necessary).  Then I stuff it into 1 cheek and moisten evenly with saliva.  Gradual dabs of the lime paste are required thereafter and timing can be determined by degree of numbness felt.  Careful with the lime paste though, it must be applied directly to the coca wad.  It burns like hell otherwise but I won't notice right away because of the numbness.  I roll it around in my cheek not so much chewing it with an occasional squeeze and slowly, over an hour or so, drink the 'juice'.",
  "A nice effect. Central Nervous System effects corelate to degree of numbness felt in the mouth.  Fatigue is gone instantly replaced by an electric energy, occasionally rushing.  Gradual up and down as well.  No weird feelings whatsoever, just energy and waves of goodness.  When the numbness is gone I known my coca wad is spent and spit it out.",
  "I have also made and tried herbal percolations of coca with vodka.  Not bad.  I can drink this stuff all night pretending I'm Pope Leo XIII or Jules Verne with nary a hangover.  I still prefer chewing though.  Or mix chewing coca with a drink or 2 of alcohol for a slightly different cocaethylene buzz."
 ],
 "erowid": {
  "id": "48976",
  "citation": " Eryth. \"Adds Life: experience with Coca (ID 48976)\". Erowid.org. Sep 5, 2007. erowid.org/exp/48976",
  "substance": "Coca",
  "views": "10999"
 }
}
