{
 "title": "Rei Kamb is Master Healer!",
 "author": "CabocloGuerreiro",
 "citation": " CabocloGuerreiro. \"Rei Kamb is Master Healer!: experience with Phyllomedusa bicolor (Kamb) & Cannabis (ID 81674)\". Erowid.org. Nov 26, 2010. erowid.org/exp/81674",
 "substance": "Phyllomedusa bicolor (Kamb) & Cannabis",
 "bodyweight": "70 kg",
 "header": [
  "DOSE:",
  " ",
  "transdermal",
  "Phyllomedusa bicolor"
 ],
 "report": "<p>The experience went on one week ago and that's been the best week in about ten years.</p><p>I live in Europe but I'm bound to Brazil and my religious practice come from there: precisely brazilian western Amazon. That is, of course, Santo Daime. I'm practicing for 4 years now and surely the Daime/Ayahuasca had a very positive effect on me. My family witnesses it with joy: I cured my 5 years long opioid addiction and started a healthy lifestile. My parents and friends first were concerned about things like 'entering a cult' and 'taking strange drugs'. Now they would be very concerned about me stopping it 'cause they see I'm millions times better than before and now better than ever!</p><p>Let me tell: About 10 years ago, medicine-men from the Katukina tribe visited Santo Daime churches. They were impressed by the strongly specialized ayahuasca use of the church and decided to teach the daimistas how to use the Kamb.</p><p>One week ago, finally my encounter with the Sapo. It was after 3 SD works in a week: 1 'Cura' + 2 'Hinarios'. I already felt so good, centered, firm and strong as usual after the Daime. The best was yet to come.  The only thing Daime/ayahuasca never totally healed (just cured) was my fibromyalgia wich I suffer(ed) for something like 20 years and led me to the opioid abuse that I stopped thanks to SD.</p><p>I had my Sapo session at 8:30 a.m. in the Santo Daime church. There were me, T. the 'sapo doctor' and other two patients. Empty stomach. I had drunk 4 glasses full of water as suggested by T.: that is very important: Kamb made me puke just bile and coming diluted with water it was not total hell like it would be without it.</p><p>T. proceeded to burn my skin in 7 points on the forearm (normally it is done on the shoulder but it was cold and so I didn't need to pull my sweater) then applied 7 little doses of the frog sweat with a small knife. It burned and after few seconds I felt warmness expanding thru my body. Then T. applied a drop of water on the upper burn and let it slide along the row of tiny burns covered by the sacred VENENUM... 'OMG!' I thought. 'I've done it!'. It was really hard to undergo and bear. Fortunately I already knew that the feeling of 'going to die' is not justified 'cause I witnessed several old people (70-80 y.o.) with serious heart problem being treated with Sapo at the same dosage and doing very well after.</p><p>After a tremendous rush of warm I felt my lips being stretched and my throat swelling and getting very dry. Then my heart began pounding a sort of strong electric flush traveled all over my body reaching every single tiny spot. I was suffering a lot. My nose running. Difficulty breathing. T. began chanting a song about Rei Kamb's healing power. Then happened something strange: I began to somehow appreciate that state. My column stetched and I seated watchin straight ahead. I began breathing deeper and slower than ever. It was like some entity possessed me and breathed for me. I enjoied the sound of my breath that became encreasingly stronger and I started to make noises humming at a frequence that resonated with a pitch sound surrounding me. It felt like I was synchronizing to the a pulse coming from Nature and that that would make me a stronger man. I also felt like I was in a different environment filled with green-yellow foggy light coming down in rays from the ceiling.</p><p>At about 10-15 minutes sickness grew strong but I was not able to puke. T. then gave me two more glasses of water, waited two minutes, I didn't puke so, again singing a song on the Sapo, T. geve me two more burns and applied new fresh medicine and water.</p><p>Again the rush, and after 1 minute I purged. Lot of water mixed with a little bile. After 10 minutes I was able to stand and after 2 more minutes I ran to the bathroom and had a huge amount of diarrhoea. After that I felt way better. Only swollen throat...</p><p>When I watched my face in the mirror I was astonished: my face was terribly swallen and had assumed a distinct froggy look. Believe me: it was not swallen as if I had an edema or someone punched me in the face... I just looked as a toad but all the swelling parts of my face had a normal color and did not hurt at all: I was frogged!</p><p>T. wept my arm and said I could do whatever I wanted now, even eating anything I wanted but he warned about not smoking tobacco at all. He said I could smoke only pure and organic cannabis if I liked. I did it and it helped a lot. Strangely enough, while cannabis normally congests the mucous membranes, it really helped with the swallen throat and the residual little fatigue.</p><p>It continued to work in my body all thru the day. Gradually it made residual symptoms of a strong cold I had previously subside after expelling a lot of mucus from my nose and throat. After that my nose and throat were perfectly cleaned. My eyesight was so good after 2-3 hours and all the day long. No fibromyalgic pain at the moment but I thought it was just a transitory effect of the Sapo-Kambo. I had a strong desire to walk in the nature.</p><p>Summarizing: I puked, I took a huge shit, I expectorated, felt total lack of pain. My face was still frog-looking but gradually coming back to normal. And then: at 9:00 p.m. I felt the urge to lay down on the floor in the church and stretch my column: tlack! tlack!! tlack!!! and then it was perfectly straight. I felt so good and finally fell asleep starting to dream before the real sleep came.</p><p>I woke up at 4:00 a.m. and I was already totally awake! I meditated 1 hour. took a shower at 5:00 then went for a walk waiting for the dawn: NO FIBROMYALGIA!!! I was amazed: for the last 15 years I always awoke with a bad pain in my leg muscles...</p><p>My eyes were wide open, my mind alert, an overall sense of well being e clearness, not the one a drug could give me but just a sensation of pure, natural health. But most important of all: NO MUSCLE PAIN!</p><p>God bless that little frog: a week passed and I didn't feel any pain. It looks like my fibromyalgia simply went away... And if one day it will come back I know whats the medicine, thanks to God.</p>",
 "year": "2009",
 "id": "81674",
 "gender": "Male",
 "age": "34",
 "timestamp": "2010-11-26T08:00:00.000Z",
 "views": "9021",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "transdermal",
   "substance": "Phyllomedusa bicolor"
  }
 }
}
