{
 "id": 8173,
 "title": "A Long Awaited Trip",
 "date": {
  "submission": "2008-02-29T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Progpsych",
  "gender": "Male",
  "weight": 136
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "At the time of this experience (winter of 2000, age 28), I had been a heavy pot smoker for about 7 years, had dropped acid about 6-8 times, drank fairly heavily on and off for 8 years, and done some assorted other drugs 2 times or less. I had always wanted to do some shrooms; but, living in a small town where they are fairly rare, at least in my circle of friends, I had never gotten the opportunity. I enjoyed acid very much until the last time I'd done it; I had a very bad trip wherein I was convinced I was dying for 4 hours, but was terrified to tell my trip pal what I was feeling for fear of ruining his trip. Stupid, I know, but most of us know one doesn't reason very well on acid at high doses (I took three hits of some evil Timothy Leary). That put me off acid for a while, but I still wanted to trip a year or so later.",
  "Well, my usual cannabis dealer informed me one day that he was privy to some good shrooms if I was interested, so I jumped on the chance. I bought a 1/4 oz., cost me $80 if I remember correctly, and looked forward to trying them out that night. I got home and put a frozen pizza in the oven and waited. When it was done, I sprinkled half of my baggie of shrooms on the pizza evenly and sat down in front of the TV to enjoy The Simpsons. They didn't taste bad at all. Those rumors I always heard about them growing in cow manure really had me nervous. There really was no taste to speak of other than a dry slightly 'papery' flavor. I had chosen all the lightest colored material to trip this first time as the dealer had told me that the darker material would be the most potent. I ate my pizza slowly and by the time I had finished the pizza and my soda, I was starting to feel a little strange. It was not a feeling I was expecting at all, sort of like a combination buzz of about 4-5 beers and marijuana, a very warm euphoric cozy feeling.",
  "I decided to enhance this by packing a bowl of some standard grade commercial schwag. By the time I had finished smoking this, I was definitely starting to enter la-la land. This was probably about t+30 minutes. My girlfriend was with me and watching TV by my side. She is not into drugs; never tried a one but is not judgemental about them either. So she was just kind of asking me how I was feeling and things like that. I was able to coherently respond to her for the most part.",
  "As time went on, I was finding TV to be funnier and funnier and soon I had to go pee. I had not noticed any visuals yet until I made that classic mistake of looking in the mirror. My pupils were huge; they nearly took up my entire irises. My face seemed very strangely textured and just odd looking, kind of like looking at a videotape of yourself. I felt I was watching a different person than myself in the mirror. I was transfixed by the way my head was pulsating and changing shape, but it was not scary like some 'mirror experiences' I have had on acid. On the whole, I had none of the anxiety problems I have had with LSD. I finally was able to pull myself away from the mirror after what was probably only 30-60 seconds, but literally felt like half an hour.",
  "I went back and sat down with my girl again and watched some more TV. She had to work the next day, so she turned in early. I went to bed with her and we spooned for a while. I wanted to try to have sex, but could not even begin to get an erection. So we cuddled for a while, and after she fell asleep, I went back out to the living room to play some video games. This was about t+90 minutes.",
  "I played some Tony Hawk for a bit, but began to get nauseated by all the rapid motion, so I decided to just put on some music and chill. I filled my CD changer with some of the weirdest, trippiest music I had including some Pink Floyd, Yes, Rush & Genesis. By this point, I was starting to have sort of dissociative symptoms: I felt as if I was floating above the room watching myself on the couch. It was a very very strange feeling, and I had little control over my thought processes and motor actions.",
  "I decided this would be an interesting time to go outside to smoke. We lived on a third floor apartment that didn't allow smoking, so I went out to the balcony to light up a cigarette. No sooner had I lit up when a police car rolled through the parking lot 30 feet directly below me and stopped, presumably to do some paperwork or something, though I was convinced he would figure out exactly what I was up to if I stayed outside too long. I flicked my butt and went back inside and this is where the memory gets very hazy. I don't remember anything specific about the rest of the night, just little snippets and fragments, sort of like after a blackout drunk. I have a vague recollection of carrying on a psychic conversation with my twin self who was sitting next to me on the couch and other such bizarre happenings. I never questioned the reality of such preponderous things until the next day looking back.",
  "I was really surprised about the lack of lucidity that I felt with mushrooms. On acid, I have always been aware of what's real and what's not, even in the one bad trip I had. With shrooms, it was totally different; I never even considered these things to be strange or out of the ordinary. It was similar to how I have heard some people describe mescaline trips; a near out-of-body experience. I wasn't endangering myself or doing anything reckless (I don't think), I just sat there on the couch and became lost in a dream world of fantasy, beauty, and mesmerizing sounds coming from the stereo. I wish I could describe this part of the trip better but I truly do remember very little of it. The next coherent memory I had was when I woke up in bed the next morning. I felt fine, no hangover, a little bit of mental exhaustion but nothing like the day after acid. I went to work (I go in at 3:00 PM) and never noticed any cognitive problems or anything like that.",
  "This whole experience turned out wonderful for me, and was like acid, but without the most negative aspects: the endless trip, the muscle tension, the 'speedy'-ness, the anxiety. I ate the other half of my baggie about 5 days later and tripped even harder (my dealer was right: those black portions were more potent than the lighter parts, plus I just chewed them up without food this time). In retrospect, I think I ate too much for my first dose (about 3.5 g). I am a big guy - 6'5 and 300 lbs. - but I should have only done maybe 2g the first time, especially after reading all the experiences here. I am lucky to not have freaked out negatively at such a potent dose, not to mention being alone for most of the trip.",
  "I have not had the opportunity to do them since, but it's something I would definitely consider trying again."
 ],
 "erowid": {
  "id": "49038",
  "citation": " Progpsych. \"A Long Awaited Trip: experience with Mushrooms & Cannabis (ID 49038)\". Erowid.org. Feb 29, 2008. erowid.org/exp/49038",
  "substance": "Mushrooms & Cannabis",
  "views": "2930"
 }
}
