{
 "title": "Moxy Moron",
 "author": "Adrenochaos",
 "citation": " Adrenochaos. \"Moxy Moron: experience with 5-MeO-MIPT (ID 81776)\". Erowid.org. Nov 27, 2009. erowid.org/exp/81776",
 "substance": "5-MeO-MIPT",
 "bodyweight": "160 lb",
 "report": "<p>Intro: I had recently received a batch of 5 meo mipt (moxy) and I was eager to try the effects before I introduced it to my friends. Before this experience I had tried few psychoactives like this and only one experience has ever come near this and that was a strong dose of mushrooms. My experiences with drugs have included marijuana, mushrooms, nitrous, nutmeg, 2C-I, DMT, MDMA, ketamine and cocaine and none of these trips came close to my heavy dose of moxy.</p><p>Setting and preparation: For the first experience of this drug I thought it would be best to try it by myself in a comfortable environment watching the television in my room. I made sure I had water and food near me in case it was needed and that I was in a comfortable resting position.</p><p>Dosage and Timing:</p><p>I had decided to ingest it in pill form which was the downfall to my trip. At first I was going to dilute the bulk powder into a predetermined amount of liquid so that I would have been able to decipher the dose I was going to take (I had not received my milligram scale yet so I could not scale out exact amounts). Instead I put an amount that I thought was close to 10mg in the pill and swallowed it at 7 pm. Later after the trip I figured out the dose I took was closer to 40mg. [Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active as such a small dose, eyeballing is particularly unwise. See related article] This was the only drug that I had taken during the day so that I could ensure I was only feeling the effects of the moxy.</p><p>The Trip</p><p>(7:30) 30 minutes after ingesting the moxy and I was starting to feel the effects and it was very euphoric and there was much anticipation in my body for the full effects to kick in.</p><p>(8:00) Around this time I began to feel muscle tension in my arms and feet and the letters on my laptop screen began to ripple and I experienced the first thought that this trip was going to be very intense.</p><p>(9:00- 11:00) Through this period my trip was very intense and I was not able to interact with other people. My hands had began to tremor and when I tried to write my experience on paper, it proved very difficult and agitating so I decided to just lay back and try to relax.</p><p>My room was very dark and the only light was coming from the television and the colours were intense and my visuals were becoming distorted. People on television would have very beady eyes and it got to the point where they started forming a third eye on their foreheads and the wrinkles in their skin would become larger making their faces much more rugged. My heartbeat was rapid and I was having sound distortions, one moment voices were in slow motion and their tones became low and then the next moment their voices would speed up and become more high pitched. \t</p><p>When I would look up at the normally glittering ceiling, it became intense swirling fractals with an amazing spectrum of colours. I found the visuals and the sound distortions more of a positive but it was the thought process while I was on the drug I found unsettling. It felt as if this drug was frying my brain and there was fever-like warmth throughout my body. Sometime in these hours I ventured to my washroom and the light combined with the white walls and the square tiles of the bathroom were very uneasy. The washroom was pulsing and urination was difficult, while I look at the door it would move farther away from me and become a distant object. This was similar to a mushroom trip I had except in this situation I told myself everything would be alright and I was not going to die or become mentally ill and this thought was soothing.</p><p>(11:00- 12:00) My brain had had enough and I lay in bed with my eyes closed. I could feel the drug subsiding and I was ecstatic to be done with this drug as I had school the next day. Within half an hour the effects had died down and were once again euphoric and I found it much better now. As I look up at the ceiling the fractals were still apparent but had decreased in speed and intensity, my tremors had disappeared and heartbeat had returned to normal. By 12 am the effects were gone and my brain was left with a feeling of tiredness, moxy had spent all my energy and I was out like a light within minutes.</p><p>After Effects: The next morning I had awoken and was considerably tired but it was manageable. I did not notice any side effects until I started constructing my project in class, it was strenuous and I was sweating and breathing slightly heavier. As I bend down, I experience a head rush that causes me to pause for a moment and close my eyes, it is quite euphoric but only lasts for 10 seconds. This happened  2 or 3 more times and then I experienced nothing weird throughout the day.</p><p>Conclusion: All in all, I would not take this dosage again. I believe if the dosage was halved that it would have been significantly better but I will not try it anytime in the near future.</p>",
 "year": "2009",
 "id": "81776",
 "gender": "Male",
 "age": "19",
 "timestamp": "2009-11-27T08:00:00.000Z",
 "views": "9811",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "5-MeO-MIPT",
   "form": "(capsule)"
  }
 }
}
