{
 "title": "Viva la Kambo!",
 "author": "Sam",
 "citation": " Sam. \"Viva la Kambo!: experience with Animals - Frogs (Phyllomedusa bicolor aka Kambo) & Ayahuasca (ID 81833)\". Erowid.org. Jul 8, 2010. erowid.org/exp/81833",
 "substance": "Animals - Frogs (Phyllomedusa bicolor aka Kambo) & Ayahuasca",
 "bodyweight": "70 kg",
 "report": [
  "<p>Well having helped a well known ethnobotanical vendor set up a new website on Iboga, he invited me to a kambo frog medicine ceremony. This was an opportunity I was unable to pass up. A few weeks before the ceremony, I had an extremely vivid dream where a large green tree frog jumped on my face, kissed me a few times on my cheek, and then jumped onto my mums face, and did the same! Very random and very vividcertainly not normal frog behaviour",
  "Skip forward a few weeks to the weekend of the ceremony. I travel down to the place. It just so happens the owner of a health food website Ive known of for ages is our hostI had recently encountered her Iboga blog online. She is a very warm, cool person, and immediately on arrival, I feel very welcome at this place, a kind of community. I am sober on the Saturday eve, due to having my kambo ceremony on the Sunday. I have some great chats to people there. A raw food chef, a girl studying her masters degree in Ireland, some shamans that work with iboga and ayahuascaand many othersan eclectic and effervescent gathering of people, I feel very welcome as soon as I arrive.",
  "There had been a delay and VISA problems, preventing the main guy running the kambo sessions from coming. However the guy he works with was in London and could make it. This guy, with his helpers and the shaman hosting the gathering all arrived late on the Saturday night, as did the well known ethnobotanical vendor, and we chatted as the guys prepared the frog medicine. The guy running the frog medicine sessions was an extremely warm, loving guy who just emanated positive vibes. I felt immediately comfortable with him. He worked with ayahuasca and the Santo Daime church as well. He explained in detail about kambo, about its mythology, and its effects, and impact on his, and his helpers livesall very positive stuff.",
  "Apparently the gift of kambo was received during an ayahuasca vision a shaman was having, where the arms of the great spirit showed him the Kambo frog (Phyllomedusa bicolour), and that frog in particularthere being many, many different species of tree frogs in the Amazon.",
  "He then sang some kambo medicine hymns, which opened with The Kambo frog will kiss you My hair stood on endthis was exactly what happened in my dream! This was very positive though, it felt very right for me to be there, then, at that corner of time and space in the world.",
  "A quick note on kambothe frog is not harmed in any way during the extraction, only mildly stressed for a very short amount of timeit is thought of as extremely bad form to harm the frog in any way, and will bring wrathful intervention from the animal spirits. Harvesting kambo is arguably much more sustainable than harvesting and destroying ayahuasca vines.",
  "The guy prepared the frog secretions for each person, and while this is going on, we were instructed to drink 2 litres or more of water down, to produce a deep cleansing purge. He then burned us, seven times, on the arm for men, and on the leg for women. It is only momentarily uncomfortable, then stings mildly.",
  "Many people went on Saturday, until 7:30 in the morning, and there was much vomiting and groaning during this time. Sunday was my day. After a little sleep, I woke up and fasted before hand. However it turns out we were able to drink some Brazilian Santo Daime ayahuasca during this time. I have never drunk ayahuasca during the day before, and I heard the Indians believed it was very bad to do so (similar to the Mazatec with mushrooms). We all had 3 glasses of this ayahuascathe mildest tasting, least fowl Ive ever hadand it was such a positive experience. The brew was almost all caapi I think, with maybe a touch of chakruna, but it was an important experience for me.",
  "Before this I had been seeking spectacular visions of the ayahuasca serpent I thinkbut I dont need visuals or visions to be embraced by the essence of the plantit was a very warm, peaceful, nurturing, nourishing experience. I actually caught up on sleep by closing my eyes and going into trance, and felt much more awake after the ayauasca. It was a beautiful day as well, and I was sitting next to my ethnobotanical friend, and he remarked on how beautiful everyone looked from the ayahuasca. And it was truethe energy unique to everyone and what made them special was visible.",
  "Then came the evening, and the time of the kambo ceremony. I was in no rush, content with the ayahuasca afterglow, not having encountered ayahuasca for some time. People went before me, and some people left, and some new people arrived. I was a bit apprehensive I must sayseveral people had passed out and collapsed as a result of the kambo, and almost all sounded like they were in agony. However this amazing girl went before me, and just laughed and smiled, then she would purge, and carried on laughing and smiling! She had such a beautiful, positive energy, it was great for me she went beforeapprehension was replaced with respect for the medicine.",
  "So I drank my water, got burned, had the venom administered, and then sat down on a couch, clutching a bucket to purge into. I felt the kambo within seconds. I tried my best to smile during the experience. I didnt want or hope to out do the girl before me, but I loved the way she had handled herself, in a way where full grown men had crumpled in groaning, nauseated agony. A heat rose to my head, and my heart rate went up. It wasnt unpleasant really, just odd.",
  "This feeling grew in intensityI focused on breathing, and this was a great anchor. I felt electricity surging into my handsmy gut was being twistedthe guide sang to me and shook his rattle. I purgeddeeply and cleanlyrepeatedly, all the water I had drunk.",
  "My eyes were glued shut, my throat was a bit swollen, and my gut was still being twisted. I didnt have any visions, as such, although I hear these may arise the more one works with kambo. I finally purged again. This time it came deep from within methe ayahuasca from earlier in the day, and stomach bileit felt like the kambo had gently squeezed all the impurities out of my liver and I was purging them.",
  "There was no trace of fear or anxiety during the experience. The experience, while very intense, was not as intense as I expected after observing others go through it. I had given myself over to the kambo and trusted in its power. The main period of intensity lasted only ten minutes. Then I could open my eyes, and my swollen throat began to recede. It was amazing being supported by all these people, all willing you on, while you are so vulnerable.",
  "I had some good chats with people when I was back, and connected with some more great people. One guy ran an ethnobotanical company here in the UK, and two Irish girls had had two kambo ceremonies, one on each day.",
  "Later in the night, we experienced these eye drops, and extract of a plant used by the Matses I thinkit was painful, but only for a minute or two.",
  "Later, we slept, and on waking, I realised how good I felt. Clear, strong. We moved furniture around and packed up and cleaned up. I said my goodbyes to everyone and headed down to Brighton with two of the kambo helpers and the shaman hosting it. He gave myself and one of the kambo guys a card readingnot that I go in for some of these thingsbut it was weird. We both picked the same cardTemple Gatesand everything that was said had been on my mind, and was true to my life, since the Iboga ceremony. The other guy had also encountered Iboga in June, around the same time as meand he will be meeting it for the second time this coming weekend, the same as mestrange coincidence maybe.",
  "I was quite emotional on saying my final goodbyes in Brighton and leaving on the train, and I dont usually get emotional like this. I feel so lucky to have experienced that couple of days, with those peopleits not something I will ever forget.",
  "I can feel the kambo now still half a week later, and I have only had the one ceremony. Apparently it gets deeper with future sessions. Likely the ayahuasca is contributing to the afterglow, but I feel incredible clarity, and power in my body. The days following I had less desire for sleep or food, likely why the Matses use it prior to going hunting. I feel deeply cleansed by the experience, and despite its intensity, and compete lack of recreational qualitiesI would very much like to meet it again. Its strange to me, as part of my mind thinks a venom is a defensive poison, best avoided at all costs. Yet the state of mind and body I feel now, I can only conclude that Kambo is a powerful medicine.",
  "Viva la kambo!! :)</p>"
 ],
 "year": "2009",
 "id": "81833",
 "gender": "Male",
 "age": "24",
 "views": "18416",
 "dose": [
  {
   "time": "0",
   "amount": "3 glasses",
   "administration": "oral",
   "substance": "Ayahuasca",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "7 ",
   "administration": "transdermal",
   "substance": "Animals - Frogs",
   "form": "(extract)"
  }
 ],
 "submissionDate": "2010-07-08T07:00:00.000Z"
}
