{
 "title": "Pretty Weird",
 "author": "Brett",
 "citation": " Brett. \"Pretty Weird: experience with Gabapentin (Neurontin) (ID 8186)\". Erowid.org. Feb 10, 2004. erowid.org/exp/8186",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "140 lb",
 "report": "<p>I was really bored one night, and I really wanted some pot, or coke or anything that I could get my hands on.  Everyone was asleep or gone, so I was stuck at home, 1 am wanting anything to do to fuck me up.  I remembered that I had some pills of Neurontin that I had prescribed to me to help me sleep.  I took the pill which was 400 milligrams and poured it onto a piece of paper.  I was going to take more if it was good or not.  I then took a dollar bill and snorted it. </p><p>I was still really bored so I went out and ate something, I had a lot of mucus coming through my mouth that tasted disgusting, and I was having second thoughts on whether I should have done it.  A little bit after, I laid down in my bed, cause I got really tired.  I turned the radio on and was really getting into the music.  After a little while, I started to shake my head back and forth almost uncontrollably.  I knew I could stop shaking my head, but it felt so good I didnt want to stop. I did that for a while and was laughed for no reason a lot.  It was now about 2:30am. </p><p>I hadnt been sleeping good the past week or so, so this probably added to my high.  I then closed my eyes to go to sleep, right when I did this, I was in my friends house watching TV and such, I then remembered I was in my bed, so I sat up.  Thinking that was pretty weird but alright, I closed my eyes again.  Then was in my friends house again, but this time standing up, I remembered to tell my friend that I wasnt feeling good, so I started talking but then fell to the ground mumbling.  After this I realized again that I was in my bed about to go to sleep. </p><p>After that last hallucination, or whatever it was, I went to sleep.  I woke up the next morning feeling very tired and drained.</p>",
 "year": "2001",
 "id": "8186",
 "gender": "Male",
 "timestamp": "2004-02-10T08:00:00.000Z",
 "views": "27301",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "400 mg",
   "administration": "insufflated",
   "substance": "Pharms - Gabapentin",
   "form": "(powder / crystals)"
  }
 }
}
