{
 "title": "The Other Side",
 "author": "Jbo",
 "citation": " Jbo. \"The Other Side: experience with LSD & Cannabis (ID 81907)\". Erowid.org. Dec 9, 2013. erowid.org/exp/81907",
 "substance": "LSD & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " repeated",
   "smoked",
   "Cannabis",
   "",
   " T+ 0:00",
   "0.5 hits",
   "",
   "LSD",
   "(blotter / tab)",
   " T+ 0:20",
   "0.5 hits",
   "",
   "LSD",
   "(blotter / tab)",
   " T+ 0:50",
   "1 hit",
   "",
   "LSD",
   "(blotter / tab)",
   " T+ 1:30",
   "1 hit",
   "",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>October 4, 2009 at about 10 o clock I awoke from the most intense night of my life, not able to remember the last 6 hours of my life, I felt empty and as if something had left me. I couldn't grasp any normal thoughts, my mind felt like pudding and it seemed that I needed to mold it into something new.</p><p>I woke up on October 3, 2009 just like any other day, my friends parents were out of town and there was going to be a party that night. We had to pick up one of my friend's brothers, so we drove with his other brother and began smoking in the car. I was feeling pretty comfortable, and we continued smoking after we picked his brother up. We were driving around until about two and came home about two thirty. We hung out for awhile and then around four we went out and smoke with a guy who was selling some bud. We sat and smoked casually for awhile. Then at about 6 a guy showed up with a bong, two giant jugs of liquor, about 300 dollars for weed, and acid. Me and him smoked for about an hour talking about weed and how he had taken six hits of acid, it made me a little uncomfortable at first but I became fine with it. He promised to match me for whatever he smoked, and offered me a cigarette and acid. I declined both but told him I would talk to my friend about the acid, and I might take him up on it.</p><p>On October 3, 2009 around seven to eight o clock I took three hits of acid which was red on one side and white on the other. The first hit my friend and I did together when we where at a party and a kid offered it to us. My friend had been wanting to do acid for awhile, but I was apprehensive because I had read about it and knew how it could fuck people up. I knew about how people could get bummer trips and how they saw people decompose and thought bugs were eating them and under their skin. My friend eventually talked me into it and we took the hit in the bathroom, the kid had left two hits beside the candle. We ripped the small piece of paper in half and stuck the other half in out bags of weed.</p><p>About 20 minutes later we decided to take the other half hit. Then maybe another twenty to thirty minutes we asked the guy who had brought the acid for another hit, we had no idea what this entailed. He told us to chill and wait for the trip to come to us but we were too impatient by that point and insisted on another. He gave it to us.</p><p>After an hour and a half or so of smoking massive amounts of chronic I begin to feel a slight tingling around the edge of my vision and mind, I take no real notice of it and just think it is the many bowls of chronic that I have had. The guy who had given us the acid was sitting across from me and we were discussing about him matching me for what he had smoked with me earlier. Everyone thought I got a little too much but he was fine with it and we continued to smoke. Ten minutes later the guy was pretty messed up because he had taken six hits of acid and was really aware of anything. His little folded up gold foil that held his twenty five hits or so of acid was right in front of me. Everyone was extremely high and no one was paying attention to me so I unfolded it and took out another hit and stuck it on my tongue. After a few minutes of trying I got my friends attention from the opposite side of the table and stuck out my tongue to show him the little tab. His eyes bulged and he tilted his head and gave me a strong look, questioning where I got it from. I asked him if he wanted one and he smile and nodded. Another poor decision on our part.</p><p>We continued to smoke ridiculous amounts, I was clearing bowls in 3 or 4 hits which were massive and I am still unsure how my body and lungs were able to keep up. My friends and I continued to smoke one of the older guys who had also dropped acid I remember talking to, his eyes were buggy and completely dilated. I remember talking to someone else and he was just watching me and I could tell he didn't approve of me taking the acid. My friend's older brother thought we were idiots but didn't do much of anything else. The kid who actually gave us acid got lost in the kitchen for about an hour, and the kid I was talking to began to have a conversation with one of the dogs.</p><p>I began losing track of time and I don't really remember much more around this time, this is when the world I was currently was peaking and the magic was getting strong. I sat down with the older kids, ate some pizza and they began to leave and go home.</p><p>Finally the party wound down and it was just me and my friend, things were picking up now and I could see and feel the magic of the world around me. My friend was just staring into space while we were smoking and kept repeating 'I have no idea what is going on right now'. This was just the beginning though, I had no idea what the night had in store for us. My friend and I went to finish up the weed. When we were smoking all of a sudden we burst out with hysterical laughter and I dropped my favorite piece, the brown bubbler that I have bought in Mexico. When the piece shattered to the ground I felt like part of me was lost and all of my memories getting high with my close friends were gone. Part of me fell to the ground and broke that night along with my bubbler. My friend gaped at me and just said, oh no you didn't just break your bubbler. I was extremely disappointed but I was willing to accept the fact, and felt like it was a good time for it to end and I would get a bong soon to show my experience with smoking. I cleaned it up and chucked the remains into the woods.</p><p>I told my friends what had happened but there wasn't much of a reaction from them because of the gratuitous amounts of bud that had been consumed earlier, and they weren't heavy weights like my friend and I. I didn't really have a clear emotion or reaction about it at the time either because I wasn't sure what I was thinking now. I planned on going to bed soon, because it was around twelve and had been tripping for several hours. When I was walking down the stair to try and fall asleep my friend asked if the acid was all weird and fucking with me. I responded no and he became tense and said it is with me. I told him to just try and sleep it off and he went into a closet full with blankets and tried to sleep. I slept outside on the couch for a little but I was worried about him and his words were starting to get to me.</p><p>I got up and asked if he could sleep. He said he wasn't going to be able to sleep and asked if he got a bummer and if he was fucked up and if he was a fuck up. I tried to find his older brother who had some experience with acid. I took me five minutes or so to realize that he wasn't home. We went up into his room and lay down and I tried to make sure he wasn't going to do something stupid like jump out a window.</p><p>This is when the transition period began, right around two o clock. I felt like I was being nudged out of this world and was stuck in between planes. It was although the world around me was like the black and white static roar when you turn on a tv with no antenna. My friend was still acting strange and uncomfortable. He seemed pretty immobile though so I left to try and sleep in the closet. His word of 'am I a fuck up' kept ringing in my head as I sat in between two strange worlds. I went back up to check on him and he was still scared, I laid down and acted like everything was fine to try and calm my own nerves.</p><p>I remember getting up and looking at my friend in the dark room and then the acid turned on me. It was only for a few seconds, but my friend grew fangs and claws and seemed to snarl at me, his flesh decomposed and I saw bubbles under my skin like something was underneath them. Some survival instinct took over and shut it down before I could react though, I remember reading about how fucked up people got on bummer trips and I think that implanted whatever saved me into my brain.</p><p>I laid down beside him and told him we need to just roll with it, he replied after a few silent seconds of tripping 'this sucks.' I am not sure how much time had passed, I think it was an hour of so, but even when I closed my eyes I could still feel the static around me. It was like the craziest party that you could ever imagine and it was on a roller coaster.</p><p>Finally I emerged into the passage to the other side. It was being flown along with thousands upon thousands of images and sound and scenes from the world. Knowledge was being poured at an astounding rate into my brain it felt like my eyes were wide open and everything the world had to offer, all experiences, weather they be painful, miraculous, or boring, flowed into my mind and remained branded there. I saw everyone I have ever cared about, know, or loved. My entire life was dissected before my eyes and shown to me from a different view point. During this time, the trip had become so intense that I clung to the side of the bed and had to tap it to remind myself I was still really in this world. I became an individual who was able to understand everything and was granted access to the other side. I remember a world around me with mountains to my left and a stream to my right. Then I was running through the world exploring as much as I could with my limited time. The other side is impossible to describe in other words, it is the essence of peace and beauty, I can see why some find it so enticing and want to go back but at times it seemed eerie and surreal.</p><p>I remembered my friend and the thought threw me back into the static dimension which allowed me to come back and grasp reality for a few brief moments. His breathing was ragged and sounded awful, it scared me a little but he seemed to be okay now. I glanced over at the clock I am pretty sure it read four-twenty one. I moaned and looked out the window and saw a light cresting the horizon. I looked back at my friend and he hadn't moved. I decided to crawl back downstairs and into the closet.</p><p>Before I closed the door though I remember my vision became swirly and certain colors were out of place. I remember looking down and saw that the blanket that I had over me had morphed with my body. The fabric of my being had combined seamlessly with this blanket, my skin, muscles, bone structure, had all been changed and I became a unique creature. I wasn't able to tell if I was uncomfortable with this or awe stuck by it. When I went back to being displaced in the limbo static world, the time I was there decreased each time I went to the other side; I had to put my hand on the nearest wall so I would know I was still real. Then I shut my mind down and re entered the other side, not sure if I would be able to make it back or not.</p><p>Six hours later my mind snatched a brief moment of opportunity for thought and heaved itself back into the real world. I felt as if I had been reborn and had a second shot at life. I went up and woke my friend, he didnt say much.</p><p>Later that day I went to a baseball game, I had about four hours to examine and lay out my life, try and mold who I am, who I used to be, what part of me got left behind on the other side, and who came back.</p><p>I realized that I had to be an extremely emotionally strong person to endure the 6 hour trip in the closet, I thought I should slow down on the drugs, stop smoking until I get my bong; let my crazy high tolerance go down. It seemed like the right thing to do.</p>",
 "year": "2009",
 "id": "81907",
 "gender": "Male",
 "age": "14",
 "timestamp": "2013-12-09T08:00:00.000Z",
 "views": "489"
}
