{
 "title": "Not a Good Combination!",
 "author": "NiNe",
 "citation": " NiNe. \"Not a Good Combination!: experience with Nitrous Oxide, Cannabis & Alcohol (ID 820)\". Erowid.org. Sep 18, 2000. erowid.org/exp/820",
 "substance": "Nitrous Oxide, Cannabis & Alcohol",
 "bodyweight": "170 lb",
 "report": "<p>I live with my girlfriend, her brother,'Scott' (not his real name) and his girlfriend. Well one night I got to come home early from work and there was a little 'get together' with some other mutual friends. My girlfriend and our mutual friends were all drinking, because they dont do any other drugs. They gave me a large 'big gulp' size cup full of Southern Comfort and soda. After drinking half the cup inside half an hour, I started getting a buzz, which was fine even though I hated alcohol. I wanted to smoke some weed,to get a 'good,proper buzz' that only weed can give, so I asked Scott if he wanted to go in the bedroom and smoke some, he said 'Sure!' and his girlfriend wanted to smoke some too, so she came with us. After smoking about 2 bowls we started telling his girlfriend how we did whippets for the first time a few days earlier. Then I got the 'Bright Idea' to try whippets and weed at the same time! Scott is the type of person to try anything,so he offered no resistance. I went into the kitchen and got about six cans of whip cream.</p><p>All three of us got two cans,and we would take a toke off my bong, hold it in, then without exhaling the smoke, inhale a whippet! I dont know how long we did this for, I'm guessing about a half an hour. The high was different. It was very enjoyable, we were all attacked by the giggles numerous times, even though I still don't recall what was so funny!</p><p>Then I goot into the second stage of my high, where things were still cool but I got something that I could only decribe as 'tunnel vision'. Instead of seeing everthing in a normal 'panoramic view', everything seemed to look as if it was on five different T.V. screens (if that makes any sense). The ceiling was in one screen,everything to the left of me was in another T.V. screen, my legs, feet, and the floor were a screen on the bottom and so on. I went to the bathroom to take a piss and then everything changed! I was happy at first then i turned around to wash my hand and looked into the wall size bathroom mirror. I looked at myself for a few seconds and everthing was o.k. until I noticed something....</p><p>My 'tunnel vision' was gone but in the top left coner of the mirror was a 'buffalo' headed man sitting in a booth above a 'stage' that looked like my bathroom. He was trying to control every single movement that my reflection made to match mine! I remember trying to move my arms and head faster then my relection to show this creature he could'nt keep up with my movements! When I failed to out move the 'clone' in the mirror i started getting angry and cussing the mirror! Scott came in the bathroom, and I tried to explain to him what was happening he tried to get me to calm down, and sat me on the toilet seat to relax. I got calm,and then everthing started spinning! well throwing up has never bothered me, so I welcomed the opportunity to puke, and get out of this now disturbing state of mind.</p><p>After I finished puking and dry heaving, I thought the next logical step is to sleep, so I went to bed. I couldn't sleep. I started to get what seemed like a migraine, but it started to get worse and worse, I wanted to go to sleep so bad I even prayed to god to let me sleep. My head just got worse, I just knew I was going to die. My brain actually felt like it was</p><p>swelling and pushing to break out of my skull. It was the worse pain I have ever felt in my life. I dont know how I managed to go to sleep or pass out, but I finally did. I'm not sure how long I felt the pain, but it felt like an eternity!</p>",
 "year": "2000",
 "id": "820",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-09-18T07:00:00.000Z",
 "views": "9972",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 }
}
