{
 "title": "Event #3",
 "author": "Kakkler",
 "citation": " Kakkler. \"Event #3: experience with JWH-018 (ID 82033)\". Erowid.org. Feb 15, 2010. erowid.org/exp/82033",
 "substance": "JWH-018",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "3 mg",
  "oral",
  "JWH-018",
  "(powder / crystals)"
 ],
 "report": "<p>This is the third time I've experienced JWH-018. It is a white, off-white powder. I am against smoking, and since my vaporizer is broken, the only other option was to eat it. I used my vaporizer spoon to dish out about 3mg's worth and put it on my tongue. I rubbed it along the roof of my mouth and it tasted slightly of whey protein powder. It was gritty and seemed to take about 20 seconds to fully dissolve. I swallowed and chased it with 8 oz water.</p><p>It took about 2 hours to take effect, coming on slowly over a 20 minute period. First I noticed a slight pressure headache in my frontal lobes, which lasted about 5 minutes. Next came a warm feeling that slowly flooded my brain and shoulders. I was watching TV and it was on a commercial. I was really getting into the new product advertised when I realized I was high, since I usually skip over commercials. The warmth continued to build and spread over my entire body, which once warm, began to feel numb. This took about an hour to manifest.</p><p>Once numb, I found my mind was open, like I was hacking into God's computer. With weed I would always write volumes of nonsensical religious-scientific rambling. This was no different. I managed to fill 3 papers, both sides, all in the first hour. I finished writing and went outside to work in my garden, getting lots of cleaning and organization done, but never actually getting to the garden. I began to get sleepy-tired and went inside.</p><p>The whole of the high lasted about 4 hours, which around hour 3, began to taper into the stone. I slowly build up on the munchies, able to resist at the start during TV, but after coming in from the garden, proceeded to consume 3 large bowls of cereal (I think I only chewed each bite once or twice). About hour 3.5 my eyes started feeling heavy and upon looking in the mirror, saw that red eyes were present (which was relieved with Visine). The high was pretty much worn off by hour 4 and by hour 4.5 I was full-on stoned. I tried writing again but came up blank. I lay down and was almost instantly asleep. I woke up 8 hours later, still feeling tired and a little bit stoned, I tried to remember my dreams but could only gather bits and pieces, it still felt like I was dreaming.</p><p>The day after, at 24 hours after dosing, I noticed a little bit of irritables and annoyance which lasted 10 minutes, if that. There was a very brief desire to do it again (not the full blown fiending I used to get with real weed) which was easy to resist. Each successive event involved the headache prior to onset, the hypomania of working on projects and starting ones I'd never finish, writing of sci-fi-philosophy papers and sending max-ed out text messages to my email, slow stone onset, deep 12-hour sleep required to become rested.</p><p>I have since finished my experimentation (Same dosage used each time, a picture was taken, then sent to my email vault of trip reports):</p><p>- Once every 5 days is mindblowing.</p><p>- Once every 3 days is ok.</p><p>- Once a day just makes me tired.</p><p>- Full stomach and no physical activity prior to dosing took 3 hours to take effect.</p><p>- Virtually empty stomach, 8-hour activity level (working outside with plants) took 90 minutes to take effect.</p><p>- Empty stomach and no activity level took 2.5 hours to take effect.</p><p>- Full stomach and high activity level took 100 minutes to take effect.</p><p>I had done research off and on since March 2009, when I had to quit weed for work. I'd read all the reports I could find, but didn't purchase any until Sept. 2009, it arrived within a week, in a small plastic ziplock bag, labled with 'Not for human consumption'. It cost $72 for 1 gram.</p><p>Final conclusion: it is a very effective substitute when I want to get high but not fail a drug test. Still requires a day to recover from and full energy is not back for 2 days. Still produces red eyes, munchies, hypomania, and the belief that what I'm writing is scripture. Most efficient method of use is to dissolve it on my tongue and wait 90 mintues to 180 minutes, depending on activity level and stomach contents.</p>",
 "year": "2009",
 "id": "82033",
 "gender": "Male",
 "age": "29",
 "timestamp": "2010-02-15T08:00:00.000Z",
 "views": "10255",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 mg",
   "administration": "oral",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  }
 }
}
