{
 "title": "No Regrets, Occasional Cramps",
 "author": "PsychadelicDrop08",
 "citation": " PsychadelicDrop08. \"No Regrets, Occasional Cramps: experience with Morning Glory (ID 8204)\". Erowid.org. Jul 13, 2004. erowid.org/exp/8204",
 "substance": "Morning Glory",
 "bodyweight": "150 lb",
 "report": "<p>I talked to a good friend two days before experimenting with Morning Glory seeds.  He was explaining to me about Morning Glory seeds and the affect they can have on person.  I started to think about trying them.  I just moved from somewhere and, well I didn't have any access to marijuana so I thought I would try something new.  I started doing research about the seeds and read a lot of the experiences and decided that I would try it.</p><p>I bought 12 grams of Heavenly Blue Morning Glory seeds and 3 grams of Flying Saucer seeds.  When I got home I went to bed early to rest for tomorrow's adventure.  I woke up the next afternoon well rested and starting the day by crunching up the seeds.  I didn't have a blender in the house so i kept the Morning Glory in the packets and took them to the garage where I crushed them up with a hammer I had lying around.  After that I emptied the seeds in a glass and poured some water in it.  I quickly drank the glass of water and it tasted horrible.  I had something light to eat so I would have an empty stomach and went to my bedroom.  I took the seeds at about 1:35pm.  After about 25 minutes, I started to feel the effects of the seeds.  I was starting to feel a little light-headed so I lied down on my bed.  I started lookin at tha fan and noticed how awesome it looked just spinning round and round.  It was amazing.  I called my ex girlfriend to say whats up and no matter what was said, I couldn't stop laughing.  I was laughing hysterically.  After I got off the phone, I noticed I wasn't feeling well, my stomach started hurting.</p><p>I tried to get up to move around, but I was feeling really sluggish and lazy.  I eventually got up and wondered the house and fell down after a little bit because my legs were cramping horribly.  I got up and walked over to the couch and watched tv for a bit.  About an hour and half into the trip, I was starting to laugh at everything and nothing that happened around me.  The tv was funny, the couch was funny, it felt like I had just smoked a crapload of good weed.  I was really having a blast.  It had the same effects weed had, I was extremely hungry.</p><p>I went out and got some food after a little while and the food tasted amazing.  I would just hold in in my mouth for a few seconds, then chew it, and swallow.  I took my time eating it all.  I was starting to come down and I went outside to have a cigarette.  I stared at the smoke and watched it swirl and the wind and it looked amazing.  I was awed by the sight of it and had another cigarette. I went back in and my legs still were cramping a little bit.  I went to lay down and watch tv and listen to some music.  I lied in my bed listening to a song that was four minutes and it seemed to last hours.  The feeling was almost undescribeable.  When I was coming down, I was just looking back on the experience I just had and was realizing everything. </p><p>After the expierence everything seemed toned down and very mellow to me.  I have no regrets in taking the seeds.  The only problem I had with them was the leg cramps and the occassional stomach cramps.</p><p>All and all it was an awesome and beautiful thing.</p>",
 "year": "2001",
 "id": "8204",
 "gender": "Male",
 "timestamp": "2004-07-13T07:00:00.000Z",
 "views": "8727",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ]
}
