{
 "title": "The Orgasm Engine",
 "author": "WaterIntoGold",
 "citation": " WaterIntoGold. \"The Orgasm Engine: experience with 4-Methoxymethcathinone (Methedrone), MDPV & Cannabis (ID 82094)\". Erowid.org. Aug 31, 2010. erowid.org/exp/82094",
 "substance": "4-Methoxymethcathinone (Methedrone), MDPV & Cannabis",
 "bodyweight": "65 kg",
 "report": [
  "<p>10:55 400mg Methedrone and 20mg MDPV consumed, half in gelcap and half in a glass of water. The sound of Sphongle is filling the room and my dog is resting in the hallway.",
  "11:10 Feeling somewhat energetic, doing small things I have been putting up.",
  "11:20 A familiar tingling feeling begins to spread throughout my body. Going to watch the latest episode of True Blood. Dog is now resting in the kitchen.",
  "11:30 No way, feels to damn good, cant watch tv now, saving that for the comedown.",
  "11:40 My dogs fur feels so incredibly soft, I think I am making him nervous with my moaning though, so I'll leave him alone.",
  "11:45 Friend called, no problem talking to him and I'm fairly confident he didn't notice anything out of the ordinary.",
  "12:00 With some effort managed to roll a joint. Slight jaw tension, 150mg magnesium ingested. Love that time is moving so slow, my mind is completely normal and my coordination is fine, this whole thing was written without having to correct any spelling mistakes (and I write fast too). My vision is somewhat blurry though, and my short term memory isn't super.",
  "12:05 Realized I havent eaten breakfeast yet. Bowl of cereal eaten without problem, tasted great. I am pretty easily distracted, haven't gone out to smoke my joint yet. Also writing on this report diminishes the effects greatly.",
  "12:12 Going to go sit in my tree.",
  "12:31 Joint was nice, I love my tree.",
  "12:53 Masturbation is great, and even though I can't get hard on stimulants I've found the perfect way around that: vibrator in my ass right this moment! Going to go take a bath, think the effects are on their way down now.",
  "13:23 SHIT OMG FUCK! As I lied down in the bathtub I took a hit from my bong, and its effects where greater than I ever could have imagined. It crept up on me almost unnoticeably, my first intention had just been to chill out with a cup of tea, but as I lay submerged in the water I suddenly noticed I was moaning quite a bit. More than quite a bit actually, it felt so great. For a moment I entertained the thought that maybe it actually felt too good to be true and it was just the weed tricking me, as I wondered about this the effects almost dissapeared. Realizing this I asked myself, does it really matter if the feeling is 'real' or not? What is the difference? This helped and refocusing on the wonderfull feeling made the effects return with full force. I could barely contain myself as I shakily reached for my vibrator.",
  "Finding my G-spot and pressing the vibrator against it sent waves and waves of intense pleasure throughout my body. Something about the feeling felt familiar, and then suddenly it hit me: this is an orgasm! It was as if I was an engine and the vibrator was the starter key, anytime I turned it I had an orgasm, and I kept orgasming until I let it go again. I had a couple of enervating engine failures as the vibrator died because of bad batteries and I had to shake it once or twice before I could continue orgasming. The only limit to the length and intensity was my own stamina, it was incredible beyond words. Totally beyond words, I'm writing this several days later and am getting hard just thinking about it. Easily one of the best half hours of my life.",
  "13:30 Only just found the strength to get up from my bed, enjoying the still lingering but diminished effects as well as recovering from a state of total exhaustion.",
  "13:36 My pulse is kinda high, but not uncomfortable in any way. 500mg L-thyrosine ingested with water.",
  "13:46 Got an sms that I'm answering, writing is fairly troublefree and my vision is returning to pretty much normal.",
  "13:56 Message answered, thinking about taking another bong hit, though I'd really just want to rest from the intense pleasure right now, it really depleated my forces. I don't want to let the moment slip though either, I wont be able to feel this way in a couple of hours. One thing is for sure though, I'm not envious of women sexually anymore. Ate some more cereal with some weed sprinkled on it, as well as some meatballs on the side. I'm a little shaky, and I have to go back and correct a few spelling mistakes every now and then. My tongue doesn't want to stay still either, I keep running it against the roof of my mouth.",
  "14:06 Alright, time to smoke up again, I'll do it for science! Thinking if I should go to a remote area outside so I don't disburb the neighbours, I don't think I was that audible but god fucking damn was it hard to keep quiet. On second thought going outside feels like not so good of an idea, it's coooold.",
  "14:48 I'm so totally NOT dissapointed! This one was equal if not greater in strength, though shorter, probably because I didn't smoke as much coupled with tolerance. I guess I must be getting the teqnique right. Also got a call in the middle of everything when I was lying writhing in bed. No problem at all to pause for a moment and talk normally.",
  "15:15 Effects waning down. Beginning to feel slightly uncomfortable, something a joint instantly cures, for now at least. Gonna take my dog for a walk, fresh air and light exercise does wonders for comedowns.",
  "15:55 Took a 5-htp and drank a cup of green tea a while ago. Pretty much no uncomfortability at the moment, feels good to just lie down.",
  "18:32 Still enjoying the effects. Met with some friends and was talkative and had fun. They kept complaining how cold it was, and I was walking in sandals. :)",
  "Epilogue",
  "The uncomfortability never returned, infact I felt cozy the whole next day, albeit tired. There was some trouble falling asleep though, but that was probably because I redosed too many times with weed, next time I will be wiser. The access to 5-htp, l-thyrosine, vitamins, magnesium and the likes really makes the experience much more smooth.</p>"
 ],
 "year": "2009",
 "id": "82094",
 "gender": "Male",
 "age": "18",
 "views": "22386",
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "4-Methoxymethcathinone"
  },
  {
   "time": " T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "MDPV"
  },
  {
   "time": " T+ 1:36",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": " T+ 2:28",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": " T+ 2:41",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Tyrosine"
  },
  {
   "time": " T+ 3:11",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": " T+ 5:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP"
  }
 ],
 "submissionDate": "2010-08-31T07:00:00.000Z"
}
