{
 "id": 8215,
 "title": "A New Euphoria",
 "date": {
  "submission": "2007-08-29T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "DayTripper",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "700"
   },
   "administration": "oral",
   "substance": "Pregabalin",
   "form": "capsule"
  }
 ],
 "report": [
  "Let me start by saying that I was rather excited to be legally given a sample bottle of lyrica by my doctor, the new wonder drug that supposedly feels like GHB, MDMA, and some type of painkiller feeling. I was rather excited by the thought of such a wonderful drug, but I was truely skeptical. I knew I had to try it to make an informed descision, so here I am.",
  "10:00 pm: 700 mg of pregabalin was ingested. I was truely excited to try this drug hoping that it would be differant than neurontin.",
  "10:30 pm: woah... I am starting to feel a slight benzo like buzz, best thing I could compare this to right now would be alprazolam. I am starting to think this may be something worth my time.",
  "11:00 pm: I have been getting higher and higher since the 30 minute mark. The benzo like feeling has faded and I now feel an absolutly electric sence of touch, everything I touch feels like the most incredible texture ever, especially my hair. The feeling is comparable to MDMA, with the slight sedation brought on by GHB. This is absolutly wonderful!!",
  "12:30 pm: This is really quite incredible the feeling has certainly peaked. I feel an intense euphoria with a slight opioid like body buzz. I am thinking this drug is going to be the next big thing it is only a matter of time before the CV is raised. This drug makes benzos look like childs candy and it somehow is on a lower schedule.",
  "I am enjoying this feeling so much I am going to have to stop this report. This feeling has stayed with me for more than four hours and has not declined in the least. This is probably my new drug of choice. To anybody doubting the effectiveness of this drug trust me when I say this works. I have done just about every common drug there is, and a good deal of rare types, so I know when something is working. good luck and stay safe."
 ],
 "erowid": {
  "id": "49212",
  "citation": " DayTripper. \"A New Euphoria: experience with Pregabalin (ID 49212)\". Erowid.org. Aug 29, 2007. erowid.org/exp/49212",
  "substance": "Pregabalin",
  "views": "36172"
 }
}
