{
 "title": "Two Days in a Row",
 "author": "barafundle",
 "citation": " barafundle. \"Two Days in a Row: experience with bk-MBDB (ID 82188)\". Erowid.org. Apr 29, 2010. erowid.org/exp/82188",
 "substance": "bk-MBDB",
 "bodyweight": "63.5 kg",
 "report": "<p>As I had tried mephedrone before and some other rcs I was interested in trying Butylone. So one day, whilst the house was empty, I had some breakfast, just a yoghurt and cup of coffee then proceeded to swallow 250mg. Instead of sitting around waiting for it to come on which I think can often have a detrimental effect, I walked the dogs instead. By the time I got back it had been just over an hour since id swallowed the Butylone and I wasnt feeling anything much at all. There was a slight increase in heart rate and appetite suppression, but this was it. I thought maybe putting some music on and having a look online for a while might help things along as I know set and setting can make a big difference, and with me music usually helps a lot, unfortunately I seemed to stay at this same state all afternoon. I was tempted to re-dose but declined as I didnt want to have to stay up late if another dose gave me a strong stimulating effect, so waited till the next day.</p><p>The next day I had breakfast again, yoghurt and coffee then swallowed 500mg this time. I did some cleaning for a while with the music up loud when I started to feel a pulsing in my chest different to the day before (which was expected as I'd doubled the dose) and I thought maybe this time Id feel what others seemed to have felt. After an hour I felt I was starting to peak and could feel sporadic tingling in my legs and cheeks which felt nice and I had a desire to do something creative or at least appreciate something creative. I put on some of my favourite bands and saw the songs in a completely different light. With other substances like this I often, if not always, want to talk to people and interact but with Butylone the opposite was the case, I felt much happier exploring my inner thoughts and basically analyzing my thoughts. I do think this would be a good substance to take with a girlfriend, as I could imagine lying in bed with her and exploring our bodies and minds without being overtly sexual, more sensual which leads me to also think this substance being a helpful tool with couples who may be drifting apart. Thats the other thing I noticed, with Butylone my libido was stronger than usual. But instead of thinking of just sex I was thinking of the more intimate side of things. Eventually, after 4-5hrs it started to taper off and eventually it had worn off. That night I slept well.</p><p>In conclusion I dont think this is something that would be good at a party but I do think it would be an excellent aid for partners and in helping couples, I think this is the main benefit. It did give me introspection as I said but there are other things like Mephedrone that I think are better for this.</p>",
 "year": "2009",
 "id": "82188",
 "gender": "Male",
 "age": "26",
 "timestamp": "2010-04-29T07:00:00.000Z",
 "views": "14018",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "bk-MBDB",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 24:00",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "bk-MBDB",
   "form": "(powder / crystals)"
  }
 }
}
