{
 "title": "A Dull Injection",
 "author": "CR",
 "citation": " CR. \"A Dull Injection: experience with MDPV (ID 82190)\". Erowid.org. Aug 31, 2010. erowid.org/exp/82190",
 "substance": "MDPV",
 "bodyweight": "150 lb",
 "report": "<p>I have no scale at the moment to weigh out chemicals accurately as the one I did have broke when dropped off a shelf and I simply cannot afford a new one at present. I use a knife to scoop out a small amount, its impossible to say how much it was it was just a little pile, at a guess it was anywhere from 5-10mg's. [Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active as such a small dose, eyeballing is particularly unwise. See related article] I then place this into a spoon and use a new syringe to add roughly 0.6ml's water to it and then mix. There is still very small amounts of powder not diluted but this will have to do.</p><p>10:20 - I take the syringe out my arm after injecting. I feel a little dizzy and sick.</p><p>10:21 - Feelings of dizziness and sickness continue. I would like to lie down but instead head to the bathroom to wash the injection site. While doing this the dizziness and sickness fade away. By the time I have finished washing the site there are some definite feelings of alertness and lots of energy, vision also blurs slightly but there is no sign of pupil dilation.</p><p>10:25 - I tide away syringes and everything in my room. There are still feelings of alertness and energy but they have not increased any. I decide I may as well get my teeth brushed, I accidentally spend nearly a whole 10 minutes brushing them, making sure I brushed them very well, this is definitly an effect of the drug. I also decide to get other little grooming duties done such as cutting nails.</p><p>10:40 - I find myself thouroughly dusting and hoovering my room, a job I had been putting off for a while. This drug has given me the energy and motivation to do this, and do it very well. I also clean the dishes and tidy any other little things that need doing. Feeling of alertness and energy are still the same, music also sounds better and I feel like dancing and singing along but there is only a slight elevation in mood and definitly no euphoria.</p><p>11:20 - Feelings still the same. My father returns home early as he does not have work today and stayed in a hotel last night as they had a meeting last night. I feel compelled to talk lots to him but I do not as I dont want to raise any suspicions.</p><p>13:25 - Effects stayed the same but have begun to fade now. Ability to focus was good as was the energy and motivation but there was no euphoria. The usual stimulant effect of cold hands and no diet was there but I experienced no jaw clenching or grinding.</p><p>In conclusion I found the effects of this very mild and not an ideal drug for recreational use, it showed great potential as a drug to be used for doing jobs and work that needs to be done. The lack of euphoria and the mild effects could simply be from the size of the dose but as I mentioned I have no scales and would rather start small. I will up the dosage slightly next time and hopefully there will be some more exciting effects. Its also worth noting that there was a slight urge to re-dose at times but I restrained and did not do so.</p>",
 "year": "2009",
 "id": "82190",
 "gender": "Male",
 "age": "18",
 "timestamp": "2010-08-31T07:00:00.000Z",
 "views": "7173",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "IV",
   "substance": "MDPV",
   "form": "(liquid)"
  }
 }
}
