{
 "title": "Good Fun Trip",
 "author": "Naboo The Enigma",
 "citation": " Naboo The Enigma. \"Good Fun Trip: experience with 2C-C (ID 82208)\". Erowid.org. Jan 10, 2010. erowid.org/exp/82208",
 "substance": "2C-C",
 "bodyweight": "16 kg",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "insufflated",
   "2C-C",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Tried for the first time last night. Had 125mg and me and my mate went through the lot doin 15 or 20mg lines, can't remember! Tracers looked fookin amazing, and there was loads of little particles zipping about - shiny stuff like tin foil looked cool and zippy aroundish too :-) . And swirly stuff around everything, sort of like smoke.</p><p>Everything looked as if it was breathing, and kind of organic. At one point a sock on the floor, looked like some sort of cute little creature moving about - although I obviously knew it wasn't! Kept getting the feeling of other people being in the room too, which I've experienced on other drugs like MDMA. Everything seemed small too, like when I looked at my phone it seemed about half the size.</p><p>Not much in the way of a head trip, but there was some cool thought patterns going on every now and again. No insights or anything, and I found communicating with my mate easy! It wasn't stimulating, but I didn't really notice the relaxation people talk about. There was never any anxiety at all. I think it'd be good mixed with a stimulant of some sort for going to clubs etc.</p><p>Left his house about 7 this morning, and felt dis-coordinated walking home. Although I had took a couple of valium to make sure I got to sleep, I'm not usually 'drunk' of valium. Feel great after sleeping all day! Looked at the bag before, and there is definately enough on there to scrape a small line off.</p><p>I had a 40x salvia trip earlier on too which, to be honest, wasn't my cup of tea - too intense, and just not really fun! A cool substance, and I will definately try it again, but probably bombing about 35mg rather than snorting cos it only seemed to last about 2 to 3 hours snorting it. I'm trying to get out of the habit of snorting stuff anyway.</p>",
 "year": "2009",
 "id": "82208",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-01-10T08:00:00.000Z",
 "views": "5208"
}
