{
 "id": 8220,
 "title": "'The One', 'The Everseeing Eye', and 'Sin'",
 "date": {
  "submission": "2006-05-02T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "panthrax",
  "gender": "Male",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Cacti - T. peruvianus",
   "form": "fresh"
  },
  {
   "time": "0",
   "amount": "1 oz",
   "administration": "",
   "substance": "Cacti - T. peruvianus",
   "form": "ground / crushed"
  }
 ],
 "report": [
  "Used: Peruvian Torch Cactus Cuttings boiled in 1 liter of water along with 1oz of powdered Peruvian Torch cactus.",
  "Method: Chew and Swallow.",
  "-------------------------------",
  "| Began Ingestion at 5:04pm    |",
  "| Finished at 5:19pm           |",
  "-------------------------------",
  "5:53pm - Notices lights brighter and such.",
  "6:21pm - Head begins to get tingly, moving aross shoulders.",
  "6:31pm - Notice a light sense of giddyness.",
  "7:02pm - Somewhat blurred vision. Altered state of mind definately present, series of goosebumps all over        body quite often.",
  "7:59pm - Christmas tree flashed red and then back to green (the tree itself/without the lights), floor        looked, and moved like water.",
  "8:37pm - Computer screen wavey, lining of anything straight edged is moving...",
  "9:22pm - Visuals are definately present now. 'Breathing Walls', colorfull patterns, yet my mind still        seems clear-headed.",
  "9:58pm - Very intense now. Pulsing vision (objects growing large, then small in a pulsing fashion.) Hard        to type, or make out what is being typed.",
  " -------------------------------------------------------------------------------------------------------",
  "[December 24th - The Next Day.] - This is where I was unable to continue updating the experience report live. So I am having to come back now and fill in the gaps.",
  "After my last entry, things became quite intense. I experienced what I would call a vision of sort. I saw three beings, or entities. One I understood its name to be 'The Everseeing Eye', and looked like a floating eyeball with eyelid turned on its side with a brownish-green aura around it. I understood it to be sort of the witness to the experience of mescaline. Like whether it is a good or bad experience, it is there to watch you.",
  "Another was what I understood to be, 'The One' and I understood it to be sort of like a judge over whether or not you will be blessed with a good or bad experience. It looked like some sort of Hawaiian ritual mask or something, a floating one that is.",
  "Then there was the last entity, the one I understood to be known as, 'Sin'. I understood it to be what 'The One' uses to grant you a bad experience if it deems you deserve it or not. 'Sin' looked like a completely black head with a cut in its forehead and one, red, menacing eye.",
  "These entities are what I understood to be the entities of the cactus. Before I had ingested the cactus, I said a quick Shamanistic Prayer, if you will to grant me a good experience and sure enough, I was given one.",
  "I spent the entire time after this vision drawing the entities and writing down everything I could remember from the vision before I was overwhelmed and forgot or something.",
  "After writing down everything I could remember, I put on some KoRn and listened to music for about 4 hours.",
  "The effects are still felt even as I type this. Mescaline is a very strong drug and should not be taken lightly."
 ],
 "erowid": {
  "id": "49236",
  "citation": " panthrax. \"'The One', 'The Everseeing Eye', and 'Sin': experience with Cacti - T. peruvianus (ID 49236)\". Erowid.org. May 2, 2006. erowid.org/exp/49236",
  "substance": "Cacti - T. peruvianus",
  "views": "3826"
 }
}
