{
 "title": "A Summary of a Short Period of Use",
 "author": "e-shm-n",
 "citation": " e-shm-n. \"A Summary of a Short Period of Use: experience with 5-MeO-DALT (ID 82249)\". Erowid.org. Apr 14, 2010. erowid.org/exp/82249",
 "substance": "5-MeO-DALT",
 "bodyweight": "200 lb",
 "report": [
  "<p>I have found 5-meo-dalt to be a rather unusual drug, hallucinogenic in only some aspects, lending itself to bursts of energy, though most likely not a good party drug.",
  "I usually take around 20mg, orally. Explaining its effects difficult. 5-meo-dalt is an incomplete trip - the user finds him or herself tripping in some ways, and not in others. Visuals for the most part are limited to a subtle alteration of relative perception of shapes and sizes - objects will seem to have subtly wrong and shifting height/weight ratios. I tend to feel very disorganized while on 5-meo-dalt; I have problems keeping my clothing neat and on correctly. Objects seen at night appear to have increased luminosity, and an associated interest and uniqueness which is hard to describe. Lastly, I tend to get very drawn into movies and media while on this substance. The first time I took 5-meo-dalt, I ended up watching the already trippy film 'Dark City,' and the combination of the drug and the movie blew my mind in a rather lot of ways and directions.",
  "However, many of the standard things I'd associate with a psychadelic are missing. There are no phantom colors, or serious visual distortions. No tracers, and I haven't noticed any CEVs. Vast ephiphanies are not shovelled into my head, and in many ways I'm not tripping.",
  "It has some non psychadelic effects as well. I notice tactile enhancement, and a pleasant body buzz that goes well with getting stoned. At higher doses (40-50mg, I haven't gone higher), this becomes a harsh energy - still pleasant, but lending itself to a feeling of edgyness. 5-meo-dalt also gives a strong energy, possibly as much as e, however the resembalence ends there. It's most definetely not an empathogen.",
  "I've experemented with other ways of ingesting it. Nasal insuffation is completely painless and very effective, it doesn't appear to be caustic, and causes absolutely no pain upon ingestion. I've also experimented with dissolving it in DMSO and absorbing it through the skin. I think that I've had a mild success doing so, however at best its a highly inefficient way of taking the substance. My biggest success was by dissolving approximately 25mg of 5-meo-dalt in 3 drops of DMSO, and applying it to an area in front of my armpit. I remember looking in the mirror of the bathroom, and feeling an abrupt 'ahhhhh....' of it kicking in, combined with pupils that I could actually see widen as I stared into my own eyes. I've attempted to repeat this with different areas of absorption, namely the wrist, and got few to no effects. This leads me to wonder if I could have touched a mucous membrane on my body (eyes, nose, mouth, etc) with 5-meo-dalt laced fingertips, absorbing it that way.",
  "Lastly, this seems like fairly safe stuff, with a big, major exception that **I would strongly suggest not using it in any overheated area, or anyplace where heat stroke is even a remote possibility!** I've noticed that 5-meo-dalt appears to raise my temperature, and causes me to sweat more than normal (which also makes it look sort of like I'm on speed). I've noticed no hangovers, or day after effects. Accurate measuring instruments must be used - the sample I have is compacted, and fairly dense.",
  "If anyone is still wondering, it's a fun substance. Definitely worth checking out.",
  "[Reported Dose: 10-40mg, orally, nasally, and cutaneous absorbtion (using DMSO)]</p>"
 ],
 "year": "2009",
 "id": "82249",
 "gender": "Male",
 "age": "26",
 "views": "9975",
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "5-MeO-DALT",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2010-04-14T07:00:00.000Z"
}
