{
 "id": 8225,
 "title": "Boring...",
 "date": {
  "submission": "2006-03-09T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Flow",
  "gender": "Male",
  "weight": 102
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-B-Fly",
   "form": "liquid"
  }
 ],
 "report": [
  "Subject is a healthy male, no meds taken for more than 3 weeks",
  "T+0:00 Ingestion of 10mgs 2C-B-Fly (powder solved in Water). BP 134/76 mmHg, HF 76 bpm.",
  "T+0:11 Ive got some tingling sensations in my feet. Is this already the onset? No, they vanish after approx. 1 minute",
  "T+0:24 Im at threshold. Skin-sensations all over my body. Within the next 8 minutes I rise to a good ++. BP 137/77 mmHg, HF 81 bpm.",
  "T+0:32 Colours are enhanced, not the same way as with 2C-E (which makes me see more colours), all colours seem brighter, even dark colours seem to glow a little. No change in the other senses. Communication with my sitter is no problem. BP 148/82 mmHg, HF 90 bpm.",
  "T+0:37 Im going down a little, only a weak ++ any more. Im a little irritated, was this all?",
  "T+0:44 Down to a good +. Colours are still brighter, but not so much as 10 mins. before. Im waiting, whats to come next? Got some leg tremor. Still no communication problem.",
  "T+1:02 No change yet. Still a good +. The leg tremor is almost gone, but now I have a little headache. BP 133/71 mmHg, HF 77 bpm.",
  "T+1:23 Still at +. The leg tremor came back, the headache is still there. This stuff is starting to bore me. I try to listen to music: not bad but also not satisfying. I turn on the TV  same effect.",
  "T+1:51 The stuff is still working, but no new effects. Im so bored! I feel the energy to do a lot of things, but nothing seems to satisfy me. BP 138/79 mmHg, HF 82 bpm.",
  "T+3:43 No changes so far. I dont like this stuff (at least not at this dose), I wait for something to happen, and I have the feeling that something could happen, but nothing happens! Im already thinking of combining it with some other substance at this point, but I want to explore this compound until the end. BP 132/70 mmHg, HF 69 bpm.",
  "T+4:02 Now Im coming down, slowly but unmistakeable. BP 128/71 mmHg, HF 77 bpm.",
  "T+5:13 Im definitely out!",
  "Summary and conclusions:",
  "I must admit, that Ive expected much more! Even without having found a single trip report about 2C-B-Fly, I thought, that this stuff would provide much more. Comparing it with 2C-B, 10mgs are much stronger there, I dont feel that the extra furanyl rings of the fly make the molecule more potent. Im definitely going to explore this substance further, but in higher doses (or maybe in combination with other RCs). Next time maybe 15mgs."
 ],
 "erowid": {
  "id": "49253",
  "citation": " The Flow. \"Boring...: experience with 2C-B-Fly (ID 49253)\". Erowid.org. Mar 9, 2006. erowid.org/exp/49253",
  "substance": "2C-B-Fly",
  "views": "19826"
 }
}
