{
 "id": 8231,
 "title": "Insufflating DXM Powder",
 "date": {
  "submission": "2001-12-28T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "DXMman",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "insufflated",
   "substance": "DXM",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "I have various drug experiences, most of which are from various illegal substances but lately I have a sparked interest in legal highs.  Feeling that drinking Robo was both disgusting and nauseating- I decided to try DXM in pure powder form.  I had heard many trip reports about DXM that told of the horror stories of simply getting the stuff down.  So I decided to order 55g of pure powder.",
  "Experience 1",
  "Insufflating ~200mg",
  "During my first trial a friend and I snorted the substance for a total dose of about 200mg each.  My friend, who has experience with insufflating many other drugs, complained of a strong pain from sniffing the powder, yet I did not feel much pain.  This method of dosing did not produce much of an effect.  It is possible that I felt slight euphoria but it could have been placebo effect.  It is to my knowledge that snorting is effective because water-soluble chemicals pass through the mucous-membranes quite well.  Although DXM is water-soluble it is not very soluble (it takes a lot of water to dissolves a little DXM).  This may be a reason why I did not trip and I experienced a large amount of drip.  I also think this is why Robotussin uses alcohol as means of transfer.",
  "Experience 2",
  "350-400 mg gel cal",
  "About 1 hour after downing my gel cap I started to feel as if I was getting a buzz from alcohol.",
  "About 1.5 hours later I noticed stomach discomfort and possible nausea.  I was surprised because I thought that much of the nausea related to DXM was from having to down bottles of the vile tasting stuff.  Apparently, that is not the only reason because a half-hour later I threw up.",
  "Once I vomited I think I lost a lot of the chemical because I started to plateau from then on.  I also noticed a strong chemical taste in my mouth after vomiting.  I felt more than just an alcohol intoxication - I felt very slow and disassociated with my body and I did have minor aural hallucinations but I did not get any visuals.",
  "On the other hand, my friend, who weighs about 30 lbs. less than me, had quite an experience.  She vomited as well but not until about 1 hour after I did, and she noticed no chemical taste in her vomit, I did.  This leads me to believe that more than the weight difference, my friend achieved stronger effects because she kept the stuff down longer.  She had many of the same effects as I but on top of my own she had outstanding visuals - she saw a blue dot that was dancing on her computer keyboard and saw glows around people's bodies.  She also saw trails of light and found dancing to be very interesting to watch but yet she felt too heavy of a body load to want to dance herself.",
  "A point I would like to bring up is this: it is very clear that DXM and alcohol combinations are dangerous!  But when taking Robitussin, one is also taking alcohol because that is the main ingredient in Tussin (is DXM more soluble in alcohol than in water?).  When drinking massive quantities of Tussin, such as a bottle or two, this amount of alcohol seems significant enough to pose danger.  Because of the other complications with Tussin (right brand, no other drugs in the syrup and facing skepticism in your local pharmacy) it seems that Tussin is not a safe nor price efficient method of consuming DXM."
 ],
 "erowid": {
  "id": "4929",
  "citation": " DXMman. \"Insufflating DXM Powder: experience with DXM (ID 4929)\". Erowid.org. Dec 28, 2001. erowid.org/exp/4929",
  "substance": "DXM",
  "views": "35320"
 }
}
