{
 "id": 8242,
 "title": "Low dose",
 "date": {
  "submission": "2007-01-11T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Adolfo",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>I had been planning on doing DPT on NYE for a while. I had DMT but had started getting worried by the reports of tolerance. I figured that by using an non-endogenous chemical I would just be supplementing rather than supplanting.",
  "As it got time I started getting a little scared and decided to go with a low dose. There are two comments in the big and dandy DPT thread about the recreationality of such amounts.",
  "At about 10:40 I insufflated 30mg divided into two lines. I'd never experienced a drip before and supposed it would feel like accidentaly breathing in water in the shower. Maybe it was because I'd spent most of the day outside or maybe it was because my nose naturally gets a little stuffy during winter but I ended up tasting DPT everytime I swallowed. It didn't burn so much as taste bad. I had a glass of water flavored with vitamin C to water it down.",
  "Anyway, by about T+:30 I was definitely starting to get alerts. I started getting cold and had to put on another layer of clothing. Watching MTV's new year of music was not markedly different and in fact seemed to be keeping me grounded.",
  "At T+:45 I returned from the bathroom mirror where I had the familiarly different view of myself I'd most recently gotten from a low dose of Salvia. I chose a different chair because it faced south although I couldn't see the TV as much. Listening, though, I got increasingly dark and hurtful beliefs.",
  "I usually listen to electronic music and am not very much into the popular music scene. Hearing interviews, I would fear they'd brainwash me and I'd want to be like them. They wanted to 'say' and not hold back. Hosts knew and enjoyed the display. They could use the others' bodies by worshipping them.",
  "Being inside a rap star's body singing their song for a while was fun and possible. The host in green explained that 2006 was going to be like 2005 except with a little more artist, which scared me as I already felt different from the artists. I thought I should go to sleep. There was minimal bodyload, some nausea but nothing too permanent.",
  "At T+1:30 I was coming down, although later that night I calculated that the experience had lasted a solid 2 hours. I shut off the TV a little before 12:30 and went to the computer to write a little about what was on my mind. During the trip while watching TV the prevailing train of thought was a 'there-for-me' reporter. When I changed to in front of the computer, however, I IM'ed happy new year holiday cheer to everyone and got some unexpected replies. I started identifying with a family who's advice was that I 'should' go to sleep. I ignored it a couple of times and wrote anyway, telling myself that writing a trip report was better than not writing one.",
  "They, on the other hand, were concerned with not talking. Saying as little as possible made me sound smarter. Stopping the desire to talk was difficult.",
  "Finally turned in and went to wash up before bed. Had involved conversations and good times. Felt like I connected to the idea of someone. Listened to some music before going to bed and had fun. Overall I thoroughly enjoyed myself although I see the possibility of depression given the underlying fear.</p>"
 ],
 "erowid": {
  "id": "49348",
  "citation": " Adolfo. \"Low dose: experience with DPT (ID 49348)\". Erowid.org. Jan 11, 2007. erowid.org/exp/49348",
  "substance": "DPT",
  "views": "7121"
 }
}
