{
 "title": "The Divine Comedy",
 "author": "Peter",
 "citation": " Peter. \"The Divine Comedy: experience with 5-MeO-DMT (ID 8244)\". Erowid.org. Jul 21, 2001. erowid.org/exp/8244",
 "substance": "5-MeO-DMT",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "15 mg",
  "smoked",
  "5-MeO-DMT",
  "(powder / crystals)"
 ],
 "report": "<p>Little did I know that I was just about to have the most remarkable few moments of personal reverie and revelation that I was ever likely to experience, today of all days... I'd clearly underestimated this material in its efficacy, thinking it may require a similar dose to DMT. How very wrong!</p><p>To smoke these magic crystals of 5-MeO DMT, I first roughly measured 15mg of said drug onto a small piece of tinfoil the size of a postage stamp, & wrapped the edges around the end of my pipe (i'd made it from 15mm plumber's copper pipe!).</p><p>I held the pipe with one end in my mouth and the 'bowl' facing downwards, the tinfoil wrapped around the bottom of the bowl. I heated the tinfoil and inhaled the vapours, 'bleugh! they taste rather cold and plasticky' i thought.</p><p>I shut my eyes and before I could sit back i could hear a humming in my ears, my body was readying for astral projection, getting lighter & lighter. It was then I almost panicked - my heart must be at around 120, my body was shaking & my vision had gone. I was seeing what could best be described as Dante's Divine comedy, during the chapter 'Inferno'. I was looking upon the depths of hell, the Icy fires which plaged the hideous realm, and staring lucifer in the face. 'My oh my, what a strange young fellow. Well welcome, death has embraced you. There is no avenue of escape'.</p><p>This continued... 'oh christ, I don't  want to die yet! My family'll be so disappointed to find a drug-filled corpse in my room!', this thought made me sneer. I stood up & talked myself through this 'Inferno', trying to encourage myself not to die: I'd be saying garbage like 'Do not die. Breathe, stay with the music & you'll be fine.' and so on.</p><p>My vision snapped. Back in my bedroom, pacing 'you'll be fine'. I sat down again. More imagery. The 'Purgatorio' that Dante described was so vivid, so brilliantly clear I could touch it, the labours of those with undecided fate watching me in absolute awe, someone of transcension reaching such a realm. Then it was gone. The fear of death had left me and I lay on my bed, where the effects had lost a bit of intensity by this time. Never in my life had I felt gladder to be alive, to be me and to be blessed with such an experience. I lay on the bed with a goofy grin permanently on my face, just wriggling, enjoying a featherlite body, enjoying my muscles glowing with energy. I was giggling, wriggling, and at moments laying down with just about the biggest smile I'd ever had. I'd reached the 'Paradiso' - the last in Dante's journeys in his attempt at purging, cleansing his soul. I was happier than I'd ever felt and the perma-grin I was displaying would show that. My soul had just had it's first orgasm and was satisfied in a way that nothing had ever touched it, and I'd been opened up to the every entity and stigma in the universe.</p><p>Events could have been a lot more terrifying if I'd panicked, but I was amazed that I hadn't. Keeping a level head in such a situation is a must - if you're caught with the fear of hades, keep a level head and the experience will pass.</p><p>Would I try it again? yes. To put it into Shulgin's rating, for me, I attined a +4 experience. Truly transcension.</p><p>Peace to you all, and remember, the mind can play just as much effect on the experience as the drug itself.</p>",
 "year": "2001",
 "id": "8244",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-07-21T07:00:00.000Z",
 "views": "17554",
 "dose": {}
}
