{
 "id": 8244,
 "title": "Beautiful Goodbye",
 "date": {
  "submission": "2006-02-14T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Xorkoth",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Piracetam"
  },
  {
   "time": "0",
   "amount": "T+ 0:00",
   "administration": "100 mg",
   "substance": "oral"
  },
  {
   "time": "Tryptophan - 5-HTP",
   "amount": "",
   "administration": "T+ 0:00",
   "substance": ""
  },
  {
   "time": "smoked",
   "amount": "Cannabis",
   "administration": "",
   "substance": "T+ 1:00"
  },
  {
   "time": "1 tablet",
   "amount": "oral",
   "administration": "MDMA",
   "substance": ""
  },
  {
   "time": "0:00",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol"
  },
  {
   "time": "0",
   "amount": "T+ 5:00",
   "administration": "0.75 hits",
   "substance": "oral"
  },
  {
   "time": "LSD",
   "amount": "",
   "administration": "T+ 0:00",
   "substance": "100 mg"
  },
  {
   "time": "oral",
   "amount": "Tryptophan - 5-HTP",
   "administration": "",
   "substance": "T+ 0:00"
  },
  {
   "time": "0",
   "amount": "smoked",
   "administration": "Cannabis",
   "substance": ""
  },
  {
   "time": "8:00",
   "amount": "5.0 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone"
  },
  {
   "time": "(ground / crushed)",
   "amount": "T+ 0:00",
   "administration": "10 g",
   "substance": "oral"
  },
  {
   "time": "Kratom",
   "amount": "",
   "administration": "T+ 0:00",
   "substance": "100 mg"
  }
 ],
 "report": [
  "I'd like to share with you an experience of beauty that I had recently, which I will always look back on with fond nostalgic thoughts.  The time was New Year's Eve Eve (the 30th) and the substances included MDMA, LSD, and the supporters, cannabis, alcohol, piracetam, 5-HTP, oxycodone, and kratom.",
  "We began the night by arriving at my friend Andy's house at about 5:30pm.  I had previously acquired each of the named substances.  Immediately I measured out about 800mg of piracetam for myself, Andy, and my best friend Brandon who was joining us on our journey.  I also gave each of us a 100mg capsule of 5-HTP to combat the MDMA side effects.  We smoked a couple of bowls of cannabis, and then 6:30 rolled around, the zero hour.  We each chewed and swallowed one Ecstasy tablet, which were yellow with red and orange speckles.  Strangely, they tasted kind of sweet, with a definite edge of bitterness but not as bad as I would have expected.  Now that I think about it, I believe there was definitely MDMA in there but there may also have been dextro-amphetamine, as that substance is the only sweet-tasting stimulant I know of.  We settled down to wait.",
  "After a few minute, Andy told us that some people might be coming over, perhaps a lot of them.  Considering that we were planning to trip later, I was a little perturbed with him, especially when he told me that a girl he liked was definitely coming and that he didn't want her to know he was on anything, even weed, because she looked down on activities like that.  However, there was no time to do anything about it, because at that moment, Andy's roommate and two girls came in.  Now, Andy's roommate is an awesome guy with much previous experience in psychoactives, and it turned out that his girl also had some experience with cannabis, but had an open mind about other things as well.  However, this other girl that Andy liked sat next to me, and there was a strange vibe in the air, as she could definitely tell something was up; by now, the rolls had begun to kick in.  I started to feel hot and cold simultaneously, with a strange alternation between a growing euphoria and a rather disturbing dysphoria.  I had forgotten to bring my CDs, and Andy's taste in music is, frankly, not at all close to mine.  He had in some annoying punk, which was very loud and was making me feel nervous.",
  "At about 7:30, (T+1:00), the pill kicked in fully and the dysphoria gave way to a nice euphoria, which, though nothing like my first few rolling experiences, was certainly the strongest I'd had in years.  Of course, I'd only rolled thrice in the last two years or so.  Andy changed the music to AFI (another punk band but one which is considerably better), and the music became quite powerful.  I moved with it, swaying back and forth, and couldn't help but rub my hands together in pleasure.  However, I was a bit disturbed, because the roll would fade and a slight dysphoria would creep in every few minutes, only to be followed by another wave.  This alarmed me; evidently, I'd forgotten than MDMA can come in waves.  I had a few drinks over the next few hours, which seemed to increase the positive effects, increase my sociability, and eliminate the dysphoric moments.  I actually had 5 or 6 drinks, which is usually enough to make me sleep, but in my current state it made me feel absolutely great.  Brandon and I continued in this state, each having a few drinks and chatting amongst ourselves and Andy's roommate and his girl.",
  "Andy, meanwhile, had obviously begun to roll very hard.  He was getting a little inappropriate with the girl he liked (not physically, but in the things he was saying to her), and she OBVIOUSLY had no interest in him.  It was pretty painful to watch.  In retrospect, that girl was a real bitch, and had quite a stick up her ass.  However, as the night progressed, it was obvious that Andy was embarrassed and feeling the vibes from her.  He just couldn't seem to stop making strange comments to her, and she was getting more and more bitchy.  Another guy, evidently an old friend of Andy's, arrived at about 9:30, and he seemed cool enough, synergizing well with our group.  This guy had also had a plethora of psychedelic experiences (or so he claimed).",
  "Finally, the girls left.  On her way out, the bitchy girl looked at me and was like 'Bye, you really kinda creep me out, but...' and trailed off.  I kind of raised my eyebrow, gave her a wry look, and said 'Ok, um, well, nice meeting you then...' and she left.  I shared a look with the remaining people in the room and they all commented on how she was kind of an annoying, prissy chick.  It seemed a weight had been lifted from the room as she left, and we all relaxed a little.  Andy proclaimed that he was rolling extremely hard and didn't care if that girl didn't like him; he was going to have fun tonight, dammit!  'Let's eat those psychedelics!' he shouted, and Brandon joined in this sentiment.  Due to a difficult come-up and some social weirdness, I had decided I'd save my LSD for a later time, but at my friends' insistence, I decided we'd do it after all.",
  "The time was 10:30 (T+4:00).  I handed out a few small mushrooms from three different strains (different varieties of cubensis) to Andy and Brandon, and then Andy's friend (we'll call him T since I don't remember his name) expressed interest.  Andy said, 'Yeah man, join on in!' so before I knew it I was giving this guy some of my fungus as well.  I'd never met him, but he seemed cool enough.  They each had between 1 and 2 grams each, probably more like 1.5, consisting of 5 or 6 tiny mushrooms each.  I ate my 3/4 hit of what was supposed to be very good acid that I had received for Christmas from a friend who had tried an equivalent amount.  He said it was sub-psychedelic, but very fun and warm-hearted, and a wonderful buzz.  How right he was!  I also gave each of us another 100mg 5-HTP pill.  The acid, contrary to previous low-dose trials, had no taste whatsoever.  This was how I had always heard it was supposed to be, yet most people I know claim that it tastes metallic, which is how it tasted the other times I tried it.",
  "With our drugs down the hatch, we went back to the chillin' room, turned on some more relaxed music (though I can't remember what it was), and Andy changed the light bulbs to colored ones, red on one side of the room and blue on the other.  After a while, my friends started to get quieter. This guy T started to geek out a little bit, saying he wasn't feeling the mushrooms but acting rather strangely, but nothing serious.  We chilled for a while longer, talking and just hanging out, until about 11:30 (T+5:00).",
  "At this point, I had a slight phase shift in my consciousness, but it basically just felt like the roll had come back a little stronger, but with more of a gentle, non-speedy feel to it.  Somehow, though I don't remember anyone saying anything about it, we decided to go turn on some Family Guy episodes.  They were hilarious as usual, and Brandon and I were having an awesome time.  I had kind of forgotten about taking drugs and was just enjoying myself, laughing a lot at the show, which is quite a psychedelic show, really.  We passed around a few bowls of home-grown skunky nugs produced by myself.  As the episodes progressed, T began to obviously struggle.  He was just occasionally mumbling things like 'Fuck, crazy' and 'scooby snacks'.  Andy, with the earlier bad vibes put in place by that bitchy chick, was dragged down by his friend, and both began to obviously get uncomfortable.  This culminated during the fourth episode we watched, when Chris (the son) joined a tribe of natives and felt like he belonged finally.  He started singing a cheesy song, which definitely was bad enough that we all felt a little embarrassed at watching it. ",
  "I'm not quite sure why the writers of Family Guy put that song in there, because even while sober I've always found it to be very... lame.  Brandon and I just kind of looked at each other as if to say, 'Why the fuck did they put this lame-ass song in here?'.  However, Andy and T started to try to sleep, it affected them so strongly.  For the rest of the episode, they remained that way, and when it was over, so was the DVD.  We tried to rouse Andy, but he wouldn't budge.  This saddened me because I was visiting home, and the next day I was driving back to the other side of the country where I now live.  I had really been looking forward to Andy, Brandon, and I having a great trip together as a goodbye.  But Andy was too far gone, so Brandon and I left him and went back to the chillin' room.",
  "Once there, everything was all good once again.  He and I were having a great time!  I loaded up my vaporizer, and he took a few tokes each and became much higher.  I started to become aware of the visuals.  They were subtle, but definitely there when I concentrated.  Due to the MDMA mostly, I would imagine, I was having some serious trouble keeping my eyes focused.  I was wide awake, but I could only stay focused through extreme concentration.  At any point, focused or not, I noticed a dramatic color enhancement.  Before, the walls had been awash in red on one side of the room, and blue on the other.  Now, however, every color of the spectrum was present, and instead of an abrupt change, the room went from deep red on one side, through light red, orange, yellow, and green, and then became blue and purple over on the side of the room with the blue light.  In addition, these colors were just so alive and vibrant that tears nearly sprung to my eyes.  I noticed no visual disturbances besides this enhancement of color and a strange blurry, fuzzy tone to everything, but whenever my eyes would unfocus, the entire room would come alive.  Objects in the room would start to move and become other things, with shocking detail and reality. ",
  "Unlike mushroom visuals, these looked very real; instead of being colored patterns and the like, they were full-on hallucinations, though I completely knew they were not real.  For example, I looked at the blue light lamp, and my eyes unfocused.  Suddenly, the lamp became a women in a flowing white robe holding out a blue lantern as if it were a beacon, and then her arms began to undulate and wave.  Another time, I saw a lamp that wasn't plugged in, and it turned into a large crank, which began turning.  Whenever I looked in the window, I'd see a faint reflection of the room, and it would start to 'zoom' - that is, it would seem to be getting closer and closer the longer I looked.",
  "During this time, Brandon and I started to talk, about everything and anything.  Over the next 6 or 7 hours, we had some irreplaceable conversation that was very valuable to me, and was a great way to say goodbye as I went back home and wouldn't see him again for months.  We talked about how Andy had given in to the Bad Trip, and we hoped he would be okay tomorrow.  We were pretty sad that he wasnt there to join us, and we felt that the night was close to perfect, but that Andy had supposed to have been with us, but that that guy had thwarted fate. ",
  "At maybe 2:30, we broke up a 10mg oxycodone and each snorted half.  Then I went and made us each a strong dose of kratom (10g each of a strong batch).  These substances brought us to an even greater state of bliss.  As opposed to usual, neither of us got at all tired from them, as we had planned, nor did the visuals decline.  In fact, since my visuals seemed to be brought on by my eyes becoming unfocused, the effects of the opiates served to actually enhance my experience.  I began staring at the blue Christmas lights that were strung up along one of the walls, and I noticed that, as opposed to before where there were only two colors, light blue and dark blue, now each of the hundreds of tiny lights was its own, unique color, in shades of blue, green, and even white and orange.  By unfocusing my eyes, I started to see double images of the lights, and each was surrounded by a halo of color.  These haloes, I began to notice, formed complex fractal patterns inside themselves.  I spent literally over two hours just looking at these with Brandon, who had similar visual effects but with less detail. ",
  "Surprisingly, despite the fact that he was on mushrooms and I was on acid, we were on the same general wavelength, though I believe my visuals were more striking and unique.  However, he did have some morphing and crawling effects without his eyes being unfocused which I didn't.  However, I'm certainly accustomed with those brand of distortions, and I definitely preferred the original kind I had.",
  "We ended up forsaking sleep and staying up all night, until I had to leave at 8:00 in the morning to get ready for my long drive back to North Carolina.  As we left, I gave us each a final 100mg 5-HTP pill.  Surprisingly, I stayed awake well enough to make the whole drive, though I passed out in a serious manner when I finally made it there.  I felt the acid lightly throughout most of the day, and it was very welcome.  Throughout the experience, I was surprised by the sheer level of joy I was feeling.  rarely have I been in such a beautiful state of mind, where everything was good and I was simply enjoying just being.  It has left me with the desire to get some more LSD and experiment with it.  To me, although I had a low dose, I can tell that lysergic acid diethylamide is a superior psychedelic, with amazing visual and emotional capabilities without the unpleasant physical side effects that most psychedelics produce.  Also, perhaps due to the 5-HTP and piracetam, neither of us at any point felt any of the depressed and empty MDMA hangover at all the next day.  Brandon reported to me that this experience made him no longer afraid of psychedelics, and he definitely wants to occasionally use them from now on, whenever I come home to visit.",
  "As the for the combination of MDMA and LSD, I give it three thumbs up!  It just kept getting better and better as the night went on, and I wished very much that it wouldn't end.  Looking back, it was such a beautiful experience that it brings tears to my eyes, mostly due to the beautiful color enhancement and emotional openness and amplification.  It was a great time, and I hope to try it again but in larger doses next year at the same approximate time."
 ],
 "erowid": {
  "id": "49352",
  "citation": " Xorkoth. \"Beautiful Goodbye: experience with LSD, MDMA (Ecstasy), Cannabis, Piracetam, 5-HTP, Alcohol, Oxycodone & Kratom (ID 49352)\". Erowid.org. Feb 14, 2006. erowid.org/exp/49352",
  "substance": "LSD, MDMA (Ecstasy), Cannabis, Piracetam, 5-HTP, Alcohol, Oxycodone & Kratom",
  "views": "7536"
 }
}
