{
 "title": "Dos and Donts (all you need to know)",
 "author": "Anonymou5",
 "citation": " Anonymou5. \"Dos and Donts (all you need to know): experience with 2C-I & MDMA (ID 82467)\". Erowid.org. Feb 2, 2010. erowid.org/exp/82467",
 "substance": "2C-I & MDMA",
 "bodyweight": "185 lb",
 "header": [
  "DOSE: T+ 0:00",
  "50 mg",
  "oral",
  "2C-I",
  " T+ 1:00",
  "1 bowl",
  "smoked",
  "Cannabis",
  " T+ 2:00",
  "1 repeated",
  "smoked",
  "Cannabis",
  " T+ 3:40",
  "45 mg",
  "insufflated",
  "MDMA",
  " T+ 5:35",
  "1 repeated",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>[Erowid Note: 50 mgs of 2C-I is considered a very high dose, see 2C-I Dose Chart]</p><p>My 2ci experience with a snack of MDMA:  </p><p>*2ci is said to feel like an acid trip combined with rolling.  Well, the results are in, that is pretty much what its like for me, especially if you add some pure MDMA powder to the mix. </p><p>12:54am We ingest 2ci, via fun size snickers bars containing 20ml of 2ci solution each.</p><p>Male (185Lbs) ingested 2.5 snickers bars (Approximately 50ml i.e. 50mg 2ci)</p><p>Female (120Lbs) ingested 2 Snickers bars (Approximately 40ml i.e. 40mg 2ci)</p><p>1:00am We depart to Wal-Mart to get supplies.</p><p>1:10am I think about a 2ci trip report I read about the dangers of driving on 2ci and his bad experience. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>1:24 We finally arrive at the Wal-Mart.  Our pupils are dilated and things are very bright, and colorful.  I am starting to feel it and I can already tell this is going to be a strong trip.  I know we need to get in and get out.</p><p>Items acquired at Wal-Mart:</p><p>Paintbrushes, Paint, and a Sketchpad for arts and crafts hour, Glow-sticks</p><p>1:47 arrival at home. It feels great to be home, I immediately race for a cigarette to calm me down as the visuals and body high multiply in waves. </p><p>2:00am Smoked a bowlor two.</p><p>2:15am I sit in a well lit room to see how hard I really am tripping.  The girl is not feeling it nearly as hard as I am, I try to play it cool and I remind myself to have a good time, and enjoy the visuals, however they are quite intense with 4 hits.  The popcorn ceiling looks like an intricate glass ant farm.  The ceiling swirls in synchronous order back and forth back and forth with a frequency about every 3 seconds.  The body high tidal waves of pleasure wash over me about every 20 seconds.   It is almost too much pleasure at times, but the keyword is almost.</p><p>*2ci has a very rolly effect to it, which can be greatly synced to music.  (Thievery Corporation Sun Moon and Stars owned my world that night.  Also see Markus Schulz, Deadmau5, Caspas Essential Mix, Bassnectar and all things Dubstep or Trance)</p><p>The visuals associated with 2ci are a cross between acid and shrooms.  At this dosage the visuals were amazing yet, there were times during this night that I had to remind myself to enjoy the visuals while theyre here.  As mentioned previously, 2ci has a swirling effect but the rooms do not breathe like with shroom visuals.   Objects seem to lengthen, expand and contract, blinds move and flutter like gills on a shark, the cracks in doors become infinite, and paintings and pictures tell stories and move like holograms.</p><p>2:20am I lay back and stare at the ceiling. The trip still comes in waves and my body pulsates with feelings of fucked upness and extreme fucked upness.  The ceiling eventually moved so much it came off, and became pseudo transparent showing the vast and infinite space beyond it.  This space was filled geometric shapes rotating in sync and in opposing directions.  I am hallucinating pretty hard.</p><p>2:32am My mind feels like a visualizer.</p><p>2:33 am We turn on Milkdrop (Winamps visualizer aka the best visualizer there is)</p><p>3-4 am Lots of weed smoking and cigarettes and a dance party ensues.  I am in love with 2ci.</p><p>4:00am Arts and Crafts time!  Painting is very fun, and I highly recommend it.  The amount of color that comes out of each stroke of a paint brush is breathtaking.  Each stroke has its own thought, feeling, and meaning attached to it. It is unbelievable how much color comes from each stroke of a paint brush, immediately after a stroke has been made; some of the color disappears, like disappearing ink.  The colors intensify and fade as this lovely drug pumps through my brain.  *2ci effects have been compared to Acid because some synesthesia goes on, i.e. hearing and feeling colors, however it is not quite at the intensity as acid.  Note:  2ci only became colorful at high doses. </p><p>4:30 I smoke a cigarette and take a GB hit as I admire my creations.  I feel like an artist and am thrilled to actually walk away with something tangible.  Never have I ever walked away from a trip with something tangible it is always just an experience, something illusory.   </p><p>4:40 am I dont want the feeling to end, and I am so fucked up already I decide I want to rail 45mg of Pure Methylenedioxymethamphetamine, AKA Pure MDMA, AKA Molly.  (Roughly half of a strong ecstasy pill) </p><p>4:50am The drip comes and the ecstasy starts to kick in.  The ecstasy takes away from famous 2ci queasiness.  My body still feels amazing yet in a slightly different way.  I can feel my body temperature rise.  The MDMA changes the 2ci trip and even with this low dosage of MDMA, I feel the effects as if I had taken a couple hits of Molly)  Eye wiggles ensue, and the ceiling is still moving, but now my visuals are slightly different.  My brain does not know what to think, or which drug to respond to.</p><p>5:45am Sexy time ensues.  The sex is life-changing.  2ci sex is the best!!! </p><p>*For all those who have heard rumors that you should never have sex on ecstasy because sex will never be the same, let me clear up some rumors.  First you should probably punch whoever said that in the face, because they are retarded.  Thats the equivalent of saying you should never listen to music while high because itll never be the same.  Can you imagine if you never listened to music while high?</p><p>6:35am I smoke another cigarette followed by multiple Gravity Bong bowls.</p><p>6:40am We take a nice hot shower lit by a glow-stick only.  The hot water feels amazing, and the darkness mixed with the blinking L.E.D. Glowstick causes some trippy hallucinations.  My mind is able to wander while we make-out.  The closed eye visuals are still great and the water and hot body pressed up against me feels amazing. </p><p>7:00am I can feel the waves of the 2ci start to slow.  They still come but not as high in frequency, or intensity.</p><p>8:00am food.</p><p>9:30am Trippy sleep ensues. </p><p>Would I do it all again?  For sure, however I might leave out the Molly (MDMA) this time.  High dosages of 2ci are good enough on their own and shouldnt really be combined with anything other than Nitrous, weed, cigarettes and Houkah.  I took the MDMA because it was available and accessible and I was curious to know what would happen.  I feel however that 2ci does not need a helping hand, unless that helping hand is another hit of 2ci.</p>",
 "year": "2009",
 "id": "82467",
 "gender": "Male",
 "age": "22",
 "timestamp": "2010-02-02T08:00:00.000Z",
 "views": "16824",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "2": {
   "time": " T+ 2:00",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "3": {
   "time": " T+ 3:40",
   "amount": "45 mg",
   "administration": "insufflated",
   "substance": "MDMA"
  },
  "4": {
   "time": " T+ 5:35",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
