{
 "title": "Weed Crack",
 "author": "A. Roper",
 "citation": " A. Roper. \"Weed Crack: experience with JWH-018 (ID 82516)\". Erowid.org. Feb 15, 2010. erowid.org/exp/82516",
 "substance": "JWH-018",
 "bodyweight": "135 lb",
 "report": "<p>t=0:00:10sec - About 10 seconds in, still holding my breath. I feel the familiar light-headedness that always comes along with a nice hit JWH-018.</p><p>t=0:00:30sec - My visions shifts for an instant and then blurs slightly. I can feel euphoria begin in stomach and rise into my brain, adding to the already light-headedness.</p><p>t=0:05min - JWH-018 always comes with a nice body high and thats definitely what Im feeling, it feels like Im wearing weights around all of my limbs, but I feel good, physically and mentally. Everything is much more vibrant. The characters in South Park appear more geometrical than usual, shapes in the room are really obvious, the spherical piggy bank, the rectangular poster. The fish swimming around in the tank seem almost to be swimming in sync with the music in South Park.</p><p>t=0:15min - The body load is even more intense than before, it feels like blood is made of lead, yet i feel somewhat mentally energized. I think I have finally reached my plateau. My body feels like putty and I cant stop moving my feet or slap this goddamn grin off my face. The nice pure white JWH-018 feels like a really good weed high, like smoking blunts when I was only 14.</p><p>t=0:45min  Im starting to come down slightly, this stuff is like weed crack; powerful as all hell but short lasting, more visually active than weed and definitely more of a body stone.</p><p>t=1h  Almost back to baseline, no burnout whatsoever, in fact I almost feel energized.</p><p>Overall: JWH-018 is a smooth, enjoyable substance very similar to oral marijuana, a nice body stone and slightly visually active, but with a dose of 5mg and a price of $50/g it makes a great weed substitute if I'm low on cash.</p>",
 "year": "2009",
 "id": "82516",
 "gender": "Male",
 "age": "18",
 "timestamp": "2010-02-15T08:00:00.000Z",
 "views": "16756",
 "dose": [
  {
   "time": "0",
   "amount": "5 mg",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  }
 ]
}
