{
 "id": 8251,
 "title": "Back in 1999",
 "date": {
  "submission": "2006-04-06T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pie Pie",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  }
 ],
 "report": [
  "This is my second experience with mushrooms, and I will always remember it. My friend M's mushrooms finished growing and he was left with about half an ounce (dried) for his first batch. M, my other friend T and I did not have a scale, so we just ate all of them, not quite sure on how much it was. I would consider myself fairly experienced with psychoactives, I am a pot smoker and drinker. I've experimented with opium, hydrocodone, codeine, DXM, Valium, Ativan and mushrooms once before this trip (only about a 16th of an ounce though.). T and M have very little experience and we didn't think about having a sober sitter around, which was a very big mistake since we all took quite a large dose.",
  "The setting: M's basement, his parents are sound asleep, 11 pm. We each spit the half three ways, I take a little more than T and M. We decide to watch a little Monty Python to loosen things up a little. The lights are dim and we're very comfortable on 3 seperate mattreses. About 45 minutes into the movie, we become quite distracted and we decide to turn it off and play some quiet music on. M decides to put Shpongle in, a nice choice. T is definitely beginning to feel it, as he is laughing uncontrollably. I am being to feel very off baseline and notice that colors are more vibrant and the music is richer.",
  "It's about 1:15 am and we are starting to trip. I decide to call my girlfriend, E and talk to her about it because she is very interested in magic mushrooms. I call her up and a guy picks up and tells me that he is E's man. I didn't believe it and thought it was her uncle or some other family member joking around. I say, 'Ha, this is probably her uncle, right?' He replies with a 'Fuck no, this isn't her uncle, I'm making your woman scream.' I had the phone on speaker and M and T were both listening very intently. I hung up on him. I told T and M that it was probably just a family member playing a trick on me. T told me that she was cheating on me for sure and that I should 'kill her.' T is not a violent person by the way, and the mushrooms were getting ahold of him.  My phone rang and it was the same guy. He asked me if I thought I was a wise guy. I heard E in the background grab the phone and explain to me that it was her cousin. Thank god for that. We all relaxed quite a bit and E took a walk so she could talk to me. I told her what we took and she wished she was there with us.",
  "By now, the room was swirling, patterns were absolutely amazing and it looked as if the ceiling was a beautiful white ocean. All of a sudden, T stood up and shouted, 'Outside is this way!' and ran into the door of his basement. I stood up and restrained him and told him to calm down. We all sat down in the corner of the room while I talked to E, M talked to himself and T repeatedly called his girlfriend and left her messages.",
  "I was telling E all that I was feeling. I loved everyone. E and I had only been going out for a little bit, but I realized that I loved her and wanted to spend more time with her. I told her this and she seemed quite happy about it. My nose was literally, dripping snot. My hands were sweating intensely, sweat seemed to come out of every pore. I told E that I understand schitzophrenic people and I feel like I'm losing it. I began to get such a deep love for every one in the world, I poured my heart out to E. The batteries on my phone were running out and M was getting lonely, so I told E good night and that I would call her when I was sober. We walked back to our mattreses. T did not know M at all, so mostly M and I talked for awhile. We talked about our lives and America. I told M that I could see into anyone's life and know all their loves, troubles, family members and their lifestyle in general, but when I tried to look into T's life, I could see nothing. T was not talking very much, so I asked him to tell us more about him. He told us about his family, his parents, his girlfriend. M and I realized that America is addicted to connectivity and time. T would not let go of his cell phone, and he constantly wanted to use the lap top. We told him he was 'always the addict.' I don't even know what was going on in our heads.",
  "I began to think suicidal thoughts, but I thought about it in a positive light. Very hard to explain. I learned to embrace my death, whenever it came. I realized how small I was, and how big the universe was. I realized that everyone I know will die and soon no one would remember us. Again, I wasn't very sad about this, I just came to realize it. The song 'Do You Realize??' came on by the Flaming Lips and this just intensified these feelings. I thought of a story where 2 lovers lived in a white box, with a purple electric barrier between one another. These 2 lovers could talk all they want, but they could never touch each other. I'm not even sure why I thought that out.",
  "Our sense of time was utterly shattered. A minute would seem like a year. T and M sat on the matress with the light next to it, and M and I told T to turn off the light. He would turn it on for a few seconds, then turn it back on again and ask us, 'What is...on? It could mean a billion things.' I then would say, 'Back in 1999.' And then M and I would ask T to turn off the light. He'd turn it off and back on again and repeat, 'What is....on? It could mean a billion things.' I would repeat myself and say, 'Back in 1999.' This cycle repeated at least 100 times, and we could not stop it. I had to go to the bathroom, so I walked upstairs and pissed for an eternity. I heard panting and I turned around only to see 2 huge dilated eyes watching me go to the bathroom. I finished and told T to hurry up and not do anything else other than piss. I walked downstairs and we both agreed it was very hard to walk.",
  "The next thing that happened was incredibly hard to explain. I thought about myself being born. I lived my life over again through my head and realized all the mistakes I've made. I told M and T what I was feeling,  M completely agreed with me. We all wanted to go upstairs and hug his parents, but thank god we didn't. I realized that my parents love me and I've been giving them the cold shoulder for the past few years, we haven't been honest with each other. I then wanted to know what it was like to be dead, just because of curiosity. I told T and M that I would kill myself in the morning to know what it was like.",
  "T would still not turn off the light so we began to get very mad at him. He started pacing around the room and said he was going to tell the world about what we were doing. He started to walk upstairs so I ran after him and held him down on the matress. He began to get scared that aliens were going to kill him. I held him and told him I would protect him. His heart was beating so fast that I began to worry he might have a heart attack. He was alright though. I told him that he needed to just lie down for a second and relax. He agreed. By now we were all happily tripping again, and we felt so connected to one another. We decided to leave the light on and try to sleep a little. It was impossible. A million thoughts were running through my head, but there was a period of silence for about an hour where we just reflected upon our lives.",
  "We were coming down rapidly at about 5:30 AM and we slept until 9 AM, to our amazement, his parents didn't say anything about how loud we were being. The day after we were quite depressed, but the depression only lasted for that day only.",
  "Mushrooms have made me realize that I love my friends, family, girlfriend and the world in general. It's been a few weeks since the trip and I still think about all the things that I said to my friends. I plan on taking other psychedelics soon, I'll be taking mushrooms soon, maybe try acid and I believe M is ordering some 2c-t-7. I am very excited for the world of psychedelics."
 ],
 "erowid": {
  "id": "49380",
  "citation": " Pie Pie. \"Back in 1999: experience with Mushrooms - P. cubensis (ID 49380)\". Erowid.org. Apr 6, 2006. erowid.org/exp/49380",
  "substance": "Mushrooms - P. cubensis",
  "views": "2828"
 }
}
