{
 "title": "Escalante Dreaming",
 "author": "Fielding Mellish",
 "citation": " Fielding Mellish. \"Escalante Dreaming: experience with Mushrooms - P. cubensis (ID 8253)\". Erowid.org. Nov 5, 2003. erowid.org/exp/8253",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "report": "<p>This experience took place among eight friends in the fall of 1999, two days into a backpacking trip in Utah's Coyote Gulch.  For me it followed a long summer of living alone in an attractive though unfamiliar city, and I had been anticipating the reunion for months. It's among the top three trips I've ever had. </p><p>As the morning wore on, and the eight of us cooked breakfast and filtered our water for the day, it became apparent that a feeling of excitement was starting to build.  We nervously skittered up and down the banks of the river and climbed on the canyon walls.  At noon we unwrapped the package of mushrooms [PF home grown] and divided them into eight small piles.  As we began make our way down the canyon, munching happily on the  fungus, each of us carried a small backpack of snacks, water, and an extra shirt or two.  I strapped my didjeridoo to my back with a length of  vibrant rock climbing rope.  We skipped and laughed, held hands and chattered like schoolchildren. </p><p>Within minutes the world began its transformation. The stream began to sparkle as it never had before. Several people were gathered in the river, watching intently as something floated by.  I excitedly ran over to join, and discovered with no small amount of surprise that the object of interest was in fact a swimming tarantula.  A bizarre sight indeed!  It must have fallen off the canyon wall, we all decided.  It was now floundering in the muddy water, it's legs ill suited for an aquatic environment.  A rather unusual start to a rather unusual afternoon.</p><p>We continued downstream, marveling at the intense detail and stark beauty of the canyon floor.  Spring water seeped from a thin dark sandstone layer in the walls, creating a strip of deep green gardens hanging high above us.  Everything around seemed to sparkle with a clarity and intensity that I had never before imagined.  I was in awe of the fractal complexity of the river.  As we splashed through the water we left forever the history of our steps.  Ripples upon ripples upon ripples, until all the world was filled with our footsteps.  Even standing still we could only watch powerlessly as the vortices peeled from our ankles.  A butterfly flaps it's wings in Japan and a week later it rains in Escalante. </p><p>We walked on gingerly, the towering canyon walls climbing higher and higher above us.  How tall Zach?  300 feet?  400?  400 what?  How are we supposed to tell?  Where are we anyway?  What does it matter?  We are here right now. We are ourselves.  We are going places.</p><p>The canyon floor narrowed and the water quickened, slicing its way through the mud into the sandstone riverbed itself. Suddenly we found ourselves as giants, kneeling over an infant canyon being born before our eyes.  The cool river water cut smooth, soft, sensual curves through the red rock.  Liquid and solid in complement. We plunged our hands into the water, feeling the shapes hidden beneath, becoming a part of the birth itself.  It seemed like it would take an eternity for water to cut through those few feet of stone, and yet as that thought flowed through my mind I tilted my head back and was met with the towering canyon above.  We were no longer giants.  We were elves.  We were mites.  We were specks.  \t</p><p>I stopped further down and sat with Jen and Emily.  Dan was worrying.  We tried to comfort him.  So many things had changed since we began our walk.  What more would change?  Where would it end?  Is anything certain?  I didn't know what to say.  What if he was right?  How could I really assure him that things would ever be normal?  I sat there beneath the rock overhang, dumbfounded.  Emily was more helpful.  We are  ourselves, and will always be.  It's the nature of consciousness.  He felt better.  </p><p>I remembered the didjeridoo strapped to my back and began to play. My lips buzzed.  My head vibrated.  The sound was overpowering, enveloping my entire existence in a matter of seconds.  In the droning darkness I came upon a funnel and slid down into it, falling deeper and deeper until I could no longer see the rim behind me.  I lost myself in the darkness, sliding into another funnel, and then another, and another, until I could not recall any other existence. The droning  stopped. I opened my eyes. Instantly I was jerked back through a thousand funnels by the inelastic rope of reality. A world of color, long since forgotten, exploded before me.  Wow.  I returned the didjeridoo its place on my back.  </p><p>Emily was still talking to Dan.  Jen asked me if I thought the canyon was echoing.  After several minutes of experiments and deliberation we concluded that there were in fact several different echoes present, some within the canyon, some within our heads.  The didjeridoo agreed. Carl, Sean and Zach suddenly came running upstream, babbling wildly and bursting with excitement.  'Could you *please* come and talk about Mars with us?'  It looked like Dan was doing well with Emily's help.  I splashed downstream with them.    </p><p>As we walked along the four of us chattered excitedly like third graders. I felt full of energy.  I felt full of amazement.  I felt reborn. My life seemed to stretch off beyond the infinite horizon.  We could do anything. We could go anywhere.  I thought of the human race and how much potential it contained.  We've done things unimaginable.  We've teleported quantum states. We've built telescopes that can see things billions of light years away.  Neutrinos have *mass*.  There are *planets* around other *stars*.  If we could only stop wasting time bickering over petty, short-term matters we just might really do something.  It's time to start thinking beyond the Earth.  It's time for us to go places. </p><p>The canyon began to narrow again.  We wandered through red sandstone gates and hopped around narrow slots in the canyon floor.  The whole scene now seemed like a hybrid of Earth and Mars.  The colors were overpowering.  Red rock, green life, blue sky.  Desert, river, infinite existence. </p><p>We suddenly found ourselves beneath a great stone arch.  Coyote Bridge.  An arc of red within a sky of blue.  We had traveled 1.5 miles from our camp.  How many lifetimes had passed since then?  The sun was low in the sky, peering at us over the canyon rim.  It was time to turn back. Say, has anyone seen Mark lately?   </p><p>We wandered back under the bridge, slowly making our way upstream. Carl ran ahead to find Jen.  Sean set off for a spot on the canyon wall. Zane and I continued onward, savoring the last bits of the fading  afternoon light, bathing ourselves in the beauty of each passing moment, stepping slowly, softly, carefully.  We stopped and stood together in silence, hearing nothing but the hypnotic drone of cicadas.  The quintessence of afternoon.  Pure afternoon extract.  Afternoon infinity.  Okay, enough of that. </p><p>I removed the didjeridoo from my back and began to play.  Civilization ceased to exist.   We were primal beings again, predator and prey in the same moment,  recalling a time when our bodies were the only tools we had.  Animal blood coursed through my veins.  I felt alive.  But I was evolving, relearning myself, the blood slowly shifting from animal to human.  Love and happiness welled up inside me.  I stopped playing and smiled at Zach.</p><p>Up ahead we met Emily and sat watching the river  water flow through a network of smooth sandstone troughs.  They were the color and texture of weathered redwood, complete with rings recording the passage of time.  The chaotic nature of the stream was hypnotic, and we watched and listened with amazement as the river level rose and fell in the stone channels. </p><p>Over a period of perhaps twenty minutes we watched  the flow level in a single trough gradually increase from nothing to a few centimeters deep and then slowly taper back to nothing.  This took place several times as we sat there in the fading evening light.  Periodic cycle?  Random fluctuations?  Ripples upon ripples upon ripples.  A butterfly flaps its wings in Japan</p><p>It was starting to get dark.  Still no sign of Mark.  Dan appeared, having made it as far as the natural bridge before turning around.  The four of us silently made our way upstream, lost in the mesmerizing liquid drumbeat of our footsteps. We passed the infant canyon and hanging gardens, stopping at the edge of an enormous stone dome.  I looked up and saw that the night had arrived.  Clouds were beginning to drift over the canyon.  The four of us stood together in the darkness, our arms resting on each other's shoulders, our heads touching together in the center.  Lightning flashed silently off in the distance.  Soft, wet wind blew down through the canyon.  The river flowed smoothly between our feet.  We drew  together, hugging tightly.  I pressed my face into someone's hair and squeezed the shoulders I was holding.  Human darkness.  Human warmth.  I felt timeless, each moment drawing out into an eternity of love and happiness.  I'll never forget that feeling as long as I live.  </p><p>I'm not sure how long we stood there.  perhaps thirty minutes, perhaps more.  Eventually Sean wandered down the river and found us standing silently in the night.  The rain began softly with warm, delicate drops.   Lightning flashed overhead, and for an instant the canyon was as bright as day.  Then darkness.  Seconds later thunder roared through us like a freight train, overpowering in its intensity.  It was definitely time to head home.</p><p>Blindly we resumed our walk up the river, arm in arm, stepping gingerly over rocks and mud.  The rain became a shower, and then a downpour.  Lightning flashed every few seconds, illuminating for split seconds the river and red canyon walls, but between flashes we could see nothing.  The thunder ripped through the canyon and pressed into my gut with such overwhelming force that I was afraid I would fall to my knees. But we continued on, holding tightly to each other, stumbling through the muddy water.  Zach howled with excitement, squeezing our arms together. An exhilarating, primal fear began to rise inside me. It welled up hot and boiling in my heart, forcing itself up my throat in a scream. I felt alive.  </p><p>We staggered back to our camp beneath the dome.  Amazingly enough it was dry despite the storm.  We laughed at our luck and happily changed into dry clothes.  The river, just a trickle earlier in the day, was now a muddy, roaring torrent in comparison.  A waterfall of rain cascaded off the lip of the dome hundreds of feet above us, caught in motion every few seconds by the flare of a lightning bolt. Thunder roared through our camp nearly continuously.  Wind whipped over the canyon walls, carrying enormous sheets of water.  And where the hell is Mark?  Somehow, in the midst of this chaos we sat quietly together,  contentedly munching on trail mix and warm risotto, enjoying the company of the best of friends.  </p><p>We slept that night in a warm pile, hugging closely as the thunder receded into the distance.  I put an arm around Zach, and felt Emily's head against me.  Friendship.  Warmth. Content. Satisfaction.  Happiness. Love. I smiled. I slept.</p><p>Shortly after sunrise Mark wandered back into camp, tired, cold,  wet and hungry, but fortunately for all of us, alive.  He'd spent the entire night shivering beneath the insufficient shelter of a bush, getting in touch with his wild canyon-dweller instincts.  We breathed a collective sigh of relief, and started to pack.</p>",
 "year": "1999",
 "id": "8253",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-11-05T08:00:00.000Z",
 "views": "23014",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  }
 ]
}
