{
 "title": "Anxiety and Narcoleptic Symptoms after 1wk!",
 "author": "Cautious",
 "citation": " Cautious. \"Anxiety and Narcoleptic Symptoms after 1wk!: experience with Phenibut (ID 82582)\". Erowid.org. Feb 24, 2012. erowid.org/exp/82582",
 "substance": "Phenibut",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Smarts - Phenibut"
  ]
 ],
 "report": "<p>I will keep this brief because the well-known 'positive' effects of phenibut are covered here and elsewhere more in-depth.  I will say that phenibut seems to be on a very steep curve when it comes to tolerance to a given dose.  As someone who experimented with dozens of drugs, both illicit and non-illicit, in the not-do-distant past, I don't recall another drug that seems to result in tolerance so quickly.</p><p>I bought phenibut because of some lingering circadian rhythm issues from my misspent youth.  I very easily get on a 4am-1pm sleep schedule even after weeks or months on a more-desirable 12am-8am sleep schedule.  One all-nighter or similar is all it takes.  This is unacceptable for me, and causes a lot of secondary stress as well as the expected issues from circadian disruption.</p><p>On to the negatives of phenibut use: while I noticed some benefit as far as sleep quality, they were  grossly outweighed by a recurring and nasty floating anxiety, occurring most intensely in social situations but manifesting as a general sense of dread and even nausea.  This started about three days after phenibut use started.  Oddly, the intense anxiety was followed by periods of near-narcoleptic drowsiness.  It got worse with prolonged use, and when I hypothesized it was the phenibut and cut down my phenibut use, it took a full week to get back to a semblance of normal.</p><p>Luckily for me I am between jobs.  This was seriously life-disrupting and resulted in 4-5 embarrassing situations during dates with girls.  I can't emphasize how out of the ordinary this is for me.  I am not at all prone to anxiety in social situations, and tend to remain cool and levelheaded under any type of pressure.</p><p>Most people who use phenibut are either looking for a good sleep aid, a cheap thrill, or are genuinely interested in experimenting with a variety of drugs and in the interest of thoroughness add phenibut to the list.  If you are looking for a sleep aid, I doubt phenibut will be worth the potential lost sleep and days of anxiety.  If you are looking for a cheap thrill, alcohol is legal and is very similar to phenibut when dosed at 2-4 drinks.  I won't suggest illicit drugs, but I think most of them are less psychologically harmful in an acute sense than phenibut.</p><p>[Reported Dose: '400-2000mg']</p>",
 "year": "2009",
 "id": "82582",
 "gender": "Male",
 "age": "23",
 "timestamp": "2012-02-24T08:00:00.000Z",
 "views": "8517"
}
