{
 "id": 8264,
 "title": "Fasting Can Be Fun",
 "date": {
  "submission": "2006-12-25T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mr. Yukk",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Tobacco",
   "form": "",
   "specific": "Cigarettes"
  }
 ],
 "report": [
  "At the time I was twenty-three, user of alcohol, cigarettes and moderate amounts of cannabis. The most salient piece of info is that I was working at a pizza parlor, and being that I was poor and the food was free, made it the mainstay of my diet for about four months. Pizza for breakfast...pizza for lunch...cheesy bread for dinner. You get the picture. I eventually started to feel sluggish, bloated, and unsatisfied (imagine that!)",
  "My decision to begin my fast was not a conscious one; I simply couldn't stomach any pizza one day, so worked a ten hour shift with nothing but water and the occasional cigarette. Jack mentioned that his was a 'dry' fast, meaning he did not drink water throughout the day; I think that was a mistake, as it alleviates hunger pains as well as helping flush the system. The next morning I woke up feeling a little sluggish, but after a big cup of coffee I was ready to go with no problem. When I got to work, the pizza again looked and smelled vile. I decided to keep up with what I had started, and any time my energy flagged, I ran next door to the Quickie Mart for some coffee (Black, no cream or sugar). I also made sure to drink plenty of water. By that night I felt more clear-headed than I had in months.",
  "The following morning I almost leapt out of bed at about six a.m., a full five hours before work, with an amazing surge of energy. I contemplated eating some fruit for breakfast, but after coffee and a cigarette my faint hunger pangs were gone and I went for a long walk in the woods before submitting once more to the toxic pizza parlor environment. After another full day of work with nary a single calorie, I went home and took a shit for the first time in two days. it was basically some little balls of black sludge, which I'm sure were what had been clinging for months to my intestinal walls. God it was great to get rid of that! I was also abstaining from alcohol, and so went right to bed and slept like a baby.",
  "Day four, things started to get a little weird. I was still full of energy, but also a little light-headed and spaced out. My coworkers started making jokes about Gandhi and hunger strikes, and they seemed so bizarre and animalistic as they gobbled down the preprocessed garbage we peddled. I had never taken coke at the time, but now I can compare the feeling to maybe one too many lines; a little paranoid, a little deranged, but damn sure ready to go!",
  "By the end of the day my ass was dragging badly, and coffee and cigarettes were no longer saving me. When I got home, my roommate was smoking a bowl in front of the television. I sat down and joined him. After about three hits, brothers and sisters I got the proverbial munchies like I never knew existed! I decided it was time to break my fast ASAP. That apple and that Peanut butter/jelly sandwich were like an orgasm in my stomach.",
  "I started eating regularly again the next morning. And by regularly, I mean something approximating a balanced diet. All in all, I feel my four days with absolutely no caloric intake were really valuable. Afterwards I felt a lot more in touch with my body and its needs.  I definitely had some surplus fat to work with, and have a pretty strong constitution for stuff like this (once went five days with no  sleep, without the aid of drugs)."
 ],
 "erowid": {
  "id": "49451",
  "citation": " Mr. Yukk. \"Fasting Can Be Fun: experience with Caffeine & Tobacco - Cigarettes (ID 49451)\". Erowid.org. Dec 25, 2006. erowid.org/exp/49451",
  "substance": "Caffeine & Tobacco - Cigarettes",
  "views": "31203"
 }
}
