{
 "title": "A Night of Fear, Sex, Energy and Love",
 "author": "Veniece",
 "citation": " Veniece. \"A Night of Fear, Sex, Energy and Love: experience with 2C-E & Ketamine (ID 82671)\". Erowid.org. Feb 15, 2010. erowid.org/exp/82671",
 "substance": "2C-E & Ketamine",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Ketamine",
  "",
  " ",
  "oral",
  "2C-E",
  "",
  " ",
  "smoked",
  "Tobacco - Cigarettes"
 ],
 "report": "<p>[Erowid Note: With no information provided regarding the relative proportions of the 2C-E and Ketamine in this mixture of substances, readers should assume that the stated dose is speculative.]</p><p>After receiving a text from a good friend B one Tuesday, I decided to head out to a local bar. I  had abstained from alcohol for mostly spiritual reasons for months prior to that week, but that night and two nights before I had a moderate amount to drink. At the bar B and I met a guy, R, during an outside smoke break he told us he had 2-CE combined with a small amount of ketamine available if we would like to trip that night. Ive had previous experiences with LSD, mushrooms, molly, ecstasy and of course cannabis, all extremely satisfying. Usually I go through great detail with set and setting, and especially wouldnt trip with a stranger, but that night I was feeling adventurous and decided to go for it.</p><p>After heading to his house to pick it up, we met back with B who was with a friend C. Before this night C had never even smoked cannabis much less any other drug. We all dosed by 4:45 am taking an eyeballed amount of about 40mg a person, which I now know is an extremely large dose for even an experienced psychonaut. It is important to note that while R and B insufflated theirs, and felt the effects almost immediately, Chip and I swallowed ours in a capsule to avoid the sting and felt the effects a little over an hour.</p><p>I had a few life questions I decided to go into the trip with, including: With graduate school so close, I was second thinking if my career choice was mine or my parents.  I had also done a lot of thinking about my purpose on this earth and my budding spirituality. I also had a sexually confused mind set since the night before I had a threesome for the first time ever. The location was Bs apartment which was a mess at the time, and being slightly ocd about my surroundings that alone had me a bit unsettled. I straightened up a bit while waiting for the come up then sat with the others and entertained ourselves with music and glow sticks.</p><p>After awhile colors became more vibrant and music was very distinct, as if each instrument was disassociated, but harmonized beautifully. I could tell my trip was beginning. After a bit, R, began to massage my back while I laid between the two speakers, this is when the CEVs started. Beautiful spirals, geometric patterns and colorful tentacles like images sprawled across the back of my eyelids. It seemed to flow with the music as well as Rs hands. After playing with the glow sticks for a bit I laid down watching the CEVs and listening to the music.</p><p>When I stood up I tripped over an object on the floor and fell hard onto the computer desk, making a large scrape on my arm that I didnt feel or notice until I saw a small piece of skin as well as minimal blood on my hand. I tried not to concentrate on it but when I looked up I saw what appeared to be blood dripping in the corner of the darkened room as well as the bathroom door. I immediately ran to the bathroom to wash it off as R followed me to make sure everything was fine. While in the bathroom the blood hallucinations faded away as R told me to look in the mirror and realize my true appearance. This was a very emotional time as I had always had longstanding appearance issues and was surprised to see how beautiful I truly was.</p><p>We went back to the room and started cuddling as B and C proceeded to take off their clothes and get busy. As R and I cuddled it seemed as if our hands were tubular structures weaving in and out of our bodies connecting us as one. Our souls felt intertwined and as our energies combined the room  began to fill with sensual energy. Soon enough one kiss led to R pleasing me while the orgasmic energy circulated immensely inside me. Colorful explosions filled my eyelids to the point where I had no concept of where I was or what was happening around me. I heard moans and noises but had no idea they were coming from me. Ive never felt such pleasure in my life as I climaxed and convulsed in a real female orgasm, which I had never been able to achieve in previous sexual experiences.</p><p>After this my trip was in full blown, the walls breathed and everything moved and waved and shifted to the point were I felt as if I were in a video game. Music became touch and colors melted and changed around me. The color of the room took on a constantly changing purple red over glow and I sat amazed as I have never had that much visuals before, even on 2 hits of lsd or an eight of mushies.</p><p>I dont remember when my bad trip started as there was about an hour and a half period in which I blacked out. Apparently I had tried to go outside naked twice and tried to wake up Bs roommate who was a mutual friend of ours sleeping at the time. All I remember was laying with B and C and B approaching me to join with her, but for some reason in my mind I thought they all were trying to either make me their sex slave or just had some previously conspired sexual plan. I have no idea what was going on as after that I lost ALL concept of reality, time, space, why I was there, etc.</p><p>Everything was shape shifting in a scale like manner. Everyone took notice that I started to enter a bad trip and started talking about me in the form of She has that stare again or why wont she say anything, which though they had no idea sent me spiraling downhill. I thought not only that I had been running around doing the same things the whole time, and for some reason because of this they already knew everything I would say and do because I had unknowingly done everything I was doing before. I also thought I was speaking the whole time, which I wasnt, and I was wondering why no one heard me, eventually I thought everyone hated me for having a bad trip and ruining theirs. In reality, I had gained all these sensual talents and went back and forth between pleasing, giving energy massages, and having these philosophical thoughts and revelations before quickly returning into my bad trip. Every time they thought I had come back into reality and was overjoyed but I always kept going back until eventually I had fell completely off my rocker.</p><p>It being day now I sat on the stairs of the apartment half smoking a cig for some sort of comfort. This is where things get hard to explain. I went between thinking I had actually taking a ton more than everyone else and they were living while I was sitting on those same stairs as days and months went by and I was getting older and older. I asked R what day it is and he said Dec 8th, which meant absolutely nothing to me at the time seeing as I forgot even what day I started to trip.  At the same time in almost a split consciousness I kept asking what the drug does, because for some reason I thought I was running around and coming back to the stairs, and running around the next day doing the same things, whatever that was as I do not remember, only coming back to the stairs as I was being drained of energy and all the used adrenaline as I just sat there aging rapidly as I thought the drug did not wear off and wouldnt for years. I even saw the sun rise and set numerous times!</p><p>After going back inside everyone started to become a bit frazzled over frustration of me not being able to enjoy being with them and having a good time. I thought everyone despised me at that time for ruining their trip but that was not the case. Eventually C took me on a walk which definitely calmed me a bit. We lay on the pavement and looked at the clouds, him still being overwhelmed at the visuals since he only knows the real world reality.</p><p>We both laid there and at one point I ended up giving him a massage and felt such STRONG energies coming from my hands they were vibrating. We both felt it and were in awe as well as overwhelmed by all these unusual senses we were experiencing, and knowledge the drug gave us. C automatically knew many pressure points out of nowhere and as he rubbed my hands it couldve been a professional practitioner. I remember knowing how to sexually please the male and female body, dance in such a way I never have before, and I stretched my limbs much further than I've ever achieved in previous weeks of yoga. </p><p>When back in the room I felt uneasy again and kept grabbing my phone, purse, and keys talking about heading to my favorite park repeatedly, even though no one was in the shape to drive. If I had actually gotten either back home or to the park I'm sure things would have been different because even my subconscious needed a change in environment. B and C got into a fight about something to do with R, and C left which worried us greatly as he's new to the psychedelic experience and alone. R left shortly after to head to class, and after a period of distress I couldnt stay there anymore and B, who was overcome with tears at C leaving, let me borrow her car to drive home as I didnt drive there. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I thought I had come off my trip enough to drive, but as I hit the road I realized my trip was still in full swing as everything took on almost comic book like visuals and the sound from the window made it seem like the car might take flight. It was about 1pm and I had to pull over twice to recuperate, and at one point even called a friend who lived right up the street from where I made a stop. She said she was writing a paper due tomorrow and could not drive me home, even though I told her repeatedly I was tripping face and could not drive (btw I am no longer friends with this girl because a true friend would have realized how dangerous the situation was). Even though it took me what seemed an eternity to get home, along with missing a few streets and driving well below speed limit, I finally made it.</p><p>Anxiety started to return as I was alone and still filled with all this energy. I decided to take music onto my patio and do some fluid yoga and stretching. As the music played I felt compelled to dance. It was if something took over my body as I swirled and danced so expressively with the effortless grace of a ballerina. I danced on the patio for hours until around 5 pm when friends started to come over to keep me company while my trip subsided. One of them suggested I play the piano while in this state, and as I played the same keys I played for years, I found that my hands just flowed over the keys and the music had much more dynamics and soul than ever before. This filled me with immense joy.</p><p>I started to realized the beauty of the trip in those hours back home, and was saddened that I couldnt be with R and that I couldnt go back and make the trip as beautiful as it should have been for my friends, since previously in my circle I was known as trip queen, and somewhat of a psychonaut, not the type to experience a bad trip. It was probably this ego, and a number of other factors that influenced this. But on the comedown and reflection of this trip I realize how much value I gained from this, and how much I learned about myself, my goals, religion, my sexuality, and more than all ENERGIES. </p><p>I now have a goal for my future as well as a plan to better my self in every aspect. I was overwhelmed by the immense energy I was feeling during the trip, which caused me to resist the drug instead of flowing with it. I did not want to drop my ego completely and let go. Spiritually, I realized that constant meditation is useful in quieting all this mind chatter, and after the unexplainable experiences I had on this trip I am extremely interested in harvesting these energies for healing.  What I have gained from this bad trip far outweighs all of the hell I went through and I looking at it comprehensively I can learn and appreciate this.</p>",
 "year": "2009",
 "id": "82671",
 "gender": "Female",
 "age": "19",
 "timestamp": "2010-02-15T08:00:00.000Z",
 "views": "14526",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Ketamine"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "2C-E"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  }
 }
}
