{
 "title": "clairvoyant to the meaning of the music",
 "author": "BP",
 "citation": " BP. \"clairvoyant to the meaning of the music: experience with Cannabis (ID 827)\". Erowid.org. Oct 20, 2000. erowid.org/exp/827",
 "substance": "Cannabis",
 "bodyweight": "140 lb",
 "report": [
  "<p>One night when I was home alone I decided to smoke. I usually smoke with friends so this was a little different. The weed wasn't laced or anything and the only other drug that I have used is alcohol (twice). As I was smoking I had this odd sensation that I could feel the THC running from my lungs and into my bloodstream and then into my brain. I was caught up in this thought of the THC flowing through my body. When it reached my brain was when I really got fucked.",
  "I sat in my room waiting for my friends to come over with some Wendy's and I was listening to music. As I was listening to the music I began to drift off in a semi concious dream. My mind began to become very clairvoyant to the meaning of the music that I was listening to. I started to think of dreams that i had once when I was a little kid. As quickly as they came to me they would leave and I couldnt remember them. I soon became aware of the music that I was listening to and it took shape in my mind. The music was rather techno so I began to think about all the electrical instruments that were required to make it. In my mind I started flowing through these wires to the tune of the music.",
  "I became aware of how odd this was and then all of the sudden i woke up as if from a dream. I was lying on the floor and i tried to get up but I couldn't move. I felt as if I had a big down comforter on me and I was too comfortable and weighed down to move. I started to lose these feelings in about twenty minutes when my friends came by. While I was talking to them i began to realize how little I knew about them. I would look at them and realize that everyone that knows this person has a different opinion abotu them and they're the only ones that truly know themselves. I began to wonder what other people thought of me and the type of person they thought that i was, I came to the conclusion that no one knows me the way I perceive myself but me. After these odd experiences it was just the regular laugh and have a good time high.</p>"
 ],
 "year": "2000",
 "id": "827",
 "views": "6399",
 "dose": [],
 "submissionDate": "2000-10-20T07:00:00.000Z"
}
