{
 "title": "Crude Bufotenin Extraction",
 "author": "Wookistan ",
 "citation": " Wookistan . \"Crude Bufotenin Extraction: experience with Anadenanthera colubrina & Harmaline (ID 82807)\". Erowid.org. Dec 13, 2013. erowid.org/exp/82807",
 "substance": "Anadenanthera colubrina & Harmaline",
 "bodyweight": "225 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Harmala Alkaloids",
  "(extract)",
  "",
  " ",
  "smoked",
  "Anadenanthera colubrina",
  "(extract)"
 ],
 "report": "<p>First I want to thank the people whose writings and experiences have informed me to explore these entheogens. Their experiments have been a fascinating study and have lead me to a very rewarding hobby. The extraction technique I used is adapted from the work of other experimenters, and to them I am most grateful.</p><p>My prior experience with entheogens is that I was a daily smoker of cannabis for ten years, and an occasional toker  for ten more, Ive done acid and mushrooms several hundred times each, smoked salvia maybe ten times, cactus four times, sub-breakthrough vaporized DMT maybe twenty times, but not much experience with MDMA, opiates, cocaine, or other hard drugs. Ive used a variety of herbs like kratom, kava, wormwood, morning glory, and kanna.</p><p>I obtained some cebil seeds originating from Argentina and some Syrian Rue extract in freebase form. One batched I ruined by burning them in a toaster oven. Be careful, these seeds burn easier than people say they can. Some people say you can throw them in the oven for an hour at 500. Ten minutes at 350 degrees in my cheap toaster and they were literally charcoal and I had a reeking house filled with smoke. My second attempt was more successful.</p><p>First I toasted the seeds in a cast iron skillet over medium heat until they began to smoke a little and were darkened quite a bit. After they cooled I put them in a hot air popcorn popper and toasted them again, agitating them by shaking the popper and letting the air move the seeds around. All this toasting is said to neutralize the toxins that make you feel sick. I peeled off the hulls with the help of a paring knife, this was the most labor intensive step of the whole process. I ground the blackened seeds with a coffee grinder, and added an equal amount of sodium carbonate (made by heating baking soda in the oven at 400 degrees for an hour.) I moistened the mixture with distilled water, kneaded it a bit like dough, then let it dry overnight. I covered the freebased seed mixture in acetone for a few days in a glass, stirring them occasionally. I siphoned off the acetone and evaporated in a Pyrex casserole dish outside, and then poured more acetone over the ground up seeds and repeated this process several times. The evaporated acetone left a very oily tar like substance that I scraped up with a razor blade. I flattened this oily goo out like silly putty as thin as I could and soaked it in a little VMP naptha in a small jar. I let this sit overnight, and this helped absorb most of the oils. After pouring the naptha off the tar, I realized the naptha would take a long time to fully evaporate. After a week of sitting, it still had that naptha smell. I massaged it and heated it up so it became pliable, but the smell was still there, but the majority of it was gone. I placed the tar on an oven proof ceramic casserole and covered it in foil; I put it on a gas grill over indirect heat for an hour at about 350-400. The tar melted and then when cooled it hardened into a little rock rather than the soft putty it was originally before defatting. I scraped this up and left it as little shards that I stored in the freezer to keep it from coming back together. It is very hard to work with when solid, and keeping it cold keeps it from coming back together into a solid lump.</p><p>I tried to smoke this but the effects were minimal. Most of the time, it would give a wave of nausea and head pressure, then nothing much else, some quick CEVs that left you wondering if they were real or just placebo. This initial wave of nausea feels sort of like you are about to pass out, and maybe vomit. It doesnt last long and although unpleasant, it  isnt as bad as morning glory belly or when you take too much kratom. One time, I tried smoking as much as possible in a very short time, this made my heart race badly for several hours and gave me about three minutes of moderate CEVs. It clogged my pipe up with nasty tar, so I worried about what it was leaving in my lungs. I almost gave up on it, but I noticed other people on the internet mixed it with MAOIs for best effect, so I tried putting some freebased harmaline (about 10 mg worth) in the pipe along with the extract on top of some dried mullein. It was a whim, so I wasnt expecting much.</p><p>I took maybe five hits off the pipe and after the first wave of malaise subsided, which lasts about three minutes, I suddenly felt like I was on a strong sub breakthrough dose of DMT. DMT is usually too intense for me when the dosage exceeds 30 mg. I was unprepared because I thought nothing much would happen. I moaned and I groaned, something I do when I smoke DMT and the alienness of it overwhelms me. The lights were too bright. The music was too loud. I lurched across the room and shut off the lights, everything was strobing and flashing in the darkness. Ive gotten this strobing effect several times from DMT. The CEVs were so intense I could see them with my eyes open.  The patterns I saw are hard to describe, they resembled the Mayan calendar, or computer generated gift wrap with trippy chaotic patterns. It morphed quickly from one thing to another. I didnt see anything grotesque or disturbing, and my mind didnt go into any loops or feel like everything was dj vu or a revelation. Like DMT, it doesnt last long, perhaps ten minutes, and when the trip is over, it is hard to remember what I saw.</p><p>The second time, I took one big hit, and decided to wait to take another hit after the nausea wore off. I didnt need that second hit.  I used more harmaline this time. It wasn't too overwhelming, it was euphoric, and it seemed to last longer. The CEVs are like a small hit of DMT but more chaotic. I didnt sense any entities. When I opened my eyes I saw the CEVs superimposed on reality. I didnt notice any crawling or morphing.  The only OEV I noticed was the hair from my brush on my white porcelain toilet had a wonderful cracked eggshell kaleidoscopic pattern to it. Again the main trip lasted about ten minutes, but the comedown felt like it took an hour, consisting of light visuals. As I drifted off to sleep, the hypnagogic world seemed much more vivid than usual, and I woke frequently throughout the night and was restless. I did expect the trip to last much longer; perhaps more MAOI will lengthen the experience.</p><p>Overall, I really like this substance, and will work with it for a while.</p>",
 "year": "2009",
 "id": "82807",
 "gender": "Male",
 "age": "40",
 "timestamp": "2013-12-13T08:00:00.000Z",
 "views": "874",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Harmala Alkaloids",
   "form": "(extract)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Anadenanthera colubrina",
   "form": "(extract)"
  }
 }
}
