{
 "title": "Calming Effect",
 "author": "WhiteRook",
 "citation": " WhiteRook. \"Calming Effect: experience with Phenobarbital (ID 82894)\". Erowid.org. Jan 31, 2011. erowid.org/exp/82894",
 "substance": "Phenobarbital",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "oral",
   "Barbiturates - Phenobarbital"
  ]
 ],
 "report": "<p>First, let me note I am typing this from a BlackBerry about 50 minutes post dose. Also, I have a professional education in biology, chemistry, and health care practice, allowing inherent extreme familiarity with the substance(s) involved in terms of pharmacokinetics, pharmacology, and contraindications as well as recommended/approved/LD50 doses for various symptomatic presentations. I am trained in anesthesia and advanced cardiac life support, as well as resuscitation aids like epinephrine and other ACLS meds along with pulse oximetry.</p><p>That said...</p><p>Though phenobarbital 400mg PO is above recommended dosing guidelines (though has been used off label clinically clinically say the journals who should know), I have enough experience with it to know how it should clinically influence me. After about an hour or so post dose, a relaxing benzodiazepine like calmness is noted. Within 1H10M I begin to experience fine motor coordination loss similar to the physical presentation of EtOH intoxication, however with a relatively normal mentation. My previous experiences (not necessarily recreational) in this dose range are consistent. At about 90 minutes in, I feel content to just be, without really any anxiety or other stress. The physical coordination impairment is more presented, however not unmanageable. I do know that tomorrow I will still be experiencing some of the effects due to the long half life, but am prepared with d-amphetamine to allow myself to function on a more or less normal level without fatigue. There really isn't much more to the 400-600mg PO dose range to say (in my opinion anyway) other than it is not by any means as seemingly intoxicating as benzo's, even, much less than other cns depressants. (Warning: barbiturates like phenobarb have a very narrow therapeutic range, and can thus not safely be taken in large amounts without risking respiratory arrest or other potentially fatal outcomes). Just because the noticed effects weren't an earth shattering trip doesn't mean drastic dose escalation is safe (in fact it is certainly the opposite due to the rapid depressant effects on respiratory drive).</p><p>This experience is not an unpleasant sensation as a mild loss of coordination (not driving) isnt unwelcome and the calming effect certainly fills in for benzodiazepines decently with regard to allowing me to get some rest before I actually get my benzo's tomorrow morning. Not a CNS depressant medication of first or even second line choice by my personal tastes though...</p>",
 "year": "2009",
 "id": "82894",
 "gender": "Male",
 "age": "25",
 "timestamp": "2011-01-31T08:00:00.000Z",
 "views": "18620"
}
