{
 "id": 8291,
 "title": "Cold Extraction and Comparison",
 "date": {
  "submission": "2006-12-19T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "MIM",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "120",
    "grams": 0.12
   },
   "administration": "oral",
   "substance": "Codeine",
   "form": "liquid"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "mg",
    "quantity": "120",
    "grams": 0.12
   },
   "administration": "oral",
   "substance": "Codeine",
   "form": "liquid"
  },
  {
   "time": "24:00",
   "amount": {
    "unit": "mg",
    "quantity": "120",
    "grams": 0.12
   },
   "administration": "oral",
   "substance": "Dihydrocodeine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I went to visit a Southeast Asian country this New Year's season to tour its various sites.  While there, I noted that in the pharmacies, whatever the pharmacy happens to hold (which varies by particular pharmacy) is available over-the-counter and for very cheap.  Among the products available at a particular pharmacy I went to were Codalgin Forte, which contains 500mg acetaminophen and 30mg codeine per pill, as well as Dicodin LP - 60mg dihydrocodeine in extended-release ('liberation prolongee' on the box since it is a French product) tablets.  Each came 20 per box, with each box of Codalgin Forte priced at $3 and each box of Dicodin L.P. priced at $10.  On my first trip I purchased one box of each: I was familiar with codeine but apprehensive of the large acetaminophen content; I liked that the Dicondin was all opiate, but I was not yet familiar with dihydrocodeine, and could find very little literature on it. ",
  "I had been taking kratom, Tylenol 3s, and hydrocodone for the weeks before this on a semi-regular basis, so I had built up somewhat of a tolerance to opiates.  As such, I took 8 Codalgin Forte tablets, wrapped them in a double thick envelope of aluminum foil, and proceeded to crush them under the weight of a glass.  This was a fairly easy task, and very soon I had obtained a pile of white powder, with a few large crumbs here and there.  I didn't have a coffee filter or a funnel, so used aluminum foil to make a makeshift funnel over the top of a glass, and punctured the center of this with a chopstick.  Over/in this, I placed an emptied out and cut/unfolded teabag.  In a second glass I poured the powder and crumbs, and on top of that approximately 200 mL water which had been cooled with ice (the ice was allowed to melt fully before the procedure, of course!).  This mixture was stirred together with the chopstick, allowed to sit sit, stirred again, and so on for about an hour to make sure all the large crumbs had dissolved. ",
  "At the end of this hour, I noticed that the water was cloudy after having been allowed to sit for a while, with a thick layer of sludge at the bottom.  Upon stirring, the sludge would be whisked up into the water above, but it would quickly precipitate out and resettle at the bottom.  I assumed this was teh acetaminophen.  I poured the freshly-stirred glass into the improvised funnel and filter, slowly to make sure it did not overflow, and to make sure the level of liquid did not get higher than the extent of the tea bag's upper edges (so that no acetaminophen would get around).  At the end of this process, cloudy white liquid sat in the second glass, and a lump of residue remained in the filter.  I simply discarded this, willing to lose a little codeine, perhaps, in the interest of protecting my liver from the acetaminophen. ",
  "Aware of the situation specificity aspect to tolerance, I consumed only half of this glass first, while watching a movie (my favorite activity - other than nodding off - on opiates).  The usual euphoria came and increased, and most notably the part I like most about opiates: all of a sudden, my mind was entirely at ease.  Nothing in the world could touch me.  I sensed that the euphoria had reached its plateau, however, and wanted to up it.  I wished then that I had kratom on me (which I felt would have been perfect), but I didn't, so I consumed the second half of the glass.  This was enough to get me to nod off during the movie.  I awoke what seemed a short time later, though I knew after an hour or so of extreme bliss, with the DVD menu playing on loop.  I shut off the TV and fell into undisturbed sleep. ",
  "As usual, I awoke a little lethargic, and throughout the day my lethargy turned to anxiety.  That night I couldn't wait to escape once again into the wonderful world of opiatated bliss, and this time thought I would experiment with the dihydrocodeine. ",
  "To be on the safe side (and because the instructions warned not to exceed two extended release tablets in a 24 hour period), I started out by breaking one of the (quite small) tablets in half, chewed it *well* (to make it act all at once), and then swished water around in my mouth and swallowed - a couple times, to make sure I got as much as possible off my teeth.  The buz I experienced was roughly equivalent to taking two tylenol 3's (60 mg codeine), so I chewed up the other half and chewed up another whole pill.  This ended up surpassing the codeine experience from the night before.  The bliss was roughly equal, but the euphoria was more pronounced and I literally felt my body go numb - not in the pins and needles sense, but in the pleasant vanishing sense - something which has before happened to me only on nigh doses of hydrocodone or kratom, or both. ",
  "I liked the dihydrocodeine so much I ended up buying two more packs at $20.  I would have bought more, for its *very* reasonable price, but was a bit bashful to buy that much... plus, upon return to places where such things are illegal, I did not want to get caught with so much on me that it would arouse suspicion of distribution (which was far from my mind, but how does one prove that to the tyrants in the DEA?). ",
  "Best wishes in your own experiences, in your own lives.  Take care when dealing with opiates.  I overcame a pot addiction.  I overcame an alcohol addiction.  I even never found cocaine or amphetamine addictive in the first place (useful, but never addictive, and in cocaine's particular case often annoying).  But opiates, at least for people like me, are a whole new ballgame.  I can control myself for now, but I'm apprehensive of that day, hovering on my probable horizon, when I no longer have control.  I hope that day never comes, and do everything to prevent it.  I would say that perhaps the best way to avoid that is to never begin in the first place, but at the same time, a solid opiate high is one of those things - like fantastically good sex, a shroom trip, several (airplane) trips abroad, etc - that most everyone, in my opinion, should experience in their lifetimes."
 ],
 "erowid": {
  "id": "49559",
  "citation": " MIM. \"Cold Extraction and Comparison: experience with Codeine & Dihydrocodeine (ID 49559)\". Erowid.org. Dec 19, 2006. erowid.org/exp/49559",
  "substance": "Codeine & Dihydrocodeine",
  "views": "52192"
 }
}
