{
 "title": "My First Shockingly 'Bad Trip'",
 "author": "TheHappiestGirl",
 "citation": " TheHappiestGirl. \"My First Shockingly 'Bad Trip': experience with 2C-E (ID 82918)\". Erowid.org. Mar 29, 2010. erowid.org/exp/82918",
 "substance": "2C-E",
 "bodyweight": "123 lb",
 "report": "<p>Before I begin, I would like to make it very  clear that this was my personal experience. I can not speak for my partner who went on this trip with me. Having said that I will be including him in my report.</p><p>7:45:  My husband and I each take 20mgs orally.  Taking into consideration the height and weight difference between the two of us, my husband chose to iv a small amount around 30 minutes after initial dose.</p><p>8:15:  I can feel a warm almost numbing sensation in my belly. Im anticipating the come up. Looking towards to this new unknown.</p><p>8:30:  The warm buzz of the come up is literally stomped out by extreme nausea. I begin to experience a very heavy/ oppressive body load which hits my back, neck, jaw and wrists like a car crash. This is immediately followed by an almost instantaneous thick and blurry visual. The combination of all of these things sent me over the edge and I found myself in the bathroom vomiting. I had hoped that this nausea would pass (as it had with my 2C-I experiences) and I could go on to enjoy the evening. This would not happen.</p><p>9:30:  I have made several trips to the bathroom to vomit. At this point there is little left in my body and I have begun to dry heave. The severity of thick patterning of prisms is making it hard to focus. To do even basic things like wash my face and brush my teeth prove nearly impossible. I finally settle to a spot on my bed. For fear of triggering another round of sickness I lay still, and have a distinct feeling of being my own hostage. All the while my husband has been helping me through my ordeal. Im certain the negativity that I was giving off had to be altering his trip. He seemed to manage some enjoyment, which I was thankful to see.</p><p>12:45:  I have been in bed. Waves of nausea keep threatening to send me back to the bathroom. At this point the thought of being sick again is unbearable. Im trying to figure out the quickest way to sleeping this off. Luckily, or maybe unluckily both mine and my husbands attention is grabbed by some fucked up movie plot,  possibly the worst movie to watch while on this stuff. We were confused and we both seemed hyper sensitive emotionally. My husband was having trouble telling weather or not the people in the movie were really there. When the movie finally had ended we both had the distinct feeling that it had consumed a little bit of our soul. We were drained. It was also around this time that all three of our cats came in and decided to lay with us. We both found this very weirdbut not unwelcome. We began to dote on the awesomeness of our fuzzy our companions.</p><p>2:15:  My husband has seemed to have had some interesting moments. I sadly have remained glued to the bed under waves of nausea and dizzying visuals. My husband begins to hold me and giving me some light relaxation suggestions. I guess my stress was apparent. This was hugely comforting, and I was glad that he was there to love and support me. We made nonsensical chit chat for about an hour and I finally passed out. Thank God. Sleep was fine but not nearly long enough</p><p>Conclusion:  I have loads of experience with psychedelic substances from nature herself to lab created. Ive heard of people having bad trips and never understood what that meant, or for that matter how that could even be possible. I have now officially had a bad trip.  It was a demon hell ride. I was never so happy in all my life to wake up this morning and not be on drugs. I felt compelled to share this experiencesimply because after 15+ years of different substances it was 2C-E that took me to the cleaners. I will never  experiment with this compound again.  I will happily and peacefully stick to my beloved  mother nature and 2C-I.</p>",
 "year": "2009",
 "id": "82918",
 "gender": "Female",
 "age": "30",
 "timestamp": "2010-03-29T07:00:00.000Z",
 "views": "4155",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ]
}
