{
 "id": 8297,
 "title": "Mushrooms and Opiate Withdrawl",
 "date": {
  "submission": "2007-05-31T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dan",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "substance": "Codeine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "number": "3.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I've been addicted to codeine on and off for a couple of years now, for various reasons, and while I don't suffer any real adverse effects from the dosage I maintain, I don't like being addicted to anything, and I don't like spending the amount of money you have to spend to keep the withdrawl symptoms at bay.",
  "And I certainly don't like the withdrawl symptoms.",
  "About two years ago, however, I noticed that psychedelic drugs (specifically LSD and Mushrooms, but more the mushrooms) can, or do for me, run the opiates of out my system and prevent the typical three/four day withdrawl syndrome that a middling dose codeine addict will probably be familiar with.",
  "It seems that the withdrawl takes place during the trip itself, but many of the symptoms are reduced. I do not get the same writhing/body tension/forced stretch thing unless my eyes are closed, and I do not get the whole-body pain at any stage. Mild headaches tend to occur at the end of the trip, but these are easily ignored. The only symptoms that seem to have their full impact are the intestinal ones, which can be managed.",
  "I wasn't sure if I'd been imagining it in the past, because nothing I've read suggested that acid or mushrooms would remove the physical side of an opiate addiction, but it's been six days, now, since I took any opiates, and five since my last shroom trip, and the only symptoms I have suffered are intestinal.",
  "I can't say I'd recommend this method to anyone who is addicted to anything heavier than codeine, though, as longer, more serious withdrawl syndromes may not be complete in the time it takes for the trip to end, and a lot of poison gunk is removed from the system via the skin and bowels. But if you really need to get off whatever you're on, it might be worth a try. It may also be an ideosyncratic effect that these two psychedelics have on me alone, but I don't think so."
 ],
 "erowid": {
  "id": "49592",
  "citation": " Dan. \"Mushrooms and Opiate Withdrawl: experience with Mushrooms & Codeine (ID 49592)\". Erowid.org. May 31, 2007. erowid.org/exp/49592",
  "substance": "Mushrooms & Codeine",
  "views": "21109"
 }
}
