{
 "id": 8301,
 "title": "Dancing With The Green Goddess",
 "date": {
  "submission": "2001-02-03T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Acid Matrix",
  "gender": "Male",
  "weight": 163
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "glass",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Absinthe",
   "form": "liquid"
  }
 ],
 "report": [
  "'All that we see and seem, is but a dream, within a dream.'  --E.A. Poe",
  "This weekend I was in Rochester, NY visiting a few of my friends for the weekend to go clubbing and just have some fun. We were going to a club called the piranah around midnight, but decided to make an appearance at a party that our friend we were staying with had been invited to.",
  "When we arrived at the party, the hostess offered us a drink, she said 'We have, White Wine, Some different kinds of Beer, and we have Absinthe.' I just grinned, I had wanted to try absinthe for a very long time, and here was a girl just serving it at a party...",
  "Watching her prepare the drink was probably half the fun,  she poured about half a goblet full of the 'green godess' and then pour a tablespoon of sugar and dip the spoon into the absinthe, soaking the sugar,  she then set fire to the spoonfull of sugar/absinthe, and as it melted she poured it into the absinthe, she then mixed ice water in to fill the rest of the glass and put the fire out.  The drink turned from green/yellow to a minty greenish white.  And it smelled like Black Liquorice or Good n Plenty.",
  "That first small mouthful filled my mouth with a very strong, but not at all unpleasant taste and warmth, and when I swallowed, I felt it's warmth flow through me.  Over the next 20 minutes, I drank from the glass, enjoying the flavor, and not rushing, and making conversation with the people at the party.",
  "When we left to go to the club at about midnight, I was feeling very uplifted and warm and music was having some mild auditory hallucinations, music was just sounding so great in the car as my friend drove to the club.  We walked into the club and paid,  and I sat for a bit enjoying the music and the feeling from the absinthe.",
  "At one point about a half hour after we arrived, the music was just seeming to flow through me and I couldn't sit down any longer, and I danced for about 1 1/2 hours until the club closed and we left.  This is strange because I never dance, at least not very much.  The music was having too much of a pull on me to resist.",
  "I found a place that sells very powerful absinthe over the net, but it costs about 200 bucks a bottle, Dave and I are going to put together the money and buy a bottle.",
  "I thoroughly enjoyed my night dancing with the 'green goddess'",
  "Acid Matrix",
  "Dream Well,  There is still alot of beauty in the world."
 ],
 "erowid": {
  "id": "4964",
  "citation": " Acid Matrix. \"Dancing With The Green Goddess: experience with Absinthe (ID 4964)\". Erowid.org. Feb 3, 2001. erowid.org/exp/4964",
  "substance": "Absinthe",
  "views": "92574"
 }
}
