{
 "title": "I Love Ecstasy!",
 "author": "Lily",
 "citation": " Lily. \"I Love Ecstasy!: experience with MDMA (ID 8302)\". Erowid.org. Jul 24, 2001. erowid.org/exp/8302",
 "substance": "MDMA",
 "bodyweight": "120 lb",
 "report": "<p>This has to be the most perfect drug!!!!  I loved it beyond belief.  Last Friday night my boyfriend of 4 years set it up for me.  He had 2 pills (the Blair Witch ones) that he had gotten the previous weekend.  Anyway, he and I live together, and he thought for my first time we should stay home together (he's done it before, but he wanted to make sure I was in a comfortable setting and that I'd have no bad reactions). We had champagne open and bottled water ready to go.  About 8:00 pm we each took half of a pill (since it was my first time we started with a half pill).  We toasted each other with champagne.  I sat there a while just waiting to feel something, and was kind of nervous as I didn't know what to expect.  About 8:45 or so I started to feel a little warm and flushed so I got up to walk around and take some deep breaths.  I went into the bathroom and noticed that it looked SOOOOO white and glowing and I was starting to feel a little light in head (in a good way though).  I came back into the living room and sat back on the couch, still waiting to feel it.  We drank some more champagne and about 9:30 we took another half a pill each.  We also then took a hit or 2 off of a joint.  It was either the second pill half, or else the joint was a catalyst - but oh my God!!!!!!!!  All of a sudden it hit me and I was rolling.  I felt the best I had ever felt in my life.  Everything was glowing, the colors were intense beyond belief.  My body felt extremely sensitive and perceptive.  I was very sexually aroused constantly, but it wasn't just a sexual thing - it was more sensual.  We listened to trance music and danced with each other and it was an out of body experience.  I was one with the music and one with my boyfriend.  I WAS the music!!!  I went and looked at myself in the mirror and was just floored.  I was absolutely beautiful and my pale skin was glowing white and shiny.  My hair looked an absolutely perfect shade of blonde. I had never looked so beautiful.  I came back in the living room and took another hit off the joint.  I was rolling.  Did not feel stoned at all.  My boyfriend and I had the most intense and loving discussion we had ever had.  We told each other how sorry we were for certain things and how much we loved each other and we just talked and talked and we really connected.  It was something that we had needed for a very long time.  We were finally able to stop being so defensive and just shared and listened.  It was amazing.  We hugged and touched and carressed each other and it was like a constant orgasm, even though we were not having sex.  My body was just responsive to the slightest thing.  Just even thinking about sex or about my boyfriend or about my love for him would bring me to orgasm.  It was unbelievable!!!!!  I wish we could have actually had sex, but because of the X he could not keep an erection, though he was as aroused as me.  But believe it or not, not being able to have actual sex didn't even matter.  It was the best sexual experince and feeling I have ever had in my life.  The whole 'rolling' experience lasted until about 1:00 am or so, when we fell asleep.  I woke up at 9:30 am and had no hangover at all, and it did not leave me feeling depressed like coke does.  It was amazing.   I LOVE X!!!!!!!!!!  I cannot wait to do it again!!!!  I have felt good ever since then, and my depression and negativity have seemed to disappear.  I also have no desire to do coke again.  I do coke about every 3 months or so, but after doing X, I will never settle for coke again or do it again.  The coke experience is lame and NOTHING compared to X.  I am going to do X about once a month from now on.  I feel it has helped my relationship with my boyfriend, it has helped me feel better about myself, and I totally understand the purpose of trance music now!!!!  I can't wait to experiment with it more and have even more breakthroughs in my thinking and emotions and perceptions.  The change is lasting.  It has improved the quality of my life.</p>",
 "year": "2001",
 "id": "8302",
 "gender": "Female",
 "timestamp": "2001-07-24T07:00:00.000Z",
 "views": "17325",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:30",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
