{
 "title": "Temporary Insanity",
 "author": "BigAl",
 "citation": " BigAl. \"Temporary Insanity: experience with 2C-T-7 (ID 83025)\". Erowid.org. Feb 15, 2010. erowid.org/exp/83025",
 "substance": "2C-T-7",
 "bodyweight": "155 lb",
 "report": "<p>I thought I would share this experience so that anyone who wants to try this can have a better understanding of what could happen to them. I started smoking weed at 15 and quickly progressed to other highs. Ive tried DXM and assorted pills but never really appreciated those highs like psychedelics. Mushrooms have been something that I have loved and done for a long time. However, once I came to college I met some new people that did drugs of the 2C family.</p><p>I first tried 2CI and it, to this day, was the best high that I have ever had.....I dont think I have ever felt euphoria close to that. About two weeks later I tried a combination of 2CE and 2CC; it was by far the most powerful trip that I have had, intense visuals, unexplainable sounds, and strong body load. It was way more powerful than the 2CC AND 2CE separately but the 2CI was by far more enjoyable.</p><p>A few weeks later I wanted to do the 2CI again but my dealer only had 2CT7. So I figured that the differences could not be that great and just expected another strong trip like the 2CE and 2CC. I took the capsule and opened it on my tongue, I believe that it was 40 mg....he said that the regular dose was 30mg but thought I would enjoy a little something extra. I thought that something for free was always a good thing and obliged. He then got out his homemade GB and we proceeded to take hits until I started to feel a little something come-up. Normally, when I put the 2C drugs on my tongue it would take fifteen to thirty minutes to start to feel the effects. However, within ten I was already tripping.</p><p>I quickly longboarded back to my dorm to meet up with my one sober friend who was going to watch me for the beginning part of my trip. We decided to walk the nature trail on campus. It took about two hours to walk the entire trail and get back to the dorm. The walk was amazing, although I was a bit nauseous. It is really hard to put into words what I saw and felt. The whole forest was alive and breathing....each section was an amazing vibrant color... and sometimes the light would shine through the tops of the trees producing shafts of light that were so real that I thought I could touch them, they seemed like butter to me(as weird as that sounds). But once I got back to the dorm things started to change. I still do not know what happened, I reached the peak, the sun set, or maybe I just started thinking to much but the trip suddenly took a turn for the worst.</p><p>I starting thinking in loops, weird strange thoughts started overwhelming me. I started feeling really sick, and the body load was becoming unbearable. The best way I can describe it is if when you are high off weed you are in the high, but this was as if the high was on top of me and pushing down on me with so much force, gravity was magnified and I was very fragile and weak. I was throwing up occasionally, but nothing was in my stomach to throw up, so it was more dry heaving. This was strangely nice, ever time this happened, I would get total relief from nausea for about an hour.</p><p>I started thinking that I was never going to be sober again and that I was going to go insane. I then started thinking about all the bad things that would happen if I went insane, I would drop out of school, I would not be able to eat and I would die, I would have to go to the hospital........just continuous looping thoughts of death and fates worse than death.</p><p>I then got past that a little and started thinking about my life, everything I had done wrong and my relationships with people that I cared about. It was a nightmare of guilt and anxiety. My roommates were freaking out trying to make me trip less and I even had to call my one friend out of her study session for finals to come and make me feel a sense of reality. That was my biggest fear overall, was my lack of reality. I was tripping nuts....I just couldnt stop the visuals and feelings of complete insanity.</p><p>My friend, M, who came out of her study session started just taking me where I thought I wanted to go, the whole trip I had this feeling of needing to go somewhere, and as soon as I got somewhere I needed to leave. This made me think I was going insane even more. Normally, I have had some shroom trips where things got a little out of hand but I never got into my own head like this. Like on shrooms where it comes in waves, tripping then not really tripping, this was tripping then tripping nuts.</p><p>Needless to say time was passing so so slowly it was unreal. Once I hit the eight hour mark I came down considerably, my vision was still off but mainly the overwhelming paranoia was gone. The last hour was kinda nice, I was just tripping and the night was beautiful. However, the experience changed me. I decided that I would never do drugs again.</p><p>The next day was very weird, I just was afraid to flashback. Over the next week I could not really sleep and when I did I had extremely disturbing dreams. I was over at a friends a little while later and tried weed for the first time in about two weeks and had a very bad experience. For about five minutes I thought I was tripping again, I almost started to panic, but I got over it soon enough. But when I got back to my dorm to sleep I was alone and had this very uneasy feeling and took a long time to sleep. I tried weed two more times after and had OK experiences but when I went to sleep and was alone I did feel very uneasy.</p><p>Its been about a week and I havent done anything....long time I know, and I still feel a little bit off. I dont know exactly what that did but I hope with time I will be better. I still debate weather I should ever do anything again but I think time will tell. All I can tell anyone out there is that 2CT7 is not something for those without experience. Also, my dealer said something to me when I last did it which I didnt understand at the time. He asked me if I was depressed and I said no, not  really giving much thought to it. However, I really think that if I had been I would not have been able to make it through the experience. It was only my will to live that kept me from doing something to myself to make the experience stop. It may not sound that bad from my description but trust me, it shook me to my core.</p>",
 "year": "2009",
 "id": "83025",
 "gender": "Male",
 "age": "18",
 "timestamp": "2010-02-15T08:00:00.000Z",
 "views": "5672",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "40 mg",
   "substance": "oral"
  }
 ]
}
