{
 "title": "I Woke Up In the ER",
 "author": "M",
 "citation": " M. \"I Woke Up In the ER: experience with DPT (ID 8303)\". Erowid.org. Feb 15, 2002. erowid.org/exp/8303",
 "substance": "DPT",
 "bodyweight": "180 lb",
 "report": "<p>I am well experienced with acid and many other things, but nothing could have prepared me for DPT. There was 5 of us over S's house.  We tripped in pairs.  So if anything went wrong there were at least 3 sober people to help.  A and Armurr tried it first and everything went smoothly.  They really seemed to enjoy it.  So then we got the next two doses ready. I snorted mine first and then S snorted his.  We went to a very comfortable room and sat on the couch.</p><p>Not even 5 min. after I had snorted the line I was already getting visuals.  I sat and stared at the patterns floating in the air and watched the tracers of A swaying back and fourth playing video games.  I heard S mention that the feeling in his nose was making him sick.  Then, reality started to slip away and I became part of the patterns.  I could feel the pattern that I was fitting into.  There were no longer arms or legs, but rather wavy lines and shapes that became part of the hallucination and I could feel it.  I could feel every twist and turn that the colors flowed into because I became part of it all.  I knew that I was loosing hold of reality.</p><p>I asked Armurr to talk some sense into me.  As he walked over to me I was snapping my fingers as to make him come quicker and time seemed to wind down to a stop. I thought 'Here it comes!'.  That is the point where I left this world.  The next thing I remember was staring at Armurr and holding his hand.   It seemed that his hand was the only grip on reality that I had.  He told me 'You can bounce things off of me, and I can bounce things off of you'  I thought he meant bounce the patterns back and fourth, but he meant conversation.  So I passed patterns between us.</p><p>The hallucinations quickly became the only thing I could see.  The next thing I heard was him asking 'Is it self evaluation?'  I said yes and it echoed on and on. When I heard it I realized I didn't mean to say yes because it wasn't a normal bad trip.  I had quite a bit of difficulty speaking.  So, to let him know that it wasn't self evaluation I said 'I'm happy' meaning I'm happy with who I am. I got lost for a moment.  Then, I heard Armurr's voice 'Do you see....'  I couldn't hear what he asked if I could see but I said yes anyhow.  Then I saw Armurr's eye floating in all the madness.  He asked me if I could see a yellow cup on the table and some other things.  Each time I began to see what he was referring to it felt like time was a record being started again. It became easier and easier to speak.  Then, he asked if I saw A and I couldn't.</p><p>That's when a dark pattern surrounded me.  I couldn't breath.  The darkness packed in tighter and tighter until I couldn't move anymore.  I felt like I was frozen in time.  Thats when I thought I was dead.  Not until I was inside the ambulance, saw my shoes, and heard the paramedics ask if this drug can make you skitzo did I realize I was alive.  When this reality hit me I panicked.  I'm not sure why, but I did.  I tried to get out of the stretcher and I remember them forcing me down and telling me that they are going to help me.  They put an oxygen mask on me and asked me which hospital I wanted to go to.  I told them and I think I passed out.</p><p>When I woke up I had an IV in my arm and was in the ER. The doctor said that I was very close to having a heart attack.  My pulse was at 155. I am still in the hospital now and I am having very strange flashbacks.  They won't tell me much about my condition and I don't know when I am going to go home.  They think there may be something wrong with my heart and kidneys.  They are sending in a specialist for me. </p><p>---------------------------</p><p>I wrote this in the hospital 4 days after the event.  I was in there for a total of 5 days.  One day was spent in the ER, one day in ICU, and then I was moved to a regular room for the rest of my stay.  It is now 6 days since the event. I am ok now, but my thoughts are still a little scattered.  I have to go back to the hospital and get some tests done on my blood.  I may have permanent heart and/or kidney damage.  I'm sure this won't happen to everyone, but I was a perfectly healthy 20 year old in a very good mindset and it still happened to me.  Be careful.</p>",
 "year": "2001",
 "id": "8303",
 "gender": "Male",
 "timestamp": "2002-02-15T08:00:00.000Z",
 "views": "16277",
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ]
}
