{
 "id": 8309,
 "title": "Short and Comfy, and more Visual",
 "date": {
  "submission": "2008-12-18T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Z.",
  "gender": "Male",
  "weight": 138
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "7.0"
   },
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder/crystals"
  },
  {
   "time": "2:00",
   "amount": {
    "unit": "mg",
    "quantity": "7.0"
   },
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Date: June 2002",
  "Weight: 138kg for me, about 94kg for my friend.",
  "This isn't the same time logging as my other reports; however, the semantics should be useful.",
  "During the day, we'd been up with friends for a wedding.",
  "9pm: After dark, we all met at a farmhouse with multiple fields, etc.",
  "Sound systems started, and friends gathered en masse.",
  "10pm:  my friend and I decided to try 2C-I. He had only taken it once, and didn't have exact precision; however, even knowing 'you can't eyeball miligrams', he's been pretty good about it anyway.[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]",
  "We dropped about 7mg of powder inside a small gel capsule on empty stomachs.  We wandered around and visited.",
  "12am: About midnight, we were peaking, and it was nice.  Lights and color were rich.  Some streaking.  Everything seemed a little lighter in weight.",
  "At this point, despite the difference in weight, we were about the same place.  I don't know if this is because of our various physiologies, or whether this is more dependant on brain mass than body mass.",
  "Anyway, we decided this wasn't really enough for the occasion and we added another 7mg.",
  "1am: the boost was peaking and we were much further in.  We were a little drunk with happiness, but not incapacitated.  Lights were very very rich.",
  "While my friend wandered off to dance more, and stare at the tapestry which was being painted by so many people, I sat down to talk with his girlfriend.",
  "She was feeding off of the energy of the party, but was otherwise sober.  We were at a darker edge of the party, and began to talk.  Speech was free and clear.  Thoughts were relatively normal, for being up in the middle of the night and being moderately intoxicated.",
  "Now, I need to clarify.  I am one of those people who doesn't see things tripping.  5 drops of liquid, and the most I get is wavering of the walls, and expansion of pores when staring into the mirror.  Shadows might do funny things.  That's it.  Mostly a head-trip for me.",
  "So, I now state that the tricks of darkness began to play.  My friend's girlfriend began to morph.  Her face turned into that of a troll.  She took on a faintly greenish tint.  Her face flattenned out and converted.",
  "There was no fear, no danger, just purely visual conversion.  And I was able to convey this, and explain it, and it didn't go away.  I was so pleased and happy, since I'd, in the past, started a program in my mind such that I would be able to visually hallucinate, without fear, and only while tripping.",
  "This was my gateway to expediating that program.",
  "I continue to assert that all psychedelics are tools.  We must respect them, and give them a clear path within us.  We should not fight with them, nor use them flippantly.",
  "So, anyway, we were back down pretty close to baseline by around 5am, other than being tired, with full baseline achieved after finally going to sleep.",
  "We had no adverse effects afterwards, and thinking was clear after awaking. We decided that next time, we would take all 14mg at once for a better peak. After verifying that 14mg is fine, the plan is/was to try around 20mg.",
  "Another thing to note is that normally, I have a little bit of paranoia.  Maybe more than a little.  The biggest problems are being around people I don't know, and being in the dark (for fear of someone hiding, waiting to harm me.  Not that it's more likely, but more that in the rare instance, I wouldn't see it coming.",
  "So, anyway, dark party, middle of nowhere, lots of people I DON'T know.  I still felt discomfort.  I wasn't turned into a mushy love monkey, but I WAS much more able to mingle.",
  "I hope this information helps someone."
 ],
 "erowid": {
  "id": "49679",
  "citation": " Z.. \"Short and Comfy, and more Visual: experience with 2C-I (ID 49679)\". Erowid.org. Dec 18, 2008. erowid.org/exp/49679",
  "substance": "2C-I",
  "views": "2817"
 }
}
