{
 "id": 831,
 "title": "The Being Within the Plant",
 "date": {
  "submission": "2008-03-27T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Dr. Trips",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 6x)"
  },
  {
   "time": " T+ 1:00",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 6x)"
  }
 ],
 "report": [
  "I purchased some extract off of a website a week ago. Much to my delight, it arrived today and I eagerly opened it. I decided to wait until the evening to smoke it with my brother and a roommate.",
  "At 11:00pm, I grabbed an apple from the fridge adn my roommate carved it into a pipe (We didn't want to taint the MJ pipes with the nasty salvia taste). I loaded the pipe up with Salvia and settled into the couch. I knew that the setting was a little off, because the tv was on. So I decide to take it easy and go for a low dose. I loaded up a 1/10 of a gram of 6x extract into the apple and lit it. I pulled in a couple of good hits and, when I realized that it was taking effect, set the pipe aside.",
  "The trip was a mild level 2 on the Salvia scale. I could sense a sort of confusion, my body was acting independently of my mind. If I had taken another hit it would have blasted me off (I have been very high on the scale before). I refrained from going overboard at this point and let the trip settle down. After 10 minutes, I was back to baseline.",
  "Next up was my brother. I packed him a decent dose and let him settle back in his bean bag with the apple pipe. He had a hard time pulling smoke and set it aside after a few hits. He said he could feel something and was anxious to build a gravity bong to get more smoke.",
  "My roommate decided to give it a shot with the apple pipe. I told him to try it in his room away from distractions. I left him in privacy. After 10 minutes, he came out pretty disoriented. Then, he just settled into the couch and grabbed a blunt.",
  "We then settled down for awhile and watched Tv.",
  "An hour later, my brother and I put together a gravity bong out of a 2 liter and a mop bucket. We set it up in my room and got a bowl ready. I sat on the floor and fired it up. The 2 liter was filled with smoke. I got ready, and asked my brother to turn off the lights. I inhaled about half of it and started to spit. I relaxed and held it in. Instantly, I could feel it come on. A very strange inebriation! My visual field became darker and more surreal I sucked down the last bit of smoke, and laid back down on the floor.",
  "Except I became the floor... My vision was extremely impaired. I saw very earthy tones browns greens. I had no control over my body. I remember flailing around like a dead fish. I tried to pull back concepts of reality and managed to pull my self up and get into bed. It seemed like I was a part of everything or everything was me. I was afraid that this was permanent mindset. I thought maybe this plant triggered some psychotic element in my brain and that I would stay in this state of mind forever. My mind would try to pull out information to help me like: 'this will only last 15 minutes' 'people have never been killed by this' etc.. These little pieces of reality I kept trying to hold on to, and they helped me communicate to my brother. They also allowed me to relax a bit. After getting into my bed, I decided to let the plant take me, and meditate.",
  "Then the being spoke to me. I saw strange green patterns and an open mouth with teeth laughing at me. It said 'So you thought this would be fun?!'. The being knew or thought that I was taking this recreationally and not treating it with respect. I starting arguing with it and said I wasn't and that I wanted to learn from it. I told it I had questions. It didn't think I was sincere, but it humored me anyway. I remember saying, 'I don't know what happens if you die, is there a hell or heaven? What is out there? Do you need to lead a good life...' I remeber it cackling back 'Is there a Hell?! Is there a Heaven?! And then it shot me back. I began grasping reality again. For the next half hour I settled back into baseline. I don't know why the plant didn't answer my question, and I don't know why it felt I was not respecting the plant. Until I answer that question, I will not try it again.",
  "My brother tried the gravity bong after I settled down, but, strangely, did not feel anything. Salvia is a strange plant indeed!"
 ],
 "erowid": {
  "id": "12298",
  "citation": " Dr. Trips. \"The Being Within the Plant: experience with Salvia Divinorum (6x extract) (ID 12298)\". Erowid.org. Mar 27, 2008. erowid.org/exp/12298",
  "substance": "Salvia Divinorum (6x extract)",
  "views": "3656"
 }
}
