{
 "title": "My Brain is Screaming at Me...",
 "author": "Serge",
 "citation": " Serge. \"My Brain is Screaming at Me...: experience with JWH-018 (ID 83183)\". Erowid.org. Mar 22, 2010. erowid.org/exp/83183",
 "substance": "JWH-018",
 "bodyweight": "185 lb",
 "report": "<p>I do not remember the time periods, as time was very distorted.</p><p>So far I have tried it on 2 seperate occasions, this will be about both (Although the first occasion was a dud).</p><p>So the first time I tried jwh-018 i eyeballed what im guessing is about 4 mg. it was about four or five salt grains worth, as I have read would be a decent trip. I put this on aluminum foil and vaped it off, this stuff vapes real easy so you gotta suck in quick. I took a hit and didnt really seem to blow out much smoke, I waited five minutes and nothing really happened, Im thinking what happened was that I didn't catch the vapors quick enough, and thats why it didn't cause me to feel anything. I thought I had gotten ripped off and was pretty pissed, and I didnt bother with it anymore that night.</p><p>Boy was I wrong about getting ripped off.</p><p>The following morning I had woken up and decided to try this stuff again, I had nothing to do that day so what have I got to lose. I remember that I had a lightbulb vaporizor and that I saw some articles using one to vape jwh-018. So I went and got my vape and jwh and set off to try this again. I put in about 10 salt grains worth into the vape. [Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]I put the flame below the lightbulb and actually saw the jwh vapors swirling aroung the lightbulb. I made sure to keep on sucking the vapors out and I got about 4 good hits. JWH taste kinda like burnt plastic. Its not bad by any means, it just tastes funny.</p><p>After about 45 seconds of taking the hits, I was feeling it really good. At about 2 minutes I was nicely baked, it feels alot like pot, however, I didnt stop coming up. I got higher and higher and higher and for about 10 minutes I was coming up too strong and too fast. At this point, I was getting scared because I wass tripping too hard, I didn't have anxiety like some people get, I was just scared because I was still not at the peak. As I was coming up things that I noted were heavy visual distortion, brighter colors and objects, color distortion, geometric hallucinations, heavy body load, numbness of whole body.</p><p>The peak. What can I say? The peak lasted about 2 hours in real time, however, it seemed to last a couple of days because time was so distored. I was feeling amazing, it's unlike anything I have ever experienced. Besides the afformetioned effects, my brain was going crazy. It was literally screaming at me. I cant explain this, but my mind was yelling at me and I didn't know what to do, this to me, was funny and I had started laughing. The laughing was more enjoyable than usual, however, I couldn't stop, my brain wouldn't let me. I know it sounds crazy but I couldn't control the laughing, I tried to stop, but it was like I wasn't in control of my own body. My mind was so blown, I couldn't make myself move. The visual distortions were becoming too much for me, so I tried to shut off my laptop, but I was so high I could do it. The sounds and sights were becoming too intense for me, even touching objects was too intense. There were alot more effects and stuff that happened, but I dont even remember, I was too high.</p><p>The comedown was nice, it felt like I was very, very stoned. The intenseness of the trip was over and the stoney feeling was quite enjoyable and lasted about 4 hours after the peak. By now I had the munchies and was very tired. I went to go get something to eat, and then lights out for me.</p><p>All in all, the trip was almost too intense, but for me, I find this intenseness enjoyable. Definitely scary at times, but once I learned to let go and let my mind take over, it was smooth sailing from then on out. Thanks for reading!</p>",
 "year": "2008",
 "id": "83183",
 "gender": "Male",
 "age": "21",
 "timestamp": "2010-03-22T07:00:00.000Z",
 "views": "13268",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "15 mg",
   "administration": "inhaled",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  }
 ]
}
