{
 "title": "Relaxing",
 "author": "Oxalis",
 "citation": " Oxalis. \"Relaxing: experience with Salvia officinalis (leaves & extract) (ID 83180)\". Erowid.org. Apr 19, 2010. erowid.org/exp/83180",
 "substance": "Salvia officinalis (leaves & extract)",
 "bodyweight": "180 lb",
 "report": "<p>Alcohol Extraction:</p><p>About 30 - 20 cm tall plants, roots removed, were frozen to break the cell walls of the plants.  The frozen plants were blended with 750 ml 98% ethanol/water.  The mixture was steeped for about one week but that was probably longer than necessary since thujone is highly soluble in EtOH.  Plant material was filtered out using several layers of cheesecloth.  The extract looked like the darkest green I have ever seen.</p><p>About 2 oz of the crude extract was a good dose, orally diluted with a beverage.  The flavor was intense and grain alcohol is not tasty.  After about 10 minutes, the feeling that I felt was relaxing and calming.  The interesting part is for about 30 minutes, I lose track of time and it flashes by.  I feel like I am thinking of nothing, truly nothing.  I am unable to concentrate on anything important.  I find myself spacing out.  It is a good way to end a stressful day.</p><p>Smoking</p><p>I grow my own sage and pick the large fragrant leaves and save leaves from pinching (a pruning technique for herbs).  I allow them to dry in my basement so the humidity is right for smoking them.</p><p>I have smoked sage leaves through a pipe and joints.  It is a tasty smoke though a little thick.  Joints seem to be a smoother smoke.  I inhale the smoke but puffing is a way to enjoy the taste but is unlikely to cause effects.  It is a relaxing smoke and reduces concentration.  It blends well with cigarette tobacco, peppermint, and cannabis.</p>",
 "year": "2009",
 "id": "83180",
 "gender": "Male",
 "age": "24",
 "timestamp": "2010-04-19T07:00:00.000Z",
 "views": "14817",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Salvia officinalis",
   "form": "(extract)"
  },
  {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia officinalis",
   "form": "(dried)"
  }
 ]
}
