{
 "title": "A Ring Modulator Stuck in My Ears",
 "author": "Conquistador",
 "citation": " Conquistador. \"A Ring Modulator Stuck in My Ears: experience with DiPT (ID 83199)\". Erowid.org. Apr 23, 2010. erowid.org/exp/83199",
 "substance": "DiPT",
 "bodyweight": "150 lb",
 "report": [
  "<p>I'm an extremely experienced psychonaut- I've taken psilocybin mushrooms many times, LSD a few, marijuana for a long time (but no more due to paranoia), MDMA a few times, DMT once, DXM many many times, amanitas muscaria, morning glory seeds, cocaine, salvia, 2C-T-21, and 5-MEO-DIPT.  I came across a small dose (50mg) of DIPT and my girlfriend and I both being musicians and recording engineers, we were SUPER STOKED to try out something that would only fuck up our hearing.  I had read most of the trip reports that I could find, so I knew what I was getting myself into and that I should take an antacid to mellow my stomach.",
  "Here's the situation-  NYE with my girlfriend (also very experienced with various substances) on a relaxing snowshoeing and skiing trip.  After a long day of skiing, we each took 50mg (in capsules) around 8pm with a 600mg calcium tablet (instead of the antacid as there were no stores within an easy distance).  We had just eaten a very spicy dinner and had a couple glasses of wine each, which I would NOT recommend as you'll read below.  We made a cozy blanket and pillow den in our cabin and had a decent Roland studio monitor setup for our listening trip.  We were both in good frames of mind, totally relaxed, happy, and lovey.",
  "T + 1hr.- started to feel something, harmonic sounds started to descend in pitch.  By T + 2hrs., all harmonic sounds were completely ring modulated.  We listened to mostly ambient stuff (Brian Eno, Aphex Twin, Fennesz, Terry Riley, Spacemen 3).  Talking became extremely bizarre and we both thought that we were talking with ridiculously deep voices.  We recorded a little bit of our speaking, and on later listening, we seemed to actually be speaking lower than normal. ",
  "Finally I decided that I had to hear something that I was familiar with, so I put on some Radiohead and JESUS CHRIST it sounded bizarre.  At that moment, I realized that any non-pitched sounds (including drums and even sibilants and pick scrapes) sounded completely normal.  Somehow, this drug destroys only pitched sounds in an extremely non-linear fashion.",
  "Now, the only problem was that both me and my girlfriend both felt EXTREMELY queasy throughout the trip and had to use the restroom about 8 times each.  I'm guessing that it was due to our meal of very spicy foods and the couple of glasses of wine beforehand.  Next time I would eat very lightly and not drink any alcohol for probably 4 hours before ingesting.",
  "I did notice some CEVs that were really gorgeous, but I kept getting distracted by the stomach issues.  I had a couple of enlightening moments, but nothing that really stuck with me.",
  "If you have access to Pro Tools or some other digital audio workstation, try setting a ring modulator to these settings- 100 Hz, sine wave, high frequencies cut at 7 kHz.  If you want to stay away from the negative aspects of this particular substance, try putting a mix of your favorite music through a ring modulator with those settings for about 8 hours.",
  "At around T + 6hrs. we each took a xanax just to go to sleep and to stop the insanity in our ears.  I woke up the next day with pretty intense residual effects, lasting until T + 24hrs.  My girlfriend was totally fine the next day.  If there were no weird body effects, this would be AMAZING to go clubbing on!</p>"
 ],
 "year": "2010",
 "id": "83199",
 "gender": "Male",
 "age": "29",
 "views": "6710",
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "DiPT",
   "form": "(capsule)"
  }
 ],
 "submissionDate": "2010-04-23T07:00:00.000Z"
}
