{
 "title": "Frozen in the River of Time",
 "author": "SubConsciousX",
 "citation": " SubConsciousX. \"Frozen in the River of Time: experience with Salvia divinorum & Cannabis (ID 83203)\". Erowid.org. Jan 4, 2013. erowid.org/exp/83203",
 "substance": "Salvia divinorum & Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>Biography: I am a male, roughly 120 lbs, and 17 years old at the time of this experience. Ever since I was acquainted with my first parapsychological phenomenon as a child I have questioned the true nature of reality (even if I did not consciously realize this notion until recently) and have inevitably found myself creeping further down the rabbit hole of conscious evolution ever since. Life just seems to get stranger. :)</p><p>Psychoactive History: Caffeine, Tobacco, Alcohol, Marijuana, Kava Kava, Diphenhydramine, Dextromethorphan, Ecstasy, Cocaine, Dextro-Amphetamine</p><p>Background: It was the last year of high school when I decided to experiment with more than just marijuana. At this point in my life I did not realize what I was searching for, or rather, I forgot and lost sight of the real reason anyway. All I knew was I wanted to experience every 'reasonable' drug-induced mind state I could and spent countless hours prowling online archives for potential drugs to be experimented with.</p><p>Mind Set & Setting: I was relaxing at my friends house one early-spring afternoon with three of my close friends. I cannot remember if there was music playing or not; if there was it was probably some chill, downtempo electronic music as that was normally the case. I felt relatively comfortable in this house as my buddys room had become known to our group as the designated drug experimentation zone. I was stoned and a bit nervous to trip on Salvia during a free period.</p><p>Experience:</p><p>Intro</p><p>It all started with my friends and I sneaking off school grounds during a free period to get stoned at a buddys house. I sat on my friends futon while we passed a bong between us. I smoked three hits (~ 0.25g) of some mid grade marijuana and felt normally stoned (e.g. the feeling you get when you habitually smoke every day). My friend proposed I try smoking some salvia extract and, having no major effects before, I thought why not. Previous to this experience, I was only familiar with the effects of the unadulterated leaves of this plant as I had been growing my own salvia at home. Upon being handed the bong of salvia extract I felt butterflies in my stomach. I tried to clear my mind and then pressed on to take a hit of the foul, plastic-tasting smoke. I took one hit and upon exhaling I quickly took another as I kept the jet flame on top of the black extract.</p><p>Physical Reality</p><p>Its funny because its at the moment I took my second hit that I dont remember anything I physically did for the next five minutes. It was like I had relinquished complete control and sense of my body and was immediately blinded to my external senses. I dont remember blowing out the smoke nor moving around the room, but I did; I suppose this is why it is a good idea to have a sitter present if you are new to the substance. Despite being blind, deaf, and dumb during the experience this was in no way frightening at all. Salvia is kind enough to disallow you to realize any of this is even going on. I was immediately thrown into a trip in which I thought the trip was my normal waking reality. I could not tell, like on milder hallucinogens, that I was in fact tripping. Its so instantaneous that its not only after I came down from my high that I realized I had just smoked salvia. My friends explained to me what I had done after I came to; they told me I dropped the bong on the floor (dont worry, it was acrylic and didnt spill due to quick bong-in-distress reflexes on my buddys part), stood up with a crazy-eyed expression on my face, walked over to my friends patio door in which I attempted to open it a few times to no avail, and then just stood staring blankly in front of me. The interesting part about this is the bodys eerie power of functioning by itself when little to no mind is present. Anyone who has drank too much alcohol can attest to how weird (and annoying, embarrassing, ridiculous, etc.) this state can be when you are not mentally present within your body, but you continue to carry out actions for uncertain periods of time!</p><p>Mental Inner Space</p><p>On the surface, Im sure I looked as if I was a zombie droning around trying to pass through a seemingly impenetrable doorway, but that was nowhere close to the reality I was registering. In a matter of seconds my external sensory input of life warped inwards and nothing existed outside anymore. This happened as I looked outwards through the glass door at my friends patio. I was observing the foliage of the trees when I remember saying to myself, everythings freezing, when suddenly my body started feeling like it was being pulled apart in opposite directions in neat lateral cross-sections down my entire body (one cross-section would be pulled left, the next cross-section below would be pulled right, and so on). This all happened within a few seconds and then everything went white; the outside scenery completely disappeared. What was so surprising the entire time was that through all of this there was no bodily discomfort or internal dialogue freak out sessions. It was the strangest thing, as if it was my normal state of being to be frozen in nothingness. The white void then proceeded to get static-y like on a TV and within a split second I was looking down within a black void of space at a cube.</p><p>At this point I began to sense I was within the cube despite being a distant observer of it in the infinite darkness. It was as if my eyes were in space while the rest of me were within this cube. As I watched, I was being rolled around within this reality cube by a giant malevolent purple hand, utterly unaware of its presence by the little me. It was at this point of the trip that I was thrust back into my body and in seconds everything within my line of sight warped back into view like a whirlpool effect transposed on the center of a picture. It was not until my friends came back into focus that I remembered my name and who I was. All of these things were 're-downloaded' into my memory bank within milliseconds yet all the while having awareness of this 'rebooting' of thoughts about myself. How the hell could I have forgotten my identity or even that I am human? Until then, I did not think these things possible.</p><p>Conclusion</p><p>After I came down from the visual hallucinations I felt a little hazy, returning to normal after about ten minutes or so. After discussing what happened with my friends I could not stop laughing to myself at how I was about to go back to school having gone through an intense five minutes of reality dissolving ego death. How could anything taught to me in math class today even compare to the experience I had just gone through?</p><p>Overall, this to date is the strongest hallucinogen I have ever tried and for that reason I rarely do it, but with enough mental preparation, and used appropriately, this drug can lead to incredible insights on the Self.</p>",
 "year": "2007",
 "id": "83203",
 "gender": "Male",
 "age": "17",
 "timestamp": "2013-01-04T08:00:00.000Z",
 "views": "759",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "",
   "amount": "",
   "administration": "2 hits",
   "substance": "smoked"
  }
 ]
}
