{
 "title": "TMA-2 is Not for Me!",
 "author": "joshi",
 "citation": " joshi. \"TMA-2 is Not for Me!: experience with TMA-2 (ID 8325)\". Erowid.org. Jul 25, 2001. erowid.org/exp/8325",
 "substance": "TMA-2",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "35 mg",
   "oral",
   "TMA-2",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>This is an experience which I had a bit over a year ago.  I started at about 11 in the morning, taking a capsule of 35 mgs TMA-2, while a friend injested some peyote buttons.  I was on no medications/supplements, and I did not eat that morning before dosing.</p><p>After determining that neither I nor my friend was going to be violently ill, we went outside.  I felt warm, and my eyes teared in the sunlight.  The body high felt a lot like MDA, but not as consistantly present, nor as  strong.  We sat in the afternoon sun, in a park, and watched people go by.  He had not eaten enough peyote buttons to trip and I, well...  I kept having the feeling that I was on the verge of having visuals, like maybe a building would change color momentarily and then return.  It was actually rather frustrating, as I had slowly to give up the notion that the experience was going to develop into anything more substantial.  Still, it was relatively enjoyable at this point, and I had a brief moment of 'merging with the music' as we rode in a car later.  Mentally, there was also not much going on, with the development of neither particularly empathogenic nor psychedelic mind states.  I felt, in this respect, somewhat stoned, as I might be on very good weed, but that was it.</p><p>HOWEVER...  the experience (or at least the physical parts thereof)dragged on and on, with the drugged body high decreasing ever so slowly as the hours ticked by.  At about 8 or 9 PM, I began to develop the worst headache that I can remember ever having.  Codeine asprin (the over-the-counter kind from Isreal, so not particularly effective stuff) did not even put a dent in the headache.  It was a dull, pulsing pain, and it took over most of my consciousness.  Even as the other drug effects wore off, and I found myself in a condition to think about sleep, at about midnight or so, the headache persisted.  It persisted, in fact, well into the next day, not dissipating until the afternoon, over 24 hours after the ingestion of the chemical.</p><p>I have had one more experience with TMA-2, which occured maybe four months after the initial one.  This time, it was combined with LSD and MDA, both substances that have (more or less) treated me fine in the past.  This time, I of course had a significantly psychedelic experience, but the thing that the two trips had in common was that again, about eight or nine hours after the ingestion of the TMA-2, I develped an *awful* headache.  This time, the headache took a bit less time to dissipate, but it was still pretty terrible while it lasted.</p><p>In brief:  I don't at all like this substance.  It seems pretty weak to me -- rather akin, but inferior, to MDA, if perhaps longer lasting -- and the physical price it exacts is pretty high.  I have no idea whether the headache is perhaps indicative of some kind of damage (Shulgin talks about headache being a particularly bad sign in PIHKAL) but, regardless, I'm never doing this stuff again.</p><p>joshi</p>",
 "year": "2000",
 "id": "8325",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-07-25T07:00:00.000Z",
 "views": "18696"
}
