{
 "id": 8329,
 "title": "A Trip Into Childhood",
 "date": {
  "submission": "2008-04-05T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Element",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "(Times past 2:30pm are estimated)",
  "Purchased an 1/8th of shrooms at $20, it consisted of one large mushroom and several smaller ones.  This was my first time, so my friend 'J' joined me. ",
  "2pm:  'J' and I consumed just under an 1/8th each with orange juice.  While waiting for the effects to kick in J mentioned that nature is really the best place to be for shrooms, so I told him that there was a network of trails nearby that I had grown up exploring as a kid, and now worked in during the summer. We packed a backpack with some soda, the bong, and a lot of water.  I told him some stories about where we were going. (In retrospect, we wish we had brought food as well.) ",
  "2:15pm: We hiked around 2 miles down into the canyon, moving fairly quickly to get to a campsite before the effects took hold, and so we could smoke and eat the remaining shrooms.  We moved so fast that it wasn't until I actually arrived and took the time to look around that I realized I was starting to see things.",
  "3:00pm: This campsite had a few tables, and was placed next to a full creek (it was January).  While I waited for my friend to make a call I sat and prepared the bong.  After a few moments I realized that a particular stand of trees nearby was waving in a very odd manner.  I got very excited and forgot all about the bong for the moment and stared.  The closer stand of trees was interacting with the trees on the steep hill behind moving both closer and farther, with some strange side to side movements that are hard to describe.  We proceded to smoke about 2 bowls, and continued on to where I hoped would be the best place, a very well maintained campsite, with two creeks, a very small waterfall, and many tall trees, mostly Eucalyptus.  (This is a non-pine tree/redwood tree kind off place). ",
  "4:00pm:  On arrival, I lay back on a bench and stared upwards listening to music.  The canopy of leaves began to make unusual moving triangle patters, and purple edging appeared in some places.  The layers of leaves made for a very amusing 3d effect as well.",
  "This is where the true mental part of the trip began. I mentioned earlier that I had basically grown up in this canyon, I spent many weeks per summer at a daycamp.  These are some of my fondest memories of childhood. ",
  "4:30pm: I freaked out a little bit when we thought we had lost the weed, but a few bowls later I calmed down a lot.  I lay back and used my coat as a blanket, pulling it over my eyes.  I do not remember how it started exactly, but I began to flashback to much earlier days.  Memories long forgotten became as real as life.  I literally relived some of the scenes.  I must admit that my 18 y/o self broke down at this time, and I cried quietly into my jacket for the better part of an hour (estimated) as I tripped. ",
  "5:00pm: My friend J was quite restless and convinced me to walk farther on the trail with him.  I stopped mentally tripping for the moment, and resumed visually tripping.",
  "We walked some ways and as we passed a group of people I realized that I recognized one of them, a 6 y/o that I knew quite well from working in a class for a year.  (I may have hallucinated this, she could have been some random kid.)",
  "I began to jog, and finally broke into a full run.  I estimate I ran as hard as I could uphill for about 1 mile before I realized how tired I was.  At the end of the run, during the last 100 yards or so I could hardly run straight and had to slow down just because the world kept streching in wierd directions, and the ground would occaisionally heave.  During this run I kept seeing things that I saw long ago, little things that certainly weren't there anymore. ",
  "The earlier parts of this trip were nothing compared to what my mind began to dish out at this point.",
  "5:20pm: I finally collapsed on the side of the trail and pulled my jacket over myself like before.  This is where I REALLY began to take a trip back into childhood.  The whole experience is a blur, but I remember the most significant points.  I literally BECAME my younger self.  I mentally reverted to the age of about 3 or 4.  I began to remember not only things that happened to me and around me as a kid, I began to remember what I used to daydream about.  I remembered that I thought in soft cornered squares. I remembered how much I loved cars.  I remembered how much I had loved my parents.  (I broke down again at this point).  I remembered looking out of a jacket I havent had since I was 5.  I remembered all of preschool and elementary school and most of all I remembered my best friend from that age that I rarely see anymore, and how his mother used to be like, a 2nd mother to me.  It was very bittersweet.",
  "(Time went away)  J finally caught up, but I was not ready to get up so he left for a while and came back after about an hour.  I could talk with J when I finally got up, but I had the thought processes of myself as a kid, now about 7-10.  A cartoon racoon kept popping up, and occaisionally the world would turn to sequins for an instant when I blinked.  The world was very patterned, nt in odd flowing shapes, but the same images kept passing by, some of the place i was, some from the same place in the past, and some from completely different places.  I kept remembering what these trails had seemed like, and I remembered a particular trail I used to walk every day with my dad to go to a from school.  I also said many times over and over that 'This is WIERD!!!'",
  "J and I suddenly remembered that we had planned on watching the sunset, but we were a long way from where we could see it and it was coming soon.  We sprinted all the way up the quickest (steepest) trail, but missed it anyways.  This was probably a bad choice, because after the run, I was hardly tripping at all anymore.  We built a small fire, then realized we didnt have any food.  We walked about 3 miles into the city to get food, and then called for a ride.  I should have called someone else, this guy, M, quickly got 3 more people together and wanted to go to the movies of all places, and see a 10pm show. J and I were both utterly drained physically and mentally at this point.  We just wanted to go back to my place and crash.  We both agreed that we would rather nap in the car while they watched the movie, but M would have nothing of that and wouldnt give up the keys. (Bastard).  We paid $10 each to sleep through Walk the Line, and the others didnt even sit nearby, even though it was by their demand that we paid to go see the movie with them.  Once again, bastards. ",
  "Afterthoughts:",
  "I learned a lot about my old HS friends compared to my new college ones.  The old ones all seemed immature, and rather selfish, all their jokes were at the expense of another in the group, and the main reason that they insisted we see the movie was simply because we didnt want to and they got pleasure out of that.",
  "My love for my family and true friends has returned from the back of my mind, and I appreciate them all the more for it.",
  "I also came to terms with how much me merely passing in school for many many years has dissapointed my parents, and I resolved to try harder.",
  "This rather difficult and yet immensely happy and gratifying experience is not one I will ever forget.  It has changed the way I think about everyone I am close to or thought i was close to.  It has shown me what I actually think is more important than what others might think of me as a reult of what I think.",
  "I am a better person."
 ],
 "erowid": {
  "id": "49758",
  "citation": " Element. \"A Trip Into Childhood: experience with Mushrooms & Cannabis (ID 49758)\". Erowid.org. Apr 5, 2008. erowid.org/exp/49758",
  "substance": "Mushrooms & Cannabis",
  "views": "11893"
 }
}
