{
 "title": "Explorations Two Through Four Wasted",
 "author": "glorfindel",
 "citation": " glorfindel. \"Explorations Two Through Four Wasted: experience with Salvia divinorum (ID 8332)\". Erowid.org. Jun 28, 2005. erowid.org/exp/8332",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "report": "<p>I take an SSRI (citalopram) and carbamazepine (for non-seizure problem).</p><p>Two days after my pleasant, mild 1st try of the tincture (dosage: a mere 2.5 droppers diluted with 1 dropper water, taken and held under tongue, spread out over 15 minutes) I decided to try the same dose undiluted. Again, I waited until it had been 12 hours since I'd taken any medication. I split the dose in half, waiting 5 minutes between doses.</p><p>Nothing much happened at all--none of the enhanced sound or mild eye-closed visuals. It was noisier in the house with more activity, though I kept quiet and still with my eyes shut. About all I got was a more burned feeling to the mucous membrane on the floor of my mouth.</p><p>A couple days later I decided to try again. I had had a little digestive upset in the interim--nothing serious, and it was clearing up.</p><p>This time I stayed off meds for 24 hours, which is physically uncomfortable. I waited until things settled down more in the house. Then I put three droppers, all at once, under the tongue, held 5 minutes, and swallowed.</p><p>Within 5 minutes I was feeling a little woozy and slightly drawn somehow into the upper right side of my head. Perspective seemed just slightly distorted, as though I were looking down a mild wide angle lens. I also started to sweat profusely, even considering the hot weather. Unfortunately I also realized I really should get to bed. I definitely felt rather strange, and given more quiet time to observe things, could probably have made more of this experience.</p><p>The next morning, after a night of vivid realistic dreams, I had a strange feeling of having missed something/someone that had been waiting for me the night before in Salvia-land. So, since I left for work early, I made the stupid decision to take the stuff along with me and do it in the car, while I waited for time to go in.</p><p>T+0: Before leaving for work, I took both my meds (citalopram 40mt and carbamazepine 200mg). I still wasn't sure I would go thru with it.</p><p>T+20min.: I arrive at work and park in a little-too-obvious place. Then I take 3 droppers under the tongue, turn on some relaxing tunes and shut my eyes. This experience was a lot like the night before, though the distortion and wooziness were somewhat more pronounced. I also sweated a lot and felt a little queasy. Silly person, I thought, to do this while still having a slight touch of tummy trouble, but that was as far as it went--no real sick to the stomach feeling.</p><p>A couple of early-bird coworkers happened to walk near by, but I was feeling trippy enough to not really respond.</p><p>T+30min.: I made another dumb and potentially dangerous move and decided to go into the building. Though still just slightly woozy, I went to my cube and logged in to do a little surfing. Strange thing, though: I found it very difficult to understand text on the screen, though talking to coworkers wasn't hard at all. I could make out words easily, but combining them and parsing the sentence was a real challenge. This lasted about 3 minutes more.</p><p>Finally, just as I was starting to return to this world from the fringes of Salvia-land, I was asked to move my car a short distance. That proved no challenge, and the parking lot was safely rather empty too. But walking back across the flat, level parking lot,  it looked as though I were climbing a slight incline. By the time I got back to my desk I was pretty well back to normal, but still had the 'missed someone' feeling.</p><p>I WON'T try this again at work or in any other public place--certainly not one with any significant chance of meeting people.</p><p>I also learned that the mucous tissue 'burn' (which isn't all that bad, really) left under the tongue is actually worse, for me, if I spread a multi-dropper dose out rather than take it all at once.</p><p>Only problem then is the huge quantity of saliva produced. Hmm: salvia, saliva. I guess I should have expected it. :-)</p><p>I'l try again in a few days under thoroughly controlled circumstances and see if I can do some more real exploring.</p>",
 "year": "2001",
 "id": "8332",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-28T07:00:00.000Z",
 "views": "3475",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 ",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(liquid)"
  }
 }
}
