{
 "title": "Sparkle",
 "author": "Jovialla",
 "citation": " Jovialla. \"Sparkle: experience with 4-Methylmethcathinone (Mephedrone) (ID 83324)\". Erowid.org. Mar 28, 2010. erowid.org/exp/83324",
 "substance": "4-Methylmethcathinone (Mephedrone)",
 "bodyweight": "144 lb",
 "report": [
  "<p>BACKGROUND",
  "So it's a saturday, I don't really have any money to spend, therefore haven't been shopping like usual and instead have been on the sofa feeling a little sorry for myself and watching some snooker. I'm 24, female, live in the northwest of england and am a very occasional drug taker. I used to smoke pot, especially during my teenage years and during a year I spent in Berkeley (where I probably did the most experimenting), but other than that I have done:",
  "- cocaine maybe 5 times (which I greatly enjoy except for the aftermath of not being able to sleep)",
  "- ecstasy 3 times (only one of which was pleasant and all of which were accompanied by heavy drinking - and sometimes \tvomiting)",
  "- ketamine (which I really really enjoy and probably one of my favorites, but can't hold of so easily now)",
  "- large amounts of nitrous",
  "- salvia 15x extract (glad I did it and crazy trip butd doubt I would want to do again - probably most peoples opinion)",
  "- some mushrooms (but only a little and nothing strong, though have no idea what type)",
  "- vicodin (which were a nice couple hours)",
  "- DXM (am highly sensitive to it and visual effects last several days on me)",
  "On 1st of January I gave up smoking (was at 5 cigarettes a day) and have been on Atkins diet induction since then (meat, cheese, eggs, salad mostly). I have also heavily cut back on drinking as was drinking most nights and usually partying too hard and binging at least once a week, but have only had a couple drinks since 1st Jan.",
  "THE DRUG",
  "So onto the experience. I bought a couple 0.25g Sparkle capsules from a headshop online after xmas, as it got good reviews and thought it would give my boyfriend and I something to do on new years eve, having not had any drugs for probably going on a year now. I also figured that if the good reviews were just a marketing ploy, we wouldn't have spashed out for a whole gram, which comes in at 40.  new years eve and therefore not taking the substance, as by the time he had arrived at the party I was wasted on shots anyhow and the people who we were around probably wouldn't have appreciated it.",
  "So having had a boring saturday in the house, I thought I might take the Sparkle. From what I can see online, I believe this is a mephedrone mix of some sort, though there is very limited posted on the substance named Sparkle itself and I only think this due to a couple of opinions on message boards.",
  "My boyfriend phoned from work for a quick chat around 4:20pm and I told him I was thinking of taking it, which he laughed and told me to have a good time. I then decided to just do a quick online search again to see if anything more had been posted about Sparkle since the last time I looked. Not really, but as I say, it seems it is probably mephedrone. Having read reviews of mephedrone I therefore decided injestion was the way forward, as the general concensus on insufflating is that it is very painful.",
  "TIMETABLE",
  "So here was my experience:",
  "4:36pm \tEmpty 125mg into half a beaker of sprite zero and drink. No noticable taste.",
  "4:40pm \tDecide might as well do the rest, having read some further experiences and dosages for mephedrone.",
  "4:41pm \tMix rest with sprite zero and drink. More bitter - used less sprite.",
  "4:48pm \tWatching 'Final Score' soccer show and notice brighter, more vivid colours but believe this may just be due to \texpectation",
  "4:51pm \tDid have a sore throat, but notice a definite numbing effect, similar to over the counter mouth ulcer gels. Colour \tenhancement definitely present and quickly focusing eyes when looking at something new is difficult - similar \t\tvisuals to DXM but more pleasant and not feeling naseous like DXM often made me.",
  "4:54pm \tShocked at how quickly feeling has set in. Slightly difficult to type. Extremely relaxed muscles. Similar to ketamine but wanting to be active - though been a long time since I last did that so maybe not. Waves of euphoria. Face fees very good. Washing machine in kitchen quiter - TV noise more focused.",
  "4:56pm \tFeel the need to check curtain completely closed - slight paranoia but only lasts a minute. Speech on TV is very echoey. Feel the need to move around and experience this fully. Typing speed phenominal.",
  "5:00pm \tText my BF to let him know how amazing this stuff is, very euphoric. End up writing 5 messages. Making lots of mistakes but manage to do to the whole thing in 6 minutes - end up more just a sequential list of my thoughts - high now so can't think of the correct term. Am hitting computer keyboard keys very hard and they are making a pleasing \tclicking noise. (Actually 5:15 now but have lost track of what I am doing.)",
  "5:16pm \tVision slightly shaky and grinding teeth slightly - am going to go enjoy this now and feel like playing Wii Fit Plus.",
  "5:23pm \tDedided to play some Wii Fit in underwear. Doing balance tests getting OK scores. Finding bending knees quite a lot as if trying to lower center of gravity. Wii fit age 25, actually age 24  so pretty good. Last age was 33 a couple days ago - weight a little more. 10 stone 6lbs - probably all the damn sprite. Feel the need ot write down the monologue going on in my head. Suck at balancing on one leg for yoga but feel more flexible for others.",
  "5.40pm \tSat down for a couple minutes and stand up too fast and fall forward almost into coffee table, but catch myself fine. Misjudgement of how high I still am.",
  "5:45pm \tDone somemore Wii fit... scored my top score on super hula hoop - and actually managed to do 4 proper pressups for a \tchange in the strength challenge section (normally on my knees can't eve do one). Crazy shit. Feel like the main euphoric high dying down now though.",
  "5:54pm \tFeel awlfuly sad when my little Mii get knocked off the assault course, which is happening a lot. Usually quite good \tat this, so think the Sparkle has effected my predictive/perceptive bases quite a lot.",
  "6:00pm \tNow definitly coming down. Grinding teeth mucn much more. Still feel good though and wish I had more (want BF to \texperience this too much to steal his)",
  "6.27pm \tWent to go and try and orgasm whilst still feeling the buzz, but low batterys prevent this :-). Quickly changed with \tWii remote batteries (hands shaking a bit), but can't orgasm and suprisingly dry down there. Body was becoming more and more relaxed but everything in brain was too frantic and frustrated to acheive.",
  "6:29pm \tActually feeling suprisingly back to normal now. Grinding teeth and typing still very fast and vision a little delayed but all in all feel fine. Actually feel pretty good as was expecting bad headaches etc. Buzzing a little, but think I could probably sleep if it was late and I needed to.",
  "6.34pm \tDecide to write an introduction to this and upload it, as think experience is pretty much over and really feeling OK \tbut have 'biscuit mouth' as we used to call it smoking canabis.",
  "7:04pm \tFinish writing intro and still no bad side effects. Grinding teeth a little and possibly a bit sweatier and warmer \tthan normal but not a bad thing considering how cold out flat is!",
  "7.24pm \tHave stuff to do around the flat... including cleaning out pet cage - just realised scents not at strong as they \tcould be, but maybe just the beginnings of a cold.",
  "8:10pm \tHave been on phone to mother for 40 minutes (was in 2 minds to pick up). Found myself speaking very fast but disjointedly as having to repeatedly pause and think of the next string of words. She didn't sound like she noticed though or thought anything was up - I did make a comment about having had too much coffee to cover (no caffiene today). ",
  "8:15pm\tStill feeling warm, alert and quicker motor skills and impressed with previous phone conversation as had to try and \tget round a problem my mother was having online with ordering something to an address she didn't live at. Ended up getting round it by setting up a new account amoungst other things, but did it all very quickly and methodically, equally, if not more, then when sober.",
  "8:42pm\tDry mouth remains, but feeling fine and mentally back to normal.",
  "ANALYSIS",
  "Well that's it. I've written this whole thing during the experience, so spelling etc may not be quite right in places, but overall impressed with what I have written and how aware I am of how I feel. I wouldn't normally have written about this, but felt it would be a good thing to have this posted, with 'Sparkle' noted, as I couldn't find much about the actual experience of this pill, just glowing reviews.",
  "I was somewhat skeptical of taking a legal high as I didn't think it would be overly effective, plus I was worried, just as I am with any drug I take, about what it will do to me and it's contents - I tend to prefer to know what I'm getting into.  Seeing as 'Sparkle' is a fairly new substance, and no long term studies have been done on the effects of it/mephedrone (if that's what it is), I was also taking this into account.",
  "UK LEGAL STATUS",
  "As a side note, I've seen in the UK news just in the past few days that mephedrone on the UK party/club scene has become a worry to the government and the drug being legal is getting a lot of press. It is currently January 2010 and judging from what they have been saying, I think, by this time next year mephedrone will have been outlawed in this country - following the recent outlaw on Spice, BZP etc. From what I have read, it will take at least 6 months organising and legislation to ban the substance and based on my experience I will definitely be getting more so long as I can and if you are wanting to try some, encourage you to too. I remember mushrooms being legal when I was living in London and thinking they would be fun to try, but never getting around to it for one reason or another. Then all of a sudden they were banned and out of all the shops - don't leave it too late and be disappointed when it's gone.",
  "I'm not trying to sell 'Sparkle' to you, especially with the price tag of 40 a gram - though cheaper in bulk. I would however be interested in trying something that has been bought as mephedrone (or have some feedback from someone who has tried both mephedrone and 'Sparkle') to see if there is a large difference in the effects, as there is a large difference in price with mephedrone found at only 15 a gram online. (If it is the same, then the UK website 'exclusively' selling 'Sparkle' must be making a fortune on all those good reviews! - as I know the 5*reviews were the reason I bought it)",
  "Saying that, the feeling is more-ish, but I don't think I would do anymore right now even if I had some - unlike something highly addictive like cocaine, where something you mean to buy and last a couple days goes in a couple hours. The come down has also in no way been unpleasant and more like a transitioning of feelings of back to how they normally are then you losing a sensation. There is also the fact that if I wanted to do more, I really could, seeing as my boyfriends 0.25g is still around (had it been coke, I'm not sure I would have held back).",
  "Should it be made illegal I figure it will probably be made Class B in the UK.",
  "REFECTIONS",
  "I took the risk on this, clinically untested, legal high, because I believe life is for living and experiencing as much as possibly in the short time we have - I would rather run the risk on a drug like this for an enjoyable time, then smoke cannabis at all and think the effect is much lesser.",
  "0.25mg was a good amount for me and I would do this again. Ingesting the product was also good and I see no reason to go any other way as it hits pretty quickly anyway - my stomach was fairly empty when I took it, having just had a chicken salad and an Atkins bar at 12pm though drinking sprite zero throughout the day. For me, the length of time of the experience was also good, being over completely in 3 hours and feeling like I could sleep and that this will not effect me tomorrow is a good feeling, as I don't like writing off too much time for coming down and feeling useless.",
  "Anyhow, hope this gives you some insight into what is being branded as 'Sparkle' and am glad to have had the experience and to have shared it with you. Will follow this up with another post should I be feeling bad tomorrow, but currently doubt it. In case of interest, people on the website reviews say the experience is comparable to Ecstasy, though less stong. Though I've taken Ecstasy, I've never had that good time on it and have had one awful time whilst drinking on it. It remains to be seen how alcohol mixes with 'Sparkle' for me this time, but I had a perfectly good experience without.",
  "Anyhow, we ended up going to a house party drugs and like this more than my other favourite of ketamine and prefer it to cocaine as it is a much better rounded experience and progression of sensations.",
  "For me, my 0.25g of 'Sparkle' was just right.</p>"
 ],
 "year": "2010",
 "id": "83324",
 "gender": "Female",
 "age": "24",
 "views": "26732",
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "4-Methylmethcathinone",
   "form": "(capsule)"
  }
 ],
 "submissionDate": "2010-03-28T07:00:00.000Z"
}
