{
 "id": 8340,
 "title": "Drugs Really Are Tools",
 "date": {
  "submission": "2007-04-20T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "WM",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "2.5",
    "quantity": "2.5"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "amount": {
    "unit": "joints/cigs",
    "quantity": "0.5"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Recently, I was finally able to obtain mushrooms, after much searching.",
  "Bit of brief hallucinogen history: Before this, I had done acid 4 times, (1 hit three times, three hits once), with varying results. I decided eventually that one hit acid trips weren't really worth it if I couldn't smoke too, and even with smoking, they weren't that impressive. When I took my first three hits of acid, I was blown away. There were visuals on everything I looked at, not just patterns, actual hallucinations. In my friend's back yard, I saw a family on a beach. I saw a man fishing in the street from his lawn. It was amazing, and I focused almost fully on the visuals. I never really stopped to let my mind process what was going on, so I was in a state of almost perpetual confusion. In the end, I enjoyed it, but I didn't get what I wanted to get out of it.",
  "For a while, I did dextromethorphan constantly. I loved it, it was so strange, however, yet again, I never really tripped 'successfully,' in my mind. I never gained anything, other than a strange feeling after a trip. I've decided to shelf the tussin for a while, and if I do it again, only do third plataeu doses, coupled with meditation.",
  "Sunday the 17th, around 12:30, I dosed the shrooms. I took approximately 2.5 grams. Chopped them up with scissors as finely as I could get them, and let them sit in orange juice for a moment. It was pretty unapealing, as the shroom bits just floated on the top. I expected it to absorb a bit more, though I guess it wouldn't make sense if it had. I drank it, having no problems, other than the last gulp which was more chunk than juice, when I gagged a bit, but managed to stomach it.",
  "I sat on the computer for a while, and talked to my friend, the sitter for the night, who was rolling on a weak MDMA/meth heavy pill. My other friend arrived to trip from work, having already taken 3 hits of acid, and I gave him what remained of the eighth. The weather at this point was getting nasty, and he was soaking wet. I offered to put his hoodie in the washer for him, and he said it was a good idea.",
  "After about 25 or so minutes, my friend who was on acid/shrooms, Kevin, decided to roll a joint of some pretty nice pot. I was ecstatic, as I had tried all day to get even regs and failed. My town was pretty much dry, other than a guy at his work. So we ventured out into the miserable conditions. The wind was blowing incredibly fast, and snow/sleet was falling. The snow had formed a thin layer over this low pile of mulch where a tree used to be, and in spots where there were holes in the snow, an amazing amount of breathing occurred. We finished up the joint, and stopped and stared out into the snow. It was tremendously beautiful. I wished I could have stayed outside, and wanted to take a walk, but I didn't want to get wet or cold, so after a bit more gazing, I wandered back inside with Kevin.",
  "When I trip with people, I tend to trip alone, near people. This was no different, and as I came up I became less euphoric and more introverted. I covered myself in a thick blanket and laid under my desk, playing Shpongle at a decent volume. When Im sober, I dont appreciate Shpongle much, but on shrooms, they were excellent. The fact that a lot of things are happening in the songs makes it very interesting. Several times, I heard the voices of my parents arguing, or calling my name, and panicked, only to realize it was just a sound in the song. I was enjoying myself, but I was still coming up.",
  "Music on shrooms and music on acid are very different. On acid, the music is very split up, for me. The different elements of the music separate and sort of wrap together in a different way. With shrooms, the music just became almost one beautiful sound. It was much more warm. Its hard to describe some of these things in words, and I think a lot of times I fall into using words that dont accurately describe things, but are the best I can get.",
  "One thing I really enjoyed about the shrooms was that my thoughts were very clear. On acid, whether it was because I wasnt just letting my mind go the right way, or I just wasnt ready to process the information, I never really understood anything substantial. The shrooms, however, made perfect sense. I took my blanket, and crawled into a wooden playhouse we have. It has triangle/circle/square windows, colorful curtains, and childrens scribbles on the walls. I leaned in the corner, rearranged the various toys on the ground to give myself a decent place to sit, draped myself in my blanket, and thought.",
  "At first, I simply looked around. This was a pretty interesting place to be. The scribbles on the walls became ancient hieroglyphics. I began to notice how introverted my thoughts were becoming, and that was when I realized it was going to be an amazing trip. I felt like my consciousness was separating from my thoughts, in a way. Typically, when not tripping, to have deep thoughts I have to actively think. On the shrooms, I just mentally sat back and listened to my inner monologue.",
  "The first thing I really thought about was the mind. The fact that I had almost completely retreated into my mind, becoming nearly oblivious of my surroundings amazed me. I realized that people pay far too much attention to their bodies than their minds. The body is basically just a vessel to nourish and protect the mind, but if you dont give your mind a break from controlling your body sometimes, you wont get the chance to see what it can really do. I decided that I wanted to start meditating, to try to be able to reach a similar state of retreat into my mind without hallucinogens.",
  "I had always heard people say that hallucinogens were just tools, but I never really understand. Sure, I wanted to seem like an intelligent educated psychonaut, but I really didnt understand. I slowly began to realize. The shrooms werent making me think anything at all. They were allowing my mind to make connections in a different way, and allowing me to inspect my thoughts a lot more in depth than normally.",
  "This time period was very powerful for me. I started thinking about all the self doubt I have, and while I knew it was a bad thought path to be going down, I let myself go, because I figured I might be able to learn things that would make me a better person. I considered my interactions with other people, and myself. I realized how much shit I put my parents through last year, and decided I needed to do something to change it. I realized how much time I waste on the computer, time that could be better spent thinking or playing sports or even just talking to people in real life.",
  "When I snapped out of this trance, so to speak, I decided I had to go to the bathroom. I slowly walked upstairs, once again noticing all of the visuals. Lots of breathing, lots of fractals. Textures were very odd, and at one point I put my hand on the wall, and the texture of the wall got onto my hand, making it look like my hand was sinking. On my way up the stairs, I saw my cat sitting on the landing. I froze, and stared at him. Somehow I managed to lean forward, until I was on a diagonal up the stairs. This lasted a few minutes, before I realized I had zoned out and headed to the bathroom.",
  "In the bathroom, I looked into the mirror. It was amazing. Ive always had some self esteem issues, though this helped work them out, in a way. My face was moving and breathing. I thought to myself, Wow, I look atrocious, moreso than usual, but it didn't really bother me much. I zoned out with my face against the mirror, staring and thinking. I realized that the body is a holy thing. Holy isnt quite the right word to describe it, but it does the job. The body is the representation of the mind in the world, and every body is unique and beautiful, in a way. Sounds clichd and stupid, but thats what was going through my head.",
  "I decided I wanted to try to think about social issues, I guess you could say. I went back downstairs and sat under my blanket and contemplated stuff like counter culture, revolution, etc. I came to the conclusion that a big contributor to the lack of a major counter culture today is the media and the general publics destruction of revolutionary music, and just general cultural revolutionary type things. I guess I really dont know how it was in the 60s, 70s, or even 80s, but it seems to me like the bands that played intelligent political music, even if it was incredibly radical were more widely respected. Nowadays, it seems like if a band makes any sort of political statement, theyre immature or just looking for attention or something like that. Yeah, that wasnt a very important realization, but it was interesting to me at the time. Hell, it might not even be entirely true, heh. These thoughts seem pretty vapid and unimportant compared to some of the stuff I learned that night, but at the time it was incredibly interesting.",
  "Around this point, I wandered over to where my friends were playing Halo, and sat down. After a few moments in the chair, the intensity of the trip lowered a lot, and I became more communicative. I wanted to explain all the things I had thought about, but my friends were both still pretty out of it, so I eventually just went and laid down under my blanket again and zoned out for several hours, thinking about the things I had already thought about and just in general being pretty satisfied and feeling fairly successful.",
  "In the morning, when I woke up, I had a hard time remembering many of the things I had thought about. I remembered basic ideas, like my idea about the mind being much more important than the body, but I didnt entirely remember how some of them made sense. I had a very pleasant afterglow, and eventually headed to a show in Philly. It was awesome, and I had a bit to drink, and just felt wonderful and loved life.",
  "After the show, a friend invited me to his house. I headed home for a bit, and decided that it would be interesting to see what would happen if I took the two E pills I had saved.(the same pills that the sitter from the pervious night had taken) I figured that since E helps people to open up, I might be able to express some of the ideas I had come up with. Despite the pills being heavy on some sort of amphetamine, or perhaps partially because of it, I was able to speak about pretty much all of the ideas I came up with. And I did speak, for a very long time, heh.",
  "When I came home, I was still speeding pretty hard, and decided to right this trip report. I wrote all through the night, the whole time worried that I'd wake up in the morning and read nothing but tweaked out meaningless rambling.",
  "Perhaps Im mentally glorifying what happened more than I should, but I definitely feel like Ive started down a different path in life. I intend to start meditating, and trip less frequently. While I may still have an occasional trip for the sake of tripping, for the most part, I plan to supplement my trips with pre-trip meditation and preparation.",
  "During the trip, I thought about my life and where I was going. I decided that I want to be a teacher, but not in a public/private school. I want to try to find some sort of commune or co-op type thing and teach there. Im also contemplating some sort of lengthy meditation retreat at some point in life, possibly to a Buddhist monastery, assuming they accept non-Buddhists interested in spending time in peace and meditating."
 ],
 "erowid": {
  "id": "49779",
  "citation": " WM. \"Drugs Really Are Tools: experience with Mushrooms & Cannabis (ID 49779)\". Erowid.org. Apr 20, 2007. erowid.org/exp/49779",
  "substance": "Mushrooms & Cannabis",
  "views": "4670"
 }
}
