{
 "title": "Experiences in Death-Dodging",
 "author": "ImperialRadio",
 "citation": " ImperialRadio. \"Experiences in Death-Dodging: experience with Duster (ID 83412)\". Erowid.org. Oct 9, 2010. erowid.org/exp/83412",
 "substance": "Duster",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>At the time, I was a 16 year old girl. I had been experimenting with drugs since I had turned fourteen, and had dabbled with alcohol, cigarettes, Marijuana, Robo, Cocaine, mushrooms, and E. I assumed that huffing keyboard cleaner would just be a mediocre high, silly like a robo-trip, and easy to stop. I was wrong.</p><p>I discovered the can in my house one day, and planned to use it that night, as my family would be gone. I put on some Animal Collective and took a huff of the cleaner. Within ten seconds, I could feel a wave of warm-numbness coming towards me. The wave surrounded my brain, filling my head with a pleasant buzzing. The buzzing spread from my brain, and filled my body with a warmness that I haven't found in any drug since. My body was filling with strange pulsating vibes, a numbness that can be compared to the opposite of electric shock. I entered a void of pleasurable calmness for about five minutes, before the high faded.</p><p>I immediately missed the pulsing warmness of the drug, so I took another huff, a bigger one this time. It instantly hit my body, and I returned to the state that I had been in before. I sat in the coziest chair I could find, and sat with my mouth hanging open, feeling my face. I had entered a different reality, physically the same, but emotionally foreign. My brain was flooded with psychedelic thoughts, and I experienced a handful of visuals that blew my mind. Colors and textures had completely changed, and the world around me was morphing and glowing. My body was filled with a warmness from my head to my toe, and all-the-while filled with a loud but comforting buzz.</p><p>I continued to hit the bottle once or twice every five minutes, until it was so cold that I could no longer hold it. I went all the way to wrap it in a towel, just so I could continue huffing. After about an hour and a half of constantly huffing, I lost complete track of time. Time itself had left me, and I was in a completely different reality. I had been sitting and drooling on myself for a few hours. I took a huge hit, emptying the bottle. I let the high surround me, fill my body.</p><p>This time, it hit me in the wrong way. I instantly saw the world around me begin to spin out of control. My body temperature rose rapidly, and I broke out in a sweat. I stumbled my way to the bathroom, and stared at myself in the mirror. My eyes were red, and I looked like I had been awake for days. The rest of these memories are a blur, but this is what I remember:</p><p>I stared in the mirror, feeling my face. The only way I knew I was touching myself was from my reflection. I was instantly scared that I would be stuck this way, that I had been high for days and would never come down. I felt the world around me breaking down, and was instantly convinced that I was going to die. I slapped myself in the face to try to bring myself down, alert myself back to reality, but I had lost all feeling. I continued to slap and punch myself until I lost faith, and accepted that I was going to die. Physical sickness shot through me, and I threw up for about twenty minutes, the most violent puke-session I have ever had.</p><p>Convinced I was going to die, I filmed a video on my camcorder, stating that if I was dead the next morning, I was sorry, and that I loved everyone. I was fully convinced that I was about to die, and was ready to say my goodbyes. I called my friend to tell her what was going on, and she told me to run to the shower, turn on the cold water, and stand in it until my body temperature came down.</p><p>I woke up about half an hour later, as from electric shock. I was instantly brought back to reality, stinging throat, fully clothed, in the cold shower. I stumbled out, threw on a towel, and crashed.</p><p>To this day, I feel an instant sickness when I am around the smell of keyboard cleaner. The high started out great, but almost ended lethally. If I am ever going to do it again, I now know not to do more than 3 or 4 huffs.  But it is not worth the risk of brain damage or death.</p><p>I wish you all beautiful days ahead.</p>",
 "year": "2007",
 "id": "83412",
 "gender": "Female",
 "age": "16",
 "timestamp": "2010-10-09T07:00:00.000Z",
 "views": "13856"
}
