{
 "id": 8345,
 "title": "Royal Farms Is Heaven",
 "date": {
  "submission": "2008-09-08T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "NickFury",
  "gender": "Male",
  "weight": "230 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:10",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "This was my first time trying E.  I had had a very long and hard week with work.  I had been waking up around 6:00 am every morning to drive to D.C. to haul monitors around until about 2:00 pm.  The weekend came and I was looking forward to relaxing a bit, which usually meant getting drunk somewhere.  That particular night there was nothing going on, so I ended up going to bed early.  The next day (Saturday) I woke up around 10:00am and hung out with my friend until about 5:00pm when he had to leave to go to a work related party.  So I went home and sat around waiting for something to do.  My friend, Stoner is what we called him, talked to me over the net and said he was getting some E pills that night and it slightly sparked my interest, but I wasn't 100% on taking it.  I figured I'd wait to see if there was anything else happening then I'd decide.  Well 10:00pm rolled around and nothing was happening so I let Stoner know that I would enjoy rolling with him.  He told me to pick him up  around 11:00pm so we could go pick the pills up.",
  "Getting the pills was a semi-complicated process, which involved picking up a drunk kid to give us directions to the kid's house who was selling it to us.  We picked up 3 pills, and as a nice gesture I dropped the kid off 20 minutes away.  He had popped a pill when he got in my car and by the time we had gotten to the destination his pupils had gotten huge, and he became extremely talkative, I noticed that he had called an ex-girlfriend and was trying to explain the mechanics of their relationship in one of the nicest ways I've ever heard.  Stoner and I walked him into the house he was staying at, he walked around feeling the carpet and kept making a girl rub his face.  This heightened my curiosity in taking the pill.  I drove home and picked up a Gatorade on the way back to my house and took the pill with the drink right before going into my house.  My original gameplan was to hang out in my basement and watch some movies and play some video games.  I wasn't aware of the intense feelings, and for some reason I just planned it out as if I were smoking some cannabis.  It was about 2:00am by the time we had taken the pills and gotten down my basement.  Within 20 minutes Stoner noticeably starting feeling it, he continually petted the pillows in my basement, and petted my cat.  His desire to hold a conversation increased greatly although the content of the conversations consisted of 'TIMMMAH! YOU FEELING IT?'. ",
  "Time passed and it was about 3:00am and I still was not feeling anything, if anything I was becoming tired.  I was waiting for my brother to go upstairs to bed before I would say anything about it though. Around 3:10 my brother went upstairs to bed and I told Stoner that I still wasn't feeling any effects.  He offered to cut the last pill in half and split it.  I took the half and sat down and played counter-strike for about 15 minutes, around then I noticed myself rubbing the top of my legs and thinking it felt good.  I looked in the mirror and noticed my pupils were huge.  Stoner had noticed and suggested that we go for a walk because we were both getting very talkative and antsy.  This was around 3:30 and it took us about 10 minutes to get out of my basement because we both kept feeling stuff and the stimulation it gave us.",
  "We decided to walk up the street to royal farms and buy some cigarettes and gum.  The walk was amazing, I felt extremely euphoric.  I was feeling extremely happy and just started looking around everywhere.  This was mid January and there was wind warning that night.  It was extremely cold but I remember not being cold at all outside.  We got to Royal Farms and I decided I would walk in and get the cigarettes because I convinced Stoner and myself that I could 'act sober'.  Immediately as I walked into  the store a wave of heat hit me and it felt wonderful, I also noticed the lighting in the store to be extremely bright, glowing almost.  I stood in the middle of the store and just said 'wooooooow'.",
  "I approached the counter bought the cigarettes and while the cashier went behind him to get the cigarettes, I noticed myself stroking the counter. I got out of there and convinced Stoner that it 'felt like heaven, and we're not leaving until you go in and buy something'. He did and agreed that it was amazing.  We then decided to walk to a pier on the water front about 5-7 miles away.",
  "We began our trip and I noticed I was feeling even better, I began smoking cigarettes non-stop. I believe we finished the pack of 20 within an hour.  We walked down alleys picking up poles spinning them, we hopped in yards and jumped on a trampoline.  I had the overwhelming urge to run, and we did, we sprinted and it was amazing it was as if all my muscles worked to their full capacity. Even with a cigarette in my mouth I was able to breath so smoothly and not get tired. I randomly tried to slam dunk on Basketball nets that loomed in the alley, we hurdled trash cans and finally stopped at this garage.  I decided that I was going to climb on its' roof.  We got on the roof and just laid on it letting our feet hang off.  The slanting of the roof and gravity felt very very good. Within minutes I decided to light up another cigarette and jump off the roof.  We continued down the alley randomly sprinting here and there.  Somewhere along the line I got the feeling that I had super strength, and decided to pull a 'Slow, Children At Play' sign out of the ground.  I did it with ease and felt extremely positive about myself. The walk was filled with praise from both of us, I contiually high-fived stoner for endorsing this night.  The alley ended into a road that had a turn closed for construction, and we stopped to play around on the construction equipment.  We both had a mischievous streak and decided we would put cones across the road to see if people were smart enough to get out and move them.  We waited in the grass as car after car approached the cones, some skidding, and turning around.  We found some paint and painted random sayings into the dirt, and then we placed a the road closed sign from the closed street onto the high way which only was separated from the residential street by a jersey wall.  We continued walking to our destination after that but stopped to bang on a door and run.",
  "We hopped into a yard and went into a shed, we found a can of spray paint, paint thinner, and gasoline and took them.  We came up onto the vocational school in the area and spraypainted ridiculous phrases on the wall.  Sayings that were really only funny to him and I.  We turned the corner of the school as we went to leave the grounds and spotted a police cruiser parked with all of its lights off in the parking lot.  With a bit off fear we hid the gas, spray paint and paint thinner out of view.  We walked around and found the shoreline, I emptied the gasoline can and paint thinner onto the beach which was mostly rocks.  I light the gasoline and it lit up the area and we bolted down the beach.  We wandered through yards and eventually made it to the pier that was our destination.  We sat and talked about personally stuff for about an hour, we talked about what a night it had been and that we were glad we did it.  It was about 5:45-6:00 when we decided to walk back.  The way back was filled with serious talks that bonded the two of us a little more.  We both brang up old memories as we made our way back to my house to sleep.  We got back in around 8:00am. Exhausted and not rolling anymore, we laid down.  Stoner was able to fall asleep right away and slept for about 4-5 hours.   However, I was unable to sleep. I watched movies till stoner woke up in which we got something to eat and just laid around all day.",
  "The day-after wasn't anything as bad as a hangover for me.  It just felt as if I played a sport the day before, although my right knee was extremely sore and I had numerous cuts and splinters in my hand."
 ],
 "erowid": {
  "id": "49794",
  "citation": " NickFury. \"Royal Farms Is Heaven: experience with MDMA (Ecstasy) (ID 49794)\". Erowid.org. Sep 8, 2008. erowid.org/exp/49794",
  "substance": "MDMA (Ecstasy)",
  "views": "3175"
 }
}
