{
 "id": 8350,
 "title": "Rock Bottom",
 "date": {
  "submission": "2008-04-08T07:00:00.000Z",
  "experience": "1996"
 },
 "author": {
  "name": "Phoenix",
  "gender": "Female",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Many years ago I had a bad meth addiction.  Everything in my life revolved around getting my next bump.  Most of the negative physical side effects were gradual, such as back problems from sitting in the same position for six hours at a time, palpitations or skin problems from constant picking.  This report is about a much worse effect.  Many addicts have to hit 'rock bottom' before they resolve to kick.  Rock bottom is a term for an injury or experience that serves as a wake-up call.  This is my rock bottom experience.",
  "About two and a half years into my meth use, I got a contaminated batch. My primary mode of use was snorting, and there were many regular health issues that came up because of that.  I had frequent sinus infections, sudden heavy nosebleeds, and I can't even count how many times I ruptured my conjunctiva (the clear tissue that covers the eye) from rubbing itchy, swollen eyes.  But this time it was different.  I'd been up for about a day and a half by the time the discomfort became intense.",
  "I got a mirror and looked closely at my eyes.  I'm very twitchy about eye problems in general, and what I saw absolutely horrified me.  Not only were both my conjunctivae ruptured, but the entire eyes were swollen.  The whites of my eyes had broken up into tiny little chunky bits that were suspended in pink fluid.  I was sure I was hallucinating at first, but when I asked my friend to look at it, he told me to go to the hospital.",
  "I sat in the waiting area of the county emergency room for several hours in line to be treated.  I went into the bathroom several times to do more little doses.  I finally got to see a doctor who put ointment into my eyes and dyed them with orange stuff.  He wanted me to go back to the waiting room for a few minutes to let the dye develop before examining me again.  While I was waiting, I went right back into the bathroom to do more.  That was when I looked at my reflection in the mirror.  I looked shocking.  My eyes were bright orange and clotted with ointment.  It looked like a really good special FX makeup job, except it was my real face.  Seeing myself in this condition, completely out of control and unable to stop doing more, I realized that I had to quit or I was going to kill myself.",
  "It turned out I hadn't been hallucinating what I saw in the mirror.  The whites of my eyes had curdled, for lack of a better word.  The doctor's tests showed that the speed I had been doing more and more of was contaminated with Staphylococcus epidermidis. Having a staph infection in your eyes is not only unspeakably uncomfortable, it's repulsive. [Erowid Note: It is not clear from these statements that the meth was actually 'contaminated with Staphylococcus epidermidis'; the doctor likely tested the patient, not the material.]",
  "There is a relatively happy ending to this story.  My eyes didn't sustain any permanent damage, and I finally did get clean.  It's been almost nine years since I last got high, and it will never happen again.  Most of my friends survived meth, but they also have lingering health problems years after they quit.  Many are caught in a cycle of relapse.  Some are dead.  The high was great, but it was NOT worth the price that I paid."
 ],
 "erowid": {
  "id": "49830",
  "citation": " Phoenix. \"Rock Bottom: experience with Methamphetamine (ID 49830)\". Erowid.org. Apr 8, 2008. erowid.org/exp/49830",
  "substance": "Methamphetamine",
  "views": "20252"
 }
}
