{
 "title": "Think Twice, It's Not Alright",
 "author": "B-Joe",
 "citation": " B-Joe. \"Think Twice, It's Not Alright: experience with 4-Methylmethcathinone (ID 83517)\". Erowid.org. Apr 30, 2010. erowid.org/exp/83517",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "95 kg",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "4-Methylmethcathinone",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Before this I had tried salvia, weed and plenty of alcohol, all these experiences were mental and I never really felt my body was in real danger except once when I had too much to drink.</p><p>Anyway this was my first time trying anything like this and the first two times I was very cautious, estimating about 100mg which I dissolved in water and drank on a full stomach. However the effects of these times were negligible so the day after finishing my exams I decided to treat myself. An ignorant sentiment. I had done my research on the subject and thought I knew what I was doing.</p><p>At around 5:45 I took between 200-400mg of 4-Methylmethcathinone dissolved in water at home on an empty stomach. Around fifteen minutes later as I sat in my room I could feel it starting so I put on some calm music and decided to meditate for a while to fully appreciate the effects. I sat there and could feel the euphoria thinking this is nice however I could feel my heart beating really strongly in my chest so I took my pulse and found that it had rocketed. Normally I have quite a slow rate at about 65 bpm but now as I timed it I was afraid to finish the check as I knew it was over 100.</p><p>For an hour or so I tried to remain calm and find my neutral space, however this substance allowed me no such thing and instead gave me chest pain and a rising fear. This was brought on partly because I did not know if this was still ok or verging onto dangerous. I had heard the effects were short lived, lasting only and hour or two. However an hour later I was still high and starting to get concerned so in the end I bit the bullet and started to walk to the hospital. I made some bullshit excuse to my parents about going to the pub and started walking feeling very uncomfortable. Thankfully my nearest hospital is not far away at all so I was soon there.</p><p>I arrived at A+E at maybe 7 and went to the desk and told them what had happened. I took a seat and ending up waiting what felt like an eternity. The reason I went is that I just thought that if anything was about to happen at least I would be somewhere they could deal with it. At this point any nice feelings were replaced by the feeling that any minute my heart would give up and at 18 years old I would have a heart attack. I realized I just did not respect the fact that what had happened to others could happen to me, I remembered the deaths related to this and started to freak a little bit. I could not sit still and paced up and down the room non-stop for a good few hours still feeling really bad. I also began to feel lightheaded and several times I felt like I was about to have a heart attack. Im pretty sure the other people there guessed I was on something as I was the only one pacing and probably looked out of it. I could almost feel waves of the effects meaning that my fear and racing heart seemed to peak then slightly subside. Despite my condition I could still feel an occasionally surfacing underlying euphoria and happiness that almost made me smile once or twice.</p><p>As I walked a boy came in crying with a man next to him, the man asked where the toilets where and the boy went into them. The man then said to the receptionist Yeah, his dads just passed away. I sat there thinking shit here I am willfully endangering myself with some random research chemical whilst other people are having real problems.</p><p>Eventually a nurse called my name and I went in and said what had happened. She thought I meant methadone and I had to be really specific because they had never heard of it. This is the real danger with these research chemicals, the nurse looked through a book then had to Google it just to find out what it was. She eventually said it was a type of amphetamine. This is the scary thing, doctors dont know much about this stuff so if youre thinking of taking this stuff remember that if the shit hits the fan these people wont necessarily know what to deal with or how to deal with it. Having said that she said that my heart rate (now 110bpm) was not too bad and I would be ok but she still was going to get a doctor for a heart trace. She said everyones tried it at least once and to sit down and try to stay calm which surprisingly helped a lot.</p><p>Another hour or so and the doctor did the heart trace, at this point I think I was very slowly coming down. He mentioned the danger of cardiac arrest with these stimulants and all the rest but said that the heart trace was fine and although it would still be in my system I could go but recommended I rest. As I walked back home at about 10 my chest was still hurting and my heart was still being forced to beat too fast but I trusted I would be ok.</p><p>Its the next morning and my chest still feels uncomfortable like its been beaten. Thankfully I have not had any weird purple patches on my skin but it is still early to tell if there are any long term consequences. My heart rate is down to 60bpm which is good to say the least. All in all I cant deny that the effects at first where nice insightful and pleasurable but the stimulant negatives quickly took over. The doc said I should stay away from stimulants as this one had a particularly bad effect on me and I couldnt agree more. From now on its only the natural herb that I will trust and not crazy dangerous stimulants. I dont regret going to A+E although looking back my memory of it is limited but it was probably sensible considering my lack of experience.</p><p>For anyone who knows they are still going to try this, my advice is this. Treat all these things with respect, although it was a little powder much more and I might not be here to tell this story. If you are increasing from a very small dosage do so carefully precisely and DO NOT change the variables such as full or empty stomach, additional drugs and even activity. I hope you take something from this as I have. I now know that my laid back disposition does not get on with stimulants but I should have guessed this before really.</p>",
 "year": "2010",
 "id": "83517",
 "gender": "Male",
 "age": "18",
 "timestamp": "2010-04-30T07:00:00.000Z",
 "views": "9645"
}
