{
 "title": "A Dangerous, Powerful, Long Acting Benzo",
 "author": "No Eff Eks",
 "citation": " No Eff Eks. \"A Dangerous, Powerful, Long Acting Benzo: experience with Phenazepam (ID 83521)\". Erowid.org. Nov 3, 2010. erowid.org/exp/83521",
 "substance": "Phenazepam",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  " repeated",
  "oral",
  "Pharms - Phenazepam",
  "(powder / crystals)"
 ],
 "report": "<p>[Erowid Note: Based on a very limited pool of available data, 200 mgs of phenazepam ingested over 4 days is considered an extremely high dose]</p><p>As a long term drug abuser this cheap, legal, fairly easy to obtain, and relatively strong benzo (phenazepam) sounded like a dream drug. I'm not a complete idiot these days though, so I looked around at various trip reports and what the prospective downside of the drug might be.</p><p>In these reports I found when I (as a long time benzo user) expected - total blackouts, amnesia, crazy behaviors, etc - all typical of an extreme benzodiazepine overdose. I was concerned about this only because phenazepam is active at such low doses (recommend is like 0.5mg, recreational is more like 2-10 depending on tolerance).</p><p>You get this stuff pure - a careless (see benzo-induced haze) individual could easily mistake 20mg for 5mg even if they were actually trying to dose carefully. A digi-scale accurate down to 0.0001 g is needed for this drug to be used safely imo -- unfortunately I don't have one, couldn't find one in time, and eyeballed my doses for this trip report.</p><p>This potential danger seemed to only make me want to purchase some phenazepam more, so I went ahead and got a 200mg sample order from an online vendor. Things went fine and 2 weeks later I had the drug in my hand. 200mg is a TINY amount of material (I expected this), but this only made me more nervous about eyeballing it. So it begins...\r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]</p><p>To start, I emptied all 200mg onto a clean sheet of paper. I divided it in half, then again, then again, then again. I now have a pile of pure phenazepam that I'm guessing was between 4mg and 20mg (most likely in the middle somewhere). I then took a straightened paper clip that had marks all along it. I wet one end with my tongue, and rolled it in phenazepam. It didn't stick to the paper clip very well, but that's not a big deal. I licked off about 1/4 inch off the paper clip four times and waited to see if this would do anything. From what I could tell the pile was the exact same size.</p><p>Within 20 minutes I could feel that I was under the influence of a benzo. It was not very strong though (much like 10mg valium), but I waited another 35 muntues before redosing about twice as much as before.</p><p>After that the next few days are a haze I can not remember much of all. I knocked my awesome fax/scanner/copier/printer off my TV and broke it... I dropped my laptop and broke that as well. Those are just bits of memory though. It was your typical benzo black-out. If you've done this before you know what I mean. It's not worth it to find out what it's like if you don't know, so don't go off and OD on my account.</p><p>Other than that is was your usual benzo-induced state of semi-consciousness where you know you're fucked up but don't really feel impaired. I was not impress with phenazepam in that regard. The amnesia is as bad or worse than other more common benzos, and they last for fucking ever. I honestly don't know how long this trip lasted. It didn't help that on the same day I ran out of phenazepam I found a bunch of Zoleplon (sleeping pills, non-benzo, but very similar mechanism of action). On the subject of the Zoleplon - I emptied out at least 10 of her caps and insufflated them. The effects were similar to benzos, and a lot more pleasant than other z-drugs (the class zoliplon belongs to) I have tried.</p><p>Back to phenazepam. The 200mg lasted at least 4 days, and I was dosing constantly, with little sleep. I didn't do much (NO DRIVING), but lay around and entertain myself in various ways. The high was nice, but not even close to as good as that of xanax.</p><p>At some point I injured a nerve in my left arm which is a real bummer. I've lost most feeling in my left ring finger (mostly on the parts close to the left pinky). My left hand's pinky is almost totally numb. It constantly feels numb, yet throbs with pain. It's like the feeling you get after smashing a finger with a hammer. So much pain, that it's just a kinda tingly numb.... well that's my left pinky for now. Every now and then if I move my left arm the wrong way it feels like I've hit my 'funny bone' and the neurons in my arm light up with pain. Oh lovely.</p><p>This is sadly similar to something that happened to me during another benzo-induced haze (klonopin that time), and I have faith that with time this will go away. In fact, this is much less of an injury as my last neuropathic damage caused by drug use.</p><p>The good side of phenazepam:</p><p>-cheap</p><p>-strong</p><p>-legal</p><p>-functional - I was able to job search online reasonably well during all this</p><p>-slightly euphoric</p><p>-very effective for anxiety</p><p>The downside</p><p>-very amnesiac</p><p>-STRONG</p><p>-very long lasting</p><p>-moreish (combined with amnesia this is a huge negative)</p><p>If you like benzos and know your shit.... have at it. It's not that great. I like drugs, and don't see myself ordering more of this any time in the near future (if ever). This is not a drug for somebody that doesn't know what they're doing. You could EASILY kill yourself on this drug. So I say newbies -- stay the fuck away -- it's not some cool drug that's being kept secret, it's a dangerous, powerful, long acting benzo that can mean some serious changes in your life before you know it.</p><p>Hope this all makes sense. I'll be happy to expand on the parts missing, but as I said -- I don't remember much, and didn't do much -- basically sat around doing phenazepam for a few days randomly doing something extremely destructive.</p><p>Random thoughts and notes:</p><p>-I give it a C- as a drug.</p><p>-I divided up the larger quantities to reduce the chance of catastrophic overdose. I limited myself to 50mg/day (and that is A LOT), and locked away the rest).</p><p>-Get fucking scale.</p><p>-I really wish I knew what I did that fucked up my arm so bad, but my pinky is just killing me (and has been for a week!).</p><p>PLEASE BE VERY CAREFUL WITH THIS DRUG, it is the real deal and is much longer lasting than the benzos people are used to.</p><p>-I actually think my starter dose was perfect, but there are too many variables to give precise directions.</p><p>-Just dose carefully and slowly unlike me. Luckily this benzo does kick in quick.</p>",
 "year": "2010",
 "id": "83521",
 "gender": "Male",
 "age": "25",
 "timestamp": "2010-11-03T07:00:00.000Z",
 "views": "27686",
 "dose": {}
}
