{
 "title": "Riding into Unconsciousness",
 "author": "clippy",
 "citation": " clippy. \"Riding into Unconsciousness: experience with Propofol (ID 83553)\". Erowid.org. Aug 1, 2011. erowid.org/exp/83553",
 "substance": "Propofol",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "IV",
   "Pharms - Propofol",
   "(liquid)"
  ]
 ],
 "report": "<p>There a few interesting and somewhat surprising effects that result from Propofol.</p><p>My experience with Propofol was a clinical one; it was the drug used to induce a general anesthesia. Essentially, it was used to take me under, and then a different substance was used to keep me there for the duration of the anesthesia. Consequently, it was a high dose.</p><p>My story starts in the operating theatre. After placing an IV cannula in my left forearm and connecting a patient monitor, the anesthetist says hes going to administer something to help you relax. He promptly whirls his chair around and begins rattling away with various unseen objects.</p><p>Im on a slightly inclined bed and I see him spin around on his chair, once again facing me, but this time with a rather giant syringe in his hand. The syringe is full of milky white Propofol. It looks almost as though it had some thickness to it, and it was mostly opaque.</p><p>As he injected it, I felt what can only be described as a hardness pushing up my arm. It was a slightly dull pain, and I could swear that I felt it advancing up into my chest. It took only a second or two from injection until I felt the effects. The hardness in my vein began to fade fairly rapidly.</p><p>I felt a feeling as though my body was dropping within itself, as though I was sagging physiologically. It wasnt a feeling of internal heaviness though; rather, it was the opposite. I felt light and my peripheral sensations were a little less acute, everything was almost floating, a little as though I was intoxicated on alcohol. I felt a sudden rushing and slight disorientation, similar to what is experienced if I stand up rapidly and get a headspin. Propofol is known to cause hypotension, so this might have been what I felt.</p><p>The effect on my mind was immediate and strong. Suddenly, out of nowhere I chuckled. I felt as though I had to express to the doctors that I was impressed by the effectiveness of this drug. Oh I started, Well, ok now I see what you mean by relax!. I laughed again. Everything was suddenly funny. I took a few deep breaths as I tried to keep my composure, but something was strangely absurd and humorous about the whole situation. There was a definite euphoria.</p><p>The effect was mounting, and I remember listening to the constant beep of the heart monitor. I remarked that I could hear my heart slowing down, and the anesthetist (perhaps with a slight tone of offense in his voice) told me it was actually speeding up. I laughed at this and looked around the room. It seemed as though all the nurses, the doctors, everyone was just grinning at me. Everything was funny, it felt relaxing and enjoyable. The initial shock I had felt at the drug onset was giving way to a calm mental attempt to manage the effects. Pleasure was washing over me in waves.</p><p>I asked the doctor: What is this stuff?? and I remember him telling me oh, dont worry about that its just something to help you relax. Immediately I feared that he might think I was some kind of drug seeker who was making mental notes about what drug he needed to seek out on the black market once the surgery was over. I tried to reassure him/everyone in the room. I said Oh, well, yeah I suppose you dont want I was going to add people going out and looking for this stuff, but I hesitated, wondering if maybe this was an overreaction. I sat there, and realized that my mind was blanking out. Mid sentence, my arm still in mid gesture, and with a stupid grin on my face, I was frozen. My thinking was in slow motion, I kept having mental blanks, trying to figure out what I was saying.</p><p>Then, without warning, everything was dark. My eyes were closed. I opened them up and saw that the room was empty. No, there was a nurse here too. I was shivering, but able to tell her I was fine. The first question out of my mouth was how long was I out??.</p><p>I dont remember actually passing out, my memory terminates when I was stuck mid sentence. From injection to sleep, it was less than 120 seconds. The disorienting sensations were strong but easy to become accustomed to. However, the mental effects were powerful and difficult to judge. I didnt feel sedated at all, and then suddenly, my mind ground to a stop. I suspect its somewhat similar to hypoxia where the victim is unaware of their declining mental faculties until its too late. It wasnt like the warming embrace of an opiate. It was sort of similar to alcohol, but again without the depressive effect. Everything felt light, my outlook was positive and my situation was suddenly funny.</p><p>The level of blood pressure drop that I experienced is unknown (I didnt think to ask) but there was a sensation very similar to postural hypotension throughout the whole trip.</p><p>Anesthetists sometimes call this drug Milk of amnesia, due to the effect it has on the memory. Its possible I was conscious longer and experienced some kind of declining level of consciousness as I was sedated by it, but I have absolutely no recollection of anything like that. I may have kept talking to them, but I suppose theres no way of knowing.</p><p>This drug is like a combination of carbon monoxide poisoning, a hypotensive episode and roofies, but its a good version of those things. It actually felt very enjoyable. That said, there was an immediate and powerful systemic (CNS and cardiovascular particularly) effect, and I can see why this is considered a dangerous drug. The effects built up more rapidly than I could process them, and while I suppose this is normal at the dose I was given, I would caution against self administration due to the fact that the user/patient cannot judge the effects objectively (and due to the systemic effects mentioned). Recreational use is definitely not recommended by me, and I was distressed to see that people apparently use it to that end.</p>",
 "year": "2007",
 "id": "83553",
 "gender": "Male",
 "age": "21",
 "timestamp": "2011-08-01T07:00:00.000Z",
 "views": "7079",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "200 mg",
   "administration": "IV",
   "substance": "Pharms - Propofol",
   "form": "(liquid)"
  }
 ]
}
