{
 "title": "Camping in Hell",
 "author": "TripDawg",
 "citation": " TripDawg. \"Camping in Hell: experience with LSD, Cannabis & Paroxetine (Paxil) (ID 8357)\". Erowid.org. Jul 26, 2001. erowid.org/exp/8357",
 "substance": "LSD, Cannabis & Paroxetine (Paxil)",
 "bodyweight": "130 lb",
 "report": "<p>It started out to be a very fun day of smoking weed. Me and my friend W were riding quads and having a great time. We had 10 hits of acid that we planned on taking at night while camping, and I was looking forward to it so much. It was a cool day, it being March, so we planned on taking lots of firewood. At around 6pm we started to get prepared to go camping. We planned on going to a very remote pond only accesible by quad. We loaded up the trailor with chairs, a CD player, firewood, 2 flashlights, and some food and drinks. We left my house to begin our journey...</p><p>I had been on paxil for about 3 months for depression, and read that SSRI's like paxil will decrease the effects of acid. This is my reason for taking 5. I was experienced with high doses of acid even when I hadn't been on paxil. This night was about to get bad, real bad.</p><p>We took the hits at around 11pm. We weren't very high anymore because I wanted to wait till the acid kicked in to smoke. I started feeling the stimulating feeling only 20 minutes later, so we started smoking weed. It came on so strong. Everything in my vision was moving and comical thoughts started to dance through my head. The fire's light seemed to go on forever through the woods and reflecting off of the pond. W was also feeling good. He was laughing and acting hysterical.</p><p>We turned on some good techno music, I believe it was Bad Boy Bill. A few minutes later, probably 12am by then, I started to feel really out of it. Everything around me started looking alien and unfamiliar. We stopped smoking weed after the 3rd bowl, as it was clear that the pot was increasing the effects of the trip. When I closed my eyes I could see things that were going with the music. I saw a line of bamboo sticks jumping up and down with the music. It was getting really cold and I decided it would be best to drive the 2 miles back to my house. W agreed, as I could clearly see he was in distress, and looked confused. This is when the trip turned absolutely crazy.</p><p>We take off running to the quad cause we are getting scared. With us, we carry the CD player and the chairs. I had parked my quad about a quarter of a mile away, because there was only a walking trail to the pond. I reached in my pocket for the key. Not there. We started to panic. Evil vibes from all directions were hitting us full speed. This is around my peak. We panic. We head back to the camp in hysteria. My visuals were getting intense and everything had a red tint to it. The trees looked like they were grabbing for me.</p><p>Then W looses the flashlight. I am freaking out and W is trying to calm me down even though he is also scared. I just take off running, blindly through the woods. He screams my name to get me to come back. What I was thinking I don't know. I fell down hard about 20 feet away from W and pick up a rock. I start pouting (not like me). My friend was like aww, come on. I start hitting myself in the head with the rock. The pain was very intense. I was either severely frustrated or trying to knock myself out. I was in a different world. I remembered going camping but I didn't know why this person was here. I almost didn't know who W was, but he looked familiar. I looked at my watch and didn't understand what it meant. Then we just layed on the ground by the fire. I had lost my glasses somwhere in my self-struggle. I suddenly thought the whole woods were on fire. I jumped up and tried to pour my drink on the fire, but W stopped me. Good thing he wasn't as messed up as me. I began to think cops were going to find us, which was impossible. I asked my friend and he clarified everything. As I layed on the ground and put my head on the rock I began getting very euphoric and just thought, I am going to lay here comfortable and wait till I am sober to figure things out. I looked in the fire and saw the wires from my glasses glowing red. I am glad that was a hallucination. In the morning my brother rode his quad up to see how we were and I told him to get the spare key. He did and our asses were saved. I found my glasses and was very happy to get the hell outta there.</p><p>Conclusion: My experiences with SSRI's and acid is it makes a different kind of trip. It is more intense actually but lasts slightly less. With weed, SSRI;s definately increase the high.</p><p>Dont assume what you read is true, it may be true for some and not true for you. In a way I am glad I lost the key. I surely would have wrecked. Be careful, trippers, acid is not somthing to play with, it is somthing to respect.</p>",
 "year": "2001",
 "id": "8357",
 "gender": "Male",
 "timestamp": "2001-07-26T07:00:00.000Z",
 "views": "29698",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": ""
  },
  {
   "time": " T+ 1:00",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
