{
 "title": "A Bad Experience",
 "author": "Been there",
 "citation": " Been there. \"A Bad Experience: experience with Datura (ID 8362)\". Erowid.org. Jul 26, 2001. erowid.org/exp/8362",
 "substance": "Datura",
 "bodyweight": "135 lb",
 "report": "<p>Came back into town from college. There was a drought with pot. At a party my local friends said they'd found something just like pot, only it was a tea. We drank a glass each. I wasn't told the tea was much stronger than what had been used in the past. One of the things I recall (until waking up on a country road with the car out of gas) was driving a friend home. According to him we actually drove into Tulsa (he was holding the steering wheel while I shifted and braked okay) to play foosball. I have no memory of that. I just remember dropping him off and heading to my folk's house. The next thing I recall was waking up on a country road, and the trees were talking to me. It was a conspiracy. The trees were out to get us. I made sure a pocketknife was in my hand and started walking. After about a half hour someone stopped and picked me up. The local sheriff, in his own car, having come from church. We had a talk while he explained why my car was towed (I'd left the radio on full volume.), and why he thought I was really high (the tree conspiracy thing.) However, there was nothing illegal that he could find. After my folks came down to the police station and paid the 75$ to get my car out of impound, I drove my VW Bug to my folk's place, went to my old room and slept for nearly 24 hours. I remember telling my folks that I'd done nothing illegal -- they decided that someone slipped something into a beer I'd drunk.</p><p>Other people also wound up in trouble that night. One guy decided that the road was actually a gravel path leading through a steel gate into a field. Really messed up his car. He didn't get hurt. Car totaled though. Another person hit a mailbox, overcorrected hit a mailbox on the other side of the road, overcorrected, hit yet another mailbox and so on for a rural mile -- pretty much ruining his van. Yet another had to take a leak. He picked a house, knocked on the door, and asked to use the bathroom. When the 80 yr old grandma slammed the door in his face, he urinated on it. She called the cops, and he wound up in jail for indecent exposure.</p><p>There are good legal herbals, stay away from jimson weed. Also known as loco weed. Or Johnson grass.</p>",
 "year": "1974",
 "id": "8362",
 "gender": "Male",
 "timestamp": "2001-07-26T07:00:00.000Z",
 "views": "20990",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 ]
}
