{
 "title": "Rebooting My Mind",
 "author": "Thedon420",
 "citation": " Thedon420. \"Rebooting My Mind: experience with LSD, Nitrous Oxide & Salvia divonorum (ID 83692)\". Erowid.org. Oct 31, 2012. erowid.org/exp/83692",
 "substance": "LSD, Nitrous Oxide & Salvia divonorum",
 "bodyweight": "150 lb",
 "report": "<p>Preface:</p><p>Yesterday, such a strange and alien concept, I have traveled an incredible and unimaginable journey in the transition from yesterday to this moment where I sit in my room, smoking my hookah, typing on an online forum; trying to put into words what I have just witnessed.</p><p>Preparation:</p><p>I guess it started Thursday morning. In my biology class I mixed up my 600mg initial dose of vitamin C; 7 halls defense drops in mango-melon sobe life water in preparation for the journey that I was planning to embark on that evening.</p><p>Thursday is my busiest day regarding school, this fact is neutral, and its my performance through those tasks which causes it to be good or bad.  This Thursday was very good, I was in a great mood from the fact that I picked up 2 tabs the day before, and all that stood between me and that spiritual experience was a philosophy class, and a chem lab.  I had philosophy at 3, which seemed like the right time to ingest my vitamin C dose.</p><p>Chem lab was nothing; I turned in my lab write-up from the previous week, happy to just have that work out of the way. The experiment for that session was overly simplistic I was able to get that write-up out of the way during the class session.  I've got all of the important stuff out of the way, and I feel like I did all that stuff well enough to make the grade, so I was ecstatic for having the coming weekend entirely to myself.</p><p>I got home, and got all of my equipment together; my pipe and salvia, an empty whipped cream can, my hookah, cigarettes (Newport M-blends) and most importantly 2 hits of dumbo blotter print LSD.</p><p>I have had a lot of experience with the salvia, and LSD, around 7 experiences with salvia, and 8 previous journeys on LSD.  Now the nitrous I've felt it a few times, but I never really got anything from it, tonight, that was going to change.</p><p>THE EXPERIENCE:</p><p>I ate the tabs.</p><p>As I waited for the effects to kick in, I light the charcoal for my hookah, as well as a stick of opium incense, and listened to my IPod. This seemed like a very fitting way to end this day, a day full of success and all around good vibes; the perfect mindset to explore the deepest recesses of my mind.  After my hookah charcoal died I went downstairs for a shower, I was fully immersed in the experience that is LSD by now.</p><p>The shower was amazing, I was washed with colors and sounds like I've never heard or seen before, but that bliss would not last.  It was at this moment where I felt a moment of vulnerability, I was naked and tripping BALLS in the shower I didn't have my glasses on (my eyes are by far the most nearsighted out of anyone I've ever met), so my entire field of vision was a blurry mass of colors, and vaguely recognizable shapes</p><p>I looked down and I hallucinated a lot of murky brownish-black water in the bath tub. SHIT MY SEWER BACKED UP!!! I thought and I immediately shut off the water and grabbed my glasses, I than cleared away some of the suds to see perfectly clear water draining normally. I found the fact that acid caused this reaction was hysterical, I laughed for a good 10-15 minutes afterwards, and that made me shake off the bad vibes from that hallucinogenic episode.</p><p>After I finished my shower...</p><p>Ever take a shit when tripping balls? IT'S FUCKIN WEIRD -that's the only way I can describe it.</p><p>I could feel a body inside of my abdomen, this form was completely useless, and potentially toxic to me, indigestible remnants of food that I had previously consumed, I want it out.  I sat on the toilet, and felt the mass moving through the length of my colon, I felt the weight of the mass change throughout my entire abdomen, as it broke apart from its own weight.  It was out. I made a point to remember to wipe, as I would most likely regret it if I did forget.</p><p>That part was done, I looked into the toilet, and I saw the smears on the paper. It shifted from smears, to shapes, composed of thousands of tiny circles; I was mesmerized as they danced around in the currents in the toilet. I noticed that the smell was getting more intense, and I found my face a few inches above the water. THANK GOD I snapped out of that trance before I dunked my face. I then realized that I was tripping on my shit, perhaps it was a misunderstanding like this that lead to the Jenkum rumor came from.</p><p>It was at this moment when I realized that I was fully immersed in my trip; Im at a solid +2 on the Shulgin rating scale.</p><p>I got dressed and went upstairs I enter a room that reeks of incense and hookah smoke, as well as a fresh bowl of shisha in my hookah, and a fresh stick of incense in my burner. I was so happy that I had everything prepared for when I returned to my room.  I have no more preparations to make at all for the rest of the night.  IT'S TIME TO GO ALL IN!  I light a cigarette and cleared the can of nitrous in one lungful. This upped my trip to a light +3.</p><p>I immediately was immersed into the beautiful fuzzy psychedelic landscape that was my mind from the N2O, it was absolutely beautiful and awe-inspiring I than called my cousin on my phone, we talked for a bit, and I had in my mind that I was going to smoke salvia.</p><p>I sounded manic as I suggested to my cousin.</p><p>TONIGHT, IM GOING TO EXPLORE WHERE IVE NEVER BEEN</p><p>Im throwing salvia into this beautiful mix to see where it takes me, if not now, never.</p><p>After a few minutes of debating if Im up for this I conclude, with the help of my cousin that I am.</p><p>I HIT THE BOWL OF SALVIA</p><p>It took a few seconds to kick in and</p><p>I felt immersed in a completely alien mindscape, I was still aware that I was in my bedroom but I knew that my consciousness had been EXTREMELY shifted.  I felt my mind merge with the universe, I still had my sense of direction in reality, but what and where was reality?  I felt my mind being guided by a strange gravity (from the salvia), and it was as if an entity was whispering questions that I should be asking myself.  Unfortunately I cant remember any of them specifically, but they where along the lines of who are you REALLY? Why are you here? I had no concept of what I was asking myself, it seemed as if my mind had been completely wiped blank, or perhaps isolated from this collective for its own protection.</p><p>For a very brief instance in this lifetime that I seemed to live in under a half hour, I had a nanosecond of ABSOLUTE mental clarity, I knew nothing, my mind was blank, and I was in a state of pure bliss. I had an extremely brief glimpse of a +4 experience, but it was so short lived, even on salvia time, that I couldnt even get a good feel for this instance. I saw just enough to know that it was absolute perfection.</p><p>I felt and saw my mind like a line in a fractal pattern, at the center was some ultimate truth, perhaps the pure essence of existence, but I also felt an extreme danger of getting too close to it, for I feared that merging my mind with this center would cause me to permanently lose my sanity.</p><p>I felt that the salvia gravity was guiding me as close as I could go to this peak, while still maintaining the ability to come back.</p><p>These fractal thought patterns where in the same form that I saw in all of my previous LSD experiences, but this time is seemed so much more vibrant, rushed and vivid, over a thousand times more intense than anything I experienced on any of these substances individually.  Needless to say this was BY FAR the most intense psychedelic experience of my life.  I saw all of existence and the inner workings of consciousness.</p><p>My thoughts kept reducing from infinitely complex to simple questions, and then a whisper, and then I could feel my mind being blown at this moment, and in that rush, it would take my into another slightly weaker  loop that explored a different facet of my being.</p><p>I forgot that I had my cell phone in my hand (what where hands?) with my cousin on speakerphone.</p><p>I felt his words the words that he said as if they where a splashes in a rapidly flowing stream of consciousness.</p><p>Eventually it weakened to a point where I was coherent and lucid enough to let my cousin know that I got through the experience, and that I needed time to integrate it.</p><p>Then after he hung-up, I managed to find my iPod and started Pink Floyd's Dark Side of the Moon Album</p><p>I felt the exact same thought patterns, but I was out of that universe I was back in reality.  My mind merged with the music, my thoughts became the music.  The transition between the songs Speak to me spoke to me as I felt like I was truly descending into insanity, but at the same time I knew it would end soon enough. Than when Breath started, it was the most mind-blowing experience Ive had since the peak, and I was back to reality, for real this time.</p><p>I lay down to integrate my experience through the rest of that album. I had a cigarette during next musical journey with another Pink Floyd album, Mettle.  Through the song Echoes, I got on my laptop, and I was trying to get on erowid to try to see if anyone else did the same combination as me.</p><p>My laptop had some virus problems, but according to my last scan, it was clear. As I tried to access a trusted website, I looked at the clock, 2:14, the load time was taking forever so I tried to close the page, but to no avail. I realized that my computer was in a similar state as me, the software had some kind of written in issues that changed the function of the machine, at the same time, inside of my head, I was tampering  with the hardware, my thoughts turned to how LSD causes a temporary deformation in the protein that lines the 5-HTP-1a receptor, and I thought back to the field of study that I decided to dedicate my life to, Biochemistry, I saw myself in a chamber, full of free floating neurons, I walked to a synapse and looked at it closely, I saw the normal form of a serotonin receptor, than I watched as a molecule of LSD bound to the receptor protein, I watched the diethyl structure force a kink to form in the protein, and suddenly, I was back in reality. fuck this is taking forever, I had to be at this for at least 10 minutes I thought.  I looked at my clock, still 2:14, all of that in under a minute.</p><p>I opened up a task manager on my computer and closed the frozen programs (an amazing feat considering the level I was tripping at)</p><p>Then I clicked on the internet explorer icon, typed the web address into the browser, and SUCCESS!  I found a few reports, from other people who have been in the same mindspace as me. I read some of these experience report, what a relief it was, just to know that that others have been to where I was and returned to share what they saw. I knew at that point that I had to share this experience with the rest of humanity. I called my cousin again and I light up another charcoal for my hookah.</p><p>I also found it extremely comforting to know how similar other peoples experiences where with these same substances. I felt a very strong connectedness to every other human on this planet, just to know how similar our minds really are.</p><p>At this point, I was back to the normal LSD level, and it was definitely tapering off, it was around 3:30 now.  I realized there was nothing more I could learn from this experience, and all that was left for me to do was to try to recall as much as I could from the peak of this journey.</p><p>I spent about an hour interviewing my cousin about what I said; he was on a caffeine binge, so he was probably in the best state of mind to remember what I said.  I recollected my thoughts and began to put together a draft of this report.  As I typed, I burned through my third bowl of shisha on my hookah.</p><p>Around 7:30-8AM, I returned to baseline. Now, its over 16 hours since the experience started and I know that I am not the same person I was before then.</p><p>Conclusions</p><p>On the Shulgin rating scale, at the peak of the experience, I was at a very high +3, almost a +4 experience, I walked along the border to that transcendental state of pure bliss, but the substances wouldnt let me cross into that realm, but I could see a small glimpse of it.</p><p>I would consider this experience as a positive one. I think I came as close to ego death as is possible without the experience becoming a painful trial, but here, I got a small glimpse of my mind with all of the doors of perception blown off the hinges. I feel like I barely scratched the surface of what I have to uncover in these higher states.</p><p>This experience was intended to be a shamanistic trip, and I came close to perceiving God. This trip also reaffirmed my conclusion from a previous acid trip, that I have a perfect mind for using psychedelics. I went so far beyond what I expected, and I grappled with dangerous and destructive thoughts, such as permanent insanity, and extreme paranoia, without allowing them to consume me. I exponentially raised the envelope of what I knew my mind could handle.</p><p>I also realized that I am at perfect peace with who I am. Im far from perfect, but I know that I am on the right path in life, and this experienced both reinforced the beliefs  that I hold that make the good likable person that I am, and it shattered all the beliefs that I held that were incorrect.</p><p>I would definitely use this combination again, however, I saw many places where this experience could get VERY dark and scary, and so I would have to tread with caution. I was in an unusually positive state of mind going into this, so I believe that this allowed the experience to stay overwhelmingly positive.  I was in such a beautiful mindspace and Oh what a strange and incredible journey it has been.</p>",
 "year": "2010",
 "id": "83692",
 "gender": "Male",
 "age": "19",
 "timestamp": "2012-10-31T07:00:00.000Z",
 "views": "3282",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "sublingual",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": "",
   "amount": "1 cart.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  },
  {
   "time": "",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  },
  {
   "time": "",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ]
}
