{
 "id": 8372,
 "title": "A Fairy Tale",
 "date": {
  "submission": "2006-07-14T07:00:00.000Z",
  "experience": "2003-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ark",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Ive done my fair share of drugs over the past two years. After experimenting with drugs like DXM and mushrooms, I began to get curious as to what other hallucinogenic drugs there might be. Ive done vast amounts of cocaine, molly, and an E-pill cut with Special K.  A friend of mine brought up the subject of acid some time ago, and it had been something of a light switch I flicked whenever I entered that particular room from the night he mentioned it and a certain music festival to which we were planning to attend. I consider it an answer to whether the chicken or the egg came first. We spoke of acid for a good chunk of the three-hour ride, as he felt confident we would find some that day. We parked the car and found a sheet of acid within 10 minutes. We were told that it was going to make us trip for fourteen hours, like it should. I admit I was slightly skeptical, but I have been told that the experience is never what some expect it to be. (Keeping myself from ever hearing or reading what it had been in the eyes of others made that rather easy.) What I did not hear, however, was that it was Fluff family acid.",
  "It has been more or less confirmed that it was not in truth from the Fluffs. Clearly some entity was watching over me that day. We each immediately took a single hit and retreated back to my car to blaze a few bowls. I believe that it was somewhere between 1:30 and 1:45 that afternoon that we dropped. We proceeded into the concert grounds at around 2:30. The concert was being held in a park spanning 666 acres of land, though we were restricted to only around twenty, with three stages. The two main stages were set up on the east and west sides so we could watch the sun rise and set against each stage with the passing of the day. We began to wander through the tents, and smack in the middle of them stood a single monolithic tent. I had just begun to start tripping and had left my phone in the car so inevitably I began to lose track of time, though the concept of time seems so trivial in retrospect. We wandered into the tent, and much to my amusement the entire hut was lined with framed blotter art.",
  "We continued to wander around the festival. We had hardly eaten anything since early that morning, but neither of us could really decide if we were hungry. Our urge to continue walking dissipated almost instantaneously, and we began searching for a place to rest and blaze again. It didnt take long to realize we didnt have anything to smoke with, or to smoke for that matter. We decided to lay down in one of the few shady spots on the grass, behind the tents and near a small lake. The music was loud, and coming from two directions as we were a median between the sunstages. I had been keeping rather quiet and was becoming incredibly introspective.",
  "I had been quietly observing each and every one of the people there as individuals, and suddenly that concept vanished and they became one living seething mass of energy. As they danced and went about their own ways, each ones soul seemed to pass directly through the others. My friend and I looked over at each other, and knew exactly what we needed to do. We both rose from our crushed cloven patch of ground and began to walk. This was the first of many times that I felt that our souls crossed. It seemed to me that there was no other reasonable explanation for these curious episodes. I felt that this was how people should be communicating, that if the rest of the world could just understand each other as this group of people moving before me.",
  "I felt unusually refreshed standing up after having been seated for any given amount of time, as if I was able to drink upon the energy of the earth like some twisted form of a vampire. It wasnt so much that we were tired from walking as much as we grew equally tired from either one after a particular amount of time. We forded our souls across the river before us until we reached the northern shore. Here we found a barren and frigid land, inhabited by natives in the form of concrete, security guards, a long row of tightly packed food vendors, and portable toilets. We had not decided that it was time to get food just yet, and we were wary of the unusual amount of guards posted here on these shores.",
  "We decided that it was time to smoke, but first we needed a bowl. As we gradually descended into the mass of people, I felt the need to turn my eyes skyward. Jutting above the tents and people was a flag adorned with a brilliant red and gold design. As soon as the beacon seemed as though it was ethereally connected to something in a place I could not entirely grasp the concept of, it appeared to be struggling to stay afloat this close to the northern shore. I noticed more across the tops of the island tents and began to feel as though this was sanctuary, a sort of home base.",
  "My friend bought a bowl, and we decided to smoke at a picnic table in the far southwestern corner near the lake and the sunset stage. The music felt as though it had always been there, like it was just as much a part of nature as myself, and the river of souls in front of us. We smoked our bowl and had a short conversation about the band that was playing. After that we decided to make another visit to the artery of earth we had been drinking from earlier. We arrived, and I lay down on my back. This was the first time that I had really truly concentrated on the sky. The sun was just far enough on its course to make staring at the sky pleasing to my eyes. The sky before me was rent open as easily as rice paper but as peacefully as a monk engrossed in calligraphy.",
  "What happened next will forever be a part of who I am now. It is something that gives definition to one of the shards of experience that comprises the mirror I look into within myself. I still find it difficult to adequately express what was in that moment, though I shall make an attempt nonetheless.",
  "The world of my peripheral vision was suddenly whisked away and I felt as though I had been absorbed into this rift that had appeared before me. I was ensconced into the sky, my elevation interrupted only by a lone soaring crow, and even the time and space behind him appeared as though it was being slowed by the rift. I was suddenly held hostage by an alluring pair of eyes, made only of color and light, peering out from their hiding place in the abyss. A pair of hands gripped the edge of the rift from whatever world was beyond, and a somewhat human form began to descend upon me. As the color and light began to transfigure into more visible form, I realized that it had a womans figure. She was composed of the purest energy from her waist down, which was extending like a snake back into its lair.",
  "Although what I was witnessing had left me at a total loss of both word and thought, the energy that this woman was showing me lit a fire in my mind. You were the one watching me earlier, I felt. We continued to move closer to one another as if she and I were a star collapsing into its self. Suddenly she was with me, and I could feel the wave of pure energy moving up my left side. The goddess was sliding up the left side of my abdomen and around to the top of my back. I could sense her eyes above, watching me, as I felt her hand touch my face.",
  "And just like that, she was gone. It felt like seeing the end of a fairy tale, which made me feel almost as if I was just a child, though I was well a",
  "ware that I would not have been measured as such by todays standards. All children are told fairy tales, then one day that all stops. But the tale never disappears, it is only hidden deeper and deeper inside us as we grow older.",
  "Instinctively I knew that I had just crested the peak of my trip. My friend and I once again looked at each other and began to swim the river again. Throughout the rest of my trip, I was able to see this goddess in everything around me. For that matter, the remainder of the trip felt almost mundane compared to what I had just experienced. I began to feel trapped inside this park with the music, seeing the same things and people over and over. Were it not for the music I might have sought my escape. We stayed until around 8:30 that evening, then left with a fairy tale safely tucked away behind the mirror."
 ],
 "erowid": {
  "id": "49904",
  "citation": " Ark. \"A Fairy Tale: experience with LSD (ID 49904)\". Erowid.org. Jul 14, 2006. erowid.org/exp/49904",
  "substance": "LSD",
  "views": "5058"
 }
}
