{
 "title": "Can Anything be Done?",
 "author": "Wayne",
 "citation": " Wayne. \"Can Anything be Done?: experience with JWH-018 (ID 83741)\". Erowid.org. Jun 17, 2010. erowid.org/exp/83741",
 "substance": "JWH-018",
 "bodyweight": "",
 "report": "<p>When I heard cannabinoid I thought THC, I figured JWH-018 couldn't be too different than THC being the same drug class. I intended nothing more than to have an intense and euphoric journey, but that's not exactly what occurred.</p><p>My friend tells me he has received JWH-018 in the mail. I recognize the substance from previous smoking blends such as 'Spice' and 'K2'. I was excited to try it! My friend and I planned on smoking it together and experience a trip dose. Everything went as planned, that is until, a few more people decide to show up. Unknowingly a few more people were invited, I didn't mind at the time, so we went down to my basement to smoke. They were smoking tobacco and weed, and I smoked cannabis with JWH-018 coating the top of the herb. My friend warned me about the intensity a small amount may produce, I didn't consider his warning and put a pinch full into the bowl over the weed. The white powder covered the herb and I pushed it into the bowl to create an even mix. I then took a large toke and held it in close to a minute.</p><p>1-10 Minutes in:</p><p>I didn't expect anything other than an intense cannabis-like high, but I felt the come up in a matter of minutes. I sat on my couch feeling immersed in another state of mind. A friend asked me to go upstairs and get my grinder, I accepted their request and went upstairs. A female guest told me not to fall, I viewed that statement as an indicator that everyone's aware that I'm coming up. </p><p>I walked up to my room feeling an intense dizziness similar to the way your body reacts before fainting. I made it upstairs and found my grinder! I sat in my bathroom for a minute and waited expecting to feel slightly more lucid before heading back downstairs, but that never happened; I just fell deeper and deeper into the mindset. I walked downstairs musing over the change in elevation, I feel as if I'm floating and sinking at the same time. I make it to the basement and try to get a clear glimpse at everyone's face, my vision seems slightly different, as if a vibration effect has been applied.</p><p>I hand the grinder to those who requested it then sat back on the couch. I felt anxious and fear fills my mind. Someone requests to play video games or watch TV, I don't reply to anyone until finally someone directly asks me 'How do you turn the TV on?' I reluctantly walk toward the TV and press power then immediately sit back down onto the couch.</p><p>10-30 Minutes:</p><p>I hear people talking but I don't comprehend it. I see faces looking at me, puzzling faces with a curious expression. Suddenly all the attention was drawn to me. I felt so uncomfortable that I couldn't sit still, I kept rubbing my head and moving around wishing the feeling would subside. I hear people questioning 'Are you ok? Are you all right, man?'. All the voices and attention was driving me mad, I couldn't shake the feeling and intensity accrued. I ruminated 'Is this what it feels like to die? Could I die right now? I wouldn't be surprised if this is what death feels like'.</p><p>I just wanted to act normal but my body and mind was tunneling into hell, I couldn't focus on anything or respond correctly to anyone's questions. One friend asked 'Do you wish so many people weren't here? Do want these people to leave?'. I thought about that but my perspective has changed. I was on the verge of seeking help from others due to the intense fear. I couldn't focus on anything at all and still have yet to really communicate with others. I was unable to convey what I am seeing and feeling.</p><p>30 Minutes - 1 hour:</p><p>I was asked 'Wayne, do you want it all to stop? Would you turn it off if you could?'. A statement synonymous to how I felt, I started reminiscing on that remark. I wanted it to stop so very badly, I couldn't handle the fear anymore. My guests were starting to freak out because I wouldn't respond to any of their questions or acknowledge their presence. They tried to pull me from the couch, I recall fuzzy images similar to lagging frames as I stood up and moved around. My friends told me they had to guide me to my room, they also claimed I walked around aimlessly and almost fell into a wall but was caught by a friend. The rest of the 2 hours is mostly a blurrr.....</p><p>2 hours - 3 hours:</p><p>I'm in my room without any memory of how I got there, I look at my walls and see colorful patterns, blue spheres with red plasma moving in and out. I looked around and my friends and my sister were present in my room. Just then I realize my sister must be aware of my state. There's a lot of talking but I don't recall anything stated. I was told I was given my laptop and I just stared at the screen and typed random keystrokes into Google's search text box. My sister and friends then rush in with cups of water and offer it to me, I drink cups of water but feel the same. Still not interacting I lay there tripping in a fearful place. My friends unable to help went downstairs and smoked some herb.</p><p>3-4 hours:</p><p>I lay there trying to articulate my thoughts so I can share this intense trip. More of the same visual distortions are recognized but intensified. I lay until my friends return to my room and I try my hardest to communicate. I was told my pupils are very large and my iris isn't visible. The trip slowly becomes less intense and doesn't completely fade until next morning...</p><p>I don't really feel like typing anymore, but I've learned my lesson and am more scrupulous when dosing a research chemical. In about an hour from now, I'll be doing JWH-018 again.</p><p>At a lower dose of course...</p>",
 "year": "2010",
 "id": "83741",
 "gender": "Male",
 "age": "20",
 "timestamp": "2010-06-17T07:00:00.000Z",
 "views": "9535",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  }
 ]
}
