{
 "title": "Confidence Enhancing, not Intelligence!",
 "author": "Average student",
 "citation": " Average student. \"Confidence Enhancing, not Intelligence!: experience with Dexedrine  (ID 83752)\". Erowid.org. Aug 6, 2011. erowid.org/exp/83752",
 "substance": "Dexedrine ",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "Amphetamines",
   "(daily)",
   "",
   "15 mg",
   "oral",
   "Amphetamines",
   "(daily)"
  ]
 ],
 "report": "<p>Frequently I hear my peers deliberating on how they can score some dexedrine, adderall or ritalin.</p><p>Maybe its a dick move, but although I'm on dexedrine, I tell its Strattera if they ask.</p><p>Why?</p><p>Imagine finals approaching, and a slew of ill-prepared university students knocking at your door, (because friend A told friend B told dude C who told girlfriend D you had it) begging you for some adderall and holding you responsible for their failure if you deny it: after all, they could pass if they had some too.</p><p>Sounds crazy, but in my experience it happens more often than you would think.</p><p>Amphetamine based stimulants, along with methylphenidate, are the new study drug of choice for university students, and have easily unseated caffiene from its throne.</p><p>Does it live up to the hype?</p><p>The one sure thing about pharmacology is that different people can experience different reactions from a drug.</p><p>I could be a minority in my experience, but I felt I would voice my opinion on the efficiency of these drugs for academics so that people can better decide if they really are the universal wonder-drugs they can get described as.</p><p>Maybe then I won't have to hide my prescription bottle and lie to my friends, or face the stigma of owning this stupid drug - even legally.</p><p>I have ADHD, and I really couldn't give a damn wether you believe in it or not. Yeah, I'm sure you're exceedingly qualified to speculate on the etiology of a complex neurobiological deficit in executive functioning, Professor Wikipedia.</p><p>This is relevant because the ADHD may affect how the drug affects me, as opposed to someone else free of it.</p><p>Academic Effects I Personally Experience:</p><p>-------------------------------------------------------------</p><p>At a normal dose, I actually don't even notice dexedrine is working - but other people do.</p><p>My brother who attends the same university as me can almost immediately tell if I've remembered to take my dosage that day.</p><p>I listen much better, I'm more mellow and not as impulsive, I remember dates, appointments and obligations, and I'm just an all-round normal person. Its really helpful.</p><p>Again - I actually don't notice a difference myself apart from feeling calm, not hungry and a dry throat - yet the desired effects are very clear and observable to others.</p><p>Academic wise it hasn't helped me as much as other people:</p><p>I always hear people talking about how it makes them super geniuses, and they study for 4 hours and get an A+, or just ace the exam through sheer willpower and awesomeness.</p><p>Well, I straight-up don't have that.</p><p>At prescribed dosages it just helps me sit still and pay attention to the lecture like my more motivated peers.</p><p>It definitely doesn't raise my intelligence, or intuition.</p><p>So why not take more? Well, I have and it produces a euphoric effect I don't get at my regular dose:</p><p>Essentially I think I'm hot shit, and I sit on my ass and daydream about how awesome I am, and how intelligent I am, and how I'm going to fucking ace the exam I have next week.</p><p>It makes big problems seem like tiny ones I can wave away with the flick of my wrist.</p><p>But I'm NOT super intelligent, or god-like, or going to ace the exam with self-righteous fantasies.</p><p>I can't just wave problems away as easily as I think I can.</p><p>I honestly think a lot of these accounts can get exaggerated because people THINK they're super intelligent because the drug boosts their confidence, not cognition.</p><p>If I want a good mark, I have to study and work hard like everyone else. Essentially I find amphetamines to be glorified caffiene pills, which ironically make the user feel glorified too.</p><p>They can be useful tools, if you use them correctly. Using them correctly is entirely dependant of finding the right dose and only using when necessary, which I would think to be difficult without the observation of a medical practitioner. There are too many potentially dangerous side effects - not to mention having legal consequences and a high addictive potential.</p><p>I wouldn't advocate their use, not because they're stigmatized, not because they're illegal, and not because of any illogical fear of the drug. Drugs are just tools, and any tool can get misused.</p><p>This particular tool is easily misused.</p><p>Bottom-line, it (when used at high, unprescribed doses) isn't worth it if your intent is only to get better marks and remain otherwise healthy. The risks simply outweigh the benefits for a healthy student, in my experience.</p><p>I haven't discussed the risks because it'll be more convincing if you just do the research yourself.</p>",
 "year": "2009",
 "id": "83752",
 "gender": "Male",
 "age": "18",
 "timestamp": "2011-08-06T07:00:00.000Z",
 "views": "18137",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(daily)"
  }
 ]
}
