{
 "title": "Please be Careful with Legal Highs",
 "author": "Raccoon00",
 "citation": " Raccoon00. \"Please be Careful with Legal Highs: experience with Products - Smoking Blends - Cannabis-Like (ID 83764)\". Erowid.org. Mar 22, 2010. erowid.org/exp/83764",
 "substance": "Products - Smoking Blends - Cannabis-Like",
 "bodyweight": "150 lb",
 "report": [
  "<p>Foreward:  I am a very experienced drug user (not that I'm proud of it).  I've tried almost every drug I could get my hands on, but mostly I liked uppers.  Not a big weed fan, not even beer.",
  "Recently I heard a lot of people raving about legal highs.  I thought, if it's undetectable with drug tests and gets you nearly the same results, why not?  I bought some K2/Spice from a popular online marketplace.",
  "The good experience:",
  "The first day I smoked a bowl, it wasn't bad.  I thought it'd be like weed and decided to treat it as such, to help me take a quick nap.  I packed a very small bowl and smoked ~3 big hits, and laid down to rest.  Within 15 minutes, I had a body high that rivaled anything I've ever felt.  I was a little disorientated with my vision, similar to before you pass out on salvia.  I was extremely aroused by the body high, and went to masturbate.  The orgasm was impressive.  Then I slept for 2 hours and woke up, quite refreshed.",
  "The worst experience ever:",
  "The second time I smoked, it was the worst drug experience I have ever had.  I came home from work and decided to smoke a tiny bowl.  Within 5 minutes, I started getting that distorted vision again.  I felt the body high again, but this time my head felt like it was throbbing too.  I looked in the mirror and my face was slightly red.",
  "The body high came on stronger and I decided to masturbate again, again with a nice finish.  30 minutes from when I smoked, things started going wrong.  The body high kept getting worse, my head started throbbing worse, and I started to realize that this body high could be me physically in trouble.  I went to check my blood pressure monitor, and it read 140/105.  I believe that is a rather odd reading (diastole a bit high).",
  "I started pacing, wondering if my body had a bad reaction to this jwh-018 chemical.  My mind's thoughts started getting sliced, it was like I could only remember the last 5 seconds, each coming up as a single image frame.  It was a serious struggle to decide what to do next.  I thought about taking a bath, but that'd elevate my heart and I may drown passing out.  I turned off all the lights, music, and laid down hopefully to calm my heart since I could not tell if it was racing, no matter how hard I focused.",
  "1 hour into it, my mind drifts in and out of focus.  I notice shallow breathing everytime I regain my focus.  I thought this was the end.  I thought people would find me dead in my apartment after a few weeks.  I seriously considered calling 911, or asking a neighbor to watch until I stop breathing.  I started to doze off physically while my mind felt like it went flying.  I tried to focus on breathing but I had no idea if I was breathing hard or shallow.",
  "2 hours into it, I am just starting to come down.  I hear a squeal like it was a pig, and it started bringing me back to consciousness.  I tried to think where that pig sound came from, but I strongly believe I made that noise trying to breathe.",
  "2 hours + 15, I felt I was going to make it.  Head throbbed less, ability to focus was coming back, body high gone.",
  "Conclusion:  Please, please be careful with K2/Spice or any jwh-018 product.  I fully realize most people never had my reaction, but this is a very new drug that made it to the market ONLY because of legal loopholes.  It never went through regular drug testing, because it's not marketed for consumption.  *WE* are the test rats.  This is a synthetic, lab made drug to act like cannabinoid.  It is NOT cannabinoid.",
  "Being a experienced drug user, I've learned something today.  I am not going to try new, synthetic drugs that have not been tested extensively.  Mushrooms, acid, mdma, cocaine, weed, opiates... they all have atleast decades of reports.  Prescription drugs might be my top drug now, since they are the cleanest and tested heavily, and professionally.",
  "If you want to smoke weed, smoke weed.  If you have a drug test, just lay off for a while.  If you decide to try untested drugs, please, be careful.</p>"
 ],
 "year": "2010",
 "id": "83764",
 "gender": "Male",
 "age": "27",
 "views": "7161",
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Products - Smoking Blends - Cannabis-Like"
  }
 ],
 "submissionDate": "2010-03-22T07:00:00.000Z"
}
