{
 "title": "Me? The Missing Domino?",
 "author": "The6stringbumRob",
 "citation": " The6stringbumRob. \"Me? The Missing Domino?: experience with Salvia divinorum (6x extract) (ID 8381)\". Erowid.org. Aug 3, 2004. erowid.org/exp/8381",
 "substance": "Salvia divinorum (6x extract)",
 "bodyweight": "160 lb",
 "report": "<p>At around 12 in the afternoon I was bored so I decided to try this salvia stuff out.  I smoked two hits of salvia 6x through a homeade bong and after that it was all over!  All of a sudden I get this feeling of not knowing who I am or where im at and then I start seeing domino like pieces that are falling while there is laughter comin in all directions.  Then I see that the dots of the dominos are people's faces and the black parts were the human bodies bent to fit.  They were all falling and I was suddenly caught in the chain and the laughter continued.  I started laughing also because I didnt know what I was supposed to do. </p><p>When I finally realized what my purpose was I immediately fell and continued the chain.  After that weird experience I tried to gain control of my mind but it was no use, my room was completely changed in all meaning of its existence.      The only true hallucination was the domino experience I just explained, afterwards I started to regain control but I just kept realizing how crazy my sudden experience was and whether that was the world I was supposed to belong to or the one I'm currently slowly going back to.  After trying this salvia extract I truly have to say I'm a believer that this can drive people insane.....just for a short while.  I was just glad that I kept my composure mainly because I was unfortunate not to have a sitter with me.  Salvia's effects while coming down, at least in my opinion, is hell.  The feeling is very unnerving and you just want it to end.  I was seriously walking around my apartment trying to find a place comfortable to sit but to no avail.  Don't get me wrong though I will try this stuff again but next time i'll have a sitter just in case.</p>",
 "year": "2001",
 "id": "8381",
 "gender": "Male",
 "timestamp": "2004-08-03T07:00:00.000Z",
 "views": "4529",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 6x)"
  }
 }
}
