{
 "title": "Bipolar for 5 Hours",
 "author": "not-spam",
 "citation": " not-spam. \"Bipolar for 5 Hours: experience with bk-MBDB (Mitseez Party Pills) (ID 83837)\". Erowid.org. Apr 29, 2010. erowid.org/exp/83837",
 "substance": "bk-MBDB (Mitseez Party Pills)",
 "bodyweight": "75 kg",
 "report": "<p>Well, I developed some interest in legal (europe) ketones lately, which got reinforced by one unearthly euphoric experience on mephedrone (4-mmc). After concluding that further experiments would definitely lead into addiction, I sought for ketone-MDxx-analogs.</p><p>So there came bk-MBDB which was said to be the ingredient of Mitseez-Party-Pills. They contain two caps for a reasonable price. So I dropped both and knew 10 mins later, that something profound was coming on. An hour later there I was, an euphoric buildup with psychedelic thought-patterns which lead to horrible crash bordering on a panic attack mixed with psychotic depression. Then it would settle, just to start over again from an euphoric introspective experience to utter hell. This was going on for 5 hours and for another one with declining highs and lows. Body was very sore after that, despite taking care of it. Next day was fine.</p><p>Ok, my setting wasn't that great but still this was way more despair then on a bad trip on psychedelics. The panic attacks ruined an experience which was very worthwhile in between, as I worked on my setting during the good periods of the drug. It reassured me on the path I was choosing and felt like strengthening  my ego in a healthy way.</p><p>Other people (say 20~50%) reported panic attacks or dysphoria for bk-MBDB (butylone) and mitseez, and subsequently equalize them. Others, on the other hand, reported great experiences - Hit and miss-</p><p>good luck</p>",
 "year": "2010",
 "id": "83837",
 "gender": "Male",
 "age": "27",
 "timestamp": "2010-04-29T07:00:00.000Z",
 "views": "7777",
 "dose": [
  {
   "time": "0",
   "amount": "2 capsls",
   "administration": "oral",
   "substance": "bk-MBDB"
  }
 ]
}
