{
 "title": "A Late Winters Night Trip Part 2",
 "author": "Orlninu",
 "citation": " Orlninu. \"A Late Winters Night Trip Part 2: experience with 2C-E (ID 83875)\". Erowid.org. Oct 28, 2010. erowid.org/exp/83875",
 "substance": "2C-E",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "16 mg",
   "oral",
   "2C-E",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>16mgs</p><p>A Late Winters Night Trip part 2</p><p>I sat down on the couch in front of a glass table. It was 9:30 and I had a movie playing on the TV. I had everything I needed laid out before me on the table -scale, 2ce, half a gel cap, a knife. I thought to myself 'This half of a gel cap, it's like a tiny shotglass', and then I got to work. I loaded up the partial gel cap, and weighed and reweighed it repeatedly while adding and remove product with the knife. I wanted around a 16mg trip tonight, and I weighed and reweighed accordingly until it was weighed correctly.</p><p>I placed the gel cap on my tongue, and I breathed in before swallowing. When I breathed in, I (on accident) sucked the 2ce into the back of my throat. I swallowed the empty cap and chugged some of my drink to try and make the strange buzzing feeling in my throat go away, go figure it came in waves. It went away permanently after about 15 minutes or so.</p><p>By about 11 I was feeling it and had retreated to bed. I began to roll around in the dark, feeling more and more like I was rolling as my mind and body became more and more activated by the 2ce. As they were activated, I felt my / body feeling similar to x / teeth grinding / darkness / paranoia / lightness / prayer / examined and judged personal relationships with those close to me and how to beset improve them (massive hours long introspective session) / visions of many things, notably large morphing objects and patterns, faces meshed into eachother at angles to one another/ sounds / coincidence, or the feeling of the existance of a cause and effect relationship between two or more things that would normally seem unrelated in the physical world.</p><p>Like hearing and controlling very clear synthesizer noisers of escalating volume with a visual component of morphing constiuency. Then, just when the synthesizers reach some kind of crescendo or movement where they get really loud and come down like a hammer, and the universe seems like its about to crack apart around me from it and I begin to want to open my eyes and distract myself - a car revs somewhere outside in a street.</p><p>I hear it from my room and it feels like the sounds and visions I had amplified in my mind with the help of the 2ce, caused the car to rev, or the sound to happen. Synesthesia as always was present, this time manifesting for a breif moment as seeing and feeling a clear picture in my head of my toe as I felt it drag along a blanket I was under. Paranoia was present, with a few nervous peaks out the window and a paranoic slant to alot of the introspective session (and a huge positive negative duality portion). I remember feeling like perhaps going beyond duality is leaving this world, as from all I can see this world is duality incarnate.</p><p>There are positive and negative poles at the atomic level, and my mind pointed to these as evidence that I should push positivity and lead a positive life. The teeth grinding was extreme this time and I had to really try not to bite down (I held my teeth slack just clear of biting down), I think I want a mouth guard next time. It came in waves, echoes, pulsations. sort of light, stronger, strong strongest and maybe a quiver of the extremities at this point and then release back to light for a few seconds or however long, and repeating this cycle, slowly falling in intensity and eventually back to baseline about 5 or 6 hours later.</p><p>With baseline comes sleep, but not very much sleep as I had to get up in the morning and go out, something I loathe to do the morning after a trip -but it worked out just fine, I caught up on sleep the next day and wrote this report the next night. This was approximately my 8th dose of 2ce ranging from 12-20mgs. Until next time.</p><p>Orlninu</p>",
 "year": "2010",
 "id": "83875",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2010-10-28T07:00:00.000Z",
 "views": "2633"
}
