{
 "title": "One Love",
 "author": "Malkie",
 "citation": " Malkie. \"One Love: experience with Cannabis (edible and smoked) (ID 83873)\". Erowid.org. Nov 3, 2011. erowid.org/exp/83873",
 "substance": "Cannabis (edible and smoked)",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Cannabis",
  "(cookie / food)"
 ],
 "report": "<p>I use cannabis medicinally as a sleep aid. I have successfully been using it for over 1 year with no negative effects. I have horrible insomnia that results in my staying up for days on end. It got so bad I started having visual hallucinations from lack of sleep. I managed to kind of control it by taking small (50mg), then medium (150mg), and then large doses (300mg) of the OTC anti-histamine Benadryl (Diphenhydramine). I eventually sought help from my doctor who prescribed me, of all things, anti-depressants.</p><p>She thought I was depressed and did not know it. The funny thing is my life was just beginning to get better. My parents had divorced (I had an abusive/alcoholic father who would one day make the news for a DWI, go figure), I had a new girlfriend, got a new step-father (really nice guy), and started college (I have a GED so I started college at 16. I am a pretty smart kid for a stoner lol and high school felt like day care with 3rd grade work so I needed a stronger, more knowledge producing environment).</p><p>She put me on Trazodone. It sucked for the first week and eventually started working good. The bad thing was I would become an emotionless zombie who was feeling a forced sense of sedation. It felt very dirty and unnatural. Then one day it just stopped working. It produced horrible effects after. Making me question life and contemplate suicide. It made me very disturbed.</p><p>I told her about it asking her for a real sleep aid and not some bogus anti-depressant that would do more harm then good. She then put me on Celexa, yet another anti-depressant. This one took the cake. The first time I took it I flipped out! I could not control my body at all, I had crazy visual hallucinations and just wanted to die. I flushed the rest of those pills down the toilet as soon as I was able to walk.</p><p>I then started reading about cannabis as a sleep aid and found that edibles and purple indica strains work well. Since purple strains are normally only sold as high grade, I could not afford it. So I took what I could and learned to cook edibles. I started with firecrackers and teas, then making oils, tinctures, and cannabutter which lead to more complex recipes like brownies, cookies, truffles, etc.</p><p>They worked tremendously. I had never been more happy. It felt so natural and relaxed me. When I would wake up, I would be relaxed and content with everything. Everything was looking good.</p><p>While doing my thing and enjoying my latest cooking creations I would grow nice purple strains. Growing is a lot harder than I thought but after some practice and tons of help I managed to yield some pretty decent smoke which only got better as I kept growing and practicing different techniques.</p><p>Purple indica strains work extremely well for producing a strong couch lock and knocking me out if I smoke enough lol.</p><p>Cannabis is a very good medication and works well for so many things. They may say it is illegal but that will not stop me from using the herb which has helped me for so long.</p>",
 "year": "2010",
 "id": "83873",
 "gender": "Male",
 "age": "16",
 "timestamp": "2011-11-03T07:00:00.000Z",
 "views": "4539",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  }
 }
}
