{
 "id": 8396,
 "title": "From Self-Confident to Self-Loathing",
 "date": {
  "submission": "2008-04-29T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Indulgence",
  "gender": "Female",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "ground / crushed"
  }
 ],
 "report": [
  "It's 6:30 on a Monday night, and I have been up for 33 hours. I actually do legitimately have ADD, but last night at approximately 12:00 I decided to take advantage of my 10 mg Adderall prescription. I had actually intended on only snorting 5 of the remaining 10 pills left, but that was a naive promise to myself.  I ended up snorting all 10 within 5 hours.",
  "I'm relatively inexperienced as far as drugs go. I'm 14 years old (yeah I know, I'm young) and I've tried weed, alcohol, and various pharms that have been prescribed to me for insomnia, anxiety, etc. But even with my limited experience with drugs, I can say this: I absolutely fucking love amphetamine, maybe too much. At a therapeutic dose it just makes me calm and focused, but I guess that isn't enough for me. I usually do anywhere from 50 to 100 mg when I want something more than being focused. The feeling is absolutely amazing while it lasts. I feel genuinely at peace with myself and the world around me. I'm no longer some 14 year old girl, but I have to power to inform, to influence. I have amazing self confidence on Adderall, but not to the point of being cocky. I just feel completely comfortable in my own skin.",
  "I feel an urge to crawl into the minds of others, to understand them, to relate with them and feel like I'm understood as well. I could easily sit and have a 3 hour long conversation with a stranger and feel completely in tune with their thoughts, and there wouldn't be one awkward pause in the conversation. I normally stumble over words and sound fairly stupid when I talk, but on Adderall that part of myself is completely gone. In the state I was in 18 hours ago, I was unstoppable. I could form a perfect argument, theory, whatever, and convey it with ease, even if it was on a subject I had no knowledge in.",
  "Music sounds amazing. It doesn't physically -sound- any different, but for me listening to Jimi Hendrix or Sublime is a new experience in itself. Every note, every syllable takes on a new meaning. Or perhaps the meaning was always there and it just now occurred to me. Last night - technically early this morning - I laid in bed for hours on end, listening to my iPod, captivated by the songs I had heard hundreds of times before. My mind flowed in and out of Hendrix's riffs, the Grateful Dead's incomprehrensible jams, some songs even bringing me to tears. I never once had a desire to do anything but what I was doing then: listening, but finally hearing, if that makes sense. It probably doesn't.",
  "Since I actually have ADD, amphetamine doesn't speed me up as it would 'normal' people, but I do get some physical side effects. I don't feel a need to constantly be in motion, but if I start a repetetive motion it's hard to stop. My heart rate increases, but not alarmingly so. My hands get extremely cold and it's hard to warm them back up.",
  "As of right now, it's 7:08 pm. The sheer beauty of amphetamine is gone and I feel slightly empty. I have no more little blue pills until Jan 31st when my script actually runs out. Today is the 23rd. My legs are extremely sore from the uncontrollable jiggling and shaking they were doing during the high. In fact, my whole damn body is sore. I have no desire to eat and haven't in hours. This report has become entirely too long, and these are just the ramblings of some drugged up kid. I have little self-control, which is why my prescription is now empty and I feel like shit."
 ],
 "erowid": {
  "id": "49967",
  "citation": " Indulgence. \"From Self-Confident to Self-Loathing: experience with Amphetamine (Adderall) (ID 49967)\". Erowid.org. Apr 29, 2008. erowid.org/exp/49967",
  "substance": "Amphetamine (Adderall)",
  "views": "5349"
 }
}
