{
 "id": 8398,
 "title": "Clear Mind, Amazing Night",
 "date": {
  "submission": "2002-01-10T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "calpo"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "The night began when one of my friends just decided, spur of the moment, that we should take some mushrooms we had left over from another trip. Being completely unprepared I was a little bit nervous. Normally I like to mentally prepare myself for what I might see or feel a little bit before hand. But, at about 8:20, we ate the mushrooms with some chocolate cake. Not very much longer (maybe 20 minutes to a half hour) they started to kick in. I live in residence at a university and none of my companions could handle the overwhelming colour of yellow or the musty smell so we decided to go for a walk.",
  "This is where things got interesting.",
  "I hope this doesn't get too cheesy. Even when I am not stoned I feel an affinity for trees and the earth but that night was a  culmination of that. Under a moon slightly hidden by clouds we went to a little forested area with ponds, fountains, a giant pagoda like building, and perfectly sculptured trees all around us. It was magical.",
  "Sitting on the ground for a bit I started noticing the earth breathing in time with me. In fact I could feel my entire body as an extension of the ground and the earth around me. My friends and I dispersed through this little wonderland and found things to occupy ourselves with. For me it was the trees. All around me the branches swayed and danced. As I saw the moon breaking through the clouds and lighting the pond I attained a clarity I doubt I will ever repeat. Everything made sense. I understood that for centuries people had looked at the same moon; they had walked on the same ground. I even gained an insight into my friends and felt a love for them impossible to describe even now. Without saying a word to them I felt I understood them and, in part, all of humanity and it's place in the world. I could feel the love and the warmth emanating from the trees around us. I thought back to some of the books i have read on buddhism and tried to place what I was feeling and gain some insight but instead of thinking all I did was let go and breath. I felt I could breath deeper, think clearer.. hell, i could do anything. But all I did was sit on a bench surrounded by trees and BE. I let the wind rush through my hair, my hands rest in my lap, and I had one of the best 'trips' I have ever had.",
  "I don't know what I took away from the experience except for a glimpse of the calm I felt. I can't remember the answers I came up with to the world around me. I can't see the unity when I look at the moon anymore. But what I can do is look back to that park and that night and know that I experienced something magical."
 ],
 "erowid": {
  "id": "4997",
  "citation": " calpo. \"Clear Mind, Amazing Night: experience with Mushrooms (ID 4997)\". Erowid.org. Jan 10, 2002. erowid.org/exp/4997",
  "substance": "Mushrooms",
  "views": "9129"
 }
}
