{
 "title": "Psychoactive Cocoa",
 "author": "Sids",
 "citation": " Sids. \"Psychoactive Cocoa: experience with Chocolate (ID 8399)\". Erowid.org. Jul 18, 2002. erowid.org/exp/8399",
 "substance": "Chocolate",
 "bodyweight": "165 lb",
 "report": "<p>Well, most of you are going to laugh at this, but it is all true -</p><p>Psychoactive chocolate drinks?  You have to use bakers chocolate and cocoa.  Eating a pound of Hershey's will make you puke and feel shitty.  However - Hershey's COCOA POWDER and BAKING CHOCOLATE can give you a langourous sense of relaxation and well-being if you do it right, and in a rather excessive quantity.  This is not for the calorie conscious or the non-lover of chocolate.  This is 12oz of the strongest cocoa you will ever taste.  It is smokey, dark and bittersweet.  Here's how to do it:</p><p>Make yourself some hot milk - about 8 oz.  After you bring it to a boil, stop, and stir in enough cocoa powder to create a deep, rich, reddish brown color.  Now saturate the solution with sugar.  Next, add about 2 oz of cream.  This should make the color much lighter.  Add cocoa until it gets darker again.  Now, heat it so that it is quite hot - don't let it boil again. </p><p>Now, stir in about 2oz of bakers chocolate and as much sugar as you want.  This should make a very dark brown, somewhat soupy, sweet mess.  Drink it slowly - sip it over the course of a half-hour, maybe an hour.  Don't rush it.  This prevents the unpleasant, sweaty feeling of nausea that I associate with eating 'too much' chocolate (as if there is a such thing!).</p><p>I usually begin to feel relaxed and comfortable and happy after about 30 minutes.  This feeling builds over the next hour and then slowly fades.  I'm not sure if this is because of the alkaloids in the chocolate, or if it is due to the MASSIVE endorphin release that is supposedly happening when you eat something sweet and tasty.  Whatever it is, I enjoy it.  It is a good time to just sit down and chill out, read the paper, talk to friends, type a friendly e-mail.  It isn't a mind-blowing natural high, and it is not an entheogen by and stretch.  It's just a good feeling that comes from something palatable and fun to make.  Happy Cocoa-making.</p>",
 "year": "2001",
 "id": "8399",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-07-18T07:00:00.000Z",
 "views": "66465",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "12 oz",
   "administration": "oral",
   "substance": "Chocolate"
  }
 }
}
