{
 "title": "Groovy with Energy",
 "author": "Rainwalker",
 "citation": " Rainwalker. \"Groovy with Energy: experience with Methylphenidate, Alcohol, Cannabis & Tobacco (ID 8411)\". Erowid.org. Nov 16, 2004. erowid.org/exp/8411",
 "substance": "Methylphenidate, Alcohol, Cannabis & Tobacco",
 "bodyweight": "190 lb",
 "header": [
  "DOSE: T+ 0:00",
  " ",
  "smoked",
  "Cannabis",
  "",
  "",
  "30 mg",
  "insufflated",
  "Pharms - Methylphenidate",
  "(ground / crushed)",
  "",
  " repeated",
  "smoked",
  "Tobacco - Cigarettes",
  "",
  "",
  "2 glasses",
  "oral",
  "Alcohol - Beer/Wine",
  "",
  "",
  "4 shots",
  "oral",
  "Alcohol - Hard",
  "",
  " T+ 1:30",
  " ",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>Methylphenidate (30mg, snorted)  Alcohol (2 cans beer, 4 shots rum), marijuana (2 roaches, medium quality), tobacco (3 cigarette</p><p>That night I was feeling good already (just got home from a most excellent date).  I was at home, comfortable and relaxed, but tired.  I started the night by smoking a roach and snorting 30mg of ritalin at about 12am, then I had the alcohol (2 cans beer, 4 shots rum) until 12:45am, and smoked the other roach at about 1:30am.  Three cigarettes of tobacco is just an estimate, as I smoked my mother's leftovers throughout the night to aid my buzz (if I don't smoke tobacco very often, it makes my weed buzz much cooler).  My  body generally felt the same; stomach a little bit queasy from a lot of quick alcohol,  and throughout the night I felt a sort of dry tightness in my mouth, especially in the roof, which is typical of when I snort ritalin.  I felt drunk...everything was fuzzy and my vision was blurred, but my hearing seemed to be more acute.  Also, I had more energy then than I had all day, and probably more than I have had in a long time.  I was able to get up and move around where normally (and especially when I'm high) I'd simply say 'Nah, fuck it.' </p><p>It was sort of euphoric...I felt very happy, and very energetic, and I had this feeling like everything was right with the world.  Also, I watched The Next Karate Kid, and the phrase 'Sun is warm, grass is green' had a strangely profound effect that I can't quite remember.  The entire night continued like this, until I went to bed around 5am.  I began to feel uncomfortably hot then, and had to fake being asleep as my mother awoke and got ready for work.  The ritalin eventually wore off around 6am and I slept from then until 1pm.  When I woke up, I had a slight headache, and felt cottonmouth, but the tightness in the roof of my mouth was gone.  All in all, it was a pleasurable experience, but I'm trying to find a way to take heavy hits of ritalin without snorting it (the tabs I have are time released, which means little to no real buzz...perhaps I could crush and dissolve in water, that may help).  I think the only major complaint I have about rits now that I've used them a few times is that they burn the hell out of my nose.</p>",
 "year": "2001",
 "id": "8411",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-11-16T08:00:00.000Z",
 "views": "20281",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": "30 mg",
   "substance": "insufflated"
  },
  "2": {
   "time": "Pharms - Methylphenidate",
   "amount": "(ground / crushed)",
   "administration": "",
   "substance": " repeated"
  },
  "3": {
   "time": "smoked",
   "amount": "Tobacco - Cigarettes",
   "administration": "",
   "substance": ""
  },
  "4": {
   "time": "2 glasses",
   "amount": "oral",
   "administration": "Alcohol - Beer/Wine",
   "substance": ""
  },
  "5": {
   "time": "",
   "amount": "4 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard"
  },
  "6": {
   "time": "",
   "amount": " T+ 1:30",
   "administration": " ",
   "substance": "smoked"
  }
 }
}
