{
 "id": 8414,
 "title": "Bup Detox Not for Everyone",
 "date": {
  "submission": "2008-04-05T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "quackntrash",
  "gender": "Male",
  "weight": 127
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Methadone"
  },
  {
   "time": "0",
   "amount": "T+ 0:00",
   "administration": "",
   "substance": ""
  },
  {
   "time": "Heroin",
   "amount": "",
   "administration": "T+ 12:00",
   "substance": "4.0 mg"
  },
  {
   "time": "sublingual",
   "amount": "Pharms - Buprenorphine",
   "administration": "(pill / tablet)",
   "substance": "T+ 15:00"
  },
  {
   "time": "4.0 mg",
   "amount": "sublingual",
   "administration": "Pharms - Buprenorphine",
   "substance": "(pill / tablet)"
  },
  {
   "time": "20:00",
   "amount": "4.0 mg",
   "administration": "sublingual",
   "substance": "Buprenorphine"
  }
 ],
 "report": [
  "I have had a pretty rough heroin habit for a couple years now. Last May I got my shit together and signed up at a methadone clinic. That stuff is golden. I was going through $150/day of dope but an $11 90mg daily dose of methadone would hold me well over 24 hours.",
  "Eventually $330/month just seemed rediculous. I did a 30 day detox and was off methadone as of four days ago. Unfortunately, on the way down, my heroin use went up to compensate. So by the end of my detox I was back to square one with a decent dope habit. They say the long half-life of methadone contributes to the extended withdrawal. It must, because two days after my detox you could say a 80% heroin withdrawal set in. No sleep, intestinal pain. no appetite, irritability, etc, etc. I had to do something to keep from reverting back to heroin full time.",
  "I found a doctor who does bupronorphine withdrawal and immediately got a script for Subutex (Bup brand name). They are 2mg sublingual tabs. He instructed me not to take them until 24 hours after my last opiate so that the Bup wouldn't throw me into hardcore withdrawal. I waited, but only made it 12 hours. I figured it couldn't get much worse. I took 2 2mg tabs followed three hours later by two more followed five hours later by two more. That puts me at 12mg (3 times the dose my doc prescribed) and I have felt 0 relief. For people who have infrequently used opiates, Bup will get you high (and likely very ill), but to the junky it's BS.",
  "Its 11am and I haven't slept in 48 hours. I have a bitchin headache, a bottle of worthless medication and a $700 doctor bill. The moral of the story is, methadone is great as long as you stick to it and nothing else. Bupronorphine may be good for some but it has just wasted my time and money."
 ],
 "erowid": {
  "id": "50013",
  "citation": " quackntrash. \"Bup Detox Not for Everyone: experience with Methadone, Heroin & Bupronorphine (ID 50013)\". Erowid.org. Apr 5, 2008. erowid.org/exp/50013",
  "substance": "Methadone, Heroin & Bupronorphine",
  "views": "19492"
 }
}
