{
 "id": 8417,
 "title": "Live Saving Bore of a Miracle Chemical",
 "date": {
  "submission": "2008-03-29T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Alpha",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "24",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Buprenorphine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "number": "8.0",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Naloxone",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "number": "6.0",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Benzodiazepines",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "number": "6",
    "unit": "glasses"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "daily",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "For over a year now I've been taking suboxone to treat my opiod addiction. I was very excited when given the chance to be a part of this new chemical and experienced a plethora of highs and lows. The highs are it almost completely cured me of my life devistating heroin addiction. The lows are it produces practically zero euphoria which is very uncommon in opiods.",
  "Dissapointed by the small recreational value of the drug which was brought about by the addition of naloxone to prevent injection, I went to another doctor to ask for Benzos. I receieved scripts for 2mg klonopin 3 times daily and 30mg temazepam 1 time daily.  Neither of these high doses of potent benzos did anything to boost the suboxone. Even with the average six pack of beer I drink nightly. Either I am almost completely immune to drugs or I have some kind of brain damage. The reason I say that is I have seen people become completely trashed off of 2mg a suboxone. I take 24 mgs a day. Also with klonopin I've seen people pass out do to 2mgs. I take 6 mgs daily and hardly feel a thing."
 ],
 "erowid": {
  "id": "50022",
  "citation": " Alpha. \"Live Saving Bore of a Miracle Chemical: experience with Buprenorphine with Naloxone (Suboxone), Benzodiazapines & Alcohol (ID 50022)\". Erowid.org. Mar 29, 2008. erowid.org/exp/50022",
  "substance": "Buprenorphine with Naloxone (Suboxone), Benzodiazapines & Alcohol",
  "views": "22193"
 }
}
