{
 "title": "Sex Rocks on Rolls",
 "author": "DE",
 "citation": " DE. \"Sex Rocks on Rolls: experience with Ecstasy (ID 843)\". Erowid.org. Oct 20, 2000. erowid.org/exp/843",
 "substance": "Ecstasy",
 "bodyweight": "195 lb",
 "header": [
  "DOSE:",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)"
 ],
 "report": "<p>I first took E about a year ago.  I had heard of it back in 1994 for the first time, but I never really thought too much about it.  Well a coworker had a few pills, so I bought 3 or 4.  They were stamped with 007.  I came home and took one by myself, so that I could know what the experience was like before I would let my wife try them.  I sat there for an hour and still didn't really feel anything.  Then a few minutes later I started to feel all tingly throughout my body, like some sort of rush was coming over me.  Then I just started getting this unknown source of energy.  I was watching TV at the time.  Something like MSNBC or something.  But all that I could remember is thinking that the anchorwoman was so beautiful.  I felt like I wanted her, and that if she was here with me, I wouldn't have a problem telling her that.  I felt horny as can be.  Everything felt so nice.  I went and took a shower in the dark and I think I  was in there forever.  It felt so good.  Shampooing my hair washing my body.  Every part that I touched felt incredible. </p><p>Later that night my wife came home from work and I was incredibly complimentary to her.  Telling her how beautiful she is and how sexy she is.  She sat there looking at me and asked if I was on something.  I had no problem in telling her that I was, because I really felt that I had anything to hide.  I told her what it was and she tried it.  And believe me, my wife has never tried any drugs before and doesn't really drink either.  We waited about an hour and she started feeling the effects, as we just touched each other and caressed one another's bodies.  It was one of the greatest feelings ever.  We explored each other for about five hours having some of the most enjoyable, wonderful sex.  We have rolled many, many times since then.  It is one of the funnest things to do.  We roll maybe on average about twice a month.  We have had many different types of pills, some ranging from excellent (green alligators) to some just okay.</p><p>But be careful because one time this guy sold me something else in the same form as E and I definitely didn't like it.  I felt real drunk and dizzy for the rest of the night.  So definitely know your source.  Also, the day after feelings depend on the type of pill.  Sometimes I feel real tired and I can't even get up all day, and sometimes I can get up and go workout.  It all depends.  However I would recommend to do it when you don't have important things to do the next day.</p>",
 "year": "2000",
 "id": "843",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-10-20T07:00:00.000Z",
 "views": "15816",
 "dose": {}
}
