{
 "id": 8435,
 "title": "Physically Active, Mentally Calm",
 "date": {
  "submission": "2001-02-06T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Delf",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Piperazines - BZP",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Piperazines - TFMPP",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Having the evening off from work, and just having come across some of the more well-known piperazines, I decided to give 100 mg of BZP a try along with a bit of TFMPP.  I had tried 100 mg of TFMPP alone in the past, but it left me feeling like I had been slightly poisoned, and I was hoping the BZP would provide a nice, synergistic effect.  Not exactly looking for an MDMA substitute, but actually excited to try something new for a change...",
  "The previous week offered negligible emotional and physical difficulty, and with no recent use of entheogens or medications at all, I measured 100 mg of BZP and threw it in a gelcap; put 20 mg of TFMPP in another.  (Still had to be convinced that the TFMPP was worthwhile.)  Downed the combo with water at around 7pm; by 8:15 the old reliable stomach was rumbling.  I was quite glad I had not eaten since noon.  Half a rice cake",
  "By 9pm (T+2) I was in quite a comfortable place... music sounded good and thoughts flowed freely, although my hands were FREEZING like the arctic winter.  I called up my best friend K and she talked me through things a bit.  Only a trace of anxiety, slowly giving way to a calm, surging, God-like feeling... the comeup was not nearly the same as TFMPP by itself.  That, in my humble opinion, not fun. ",
  "10pm (T+3) and I am flying.  Physically active, mentally calm, hands freezing, and monumental thirst.  I'm still on the phone--friend noticed that my voice had dropped considerably.  Thinking back, I don't think I could have pulled myself together entirely for, say, a business transaction or conversation with a family member.  Good thing I was alone.  But I wish some others had been around... maybe next time.",
  "All in all, I had a very good time with this combo.  Perhaps I am conservative but I don't think a higher dose would have added much, but to each his or her own.  I don't usually sit around and dose by myself for fear of paranoia, but there wasn't much here at all.  I didn't get to sleep until 5am (T+9), but what did I expect?  For those who like to make comparisons, the BZP/TFMPP combo in this dosage range provided many of the same impressive characteristics as would a low to average dose of speedy MDMA, with a slight bit of trippiness and a few extra body symptoms included.  (These could be unnerving to inexperienced users.)  But the musical and somatic effects were there.  As was the second-day-after depression, and also a slight but persistent next-day headache, curable by healthy doses of fruit juice and sleep. ",
  "Be safe and have fun, and take care of yourself..."
 ],
 "erowid": {
  "id": "5010",
  "citation": " Delf. \"Physically Active, Mentally Calm: experience with BZP & TFMPP (ID 5010)\". Erowid.org. Feb 6, 2001. erowid.org/exp/5010",
  "substance": "BZP & TFMPP",
  "views": "19868"
 }
}
