{
 "title": "Powerful",
 "author": "Jay",
 "citation": " Jay. \"Powerful: experience with Phenibut (ID 84383)\". Erowid.org. Feb 25, 2012. erowid.org/exp/84383",
 "substance": "Phenibut",
 "bodyweight": "180 lb",
 "report": "<p>Background: I am familiar with weed, opiates, cocaine, amphetamines, Benzodiazepine, kratom, mushrooms, and most amino acid supplements. I have become dependent and temporarily addicted, but I have always fought back to freedom. Currently, I dislike most drugs (all but opiates, which have a reserved warm place in my heart)</p><p>Phenibut is... powerful</p><p>Its effects are akin to the mental effects felt from vicodin (more like buprenorphin if you are familiar with a high from that). I have determined that there are only a few brands that are effective.</p><p>I received my order and, out of a Christmas-like enthusiasm, I ingested 5 pills.</p><p>+30 mins: Barely any noticeable effects, except a slight calming feeling approx. that of a cup of chamomile tea.</p><p>+2hrs: The effects have kicked in. I feel slightly dizzy and my head feels like it is gently buzzing.</p><p>+3hrs to +10hrs: I am way more sociable with thoughts of life and feelings of happiness swirling around me. A state of euphoria. My ability to play piano seems to have increased, Ill call it increased neuron signaling (A real thing, although the term requires your own research and understanding, since I did not use it correctly or only coincidentally correctly)</p><p>After a good nights rest I wake up feeling stimulated and glowing. A completely different feeling, content with life with a hint of nausea.</p><p>Effects are subjective always. The main purpose of this report was to inform. Do your research on the product. Do your research on the brand. Most experience reports listed seem to have been placebo caused by a bs brand, in my opinion. Mixed reviews stating that they felt nothing, could have possibly been a bad brand, using the wrong isomer.</p>",
 "year": "2010",
 "id": "84383",
 "gender": "Male",
 "age": "24",
 "timestamp": "2012-02-25T08:00:00.000Z",
 "views": "10627",
 "dose": [
  {
   "time": "0",
   "amount": "3500 mg",
   "administration": "oral",
   "substance": "Smarts - Phenibut",
   "form": "(powder / crystals)"
  }
 ]
}
