{
 "title": "To the Hospital for Very Elevated Heart Rate",
 "author": "catsarefun",
 "citation": " catsarefun. \"To the Hospital for Very Elevated Heart Rate: experience with Methylone (ID 84470)\". Erowid.org. Mar 22, 2010. erowid.org/exp/84470",
 "substance": "Methylone",
 "bodyweight": "185 lb",
 "report": "<p>I would like to submit my experience with methylone, because reading on here Ive never heard of anybody having a similar experience.</p><p>It was peculiar, because I have quite a lot of experience with various chemicals, probably most extensively with MDMA and amphetamines, but have also experimented with LSD, mushrooms, cannabis, opium, cocaine and have never had an experience quite so terrifying.</p><p>I hadnt taken anything recently though, most of those experiences were several years earlier. Anyways, I had heard a lot about methylone and decided I would try some, I took a dose of around 150mg at about 10:30am Saturday morning, I figured if I did it early in the day I would be able to sleep that night, as amphetamines and such normally give me awful insomnia!</p><p>I was a little concerned as soon as I took it (orally) as I felt a slight shift in my perception within 2 minutes, and the effects grew from there over the next hour. I was just sitting at my desk listening to music and having a pretty good time, when I felt as if the effect was dying already. I decided to take a similar dose to the initial one as Id heard of many people doing this as a rule to get the best experience.</p><p>Within 5 minutes of doing this I felt a little strange, so I stood up to get myself some water. Big Mistake, as I did this my heart started pounding a million miles an hour, and I felt very flush. Its difficult to describe how I felt, but to cut a long story short I felt like I was about to drop down dead, right then, right there. I'd never been so sure in my life.</p><p>I grabbed the phone and called an ambulance! I was taken to hospital with very high rate of tachycardia (my heart was beating at 176bpm at one point, and changing from 130 to 90 then up again within about 10-15 minutes). I was so scared, I really did think that was the end of me. I was admitted to hospital, and given diazepam to calm me down, but nevertheless, I remained in the hospital for 2 days, with elevated heart rate. It came down to around 90 on the morning of the second day, and I was allowed home. Please be careful if you choose to use this substance, its really not pleasant if you end up in hospital or worse!!</p><p>Just regarding a couple of extra details: I did tell the staff at the hospital/ambulance what I'd taken, but as methylone is fairly new to the scene, they knew NOTHING about it, which only added to my anxiety, as I didn't know whether they would be able to 'save' me. Thankfully, I'm back to good health now and haven't had any persisting effects, nor do I plan to take methylone again!</p><p>I don't know of anyone else took methylone from the same source I did.</p><p>----------------------------------------</p><p>Jul 14, 2010 Addendum</p><p>I'd like to add that the doctors in the hospital appeared very concerned, and when I was admitted to the emergency assessment unit from A&E I was seen by another doctor, and I was feeling really strange. There was a weakness in my legs and if I sat up, I would feel really strange, it was almost as if there was no enough blood/oxygen getting to my brain and when I mentioned it to this really concerned doctor she was like 'yeah, it'll do that to you' all the while looking at my notes appearing very worried. I remember her listening to my heart and saying 'I'm going to be okay right?' and she said 'to be honest, i really don't know, I need to talk to my superiors about this, your heart is beating very fast. You're stable at the moment, but if you deteriorate then... you know'. I was fucking petrified!!!</p><p>The nurses came back shortly afterwards and were measuring my blood sugar, oxygen levels, blood pressure, heart rate and breathing rate every hour. This was the result of a doctor saying 'we want him on hourly observations' I'm pretty sure I nearly killed myself, I'm such an idiot!!</p><p>I have been having really strange muscle spasms in random parts of my body, for instance twitching in the bottom of my foot, at first I thought it was just in my mind, but when I looked there was a weird twitching of a muscle, and I sometimes get it in my arms and legs - it's very strange!! Also, several experience reports I've read recently mentioned a severe fear of taking any kind of stimulant after really bad experiences, I am now 100% terrified of them. Last time I even went near them, my heart went into overdrive and I felt really weird after dabbing just a tiny amount of cocaine onto my gums, yet the people I was with were snorting big lines of it and were totally fine!</p>",
 "year": "2010",
 "id": "84470",
 "gender": "Male",
 "age": "24",
 "timestamp": "2010-03-22T07:00:00.000Z",
 "views": "13688",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(powder / crystals)"
  }
 ]
}
