{
 "id": 8453,
 "title": "The World is Magical Again",
 "date": {
  "submission": "2008-04-18T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "AliceNChainz",
  "gender": "Male",
  "weight": "205 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I am a 22 year old male, weighing 205 pounds.",
  "I have been prescribed Ritalin by a doctor for almost a year now, and I cannot say whether or not it is doing any good for my life. I have experience with marijuana, amphetamines, oxycodone, celexa, vicodin, vivarian root, and yerba mate prior to this. The usual dosage, one chewed 27mg concerta will give me an hours worth of euphoria, and three hours worth of being wired, four total.",
  "The usual protocol is to get 30 days worth from the pharmacist, then shoot through it in 10 days, in which I am superman; working harder, faster, remembering way more things, mastering conversations, etc. Besides these nice side effects, I am very surprised to find that it is nearly impossible to do the following while on ritalin:",
  "-Study",
  "-Clean",
  "-Organize",
  "UNLESS, a small part of me wants to. Ritalin is not will changing. If I don't want to study, ritalin won't force me to either, I have to want to. Once I force myself to do any of these previous activities, I enjoy them, and am overly intricate with the details involved, however, Ritalin makes me feel so good, that all I usually do is surf the net and listen to music, reading a wide variety of useless topics including boat building, guitar effects, comedy videos, etc. Initially I had hoped for Ritalin to help me study more, clean my apartment, and other crappy tasks, but what it really seems to do is make me avoid them more.",
  "Several bad physical traits to notice while on Ritalin include:",
  "- Dry mouth, no amount of drink is enough",
  "- Urination every half hour or less",
  "- tarter buildup on teeth (my guess is lack of saliva)",
  "- increased pulse (more on this later)",
  "- paranoia",
  "Good effects include:",
  "- Super sharp perception",
  "- no 'morning cobwebs'",
  "- ability to pay attention well IF you want to",
  "- increased love for those I know well",
  "- Music doesn't sound better, but it means more",
  "- diuretic, takes the bags under eyes away, drops water from the waist",
  "I like to lift weights several times a week, and ritalin complicates this, as I find myself at the campus gym checking my pulse, unable to take my workout to the intensity level that I desire. I am constantly worried about what might happen if my pulse raises too high. I can also expect Ritalin to keep me up for four hours after I take it. Thus, if I took one at eleven at night, I can not expect to go to bed before 3am.",
  "One thing I expected after my amphetamine use last year was a weight loss, however ritalin does not give me this. In fact, since I smoke cigarettes, Ritalin increases my oral fixation, constantly leaving me wanting for something to do with my mouth. Hence, I am always drinking, eating, or smoking while on Ritalin.  I also expected Ritalin to make me want to play guitar more, but I usually find myself putting the guitar down after a few minutes, rushing to do something else fun.",
  "I guess what ritalin does best for me is give me excitement again. It makes me look forward to things I can't remember being happy about last. Getting a lot done at work. Doing laundry, seeing family, fishing, boating with my dad, driving long distances. Ritalin ultimately makes me feel like a child again. Somewhere along the lines of growing up, with the gaining of knowledge in and out of school, the world has lost it's magic. I wouldn't call this depression, but rather a realization of the cruel, cold world we live in. I could go on in this direction forever, but needless to say, Ritalin brings back a sense of innocence without destroying the knowledge I possess that denies it. Ritalin makes me feel good, It makes me look forward to each day's adventures. Call it addiction, call it self medication, call it abuse, I call it a revival of my spirit. A gentle guiding hand that propels me in the direction I would like to go, with a restrained smile on my face, because I know where I'm going."
 ],
 "erowid": {
  "id": "50162",
  "citation": " AliceNChainz. \"The World is Magical Again: experience with Methylphenidate (ID 50162)\". Erowid.org. Apr 18, 2008. erowid.org/exp/50162",
  "substance": "Methylphenidate",
  "views": "25320"
 }
}
