{
 "title": "A Scary Experience",
 "author": "tony",
 "citation": " tony. \"A Scary Experience: experience with 5-MeO-DALT & Spice (ID 84580)\". Erowid.org. Mar 31, 2010. erowid.org/exp/84580",
 "substance": "5-MeO-DALT & Spice",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Products - Spice and Synthetic Cannabinoids",
  "",
  "",
  "25 mg",
  "smoked",
  "5-MeO-DALT",
  "(powder / crystals)"
 ],
 "report": "<p>The JWH-018 and JWH-073 I use regularly, and did not feel any effects from with this experience. The JWH's were overpowered, but used, so I listed them.</p><p>I have used 5-MeO-DALT before this, taking orally in doses of 25mg. With good experiences, this was my 1st and last time smoking this chemical. I have a good milligram scale, so measurements are accurate.</p><p>So I have heard that 5-MeO-DALT is best when smoked. With 25mg being (what I thought as) a small amount, and not too much when taken orally. I thought it would be a good amount to experiment with.</p><p>Packed a bowl of some 'spice' like incense, which contains both JWH-018 and JWH-073, put 25mg of 5-MeO-DALT on top and fired up. Did not taste to bad, effects were felt immediately after exhaling.</p><p>Let me remind you, this is one hit.</p><p>Less than 1 minute- Intense rush takes over my body, with immediate color and pattern changing visuals. Becomes overwhelming very fast.</p><p>2 min- Heart rate is through the roof, I feel like its going to explode. Add that to the visuals and I'm scared out of my mind. I stay in this overwhelming/way too high panic state for around 1 hour.</p><p>60 min- With the overwhelming part of the high gone, I'm in a kind of speedy euphoria, with some visual effects effects along with tracers present.</p><p>120min- Effects wearing off slowly, last in total around 3.5 to 4 hours.</p><p>Easy come down. No side effects noticed. But it was enough for me. It might be pleasurable when smoked in smaller quantities, but I'm not willing to try.</p><p>Note: I have used meth, coke, and was even addicted to crack (very bad shit) for a short while. NOTHING has ever made my heart pound like this did. Scared the hell out of me. I REALLY do not recommend trying this.</p>",
 "year": "2010",
 "id": "84580",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2010-03-31T07:00:00.000Z",
 "views": "16301",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": "25 mg",
   "substance": "smoked"
  }
 }
}
