{
 "id": 8459,
 "title": "Some Fun at School",
 "date": {
  "submission": "2007-05-23T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cedric",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 ",
   "substance": "DXM",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "When I did DXM I had no clue I was doing DXM.  My friend bought a strange pill off of someone at school and did it.  It had quite a strong effect on him.  He told me it was called Snurf.  We both never heard of it before.  After seeing him do it and watching him be effected by the pill for about 2-4 hours I decided I was going to buy one too. ",
  "The next day at school I bought one and swallowed it with water on an empty stomach right before 4th period.  About 30 mins after dosage I started feeling nausice(sp?)  After the period ended I went to the bathroom and I amazingly felt great.  I walked to my next class very pleased in how it was working.  I sat and talked to one of my friends and I was much more talkative, I didnt tell him what I was on.  A couple times I looked at the clock and noticed time flew by.  It was incredible.  When my last class was over I was pretty much at the peak.  It gave me an incredible body feeling, almost like I popped 3 vicodine, and it was making things seem soo slow.  I remember walking down to my car and thinking, my god this is taking forever. And in the next instant I was there. It made me feel like I was tripping BALLS......long story short I reasearched it after I did it and found out some lazy basterds are selling SNURF as a total different drug to make money.  They list the ingredients as fake things and it is actually pure DXM ...cough syrup stuff.  I was amazed when I found this out but actually ok with it."
 ],
 "erowid": {
  "id": "50177",
  "citation": " Cedric. \"Some Fun at School: experience with DXM (ID 50177)\". Erowid.org. May 23, 2007. erowid.org/exp/50177",
  "substance": "DXM",
  "views": "7267"
 }
}
