{
 "title": "It's Not Fun",
 "author": "Curmudgeon",
 "citation": " Curmudgeon. \"It's Not Fun: experience with Ephedrine, Cannabis, Caffeine & Opium (ID 8464)\". Erowid.org. Jun 28, 2005. erowid.org/exp/8464",
 "substance": "Ephedrine, Cannabis, Caffeine & Opium",
 "bodyweight": "135 lb",
 "header": [
  "DOSE: T+ 0:00",
  "125 mg",
  "oral",
  "Ephedrine",
  "(pill / tablet)",
  " T+ 1:00",
  "50 mg",
  "oral",
  "Ephedrine",
  "(pill / tablet)",
  " T+ 2:00",
  "50 mg",
  "oral",
  "Ephedrine",
  "(pill / tablet)"
 ],
 "report": "<p>Okay, so I have to say, I had prescription for pseudoephedrine a while back, and had experimented with large pseudoephedrine doses, and the later, I had had a bottle of generic robo, and by mistake, I had bought a bottle with pseudo. Anyway... My point is, Im pretty experienced with pseudoephedrine, and I had been thinking about taking some ephedrine, just to fuck around. You know how it goes... Anyway, while coming back from a camping trip, Im in some little seedy truck stop, buying coffee... Right when Im about to pay for my coffee, I set my hand down on a bottle, which just happens to be yellow jackets (OTC ephedrine). So, I grab it, and Im just like, okay... What the fuck, I might as well.</p><p>So, anyway... I get back in the car, and Im telling my friends how I got some ephedrine, and would they want some. Everyone (excluding the driver [who was himself coming down from a dxm trip]) pipes up with how they'd like to pop some. So... Not knowing the dosage, I look on the back of the bottle... Now, I know that they don't usually give the dosage for how many you should take to get 'high'... Anyway... The back says to take no more than 4 in a 24 hour period. So, I figure... There's the dose, and I hand out 4 to each of my friends. I am about to take my 4 when the driver says 'fuck it, just take 5'. So, like the jackass I am, I pop 5.</p><p>We took them at approx 2:00 pm, and by 3, I had decided to go for the gusto, and pop 2 more.</p><p>By about 3:30, the other people in the car keep rattling on about how high they are, and I don't feel anything. In the morning, we had smoked a few bowls loaded up with opium, and I really wasn't feeling much... I was kinda upset at the drug not working, and after waiting maybe an additional 30 min, I decide to pop 2 more.</p><p>By 4, everyone is freaking out about how energetic they feel, and I still don't feel much, besides kinda feeling like flexing my hand. As soon as we pull into town, I get kinda odd visuals (things sorta took a second to...look right? Like, when I would turn my head from side to side, things would take a second to 'catch up' I guess. Basically, I felt like T+45 on dxm).</p><p>When we pull into my friends' driveway, the girl next to me vomits into a bag, and I try hard not to vomit as well. We spent the next 2 hours lying around, trying not to throw up. I felt a lot better, and then just felt terrible vomit coming up, and hurled into the bushes. I felt a lot better, so I called up my girlfriend, and she picked me up.</p><p>Now, it's like 30 minutes later, we had only been in the car for about 5 minutes when I tell her what I took earlier, and then tell her that I don't think I can take the car ride. She pulls to the side of the road, and I spew up some stomach acid the color of my breakfast. She's really upset by this, and I tell her to just drive the last mile to her house quick.</p><p>To make this long story short, I threw up pretty much once every 2 hours until 11, when I threw up once an hour. The rest of the night was spent sweating, and trying not to vomit, as I lie next to my sleeping girlfriend.</p><p>To be complete, I will describe the feeling of the 'high' basically, it was like watching the person next to you get hit by a comet. Afterwards, you are so shocked to be alive, your heart races, and you are really alert, you basically don't feel anything, and that's the high, I guess... No fatigue, or tiredness. Basically, you are always aware of the nausea that grows in your stomach... It never goes away, only getting worse, until you vomit. After vomiting, you have probably 15 minutes free of nausea.</p><p>Special note for the slow: don't take this. It's not fun.</p>",
 "year": "2001",
 "id": "8464",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-28T07:00:00.000Z",
 "views": "12385",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "Ephedrine",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Ephedrine",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 2:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Ephedrine",
   "form": "(pill / tablet)"
  }
 }
}
