{
 "id": 8466,
 "title": "Wisdom in the Cave",
 "date": {
  "submission": "2006-03-08T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Jtraveller",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD"
  }
 ],
 "report": [
  "I live down in South Africa, a place of insane beauty, culture and energy. Me and two of my closest friends arranged to travel the rugged coastline with nothing but a tent and the thirst for adventure.  I was blessed to find the most incredible LSD in the 200-300ug range and so the journey began.",
  "On our third night we found a beach surrounded by lime green cliffs, scattered with mystical caves and sand rarely marked with human feet. We decided to hike down the cliff on a rather treacherous trail and make camp for the night.",
  "At about 5pm, just as the sun lost its brutal intensity we took our dose. We explored the beach for a while and once we felt the surge of the acid take hold we returned to our cave to lie down and listen to Jim Morrison - An American Prayer. The music became all powerful and faces swirled in the cave above. Then sunset came. Standing knee deep in the icy and restless water we watched the orb of light sink slowly into the sea - around us we could see the earth breathing, everything had faces and spoke to us, not with words, but with beauty. I can truly say that this was the most powerful sunset of my life.",
  "Darkness descended and we went cave exploring. We found an Alice in wonderland like rabbit hole in one cave and of course dived in head first. Inside the cave it was pitch black - it felt like being in the stomach of a giant being. The walls were slick and every flick of our lighter revealed complicated stone structures the likes of which are indescribable. We stayed in the cave for about 30 minutes, laughing and feeding on the surrounding energy. When we left the cave a dense mist had rolled in off the sea and the surrounding visibility was about 5 feet. It was a cold night, yet every now and again an incredible warmth would surround us. I cant explain this, except that I knew there was a presence on the beach with us that night. The presence guided us and when it left, we would feel cold and alone.",
  "At about 9pm - we suddenly realized our situation. Trapped on a remote beach, nobody knows where we are, anything could happen - we felt very isolated and alone. It was a scary, but ultimately amazing feeling. We were experiencing the true nature of night, the same as any wild animal or as man a few hundred years ago. Our senses were acute and we could feel every vibration, see every movement and taste the life in the sea air. The night was filled with an amazing adventurous spirit. We all had profound insights about the misdirection of our lives and our imbalances and today we are all better people, striving to follow our dreams.",
  "We were so lost in the confusion of society and western thinking - this trip was like a sledgehammer of reason and truth - I am now starting to wake from my earthly slumber - how foolish it is to follow, when we are able to create."
 ],
 "erowid": {
  "id": "50205",
  "citation": " Jtraveller. \"Wisdom in the Cave: experience with LSD (ID 50205)\". Erowid.org. Mar 8, 2006. erowid.org/exp/50205",
  "substance": "LSD",
  "views": "4019"
 }
}
