{
 "title": "A Total Sensory Experience",
 "author": "Anonymous",
 "citation": " Anonymous. \"A Total Sensory Experience: experience with Absinthe (ID 847)\". Erowid.org. Jul 13, 2000. erowid.org/exp/847",
 "substance": "Absinthe",
 "bodyweight": "125 lb",
 "report": [
  "<p>After the initial excitement of finding real absinthe for sale in the United States (New Orleans), I was curious to see whether the effects of the drink were any different from other alcoholic beverages.",
  "I sat at the bar with a friend and watched the bartender pull out two small glasses labelled 'Absente'.  She put a stainless steel strainer spoon atop each glass, and then a large sugar cube.  Then cold water was poured slowly from a glass bottle over the sugar cube in order to dissolve it into the liquor.  As she did this, the drink changed from a chartreuse color (yellow-green) to a cloudy, sea green.  It was very pretty, a candy-like color.  I could faintly smell black licorice.  Watching this process was part of the anticipation of tasting the drink.  As it clouded and swirled in the glass, it looked a little like a magic potion.  This was silly, I thought, but rather fun.",
  "Finally, the distillation was complete, and I took my first sip.  It had a very light licorice flavor, much lighter than Sambuca or Anisette, and not unpleasant.  I actually hate the taste of black licorice, but this was tolerable as it was so mild.  After my first drink, which I had on an empty stomach (approximately the volume of 2.5 shot glasses worth of liquid), I did not feel any of the normal symptoms of an alcohol buzz.  What I did feel, and more strongly after the 2nd drink, was a whole body feeling of warmth, a trembling in my stomach area, tingling and then numbness in my fingers and toes, and an urge to grin uncontrollably.  This 'whole-body' sensation was reminiscent of my experiences with both hallucinogenic mushrooms and LSD.",
  "I did not have any trouble thinking or speaking clearly. I definitely had more of an urge to talk (and I am generally very quiet when buzzed or drunk), and was also inspired poetically (my thoughts started to flow in rhythm). Walking was slightly more difficult but I was not stumbling when I left the bar.  The effects were pleasant, fairly mild, and wore off after about an hour.  I did not 'trip' or have any hallucinatory experiences.  The strong feeling of warmth throughout my body was unusual for me after drinking.  This was a mellow high, and one that seemed to 'sneak up on me' without becoming overwhelming.  I am interested in experiencing the effects of more than two drinks.",
  "Unfortunately, I did not discover the brand name of this absinthe, but was told by the owner of the bar that it was imported from France, as were the sugar cubes used in distillation (apparently sugar cubes from this country do not dissolve well enough in the liquor).  Apparently this bar has only a limited supply.  They told me they were prohibited from selling individual bottles to customers when I requested one.  They did not make it clear whether their importation of the liquor was legal, though I got the distinct impression that they preferred that this remain a local secret.",
  "I enjoyed the visual anticipation of watching the drink being prepared, catching a faint whiff of its licorice-like smell, and its mild, semi-sweet taste.  Its physical effect was very nice.  This is not a drink I would like to 'get drunk' on, rather a good sipping drink, and a pleasant way to spend a sunny afternoon in the French Quarter.</p>"
 ],
 "year": "2000",
 "id": "847",
 "views": "128507",
 "dose": [
  {
   "time": "0",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2000-07-13T07:00:00.000Z"
}
