{
 "id": 8470,
 "title": "Grapefruit Juice: An Anzymatic Observation",
 "date": {
  "submission": "2007-09-14T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "nutopia",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.6 g",
   "administration": "oral",
   "substance": "GBL",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Morphine",
   "form": "(daily)"
  }
 ],
 "report": [
  "In an attempt to continue to cultivate and grow the body of knowledge on this greatly misunderstood and misused drug, I present a simple observation on the specification of the drug's effects brought on by the intestinal CYP 3A4-mediated metabolism of grapefruit juice. ",
  "I had ingested a half cup of GF juice about 25 minutes prior to dosing with 2.6 g of GBL dropped into another half cup of juice.  The onset of the effect was slightly delayed (30-35 min.) with a fast euphoric come-up (10min.) hitting firmly into a ceiling of dumbfoundedness.  The peak was the feeling of a heavy woolen blanket being placed over the head of one's intellectuality and ability to wield cohesive language.  My head was full of cotton and floating akwardly off its axis in a manner similar to that induced by ketamine.  I love ketamine, yet this state was frustrating, perhaps because i had entered a social situation intending to call on the socializing effects of the GBL and only recieving a mind so full of pitfalls and dark rooms that I would lose track of the structuring of my sentences and the use of appropriate voice intonation.  My voice grated on me as i'm sure it did to others present, it was flat and dead like a beached flounder.  I have, on occasion, gotten this strong feeling at the beginning of a GBL experience, but never for more than a few minutes, 15 at most.  This time it lasted for about 1 1/2 - 2 hours.  It ran short on euphoria but long on fucked-upped-ness, not a huge plus for me. ",
  "At this point in time, i had been using about 1.7g - 2.5g of GBL about 3-5 times a week for 2 weeks. I would usually use 1 (or 2) .5g - 1.5g booster doses as well, before carefully timing out the drug and administering my daily morphine.  And so it must be said that my body was evolving a response to the GBL and confounding the specifics of these observations, but the aspect of duration of effect was directly effected by the ingestion of grapefruit juice.  The peak plateau-d for over an hour as opposed to 10 - 15 minutes and instead of being followed by a mellow, glowing, talkative state where i can focus and concentrate with, perhaps, increased ability, I had trouble carrying conversation and thinking and, as a result, found myself board and frustrated.  The entire experience lasted about 4.5 hours without a booster (not desired), more than an hour longer than usual.",
  "GHB/GBL is not a 'more-is-better' drug; if the euphoric and socializing effects were to grow directly and proportionately with an increase in dose, then higher doses would make some sort of sense, but this veryreallytruly is not the case.  Only confusion, nausea, uselessness and sleep await the user of the higher doses.  This was too much of the drug for me, due to the lack of clearance, it hit me like a punch that throbbed for 4.5 hours.  All in all, a longer experience isn't what i want if i must spend the whole time in this valueless fog.  I will not repeat."
 ],
 "erowid": {
  "id": "50217",
  "citation": " nutopia. \"Grapefruit Juice: An Anzymatic Observation: experience with GBL (ID 50217)\". Erowid.org. Sep 14, 2007. erowid.org/exp/50217",
  "substance": "GBL",
  "views": "12475"
 }
}
