{
 "title": "Nature's Badass",
 "author": "Treehugger488",
 "citation": " Treehugger488. \"Nature's Badass: experience with Syrian Rue (ID 84708)\". Erowid.org. Jul 19, 2010. erowid.org/exp/84708",
 "substance": "Syrian Rue",
 "bodyweight": "155 lb",
 "header": [
  "DOSE:",
  "15 g",
  "oral",
  "Syrian Rue",
  "(seeds)"
 ],
 "report": "<p>The following is my report using Syrian Rue seeds. The duration lasted about six hours, after effects lasted until I fell asleep that night.</p><p>The seeds were used to die carpets in the 'Aladdin' era of time; the carpet makers would get the Syrian Rue absorbed into their skin, causing them to hallucinate and feel that they were 'flying' on the carpets (sound familiar?). My husband and I also have found Syrian Rue to be one of the Ahuayasca components, not as the main ingredient but as a small part of the whole that stimualtes the psychedelic components of the brew. It has also been commonly used in combination with DMT to activate the effects. I would like to take note that I myself had not researched this powerful ethnogen, but my husband had. And this was my downfall.</p><p>We had decided today to administer it by itself. After grinding up the seeds in a coffee grinder, we put fifteen grams each of the grinds into orange juice (NEVER EVER DO THIS). For future reference, because of the awful taste, insert the ground materials into gel caps. First of all, I would like to note that my husband and I have done much research in the field of ethnogens and spiritual plants. We were ignorant to assume that our tolerance to this new herb would be adequate for a VERY HIGH dose. There are reports of effects from 2-28g. We really should have started with 5g at the MAXIMUM.</p><p>I will now proceed to explain the events that happened afterward. These are not exaggerated in any way and I cannot stress enough how important it is to keep hydrated and in a safe, cool environment with people you trust!</p><p>I have taken various natural as well as manufactured ethnogens and psychedelics and never before have either my husband and I experienced anything like this. The effects could be described similar to the opiate family. Almost immediately after ingesting the drink I began vomiting. The effects kicked in almost simultaneously, the bathroom spinning before me and I was in a 'heat haze' (as if heat were rising from the ground, this was my vision at the moment). I heard buzzing in my head even though there was nothing there. I felt faint, dizzy and weak. It became hard to focus and move. I made my way back to the couch and watched the news, with the haze still continuing. Constant vomiting, impatience and anxiety. My husband described a 'rushing' feeling, similar to ecstacy. I did not feel any of these things. I was focused on the weights on my eyelids and the helpless feeling I got from not being able to eat or keep any water down. I felt like I was purging to the point of death.</p><p>At some point we decided we couldn't handle the TV anymore. I somehow managed to walk, rather stumble, to the bedroom where it was dark and cool. We put on music and decided to lay down to get our stomachs feeling up to par. Perhaps this was our downfall, or just an addition to our near death experience. I could not function at all. I couldn't bring myself to plug in my charger; this task was way too complicated and absorbed too much energy from me that I didn't even have. I felt weaker and weaker and could only curl up in a fetal position with visions running through my head. Worried about my dog, I believe my brain forced itself to check on her periodically. Amazingly she was perceptive of the situation and stayed in the hallway watching us, but didn't attempt to play. She knew we were out of sorts to say the least.</p><p>Outside was unbearable. The sun blinded my sight, making everything white. Taking my dog out became the hardest thing in the world. My balance was off similar to being drunk, but I was so weak I found myself holding on for dear life to the banister when I climbed or went down the porch steps. Luckily I didn't need to have any human contact besides my husband who was also almost glued to the bed. I recall having visions of touching death. I can't stress the fear that I constantly had of knowing how close I was to the verge of dying. 'The Fear' as Timothy Leary calls it, is no joke. Mortality, once it is put in front of you, makes one realize how unimportant every day matters are.</p><p>You can only experience life by brushing the hand of death.</p><p>It was as if there was a black veil, and my fingers were brushing Death's fingers, or the Grim Reaper. 'Don't Fear the Reaper' comes to mind. My husband and I did, 100%, overdose. But luckily, we have experienced similar things before, and brought ourselves out of it. I want to note that someone who is not trained in these subjects will very possibly cause harm to themselves.</p><p>Other visions, such as space and the universe, came into my head. I felt that we were all so ignorant to go about our lives in vain, thinking that our mundane problems in society actually matter. The universe, space, the planets, and the antimatter, are timeless and this is what the world should be focusing on. Research into the other realms that we haven't yet crossed. Discovering others like us on other planets. These were some justified thoughts I felt at the time were revelations. Visions of the stars and the black space we call the universe entranced me for awhile. We as humans are obsessed and are being fed lies, coverups and bullshit through the media; only if we can limit our partaking in the brainwashing which is TV can we uncover our true selves and the beautiful truth of life. We are not alone in this universe, and this experience confirmed it for me.</p><p>The buzzing, the heat haze, the weakness, the incapability of keeping my eyes open ... all experiences that are frightening, but useful. If one has seen the HBO show True Blood: I felt as if I had conjured up some demon or the feeling of possession came to mind. In the show, Maryann, a maenad (or a handmaiden of Dionysus), has a 'heat haze' vision when she becomes empowered. It's as if heat is rising from the ground and producing heat waves to impair your vision, making things wavy and hard to concentrate. Her psychic abilities were awesome but she definitely had an evil aura. So I felt was for this Syrian Rue. Perhaps my experience was biased, and I feel that more research needs to happen. Maybe not taking a dose that would nearly kill me would make my experience better. This plant has been used in SMALL doses (2-5g) for antidepressant usage.</p><p>Sprirituality and herbs have been used hand in hand throughout history. Why have people stopped concentrating on it now? If we can find a happy medium with the proper dosage and proper set and setting, maybe our pagan ways can be enhanced. Why are we scared to speak up about this? Shamanism traditions, including the Peyote Way of Church, actually encourage peyote usage for spiritual visions. Ayahusca is administered in Brazil, and now one can sign up for ritiuals with shamans there, leading the ceremonies safely. Visitors of these rituals report much self-reflection and epiphanies about themselves. Maybe these psychedelic ethneogens can improve our spritual life, and cause a wave of inspiration that this world needs now.</p>",
 "year": "2010",
 "id": "84708",
 "gender": "Female",
 "age": "21",
 "timestamp": "2010-07-19T07:00:00.000Z",
 "views": "4268",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "15 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(seeds)"
  }
 }
}
