{
 "id": 8471,
 "title": "Ancient Aztec Fooseball Men",
 "date": {
  "submission": "2007-08-21T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "El Presidente",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "As I stood on my tiptoes in my bathroom with my head sticking out of the window, tinfoil pipe in hand, I lit the bowl filled with the inky extract of Salvinorin A. I inhaled as hard as I could, keeping the flame on the sticky black foliage as I sucked up the smoke. My full lungs felt as if somebody had kicked them. As I exhaled, I looked around the room for a noticeable hallucination, thinking it would be as obvious a hallucination as LSD or mushrooms. Disappointed with the results of this new and 'powerful' psychedelic, I finished the remainder of the bowl.",
  "It was at about this time that I discovered a whole new meaning to the word 'psychedelic'. As I hit the foiley pipe, in the same fashion as before, I was immediately stopped by an invisible force. Before I could finish inhaling, I was physically dropped from the reality I've come to know and love. The frame-speed at which my mind works was slowed down to a complete halt.",
  "I felt as if I was looking at five individual shots of a film reel to a movie based on me. I could travel freely within these five shots, each a moment in time my mind had engraved. I moved into the middle frame and stared out of my window into blackness. There, I saw a chain of embodied forces holding hands like a paper doll, all staring at me. They all had the same face: no eyelids, large sadistic grins, and holes as noses like skeletons. As I turned to look at each one, he would flip upside-down like a foosmen. They formed an oval around me and as I looked closer to myself, I started to recognize faces, such as my mom, my dad, and my best friend Vince.",
  "As I stepped back into another frame, I watched myself from behind by staring at the back of my head. I could do so because my mind had the imprinted vision of me standing there. A metallic locking-in-place sound echoed throughout the room as I went down the line, looking at each one and making them flip. When I got to myself, I watched in utter terror as I spun upside-down like the rest. I had become an ancient foosball man.",
  "He started talking to me, telling me that I was one of them. Just then, all of the hand-holding people, including my family and my friend, were trying to coax me into 'accepting who I really am'. Out of nowhere the lead singer from The Squirrel Nut Zippers, dressed in his makeup from the video for the song 'Hell', appeared next to me. He was holding a 40's style microphone and was dressed in a zoot suit, standing in front of a curtain.",
  "'Are you ready to find out what you really are?!'",
  "I felt like I had been on some sick and twisted game show my entire life, and behind the curtain was the real world: the god awful truth that I was going to be stuck in this rift in time forever.",
  "I huddled in the corner, too scared to face the consequences of abusing this powerful divinatory device so grossly arrogantly. I put myself in the fetal position and tucked my head between my elbows. The evil game show host moved in front of me with the curtain. His legs served no visible purpose; as he hovered towards me, he dragged his feet along the ground, slowly tugging the curtain closer to me. His grin grew as he prepared to pull open the curtain. With one swift flick of his wrist, he presented to me a strikingly familiar room.",
  "I looked around my bathroom, slowly regaining my rational thought. I was home, or at least I thought I was. Immediately, I opened my cell phone and frantically went down the list of people saved in my phonebook, calling each one. Finally, Chris answered.",
  "'Hello?' Chris's voice was the most comforting thing in the world",
  "'Chris its James, is this real?' Chris seemed a little baffled.",
  "'Uh, what are you on?'",
  "'Salvia'",
  "'Oh, how was it?'",
  "'Just do me a favor and stay on the line for a little bit longer.'"
 ],
 "erowid": {
  "id": "50218",
  "citation": " El Presidente. \"Ancient Aztec Fooseball Men: experience with Salvia divinorum (32x extract) (ID 50218)\". Erowid.org. Aug 21, 2007. erowid.org/exp/50218",
  "substance": "Salvia divinorum (32x extract)",
  "views": "3050"
 }
}
