{
 "id": 8474,
 "title": "Basically Cannabis, Minus the Fun",
 "date": {
  "submission": "2007-09-29T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Flashback",
  "gender": "Male",
  "weight": "70 kg"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  "<p>I found this blend 'Spice' in a local headshop near me, and was told by many people it was almost exactly like cannabis, but legal. It came in a bag similar to cannabis in an 'eighth'.",
  "I smoked a bit from a pipe and took a reasonably large hit. The initial effect was very subtle, with a slight light-headedness and not much else. I waited for a while to see if anything else would happen. Very slowly, the light-headedness turned into a slight warmness concentrated near the head, quite pleasant, almost like cannabis, but more gentle. I didn't notice any changes in perception. It felt almost as subtle as drinking tea!",
  "I took another slightly larger hit a couple of minutes later and again, got the initial lightness followed by more warmness and more relaxed feeling generally after about 30-40mins, I noticed that my head felt heavy. I noticed colours becoming subtly more defined. I took a couple more hits and eventually there was a bit of change, just more and more heavyheadedness, and a general drunk/tipsy feeling. There were no visual effects apart from very slightly enchanced colour perception. There was no change in audio perception, which was a bit of a let down, as cannabis rules when it comes to music.",
  "Walking naturally caused more blood flow which increased the 'drunk' feeling while moving. It felt like walking on a bouncy castle. Enjoyment wasn't really enhanced overall, everything was just a bit dulled. I was watching something, but could only see the pictures changing. I couldn't really apply my mind to what was going on. After the experience, I don't remember what I was watching. Similar to cannabis.",
  "I decided to go the whole way after the frustration of not having much going on, just felt like being drunk and bored really. I rolled a neat joint and smoked what must have been 1/16 of the bag, a fair bit. The result - nothing! no change in effects at all, almost like a plateau. This was about as exciting as watching paint dry. My 'normal' excitement levels were taken down too.",
  "Overall I would describe this drug at low levels as tea and at high levels as being drunk, but without the 'high' feeling. Maybe I was expecting it to be like cannabis (as it is advertised) but not really impressed, seeing as it costs more than cannabis. This drug is legal for a reason. It's basically cannabis, minus the fun.</p>"
 ],
 "erowid": {
  "id": "50226",
  "citation": " Flashback. \"Basically Cannabis, Minus the Fun: experience with Spice Product (ID 50226)\". Erowid.org. Sep 29, 2007. erowid.org/exp/50226",
  "substance": "Spice Product",
  "views": "66720"
 }
}
