{
 "id": 8478,
 "title": "Pleasure of Nutmeg Oil",
 "date": {
  "submission": "2001-11-30T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Lophophora",
  "weight": "66 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 ml",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(extract)"
  }
 ],
 "report": [
  "Last summer I came across a 250 ml bottle of pretty strong nutmeg oil. There was to be a party down on the beach later that evening and I was very exited to try something new, and this is where the nutmeg came in. I had read a little about nutmeg on Erowid and Lycaeum and found that it could be drunk in warm milk. So, I warmed up 2 dl of milk and added 30 drops of nutmeg oil. Some people say that they don't like the smell and taste of nutmeg, but I like it pretty much and in milk it is rather good.",
  "The trip!",
  "17.00 I drank the spicy tasting tea and made ready to go out. I have read that nutmeg takes a while to come on so I was in no hurry.",
  "17.50 I went off with my brother. On the way to the beach I could feel some shivers in my spine, which were pretty nice. I could imagine what MDMA would feel like at this moment, while a warmth spread through my whole body. This part was really pleasurable.",
  "18.20 We came down to the beach and there were already some friends there, drinking and socialising. I felt the effects for another hour or so, very much like being stoned but different. I was from time to time very clear in my head and there was no paranoia like I used to get from THC.",
  "19.00 The effects seemed to increase a bit, but not much. At this time I started to drink beer and forgot about the trip for a while.",
  "20.00 I have no memory of the trip because of the amount of alcohol that I consumed. I think that the alcohol diminished the effects of the nutmeg.",
  "I found that nutmeg oil in a small dosage was quite nice and I am planning to do it again, this summer. Why summer? Because this feels like a summer drug, very fun to be out on a nice evening, just floating around with friends and having a good time. I have some plans for the first of May, so wish me good luck. I think that I should put the dosage up a little bit and not drink more than a few beers.",
  "Take care !",
  "Lophophora"
 ],
 "erowid": {
  "id": "5024",
  "citation": " Lophophora. \"Pleasure of Nutmeg Oil: experience with Nutmeg (ID 5024)\". Erowid.org. Nov 30, 2001. erowid.org/exp/5024",
  "substance": "Nutmeg",
  "views": "30407"
 }
}
