{
 "id": 848,
 "title": "The Ups and Downs",
 "date": {
  "submission": "2006-04-16T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Penguin420",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "6 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>It all started on Friday when I arranged for an acquantiance to pick me up 1 liter of cheap ass Vodka.  He was to drop it off in my mailbox on saturday night. Well, about 8 saturday night I'm watching T.V and I see someone's car pull up to the mailbox and drop my acquaintance out, vodka in hand, right as the my next door neighbors pulling out of the driveway.  I was like 'Shit!  He's gonna get the cops called on him'.  Well, he waits for them to leave, makes sure no one's watching, slides in the vodka and runs to his house.",
  "I made up some story to get out of the house to pick up the vodka, I was lucky I was able to smuggle it in with my pants, the bottle was pretty big.",
  "I snuck up to my room to take a look at it.  I hadn't planned on drinking any that night, mainly because I didn't know how much a liter was.  However, as I looked at how much I had, I figured what the fuck, I'll have enough left over for the party next week if I have a little now.",
  "Now it had been about 2 years since the last time I had got drunk, about 5 since I last had vodka, so I wasn't really sure of the dosage I wanted.  I decided to steal a little shot glass that no one used anymore.  I figured about 4 of those should be enough.  So I took my 4 shots and about 30 minutes later I'm feeling pretty good, I'm warm all over like when I smoke cannibis, everything seems like its almost a dream.  Things are getting all wavy and fuzzy when I move past them or they move past me, and it makes me laugh almost uncontrolably.  At this time I was getting some slurred speech and it was getting increasingly difficult to walk or stand up.  I did something a little stupid and decided to have 2 more shots.",
  "About 40 minutes after I took those shots I decided to go outside and smoke a cigarette.  When I came in I was a little bit too drunk, I was still feeling pretty good, but my complete loss of balance and the way I swayed back and forth when I stood up was really making me feel uncomfortable.  Quite unexpectedley I felt the urge to vomit, I would have probably made it to my bathroom, but I was too slow, my mind could see beforehand that I had to puke, but my body was too slow to make the connection and run to the bathroom.  This lead to me vomiting right on my carpet.  The alcohol helped the vomiting actually.  Normally there's nothing I fear more than vomiting, but with the alcohol it felt just as normal as coughing or sneezing.  I didn't mind one bit.  I actually think the cigarette induced the vomiting, I think I got too much smoke in my stomach, and this lead to it, but of course, the alcohol didn't help",
  ".",
  "Luckly there wasn't a lot of vomit.  My parents were up and I didn't want them to see. So I figured I'd go to sleep now, and clean it up early in the morning.Well, I went to bed, woke up about 6 the next morning, cleaned everything up, went back to sleep and woke up feeling clean and refreshed.  The only downside of this experience was the vomiting and the discomfort that came after .  O yea, and the cleaning up my own puke deal, I didn't like that much either.",
  "Although I did have an overall good experience, thing could have been worse.</p>"
 ],
 "erowid": {
  "id": "12339",
  "citation": " Penguin420. \"The Ups and Downs: experience with Alcohol - Hard (ID 12339)\". Erowid.org. Apr 16, 2006. erowid.org/exp/12339",
  "substance": "Alcohol - Hard",
  "views": "9283"
 }
}
