{
 "id": 8482,
 "title": "Legal Psychedelic",
 "date": {
  "submission": "2006-12-01T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Gingerfish",
  "gender": "Male",
  "weight": 83
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Piperazines",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "Hi I am 15 years old and living in new zealand I have always wanted to try drugs like lsd and mdma but could never get them.  The only drugs I had tried before bzp was weed /dxm/alcohol/and ritilan/. When I learnt about bzp and tmpff (what are called party pills in new zealand and are legal but has a age restriction of 18 ) I told my friend Andrew he was just as keen as me to try them so after school we went down to a store that sells them and we looked at all the brands I saw ones labeld lsd effects so me and my friend payed 20 dollers each to get a 2 pack of what were called shrooms. We went our seperate ways and decided we would have them the next night (please note that when I took these I didnt know anything about party pills and did not relise that not eating before hand increasd the efects and drinking juice increased them also).",
  "I knew I had promised to take them with my friend but I couldnt wait I went into my room. It was just like any other teenagers room and there was nothing in there to freak me out. not that I was checking when I took the pill at 7:30 pm. My computer was on and playing music my tv was on and my lamp was on my main light was turned of. At this moment my mum was at the supermarket and my older brother was asleep. 8 pm = I start to feel a strange feeling in my head like the feeling u get if u wear a hat for ages and u take it of and it still feels like u are wearing it and it is really itcy apart from that I feel no diferent.",
  "8:50 pm min = I start to feel it I start to feel slight waves of warmth in my bodies and a shiver up my spine. then I start getting moody the tv the computer the light its all to much I start talking to myself. no no no go away I repeat. Then I get of my bed wich I have being lying on the whole time and turn of the tv the computer and the light and go sit in the corner and wrap a cold towl around me that was lying on the floor. I sit their for probely only 5 minutes but it seems like hours. I stare at my cell phone and the minutes seen to tick by so fucking slowly.",
  "I stare at my marilyn manson poster it the picture of him from holywood with the red flames above his eyes. That picture has allways interested me becuase when I stare at it, it seems to change shape. so of course I really trip out on it and see his face move and he seemed to be smilimg to me as if he knows Im high. I get really paranoid that someone is going to come in and see me in the corner and know Im high. So I stand up and go over to my baed what I lie on for about 1 hour.",
  "9:30 pm I now feel the full physical effects of the pill before the just felt mental feelings of discomfort. I feel a great sense of well being. I feel good and I keep geting tingles in parts of my body mainly my fore arms and legs. I decide to walk down to the shop about a 5 minute walk away. It is still light as it is daylight savings.",
  "9:40 pm I start my walk to the shop I am wearing a t shirt and black jeans it is overcast and proberly freezing I live on a busy street though not many people are out. As I walk I feel better and better I am a overweight person but I feel so light and healthy and just so happy I still have the same physical feeling as before but I did not think about these. I can only think about how good life is and how cool I am. I feel real awsome and feel prety cocky and very confident. I feel that I could go and talk to any person and make friends with them.",
  "As I walk along I stare at the bushes around me and realise how wonderfull nature is I walk to the petrol station to buy a phone card. When I walk into the empty store the clerk seems to be eating something and rubbing his hands side to side and spining in circles. I trip on this for a while. After unsucesfuly getin a card becuase I was to fucked up to talk properly I leave the petrol.",
  "10:20 pm it takes me ages to get to the shop I dont really remember the rest of the trip to the store or back but I do remember just before I enter my house and I look at the road. And see two scooters driving side by side and they turn in opisite ways to each other and beep I dont know if this was reall or not but it was really tripy.",
  "10.40 pm the same feelings are running throught me and feel so good. Everytime I touch my self I feel good. I like rubbing my cold stomach it just feels so nice. my mum returns home and I go out to greet her and I try to act normal but its so hard. I cant even walk straight its like my legs just dont give a fuck she brings home a cooked chicken and I take a bun full of it with so that it would not be suspects becuase I am always eating. When Im in my room I put the bun in my cuboard I cant eat I have lost my apitite completly. I try to take a bite of the chicken but it is all dry and I almost choke on it.",
  "11:30 pm my mum goes to work finally and I can relax. I sit there in the darkness on my bed for ages. The effects are still at there peak. I sit at my desk and start scribiling with a pen on paper. I notice the ink seems to thread into the paper like cotten. I trip out on this for a few minutes.",
  "1 am. the phycidelic effects were off but I still feel the great tingles I feel like a better person and am so happy then at 2 am I feel a really strong craving for another pill. I soon get over this and fall asleep. I wake up in the morning perfectly fine."
 ],
 "erowid": {
  "id": "50255",
  "citation": " Gingerfish. \"Legal Psychedelic: experience with Piperazines (BZP & TFMPP) (ID 50255)\". Erowid.org. Dec 1, 2006. erowid.org/exp/50255",
  "substance": "Piperazines (BZP & TFMPP)",
  "views": "12103"
 }
}
