{
 "title": "Attempting to Achieve Maximum Effect",
 "author": "Agkdov",
 "citation": " Agkdov. \"Attempting to Achieve Maximum Effect: experience with Kratom (Thai Premium, powdered) (ID 84820)\". Erowid.org. Jul 14, 2010. erowid.org/exp/84820",
 "substance": "Kratom (Thai Premium, powdered)",
 "bodyweight": "65 kg",
 "report": "<p>Setting:</p><p>I have had a few experiences with kratom in the past, never exceeding 5-6g of similar material (powdered kratom Thai Premium - according to the retailer) before. I have boiled it in water, made alcohol extractions and attempted boiling it down to resinous extract to be consumed orally. The best experiences I had were using the alcohol extractions, which got me very euphoric for about one hour before rapidly becoming sedated in a similar way to the effects of a mild cannabis dose.</p><p>A friend of mine told me that he had achieved longer and stronger trips with kratom by ingesting the plant material directly (in gelcaps) so I decided to attempt this. Having no gelcaps I decided to let the powdered kratom sit in warm water, then mix it and down the liquid along with the powder to achieve maximum effect. I also decided to aim for a stronger dose, choosing to do at least 12g (amount chosen considering other reports and my prior experience).</p><p>My last meal was ingested almost 3h before the start of this experiment. I had not been consuming any perception altering substances for over a week and had been sleeping well. I consumed the dose alone, in a calm environment, to be able to assess the effects without too many external disturbances.</p><p>22h30</p><p>I boiled approx. 1L of water and let it cool slightly before mixing 6g of Kratom powder to 0,4L in a cup. After stirring a little to get the powder well mixed in I let it sit and cool for about 15 minutes.</p><p>23h00</p><p>I begin ingesting the 'tea' I just prepared, which has the usual grass-like taste of Kratom. It's not unpleasant at all at this level of dilution. I stir the drink now and then to make sure the powder is more or less evenly distributed throughout the cup.</p><p>23h20</p><p>Apparently the occasional stirring wasn't sufficient and I'm having serious trouble downing the last 0.15L because of the texture of the powder. I fill up the cup with some of the remaining warm water and mix thoroughly. This helps a lot and I finish my cup without any further discomfort.</p><p>23h30</p><p>I start to feel a tingling sensation and slight sedation. I'm pretty euphoric and motivated to do the most random things as long as they will amuse me though. Giddy would probably be the best word to describe my mental state here.</p><p>23h34</p><p>The high is somewhere between the randomness of thought and sedation of a few joints and the euphoria of a large alcohol dose. I decide to prepare the second dose (same as my first preparation, only this time I use 8g and plan on diluting again once I'm halfway through the cup). I'm feeling really energetic by now.</p><p>23h50</p><p>I'm about one quarter of the way through my second cup. By now I'm really euphoric, this is probably the peak of the high. This high mainly consists of bodily sensations, I get not CEVs, no form of hallucinations whatsoever, just general well-being and euphoria.</p><p>00h10</p><p>I'm way slower at drinking the mixture this time because of a mild body load that brings on slight nausea. It's nothing too important and I can easily ignore it. The 'real' sedation is starting to kick in. I feel like a couch, a warm couch, if that makes any sense. To counter the slight nausea I decide to mix in a teaspoon of honey with the drink so as to mask the taste and texture of the kratom powder. This works pretty well and I can speed up my ingestion of the mixture again. I really enjoy watching ripples in water right now.</p><p>00h20</p><p>The nausea is getting much stronger, probably because I sped up my drinking of the mixture. I decide to set the cup aside (there's about 1/2 left) and chill for a while.</p><p>When I close my eyes my perception of my own body changes according to the music I'm listening to. Fast parts make me feel tall and thin, calm acoustic parts make me feel soft (or dampened in some way).</p><p>00h50</p><p>The nausea has subsided back to a manageable level (similar to the moment where I decided to mix in the honey with the drink). I'm randomly surfing on the internet and everything is far more enjoyable than normally. I feel deeply pleased by the most common tasks. The euphoria is still pretty strong but I'm much more sedated by now. I'm quite uncoordinated right now so I have to slow all my movements down.</p><p>02h00</p><p>The effects are wearing off slightly now, so I decide to finish what is left of my second cup, which goes down without to many problems. I feel similar to when I am really stoned, but less forgetful. Still I keep starting to do stuff and then forgetting what I'm doing half way through.</p><p>Also I seem to associated emotions with movements in quite an unexpected way. When I walk around I feel like I can induce various emotional states by changing my walking speed and pattern. I would not, however, classify this as a proper hallucination as it was more of an evasive state of ming.</p><p>03h00</p><p>I've been craving for food for quite a while now but I'm cautious because of the body load and the amount of liquid i ingested to get the kratom into my system. The effects are still the same as before, nothing has worn off, but the body load seems to have increased slightly. Maybe this is due to me getting tired and hungry? I decide to eat a kiwi and see how it goes from there. Food doesn't taste as awesome as I'd imagined it though...</p><p>I can't read what I jotted down as notes for this moment, but I remember thinking the food went down pretty well considering the body load I was experiencing. I can't seem to focus my eyes on anything for a long time, they seem to move off in random directions and everything I focus on gets blurry after a while. I still feel really hungry but I'm not sure whether my system is ready for food yet so I don't want to bother cooking until I get feedback from my stomach.</p><p>03h20</p><p>Sure enough I got feedback from my stomach. I got a sudden rush of nausea and had to purge. I think this is due to the large amount of liquid that was sitting in my stomach. Next time I will probably try a slightly smaller dose (10 to 12g of the same stuff) either gelcapped or far less diluted to reduce the load on my stomach. It's a pity about the kratom that got wasted because of this but one has to learn from trial and error. I feel way better now, the body load is almost gone and I'm left with quite a pleasant sensation.</p><p>Note: throwing up powdered kratom is probably one of the most unpleasant experiences I've had when it comes to throwing up, so a change in the ingestion method to avoid this would be most welcome.</p><p>04h30</p><p>I'm still slightly buzzed but the main effects have clearly subsided by now. I don't feel sleepy at all yet, but the hunger is back and this time I'm able to eat without any adverse reaction.</p><p>Overall this was quite an interesting experience. I didn't realise that Kratom could get one that high until now, and I would definetly consider it a worthy alternative to alcohol and a few joints when partying. Note that I am not claiming the effects of kratom are identical, merely that I would consider Kratom as an option in the circumstances where I could choose to get drunk and smoke a little weed.</p><p>I noticed that throughout the trip I would get really itchy in random parts of my body, however I'm not sure if this is just due to some effect of the kratom, some reaction to the plant material or something else entirely. I would need to compare future trips and do a little research on that.</p><p>I slept pretty well that night, and woke up with a very slight hangover, a dry throat and still feeling slightly sedated, but this wore off over the course of 2-3hours after waking. Thinking back about the trip I feel like I have some slight memory loss, nothing comparable to an alcohol-induced blackout, but it still feels like some parts are missing.</p>",
 "year": "2010",
 "id": "84820",
 "gender": "Male",
 "age": "22",
 "timestamp": "2010-07-14T07:00:00.000Z",
 "views": "25738",
 "dose": [
  {
   "time": "0",
   "amount": "6 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:34",
   "amount": "4 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  },
  {
   "time": " T+ 3:00",
   "amount": "4 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  }
 ]
}
