{
 "title": "A Perfectly Blissful, Yet Distorted Reality",
 "author": "Chuckz",
 "citation": " Chuckz. \"A Perfectly Blissful, Yet Distorted Reality: experience with Sleep Deprivation, Amphetamines (Adderall), Methylphenidate (Ritalin), Modafinil (Provigil), Alprazolam (Xanax), Cannabis & Prom (ID 84837)\". Erowid.org. Apr 19, 2010. erowid.org/exp/84837",
 "substance": "Sleep Deprivation, Amphetamines (Adderall), Methylphenidate (Ritalin), Modafinil (Provigil), Alprazolam (Xanax), Cannabis & Prom",
 "bodyweight": "160 lb",
 "report": "<p>I'm a 24 year old graphics and web designer. My workload is especially high for the next week, and energy levels are, well...fading, at best. I find it very difficult to stay awake, which is a huge problem with the projects I have to get done right now. I was diagnosed ADHD some time ago and prescribed Ritalin (methylphenidate), which sometimes helps, but hasn't been able to keep me going the past few days. A friend with ADHD takes Adderall, so I decide to grab some of those as well, because I've got a LOT of work ahead of me. I find out another of my constituents takes Provigil (modafinil) for narcolepsy and reports that it is a strong stimulant/wakefulness-promoting agent, so I decide to give all three a run, simultaneously. Since I have pretty high anxiety, I keep a few 1mg Xanax and some marijuana within arm's reach. At the start of this report, I've been sleep deprived for approximately 36 hours.</p><p>T 0:00 - Ingested 2 x 10mg Adderall, 2 x 10mg Ritalin, 2 x 200mg Provigil. Feeling massive cobwebs in my head right now, barely able to type above 10 WPM...fading...</p><p>T 0:15 - Adderall effects are coming in pretty well, and the Ritalin is becoming apparent as well. Feeling still very tired and wishing these pills kick harder.</p><p>T 0:35 - Adderall and Ritalin effects are full swing. I'm feeling a bit less impaired, and my typing speed and accuracy has improved a good bit. I'm wondering about the Provigil now, as my narcoleptic friend only takes 200mg and says that's sufficient to keep her awake all day. I guess I'll just wait for it...</p><p>T 0:45 - Ok, so Provigil is coming in strong. The effects seem to have started a few minutes ago, but have just become noticable. My mind is almost fully clear, and I'm not nodding off anymore. Good news. Time to start working.</p><p>T 1:15 - The Provigil seems to be more or less in full swing. Cobwebs have subsided, and I'm pretty awake. Usually, I spend 1 to 6 hours on a logo. I just finished my second one of the day, and we're only 30 minutes in to working. Good progress.</p><p>T 1:25 - I believe that I have lost the effects of the Adderall and Ritalin, and decide to take another 2 x 10mg Ritalin, 1 x 10mg Adderall and crush up a 30mg extended release Adderall, split it in to two lines and snort one. I'll save the other until I feel like I'm fading again...</p><p>T 1:50 - I'm FLYING through work. I have been playing with an abstract web design for weeks, unable to finish it. Might as well give it a spin, right?</p><p>T 2:20 - I decide to go back and change one of the logos I finished earlier. I'm not impressed by it anymore. I start feeling very bored, so I turn on some music. No progress thus far on the web design.</p><p>T 2:25 - So I have skipped 16 tracks in the past 5 minutes. No wonder there has been no progress. I decide I need heavier music, and opt for some bass-heavy electronic tunes. I realize as I'm typing this that my hands are a bit jittery. As soon as I take notice of that, I get a bit of a hot chill. I open a window or two for ventilation, turn on my fan and get back to work.</p><p>T 2:35 - I am realizing that I'm very warm and I look over to one of the windows I thought I had opened. It's closed. I go over to it and open it (again?). I walk toward another window, and catch a hell of a wave of euphoria. Feels great. I continue my trip to the window, open it, then head back to my desk. I'm sweating a little, but nothing major.</p><p>T 3:15 - I just came out of what seems to be a period of blankness. I am not really sure what happened in the past 20 minutes or so. That creates a little anxiety for me, so I'm taking half of a 1mg Xanax and pack a bowl. Before I light the bowl, I need to go get some water.</p><p>T 3:25 - I got stuck in my kitchen playing with a magnetic word set for a few, but I'm back in action. I'm firing up my bowl now. I can just barely feel the smoke going in my lungs, which is a little surprising, considering the quality.</p><p>T 3:35 - Wow. I have literally never felt anything like this before. My entire body is tingling like the first time I smoked pot. My mind is racing and euphoria is very heavy. I am getting mild visual hallucinations in the form of ripples on pretty much anything I stare at for more than a couple seconds. Having trouble typing again, but this time because my hands are moving waaaay too fast. I'm typing roughly 3 extra letters for every correct letter in this paragraph-like collection of sentences. Seems sort of like a fairly high dose of mushrooms, except I'm moving much faster, and time doesn't seem distorted.</p><p>T 3:45 - Interesting. The euphoria has calmed down some, and my hands have gotten a little more controlled. Hallucinations are coming and going...</p><p>T 4:05 - I feel awake, but cobwebs are back. I think. I'm not sure, really. Anyway, I'll snort the other line of Adderall now.</p><p>T 4:15 - Feels like I'm on MDMA. Warm. I feel a rush of dopamine releases in my head. Always fun. Euphoria, welcome back. I believe I'll have another bowl pack. I'm sweating again...which I realized, only because the cold air from my AC vent cooled a stream of sweat that ran from my armpit to my waist, which I touched with my foot (somehow...).</p><p>(unknown time) - Apparently I made a trip to 7-11. I have no idea how I got there or what I went for, but I ended up buying a beer. I walk outside and my car is nowhere in sight. I guess I walked...</p><p>T 4:55 - I just walked in the door at home (which was left wide open). I sit down at my desk and realize I left the door standing open. After a minute or two, I go close it. Back to work. Beer-drinking commences.</p><p>T 5:10 - I have finished my beer (apparently, based on the empty tall can in front of me and lack of wet clothing or floors around me). I also lost my hat.</p><p>T 5:11 - Found my hat. On my head...</p><p>T 5:30 - I'm rifling through Popular Science magazine. I didn't know I had Popular Science magazine...</p><p>T 6:10 - Apparently I have been working for the past 30-some-odd minutes. There is an abstract image open in Photoshop that I don't remember making, but really, really like. Popular Science is on the floor. Spread on my desk in front of me are my sketch book and sketch-related materials, my laptop (on top of my desktop's keyboard for some reason), a bag of chips, a half-eaten Snickers bar and several Mike and Ike's. Interestingly enough, none of the edible items were in my house before the 7-11 trip...nor were they in the bag with the beer.</p><p>T 6:30 - I'm in a very strange place right now. A little lost. I don't feel like I'm at home anymore, and I'm not recognizing any of the pictures on the walls. I grab my phone and call my girlfriend. I told her what all I've taken and ask her to come over, and she agrees. Should be here soon.</p><p>T 6:55 - Somehow, I seem to have forgotten the passcode to my phone and I can't access it. I start thinking about why my girlfriend's taking so long and get a little anxiety. Time for the other half of that 1mg Xanax from earlier.</p><p>T 7:05 - Girlfriend just arrived. She brings to my attention that I haven't eaten much today, so I force myself to eat a P B & J she made me.</p><p>T 7:15 - Nausea, big time. Luckily, I have some Phenergan (promethazine). I take 2 x 25mg pills and drink a tall glass of water.</p><p>T 7:25 - Phew...nausea subsided. It's replaced with a strangely elevated mood. I guess I'm happy my girlfriend's here... Anyway, lots of work to do. Back to it.</p><p>T 8:05 - I find myself squinting and straining to focus as I type. My eyes are becoming very sensitive to light. I turn down the brightness on my monitor and turn off the lights surrounding me, which helps.</p><p>T 11:50 - Apparently I fell asleep for a few hours, and I feel *exhausted*. It feels like I weigh 300 pounds. This is bad. I'm nowhere near done with what I'd planned to do for the day, so I decide to take another 2 x 10mg Adderall, 2 x 10mg Ritalin and another 200mg Provigil. I have to come out of this funk.</p><p>T 12:20 - I feel so...blah. I can't think of a better word to describe exactly how I feel...</p><p>T 12:30 - Not really feeling anything from the Adderall or Ritalin. I decide to crush another 30mg extended release Adderall and snort half. Maybe 30 seconds later, I realize I didn't split the pile. I just snorted the whole 30mg in one shot.</p><p>T 12:40 - I'm wired again, but I can't stop yawning. Somewhere past 48 hours without sleep now. Wonder how much longer I'll last...</p><p>T 13:05 - I keep spacing out, so I decide to watch TV for a bit.</p><p>T 13:20 - Realized the TV wasn't on. Took me another 45 seconds or so to make to 2-foot move to get the remote. I turn on World's Wildest High Speed Chases. Meanwhile, I'm writing out a list of things to do.</p><p>T 14:45 - I *think* I passed out again...but I kept writing that list, apparently. I wrote about half a page of very strange things. Among these was: '...stale birds need eat with mom's flower indeed...' -- you don't want to read these, but I thought that one was worth tossing in here.</p><p>T 14:55 - Seems like I have been sitting for days. I thought it was time to stand up. My legs disagreed. I fell in to my glass coffee table. My girlfriend flipped out and tried to make me lay down, but I refused. I have work to do.</p><p>T 15:05 - Back at my desk with a glass of water, I try to pick up where I left off...</p><p>T 19:35 - Waking up again...this sucks. I decide to smoke a bowl and call it a night.</p><p>T 31:40 - Just woke up, feeling fairly refreshed. I slept a lot more than I planned, and I'm *WAY* behind. Awesome.</p><p>All in all, not bad. I accomplished more than I would have if I'd not taken anything, so that's a plus. I'm sure it will be better when I'm not already sleep deprived for 36 hours...so, until next time...</p><p>TOTAL CONSUMPTION:</p><p>Ritalin (methylphenidate) - 6 x 10mg(oral)</p><p>Adderall (amphetamine) - 5 x 10mg(oral); 1.5 x 30mg(snorted)</p><p>Provigil (modafinil) - 4 x 200mg(oral)</p><p>Phenergan (promethazine) - 2 x 25mg(oral)</p><p>Xanax (alprazolam) - 1 x 1mg(oral)</p><p>Marijuana - 3 bowls</p>",
 "year": "2010",
 "id": "84837",
 "gender": "Male",
 "age": "24",
 "timestamp": "2010-04-19T07:00:00.000Z",
 "views": "16205",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:25",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:25",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:25",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 3:15",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 3:25",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 4:55",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": " T+ 6:55",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 7:15",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Promethazine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 11:50",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 11:50",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 11:50",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  }
 ]
}
