{
 "id": 8484,
 "title": "The Great Itch",
 "date": {
  "submission": "2007-06-22T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Andrew",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "After school I decide to take some Ultram so I called up my friend and bought about 15 50mg doses. At about 4 oclock I took 4 50mg pills(200mg) of Ultram. At first I didn't really feel any effects, until I sat on the couch. I had the strong desire to just be still. Eventually my entire body was itching intensely.",
  "At about 5 o'clock I came down to the computer room and started talking to my friends. I realized that was apologizing to people about things that happened months ago. I started to feel as if everyone was cool and that I had no enemies.",
  "At about 6 o'clock I had a very intense body high type feeling...I also felt a very intense euphoria...Everything just felt so good and so right.",
  "At about 10 o'clock, I had been coming down, so I decided just to sleep it out. I awoke the first time with my heart beating very fast. I had dreamt my mom found substances on my shelves and I was tackling her in slow motion. I finally got back to bed and remember yelling 'sam' in the dream and awaking screaming it at the same time. The scream was not a small whisper. It woke up my entire house and my dad knocked on my door. So then I went downstairs terrified and went to take a piss. I noticed that my piss wasnt naturally shooting out, it was falling out in masses, a very peculiar effect that Ultram had on my body.",
  "Overall, Ultram is not an addictive drug at all. Although I take Ultram 2 or 3 times a week I feel that I can go without it. I love the sense of euphoria when I'm on it. Although I like the feeling, I also have a good sense that I am not/could not abuse Ultram."
 ],
 "erowid": {
  "id": "50260",
  "citation": " Andrew. \"The Great Itch: experience with Tramadol (Ultram) (ID 50260)\". Erowid.org. Jun 22, 2007. erowid.org/exp/50260",
  "substance": "Tramadol (Ultram)",
  "views": "11149"
 }
}
