{
 "id": 8488,
 "title": "After Struggling with Psychosis",
 "date": {
  "submission": "2006-03-08T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Acidkills",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "10",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "For everybody out there dealing with an LSD 'psychosis'/hell/suicidal phase, please be aware that you are not alone.",
  "I have possible ways of fighting it. Ways of dealing with it that have completely made me continue with my life happilly and succesfully. I dropped acid September 20th, 2005, the day that my life took a complete twist and I had to possibly start dealing with schyzophrenia for life. I went to this park looking for a metaphysical, mystical and life changing experience and I never thought of the consequences that were lying ahead.",
  "It was my first time on it and the trip started out pretty well. Then the security from the park told me and my friend (which was babysitting) we had to leave. I lost my car keys and we couldnt leave the park. Then I walked back home and everything became incredibly evil. I saw demonlike shapes, and everything seemed black and infernal. I thought I had died and arrived in hell. I felt incredibly alone and hopeless. I cant put in words the horrible feeling and inmense agony I was going through and I hope nobody ever feels that because I cant think of anything worse.  When I got home, my parents asked me where was the car and I told them I had lost the keys and that I was on acid. They completely flipped out (they are very religious and had no idea I had ever tried any drug) and told me how terrible I was after being raised in such a great family (which is completely true). Hell became even bigger and to not make this story so long, I spent 3 days after that without being able to sleep and just thinking that I was eternally damned and that I had to kill myself. Thank God I never did it (after I put a gun to my head I chickened out).",
  "After a week my family had accepted the fact of what just happened and just wanted me to continue living my life drug free and with Jesus by my side. But something was terribly wrong. My thoughts were out of control and I was hearing strange things in my head. My ego was also destroyed and I thought I had become 'nothing'. I felt my personality was completely gone and that I had no way of regaining it. I told my mom that I needed help (which takes a lot of courage because it is hard to accept that you went crazy) and we went to a shrink. The shrink prescribed me Seroquel (which is an antypsychotic medication) and the first days were horrible. I thought I was going to finish up in a mental hospital tied down. The anxiety I felt was overwhelming and the fact that you think that at this point there is no way back. But how wrong I was. I started praying to Jesus and God and things started to get better until this day (5 months later) which I feel completely well.",
  "I just want to tell people going through this to seek professional help right away and to pray to God and Jesus a lot. That was my salvation.  And mainly, to not lose faith in myself or God. God is loving and omnipotent and is the only one who can really make a difference in me. Dont feel like a sinner or that you are eternally damned because that is not true and that is the way I felt. But believe me, with enough praying, avoidance of drugs and alcohol 100 percent, and with a good psychiatrist by my side, I have everything by my side to fight the condition I know many people live in. I just want to tell you again that there IS help out there and that nothing in this world lasts forever. Your hopelessness, fear, anxiety, and fear of being psychotic for the rest of your life, will disappear and the light of God will shine on you again. I truly believe God gives us very hard tests for us to evolve spiritually and that everything happens for a good reason. Also it is a way for us to find the real truth which is Him and not move along with our egocentric attitudes, drug usage and other terrible things human beings do.  Have faith in God, pray, seek for professional help and quit drugs. Thats all I have to say. Peace and love for everyone."
 ],
 "erowid": {
  "id": "50272",
  "citation": " Acidkills. \"After Struggling with Psychosis: experience with LSD (ID 50272)\". Erowid.org. Mar 8, 2006. erowid.org/exp/50272",
  "substance": "LSD",
  "views": "4774"
 }
}
