{
 "title": "Left with a Headache",
 "author": "Milbytoker",
 "citation": " Milbytoker. \"Left with a Headache: experience with Inhalants - Nitrites (ID 8489)\". Erowid.org. Jul 22, 2003. erowid.org/exp/8489",
 "substance": "Inhalants - Nitrites",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "",
   "1 hit",
   "inhaled",
   "Inhalants - Nitrites"
  ]
 ],
 "report": "<p>I am a 16 year old male. Recently, me & my best friend decided to go to a dance music event. While we were there we took some ecstasy pills, it was around 6:00pm in the warm summers evening, we were sitting in a quiet part of the sweaty, loud, dance tent. I was rolling a joint when a girl came up to us, offering us a lick of her ice cream, we gladly obliged, and noticed a small brown bottle in her hand. It was at this point that my friend asked her what it was, we had already consumed 2 pills and were feeling very outgoing and friendly. She told my friend to put the bottle next to his nose and sniff, it was a bottle of poppers. He took a sniff and the bottle was passed over to me, i did the same. It was at this point i observed my friends eyes widen, and a strange look on his face. It took me about 10 seconds to make this observation, the amount of time that the substance takes to effect.</p><p>I sit back slightly and my chest tightens, I concentrate on the ice-cream girl who is passing the bottle to someone else, i suddenly start to think about her. Who is she? Where is she from? Why have i taken this strange drug off this total stranger? I then look round to the more populated part of the tent, people are dancing, having a fantastic time, and it is obvious that everybody is under some kind of influence. I start to question things, what i am doing here? i'm only 16, on ecstasy, with this strange new feeling engulfing my body. What am i doing here? so many questions. I look round to my friend for help, and realise that he has gone, run away from under my nose. What could've happened to him? I asked the guy who we are sitting with rolling the joint which way he went, but he, as i, hadn't even noticed he had gone. It was at this point that the girl gave me a hug, asking if i loved her. I then sat back down and continued with the joint.</p><p>My friend returned. We were safe again, the substance took 10 seconds to take effect, and 30 seconds later the effects had gone. Next my face becomes red and burns up, my head swells for a few seconds, and i am left with a head ache. Poppers smells bad, like dentist gas, and the buzz isn't usually worth it, it makes me complain.</p>",
 "year": "2001",
 "id": "8489",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-07-22T07:00:00.000Z",
 "views": "15033",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": ""
  }
 ]
}
