{
 "title": "No More RoboCid",
 "author": "Robohead",
 "citation": " Robohead. \"No More RoboCid: experience with DXM & LSD (ID 85)\". Erowid.org. Jul 11, 2001. erowid.org/exp/85",
 "substance": "DXM & LSD",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   " T+ 2:00",
   "8 oz",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "report": "<p>I haven't read through all of these reports yet, so I don't know if anyone has had an experience quite like this.  Years back, when I was 18 years old,  myself and two of my friends decided to try Acid.  One friend had already done it before (Brian), but me and my other friend (Jason), had not.</p><p>So, one night we took the acid and then proceeded to go out for a night on the town.  After an hour or so, Brian started to trip, yet Jason and I had not felt a thing from it.  After about 2 hours we started to question Brian's claim to be tripping, as we were still not feeling a thing.  Brian started to get really loopy and started to freak out that we weren't feeling a thing.  For some reason, the acid did nothing for us.  We figured it must have something to do with it being our first time.  The first couple of times that I smoked pot, I also felt nothing (as many of my friends also experienced).  So, not to miss out on all the fun, Jason and I decided to  drink an 8oz bottle of Robotussin DM each (as we had done many times before). </p><p>We drank the cough syrup down in one long, agonizing gulp as per usual, threw our bottles out the window of the car and proceeded to go to my home because my parents were on vacation (and Brian was really not okay to be out in public anymore).  Shortly after arriving to my house, I started to feel very nauseated and hot, so I went up to my bedroom and lay down.  As I lay there, I became hotter and hotter, and felt that something was very, very wrong with me.  I actually had thoughts that I might die because I had done Robo a number of times before and I never got sick.  Feeling sicker and sicker, I then made my way into the bathroom and puked my guts out.  It was a very strange vomit, as there seemed to be very little, if any, fluid in the barf.  It was dry and chunky, and very gross.  I flushed the toilet, thoroughly brushed my teeth, and then as I looked in the mirror, realized that I was now feeling pretty good and rather high. </p><p>I decided to go downstairs and see how my friends were doing.  As I began walking down the stairs, I overheard my friend Jason repeating over and over, very frantically, 'No more RoboCid, No more RoboCid...'.  Brian asked where I had gone, and I began to tell him about my feeling sick, when  Jason interrupted 'Yeah, me too, and then you got really hot, ...and then you puked....'  Very surprised he knew all this, I just answered with a simple 'Yeah'.  Then Jason exclaimed, 'Me too! And, then you saw it, didn't you?'  I replied, 'Saw what?'  And then he hit us with it... 'The Demon!' Jason shouted. </p><p>I couldn't believe what he was telling me... he had lost his mind.  He then proceeded to explain that as he was puking a demon came from behind him and said 'Don't you ever fucking do this again'. The rest of the night was fun, but for an hour or so, I felt like I was on my way to a very painful, agonizing death.  Needless to say, after my experience, I didn't require a Demon to set me straight.  There was and will be 'No more RoboCid' for me.</p>",
 "year": "1999",
 "id": "85",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-07-11T07:00:00.000Z",
 "views": "16141",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
