{
 "id": 8500,
 "title": "Slipping In and Out of Realities",
 "date": {
  "submission": "2001-02-06T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Catfish Rivers",
  "gender": "Female",
  "weight": 125
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "31 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "There is a special synergy here in my one experience. The empathogen sides of both compounds were very pronounced, very MDMA like. I was longing to connect with my friends, but alas I was alone in my basement. Nevertheless, I had a few touching remembrances of some good times. Visuals kicked off within 45 minutes (both CEV and OEV), which was accompanied by a very speedy, euphoric rush feeling in my chest (which is part of what connected the experience to MDMA on the physical side for me).",
  "The character of the visual would continuosly change. There wasn't a qaulity I could pinpoint, as you can sorta distinguish LSD visuals from say DMT. On both compounds, I've been visually overwhelmed by several compounds, but never transported totally away (except for one time on DXM but that another story).",
  "Within two hours I was slipping in and out of realities. There was one cool moment where I saw hyroglyphs on my basement walls. Nothing would maintain its usual shape, continuosly morphing. And I'm not talking little eddies and swirls of psychedelia. Large objects like my drums would suddenly look exactly like a Harley Davidson. Or, at one point I could perceive a red grid, something similar to a fishing net, floating through the air, energy like, reminded me of Castenada's filiments of energy. I had the feeling that there was a sort of conscious enregy surrounding me at all times, something separate from me, but somehow interested in me.",
  "I never reached a full out delusional break with reality though as I was usually aware that I was not at sober mind. At points, I even felt I could focus the energy of my being to project into whatever scene I had sitting in my head. I must say that music had a very special meaning all night. It kept me grounded when I was off floating somewhere into nowhere. Shpongle was an amazing new band (for me) to listen to throughout this night. All in all, this was probably the most intense mindwarping I've underwent. Physically, there was not much body load that I would consider a problem. Slight nausea, the speedy feeling which may scare some people, and some facial tension (but the clonazepan always solves that problem for me). This is a definite try again, maybe with more equal dosages of each."
 ],
 "erowid": {
  "id": "5032",
  "citation": " Catfish Rivers. \"Slipping In and Out of Realities: experience with 2C-T-7, 2C-T-2, & Clonezepam (ID 5032)\". Erowid.org. Feb 6, 2001. erowid.org/exp/5032",
  "substance": "2C-T-7, 2C-T-2, & Clonezepam",
  "views": "12365"
 }
}
