{
 "title": "Intense Enhancement",
 "author": "TRIPplemoonGODus",
 "citation": " TRIPplemoonGODus. \"Intense Enhancement: experience with 5-MeO-DALT (ID 85000)\". Erowid.org. Sep 9, 2010. erowid.org/exp/85000",
 "substance": "5-MeO-DALT",
 "bodyweight": "122 lb",
 "header": [
  "DOSE:",
  "32 mg",
  "oral",
  "5-MeO-DALT",
  "(capsule)",
  "",
  " ",
  "smoked",
  "Tobacco - Cigarettes",
  ""
 ],
 "report": "<p>I have quite a history with psychedelics and compare this ones effects to 2C-I, mushrooms and LSD, both visually and in physical  feelings. I have played with this 5meo-dalt before with random amounts, but this is my first entry and now with a good mg scale a precise one.</p><p>I took the gel cap with 32mg in it on an empty stomach with water about 30 to 45 minutes ago and I can already strongly feel the effects. It is very pleasant, sounds are amplified, colors intensified, and my body feels good all over like how MDMA feels. I'm really amazed how strong the effects are at 32mgs! I found myself somewhat disappointed with effects around 15mgs to 20mgs, but 10mgs make a stellar difference! I'm tripping pretty hard now, I'm sitting on the sofa typing on the laptop looking out the window and every movement of the wind on leaves in the trees is intensified and the colors are so bright and vivid, this would be excellent in a rave or club atmosphere, I'm getting tracers from sunlight, rainbow outlines around everything and pink and green glowing from nowhere, my boyfriend put on a steely dan cd and it sounds really clear and crisp, this material enhances everything.</p><p>This should give you an idea on how distracted I've been, its been 45 more minutes since I typed the words '30 to 45 minutes ago' I'm really tripping now, repetitive patterns forming on walls and ceiling, pink and green radiating  from the windows the music flows perfectly, looking out the window is like watching a CG movie its so detailed and the colors are so intense! My body feels tingly and sensitive all over like how LSD and mushrooms feel, its very similar to 2ci though. 5-meo-DALT is a psychedelic tryptamine, and I can tell you its psychedelic and trippy for sure, I can even start to see patterns forming on my own skin, its so beautiful outside I'm going to go out there and have a cigarette, just came back in, that was probably the best cigarette I've had all year! Inhaling smoke and taking deep breaths is very enjoyable like it is when I'm on MDMA, the wind was cold and crisp but enjoyable even though I'm normally the kind of person who gets cold easily, I was out there without a coat and was not uncomfortable. The little voice in my head is saying 'this is good stuff' its been another 45 minutes and I'm losing focus so I will end by saying people should be careful when using this substance because its effects are very intense, but I think its a very fun and interesting material that is enjoyable in both a lazy daytime or busy nightlife situation. I'm going to go enjoy the rest of my trip, be safe everyone thanks for reading :)</p>",
 "year": "2010",
 "id": "85000",
 "gender": "Female",
 "age": "19",
 "timestamp": "2010-09-09T07:00:00.000Z",
 "views": "11145",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "32 mg",
   "administration": "oral",
   "substance": "5-MeO-DALT",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 }
}
