{
 "id": 8503,
 "title": "Focus, Anti-Stress",
 "date": {
  "submission": "2007-07-19T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "In Sight",
  "gender": "Male",
  "weight": "75 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Rhodiola rosea"
  }
 ],
 "report": [
  "I have taken 1000mg of rose root several times before, and it's great, so figured I'd take 2000mg. I got the typical safety-feeling and the coffee-like stimuli. It's a little different though. It doesn't tense you up like coffee may do. It makes you feel safe, totally comfortable, with great mood-lift and with an urge to have fun and just do something!",
  "(5feb. 2006)Day 1:",
  "20:00 PM: Had just popped 1000mg. Started to feel it in 15 minutes. I went down to my room and finally realized how messy it was, typical teen-ager room, so I cleaned it all up AND took out all my sweaters and tee's and put them back in perfect order. All the while I watched the movie 8Mile. After that(21:30) I wrote a song, which was really cool. I was finished by 2AM. Even though, I had difficulty sleeping.",
  "(6feb. 2006)Day 2:",
  "Took 2000mg at school. I managed to focuse much better, without feeling as tense as I sometimes do with coffee. School finished at 11:30 today. I went home and cleaned the kitchen! Not typical for me, but it's all good I guess. :P",
  "19:30 I dropped 2000mg more to have some extra energy during my soccer exercise. This worked very well! I manage to push myself further and FOR THE FIRST TIME I have managed to understand almost everything our irish coach who doesn't speak Norwegian very well, said. If I could be this focused every day I might get better grades, more chicks and stuff too!",
  "20:00 Feel a little tense, but nothing big. Disappairs after some running.",
  "Summary:",
  "This herb is great for energy, libido-increase* use as an anti-depressant and just plain confidence-, health- and mood-enchancer.",
  "*(I didn't mention that I masturbated 3times both days!)"
 ],
 "erowid": {
  "id": "50331",
  "citation": " In Sight. \"Focus, Anti-Stress: experience with Rhodiola rosea (ID 50331)\". Erowid.org. Jul 19, 2007. erowid.org/exp/50331",
  "substance": "Rhodiola rosea",
  "views": "13794"
 }
}
