{
 "id": 8505,
 "title": "Peacefully Forever Changed",
 "date": {
  "submission": "2008-01-27T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Nick",
  "gender": "Female",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "875 mg",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>I had been heavy drug abuser in the past, but I was putting it all behind me.  I decided after my first mushroom trip I was done prescription pills and marijuana.  From that point forward, I decided in order to get high I'd use a very low dose of mushrooms, for several reasons.  The most important reason is to save my lungs and to end my psychological addiction to getting fucked up in any means possible.",
  "So I was staying home one day and had absoluley nothing to do.  My father was a floor below me, snoozing away, unaware of the journey I was about to partake.  The plan was to stay inside my room up stairs all morning long, listen to some music, write down some life theories, philosophies and revelations, and if I was lucky, see some cool shit.",
  "I pulled out my dried little cubies out of there plastic box, drank some orange juice, and ate the shrooms.  I had not eaten anything all morning except for a part of a banana which had been an hour or two ago.  I was pretty nervous for some reason, even though I knew the dose was too small to induce any seriously irresponsible behavior that my dad would notice.  I tried to feel good so I popped on the Safety Dance and ran around my room singing to it.  No, this is not something I normally do.  It's weird for me to even admit that.",
  "T+ 15 minutes.",
  "I started to feel the same sensation I had the first shroom trip, like gravity had lightened up on me and given me a break.  My whole body felt like it had been pumped with a just little helium.  This felt pretty good, but the nervousness was still there although I was doing a good job at remaining relaxed and focused.  A strange feeling came upon me, but I liked it, just as much as I liked the taste of the shrooms.",
  "T+ 30 minutes",
  "I layed in my bed because I was getting pretty cold feeling, and I turned up the heat.  I definitley knew it was coming on, everything felt stranger and stranger. My body would feel sort of out of proportion, and the room around me felt slightly brighter. I sat down, listened to some music and started doodling on a paper.",
  "T+ 45 minutes",
  "This is the time I had been waiting for as it was the time my last trip fully kicked in.  It didn't feel half as strong, although I was getting some open eye visuals that looked more like closed eye visuals.  Little eyes of random color creeping over my vision, but not actually physically affecting the room around me.  I was sort of disappointed, but now completely relaxed.",
  "T+ 60 minutes",
  "I started thinking.  I thought real hard about the nature of the world and the way things were.  My last trip's theme for my brain seemed to be the wonder of my existance, this one was about being one with peace and nature.  The visuals to my surprise heightened, and the O.E.V.s of C.E.V.s now had more color and more of a fluid flow to them.  They'd only appear directly in front of what my eyes were concentrating on, and not just randomly everywhere, so I could just watch them transform.",
  "T+ 90 minutes",
  "At this point I was very deep in thought.  I was looking at some trippy images on my computer, although they were not moving around and going crazy like I had prepared for.  One of the pictures which had three girls in it in some psychedelic mass of patterns and colors, and all three at the time were my mom.  This weirded me out.  Listening to music was nice, but I was so deep in thought or so deep in concentrating on the bright shapes and elegant designs my brain was creating for my viewing pleasure, I didn't really enjoy The Beatles like I had hoped. I also didn't get that 'wide' sound of music people are always talking about.",
  "T+ 120 minutes-240 minutes",
  "I had written and drawn all over a little notebook now, there were a lot of mushrooms drawn and written were some crazy theories and some very obvious things that had just hit me in a genuine way they had never written before.  The way the stuff was written it had looked like a schizophrenic had to be responsible for it.  One passage taking up a whole page read 'The key is to getting is not to want, but to have.  You'll get everything - happiness, peace of mind, unity with man and nature, if you can just have everything you have now, and be content.'  Another was little poem that read 'And, we only have each other.  And, every man is your brother.  And.'  Not sure what the point of throwing the word 'And' in there, this was not a continuation of another writing.",
  "My OEV's became apparent.  The pattern on my sheets of small circles moved and wiggled individually sometimes, my arm kept getting suctioned in at random certain points as I staired at it in astonishment.  I always knew I'd like visuals, but this was pure eye candy, coated with the finest fruity flavor imaginable.  I loved chilling way away from reality.  Another thing I had wrote down, taking up a whole page, was 'My only quest in the 'reality' realm is to find THESE,' THESE being written on top of a nifty looking mushroom character 'And manipulate my own reality.'",
  "I came to some serious revelations about my life, and after I started coming down and everything slowly went back to normal, I felt calm, happy... 'zenful.'  I had realised I was a being that was full of conflict and hatred, no matter how much I endorsed being positive and peaceful in the past.  I wasn't living out beliefs very well, and this trip completely changed that.  I don't feel the same way I did after I came down off the trip, I'm my old self, no more light shining off my skin because of the amazingly good of vibes I was giving off, but I can now stay away from arguments and fighting and be more open with myself and others.  I've always been a social butterfly, but this actually has helped me renew certain relationships that had been falling apart, particularly with some family members.  Thank you, almighty mushrooms.",
  "But right after I had thought it had all ended, all my visuals were coming to a close, I felt very sick, to the point where I went to the garbage and started gagging.  It immediatley went away without throwing up.  I walked down stairs and stood in front of a mirror after a shower.  I looked at my head.  I just staired at it.  All of a sudden images, somewhat heavenly and bright started coming off my forehead and my strongest OEV occured: my nose stretched all the way to the side of my face while my neck grew skinny and my head sort of rose up.  My jaw had dropped and the psylocibin dispersed from my brain at that moment, rendering me completely sober.  What an unexpected twist to the end of my adventure.",
  "So shrooms, thank you, and I will be seeing you sometime soon.  Hopefully this weekend. I love you all.</p>"
 ],
 "erowid": {
  "id": "50350",
  "citation": " Nick. \"Peacefully Forever Changed: experience with Mushrooms (ID 50350)\". Erowid.org. Jan 27, 2008. erowid.org/exp/50350",
  "substance": "Mushrooms",
  "views": "3142"
 }
}
