{
 "title": "Philosophical Musings on Existentialism and Appliances",
 "author": "J Money",
 "citation": " J Money. \"Philosophical Musings on Existentialism and Appliances: experience with Mushrooms (ID 85078)\". Erowid.org. Oct 7, 2010. erowid.org/exp/85078",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "report": [
  "<p>I'm a pretty experienced drug user, having tried many substances in my life, especially hallucinogenics. However, up until this point I had never laid a hand on mushrooms. When I got a call from my dude Ryan saying he had shrooms, I immediately scrounged up $35 and went over to his place to buy an 8th. It was my good friends birthday, and I wanted to make the experience all the more special with mushrooms.",
  "I arrived at my fraternity house where the party was taking place, and ate the entire 8th. I had read many reports of nausea and general discomfort associated with taking mushrooms, but I never experienced any of these symptoms. They tasted sort of foul, but I just washed them down with a can of grape soda, which eliminated the bad taste pretty effectively.",
  "I stood around, socialized, and waited anxiously for the mushrooms to kick in. Nothing really happened for about an hour. At our house, we have a dance room with a colorful disco ball style light hanging from our ceiling, and the first thing I noticed was that the lights were trailing a little bit, and the colors seemed very prominent and beautiful, moreso than normal. I then proceeded to walk into the kitchen, and that was when I knew the mushrooms had hit me full force.",
  "Our refridgerator is an industrial sized one that is made of a shiny metal material, I want to say chrome but I'm not quite sure. Regardless of that, I stared at the fridge, fascinated by the way the light reflected off of it. It seemed to take on a whole new level of depth an intrigue. I guess I stared at this for a long time (I want to say about 15 minutes), and by this point people knew I was fucked up on something: who else other than the man tripping balls on hallucinogenics would stare at a refridgerator? People would open the fridge to grab their drinks and what not, but I would yell at them for 'interrupting the continuity of the fantastic appliance'. One of my friends asked me what I was tripping on (I have a reputation as the resident druggie), and that's when I realized the mushrooms had hit me full on.",
  "A lot of people came into the kitchen, because they were fascinated by the idea of someone who was tripping balls on what they perceive to be such an exotic substance. People started interrogating me about the shrooms, what they were like, and I got asked a lot of stupid quetsions like 'Can you see purple unicorns?'. This frustrated me, and the large mass of people suddenly fucked with my emotions. A wave of fear and discomfort overcame me, and I isolated myself from everyone else in the attic. As soon as I was away from everyone else, I suddenly felt much calmer and at ease.",
  "I layed down on a mattress, and stared at the wall. I immediately noticed all sorts of psychadellic patterns, similar to the stoner artwork you've probably seen all over the internet. Before I never really understood how someone could come up with those intricate, beautiful and detailed patterns, but after taking mushrooms I sure as hell understand! Anyways I stared at the ceiling for about a half hour. At this point my emotions took hold and I once again became very scared and uncomfortable, and decided I needed to talk to a close friend.",
  "At this point I went back downstairs into the kitchen, where a large group of people were standing around talking. I went up to them, interrupted the conversation, and started talking philosophy (I am a philosophy + mathematics student). I was mainly discussing the ideas in Ludwig Wittgenstein's 'Tractatus Logico-Philosophicus', and although I'm pretty sure nobody understood what I was talking about, it all made sense to me.",
  "One thing I noticed about mushrooms is that they make me become very introspective and philosophical. I came to so many deep, philosophical conclusions about life and the unierse on mushrooms! I basically had an existentialist epitome: mushrooms really helped me realize that life is essentially pointless, that there is no God, and that it's my duty to rebel against this pointlessness, to create my own purpose in life. Basically everything Albert Camus wrote in the Myth of Sisyphus, I realized while tripping on shrooms.",
  "The night went on, and I continued to have all sorts of fantastic visuals and amazing philosophical + mathematical epitomes. I think the one mistake I made with mushrooms was the fact I chose a social party setting to take them in. Mushrooms are an extremely introspective drug, and although I feel I should have a sitter at all times to watch me and make sure I don't do something stupid, it's definetly not something I want to do in a party or social environment. Next time Ill use them in a private setting with a few close friends. I can most definetly say I will definetly eat shrooms before I attempt to write any sort of philosophical masterpiece!</p>"
 ],
 "year": "2010",
 "id": "85078",
 "gender": "Male",
 "age": "19",
 "views": "2638",
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2010-10-07T07:00:00.000Z"
}
