{
 "title": "My Brief Career as a Crazy Person",
 "author": "nrs",
 "citation": " nrs. \"My Brief Career as a Crazy Person: experience with Smoking Blends (K2) (ID 85083)\". Erowid.org. May 1, 2010. erowid.org/exp/85083",
 "substance": "Smoking Blends (K2)",
 "bodyweight": "180 lb",
 "report": "<p>It all started like everything else, a fad,a rush, uncharted territory and a chance to tell the man to fuck himself, this is legal I'll smoke this where I please. I bought two 4 gram bags of k2 in a headshop outside of town it came in a inconspicuous bag that said the contents of the package in question shouldnt be exposed to static electricity.</p><p>After buying the goods I drove home and rather eagerly stuffed a cyclone blunt full of it and went outside to indulge myself in the perfect weather. Coming up I felt like I'd taken a steep hit off of my water bong, I noticed that everything looked much brighter and the sounds of the birds started to really get on my nerves, I went inside to be in less chaotic surroundings.</p><p>I made a beeline to my room because I felt very inspired and wrote for at least an hour about any subject my brain could get its hands on. I started to notice my body felt sore and very heavy afterwords, I also felt feverish and hot. My friend called me later and asked if I wanted to smoke some with him because I told him I would be buying some and he had never partaken in it before.</p><p>We smoked and joked and he described it as how you feel when you just step off of a roller coaster and your trying to find your land legs, I thought this fitting. I enjoyed my first time so much that I found myself doing it every day for the rest of the month, doing at least 2 grams a day. Some days I would be very inspired other days very very paranoid, I'm already a very anxious, depressed person who has pretty bad attention problems. So the weeks following lift off, at first in a stressful work environment I was performing better, but going along I found myself getting very angry all the time and without any reason to.</p><p>The last week everyday I smoked I would have extreme bouts of involuntary muscle spasms, I could feel the blood running in my veins I thought my body was falling apart, not to my surprise the day after I would always be extremely sore. So I guess in retrospect I would say, that it was an interesting drug that was a mix between in my mind, mushrooms and meth, though entertaining and legal I found it not to be worth the cost to buy or the damage it will do to my body and mind.</p><p>Pros</p><p>Creative</p><p>Clarity of thought</p><p>Sound is fantastic</p><p>Cons</p><p>Extreme muscle spasms (not just my experience many of my friends had the same thing occur)</p><p>Depression</p><p>Anxiety</p><p>The world seems very foreign</p><p>Irrational thoughts</p><p>Delusions of bad health</p>",
 "year": "2010",
 "id": "85083",
 "gender": "Male",
 "age": "20",
 "timestamp": "2010-05-01T07:00:00.000Z",
 "views": "5426",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 g",
   "administration": "smoked",
   "substance": "Products - Smoking Blends - Cannabis-Like"
  }
 }
}
