{
 "title": "American Revelations",
 "author": "Bruce",
 "citation": " Bruce. \"American Revelations: experience with Mushrooms (ID 85118)\". Erowid.org. Sep 9, 2010. erowid.org/exp/85118",
 "substance": "Mushrooms",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "3 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>Well, it all started at night when I decided we should get some mushrooms around 3AM, drunk. The only connect we found was someone about 40 minutes away and ended up getting them and sleep about 5AM. Eleven grams of powdered crushed up boomers. Woke up the next day with a few things to do, so me and the two other trippers went our separate ways until around three PM. Before leaving I wrote down a few things I had been thinking about lately that I wanted to keep in my mind, if somehow it changed on the trip.</p><p>We started at our friend's house who at the last moment decided not to trip with us. We will call him G. It was somewhat of a disappointment but he had his own reasons so we didn't stress it. I had tripped 3 times prior to this, Z had never tripped (and was only going to take two grams), and K and tripped countless times. So we mixed each of our respective amounts into a drink and enjoyed (almost puked from the grossness).</p><p>After about 20 minutes we were sitting out in the sunlight in Z's mustang. Everything around me started to shift. Ideas were revolving, and I felt like I had been freed from some mental barriers that had been stressing me lately. All that I saw and felt was in the car and I was really in the moment. Flowers were shifting, trees were turning and twisting. For the first time I really started to appreciate Z's mustang at a higher level. The weight and American spirit of the doors fascinated me. About that time G came out and said when we wanted to, he could give us a ride wherever. This was great news for me Z and K, to have someone not tripping able to do that for us. After about 20 minutes more we decided to go to a secluded spot with a tennis and basketball court.</p><p>I love basketball and couldn't wait to play when I got there. Even with everything spinning I felt like I could just have fun and play well. As I looked around my familiar neighborhood took on a new light. It was as though I was seeing all of it for the first time, even after living there my whole life. We started playing basketball, and I challenged G to a game. After about 1 point I changed my mind and didn't want the competitive spirit anymore. So we shot around and had a few conversations. We talked about society, the complexities of time and space (which G helped with by bringing a good dose of reality into the conversation), painting, basketball, and life decisions. Z, who was a first time tripper, and slightly apprehensive at first said he was loving it and saw a whole new way of living. I felt like mushrooms were always a part of me and so natural and I was connecting with that part of myself. This especially made sense after we were talking about parallel universes.</p><p>I laid on the ground and felt all the weight in my body go away, and saw octagons and hexagons start forming in the trees and spinning along with the sky. I told my friends to come over immediately and try it too. Everyone seemed to like that feeling.</p><p>After a little longer we decided to take G up on the mustang ride. We hopped in, and I thought I should get shot gun, even though it wasn't my car. Material objects meant absolutely nothing and had no owner at this point. K brought along a great unreleased Jimi Hendrix CD. This was AMAZING. I had never, and I don't think either K or Z had ever felt Stone Free the way I felt it that day. Driving in the mustang, smoking cigarettes and hearing him yell out his life to us was incredible.</p><p>After about ten minutes we were at the high way on our way to a nice route through the mountains that we know. We were all smoking ciggs with the exception of Z, who never does and was not about to start. Well on the ride we saw motorcycles, people tenting and almost simultaneously we all had the realization that we ARE AMERICANS. It was as though we had never truly realized what it meant to be American. We are all just immigrants. We were in our mustang, cigarettes lit, listening to Jimi. We drove full speed down one road, but luckily G spotted a cop and slowed down right in time. It was comforting knowing he had things under control, and I was able to relax and just enjoy tripping and seeing the scenery. Then we started listening to rap, which sounded amazing and I really listened to every word with anticipation of the next thing coming.</p><p>After a good ride (about an hour?). We all agreed it had been the perfect amount when we arrived back at the house. When we went in the driveway we hung around and talked a bit. At this time I got some intense motivation from somewhere, and started yelling LET's GET IT! I felt like we were all wasting our minds. If we could combine our brains into one common goal, and provide a service or product to people we could become extremely successful. I started seeing the true potential of everyone and everything around me, the maximum possible level of achievement and it was mind-boggling. I tried explaining it to my friends and they agreed we were capable of tremendous things. At this point we were all starting to come down. Z pointed out a spider to me, and its web looked ridiculous. The web continued further than it really did for me with the effect of the mushrooms.</p><p>We went inside and Z and K both took a little more mushrooms to keep the trip going for them. I decided to just relax and have a few beers. I couldn't smoke marijuana due to an upcoming drug test. I expected this to bother me a lot more on the trip but I was fine just watching my friends. We started playing one of our favorite games Fifa 2010, which felt so realistic and great. I was basically done tripping after my game.</p><p>This trip was completely amazing, enlightening and successful. Z had a great time and felt as though his mind had been transformed for the better. K, who had experienced it many times, felt like it was a solid good trip. G enjoyed it, even when not tripping. I came to a lot of conclusions and used the drug not for recreation but as a way to really make my standard of living better. My five senses were working great, my mind was more accepting of things that used to get it mad. I felt as though I really could see the inner soul of people and understood them at a more loving level than before the trip. I plan on tripping one or two more times this summer and then taking a year break.</p><p>Trip success.</p>",
 "year": "2010",
 "id": "85118",
 "gender": "Male",
 "age": "19",
 "timestamp": "2010-09-09T07:00:00.000Z",
 "views": "1804",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
