{
 "id": 8525,
 "title": "Incredibly Energized",
 "date": {
  "submission": "2008-04-27T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Schwarzmagier",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Wormwood",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ],
 "report": [
  "After reading about the legendary beverage called absinthe, I became curious about the main ingredient, Wormwood. I ordered a package of 50g on eBay. This herb is actually fully legal here in Germany.",
  "My first experiments were made with Wormwood tea. I usually took about 2-3 grams and added 200 ml of boiling water. To make it drinkable I added lots of sugar (like 5-6 spoons!). The first time it tasted awful, but after the 3rd time or so, I got accustomed to it.",
  "Whenever I drank this tea, I felt incredibly energized. Some people told about increased creativity, and I can only second to that. I usually just had to rock out on the piano, trying out new things. Sometimes I just felt like moving around and started jumping! There was an anxiety similar to a high dose of caffeine. Rarely I experienced a light headache, increased heart frequency, or a very slight nausea (probably due to the odd taste). The anxiety and creativity usually reached it's peak 30-45 minutes after ingestion, and then faded off into a tranquil and peaceful state, with a slight decrease in mental abilities. I couldn't concentrate on a movie or a book, but listening to music was fine. A few hours later I usually became very tired and went to bed. Occasionally I had a hangover with headache on the next morning, which was negligible unless I had to get up at 6.",
  "Eventually, I wanted to try something different. I mixed most of the remaining herbs (about 35 grams) with about 350 ml Doppelkorn (an alcoholic beverage containing 38% alcohol), and let it rest for about two weeks. Then I filtered it and came up with a somewhat clear brown liquid, not unlike some czech absinthe I had seen earlier. It smelled very strong and reminded me to medicine. By European laws, the resulting liquid probably was exceeding the legal thujone limit. In fact, the recipe I had gotten with the herb said to use 1000 ml of vodka with 25 grams of herb.",
  "Ingested in small doses like 2 cl, the effects were almost identical to the wormwood tea, although the alcohol seemed to cause a less lucid state of mind than the pure tea. The taste was very similar actually.",
  "One time I increased the dosage, and consumed about 10 cl at once. The effects remained the same, but increased in strength and duration. I felt very good. In fact, wormwood is definitely useful as an antidepressant. I felt like moving and dancing around, and so I did. I started playing on the piano at an insane pace. I even rolled on the floor laughing just because I liked to. However, I didn't lose control over myself. As the doorbell rung, I quickly got up and normally walked to the door to respond. The guy didn't notice how I was out of myself. When I came down later, it happened incredibly soft and peaceful. That night however, I had some trouble getting to sleep, again the effects were similar to a high caffeine dose. But eventually I fell asleep and had some intense dreams.",
  "By now, the herb I bought is almost gone. Maybe I'll try it out again, maybe not. I don't feel addicted to it at all, and I fear it will lose it's effect if done to often. Also there are statements that it can cause brain damage if consumed over a longer period of time. Luckily, my brain doesn't feel damaged.",
  "Last but not least, I do not believe that wormwood, even combined with alcohol, can have such effects as putting someone in a homicidal rage, as reported from the beginning of the 20th century. I neither felt the urge to kill anyone, nor to cut my own ear off (as Vincent Van Gogh is told to have done). The overall tone of my experiences was happy and peaceful and just a little bit weird."
 ],
 "erowid": {
  "id": "50438",
  "citation": " Schwarzmagier. \"Incredibly Energized: experience with Wormwood & Alcohol (ID 50438)\". Erowid.org. Apr 27, 2008. erowid.org/exp/50438",
  "substance": "Wormwood & Alcohol",
  "views": "24962"
 }
}
