{
 "title": "First Time - Very Impressed",
 "author": "Bakininmephrica",
 "citation": " Bakininmephrica. \"First Time - Very Impressed: experience with JWH-018 (ID 85285)\". Erowid.org. May 18, 2010. erowid.org/exp/85285",
 "substance": "JWH-018",
 "bodyweight": "240 lb",
 "header": [
  "DOSE:",
  "7 mg",
  "smoked",
  "JWH-018",
  "(powder / crystals)"
 ],
 "report": "<p>I heard of fake pot on the local news.  I normally would have dismissed the information but my interest was peaked when the report stated that kids were going to the hospital.  My first thought was that it must be describing salvia or some other herb that gave a head rush.  When I discovered JWH-018 I was very intrigued.</p><p>I purchased 2g.  It cost $90 and was at my door in 3 days.  Let me first say also that Ive smoked my share of pot but Ive mostly been abstinent from all drugs and alcohol for the last several years.  I had done a lot of research so I was wary of the dosing. On the same day the JWH came, I received a cheap 1mg scale.  It wasnt very accurate below 10mg so I couldnt accurately weigh less than that.</p><p>My first 10mg was mostly wasted whilst I was learning to vaporize properly. Got almost nothing off that.  However, my 2nd 10mg was much more efficiently absorbed!!  I estimate with losses from missing smoke I probably consumed a total of 7-8mg.</p><p>About 15minutes after consuming the 2nd 10mg, I realized I was getting really high.  It was identical in feeling to high grade marijuana except I had smoked a ridiculously small amount(by the way, my supply was perfectly white). </p><p>The first hour was NOT pleasant, I got very introspective in a negative way and had a fair amount of anxiety and paranoia.  I was extremely high and it felt similar too the first time I smoked a large amount of high grade marijuana and got higher than I liked.</p><p>After that hour passed, I had a little more control of my emotions and I felt really good. Enjoying the warm pulsations of being on a really clean high.  It was a VERY energetic high and I cleaned my house like a maniac (but was really stoned and moving slow)</p><p>Finally felt good enough to take my dog to the park. Lots of energy loss when walking, but felt mentally alive.  Strangely enough, this stuff seems to have the OPPOSITE effect on munchies for me. I have an overactive appetite anyway, so whenever I smoke pot I get insane munchies.  Im 4 hours into this high and I have absolutely NO appetite.</p><p>Duration: Ive read many reports about this having a much shorter duration that MJ.  This was not the case. The duration was almost identical to high grade MJ (3 hours) possibly longer.</p><p>Overall, Id say this is the poor mans way to a super clean high normally only reserved for the highest grade bud.  No odor, no drug test failure, cheap, Im sure it will be highly illegal soon!  Order a shitload of it while its still easy to get!</p>",
 "year": "2010",
 "id": "85285",
 "gender": "Male",
 "age": "38",
 "timestamp": "2010-05-18T07:00:00.000Z",
 "views": "9681",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "7 mg",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  }
 }
}
