{
 "id": 8529,
 "title": "Stop The Ride, I Wanna Get Off!",
 "date": {
  "submission": "2002-01-11T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "LewisCarrol",
  "gender": "Female",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  }
 ],
 "report": [
  "I wanted a cheap trip, so I went to Wal*Mart and bought some Heavenly Blues.  I also bought a coffee grinder.  I worked at a coffee shop then, so the grinder wasn't out of place.  I ground 4 packs of the seeds, after washing them in boiling water.  I then let the mixture set for almost 5 hours till I got home.  At home, I ground up the other 4 packs.  Then I took 2 motion sickness pills.  I CANNOT STRESS ENOUGH HOW MUCH YOU NEED THESE!!  I let those set for about 45 minutes.  I then strained the water out, and got a straw and started drinking. ",
  "This is the worst smelling/tasting crap I've ever been near.  I kept almost gagging.  Then I laid down for about 30 minutes.  I started to feel very, very ill.  I got up to go lay in my bed, and it was hard to stand up straight.  I tried to hold out as long as I could before I had to puke, but there was no stopping it. ",
  "I was SICK.  My stomach felt a little better after I puked, but my head was spinning.  It felt like someone took my brain and put it on the Gravitron.  My body felt like the air weighed a million pounds.  I was afraid to lay in the dark or turn off the tv, like if I did, it would mean I would be turned off too.  Time passed excruciatinly slow.  Every minute felt like at least ten.  Serious.  I was getting more sick, and wished I had taken more motion sickness pills.  I had long since given up smoking weed on anything more then a bi-monthly basis, but decided I'd go for it.  I tried to smoke a bowl, and took three hits.  I wanted more, but it felt like I had been standing there a half hour.  (I have to smoke out my window.)  It helped a lot, and I eventually fell asleep--Thank God!",
  "I will never, ever do this again.  Never."
 ],
 "erowid": {
  "id": "5045",
  "citation": " LewisCarrol. \"Stop The Ride, I Wanna Get Off!: experience with Moring Glory Seeds (ID 5045)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5045",
  "substance": "Moring Glory Seeds",
  "views": "23153"
 }
}
