{
 "id": 8536,
 "title": "A Delightful Romp",
 "date": {
  "submission": "2007-12-17T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sqwirl",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Wormwood",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Well a little while ago I purchased one of those 'steep your own absinthe kits'. After more internet research I found people who both said they did work and some that didn't. Before I made the absinthe me and a few friends were sitting around one night and we read about smoking it so we decided to give it a go.",
  "We had no rolling papers available so I removed the tabacco from four cigarettes and filled them back up with as much wormwood as I could pack in with a pencil. They were of course not packed very tight and contained a very small amount of wormwood. The smoke was pretty pleasent and went down smooth with no coughing. It burned rather quickly but I attribute that to the fact that I didn't have proper equipment to roll/pack them.",
  "After a few hits three of the four of us were feeling effects. I can only describe what I experienced but the other two said they felt very similar. What I felt was a state of being completely relaxed but at the same time able to focus very intently. It was very pleasant for me. The fourth guy said he felt absolutely nothing from it. The effects only lasted around thirty minutes to an hour. Which is fine, I can stand smoking another cig every hour or so. None of us developed a headache or stomach issues at all.",
  "All in all I'd say it was a pleasant experience and I'm waiting to make some wormwood hash out of the ounce I've had soaking in grain alcohol for over a month."
 ],
 "erowid": {
  "id": "50481",
  "citation": " Sqwirl. \"A Delightful Romp: experience with Wormwood (ID 50481)\". Erowid.org. Dec 17, 2007. erowid.org/exp/50481",
  "substance": "Wormwood",
  "views": "10229"
 }
}
