{
 "title": "Don't Ever Mix RC's",
 "author": "Uncle_bud",
 "citation": " Uncle_bud. \"Don't Ever Mix RC's: experience with Methylone, MDPV & Mephedrone (ID 85370)\". Erowid.org. May 18, 2010. erowid.org/exp/85370",
 "substance": "Methylone, MDPV & Mephedrone",
 "bodyweight": "69 kg",
 "report": "<p>So i have finnaly found time to write what happend to me last week. It was friday and parents ( i only live with mom ) were on vacation till Sunday evening. So my friend came to my place and 5 min. later the man with drugs.</p><p>So in the course of an afternoon we eat each aprox. 1,5g of Methylone 3x500mg ( we both have high tolerance on those legal rc stuff and we both smoke Cannabis daily )</p><p>The last 500mg produced a light buzz nothin much.</p><p>At 3 in the morning we are still at my place. We had a small party going on and friend brought aprox. 100mg of MDPV. I was getting ready to divide into doses when a friend spilled water directly in the opened tin foil with mdpv in it.We decided to put everything in  a 0.5 L bottle filled with water. In 10 min the bottle was empty, we all drinked the same amount. 30min later we all felt another buzz very similar to speed. Nothing much. We smoked couple of joints till morning.</p><p>Peep's left in the morning. just my bf stayed... the day was going slowly and we were both totaly exhausted from the after effecs. At around 12 i took another 500mg Methylone pill. 1hour later.... NOTHING ... it seemed weird to me. We were planing for another party night at my place.</p><p>At around 4 we got 20mg of MDPV. each insuflating 10mg. again a amphetamine like buzz wich turned my washed up head into more enjoyable mood. At around 8 in the evening a friend droped bye with mephedrone (crystal form). ( shiiiiit not again - craving )</p><p>Each inssuflating whole gram in half an hour. Nothing much... a little buzz ?</p><p>So we decided fuck chemistry and bought 3g of very very good weed (killer sativa). Back at my place. We smoked 7 joints one after another including a 1g spliff 100% weed ( All pissed off beacause mephedrone and bk-mdma didn't produced the desired buzz.</p><p>10 min later... things were getting strange. It wasnt just a marihuana high. it was getting similar to a easy shroom trip mixed with ganja and speed. 15 min later we were both fucking hallucinating ! every color was darker. everything looked smaller. if i looked through the window i couldt tell if it is raining beceause i saw little stars falling like rain. we were totaly surprised because we didnt expect such intense high. and damn it was fucking stroong. we went to my room and decidet to surf some net.</p><p>The felling was amazing, racing thoughts,everything looking funny... my friend was at the keybord so he rooled some hip-hop tracks. When i heard the beat i just couldnt shut the mouth. I began to freestyle rap and i was doing so for the next hour ( i never ever tried to rap something) The thing that im most stunned by is that it actually sounded very very good. Friend was so fucking amazed because he has never saw me that high. And yes i was fucking high.  I could compare it to 150mg of MDMA or 0.7g of Panaeolus Mushrooms.</p><p>At around midnight my friend left and i was home alone... i was stil very high. I began randomly walking from one part of my apartment to another. 10min later i fell in the bed. The next 3 days i was sleeping almost the whole day and my sweat smeelled like Acetone. It was horrible. I got really depreesed.And i could still fell the aftereffects the 4th day.</p><p>I know that i consumed too much of everything and i learned something... go to sleep between trips.  I noticed also from other experiences with Methylone that smoking Cannabis after the peak or when it's coming to an end brings you back on a very similar buzz.</p><p>Sorry for my bad english and writing under influence of ganja.</p><p>Greets.</p>",
 "year": "2010",
 "id": "85370",
 "gender": "Male",
 "age": "18",
 "timestamp": "2010-05-18T07:00:00.000Z",
 "views": "20714",
 "dose": [
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 3:00",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 6:00",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 15:00",
   "amount": "33 mg",
   "administration": "oral",
   "substance": "MDPV",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 16:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 24:00",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 28:00",
   "amount": "10 mg",
   "administration": "inhaled",
   "substance": "MDPV",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 32:00",
   "amount": "1 g",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 33:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
