{
 "id": 8537,
 "title": "Incredible",
 "date": {
  "submission": "2007-09-06T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Rafeek",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 6x"
  }
 ],
 "report": [
  "This was my third experience with salvia and by far the best.",
  "Setting: my room, lights out, one candle lit, alone, watching trance dvd by robotic exotics on laptop",
  "2215 - Pack and take two hits off bowl",
  "2216 - Salvia hits immediately. Intense feeling of warmness. Feels as if someone is trying to tip me over, pushing me back as if trying to facilitate being slain in the spirit like the Penetecostals do. I always get this feeling.  This is followed by the floating away of my mind, depersonalization beginning. I can feel my body fall asleep, just like what happens to my leg, but all over.",
  "2220 - By now I'm completely immersed into the trance dvd. It's an incredible experience. It's as if I've been sucked into the computer screen and on a magic carpet floating through the everchanging landscapes.",
  "2225 - I attempt to close my eyes. Visuals are fleeting but there. Very arbitrary and relentless. I bounce from one place to the next. I start off in the psuedo religous ceremony scene of the movie eyes wide shut but there's no fear.",
  "now (2300) - I am still watching my trance dvd. The strong effects of salvia are long  gone, but it still easily entrains my mind into the trance dvd. Salvia might be the next great audiovisual entrainment facilitator out there. I would love to try it with a mind machine."
 ],
 "erowid": {
  "id": "50482",
  "citation": " Rafeek. \"Incredible: experience with Salvia Divinorum (6x extract) & Devices (Trance DVD) (ID 50482)\". Erowid.org. Sep 6, 2007. erowid.org/exp/50482",
  "substance": "Salvia Divinorum (6x extract) & Devices (Trance DVD)",
  "views": "3896"
 }
}
