{
 "title": "Buzzy Feelings",
 "author": "Paradigm",
 "citation": " Paradigm. \"Buzzy Feelings: experience with Products - Bath Salts, Plant Food, etc. ('Stardust Extreme') (ID 85396)\". Erowid.org. Aug 31, 2011. erowid.org/exp/85396",
 "substance": "Products - Bath Salts, Plant Food, etc. ('Stardust Extreme')",
 "bodyweight": "68 kg",
 "header": [
  "DOSE:",
  "1 line",
  "insufflated",
  "Products - Bath Salts, Plant Food, etc",
  "(powder / crystals)"
 ],
 "report": "<p>[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.] </p><p>I bought 0.5g of StarDust Extreme from a UK head shop the other day. When I tipped it out it looked light and slightly crystally. I was unsure of how much to take or what to expect, because after 2 weeks of solid searching on the net I found no reviews, experiences or information of any kind on this product. So I decided to cut myself a small line of about 30-40mg to see what this stuff was like. It went down smooth and didn't have a very strong scent at all. Which from my experience with party powders and 'bath salts' is a good thing, because sometimes the things manufacturers add to make it smell and taste nice can actually make it unpleasant to take. As a result, the nasal drip from this stuff was better than similar products which tend to make me gag, but this was ok.</p><p>I sat there for about 10 minutes and waited for it to kick in. I wasn't feeling anything at this point. So I gave up and went to sit down and watch tv. As I entered the living room I started to feel a weird buzzy feeling in my stomach, which I thought nothing of. Over the next 10-20 minutes the feelings got stronger and my heart rate increased. But it was so subtle and gradual that I hadn't really noticed how it was effecting me, until I decided to phone my Dad! As soon as he answered I suddenly found myself with a million things to say, which is unusual because I'm a very quiet, shy person. With this new found confidence we chatted away for 5 minutes, then out of nowhere I was hit with a pleasant rush all over. I suddenly realized that I was as high as a kite and feeling happy, chatty and slightly euphoric. For a moment I panicked over one thought, 'what if Dad notices I'm on something'. Because as far as he knows I stopped taking drugs (legal or otherwise) when I left home 6 years ago. Which I had done, until last year when I decided to try some of the latest generation of legal highs. We chatted some more and I began to calm down.</p><p>After talking to my Dad I found myself sitting in front of the tv and just staring into space, with some wonderful euphoric, heart racing buzzy feelings. So I thought I might as well do something useful with my time while I was buzzing. I finally decided to go on the computer and write a review of a different legal high I bought the week before. So I got writing. Before I knew it an hour and a half had disappeared and I had written well over 500 words. Making, I thought, some very interesting and informative points. Looking back I think I was just waffling and writing down the first thing that came in to my head. Suffice to say, they didn't accept my review, far too long probably.</p><p>Time seemed to just disappear as I was sitting in front of my pc. Before I knew it another 2 hours had gone by and I was feeling great. I ended up spending the rest of time doing the cleaning. I would say the high lasts a good 5-6 hours. When I came down I slept soundly and had no ill effects in the morning.</p><p>I think I will do this again, but only as a once in a while thing. It's not the kind of thing I want to get addicted to.</p>",
 "year": "2010",
 "id": "85396",
 "gender": "Male",
 "age": "27",
 "timestamp": "2011-08-31T07:00:00.000Z",
 "views": "4587",
 "dose": {}
}
