{
 "id": 854,
 "title": "Long... Long... HELL",
 "date": {
  "submission": "2000-10-05T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Cold",
  "weight": "64 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 flowers",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "3 leaves",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(tea)"
  }
 ],
 "report": [
  "<p>I live in mexico... so Datura or Brugmansia plants aren't hard to find... At the highway sometimes you can see hundreds of these plants... but the most common ones are Brugmansia candida and Brugmansia versicolor. Anyway, I picked up 3 yellow flowers (B. versicolor) and 2 white ones (B. candida)... also picked 5 leaves.",
  "I wasnt sure if boiling would cause scopolamine and atropine to disappear due to heat action, so it seemed logical to me that heat wasn't needed... I chewed a leaf and nothing happened... except for that nasty flavor... So I mixed 3 B. versicolor flowers and 3 leaves in about  500ml water... I waited for about 3 hrs to let tropane alkaloids out of the flower/leaves iber.",
  "First I drank about 100ml and the way it tasted was awful.",
  "I waited half an hour to see if the effects would appear as with Real Daturas (Datura inoxia... also called Toloache or Yerba del Diablo) but nothing happened...",
  "I thought that Brugmansias had a very poor amount of Scopolamine/atropine so I decided to drink the rest of the solution... Again the solution flavor almost caused me to vomit, but anyways I drank it all.",
  "I waited for about 30 minutes and nothing happened...",
  "I was kind of frustrated but about an hour after ingestion, I started to feel some strange things about my conscience.",
  "I started to walk around my house... went to my room, studio, kitchen, living room, garden etc... I didnt knew why I was doing that... I looked through the windows and the world outside seemed artificial (something like those sketches that use in movies)... Outside seemed so new, so artificial, but also so nice...",
  "I felt happy because Ive never tried Brugmansia... This 'artificial world feeling' lasted for about 30 minutes and then altough it was still there, it was barely noticeable.",
  "Then I started to feel my legs very weak and I decided to sit in my bed for a while...",
  "I was looking through the window and then strange things happened... My peripheral vision changed at the point that images were disstortioned like if they were covered by water or some jelly like substance... I tried to feel my heart (as I always do when trying a psychoactive), but i couldnt feel it... I countinued trying and trying but I could feel nothing.",
  "I started to feel nausea, and I decided to go to bed again, this time to rest... I tried to rest, but I couldnt... I felt disoriented... I didnt know were was my rooms window, or if I was lying on my bed... I felt confused.",
  "Those things were nasty, but something happened that still makes me feel scared... I was lying on my bed and then I felt like someone had touch my shoulder... I had read about tropane alkaloids, so this seemed normal to me... then I felt again like someone had touched my back, then my lef leg, then my arms, then my other leg... etc...",
  "This wasn't scary or something, but then I started to feel electric shocks all over my body, but in specific areas... first I felt a shock in my back, then my legs, etc... This was HORRIBLE... I couldnt stop that!!... I tried to calm down and I did it well... shocks almost disappeared.",
  "I fell asleep, although I'm not sure if I was sleeping or if I was awake but in some altered conscience state... My girlfriend woke me up and we talked for some minutes. Then two friends entered to my room and I talked to them... when I turned back my girl wasnt there!!! then I turned around again and my friends weren't there either!!!",
  "I knew those were hallucinations, but DAMN!! they were sooooo reaaall... Friends and people keeped coming the whole night but although i knew they were hallucinations, I talked to them loud as if they were real people. It was just that my brain wanted to talk to them... I couldnt stop... then electricity came back, but this time harder...",
  "That nasty feeling attacked my neck to the point that I couldn't move my head... that lasted for about an hour!... an hour of suffering... and then it disappeared.",
  "Many other friends came to visit me and then I felt electricity in my right arm...  This time I felt really bad... that 'electricity' feeling was really really painful and I couldnt stop it... This lasted for about 3 hours and I couldn't rest or be distracted or anything else to forget about that pain.",
  "I started to think the solution was poisonous, but I woke up and went to the bathroom to relax a bit. Pain in the right arm dissapeared as i looked at myself in front of the mirror.  I knew it was me at the mirror, but I felt like if that guy wasnt me... like if it was a different person, with different feelings that was looking at me.  I laughed at that feeling but the reflection didn't...I got close to the mirror, but the reflection didnt move a single cm...",
  "I returned to my bed and started to feel cramps, nausea, touching, electricity running all over my arms.  I opened my eyes to see if everything was ok, and my room was different... I mean... same stuff in there, but all furniture was in a different place... I closed my eyes again, and opened them in about 2 minutes... Damn!! the furniture wasnt there! ",
  "I looked through my window again, and I saw a flashing light... one... two... three!... like the ones u see in a big rain storm... I rested again and friends appeared again. I talked to them the whole night as if they were there.",
  "Next morning i woke up and I couldn't tell if my world was real or not. Daturas hallucinations are so real that I couldnt tell if I was still 'dreaming'. I walked around my house and I realized that I was normal again... I went to the kitchen... etc... then I started to feel cramps at my right arm, but nothing seriouse... I was happy because everything was over...",
  "I went to the bathroom and saw me at the mirror.. The reflection was normal, except for one thing... Its eyes were closed. Then I moved and it moved too... even it felt normal, but the eyes... closed eyes... DAMN!!!",
  "I touched my eyes, and they were closed too!!!  The reflection wasn't wrong!  I could see even if my eyes were closed!!!... This felt so real!!!... so real!!!  I could walk, sit, watch tv, everything as if my eyes where open...",
  "Then cramps started again... so i decided to rest a little... I woke up and nothing was wrong... Im pretty sure I wasnt at Brugmansia's effects anymore.  Everything was normal again, but I couldnt read, or see some details of the things in my house, my vision was pretty blurry due to scopolamine as I had read.",
  "Blurry vision disappeared sometimes, but it came back in a few minutes.",
  "Then electricity again... and again, and again, It was a living hell... hallucinations were over... All I had was that I was poisoned... Not something to worry about, but it is something I wouldn't wish on anyone.",
  "My trip (If u can call it that) lasted for about 20 hours... and the blurry vision lasted 3 days...",
  "That night I learned something...",
  "Brugmansia can give u hallucinations so real that u can be confused about whether you are hallucinating or not... Also... Brugmansia are highly poisonous. You must treat this lady with all respect she deserves.  She is the kind of plant you dont want to mess with.",
  "I dont know if my uncooked solution was the problem, but I'm sure I wont do it again... cooked, smoked, snorted or whatever.  This plant is for the kind of persons that want to try everything at least once.",
  "I personally discourage the use of this plant as a recreational psychoactive. It seemed really dangerous and if u have a bad trip like mine you may be TORTURED for hours or even days...</p>"
 ],
 "erowid": {
  "id": "1239",
  "citation": " Cold. \"Long... Long... HELL: experience with Brugmansia (ID 1239)\". Erowid.org. Oct 5, 2000. erowid.org/exp/1239",
  "substance": "Brugmansia",
  "views": "34185"
 }
}
