{
 "id": 8545,
 "title": "Keep It Legal",
 "date": {
  "submission": "2006-03-24T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Teethoflions",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "tea"
  },
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "",
   "specific": "Cigarettes"
  }
 ],
 "report": [
  "I had a concussion about 4 months ago and was diagnosed with post-traumatic headache. For a longtime I suffered from horrible migraine-like headaches on a daily basis. My neurologist started me on Darvocet, bumped me up to Vicodin ES, then to Percocet, then eventually OxyContin. I had been on opiates everyday for those 4 months and will admit I became very dependendant on them. I was running out of medication and didn't have an appointment with my doctor for several weeks. I was afraid of not only opiate withdrawal but also rebound headaches. I'm just getting my life back together, I could not afford to miss one more day of work or I would lose my job.",
  "While searching the internet for help with the withdrawal I might be facing I came across kratom. I was intrigued. There seemed to be an awful lot of hype for a legal plant! I had read many, many reports of people successfully using kratom to help ween themselves off of opiates or to at least ease opiate withdrawal. Becoming desperate, I figured it couldn't hurt to give kratom a try.",
  "I had taken my last dose of OxyContin. I was beginning to feel very woosy, agitated and nauseous. I was having intense cravings and could not get to sleep. But luckily my order for 40 grams of 'premium commercial' powdered kratom arrived the next morning.",
  "First, I brought approximately 55 fluid ounces of water to a roaring boil. I then stirred in all 40 grams of kratom and lowered the water to a gentle boil. I left the kratom to boil for 1 hour then strained the resulting liquid. After evaporation I was left with approximately 42 fluid ounces of kratom tea. Therefore my tea had a concentration of about 0.95 grams per fluid oz.",
  "I wanted to start out with a dose of 12 grams so I poured a little over 12.5 fluid ounces into a cup. My experiment was about to begin. I would be keeping a journal of my progress. And just for the record I am a 20 year old male, 5'11' tall and weigh 170lbs.",
  "5:20 PM - I'm just beginning to drink my cup of tea. I had read so many bad things about the taste and consistency of kratom tea. I was nervous with the first sip, but surprisingly its really not that bad. I was expecting much worse. It is quite bitter, but bareable. Best way to drink it is hold my breath a little, take a big sip and exhale. Not bad at all!",
  "5:23 PM - Wow, I can already feel my heart beating faster.",
  "5:33 PM - I'm beginning to feel a warm tingling sensation throughout my arms and legs. It feels quite nice. The heat in my house is not working on this very cold New England day, yet I feel very warm. Not too warm - comfortably warm actually.",
  "5:39 PM - I have finished sipping on my cup of tea finally. Yuck! Kratom tea tastes pretty nasty once it gets cold! I'd like to note that I just realized I'm no longer intensely craving more OxyContin and I'm actually beginning to feel better physically. Wow.",
  "5:42 PM - I'm feeling very spaced out mentally, yet physically stimulated at the same time. Like if I had drank a couple Red Bulls and taken a couple Percocet. I can definitely see how kratom could be useful for physical labor. All I can do is stare at the TV dumbfounded, but I feel a bit antsy - like I really need to get up and do something. Also, my tongue, lips and throat are all beginning to feel numb. It's a very nice sensation.",
  "5:50 PM - I was actually hoping for something a little more intense. I want to take 8 more grams of kratom so I poured myself around 8.5 fluid ounces of more tea and stuck it in the microwave. I'm actually enjoying the taste! The tea isn't bad when its hot.",
  "5:58 PM - It occured to me that if I'm going to be consuming around 20 grams of kratom (total) I ought to smoke some cannabis to prevent any possible nausea. I've only taken 3 large hits out of my bubbler. The bud I'm smoking is nothing to write home about. Midgrade at best. However, I'm beginning to feel intensely high! The synergy between the marijuana and the kratom is unbelievable. It's like the two drugs were designed to be used together. I feel very opiated and buzzed. I keep staring out into space and forgetting what the hell I'm even doing for minutes at time. It's wonderful.",
  "At this point I was too messed up to even care about keeping a journal. I decided to go outside for a walk, smoke a couple cigarettes and of course call some of my friends. I was feeling great. And I couldn't believe it was in part because of a -LEGAL- plant. I eventually made my way back into the house and got back to my journal.",
  "7:21 PM - Just finished smoking a cigarette. Whoa, wait a second. Did I just nod out? Yes...I did! I'm hungry so I think I'm gonna go make myself something to eat.",
  "Eating killed my buzz a tad, but doesn't it always? Around 8:30 PM I was clearly beginning to come down. But it was a nice, gentle comedown. And I should note, the effects from the cannabis ended before the effects of the kratom.",
  "I am extremely impressed with kratom. Not only did it stave off withdrawal, I actually got a very pleasant opiate type buzz off of it. There was no nausea whatsoever. Only downside is I can definitely see how this stuff is addicting. I'm already craving more and its only been a couple hours since I came down! I just ordered more.",
  "This plant is certainly very, very special."
 ],
 "erowid": {
  "id": "50519",
  "citation": " Teethoflions. \"Keep It Legal: experience with Kratom (ID 50519)\". Erowid.org. Mar 24, 2006. erowid.org/exp/50519",
  "substance": "Kratom",
  "views": "26895"
 }
}
