{
 "id": 8546,
 "title": "Not Such a Big Deal",
 "date": {
  "submission": "2009-10-20T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Cocaine",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "My friend had done coke a few times and asked me if I wanted to do some one of these days. Being in high school and having little funds, I figured that if he wanted to buy it for me, I would do it. I researched a bit online and decided that it might not be bad.",
  "We decided to wake up early in the day and do it. I called him and he came over with the coke. He showed me the coke as we entered my room; it was in a compact rock form and wrapped in tinfoil. We took out a book and began to cut it up. The powder seemed so fine and smooth. I expected the first time to hurt my nose and burn as it went up. My parents were still home and I had no idea what it would be like so I suggested that we leave and go somewheres to do it. He did one line while I took a small amount and rubbed it on my gums. The taste is unforgettable and delightful. After a minute or so my tongue and lips went numb. I couldn't wait to try it.",
  "We went to a usual hang out spot and parked his car. I asked him if he was alright to drive on coke and he said that it just perks you up. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] He busted it out and we had two perfectly seperated lines on the book for each of us. I had little food in my stomach so I could feel the butterflies flapping around. The moment came. My friend lunged into the book with his pen aimed at the two white lines and just like that they were gone. He told me to go nuts. I took the pen and took a few deep breaths and went in for my first line in my right nostril. I felt it going in and it was alot smoother than I had thought it would be. I had a stuffed up nose so I had to snuff extra hard. The next line was gone like candy.",
  "I asked him where to. We drove to the mall and talked the entire way there. When we got there for some reason I had a feeling that everyone knew I was on coke. It didn't freak me out, but it just bothered me. We went to tim hortons and got a coffee and walked the mall for an hour. The high didn't seem very intense and was nothing like I thought it was going to be. I just felt good, and slightly paranoid.",
  "My friend had to go do something in an hour so we went back to the place and snorted a pretty big line each. It felt really good this time. Several minutes later and I felt a more euphoric feeling. It was just a feeling of calmness. He told me that we had to pick up another friend to go to his event. As he got into the car he was unbeknowest that we had just done coke. The coke was by my foot on the floor of the car covered over by a napkin on a Lynard Skynard CD. We drove twenty minutes out to the place with the music blaring. The entire time I was staring at the coke anticipating when we would do our next line. Eventually I got so antsy that I just reached down and scooped a little to put on my teeth. My mouth became numb and the drip came. I couldn't stop snuffing back the snots from the back of my throat. I didn't want to spit them out for fear of losing some coke so I kept them there. Eventually the roof of my mouth went numb and I was feeling on top of the world.",
  "Halfway through the event I asked him if I could go snort another line. On my way to the car I asked myself if I could get addicted to this stuff. I cleared those thoughts as I did the next line and went back and sat with the fans.",
  "After his event we rushed back to his car and did another line each and finished it off. We both had grins on the entire way to the food store. I discussed my feelings towards coke with a semi friend over a smoke and I came to the conclusion that I should not do it for a long while.",
  "The funny thing is that everyone viewed coke as such a big deal of a drug and I found it to be the least effective. I did like coke for a few reasons however. There was no way anyone could tell that I did it. And it seemed like a really nice social drug. I waited until superbowl (five months later) before I had my next experience and the same friend and I did it in secret of three other friends that were at my house watching the game with us."
 ],
 "erowid": {
  "id": "50520",
  "citation": " Cocaine. \"Not Such a Big Deal: experience with Cocaine (ID 50520)\". Erowid.org. Oct 20, 2009. erowid.org/exp/50520",
  "substance": "Cocaine",
  "views": "5688"
 }
}
