{
 "title": "Nootropics",
 "author": "Dave",
 "citation": " Dave. \"Nootropics: experience with 5-HTP, Sertraline, GABA, Tyrosine & Phenylalanine (ID 85473)\". Erowid.org. Dec 3, 2013. erowid.org/exp/85473",
 "substance": "5-HTP, Sertraline, GABA, Tyrosine & Phenylalanine",
 "bodyweight": "145 lb",
 "report": "<p>Since fighting depression for two years, I realized that any depressants either gave too many side effects, or stopped working in a month of use. So after experimenting with my diet, and activities, I got my emotional depression, and lack of energy (somewhat) under control. But my focus and some-what lack of energy was still a mystery to me.</p><p>So I decided to try nootropic/smart drugs to see if I could find the right substances to curb the chemical imbalances in my brain. This report was compiled over two weeks. And each of these dosages were tried 2-3 times each for the sake of science and statistics.</p><p>5-HTP</p><p>At first, I tried 5-HTP, which goes as follows: taken with Sertraline (zoloft) it greatly enhanced my (assumed) serotonin levels, to the point I could feel the serotonin increasing and acting my brain. SSRI users know this feeling as a bunch of yawns, a numb apathetic feelin. The dosage and results goes as follows (without Sertraline). Each of these scenarios were experimented several times each.50mg (bedtime): Sleeping is easy, but significant increase of dreaming, especially 'weird' and vivid dreams. Woke up feeling much better and less groggy.100mg (bedtime): Sleeping is more difficult than without 5-HTP, very restless. And once asleep I was prone to wake up 3 or so hours later because of the dreams. Woke up feeling very weird and paranoid.50mg (daytime): Decent boost of energy, and slightly enhanced focus (not enough though). No mood enhancement though.100mg (daytime): Typical Serotonin yawn episodes every 10 minutes, slight lethargy, and a very pronounced 'fried-out' feeling not limited to staring off into the distances.50mg (daytime, with sertraline): Though the serotonin effects were far more pronounced, my symptoms were alot less severe with this combination. 5-HTP also seems to counteract the sexual side effects of Sertraline. But alas, cognition was still lax.I recommend 5-HTP over any pharmaceutical any day for general depression. And if you use other drugs, 5-HTP was a great suppressant for post-ecstasy crashes. And also boosted the effects of cannabis (especially the effects such as racing thoughts).</p><p>GABA</p><p>Secondly, I tried GABA in hopes of improving my cognition.2000mg (by itself): No real effect, however every 30 minutes it felt as if I was not getting enough oxygen, and I began hyperventilating. Nothing too scary though. Episodes lasted about 20 seconds.4000mg (by itself): No real effect noticeable still, I still have a foggy mind, but I seem to think a tad bit faster. And the breathing episodes increased in duration.GABA also appeared to make my cannabis highs become a lot mellower and slow paced, and the peak high was slightly longer lasting. Also, after the fourth or fifth time with GABA 4000mg, the breathing difficulties ceased entirely.</p><p>L-Tyrosine</p><p>Thirdly, I experimented with Tyrosine.1000mg (by itself): Slight mood lift, and cognition was noticeably sharper. I like where this is going. No other side effects.2000mg (by itself): A better mood lift, nothing really heavy, but it helps. Cognition was the same as 1000mg.1000mg (with 5-htp): This combination works great, with the cognition, mood, and energy enhancement of both - though not as effective as first few weeks of any anti-depressants SSRI or not.L-Phenylalanine</p><p>Last I tried Phenylalanine, which is a precursor to Tyrosine.1500mg (by itself): Same effect as Tyrosine(1000mg), but this kicked in much later.2500mg (by itself): After 3 hours, I noticed some positive effects. But not as good as Tyrosine 2000mg. or Tyrosine/5-HTP combo.</p>",
 "year": "2010",
 "id": "85473",
 "gender": "Male",
 "age": "18",
 "timestamp": "2013-12-03T08:00:00.000Z",
 "views": "813",
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP"
  },
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP"
  },
  {
   "time": "0",
   "amount": "2 g",
   "administration": "oral",
   "substance": "GABA"
  },
  {
   "time": "0",
   "amount": "4 g",
   "administration": "oral",
   "substance": "GABA"
  },
  {
   "time": "0",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Tyrosine"
  },
  {
   "time": "0",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Tyrosine"
  },
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Phenylalanine"
  },
  {
   "time": "0",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Phenylalanine"
  }
 ]
}
