{
 "id": 8556,
 "title": "Recovery from Addiction",
 "date": {
  "submission": "2006-02-21T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zoop",
  "gender": "Male",
  "weight": 83
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "15",
    "quantity": "15"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "oral",
   "substance": "Buprenorphine",
   "form": "daily"
  }
 ],
 "report": [
  "Hi, my name is Zoop. I have an update to an earlier experience report that I want to put out there.  My earlier report, entitled, 'This Thing is a Secret,' can be viewed here.",
  "Well, after about 11 months of using kratom daily, at a level of approximately 1/2 ounce (~15grams) per day (sometimes a little more), I finally got some help. The amount of money I was spending on this plant was totally ridiculous.  So, I have managed to get hooked up with a doctor who prescribes buprenorphine (brand names 'Suboxone' and 'Subutex') for maintenance therapy of opioid addiction.  This drug, buprenorphine, I am convinced, has come into my life directly from God.  If you are an atheist, forgive me for saying that. It has really helped me out a lot.  I haven't had any kratom for about 4 months now and the habit I had was pretty bad.  At the end, I was beginning to use poppy pods (P. somniferum) as a way to mediate the kratom addiction, but this ended up making my habit worse, not better (as most people could probably imagine, DUUH!).  O.K., so I am doing much much better now and I still attend Alcoholics Anonymous. I finally came clean to my AA associates and friends about the whole big long escapade with kratom addiction and everyone was supportive and understanding. ",
  "So, the moral of the story is that kratom is seriously addictive, and buprenorphine, which is approved by the FDA for treatment of opioid addiction, is an effective maintenance treatment for kratom addiction.  I have had NO cravings for kratom since starting 'bupe,' as they call it.",
  "Thanks for taking the time to read this."
 ],
 "erowid": {
  "id": "50555",
  "citation": " Zoop. \"Recovery from Addiction: experience with Kratom & Buprenorphine (ID 50555)\". Erowid.org. Feb 21, 2006. erowid.org/exp/50555",
  "substance": "Kratom & Buprenorphine",
  "views": "26504"
 }
}
