{
 "title": "Finding Your Most Beautiful Thoughts",
 "author": "stardreamer",
 "citation": " stardreamer. \"Finding Your Most Beautiful Thoughts: experience with Psilocybin Mushrooms (ID 8558)\". Erowid.org. May 2, 2004. erowid.org/exp/8558",
 "substance": "Psilocybin Mushrooms",
 "bodyweight": "135 lb",
 "report": [
  "<p> At the time I was 14 years old, and the hardest drug I'd ever done was pot. When my brother (a senior) and his friends shared stories about mushrooms, acid, dramamine, dxm etc. I wanted to see the fun they were talking about more than anything in the world.",
  "Now it just so happened that my brother had just ordered about 30 grams (for a large group of people to split) from japan, and I convinced him to sell 2 grams to me and 2 grams to my friend. However my friend couldnt pay, so I got 4 grams and gave one to him as a buddy ;) After holding on to them for about a week, we decided the safest place was at my dad's house (nicest guy on earth) in the middle of the night. This was a wednesday night and yeah we had school the next day (bad idea).",
  " My brother and his girlfriend told us they would semi 'babysit' us and make sure we didn't do anything stupid. What I have to emphasize is that all I expected was a drunken or potlike state (which was all I'd known) only with visual patterns and imagery mixed in. Nothing, and I mean NOTHING can prepare you for a first time on mushrooms. So about 11 o' clock my friend and I ate our mushrooms straight (smells like a foot, tastes like dirt.) and started watching tv in waiting.",
  "After about an hour, my brother and his girl went upstairs, and as far as I knew I was still totally straight. My friend and I sat on the couch relatively quiet until about an hour and a half into it I suddenly 'noticed' that I was not the same. It almost seemed without any climbimg into the high at all. Of course I didn't think of it that way at the time, and I'll do my best describe what I saw and thought.",
  " In my mind, mushrooms engage in 3 steps. The first of which being primarily visual. I still watched t.v., but suddenly and without any warning, I noticed the walls like never before. They seemed as if the little inlaid paint patterns were crawling and sliding down the wall, but in the same way candy cane strips move when you rotate the cane. They drifted downward but never really seemed to get anywhere. This is where things got really interesting.",
  "Everything I was seeing suddenly seemed extremely delicate and beautiful, and in another way I could almost say wise. As if lifeless objects had lessons to teach me, and I payed attention to everything. Meanwhile my friend was not having a far lesser experience, I payed little attention to his actions but more tried to talk to him as much as possible. This will sound really stupid, but I remember explaining to him for at least ten minutes about how this girl I was almost going out with had made this beautiful noise at school. The cause I couldn't remember, but I told him how she had   maybe giggled or laughed and that it was the single most extraordinary thing I had ever heard.",
  " We took turns staring at ourself in the mirror to see if the story about dilated pupils was true. Mine didn't seem to be but his definately were (odd?). At one point when I turned my head to the mirror, I saw my friend in a very strange way. This is almost unexplainable, but on mushrooms everything means something different. He was not just my friend but I saw him as everything he is. It's hard to make sense of now.",
  " The most amazing thing however happened in the kitchen. I noticed my friend turning the lights on and off and I stepped inside and asked him what he was doing. He said nothing and continued to turn lights on and off and after a few seconds I saw it. When the lights went off there remained a perfect and undeniable yellow-blue outline of everything in the kitchen. The stove and refrigerator mostly. Like a chalk outline in very vibrant, buzzing colors.",
  "After that we sat by the fireplace in the dark with the t.v. on and I explained to him all of the most 'impressive' things in my life, such as a gorillaz music video I had seen about 10 minutes before and the way my (soon to be) girlfriend walks like 'some sort of glorious being'. It seems that ideas of love and friendship or most prominent and that thinking about them excels the high intensely, making one feel very comfortable and ready to tell everything and everyone their love for it (similar to stories of heard of ecstacy).",
  " My friend fell asleep, and in the dark I talked to him (while sleeping) for about 30 minutes until I realized he wasn't paying attention (i wonder why). Now about 3:35 a.m. I decided I 'definately had to have sleep' and immedeately layed down on the couch. This is the worst idea in the world on mushrooms. YOU CAN NOT SLEEP. At least I couldn't! My head was so full of ideas and thoughts and it seemed as if I was thinking in multiple consciousness and of so many things that trying to sleep only confused me.",
  " I sat back up, pulled out some paper and began writing (not very legibly). It was mostly the same ideas of love and friendship and of the 'important things' like my brother and my family and most of all my unfortunate friend who I wrote of extensively as the best thing to ever happen to me. Yes I know this all sounds very much like I am gay, but on mushrooms it's like your deepest and most honest feelings come out freely and are then multiplied 1000x.",
  "After an hour or more I layed down and my head was quiet enough for me to sit still for about another hour. Eventually I slept (sleep was very weird, almost as if I were still awake with no mental movement) for maybe 10 to 30 minutes and I woke up to my friend getting a blanket. I quickly explained to him how he had 'saved me from the perils of sleeping' (yes trying to sleep was pretty bad) and asked him where to find a blanket. I made a large amount of noise staggering around in the dark looking, and for the first time I had a body high that felt like I was wavering back and forth as if made of rubber. With a much clearer head I layed down and fell asleep.",
  " In retrospect, it was the single greatest thing that has ever happened to me. It changed my views of everything. I wasn't a differnet person at all, but a more content one. I realize how dangerous it was to do it with my dad sleeping right upstairs, for if he were to come downstairs I have no idea how I would have responded to him. That was my first and only time, and I am 15 1/2 now. If only I could get some mushrooms again soon...</p>"
 ],
 "year": "2000",
 "id": "8558",
 "gender": "Male",
 "views": "6480",
 "dose": [
  {
   "time": "0",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2004-05-02T07:00:00.000Z"
}
