{
 "title": "Kratom Shooters",
 "author": "Mishkin",
 "citation": " Mishkin. \"Kratom Shooters: experience with Kratom (ID 85592)\". Erowid.org. Jan 9, 2011. erowid.org/exp/85592",
 "substance": "Kratom",
 "bodyweight": "160 lb",
 "report": "<p>A little about the subject: I am a 23 year old male, 160 pounds, daily cannabis smoker, dozens of drinks a week, several cigarettes, and then with consideration to environment, the nature of the ally, my mental health, supply etc. I also try to make sure and ingest: Psilocybin mushrooms, Ketamine (IM), Mescaline, MDMA, 2CB, 2CE, DMT, Nitrous Oxide whippets, very occasionally a sniff of cocaine or heroin (once or twice a year, insufflated). Im taking more consideration of the legal entheogens lately, locating me in the realm of Kratom. This year I have started using it about once a week, sometimes less, and lately more because I have discovered a favorite method of doing it after much trial and error, such is the reason I am posting this report, to hopefully help people figure out if they like Kratom via a consistent method of achieving effects, which seems to last overall about six hours, with sleepiness that follows.</p><p>A little more about Kratom and its effects on me: Kratom shows itself first in its curious stimulant effect, which is rather like caffeine to me, except glowing, with fuzzy vision. What is curious about it is that it makes me want to do physical labor, use my muscles, stretch, and focus on the stillness and pleasure of muscle strain and release, for example, hanging on a pull-up bar would be nice. The stimulation of it lasts for most of the experience but to me it slowly converts itself towards an opiate sensation, including itching, as the caffeine-like buzz settles down a bit. In both phases of the experience I have found nausea to be possible. Cannabis is a great relief for this and it also combines beautifully with Kratom.</p><p>Other effects of note: It works well as an anti-anxiety cure, allowing me to speak and think at greater ease and with less hesitation, a euphoric analgesic without the investment and shaky pleasant weight/dullness I seek in other opiates which kind of smear the experience like a warm puddle around me and behind me. Kratom is more like stiff mellow vines growing and doggy paddling inside of me and out of my head, far less like my muscles have fallen through the floorboards, but getting there, and as a sleep aid it works in the same vein as an opiate (the sleep of angels) or benzo, but less often fluttery in the eyes/double-vision as with opiates nor as instantaneous as benzos. Higher doses are not enjoyed: blegch!</p><p>So why isnt this the most popular opiate replacement the legal drug world has ever seen? Because it is gross and it is hard to figure out what supplier is good or bad. They all look the same. Nor is it as heavenly and ultimately euphoric as opiates. Search online and youll see what I mean. The plant is coming from Thailand(?)/Indonesia and some even report growing clones in India, so how are we supposed to know whats good, or even how to pronounce its name properly? It seems like a lot of websites are tapping the same suppliers but Im not sure. Ive tried two sites and I like one, but Im still wondering if there is something better out there. I've had better/worse batches.</p><p>A little about Kratom preference and tea: Okay, so gross isnt the best way to describe the flavor of Kratom, especially the tea, and I feel bad for being misleading for the sake of humor. I'll explain more later about powdered Kratom. The Kratom tea is actually quite tolerable, its harshness comes from being bitter which is easy to tolerate. If you ask me though, the tea is less effective. There are other things about the tea I dont prefer as well. If you make it as a tea, you are talking about spending a good hour or so brewing it + waiting for it to cool. As a general rule: the darker the tea the better, that means plenty of infused sediment has collected. I've noticed the last sips of my best tea to be silty, with a slight numbing sensation, the coolest thing about the tea. I have the best luck with multiple infusions, pouring each into one separate pot to simmer down. A pan helps to make it simmer faster but it can be difficult to pour. When I do make the tea I try to have a 'hot pot' or electric kettle on hand to quickly boil water, it saves me a good half hour.</p><p>My method: Okay, so Ive tried all that but I just havent found the tea to be as effective to pull the good stuff out of the Kratom. It's still good and provides a nice, warm experience, but I end up wasting a decent amount of time and product if Im just looking to get fucked up. Im not sure if water solubility is an issue or what, but lately Ive decided to stop wasting my time with the tea and use the powder.  With many powders, I find that toss n wash is the way to go.</p><p>With Kratom, toss n wash is not the simplest process because the powder is so fine. I notice as I mix water with powder many dry chunks are in the water and they are hard to stir into solution. No matter how much I drink to wash down the powder I still have grainy remnants left in my throat after, which is horribly uncomfortable. I've tried soda and drinking plenty of water but I can't seem to get the grains to wash down which triggers the most unpleasant reaction of reflex. The only way to really clear out the grainy stuff is to do a nice big cough, which for me, comes out as a loud powdery gag (where I derived my usage of the word gross). There is a way around this and it is the only sure-fire way I can dose myself on Kratom in less than 5 minutes with any desired amount. Its very simple.</p><p>Kratom Shooters</p><p>What you need:</p><p>Kratom</p><p>A scale</p><p>A small shooter cup</p><p>Warm water</p><p>Honey</p><p>Your favorite soda</p><p>Fill your shooter cup with some of your warm water. Measure out about 3 grams of Kratom and add to your water. Pour the Kratom slowly and stir. You should have a greenish-brownish sludge going on that isnt quite readily mixing into the water. At this point, add honey. I add a little less honey than Kratom, roughly 1:1. Give yourself a decent amount because that honey is going to help make sure you dont get nasty Kratom powder stuck in your throat. Add warm water on top of this and stir to an equal consistency. I recommend drinking it fast before the Kratom gets frothy and separates, and chasing it with your favorite soda. Yesterday and today I chose Grape soda with my Kratom Shooters! The bubbles in the soda also help keep your throat safe and the flavor should mask anything else you arent drinking Kratom for.</p><p>My shooter cup holds something like five or six shots of liquid, if that helps you conceptualize, and I chose three grams of Kratom because I can dose it out easily in multiples from there. As to what kind of Kratom I use: I enjoy Bali Premium Kratom and Maeng Da Kratom, but due to expense stick with the Bali which runs about ten dollars an ounce and even less per ounce for a QP. The Maeng Da is cool because it has more of a stimulant kick with some visual tweaks but it isnt cost-effective compared to the Bali which essentially does the same thing. For the reason of cost Ive never tried the extracts.</p><p>In terms of dose three grams is where I see effects begin. Its a small kick, more caffeine-like and with a mild narcotic buzz and slight itch. Three of the Maeng Da seems to have more pronounced effects than the Bali. At six-nine grams I find the dose to be more as I described in the above paragraphs, anti-anxiety, etc. If I had the whole day to just stay buzzed Id go for the nine gram dose and let my eyes flutter more, but I wouldnt go to work that stoned on it, and if I had physical pain I wanted to manage, I would take it up twelve but Im not sure Im good for it after that. Also, at twelve grams, I am paying almost five dollars for the one dose. There does seem to be a cross-tolerance with opiates but I haven't mixed enough to say for sure.</p><p>Kratom is nice because I can replace alcohol 2-3 nights a week with it without having to worry about scoring painkillers or dealing with their potentially negative addiction effects, and saving money and hangover pain. So far it is working out to take it twice a week and I havent noticed withdrawal effects save a mild headache from daily use. I like it and will continue using with self-monitoring but so far I dont find it nearly as powerful as opiates with less of an urge to use.</p><p>There is the chance of nausea with increasing dosage. I do NOT recommend getting too sloshed on alcohol the night before. That has always made my experience uncomfortable and has caused nausea predictably. An empty stomach helps a lot but that can backfire. For example, while hungover on a bus from Memphis to Chicago I took Kratom powder with apple juice and got trapped in the window seat by a five hundred pound woman, without a bag to barf in, oh yeah, except the one I put my lunch in. So, was it my empty stomach or my empty mind for having decided to down Kratom under such unpredictable circumstances?</p>",
 "year": "2010",
 "id": "85592",
 "gender": "Male",
 "age": "23",
 "timestamp": "2011-01-09T08:00:00.000Z",
 "views": "30138",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(liquid)"
  }
 ]
}
