{
 "id": 8565,
 "title": "A Nice Alternative",
 "date": {
  "submission": "2007-09-12T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Red",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.75",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Sceletium tortuosum",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I obtained 3.5 grams of powdered plant material as a free sample from an online purchase of salvia extract.  Having never heard of the plant before I did a little research on it to figure out what the hell we should do with it.  An hour later a friend and I came to the conclusion that since our plant material was so dry that it would be a pain to injest, and that we might as well just smoke it.  I grabbed two extra large hemp papers and rolled the entiriety of the plant material up into a blunt sized joint and we walked outside and sparked it up.",
  "The taste for the first few minutes was something like the 'fopium' that sometimes hits our town.  It tasted perfumey, basically like potpourri.  This taste lasted for about five minutes, and then it obtained a very bland generic smokey taste, more than likely due to the build up of resin.  I was feeling a little light headed about halfway through it, but it was probably just because of the massive hits we were pulling of the joint.  In all it took about 15 minutes to toke between my friend and I.  It burned fast, understandbly so given that it was extremely dry.",
  "About 10 minutes after smoking the light headed, commericial middies pot feeling evolved into more of a spacey relaxed feeling.  Not different from low grade pot, however it was more involved than that.  It was like I drank a six pack or had a few shots of whiskey.  No dizziness or anything, just a fairly relaxed calming sensation.  My heart rate was slowed and I enjoyed just sitting down and watching tv for the rest of the night even though our intention was to trip off of some salvia.  All in all it was pretty good for a freebie, something I might consider experimenting with at a later time.  Definitely better than the legal fake pot you can purchase online."
 ],
 "erowid": {
  "id": "50586",
  "citation": " Red. \"A Nice Alternative: experience with Sceletium tortuosum (Kanna) (ID 50586)\". Erowid.org. Sep 12, 2007. erowid.org/exp/50586",
  "substance": "Sceletium tortuosum (Kanna)",
  "views": "16744"
 }
}
