{
 "id": 8567,
 "title": "Codeine on an Empty Stomach!",
 "date": {
  "submission": "2000-07-14T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Charlie Brown",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "300",
    "grams": 0.3
   },
   "administration": "oral",
   "substance": "Codeine"
  }
 ],
 "report": [
  "Trust me, if you eat a LITTLE before you drink the codeine solution (it is bitter but not at all as bad as this guy says it is) you won't have a problem.  Also, once you grow used to taking it, codeine very rarely upsets your stomach unless you happen to be allergic to it (alot of ppl say that they are but are not. They are simply afraid of the nausea it can produce when first starting out with it).  I have taken far more than 300 mgs. of the stuff at a time and don't have any problems with it......and oooooooooohhhhhh what a feeling!!!!  It is a warm, cozy, calm feeling that simply cannot be produced by pot or any other drug (except for other opiates!).  It is my absolute FAVORITE drug of choice!  I get a pretty much unlimited supply of tablets containing codeine and tylenol (they are called Empacod). ",
  "Anyway, Empacod has 20 mgs. of codeine per tablet in it and that is a VERY high amount of codeine to be able to get without a script!  I just use the procedure outlined in the FAQ here in the Vaults about getting rid of the tylenol (each tab also has 500 mgs. of tylenol which they call paracetamol overseas).  The finished product is called 'jungle juice' in other countries and I LOVE IT!!!  Just drink it down and enjoy the BEST high of your life baby!!!!!!!!  And by the way, it last much longer than 1 hour, but the really EXTREME high lasts anywhere from 30  minutes to 1 hour.  I HIGHLY recommend codeine as a perfect recreational drug!"
 ],
 "erowid": {
  "id": "506",
  "citation": " Charlie Brown. \"Codeine on an Empty Stomach!: experience with Codeine (ID 506)\". Erowid.org. Jul 14, 2000. erowid.org/exp/506",
  "substance": "Codeine",
  "views": "45029"
 }
}
