{
 "id": 8568,
 "title": "Feel No Pain",
 "date": {
  "submission": "2006-05-23T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Spectrum Junky",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "15",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Methadone",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I first tried methadone at seventeen, during a rather predominant nine-month hydrocodone addiction. I had become more and more interested in opiates as my Vicodin addiction became more prevalent in my life, and wished to explore heroin at some point. I later did, as a result of the experiment detailed here. I took a pill containing ten milligrams of methadone, and half of another identical pill. This dosage was recommended by the friend who had sold them to me.",
  "The pill came on slow, unnervingly slow, until, after nearly two hours, I felt the distinctive electric crawl in the spine that tends to indicate opiate action. Within fifteen minutes I was in the grip of the most distinct euphoria I had felt to this point. I found it necessary to sit, as movement resulted more and more in vertigo and nausea. But sitting or lying down I felt perfectly numb. This wasn't the sharp pleasure of hydrocodone and alcohol, and it wasn't the general wellbeing of marijuana. Neither was it the euphoric energy of cocaine, although I felt remarkably tempted to take some of the cocaine I was holding during the high. This was the complete and total absence of pain. Mentally, physically, emotionally, psychologically free of any imaginable pain. I spent the next several hours only moving to change records. Brian Eno and Aphex Twin's ambient work went over well, as did the Velvet Underground. I believe the enjoyment had more to do with lack of emotional content in the music than anything else. it's difficult to say.",
  "The following morning I was awake with a heavy reassurance and no sign of hangover. However, within forty minutes I was sick, vomiting twice. This sickness was as bad or worse than Vicodin withdrawal. It subsided with 20mg Vicodin taken orally."
 ],
 "erowid": {
  "id": "50602",
  "citation": " Spectrum Junky. \"Feel No Pain: experience with Methadone (ID 50602)\". Erowid.org. May 23, 2006. erowid.org/exp/50602",
  "substance": "Methadone",
  "views": "28902"
 }
}
