{
 "title": "Not As Good As I Expected",
 "author": "desox",
 "citation": " desox. \"Not As Good As I Expected: experience with Morphine (ID 8575)\". Erowid.org. Oct 27, 2001. erowid.org/exp/8575",
 "substance": "Morphine",
 "bodyweight": "77 kg",
 "header": [
  "DOSE: T+ 0:00",
  "12.5 mg",
  "insufflated",
  "Morphine",
  "(ground / crushed)",
  " T+ 0:15",
  "12.5 mg",
  "insufflated",
  "Morphine",
  "(ground / crushed)",
  " T+ 1:15",
  "12.5 mg",
  "insufflated",
  "Morphine",
  "(ground / crushed)",
  " T+ 2:45",
  "12.5 mg",
  "insufflated",
  "Morphine",
  "(ground / crushed)"
 ],
 "report": "<p>I had some capsules containg very little pills of morphine. Each capsule was 100mg. Since I heard eating morphine wastes most of it since it gets destroyed in your liver but I'm not into shooting, I decided to snort some crushed up pills.</p><p>I had done some dihydrocodeine and codeine before, each time about 200mg-250mg and had drunk some poppy tea for about half a year. But because I ran out of opiates this morphine would be the first opiate since about 3 weeks, so I thought my tolerance should have dropped a lot. Someone told me I should start with 12.5mg and to take another 12.5mg if necessary.</p><p>8:30pm</p><p>I opened one capsule and crushed those little pills to a fine powder. I devided the powder in 8 parts (each 12.5mg) and snorted one. I had thought the effects would kick in immediately like it is with amphetamines, but for the first 10minutes I felt nothing. I was a bit disappointed and snorted another 12.5mg in T+15mins. About 10mins later I began to feel a light opiate feeling coming up, but nowhere near the effects of a strong poppy tea.</p><p>The feelings intensified a bit and I sat down and read some comics. After about 1hour I took another 12.5mg and another 1.5hours later another 12.5mg.  I would compare my feels to 200mg of codeine without that red face and itching stuff. Not as good as I expected but it was okay.</p><p>2:30am</p><p>I decided to go to bed, since I felt like coming down. Each time I do opiates I can hardly fall asleep. I lay in my bed half dreaming half awake, but I like that. Mostly I really fall asleep after about an hour, but this time I was in this dreamlike state for about 3 hours.</p><p>When I woke up the next day, I still felt the morphine, even my pupils were still small. Perhaps there was some kind of time-release working, despite the fact I crushed and snorted the pills. That would make it understandable why the effects weren't that good but lasted that long.</p><p>I will try eating some morphine next time, it is a waste but I have plenty of them, so I think I'll try about 60-75mg orally.</p>",
 "year": "2001",
 "id": "8575",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-10-27T07:00:00.000Z",
 "views": "56228",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "12.5 mg",
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": " T+ 0:15",
   "amount": "12.5 mg",
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "(ground / crushed)"
  },
  "2": {
   "time": " T+ 1:15",
   "amount": "12.5 mg",
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "(ground / crushed)"
  },
  "3": {
   "time": " T+ 2:45",
   "amount": "12.5 mg",
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "(ground / crushed)"
  }
 }
}
