{
 "id": 8577,
 "title": "A Godsend",
 "date": {
  "submission": "2007-08-29T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bob",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "800",
    "grams": 0.8
   },
   "administration": "oral",
   "substance": "Pregabalin",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": {
    "unit": "",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Tobacco",
   "specific": "Cigarettes"
  }
 ],
 "report": [
  "I got Lyrica prescribed to me when I got the shingles. However they are now also being issued out as a medication for nerve damage, and in some cases, pain relief. Being a somewhat avid and experienced drug user (Marijuna, alchohol, coke, ecstacy, opiates, xanax, crystal meth), I immediatley searched the internet for any recreational value after I was cured of this AWFUL sickness. I found a couple reports about its recreational value on some faq on a website. The users described the feeling as very similar to a GHB intoxication, with some similar qualities to X. Now I have never experienced GHB, but I am a big fan of X, so I decided I would try them the next morning before I headed off to school. (I know this was a stupid idea, but I HATE my fuckin school, and I have straight A's with one C so I wasn't worried about it) So the next morning I woke up at around 6:30Am, took a shower, finished some homework, ate breakfast (I had read that it is wise to take these on a full stomach) and popped eight of my 100 miligram Lyrica pills. I then went outside and smoked a cig and headed off to school.",
  "About five minutes into first period I felt pretty drunk, with a mild euphoria on top of that, similar to a mixing some beer with vicadin. It was not until about midway through 2nd period that I felt ROYALLY fucked up, and I loved it. I would not go as far to compare the euphoria off this to an ecstasy experience, but it defeintly felt wonderful. Whenever I would get up to walk around, I would have to be very careful not to stumble, and I could not write straight if my life depended on it! You would think that being this fucked up at school would cause me to worry, but I just decided to devote this day to this experience and play catch up with my schoolwork the following day. This experience lasted the whole day! I even had a difficult driving home after school, which is seven hours after I took the pills! [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "It was not until about 8pm that night that I began to feel reconnected with myself, and I went to sleep quite easily that night and had no hangover at all the next day. This was a wonderful experience and next time I do it I will be sure to add some pot with it, since I find it to intensify every drug experience."
 ],
 "erowid": {
  "id": "50637",
  "citation": " Bob. \"A Godsend: experience with Pregabalin (ID 50637)\". Erowid.org. Aug 29, 2007. erowid.org/exp/50637",
  "substance": "Pregabalin",
  "views": "30394"
 }
}
