{
 "title": "If Only I Had a Brain",
 "author": "Thinker",
 "citation": " Thinker. \"If Only I Had a Brain: experience with Mushrooms (P. cubensis) (ID 8578)\". Erowid.org. Jun 30, 2005. erowid.org/exp/8578",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "report": "<p>I was just sitting there playing around with my computer when my roommate (who does not do any drugs) was called and asked if he could get any shrooms.  After some searching he found out that there was some good stuff going around.  My other roommate and I decided to go in on an 1/8th and split that just for kicks.</p><p>So there we were, in our apartment, safe, comfortable, and with a designated baby sitter for us.  It was around 11pm when we took the shrooms, chewing them up real good and letting them dissolve.  We then decided to watch the Sopranos just to pass the time and wait for the inevitable to come.  After about 30 minutes I started noticing in my peripheral visions that glow and somewhat growing of the surroundings.  But when looking at them directly it returned to normal.  About 15 minutes later is when it all started to kick in real good.  Our apartment was well equipped for our journey.  Having 3 computers in our living room, all having some type of trippy screen saver or desktop running on them.  It was a feast for the eyes. </p><p>My tripping roommate and I decided to take a walk around the neighborhood to see what interesting things we would find.  Everything seemed alive, breathing in and out.  The trees, the sky, cars, you named it was alive to us.  This only being about an hour into our trip I was still able to control it pretty easy.  Before returning to the safety of our apartment I noticed a bush just down the stairs from where we lived.  This bush was not only breathing it was turning all different colors.  It was so beautiful I stared at it for a good 10 minutes.  By that time the outside world had taken on a mind of its own and it started being a little freaky.  So we retreated back to our safe haven. </p><p>My sober roommate was watching Any Given Sunday on the TV so we decided to watch that for a little while.  I was getting very good visuals and Al Pacino was a fucking hoot to watch,  He was talking out of his eyes.  Not where his eyes would normally be, but where his mouth was, he had eyes there, and they were talking.  Fucking funny shit.  We also had a ferret to play with which was very cool, he felt as if he were made out of Jell-O, but furry and soft. </p><p>This is where the shrooms take over and I am along for the ride.  I was sitting in my chair thinking, and all of a sudden I was not at my apartment anymore.  I didnt know where I was, or what I had done.  I didnt realize that I had taken shrooms, and if you would have asked me anything I would have not been able to answer you.  From what I can remember it seemed like I was strapped to a table, my feet and hands were bound, so I couldnt move at all.  Then the voices and the smell of a hospital came.  People were telling me that if I didnt throw up they would have to operate.  I was starting to freak out.  I was telling myself to stay calm, stay calm.  Then I would feel better, but only for about a minute.  Then the voices came back.  This time they said I would die if I didnt make an effort (effort for what I didnt know)  By this time I thought that I passed out or something and my roommate had taken me to the hospital.  I could feel myself pissing on me (to find out later that was not the case), It felt that I was dying. I could feel them taking my blood pressure on my arm.  I could feel every pounding of my heart, which felt like it was going to explode.  All this time my sober roommate was telling me to stay calm, its only the shrooms, I really wanted to believe him but everything seemed so real.</p><p>He then thought that putting me on the computer and trying to make me play a game or something would do me some good.  So what did he start up, Counter-Strike of all things.  As soon as it loaded I heard the gun shots ringing away.  I had very bad tunnel vision, seemed like the light at the end of the tunnel was my life and if it went out I would be dead.  Then I saw an image of a team mate getting shot in the head and his head exploding.  That really put me over the edge, I threw the headphones off and was in the need for emotional and physical support, so my roommate gave me a hug.  That was the only time I felt safe.  I knew that if there was someone there hugging me that meant I was still in this world and had not died or something.  After an hour or so of feeling very scared and needing a hug every few minutes, I was starting to come down.  I had to be reassured by my roommate that I was at home and not at the hospital. Even though I saw all the things in our apartment, I was sure that I was somewhere else.  I then sat down falling in and out of this shroom induced world.  Saying to myself I am at home, I am at home, but I still felt that I was somewhere else.  Finally at around 4 am I was able to take control of it again.  I was curled up in a ball with a blanket around me.  At last I felt safe and happy again.  The nightmare was over.</p><p>My other roommate that was tripping did not have this out of body experience as I did.  I have come to realize that I am a little more sensitive to shrooms than most.  Having never taken more than 2 grams, I am able to always have very intense visuals and out of body experiences, but never to the point I was frightened for my life.  So my advice for those who like to take 4+ grams and have an intense trip is to prepare mentally for your trip, so when you get to that other plain of existence you will be able to control to some extent what you feel, hear, smell, and think about.  I know shrooms can be a very good tool to get to know your inner self, but always be prepared for the bad to happen and to have a good friend that is not on anything to watch you and help you if need be. Cause you never know what your inner self whats to show you.</p>",
 "year": "2001",
 "id": "8578",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-06-30T07:00:00.000Z",
 "views": "2921",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ]
}
