{
 "title": "A Teaspoon a Day",
 "author": "Rocket",
 "citation": " Rocket. \"A Teaspoon a Day: experience with 2C-I & Cannabis (ID 85794)\". Erowid.org. Aug 22, 2010. erowid.org/exp/85794",
 "substance": "2C-I & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "16 mg",
   "oral",
   "2C-I",
   "(liquid)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Very brief summary</p><p>===================</p><p>To dose, 500mg was mixed with 250ml water making 1ml solution contain 2ml 2c-i.</p><p>5ml = teaspoon = 10mg 2ci</p><p>Dose taken on empty stomach was about 15-17mg.</p><p>Come up apparent after 1 hour and intensifies at the +2-3h mark.</p><p>Pupils were dilated so colors were vivid and vibrant, but we experienced NO visuals except for very minor patterning and trails.</p><p>Music becomes significant, pulling my attention and emotions with it and drastically affecting the mindset/mood.</p><p>Social anxiety is diminished and confidence increases significantly.</p><p>Socializing becomes desirable and easy. I can see this being excellent for therapy or just dosing and going out somewhere quiet to meet people.</p><p>Trip ends cleanly with mental fatigue.</p><p>Not many physical side effects to report other than maybe gas and a mildly upset stomach, but that may not have been related to the 2c-i in my case.</p><p>I personally enjoyed the experience and learned a lot about myself. I feel 2c-i is underrated.</p><p>Dosing 2C-I</p><p>===================</p><p>500mg 2ci powder arrives.</p><p>240ml of DISTILLED water measured out. I always use a graduated cylinder and NOT a measuring cup. They are not accurate for my purpose. Tap water will work but I go with distilled for reliability and long term storage. Supermarkets/pharmacies sell this.</p><p>10ml mix of lemon juice and alcohol (40%) measured out. This step is not necessary and one may use 100% distilled water. Acidifying the water helps the 2ci dissolve but it dissolves readily in water regardless.</p><p>500mg powder placed in this 250ml mixture and stirred. Everything dissolved. No heat used. I chose this quantity of solution because 5ml (teaspoon) of solution will provide 10mg of 2ci. Not too accurate, but it worked beautifully.</p><p>Solution placed into 2 small bottles, labeled appropriately (always do this!) and one thrown into the fridge. For long term storage, freeze this solution.</p><p>Taste Test</p><p>===============</p><p>2 male subjects, myself and Bbb, same age.</p><p>I am 160-170lb and 5' 9</p><p>Bbb is 150-160lb and 5' 5</p><p>Neither has tripped in the prior 2 weeks but are experienced (though not with any 2C-* compound.) Cannabis (super lemon haze and 'some indica shit') and tobacco were smoked on a regular basis before the trip but both subjects sober, albeit physically tired from lack of sleep.</p><p>Subjects met in subject Bbb's highly controlled environment (his trashed living room). I ingested ~1.5 teaspoons, Bbb a little under 2 teaspoons.</p><p>+40 mins - Something clicks. Something is different, but not quiet discernible.</p><p>+60 mins - I go into a familiar psychedelic mindset. Normally, humans are intoxicated with worries, their past, future, etc, but on a psychedelic, these lose significance to the Here & Now. I call THIS feeling being 'sober.' It is one I experience after the peak of a mushroom trip for instance.</p><p>Bbb escalated quickly to a 'tripping balls' state in which he struggled not to let his ego die, but throughout the trip regained enough composure to walk and talk with sober people and handle basic tasks.</p><p>+2 hours - Disappointed with the lack of visuals which both Bbb and I now no longer expect will come, but otherwise in an excellent mood. Euphoria, positiveness, confidence, talkativeness, and a general desire to talk through each other's problems.</p><p>Recurring tripping themes for me include the Drug War, the legal system, hedonism, the idea of marriage (and my own marriage,) marketing and advertising, selling and commerce, non verbal communication, and the general exchange of services and goods, corporate hierarchy and hierarchies and class systems in general.</p><p>The Metaphysics of Quality is also a recurring theme in my trip. Food that I would normally find 'good' is judged harshly. The difference between a $15 burger and a $1 burger becomes very apparent for instance. Every ingredient and spice used is obvious and deserving of equal scrutiny.  I notice this 'quality' issue arises for music and just about any product, not just food.</p><p>Bbb's recurring themes generally center around religion, girls, friends, relationships, subliminal messages and non verbal communication, marketing, and IT in general, among others.</p><p>At this point Bbb and I discuss life for a good 6 hours, smoking tobacco and cannabis liberally. Music has a significant impact on how we feel towards the conversation. An emotional song brings back emotional memories (but not necessarily in a negative way) and a high energy song brings on a sense of power.</p><p>Aaa and Bbb had not many stomach issues except for minor bloating which may be the result of food from the day before and/or due to the excessive tobacco smoked.</p><p>Afterthoughts</p><p>==============</p><p>I weighed out the baggie of 500mg to 0.7g. I took ALL the powder out and weighed the baggie again to 0.2g. So the 500mg was accurate in my case. If a chem supplier had sent me a little extra, my entire dosing system would be off.</p><p>2c-i is excellent for repairing relationships and the 'candyflip (LSD+MDMA)' comparison I read sometimes is somewhat accurate. For my next trip, I plan on making a list of problem areas in my life during the come up that I wish to address.  This time I just went with the flow.</p><p>I ate while tripping, but I would have enjoyed this substance more if I had food in my stomach from the beginning.</p><p>Less is more. I do not feel the need to feel 'fucked up' or kill my ego to experience a psychedelic. My most insightful trips have been low doses taken in social situations.</p>",
 "year": "2010",
 "id": "85794",
 "gender": "Male",
 "age": "24",
 "timestamp": "2010-08-22T07:00:00.000Z",
 "views": "3009"
}
