{
 "id": 8581,
 "title": "Very Pleased",
 "date": {
  "submission": "2007-01-09T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "HyPNoTiQ",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "15"
   },
   "administration": "oral",
   "substance": "Zolpidem",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Well, first off, my mom is a nurse and has access to all those perscription drugs the companys send as samples. I have pretty severe insomnia but my mom won't let me get anything perscribed as she knows the effects of Ambien and Lunesta(which i've also used). I did convince her to give me some of both of those to help me sleep since it was messing with my grades at school, as I would frequently sleep during class. I have a few descriptions of what happens on Ambien in different doses to me.",
  "First:",
  "I took one 10mg Ambien with a glass of water on an empty stomach. I felt the effects within about 5 minutes. The initial onset was a feeling of relaxation and my body felt tired. Then after about 20 minutes I was really starting to feel it. I felt very sleepy and was relaxed if I was sitting down. After about 45 minutes I was more or less drunk off of it. It's a very intoxicating drug. I get dizzy and a state of euphoria. My mind isn't really there during the whole thing. I just sort of act and don't think about it. I found this out by trying to light up a joint in front of my mom, she didn't like that. After about an hour and half I gave in and went to sleep. I slept very well that night and the pill wears off well and I don't feel very different the next day.",
  "Now for a bad story.",
  "One time I was bored and decided to do what I thought would be funner than 10mg or 20mg which I had done inbetween these two storys. The 20mg just intensified the effects, it probably tripled the intoxicated feeling.",
  "So, I decided that I would take 60mg of Ambien. I spent 15 minutes trying to get the pills out of their little case thing the samples come in. Then popped them with water on an empty stomach again. I really don't remember anything about it but I know a few things.",
  "I took them around 12:00 and most likely before 12:30 I was out. Completely passed out. I remember coming to during first hour of school at about 8:30. I was playing baseketball with someone I didn't know. That was about a minute of what I remember. The next thing I remember is around 9:00 I woke up in second hour when a friend smacked my head.",
  "Later that day I found out from my girlfriend that I had called her numerous times in the early hours of the morning and left voicemails that sounded very intoxicated with random jabbering. Then I found out that in the morning when my mom had tried to wake me up she had alot of difficulty with me. I don't remember any of it at all. She also said that I was wobbling around the house looking for things I didn't need.",
  "I later tried taking 40mg on a night that I wouldn't have school to worry about. I don't remember anything here either. I just went straight to sleep and woke up.",
  "I would not reccomend taking more than 20-30mg of this unless your alot bigger than me.",
  "Now, it's 11:15 and i'm typing this report up. I'm bored so i'm going to take approximently 15mg of ambien and stay with the report for a few hours to try to explain the effects in more detail.",
  "T:11:20 PM - 15mg Ambien down the hatch. I ate some soup at around 10:00-10:30 so i'm not completely empty. I poped in the movie titanic to gimme somethin to do.",
  "T:11:30 PM - It's only 10 minutes in and I can already feel that i'm getting tired. I also noticed that sounds seem louder and more clearer for some reason.",
  "T:12:40 AM - I have been feeling pretty good and the dizzy feeling is more like when I move my head my vision has a little bit of lag and takes a few seconds to catch up. I felt as though I didn't take enough and don't have anymore to take so I went upstairs and took a few swigs of Arbor Mist to try and up the effects a little.",
  "T:1:40 AM - Well, the alcohol made me pretty tired and i've had enough fun for tonight. I'm going to check out and go to sleep.",
  "I'm not going to bother to type anything about tomorrow. I'm sure i'll feel as normal as I can. Hope this helps anyone trying Ambien. It's a fun drug but there are better things."
 ],
 "erowid": {
  "id": "50673",
  "citation": " HyPNoTiQ. \"Very Pleased: experience with Zolpidem (Ambien) (ID 50673)\". Erowid.org. Jan 9, 2007. erowid.org/exp/50673",
  "substance": "Zolpidem (Ambien)",
  "views": "37415"
 }
}
