{
 "title": "Non-Allergic Adverse Reaction",
 "author": "Boss Lok",
 "citation": " Boss Lok. \"Non-Allergic Adverse Reaction: experience with Spice and Synthetic Cannabinoids ('Drill') (ID 85853)\". Erowid.org. Oct 12, 2010. erowid.org/exp/85853",
 "substance": "Spice and Synthetic Cannabinoids ('Drill')",
 "bodyweight": "190 lb",
 "report": "<p>Male: 25  Weight: ~190 Height: 62 Experienced Cannabis Smoker</p><p>Substance: Spice Products, Specifically Drill</p><p>Dose: 2 hits (lungs @  capacity) 5-10 minutes apart every 12 hours</p><p>I have a misplaced nerve cluster in my lower back, when it gets aggravated; things like walking become very difficult.  OTC painkillers dont cut into the pain; Codeine handles it but leaves me unable to perform my work or hobbies to my satisfaction.  Cannabis has been a preferred alternative, but the aspect of breaking the law always leaves a somewhat bittersweet taste in my mouth.  I heard of an as of now legal alternative referred to as K2, Spice, or Herbal Mixes.  The specific blend I got was called Drill, I choose it as it was referred to me as a sativa like blend.</p><p>Smoking it initially was like a dream come true, I wasnt breaking the law, my back pain was in check, and unlike with cannabis I was completely clear headed although very stoned.  I waited 5-10 minutes between each hit, and held each for only 10 seconds.  Each hit filled my lungs to  capacity; while the taste wasnt pleasurable it wasnt bad.  I would relate the experience to stems.  The high would last 3-4 hours, but my pain would be almost gone for 8 and manageable for 12 hours.</p><p>I had no problems with anxiety, as I did not overdo it, but hydrating seemed to be very important to a positive experience.  I had great experiences the first two days with the product, having more energy and being less faded in my day-to-day duties.  My 5th time smoking the herbal blend though things were different.</p><p>I used the same dosage as before, I reached similar results although feeling less stoned, my pain was still relieved, so a tolerance was building but I still reached my desired effect.  Then 1 hours into the experience my stomach felt more upset than just the feeling of something new.  10 minutes later I experienced thick vomit darker in color than it should have been based on my diet it had a strange low carpet texture (the cheap kind that comes in cheap apartments).  This was made worse by the high, as it felt like I vomited this in slow motion; it came out slower than watery vomit, but the process felt like a ten-minute ordeal (in reality under a minute).  Knowing my body and my reactions to things quite well, I can say with confidence that this was a toxic reaction to something in the blend, most likely to do with a build up of JWH-018 and other chemicals in my system.  While I experienced no other adverse reactions that I wasnt expecting from my experience with cannabis, this reaction leads me to believe that spice may be very harmful to our bodies.  (As a note, my diet has remained the same for quite some time, and no other drugs legal or otherwise were in my system  this was planned to see the effects of spice on me personally)</p><p>This brings me great dismay to say that I will not use this ever again, and I do not recommend its use recreationally.  It is clearly a very potent chemical that has some benefit, but I would place it in the same category as methadone, a substance thats risks outweigh its benefits for most people.  That being said if you do use this product please do not drive as it had a greater affect on my depth perception than I would admit while stoned on it.  Legalizing or making cannabis medically available would cut down on experiences like this and abuse of narcotic drugs (prescribed or not).  I feel cannabis is considered a gateway drug because of its illegality, after breaking the law for long enough with cannabis, one may grow to feel comfortable breaking the law in other ways, if the 'I'm doing something bad' thrill was gone, I feel that it's use would drop in people who dont need it.</p>",
 "year": "2010",
 "id": "85853",
 "gender": "Male",
 "age": "25",
 "timestamp": "2010-10-12T07:00:00.000Z",
 "views": "5058",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  }
 }
}
