{
 "title": "A Magical Drunken Trip",
 "author": "DW",
 "citation": " DW. \"A Magical Drunken Trip: experience with Mushrooms & Alcohol  (ID 85878)\". Erowid.org. Jun 14, 2010. erowid.org/exp/85878",
 "substance": "Mushrooms & Alcohol ",
 "bodyweight": "150 lb",
 "header": [
  "DOSE: T+ 0:00",
  "750 ml",
  "oral",
  "Alcohol - Hard",
  "(liquid)",
  " T+ 2:00",
  "3.5 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>[Erowid Note: 1/5 of a gallon (750ml) of hard liquor is considered an extremely high dose.]</p><p>The day started off by me and one of my friends doing shots from a bottle of vodka. We continued to take shots until I was pretty buzzed. I ended up drinking about a fifth of vodka to myself. I was to the point where I was 'blacked out' and don't remember much of what happened an hour after this.</p><p>We had previously bought some magic mushrooms to take that night. These were very good mushrooms and the caps were gold in color. We ate them around 2 hours after the drinking. I barely remember eating them and even forget that I ate them. But then once they hit me I got a little scared and wasn't sure what was happening. But my friends calmed me down and I began to trip.</p><p>Just as a background, I have taken shrooms at least 8 times before this. I knew what to expect and how to handle it. I remember laying in my friends living room and looking at the ceiling and the lines in it looked as if they were waving and moving back and forth. I stared at the ceiling for quite some time and was very entertained. Then I seen a wooden statue that had been carved to look like a Native American. I looked at the face and I could have swore that it was trying to talk to me and I thought it was evil. I had to turn it towards the wall because I couldn't handle looking at it.</p><p>I liked the experience with alcohol due to the fact that it increased the effect and also I felt the shrooms a lot sooner than I ever had. But I was kind of mad the next day because I didn't remember much and kept hearing new things from my friends that I did that night. But overall it was one of my favorite trips.</p>",
 "year": "2010",
 "id": "85878",
 "gender": "Male",
 "age": "19",
 "timestamp": "2010-06-14T07:00:00.000Z",
 "views": "3482",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "750 ml",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
