{
 "title": "Very Pleasant",
 "author": "MDMAok",
 "citation": " MDMAok. \"Very Pleasant: experience with MDAI (ID 85907)\". Erowid.org. Jul 22, 2010. erowid.org/exp/85907",
 "substance": "MDAI",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "MDAI",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I got the MDAI mail order from one of many suppliers on the net who deliver by post in the UK. The gram was packaged very professionally, and the label declared there was enough plant food inside for 10 doses. I took one tenth the first time and two tenths the second. I suspected that the larger dose would be needed as I have quite a tolerance for serotonin interferers, and I am only one year into what I expect to be at least two years of near abstinence to get my receptors back into shape. These were my first two hits in a few months.</p><p>The bigger dose did make me rush; it came on an hour after I dropped. I had eaten. It was more intense  that was a surprise  than MDMA, but only lasted a few minutes. I has to sit down  I am sixty but after that it settled into what I had been led to expect, a less speedy and less euphoric hit than MDMA.  It was very pleasant.  My heart rate and blood pressure were up, but not as much as on MDMA, as I had hoped. But I shall take 150mg next time rather than 200mg. I am conscious of being at the upper age limit for any drug that has these effects and I chose MDAI because I did not want to dance all night.</p><p>I would describe it as a subtle MDMA clone. I like it. I do not think it will become the drug du jour because kids  anyone under forty  probably want something speedier. Im happy to sit and chill. I shall buy some to stash while it is legal.</p>",
 "year": "2010",
 "id": "85907",
 "gender": "Male",
 "age": "60",
 "timestamp": "2010-07-22T07:00:00.000Z",
 "views": "20817",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "(powder / crystals)"
  }
 ]
}
