{
 "id": 8591,
 "title": "Preliminary Reconnaisance",
 "date": {
  "submission": "2006-12-06T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Gazza",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 g",
   "administration": "oral",
   "substance": "Cacti",
   "form": "ground/crushed",
   "specific": "T. peruvianus"
  }
 ],
 "report": [
  "Subjects condition:",
  "Subject 1: Took it very easy on the beer and smokes last night so relatively good. Slightly 'just got up' feeling if anything.",
  "Subject 2: Mild Headache and slightly unsettled stomach.",
  "Time - 13:00",
  "T+0mins",
  "Weve just measured out 25gms each of Peruvian Torch powder. It looks like a lot of powder to eat Were going to try taking spoonfuls then chasing with water/blackcurrant squash.",
  "T+30mins",
  "After a failed attempt at consuming teaspoons full of the powder, the biggest problem with which was avoidance of inhalation of the fine dust, subject 2 hit upon the idea of form the powder into a paste, then consuming small amounts of the paste followed by water. This method was successful. So far. We now await a sign.",
  "T+1hr 30mins",
  "Both subjects report feeling slightly altered. Vision slightly altered though nothing definitive. Confident that the initial effects are being felt. Stomach feeling a little uncomfortable though nothing unbearable. More waves of suggestion whilst writing this.",
  "T+2hr 10mins",
  "Both in good spirits though no significant progress. I feel some MDMA like effects  constant grin (especially when watching Bill Hicks), nervous excitement, the yawns.",
  "T+2hr 55mins",
  "No change  Slight MDMA like effects thought nothing spectacular. Going for a walk to the shops.",
  "T+3hrs 30min",
  "Pleasant walk on a beautifully bright winters day. Slightly heightened awareness of colours and happily content with life.",
  "T+5hrs",
  "Both feeling minor buzz but not tripping per se. Having a joint to see what happens. All cool though and still enjoying the day.",
  "T+15hrs 20mins",
  "Going to bed now after a fair few joints, and a few beers. Still quite up but dont want to have to write off tomorrow totally. All in all a very pleasant day, akin to taking  an MDMA pill which lasts for 15 hours (pretty cool!). Will try upping the dose to 40  50 gms next time."
 ],
 "erowid": {
  "id": "50718",
  "citation": " Gazza. \"Preliminary Reconnaisance: experience with Cacti - T. peruvianus (ID 50718)\". Erowid.org. Dec 6, 2006. erowid.org/exp/50718",
  "substance": "Cacti - T. peruvianus",
  "views": "3840"
 }
}
