{
 "title": "Half Decent Experience",
 "author": "Danielle",
 "citation": " Danielle. \"Half Decent Experience: experience with 2C-P (ID 85926)\". Erowid.org. Oct 4, 2010. erowid.org/exp/85926",
 "substance": "2C-P",
 "bodyweight": "109 lb",
 "report": [
  "<p>I have had many experiences with psychedelics, including large doses of mushrooms, 10-strips of LSD, 2C-E, 2C-I, DMT, 4-AcO-DET, and 4-AcO-DMT.  I had experienced quite a bit of nausea on the come-up with the other 2C chemicals I had tried, but I wasnt worried.  I had the house to myself, and I was in a very good state of mind.  I had not taken any pharmaceuticals or any other chemicals that day.  This includes alcohol, nicotine, and caffeine. ",
  "My friend, who sent me 200mg 2C-P, had suggested Intrarectal Administration.  He told me that this causes the greatest rush, increases duration, and preserves your supply.  I had never plugged a chemical before, and this was the first time.",
  "I woke up at about 10AM, and shortly after, I dissolved 12mg 2C-P in some water, sucked it into a syringe, and plugged it. ",
  "+ 0:45:  Im noticing some pretty intense physical symptoms of anxiety, similar to what I felt with 2C-E and 2C-I, but this is much more uncomfortable.  I have no mental symptoms of anxiety, only physical symptoms, mostly in my stomach. ",
  "+ 1:00:  Feeling quite nauseas.  Spend about 20 minutes throwing up, and then I feel better.  Im extremely cold though, but I cant seem to stop sweating.  Its 74F in the house, which is usually hotter than I prefer, but I still find myself shivering and sweating underneath a few blankets.  I take one hit of cannabis.",
  "+1:45:  Still feeling anxious.  My stomach is somewhat unhappy, but not bothering me too much.  The physical symptoms of anxiety are getting quite severe now, so I decide a beer will help me calm down.  Alcohol acts on the GABA system, so it helps quite well with anxiety, and did so for both my 2C-I and 2C-E experiences.  I took one sip of beer, and found myself puking again.  Only lasted about 2 minutes this time, and then I felt OK.",
  "+2:00:  Turn on Bonnaroo 2004, and start really getting into the music.  Visuals are starting to become noticeable, and soon I find myself dancing around the living room with jam music blasting.  Im starting to feel really intense MDMA-like serotonergic rushes. ",
  "+2:45:  After dancing non stop for 45 minutes, Im exhausted, and sit down.  Music is sounding absolutely wonderful, and even though Im lying down, I cant stop my hands from moving to the music.  Physical symptoms of anxiety are coming back, and theyre starting to manifest themselves in actual mental anxiety; something that never happened with the other 2C chemicals.  I decide to give the rest of my beer another shot.  It stays down easily this time, and tastes really great.  Mental anxiety fades after about 10 minutes, and physical anxiety is reduced, but not eliminated.  Visuals are getting quite intense now, and everything seems to be changing size, and distance from me.  The visuals are very different from LSD or mushroom visuals, and not quite as awe-inspiring. ",
  "+3:30:  Ive reached my peak, and the visuals are very intense, but the MDMA-like euphoria has gone away.  I get my dog, another beer, and head outside.  Its 97F outside, and extremely humid.  Since I was so incredibly cold inside, the heat is quite refreshing, but the humidity begins to bother me.  My whole body is becoming sticky, and Im getting annoyed.  I go sit down on the grass with my dog and my beer and stare at the lake.  The lake looks like glass, and the reflection of the houses in the lake looks like oil paintings. Its extraordinarily beautiful.  The grass is flowing like a fast-moving river, and Im feeling quite amazing now.",
  "+4:30: Still sitting on the grass with my dog.  The anxiety has gone away completely, both mental and physical.  Its now 2:30PM and I havent eaten anything.  I go inside, warm up some left-overs, and eat.  Eating feels like a chore.  The textures are unpleasant, and the tastes are quite bland.  I force food down, because I want my body to have some calories to run on.  After that, I take 2 more hits of cannabis.",
  "+5:00:  Head back outside with my dog.  I lie down on the grass, and watch the clouds flow all over the sky.  Im feeling completely still.  Im not getting any MDMA-like euphoria, but I am feeling really good.  I feel like life has been paused at the most beautiful moment possible, and Im happy to lay there and watch it.",
  "+10:00:  Still lying on the grass, feeling quite awesome.  Its 8:00PM and the sun is setting.  The clouds are looking even more beautiful than ever, and the heat has died down to the 80s.  Life is great, and I have no worries.",
  "+12:00:  I head inside, turn on Comedy Central, and find it absolutely hysterical.  Im laughing so hard tears are streaming down my face, and down my neck.  I havent laughed this hard in months, and Im loving it.",
  "+14:00:  I go upstairs to my bedroom, turn on the Grateful Dead, and surf the web.  Visuals are still quite intense, and Im having a lot of difficulty reading/typing.",
  "+15:00:  Its 1AM, and my physical anxiety symptoms are coming back.  My head is starting to hurt a bit, but nothing too serious.  Its mostly that anxious feeling in my stomach thats bothering me.  I decide its time to go to sleep, but Ive still got some intense residual stimulation.  I take 50mg Benadryl, and 5mg Ambien.  I go lie down, and my field of vision explodes with CEVs.  Theyre quite distracting, and I realize I wont get to sleep soon, but I keep trying.",
  "+17:00:  Look up at the clock.  Its 3AM, and Im still awake, but extremely intoxicated by the Ambien.  I fall asleep shortly after, and sleep until 3PM the next day. ",
  "I didnt experience any hang-over symptoms.  I felt quite great the next day, but no more so than I would any other morning.",
  "This is definitely a strange chemical, and worth experiencing once, but theres no way Ill be doing it again without some type of benzo or opiate for the anxiety.  The trip wasnt very introspective at all.  I spent half the trip staring at the clouds, and feeling still.  Its nice to be still every once in a while, so I definitely enjoyed it.  The experience was nowhere near as significant as LSD, MDMA, Mushrooms, DMT, or 4-AcO-DMT.  The MDMA type euphoria only seemed to last about an hour and a half.  Im wondering if maybe it was a fluke.  I really have no idea.",
  "All in all, it was an alright experience.  The trip lasted about 17 hours, but at least 4 of those hours were moderately to severely unpleasant.  Still, that leaves 13 hours of awesomeness.  Good luck to all who experiment with this chemical.  Its a long ride.</p>"
 ],
 "year": "2010",
 "id": "85926",
 "gender": "Female",
 "age": "21",
 "views": "6048",
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "rectal",
   "substance": "2C-P",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2010-10-04T07:00:00.000Z"
}
