{
 "title": "About as Much Fun as a Caffeine Overdose",
 "author": "hyacinthus",
 "citation": " hyacinthus. \"About as Much Fun as a Caffeine Overdose: experience with Yohimbe (ID 8597)\". Erowid.org. Aug 7, 2001. erowid.org/exp/8597",
 "substance": "Yohimbe",
 "bodyweight": "240 lb",
 "report": [
  "<p>I am currently having one of the most wretched drug experiences of my life, thanks to yohimbe.",
  "First, a little background; I'm a sufferer of clinical depression, and I'm on a regimen of drugs which seriously depresses my sexual response.  Having heard that yohimbe could combat this side-effect, I purchased a quantity of yohimbe bark from a local herb-shop and tried it out.",
  "I made a tea by placing about 2 tablespoons of the bark in a tea ball and steeping it in boiling hot water for 5-10 minutes.  The tea, sweetened with honey, was drinkable and not particularly foul tasting.  I noticed the effects within an hour; I felt sped up, uncomfortable, and a little nauseous.  Paradoxically, I also felt like lying down (I wish I felt that way now.)",
  "It's some eight hours later and I'm completely unable to go to sleep; the normally cheerful prospect of lying down in bed with my boyfriend is impossible to contemplate, because I can't sit still for more than five minutes and I don't want to wake him up.  I resorted to alcohol, the only depressant I had on hand, to try to get to sleep, but it was no use.  I've lost track of the number of times I've had to get up to pee; evidently this stuff exerts a diuretic effect.  Also, I notice a mydriatic effect; my pupils are wide and dilated.  The effect on my mood has not been pleasant, either; I've found myself dwelling on unpleasant things and experiencing something like panic.",
  "It came as little consolation that I was, in fact, able to have sex; I got little pleasure from it.",
  "I may try this again at a significantly lower dosage, because it did do what it was supposed to do, sort of.  But right now it's looking as though I'm not to get a wink of sleep before sunrise, and that's a depressing thought.</p>"
 ],
 "year": "2001",
 "id": "8597",
 "gender": "Male",
 "views": "25452",
 "dose": [
  {
   "time": "0",
   "amount": "2 Tbsp",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "(tea)"
  }
 ],
 "submissionDate": "2001-08-07T07:00:00.000Z"
}
