{
 "title": "Overwhelmed by the Psychedelic Soup",
 "author": "Ulwarth",
 "citation": " Ulwarth. \"Overwhelmed by the Psychedelic Soup: experience with 2C-B (ID 8598)\". Erowid.org. Aug 7, 2001. erowid.org/exp/8598",
 "substance": "2C-B",
 "bodyweight": "165 lb",
 "report": "<p>   Having been unsatisfied with the effects of previous oral doses of 20mg and 30mg of 2C-B, my girlfriend and I snorted 23mg of 2C-B.  Onset was sudden, making me feel 'up' within seconds.  Within minutes I found myself overwhelmed by the people, lights, and music - we were at a very crowded rave, a spot that turned out to be a poor choice for this experiment.</p><p>   We retreated out a gap in the tent to try to get fresh air.  Ten minutes into the experience we both found ourselves totally overwhelmed.  All of my senses had become suffused in a psychedelic soup.  Sights and sounds bled into one another.  Sense of identity and ego were completely lost, and I stared around trying to find a sight that I could cling to.  I finally gave up as I found myself staring up at the sky, and even it was completely obscured by colorful patterns.</p><p>   The visuals were very 'digital' compared to LSD (which I am very familiar with) or mushrooms.  Primarily there was a repeating shape that had a sharp-edged, alien science fiction type look to it.  I found myself thinking of corrugated metal, barbed wire, the greek letter Omega, or the biohazard symbol.  Later, my girlfriend drew the patterns she saw for me, which were similar but slightly different - she described it as looking more like circuitboard traces or jigsaw puzzle pieces.  The visuals moved and shifted, and covered absolutely everything.  They were very colorful (red, green, and yellow most commonly) and made it next to impossible to make out anything real.  When I closed my eyes, I saw the identical pattern but more intense because it was against a black background.</p><p>   Interestingly, unlike LSD, it left my mind almost completely unclouded.  However, with my senses so overloaded, I found it hard to think about anything or even conceptualize who I was, where I was, or what I was doing.  My experience with overwhelming (or 'bad') trips on other psychedelic made it possible for me to deal with the situation without getting scared or 'freaking out', however, I almost certainly would have panicked otherwise.</p><p>   The trip was identical in intensity from about 25 minutes in until the 90 minute mark.  Approximately one hour into it I managed to get out my girlfriend's cell phone.  I spent approximately five minutes trying to see the screen well enough to see the time; it wasn't a matter of being unable to understand the numbers or being unable to think, just being able to see through the intense visuals well enough to make out the digits.</p><p>   At the 1.5 hour mark things began to ramp down pretty quickly, although it was still extremely intense.  At this point the trip started to reach a level at which it was actually very enjoyable, though still it was something that would probably better be experienced from the comfort of one's living room rather than a rave.  By the two hour mark we were down enough that we could navigate the crowd, listen to the music, etc, although the visuals were still present.  We began laughing at ourselves for having put ourselves through such a powerful trip so unexpectedly.</p><p>   At this point I felt mostly the way I did from a normal oral dose, but much more intensely.  In particular, people's motions seemed very exaggerated; people dancing looked like they were jumping all over the place, the DJ seemed to be cavorting around a lot (and I knew from past experience that he was not the type to do so), overweight people walking by seemed to be giant tubs of jello shaking all over the place.  We felt an unusual euphoria, both from having gotten past the difficult part of the experience, and from being in the 'euphoric comedown' phase of the drug.  Basic visuals were still in evidence, and everything seemed extra-pleasant.</p><p>   At the four hour mark (supposedly when the drug wears off) the party was over and I was forced to get into the car to drive home.  I felt quite odd behind the wheel (like it had been years since I had driven), but otherwise it was no problem.  We found ourselves voracious, and ate a satisfying meal of Denny's mozzarella sticks before collapsing into bed exhausted, approximately 5.5 hours after snorting the 2CB.</p><p>   I found myself particularly capable, in control, and relaxed over the next four or five days.  My girlfriend said that she felt 'more sentient' than usual, and also seemed to be in particularly good spirits for the remainder of the week.</p><p>   All in all, the first 90 minutes or so was distinctly unpleasant, but possible to deal with for someone experienced with psychedelics.  From the 2 hour point onwards it was wonderful, my best 2CB experience yet, and one of my favorite drug experiences just in general.  But the pain and difficulty of the first few hours make it doubtful that I would want to try such a stunt again, and I would hesitate to recommend it.</p>",
 "year": "2001",
 "id": "8598",
 "gender": "Male",
 "timestamp": "2001-08-07T07:00:00.000Z",
 "views": "31565",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "23 mg",
   "administration": "insufflated",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  }
 }
}
