{
 "id": 8600,
 "title": "Nodding Happily Away",
 "date": {
  "submission": "2008-01-17T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Remicks",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:30",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I have a mild tolerance to opiates - I had taken 22.5 mg of hydrocodone in solution with guifanesin (Vi-Q Tussin) 2 days previous.",
  "T+0:00",
  "I took orally (no chewing) 2 generic Tramadol pills, 50mg each for a total of 100mg. It was 8:05 PM. I hadn't eaten in 7 hours.",
  "T+0:20",
  "I began feeling a tingling/massaging sensation in the back of my head, between my ears. The sensation was very mild, but spread to my ears and neck. It wavered in and out of perceptibility.",
  "T+0:30",
  "At this point I took the third 50mg orally.",
  "T+0:30",
  "I connected my headphones to my computer and put on some My Bloody Valentine. Shoegazing is my favorite for opioid induced dazes.",
  "T+0:50",
  "I began at this point to experience some stomach discomfort. Light waves of nausea (similar to the nausea felt when taking 300mg+ of DXM) swept my body occasionally, but I did not vomit. I felt like I had to move my bowels, but couldn't.",
  "T+1:10",
  "I guess this is where the first 2 pills leveled out. I started feeling very relaxed, and in a conservatively upbeat mood. Sort of like the normal opiate feeling, but it 'meshed' better...it's hard to explain something like this feeling. It felt very natural to be this way, not 'fucked up' at all.",
  "T+2:00",
  "I had been listening to My Bloody Valentine, but at this point the music seemed very powerful, enough to put me into a daze. I just let the iTunes visualizer sweep me away.",
  "T+2:40",
  "At this point I felt very social, like I should be talking to lots of people. I signed in on all of my messaging clients and got on the phone with my girlfriend. She told me the next day that I was very slightly slurring my words - apparently I have trouble making the 's' sound. 'Stop' became 'schtop,' 'sex' became 'schecks.' Overall, I continued to feel very social.",
  "T+3:50",
  "I decided to stop talking to people and try to get to bed. I put on headphones and a bit of Dandy Warhols, turned out the lights, and tried to get to sleep.",
  "Sleep was rough. I spent the night in a dreamy daze - not exactly sure whether Im dreaming or awake, in a state between those two areas of being. I had that old 'naked in school' dream. I woke up around 6 am, unable to continue attempting to sleep. I was still feeling the Tramadol at this point. I got onto World of Warcraft and amused myself for a while. I was very open and talked to lots of people; I was very social where normally I am not.",
  "Overall, I would say Tramadol is a fun experience. I was mildly constipated for the next day or so, but nothing ex-lax couldn't fix."
 ],
 "erowid": {
  "id": "50753",
  "citation": " Remicks. \"Nodding Happily Away: experience with Tramadol (ID 50753)\". Erowid.org. Jan 17, 2008. erowid.org/exp/50753",
  "substance": "Tramadol",
  "views": "64568"
 }
}
