{
 "id": 8605,
 "title": "Nausea -- Is My Body Rejecting This?",
 "date": {
  "submission": "2006-07-05T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anony5000",
  "gender": "Female",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "4-HO-MiPT",
   "form": "capsule"
  },
  {
   "time": "4:30",
   "amount": "12.5 mg",
   "administration": "oral",
   "substance": "Meclizine",
   "form": ""
  }
 ],
 "report": [
  "Material - 20 mg miprocin (4-HO-MiPT) in a gelcap.  This is my second time using miprocin.",
  "Setting - A rock show, then my apartment.",
  "Purpose - Entertainment and exploration.",
  "+0 - I arrive at a rock show, and drop as the music starts. I eat it with a tastycake, but otherwise am on an empty stomach.",
  "+0:30 - Tryptamine alerts, a little muscle tension.",
  "+1:00 - Nothing much. I feel a little out of it, but that's it. I find this is kind of odd; miprocin normally comes on pretty fast.",
  "+1:30 - Still not tripping... A little weird, that's it.",
  "+2:00 - I finally hit a +2. +3 in 20 minutes. The show ends and I get some food and walk home. OEVs and mindfuck as per last experience. Something strange though: around the time I start tripping, very bad nausea starts to come on. The last trip I had, there was very little nausea, if any...but now it is very obvious. I am very much reminded of the horrible feelings I experience of HBWR one week ago.",
  "+3:00 - I get back to my apartment. Some friends stop over. Very sick still, it seems to be getting worse. Eating food does not help.",
  "+4:00 - Still very ill. I separate from my friends and tell them I'm not feeling well at the moment. They leave except for one who is concerned about me.",
  "+4:30 - The physical illness from this breaks me down and I start with the usual bad trip waterworks. My friend (the same one I'd phoned on HBWR) seems kind of upset, but tries to keep me sane. I can barely even talk for about a half an hour and just cling to him. I feel horrible that he has to help me through yet another bad trip. I take 12.5mg meclizine to try and deal with the nausea I am experiencing. My friend goes to bed on my couch.",
  "+6:00 - I watch some movies and listen to some calmer music. I try not to think much about how much I am tripping. The nausea seems to be leaving some.",
  "+8:00 - At a +1. Visual effects mostly gone. I go to bed.",
  "--",
  "This trip very much worries me; why did I get so sick? No one of my friends ever got nausea from this (same batch), and I really worry that my body is now associating the effects of psychedelics with my body being poisoned and reacting accordingly. Will I ever be able to enjoy a psychedelic again without intense physical trauma? I am kind of cautious now about taking another since all of this happened.",
  "Also, I wonder why it took so long to come on? All my friends who took this from this same batch all were at peak by an hour and fifthteen or so."
 ],
 "erowid": {
  "id": "50762",
  "citation": " Anony5000. \"Nausea -- Is My Body Rejecting This?: experience with 4-HO-MiPT & Meclizine (ID 50762)\". Erowid.org. Jul 5, 2006. erowid.org/exp/50762",
  "substance": "4-HO-MiPT & Meclizine",
  "views": "18885"
 }
}
