{
 "title": "Life Has Changed Dramatically",
 "author": "Karpet",
 "citation": " Karpet. \"Life Has Changed Dramatically: experience with MDMA, Cannabis, Tobacco & Inhalants (Nitrites) (ID 8606)\". Erowid.org. May 12, 2004. erowid.org/exp/8606",
 "substance": "MDMA, Cannabis, Tobacco & Inhalants (Nitrites)",
 "bodyweight": "9 kg",
 "report": "<p>Before I start I would like to say that I am only 14 years old.</p><p>I would also like to comment on the prices specified for E and dope...'A single tablet bought at a rave can cost as much as $50 though more commonly $20-$30. Purchased in higher quantities MDMA generally sells for $100-$250 per gram (about $10-25 per dose), with wholesale prices as low as $50 per gram.'...Where I live, in the middle of farm country, England, nowhere, I can score a pill for around 5 (about $8).  And cannabis prices...'generally $30-$60 for 1/4 ounce of lower quality and $60-$120 for 1/4 ounce of high quality bud'...are quite expensive too...a quarter of hash will set me back 20 (about $35), and to give some idea of potency, a quarter of the stuff around here will get 8 people very stoned.</p><p>Over the last few months my life has changed dramatically.  But for the better, definately.  4 months ago I had no social life.  Now I go to parties every weekend.  4 months ago my drug use was limited to a glass of wine with my parents every now and then.  Yesterday I took my first pill. </p><p>I think that it is to do with my personality.  Every time in my life when I find something that is fun, I do it over and over again and explore all the possibilities available, and this only ends when I find something else to take it's place.  My new craze, unfortunately, is drugs.  It started off with the most ridiculous situation possible. </p><p>This man i'd never seen before was wearing the same Nirvana T-shirt as me, and so he invited me to a party.  AS a result, I got incredibly drunk.  I loved the feeling.  I could talk openly to people, I was more popular when I was drunk and everything seemed more fun.  So for a month I got drunk every weekend. </p><p>Next month, the same guy (who goes to the same school as me) invited me to another party.  Here I smoked my first joint ever.  Again, I loved the feeling.  This time it was relaxing, calming, and lifted my mood.  So for the next 2 months I got stoned every weekend.  In those 3 months, I grew very close to a friend I didn't know I liked so much, called Lizzie.  She was much more experienced with drug use than me, having smoked her first joint at 12 and taken ecstacy at 13(!!!).  So at the beginning of month 4 of my new obsession, we drop a pill together.</p><p>we'd managed to get hold of 'dexters' at 8 ($13) per dose.  They had a pretty picture of dexter from the TV show on the front, and I happily munched mine in a fruit pastel (pastille, pastil, pastelle, how the hell do you spell that?).  THe Nirvana T-shirt guy, who was now one of my best friends, said that if I stared into his eyes i would 'come up' harder and faster.  I realise now, having read the literature, that this was probably untrue, but could it possibly have had psychological effects?  Well anyway...we dropped the pills at 7:30.</p><p>After about 15 minutes of walking around the park we met some of Lizzie's 'friends' who steal from her, insult her and aren't actually very nice people at all.  After their traditional cry of 'Lizzie, gimme a fag'  (fag being English slang for cigarette) we had a chat with them about this and that, and they offered us a couple of shotties.  (I'll explain shotties later...they're like bongs but I think they only come from the south-west of England...no-one i've met from anywhere else has heard of them)</p><p>So about 30 minutes after dropping, we're feeling nicely stoned from the shotties.  Suddenly, a surge of energy and euphoria takes me, and I find myself sprinting around the park.  After some odd looks from Lizzie's friends, I return for another shotty and declare to the world 'I'm coming up!!!'</p><p>Lizzie also was feeling the effects, so we thought we had better do something fun.  So we stomped off to the fairground.  Here we found this ride called 'orbiter' which spins you aroundd and up and down and sideways and inside out etc etc...so we decided to give it a whirl.  There was some loud dance music coming from a nearby speaker, and this complemented the movement of the ride so well.  It was like flying through space at a million kilometres per second.  When the ride stopped we got off, hugged each other, (hugged the ride operator too :) and set off somewhere to chill out and sip some water. </p><p>THe beach wasn't far away, so we walked off to there.  On the way through, we met Nirvana T-shirt guy again, and hugged him and all his friends, and told them how much we loved them all.  Walking through town was just like...just like normal, except everything was perfect.  They were the same streets, but the lights and music from inside the clubs was so uplifting, and the cars passing by looked so perfect.  Everything was right with the world.  That's what I love about drugs.</p><p>Sitting on the beach, we had a long conversation about how we had grown very close to each other over the past few months, and we also phoned some friends and told them how special they were and how we could never live without them.  I felt an emotional bond between me and Lizzie and everyone we phoned.  Even the people I hate didn't seem so bad.  I felt sorry for them, thinking how sad it was that they were so nasty.  we decided that trying some Poppers (a liquid you sniff) while on E would be fun.  So she took out the bottle, and we each took 2 long hits.  simultaneously, we let ourselves lie back on the sand, the only words coming from our lips were 'i'm so wasted'.  It was a very strange hit, and I loved every bit of it.  Lizzie described it as being similar to Valium, which I have never tried, but you may be able to relate to that.</p><p>Floating along the streets, we returned to my house.  It was about midnight, and the effects were wearing off rapidly.  With the last few minutes of ecstacy, we talked about how similar we were, having birthdays within 2 days of each other, having the same hobbies, both of us being intelligent, and our ability to get on with each other so easily.  At about 2 in the morning, Lizzie went home and I watched TV for a while and sipped my water. </p><p>Best night of my life.  By far.</p><p>And I will definately try it again, always with people who I would like to become good friends with.  It just sets the whole world right, for a few hours.  I love it.</p><p>The morning after.  A slight hangover, as if I'd been drinking.  I didn't expect that.  A few shotties brought that to an end.  I think I had bettter explain shotties now.</p><p>A shotty is just a 500 ml coke bottle with a metal tube, in this case a windchime, going into it.  You prepare the hash/bud just as if you were going to make a bong mix.  To load them, you roll a very small pinch of tobacco up into a ball and plug the end of the tube with this ball.  then you take the tube out of the bottle and press it on the prepared hash so it picks it up.  About 4 'dabs' is enough.  Then you put the tube back into the bottle, light the substance at the end of the tube and suck through the top of the bottle.  Although this is vastly inferior to a properly made bong, you can do this anywhere with just a tube in your pocket.  Just buy a drink and then use the bottle</p><p>                |  |</p><p>               /  </p><p>             |      |</p><p>              |      | //------Metal Tube</p><p>              |      |//</p><p>              |      //</p><p>              |~~~~~//</p><p>  Water --------     |</p><p>              --------</p><p>This turned out to be most of my life story, aswell as the experience :)  sorry....</p><p>I hope you found this interesting, it felt good to get it all off my chest.</p>",
 "year": "2001",
 "id": "8606",
 "gender": "Male",
 "timestamp": "2004-05-12T07:00:00.000Z",
 "views": "5498",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": "2 hits",
   "administration": "inhaled",
   "substance": "Inhalants - Nitrites",
   "form": "(liquid)"
  }
 ]
}
