{
 "id": 8607,
 "title": "Plugging My Mind Into Fractal Chaos",
 "date": {
  "submission": "2007-01-04T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anony5000",
  "gender": "Female",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "18"
   },
   "administration": "rectal",
   "substance": "4-HO-DET",
   "form": "capsule"
  }
 ],
 "report": [
  "Material - 18 mg ethocin (4-HO-DET) in a gelcap, admistered rectally.",
  "Setting - My apartment, various places around the city.",
  "Purpose - Entertainment and exploration.",
  "-0:30 - Use the bathroom to clear myself out for rectal administration.",
  "0:00 - Insert a gelcap with 18 mg of ethocin about three and a half inches into my rectum with my finger and some lubricant.",
  "+0:15 - I am at a +1. I put on a movie; slow, ambient, animated film.",
  "+0:30 - +3 now. Loads of body tension, way moreso than 25 mg of ethocin orally. This has come on fast and hard.",
  "+0:45 - Seems even stronger now, there is lots of shaking and twitching of my body. Visuals start to manifest strongly, unlike the mostly completely avisual experience I had on 25 mg orally. Strong neon blues and greens, light distortion. Not as intense or driven as 4-HO-MiPT, but certainly strong in its own respect.",
  "+1:00 - The movie turns out to be too much for right now. I turn it off and play some Nintendo, but find that pretty difficult (I have no idea what I'm doing, even on familiar games). The white and light colours in Ninja Gaiden 3 are constantly cycling through rainbow neon hues. I am very confused sometimes, and my thoughts are spiralling and illogical. I get a little anxious. Body load is persistent.",
  "+1:30 - Body load starts subsiding a little, but the visuals are still all over the place (this was a very positive thing). I start to note a very weird sensation in my body: I constantly think that I am wet. I check myself to make sure I haven't spilled something on myself or wet myself, and find I am completely dry. Still, the feeling that various parts of my body are soaked persists, and lingers throughout the trip for the next three hours. I found this slightly uncomfortable. Some people note this to be a diuretic; I did not find this to be very true.",
  "+2:00 - I use the bathroom and stop to gaze out the window at the usually dull concrete block adjacent to it. After staring for a short time, the entire wall exploded into rainbow, green, and purple fractals, constantly morphing and changing, with a bright white background. I recognized some of them from closed eye miprocin visuals. The sight was breathtaking and I found myself glued to the view from the window for a half an hour. These were some of the most beautiful visuals I had ever gotten on a psychedelic.",
  "+2:40 - Go downstairs and watch some of the same thing (though slightly different because of the lighting, I guess) downstairs. Still very entertaining. I find the movie store to be a little too strong on negative vibes and wait outside.",
  "+3:00 - Me and a friend go downtown to return some videos and get some cigarettes and water ice. While walking there, I note the sidewalks and roads being filled with bright fractal patterns. I have trouble concentrating on much else aside from the visuals.",
  "+4:00 - Coming down slightly, though I'm still pretty zoned. Talk to my friend some and watch TV.",
  "+5:00 - +1 now. Relaxed, started to watch a movie.",
  "+6:00 - It seems mostly out of my system. Some residual muscle tension persists for three hours or so.",
  "--",
  "This was my second experience with ethocin. The only other 4-HO-T I've had is miprocin, orally. I found this experience to be much different than my 25 mg oral ethocin trip, in terms of visuals, duration, and intensity. It was definitely stonger than 25 mg oral, though the duration seemed to be cut by two hours. I will definitely consider this method of consumption again in the future with 4-HO-T's.",
  "Between miprocin and ethocin visuals (experienced on this trip), I think the main difference was that miprocin was very in your face about everything, while ethocin sort of suggested but didn't really push. Ethocin had none of the in your face swirls or warps of miprocin, but it did have some very beautiful color modulation and gentle displays of imagery that could be seen if you relaxed your mind and let it flow. One thing noted here was the colours, too: lots of neon purple and green.",
  "Overall, I very much enjoyed this trip, despite the 'wet' feeling and some intense muscle tension early on."
 ],
 "erowid": {
  "id": "50765",
  "citation": " Anony5000. \"Plugging My Mind Into Fractal Chaos: experience with 4-HO-DET (ID 50765)\". Erowid.org. Jan 4, 2007. erowid.org/exp/50765",
  "substance": "4-HO-DET",
  "views": "8474"
 }
}
