{
 "title": "The Things We Love Most Are Things Forgotten",
 "author": "Enthrall",
 "citation": " Enthrall. \"The Things We Love Most Are Things Forgotten: experience with Tea (Oolong) (ID 86101)\". Erowid.org. Dec 5, 2013. erowid.org/exp/86101",
 "substance": "Tea (Oolong)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5 g",
   "oral",
   "Tea",
   "(tea)"
  ]
 ],
 "report": "<p>Where do I start? I'm no writer or english professor. However since I'm making the first tea report here, its important that I write well and neat in an effort to portray my strange tea experience as best I can.</p><p>Part 1: Magic</p><p>Some background info. Me and tea go back far. As stated in my title I had a tea inspired realization. 'That the things we love most, are things forgotten.'</p><p>I first had my first cup of tea nearly ten years ago from today. It was at a sushi bar in which I was served a pot and cup of Japanese green tea known as Genmaicha. Green tea combines with roasted brown rice. The genmaicha had kind of a funky smell to it. Although I wasn't repulsed by it. Kind of like a vegetative scent. Like freshly cut grass slowly bubbling in a hot pot of water. To most people they would thing 'oh gross.' I was young and when you're young, you're adventurous and willing to try new things. I was in a sushi bar for christ's sake.</p><p>Looking inside the pot was a mesh filter and floating in the water was green tea and puffy looking rice which most likely swell due to the waters heat. As I closed the lid the steam engulfed my hand, the smell was lingering and strong. I was probably 13 yrs old. Maybe even younger.</p><p>As a kid my parents discouraged me and my brother from drinking anything with caffeine in it. Well not really discouraged, but anytime we ever wanted a drink it was either koolaids in the fridge or here's some water. They never bought soda for us. Considering the amount of sugar in koolaid I don't really understand why. I never complained though. A few years passed and I started to visit my grandparents quite a bit more than usual. They are old folk and we were in the south. So I remember sun tea being the thing! Everyday they would put some water in a 1 gallon glass jar with a few tea bags and set it out in the sun. Most might identify with the brand lipton which is a blend of multiple different black teas. Point is. This is the only tea I knew existed as a kid. Just plan old tea in a bag.</p><p>Flashing back to the sushi bar, I picked up the pot which resembled a mix between a kyusu and tetsubin (japanese teaware). Pouring into an elongated cup steam and a deep cloudy jade colored green tea flowed out and into my cup. I took a sip of the warm beverage. The emotion that followed is difficult to put into word because human language cannot even come close to true experience. It's very limited. Try and describe the color blue without using the word blue? I simply can't.</p><p>What really brought me into the world of tea was most likely the taste but I can't say so for sure. It is a cascade of senses and emotion which grabs hold of me. The taste of the genmaicha was simply amazing, astringent, warm, soothing, and the brown rice gave it a nutty taste which put me over the edge. Tea cannot be compared to much of anything in my opinion. Like 'Tastes just like chicken!' No, tea is its own flavor, unique. Less experienced would make comparisons to 'nature' which you could say is partially true. However not 100% the same when you get down to the flavor within the flavor or...subtleties.</p><p>It was relaxing, it calmed my mind. 'Anyway, it gives patience, to listen to error without anger.' My tea experience was spiritual!</p><p>The tea tree which is infused with life and captured within its leaves is once more called upon by the water, for one last breath.</p><p>My belief is that the leaf is reborn or reincarnated. Not as a living thing being reborn but the Qi inside the leaf is being held like a capacitor holding a charge. Adding the water draws the Qi from the leaf which once belonged to a majestic tree, and into my mouth, into my body. To give me strength and an overwhelming connection to nature and everything. Within everything is a life force, just listen to the tea. And once again become one.</p><p>I didn't realize this connection I was making until a ways into my tea career. I just knew from that moment on the east had culture that I wanted to be part of too, and this tea, well, it was something special and I couldn't quite put my finger on it.</p><p>Part 2: Present day</p><p>Now to the actual experience which may be short in comparison to part 1.</p><p>It was nearly 8pm on a monday and a breeze was blowing outside as I set up my gong fu tea set to begin gong fu cha dao (the way of tea) which is a chinese tea ceremony which allows me to become ONE and reach another state of conciseness. A meditated, buddhist, almost nirvana like state of ONE.</p><p>I heated up my water, added 5 grams of Tie guan yin oolong to my yixing pot and set facing the v shape of the mountain canyon. The sun was nearly completely set. It was completely silent besides the trees dancing in the wind and chimes hanging over my neighbors porch. I lost complete track of time as I tended to my gong fu ceremony.</p><p>Put tea leaf into pot, poured water over my pitcher and cups to heat them up. I steeped only for a few breaths. This is the trick to the meditation, do not time with a watch time only for the moment. I would probably breathe in and out slowly for 5 breaths. I don't keep count. Just calm my mind and sit still. After a short time I would pour the tea into my pitcher and then into cups. I'd savor the flavor and subtleties of the oolong. Then resume my meditated-like routine of tending the heat of the clay. After some time and steeps later my mind slipped into another realm. A nirvana-like state, coupled with the meditation like tea ceremony, and the relaxing chemicals in the tea itself which change my brain waves. (L-theanine is the name. It has psychoactive properties and promotes alpha wave production in the brain.)</p><p>The effects were stronger than I expected. I hadn't had tea in awhile. Sounds around me were amplified. The wind was pressing against me. I felt like I had taken a strong sedative. My body felt heavy. The wind itself felt euphoric and I felt butterflies through out my body. I had a strong since of well being. The world was beautiful, the trees swaying in the wind were happy/excited. Every living things Qi/soul whatever you want to call it were reaching out to my soul/energy and intertwining. Almost like drinking the tea allowed me to shed energy blockage which was keeping us from connecting. We were friends. The birds chirped beautifully. I felt inspiration and connection to the earth. I was ONE and felt love!</p><p>To this day tea is such a spiritual thing to me that after I drink it, the loose tea leaf must go back to the earth so that the energy cycle can continue. It's the least I can do for the great divine gift of tea the earth has given us.</p><p>Note: Good quality tea was used, not cheap stuff. I import from china directly from farms. Most of it is high in L-theanine. So using store bought tea won't suffice. The experiences I have are based on the quality of tea and mediation which alter my conciseness.</p><p>Tips: Relax, calm your mind, stay in the present, engulf yourself at the task at hand. And best of all strong tea. It may not work for you. It may just be my genetics? Then again why does the east like tea so much? Japanese ceremony? Chinese ceremony? For tea? Why are people so crazy about tea?</p>",
 "year": "2010",
 "id": "86101",
 "gender": "Male",
 "age": "20",
 "timestamp": "2013-12-05T08:00:00.000Z",
 "views": "552",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 g",
   "administration": "oral",
   "substance": "Tea",
   "form": "(tea)"
  }
 ]
}
