{
 "id": 8613,
 "title": "Not As Bad As I Thought",
 "date": {
  "submission": "2002-01-11T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Fed",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>I am very liberal when it comes to drug use, and ill usually try anything at least once. I had used coke before, but it was in combination with x, a ton of good weed, 9 adderall, and beer, so the effects from the 1/2 gram I had snorted during that night of extreme drug abuse were not very distinct.",
  "When 'rocket fuel' came around to my dealer, I was eager to try it alone. He fronted me a half gram which was wrapped in a corner of a plastic bag.",
  "I went over to where my friend worked and did a couple lines in the employee bathroom with a rolled up $20. In five minutes I was really chatty and full of euphoric energy.  Later that night I went out with him to his girl's friend's house. Before leaving, I did another 2 lines, and on the way over I was talking about relationships and how we should treat women better (something I usually don't talk or think about). He was looking at me like I was a weirdo, so I explained what I was on. He understood, and we went on to an uneventful night watching movies.",
  "The next day, during my break at work, I decided to do a line. When I got back, my menial job seemed not so bad and I got my jobs done quickly and easily. The effect lasted about 20min with a smooth return to baseline.",
  "After I got out of work, I did a couple more lines in my car. Smoking cigarettes was nice, and for some reason I got the idea in my head that I should visit my grandmother. By the time I got to her house the effects had worn off and I realized that it was the coke talking. I said 'hi' and left. I did the rest of the coke on the way to my other friends house.",
  "Once I got there, I was really high because the last bit of coke was at least 4 big lines. The shit was good quality by the way with not much cut at all.  Another friend was at the house, me and him almost got in a fight over weed that day in school. Since I was flying, I accepted the apology he gave me for getting pissed over nothing, and we proceeded to smoke some really good weed.",
  "I realized that coke isn't as addictive as many people say. Its fun, but if you have good self control, and make sure to limit yourself to sporadic use then its not bad. Many people have addictive personalities and end up using everyday. I think that if you are someone who finds it hard to quit smoking (Im not) then using addictive drugs like coke and speed isn't a good idea. Coke makes me talk alot, thoughts move quickly, and I don't look fucked up. The euphoria is good, but last only 20-30minutes if I don't snort anymore. I also noticed that the effects from ritalin snorted are almost identical, albeit without numbness of your face and a little bit less intense euphoria. I know that ritalin is pure though, something I can never tell with coke. With both, emotions come freely, something that was the only give away that I was on a drug. Usually Im not emotional at all, and when Im all nice to my parents it makes them suspicious.</p>"
 ],
 "erowid": {
  "id": "5080",
  "citation": " Fed. \"Not As Bad As I Thought: experience with Cocaine (ID 5080)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5080",
  "substance": "Cocaine",
  "views": "11375"
 }
}
