{
 "id": 862,
 "title": "Crying For Joy And Happiness",
 "date": {
  "submission": "2002-02-12T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Black Scooter",
  "gender": "Male",
  "weight": "80 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "8 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>I originally bought a bag of Copelandia from Amsterdam where the substance is freely available from shops dedicated to the issue.",
  "First I was a bit worried about the whole thing and didn't consume the shrooms and I left them in my drawer for appr. 3 months.",
  "Finally, one saturday I had a good mood and figured to consume the goods. I had few glasses of red wine, my wife was out of home and I consumed the shrooms by simply eating the dried shrooms and flushed them with good wine. Taste of the shrooms was practically NIL, it was like eating dried bread.",
  "In the first half an hour I did feel nothing but then...it REALLY started to happen. I was in my room alright but again...I wasn't. I went somewhere with full of colours, joy and happiness. I felt I went to the place where everything was united, where everything simply was beautiful and there was no fear or angst whatsoever.  I was IT and IT was me and I was part of everything.",
  "I have never cried for joy before in my life but then I did. It was the most beautiful thing happened to me ever. There was no bad feeling whatsoverer during the trip and I just sat on my couch and enjoyed the sights.",
  "On some stage of my trip I met somebody who told me that there (in the world of cosmos) is nothing to be feared of. Everything is simply love and happiness. The only thing needed is that your 'heart is pure' without specifying what it means.",
  "On that stage I understood how much life and cosmos is more than the thing we physically see here.",
  "Eventually I met a girl - it was a very short time of the general experience - who told me that 'we're not dating nor married but we can meet every once in a while'. To me this meant that this substance is not going to hook me and I can fairly safely do this some other time. I felt it was to ensure me that there is no danger.",
  "The whole session took about 5 hours until I started to come down at around 24.00 at night.",
  "Sometime in the end of the experience my wife came home (she's the most understanding person) and I just told her not to be worried although that was around the time I was crying for joy and happiness.",
  "The following day my head was still a bit dizzy and I had a big smile on my face the whole day.",
  "To me it was most spritual experience ever.</p>"
 ],
 "erowid": {
  "id": "12407",
  "citation": " Black Scooter. \"Crying For Joy And Happiness: experience with Mushrooms (ID 12407)\". Erowid.org. Feb 12, 2002. erowid.org/exp/12407",
  "substance": "Mushrooms",
  "views": "9147"
 }
}
