{
 "id": 8623,
 "title": "So This Is It?",
 "date": {
  "submission": "2002-01-11T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kevin S.",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "liquid"
  },
  {
   "time": "4:00",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "liquid"
  },
  {
   "time": "6:00",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "liquid"
  }
 ],
 "report": [
  "This story is about my first experience on acid. I wouldn't call it a bad trip, but it definitely wasn't what I was expecting. My only thought through most of the trip was, 'This is it? This is what all the fuss over acid is about?' If circumstances under which I got the acid had been different (I didn't have to pay for all of the hits), I would have thought it a waste, but as it is, I'm chalking this one up as a learning experience of what to do and not do on LSD. This is very long, and I may ramble, so stay with me.",
  "I came across my first hits of acid last Wednesday after finding out that someone had taken a $35 hit of X that I had been saving for the weekend. My roommate asks if there's anything he can do to help make it right again, and after a day of deliberation, I asked for 2 hits of the acid he'd been tripping on ('testing') the night before. Each hit was a drop on an altoid mint (I'm not sure of the exact dosage, but my roommate had taken 8 with no ill effects, just a mad trip). I put them in the freezer (this may not have been a good idea), and waited till the next day, Fry-day.",
  "Friday came, I went through all my classes, and came home ready to trip. I took both hits immediately after entering the room, at about 4:00 PM. Some friends showed up, and a couple bowls of weed were passed around. I passed the pipe without hitting a few times, telling myself that the weed was only entertainment until the acid kicked in, and that I didn't want to get stoned to sleep before it really hit. We finished the bowls, went to dinner, and headed to R's room to roll a blunt and listen to some music. By this time, it was 5:00, T +1:00, and I was kinda wondering if I was gonna feel anything soon. A, my roommate, pulled out money he was collecting from various people for shrooms, and grumbled that he was one hit of acid short of the money needed to buy 6g for three people. Not feeling my acid at the moment, and wondering if I would, I forked over for one more hit, which he kept until I was sure that the two hits I'd had weren't going to be enough.",
  "The blunt got rolled, and 6 of us went for a ride in ST's truck. I got the bed in 40-degree weather, but this turned out to be not so bad. I felt something start to kick in on the way to the lake. Everything looked a little brighter than usual, and looking around the side of the cab into the wind had a refreshing feel to it. I'd just hold my head there as we drove to the lake, going about 55 in some places, just savoring the feeling of the wind in my hair and face. It wasn't cold or painful, nor did I have trouble breathing, all of which would have been the case had I been sober.",
  "Upon reaching the lake (it's more of a reservoir, little more than a pond really), I got out and walked over to a bridge. I noticed a pipe pumping water into the reservoir. After being given a charge from the blunt, I noticed that the pipe suddenly sounded as if the sound was being focused through a tunnel toward my ears, and it sounded as if it were farther away than I really was. ST asked if I was frying yet, and I told him about the water pipe, to which he just smiled and chuckled.",
  "After a couple more hits, we get back in the truck and head home. This ride was a little less pleasant; I had slowly been getting colder, and ST took the long way around to get back to the dorm. As we approached the dorm in the car, I looked away from it for a second and out of the corner of my eye saw that the building was highlighted in purple. I blinked and looked back, but the illusion was gone. It bummed me for a second, but then I thought, hey, at least it's starting to work.",
  "This was about T +2:00, or 6:00 PM. My friends split up two ways, one to go score the shrooms, the other to do some more legal errands. I headed to my friend CD's room and watched some of a movie. I was feeling the effects, but I didn't want to just fry (get high), I wanted to trip (visuals and losing contact with reality). I found that I had to concentrate somewhat to hear and understand what was being said. I could focus on one thing or person and hear it/him/her, but everything else was a wash of sound that my brain acknowledged and then discarded. This, I now know, is when it really started to hit, but the thought was still back in my head that nothing was happening. If I didn't concentrate on anything, I just zoned out a little and let the world go by. Some of my friends came by and asked if I was getting anything yet. I felt fucked up, but I really wasn't seeing anything, so I said no, I wasn't getting much.",
  "At about T +4:00, I headed back to my room. My roommate was there, and asked if I was getting anything yet. My response was that I felt little if anything. A gave me that third altoid I had bought, and I dropped it. A short while later, A took off again. He grabbed some of his friends and went to a keg party where some more acid was going around, but I didn't know this at the time.",
  "I headed to my friend J's room and chilled with his roommate Y and a couple of his friends, whom I didn't know. I found a seat and watched the comedy channel on the TV for a while. Again, I had to concentrate on the TV to understand anything, and my attention span was brief. I remember the commercials more than the actual show. People came and went, and I got a little uneasy at this. No one would stay put! People I didn't know came in, sat, and talked with others in the room. I couldn't keep track of the conversation, coming as it was from three people. I began to feel a little nervous, and decided that I would head to my own room and chill for a while. This wasn't far past T +5:00, 9:00 PM, and I was really feeling the effects, though I couldn't make myself believe that I was high. I was still disappointed with the trip thus far, interrupted and uneventful to me as it was.",
  "In my own room, I just couldn't get comfortable, no matter where I stood, sat, leaned, or lay down. I knew better than to try to sleep, and wasn't tired anyway, but I was just so bored and on-edge. None of the songs I had on my computer or could find seemed to match the mood, and some made me start to feel bad before I turned them off. I walked down the hall across the dorm to a friend's room, and while passing through a dark section of hallway, the door frames on the sides of the hall were highlighted in purple, with dim purple tracers as I moved past them. I tried this a few more times through the night, but the effect didn't change or increase, and it lost its novelty after a few times. The friend wasn't home, so eventually I went back to my own room, put some standup comedy clips into the player, turned off the lights in my room, and lay in my bunk. The ceiling fan became the center of my attention. It cast a shadow from the light of my computer screen, which was the only light in the room save a few LEDs on the stereo. I looked at it, and found that it appeared to be off, in that I could see all four blades frozen in place, but there was a blur behind it, and the shadow was unaffected, so I knew the fan was on. I started to relax a little, knowing now that I could keep a grip on reality, and started to play mind games, trying to control what I was seeing. I concentrated on the fan for a while, and the four frozen blades started to slowly turn, slowly, then faster. I imagined the fan slowing down, and lo and behold, it did.",
  "I grew bored with this eventually, as it wasnt as real as I thought it would be, and closed my eyes to see what kind of closed-eye visuals I could have. I think I can best describe it as looking through a kaleidoscope, where everything is reflected in a series of triangles, but only being able to focus on one or two triangles of space at a time. Dim patterns moved across my eyes, heading to different points, but when I concentrated, these dim patterns started to fall into place as the kaleidoscope I have described, but I could only see one triangle in space at a time. Cool, but still not too real. When am I gonna see real visuals? I refused to believe that the acid was really doing anything until I saw these things.",
  "I opened my eyes and turned my attention back to the ceiling fan. I was starting to get lost in it again, when the lights turned on. A was back with a mutual friend, K. This was, I think, the biggest and most jarring interruption of a drug trip I have ever experienced. I'm in a very dark, quiet room, staring at a ceiling fan with two 60-watt bulbs on it, when all of a sudden those bulbs flash in my eyes, the room door bangs against the wall, and A walks in saying 'What the fuck are you doing in bed?'",
  "I was slightly annoyed, not at A, but at the blind spot on my eyes. Even now (the next morning), when I close my eyes, I still see those dim tracers from being light-flashed. I wasn't too peeved at A at the time though, because I didn't think he had interrupted anything incredibly important or cool. I climbed down from my bunk and chilled with A and K for a while. This was about T +6:00, 10:00. K, after looking at me, proclaimed that I was tripping and just didn't know it. Hearing her say that brought back the fucked-up feeling that had left me when the lights turned on, but I was concentrating on A and K too much to enjoy any feelings I got.",
  "The rest of A's friends from the kegger show up, including three people I don't know. One of them saw that I was getting a little uneasy, and sat down next to me, introducing herself. I returned the greeting, and then relaxed and just stared at her, not in a sexual way, but just focused on her face smiling at me. It occurred to me at one point that I was probably annoying her somewhat, but she'd had a few beers and a few hits of acid, as well as a little weed just then. She was feeling really good, but told us that the cocktail wasn't giving her any visuals or hallucinations. Same here. I shifted my gaze to K, who was laying back on the bed behind me and SH. She was pretty much sober, and got a little wierded out from my constant gaze. Another friend with acid showed up, and after hearing me describe my high, he gave me a tongue hit straight from the dropper. I thought, 'Finally, I'm going to trip!'",
  "People kept coming and going, guys escorting girls to the bathroom, guys going themselves, people leaving to find another couple. Again, this started to make me uneasy. Why couldn't everyone just stay put and be fucked up? Why did they always have to go get themselves lost searching for someone who came back 5 minutes after the search party left? Everyone will be back eventually. Eventually, everyone did come back, collecting those who had passed out on the floor of my room, and then suddenly, everyone was getting ready to go. Where? I had no idea. A left with K and some of her friends, and I was alone again.",
  "I downloaded some of Paul Oakenfold's music, put my headphones on, and started the visualization on my computer. I wanted to stay awake until I could tell if that third hit kicked in, or until I was just too tired to stay awake and wait, which was what I felt I had been doing all night. I found myself getting lost in the visualizations, but whenever I wanted, I could look away, and the rest of the room would be normal, if a bit dark. At 4:00 AM, 12 hours after dropping the first two altoids, I looked around and said to myself, 'forget it. I'm too tired to enjoy this', as I climbed into my bunk and tried to get comfy.",
  "I looked at the ceiling fan for a while, then closed my eyes. Sleep was a while coming to me, as I still couldn't get comfortable. I would be too hot in one place and too cold in another. Finally, I looked at the clock, which read 4:40 AM, and closed my eyes. In my mind's eye, I saw me, but this vision of me was full of static and distortion, as if it had been cut out of a TV picture with bad reception. I followed myself through a hallway. The hall was brightly lit, but my vision was dim and clouded. The walls looked beige and yellow, with no features to them, and it occurred to me that this was my floor in the dorm, but without any doors, stairs, or other features that would make it recognizable as such. I followed me until I came to a point in the hallway where there should be a water fountain, but instead there was a file cabinet. The vision opened the drawer to reveal that it was full of videocassettes. He selected one, looked at it, then picked up another and another. He looked at me, and I saw a fiendish grin cross his face. The last thing I remember of that scene was thinking that I'm in for one hell of a ride.",
  "Beyond that, I don't remember anything except for two fleeting scenes. The first was of a female friend, C, and her boyfriend ST, curled up together on a bean bag in a dimly-lit room. I could recognize it as a dorm room, but I couldn't tell whose it was. The entire scene was very dim and fuzzy, and presented to me in shades of dark blue. I was not really in a room with them, that much is certain. My view was always of those two on the bean bag, but my point of view was constantly changing, rapidly, yet smoothly. This scene fades, and another eventually takes its place. This one was of another person sleeping in another style of dorm room. I floated closer, and the last I remember of this scene is seeing a strand of blone hair run from her bangs, over her shoulder, and into the blanket, and realizing that I was looking at K. Immediately after I realized this, the scene faded from my mind and I can remember nothing further.",
  "I became aware of reality again at about 8:30 the next morning, in the form of my alarm clock going off and a garbage truck starting a ruckus emptying the dumpster not far from my window. I ackowledged that I was back, thought 'that was it?', and promptly fell asleep again.",
  "I woke again at 10:30 to my roommate's phone ringing. He answered it and prepared to leave. When he saw that I was awake, he asked how my trip went. I could not give him a straight answer. I told him about seeing myself and the videos, and he's convinced I tripped, but I'm still not sure. I was looking for something different than the experience LSD gave me. I was looking for trippy visuals and hallucinations showing me the key to the dark (or light) side of my imagination. Instead, I just felt fucked up and disappointed for most of the night. In retrospect, trying to trip was the last thing I wanted to do if I wanted to trip. The uneasy feeling of people entering and leaving, as well as the interruption in the middle of a minor trip, also contributed to a no-show for the high I was after. Next time I do acid, I'll try and keep 'this is it?' out of my thoughts. Maybe I'll replace it with 'it gets better'."
 ],
 "erowid": {
  "id": "5087",
  "citation": " Kevin S.. \"So This Is It?: experience with LSD (ID 5087)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5087",
  "substance": "LSD",
  "views": "8171"
 }
}
