{
 "id": 8628,
 "title": "The Wall",
 "date": {
  "submission": "2008-07-21T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Salvia Man",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "Preamble-",
  "At my high school, there was a monthly paper put together by the journalism class. In one edition, I read an article about a legal hallucinogen called 'Salvia.' This article really intrigued me and I decided that I was going to try it. A few of my friends and I, without even reading up on it, all pitched in and purchased 25 grams of leaves for $100 and split it up amongst the five of us. Each of us tried it on our own or with our seperate groups of friends and only one of us (not me) reported that they actually felt something substantial. This struck me as odd so I decided to do some research and quickly learned that the leaves themselves are not highly potent but can be extracted and made highly potent. I found a recipe for extraction using grain alcohol on the web and with the rest of my leaves made a 20x extract which only produced 2 bowls worth.",
  "The Story-",
  "So we were at my girlfriend's house. She was having a HUGE party with all of her friends, all of my friends and all of her brother's friends, probably about 35 people in all, which I later learned is bad when smoking salvia. I had been drinking that night and suddenly it occurred to me that the salvia that I had extracted a few weeks prior was in my car and my friend said she wanted to try it. Her and I were the only brave souls that decided to smoke it, I heard that it worked best with a bong and a torch lighter. It just so happens one of my other friends had his bong and I had a torch lighter. I packed the bowl and took one gigantic rip out of the bong and held it in as long as I could, as I had read to do.",
  "Before I even exhaled, I lost all sense of reality. I don't even remember most of the next 5 minutes and I am going strictly off the accounts of some of my friends who were watching us smoke it. Apparently I put the bong down right away and was unable to even take another hit so my friend took her hit. The next thing I remember is that I was sitting at a picnic table and my friend and his girlfriend were sitting on the other side. Then, out of nowhere, this gigantic brick wall sprouted out of the ground and swallowed my friend, my reaction caused my friend to burst into laughter and I thought he was asking me to pull him out of the wall so I started trying to pull him across the table. Him and his girlfriend were now hysterically laughing and I couldn't figure out why.",
  "I wandered away from the table, everyone was yelling my name but when I heard it, I couldn't comprehend that it was my name, it felt like a word from the dictionary that was being repeated over and over again. I spotted my friend a few feet away from the picnic table. He was really drunk and dancing to some music that was being emitted from the stereo on the ground next to him. I saw the waves of music flowing out of the speakers and drifting through his body and at that exact second I felt like someone of a greater power gave me a mission to stop him from dancing. I tackled him and turned off the stereo and I had this overwhelming feeling of accomplishment, I felt like I had saved the world from destruction.",
  "I started coming down and felt a huge body high and I was pretty much done tripping at this point, about 15 minutes after I had taken the hit. I finally found my friend who had smoked with me and she was still tripping pretty hard and came up to me and said 'Can you give me a ride home? My friend that was going to drive me just turned into a deck of cards.' It was the craziest night I have EVER had and ever since then I have been afraid of smoking that high of an extract because of the complete lack of control I had over my body."
 ],
 "erowid": {
  "id": "50903",
  "citation": " Salvia Man. \"The Wall: experience with Salvia divinorum (homemade extract) & Alcohol (ID 50903)\". Erowid.org. Jul 21, 2008. erowid.org/exp/50903",
  "substance": "Salvia divinorum (homemade extract) & Alcohol",
  "views": "2804"
 }
}
