{
 "title": "Geat High.. Terrifying Tachycardia",
 "author": "BongRipperton",
 "citation": " BongRipperton. \"Geat High.. Terrifying Tachycardia: experience with Products - Spice and Synthetic Cannabinoids (ID 86313)\". Erowid.org. Jul 22, 2010. erowid.org/exp/86313",
 "substance": "Products - Spice and Synthetic Cannabinoids",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  ".5 g",
  "smoked",
  "Products - Spice and Synthetic Cannabinoids",
  "(plant material)"
 ],
 "report": "<p>I have been smoking cannabis for about 3 years. I would consider myself a very heavy smoker, (at least once a day) and I have been consuming marijuana at this rate for about a year. Recently my phone broke and I was not able to get in contact with my dealer for a while. I decided to try some incense.</p><p>10 pm</p><p>I weighed out .5 grams on my digital scale and packed it into my bong. .5 is roughly the dose I use when smoking cannabis alone. I have heard that the JWH-018 chemical in spice is stronger than THC but I was not worried.</p><p>10:15 pm</p><p>After smoking about half of the bowl I was feeling very high. The high was exactly like cannabis at first.</p><p>10:45 pm</p><p>At this point I started to feel some mild stomach discomfort. I was very very very high. Mild auditory hallucinations were noticeable. I have never had this experience with marijuana.</p><p>11 pm</p><p>My heart was beating very fast at this point and I was beginning to worry. I laid down in bed and began to take deep breaths which slowed my heart beat a little. I put my hand on my heart and it felt as if my heart were bursting out of my chest. I started to imagine that my ribcage was broken and my heart was being stabbed by the shattered ribs. I could feel the sharp edges of my shattered ribs through my skin. I was terrified.</p><p>11:15 pm</p><p>At this point I fell asleep.</p><p>9:30 am</p><p>I woke up to find my ribs fully intact and my heart was beating at a very normal rate. Apparently this drug is not for me.</p>",
 "year": "2010",
 "id": "86313",
 "gender": "Male",
 "age": "18",
 "timestamp": "2010-07-22T07:00:00.000Z",
 "views": "8307",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": ".5 g",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids",
   "form": "(plant material)"
  }
 }
}
