{
 "title": "Small Dose, Mild High",
 "author": "Madalaine",
 "citation": " Madalaine. \"Small Dose, Mild High: experience with K2 (ID 86324)\". Erowid.org. Oct 15, 2011. erowid.org/exp/86324",
 "substance": "K2",
 "bodyweight": "100 lb",
 "report": "<p>Background Info: I am a 20-year-old, 100 lb female. I have smoked marijuana for more than a year, usually 2 or 3 times a week. Before this experience, however, I have not smoked marijuana for more than a month. I bought K2 Summit from a local smoke shop to try since I cant smoke pot anymore because of drug tests. Before this experience I took two small hits of it from a pocket vaporizer for the purpose of making sure I was not allergic or had any immediate negative reactions. This did not make me high at all; they were VERY small hits. So in effect, this experience was my very first time smoking K2. I have read a lot of stories about severe paranoia, cardiovascular problems, and even seizures due to K2, so I planned on not smoking very much for the first time just to be safe and to gauge my bodys reaction and tolerance.</p><p>The Experience</p><p>0:00: I put a pinch of K2 Summit into my one-hitter pipe and took two small hits. I felt no immediate effects.</p><p>0:14: Im sitting here in my bed on my laptop, looking at artwork online. I dont feel much yet, maybe a little bit of a head high, kind-of unfocused and light-headed. Im thinking about trying another hit or two if Im still not feeling much in the next 20 minutes or so.</p><p>0:35: About five minutes ago I put another pinch into my one hitter and took two more pretty small hits. I dont even know if the first one counted as a hit, though. Im just really worried about doing too much; Ive read some horror stories about K2 online. Since this is really my first time doing it I want to be extra careful to start with just a little until I figure out my tolerance. I also made myself some tea. Lemongrass green tea. And brought some granola up with me. Yum. Im definitely feeling off. Similar to slight marijuana high. What Ive read about K2 made me expect that its ultra-potency made just a couple hits make you really high, but so far it doesnt seem that way. The high is pretty mild. Mostly light-headedness, my visual focus is just a little different, and my mental focusing ability is a little impaired. Its a little bit harder than usual to keep a train of thought, something that is common for me when high off marijuana.</p><p>0:39: My audio perception seems more refined. Everything seems a little louder and clearer. When I eat granola its so loud. It sounds like crunching rocks in my head.</p><p>0:52: Still on my computer. I almost feel as if the peak of the high has passed already. At the highest point it was mild at best. Im still definitely feeling a little high, but I guess I didnt smoke enough because its been pretty minimal this whole time.</p><p>0:57: I mostly feel like I wish I were super baked off marijuana. The high Im feeling is mild enough that its possible that most of it could be psychological due to my expectations. The slight high I do feel does feel good, however, and very similar to an equivalent marijuana high. Theres a little visual/audio distortion, slight light-headedness, difficulty focusing on tasks, slight euphoric effect/happy feeling. No eye redness or increased appetite, probably because of the mildness of the high.</p><p>1:04: I definitely have a heightened sensitivity to music. Just turned on Deadmou5 Ghosts and Stuff. LOVE this. Electronic music is highly underappreciated. Its so complicated, layered, refined just indescribably incredible. I can feel this music in my whole body.</p><p>1:45: I listened to Radiohead for a while, and then just jacked around on the Internet. I feel pretty much sober now, but have a headache. Ive never gotten a headache from smoking marijuana. Im going to call this the end of the experience for now.</p><p>Summary: Overall it was comparable to a mild high from marijuana. A little bit disorienting, light-headedness, decreased ability to mentally focus, lifted mood, slight paranoia, and slight visual distortion. A heightened sensitivity to sound and music seemed the most pronounced of all the effects. I didnt have a dangerous reaction or a frightening experience at all, so Ill probably try it again some other time, but a larger dose. My goal this time wasnt to get super high, but to try a small dose, gauge my tolerance, and see if I liked it. Overall it was enjoyable, so I would like to try again with the goal of getting pretty stoned.</p>",
 "year": "2010",
 "id": "86324",
 "gender": "Female",
 "age": "20",
 "timestamp": "2011-10-15T07:00:00.000Z",
 "views": "5858",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids",
   "form": "(plant material)"
  }
 }
}
