{
 "id": 864,
 "title": "Or Am I Standing Still?",
 "date": {
  "submission": "2005-07-26T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "sighlence",
  "gender": "Female",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "4 oz",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Mental preparation. \rOne must remember this. Do not overhype the moment. Do not worry too much. Relax and let yourself drift.",
  "The first time I had done mushrooms, I had had a glowing time. Nothing to mind blowing or exciting, and I felt good enough after to consider doing it again. Out of the two grams I had from my initial taking, I had a good 0.75 grams left. Most of it being powder, it was probably closer to one gram of concentrated material.",
  "A week after my first trip, I decided to use up what I had left. I was leaving on a long three month trip in the next two weeks, and didn't want any illegal material hiding in my room for anyone to find. It was a spontaneous spur of the moment thing, and I was frankly more concerned about using the shrooms up as opposed to having a good time.",
  "I was hanging out with a few friends that night, going to see a favorite band at a favorite clubrelaxed, comfortable setting. I went to pick up my friend and informed her I would be taking off that night, so to speak. I showed her what I had left and she doubted the amount. 'Are you even going to feel anything on that?' I was adamant I'd at least feel half as good as my first time (ah, reflections on the second tab of X I took after that magical first time) and told her it didn't even really matter anyhow.",
  "We took off, and went to a bar beside the club to chill out and wait for my brother. We each sipped on a beer, and I took off to the women's washroom to take my dose. The Ziploc bag, jammed, crumpled and twisted, had really crunched up the poor little guys. I had a few stalks and a lot of powdergood, in hindsight. I took the bag and just crunched down on what was left. It's strange, maybe, but I enjoy the taste of the mushrooms, reminds me of grass or hay. I had a good little paste going, and had to swallow that with some water, but headed back out to the bar floor. My friend raised her eyebrows, I nodded, and slugged my beer back.",
  "About ten minutes later, we head out and pick up my brother. To give some background, this was the first real time I'd been out with my brother in a bar, ever. He was totally unaware I was high, or that I've ever been high. He's not a bar kinda guy, but I figured he might like to come out, as he gets along with my friends.",
  "We waited in line, and things were progressing well. The rest of my friends were 2 people behind us, and the line-up was moving smoothly. Then*bang*guest list people. About twenty-five people show up from NOWHERE, and hold up the line. That's when I start to get all gigglynot so much impatient though. I'm feeling a bit fuzzy, happy, not as cold as I should be for the snowy weather we were having.",
  "FINALLY get in, and I'm like a hound from hell, running to the dance floor. I'm in that state of awe when something first hits methe 'wow' feeling. No where near the good stuff, but feeling all right. I grab a double gin and tonic and sip on it periodically. It's not a drinking night, but I need something to hold onto as my hands tend to float away and clench if I'm not careful. I do not feel sick like I did the first time, maybe the alcohol helped? Thinking back, now, I hardly felt the effects of it at all.",
  "I talk to some people I know, walk around and explore as I often do. The music makes me feel like I'm tunnelling under the club. I'm trying to walk through the packed room, and am misjudging people's distances. My brother asks me why I'm meandering and walking strange. I stop and start in the crowd, unsure if they have stopped moving or ifoh wait, it's me, I realize as people shove past me. I'm chattier with people. Especially with my brother We were standing at the back of the room and he said something very out of character. It made me, in my messed up mind, think he had taken something as well. I think start to tell him about how 'I'm on something' and, due to the loud music, he mishears me. I freak out and change what I told him to 'I once took some stuff, you know' and he gets very disapproving and upset. He's two years my junior, but is a paramedic and does not believe in drug use at all. He starts to tell me about how he used to look up to me, and how I'm a bad person",
  "I run away, down to the bathroom. My female friend comes with me, and I stare at myself in the mirror for a while. The mirror is pulsing. I take my curly hair down from it's ponytail, and admire it's fluffiness. I touch it, and it's like the seeds that come off of a dandelion or pussywillow. My shirt deepens in color to be a dark pink, and my eyes look interminably greenthe bits I can see around my pupils anyhow.",
  "I then race back upstairs after my friend calms me, and chomp down on some gum. The menthol lifts me up, and I feel better. Then I see my ex-boyfriend across the room. I had broken up with him a few months previous, and he had taken it hard. It was not a good break up, I suppose. All of my friends and my brother go to talk to him. I stand in a corner, wondering what to do. I don't want to give him the wrong impression, but at the same time, I want to feel familiar and comforted by his presence, and I also am battling sympathetic feelings towards him.",
  "Finally, friend in tow, I go talk to him. I tell him right up front that I'm high. The music is pulsing through my body, and I'm trying not to run to the dance floor. Smells of weed and perfume are intoxicating, distracting. He's got a notebook and a pen, and I write for a bit. I don't talk too much, but mostly talk around him. I leave him, and try to focus on the feelings of deja vu I'm battling. I'm living out a dream I had had two nights previous about a waterfall and zoo, and want to try and tell someone, but can't explain it well enough. Time is racing beyond me, but I feel stuck in a zone.",
  "My brother, friend and I go to sit down. People walk past and grin at me, and only me, I feel. We are sitting under a blue light, and I turn to talk to my brother. I stare at him, without blinking and he mentions it. He does not notice my pupil dilation. As I stare at him, he turns into some sort of toad his skin a slight green/blue, and his acne red warts. It reminded me of Toad from 'X Men'. It upset me, and he was not very responsive to me wanting to hug or be friendly with him. I was really freaked out and so instead concentrated on some gridding that was happening to my right. There was a fence that was starting to cover the entire room. My vision was splitting a bit, and I was only able to hear half of what was going on at my table, as other people's conversations seemed to be coming in loud and clear. Everyone looked familiar to me, even if I had never met them. Jokes were twice as funny, and I felt wittier than usual.",
  "I then went to danceand danceand dance. Every time I closed my eyes, it's as if vines were growing over them. Ice crystals formed once, and the light I saw when I opened my eyes refracted more and more. I didn't necessarily feel like I was acting strange, but felt like others were. I thought almost everyone was high on something, and that everyone who looked at me knew I was, too. It was a sort of paranoia.",
  "As the night went on, I came down a little more, it wasn't a drop out of the sky episode. Three hours later, I was pretty much sober again, although really tired. I tried to eat at a diner, but found the people there too strange and the food too gross to eat. The next day, after a good sleep, I felt great. A few memory problems in the next few days, but I have a bad memory anyhow. I guess I can officially say I'm a shroom head now!"
 ],
 "erowid": {
  "id": "12421",
  "citation": " sighlence. \"Or Am I Standing Still?: experience with Alcohol & Mushrooms (ID 12421)\". Erowid.org. Jul 26, 2005. erowid.org/exp/12421",
  "substance": "Alcohol & Mushrooms",
  "views": "18367"
 }
}
