{
 "title": "This One is a Gem",
 "author": "Skullfarmer",
 "citation": " Skullfarmer. \"This One is a Gem: experience with 2C-D (ID 86422)\". Erowid.org. May 27, 2012. erowid.org/exp/86422",
 "substance": "2C-D",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "40 mg",
   "oral",
   "2C-D",
   "(powder / crystals)",
   " T+ 6:00",
   "1 mg",
   "oral",
   "Pharms - Phenazepam",
   ""
  ]
 ],
 "report": "<p>I am a well experienced psychedelic user with over a 100 or so misc trips, shrooms, lsd, doc, 4-aco-dipt, 5-meo-dmt, dpt, ayahausaca, dmt, amt, pfpp, 2C-C, 2C-E, 5-meo-dalt, mdma, mda, mdpv, methylone, salvia, harmine, mescaline and the usual rec drugs, coke, meth, different pills etc.</p><p>At about 10pm one evening I was sitting around the house in a good mood and decided to give it a go.</p><p>00:00: 40mgs was placed on tounge and drinked back with water. It didnt taste bad really.  Put my trippin playlist on my ipod , thru in my sporworks dvd and kicked back.</p><p>00:30: Feeling a slow crawl up my head like something was going to happen. Feelin a lil happy. No stomach discomfort.</p><p>01:00: Finally starting to get wavy visuals and tracers. Music is sounding good. Body feels great.</p><p>01:30: This has to be the peak. OEV's are going nuts! Everythings moving,swaying. The sporworks dvd is no longer trapped on my tv screen but has started to blend into the space around my tv. The music is provoking the sporworks visuals like they are communicating with each other. I close my eyes and the synergy produced by the music and the drug has caused me to lose touch with my physical self. CEV's are patterns of what I've been watching on the sporworks dvd. Very nice. Im at a full blown +3 at the moment and its super enjoyable.</p><p>02:00: more of the same. Awesome peak with awesome body feel that feels like the euphoria from 4-aco-dipt (without the twitches) or mescaline or mdma . I was easily able to achieve an erection so that was a plus!! Wish I had a girl trip partner ;-).Erotic feelings were not pouring out of me but they were there.</p><p>04:00: This shit is awesome!! Visuals still kickin ass and no, I REPEAT NO BODYLOAD WHATSOEVER. None of that painful, head tension/pressure I get with 2C-E, no negative brain loops that are common with 2C-E also. This also blows 2C-C out of the water completely. I may have received a bad batch of 2C-C back in the day cause all that shit gave me was pressure in head, pain in kidney area like I had been stabbed in my kidneys and everything looked fuzzy. 2C-Crap!! Sorry bout that, now back to 2C-Dy-no-mite! I cant believe Im still at the peak and no negative side effects, just pleasureable euphoric feelings with great visuals ala LSD .</p><p>05:00: finally I start to feel it begin to drop off. Within the next hour I still see OEV's but they are slowly becoming less pronounced. Thinking about the last 4 hours actually made me tear up because the experience was so beautiful and amazing. Felt like I won the lottery ;-)</p><p>06:00: I took 1 mg phenazpam and off to bed I went and sleep came soon. No writhing around in bed for hours wishing it would stop, unlike 2C-E.</p><p>In conclusion, I LOVE THIS STUFF!!! the next day I woke up with a very mild headache, ate 1 advil with breakfest and it was gone. No leftover side effects to speek of.</p><p>I cant compare it to 2C-I but its nothing like the chemical poison w/visuals and mind fuck called 2C-E. 2C-D comes on easy, peaks hard for almost 3 hours , with no mind fuck and glides back down to earth. This would be good to share with friends unlike 2C-E where for 8-10 hours Im stuck trying to figure out why ppl do what they do while hopeing the pressure in my head doesnt cause my head to pop off. I've taken 2C-E 6 times so I think I know it well enough ;-).</p><p>2C-D gets 4 thumbs way up. Its a gem!</p>",
 "year": "2010",
 "id": "86422",
 "gender": "Male",
 "age": "31",
 "timestamp": "2012-05-27T07:00:00.000Z",
 "views": "2802",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "2C-D",
   "form": "(powder / crystals)"
  }
 ]
}
