{
 "title": "Completely Open Mind",
 "author": "Josh",
 "citation": " Josh. \"Completely Open Mind: experience with Mushrooms - P. Cubensis (ID 86441)\". Erowid.org. Jul 30, 2010. erowid.org/exp/86441",
 "substance": "Mushrooms - P. Cubensis",
 "bodyweight": "200 lb",
 "report": "<p>I'll start off by giving a little bit of a background of myself. I was born and raised in Central Florida, and have been experimenting with mild altering substances for about 5 years (starting at the end of my 9th grade year of High School). I've used many different pharmaceuticals, and have experimented with moderate doses of DXM (600+ mg). I normally smoke pot a couple times a week, and that has been going on for about 2 years. I started smoking pot after my Freshman Year in High School, but until recently I was only smoking a few times a month.</p><p>I have taken Psilocybe Mushrooms on 3 different occasions, but I will only be talking about my most recent experience which was two days before this was written. The first time I tried mushrooms I did about 2.5 grams and had a great time, the second time I did around 3 grams and had an even greater time. For that reason, I decided that I wanted to experiment with a higher dose. My cousin (We'll call him N) decided that he had wanted to try mushrooms for his first time with me, so we acquired about 8 grams of dried Psilocybe Cubensis and split it 50/50. To prepare for our trip, I told my cousin to eat a good breakfast in the morning, and to try to eat a light lunch because this tends to help me with the abdominal discomfort that comes after ingesting the mushrooms.</p><p>At around 10:30 P.M. we each ingested roughly 4 grams of the mushrooms we acquired earlier that day, and chased the taste down with a glass of lemon juice. I told N that the mushrooms would take roughly an hour and a half to kick in, so we needed to find a way to occupy ourselves for the time being. About 30 minutes after taking the mushrooms I decided to go for a walk with my cousin to pass the time. After walking for about 30 minutes, N and I both started feeling 'Different', and our pupils began to dilate. I told N that the mushrooms would be kicking in full force shortly. We decided then to start heading back to his house before things got too hectic. The walk home was a lot longer than I remembered it being, and I began to sweat a lot. By the time we got home, we still weren't feeling much other than having the giggles, and the 'Bright' look that everything had.</p><p>T + 2:15</p><p>We decided to watch some TV to pass the time, I was starting to get worried that the mushrooms we had were of low quality because I was still barely feeling anything. I didn't mention that to N at the time because I didn't want to bum him out.</p><p>T + 2:45</p><p>After sitting around watching TV for another half hour, we decided to smoke a few bowls of 'K2 Pineapple Express Herbal Incense', which we purchased at a local gas station earlier that day. Roughly 10 minutes, and 2 bowls later the mushrooms finally started to kick in full force. The come-up was extremely fast, and it caught N and I by surprise. Within the same minute, N and I had both started peaking, which I found extremely odd. For the next 15 minutes we just sat on the floor and admired the beautiful world that we had just entered. Everything in his room was glowing, and everything that I looked at was made of wonderful tiny colorful patterns. N and I started talking about how much we loved each other, and how awesome it was that we finally got to experience mushrooms together. This lead us to the decision that this moment called for a hug.</p><p>T + 3:00</p><p>N and I sat around for a while and watched some Dragon Ball Z Kai on TV, and giggled about every little thing that happened. By this time, we were both having a great time, and were very relieved that the mushrooms had finally kicked in. While watching TV I noticed that any time I would look away, the picture from the TV would follow wherever I looked and it seemed as though the picture was still moving even though I wasn't looking at the TV anymore. The colors on the TV seemed brighter, and more saturated than ever. There also seemed to be bubbles floating around the screen, distorting everything that they passed. Everything in the room seemed to be floating in the air as if there was no gravity.</p><p>T + 4:00</p><p>At this point in the night, I was enjoying the visuals and brilliant colors that the mushrooms had introduced to me. I started to think deeply about the meaning of life (typical right?), and how things work. For what seemed like an eternity, I was trying to figure out how my brain communicated with my lungs/vocal chords/mouth to make me talk, and where personality came from. As much as I thought about it, I could not understand how the human body was capable of such amazing things. I found it very difficult to communicate with anyone other than N, because I thought that any sober person would not understand what I was feeling/thinking. N had a box of 'Airheads' that he bought earlier that week, and gave me a couple to eat. After every bite of the airhead I would say something like 'Best decision of my life' because I felt like they were the best candy I had ever eaten.</p><p>T + 5:30</p><p>N decided that he wanted to go lay down in bed and enjoy the rest of his trip by listening to his mp3 player and letting his mind wander. I prepared my bed on his floor and watched TV for the rest of the night. While laying down, I thought deeply about how to explain the whole experience in words, but was unsuccessful. The best way that I could describe the experience is to say this:</p><p>'The mushrooms don't cause me to see things such as large purple elephants, and talking trees. They basically take the things that I could already see, and give them a new, more brilliant and mysterious look. All the barriers in my mind that I never knew existed are removed, allowing my mind to wander anywhere it wants with no limitations. They also give me a new respect for the human mind, and the amazing world we live in.'</p>",
 "year": "2010",
 "id": "86441",
 "gender": "Male",
 "age": "18",
 "timestamp": "2010-07-30T07:00:00.000Z",
 "views": "2400",
 "dose": [
  {
   "time": "0",
   "amount": "4 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": " T+ 2:45",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids",
   "form": ""
  }
 ]
}
