{
 "title": "Terrifying, Will Never Touch It Again",
 "author": "tocxitcy",
 "citation": " tocxitcy. \"Terrifying, Will Never Touch It Again: experience with JWH-018 (ID 86486)\". Erowid.org. Oct 12, 2010. erowid.org/exp/86486",
 "substance": "JWH-018",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "JWH-018",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>After smoking K2/Spice/Etc for a while I decided to make my own to save some money.  Unfortunately the 99.9% pure JWH-018 arrived before the scale, etc arrived.  I'd read about the risks of smoking too much but decided to take it really slow and be careful.</p><p>My smoking apparatus was a small glass bong.  I lined the bowl with aluminum foil and used a pin to poke some holes in it.  Using the tip of a knife I eyeballed what I hoped would be 2mg or so.  I got high a couple times through the day like that and all was good.</p><p>In the evening I decided to try again but this time it wasn't working as good and it seemed like the jwh-018 was melting and dripping into the bong without being vaporized.  Now I'm not sure how many hits I served up but I do recall, at the end, taking two hits off the aluminum foil that lined the bowl, and in both cases I blew out huge clouds of smoke afterwards.</p><p>About 5 minutes later I realized I was higher than I'd ever been in my life, and I was still getting higher and higher.  And then it hit me:  I just overdosed.  My heart was beating so hard that I thought I was going to have a heart attack, and I decided that there was a good possibility that I would die from this.  I was overwhelmed by guilt, realizing that I'd just done the stupidest thing in my life and now I was going to pay for it.  I didn't want my friends, family, and girlfriend to know that I died from a drug overdose.  So I decided to get rid of everything.  I flushed the remaining jwh-018 down the toilet along with the bong stem and all the paperwork from my jwh order.  Now they would think that I just dropped dead out of the blue.</p><p>I came back to the living room and fired up my laptop.  I tried searching for 'jwh-018 toxicity' but I was no longer able to spell toxicity.  I realized that I was having a panic attack and after a few searches I read that breathing in/out of a paper bag would help.  Not having any paper bags, I tried with a garbage bag and it didn't work too good.</p><p>For the next 10-15 minutes I marched around the house chanting 'I'm not gonna die, I'm not gonna die, I'm gonna be ok, I'm gonna be ok'.  My heart was still racing but I wasn't able to count well enough to figure out my heart rate.</p><p>30 minutes after it all began, I realized that yes, I was going to be OK.  I ate some pizza, watched tv, and went to sleep.  The following day I felt like I was still high a little, and had some serious balance/coordination problems.</p><p>I realize that it was my own stupidity that got me in trouble, but nevertheless I will never touch this shit again.</p>",
 "year": "2010",
 "id": "86486",
 "gender": "Male",
 "age": "33",
 "timestamp": "2010-10-12T07:00:00.000Z",
 "views": "7454"
}
