{
 "title": "Perfect Little Pill",
 "author": "Flintstone",
 "citation": " Flintstone. \"Perfect Little Pill: experience with Oxymorphone (Opana) (ID 86535)\". Erowid.org. Aug 28, 2010. erowid.org/exp/86535",
 "substance": "Oxymorphone (Opana)",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "insufflated",
   "Pharms - Oxymorphone",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>I called my friend up and asked if he knew where to some oxycontin. He said he had something named opana and it was ridiculously strong. I had to try it considering I had never even heard of it before. It was quite expensive and he warned me not to take a whole one so he sold me half a pill, which was pretty cool. After I bought it off him he informed me that it is practically useless unless you snort it. Damn I hate snorting pills but I went ahead and crushed it up. It broke up quite easily.</p><p>I made two lines and snorted one up each nostril. I also found that this went down smoother than any other pill I have snorted. We then walked outside for a cigarette and I felt the intense feeling of opiods within 1 - 2 minutes. Already I could tell that this was going to be stronger than any other pain pill I have had. After 10 minutes, the euphoria was incredible. I was so happy and content as I sat on the couch doing nothing. The feeling still became stronger and stronger.</p><p>About an hour into it, I tried to send a text message but I could hardly see the screen. It was just too much to try and concentrate. I also found that after sitting for a while (30 - 45 minutes) I would start feeling very nauseous but standing up and walking around for a few minutes helped out a lot. As time continued to pass I began nodding off for probably about 30 seconds at a time. I just sat back with my face towards the ceiling.</p><p>At approximately 6 hours in I became extremely nauseous and this time walking wasn't going to help. I barely made it to the toilet before I was vomiting copious amounts. Strangely though, even while vomiting it really wasn't that unpleasant. I was just sort of opening my mouth and releasing the contents of my stomach. There was no heaving or force to it really involved. When I finished I got some water from the sink and swished some toothpaste around because he had no mouthwash. I went outside to smoke a cigarette and I was still feeling incredible. At 6 hour, it was only the peak of the high and had a long way to go.</p><p>I spent the evening sitting on my friends couch and listening to the conversation of everyone and only occasionally joining in. It just seemed like talking took more energy than I had to spare. All in all this high lasted about 12 hours or so. Opana is by far the most powerful pill I have ever had even comparing to very large doses of oxycontin and other things of that nature. I have never tried heroin but I have met people since this experience that say opana is better. The only downside to opana is the nausea and vomiting, which I of course said wasn't really that bad. Opana is definitely my favorite drug and trust me - I pay a lot for it but it is beyond worth it to me.</p>",
 "year": "2009",
 "id": "86535",
 "gender": "Male",
 "age": "21",
 "timestamp": "2010-08-28T07:00:00.000Z",
 "views": "25144",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxymorphone",
   "form": "(ground / crushed)"
  }
 ]
}
