{
 "title": "Speedy, But not Jagged",
 "author": "Phlash",
 "citation": " Phlash. \"Speedy, But not Jagged: experience with Calamus americanis (ID 8653)\". Erowid.org. Aug 8, 2001. erowid.org/exp/8653",
 "substance": "Calamus americanis",
 "bodyweight": "210 lb",
 "report": "<p>After searching the local riverbanks for several hours, we happened upon a sign that read 'Herb Farm'.  Short on luck, and looking for some of the North American Native's divination/healing plant, we opted to check it out.  They sold plants for $6 in a pot, fairly healthy (if a bit rootbound).  On the ride home, I decided to try chewing a leaf (VERY VERY BITTER!)  My tongue went slightly numb, and I spit it out of the truck's window.  About 7:00pm, we arrived back home, and decided to seperate the individual plants, while repotting them.  During seperation, there was about 3 inches of good solid root and quite a bit of smaller root structure that was removed and used.  Chewing the smaller roots proved to give a mild 'speedy' effect, but not as 'jagged' or rough as amphetamines or ephedra.  R, the other person trying it, decided to chew a 1.5 inch segment of the thicker root, making horrible faces the entire time.  He claimed it was disgustingly bitter, but after swallowing the taste dissapeared quickly.  I chewed and swallowed about 6 smaller roots, each roughly 4 inches in length, and was immediately in Fast Forward.  Things seemed different, and depth perception was odd.  If you've ever looked through a fisheye lens, the effect is somewhat the same.  My senses also seemed to perk up, as I could hear sirens that J couldn't (she was smoking cannibis and that's it).  The crickets sounded quite a bit louder, and everything looked simply clearer.  I ran upstairs, to retrieve my cigarettes and lighter, then ran back downstairs at a blistering pace.  Normally when I do this, I fall, bruise my knees, and look rather comical doing so.  This time, I had perfect balance, made each step precisely, and was quick to move.  It seemed I had peaked.  I started talking with K, and she burst out laughing at the pace of my speech (much quicker).  Yet, it was all very clearly enunciated and understandable.  Gradually, these effects subsided, and I began coming down.  But the effects lasted for nearly 1 hour 45 minutes.  I noticed being able to sit quietly, something not easy on chemical 'uppers'.  Yet, while sitting quietly, my senses apexed to the point of seeing each bird or insect whenever it chose to move.  Trees seemed not profound exactly, but the best way to describe it was 'woooowwww.... trees.'.  Strange for a speedier plant, but very nice.  The journey back to 'normal' was easy as well, not as rough on the mind or body as normal amphetamines and such.</p><p>I see now why the Native Americans used this for hunting.  Now if I could just make a tasty tea out of it, every modern hunter would love it as I do.  The effects lend themselves well to sitting still, but being very alert and aware of your surroundings or prey as the case may be.</p><p>A mild tightening of the stomach was also noted about 15 minutes after effects set, but this was almost ignorable while under the effect.  Also, unlike amphetamines or ephedra, it doesn't kill the appetite and would lend itself well to working with technical stuff or studying.</p>",
 "year": "2001",
 "id": "8653",
 "gender": "Male",
 "timestamp": "2001-08-08T07:00:00.000Z",
 "views": "21280",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "4 in",
   "administration": "oral",
   "substance": "Calamus",
   "form": "(roots)"
  }
 ]
}
