{
 "title": "Very Confused",
 "author": "jake",
 "citation": " jake. \"Very Confused: experience with Spice and Synthetic Cannabinoids ('Armageddon') (ID 86582)\". Erowid.org. Oct 12, 2010. erowid.org/exp/86582",
 "substance": "Spice and Synthetic Cannabinoids ('Armageddon')",
 "bodyweight": "175 lb",
 "report": "<p>I have smoked weed at least once a day for about a year....but as of late I have decided to stay clean in order to have a certain job that drug tests. Other guys from my work started to smoke different types of spice (Armagedon, Judgement Day, Green Budda, Spike, Spike Max, Spike Diamond, Freedom, and pep spice are all common in stores in Southern California).</p><p>I had smoked this stuff many times before this day, but something about this time was different. I got off work and stopped at a local smoke shop with a buddy to get a gram of our typical favorite, armagedon. The smoke shop had a type I had never seen. It was called Armagedon Pinnapple.</p><p>We got home and loaded my 2 foot bong with about half the bag, or around .5 grams. My friend and I passed the bong for the next 5 minutes, smoking rather fast. We were being observed by my friend's wife. 5 min into smoking she noticed that he was not talking, and that he seemed to have an overwhelmed look on his face. After being spoken to he would not talk to either me or his wife. He was just sitting there with a grin on his face. I just thought he was being a weirdo and brushed it off.</p><p>I got up from the couch where we had been smoking to go clean my bong. As soon as I stood up the high hit me hard....I had a very intense body high, that I can most compare to the effects of MDMA. As I started to rinse out my bong in the sink, I noticed I was having hallucinations. I watched my bongs glass change colors as the water was pouring over it. Everything looked membranous and breathing. At this point I was having a great time.</p><p>About 15 minutes later, my vision was starting blur as my heart rate increased to around 150 bpm. I got very hot and wanted to take a shower to cool my body.</p><p>Once I took off my clothes and got into a cold shower, I tried to adjust the water temp. I was so confused, and was having such trouble concentrating that I could not figure out how to adjust the water. I did manage to make the water so hot I could not stand the heat....so I just turned the water off and gave up. I thought something was wrong with the pipes. I was just very confused. I brought my roommate into the bathroom to see if she could figure out what was wrong with the shower. I showed her and it worked fine. When she left the bathroom, I tried to adjust the water again and I could only get it burning hot, or freezing cold. I was freaking out, by now over this. It was like I was in the twilight zone. I just did not feel right. I felt severe waves of paranoia, and again mass confusion.</p><p>This lasted for 2 hours, coming down slowly until I was normal again in 4 hours. I have not again had anything even similar to this effect on my body by any other spice, or even the same.</p>",
 "year": "2010",
 "id": "86582",
 "gender": "Male",
 "age": "21",
 "timestamp": "2010-10-12T07:00:00.000Z",
 "views": "5075",
 "dose": [
  {
   "time": "DOSE:",
   "amount": ".25 g",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  }
 ]
}
