{
 "id": 8664,
 "title": "My Clothes Felt Good",
 "date": {
  "submission": "2000-08-05T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Smokey Duroass",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I found out that my friend was going to be getting some ecstacy. I had never tried it, and I was a little hesitant about trying it at first. I had previously just stuck to weed, and this seemed to be a bit more of a hardcore drug. I eventually decided to drop, and drank it down with some orange juice. One of my friends had dropped an hour before me, so he was beginning to turn on when I dropped.",
  "Right after I droppped, we smoked a bowl. I was told this is one of the best ways to take it. It clams you down for an hour until the drug begins to take hold, so as you begin to go from high to stoned, the drug turns on. It was indeed a very smooth and enjoyable transition.",
  "About an hour later, I was sitting in my friends room getting ready to go out, and I began to turn on. The first feelings were weird and disorienting. I did not have trouble focusing on things when I kept my head still, but when I moved it, things went a little blurry (if you have ever seen Go, the part when the guy first starts turning on the apartment illustrates this feeling well). We then went out to go walk to a party. As we walked, the cool winter air felt good on my skin, like a hot summer day when you open the freezer. I lit up a cigarette, and the smoke felt good going down and back up my throat. I could barely even feel the smoke, but the motion of the air was nice.",
  "Then it really began to hit me. My clothes began to feel good against my skin. I went up to my friend who had recommended that I try the drug, and just yelled, 'Eric, aaahhhh!' I had no other way of telling him what was happening to me, but he knew exactly what I meant. It was an incredible feeling. We went into the party, and when we went out to the dance floor, I was incredibly drawn to the energy of all of the people dancing. I made me happy that all of these other people were having a good time, laughing and dancing. I loved it.",
  "Some of the people I was with were asked to leave, so went to another party where some of my other friends were. Soon would come the high point of my experience. I told some of my friends at the party that I was rolling, and one of them insisted that they do an airplane to me. I had no idea what this was, but it sounded interesting.",
  "They took me into a room that was carpeted, and the one guy began to 'blow me up.' He He moved his hands all around on my face, chest, shoulders, and back. It felt very good. He then said to fall back when he told me, and I did. It felt like I was falling back into a pillow. Another friend picked me up by my legs, and they began to swing me back and forth in the air. I felt like I was flying. They then began to slowly let me down to the ground, and when I was on the ground, my friend blew me up again. When he did this the second time, I had no knowledge of my body. All I could feel were the spots on my face where my riend was touching me. It was like I only existed where I was being touched. After he finished, I just lay there for a minute, and when I opened my eyes, they were all these people looking down a tme. I just looked up and smiled, thinking to myself, 'If you only knew.'",
  "I got up and began to rub my hands up and down my arms and hips and chest, because my clothes felt good against me. I loved it. Textures were awesome. I especially liked sweaters, becase they were soft but a little rough. I found myself shaking everyone's hand and feeling their arm as I wlaked away. I just wanted to touch everyone and feel everything. I went and sat down, and just felt my girlfriend's down jacket for about fifteen minutes while talking to some people. I was sitting next to a friend of mine (who had rolled before) and said, 'Dude, I'm not gay or anything, but your jeans feel good.' He just laughed. He knew.",
  "Soon after, I began to come down because my gilrfriend had dropped as well, but it never kicked in for her. Overall, from the time it turned on until the time I began to come down, it was only an hour, but seemed like an eternity. It is definitely something I would do again."
 ],
 "erowid": {
  "id": "511",
  "citation": " Smokey Duroass. \"My Clothes Felt Good: experience with Ecstasy (ID 511)\". Erowid.org. Aug 5, 2000. erowid.org/exp/511",
  "substance": "Ecstasy",
  "views": "6997"
 }
}
