{
 "title": "Insanity Drug",
 "author": "Galaga",
 "citation": " Galaga. \"Insanity Drug: experience with 4-Methylmethcathinone & Alcohol (ID 86689)\". Erowid.org. Feb 7, 2011. erowid.org/exp/86689",
 "substance": "4-Methylmethcathinone & Alcohol",
 "bodyweight": "155 lb",
 "report": "<p>THIS DRUG IS NUTS</p><p>I'll start from the beginning.</p><p>Me and my friends went to a random party down the block, and I ran into some other friends there randomly. My friend J was on this drug that he called 'Molly's hotter sister,' Molly as in MDMA. Then I ran into the guy selling it. This guy was tweaking out like crazy. His eyes were wide open and staring, he kept on licking his gums and his teeth and grinding his teeth, and he spoke in short, fast bursts.</p><p>I decided to buy it because I don't really give a fuck, and it was only twenty bucks. He called it Megatron and Molly's hotter sister, so I was expecting it to be like a stronger version of MDMA. I wanted to save it for a night that would be fun to roll, so I didn't take it until a couple weeks later. I was hanging out with some friends at the park, drinking beer, and we were going to go to this house show by a really sweet band, so I decided this would be as good a time as any to take it. I was going to swallow it, but my friends said I should snort it, so I cut 5 fat lines on an issue of The New Yorker and snorted them all in about 30 seconds. It pretty much felt the same as snorting MDMA. Instantly, things started going crazy. My vision got really clear and bright, my whole body went numb, and I got this weird static in my ears. My friends were all pretty sober, so I was feeling kind of awkward being super fucked up, but they told me not to worry and we left for this house, which was about three miles away. We went on bike.</p><p>The bike ride was amazing! My whole body felt great, my mind was racing, and I was clenching my teeth and swallowing a lot and basically acting like the guy I bought it from, but not quite so tweaked. The bike ride went normally, and we got to the house show, where about 75 people were sitting outside watching these guys doing this sort of lo-fi ambient set. The party was amazing, I felt great and talked to a lot of people, including some other people I know. They couldn't all tell I was on drugs, so I was holding my shit down pretty well. I drank about 5 beers and some whiskey, but I didn't really feel it at all. The cops came around 1 am, and so we went inside. They decided to move the show to another house, so we all biked over. I held it together for a while, but things get pretty hazy here. I remember sitting in a wheelchair and making a lot of jokes, and people were laughing a lot and I was on point pretty well. I was thinking fast, and I had this attitude that I didn't give a fuck about anything, so I was making fun of people and doing stupid stuff in general. Finally, around 3-4 am, the headlining band started playing. I bought 4 stiff drinks and slugged them back instantly, and then, while the band was playing, I was dancing and headbanging like a crazy person. This is when I started blacking out. The last thing I remember is picking up my bike and smashing it repeatedly against a car for no reason except that it was funny.</p><p>I woke up in my bed, undressed and everything, around 11:30 am. It was 85 degrees F and extremely humid and hazy. I didn't know where my bike was, and I still felt fucked up on this drug, except in a bad way. I felt agitated, and I couldn't act normally or think rationally. I walked three miles to the house where the show was, and my bike wasn't where I left it. I looked all around the house, even climbed a rusty barbed wire fence, but the doors were locked and the person there was a crust punk passed out on some cardboard in the halfpipe in the backyard. He hadn't seen my bike.</p><p>I decided to go buy a new bike at the store nearby, so I started walking over there. On my way I saw my bike locked to my friends bike on a pole. The back wheel was completely bent, the seat was fucked up, and the fork was bent pretty bad as well. My phone was dead at this point, so I couldn't call him to meet me, so I decided to buy a new bike anyways. I went to the store, but the bikes were all too expensive, so I started walking back to my friends house, another three mile walk. I knocked but he didn't answer. I started walking to another friend's house to use his phone, and I saw these rental bikes they have in the city, so I rented one. I biked to my other friend's house, used his phone, but I still couldn't get a hold of my friend who I was locked up with, so I just biked back to his house and tried ringing again. This time he answered, and we walked back to our bikes.</p><p>At this point, I felt like total shit. I was still clenching my teeth and feeling agitated, I was sweating like a pig, and dirty as fuck. We unlocked the bikes, and I brought it to a bike shop to work on it. It took me two hours to fix it, and then the back tire popped as I was riding home. WORST DAY EVER</p><p>In conclusion, I would never do this drug again. I destroyed my nice bike, and I felt depressed and shitty for two days afterwords. While it was the most amazing high I've ever had, it made me act insane and I think I could've done some really fucked up shit had I been in a different situation. I probably would have beaten someone to death, or seriously hurt myself in some way. I was blacked out from 4 am to 7 am, and I have no idea what I might have done in that time, except that I made some random calls at 6:40 am.</p><p>Basically, it's just not worth it.</p><p>Moral of the story: Don't do random drugs!</p>",
 "year": "2010",
 "id": "86689",
 "gender": "Male",
 "age": "21",
 "timestamp": "2011-02-07T08:00:00.000Z",
 "views": "8883",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol"
  },
  {
   "time": "",
   "amount": "",
   "administration": " ",
   "substance": "insufflated"
  }
 ]
}
