{
 "title": "To Be or Not to 6-APB?",
 "author": "giggly",
 "citation": " giggly. \"To Be or Not to 6-APB?: experience with 6-APB, Phenazepam & Kratom (ID 86746)\". Erowid.org. Sep 23, 2010. erowid.org/exp/86746",
 "substance": "6-APB, Phenazepam & Kratom",
 "bodyweight": "73 kg",
 "report": [
  "<p>I consider myself an experienced drug experimenter having used many drugs. These include; LSD, 5-meo-DALT, mushrooms (psilocybin & argaric), MDMA, speed, ketamine, tramadol, codeine, dihydrocodeine, weed, morphine hcl, diazpeam, kratom, diphenhydramine, DXM, gabapentin and mephedrone. I think that's the entire list but I could be missing one or two out. Suffice to say I'm no virgin when it comes to getting high and feel that my experience gives me the right to describe fairly accurately my encounter with the newest available legal high 6-apb (or its God awful pseudonym 'Benzo Fury'- please let's just call it 6-apb!!)",
  "After nearly 2 months of drug forum bullshit paranoia as to whether or not this substance even existed (some felt it was all hype and a scam) my 6-apb finally fell through my letterbox. Now, it was time to test if it lived up the hype.",
  "In short, the answer for me is yes. This substance is the real deal. Half a pellet hit me within 45 mins, a definite MDMAesque tinge to it; tightening of the jaw, increased body heat and a desire to engage in conversation. My eyes also increased in size and an aversion to eating was noted; a sure fire indicator of a stimulant.",
  "So I bit the bullet and took a full pellet about 1 hour later. About 45 mins later the effects increased dramatically; more jaw grinding, musical enhancement, TV funnier than usual, more sweating and muscle tightening. I also spent a couple of hours flirting madly with all my single female friends on Facebook, ha-ha! Think that some of it worked but I was flying at the time so it might just be my imagination! Still, harmless fun. Increasing the dose by another half-pellet 2 hours later led to a more out of body feeling, very reminiscent of the old skool mitsubishi speckled pills that were mixed with ketamine.",
  "All in all a very interesting experience. It might be because I staggered the dosage but I felt 6-apb lasted far longer than MDMA. However, it lacked the 'I wanna share my deepest, most profound insights with everyone in the room' thing that I get with MDMA. For some people this is a good thing. I've had nights on MDMA where I've talked about very personal shit with practical strangers then regretted it the next day. At least 6-apb restrains that particular urge, which may or may not be to everyone's taste.",
  "However, sleep was impossible, eye wiggles came and went and even 2.5mg of phenazepam and 7g of Super Green Kratom didn't work. Very frustrating but that's the price you pay. I also noticed a lack of sexual desire both coming-up and down. I also had difficulty in co-ordinating movement and a nasty sore head the next day. This was very troublesome when I realised I had to sign-on at the local job centre that afternoon after all the fireworks. However, I survived to tell the tale and felt relatively OK all things considered although the person doing the signing obviously knew I was on something, but, you know, fuck 'em!! It's my life and I'll damn well do what I want even if I'm outta work!!",
  "A word of warning though - don't underestimate this drug, it is quite strong enough and it will be very obvious to everyone you are on it. So save it for raves, concerts, nightclubs and house parties. Also, I noticed that it smelt strongly of carbolic soap, surely not a sign that this shit is healthy in the long run.",
  "Good luck everyone, enjoy the ride but don't stay on for too long!! Besides, governments all round the world will jump on the bandwagon and outlaw this newest of chemicals pretty soon - give it 6 months maximum. Peace, G.</p>"
 ],
 "year": "2010",
 "id": "86746",
 "gender": "Male",
 "age": "28",
 "views": "22152",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "6-APB"
  },
  {
   "time": " T+ 1:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "6-APB"
  },
  {
   "time": " T+ 2:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "6-APB"
  },
  {
   "time": " T+ 0:00",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "Pharms - Phenazepam"
  },
  {
   "time": " T+ 0:00",
   "amount": "7 g",
   "administration": "oral",
   "substance": "Kratom"
  }
 ],
 "submissionDate": "2010-09-23T07:00:00.000Z"
}
