{
 "id": 8676,
 "title": "My Panic Induced Epiphany",
 "date": {
  "submission": "2007-05-01T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "F-fresh",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "Too often, I laughed at difficult experience reports written about cannabis. I can understand the anxiety and panic of an altered state on someone unfamiliar in a psychedelic environment, however I thought I was much too experienced for these things to happen to me",
  "My night started like many others before that. Myself, and my two friends Mike and Adrian met up at Mikes house to cook some herb. A few weeks prior to this night, I, in a foolishly high stupor, knocked over our bong and broke the ash-catcher attachment. We were planning on picking up a new one tonight, and headed downtown to run our errands. We ended up buying a whole new bong through impulse, and without a doubt this bong was far superior to our old one.",
  "Rushing home, excited to try it out, Mike and Adrian quickly packed bowls of our finest and were out to lunch. My turn brought a decision of what to smoke. Going with my philosophy of go big or go home I decided to drop it like its hot, and smoke our finest product. I packed a base of house indica, with Juicy Fruit and potent honey oil on top. In a blaze of glory, I took my bowl in the biggest hit of my life.",
  "My lungs burned like never before, gasping, I tried to inhale but it felt like my lungs were rejecting the air, only wanting to cough. It felt like my lungs were dry-heaving.  I broke out into a sweat and felt very light headed. Im going to be fucking high in like 10 minutes, I thought to myself casually. Deciding on a change of venue, I went to get some water and sat down on the bed while the boys played PS2.",
  "As I sat there analyzing my high thus far, I knew this was going to be one for the record books. As my heart was beating faster and I was getting higher, I tried to think of how often Ive been this fucked to calm myself down. Those who know me know that Im one to preach about keeping your shit together, meaning, dont make a fool of yourself when your dosed on any plants, chemicals or drugs.",
  "Letting the music take me through psychedelic thought, I, for the first time, thought about terrible things. As my heart beat faster, and my lungs still burned, I started to get nervous. Peaking on my high for the night, all my negative thoughts swelled until it hit me like a tonne of bricks. I felt tremendous guilt for the life of excess that I lead. I had recently started dealing, and these thoughts of myself not being able to turn back to a normal life really frightened me. I thought of myself dying of lung cancer, the pain and suffering on my family and myself and my health. I thought of my mother, slowly growing old, shamed at what her perfect son had become if she only knew. I thought about how my parents having given me everything, and how Im just fucking off at school, doing poorly and getting wasted everyday.",
  "Every song that played on mikes computer went along perfectly with what I was feeling, the lyrics seemed to speak to me, and my conscious cried out never again! I remember reading an experience report about a seriously addicted Heroin user who said once you know you have a problem, your high is never the same. All these thoughts were very powerful to me, I was sick with emotion and felt that I had truly experienced an epiphany.",
  "When finally, (for those who are interested) the song Gone Till November  Wyclef Jean played and in an instantit all started to melt away. The melody soothed my jangled soul, and the lyrics made me think of hope and turning a new leaf.",
  "Mike, Adrian and I went to get pizza, and I went along and enjoyed it, unbeknown to them that I had the most powerful experience from weed Ive ever had."
 ],
 "erowid": {
  "id": "51165",
  "citation": " F-fresh. \"My Panic Induced Epiphany: experience with Cannabis (ID 51165)\". Erowid.org. May 1, 2007. erowid.org/exp/51165",
  "substance": "Cannabis",
  "views": "2605"
 }
}
