{
 "id": 8679,
 "title": "HBWR Disaster",
 "date": {
  "submission": "2002-01-11T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "KCM19",
  "gender": "Male",
  "weight": 102
 },
 "dose": [
  {
   "time": "0",
   "amount": "9 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 ],
 "report": [
  "Several days ago, I ate 9 HBWR seeds I obtained from an online catalog. They tasted pretty foul, but I chewed each one thoroughly before swallowing. That was at 12:30 PM.",
  "I expected nausea, and that's what I got. Starting about 30 minutes after I ate them my stomach felt terrible and I got very very tired. I lay on my couch with some friends, none of whom were tripping, just trying to ride out the nausea and waiting for some more positive effects. I felt like I wanted to sleep, but when I tried to, the discomfort from the nausea was too great, so I just lay there for quite some time.",
  "Around 5:00 PM, I got up and walked about a block to a benefit dinner I had purchased a ticket for. I knew I didn't want to eat anything, but I figured I might as well make an appearance.",
  "Waiting in line to get into the dinner, my nausea started getting more and more acute. By the time I realized I had better find a bathroom to vomit in, my vision blacked out and the next thing I remember is opening my eyes and looking up and people crowded around me. I got up, very disoriented and frightened, and sat down on a couch nearby. The drug had really kicked in at this point, and hitting my head as hard as I did on the ground didn't really help a whole lot. People were talking about calling paramedics, and someone did call college security, who arrived within minutes and talked to me. I was tripping hard enough to make talking to pseudo-law enforcement a really trying experience. I had to convince them that I was fine, that this sort of thing had happened before, that I just needed to go back to my dorm and drink some water, etc. They wanted me to go to the hospital but I was afraid of legal repercussions etc. I know HBWR isn't illegal, but at this point and in my condition it seemed like anything could happen and that I would be headed to jail if I didn't get out of there fast.",
  "Anyway, I did manage to convince them I was all right, something I myself wasn't that sure of. I got back to my bedroom and spent the next 12 hours in an awful, spinning, paranoid hell, hearing (hallucinating) the police come into the room, the ambulances waiting outside, my friends telling the police it was acid, etc.",
  "Basically it was the most miserable day I can remember by far. So if you decide to experiment with these seeds, remember that unless you have done them before you don't know what their effect is going to be on your body. Above all, don't put yourself into a dangerous situation like I did. I could easily have hit my head on something sharp when I fainted, rather than just on a carpeted floor. Be careful everyone. These plants can be a lot of fun but you can mess yourself up pretty bad without even realizing what's going on.",
  "I sound like an old man, I know, but I'm 18 and I just hope that no one else will have as bad an experience as I did. Read the info on the net and take the whole thing seriously."
 ],
 "erowid": {
  "id": "5119",
  "citation": " KCM19. \"HBWR Disaster: experience with H.B. Woodrose Seeds (ID 5119)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5119",
  "substance": "H.B. Woodrose Seeds",
  "views": "21155"
 }
}
