{
 "id": 8682,
 "title": "Old Traditions Yield Modern Results",
 "date": {
  "submission": "2007-09-08T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Jinx",
  "gender": "Male",
  "weight": "230 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(tar / resin)"
  },
  {
   "time": " T+ 0:15",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(tar / resin)"
  },
  {
   "time": " T+ 0:40",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(tar / resin)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>My recipe was fairly simple: Approximately three tablespoons of finely ground, good commercial grade marijuana, and 70% diluted Isopropyl alcohol (30% water). I used a mason jar as my container. I carefully spooned the powder into the bottom of the jar, careful because the finely ground grass dust likes to stick to the glass and its hard to get off. I then carefully poured in enough alcohol to just cover the ground grass. I let it soak in my bathroom closet for approximately twenty-hours. I then strained it into a small, medium high casserole dish and set it by the heater vent to evaporate. I used a fine metal mesh fry pan splash protector.",
  "After it dried I scraped out the resin. I was worried for a moment because Id read it was supposed to be black to golden brown in color, but mine was green. As soon as I got enough to roll into a little ball it turned black. It has an odd consistency, a little drier than opium. I used approximately three tablespoons of fine ground, good commercial grade grass and gotten a yield of between a gram, gram and a half (a bit over the weight of a large paper clip, which I think this the approximation for a gram anyhow). Read the Conclusion section to view my thoughts on whether this is a good way to conserve on grass. I was told/read that it can be very economic to turn half, or all of you stash into hashish.",
  "Adult Male, 230 lbs",
  "Consumed: (2x) 1 milligram hashish (a nice little dollop on a pinhead) on top half an average bowl pack.",
  "6oz of red wine (about 13% alcohol).",
  "Condition: Relaxed, excited. Id slept in way late, like 2pm, and didnt really do anything all day except smoke two pinner joints and listen to music. But, I am a graduate student during the week so there is always an element of stress in my life. Id also had a beer or two through out the day. However, Id dinner shortly before I smoked and was basically sober (that weird feeling one gets after smoking early in the day, then not for six hours or so).",
  "T+0 I take a monster rip off my little glass pipe. I watch the bowl and can see the hash burning/boiling away. The smoke was viscous, but surprisingly cool. The hashish actually burned before the grass, I am somewhat concerned it may have been residual alcohol. The first rip was kind of bizarre, being fairly cool but very harsh. I coughed for about a minute and a half, nothing terrible. Im a half a pack a day smoker, plus my grass consumption which is also daily. I dont know if it was the coughing or not but I got a huge head rush for about thirty seconds and felt like a trip was coming on. These sensations died off fairly quickly.",
  "T+15 minutes: I took about two more large hits and most of the grass was gone, but I think there is still some hashish left in there. Its a very clear body high, not too cerebral. Right after the last hit the high was extremely intense for a while, all body though. It almost felt like a hard roll and being drunk at the same time. ",
  "T+30 Listening to music and writing this report. Nice mild body high has gotten slowly more cerebral. My vision is a little fuzzy and its hard to focus my sight, but this happens at times just smoking bud. Probably going to try a little more before the next check in.",
  "T+40 OK, this stuff is officially harsh. Just packed another 1/3-1/2 bowl of dry grass and another dollop on a pinhead size of hashish. I didnt cough as much as the first time, but damn. I defiantly felt the effects soon after the hit. I hit it, coughed after holding the smoke for 45 seconds maybe. I coughed for about thirty seconds. Sat for a minute or two and thought, Wow, Im way more high than I was a minute ago.",
  "T+55 I beginning to think it might be worth packing a batch once a month. It would be handy if I were low on bud. Putting a pinhead dollop or two on top of even half a bowl will get me a very pleasant buzz. Id imagine I can probably get bombed on this stuff. I may give a go to trying a larger chunk of hashish this evening. Getting extremely high as I type, pleasant pressure in the base of my skull sends rushing waves of through my body. Great auditory stimulation. Ive got some nervous twitches, but I dont feel paranoid. The high is certainly getting a little trippy. Major rush passed, pleasant skull pressure still present.",
  "T+65 Smoked the remainder of the second bowl. Feeling great.",
  "Recipe Conclusions: ",
  "Its a simple recipe with a good yield and a nice mellow high. It is the kind of high that cannabis has, but 3-5 times more powerful.",
  "Various Final Thoughts:",
  "Im still not ready to commit to the fact that this will help you conserve weed, but itd be worth doing a large batch (1/8 once dry material IMHO) and having it around to spruce up your before bed-time bowl. And these days arent you the connected party host when you break out *GASP* hashish! I live in the mid-west and I have never been able to find it, nor had I tried it before making it myself. I could really get blasted on this stuff, like getting rock-star wasted. Also, it is a lot more inconspicuous to carry. I could easily carry ten grams of it. A small chunk, about the size of a hershy bar section, could easily get six people (probably eight even) as high as they want.</p>"
 ],
 "erowid": {
  "id": "51198",
  "citation": " Jinx. \"Old Traditions Yield Modern Results: experience with Cannibus - Hashish (ID 51198)\". Erowid.org. Sep 8, 2007. erowid.org/exp/51198",
  "substance": "Cannibus - Hashish",
  "views": "8847"
 }
}
