{
 "id": 8685,
 "title": "Stomach Load",
 "date": {
  "submission": "2009-01-12T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Psychotr0pik",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(capsule)"
  }
 ],
 "report": [
  "Well, i opened the bag containing the stuff then ,eyed ball it in a capsule that i ate at 13:00",
  "At t+2 i noticed visuals on my comp",
  "At t+4 i couldnt stay anywhere so i decided so go to bed, and what i can say is that stomach discumfurt is so bad that it becomes hell.",
  "One intersting point about that stuff is when looking oneself face into a mirror, i was able to control the visual about my own face, focusing into my right eye.",
  "This Worked instantly and i could look like what i was feeling, sometimes dark visuals (like becoming some kind of dark monster) sometimes a beautiful boy.",
  "Well hard to explain, but it seemed my own spirit was sending orders through my right pupil, then receiving it and computing it into appropriate visuals ...",
  "Kinda funny no ???",
  "After that my brain was really tired but the effect did not go away and i really wanted it to go out of my body.",
  "I felt like this substance was in every cells of my body, like some kind of intoxication (not very pleasant to me).",
  "At t+9 it became to go out, i went to sleep after having taken 1500 mg of aspirin and at 3:00 AM a big stomach cramp woke me up: waaaah please stop that!!! I wanna sleep !!!!",
  "2CE said me bye bye and then i slept normally.",
  "Finally, this stuff is no fun, and it hurts to much to have a good trip.",
  "But what one can discover can be interesting, well, anyway the stuff went into toilets because i dont want to spoil a Saturday anymore like that."
 ],
 "erowid": {
  "id": "51205",
  "citation": " Psychotr0pik. \"Stomach Load: experience with 2C-E (ID 51205)\". Erowid.org. Jan 12, 2009. erowid.org/exp/51205",
  "substance": "2C-E",
  "views": "6989"
 }
}
