{
 "title": "Jedi Mind Tricks",
 "author": "Ben Kenobi",
 "citation": " Ben Kenobi. \"Jedi Mind Tricks: experience with LSD, Mushrooms, Cannabis & MDMA (Ecstasy) (ID 86863)\". Erowid.org. May 18, 2011. erowid.org/exp/86863",
 "substance": "LSD, Mushrooms, Cannabis & MDMA (Ecstasy)",
 "bodyweight": "135 lb",
 "report": "<p>Esthetic Evolution. The hippest among us describe it as the single most exciting event in our great state of Idaho (although, thats probably not the most difficult title to attain).  Every year come June the isolated hick settlement of Twin Springs (Population: 5) gets swarmed by a thousand ravers, Burning Man veterans, e-tards, drunkards, acid freaks and other various individuals that the County Sheriffs would most certainly frown upon. Set upon the top of a grassy plateau, with rivers below and mountains above, the scenic location becomes the center for a community built fundamentally on the principle of self-expression, in true Burning Man spirit.  People are given the opportunity to build their own self-contained, autonomous society with its own aesthetic and ethical standards.  Nothing is forbidden.  Everything is permitted.</p><p>The sets of music each night go from 7 PM to 7 AM.  I knew that I would need a lot of chemical energy to get through that much music.  The first night I conserved my energy.  I dropped a hit of my sugar cube LSD to gauge its potency.  The trip was average, but I needed a gram-full pot brownie to really get me going.  I went to a sleep at a conservative 4 AM, partly to conserve my energy for the next night, and mostly because there was a lot of THC in my system and I had little choice.  The second night was going to be the main event.  Jedi Flipping.  Ive found few recorded cases on the mixture of LSD, Mushrooms, and Ecstasy, so I decided it was territory I needed to explore on my own accord.  Besides, who wouldnt want to be a Jedi?  Its not like Id be the only one at the festival completely twisted on hallucinogens.</p><p>I had a pretty good inkling of what Jedi Flipping was going to do to me, and I knew it would be above and beyond anything else Id experienced up to that point.  And, at the ripe old age of 17, I was not exactly inexperienced with mind-bending drugs.  Id had around 25 mushroom trips, 5 acid trips, and 5 experiences with MDMA (but always in the form of molly before this).  Id hippy flipped once, candy flipped once, wasted a lot of time getting stoned, and experimented with a few other oddities (Salvia, Morning Glories, Hawaiian Baby Woodrose).  The shit I steered clear of was alcohol (for the most part), opiates, and hard stimulants.  But if it had the potential to be mind opening, I wanted to try it.  Ever since first reading Huxleys The Doors of Perception, in 8th grade, I wanted to chase ultimate psychedelic experience.  In my area, these drugs are by no means easy to come by (although I learned the hard way its easy to get ripped off).  I stumbled onto pot in my search, but wasnt able to get any illegal psychedelics until the summer between Sophomore and Junior year.  Junior year saw great escalation in my psychedelic drug use.  First mushrooms, then acid and ecstasy as they began circulating.  I liked tripping.  I wanted to trip in every possible set and setting, just to see the different directions my mind would go.  Id trip with small circles of friends, Id trip at large parties, Id trip alone, Id trip while seeing a gig, Id trip while playing a gig, Id trip at school, Id trip in nature, Id trip at 3D movies, Id trip any day and any way.</p><p>But thats more than enough about me.</p><p>The Esthetic Evolution experience is primarily a social experiment, so its just as important for you to get to know my friends.</p><p>First there was The Prince of Persia, or Prince for short.  The nickname came from the fact that hes half-Persian, off-white in a state completely dominated by Caucasians.  Me and him go way back.  Back to the days of the elementary school playground, back to junior high when we first started playing our guitars together, back to starting our first band in high school, and all the while getting into smoking dope, shrooming, and rolling together.  The night of my Jedi Flip would be Princes first time on LSD (though not for lack of trying, wed had experience getting ripped off together too).  Hed done shrooms quite a few times, so I told him to go ahead and opt for two hits for optimum visceral experience, and he planned to take his ecstasy on the comedown.</p><p>Next we have J-Nug, quite possibly my favorite person in the world, and certainly the funniest motherfucker Ive ever met.  Most people tell jokes, but J-Nug lives a joke (and at everyone elses expense).  Many who meet think hes a douchebag, which probably stems from his habit of insulting everyone around him.  But largely, its a persona hes taken on for his own personal amusement.  Blonde-haired, blue-eyed, and wearing a superheros cape around the festival, he looked like the high, drunken badass he was.  Even though hed very conspicuously spoken about his love of gettin faded for years, it wasnt until a few weeks before Esthetic that he actually began drinking or smoking, and he certainly wasnt at a stage where he was getting into shrooms, cid, or X.  Still, considering he was a relative newcomer to substances he could hold is own with the best of them.</p><p>Then there was Jersey.  Hes from Jersey.  And hell let you know (usually by saying Im from fuckin Jersey!).  Hes just about as nice a kid as youll ever meet.  However, as much as we like hanging out with him sober, when you put any amount of mind-altering substance in his body and he can turn into a total babbling idiot.  He becomes like a horribly well-intentioned retard you dont have the heart to tell to shut up, projecting every goddamn thought that pops into his head.  He had gotten earned some derisive nicknames in his time.  One of them being The Two-Beer Queer, fairly indicative of Jerseys chronic condition of total lightweightedness.   But Jersey was also convinced that he wanted some LSD for the night.  I wasnt sure whether it was a good idea, but there was really only one way to find out.  What the hell, I figured, if youre good for the money Ill give you a dose.  As J-Nug so eloquently put it, The One-Drag Fag frying on acid?  That is gonna be a fucking sight.</p><p>And finally, there was D.  D doesnt have any dumb nicknames, so I guess he just gets to have his name shortened to one letter.  Hes the one who gave us a ride up in his big ol Suburban, The Red Rocket.  He was Jerseys best friend and the group Mom, too.  Always wanting to know everyone was all right.  If you were on powerful drugs and you werent in Ds sight, then in his mind you had either died or were in the process of dying. The top priority was to ensure your safety.  Im not sure what the trip wouldve been like without him there to look out for us.</p><p>Enough background for you?  Shit man, you have no patience.  Im getting to the exciting stuff.</p><p>________________________________________________________________________</p><p>Saturday, June 19 2010.  7:30 PM.</p><p>We all take our acid.  Sugar cubes dissolve nice and quick, its not like blotter where I'm swirling the tabs around under my tongue for five or ten minutes.  Pop a cube in my mouth and a minute later Ill have nothing but a residual sweet taste and the satisfying knowledge that I have 100 micrograms soaking into my system. </p><p>Three hits seems like a good dose for me.  I figured with a day-after tolerance Id need to double my dose to get effects comparable to last nights trip.  And why not drop another for good measure?  Theres nothing to lose.  Prince has had his two hits.  Jerseys dropped his.  Shit, I dont know about that kid though.  Well see how this goes.</p><p>Weve been sitting around camp getting stoned all day.  Its not as interesting as it sounds (and it doesnt sound that interesting), but it provided some much needed R&R.</p><p>A little more sitting around, and the initial effects are coming on.  It starts off softly.  My vision gets sharper.  Everything comes at me crystal clear.  Its a feeling like Ive spent my whole life looking at the world through one window pane, and somebody just sprayed some windex on it and wiped it down.  This acid is clean, too.  Theres very little body tension, just that oddly euphoric psychedelic energy that comes in sheets through my whole body.  Its not speedy by any means, just a feeling that every action is performed with great purpose.  It wont be long now until Im launched into outer space.</p><p>We can hear the first pulses of the electronic music in the distance.  J-Nug is sipping on some bizarrely appetizing mixture of Tiki Punch and Vodka.</p><p>I hope it gets more poppin up there tonight, he says, looking lazily up towards the source of the music.</p><p>I dunno man, it was pretty poppin up there last night, I tell him.  In reality, its not like I could judge.  I was tripping balls last night.  Pot has a way of bringing out everything thats weird about an acid trip (and acid has some weird places to take me).  My immediate physical surroundings were not of the biggest concern to me when I was raving</p><p>Yeah, I know it was poppin last night, J-Nug says, I just hope it gets more poppin is all.</p><p>Jersey is looking off in the opposite direction.  Across a dirt road, theres an old school bus thats been completely spray painted over with Alice in Wonderland themed graffiti.  Its got a flat deck strapped to the top and a couple couches and chairs where people can lounge.</p><p>Bro, that looks sick, Jersey says.  Im gonna go kick it up there.</p><p>Im coming with you, D adds, hurrying to catch up to him.</p><p>Me and J-Nug follow suit.</p><p>Prince has been sitting in the drivers seat of the Red Rocket ever since we dropped our acid.  Hes starting to look a little zoned.  You comin man? I holler through the car window.</p><p>Naw, man. I think he trails off, looking like hes carefully considering something. I think Im just gonna sit in here.</p><p>I shrug.  Thats cool.</p><p>We walk across the road and climb up a ladder propped on the side of the bus.  As I pop over the last rung, I see a girl on one of the couches waving a peacocks feather in circles a few inches from her face.  Shes entranced.  She looks serene.  She must be on LSD.</p><p>Jersey sits down by her on the couch and begins to strike up a conversation.  I dont pay attention; Im sitting on the edge of the bus and letting my legs dangle, sitting in silence with J-Nug while he munches on a bowl of dry Frosted Flakes.</p><p>I look out over the camp.  What an incredible sight.  People are wandering around in lavish costumes.  Its nice to see people as fucked up, freaked out, and into drugs as I am.  Some of them have it together.  Others dont.  Some are curiously roaming around with eyes glazed over, while others have let their minds deteriorate to a more primal state.  Theyre running and jumping, screaming and yelling, acting on every single impulse.</p><p>I look up at J-Nug.  It is going to get fucking wild tonight, man.</p><p>He doesnt look back, but he nods in acknowledgement.  Hes more focused on his Frosted Flakes.  I look back over the grassy plateau.  The sun is setting over the mountains, casting subtle shades of violet across the sky.  I focus on the peaks and see them like a time-lapse photograph.  Over the course of a few seconds I can see hundreds of trees sprout up, grow, flourish, reach their peak, and then slowly wither and die before completely disappearing.  There is already a certain fractal nature to the geometry of a mountain face.  This becomes greatly exaggerated while tripping.  As the light of the sun shines down through the cracks of the rock face, the sensory input hits me in two discernable planes of geometric patterns.  Its sort of like the end of 2001: A Space Odyssey.  Thank God for the third hit.  Acid visuals are always grand, but this is nothing short of spectacular.  And to think, Im still just coming up.</p><p>At this point, J-Nug has stuck his entire face into his plastic bowl of Frosted Flakes.</p><p>I want to divert his attention towards the sunset.  Would you look at that, man?</p><p>That is nice, he admits.</p><p>He looks back down at his Frosted Flakes.  I can tell hes about to stick his face in again, but then looks back at me.</p><p>I mean, that is fuckin nice, man.  He doesnt want me to doubt his sincerity.</p><p>Dude, Prince has just been sitting in the car for like thirty minutes, D points out.</p><p>I look over towards our camp.  Yeah.  I better go check on him.</p><p>I walk over to the Red Rocket and Prince is staring intently at the logo on the center of the steering wheel.</p><p>I open the passengers side door.  You all good?</p><p>His concentration on the logo is broken.  He looks away, towards me.  Yeah.</p><p>Your acid kicked in?</p><p>He looks at me like I just asked if the sky was blue.  Yes.</p><p>Yeah, mine too, I giggle.  You shouldve fucking seen it on top of that bus, man.</p><p>Yeah.  He pauses and stares into the distance, choosing his next words carefully.  I guess I just didnt really want to be around Jersey when I was coming up.  I mean, I can get a little uncomfortable when he gets the way he does, yknow?  I just didnt want to start the trip off in a bad way.</p><p>I got you, man, dont worry about it.  He seems to be handling the acid well so far, though.  I feel the suspension sink down in the back of the car.  J-Nug, Jersey, and D are sitting on the bumper, talking to our next-door neighbor while he smokes a cigarette.</p><p>Its bizarre to see him up and about.  The night before he and his friends from Oregon had a vial of some fairly weak acid. In something of a drunken stupor, this neighbor thought it was a good idea to drink everything they had left, a good half a vial.  He claims to have no recollection of the next ten hours, but I personally watched him lie underneath the shade of our car, getting up only on occasion to pace back and forth and forcefully vomit clear liquid.  It was as though hed only taken time to put two things in his system: drugs and water, and his body was violently rejecting both.  Luckily, he seems to have fully pieced his mind back together.</p><p>Prince and I get out of the car and join the party.</p><p>Whats up guys?  I give my psychedelically inclined neighbor an obligatory nod.  He nods back, cancer stick dangling from the corner of his mouth.</p><p>Jersey turns to Prince and I.  Dude, is it normal that Im not feeling my acid yet if you guys are?</p><p>Well, you gotta remember that we had more than you, so we came up harder and faster.  But from my observations of the past forty minutes, Jersey had been just as bug-eyed and giggly as the rest of us.  Hes fallen into a common syndrome for a newcoming tripper.  I think youre feeling your acid, dude.  You just dont realize it.</p><p>Jersey looks confused and annoyed at the response.  But I thought I was going to see cartoons?</p><p>Our neighbor chuckles.  Is it his first time?</p><p>Yeah.</p><p>He turns to Jersey.  Its not like you think.  Its not like any other drug.  Theres no definitive moment when it hits you. It creeps up gradually and kicks your ass before you know it.  A lot of it starts with you just getting into the body high and letting your mind wander, and then youll stop thinking altogether.  You just need accept the fact that youre frying, because all you have to do is go with it.</p><p>This motherfucker actually knows what hes talking about.</p><p>Jersey still isnt convinced, I just want to take it to the next level.  He turns to me, Ive got the money, could I please get one more hit off you?</p><p>Shit! I yell in frustration.  I just got ten hits yesterday, and now Im down to one.</p><p>Look man,' I try to level with Jersey.  Im a greedy motherfucker, and I wasnt exactly planning on having all my acid eaten within a day of getting it.  If you want to take your trip to the next level, you should smoke.</p><p>Hmmm on second thought, Ive seen Jersey smoke before.  Maybe thats not a good idea for him.  I mean, pot and shrooms go great together, but pot and LSD can be a very odd and dangerous combination.  Especially if youre the One-Drag Fag.  I reconsider the proposition.  WellI trail off.  I guess its not like that one hit would do me that much good anyhow.</p><p>I am definitely glad I opted for the second hit, Prince chimes in. </p><p>and Ive got the money Jersey reminds me.</p><p>I mull it over in my brain.  Jersey is looking up at me pleadingly, anxiously.  I carefully consider the circumstances.</p><p>Fuck! I finally burst out.  Go ahead.  The last hits in that big red water bottle in the tent.'</p><p>THANK YOU! Jersey practically runs back there.</p><p>Such incredible generosity, our neighbor says, sarcastically, as he extinguishes the butt of his cigarette on his cars bumper.</p><p>I pretend I didnt hear him.</p><p>D looks at me.  Yeah, man.  You dont need that hit.  I mean, how many shrooms are you going to take tonight anyhow?</p><p>The neighbor looks up, with a newfound interest in our affairs.</p><p>Ive got a little less than an eighth.</p><p>The neighbor raises his eyebrows.</p><p>D is shaking is head in disbelief.  Jesus Christ 3 hits of acid, an eighth of shrooms, and all that ecstasy too? Just do me a favor and please dont die, ok?</p><p>The neighbor lets out a low laugh.  Jedi flipping, dude?</p><p>I look over and he flashes me one of those rare smiles you encounter to varying degrees throughout your life.  The kind you get from someone who knows exactly where youre coming from and what youre going through.  The kind of smile that goes up into the eyes, making them narrow on the face.  The smile of shared experience.</p><p>You are in for one helluva time.</p><p>Saturday, June 19 2010.  9:30 PM</p><p>The second hit of acid wound up hitting Jersey pretty hard.</p><p>He was looking at me with his eyes half shut, speaking blissfully.  Oh man.  I just feel so good its just like my whole body is</p><p>He trailed off; his train of thought got derailed.  I know the feeling.</p><p>After some time his smile melted away and he began to look very solemn.  His eyes opened wider and wider, until I thought theyd pop out of his skull.   My whole body is. FUCKING!</p><p>The final word had a force that nearly knocked me off balance.  Shit, I wouldnt have been surprised if it had.  Everything around me was warping, swirling, growing and then shrinking again.  My brain had turned to rubber and was being stretched out for miles in every imaginable direction.</p><p>It took a second for what Jersey had said to set in.  When it did, a laugh escaped me from the inside out.  It kept going until my eyes started to water.</p><p>I yelled back behind me,  Prince, you gotta check this kid out, man!</p><p>But it was too late.  I had turned away from Jersey for two seconds, and when I turned back around he was sprinting away in the opposite direction, ripping off his shirt as he went.</p><p>Holy shit! I howled.</p><p>D was concerned, though.  What the hell, dude?  He better not wander off and die.</p><p>J-Nug shrugged.  So what if he does?</p><p>Hell be fine.  I mean, hes just trippin is all, Prince concluded.  His pupils were massive.  He knelt down and picked a blade of grass, inspecting it carefully, following it closely with his eyes.  He held it up and aligned it with the light of the sun, before letting go to watch it float away in slow motion.</p><p>Good God, he announced, I am just frying through my goddamn skull.</p><p>Youre not alone, I told him.</p><p>Everyone in sight was as openly inebriated as we were.  I could focus on any one person and see their trip as plain as day.  Their face would go through the entire spectrum of emotion.  Theyd smile, but soon frown.  Theyd look at peace with the world, but their look would soon subside to one of shock and confusion.  Their actions made little logical sense, but I always understood where they were coming from.  They could spend a whole two minutes laughing at the sight of their own hands.</p><p>A blonde-haired kid about our age approached our group, sitting on the bumper of the Red Rocket right next to us.</p><p>Heeeey guys howwuh you dooin?  Man, this kid sounded like he was cognitively impaired and had just downed a fifth of Jim Beam.</p><p>I laughed anxiously.  Um.  I was a little taken aback with how he had just invited himself into our group.</p><p>Suddenly he jerked his head away and jumped back as though he saw something unspeakably terrifying behind us.</p><p>WOAH!  WOAH! he screamed at the top of his lungs, eyes popping with each exclamation.</p><p>Holy fuck, what are you on right now man?  I had seen some strange behavior so far, but this by far was taking the cake.</p><p>I am on molly, he smirked.  She is my besssssst friend.  Woah, woah WOAH!  WOAH!</p><p>Yeah Im down with molly, man, I told him, trying to ignore the ear-piercing shouts he used to punctuate his sentences,  but Lucy has always been my main squeeze.</p><p>He sank deeply into thought.  Lucy? </p><p>I could see the gears turning in his head.  Whos Lucy?</p><p>Yknow, Lucy in the Sky with Diamonds D clarified.</p><p>Finally it clicked for him.  A grin crept across the width of his face.  Well as for Lucy.  I guess you could say that. shes my friend too!  He erupted into hysterical laughs, but they soon faded back to screams.</p><p>WOAH!  WOAH!  WOAH! He ran away from the camp.</p><p>I looked at my friends.  Had that just happened?  I didnt even know what to think anymore.  How could so many peoples heads be this fucked?  Or is my head so fucked that I dont even know the difference, and everyone else is just acting normal?</p><p>Fuck that kid dude.  That kid was fucking annoying.  J-Nug got more and more insightful as he sent more and more vodka down the hatch.</p><p>I saw an unmistakable tall figure walking towards camp.  I prodded J-Nug,  Hey dude, look, here comes Jersey.  His shirts back on...  I figure thats a good thing.</p><p>J-Nug looked up, unenthused.  Fuck this kid dude.  This kid is fucking annoying.</p><p>He came up to camp as though the way he sprinted off earlier was nothing out of the ordinary.  Hey guys, you guys want any hamburgers?  Man!  Theres this lady back there giving out hamburgers!</p><p>He looked me square in the eyes. </p><p>Ive never felt this</p><p>None of what he had to say concerned me very much.  I was more interested in the fact that he was chewing on a stick about thick and long as my goddamn forearm, holding the whole thing up purely with the strength of his jaw.</p><p>Prince grabbed it from his mouth.  Come on, man, seriously?  You dont know where this stick has been.</p><p>Jersey snatched it right back.  Its my cannibalistic biting stick!  We decided I needed a cannibalistic biting stick!</p><p>His anger quickly turned to remorse.  He handed it back to Prince, apologetically.</p><p>Throw it far</p><p>Prince laughed, You wanna play some goddamn fetch, man?</p><p>Jersey gave no clear answers, but certainly smiled a lot.</p><p>Prince shrugged and thrust the stick over his shoulders, winding up for a big toss.</p><p>I had no clue what was going on, but I knew I had to stop it.</p><p>I grabbed the stick before Prince could get it airborne.  Look man, Im all for it, but this is not the time nor the place!</p><p>Jersey shook his head at me, disappointed.  Youre no fun.</p><p>I was shocked.  No fun?  And to think I gave this rat bastard my acid.</p><p>Say, Jersey, what do you think of the ol LSD?</p><p>It it is my favorite.</p><p>Thats what I thought.</p><p>I sure showed him.  What was I showing him again?  And why is Jersey taking off his pants?</p><p>Um.</p><p>Im just changing into shorts dude.  I wanna go dance soon.</p><p>The music had been going for a couple hours, but we hadnt even gone up to the stage yet.  In fact, most people hadnt.  I think we were all too fried. But as nightfall approached, we knew thats where the party would find itself.  It was about time to head up to the main attraction, The Dome.</p><p>The Dome was an extremely psychedelic place to situate yourself.  It was made of metal piping (kind of like scaffolding except it was in the shape of a dome).  The pipes formed various geometric shapes all around.  Triangles, pentagons, hexagons  The sound system was like none Id ever seen or heard.  Every frequency cut through crystal clear.  The music couldnt just be heard, it could be felt.  The bass hits rumbled me from the inside out.  The mids enveloped my whole body while the highs assaulted my frontal lobe.  But like any respectable display nowadays, the Dome had to hit me on all sensory levels.  Behind the stage, loops of film were rear-projected onto massive screens.  There were LED lights powerful enough to shine patterns on mountain faces a few miles away.  And, most importantly, the top of the dome was rigged with powerful pyrotechnics.  The bass drops were accompanied with 20-foot spurts of intense flame.</p><p>The next few hours are a blur of raving with a head full of acid.  Eventually J-Nug came up and tapped me on the back.  He pointed back towards camp and made gestures that unmistakably communicated his desire to roast a bowl.  I walked with him and Prince.</p><p>Theres a part of me that wishes I had brought a flashlight to Esthetic.  It was damn near impossible to see three feet in front of me at night.  On the other hand the lack of sensory input, as always, produced stunning visual effects.  As we were walking, I was treated to incredible technicolor fractals all around me.</p><p>We got back to camp.  I think Im gonna drop my first roll, Prince said.  Its really getting started in there.</p><p>Go for it dude, Im gonna take my boomers, I told him.  I fumbled around in the tent for my big red water bottle that Ive always used to store drugs in.  Finally I found it and twisted the cap off.  I pulled out the biggest ziploc bag stuck my nose in.  It smelled like my favorite thing in the world, that bizarrely dungy scent of psilocybin mushrooms.</p><p>________________________________________________________________________</p><p>Saturday, June 19 2010, 11:30 PM.</p><p>Most people are not big fans of the taste of and smell of mushies.  Personally, I have grown to love both.  Even if they smell like shit and taste like dirt, I have grown such a good association with the trips that the sensations leading up to it always excite me.  I popped them in my mouth, chewing em up nice and slow, savoring it.  Even after I swallow, the taste lingers for some time.  Its nice.  It makes my mouth feel warm, and before long the feeling has crept into my entire body. The body tingles start in my soul and seep up through the pores of my skin, bubbling over like magma from a thick reservoir deep down beneath the surface.  Before long I'm completely bug-eyed, with mouth agape and an indescribable feeling that my brain has been plastered on the outermost walls of the galaxy.</p><p>I do a lot of drugs, but I do mushrooms too.  Theyre not drugs.  Theyre much bigger than drugs.</p><p>Im starting to feel them come on when we sit down to smoke a bowl. </p><p>Will you pack this, dude? Prince asks me.  But one look up and he changes his mind.  Actually, youre frying pretty hard.  I wont make you think about it, Ill pack it.</p><p>He corners the bowl, drags slow, and holds the hit deep in his lungs.  He throws his head back in relaxation when he exhales, thick white smoke hanging in front of him.  Prince is a man who loves his weed.</p><p>Master Kush.  This is some dank shit dude.</p><p>Hes right.  The bowl makes its rotations knocks us all out.  Its the kind of stone that goes right to your body.</p><p>This weed is just taking me to Cloud 9, Prince said.</p><p>Each word came out so slowly it was as though I could see each one formulate in front of Princes mouth and float away before the next one came.  Time was slowing down like a locomotive.  The sounds themselves were damp and muffled, like how a good DJ will start off a breakdown with the resonance backed off all the way, giving the track a drowned out sound like I'm hearing it underwater.  But I always know hell slowly bring it up higher and higher, then higher again, maybe kicking the drums back in before the treble is piercing my ears and the tension is so high I can barely stand it.  But when the bass drops back in (and in the dome, flames spit out overhead), I can take comfort in the fact that the party will rage on until the whole cycle repeats itself.</p><p>D and that giggling freak Jersey walk up to the car. </p><p>D yells in to us, Get out of the car so I can lock it up.  Oh, and grab all the water out of the trunk and put in the tent.  Ill be damned if you guys are gonna get dehydrated when youre rolling.</p><p>I step outside the car and am hit with a wave of vertigo.   Woah shit</p><p>J-Nug nods in agreement.  Its good bud, doggie.</p><p>Yeah.  Good bud, thats for sure.  Good shrooms too.</p><p>Shit.  Three grams and I'm getting up near a spiritual dose.  I try not to smoke at spiritual doses.  Half eighth and I can toke my heart out, but three grams Am I really ready for this trip, stoned of my ass and with a mind already warped by LSD?  Did I finally overestimate my own ability to keep it together?</p><p>Wait, what time is it?  Its too dark to see my watch, let me grab my phone.  12:08.  Cool. Whats that mean, again?  When did I take those mushrooms am I peaking yet?  Or am I gonna go further out, still?  Am I ready for this?</p><p>Ready or not, here it comes.  Im feeling it all through my body.  Waves of tension come through the top of my skull, down my torso, and phase through my arms and legs until they finally reach my outer extremities.  Fuck, Im in for something big.</p><p>Somethings coming for me.  The whole worlds rumbling.</p><p>Wwweeerrreee gggooonnnnnnaaa hhheeeaaaddd bbbaaaccckkk tttooo ttthhheee dddooommmeee.</p><p>I nod.  Ill come with.</p><p>Why did I say that?  Who am I talking to?  I cant hear my own voice, but I can see the sound project outward and reverberate.  Yes, I have certainly said something.</p><p>I dont know how long Ive been following these people for.  Its felt like ten seconds and its felt like two years.  Wait, where did they go?  I wish I had a flashlight.  Who are they again?  I stop walking.  Why would I even want to walk why would I start?  Its certainly easier to stand.</p><p>Darkness is no longer dark.  These patterns can be ignored no longer. </p><p>All around me there are swirling vibrations.  They have no color; theyre beyond it.  Theyre moving constantly, spiraling upward like Da Vincis early conceptions of helicopters. Theyre dependent on one another, drawing on each others energy for stability, forming grand double helixes like colossal strands of DNA.</p><p>But all things come to an end. Nothing ever lasts forever, right?  Each end of these things is fixed onto something definite.  Each half is distinct, the bottom and the top.  Its like its a circular vortex, spinning</p><p>Wait a minute  I recognize these fuckers!  They spun me all to hell the last time I tripped 20x Salvia.  These are my thoughts.  Good thoughts, bad thoughts  They can be friends or foes, and theyre not afraid to switch on a dime.   Trust me, Ive seen it happen, and it can be a very ugly thing.</p><p>But not this time.  Im in control now.  How should I let these things spin me, when its really me who spins them?  This vision is familiar to me.  I remember it from the time I Hippy Flipped.</p><p>Its the one cycle that all the others are derived from. It starts in my mind and projects upward to the highest imaginable peak.  Here I find concepts, ideals, the way things ought to be.  Its the infinite truth of the yin.  It is completely unbound by time, because it can apply to any and every moment.  I'm in control of it; I can mold it any way I please.  Everythings perfect for me there, because its a construction Ive created by and for myself.  I think that, as day turns to night, this must be the place I visit in my dreams.  But as much as Id like to, I cant stay there.  I have to sink downward, past a crucial split. </p><p>From there it swings to a low valley, where everything is contained within the finite point of the present moment.  Here I find the other truth: not the truth of concept, but the truth of action.  Its unbendable. I cannot change what Ive done once Ive done it, though its easy to wish I could.  Thats how people get hung up here. The heart of the yang is so immediate and tangible that I can lose sight of the other side of things.  On one hand, a thought without action is rendered meaningless. No-one will congratulate me for what I regulate to the realm of my own mind.  On the other hand, an action without thought is rendered dangerous.  Then it becomes the epicenter of miscommunication, giving rise to conflict and confrontation.  Actions have a lot of weight, for better or worse.</p><p>But in the big scheme, I rise back up from this point.  The cycle enters back to my body through the chest, hitting the heart as it goes.  It pumps the blood and circulates the oxygen and oxygen that animates my being.  Then, at some ineffable chakra between the aorta and the cerebral cortex: Ouroboros. The serpent eats its tail, and the whole thing starts again.</p><p>Ive seen this all before.  Im comfortable with it.  I guess maybe its time to turn my head. </p><p>Visions like this are inescapable and infinite in this darkness.  But in the distance I see a source of light, a source of sound, a source of creation.</p><p>I begin walking towards it, taking note of the fantastic sights around me.  Three dimensional patterns are beneath me at this point.  Im seeing cubes that seem to occupy a fourth spatial dimension.  I heard of these fuckers in Accelerated Math Analysis, but not like this, not hundreds of them looking me in the face.  Whats the word for these, these shapes have a word</p><p>tesseract, yes, certainly theyre tesseracts.</p><p>Ive arrived at my destination.  Look at these shapes, look at these lights.  This is a truly intricate hallucination.  Or is this the part thats real?  The line is getting fuzzy.</p><p>No, no.  This is the Dome.  This is what I came for.  But why is everyone looking at me? </p><p>Are they just looking at me in all my dosed glory?  Are they looking at my raggedy, torn up jeans and button-up shirt, two sizes too big, with the pattern of an American flag sewn across?  Are they looking at my pupils, the size of flying saucers?  Are they looking at me because I wandered in here mumbling about tesseracts?</p><p>I need to avoid their stares.  Just turn around and walk away.</p><p>But I turn around and the stage is blocking my path.  Oh wait maybe thats what these people were looking at.</p><p>Maybe I should turn back around and explain myself.</p><p>Theres no point, really.  The ability to communicate a rational thought in English left me a long time ago.</p><p>Everything has left me, really.  Im a blank slate, regressed to a completely infantile frame of mind.  When I was first born, I hadnt placed any filters on my thoughts yet.  There was only one thing going to my mind: pure human experience.  As I was raised, there needed to be filters placed on these thoughts, purely for the sake of survival.  As a biological organism, I cannot survive if I have no larger scope on the nature things, nothing to fill the void that exists beyond the definitions of the present moment.</p><p>The most basic of these thought filters is the filter of language.  This is what children pick up first.  They learn that that a certain concept is intrinsically linked to a specific vocal expression, the most comprehensible and basic ideas being Yes and No.</p><p>From there we have to filter our experience further.  To be able to express more complex thoughts, we need to follow the collectively agreed upon pattern.  This becomes the subjects, the predicates, the rules of grammar.  It becomes the language.  It becomes a specific pattern in thought that we adhere too, even though its not the only pattern out there.</p><p>Experience needs to be filtered down if we have any hope of being a functioning member of society.  If we didnt filter it, wed constantly be like me a freak with all his senses overloaded.  If we cant filter our thoughts down to something expressible, we cannot communicate with other human beings.  We cant collaborate with them.  We cant survive.</p><p>Programming a sound into a synthesizer works in a very similar way.  You start with a basic, initialized waveform.  If you play the synth at this point, it will simply sound a pitch.  From there, a producer will run it through filters, oscillators, envelopes, and modulators, which will cancel out some frequencies and thus emphasize others.  This is known as subtractive synthesis.  You can start with the form of a sine wave and create a literally infinite number of unique sounds, not because you added anything to the initial waveform, but because you took things away.  In this same fashion, you can encounter an infinite number of unique personalities in your life, all crafted by filtering out parts of the waveform of basic human experience.</p><p>Psychedelic drugs take off all my minds filters, oscillators, envelopes, and modulators.  I can see my speech, my mannerisms, and everything that shapes me as a human being manifest itself into patterns coming towards me from every imaginable direction.  Theres an innate humor present in a drug trip, and fundamentally it is self-deprecating.  I'm laughing at myself.  I'm laughing because I see how Ive been stumbling through my life in one particular way, when theres a million different ways I could go, and I'm laughing because I think myself a fool for missing things so fantastically different yet so apparently obvious.</p><p>At this point, Im laughing quite a bit.  Things are getting very bizarre.</p><p>I look up towards the light show.  My head cocks to the left.  My joy leaves me.  My smile leaves me.  The steady pulse of the music puts me in a trance. My whole body starts to sway backward and forward.  If you were to get up, stare at one point high on the wall of the far side of the room, and proceed to draw large circles with your head, you would be making about the same motion I was.</p><p>The entirety of human experience as I have ever known is beginning to fold in on itself.  Time is compressing.  Everything Ive ever perceived and ever will is pushing into itself like an accordion, until it becomes a single, comprehensible axis on a higher plane.</p><p>I have finally come to the edge, and whether I like or not Im getting pushed over into a new dimension.  Im aware of my surroundings in the immediate physical realm, but its no longer of any concern to me.  The world has been rendered insignificant.  The universe as I have ever understood it is just one universe.  One of many.</p><p>Now that universe has subsided to a gigantic, rushing, fractal pattern (more specifically, The Mandelbrot Set), in which I can perceive not only our universe, but parallel universes as well.  I see every course of action that could have been possibly been taken throughout the history of time.  Whether or not that was the course of action that actually was taken is no longer significant, it is simply one manner in which things could have unfolded.  In a sense, actions have lost all their weight.  Ive been freed completely from the prison of the present moment.</p><p>What is action? Why does it matter?  Ill spend the whole night drawing circles with my head if I damn well feel like it. </p><p>Now theres no way anyone around me could not know Im tripping.  I see people walk by and stare at me, some give me two thumbs up, some are simply taken aback, and others seem legitimately concerned that a kid so young has gotten so screwed up.</p><p>A lady comes up to me.  I figure her to be in her sixties, certainly of the older crowd that attends an event like this.  Shes too old to rave, but here for the concept.  Shes an old hippy.  I figure her for a Burning Man veteran.  Hell, she looks like she could have even lived through the Haight-Ashbury scene.  Clearly though, she knows what Im going through.</p><p>She speaks to me.  Trpinipg?</p><p>Every one of my senses is too warped for me to hear her correctly.  Im sure I have the same look of confusion as the WOAH-shouting candy flipper I encountered earlier that night.</p><p>Um</p><p>She speaks again, louder, clearer.  Tripping?</p><p>I respond the only way I really can: I giggle.  I make a Herculean effort to say Yes, or even to just nod, but I cant.</p><p>Still, she understands.</p><p>She smiles.  Ive seen this before, the same smile my neighbor gave me when he heard of my plans to take these ridiculous drugs.  The smile that has behind it some incredible telepathic meaning that I wouldnt want to disgrace by trying to put into words.  Its the smile of shared experience.</p><p>She clasps her hands over my face.  It takes me by surprise, this sensation.</p><p>Cold, she says.  Hands.  Cold.</p><p>Yeah, her hands are cold, I think.</p><p>By only giving me a few words to link up, she made me create a communicable thought, something I hadnt done in a long time.  She didnt try to talk me down.  She helped me help myself out of my trip.  Shit, how long was I gone?  Is there any further out to go? And, most importantly, how long until I get stuck out there again?</p><p>Boy, am I tripping.  Thank God I get off on this kind of thing.  I knew this would happen.  I came prepared.  When my head has gone out to play like this, theres only one sure-fire remedy to keep me engaged.  Theres only one thing that will fix me tight onto positive vibrations and never let me let go.  Rolls.  Thizz.  E.  Love Speed.  Its all about the Ecstasy, and I brought three of the best pills money can buy around here.  But time is running out.  I need to get back to camp.  I need to pop at least one of those magic little e-bombs in my mouth before I get catapulted back out to the astral plane.</p><p>I have to find my friends again.  It doesnt take much looking.  I tap D on the shoulder.  I can tell hes relieved to see me.</p><p>DUDE!  Where the hell did you go?  I thought wed lost you.  Shit, man, I thought you were dead.</p><p>I might have been.</p><p>J-Nug is crunkenly waving his hands in the air.  Jersey is all smiles.  The acid is still going strong.  Prince is already rolling.  He dropped when I ate my mushrooms.  Its funny how easy it is to tell when somebody is on a roll.  They seem so content, so at peace with themselves and the world.  I think to myself, Theres no way somebody could be that happy for no particular reason unless they were rolling.</p><p>Prince is dancing harder than Ive ever seen him dance before.  Hes had a Yellow Puma.  Supposedly, they were cut with coke.  But when pushers have pills, theyll always say its cut with coke.  It sounds much more exotic that way.  The fact of the matter is theres not a whiff of coke in those pills, but certainly some straight amphetamine.  As for how much amp there is, only two people know:  God and the Chemist.</p><p>Prince turns to me smiling.  Now, theres a significant difference between a roll smile and a trip smile.  A trip smile is akin to the expression I get when Ive just heard an incredibly bad pun, and softly laughing is the only way to ease the awkward tension thats thick in the room.  A roll smile is more like an elated smirk, a display of absolute understanding usually only seen by those I care about the most, to let people know that I appreciate them for who they are.</p><p>THESE PILLS ARE FUCKING SLAPPERS!</p><p>Prince tells me what I can already see.</p><p>Hell yeah, dude.  I need to get back to camp and drop one.</p><p>Ill come with you.  Im gonna take my molly.</p><p>We walk back to camp.</p><p>How are the shrooms treating you?  Prince asks.</p><p>Shit, I cant think about that now.  If I start trying to tell him where my head was just at, theres a good chance Id go back there again.  There are more pressing matters at hand.</p><p>Well, the pot sure made it come on fast.</p><p>Prince chuckles, Yeah.  He pops a capsule of good brown molly that came through town a few months back.  We heard later that the chemist said it was pure MDA.  And, the chemist is one of two people who would actually know.</p><p>Its dark, I cant see where my hands are going.</p><p>What are you looking for? Prince asks.</p><p>Hmmm what am I looking for again?</p><p>Im looking for a, uh</p><p>I keep my drugs inside my big red water bottle, but I cant for the life of me remember the term water bottle.</p><p>Shit, Im looking for a</p><p>Prince is holding a plastic water bottle.  I snatch it out of his hands and point to it, and then point to it again.  Im getting in a trance again.  I cant think, I just keep pointing and pointing.  Prince is taken aback, watching me and laughing.  My mind is going.  I cant lose it again, this close to finding my ecstasy.  Shit, I cant believe Im about to take more drugs.  I keep pointing and Prince keeps laughing.  It takes a lot of willpower, but suddenly, theres a burst of communicative energy.</p><p>The word!  Im just trying to think of the next word!  My thizz is in one of these.</p><p>Suddenly, it comes to me.</p><p>WATER BOTTLE!  Yeah, thats what Im looking for goddammit!  A water bottle!</p><p>It feels like a great victory to have pulled myself out of the trance.  Communication, thats what its all about.</p><p>Prince has a light and helps me find my bag of pills.  Theyre so little and adorable.  I take them in my palm and shine a light on, admiring the press.  Two Blue Rolexes and one Green Puma.  The press is clean on them all, with finely detailed logos.</p><p>Now, Im someone who does his research before going in on a pill.  Pillreports.com, and Ecstasydata.org are lifesavers.   All evidence I had access to led me to believe the Rolexes would be very MDxx high (subjective experiences suspected MDA), and I paid top dollar for them. The Green Puma was more akin to Princes pill.  Good amount of MDMA, good amount of amp.  The Puma will be speedy, I figure Ill save it for last, to really keep me going even after the sun has risen.</p><p>Shit, I cant believe Im about to take more drugs.</p><p>Sunday, June 20 2010, 12:30 AM</p><p>I cant stand the taste of Ecstasy, but its necessary.  I always chew up my pills, for two reasons.  1) It gives a horrible chemical taste to remind me that Im putting horrible chemicals in my body.  2) It makes them come on faster.</p><p>Rolls on their own are ok.  Im in the minority of users in that I dont do back flips over how fantastic the effects are.  I figure I have the same aversion to ecstasy that some people have to cheesecake.  Its too light, too sweet, too rich, and too fluffy.  Still, I will never how a person could dislike cheesecake.</p><p>The problem with rolling is that it will take me to the most incredible places, but give me no clues as to how I got there.  It launches me upward, keeps me on top of the highest mountain for three hours, and instantaneously tears me back down.  This is when it's easy to crash completely, to lose sight of the beautiful feeling that once seemed so obvious, and come to the conclusion that the only way to get back to that space is to take more ecstasy.  This is what can render the experience meaningless.  I dance through the comedown.  Close my eyes, get some water, shit, do what I need to do, but make sure I keep dancing hard as ever.  I need to expel my own energy in order to integrate the ecstasy experience.</p><p>The full glory of a roll unveils itself when mixed it with hallucinogens.  The psychedelics give me the bigger picture needed to grasp the experience as its happening.  I dont have to go through the trouble of comprehending a roll after a depressing comedown, you can work to understand the roll and its implications at the peak.  Theres this wonderful interplay between the head and the heart when the peaks overlap, the trips introspective understanding mixed with the raw emotion intensity of MDMA.  The interaction between the drugs is unspeakably beautiful.</p><p>I always feel a roll come on faster than a trip.  For the first twenty minutes, the buzz is nearly imperceptible.  I step on the dance floor and its business as usual.  Theres repetition in dancing.  Whether we know it or not, we always get locked in to a similar groove.  In ten minutes or so and something strange happens.  I'm not even thinking about it, but at some point there was a moment where my inhibitions completely dissolved.  My body is moving into spatial dimensions its never considered before.  I'm feeling the music from the inside outward, and motion has become effortless.</p><p>The only thing more remarkable than whats happening to my body is whats happening to my mind.  Insecurities have evaporated.  Theres no shame in myself, anything I have to say or do.  But the really heavy thing is this sense of obligation to try and bring others to my level.  When I see someone, I smile.  Not because I'm amused, far from it.  I smile because I want people to know that I accept them.  I want them to know its perfectly ok to be who they are.  I want them to know all the things I know.</p><p>I spaced my Rolexes 30 minutes apart.  Id had my fair share of rolls before, but nothing like that.  Nothing that pure.  Nothing that clean.  That was even better than the best molly Id ever got in on.  Somehow people have been suckered into this notion that molly is more reliable than pills. Hey, I dont even fuck with pills maaaan, its all about the molly, maaan, you gotta go molly, you gotta go puuuuure.</p><p>Fuck that noise.  If you think what you get is pure because its in the form of a nondescript white powder, then I dont even know where your heads at.  Even if its got that nice brown tinge, how do you really know what youre getting?  At least with pills there are online resources, places where you can get a good idea whats going in your system before you get in on a batch.</p><p>And the Rolexes were a helluva batch.  Incredibly MDA high.  No wonder I got charged extra.</p><p>Something funny happened to me over that roll, something thats never happened to me before.  Theres a gap in my memory.  People frequently drink to the point of blacking out, but Ive never come close to the experience myself.  This was the first time anything like that happened to me.  But I wouldnt call it a black out; Id call it a white out.</p><p>1:00 to 4:00 AM that morning must have been an experience unlike any other.  That was it, that was the Jedi Flip.  The shrooms and the X synced up perfectly.  It was essentially a Hippy Flip superimposed on the latter half of an acid trip.  There are only bits and pieces of it I can recall, but theyre permanently carved into my mind like beautiful portraits, scenes from the best movie never made.</p><p>I recall at one point I was raving up front by the stage and the mixer and the turntables.  A man with a cowboy hat leaned in towards me.</p><p>Why dont you jump up there? he said, pointing to a spot on the stage right in front of the speaker cabinets.</p><p>I couldnt tell whether he was joking or serious.</p><p>Go on, he said, grinning.  Dance your little heart out.</p><p>Yeah, I thought, why dont I jump up there?  Whos to make me stay down here anyway?</p><p>I leapt up and turned around to face the crowd, pointing upward, beating my arms in frantic circles to the beat as the kick drum boomed.  People appreciate any such show of energy, I think.  People gathered around and threw their arms up like mine.  The man in the cowboy hat was jumping up and down, screaming, cheering, eyes rolling up into his head.  He was elated, I think, by the fact that his idea had been acted on.  It didnt matter who had done the acting.</p><p>It wasnt long though before a crew member pulled me down.  We cant let you stay up there.  Its a safety hazard, for you and our equipment.</p><p>Makes sense, I said.  I was, after all, on some very unpredictable substances.</p><p>He acted like he didnt want to have pulled me down.  Do you want a cigarette? he offered, in consolation.</p><p>No thanks. I told him.</p><p>Well You gotta light?</p><p>I reached in my pocket and flicked my bic.  I held it up to the cigarette dangling from his mouth and the flame danced and flickered in the wind.  He sucked the smoke in like it was soda through a straw, his jaw slowly lowering to create suction. The cherry flared up and the end of the stick was glowing.  It always amazes me how easy cigarettes light.  Its all the chemicals they treat it with to make it burn even.</p><p>He exhaled and gave me a nod as if to say Youre alright, before I went back on the dance floor.  He had long silvery hair and spoke with a thick English accent.  He must have been there with Meat Katie: a breaks DJ, a Londoner, and the headliner of the festival.  I had been psyching myself up for Meat Katies set.</p><p>Problem is, I do not recall Meat Katie at all.  He was playing at the height of my Jedi Flip.  It trips me out that I can recall a small encounter with a crew member vividly, but I cant even picture Meat Katies face when he was the one making me dance for hours on end.  Theres a lot of things I dont remember.  Im sure I was dancing the whole time, though. </p><p>Several months later I went to a friends house to smoke hookah while his parents were out of town, and the 21 year old house sitter was throwing a party there.  I walked into the living room where there were all these young adults sitting around and playing drinking games when suddenly one screamed out, DUDE! I HAVE A PICTURE OF YOU!  I looked over my shoulders, was this motherfucker really talking to me?  I dont even know this guy.  Maybe hes just drunk.  But he leapt up, whipped out his camera, and handed it to me.</p><p>Sure enough there I was, Jedi Flipping.  I was drenched in sweat.  Every part of my body looked like it was caught midstream in some heinously intense motion.  My eyes were closed, and every muscle on my face was tensed up in pleasure.  Apparently thats just how I look when every motion I make brings orgasmic sensations through my entire body.  Apparently thats how I act when every pore of my skin is ejaculating the pure light of God.  Apparently thats what makes me white out.  Apparently thats the kind of thing that total strangers find picture worthy.</p><p>And to think, if I hadnt been wearing that same oversized American flag shirt, he wouldnt have recognized me at all.</p><p>Sunday, June 20 2010, 4:00 AM</p><p>Were gonna go to sleep.</p><p>All my friends are calling it quits.  I dont blame any of them.  J-Nug and D have been running solely on alcohol and cannabis, neither of which are exactly known to keep people awake.  Jerseys trip is done, and Prince is in the throes of an X crash.</p><p>My pills are wearing off too, but I knew that would happen.  Thats why I came prepared.  The Green Puma will do me nicely.  My reservoir of natural energy has been fully tapped, but with enough amphetamines in my system I wont notice the difference.  I better chew it up now.  If I sync up the come-up of one roll with the comedown of another, the transition is very smooth.  At this point, the feelings of a crash must be avoided at all costs.  Sometimes I cant recover from a thing like that.  I reach in my pocket watch pocket and put the e-bomb on my tongue.</p><p>There it is.  Theres the bitter taste.  Theres the chemistry working.  Ive bought myself three more hours in the zone and I should make them count.  Im on the tail-end of the mushroom trip, and theres a minor but still perceptible afterglow from the LSD.  But there were a few hours there where it was all overlapping.  The cid, the shrooms, and the X all piled on top of one another to from this otherworldly trifecta of pure psychedelically indulged bliss.  I guess that makes me a Jedi now.</p><p>But what in Gods name drives a person to do a thing like that?  Ive taken these three powerful allies and used them in such an indulgent, hedonistic fashion.  The LSD and the Mushrooms together were the kind of experience that could drive you completely off your skull.  And what was my remedy for that taking more drugs?  Maybe this isnt even drug use any more.  Maybe this is abuse.  Am I doing this for personal growth anymore?  Have I been using these drugs for so long as a mere escape from reality?  If thats so, then what makes me better than an alcoholic, a coke fiend, a popper or a junkie?</p><p>Maybe theyre right, those people who seem so concerned about my habits.  Those people who insist I have a drug problem.  Those people at parties who always tell me that what I do is bad for my brain while I can smell the alcohol on my breath.  Those people who insist that tripping will cause some incurable mental disorder.  Those people who doubt that Im in control. </p><p>It puts me in a bad mood to see people talk like that.  Its so often that when they say it, they have such a genuine look of concern on their face that I can barely stand to look at.  I cant bear that theyre that concerned.  Furthermore, I cant bear that theyre that concerned about me.  And most of all, I cant bear that theyre that concerned about me for no good reason at all.  It used to be Id try to spit statistics at people, explain to them how scientifically safe these things are for my brain, especially in comparison to their substances of choice.  But anymore Ive given that up.  I just let them feel sorry for me.  If it helps them feel better about themselves, then I guess theres no harm done. </p><p>But when I take one look around me, at everyone still thizzin at 4 AM and dancing their asses off, I can see that same look of concern all around me.  I see water jugs being passed around communally, everyone concerned with the level of collective hydration.  I see everyone smiling, concerned to let others know that everything is all right.  I see people concerned with the happiness of themselves and all around them.  And when I see things like this, theres nothing better than the underlying feeling that Im a part of something good, some incredible positive vibration that were somehow all spinning around on.  Theres nothing better than to think about all those people who are worried about me, and to understand theyre concerned, fundamentally, out of love.  Theres nothing better than to know that theres people who care that much.  But, most of all, theres nothing to better than to know that those people are wrong.  Am I out of control?  Fuck no, Im a goddamn Jedi.  Thats as in control as it gets.</p><p>By 7 AM, the mushrooms had certainly worn off.  The acid had subsided hours before.  My roll was coming to an end as abruptly as the music was going to.  There were only ten other freaks left in the dome.  One look at any of us and youd know that we all had lost our minds at one point or another during the course of the night.  How else could we think that dancing to 160 BPM psy-trance after pulling an all-nighter was a reasonable investment of energy?  As the final hits of the music faded away, one girl among us rounded us all up, had us lock arms and do a circular Russian dance in one final act of celebration.</p><p>WE MADE IT THROUGH THE NIGHT!  WE MADE IT THROUGH THE NIGHT!</p><p>I looked down at my feet as I stumbled out of the dome and onto the dirt.  My body was done.  It was time to crash.  It felt like a Herculean effort to keep my eyes open, or to even stand up.  It was hard to stop from collapsing right there on the spot.  Off in the distance, somebody was watching me in my stupor, laughing at the sight.  As I approached, I made the figure out more clearly.  It was my neighbor. </p><p>I was drenched in sweat when I walked past him, giving him the slightest nod I could afford.  He slapped me firmly on the back as I passed.  He still had it.  That same smile.  If a picture can say as much as a thousand words, that smile can say as much as a thousand pictures.  Id seen it on the old hippie woman, pulling me out of hyperspace, Id seen it on dozens of dedicated dancers, completely loaded on X in the wee hours, and Id seen it on this same man the previous evening, when he learned of the insanity I planned to embark on.  It was the smile of shared experience.</p><p>Whats up, Obi-Wan?</p>",
 "year": "2010",
 "id": "86863",
 "gender": "Male",
 "age": "17",
 "timestamp": "2011-05-18T07:00:00.000Z",
 "views": "55550",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(cookie / food)"
  },
  "1": {
   "time": " T+ 3:30",
   "amount": "3 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "2": {
   "time": " T+ 4:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": " T+ 4:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "4": {
   "time": " T+ 5:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "5": {
   "time": " T+ 9:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
