{
 "title": "Caught Me Off Guard",
 "author": "Remphor",
 "citation": " Remphor. \"Caught Me Off Guard: experience with Products - Spice and Synthetic Cannabinoids  ('Serenity Now') (ID 86876)\". Erowid.org. Sep 22, 2010. erowid.org/exp/86876",
 "substance": "Products - Spice and Synthetic Cannabinoids  ('Serenity Now')",
 "bodyweight": "240 lb",
 "report": [
  "<p>I had heard of spice before but never ordered any for fear that it wouldn't work. Recently I heard from a friend that they were selling it locally and it got them pretty high so I decided to try it. I went and got a 1.5g bag of 'Serenity Now' because it was supposed to be the best they had. I was kind of excited to try it when I got home but I was still kind of worried I had wasted my money. When I got home I rolled about half of the bag into a joint and proceeded to smoke down with my girlfriend.",
  "The taste was something different, not good but not completely horrible. I did notice the taste changed quite a bit after about 3/4 of the way through the joint. It was a strange almost metallic taste. Immediately after, maybe even before it was finished I started to feel the effects. It started out like a normal head change that a joint of marijuana would give me. Very quickly I found that my high was getting increasingly stronger. My vision started getting distorted. I couldn't focus on anything. The colors in the room seemed to be more vibrant. After about 5 minutes the high was so strong I honestly couldn't handle it, and I had to be alone for a minute to compose myself. I went to the bathroom and sat on the toilet seat looking around at everything. I got up and splashed some water on my face, but it didn't help. I told myself that I am just high and I need to relax. I went back into the bedroom with my girlfriend and she was looking at old baby pictures of herself. She said that she could just imagine them moving and could picture how she was as a baby. It was at this point she looked up at me and said she was tore up. We talked and enjoyed the experience for another 30 minutes or so before we started to come down. About 1 1/2 hours after we smoked we were basically sober again. About 30 minutes after that we couldn't even tell that we had smoked anything.",
  "Overall it was a great experience, but I was not prepared for it. I expected almost nothing and it really messed me up. I have smoked it several times since then and if done properly it feels like smoking pot that only lasts an hour, which is great to do before work.</p>"
 ],
 "year": "2010",
 "id": "86876",
 "gender": "Male",
 "age": "22",
 "views": "6550",
 "dose": [
  {
   "time": "0",
   "amount": ".5 g",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2010-09-22T07:00:00.000Z"
}
