{
 "title": "One of Life's Little Secrets",
 "author": "Imogene",
 "citation": " Imogene. \"One of Life's Little Secrets: experience with MDMA (ID 86898)\". Erowid.org. Nov 20, 2013. erowid.org/exp/86898",
 "substance": "MDMA",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(ground / crushed)",
   "",
   "1 tablet",
   "oral",
   "MDMA",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2009",
   "86898",
   "Female",
   "",
   "17",
   "Nov 20, 2013",
   "632",
   " "
  ]
 ],
 "report": "<p>A few of my friends were dealers of various illegal substances, and most of them raved/had at least been to a rave before. I had a curiosity about ecstasy for probably six months or so, but had never had the guts to seek it out. Lo and behold, one of my dealer friends, G, starts talking about these pills he had just acquired, purple stars of David, and about a rave that was going to take place the next night. Thanks to a beer buzz, I was brave enough to catch the eye of one of my friends, J. Pretty soon J and I each had one of the purple pills in our possession. We tucked them away and continued to drink, enjoying the rest of the increasingly good day.</p><p>The next morning, I woke up on the couch of another friend, C. I started talking with J and C, and before long, J asked me about 'what we bought yesterday'. I got a grin on my face and quickly dug for the small bag, because I had forgotten, and now that I remembered, it was like a good dream come true. I went home and was excited all day for that night. I told my mother that I'd be going to see a movie and would probably spend the night at J's house, and got into the van with my friends. 'So, are you excited?' they asked me, and I nonchalantly assented. Of course I was excited, but I had no idea how excited I really should have been.</p><p>We parked outside of the rave venue to take our pills. 'Chewing it will make it kick in faster, but it tastes awful,' everyone warned me. With butterflies exploding in my stomach, I decided I'd rather deal with the taste than have to deal with the anticipation of waiting, and chewed the bomb thoroughly with my front teeth only, as advised. I took a swig of water and decided that it didn't even taste that bad. Then someone realized that we didn't have binkies. So we started to drive to the store, with my butterflies getting worse and worse, making the drive seem like ages. I couldn't believe that I'd just ingested something which could contain anything. I could've just poisoned myself. I lied to my mom to go to a rave and take drugs. 'This is everything,' I thought (well, not everything, but by the end of the night, I pretty much had done everything), 'a good girl isn't supposed to do. If I die, so help me...' I noticed the song that my friend S had put on, 'Ecstasy' by ATB. Everything felt surreal, and I wasn't sure yet if it was the good sort of surreal yet. Soon, though, we were at the store. We all hopped out and bought the pacifiers, as I thanked the supermarket gods for self-checkout lanes so I wouldn't have to undergo the judgment of a cashier.</p><p>We got back into the van, fashioning make-shift string necklaces of our binkies. When we got back to the venue, there were tons of people standing outside. As we joined the throng, the butterflies in my stomach were more like great bats flapping about. Several of my friends were already rolling, having eaten some pills before everyone else. Everyone was huddled together, as it was quite chilly. Suddenly I felt a rush of what I thought to be nerves and adrenalin. I took a deep, long breath, and turned my face to the sky, eyes closed.</p><p>When I opened my eyes, I knew I was rolling (probably about half an hour after ingesting the pill). That moment is forever in my memory. I can still recall it almost perfectly, a year and a few months later. It was already a beautiful night: the sky was clear, with a few wispy clouds hanging around the full moon; full of stars and purple. I was always the kind of person who appreciates a beautiful sky, but after that moment, it has never been the same. I now have a kind of one-ness with the sky, and when it looks like it did that night, I am instantly full of peace and good vibes. Anyway: I righted my head with a huge grin on my face. 'I'm rolling!' I said, in a bit of a stage whisper. I smiled at everyone, knowing finally why they call this drug ecstasy, because it was. I still get giddy thinking of this night, and consider it one of the best, if not the best, of my life. I was happy to be waiting in line in the cold with everyone, everyone was adorable and funny.</p><p>A girl was standing in line behind us, looking lonely and cold, and I welcomed her into our huddle. I am usually a very, very shy person; not unfriendly, but I never strike up conversations with others. She was definitely sober and, I think, a little weirded out by our group. But I felt good, not only because I was rolling, but also because I had overcome my shyness to help someone out. I try to be really compassionate but that sometimes opposes my shy personality and makes me feel guilty, so that I had done what I had felt really good, enhanced by the beautiful drug I had discovered. I could have been content standing in line all night! Everyone was so friendly and nice and excited.</p><p>As we got closer to the entrance, I felt nervous to be confronted by security but found it to be quite easy as it happened. We gathered just within the entrance waiting for the whole group to get in, but found that A and T were talking an awful long time to come through. I went to the bathroom with the girls, S, J, and M, and when we came out we saw A and T. A reported that T had almost not been let in because of his very obvious state. I listened to the story wide-eyed, coming to realize another side of this drug, a feeling of childlike innocence. We went to dance. I admit that at this, my first rave, I didn't dance all that much. It was quite crowded and the innocence that I felt had me feeling vulnerable and uncomfortable around too many grabby guys. I was really insecure with my body at that time, having just had to deal with a significant increase in bust size, and was not experiencing any of the horniness that a lot of people have on e. At the point of writing (after having taken 10 pills and taken pure molly) I do not believe that MDMA affects me that way. It makes me friendly and childlike, and I feel too vulnerable for anything sexual. I think that the times I have taken e pills and felt horny that these pills were heavy on meth. Just my conjecture and personal experiences.</p><p>I left the dance area and found S talking to some people on the other side of the room. Greeting each other like we had been apart for years, I decided that I'd have much more fun dancing/swaying out there in the open, talking to people. S and I planted ourselves in that area for much of the night. Soon J joined us, and we all talked and danced for a while. Suddenly, I realized that I was no longer rolling. I was really disappointed; the rave was nowhere near over and I was sober! I knew that I could have fun sober, but I also knew that G had brought more pills with him. I mentioned my feelings to S and J, and J said that she was also sober. That settled it, and we set off to find G. G and T were sitting together, looking very much the opposite of J and myself. We told them our problem, and they told us that they would hook us up for free, us being friends and this being our first roll. G had sent M to get the pills from the van, and she soon appeared. We were each given a pill from the bag (it was dark and it was a skittles bag so I don't know what color or press, but it definitely wasn't the same as my first pill because there were none in the bag) which we quickly chewed. M informed us that she had yet to even start rolling. She had swallowed her pill whole instead of chewing like the rest of us. She decided to eat another, which she chewed this time. In about ten minutes, J said she was rolling again, and M had finally begun to roll. I was not, but didn't mind, I was enjoying talking to people and the rave atmosphere. I sat and talked with S. Still feeling very confident and open, I started talking to a cute guy who was also rolling for the first time. While talking to him, about twenty-five minutes after ingesting the second pill, I came back up, and of course we hit it off. He was peaking and I was rolling harder than before, and we both had that need to touch that I hadn't really felt with my first bomb, at least not like this. Every touch was incredibly intense, especially tongues, after we'd started kissing. </p><p>At the end of the night, I did probably the biggest 'no-no', maybe tied with taking drugs, and decided to go home with the guy. I just didn't want to stop cuddling. He struck me as a good guy. I'm 99% sure would never have done this if I hadn't been rolling. I was very lucky because he was in actuality a good guy. I feel that I lead him on, but when we got to his house, I had come down and was feeling very 'cracked out'. I was unable to sleep and I was incapable of urinating for some time, though my bladder was full as I had made sure to be well-hydrated. We stayed in bed for probably a couple of hours, but I was feeling antsy and needed to be in my own home. He drove me home, and once I took a shower and just relaxed, I no longer felt the anxiety that had overtaken me when I realized that I had gone to the house of guy who I'd just met (at a rave no less) on drugs, without any of my friends, and was probably two hours away from home.</p><p>Instead, I felt an afterglow. I felt that the world was good. I recognized my good luck and experience with everything that had happened. I did not feel the need to immediately take ecstasy again. I felt totally positive for several days, and generally happier for probably almost a month, even though I was going through a tough home transition and had been stuck bout of chemical depression that consistently plagues me. It was therapeutic, and I discovered a love for EDM, too. Yes, ecstasy definitely caused lowered inhibitions in me, but even in that, I realized something (something about my friends, even though it was not a good thing: they didn't prevent me from doing something stupid, though it turned out alright in the end). However, I felt and continue to feel as though I have been let in on one of life's secrets.</p>"
}
