{
 "id": 8694,
 "title": "In The Toolshed",
 "date": {
  "submission": "2006-03-21T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Atomic006",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25",
    "grams": 0.025
   },
   "administration": "oral",
   "substance": "2C-B",
   "form": "pill/tablet"
  },
  {
   "time": "2:00",
   "amount": {
    "unit": "g",
    "grams": "1.0",
    "quantity": "1.0"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "tar/resin",
   "specific": "Hash"
  }
 ],
 "report": [
  "Mindset:  End of a work day. Already quite tired from lack of sleep, but excited to experience a new phenethylamine. Going to explore the various tools that are said to be presented while on this drug.",
  "Setting:  My girlfriend's house near a wooded area. It is a small one bedroom basement suite that is comfortably furnished. She will also accompany me with a 25mg dose as well.",
  "9:15pm - Both of us were hungry, so we ordered in pizza and ate quite a bit. I knew this would probably delay the coming up period, but the food was a necessity.",
  "9:30pm - We each take our 25mgs of 2C-B orally.",
  "10:30pm - Definitely little to no effect felt. I attribute this once again to the food in our stomachs. However Im not feeling as tired as I was before, so I take this as a sign of something at work.",
  "11:15pm - Now nearly 2h since ingestion of the 2C-B. Im really starting to think this material isnt going to work for me. My girlfriend also says that she feels little to no effect either. We both decide to go outside and smoke some fine hash product. About 1g of hash is smoked with normal effect, we feel pleasantly relax in our bodies, but I find that my mind is still fairly clear.",
  "11:30pm - We sit down to watch some Family Guy, which is when I start to feel a slight body buzz growing in my chest and abdomen. This grows for a further 10mins, but is never unpleasant or overwhelming in any sense. The hash wears off very quickly, and I find myself very focused on the colors coming from the TV. If I concentrate, I can make edges shift and colors glow a little brighter.",
  "11:50pm - At this point my girlfriend admits to feeling very cold, and I notice that I have become very sensitive to temperature as well. She has also started coughing frequently, but I assure her that this is probably an allergic reaction to the 2CB and that it would pass eventually. We get into the shower to warm up.",
  "The warm water feels very hot, but very good. I notice the tactile effects coming on in full force. Colors are now shifting to orange and green hues and the shifting on edges is more pronounced. I feel a slight mood lift, but nothing like that of MDA or MDMA. Along with this come some erotic feelings, which are not unlike that of MDMA, but feel more raw as opposed to soft and fuzzy. My mind begins to wander onto some obscure thought patterns as I'm in the shower. I do not feel like Im getting lost in these thoughts, as I sometimes do on LSD or psilocybin, but feel like I can slide my thoughts around to work on tasks at hand. This is when I realize the peak effects have creeped up on me without my realization. I get the feeling that an entire array of tools has been laid before me, but that I'm not being forced to use them.",
  "12:00am - The long shower is over, and both of us are exploring the nice colorful, clean visuals in front of our eyes. I find that the visual patterning creates a grid-like sheen on everything in the room, but nothing overwhelming, like a high dose LSD trip. I've also noted that the visuals seem to be the most apparent aspect of this experience, since the other effects have to be focused on to manifest.",
  "Time is spent looking at artwork and talk. I also have to spend time keeping my girlfriend warm, because she is still very, very cold and continues to cough.",
  "2:00am - Both of us are very tired now, after a long day, and decide we should try to sleep. I find that the dips in the peak effect allow enough exhaustion to try and sleep. The CEVs in the dark room are beautiful and flowing. Very long tracer-like lines which suddenly turn into apocalyptic imagery. Now this isnt a bad thing, as one might think. The images didnt have any negative emotional attachment to them, but I found them very unusual because of their detail. Ive only had such dark and vivid CEVs with ketamine and psilocybin before. Most other hallucinogens Ive experienced have produced bright CEVs.",
  "I toss and turn all night, but get some sleep in there somewhere. I wake up at 8:00am feeling a bit tired in my body, but alert and refreshed in my mind. My girlfriend and I smoke some more hash and go back to bed to get more rest.",
  "Summary:",
  "All in all, I found this to be a very interesting journey. I get the feeling that this compound can be used in many different ways for a variety of purposes. Time of day, mindsets, company, can all play a role in shaping an entirely new experience. However, do note that my girlfriends cough didnt get a whole lot better the next day, and she caught a flu the next morning. I guess like any other strong psychoactive, the strain on the mind and body will lower your immune resistances."
 ],
 "erowid": {
  "id": "51233",
  "citation": " Atomic006. \"In The Toolshed: experience with 2C-B & Hash (ID 51233)\". Erowid.org. Mar 21, 2006. erowid.org/exp/51233",
  "substance": "2C-B & Hash",
  "views": "14312"
 }
}
