{
 "id": 8696,
 "title": "Halfway Into The Orb Reality",
 "date": {
  "submission": "2006-03-06T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Yoschie",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "(capsule)"
  }
 ],
 "report": [
  "<p>Substance: 2C-T-7",
  "Dosage: 75mg oral",
  "This is my attempt at documenting my experience with 2C-T-7 at the level where I felt that I actually achieved a real psychadelic experience. Prior to this dose, I had taken dosages of 25mg and 50mg. Both of these lower doses provided little more than nausea and an uncomfortable body load w/ slight auditory alterations and visual brightening. After speaking with the person that I procured the T7 from about my trials to that point, he suggested I try this dosage. He had done a similar dose, as well as a higher dose.",
  "This trip occurred in the spring of 2001 I believe it was in march or april. At the time I was living at home with my parents in the basement of their house in PA.",
  "I should further note that I am indeed a hardhead for psychedelics.",
  "--",
  "At around 10:30pm I swallowed three capsules of 2C-T-7, each containing 25mg. It didnt take long to notice a feeling similar to indigestion. I began burping and I could taste the sulphuric flavor of T7. My stomach began to tighten and I felt a buzzing sensation in the pit of my stomach.",
  "Approximately 1 hour after dosing I went upstairs and vomited. It was a violent bout of vomiting, but immediately after finishing I started to notice a warm, tingly body sensation and visual distortions.",
  "About 2hrs after dosing I started to notice that the visual distortion was becoming quite great.. but in a different way than other psychedelics such as LSD or mushrooms. I was seeing objects fly across my field of vision that werent there. On LSD or mushrooms, I often have movements of color, but never creation of foreign flying objects. In the sides and corners of my vision I would see movement that I was sure was one of my cats or some sort of animal, but there was nothing there with me.",
  "The body load at this point was quite intense and completely different from anything I had experienced before. It was as if I was plugged into some sort of generator I could feel a pulsing, electric vibration in all of my limbs in my fingers, in my toes, in my head.. everywhere..",
  "I was also having auditory hallucinations.. I would hear cats meowing or hear my name being called from upstairs.. but there was never anyone there. I also heard a buzzing that seemed to fit with the body feeling.",
  "I cant really keep to a timeline from this point on.. the experience became too intense to really keep track of time.",
  "I was in my room, lying on my bed. My room at the time was pretty small.. probably about 10x10 or so. It had really low ceilings.. about 6 high only and I had painted a design on the ceiling in blue and red paints. It was a sort of weird connected design of spirals, dots, dashes and other shapes  I also had a tapestry w/ a similar theme hanging in the entrance to my closet.",
  "As I was lying in bed, I would close my eyes and picture myself somewhere it could be anywhere someplace very earthy and normal, like a beach or I could be in some futuristic inside of a starship or something. I would close my eyes and be in a world that was exactly as I imagined it. I would explore these worlds for several minutes, that seemed like hours.  It was as if I was inducing a super lucid dream state, for lack of a better description.",
  "The trip became very disorienting. I would open my eyes from one of these induced dreams and forget that I wasnt sleeping or dreaming.. and forget that I had taken 2C-T-7.. I would just think that my room was doing crazy things and I didnt know why. Luckily, I had read of memory loss problems with T7, so I had written in a sketchbook next to my bed, You took 2C-T-7 at 10:45pm. Once I saw that I would remember exactly what was going on. But, each time it happened I would only remember by reading the words.",
  "During the time exploring my inner visual world(s), my open eye visuals had become quite intense. I had a sea of 3D floating orbs swirling about my room. I looked at the pattern on my celing and it dropped down.. it sort of pulsated and then sprung free of the ceiling. The orbs would rotate and go into a spiral and appear on the other end as as dashconstant movement. The same was true for the design on my tapestry. Along with these, I had orbs and objects that were in no way connected to my room zooming across my field of vision at all times.",
  "I started to play with these objects using my mind I would look at a stream of orbs in that was out in the room, I would draw it out and closer to me.. I would slow down its rotation.. I would peer into individual orbs. I could pull an orb out of the sequence with my mind and see it right in front of my face.. they were like red and blue crystal balls. Inside the orb I would see a sort of trailer to what was inside.. some were just pretty still landscapes that I could immerse myself in by kind of mentally jumping into the orb. Some were situations with my friends.. wed be out dancing or talking or walking on a beach.",
  "After a while of this, as I pulled an orb free to look at it it was like it sprung loose and just shot right into my face. I felt it hit me in the face.. it was like a strange, soft and wet sensation. But, as it hit my face I was thrown into the contents of the orb. This was my discovery of the tactile hallucination. I realized that I could use my mind to slow the orbs down and draw them closer.. but when I wanted to look at one, rather than stop the whole rotation and pull out one orb to look at.. I could actually reach out with my hand and just pluck an orb from the sky I could hold it in front of my face and lean into it I could peek my face halfway into the reality of the orb or lean completely into it and then just exit out by sitting back.",
  "During this time my cat also joined me on my bed I was lying on my back looking up at the ceiling and out at the walls, and the cat came and layed down on my chest. She was a serious purrer and was vibrating on my chest and softly kneading the base of my neck. When I looked her in the face it was as if she was trying to communicate with me.. so I would try and communicate back with her. I would think as intensely as I could about a message to send to her.. and focus on transporting that message to her. I have no idea if it worked.. but the cat and I seemed to somehow be on the same page.",
  "This sequence of visuals basically kept me busy for the duration of the trip I would say I had these hallucinations for around 5-6hrs. Each orb was a different experience for the most part.. though there were a few favorites that I kept on the bed next to me for repeat viewing.",
  "The comedown I remember as me being quite jittery and having extremely sore muscles. I managed to eat a little food in the morning with my parents to help with my stomach. I also took a shower, which was a pretty enjoyable experience as I could stop the flow of the water running down the shower doors and sides of the tub and make it reverse up the way it came.",
  "About 10-12 hrs afer initially dosing I managed to fall asleep. I slept for the better half of a day and was left w/ a slight hangover feeling and sore muscles for a couple of days afterwards.",
  "As for the mental aspect of the trip early on in the trip I was seriously worried about my health due to the extreme nausea and abdominal cramping, but, after vomiting, my mood changed greatly. The worry left me and was initially replaced by an energetic feeling.. I felt like I wanted to learn something.. I was very curious and had a million ideas formulating in my head.",
  "This was by far one of the most enjoyable psychadelic experiences I have had. My emotions seemed so true.. I would get extreme waves of happiness and sadness.. moments where I felt like crying from either joy or pain. My mood would change with the setting of each new world I explored each orb I peered into would alter my mindset depending on what I saw there.</p>"
 ],
 "erowid": {
  "id": "51242",
  "citation": " Yoschie. \"Halfway Into The Orb Reality: experience with 2C-T-7 (ID 51242)\". Erowid.org. Mar 6, 2006. erowid.org/exp/51242",
  "substance": "2C-T-7",
  "views": "12449"
 }
}
