{
 "id": 8702,
 "title": "I Am a Want Pig",
 "date": {
  "submission": "2008-06-21T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "CletusJay",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.0",
    "quantity": "1.0"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "It was a Sunday night, and I had just returned from my ridiculously stress free winter breaker, eager to see the simple retards I had befriended at my university. We celebrated our reunion with some of my preferred chemicals, those found in the flowering cannabis plant. We loaded a g-bong in an upper dorm room, and kicked it up a notch.",
  "Well, after a one gram or so hit, I coughed painfully.  I coughed and teared until my face felt clammy and oddly flushed. My throat felt tender and sore. Yet I could feel the high within 30 seconds. I quickly entered the jubilant, absurd, clownish, yet clever (to me) phase that I normally assume.",
  "Fifteen minutes later, I began experiencing social interaction as if I was not a participator, but rather a psychic observer. I began to analyze every motive in conversation, each person's intent, empathy, small cock, and so forth. I saw insecurities and darker issues that these friends had yet to divulge to me. Later on, I contemplated the sober person I call myself.",
  "I realized he, in life, was a 'want pig'; a hungry person that desires food, water, warmth, violence, control, and sexual release (love mayonnaise). I looked in the mirror and saw myself not as I would like to imagine, but as the first impression my body and social attitude would relate. I was a hungry, selfish, fool of a reptilian man. I hated the fact that I was identified with drugs, especially the mary jane nugs I most often savor.",
  "I later went further in my superfucked up analysis. I started thinking about who I really was, as an entity and a spirt, rather than a body with desires and a means to attain them. I wanted to find out the motives of my want. I am not just an organism, or at least I pray that humans are not just another step on the evolutionary ladder towards the final dominant life form on Earth. Our vice is violence and violence will precipitate another evolutionary shift. It wont be the final one the first time, but eventually a species of human culturally and genetically disposed towards peace will emerge. Perhaps it is that species that will be able to answer the question What is the meaning of life?' I found the strongest aspects of my g bong trip lasted for a good 60 minutes followed by a draining but satisfying comedown and more feasting and television.",
  "This is all I will submit for the evening, as my present stoning (one of many since this incident) ends. I still have these thoughts of higher forms of life and the futility of our present human lives, and still the doubts and guilt of my stoner status. But my conclusion always is the same, I smoke weed more than drinking or and prefer it to trying, because weed grants a pleasant time faster and with less work. Ive associated the chemical with the successful pursuit of food, water, warmth, violence, control, and believe it or not, women, and so I continue to smoke. Now I will smoke because it produces an intellectual profundity and clarity that I will never be brave enough to enter as my sober self."
 ],
 "erowid": {
  "id": "51261",
  "citation": " CletusJay. \"I Am a Want Pig: experience with Cannabis (ID 51261)\". Erowid.org. Jun 21, 2008. erowid.org/exp/51261",
  "substance": "Cannabis",
  "views": "3060"
 }
}
