{
 "title": "Thank God My Heart Still Works",
 "author": "TrustGod",
 "citation": " TrustGod. \"Thank God My Heart Still Works: experience with Products - Spice and Synthetic Cannabinoids ('Happy Shaman') (ID 87022)\". Erowid.org. Sep 8, 2010. erowid.org/exp/87022",
 "substance": "Products - Spice and Synthetic Cannabinoids ('Happy Shaman')",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2.5 bowls",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "footer": [
  [
   "2010",
   "87022",
   "Male",
   "",
   "20",
   "Sep 8, 2010",
   "8710",
   " "
  ]
 ],
 "report": "<p>Hello all I'm a 20 year old male. I used spice, magic gold, k2, happy shaman, and all the legal highs that were available in Oceanside calif. I'm a military service member and I'm well aware were are not supposed to use drugs, but me and my friends chose to anyway. I used spice regularly from June until October 2009 when I deployed to Iraq with no ill effects. Ceased usage while in Iraq and continued when I returned state side. </p><p>I absolutely loved spice and never had a problem until one day horrible night. I got a horrible case of tinnitus I could physically feel my heart beat on the side of my head blood vessels next to my ear. I temporarily went deaf and couldn't hear my friends speak or myself and had a persistent very loud roaring noise which felt like my brains were going to spew out my ears.  My heart felt like it was at heart attack levels. All I could do was lay in my bed and pray to God not take me now.  I had extreme anxiety which I've never had on any drug (shrooms, acid, pot, mcpp, adderall, ecstasy, and the list goes on). This experience was the worst experience I've ever endured. It lasted about 2 hours I would assume.  After the effects wore off I just thought I got wayyy too high (yes that happened for once) and induced myself into a panic attack. This same experience happened 1 or 2 more times. Which lead to my decision of being drug free. Aside from shrooms occasionally. I am incredibly paranoid of smoking marijuana now because I get uncontrollable paranoia, what I would compare to schizophrenia.  </p><p>I have been clean from spice and all drugs including alcohol for about 4 months with no physical or mental impairment. I know it was a very foolish choice I made to ingest chemicals that are unresearched. I don't trust researched stuff much less chemicals from a strange country. There is no way to know the purity or dosage. But I'm here to share my experience with anyone that may be considering using or is currently. Stop now before you have this happen to you. I know you guys want to think it was just me or my genetic build, but don't take the risk with something you don't know anything about. I thought I knew it all. Thankfully I'm still here to share. Thank you Jesus for saving me from myself. God bless my friends be smart out there.</p>"
}
