{
 "id": 8705,
 "title": "Chasing the Dope Train",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dead Boy",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Heroin",
   "form": "(daily)"
  }
 ],
 "report": [
  "I am not a current addict, I am currently in recovery.",
  "I guess I should start off with the basics...I was born April 14th 1987 my father was 16 years old and my mother was 32 both alcoholics and my father an addict as well. My parents split by the time I was three years old after that my mother entered recovery for alcoholism and my father I guess just hit the streets harder than ever. My mother remarried when I was about 7 years old to a fairly successful electronics rep, my childhood was I guess rather normal, I was loved and everything I needed was provided.",
  "When I was 13 years old I got into the pot crowd and became a weekend warrior. When I was 15 I got my first taste of dope, and I was hooked...every dime I had went right into the dope mans pocket. I was a rather good student with a borderline genius IQ, but as soon as that dope went up my nose the grades began to fall. Heroin lets the world pass me by and I couldn't care less. I was snorting as much dope as I can get my hands on, when people tell me they had a 5 bag a day habit or a 15 bag a day habit I couldn't care, I did every damn bag I could get.",
  "My life began to crumble, going from all honors classes to fundamentals within two marking periods, and my mom and stepdad just called it a phase. I was a slave on the dope train the only thing I thought of was ways to get money or dope, stealing, selling, pawning, cheating...anything. Like they say in Trainspotting...who needs reasons when you've got heroin? Finally when I was 17 my parents caught on and began to watch me, two weeks later they caught me shooting up and pushed me to the streets in hopes I would kick the habit, that didn't happen. I walked from the suburbs to the Badlands living with my dad. When I showed up at his doorstep, that was the first time I've seen him since I was 3, he was still an addict and a alcoholic, the only difference was he traded dope for a hefty 250mgs of methedone a day, he was registered at least 4 different clinics.",
  "My habit exploded I went from bad to worse, when my dad got into shit with the law I was forced back to the streets to avoid being arrested...I was leaving out of WaWa trucks and begging for money...filling out daily surveys at the needle exchange for that 10 bucks...beating dealer after dealer. Finally in September 2005 my dad was arrested for assault, theft, grand theft auto, breaking and entering, narcotics and a DUI...when they raided his house I was sitting in the living room getting high...I was arrested of course.",
  "That is honestly the best thing that has ever happened to me, I had lost all control and couldn't shake my habit. I got lucky and I was released into the custody of my mom and stepdad and was taken to the hospital the same night. I spent 9 days there getting tested for everything, I found out I have a bacterial blood infection and the valves on my heart where at risk of splitting. I am 18 years old and I have fucked myself up just chasing a slim chance of bliss.",
  "I may only have 174 days clean, but I have more to my life than shooting dope, its nearly impossible to kick the habit alone, I spent only 28 days in rehab and 28 days compared to however long Ive been using sure seems worth it to me. I only used for about 4 years and I know thats almost nothing compared to a lot of people out on the streets, but it only took 4 years to realize I was fucked up. My story isn't about getting fucked up, it's about finding a reason to live.",
  "My final note, I still smoke pot and trip and it hasn't tempted me to use dope."
 ],
 "erowid": {
  "id": "51275",
  "citation": " Dead Boy. \"Chasing the Dope Train: experience with Heroin (ID 51275)\". Erowid.org. Jun 25, 2007. erowid.org/exp/51275",
  "substance": "Heroin",
  "views": "7408"
 }
}
