{
 "title": "A Party Like No Other",
 "author": "Nick Valentin",
 "citation": " Nick Valentin. \"A Party Like No Other: experience with Pregabalin (ID 87072)\". Erowid.org. Nov 29, 2012. erowid.org/exp/87072",
 "substance": "Pregabalin",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "600 mg",
  "oral",
  "Pharms - Pregabalin",
  "(capsule)"
 ],
 "report": "<p>Before I start, I would like to say that I have tried Lyrica multiple times before this and have found that a good dose for me is 600 mg. Everyones body reacts differently, so experiment with smaller doses before moving up.</p><p>Yesterday was one of my fiancs friends birthday party, which of course I was forced to go to. She was turning 21 and was throwing a crazy party at some bar. The problem? Im not old enough to drink (at least they let me in.) I knew Id never be able to stand this party sober, so I rummaged around and found a bottle of Lyrica they had prescribed to my father. I took 300 mg, twelve 50mg capsules, at around 7, the party was supposed to begin at 8 and I knew it would take between 30 and 60 minutes to kick in.</p><p>At 7:45, my girlfriend came and picked me up and I noticed that conversation with her seemed strange. She dislikes when Im high, so I was trying to keep cool, but I noticed my brain wasnt clicking as fast as usual. We got to the party and I met up with four of my friends, lets call them Neil, Jim, Scott, and Susan.</p><p>At 8:15, Scott and I started playing pool. I was doing really well, even though my brain still seemed a little slow as compared to the outside world.</p><p>At 8:30, a band came on the stage in the corner of the bar. I felt the thumping of the bass drum all through my body, and it made me smile. I could definitely tell I was not sober.</p><p>Between then and 10:30, multiple bands came on and I had the same feeling. I ate a sandwich and drank some cola. There was no drastic high to speak of, just a general sense of this is nicer than its supposed to be. My girlfriend left at 10:30, and this is when things really heated up.</p><p>I mustve been trying to push away the high because as soon as my girlfriend was gone, I steadily came up until I was drastically high only 15 minutes later.</p><p>A metal band came on stage, at which point I threw my dress shirt into Susans bag and started moshing in just a t-shirt and jeans in the middle of this semi-formal party. The next song, Neil, Jim, Scott, and Susan all joined me. Dancing and moving around felt so good, even though I felt very off balance the whole time. Turns out Neil noticed and asked if Id been drinking, which I calmly replied No and kept on dancing.</p><p>After the metal band it was about 11:30, and techno began blasting over the speakers about the room. I dragged Susan out onto the dance floor and we were standing there hopping and jumping about for a few songs. I kept falling over, but I was having such a great time I didnt care. Everything was just so much fun, and I was not tired at all, even though Id woken up at 6 that morning.</p><p>At midnight, Scott and I went to play another game of pool, but no balls were coming out (it was one of those 25 cent tables/play tables.) I immediately volunteered to throw myself under the table and find them. I mustve been under there for a while because eventually Jim had to pull me out by my legs, hitting my head on the edge of the table. It didnt hurt as much as it shouldve, as I can see a bruise there today.</p><p>By 1, the party had begun to die down. I grabbed a ride with Neil (who had not drank) and once we got back to my apartment I invited him inside. He accepted, and we had a nice chat over a couple slices of cold pizza. I felt it was easier to communicate what I was thinking. When I went to walk him out the door, I stood up from my chair and immediately fell sideways into the couch. My balance had been off all night, but now it seemed I had none at all. I regained my composure and navigated him back to the stairs.</p><p>By now it was about 2:30, my muscles ached, my balance was off, and Id been up almost 20 hours, but I had a feeling of excitement, like I was anticipating something. As I got back to my apartment, I used the wall as a crutch to get back to my bathroom. After a quick brush of the teeth and wash of the face, I laid in bed, where I sat with this excited feeling for what felt like half an hour or so before I finally slept.</p><p>The next day I woke up at 12:30. I felt heavy, and my muscles ached painfully. I still had a noticeable lack of balance; If I turned a corner to quickly, I would stumble and often have to use a wall or chair to stand back up. By 1:30 I drove to band practice and once I started playing I was absolutely fine.</p><p>All in all a fantastic, long lasting drug which peaks multiple times. Im sure it wouldve lasted longer than the 7 hours it did had I not gone to sleep. Definitely something to do if youre going to be dancing or moving about, as long as the movement doesnt require any coordination on your feets part.</p>",
 "year": "2010",
 "id": "87072",
 "gender": "Male",
 "age": "19",
 "timestamp": "2012-11-29T08:00:00.000Z",
 "views": "6007",
 "dose": {}
}
