{
 "id": 8712,
 "title": "Various Methods of Ingestion",
 "date": {
  "submission": "2006-06-10T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cactushead",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "substance": "Fentanyl",
   "form": "patch"
  }
 ],
 "report": [
  "Background: I have experience with many drugs, but for the purposes of this experience report, Ill limit the discussion strictly to the opiates and other painkillers. Ive tried codeine, morphine, oxycodone, tramadol, hydrocodone, opium, and heroin. Ive also tried Fentanyl a few times, but Ive had very mixed results. I was very disappointed with my previous Fentanyl experiences, but Ive finally found a way to better predict and control the level of effects on me. First, Id like to briefly mention my past experiences and the problems I had encountered.",
  "Previous Fentanyl experiences:",
  "Eating - I have tried eating the gel before, but it didnt seem to work very well. Over the course of a several hours, I ate approximately a quarter of a 100mcg/h patch with almost no effect. Later in the night, I ate a little more and suddenly became very fucked up. It seemed very difficult to determine the amount of Fentanyl that would, or would not, have an effect. I tried eating small amounts of the gel (sometimes one tenth of a patch and other times more, up to and including a quarter.) It seemed pretty dangerous solely because the onset and intensity was never predictable.",
  "Sublingual  On a few occasions, I would cut a strip of the patch off; usually one tenth of a patch, and let it rest underneath my tongue for 15 minutes or so. This worked very well, but the experience was always accompanied with moderate, and sometimes severe, nausea; sometimes, I eventually vomit as well. I found these experiences to be negative overall, because the nausea far outweighed any positive effects of the drug. Furthermore, it really just made me fucked up rather than high (sick and too much respiratory depression.)",
  "Smoking  In the past, Id taken some of the gel, approximately half the size of my fingernail, and put it into a glass one-hitter. I would then put a flame directly on the fentanyl and inhale as it fizzled and bubbled. To my surprise, I would get little to no effect and would end up trying even more. After 3 or 4 hits of a similar size, I still wasnt feeling anything and concluded that the fire destroyed the fentanyl and therefore, it could not be used in this way. In retrospect, Im really happy that the flame made the drug inactive because of what Ive learned tonight (smoking DOES work, and it requires FAR LESS of the drug than I was smoking before)",
  "Transdermal  This worked OK, but it took about 4 hours before I felt anything, and once I did, it was accompanied with a lot of nausea and vomiting. The effects came in waves, and were similar to my sublingual experiences, but less debilitating. However, I couldnt wear the patch for the entire 72 hours because it came off in the shower. At this point, I thought I completely wasted my money on the patches I bought.",
  "Tonight was a different story. I was bored and staying at home for the night, and I really was in the mood for an opiate high. I thought Id give the Fentanyl another shot, just to see if I could make work in a way that I would find rewarding. I had heard about making a small puncture with a pin into the patch, and squeezing out a small drop to smoke. The way that I had smoked the fentanyl in the past wouldnt have produced any effects whatsoever with such a small amount, but I decided to try smoking it differently this time.",
  "First, I took a *small* drop (I cant emphasize enough how small this drop was; it was perhaps the size of the tip of a ball-point pen) and I smeared it into the bowl of a glass one-hitter I have. Then, instead of putting the flame directly on the gel while I inhaled, I held the flame a about a centimeter or two away from the bowl while inhaling. The entire time, I made sure that the flame never actually touched the gel or even the bowl. As I inhaled, there was a faint taste passing over my tongue. This taste wasnt nearly as strong as the taste when I put the flame directly on the gel in the past. I held the hit and exhaled, seeing no smoke whatsoever. However, about 30 seconds later, I felt a decently strong opiate high permeate my body. I was completely surprised how little of the gel produced an effect, and I was both relieved and thankful that I hadnt smoked the amount of gel in the past this way (otherwise, I realize that I could have overdosed.)",
  "This route of administration has proven to be the best for me for several reasons. First, I have not experienced any nausea or alarming respiratory depression. Second, the dose is much easier for me to measure, and I feel much safer having a good idea how potent the effects will be. Third, one patch can last a long, long time. The amount of gel needed to smoke for full effects is so small that I am frankly astonished (generally I like to take at least 40mg Oxycodone or 60mg morphine to reach my desired level.)",
  "There are some things though that I dont particularly like about this drug though. One negative effect I often experience is a headache that accompanies the high; usually when Im coming down, but sometimes during the experiences as well. Another thing that I dont like about this drug is that it doesnt produce nearly as much euphoria for me as do the opiates derived from poppies. The last thing that I dont like about fentanyl is that it has caused me to experience significantly greater respiratory depression than other opiates (sometimes, it can seem like the fentanyl makes me forget to breath.) [Note: I have tried smoking it this way a few times after I wrote this report and I did not consistently reach the effects that I had the first time I tried this method.]",
  "Overall, I do not find Fentanyl very much like heroin; at least not in the ways that make heroin pleasurable for me. For me, Fentanyl lacks euphoria, has a greater degree of respiratory depression, and isnt consistent in producing its effects. The only qualities that I find redeeming about this drug are that it doesnt make urination difficult for me, I dont get as itchy compared to other opiates, and it does work VERY well at numbing physical pain."
 ],
 "erowid": {
  "id": "51301",
  "citation": " Cactushead. \"Various Methods of Ingestion: experience with Fentanyl (ID 51301)\". Erowid.org. Jun 10, 2006. erowid.org/exp/51301",
  "substance": "Fentanyl",
  "views": "79839"
 }
}
