{
 "title": "Life, Death, Love and What It All Means!",
 "author": "Fenix",
 "citation": " Fenix. \"Life, Death, Love and What It All Means!: experience with Mushrooms (ID 8717)\". Erowid.org. Apr 18, 2003. erowid.org/exp/8717",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "report": "<p>It all started on a warm April night.  I was all alone that night with my bag of shrooms.  My room was a 'sacred ground,' one where I would find everything I would need to help me see what I was about to do.  This was the second time that I had taken these mind-bending fungi.  It had been several months since the last time I'd shroomed, which was a killer experience where I almost killed my self.  This time I was playing it safe and staying in my room listening to some of my trance discs on my kickin' new stereo.  I was getting ready to let my being go and let the world come in.  It was only one week after my birthday.  I was ready to start all over.  Ready to get my life headed in the direction that I needed to go in.  I felt the only way that I could this was to have a massive life-altering trip. So I ate the whole bag at exactly 8pm. </p><p>I remember watching 'The Devil's Advocate' (which wasn't exactly the best way to start a trip, but then again I wasn't really thinking at the time) at around 830, that's when I started to feel that tingle that starts in the ears.  Then the feeling of not knowing.  I was getting more and more excited.  Then the movie started to warp, and that's when I started to understand what the true meaning of it all really was.  I simply couldn't take it anymore.  The thought of living and dying and going to hell was just too much.  And that's when the shrooms really started to hit me hard.  I turned the TV off, and turned my trance on and I jumped onto my bed.  I had to clear my mind out.  But it was already too late.  The trance had already super-charged the effects, and slowly I was vanishing into my mind.  The thought of where I was, and the way I was living... all of these thoughts kept flowing through my mind, overpowering any other thoughts in my mind. </p><p>I was lying on my bed with the lights out, the endless litany of the music, and my entire life began flashing before my eyes.  The patterns in the ceiling started to take strange shapes, swirling into my unconscious, leading me to what I saw as the center to everything.  Then everything began to warp, pulling me in.  I had died, and was born again in the same instant.  And then I started to see the world as it really was, as if seeing it for the first time all over again, only more clearly this time around.  I was praying to the gods and goddesses, asking them all of the questions that all humans want to know the answers to.</p><p>What is this?</p><p>What does it all mean?</p><p>Then everything was revealed.  I found all of the answers I was looking for, and more... I saw all of the different possibilities to my life, and everything in it, but all of the different planes of existence.  I saw what reality really was.</p><p>Everything is reality.</p><p>This is real.</p><p>The dreams we have are real.</p><p>The thoughts we have are real.</p><p>The lives we live and the lives' that we wish for are all real.</p><p>There is a center to everything, warping everything into it.</p><p>It's time recycling itself forever, worlds in constant flux,</p><p>Life always beginning anew,</p><p>The true power of LOVE.</p><p>All colors,</p><p>And yet,</p><p>No colors at all. </p><p>A force that holds all of the energies in our infinite universe. </p><p>The past, The future, and present! </p><p>Totality, but not quite, it's hard to comprehend, but in this one moment, everything made crystal clear, a moment of silent lucidity. It was all true, all of it. </p><p>I had been laying in this position for around 5 hours when I finally came back to my body.  The world felt strangely different and yet strangely familiar at the same time.  I got up to walk around and ponder everything that the gods had shown me. It was as if I was a new person.  For the first time in my life I was content with the choices I was making.  Everything was going as foreseen in the EYES OF THE UNIVERSE.</p><p>Fenix</p>",
 "year": "2001",
 "id": "8717",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-04-18T07:00:00.000Z",
 "views": "6127",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 }
}
