{
 "title": "The Cry of the Gnomes",
 "author": "Spazmik",
 "citation": " Spazmik. \"The Cry of the Gnomes: experience with Salvia divinorum & Cannabis (ID 8723)\". Erowid.org. May 12, 2004. erowid.org/exp/8723",
 "substance": "Salvia divinorum & Cannabis",
 "bodyweight": "160 lb",
 "report": [
  "<p>I smoked salvia in mid summer.  having had no hallucinogens all summer, I was ready.  I smoked some salvia the previous day at my friend's house, and got pretty inotxicated, although the heat from the outdoors made me sweat too much to enjoy it.  Anyways, the next day after work I lodead half a bowl of salvia, and half a bowl of good weed.  I started to smoke (with salvia on top) and after 2 hits felt pretty intoxicated.  I had just gotten out of the shower and was dripping wet, and as soon as the salvia hit it felt like I was melting.  the feeling was like body trips I had experienced the first few times I smoked pot.  I felt objects cutting through my body and things touching me that didnt exist.  Visually, I was fucked.  The marijuana and salvia combined to make me see the designs in the wallpaper as faces.  they were tribal faces from ancient times, and they were singing.  The singing sounded like little gnomes and they were singing all of my actions.  When I lifted the pipe they sang 'Ryan's lifting the pipe again!' in a melodious fashion. ",
  "After about 2 minues I realized I was acutally in a bathroom and the salvia started wearing off.  I was a little bit jumpy for a while.  In retrospect, I have to say salvia is harmless physically, and mentally it's very intense, like marijuana is the first few times only it doesnt last as long.  I didnt wanna do it again for a while, but sometime in the future I'd like to try more to see where it can take me.  Anyways, pleasant tripping and remember to stay in a very well air-conditioned place while on salvia because the sweating is very uncomfortable.</p>"
 ],
 "year": "2001",
 "id": "8723",
 "gender": "Male",
 "views": "5699",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "0.5 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2004-05-12T07:00:00.000Z"
}
