{
 "title": "Learning to Handle Stimulants",
 "author": "777xog",
 "citation": " 777xog. \"Learning to Handle Stimulants: experience with Ginger, 2C-C & 5-MeO-DALT (ID 87267)\". Erowid.org. Sep 23, 2010. erowid.org/exp/87267",
 "substance": "Ginger, 2C-C & 5-MeO-DALT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "550 mg",
   "oral",
   "Ginger",
   "(extract)",
   " T+ 0:20",
   "35 mg",
   "oral",
   "2C-C",
   "(liquid)",
   " T+ 0:30",
   "35 mg",
   "oral",
   "5-MeO-DALT",
   "(capsule)"
  ]
 ],
 "report": "<p>--------------------</p><p>Substances Ingested:</p><p>--------------------</p><p>Ginger Root Extract (550mg)</p><p>+ 2C-C (35mg)</p><p>+ 5-MeO-DALT (35mg)</p><p>--------------------</p><p>Previous experience:</p><p>--------------------</p><p>MDAI, 2C-C, 5-MeO-DALT, 2C-E, DXM</p><p>--------------------</p><p>Set & Setting:</p><p>--------------------</p><p>I awoke from a long nap this evening at around 9:30pm feeling refreshed and spontaneous. Earlier in the day, I had been contemplating a trip for the sake of promoting my creativity toward a project I had been working on. I decided I would try combining the mild visual nature of 2C-C with the buzz of 5-MeO-DALT and listen to music in my completely dark bedroom. I have taken these compounds separately up to 60mg and 40mg respectively. These trips were never overpowering; for comparison, I have estimated that 60mg of 2C-C for me may produce the same effect that others feel on 30mg. In contrast, my experience with 2C-E about a month prior had been quite difficult, even scary at moments, because I was caught off guard over its stimulating effect. The 2C-E experience helped me develop a real sense of caution with psychedelics and left a lingering bit of concern in me.</p><p>I ate a large meal earlier at around 2pm; I did not feel at all hungry yet, so I decided to also take ginger root to help ward off any chance of nausea.</p><p>--------------------</p><p>Timed Notes</p><p>--------------------</p><p>11:25am - Ingested 550mg ginger root extract.</p><p>11:45 - Orally ingested 35mg 2C-C dissolved in water.</p><p>11:55 - Orally ingested 35mg 5-MeO-DALT in capsule (can't stand the taste).</p><p>12:04 - Going to play robot unicorn and wait for things to get interesting.</p><p>12:07 - Interesting. I felt very disconnected from the game, yet I did pretty well regardless. Scores were 14774, 7664, 20338. Total of 42,776.</p><p>12:10 - Pretty sure I'm starting to feel the onset. Pretty fast.</p><p>12:23 - Pretty smooth comeup so far. Tactile perception enhanced/</p><p>12:29 - I have to emphasize the tactile enhancement again. This wasn't intentional, but there's something very erotic going on that I want to explore.</p><p>12:46 - Wow! Incredibly clear-minded! Cognitive abilities don't really appear to be affected too much. This is very comfortable.</p><p>1:35 - That was weird. I just felt a surge of discomfort in my breathing, much like the 2C-E trip. A little worried. Going to take a shower.</p><p>1:42 - HA! That's some major time distortion. A short time after I made the last note, I decided to jump in the shower. Then I had to look for a towel. Then come back to here and start typing. Apparently that was a very short shower. It felt great though and helped somewhat.</p><p>2:07 - Time is slow. Heh wow. The anxiety came back :/</p><p>2:47 - I have been experiencing some of the same (vasoconstriction?) as 2C-E, but to a lesser degree. Me and those stimulants, jeez. lol. Anyway, my heart bpm is 102 so that's good. I don't think I would take a benzo just yet even if they were available.</p><p>2:50 - That bpm rating really helped calm me. Things became more euphoric again. Also clear-minded again. Wow. Everything's good again, just as it was before! (will explain more on this in the summary)</p><p>3:41 - I think I have begun coming down.</p><p>4:35 - Actually, the previous post may have been a false comedown. I don't know. It's very gradual in any case. I think I was just taken again by surprise of how clear-headed I was.</p><p>5:09 - Still affected, haha. But I'm actually going to start writing my retrospective summary.</p><p>6:12 - Took a walk around the block for some activity to help return to baseline faster. Need to leave for school by 7:30. The walk felt amazing.</p><p>6:28 - Stimulant effect is wearing off somewhat.</p><p>6:54 - Yep, this is feeling like baseline. Total duration of ~7 hours.</p><p>Note: I felt a long afterglow and stimulant effect throughout the entire morning.</p><p>--------------------</p><p>Summary and After-Thoughts</p><p>--------------------</p><p>Wow! This is a worthwhile combination. Euphoric at times, but less of a drunken feel than 2C-C alone. Very clear-headed. Very pleasant-body high, so long as I didn't panic over the stimulating effect. It also felt much more conductive toward productivity.</p><p>Visuals for me were present, but not to any great extent. Comparable with a 50mg 2C-C trip for me. I've never had very spectacular visuals - just some abstract colors and shapes that show up now and then in a sea of darkness when I close my eyes.</p><p>The combination never caused any auditory distortions, but I will note that my mood was quite sensitive to music. Some parts of songs made me very uneasy, so I avoided these. There were plenty of other warmer songs that I found myself joyfully dancing around to. Early era Supertramp and Queen were the favorites tonight.</p><p>During the comeup, tactile sensations were the first thing greatly enhanced. Plenty of erotic energy and imagination during that point. Honestly, I thought of some very graphic stuff that would normally cause even me to be taken aback, but it all seemed so natural and beautiful and right, so I went with it. I think this was a nice lesson.</p><p>However, the big lesson for me PERSONALLY...</p><p>From about 1:45 - 2:45, the experience grew difficult. I started to worry over the stimulating effect. I experienced some tightness in the chest, very much like my 2C-E experience, however this felt a bit more manageable and not as scary. As it turns out, this experience was a great teaching tool for helping me understand exactly what happens or can happen when using a stimulating psychedelic. I found that I should not be alarmed that breathing manually through my mouth is uncomfortable. Considering the time distortion, I believe such an act would be like trying to continuously breath with my mouth very fast - and that just doesn't work, so I would grow anxious. I found that instead, I should just allow breathing to occur through my nose, and not anymore than what is needed/natural. This is important to recognize, but not be alarmed over, because it can needlessly trigger a panic-attack. The turning point was when I used a stopwatch to test my heart's bpm. At 2:45 I got 102bpm. This was elevated, but completely acceptable and led me to become much more relaxed. The nice body high and everything else from early in the trip returned. I tested a little later and got 78bpm. I think this shows the increased heart rate was completely self-manifested, simply because I started worrying over 'what-ifs' and bad memories of the 2C-E trip. With this experience and knowledge, I could probably find 2C-E to be much more manageable, however I still don't plan on going down that road again too soon.</p><p>The combination trip surprised me in its duration. ~7 Hours total. However, this makes sense if I consider that a 35mg 5-MeO-DALT trip would last ~2 hours and a 35mg 2C-C trip would last 4-5 hours. I would probably not go higher than the 35+35 dosage, but that's just me.</p><p>Overall, this was the most beneficial and enlightening trip I've had to date. I believe that by relearning proper breathing, it helped me to understand and overcome the source of anxiety during strong stimulating trips. Better breathing is sure to help me in the sober world as well. The experience has also helped me to continue to see things in life just as they are, free from the skew that social conditioning causes; we can live much more authentic lives with less stress and cognitive dissonance when we can recognize and accept life as it is.</p><p>--------------------</p><p>POSITIVES:</p><p>--------------------</p><p>-Tactile enhancement</p><p>-Euphoric tendency</p><p>-Very pleasant body-high.</p><p>-Erotic potential</p><p>-Clear-headed</p><p>-Therapeutic potential</p><p>-Positive mood during afterglow with no headache/hangover effects</p><p>-Saw improvements the following days in mood, motivation, and sense of self.</p><p>--------------------</p><p>NEGATIVES:</p><p>--------------------</p><p>-Stimulant effect can cause anxiety.</p><p>-Possibly not deep or strong enough for some.</p>",
 "year": "2010",
 "id": "87267",
 "gender": "Male",
 "age": "19",
 "timestamp": "2010-09-23T07:00:00.000Z",
 "views": "3636"
}
