{
 "title": "A Close Call",
 "author": "Depra",
 "citation": " Depra. \"A Close Call: experience with 2C-D (ID 87284)\". Erowid.org. Sep 21, 2010. erowid.org/exp/87284",
 "substance": "2C-D",
 "bodyweight": "80 kg",
 "report": "<p>First I'll add that I'm not very experienced with psychedelic drugs, and probably most other people will not experience this insanity. I weighed out 80 mg of 2C-D on my MM scale, which is twice as much as other recent 2C-D trips. I was sitting in my small apartment tripping alone, and I figured I was in for a great time. My stomach was not empty, but this substance seems to be just as potent with or without empty stomach.</p><p>After 90 minutes I'm reaching the peak of the effects, and around here I lose complete grip of ordinary reality, and internal fantasies and psychedelic visions apparently take control of my physical body, losing completely any sort of control. Last thing I remember is that I was feeling discomfort, feeling like I had too much energy, having too much energy, and worrying that I am dead (ego death I suppose). I could not feel my heart, and soon I accept that it is too late, and my spirit might already have left my body. So not knowing what to do with myself, having all this energy, I start dancing around my apartment, and this is where I lose complete control. Unbeknownst to me at the time, all my visions / dreams / fantasies are coming to the surface through intense screaming, and basically letting myself fall around the apartment, throwing my possessions all over the place. Neighbours call the police, and only 3-4 hours into my trip - around the peak - I suddenly find myself in a police cell. As I only got to know later, 5 police officers had to carry my body out of the apartment. Normally I would've been freaked out, but I integrated the strange events into my own fantasies.</p><p>Immediately upon arriving, and being put in a cell for the night so that I'd calm down; I get naked, jump and flip around as if practising martial arts, and I do throat singing, doing different yoga-like postures, and meditative positions, showing respect to the police officer standing on the outside with my hands put together and crossed legs.  As I lie there on my back, the ceiling was morphing in wonderful ways. I was convinced that I had a direct connection with the spiritual realms (which of course, to which there is some truth) and I was starting to dislike the wall between me and the police officers - I would like to tell them how much I love them, and talk about philosophy and religion - discuss my new enlightened ideas. I am a foreigner in this country and could've gotten imprisoned or thrown out of the country from this crazy episode. On the contrary, nothing happened. I insisted to them that I just had too much to drink. I don't think they believed me, but they let the entire matter slide.</p><p>Now, a day later I have about 10 small cuts on my body, from bumping into objects and I wouldn't know what..., and flipping around naked in the prison cell and in the process rubbing my skin against against the plastic mats a bit too much. My vocal cords are very sore from long periods of screaming and throat-singing (a little hobby I have... which during the trip I am pretty sure I actually took to masterful levels, but there were no one there to record.) I am happy that I did not endure any lasting physical injury, nor did I get in legal trouble or get evicted from my apartment.</p><p>In the prison cell, I only first started wondering where I was after a few hours of sleep and waking up in the night. It was certainly the most bizarre and dangerous trip I have had, while at the same time a rich, fantastic experience, so full of imagination and wonder. But for now I will take a break, maybe wait for a different RC substance to come up ...</p>",
 "year": "2010",
 "id": "87284",
 "gender": "Male",
 "age": "26",
 "timestamp": "2010-09-21T07:00:00.000Z",
 "views": "4719",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "80 mg",
   "administration": "oral",
   "substance": "2C-D",
   "form": "(powder / crystals)"
  }
 ]
}
