{
 "title": "Caffeine, stange noises, and sleep paralysis",
 "author": "Doppelgnger",
 "citation": " Doppelgnger. \"Caffeine, stange noises, and sleep paralysis: experience with Caffeine (ID 873)\". Erowid.org. Jul 16, 2000. erowid.org/exp/873",
 "substance": "Caffeine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Caffeine",
   "(liquid)"
  ]
 ],
 "report": "<p>It was one of those very strange weekends where I was going to pull an all nighter, so I decided to load up on caffeine. Coffee, Mountain Dew, Jolt, Surge, I was drinking whatever I could find.</p><p>Anyway, the night went rather well, as I was bouncing off the walls. Over the next 24 hours, I phased in and out of sleep. At about seven o'clock that night, I went right to sleep. Everything's going okay, but wait, there's more.</p><p>I woke up at about two in the morning. I got up, drank a glass of water, and went back the bed. The next moment stands as one of the strangest experiences of my life.</p><p>I heard a strange, indescribable sound. It resonated, and echoed, growing louder every time. I knew it was coming from the inside, but I was still very afraid. When it soon seemed to get unbearably loud, it stopped. I got up. Or, at least I tried.</p><p>For the next few seconds, couldn't move at all. Any commands I send to my arms and legs wouldn't work. Of course, I knew that I had sleep paralysis at that moment.</p><p>I waited a few seconds and was able to move again. Some people have these experiences and think it was divine, or perhaps even interstellar.</p><p>But I know that these strange effects were the result of caffeine.</p><p>Please tell me I'm not the only one that hear's these noises. It happened again, and for the same reason. It started to scare me.</p>",
 "year": "2000",
 "id": "873",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-07-16T07:00:00.000Z",
 "views": "14577",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  }
 ]
}
