{
 "title": "Interesting Sensations",
 "author": "wolfy",
 "citation": " wolfy. \"Interesting Sensations: experience with Sleep Deprivation (ID 87309)\". Erowid.org. Sep 21, 2010. erowid.org/exp/87309",
 "substance": "Sleep Deprivation",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "2010",
   "87309",
   "Male",
   "",
   "21",
   "Sep 21, 2010",
   "3125",
   " "
  ]
 ],
 "report": "</p>This is an experience that happened to me during university due to sleep deprivation. I wasn't extremely deprived of sleep but it was enough to have produced some peculiar effects.</p><p>On a Thursday night we all went out to this club. I had class at 8am the next day but decided to go anyway. I should note that I only had three drinks this night so I don't think alcohol had any significant effect. I danced a lot that night and was very exhausted at the end of it, however upon returning home I did not go to sleep until about 5:30am, and woke up only a few hours later to go to class. So the day went by as normal, aside from being tired. But then that night I was working on a project until about 3:30 am, when I finally decided to go to bed. Shortly after laying down in bed and closing my eyes I began experiencing some strange sensations.</p><p>The first thing I noticed was like an external pressure on my chest from some unknown object. Not painful, just slight pressure, as if they were some object there. I then began to notice in my fingertips a sensation like they were wiggling around even though I was not moving them. And then, the most interesting part, I began to feel like there was a girl in the bed with me, rubbing up against me and so on. I could feel her when her body touched mine. And when she moved around I could sense where she was even when she was not touching me. The feeling of her presence was so convincing that I actually opened my eyes to check at one point. There was one point when she whispered in my ear and I had an auditory hallucination. I don't recall what she said. I don't think it was words so much as just sounds, but I definitely heard it.</p><p>I was awake this whole time, but with my eyes closed. It was a pretty interesting experience and really quite nice. And what surprises me is it took relatively little sleep deprivation to bring this on.</p>"
}
