{
 "title": "A Day Out of Time",
 "author": "Tumbleweed",
 "citation": " Tumbleweed. \"A Day Out of Time: experience with 2C-B (ID 87389)\". Erowid.org. Sep 23, 2010. erowid.org/exp/87389",
 "substance": "2C-B",
 "bodyweight": "127 lb",
 "report": "<p>The train drops us off at a non-descript station.  It is just a bench with a sign above it reading Appalachian Trail.  We cross the tracks, enter the trailhead, and leave it all behind.  It is about an hour later that we come to a large clearing of farmland beside the trail and set down to lunch.  It is a perfect autumn day.  The sun beats down on us, tempered by cooling breezes.  The sandwiches and trail mix are tasty. For dessert, I eat 18mg of 2C-B.</p><p>Twenty minutes later we have come to a thick forest path, and the climb is uphill. We stop for a breather, and every exhalation brings mounting waves of sensation. Perhaps it is the power of suggestion, but one of my companions mentions a swelling in her solar plexus and the rest of us agree we feel it.  If I relax my eyes, vague lattices scroll by.  We power on up the hill. Euphoria builds.  A toad that looks like the patch of dead leaves in which it sits lets me get close enough to touch it.  The girls hang from a tree that is our totem.  We keep climbing.</p><p>Three and a half miles into our hike, we come to a rock promontory overlooking a vast expanse of farmland.  A sleepy hamlet sits down below. Grain solos and red farmhouses dot the landscape.  America stirs in my chest.  We spread blankets and settle into the trip.  2c-b is a beautiful drug. I walk into the woods to piss and as I am pissing, I think about the choice I made to eat 2c-b as opposed to mushrooms. Life is busy right now, and I am working on myself in many different ways. I realize I know exactly what would have happened if I had eaten mushrooms  some foreign, invasive intelligence would crowd my consciousness, telling me I should do this and do that.  All things I know I should do, that I am trying to do.  The last thing I need is to be taken for an existential ride.</p><p>And yet, I am tripping. Boundary dissolution, plasticity of ideas, I am working through concepts. It is easy. I feel a perfect euphoria in that it does not overwhelm me at all. Rather than lay heavy on me, it lilts and lifts me. I come back to our temporary camp and love my friends. We are free and easy. We have ideals and we share them. This is how I want to spend my time.</p><p>Laying on my back, I melt into the hillside. Rebecca places a lavender-scented eye pillow across my face and I am transported deep inside myself. Faint patterns crawl across the insides of my eyelids. With every breath, I find I can relax deeper and deeper into the hill, into myself, into the trip. Alexander Shulgin, thank you. I dont relax enough. It must be possible to achieve this state of relaxation in the hustle and the bustle of New York City, without the drug. But this taste is valuable. I am filled with gratitude.</p><p>Some time later, we pack our things to leave. Together, we walk to the farthest protrusion of rock, looking out over the pastoral landscape beneath us.  Rebecca beats her chest like a gorilla, and I follow her lead and start screaming like a crazed monkey.  Nicole and Frank join in the fray and our screaming builds to a singular crescendo, some great cathartic release. Our scream ends and we look at one another. I assume their bodies are all vibrating with the same intensity as my own. The screams ride back to us on echoes from the valley down below. Sweet catharsis. A day out of time.</p>",
 "year": "2010",
 "id": "87389",
 "gender": "Male",
 "age": "27",
 "timestamp": "2010-09-23T07:00:00.000Z",
 "views": "2358",
 "dose": [
  {
   "time": "0",
   "amount": "18 mg",
   "administration": "oral",
   "substance": "2C-B"
  }
 ]
}
