{
 "title": "Ill Never Need Pot Again",
 "author": "Todd the Leper",
 "citation": " Todd the Leper. \"Ill Never Need Pot Again: experience with JWH-018 (ID 87396)\". Erowid.org. Feb 8, 2011. erowid.org/exp/87396",
 "substance": "JWH-018",
 "bodyweight": "150 lb",
 "report": "<p>I take 60mg Celexa daily for anxiety and panic attacks. I have gone through a lot of individual and group therapy, CBT and other things, and my anxiety is very much under control and I feel much more in control of my life than I ever have. That said I decided I wanted to get high, but being in the military I'm pretty much limited to RC's. I'd already done some 2c-i, 2c-e, pure DXM, and some DMT variants, so I was pretty confident in a number of online suppliers. So I discover JWH-018 and 'Spice' ...</p><p>I keep hearing terrible things about Spice and JWH-018. I love asking people, 'How much did you take?' and they respond with some kind of mumbling which roughly equates to, 'I don't know'!!</p><p>So, I read about Spice. JWH-018 is supposed to be sprayed onto Spice. How can you spray such a sensitive chemical on any kind of herbal blend and expect to know how much you're getting regardless of how much 'herb' you're smoking? You can't, so I didn't actually smoke Spice. Instead, I ordered some JWH-018, a one gram bag. I weighed it all on a scale and it came out to about 1.02 grams. Why thanks for the extra, Mr. JWH Supplier from the Internet.</p><p>I had heard that a good dose was about 3mg smoked or twice that amount oral. So I did some quick thinking.</p><p>1000mg / 128 = 7.8125</p><p>So I split it into half, then that into half, et cetera, until I had made 128 piles which looked about the same. Figuring a good portion of it stuck to the surface I was using, I assumed that each gelatin capsule I had filled had about 7mg in it, surely no more than 8 or 9. Wonderful. I knew exactly how much I would be taking.\r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active as such a small dose, eyeballing is particularly unwise. See related article]</p><p>So, I took it orally. One capsule. I'm guessing it was 7mg. Every single time I have taken a capsule orally my plateaus and highs have been virtually identical.</p><p>+1:30</p><p>Wow, I'm finally feeling something. It feels like I smoked a very light amount of weed. Did I not get enough? Well, I'll give it some time.</p><p>+2:00</p><p>I'm stoned. Holy crap. I feel like I ate a large pot brownie. I struggle to find my iPod and my ~$200 ear buds. I play all kinds of random music: Andrew WK, Boards of Canada, Emperor, Talib Kweli, Lady Gaga, the first Metallica album... everything sounds great. Just like pot. In fact, I can't tell any difference whatsoever from when I ate a large sized pot brownie. I am just as ecstatic.</p><p>+4:30</p><p>I realized I'd been sitting down for about two or three hours doing nothing but listening to music, but it felt like much longer. This is time dilation in a good way, right? I pick up my iPod and put it in shuffle, then I sit down at my computer and start fucking around on the Internet. Doody doot doot, hello Facebook. I see my mom online. Should I talk to my mom? No. I'm stoned. That would be a really bad idea.</p><p>+6:00</p><p>I'm feeling less stoned. Holy crap, I'm finally coming down. Still like listening to music. Decide to cool down by getting on my Xbox 360 and playing some simple games. I cycle between Lumines, Geometry Wars, and Chime - they're all very basic games and feature lots of flashy lights and cool music; I enjoyed these games on 2c-i very much and they were unsurprisingly entertaining when I was on JWH.</p><p>+7:30</p><p>I finally don't feel stoned anymore. Naptime. Proceed to sleep for ten hours. Wonderful.</p><p>----</p><p>So a couple weeks later after popping the capsule a few times, I buy a glass pipe and some really good smelling, humid pipe tobacco. I decide I'm going to take half of the capsule's contents, mush it on a very tiny amount of tobacco (probably less than 5% the length of a cigarette) and down all this in one big puff. I don't smoke cigarettes anymore so it irritates my lungs quite a bit, but probably less than pot would since it was a small amount of very 'clean' tobacco.</p><p>+0:15</p><p>Yup. This feels exactly like I just got done smoking pot. Holy crap, I'm going to call that girl and invite her over to smoke with me! In the meantime, time to listen to music. I choose 'Blood Inside' by Ulver which is a strange, noisy, scary, electronic-but-not-dancy album from Norway.</p><p>+0:40</p><p>I hear my phone vibrating. I get a text message from my friend. Something along the lines of 'I'm knocking at your door and you're not answering' so I let her in. After about ten minutes she smokes some with me, but I'm already quite stoned and impatient, waiting for her to get as stoned as me.</p><p>+1:45</p><p>We're both peaking. I had been there for a little bit but she finally came up to my level. We're watching interviews with Sarah Palin and giggling our asses off and making jokes about Alaska and Russia. We are having the time of our lives, but something is missing: FOOD!</p><p>+2:30</p><p>Pizza man comes. That's fast. Ham and pineapple on thin crust from Domino's. I'm glad I found a girl that will tolerate my favorite pizza with me. And yes of course the pizza was delicious. She doesn't like rap, but we're listening to Raekwon's 'Only Built 4 Cuban Linx 2' CD and she's commenting on how she kinda likes it. Maybe she was just stoned.</p><p>+3:30</p><p>I'm definitely not stoned anymore. She is though, but I noticed she was coming down.</p><p>+5:00</p><p>She goes home. Neither of us are stoned anymore, but I have work in the morning and she has to go see her girlfriend a few hours away, blah blah blah. Time to call it a night, so I hit the sack and proceed to sleep wonderfully, just like I had smoked pot.</p><p>----</p><p>Overall I would say JWH may very well replace marijuana for me, period. I got a gram for $40 which is 256 hits smoked, or 128 hits orally. My glass pipe was $20, the tobacco was $5 (and I can easily get 100+ uses out of it), and a lighter is what? $1? $2? Considering this stuff is legal right now, and I'm carrying around tobacco with it to make it seem less discreet, I don't see why I should start smoking pot ever again.</p>",
 "year": "2010",
 "id": "87396",
 "gender": "Male",
 "age": "23",
 "timestamp": "2011-02-08T08:00:00.000Z",
 "views": "6101",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "7 mg",
   "administration": "oral",
   "substance": "JWH-018",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": "3.5 mg",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": "",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Pharms - Citalopram",
   "form": "(daily)"
  }
 }
}
