{
 "title": "Tracks in the Snow",
 "author": "Typhon",
 "citation": " Typhon. \"Tracks in the Snow: experience with Cocaine (IV) (ID 8743)\". Erowid.org. Jan 17, 2003. erowid.org/exp/8743",
 "substance": "Cocaine (IV)",
 "bodyweight": "145 lb",
 "report": "<p>It was a rather strange at work for me.  Wal-mart is the last place I'd expect to get started on my adventures with cocaine.  I'd done coke before but only a line or two before a party kinda thing.  I'd never even bought any before; it was only when friends I knew managed to buy a gram or an eightball, which to us mas big.</p><p>So There I am chatting with a co-worker, who I occationally sold hashish and mushrooms to, and he asked me if I wanted to try some coke that he just picked up.  I hadn't had a chance to do coke for about 18 monthes at this point;  so I said why not.</p><p>We went into the bathroom, chopped up some fat lines, and each snorted two.  It felt so good, I had the best day at work I'd ever had and no one suspected a thing.  Before my companion left work he offered to spot me a gram until payday.  I accepted it.</p><p>A few years ago I had tried main lining a few different drugs.  I started with meth, then tried PCP and ket, and finally Heroin.  I've shot heroin twice in my life.  The first time I loved it.  about 8 hours later I did another and felt superb.  And really wanted another.  Heroin withdrawl scares me.  I've seen and and knew that some day I wouldn't be able to get my fix and it would really hurt. So I've never done it again.</p><p>So I get home after work with my first gram of coke and display it on a little mirror for while merely staring at it.  I was still feeling a bit from the lines I did earlier so I decided to try something.  I went to my closet, and in a small box in the cornor were a spoon, some q-tips and some sterile syringes.  So I put about 150mg's or so in the spoon; added 60 units of water and proceeded to cook my first hit of many. </p><p>I have since learned that you only need to use cotton on some stuff; some coke seems to disolve easier and not need a q-tip.  I think perhaps it might have to do with purity; the stronger the dope the easier it disolves in water. </p><p>So I'm sittin on couch with my shirt off, my belt off and an insulin syringe in my hand filled with aprox 150mg of a drug that would catch me an instant 10 years.</p><p>I tie off and choose my mark, plug it in, pull a bit of blood and fasten my soul's seat belt.  The depression of the plunger was all it took to set me of, before I even got the needle out I started on my first wave of euphric splendor.  It was a damn good hit.</p><p>I stood up and just walked around making a strange noise like a bird or something for about 10 seconds then sat down and just kept thinkin wow.  THis is excellent.</p><p>A few days later payday came and I bought an eightball.  Me and a buddy sat back and he did a few lines, I did a fat shot, and about every half hour or so after that I did another.  The next thing you know it's about 12 hours later and there's only a slight residue left in a baggie.</p><p>A month later I calculated that in that month I spent about 2300 or so on cocaine.  I bought an eightball every day.  I don't start using until usually at least 8 or so in the evening, of course I was usually extremelly hung over from the night before.  There was usually at least one person sharing the spoon with me or requesting some bumps, and money is only money.   I remember an evening where I went out to score four times.  There were three of us; Two of my closest friends (whom I've known for a lot longer then I've done cocaine.) and I bought an eightball around midnight, and by two o'clock it was all in our arms.  So we bought another eightball.  I went out twice more and boutgt two grams each time before 6 and none of us snorted one line. </p><p>That afternoon I had went to the needle exchange and got a new box of 100.  In the morning There was 30 or so left.  My arms were looking like grand sentral station. </p><p>Now I never really felt addicted to it.  Often I would stop for a few days just to let me arms heal up a bit and have no trouble at all.  I truly believe that it is only phychologically addictive which I can usually control pretty well.  I still want it, but I want to give it some time so I don't use.</p><p>I always however manage to score big less than a week later; and start the whole process all over again.  I managed to keep my hobby a secret from the rest of my co-workers, friends who didn't use, family and doctors by always wearing long sleave shirts and keepin it real low profile. </p><p>However using as much as tend to often gives you the opportunity to met other users, and most of them fiends.  So I started buying half O's and ounces and helpin out the 'hommies' with no 'blow'.  And I could keep more for myself and not spend a dime of my own money. </p><p>I find sometimes though that I binge a bit longer and don't take a few days off as often; but I figure that I spend at least 10 days or so out of every month clean.  Sometimes I stop for a week just to make sure I still can and it's never a hassle.  I do want it; but agian I keep my sights on my target.  Marijuana is still my all time favourite drug, and I smoke it more often then I shoot coke.</p><p>By no means am I trying to advicate that cocaine is good for you, or that it's okay; because as much as I'd like it to be, it's still illegal.  I've seen it destroy a few people lives, perhaps I am one of them, but I can truly say that I have never needed it.</p>",
 "year": "2001",
 "id": "8743",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-01-17T08:00:00.000Z",
 "views": "24942",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "IV",
   "substance": "Cocaine"
  }
 }
}
