{
 "id": 8743,
 "title": "Treadmill of Numerous Realities",
 "date": {
  "submission": "2008-06-10T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nitsuj",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "I awoke early on this Saturday morning. Tired yet very excited towards the coming adventure. We reached our destination around 9.30am, and instantly divided the tabs. My friend D*** and I were taking one and a half, and the others just one. We have had LSD before but only in small doses, and we never experienced it to its full potential. But we both knew after today that would change. We had an abandon house with a large block of land to trip at. Around 25 minutes after dropping the tabs, I was walking with my friend B** to retrieve some insect repellent as our trip spot was quite infected with mosquitos. While in the supermarket, I noticed overwhelming feeling of butterflies in my stomach, and anxious feeling. Once we had bought the repellent we then walked back to our trip spot.",
  "I noticed while approaching the abandoned house, it seemed to stretch very far away then normal, and kept stretching the more I walked towards it. Half an hour since dropping, back with my friends now, all feeling the same anxious butterflies in us, I slowly begin to feel the effects. My mind starts racing, I feel energy building up in me, my stomach begins to tense up and also my jaw clenches in a strange matter, very different to MDMA. My friends heads are warping slightly, nothing drastic. I don't remember the full effects creeping up on me so quickly, but around 1 hour into the trip, after lying down for a bit I open my eyes, the trees around me are no longer trees, but a collage of of amazing colours collapsing into each other. The effects are quite intense, I feel a discomfort of some sort, nasuea? I couldn't tell, my body had left reality, and now for some reason I could not identify what nausea felt like. I take deep breaths, I look up. Now wait a minute, I've never seen a tree turn that colour before. I start to feel more comfortable, calming my self down, taking more deep breaths. 'Ok I've taken some acid. I WILL be ok. I've done it before, even if something bad happens I will still be ok.'",
  "Slowly my mind falls deeper and deeper down the rabbit hole. Soon I cannot even remember what reality is or was. I sit up feeling an energy burst, Mars Volta is beeming from my friends speakers, the music appears in a Vein like formation on the ground weaving in and out of the leaves, truly amazing. I see my friend flick a insect off him. I stare at this insect, my mind starts its amazing power. I think about the insect's mind. What thoughts does it receive from its brain? Does it have emotions? WHAT CREATES A THOUGHT? My brain is now a masterpiece of thoughts, of life, the brain evolution. It is around 2 hours after dropping, I finally get to my feet, my friends heads are extremely oversized, caricature like. One of them for some reason resembles Richard D. James, from Aphex Twin exactly! 'HOW DID YOU DO THAT!?' I yell. My friends obviously are aware now of my altered state.",
  "I take a walk around the abandoned house, looking on the graffiti covered ground, the graffiti slowly starts to swirl around the ground with a smoke like texture. I slash some water onto it with my water bottle, the water stain expands rapidly to about 50 times its normals size, morphing into amazing shapes, disappearing and reappearing. I am astonished, I run back to show a friend, noticing back on the way the scenery slowly turning black and white and then back to its full coloured self, the leaves with a flurescent like texture. I take my friend B** to the spot where I saw the amazing event. I splash the water onto the ground, I see the exact same thing, so does B**, I then begin to realise that his mind and the rest of my friends are all now sharing the exact same wave length. We then begin to share our thoughts and discoveries, all being able to relate to each other, some amazing conversations, this is around 4 hours after dropping.",
  "We decide to take another walk, up a long pathway. So many different sceneries that I interpret as other worlds I witness on this walk. I say to my friends 'Welcome to the treadmill of numerous realities.' They burst out laughing, what a trippy thing to say I think to myself. The extreme hallucinations start to wear of now, I am left now with a racing mind, and small warping effects, this is after around 5 hours. I notice that the comedown in slightly similar to MDMA, very worn out feeling, loss of social mood, no depression just not a very talkative mood. What an amazing day. I will remember this day as my first mind expansion, a great day with friends, and much self discovery."
 ],
 "erowid": {
  "id": "51465",
  "citation": " Nitsuj. \"Treadmill of Numerous Realities: experience with LSD (ID 51465)\". Erowid.org. Jun 10, 2008. erowid.org/exp/51465",
  "substance": "LSD",
  "views": "4705"
 }
}
