{
 "id": 8744,
 "title": "Weakness, Fainting, Admission to Hospital",
 "date": {
  "submission": "2006-10-11T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "fooly",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "fresh"
  }
 ],
 "report": [
  "I have had no experience with mushrooms. Previously, long ago, I had a few LSD trips which were nice. These days, occasionally I smoke some grass, which I like, because everything gets easy, and which I dont like, because concentration deteriorates and it is not easy to exploit interesting or pleasant thoughts.",
  "I am very well settled in life with a great job, a great family and a healthy and sportive body. The one thing I am missing a bit is a deep spiritual experience. I meditate with pleasure, but this is never 'sensational'. Heaving read a lot of great experiences on the web, I ordered 2 mushrooms on the internet. I received confirmation by email that the order was shipped on February, 28th. However, the package arrived very late on March, 8th. The shrooms were sealed in a plastic bag, thick stems, caps not opened with a length of about 10cm. The label on the bag said, beginners should not consume more than half of the package.",
  "In earlier days, my parents, brother and sisters were often outside in the forests to collect mushrooms for eating, which we used to fry and eat. So I kind of know to distinguish a fresh and older mushroom. These mushrooms did not look good. My instinct said: dont. I did not listen to this voice, and I did for some temporary stupidity not consider food poisoning. So I got the bill.",
  "I opened the seal to let them dry for three days at room temperature. On march 11th they were half dried. At 5pm I consumed about 3/4 of the two shrooms, which corresponds, I assume, to about 15-25g fresh mushroom. One hour later I had a slight feeling of flying, another hour later my ability to smell and to hear was more intense. Time seemed to flow a bit slower. But, overall, nothing spectacular. Four hours after ingestion I was tripping similar to an overdose of eaten shit (marihuana). I felt very weak and not nice and tried to resist.",
  "Over the next two hours the weakness increased close to swooning. I told my wife that I did not feel good. I felt cold but still had a great desire for fresh air. We opened the outside door, which relieved my fresh air desire but made me feel cold even more. My mouth felt dry, I asked for water. I had cold sweat on my forehead and was scared that my body would be uncapable to deal with what I had done to it. My heartbeat was OK with 72 beats/min, but I had the strongest feeling that my circulation is close to breaking down. On the way to the toilet I lost consciousness for about a minute. At that point my wife called the ambulance. I was admitted to hospital.",
  "My circulation was monitored for the next hours and did not show any problem on paper, but for another hour or so during intensity care weakness and the threat of losing consciousness were scaring to hell. At some point someone decided to direct pure oxygen into my nose, and my condition improved immediately to a point where I thought, I might be rescued.",
  "About 11 hours after consumption, when I was out of intensity care laying on the bed for the night, I had a small relapse of weakening and cold sweat, which passed after sitting up. I was released from hospital next noon.",
  "The medical doctors apparently seemed not to be very knowledgeable, neither on food poisoning nor on magic mushrooms. They probably did not consider my case a serious one, but did not have a clear clue what was going on either. They called a special intoxication unit [toxicologist] in another town and according to them horror trips like this were known and of psychosomatic nature. However, I did not find any experience like this on the web at the time, and I know that the circulation thread came first and than the anxiety, not the other way round. I should mention that I pissed almost 2 liters during the night in the hospital which to me is indicative of a physical reation to a toxic effect as well. On the other side, as far as I know the failure cannot be ascribed to typical food poisoning (alone), which almost always goes along with diarrhoea, sometimes with fever, sometimes with partial paralysis due to botulinus toxin, which I did not have.",
  "In corollary: be absolutely certain that the kind of mushroom you are going to consume is the right kind. Start with a low dose for the first time and increase gently the next time. Most important: let it be fresh !!!!"
 ],
 "erowid": {
  "id": "51482",
  "citation": " fooly. \"Weakness, Fainting, Admission to Hospital: experience with Mushrooms - P. cubensis (ID 51482)\". Erowid.org. Oct 11, 2006. erowid.org/exp/51482",
  "substance": "Mushrooms - P. cubensis",
  "views": "6426"
 }
}
