{
 "id": 8746,
 "title": "Hospitalization and the Drip",
 "date": {
  "submission": "2006-10-20T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Adc",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4",
    "unit": "tablets"
   },
   "administration": "oral",
   "substance": "Piperazines",
   "specific": "BZP"
  }
 ],
 "report": [
  "For quite a while after dosage I felt quite good (I took 4 original p.e.p pills, I'd done 2 a couple of months prior to this and I had experienced no effects, so this seemed a good dosage). It was very much like a decent dose of speed, but somewhat psychedelic. I noticed as time went on that I was beginning to get visuals. They mainly consisted of thin 'waves' of lines of dark green and purple, but did vary.",
  "After around 2 hours of dosing I began to feel slightly unwell, like the trip was becoming too intense, it became difficult to type, where as before my typing was enhanced greatly. I also started to notice general discomfort and a difficulty breathing.",
  "As time went on this continued, gradually getting worse and worse. I tried to reassure myself that I was just having a bad trip and that it must be mainly paranoia due to the intensity of the trip. My heart felt like it was beating far too frantically and breathing was now quite a task. I decided to go to bed but upon laying down I felt extremely uncomfortable and extremely scared. I felt as if there was a huge pressure on me, pushing me back. The darkness was extremely intensified, I couldn't see my own hand in front of my face hardly, it was like a very thick fog. Then I began to get strange pains and a numbness down my left side which would come and go.",
  "Still worrying if it was just paranoia, I decided to call for an ambulance; better to be safe than sorry I thought. The ambulance came after about 15 minutes and the paramedics took me out to and hooked me up to some sort of heart monitor. I was told my heart beat was quite high and that they'd need to take me into hospital. That journey in the ambulance seemed like one of the longest I've ever had. I kept feeling as if I were about to faint or go into cardiac arrest (which wasn't just paranoia).",
  "When in hospital they took blood samples and continued to monitor my heart/pulse and blood pressure etc. They hooked me up to a drip to try and flush the drug out of my body and injected some sort of steroid.",
  "I dosed at around 1am, got into hospital at around 7am, and after a few hours they moved me from accident and emergency to a ward. I spent all of that day and the majority of the next on that ward, all the time hooked up to a heart monitor to, often being checked upon.",
  "Later on I found out my heart reached over 160bpm when I first entered hospital, normally it should be 60, anything over 100 is quite dangerous and can prove fatal. My heart didn't even begin to slow down until around 6pm that evening, and still it was around 100/120bpm.",
  "I was let home around mid afternoon the next day. It was an extremely traumatizing experience for me, I really didn't think I'd make it through it. I was extremely paranoid and honestly believed that my heart wouldn't be able to keep up and would eventually just go into cardiac arrest (which it could have easily done).",
  "I found I was very tired and still found it somewhat difficult to breathe for the next few days after this, not really recovering properly for a week. What's worse than that though is that now I'm extremely paranoid about ever using stimulants again, I'm not entirely sure if there's any lasting damage that has been done and worry if I were to use a stimulant, would my heart be fucked."
 ],
 "erowid": {
  "id": "51485",
  "citation": " Adc. \"Hospitalization and the Drip: experience with Piperazines - BZP (ID 51485)\". Erowid.org. Oct 20, 2006. erowid.org/exp/51485",
  "substance": "Piperazines - BZP",
  "views": "10805"
 }
}
