{
 "title": "Who Needs Viagra",
 "author": "Kaptinemo",
 "citation": " Kaptinemo. \"Who Needs Viagra: experience with Salvia divinorum (ID 875)\". Erowid.org. Oct 11, 2000. erowid.org/exp/875",
 "substance": "Salvia divinorum",
 "bodyweight": "225 lb",
 "report": "<p>My first salvia experience was approached with a good deal of trepidation; I cannot say I am an experienced psychonaut. The closest I have ever come to any self-revelatory experiences was with some very low grade mushrooms, and I saw little in the way of the visual phantasmagoria others have reported. I was understandably worried about the effects of this plant, having read many of the available subjective experiences about it on this website. But my curiosity got the better of me, and in this instance, I am glad that it did.</p><p>Having secured the Salvia from a reputable source, I prepared it in a 6X solution, dried the leaves, and placed them in a bowl of a homemade hooka. As I did so, I felt that, just as with cannabis, I should make some gesture of respect towards the spirit of the plant. I have no one set of religious beliefs, but I said something of a prayer requesting that no harm come to me or those around me as I partook.</p><p>I had prepared a couch, placed the hooka on the floor beside it, the bowl of which serendipitously was just level with the edge of the seat. I had selected a favorite album of mine, Pangaea by Stephen Bacchus, as it offers a wide range of instruments in the selections, but is very melodic and never jarring. Starting the music, I lay on the couch and lit the bowl for the first time. An experienced but out of practice cannabis user, I tended to hold the smoke for at least 5 seconds before inhaling, but in the case of Salvia, IMHO this might be unnecessary.</p><p>I took a total of four initial puffs, and after the 4th, lay back and looked at the patterned acoustic ceiling of the basement, counting 'One-one thousand, Two- one thousand' etc. until about 35 seconds. Then with majestic slowness, the tiles in the center of field of vision began to waver, to sway back and forth. At the periphery of vision, the square tiles began to flow into a counter-clockwise vortex. At this point, I closed my eyes, and surrendered to whatever the experience had to offer. Perhaps this attitude is what afforded me the great gift I was about to receive.</p><p>What happened next is somewhat embarrassing to relate. I hope the reader does not think this in any way to be an attempt by an exhibitionist performing verbal self-exposure. I am by nature a shy individual, and not given to revealing personal information easily. But I feel that the benefits of the Salvia experience far outweigh any normal reluctance on my part.</p><p>As a feeling of electricity buzzed through my body, I began to have an erection. A very strong one, and it was to say the least, distracting. While this was happening, it also felt as if the music was somehow massaging my body; the feeling can only be described as if hundreds of miniature rollers that contained small bumps were being rolled over my entire body. What was even more interesting was that it seemed to somehow be conforming to the music; the second track of the album contains Indonesian gamelon music (specially tuned bells struck in rhythm) and the sensations seemed especially synchronized with it. Also, I had deliberately set the volume of the stereo to the lowest setting possible, and the couch was a good three meters away, yet the music seemed quite loud and clear, as though I were wearing headphones. Time fell away like a scab covering new skin, and my breathing seemed to be unnaturally easy and flowing.</p><p>As the experience progressed, I saw all manner of swirling, multicolored, but very precise geometric patterns that seemed to flow pinwheel fashion. They would flow up out of a vortex, outwards then down and back into itself. It reminded me of graphical representations of the Earth's magnetic field. On that realization came another thought: this was the true meaning of the Tao; endless recycling of all there is.</p><p>Unfortunately, the experience was marred by the necessity to get up and relieve myself; it's been my sad history that the mundane intrudes into the sublime and ruins an extraordinary moment. I made it into the bathroom without incident. My image in the mirror looked no worse for wear. In the intervening weeks (only on Saturdays!) with every session, I have had the relaxation/arousal/massage sensation. As I had said, who needs horrendously expensive and possibly dangerous Viagra, when you can have Salvia. - and have some real mental fireworks as well as the physical ones?</p>",
 "year": "2000",
 "id": "875",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-10-11T07:00:00.000Z",
 "views": "25048",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
