{
 "title": "A World of Pure Imagination",
 "author": "Pox",
 "citation": " Pox. \"A World of Pure Imagination: experience with 2C-C (ID 87531)\". Erowid.org. Nov 20, 2012. erowid.org/exp/87531",
 "substance": "2C-C",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "oral",
   "Diphenhydramine",
   "",
   " T+ 0:30",
   "50 mg",
   "oral",
   "2C-C",
   "(liquid)"
  ]
 ],
 "report": "<p>Experience: I've really only had two trips, both of which were on 2C-E at 30mg and 15mg. I've smoked Salvia but I don't think that compares at all to either 2C-C or 2C-E.</p><p>Well yesterday I received the 2C-C from my vendor far earlier than I expected. He was originally going to ship it last Friday, and it would have been here by this Friday, but instead he wasn't able to ship it out until Monday. As a result, he put two-day rush shipping on it and added an extra 130mg to the original 250mg, as a compensation. I was originally going to dose 20mg 2C-E last night but because of the arrival of a new gift, I was obliged to test it out.</p><p>What follows is easily the best night of my life.</p><p>Note: I'm recalling this from memory. Today is the morning after this experience.</p><p>Set: Been pretty happy recently. Searching for jobs helps one feel like they're doing something with their life. Very, VERY excited to try the 2C-C though I'm a little worried because I'm in a house full of sleeping family.</p><p>Setting: Mom's house (dad passed away 4 years ago). My family is sleeping, and they're both very critical of drugs so I can't wake them up. Quiet, well-patrolled neighborhood too, so going outside for extended periods of time is not really an option. I'm in my room with a TV, window, brand new queen size bed, and plenty of snacks/water.</p><p>T-2:00: I measure out 50mg of 2C-C and mix it in a cup of water. I stir it a bit and it readily dissolves.</p><p>T-0:30: I take 50mg diphenhydramine (benadryl) for any nausea that may arise.</p><p>(Midnight) T-0:00: I drink the water and 2C-C. Strong bitter taste is apparent, will probably mix with some juice next time.</p><p>T+0:10: I go downstairs and get some BBQ Lays and a bowl. I always get something tasty and a bowl in case I puke. Bowl to catch it, food to clear the vile taste out of my mouth.</p><p>T+0:20: Already getting alerts. Slight cheek warmth, body stiffness, and some slight nausea/'stomach energy.'</p><p>T+0:30: First visual alerts already! Surfaces crawling, vision warping slightly. Losing full control of body and some sensation in body as I did on 2C-E. Defecating became difficult.</p><p>T+0:40: Visuals climbing rapidly, still some nausea. Starting to feel euphoric, anything tactile is awesome. Splashing water on my face in the bathroom is very enjoyable.</p><p>T+1:00: At this point I've just about peaked. I'm very surprised by the speed at which this developed. There's still some nausea, and it's still keeping me down. I feel if the nausea would just fade, I could blast off into pure unadulterated bliss.</p><p>T+1:30: At this point the nausea has faded, and I had felt like I had peaked. Tons of euphoria, waves of it flowing throughout my body. Music is godly.</p><p>T+2:00: I've peaked. I feel as if I'm hollow when I breathe. I feel so clean inside and everything is making me happy. The visuals are mindblowing, far far stronger than the 2C-E I've taken. Closing eyes makes me feel omnipotent but in a far more blissful sense than on the 15mg of 2C-E I had taken.</p><p>I'm basically switching from gleefully writhing around on my wonderfully comfy bed to playing audiosurf or watching music videos on my computer. Unfortunately I couldn't have my speakers on so I had to work with headsets.</p><p>I feel as if I'm floating. When I walk to the bathroom, I only feel my forward momentum, it's as if my legs are a separate machine.</p><p>Oh the tracers. I wave my hand in front of my face and it feels as if the FPS of the world just dropped. I see ghosts of my hand for a good 2 whole seconds.</p><p>T+2:30: I decide to go for a walk outside. I just can't resist it. The outside world just seems so magnificent but otherworldly. Once again I feel as if I could walk for miles. I reach the end of the block and it becomes overwhelming; I jog back home. I think I shed a few tears of happiness.</p><p>T+3:00: Visuals and euphoria starting to fade. Wow! This was a short trip. Mind you this is exactly what I needed, something so wonderful to pack into such a short amount of time is perfect because I don't have a busy day but there's never a point at which I'm alone long enough to be able to try most psychedelics. I get dressed (I was butt naked and writhing in bed for a while) and go downstairs. I flip on Pineapple Express and lay there (once again I can't really say I felt myself laying down. I felt as if I was floating, as if my body was a separate entity) waiting for it all to fade.</p><p>T+3:30: I heat up some garlic chicken from the day before. It's magically delicious! Still feeling some euphoria, and my vision seems 'off' but I can't really define it. There are no more distortions or colors or anything, it just feels 'off.'</p><p>T+4:00: I'm upstairs lying in bed and watching some cartoons for the ignorant bliss in them. All the euphoria and visuals are pretty much gone. Quite a short trip this was. I turn off the lights and fall asleep. There's still some familiar shaking that I experienced on 2C-E but nothing to keep me up.</p><p>Next morning: I feel tired, but that's probably just the lack of sleep. I was worried that life would seem shitty after that euphoria but I've almost forgotten what it feels like. Life is just normal again.</p><p>The pure bliss paired with the amazing sensuality and tactile glee and awesome visuals made this my favorite psychedelic so far (keep in mind I have very little psychedelic experience though). As for headspace, there was the basic looping of thoughts but that's it. The euphoria and visuals dominated the experience.</p>",
 "year": "2010",
 "id": "87531",
 "gender": "Male",
 "age": "18",
 "timestamp": "2012-11-20T08:00:00.000Z",
 "views": "1255",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": ""
  }
 ]
}
