{
 "title": "Lucky to Be Alive",
 "author": "JF",
 "citation": " JF. \"Lucky to Be Alive: experience with Bupropion (Wellbutrin XL) (ID 87541)\". Erowid.org. Oct 28, 2010. erowid.org/exp/87541",
 "substance": "Bupropion (Wellbutrin XL)",
 "bodyweight": "170 lb",
 "report": "<p>I would NEVER advise to use this drug recreationally. Here's my expierence:</p><p>6:30AM-I Wake up</p><p>6:45AM-I Take 6 Wellbutrin XL (Bopropion,150mg)(900mg)</p><p>7:00AM-I felt confident and ready for the day</p><p>8:00AM-I feel a little light headed, everything seemed okay</p><p>9:00AM-I Stand up to go to my next class and nearly fall due to a headrush</p><p>9:30AM-I feel shakey, mainly my hands and feet</p><p>9:45AM-I was talking to a classmate</p><p>*9:46AM-From this time until about 10:30 I remember nothing.</p><p>What I heard happened during my 45 Minute black out was that I had layed my head down, and rested for about 3 Minutes, at this point I started shaking violently (I bit holes in my tongue), the shaking was a Myoclonic seizure, while seizuring I also started vomiting blood, this may have been from my wounded tongue, but regardless I vomitted several times. ((I DO NOT REMEMBER ANYTHING, TOTAL BLACKOUT))</p><p>10:25-11AM-I remember getting the I.V put in me</p><p>10:30AM-I become conscious being rushed around a hospital</p><p>10:30-11:30AM-I take several blood tests and, urine test</p><p>*(While I was given the urine test I could not pee, full bladder, but I simply couldn't get it out)</p><p>*11:30AM-12PM-It is mandatory to hold seizure patients for a 12 hour watch, during this time I was on an IV for several hours.</p><p>I just got home about a hour ago, and I felt it was appropriate to inform as many people as I can. It is absolutely the worst expierience of my life, if you're going to do drugs don't do anything thinking it's totally safe. I wouldn't even suggest trying this drug, it doesn't seem to have any positive effects.</p>",
 "year": "2010",
 "id": "87541",
 "gender": "Male",
 "age": "16",
 "timestamp": "2010-10-28T07:00:00.000Z",
 "views": "5745",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "900 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion"
  }
 }
}
