{
 "title": "Strange and Comfortable",
 "author": "Vixxen",
 "citation": " Vixxen. \"Strange and Comfortable: experience with Methoxetamine (ID 87543)\". Erowid.org. Oct 1, 2010. erowid.org/exp/87543",
 "substance": "Methoxetamine",
 "bodyweight": "57 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)",
   " T+ 0:20",
   " ",
   "smoked",
   "Tobacco - Cigarettes",
   "",
   " T+ 3:00",
   " ",
   "oral",
   "Pharms - Phenazepam",
   ""
  ]
 ],
 "report": "<p>First, I have to say I take DXM in high doses, but haven't taken ketamine yet. So I just wanted to give methoxetamine a cautious try for my first time with it. I was with my boyfriend. We snorted 20mg each. I began to feel real, though light effects at about ten minutes, with a little dizziness and an enhanced enjoyment of music. At + 20 minutes, I'm at a '++' on the Shulgin scale. I am very disgusted by tobacco when on DXM, but this time, I feel like having a cigarette, so we smoke one. It's OK but I know I won't want to have another. I'm getting like a GHB effect without the drunkenness, mixed with a DXM effect without the confusion. We're at + 30 mn.</p><p>At + 40 mn, I'm set on a 'plus three' and enjoying it. I think that I could take this product at a party, but it's not extremely social, I would not enjoy shrieking laughs or too many people. At + 50mn, I think to myself that sex would be fine, but the idea doesn't impose itself, and my boyfriend is having fun with other thoughts, so I don't tell him and just listen to the music (which is definitely a good part of the trip).</p><p>At one hour and ten minutes, we take the decision to go out and buy some cider. Walking in the street is very pleasant, cloud-like. We don't seem to act too strange with the missus at the supermarket. At home, we enjoy the peak of effects for a little while, then it begins to go down, and at three hours I'm not back at baseline, but pretty much normal, although with a little anxiety (I then take a little -very little-</p><p>phenazepam). I feel good overall, it has been a peaceful and happy experience.</p><p>So at this dosage, it was pretty much like a low dose of DXM and a 'perfect' dose of GHB, without their bad side-effects, for me and my boyfriend. I think we'll try 30mg next time, to get fuller and maybe longer effects. It didn't feel neurotoxic at all.</p>",
 "year": "2010",
 "id": "87543",
 "gender": "Female",
 "age": "25",
 "timestamp": "2010-10-01T07:00:00.000Z",
 "views": "17663"
}
