{
 "id": 8765,
 "title": "Panic Attacks",
 "date": {
  "submission": "2010-04-21T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Prince",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Pharms - Escitalopram",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "About 3 years before my experience, I was prescribed Lexapro (escitalopram) 10mg daily and then bumped up to 20mg daily and tolerated the drug fine. But, I was prescribed it again, and took it one day while I was in Philadelphia. I drove down to my home in Delaware and after about 4 hours, started smoking marijuana. I probably took about 25 hits (I smoked everyday before this).",
  "One of my friends began talking about someone I went to school with who got alcohol poisoning, and it freaked me out very badly. I began getting waves of feeling like I was going to lose consciousness, but eventually sat down and passed out for about 5 seconds. When I woke up, I had a ringing in my ear and could only see silouettes of things. I also had no feeling from my elbows to my hands, but the symptoms eventually went away.",
  "I started having panic attacks after the incident and my psychiatrist advised me to try the Lexapro again. I did about two weeks later at about midnight and had a panic attack with full fledged bad shaking/tremors, very increased heart rate, and trouble breathing. I ended up going to the hospital and getting propranalol (used for blood pressure/anxiety). I had bad panic attacks after this time for a few weeks, up to 20-30 a day. They are better now though and I was prescribed Buspar (Buspirone) and Xanax (Alprazolam) to control my anxiety."
 ],
 "erowid": {
  "id": "51568",
  "citation": " Prince. \"Panic Attacks: experience with Escitalopram (Lexapro) & Cannabis (ID 51568)\". Erowid.org. Apr 21, 2010. erowid.org/exp/51568",
  "substance": "Escitalopram (Lexapro) & Cannabis",
  "views": "8459"
 }
}
