{
 "title": "Deconstructing and Rearranging Reality",
 "author": "Akewstik",
 "citation": " Akewstik. \"Deconstructing and Rearranging Reality: experience with 4-MeO-PCP (ID 87652)\". Erowid.org. Jan 5, 2011. erowid.org/exp/87652",
 "substance": "4-MeO-PCP",
 "bodyweight": "180 lb",
 "report": "<p>This was my first time with this chemical, I was expecting something like ketamine, but the come up was incredibly similar to DXM: thoughts became fragmented and speech became difficult. The dissasociative body-load feeling was the strangest I have experienced, not as sedating as ketamine, I remained very mobile, and had much more tactile awareness than with DXM, but I had the most pronounced and obvious feeling that the usually straightforward link between thought and physical movement had a barrier in it, that my body was being moved in some unnatural and awkward way.</p><p>The psychological aspects of the trip arrived over a matter of a minute or two, very early on into the trip strange fantasies entered my mind and seemed to be as apparent and tangible as reality, though I did still have a firm grip on reality. Music seemed distant and alien, I completely lost any sense of rhythm and melody. The friends I was with seemed to be highly exaggerated characters, baring only a basic resemblance to their actual personalities, the situation we were in (just sitting around talking) seemed to be fantastically dramatic and significant. We listened to music, described our thoughts and feelings, smoked pot, watched the relatively subdued OEVs, and everything was very pleasant and peaceful. I was playing around with ideas about the room being lit by odd-coloured electric lighting, and the ceiling being only 3 feet above our faces as we lay on the bed looking up at it, and it seemed SO real I could sort of see it, and sort of feel it, but only sort of, but still very apparently it was there. We did a few caps of nitrous oxide, and the first one or two sent me delirious and then blank for a few seconds, eventually after repeated caps, I tripped, but essentially for me, it was the same as it ever was when mixed with pot, and then when it was over I just went right back to the PCP as if nothing had happened.</p><p>After probably 90-120 minutes at the peak, the physical aspects of it and the visuals began slowly to fade, which was fine, but very annoyingly, the strange, grand, complicated and involving ideas disappeared all at once, and I was back being myself, firmly grounded in the real world, it was quite a shock, and I felt that I urgently needed to get back there, and further, to explore the thoughts Id skirted around. One of the people whod planned to trip with us that night wasnt feeling well enough, so there was a dose going spare, nobody else wanted to do it, so I did.</p><p>I sat talking, still under the effects, and the come up this time was much less obvious, although looking back, much more dramatic, at the time it was less obvious because the more intense the psychological effects became, the less able I became to focus on exactly what was happening. This is very difficult to explain: I suppose, when Im in a normal mental state, I can think about a few things at once, because some thoughts are clear and focussed in my mind, and others sort of float around and make connections with others, but I dont have to put any effort into keeping them hanging around till I need them - I completely lost the ability to do this. I could only direct the whole of my attention to one specific thought at a time. My friend would ask me what he considered to be a straightforward question and I would have to think about every miniscule implication of what hed said, what my opinion was on each of them, usually getting him to repeat the question after each stage of logic, because Id had to concentrate so hard on the tiny part of it, Id forgotten why I was thinking about it. Being asked a question like Do you want to put a different record on? and after minutes and minutes of staring silently into space and internally battling with the question, finally answering ok.</p><p>Eventually, the single focussed thoughts I was having became so clear and so all-encompassing that I could see them played out before my eyes and feel them in deep parts of my brain, the way you feel a distant memory or an inclination, rather than just thinking about it intellectually. Gradually I got the ability to have more than one idea at once, but each of them experienced in this way, through senses and from multiple perspectives at once. I got double vision, which gradually split into 4, and eventually got so complicated I couldnt focus on anything and my vision effectively was a constantly changing swirling mess, my vision was completely useless. Eventually OEV-style visuals started creeping over the top of the incomprehensible mess of what I was seeing, I saw a clay block, I saw it in the past and the future at the same time, it existed in multiple spaces at once, but not a number of spaces next to each other, it existed in the same space, but at different moments in time. This actually is impossible to explain, I think, but I saw it in four dimensions: up/down, left/right, forward/backwards, and past/present/future. It was the furthest thing from reality as I usually understand it that I have ever experienced.</p><p>I ended up lying in the bath (without water in) and looking out over the rim into my small bathroom, and it stretched out for 100s of metres, glittering with glass and blue jewels, and I could not possibly comprehend where I was or what the house I was in might look like outside the bathroom door, I kept getting my friend to tell me that we were in my house, and list the names of the people who were in the house, which room they were in, and what they were doing. I knew the names of the people were familiar, and words like bedroom and watching TV and sleeping I knew what they meant, but they were only ever as real to me as the strange and now obviously fictional things that popped in and out of existence constantly.</p><p>This extreme disconnection from reality was scary, but I knew really that it posed no real threat to me, because the house was very quiet, and everyone else seemed to be in total control, and no one was going anywhere. The thought this will all end at some point and things will go back to normal never occurred to me like it does on psychedelics, and even on DXM and Ketamine, I forced myself to think it at times, but I never believed it, my sense of time had disappeared, I couldnt imagine ever not being on the drug, I couldnt imagine that it would ever end. This seemed to crop up in my trains of thought as a problem, but never a big one, until eventually my thoughts became so fast and frenzied that I was thinking so many things at once, the sheer quantity and speed of my thoughts was more than my sober mind could ever possibly have processed, I became convinced that this would have some permanent effect on me, and that I would never be the same person again. I never got this thought out of my mind, but managed to ignore it at the peak, during the long come down though, it kept coming back to haunt me, when my thoughts became more ordered and less chaotic, but still very strange and inexplicable to the people around me, it seemed more and more pressing that the longer I went without remembering quite what normality was, the less of a chance there was I would ever get it back. I had an idea of what ego-death was, but essentially, and simply put, its forgetting who you are, and the disassociation of yourself from all of your memories and experiences that normally go towards defining your identity.</p><p>Eventually I managed to fall asleep after about 8 hours (6 hours or so after the 2nd dose), I woke up with zero afterglow and zero hangover. And although there are a lot of thoughts that I actually believe are incomprehensible to a sober mind, that there is no chance of me properly recalling, I remember the moments I had those thoughts, and aspects of what was happening and what I did, but I remembered a huge amount of the trip, and understand a huge amount of the thoughts that I had for the very first time that night, much moreso that with DXM. With DXM Im shocked every time I do it at the huge quantity of ideas that are so obvious and memorable while high, but that Id completely forgotten about or been perplexed or bored by if I had remembered them while sober, 4-meo-PCP was much, much less like that.</p><p>Theres so much more I experienced and thought, Ive chosen the bits I think best express what it was like, but its so much more incredibly complicated and strange and exciting than I could ever write down, even if I wrote a million words.</p><p>Its the most intense and immersive experience Ive had with drugs, more so that acid, DPT, ketamine, Im going to try a 250/300 dose at some point soon, since Ill be less overwhelmed and more comfortable, hopefully, and find out more about it.</p>",
 "year": "2010",
 "id": "87652",
 "gender": "Male",
 "age": "20",
 "timestamp": "2011-01-05T08:00:00.000Z",
 "views": "8318",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "100 mg",
   "administration": "",
   "substance": "4-MeO-PCP"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Nitrous Oxide"
  },
  "3": {
   "time": " T+ 2:00",
   "amount": "100 mg",
   "administration": "",
   "substance": "4-MeO-PCP"
  }
 }
}
