{
 "id": 8779,
 "title": "So Happy I Could Cry",
 "date": {
  "submission": "2008-06-23T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Devotchka",
  "gender": "Female",
  "weight": "110 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "It all started when my friend called me saying she wanted to try coke. The past weekend I'd met someone who dealt so we called him up and waited. She had to pick up her friend at the airport so she left, and then she called to say she'd do it tomorrow night but not tonight.",
  "So I ended up in front of a mirror full of coke, debating whether I should try some myself. Just one line to see what it's like, and I'd save the rest to share with my friend tomorrow. I did a few very, very small lines and hardly felt anything -- I started thinking maybe the guy had sold me chopped up aspirin and got pissed. I thought, I'll just do two medium-sized lines, if one's not enough, I'll snort the other too, and if that does nothing it has to be shit.",
  "Well I snorted the first one, and I felt something. I started snorting the second one and all of a sudden I felt the most amazing adrenaline rush mixed with overwhelming joy and euphoria. My hands were shaking and starting to feel numb, but I did a few more small lines. It was compulsive, I wanted to see just how euphoric I could get. I literally felt happier than I'd ever felt in my entire life. I almost cried, and I've never, ever cried out of happiness before. An orgasm is nothing compared to a coke high. And while I was snorting those extra lines the thought of a heart attack or some other consequence from an OD passed through my head, but I just didn't care. I understood how people could do it until their septums rotted away. You could have shot me right then and I'd be happy.",
  "I decided to go for a walk, which quickly turned into me running down the street out of having so much energy, looking like a fucking lunatic but at that time I didn't care. That extreme energy only lasted a few minutes, but I still felt pretty damn good afterwards, and every so often I'd bump to stop myself from coming down. I wanted to talk to everyone I passed on the street (thankfully I didn't).",
  "The physical effects are nasty. My nasal passages and throat were totally numb, and all I could taste was the bitterness of the coke. I kept sniffling trying to keep away the drip. My mouth was so dry, but when I tried to drink water I felt nauseous.",
  "At the end of the night, I'd snorted most of a gram of cocaine by myself. and when I came down, I felt horrible -- how would I explain everything to my friend? I was ashamed that I had no control, and felt stupid for feeling so euphoric earlier, and basically being the addict cliche they warn you about in high school health classes. But I did have enough control to flush what was left of the coke down the toilet, and I know I won't be doing it anytime soon if I ever do it again. I'll definitely do it with other people and not quite as much (if that's even possible once you're on it).",
  "I have a new respect for drugs and an understanding of people who get addicted. I am an intelligent person who has self-control in all other areas of life, but I just wanted to keep doing it."
 ],
 "erowid": {
  "id": "51617",
  "citation": " Devotchka. \"So Happy I Could Cry: experience with Cocaine (ID 51617)\". Erowid.org. Jun 23, 2008. erowid.org/exp/51617",
  "substance": "Cocaine",
  "views": "27489"
 }
}
