{
 "id": 8782,
 "title": "All Positives and Negatives Too",
 "date": {
  "submission": "2006-04-13T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jama Da",
  "gender": "Male",
  "weight": 85
 },
 "dose": [],
 "report": [
  "I need to make it clear that I am referring to psychological states of ecstasy not the drug ecstasy although ecstatic states precipitated by drug use are not excluded. The problem of how to reconcile the all-positive experiences of ecstasy with the reality of the negatives of this world had been one that had troubled me for a very long time. All mystical and religious traditions culminate in the experience of ecstasy, whether it is called Enlightenment, Nirvana, Fana, Samadhi or something else, the ultimate achievement of the adept always includes an all-positive state of unsullied, unbridled blissfulness.",
  "One of the common observations of this experience is that reality is an entirely positive phenomenon, ie a cosmos completely without negatives. This is the observation has led to such mystic aphorisms as; everything is the work of God, love is the only force, everything is divine and numerous other traditional superlatives and absolutes involving various religious terminologies and god concepts. This observation is recorded not just by many of the most revered and respected sages and mystics in history but, largely because of the ready availability of certain types of drugs especially in modern times, many ordinary and often quite young people have had this experience and have expressed it in their own modern secular language, eg. it is all good, love is all there is, `everyone is good`, etc.",
  "The assertion that everything is good raises a problem  how to explain negative phenomena, eg wars, rapes, child abuse, torture, etc. Logically, it seems the two observations are mutually exclusive, ie if everything is positive   there cannot be any negatives or; if there are negatives  everything cannot be positive. This was a gnawing problem for me because I had experienced ecstatic states wherein I had the observation that everything was positive and I was convinced of the legitimacy of these experiences however I was also convinced that negatives were truly negative, ie I didnt buy any of the whitewash theories that strive to construe negatives as somehow a positive in disguise, eg righteous karma, unseen grand-plan, unrecognised need/desire, etc.",
  "To address this question I undertook the methodology of my tradition and engaged in a special series of yoga processes including; a purge, 5 days without food and 3 without sleep doing special exercises 24hrs a day. I designed these processes to produce a state of ecstasy with the intention of focussing the insights of that state on the resolution of this dilemma. I feel it is important to note that the state that was produced by these processes was the most profound and powerful ecstatic experience of my life (and I took a lot of drugs when I was young). I expected to find that one or the other of these observations were not legitimate, ie either there are no real negatives or, everything is not positive.  What I did find astonished me  I found that both observations were legitimate but that they are not mutually exclusive because there is something about the true nature of negatives which has never been recognised.",
  "While negatives are real  and this is the twist  they do not actually exist. This is not some bizarre quantum reality, this idea is actually completely sensible, absolutely rational and quite simple and it can be readily understood by looking at certain physical phenomena. All negatives are the same type of phenomena as things like; darkness, cold, dryness and silence. That is they are phenomena not of the presence of something but of the absence of something. Darkness is only the absence of light, cold is only the shortage of heat, dryness is only a lack of moisture, silence is only the absence of sound, etc. An absence of something, since it is by definition an absence of an existence, does not have any actual existence of its own and therefore does not actually exist. So while things like dark and cold are obviously real and have real effects these things do not actually exist, they are abstracts.",
  "I saw that all negatives are phenomena of this type. Just as darkness is only what happens when there is a lack of light, callousness is only what happens when there is a shortage of empathy. Just as cold is only what happens when there is not enough heat jealousy is only what happens when there is not enough trust, etc, etc.",
  "The reconciliation of the mutually exclusive perceptions comes because something has to actually exist to be subject to perception. In a state of clarified perception all actually existing negatives disappear because they were never really there. They never were perceptions of the mind, they were always only ever projections from the mind  they were reifications. All that had to happen for these negatives to disappear was for them to stop being projected.",
  "Negatives are however still perfectly valid concepts just as cold and dark are valid concepts  they are not illusions, figments of the imagination nor are they mistakes and they are negative. They are legitimate concepts that correspond accurately to the real world but they are not actually existing things and so they cannot be perceived. When we go into a dark room we do not actually see darkness, what we actually see is the small amount of light that is there. What we perceive as cold chilling us to the marrow is actually a perception of heat, only it is a perception of heat leaving the body (anyone with a background in physics or engineering, particularly refrigeration, will understand this immediately).",
  "It is important to realise that this is not just a piece of sophistry or an exercise in semantics - darkness and light are 2 completely different types of phenomena  one can be manipulated and one cannot. Light consists of photons, it can be reflected, refracted or blocked  in some cases photons can even be counted. You can't do anything with Darkness because there is nothing to do anything with, it cannot be manipulated because there is no actual thing to manipulate. So even though, in the ecstatic state, the perception is only of positives, since negatives are not subject to perception, our world can be and is still riddled with negatives because there are still so many positives lacking.",
  "In exactly the same way as there is not and cannot be a conflict between silence and sound there is not and cannot be a conflict between positive and negative. Because negatives are only absences of things there are no actual things with which positives could be in conflict.",
  "I do not expect anyone who has not had the experience/observation of omniscient positivity to grasp this insight however with the ready availability of certain drugs in the modern age many people have now had this experience and this observation."
 ],
 "erowid": {
  "id": "51624",
  "citation": " Jama Da. \"All Positives and Negatives Too: experience with Yoga (ID 51624)\". Erowid.org. Apr 13, 2006. erowid.org/exp/51624",
  "substance": "Yoga",
  "views": "8006"
 }
}
