{
 "title": "And Life Bled Fractal",
 "author": "GhostHardware",
 "citation": " GhostHardware. \"And Life Bled Fractal: experience with Cacti - T. pachanoi (San Pedro) & Various (ID 87859)\". Erowid.org. Dec 8, 2010. erowid.org/exp/87859",
 "substance": "Cacti - T. pachanoi (San Pedro) & Various",
 "bodyweight": "76 kg",
 "header": [
  "DOSE: T+ 0:00",
  "25 g",
  "oral",
  "Cacti - T. pachanoi",
  "(ground / crushed)",
  " T+ 0:00",
  "5 g",
  "oral",
  "Piracetam",
  "",
  " T+ 0:00",
  "2 g",
  "oral",
  "Aniracetam",
  "",
  " T+ 0:00",
  "1 g",
  "oral",
  "Syrian Rue",
  "",
  " T+ 1:55",
  "1 cup",
  "oral",
  "Coffee",
  "",
  " T+ 3:33",
  "30 mg",
  "oral",
  "AMT",
  "",
  " T+ 4:15",
  "25 mg",
  "oral",
  "5-MeO-DALT",
  "",
  " T+ 10:40",
  "50 mg",
  "oral",
  "AMT",
  "",
  " T+ 0:00",
  "1 cup",
  "oral",
  "Coffee",
  ""
 ],
 "report": "<p>Background - Im an 18 year old university student that just moved away from home for the first time and Im immensely enjoying the freedom and getting to know a bunch of new people. Supplements/nootropics I take daily are - Piracetam, SAMe, Fish oils, Aniracetam and a Multi-vitamin in the AM, and just before sleep I take Galantamine, Lions mane and Melatonin. Prior drug experience consists of a variety of stimulants and depressants for the past 4-5 years, but I never really found a chemical that chimed harmonically with my soul. That is until I did mushrooms in Amsterdam. Shrooms was wonderful, a most beautiful experience in which I spoke -and listened- to nature. Reminiscing upon that experience one day while accessing my newly loaded bank account (student loan :D) I put two and two together and said to myself HEY LETS GET A BAG OF PSYCHEDELICS BUDDY. And of course I kindly obliged. Thus we arrive at the present.</p><p>Setting - Alone in my dorm room, just come back from seminars for the day, anticipating the moments to come. Have been fasting all day. (All notes -bar retrospect- were taken throughout the experience)</p><p>T+0:00 (7:00pm) - Ingested 25g San Pedro ground up in a coffee grinder and put into roughly 60 capsules, taken with 5g Piracetam, 2g Aniracetam and 1g syrian rue in the hope of potentiation.</p><p>T+1:30 - Feeling slightly emotionally elevated, nothing out of the ordinary yet.</p><p>T+1:55 - Drank a strong coffee as I just read it may increase the hallucinatory capacities of this intriguing cacti.</p><p>T+2:00 - Pronounced sense of well-being, content with surroundings, analytical thought above usual levels. Staring at the contours of my green and white spotted duvet is oh so satisfying. It seems to breath in time with my heartbeat, its like theres some tiny midgets under there pushing it up at random points. Smiling a lot. The bass in my headphones gets noticeably deeper. Or maybe I only just noticed the real depths of Burials intricately intwined masterpieces - by the way, fucking amazing artist, check him out if you like chilled 2-steppy ambience. Definitely a catalyst for drug-induced thoughts.</p><p>T+2:15 - Slow ripples keep spreading out on my bed; they emanate from my feet resting on it. Slight phasing effect on the audio capacities. When Im not listening to music its like the silence is shifting around me. The soul in the music Im listening to is more pronounced, shivers irregularly embrace my spine. I like this but I hope for a little something more from my long-awaited meeting with Mr. Mescalito. I bide my time, content with just being.</p><p>T+2:55 - Mmmm he is surely inside my head now, caressing my neurotransmitters with his gentle grasp, bending and twisting my visual cortex with a slow but powerful might. Life seems stuck in a slow dance with itself all around me. The three dimensions are being stretched and then compressed in endless and random cycles. Not the objects but the space that contains them is structurally morphing, and I can feel my being twisting in time with these oscillations of space. My screen seems to be melting slightly, bubbling and bulging around, I cant stop laughing at it :D</p><p>T+3:07 - I just went into the bathroom, looked in the mirror and saw my pupils repeatedly dilating and inflating. What the fuck. My towel was breathing at me too. That place is fucking weird. So is this place. The whole universe is odd when you think about it. Hahaha its funny, nature came all this way through evolution, from amoeboids to consciousness, and were the first species to look at the universe stretching out far behind it and go What the fuck was that. Jaws clenching slightly and my legs going haywire, more so than usual (I think I have restless leg syndrome). Mentally Im in a very mellow headspace.</p><p>T+3:33 - Seems to have leveled off on a decent plateau, but Im left with my taste buds tantalizingly wet. Just been reading a few reports. Seems that a guy who mixed this with aMT said they worked synergistically. Hey look a bag of aMT, well fuck me sideways! Without hesitation I slam 30mg down the hatch.</p><p>T+3:58 - Colours are so ridiculously saturated its mad. But I must note that this is not a tool for psycho-analytical introspection. This is a tool for examining what is out there and being able to let go of definitions that confine your world-view. This is what I imagine the Buddha to have understood during enlightenment. I am one with the flow. The universe is I, and I, it. We could be folded infinitely into each other with little distinction. An almost seamless transition. Almost, except for the fact Im in here and its out there. Damn I need a cigarette.</p><p>T+4:15 - Okay, I want some more tryptamines, how bout some 5-MeO-DALT? Well why not, crazy man who talks to himself (crazy man proceeds to swallow ~25mg).</p><p>T+4:20 -  Man, that van outside was pulsating madly, like a toad on amphetamines. Right now I feel that life is good. I am falling into my place in the universe. I relish in the synchronicity that previously escaped me. I bask in the glow of order; sublime, ultimate and peaceful. Time is not a dimension here. Past and future converge a point that transcends the present. Or do they diverge to infinity? Same difference. The metaphysical qualities of this substance are pleasant. When I close my eyes the darkness has a faint fractal nature, which is awesomely magnified when I put my face in front of the desk lamp and flicker my hand in front of it. Holy shit do I love fractals. A while back I was wondering why the image of fractals is pretty much universal in strong psychedelic trips. I think it has something to do with the patterns inherent in all of lifes structures, the self-similarity they exhibit, like the trunk of the tree that branches out smaller and smaller, or the veins that split and split into other veins and capillaries. And somehow this biological trait makes its impression on the senses of the psychedelicized. I take this as a sign that psychedelics are the true key that fits into the lock of the mind, I mean you can take any old lockpick, like heroin, to the keyhole, but most of the time youll just end up jamming and fucking it up. Psychedelics are the only true fit, I see that now. The dial of revelations just keeps blowing off the scale motherfucker!</p><p>T+5:18 - Thought Id have a break from exercising my thoughts to see how my radars functioning. Just watched some of MTV Odditys The Head and shit was morphing all over the place, the colours kept shifting and all the lines were grooving parabolically, that shit was intense!  Oh and the plot was pretty funny too. These words leave are falling around and emanating mad ass rainbow trails dripping down the page. Now I feel like Im shrinking into my own head looking at this screen. My laptop and my hands resting on it are like stretching out into the distance and these words keep getting smaller. My attention span is non-existent right now.</p><p>T+5:53 - Oh my god! That frusli oat bar was ravishingly delicious. It was possibly the greatest tasting thing Ive ever tasted, ever! Before this I never really knew what taste was.</p><p>T+6:18 - These visuals are out of this world! Let me try and describe... everything is literally breathing with colour and movement. Imagine that space is constituted of macro-sized bubbles of air, refracting the rainbow around their shiny spheres, pulsating beautifully. Right now seems very unreal. How can these atoms that make me have intent? How can you, the reader, actually exist? How can a certain configuration of otherwise inanimate matter form a conscious experience? Smiley mindfuck :)Time seems to be speeding up and slowing down randomly.</p><p>Time Unknown -I am held in the breath of infinity. The feeling is entirely sensuous and simultaneously spiritual. Patterns of immense quality are slowly seeping and being reabsorbed by the screen, intense geometric shapes composed of incomprehensible complexity and breathtaking hues that sweep the entire spectrum of colour grow out of nothing.</p><p>I realize now the impossibility of describing any experience fully, as always it is limited to mere words on a page, but hopefully I have been able to convey, and you to understand, at least some aspects of this tranquil and very odd headspace.</p><p>Time dilation is rather extreme now. Each second is passing ridiculously slowly by. I feel the force of my every atom, I see myself for the first time.</p><p>Visually, this is insanely beautiful, deep fractals are borne from nothing continually, I am reduced to a marveling retard in their presence. If there is a downside its that the visuals are so awesome Its hard to keep my train of thought. Physiologically so far I have been okay, but now Im starting to feel fucked up. Theres a persistent serotonin-flooding yawn that is in time with my hallucinations, a chill that creeps my fingers occasionally, massive urinary retention and dehydration.</p><p>Music sounds like Im underwater. All thought seems to stop at perception. Its like I have no inner voice, or rather no voice that is distinguishable from the insanity that is occurring around me. Oh my god the bass is coursing through my entire body, the universe is a lightbulb; I feel like the music is the electrical input and my body is the filament vibrating madly in response.</p><p>Main thought right now is JESUS FUCKING SHIT CAKES. Everything has fractal rainbow tracers coming out of it. Most awesome visuals Ive ever fucking seen! My skin is bleeding saturated fractality. The paint drips up the walls to the celling. I find my motor skills are surprisingly intact while I roll myself a cigarette. Looking out my high-rise window, the city is alive with midnight movements of madness.</p><p>Life is the concentration of energy. In the dark ocean we find our genesis and in it also we meet our final nemesis. But in-between there is a process, a flowing force, this force we all are, this force I call life. And varying forces of differing magnitudes will meet and affect each other over and over, and the end result will always be a chaotic dance of the unpredictable and unprecedented. I believe the seed of all the in-harmonies of the mind is humanities constant trying in vain to grasp some unseen beyond, the idea that always seems on the tip of the tongue, the horizon that lies just out of reach. We seem poised in a frame between the past and the future, always seeking a definition in what has been or what could be, never quite grasping the moment. We polluted everything with our categorizations and in the process, forgot how to just be.</p><p>T+10:38 - Where the fuck did time go. I need a coffee.</p><p>I cant calculate the time anymore. All i know is its 5:49am and I am not sleeping tonight, so I might as well take a bit more aMT (~50mg), if only to prolong this awesome feeeeeling. Probably a mistake. Only time will tell. This, right now, is the realization of what I am as a being, this is my whole, I am whole, disregarding any other part of me that might vary with time, the one, the experiencer, the ultimate integration of sensory perception into a fleshy, feeling, thinking thing. Thoughts explode in my mind with almost as much going on inside as there is outside. If ever there was a time when my head was severely blown to pieces, then that was it. And yet at the same time I had it together more than I ever had. Everything about this trip is explained in polar opposites. Still need that coffee. For a second there everything looked like it was oozing raspberry jam from its pores. Reality is melting smoothly around. All i can do is rub my skin and stare at the curtain like a mong. I can feel my edges bleeding out into the void in all their fractal complexity. That was freeeakay.</p><p>Dosage so far is approximately 25 g san pedro, 80mg aMT, 60mg 5-MeO-DALT (not sure when I had the last 35mg), 1g syrian rue, 5g piracetam, 2g aniracetam, 2 coffees and a few cigarettes. Reality is seeping intense multicoloured beautiful structures from its every orifice. They grow and decay rapidly in crazy swirls of complexity. My body is writhing in utter madness.</p><p>Its 2 oclock the next day, I havent slept for ages, nor can I, because the walls continue to bleed, much to my frustration. I fought a struggle with darkness, but she won and now my ego lies in fragments on the floor. I feel like I have been overcooked and severely burned by the mind bakery. I lie down completely wasted, in a steaming pile of nothingness.</p><p>Retrospect/Summary (T+27h)- Slept about 5 hours, still feel conked out. Was woken up by a fucking fire alarm that went on for about half an hour, that kind of shit happens all the time in my building so I thought nothing of it, but the painful screech penetrated to the depths of my being and stirred a torrent of despair that I havent felt for a long time. I may have blown a few serotonin receptors, I mean my jaw and legs wouldnt stop shaking until about an hour ago, and my pupils are still as big as dinner-plates. I feel like a part of my sanity was stolen last night, it seems a sacrifice was demanded for my foolishness. I had fun until my life-conceptions were utterly shattered like porcelain. I was trying to piece it all together and make sense of the confusion, ultimately to no avail. All I could do was stare in disbelief and sadness. If I have learned one thing, it is this - Dont cram new drugs into your system on a whim, take time, research them fully, and above all respect psychedelics.</p><p>The trip started off well then got kinda fucked towards the end. I probably will do these drugs again some time in the future, but not certainly not together.</p><p>(Note - I do not advise anyone to take this combination in the dosages I did. It was a smooth ride when I had less than half the final amounts of aMT and 5-MeO-DALT, but after that when I took the other parts, my brain was gradually put inside a blender. It was messy and Ill probably be cleaning up the residue for a while)</p>",
 "year": "2010",
 "id": "87859",
 "gender": "Male",
 "age": "18",
 "timestamp": "2010-12-08T08:00:00.000Z",
 "views": "3672",
 "dose": {}
}
