{
 "id": 8789,
 "title": "Emotional Renewal but Bad Side Effects",
 "date": {
  "submission": "2007-02-05T08:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "MikeD",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200",
    "grams": 0.2
   },
   "administration": "oral",
   "substance": "Phenytoin",
   "form": "daily"
  }
 ],
 "report": [
  "My experience with Dilantin/phenytoin was quite different than what the average enthogenist can expect.  I have to take this drug for medical reasons.  This is my story...",
  "I had considered myself to be deep into enthobotony since a young age, and had many growth experiences.  At some point I started experiencing partial seizures around the age of fifteen, and I didnt know it.  I didnt even know there was such a thing!  I just knew something was wrong during those episodes.  Kind of like a bad phenylethylamine/adrenaline alert.",
  "Well, July 2005 I was in a really horrible place, clinical depression, seizing and not knowing it.  My mind was in a wreck from my undiagnosed condition, and the seventeenth of that month I snapped.  I suffered a really bad Grand-mal seizure that day at home, then another in the ER.  It was the first time I realized what was going on.  I have epilepsy.  First thing they did in the ER was pump me full of injectable Dilantin, so much so it was at toxic levels in my blood for the three following weeks. ",
  "It was amazing to me, my first month I experience a complete rebirth in my psyche. I was prescribed 200mg/day (in two doses) at that time.   The first week or two after the seizures where discomforting, but I was all overdosed on dilantin.  I was feeling totally blissed, as if I had an on/off pleasure switch!  There where many moments, where it literally felt like my brain was being gently cradled in a warm luxurious fur lined hammock.  The overdose also caused debilitating effects on cognition, impaired alertness level, strong double vision, and difficulties thinking.  At that point my blood level read 0.5, double the 0.25 therapy range.  My doctor was surprised they didnt damage my liver.",
  "To understand how Dilantin effected my emotional state at that time you have to understand, what had been happening in my life up to July 17th, 2005.  I was at an extremely low point in my life, dangerously depressed and seizing constantly.  I didnt know that I was seizing, and the depression was a symptom.  I felt as if I was falling apart, I basically was down and out.  Then Bam!  I enter a new life.  Have a mid life crisis and wake up in the hospital on the other side of the spectrum.  It felt like, what I would imagine bi-polar sufferers go through.  All though, I had a more traumatic experience.  It was amazing because I stayed up there!  All the depression went away that day and hasnt returned.  Sure I get negative thoughts like everyone else, but they just float away.  I wonder if its the dilantin?",
  "So now between the two and six month period, I was taking 200mg/twice daily and my blood levels where at the therapeutic range.  I was feeling like a new man.  I had not had control over my thoughts before like dilantin has given me.  I was feeling very on track, really back in the natural cycle.  I had many days though at this dose, when I still found it hard to cognitively function.  Thoughts would come slow, I would find it really hard to focus, would stop in the middle of a sentence and forget what I was talking about, and some times just feel like a zombie!  After months of bad side effects I was switched to a new drug Trileptal, which I think might have more promise as a nootropic.  I think dilantin was a good nootropic, only because it was a great mood-elevator.  Some of the side effects can be too much, though.",
  "P.S.-Brugmansia is dangerous!  I think that might be the reason I started seizing those many years ago.  So, stay safe everybody...     MikeD, from Cali"
 ],
 "erowid": {
  "id": "51651",
  "citation": " MikeD. \"Emotional Renewal but Bad Side Effects: experience with Phenytoin (Dilantin) (ID 51651)\". Erowid.org. Feb 5, 2007. erowid.org/exp/51651",
  "substance": "Phenytoin (Dilantin)",
  "views": "8537"
 }
}
