{
 "title": "Surprise",
 "author": "Chicken",
 "citation": " Chicken. \"Surprise: experience with Nutmeg (ID 879)\". Erowid.org. Oct 9, 2000. erowid.org/exp/879",
 "substance": "Nutmeg",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "6 tsp",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>Well, I woke up, and SURPRISE! I was totally high off my ass! It was like 6:30am. I had taken a little nutmeg at appx. 6:00pm the night before, and didn't think that anything was happening (about an inch in the bottom of a plastic cup, washed down with water). I must have been asleep whenever the stuff took effect. I was on my way to the shower when I realized that reality was a bit different than normal. I think that I woke up at the peak. I went to work (serving tables at a resort). By lunch (noon) things were still pretty weird, by dinner (6:00pm) I had a very mild headache that dissapeared every now and then with the effects coming back occasionally. I was still messed up when I went to sleep for the night, woke up fine the next day.</p><p>The effect was somewhat like being high on pot, especially when trying to drive. I just kept driving over and over the same spot on the road, in my mind. Time was way slowed down. I didn't want to talk to anybody. I didn't want to work fast. I just wanted to sit down, and maybe take a nap. While working it was like I was actually in a dream, only what was in front of me directly was normal, everything peripheral and behind me was distorted in my mind, similar but not the same as reality, like in a dream. I would think things like 'it is really sunny,' but it wouldn't be, or that 'the porch is 20 feet of off the ground with the forest below,' but actually the porch was only 4 feet off of the ground and the forest was across the parking lot.</p><p>Overall, a good experience. I wouldn't suggest trying if you have to work the next day. Pick a day that you can sit around and drink lemonade or something.</p>",
 "year": "2000",
 "id": "879",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-10-09T07:00:00.000Z",
 "views": "7806",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "6 tsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ]
}
