{
 "id": 8791,
 "title": "Unexpected First Time",
 "date": {
  "submission": "2009-10-19T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Estudiantezed",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "6 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I had never planned to do coke, at any point in my life. I know too much about the way cocaine is produced, in South America, and how many lives are ruined by the process of production, at the hands of narco-thug terrorists. Remember those stupid commercials that were on after 9/11, equating drug use with terrorism? Well, cocaine and heroine actually are ruining people's lives in drug-producing countries, and the stupid, heavy-handed American government is ruining lives with their approach to fighting the drug war. Anyway, this is how I became such a hypocrite:",
  "One night, I was hanging out in my apartment, enjoying a Gin and tonic with a few of my mates. As often happens, I was already a little stoned from my hijinks that afternoon. My friend K called me up and suggested that she come over and cook us some food. Who am I to resist that? So, she rolled on over, cooked us up a heap of delicious pasta, and sat down to eat it. About half way through the meal, she says, 'Hey, I want to get some coke tonight, do you know where to get some?' I don't do coke, for the reasons I already detailed, but I had a good idea where we could get it, so we walked over to my dealer's pad. By now, I had had about six or seven drinks, and was starting to feel a good buzz. We asked my dealer about blow, and he made calls, while we waited. It took some time, and a few more drinks, and sitting in his pad smoking a couple bowls of pot, before his girl showed up. We grabbed a half-gram bag and beat it back to the pad.",
  "By now I was quite stoned, and a little bit drunk. I have had some experience with prescription amphetamines, and I knew I wouldn't feel drunk for long, once the stimulants kicked in. Four of us went to my room and turned on some music. The atmosphere was cool, and everyone was a little giddy. None of us had ever tried this before. By now, I had decided to do a few bumps, just for giggles, to try it out. Fuck my guilty concience. We cut out three lines, and K, my friend Chris and I all horned one. Our dealer had told us that this shit was cut with ether, and I thought I could smell it. I've huffed a bit of ether in my day, and that cold, chemical feeling in my nostrils is unmistakable. The drip hit us and we were all laughing, numbed up and comfortably buzzed. I had a sudden burst of energy and knew that after about five minutes, this was the most we were gonna get off of one little line. We still had most of the pile left, but we decided to put it aside and head over to my lady-friend's apartment.",
  "It was a party over there, I was losing my alcohol buzz, and was a lot less stoned (it had been about 2 hours since I had smoked). That was about to end. We sat down, mixed drinks and proceeded to smoke about 3 or four bowls. I was toasted and still feeling a little effect from the line I had done about 45 minutes before. Sure, I was stoned, but I still felt talkative and pleasant. They were listening to some random rap music and I was bopping along to it and tapping my toes. I took a straw poll, and we determined that it was time to go back and finish the coke. It was getting on towards eleven at night, and we wanted to do the coke quick, so we wouldn't be watching the sun come up the next morning.",
  "We got back to my pad and went into my room and closed the door. There this was the most fun part of the experience. We started just cutting lines and passing the shit around the room. It was like a sporting event, everyone was jockular and cheering each other on. The drip was insane, but I wasn't even that focused on the physical effects. By this point, I was just feeling great and chatty as fuck. Everyone in the room was talking a blue streak and everybody seemed like my best friend. I was pacing around and going back to horn a line or rub some on my gums. I probably got about .20 of a gram (and didn't have to pay anything, which is cool). My whole body felt great-- I found that all I wanted to do was listen to music and dance. I was also starting to feel a bit horny.",
  "Twenty minutes after we snorted our last line, we decided to go out for a cigarrete. Everyone was chatty, smoking cigs and talking to strangers, I was still feeling good. It was a very chemical rush, intense and vivid, like a taught string being snapped (anyone who had experience with amphetamines or coke should know what I mean.) The result was a sort of ultra-reality. A feeling of intensity in each moment that made me feel like I could do basically whatever I wanted. I can see now why this drug is so attractive to so many rich assholes-- it's a complete ego trip.",
  "Between the time we had finished all our lines and gotten back up to the room from smoking, maybe an hour had passed. After twenty more minutes, I was crashing. I felt completely deflated and totally unable to have a conversation. Everything felt dull and stupid. I knew it was unlikely that I would be able to sleep, but it felt shitty sitting there and feeling uncomfortable. I went to my bed and layed down for about forty minutes without being able to sleep. What a shitty feeling. I got up for a little while more, and then, finally, around 2 a.m. (we had started doing lines around 10) I slipped into a light, surreal sleep.",
  "I woke up that morning feeling miraculously ok. I was still very conscious of my nostrils, and felt a little dreamy, but I was not depressed or terribly burned-out.",
  "Mostly, even if coke wasn't terrible from a political standpoint, I still don't think I'd make a habit of it. The act of doing it is really fun. It is so much fun that right after you do a line, all you really want to do is snort another one (and have more fun). Really, I'm just not that into stimmulants, and I figure if I want to get wired, I'll take some addies or dexies and not have such a shitty crash at the end. An interesting experience? Sure. One that this mostly chilled-out stoner will likely repeat? Probably not."
 ],
 "erowid": {
  "id": "51664",
  "citation": " Estudiantezed. \"Unexpected First Time: experience with Cocaine, Alcohol & Cannabis (ID 51664)\". Erowid.org. Oct 19, 2009. erowid.org/exp/51664",
  "substance": "Cocaine, Alcohol & Cannabis",
  "views": "5118"
 }
}
