{
 "title": "Romance the Green Fairy",
 "author": "Circe",
 "citation": " Circe. \"Romance the Green Fairy: experience with Absinthe (ID 8791)\". Erowid.org. Jul 1, 2005. erowid.org/exp/8791",
 "substance": "Absinthe",
 "bodyweight": "120 lb",
 "report": "<p>After a long fascination with absinthe, I finally decided to try and locate and purchase a bottle of absinthe (the real stuff). I managed to buy a bottle of 'La Bleue' absinthe from France which contains 60mg of thujone (The ingredient that caused it's banishment from most countries). Most other types I was looking at had only about 2-5 mg of thujone, so I was quick to snatch up my own bottle of La Bleue.</p><p>My boyfriend and I started the absinthe ritual the night I received it. I poured a large shot of the liquid in each glass. In La Bleue's case, the liquid is clear instead of the trademark green. I learned that this is because absinthe is bootlegged in France and keeping it clear helps from getting caught. After I poured the absinthe, I set a slotted absinthe spoon on top of each glass, with 3 sugar cubes placed carefully on top of the spoon. I then took about 4 oz of ice-cold water and started to SLOWLY pour it over the sugar cubes. The water dripping through the sugar and into the glass made the clear absinthe start to 'louche' or cloud into a pearly white color. After I finished pouring the water, I took the remaining sugar on the spoon and stirred it in.</p><p>We toasted and drank. The absinthe tasted like strong black licorice and gave an instant sensation of warmth, despite the coldness of the liquid. After we drank, a half hour passed before we decided to make a second glass. This time we used the 'fire method'...</p><p>I set everything up exactly as before. But instead of straining water through the sugar cubes, I stuck the spoon inside and tilted the glass so some of the absinthe would get on the sugar cubes. Then I lit the spoon on fire. With the lights out, this is quite a spectacle...not to mention a great party recipe... A blue flame burned softly on top of the spoon, making the sugar sizzle, and melt, eventually dripping through the spoon and into the glass. I stirred in the remaining bit which ignited a small fire inside the glass...also very pretty to watch. I let the fire burn for a few seconds before putting it out with ice water. We drank that and had one more glass each afterward, using the fire method again.</p><p>Then we decided to go for a walk. It was about midnight and very warm out. Basically I was feeling slightly drunk and mellow. Very mild hallucinations occurred, like seeing something in my peripheral vision, but nothing like a mushroom or acid trip. Colors and lights stood out more. The farther we walked, the slower we got, laughing and acting silly. We were very giddy after another hour passed (absinthe generally comes on slow) and were running through some sprinklers that were on and dancing on the streets since they were practically deserted. When we got back home, we laid in bed and listened to some music. Sound is a lot more intense on absinthe...similar to weed.</p><p>For the most part, I believe one has to drink a large amount of absinthe for the full effects to take hold - the effects that got it banned in most countries. But just having a couple glasses at a party or whatever basically mellows you out, makes you feel a little drunk and silly, loosens you up. I definitely enjoy a glass every now and then, whenever I have time to sit, enjoy and dance with the Green Fairy.</p>",
 "year": "2001",
 "id": "8791",
 "gender": "Female",
 "timestamp": "2005-07-01T07:00:00.000Z",
 "views": "11130",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 glasses",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 }
}
