{
 "title": "Incognition Incoherency and Amnesia",
 "author": "DivineLamiaceae",
 "citation": " DivineLamiaceae. \"Incognition Incoherency and Amnesia: experience with Inhalants (Gasoline) (ID 87948)\". Erowid.org. Oct 28, 2010. erowid.org/exp/87948",
 "substance": "Inhalants (Gasoline)",
 "bodyweight": "120 lb",
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>To start off, Gasoline is an intense drug that, although very bad for your health can be a great hallucinogenic high. Having inhaled the vapors off of it multiple times, I know it is terrible as well as amazing if used often. But having come in contact with that gascan within my shed, the temptation to repeat this very enjoyable experience is too tempting.</p><p>Having not used Gasoline as a drug in over seven months, the high sets in very fast. One hit directly off of the can offers that familiar cerebral compression that you may get after taking a large hoot of good dope. I take about three more hits and the minor distortions in reality begin. It is at this point that I stop, because I got work to do, moving shit back and forth between the house and shed for winter storage. The high diminishes as I work and within a few minutes is almost gone. Process repeated, I take some hits and continue working...</p><p>Now, I have problems with nausea, depression and anxiety normally so before the day was out, I took 2mg of Lorazepam to even out the anger and anxiety that naturally comes each day. Forgetting about the Ativan and not really caring either, I decided to try to acquire a full-on Gas trip.</p><p>I have found that percolating the Gasoline makes the trip stronger, but maybe that is just placebo from believing it, either way, I create a vertical percolator, very much the same as a homemade Hookah and filled it up. Knowing that it is easy to spill the Gasoline while tripping would be to TRUE reason for the device that was designed to not spill as easy. Anyways, I hoot off of the Gas Bong as usual, taking quite a bit of effort to go 'All The Way'.</p><p>After hit after hit things still didn't get all fucked up and trippy as usual, I only was able to get the initial coming up high that is just okay. So I relentlessly hoot the vapors, expecting to trip...</p><p>Now I expected to be incoherent... incognitive even. But what happened totally caught me off guard. I simply woke up in my bed. The first thoughts surfaced: 'What the fuck happened?'. The percolator sits burlesquely upon my table...</p><p>My assumption being that the Lorazepam simply inhibited a blackout. I spoke to 'C' and he tells me that I was constantly coming in and out of my bedroom and constantly hooting the Gasoline. He kept telling me to get rid of it and go to bed whereas I would just laugh like a moron. I was obviously having a great time, probably in some fucked up wonderland that I can't remember... I had a perma-smile the whole time and would not talk.</p><p>All in all, it wasn't a negative experience. But it also was not a good one. Waking up in a haze from a blackout is never a nice thing, having fucked up on Zopiclone before, I know it can be fucking bad. But just the fact that I cannot remember an obvious good time pisses me off. Just that I had harmed myself by inhaling this terrible fluid's malignant vapors for generally no reason.</p><p>I don't recommend using Gasoline as a recreational drug, it is fucking great but still... Diacetylmorphine is great too but it's just not worth it. But especially using Lorazepam in combination, is not a good idea. Now I HAVE read some things about good times on 3mg Lorazepam but that also involved FOUR hits of the inhalant, not uncountable ones so I don't know.</p><p>Either way don't get into the habit of tripping balls for free. If you are gonna' have a good trip, it will cost you SOMETHING, in this case, it is virtually free and only costs you know YOUR HEALTH.</p><p>Seriously, from my experience though, just go buy a box of Dimenhydrinate, Dextromethorphan, etc. Or fuck, make some shit, go pick some Mushrooms or something, man. It may be time consuming and buying LSD or something may cost a bit of cash but it's totally worth it.</p><p>In fact, smoke a fat bowl of Salvia lol. The Salvia trip is very similar to the Gas trip but better and WAY cleaner!</p><p>Happy Tripping =)</p>",
 "year": "2010",
 "id": "87948",
 "gender": "Male",
 "age": "17",
 "timestamp": "2010-10-28T07:00:00.000Z",
 "views": "6718",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  },
  {
   "time": "",
   "amount": "2 mg",
   "administration": "oral",
   "substance": "Pharms - Lorazepam",
   "form": "(pill / tablet)"
  }
 ]
}
