{
 "title": "Yoga Potentiates Psychedelics",
 "author": "Mitra",
 "citation": " mitra. \"Yoga Potentiates Psychedelics: experience with Yoga, MDMA, & LSD (ID 8795)\". Erowid.org. Aug 19, 2001. erowid.org/exp/8795",
 "substance": "Yoga, MDMA, & LSD",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "MDMA",
  "(pill / tablet)",
  "",
  " ",
  "oral",
  "LSD",
  "(liquid)"
 ],
 "report": "<p>This report contains the discoveries made during the course of a number of trips. Most were candyflips (mdma and lsd which I think is the best way to trip) but I checked my results with a straight lsd trip and a straight mdma roll.</p><p>OK, the discovery (which may not be new but was a surprise to me) Yoga potentiates psychedelics!! On the 1-5 scale with a 1 being a threshold dose and 5 being complete ego death out-of-body experience, doing yoga while on a psychedelic seems to raise the level of experence by 1 to 2 levels! Not only that, but it seems to vastly improve the quality (subjective enjoyment) of the trip as well as the intensity!</p><p>I first discovered this when I was candyflipping alone and the muscle tension was really starting to get to me. It had been a level 3 trip, breifly, at the peak and again breifly when my bump kicked in and it was not back down to a level 2 and tapering off steadily. Still, it would be a couple of hours before I would be able to sleep and my muscles were in knots all over. I was unable to massage them out myself and I had no roll partner to turn to. I decided that I was going to have to stretch the muscles to get the discomfort to stop. I was a compete beginner to yoga at the time and knew very little about it except for a few basic principles. The first thing that I discovered is that yoga feels REALLY GOOD when one is candyflipping. I got really into it and used some self massage to help out with the stretch of particularly stiff muscles. The second thing I discovered was that I felt like I was coming onto another roll even though I had not taken any more. I kept it up and the experience continued to rise. I started to get major colorful visuals like I could see into my body and visually see the chi energy circulating.</p><p>I began to feel like I could see where there was blockage and tension in my body visually. I kept doing the yoga feeling now as though I was being led through it by some outside devine force and as I continues to work the level of my trip continues to rise. My trip reaches a high level 4 with breif flashes of level 5, the contents of which I could go on for pages about but I will refrain in this context. I am overcome with awe and joy and become incapable of doing anything but laying there and laughing about the perfect beauty and pleasure of it all. A few hours later, I came all the way back down after an unexpectedly intense trip feeling great, none of the usual body tension that usually plagues me after a candyflip. The next day was almost entirely free from the normal hangover all though there was nothing that I wanted to do other than think about all that I had experienced.</p><p>I knew then that I had to experiment further with this to find out if it was some sort of freak occurance or a genuine discovery. I also vowed to learn everything that there is to know about yoga. a few weeks after the first experience, I decided to try again. I candyflip fairly strongly, a high level 3 experience. Once I am clearly on my way back down I start doing the yoga. I wanted to wait until I was coming back down a bit so that I would know where the trip would have topped out normally. This time, it was even more spectacularly successfull than the first time. I am able to push myself up to an intense hyperspace, level 5 experience complete with entity contact and talking to god and the whole nine yards. A complete success. I become convinced that when properly understood, the combination of yoga and the candyflip will transform society. (it might too)</p><p>So far, I have run one more candy flip experiment, a straight mdma roll experiment, and 2 straight lsd experiments. It works great. Yoga will bring the level of any of these kinds of trips up by at lest 1 full level if not more. I am absolulely astounded by the results. I have had several entity contacts and a number of excusions into hyperspace by doing this. In general, a candyflip potentiated by yoga is such an overwhelmingly positive experience that I am on an emotional high for weeks afterwards. I would highly recommend this to everyone who does psychedelics as I think that we never really trip until we include this aspect.</p><p>There are other benefits too, besides just potentiating the intesity level of the trip but these are fairly essoteric and mostly spiritual and you just have to experience it to beleive it. Give it a try. I would dearly love to see some other people's reports of yoga potentiating psychedelics posted here at Erowid for the comparing and contrasting.</p>",
 "year": "2001",
 "id": "8795",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-08-19T07:00:00.000Z",
 "views": "26361",
 "dose": {}
}
