{
 "title": "Paranoid Delusions",
 "author": "Moloko Plus",
 "citation": " Moloko Plus. \"Paranoid Delusions: experience with MDPV (ID 88015)\". Erowid.org. Nov 1, 2010. erowid.org/exp/88015",
 "substance": "MDPV",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  " repeated",
  "insufflated",
  "MDPV",
  "(powder / crystals)"
 ],
 "report": "<p>I normally wouldn't bother submitting a trip report, but because this substance is poorly documented I think it is important for people to be aware of what can happen.</p><p>I am very experienced with all types of drugs, but the ones that are relevant to this report include cocaine and amphetamines. I have done these drugs to death, and there may be some cross tolerance between them and MDPV.</p><p>I had bought a gram of MDPV from an online supplier, and because of my addictive personality I found it impossible to stop using it. I knew that this was a potential problem, but like everything else I had to find out the hard way. Anyway, I had been up for three days not eating or sleeping. I think the sleep deprivation may have played a large role in what happened.</p><p>I didn't have a milligram scale at the time, so unfortunately I don't know how much I had taken. I have since weighed this substance, and based on this information i can guess that I had been doing bumps in the 25 - 30 mg range. This is quite a large dose, but I think that a possible cross tolerance may have played a role in this.</p><p>This substance, like all stimulants, makes me very paranoid, but I have never experienced anything like this before. After I had finished off the gram, which was at the three day point, I started having very vivid hallucinations of people being in my house who refused to leave. These people were characters from the TV show Oz, in particular Vern Schillinger and his son Hank. Anyone who has seen the show will know what kind of guy this is, and what kind of mocking smile he has. I was extremely frightened and panicked.</p><p>I had been watching all the seasons back to back and I guess it got in my head. Anyway, I tried using conventional methods of making them leave, such as threatening them with my katana, but when this failed I called the police. Ordinarily I would never do this because cops have fucked me around quite a bit, and every time I deal with them I end up getting arrested. I can not stress enough how unusual it is for me to call the police for any reason. They ended up bringing me to the hospital where I was given 30 mg of Valium, which calmed me down. The combination is very nice actually.</p><p>After I got home I had more delusions of short little black clad Asians siting in my house who also refused to leave. These hallucinations were extremely vivid, and again</p><p>I tried threatening them, and of course it didn't work. At least I didn't call the cops this time. They weren't behaving in a threatening manner so I wasn't frightened this time. Still very unpleasant though. Anyway I finally fell asleep and all was well afterwards.</p><p>I have done this substance a second time with only 1/4 gram and I did get a bit paranoid, but nothing too serious. Treat this substance with respect and it's alright, although this is easier said than done.  I hope this information is useful to someone, and may prevent a repeat incident.</p>",
 "year": "2010",
 "id": "88015",
 "gender": "Male",
 "age": "24",
 "timestamp": "2010-11-01T07:00:00.000Z",
 "views": "28950",
 "dose": {}
}
