{
 "id": 8804,
 "title": "Astral Trip",
 "date": {
  "submission": "2008-06-24T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Weedman",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "300"
   },
   "administration": "oral",
   "substance": "Cannabis",
   "form": "tar/resin",
   "specific": "Hash"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "300"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "tar/resin",
   "specific": "Hash"
  }
 ],
 "report": [
  "I would like to tell you about one of my weed trips. Nowadays, I get them every time I use cannabis, but this one was the most wonderful! *Note that I write the word 'use' instead of 'smoke', because I always eat 40% of my dose and smoke 60%.*",
  "I went to my friend in his apartment, bringing my last gram of what originally was a 5 gram smelly, sticky, golden-brown hashish cake. Cant really say that I felt like using it that evening (I arrived about 7 p.m.), as I felt really drowsy and low. I said to him 'If we use this, Im going to get a bad trip.' He said 'OK'. I laid down on the couch to rest for a while. After about 1.5 hours, I felt refreshed and good spirited. I said 'Lets do this!'",
  "We put on some music, Bone Thugs -N- Harmony (all the weed-related songs, of course!)",
  "He started to cut up and crumble the hash while I prepared the tobacco and the king-size rolling paper. Finally, I twisted up the delicacy. We took a 0.2 gram piece each and swallowed it with some water, and smoked up the joint.",
  "9 p.m. (The beginning of the trip)",
  "The effects started with the usual 'high'. I went to sit in the couch while he went to put on some psychedelic trance. About 5-10 minutes later, I began to feel the cannabiss psychedelic/hallucinogenic properties. My vision and sense of balance started to get distorted, I can describe it as a a ball bouncing around in different patterns such as circles and waves. My body started rocking to this, and I felt to fucked up to sit up. I laid down on the couch.",
  "Everything was moving slow, like 'bullet-time'. The environment started to blur and the colors started to shift and mix. My friend said something I didnt pick up, but I managed stutter out something like 'Thats right.' When I turned my head, I saw a mans face appear on the wall. He was mumbling in a strange language, and I said 'Thats right' to him too, and he disappeared. When I looked at my friend, he was in the middle of making love to a woman he said had descended from space. This was fucking hilarious, and I managed to stutter out a laugh.",
  "Then I got the same vision, I got a space-woman to :-). We started throwing an visionary ball to each other, that didnt obey the laws of gravity. Thats when I felt gravity let go of me, I was floating a metre above the couch! And I was filled with cosmic, electric energy!",
  "I told my friend that I was floating, and he pulled me down. But I yelled out something like 'Youre pulling out my soul!' over and over. I clearly saw this energy field in his hands and I felt it strongly like my soul was leaving me, but he wasnt strong enough to pull it out. I think this part lasted for about an hour.",
  "10 p.m. (Tripping) *Totally losing perspective of time after this point*",
  "I stumbled to the bed (couldnt walk at this point), laid down, staring at the ceiling. My friend put on more psy-trance. Now I was really beginning to trip! I looked into the neonic-blue light beneath the bed and I saw it flaming like fire, and then it started pulsating to the musics beat. I felt myself falling into this light, and I was falling for an eternity into it. I stared at the ceiling again, and a half-metre tall rainbow-colored mushroom appeared before my eyes, which followed me through the rest of the trip. Im feeling that Im one with music, and I dance with my hands in front of my eyes, everything is going one frame per second, ten hands blink after my real hands.",
  "All of the sudden I see a small man peeking out from behind a shadow, digging the beat. Above him a large man taking shape from a shadow, dancing to the beat! Colors are hevily shifting, pulsating and growing. When I look to the right, the lid to the central vacuum-cleaner is also dancing! I look to my left, seeing the ceiling lamp swinging in an irregular pattern. Im hearing beeps and other strange noises, my senses have merged. Im hearing what Im seeing, tasting the colors I see. An inexplainable super sweet Coca-Cola taste shot up in my mouth.",
  "My friend laid down in the bed beside me (no, were not gay!). He had a blue/purple aura emitting around him, and when I placed my hand in his aura I strongly felt that my arm started burning (in a twisted pleasuring way!). I began to feel extremely cold and hot at the same time, combined with visions of deserts and arctic places. Then he told me that he saw something crawling inside my right leg in my pants, at first I saw a snake crawling up between my legs, and then I touched that place he told me and I clearly felt a cockroach. Suddenly, this cockroach was creeping inside my throat. A soft ball grew expanded under the skin of my neck, and I was bouncing my head on this!",
  "I looked in the ceiling again, and I saw a large hallucinated spider crawling there. I told my friend this and he goes like 'Spiders!' 'Spiders!' (he told me the next day that he saw and felt small spiders crawling all over his body and nearly started panicking). I hate spiders too, but this one was so soft and cuddly. HAHAHAHA. Weed really twists my mind.",
  "Again I looked at the central vacuum-cleaner lid, and CLEARLY saw a red light (LED) that shouldnt be there. I told my friend this and he opened the lid and put his finger inside it, and said 'Its strange' over and over. He pulled his finger out and I said something like 'You have awoken the monster!', because I saw a gelatinious thing crawl out from the hole, staring at me with its black eye! My friend crawled out of the bed (it was clearly an near-impossible struggle for him) and put on the movie 'Kung-Fu Hustle' on the DVD-player. Suddenly, I looked at the TV and CLEARLY saw a charged ball of yellow, pulsating light appear and disappear between two characters!",
  "*The peak of my trip begins*",
  "I turned my head back, staring at the ceiling again. The rainbow mushroom appeared again, and all the colors I see are totally fucked up. The walls begin to ripple and all my surroundings start to breathe and pulsate. The weed had completely widened the 'funnel' that constricts my thought and all thoughts are rushing in my head at the same time. I felt that I loved everything, and that everything loved me. My body felt like it was made of lead. I fell into a trance, leaving reality completely. I felt that I was God, then an ant, then I felt that I ceased to exist. This led to the feeling that my soul left my body, that it was free and unrestricted. It was soaring through maybe 1000 different real and fictious locations, like tropical paradises, heaven, oceans, deserts, arctic regions, 'the magical mushroom land', space, far-away planets, and a lot of other places I dont clearly remember. My astral-visionary trip was so intense and 'real' that when my soul returned to my body, I felt completely drained of energy. I was still having OEVs and CEVs, but I fell into a state where I didnt know if I was asleep or awake. After a while, I instantaniously fell asleep. I slept for 12 hours, I guess. When I woke up, it was already afternoon.",
  "I had so called 'afterglows' for a week, having mild auditory hallucinations and a bit of visual distortions. Nothing that hindered me from living my everyday life. This trip in particular made me understand that I had the same worth as every human, something I have never experienced before (I am unemployed, poor and discriminated in my real life). I had found the missing piece of the puzzle that is my life. And it is Gods plant, cannabis.",
  "I believe I know why I reach these trip-experiences every time that I use cannabis. 1) I eat a part of the dose and smoke the rest. 2) I use larger doses. 3) My friend and I want to achieve these levels, we always use good 'set and setting'. 4) The weed/ hash we get is really potent and pure. 5) I dont use cannabis often, maybe 1-2 times a month. And when I do, I have been looking forward to it. 6) I am a person that bonds well with cannabis."
 ],
 "erowid": {
  "id": "51691",
  "citation": " Weedman. \"Astral Trip: experience with Cannabis (Hashish) & OBE (ID 51691)\". Erowid.org. Jun 24, 2008. erowid.org/exp/51691",
  "substance": "Cannabis (Hashish) & OBE",
  "views": "6499"
 }
}
