{
 "title": "An Accidental Meeting",
 "author": "Theophany Blackfoot",
 "citation": " Theophany Blackfoot. \"An Accidental Meeting: experience with Belladonna (ID 88053)\". Erowid.org. Dec 11, 2013. erowid.org/exp/88053",
 "substance": "Belladonna",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "transdermal",
   "Belladonna",
   "(plant material)"
  ]
 ],
 "report": "<p>So there I was, working in the yard, culling the garden on the day of Halloween.  My garden was overgrown with Belladonna, which is an evasive species of plant here in the Pacific NW; soon my face and arms were covered with the deadly berries' juice and seeds but I was not aware of it until later.  By the time I was done whacking the garden, my arms and face were tingling with numbness and I was no longer on baseline any more.  I looked down at my body, thinking 'What's happening!?!' and noticed the berry juice all over me.  I dropped what I was doing, unplugged the weed-whacker and headed for the shower, passing my husband on the way.  I told him what was up and he asked if I was okay, I said yeah but I need to get this washed off.  By the time I got to the shower, my head was ringing with a high pitched buzz and my eyes had a really hard time focusing on what was in front of me.</p><p>I knew I was intoxicated with Belladonna (which was something I had read about but never thought to try due to the severity of the reactions, and the fact that dosing yourself with deadly anything is just plain stupid in most cases).  I reached out to the plant's consciousness as I had with mushrooms and salvia in the past, as I had with stones and herbs and other items, trying to connect.  I connected with the spirit of the plant right away. Getting a distinctly feminine feeling from the presents...something feminist and strong, something very old and very dark, but with a sense of humor.  I was having closed-eyed visuals, lots of teeth and golden eyes, angry snarls and again more golden hued eyes (as in the iris or colored part of the eye was deep golden. </p><p>Ive seen and experienced eyes during my journeys with salvia and mushrooms, but nothing like these) I was very thankful that I had my wits about me still, that I wasn't in the full throws of a trip experience with this plant as she is dark.  I got the distinct feeling not to shave or risk blood around Belladonna, that it would be very, very bad.  Also no Men, sorry guys.  I don't think she takes kindly to men at all...or at least the 'typical' masculine, jarhead stereotype.  As soon as I connected with her, I had a flood of information about taboos with this plant and how to use it semi-safely.  I was so excited I thought, 'I'm going to go get a spray bottle and start making a mix of water and fresh juice and seeds...' but my guide (thankfully) spoke up with one word, seductress, and it all fell into place.  I call Belladonna the name and she laughed a throaty, lusty laugh.  I got the sensation of being pulled into a black vortex and happily giving myself over to it.  Then all this information came flooding in, she is a Dark Goddess ally, something not to be trifled with, but with the kindliness of a sister, she showed me where my one of my shadow traits was wanting more; more of everything good in life.  More knowledge, more food, more sex, more happiness, more free time, more money, more, more, more...like a hungry maw that doesn't feel as though it gets enough.</p><p>There was no sense of judgment in this brief evaluation of my Dark Goddess, just a glimpse from a different point of view and it was easy to accept the knowledge for what it was.  I asked her if there was anything else I should know, I said, 'what about everything else that's been on my mind, that I've been trying to sort though?' of which she responded with information on Magic and how the magical or psychic abilities people have are everyday abilities for us.  They are something we do all the time, but are not aware of it.  The key is to engender awareness, not ability.  Once you have the awareness you need, you can consciously choose to put those abilities into effect (healing, telepathy, energy work, etc).  She also showed me how any act of kindness can be a shadow trait, if the intention behind the act reflects that shadow.  The example I was shown was someone who preached to a congregation out of the pomp it gave them as the preacher, not out of love for their flock.  It didnt start that way, but once the shadow feasted on the adoration, it turned into that.  Light turned to dark.  All in all, If I were to visit with her again, I wouldn't approach her unless I was at the end of my moon cycle, after ovulation but before menses.  I was told not to approach her while on my moon blood, something about two dark goddesses competing for the same space, apposing energies and all.  Also I feel as though there was a kinship between an ally that was associated with the Dark Goddess and where I was on my moon-cycle.  As though if I attempted to contact her prior to ovulation, or too soon after (Still in the mother phase) I would have had a much more negative experience...so many dark lessons on this one.</p>",
 "year": "2010",
 "id": "88053",
 "gender": "Female",
 "age": "31",
 "timestamp": "2013-12-11T08:00:00.000Z",
 "views": "1454",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "transdermal",
   "substance": "Belladonna",
   "form": "(plant material)"
  }
 ]
}
