{
 "title": "Amazing Stimulation and Euphoria",
 "author": "3eyeswise",
 "citation": " 3eyeswise. \"Amazing Stimulation and Euphoria: experience with 4-Methylmethcathinone (Mephedrone) (ID 88054)\". Erowid.org. Nov 3, 2010. erowid.org/exp/88054",
 "substance": "4-Methylmethcathinone (Mephedrone)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "oral",
   "4-Methylmethcathinone",
   "(powder / crystals)",
   "",
   " repeated",
   "oral",
   "Alcohol",
   ""
  ]
 ],
 "footer": [
  [
   "2010",
   "88054",
   "Male",
   "",
   "30",
   "Nov 3, 2010",
   "10416",
   " "
  ]
 ],
 "report": "<p>After doing as much research as possible, I decided to give Mephedrone a try. I have had experience with moderate use of stimulants like ecstasy, coccaine,Adderal and MDMA, and I must say that in my opinion Mephedrone, when used in moderation, is better than all of them. </p><p>After receiving 1 gram of flour like Mephedrone, I then seperated my gram into 4 piles. I did not have a milligram scale but figured my 4 piles would equal 4 250mg piles.( 1 gram = 1,000mg) All week I was planning on attending a big Halloween party and figured I would save a 250mg pile to try. Finally the night of the party comes and I have my M-Drone ready to take.</p><p>We arrived at 9pm, I poured a drink for me and my girlfriend, being very cautious about my drinking. After about 3 drinks and greetings from all of my friends I was feeling very mellow and relaxed and decided its time to dose. I had seperated my 4 250mg piles in some small jewlery baggies I had. At 9PM I simply held them up to the faucet, filled them half way with water and drank the chemical down. Yuck! Very nasty but the nasty taste left me quickly. </p><p>9:30 I am definetly feeling different,slight stimulation,but it is'nt until 10PM that the real fun began. 10PM, I get up to go talk to some friends and I think to myself ' Holy Shit, I feel AMAZING!!! '. A superior feeling came over me, very similar to ecstasy but I can hold intelligent conversations. I felt awake stimulated and extra talkative during this Mephedrone experience. The high is a very clean feeling, definetly one of my favorite feelings to date. 10:30PM its still going very strong, I am talking my ass off to everyone, I can feel a strong sense of love for my girlfriend, very much like the ecstasy ' I love you' feeling you get when on a roll. I even start talking about getting engaged soon, which is very odd for me. </p><p>11PM still feeling great but I should'nt have kept drinking. I am on about drink number 8 and feeling completely Dishstunkinflunk wasted. </p><p>11:30PM I am still going pretty good but not as much as before, wanting to redose just a little, but I refuse the urge. 12AM I am now drinking water and eating. Feeling great, nice wired feeling, very much like adderal or good coccaine except the huge rush I had before is gone. 1 AM, I can feel the Mephedrone starting to wear off,although it still feels as if I am very alert even though I had 8 strong drinks. </p><p>2 AM, I am now starting to comedown and resisting the urge to do more. Wow the initial wave makes you feel so good that it is very hard to Not re-dose. I did'nt give in, and at 3 AM I decided to call it a night. </p><p>I would say Mephedrone when taken orally last for 4 hours total, 2 of which are like a strong mix of coccaine and ecstasy but clearer on the mind, followed by another 2 hours of adderal or strong caffeine feelings. Sleeping was hard at the end of the night, that is the bad news. The good news is that I was able to give my girlfriend great sex with no problems. </p><p>With carefull moderate use, Mephedrone is an excellent mood lift, pick me up, and socially loose drug. I enjoyed the experiment very much. In small doses its really quite great. Good to have a couple drinks or benzo on the come down, it really helps. Its still Legal in the USA, but only to put on your plants as plant food. NOT for human ingestion.....Hope this helps anyone curious.</p>"
}
