{
 "id": 8808,
 "title": "The Goddess Effect",
 "date": {
  "submission": "2006-07-11T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Irie Knifefish",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "MIPT",
   "form": "(capsule)"
  }
 ],
 "report": [
  "<p>[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "Just a little background, I have debilitating depression as well as other disorders associated with ill mental health for most of my life, however, no to the point I couldnt function. Im 20 and have been in college for 2 years now and worked at the same job for 3. My mental issues kept me from enjoying a normal social life.",
  "Well, where do I start? I have never really tripped much, and I have a much more different approach and stance on it then most people do. I believe that they shouldn't be done in public, and I dont do them at parties. The only drug I have ever driven on was Marijuana, But I know my limitations when it comes to the two together. I have a friend who by all means is some what of a psychonaut. Me and a friend see him occasionally and he usually hooks us up with a few interesting things. I have done MIPT twice before, but at low doses. This time, he gave us 2 gel caps of MIPT, approximately 40 mg each. I held on to it for about 2 weeks before me and a friend set up a day to do it.",
  "It was Friday, and we ate nothing the entire day. The setting was his basement, which has great textures and surfaces and makes a excellent place to trip. We took our caps at 11pm and within about 20 minutes, felt the usual stomach pain associated with it. This time around it was a little worse, in fact, a lot worse. Well, as the hallucinations started kicking in, we turned on the stereo and listened to Kevin Drums Sheer Hellish Miasma. It kinda sounds like a static fan blade. We watched the ceiling. He has an asbestos ceiling slowly morph into a sea of squirming people and then into these Indian Goddesses dancing in geometric patterns. Me and my friend are McKenna Fans, so we called them 'self transforming machine bone goddesses. They would dance geometrically, then break apart and reassemble themselves. Small Aztec looking gods danced across the floor and walls.",
  "While this was happening, the physical symptoms were getting much stronger, which is why I say that this dose should be done by people in decent physical health. I had the stiffness in the joints as well as increased body temperature. My skin was reddening, so I took off my shirt and just wore my A-Shirt for the night. I could feel my spirit getting sort of further away from my body. To be honest, I was almost convinced I might have been dying at this point. I remember telling my fellow MIPT consuming comrade that my spirit was telling my body to die. In a way, it kind of was.",
  "Back to the story. So this disassociative feeling grew, to the point where I had some sort of near death experience followed by an out of body one. I heard this noise like a teapot whistling inside my head as the drug peaked. This is was without a doubt the telltale tryptamine tone. My heart beat fast and hard as I approached otherness. The near death was brief, and very comfortable. I felt no fear or sense of estrangement (at the time). Me and my comrade traveled back in time to my friends house (from whom we got the MIPT) and decided not to wake him up.",
  "For some reason, we touched hands were shown a pattern that illustrated how everyone in the world was connected, with us in the center. As I came back, I was out of body. There were colors, somewhat like acid. If I stared at something too long, I would zoom in on it. Minutes later, I was back to the altered reality, in a state of shock. During this, all the internal arguments which at the time would always occupy my thoughts were externalized. Many thoughts raced through my head. I thought that I had just died for a minute, I thought that I was still dead and ghost was my friends basement, and all kinds of nonsensical things about what other people are thinking and such. Almost 25 minutes or arguing with myself and my friend trying to calm me down, I addressed the absurdity of these arguments. Things have changed much since then. I stay in a kind of Zen state now. My mind is very balanced, and I concentrate on present issues only.",
  "This drug helped me catch up on years of personal development that I have either been denied of, shunned away from, or simply missed out on. Now that I was calmed down, I smoked the Joint while enjoying an Igor Wakhevitch CD and the wood panel walls. I used to smoke weed every day, start to finish. Now, the only time I absolutely need it is when I trip. It helps with the nausea and helps keep my trip positive. I believe that the Indian goddess may have been linked to the Marijuana smoke in the air (we had smoked a bowl before we started tripping to help with the stomach pain).",
  "Back to the joint. It was delightful, and as I sat there and smoked it, I thought about a girl I like. Well, color me crazy, but the smoke pouring out the end of the joint turned calm blue. This was the last of any great major visuals. Me and my friend spent time talking after this, and I believed that we managed to connect to our over minds. We got this tingly feeling in our foreheads and meaningful words would just flow. We felt someone elses presence the whole time, though we were the only ones there. So all and all, this was a good life changing experience. I like to trip for insightful and meditative purposes. I'm not sure If Ill do that dose again because I have learned what I needed from it. Perhaps 35mg next time, if there is one.</p>"
 ],
 "erowid": {
  "id": "51725",
  "citation": " Irie Knifefish. \"The Goddess Effect: experience with MIPT (ID 51725)\". Erowid.org. Jul 11, 2006. erowid.org/exp/51725",
  "substance": "MIPT",
  "views": "11266"
 }
}
