{
 "title": "Memoirs of an Overdose",
 "author": "Mocha",
 "citation": " Mocha. \"Memoirs of an Overdose: experience with JWH-018 in combination with cannabis (ID 88093)\". Erowid.org. Apr 28, 2011. erowid.org/exp/88093",
 "substance": "JWH-018 in combination with cannabis",
 "bodyweight": "130 lb",
 "report": "<p>When I first heard about JWH-018, I was instantly captivated. I started research on the internet right away and even came across some of the early reports. Eventually, I came across a website that would sell 99.9% pure product for very low prices compared to many others. I still lived with my parents at the time so I had a gram shipped to my juvenile delinquant cousin.</p><p>I watched as my cousin flicked on his lighter and brought it closer to the crude piece of tinfoil. The illusive white substance bubbled and melted into a brown smear of goo. As the smoked rolled off in a line, the odor that I've grown to know so well began to tickle my nostrils. 'Plastic!' he shouted, 'This shit smells and tastes like plastic.' It was my turn now and it couldn't have been sooner. Right when I inhaled that first cloud, I knew that this substance was something completely different from marijuana. I began to feel waves of pleasure flowing through my whole body. My cousin and I figured we could sell JWH-018 on the street with jacked up prices and make at least one hundred percent profit. We split the remains of the gram in half and I ordered some more when I arrived home.</p><p>Not before too long, I began smoking every night. It was the perfect drug of the night; Just what I was looking for. I would lay on my bed and listen to music while I fastened my gaze on an interesting visualizer. This proved to be a remarkable experience. I would hallucinate within the complex swirlings of colour. I remember one specific time when I saw a battle between medieval cavalry. It was surprisingly detailed and remains vivid in my mind to this day.</p><p>JWH-018 is a great sexual stimulator. I had some of the best sex (and alone times) I have ever had on this substance. It increases sensitivity and allows me to experience every feeling amplified.</p><p>While under the influence, it is best to eat something. Much like when stoned, food tastes unusually pleasant and I've found negative side effects (Nausea and Anxiety) can escalate on an empty stomach. Food is also good simply to get the bad taste out of my mouth. I always find the smoke leaves a bitter chemical taste and my teeth feel soft and powdery (not in a good way).</p><p>The final time I smoked JWH-018 was different than anything I had experienced prior. It all began on a night which had been going fairly well. It seemed like the perfect time to get really messed up. I had developed a bit of arrogance and was very loose with my dose. Unfortunately, I can't even give an approximation on how much I had smoked. Needless to say, it was definately not a safe dose. The usual effects began to show their faces as usual. My hands and feet began to go numb, like they had in previous experiences, but this time my legs began to slowly go numb as well. I began to get worried because I could move my feet but not feel them at all. They would only twitch in a jerky and sharp motion. I then began to noticed my heart had escalated faster than ever before. I could feel my whole body going into panic mode. I also began to shake uncontrollably and my breathes felt very shallow. I feared that I was having a heart attack or something of the likes so I began to take very slow, deep, cleansing breathes. I managed to bring down my heart rate down but my body was still shaking and tremoring uncontrollably. After coming down, I was grateful for my life and realized how ignorant I had been.</p><p>Be careful with JWH-018. It is not a joke. Do not take its use as lightly as I have. Learn from my mistakes.</p>",
 "year": "2009",
 "id": "88093",
 "gender": "Male",
 "age": "19",
 "timestamp": "2011-04-28T07:00:00.000Z",
 "views": "6438",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  }
 }
}
