{
 "title": "Cocaine the dealers perspective",
 "author": "albatross",
 "citation": " albatross. \"Cocaine the dealers perspective: experience with Cocaine (ID 881)\". Erowid.org. Nov 20, 2000. erowid.org/exp/881",
 "substance": "Cocaine",
 "bodyweight": "158 lb",
 "header": [],
 "report": "<p>The first time that I tried cocaine I was 23 years old and at the local bar with some friends. We had gotten out of work and were ready to have some drinks. I have a BA degree and consider myself fairly educated, but Cocaine I had no prior experiance or knowledge of the drug other than it was another drug.</p><p>Inside the busy bar my friend and his girlfriend turned to me and said, 'do you want to do some coke' looking them dead in the eye, they somehow convinced me to give it a try.</p><p>The three of us headed out to his car we piled in and his girlfriend cut up three lines on a CD case and we railed (snorted) them up with a 'toot': a rolled up dollar.</p><p>I felt the burn inside my nostril, and an accute awarness came over me. I felt my alcohol 'wear off' I felt very sober and coherent. I didn't mind the drip.</p><p>Despite the irritating running nose when we returned into the bar. I was feeling great. My mind was fully aware of my surroundings and the people around me. Over the next few hours we snorted up what I learned to be about 2 grams. The girl that I was seeing at the time, came home with me to sleep with me. I was a stud I knew everything to say and everything to do. I was so alert to her body and movements.  Then when the moment for sex came, and I learned the major downer of cocaine. It took about a half hour for me to produce an erection.</p><p>After this Cocaine became a weekend experiance for me, this went on for about two months. I also began to dabble into Extacy, from a local pharmacist, I stopped seeing the girl that went home with me the first night, and spent most of my time with my friends.</p><p>After three months of weekend use I began binging with my friends inviting people who wanted to do Cocaine up to the City for a little Cocaine. The average bing was only two to three days. I began to purchase large quantities through my friend, and then my dealer made himself known to me he was an average guy someone who I would talk to at work all the time, The Average Joe with everything going for him like me.</p><p>At that time I was spliting 60 dollars a gram with my friends every weekend or roughly two times a month guaranteed. After meeting the dealer, I would purchace a few grams, and during the purchase, I would kick him a line, up until that night in his car I had never portioned out lines before. I didn't know how much to give him let alone me. Obviously I was a heavy pour, each line was about a quarter gram, I believe now. With each purchace I made the price began going down.</p><p>It finally came to the point that the dealer and I hung out, and he cut me into his deal. I purchace a 1/2 ounce of good cocaine for 600 dollars, @ 45 dollars a gram. Out of this I sell close to 14 grams and keep two for myself.</p><p>I am a normal guy with a job and friends, I have an education and a great future ahead of me. I grew up in the average home, with good parents.</p><p>This is my story and I just finished a gram today while writing this. I am finished using and finished selling as of this moment.</p><p>Albatross, a seller, a user, not an addict by choice.</p>",
 "year": "2000",
 "id": "881",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-11-20T08:00:00.000Z",
 "views": "14350",
 "dose": []
}
