{
 "title": "Too Much is NOT Pleasant",
 "author": "GreenFairy",
 "citation": " GreenFairy. \"Too Much is NOT Pleasant: experience with JWH-018 (ID 88103)\". Erowid.org. Apr 29, 2011. erowid.org/exp/88103",
 "substance": "JWH-018",
 "bodyweight": "140 lb",
 "report": "<p>I find it a bit ironic that only days after submitting my report in which I stated that JWH-018 was my new favorite research chemical and possibly a complete replacement for pot altogether, I now have to return to tell a tale of the horrors that can occur when a markedly higher than normal dose gets smoked.</p><p>Now, I'm not criticizing the chemical itself in any way shape or form. I was well aware what the effects would be of smoking a large quantity of the powder, and as such, I decided of my own free will to smoke a dose that appeared to be roughly more than 7-8x larger than my usual dosage. Basically, I had flirted with some large doses in the past few days, but each time I managed to keep myself in a good state of mind, even if my body would tense up a bit and anxiety levels would increase. I frequently described the state to my friends as being 'awkwardly magical.' However, I really wasn't anticipating just how bad the effects could become in even higher doses. Even though I knew that unlike cannabis, which only acts as a partial antagonist of the CB1 and CB2 receptors, JWH-018 acts as a FULL antagonist, meaning you can just keep getting higher and higher. [Erowid Note: JWH-018 is a cannabinoid receptor agonist.] Little did I know just how high I would become...</p><p>Around 4:20 AM, I was sitting in my room and noticing that my high was starting to come down, so I sprinkled a few clumps of powder into my bowl, and lit up in my own special mini-celebration of highness and fun. However, I had only packed a small dose, and my high quickly began to fade (especially considering that I had been high literally the entire day), so around 4:50-ish, I decided to pack another bowl. This one however, I continued to pack far fuller than my usual doses. I stepped outside for a minute, smoked, and then went right back into my dorm and into my room. The usual marked euphoria and head-rush appeared just as quickly as usual, and so I sat down at my desk, ready crank out some music or watch something amusing online. I figured that if I got too high to handle, I could just lie down in my bed and go to sleep. After all, it WAS 5 AM and I HAD been up all day...</p><p>However, I quickly noticed a change in my 'high.' I was trying to read through my music playlist, when I suddenly noticed that I could no longer read. The screen just seemed to swim around in front of me, and I was seeing triples of everything. I still felt the euphoria from the high, but I quickly realized that anxiety was beginning to build up within me as well. Within mere minutes of my actually smoking, I was already too high to function. I got in my bed, lying down in an attempt to just calm down and get the high back under control. But with each minute that passed, the high grew stronger. And no matter how much I tried to reassure myself that I was going to be fine, I couldn't help but feel inside that all hope was lost and that I'd be stuck like this forever.</p><p>The worst feeling though, was that I couldn't simply fall asleep and ignore the high. Because as soon as I tried closing my eyes to fall asleep, if I kept them closed for more than 5-10 seconds, all of a sudden I'd feel a paralyzing numbness in my body, almost as if though the weight of all the earth's gravity was pushing on me at once. I quickly re-opened my eyes to make it stop, but it took another 3 seconds after opening up my eyes for it to go away again. It was actually both physically and mentally painful for me each time I shut my eyes, and so I had to stay awake and ride the whole trip out. What's worst though, is that I actually WAS very tired, so it was a fight with myself as well as a fight with the drug.</p><p>Auditory hallucinations were present for the duration of the experience. Various self-created melodic sequences were stuck on repeat in my head, each one playing faster and faster as my anxiety would continue to increase. Visual hallucinations were limited to how everything I was seeing, I was seeing three of at once. I also noticed that it was nearly impossible to focus on any one object or location for more than a second, as my eyes would start to involuntarily jerk around, trying to look at everything at once. I'm almost positive that I was suffering from a physiologic nystagmus. Tactile stimulation was enhanced, much like the effects of MDMA. The only difference, however, is that whereas MDMA made everything I touched feel AWESOME, JWH-018 made everything feel weird. Not bad, necessarily. But weird. At one point, I remember feeling my leg and thinking that it was literally as thin as a toothpick, and that if I moved it the wrong was that I would snap it. It was actually quite horrifying.</p><p>Time dilation was also present, in a very negative way. As my trip was proceeding, the one thing that kept me going was the thought that 'it won't last long, and besides, you've probably been tripping for close to an hour now, it's bound to leave soon.' And that's when I looked down at my phone and realized in horror that it had barely even been 15 minutes.</p><p>After nearly another hour of rocking back and forth in my bed, trying to fight off nausea, the need to sleep, and my own pending insanity, I eventually managed to pass out all at once, not even staying awake long enough to remember feeling the effects of being pushed down by the world's gravity again.</p><p>To try and make sense of my trip, here's how I would compare it to other drugs I've taken. Definitely stronger than cannabis, seeing as how cannabis never causes me to suffer anxiety, tension, or hallucinate in the slightest bit anymore (though it did the first times I tried it). I would also state that it was a stronger experience for me than when I dropped two tabs of acid. Though the acid was certainly very strong, and a fantastic experience, this was hands-down stronger. Shorter, yes, but much stronger. And more unpleasant. However, it was not quite as strong as my stronger salvia trips. I only ever do the highest strength salvia that I can purchase, never smoking an extract of less than 160 mg salvinorin A. It was definitely much longer than my salvia trips, but much weaker and less happy.</p><p>Over all, it was a horrible experience. Nothing I would ever repeat. However, I don't regret it either. I knew exactly what the dangers were of smoking too much at once, and I chose to ignore them. And as such, I suffered the consequences. But at least now I know what NOT to do, and have an even stronger understanding of how to make use of the product responsibly.</p>",
 "year": "2010",
 "id": "88103",
 "gender": "Male",
 "age": "19",
 "timestamp": "2011-04-29T07:00:00.000Z",
 "views": "6703",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  }
 ]
}
