{
 "id": 8812,
 "title": "Who's There?",
 "date": {
  "submission": "2002-01-11T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Breeze",
  "gender": "Male",
  "weight": 58
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "Last week I bought some salvia divinorum to share with some friends on winter holidays next week. Having read about the strength of its psychedelic qualities, I was (and still am actually) quite uncertain if it would be a good idea to share this plant with people that have no experience with psycheldelics whatsoever.",
  "Last night I decided to smoke a little of the extract I had bought to get a suggestion of what and where a full experience would bring me. Maybe I could taste some of the fear and awe so many people are talking about. I must admit, however, that I am very sensitive to any drug. The fact that I was alone made me even more cautious.",
  "In one toke I finished what can't have been more than 40 mg of the material, kept the smoke in my lungs for about 15 seconds and exhaled. It came on fast, like ether. My shirt was getting itchy, and it felt very pleasant to stretch and relax the muscles of my face. Then it suddenly felt like someone was pulling me gently on my shirt. This seemed very real. I remember laughing and thinking 'come on, don't try to play with me'.",
  "When I opened my eyes I saw myself hanging in the middle of some kind of circular and transparent platform. Suddenly it felt like this platform was pushed upwards at one side, what caused me to hang sideways. Again it was like there was someone who was doing this to me, someone I felt very familiar with. It made me giggle.",
  "Several seconds later I was completely out of that strange world. In total the effects can not have lasted more than 2 to 5 minutes. For the rest of the evening I felt very relaxed and read every article from the newspaper I had bought with unusual interest.",
  "This encounter made me curiouser than I was before. I hope that next time, with a strong dose, I won't meet Mike Tyson in the ring either."
 ],
 "erowid": {
  "id": "5174",
  "citation": " Breeze. \"Who's There?: experience with Salvia divinorum (5x extract) (ID 5174)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5174",
  "substance": "Salvia divinorum (5x extract)",
  "views": "5813"
 }
}
