{
 "title": "A Simple Yet Oddly Stimulating Trip",
 "author": "allgoldandgreen",
 "citation": " allgoldandgreen. \"A Simple Yet Oddly Stimulating Trip: experience with 5-MeO-DALT (ID 88213)\". Erowid.org. Dec 10, 2010. erowid.org/exp/88213",
 "substance": "5-MeO-DALT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "oral",
   "5-MeO-DALT",
   "(capsule)",
   " T+ 4:30",
   "3 mg",
   "oral",
   "Pharms - Eszopiclone",
   "",
   " T+ 4:30",
   "1 mg",
   "oral",
   "Pharms - Alprazolam",
   "",
   " T+ 4:30",
   "50 mg",
   "oral",
   "Diphenhydramine",
   ""
  ]
 ],
 "report": "<p>So I just purchased a gram of this stuff to give it a try, as psychedelics have always been interesting to me. It was a white crystalline powder despite what I've been told that it is a tan/brown-ish color. Regardless I weighed out what was approximately 30 mg (my scale is a bit shitty so I'm guessing it was between 30 and 35 mg but whatever) and popped it into a capsule and sent it down my throat on an empty stomach.</p><p>After about a half hour or so I was pretty certain that I felt an alteration of my mental state but I wasn't totally convinced it wasn't placebo. I mean the last psychedelic I used was a double tab of acid so comparatively it felt like nothing much at all. Regardless, I became certain that the stuff was certainly functioning when I definitively felt that rush one feels when coming up on a psychedelic. I normally smoke a bit of weed before tripping to kill any come-up discomfort but I elected against it so as to feel the DALT in its pure form. It was like a tingling warmth rushing through my bones.</p><p>I clearly felt a different rush at about the 45 minute mark; a stimulating bolt of energy roughly equivalent in force to stimulants like MDMA or methylone etc without being AT ALL similar in its energy. In fact the comparison should really just end there. Its challenging to verbalize, but normally while on shrooms or acid etc I can just lay under a tree for hours and be content. While on DALT staying still or sitting for too long was a bit uncomfortable.</p><p>While on the come up, approaching the 60-minute point, the first thing I really noticed (besides the stimulation) was the ability to pinpoint sounds in a different way. I could sense the 360-degree space I was in and absorb every subtle sound in a beautiful way that was very reminiscent of other tripping experiences that Ive had. The next thing I noticed was, not surprisingly, a change in time perception; time seemed to pass much slower, as with most psychoactives.</p><p>Furthermore there were absolutely no OEVs or CEVs. (By this point I was maybe 75-85 minutes in) Pretty boring for a psychedelic you may say huh? Not TOTALLY accurate I mean I was still clearly tripping more or less. You know how when you trip your spatial perception changes in a way that nobody can really explain fully or properly? Everything just FEELS different and LOOKS different, and not in an animated sense; it just IS different. Well while on DALT everything FELT different but didnt really LOOK all that different. By extension there was a definitive increase in color vibrancy yet it was not terribly extreme.</p><p>There was still a greater appreciation of nature and beauty but in a way that was very simple and subtle.  While on shrooms or acid I can clearly see a tree or flower etc and say to myself that tree looks so vibrant and clear and just gorgeous yet while on DALT it was hard to pinpoint WHY things looked so beautiful. It felt like a very simplified version of standard psychedelics. The places my mind goes on acid etc is just far more complex and deep than while on DALT. I realize thats not really the fairest comparison as acid is clearly THE psychoactive substance in my opinion.</p><p>That said, the DALT was certainly interesting, lasting about 2 hours before I started to come down. If I had to summarize by noting the primary negative of the substance in my opinion it would be that I was actually quite aroused for the majority of the trip. It was actually rather bizarre, as NO psychoactive experience has ever done this to me. As I was wandering campus the number of attractive women I saw was astonishing (usually I see quite few) despite the fact that these girls would clearly not be attractive to me when sober. Obviously I didnt act on any of this though. This could totally be a one-time thing though and theoretically it may not be an issue at all next time I use it. Its just something I, and perhaps others, should be aware of.</p><p>The come down was very smooth, although I needed 3 mg of lunesta, 1 mg of xanax and 50 mg of benadryl to get to sleep (about 4.5 hours after consumption of the DALT). There were no hangover affects whatsoever.</p><p>Overall it was not overwhelmingly exciting and in a lot of ways it failed my expectations but it was certainly not a failure by any means of the word. I will definitely increase my dose next time to around 50 or so mg and see what happens. My biggest disappointment in the substance was its lack of visuals and lack of deep introspective ability that makes acid so brilliant. I actually think it could have excellent potential in combo with other substances. Next time I drop acid I would love to take some DALT mid-trip and see where it takes me. Or even in combo with some euphoric stimulants, who knows! Im not sure, I just think I need to experiment its combination potential and perhaps write another experience.</p><p>Ok last point: I would suggest others to not shy away from this substance (because I realize my report was rather neutral at face value) because it WAS rather interesting and a worthy experience totally something I would try again. I would particularly recommend it to someone who has never tripped before and is somewhat anxious about the experience because its not a long commitment (about 3-ish hours) and its not overwhelming yet still makes for a good first stepping stone into the wonderful world of psychedelics.</p>",
 "year": "2010",
 "id": "88213",
 "gender": "Male",
 "age": "21",
 "timestamp": "2010-12-10T08:00:00.000Z",
 "views": "19441",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "5-MeO-DALT",
   "form": "(capsule)"
  }
 ]
}
