{
 "id": 8823,
 "title": "What It Is Like",
 "date": {
  "submission": "2007-12-18T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Warbles",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "150",
    "unit": "mg"
   },
   "administration": "IM",
   "substance": "Ketamine",
   "form": "liquid"
  },
  {
   "time": "0:20",
   "amount": {
    "number": "100",
    "unit": "mg"
   },
   "administration": "IM",
   "substance": "Ketamine",
   "form": "liquid"
  }
 ],
 "report": [
  "I am 24 years old.  I have used all kinds of drugs hard for the last 3 years.  I have come to really enjoy the effect that DXM and Ketamine give me.  At the time I am writing I have injected 150 mg of ketamine into my arm.  This is the second night I have done this.",
  "The feeling comes on quick.  I ask myself 'Am I feeling it?'  Then I am.  I float.  I look and it all looks glazed over.  It is there but, well who cares.  I think.  It is all confusing, but calm.  I move on.  Letters and objects seem magnified.  They are not enormous but they are out of place.  It doesn't come completely together for me but hey it's ok.  It is just big.  My jaw tingles, feels kinda warm.  My lips are numb.  I think.",
  "It has been twenty mins.  World spins.  Some confusion but not fear.  I decide to take another shot 1 cc/100mg.  I am up to 250 mg.  One mg for each pound.  Things I remembered like how much to dose per lb I have a hard time remembering.  This goes on.  Pleasant but I have control.   Makes me sleepy but not really just relaxed.  Everything feels like clay.  Like I am made of clay.  Everything is moldable.  Body feels like liquid.  Relaxed.  But everything here is calm.  Feels nice.  Watch t.v. now.",
  "One hour later.  Spaced out but not real high.  Wouldn't drive a car now probaly will go to sleep."
 ],
 "erowid": {
  "id": "51789",
  "citation": " Warbles. \"What It Is Like: experience with Ketamine (ID 51789)\". Erowid.org. Dec 18, 2007. erowid.org/exp/51789",
  "substance": "Ketamine",
  "views": "3836"
 }
}
