{
 "id": 8825,
 "title": "What's Up Grandpa?",
 "date": {
  "submission": "2002-01-11T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "q-tip",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 5x"
  },
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Pharms - Diazepam",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "1st and 2nd full-blown salvia trips",
  "1st Trip - What's up Grandpa? - 12/00",
  "My first 2 times I tried smoking my salvia 5x extract I smoked it out of a bowl, which was very unsuccessful, no effects at all, except for being in a dreamy/sleepy state.",
  "So I finally decided it was time for me to buy myself a big old' bong, who is now dubbed 'The Purple Pirate'. Well the first time I tried smoking it out of my bong I was all by myself (stupid idea) and I was chilling in my bedroom. I lowered the lights, turned out the TV and packed about 100mg. into the bong.  I sparked it up and took in a huge chamber full of smoke and held it in for about 15 seconds, then I went back and took another chamber full hit. That's all I remember of reality.",
  "I slipped into my childhood in a disoriented way. I lost contact with the real world as I slowly felt like someone had a remote control to my life.  They would put me on play and then pause, then play again then pause, as this occurred I knew I was slowly slipping off of my couch I had been sitting on. Then I realized I could still recognize the world around me, I saw my TV and my stereo, but in the back of my head the trip really began. I felt real warm and comfortable, and I noticed myself riding around on a tricycle in my grandparent's driveway.  My grandparents used to have family cookouts at their house in the summer time all the time when I was little, and my cousins and me would spend the days away riding bikes and playing bochee ball. I saw my grandpa standing on the side of the driveway just watching me peddle around on my bike, and he just smiled with joy, I knew he loved me. During this whole time the play/pause effect was still occurring. I finally got real scared that my mom would find me (even though she wasn't home) and I forced myself out of the trip. I woke up out of it lying on the floor holding my bong and lighter in a complete state of confusion. I quickly got up and walked around the house to see if everything was normal. I then called a friend Jenn, who I had spoken to about 5 minutes before I tripped.  I asked her how long ago it had been since I talked to her? She said it had been a good 20-30 minutes, which means I was out of if for about 15-20 minutes. It was beautiful. I was left in a very dreamy and confused state of mind for about another hour or so. All in all it was a good experience, I didn't know what I did at the moment, but I learnt that I need to have a sitter with me from now on.",
  "2nd Trip - What the hell are you doing here beetle bailey? - 12/00 (five days later)",
  "I decided my friend John would appreciate a good salvia trip, and I needed a release from a real fucked up day. So we hang out for a little shooting the breeze and decide its time to go smoke up. I railed a couple valiums to calm me down and we head out to his car.  As we get in we decide it would be best not to do this in front of my house (in case my mom sees us). SO we park on a side road and I pack about 100mg for John. I tell him the instructions on how to smoke it and hand him the bong.  With a click of a lighter he inhales a full chamber of smoke, holds and releases, I tell him to quickly take another hit and he finishes off what's left.",
  "Silence. John looks at me and asks is his leg is ok? I say yeah of course it is. He then rips off his hat and tosses his hair around in a fury! I begin to get worried, but I know he's just tripping real hard. He grabs onto my arm with great strength and asks why its gonna end? He says why now? And he starts looking into the back window freaking out that's he's stuck and he needs to leave. He asks if we can go now because he doesn't want it to happen! I grab onto his hand and tell him to calm down, I'm here, its me John, I'm here for you, and everything is ok. He begins getting in and out of his seat trying to dislodge his foot that was stuck, he felt this is what was keeping him from being saved from the peeling effect. He finally begins to calm down and grasps onto my hand. I ask him what he saw, he said the world began to peel away from reality and everyone was going to die, but no one knew, and he needed to get out of there so we wouldn't die. But then he saw me saying I knew, and that it was ok, it relieved him that someone else knew where he was. He finally came back down to a baseline and we discussed his experience.",
  "Now it was my turn, I knew I wasn't going to have a scary experience, I wanted it to be nice, so that's how it was going to be I told myself. I pack up about 100mg and light it up, I take in a huge chamber full, hold it for about 10 seconds, then take another chamber full and hold for another 10 seconds. That's where I lost touch, I slipped into a beetle bailey cartoon, the music John had on in the car must have sparked thoughts of the wars back in the day that Beetle Bailey would have fought in, and he was standing there watching over me. He told me it was time to go.  Soldier, get your stuff we have to get out of here. I asked him where we were going to go, but he wouldn't answer my questions. I felt that my body was his body, and the bong I was holding was the American flag he was holding. And then he started peeling away in small strips from the right side of his body.  My body was very hot and I could feel each strip of me/beetle getting pulled away.",
  "I asked him if my sister was going to be coming with us? But he didn't answer, I said well if she comes I don't want her to get in trouble with my mom. And the peeling just continued, so I decided just to watch and feel it go on. When the peeling got to my hand with the bong/flag I felt a coolness come over me in my hand, like my skin was being exposed, not in a scary flesh eating way, but a nice comforting coolness. So I just sat there watching us getting peeled away from reality. Finally it got to my face and my whole face got real cool, and once it got to the end of my face I snapped out of it. I had no fucking clue where I was, then I saw John and figured I was ok at this point.  I asked if we were gonna be ok, and he said yeah everything was fine, then I asked if my mom or my sister knew, and he said no, then I realized I was back on earth in the real world again. Then I just started laughing at how funny it was and how damn cool it felt. That was one of the quickest and hardest trips I have ever taken. Can't wait for then next time. Until then, peace and love.",
  "q-tip"
 ],
 "erowid": {
  "id": "5179",
  "citation": " q-tip. \"What's Up Grandpa?: experience with Salvia divinorum (5x extract) (ID 5179)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5179",
  "substance": "Salvia divinorum (5x extract)",
  "views": "6127"
 }
}
