{
 "title": "I Manifested This Body for You",
 "author": "Rick",
 "citation": " Rick. \"I Manifested This Body for You: experience with P. cubensis (ID 8825)\". Erowid.org. May 19, 2004. erowid.org/exp/8825",
 "substance": "P. cubensis",
 "bodyweight": "60 kg",
 "header": [
  "DOSE: T+ 0:00",
  "1.0 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)",
  " T+ 0:15",
  "1.0 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)",
  " T+ 0:15",
  "1.0 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)"
 ],
 "report": "<p>Mushrooms 'Stropharia caerulescens' [Erowid Note: Psilocybe cubensis]  freely available in Japan from street side stalls and shops in Japan especially in the 'cool' young areas eg Shibuya. Not cheap though... 1000yen/gm. Thought I'd give it a go...</p><p>History: About 6 times a year I eat MJ and Nitrous Balloons   (real good combo)</p><p>We (wife and I) decide to go seperately so we could keep an eye on each others state. I get to go first...</p><p>Planned the day, my birthday. Early lunch, skip dinner. Positive attitude. Staying happy, doing little.</p><p>Japanese style room. ie. Tatami mat paper walls etc. Its where we live these days. Aircon set to 27degrees.</p><p>6:30 Chewed the first packet (1gm) grinding it carefully with my teeth to a fine mush and very aware of my state to notice any effects. None.</p><p>6:45 Chewed 2nd packet (1gm) grinding as before the taste of the mushrooms is strong but not unpleasant I think. Am I feeling a little numb?</p><p>7:00 Thinking must be dud crop. Well 1gm more. Chew away. Getting a little bored of religiously chewing  the mushrooms to a fine pulp...</p><p>7:05 The trip begins. Some body numbness. Open eyes nothing. Close the eyes and the image of the real world melts into something with a slightly sinester feel. Thoughts like I am actually now opening my eyes and peering into the real world. The mushrooms giving me the power of vision in this real world. Strange morphing creatures in the area, me in a glass cage in the dark. All weird and would normally freak me senseless but was happy and understanding of the whole thing. I think if I hadn't had my ever loving wife with me at that point it could have been a very different trip? This state lasted a while. Becoming stronger before changing into...</p><p>7:15 The good stuff starts. Everything swirling and merging, the music (5000 mp3's on my portable randomly selecting) picked out some Santana and I was just grooving in my mind. Wife was definitely helping with some nice physical inputs. I decided to concentrate on her for while, she tells me I did a good job there. But the physical effort seem to kick the mushrooms in even more. I went totally out to Godness. I believed that I was just looking into this world and that I had fully created it. Then I was there saying stuff like 'I manifested this body for you' and 'I manifested you for me'.</p><p>8:30 Just 'being love'. I seemed to just 'be love'. Only words for it. I stared at my wife and it was almost like her face was a mirror of mine. She looked like her but I saw her as me (part of me?) and I just smiled inanely at her.</p><p>8:45 Something by Kitaro came on and was very nice. I decided to basically put that on loop. There was an occasional Black Sabbath song coming on and it disturbed me a little. So, only Kitaro from now on. And some religious chanting track from free CD in 'Spirituality for Dummies' book.</p><p>9:00 Asking/telling wife lots of dumb questions. All seems trite now that I type it but at the time it was the most profound. But even then I was floating in and out. Sometimes I'd be saying something and float in and realise how trite it sounded. Other times I'd be saying something and float out and realise how stupid it was to be so limited. I seemed very aware of all the unnecessary rules I had inflicted upon this world.</p><p>Wanted to 'give' my body to my wife. At the time this meant she should use it for food. Not in a sexual sense, just cut it up and eat it. I thought she needed it to live. Wasn't a bad thing. Just a way to 'love' someone. Even suggested that there was a lot of me for one so perhaps a couple of her friends could have a meal too. A wish to be used fully, not wasted.</p><p>9:30 'I manifested food and hunger'. I had some really good tasting Cashews and Jelly (Jelly in Japan is great even without Mushrooms).</p><p>Eating, talking. Partially still convinced that I was the creator. But losing the conviction, suspecting that it was somehow related to mushroom eating.</p><p>10:30 Trouble now with temperature. Tried moving aircon up and down a few degrees always out of sync. This was an effect of the mushroom as wife didn't feel the need to play with aircon.</p><p>11:00 Floating in and out of mushroom land. Time to let go and come back. Not totally happy with the idea of returning. But now as I type this 14 hours later it seems right not to stay there... (Or at least I have a rule that that would be bad)</p><p>I am very keen to find out my wife's experience and hope I can provide her as great an environment as she provided me for my first trip.</p><p>I plan to do this again. Not sure whether I think we should do it together until we have had assisted visits a few more times. There were some amazing powerful thoughts that perhaps would get out of hand if someone were not there to temper them.</p>",
 "year": "2001",
 "id": "8825",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-05-19T07:00:00.000Z",
 "views": "5832",
 "dose": {}
}
