{
 "title": "All Systems Are Go",
 "author": "J. Spooky",
 "citation": " J. Spooky. \"All Systems Are Go: experience with bk-MDMA (Methylone), MDAI & Cannabis (ID 88261)\". Erowid.org. Dec 11, 2010. erowid.org/exp/88261",
 "substance": "bk-MDMA (Methylone), MDAI & Cannabis",
 "bodyweight": "140 lb",
 "report": "<p>Yesterday, I headed over to a friends house not sure what to expect, although I did know that four of my friends were doing about 1-2 grams of mushrooms each. I arrived and it was kind of quiet for a while until we got comfy and smoked some delicious ganj. We headed back to my other friends place to wait for about an hour, had some more tokes and then headed back to our original meeting place. The atmosphere changed pretty quickly, everyone was pretty positive about things and we watched some anime for a while. I was offered 100mg of Methylone, which I tried about a week beforehand at another party, and 100mg of MDAI.</p><p>I swallowed the first cap and began to feel the effects about a half an hour later. Most of what Ive noticed from the Methylone are feelings of relaxation; some claim that they feel nothing from it but I find it to be a mild, relaxing version of MDMA. I enjoy that the toxicity rates are considered significantly lower than that of MDMA and ecstasy [Erowid Note: While many ecstasy tablets are in fact not actually MDMA, 'ecstasy' as it refers to a drug is supposed to be MDMA, not a separate substance.], which were formerly my choice party drug and I have since made the conscious decision to do less of in order to focus on work and moving out in the next couple of months. Although no one else at the party was on either of the drugs I was trying, I had a lot of fun and was able to move around/dance with a decent amount of ease. The MDAI, which I took (100mg) dissolved in a glass of water about 45 minutes or so after the original dose of Methylone, added a nice edge to the high. It was more high energy and with the two of them combined I felt great. I didnt feel speedy, but was able to chat with my friends and function perfectly well both mentally and physically other than occasional sloppiness. I enjoyed the music (which ranged between Armin Van Buuren, ambient, and Mindless Self Indulgence) immensely and even danced a little bit, something I wasnt able to do on a combo of Methylone and Ethcathinone (Dancers). Again, this time, I neglected to eat very much beforehand and because of this I felt a decent amount of nausea throughout the high. I felt pretty snugly and loving throughout, happy to be in the company of my friends in a pleasant atmosphere.</p><p>My attention span waned probably more than my companions, as I was quite a bit more energetic and talkative, but I think I meshed pretty well with them. They werent high as balls on mushrooms as they hadnt taken a whole ton, but they seemed to be enjoying themselves nonetheless. Once again, everything I ate (a quarter of a pot cookie, piece of a pizza sub) made me feel incredibly nauseous and tasted of chalk. This is a large part of why I recommend eating before dosing up. I was toking quite a bit during this time, so it may have numbed my high out a little bit but I didnt really mind as I was enjoying the combination. The only downside to toking while I was high was that it made it more difficult to hydrate especially in combination with the nausea.</p><p>About an hour and a half later, I dosed up again, and I was feeling pretty shaky. I was noticeably high to everyone around me, especially my friend who came in later on sober. But once again, I didnt have a problem with it. Did some drawing earlier on in the evening as well, offered to paint on a few people but no one seemed to really be up for it. As the night went on, maybe four to five hours in, my temperature was changing a lot. I assume this is because I was having a hard time drinking water, and whenever I did, I probably should have made sure that it was kind of lukewarm. The cold water left an unpleasant feeling in my stomach. My high panned out pretty well after this with not too shabby of an emotional comedown. The only real issue I had was how sick I felt, and my inability to consume any small amount of food. Later on in the night, I tried to get some bread down (bad idea, by the way) and ended up throwing up in the toilet. Afterwards, I felt much better and was able to get a pretty good rest, something that I was not able to do with the methylone/ethcathinone combo.</p><p>Although I think I shouldve stuck to the first dose, I still had fun and the only thing that really brought me down, as I mentioned, was the nausea, rapid temperature changes, and my inability to eat. The headaches with this combination were much much milder than the dancers, so that was a plus. If one takes this combo and is not familiar with the effects of MDMA-like drugs then I would recommend starting out with 100mg Methylone and seeing how one feels afterwards. Everyone reacts differently to different drugs, and be especially careful if you mix Methylone with stimulants and are particularly sensitive. Try to stay hydrated, although it can be difficult at times, I experienced nausea and my friend agreed after taking the same drug later that night. I find that a water bottle or container that avoids spilling comes in handy, especially if with a straw. Also, pick up some gum; I experienced some lock jaw. I wouldnt recommend drinking in combination with this combo, considering the amount of nausea I felt. Trip safely and with good friends! Cheers!</p>",
 "year": "2010",
 "id": "88261",
 "gender": "Male",
 "age": "19",
 "timestamp": "2010-12-11T08:00:00.000Z",
 "views": "7136",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(capsule)"
  },
  {
   "time": " T+ 0:45",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1/4 ",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  },
  {
   "time": " T+ 0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 2:15",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": ""
  }
 ]
}
