{
 "title": "Cured My Bronchitis",
 "author": "pupil",
 "citation": " pupil. \"Cured My Bronchitis: experience with MImosa tenuiflora (ID 88270)\". Erowid.org. Feb 1, 2011. erowid.org/exp/88270",
 "substance": "MImosa tenuiflora",
 "bodyweight": "130 lb",
 "report": "<p>I have experienced chronic bronchitis many times in my life. Mostly as a child. This had been diagnosed by a doctor in my youth, so when I got it again last year I knew exactly what it was. When I get a bronchial infection it is very difficult to get rid of. Even though I have much faith in plant medicines, when given the opportunity I took an antibiotic to relieve myself of the symptoms out of pure convenience. Three months went by with no effect.</p><p>Then I was reading online somewhere about mimosa hostilis and juerma and related phenomenon. One of the sites had mentioned that some northeastern Brazilian tribes used the root bark to treat bronchitis. I had some root bark that I had previously purchased and I figured that it could not hurt. I made a tea and drank it each night for about a week. I was not careful about the amount used as I knew it would not be psychoactive and felt comfortable with this sacred plant being good for my body. After a week my bronchitis was completely gone. I have no doubt that the mimosa cured me.</p><p>It is easy to be amazed and curious about the psychoactive effect of these sacred plants. I have received many blessings from entheogens and the visual and synesthetic effects that facilitate healing. However, maybe it is time that we start experimenting with them as tonics. It would be much easier for skeptical people and 'non-believers' to use and appreciate these medicines in something other than a psychoactive manner. Once again the universe has proven to me that nature is the ultimate healer and that our brothers and sisters in the plant world are here to help.</p><p>[Reported Dose: '5-7 cups of tea']</p>",
 "year": "2010",
 "id": "88270",
 "gender": "Male",
 "age": "31",
 "timestamp": "2011-02-01T08:00:00.000Z",
 "views": "6015",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "(tea)"
  }
 ]
}
