{
 "title": "Too Mellow for Me",
 "author": "LoneSoldier",
 "citation": " LoneSoldier. \"Too Mellow for Me: experience with 6-APB (ID 88294)\". Erowid.org. Nov 18, 2010. erowid.org/exp/88294",
 "substance": "6-APB",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "95 mg",
   "oral",
   "6-APB",
   "(capsule)"
  ]
 ],
 "report": "<p>6:30pm Weighed and capped two 95mg portions of 6-APB powder.</p><p>7:00pm Partner and I swallowed the capsules, 95mg each.</p><p>7:45pm I'm feeling a +1. Very mild butterflies, but no placebo.</p><p>8:15pm Arriving at a +2. Definite warm rushes in chest and stomach, partner reports the same.</p><p>8:45pm We've peaked at a very 2C-like +3, but with significantly less body load.  Time has slowed and feeling very relaxed.</p><p>9:30pm Decided we are at a plateau in terms of intensity, still +3.  I can see some MD-ishness, jaw tremors, much eye-twitching.  Still mostly 2C-like.</p><p>11:30pm Both feel a decline in intensity, coming down.</p><p>1:00am Slowly dragging to a halt.  Definitely overstaying its welcome.</p><p>2:30am Partner and I are both asleep.</p><p>I have a lot of experience with chemicals in this family over my 15 or so years of off-and-on research.  I'll say it right out, 6-APB (please dont call it Benzo anything) reminded me far more of a 2C than a MD anything.  Very vanilla to me, like 2C-I - you know it's there, and it will be there for a while, but otherwise is completely unremarkable.  I felt no real euphoria at all in comparison to methylone, mephedrone or MDMA.  I felt no emotional push towards what I consider to be my happy e-space. </p><p>I've heard a lot about this being an entactogen, and I call bullshit.  I felt rather numbed, like a there was a thin gause over my skin.  No tactile enhancement for me, partner concurs.  We had some excellent adult time, but what 6-APB lent to the experience was mental and emotional (if anything) and I had to go after it.  Concentration was very difficult, but when I found the right space, the head and body rushes were enjoyable. </p><p>This gave me no stimulation at all, and my partner and I both agreed that we felt lazily relaxed for the duration.  Amazingly enough, we both fell readily to sleep and I seriously mean sleep.  Deeper and longer sleep than I am ever usually capable of, and I woke up 13 hours later still feeling buzzed off the 6-APB.  Very uncharacteristic of substances in this genre (for me anyway).</p><p>Communication was easy, but decisions were impossible.  We spent hours channel surfing, tearing through all our on demand movie services and DVD collections.  Never could decide what to put on.  Same for music too.  Very frustrating logic loops that render one completely incapable of reaching a decision.  That usually only happens to me when I'm crashing from something.</p><p>I saw some very mild visual distortions, but nothing even close to a visual, though that's par for the course for me - I've seldom had much luck experiencing visuals.  Flickering, imbalances in light, colors maybe a bit more vivid.  Nothing so dramatic as breathing walls.  Only LSD consistently gives me visuals worthy of mention.</p><p>No urge to redose.</p><p>In summary, 6-APB is a decent RC.  Great for supplementing any extended outing or event.  Concerts would be cool, but I would use it for something more along the lines of a fishing trip, or a movie since this stuff lends itself well to relaxing.  Nothing that involves intense concentration or critical thinking though.  Honestly, I wouldn't buy it again.  Meph is way better for my purposes with a duration is much more suitable to my lifestyle.  6-APB just sticks around too long and offers too little for the time spent waiting for it to start and, in particular, finish.</p>",
 "year": "2010",
 "id": "88294",
 "gender": "Male",
 "age": "32",
 "timestamp": "2010-11-18T08:00:00.000Z",
 "views": "35317",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "95 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(capsule)"
  }
 ]
}
