{
 "id": 8839,
 "title": "Fake Wetness",
 "date": {
  "submission": "2008-07-05T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "D",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.2",
    "quantity": "1.2"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "1:15",
   "amount": {
    "unit": "g",
    "grams": "1.2",
    "quantity": "1.2"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "It has been a while since my trip, but I still remember it pretty well. The only thing that may be a little off is the times I report since it was some time ago.",
  "The night started out fine. 2 friends and I had planned to trip this night at my house, but somehow I got dragged into tripping at someone else's house. I had taken mushrooms two times before this night, and had pretty good trips. Those two times I went into the night excited and ready to go, and I was in very comfortable surroundings around people I was friends with. There was absolutely no hint of a bad trip those two times. This time was different though. There were about 8 or so people at the house we were at, most of which I wasnt very good friends with, just people I had seen around. I was decent friends with the guy who lived there and I would have been fine tripping around him, but the other people left me feeling anxious.",
  "I told my friends that I didnt want to trip here but I think my one friend was a little influenced by a girl he really liked, and she pressured us to stay. At around 11:00 pm or so, my friends and I started eating the mushrooms. Both of my friends ate all of theirs, but I ate probably a little less than half. I was too anxious to eat all of them in fear of a bad trip so I just kept the rest of the mushrooms in my pocket in case I had a change of heart later that night.",
  "At about 12:00 am my good friend and I walked outside for some fresh air and to look at the stars and the clouds in the sky. It was his first experience with mushrooms so there was a lot to talk about. At this point in time, being with my friend, and having the mushrooms that I ate start to shift my mood, I felt good enough to eat the rest of what I had left. At about 12:15 maybe I finished the 2.4 grams and was feeling pretty good because I made a conscious effort to stay around the people I was good friends with.",
  "At this point, maybe around 12:20, we went inside and got my other friend who was tripping to come outside and walk around with us. We laid on the driveway for a little bit, staring up at the sky. After a few minutes we made our way to the garage where a couple people were smoking so we smoked some cigarettes in the garage. I would say close to 12:30. I can remember the exact point in time where I started having OEV's. The garage floor was old and dirty and a film like coating covered the whole thing as it appeared to 'flow' around us. The visuals werent too extreme, especially compared to what I would experience later that night.",
  "After smoking, we went inside to listen to music and we were sitting around a black light talking and looking at some posters and stuff when all of a sudden I just got completely overwhelmed with the people around me and the experience, so I went upstairs to watch TV on the couch. I was basically alone except for when people would walk in and out of the house. I even tried to play Ghost Recon or Socom 3 or some game. I was pretty disoriented within the game, but I'm not too bad at those types of games so it wasnt too difficult to play, but I soon gave up on playing it.",
  "The next time my friends came up we went outside to smoke again. It might have been around 1:00 am now, and the visuals hadnt really changed much since we originally walked into the house. I walked out a little into the yard so I could call some people and by the time I got back we just went back inside. I stayed on the couch watching TV as I was still not ready to try and be around what seemed like craziness downstairs because most of the people were drunk and loud.",
  "By this time I was having the feeling of wetness all over me. I had experienced this before, but never so intense. It was around 1:30 when my trip started to take a turn for the worse. The OEV's and especially the CEV's were getting extremely intense, and I was also experiencing an intense body high. My anxiety had come back, and I soon felt like I was going to throw up.",
  "I'd say it was around 1:45 am when I curled up into the fetal position on the couch with a blanket to weather the storm. The entire couch felt like a dripping wet marsh, and it was entirely uncomfortable. Along with the annoying sensation of feeling wet all over and constantly rubbing the fake snot from under my nose and feeling my clammy hands (even though I realized I wasnt really wet) my nausea started to become even more intense. I never once felt the need to puke though. This was when I started noticing the clock on the cable box. I drifted in and out of my attempted sleep as seconds seemed like hours, and minutes felt like days. It reminds me of those scenes in movies when someone is tossing and turning in bed as they have a nightmare.",
  "I wanted to fall asleep but I couldnt escape the visuals. Sometimes it was actually better to stare at the walls instead of keeping my eyes closed because my CEV's were so intense. I started to fall into this loop of thought. I started to feel like I was actually puking even though I knew I wasnt, and it was the worst feeling I have ever had. It seemed like I was tossing and turning, and my *entire* body was puking into itself and everywhere, and in all of my thoughts. Its the closest I have ever felt like I was dying. Even though I was feeling wet, I knew for sure my eyes were watering intensely because I actually felt the tears come down my face and I saw and felt them when I wiped them away (as I had experienced in trips previously).",
  "A couple guys came in the house, and one guy I know who is a boxer was really drunk, and although he is a pretty good guy, I felt very threatened, and I feared for my life. Under no other circumstances have I felt the same way around him and the other guys. Instances like this pulled me back into reality once in a while as some people checked up on me since it was pretty obvious I was having a bad trip. These times were only followed up with a springing back into my alternate reality of despair and what seemed like eternal torture. I looked at the clock and knew I didnt have much longer to go. I knew it would take its course and I would return to normal, but 5 seconds later I would be back to thinking this was going to be my reality for the rest of my life.",
  "Then my good friend came up and sat with me. It was probably about 2:15 now (which felt like 10 hours later) and even though I was probably coming down, my friend felt like God and my savior. I was so grateful that he sat and talked me down and soon I was back to having a normal trip, and only a few minutes later my visuals were gone, probably no later than 2:30 am. I still felt immensely high. I had a few light traces once in a while for the next hour or so, and other than my stomach feeling horrible (it felt like I hadnt eaten in a week), I was blissfully high for the next 2 to 2.5 hours.",
  "In the time I came down with my friend, the 2 to 2.5 hours afterward, in the car on my way home with my two friends, and until 6:00 am at my house, I probably said more words than I have said in my entire life. My friends and I had very intelligent conversations about radical topics, and everything around me seemed so interesting and worth talking about. I took nothing for granted.",
  "My two friends eventually passed out a little after 6:00 and I went up to my bed and laid there until about 7:30 thinking about stuff before I could actually fall asleep.",
  "After I woke up that day and could reflect on the last nights events, I was happy I had a bad trip. Dont get me wrong, it was absolutely horrible, but it made me realize not to take life for granted, and I came to all sorts of other spiritual conclusions. Although I would never change the choice I made that night because I wouldnt be the same as I am today, I thought I would never try hallucinogens again, but since then I have decided that if every possible condition felt right, I might try it again.",
  "I would never wish a bad trip onto someone else, but I feel its an experience everyone would be grateful for afterwards. A normal good trip is fun, and can lead to some great discoveries about yourself or reality and life, but a bad trip just puts things into perspective."
 ],
 "erowid": {
  "id": "51841",
  "citation": " D. \"Fake Wetness: experience with Mushrooms (ID 51841)\". Erowid.org. Jul 5, 2008. erowid.org/exp/51841",
  "substance": "Mushrooms",
  "views": "3076"
 }
}
