{
 "title": "Adverse Reaction",
 "author": "1timeuser",
 "citation": " 1timeuser. \"Adverse Reaction: experience with DXM (ID 88410)\". Erowid.org. Dec 8, 2010. erowid.org/exp/88410",
 "substance": "DXM",
 "bodyweight": "155 lb",
 "report": [
  "<p>I was home for Thanksgiving Break and didn't have much to do. My grandparents were in town so my parents asked me to stick around the house rather than go out, as it's the one time of year I see them. Naturally, this got boring about half way through the first day. My bud stash ran out quickly, as did the percocet I had from when I got my wisdom teeth out. I was talking to my friend about new things to do and he recommended DXM. He told me it was easy to get and manageable.",
  "I went to the pharmacy and picked up some cough pills. I took all 20. all together containing 300 mg of DXM, enough to get me to a low level plateu; I figured that would be a good amount for my first time. It kicked in and I felt good, a little like being high. I layed down in my room watching some tv. About an hour in my head started itching pretty badly, which I expected because I did my research. The itching started to carry town my neck where I felt a gigantic puss-like lump where my lymph nodes are. My neck had swelled up about twice its normal size. It got to the point where I couldn't turn my neck sideways.",
  "I am a natural worrier, so I was freaking the fuck out. I was pretty high on the stuff so my reaction was intensified. My breathing became more difficult (probably a reaction to stress) and my stomach and back started looking blotchy. I scoured google for any sign of this happening to anyone else. I was literally about to wake my parents up and get them to drive me to the hospital.",
  "It turns out DXM can act as a histamine (blood clotter and inflammatory response inducer) in certain individuals. I popped a couple of benadryl and calmed myself down.The swelling went down overnight and dissapeared within a day. Once I calmed down and focused on my high it was fairly enjoyable, but nothing I would go out of my way to pursue. Then again, I didn't take a large dose. I hope that my experience will help someone else out in the future if they ever find themselves with a gigantic neck and a blotchy rash.</p>"
 ],
 "year": "2010",
 "id": "88410",
 "gender": "Male",
 "age": "18",
 "views": "3934",
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2010-12-08T08:00:00.000Z"
}
