{
 "id": 8842,
 "title": "Pieces of Everything",
 "date": {
  "submission": "2008-07-02T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Leafybug",
  "gender": "Female",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "400",
    "unit": "mg"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "tar/resin",
   "specific": "Hash"
  }
 ],
 "report": [
  "I had wanted to try Salvia for a long time. I had read stuff about it and heard reports from friends and it seemed unbelievably interesting to me. I had never previously tried any hallucinogens and didn't fully understand how intense the trip would be. I thought that it would be a lot of pretty pictures coming at me and playing like a movie in front of me. This was not the case, however.",
  "My friends and I picked up a gram of 20x extract and got ready. We put a little piece of hash in the bottom of the bowl of my friends pipe to keep the Salvia from falling through, and put about .4 of a gram of salvia on top of that. You have to smoke all of that in one hoot. My friend told me.",
  "My friend went before me, and after seeing him on it I got shaky and very nervous. We refilled the pipe and it was my turn. I took a lot of deep breaths and gave my two friends hugs before I took my hoot. I kept the lighter on the salvia for the entire duration of the hoot. I sucked in until I felt my throat start to burn, held it in for about 20-30 seconds, coughed, stood up, noticed my body felt like it was tingling all over, and stumbled back down onto the bed. This was the last thing I remember before I started my journey.",
  "I looked up at my friends, whose heads became the sails on two sailboats that were on a chalkboard. The chalkboard tilted and I instantly remembered seeing that exact same thing before. I forgot that I took the Salvia and thought for a moment that I had gotten high off the Salvia smoke in the room. I was so out of it by now that I didnt know what I was doing. Apparently I yelled I took the salvia! and lunged toward my friends hand, where the pipe was, grabbed the pipe and started waving it around. I remember trying to see if there was any Salvia left in the bowl.",
  "All of a sudden I was a piece of a letter on the page of a book. I tried to rip off of the page and then I became a piece of someones ear. Then I was a little piece of metal hanging off of a long strip of metal. These visions are very vague in my memory, but the next part is very vivid.",
  "I became a piece of rubber and I was trying to rip myself apart from the other pieces of rubber that I was attached to. I then realized that I couldnt because I was attached to a living thing and if I ripped apart it would hurt. I felt trapped, and then it seemed like all of the other pieces of rubber on the thing were trying to rip off too, and they were succeeding but I still couldnt. I remembered being in that position before, and it scared the crap out of me. All of a sudden I could see the room again, and my two friends, but I couldnt recognize them, and I felt as though I was attached to the wall and couldnt get free.",
  "One of my friends tilted his head to the left and asked me if I was okay. I said no and then looked at him again and he was up on the wall, his body was shaped like some kind of weird cartoon bug or something and his head was huge. My other friends head was attached to the wall opposite the one I was attached to, and there were swirling colors all around.",
  "Then I was sitting on the floor, my two friends were also sitting on the floor in front of me, and every time I looked at something I would see a picture fly out of it. I kept seeing indescribable little movements and pictures in the room, all of which I recognized, but couldnt remember where from, and I remember thinking that it seemed like every little thing and every person, animal, plant, everything, was really a piece of something else in another reality.",
  "My first Salvia Divinorum trip was the most intense thing I ever experienced, and it was so out of this world that I dont even think that I have explained it to even half of its actual magnitude. I look forward to trying it again."
 ],
 "erowid": {
  "id": "51856",
  "citation": " Leafybug. \"Pieces of Everything: experience with Salvia divinorum (20x extract) & Cannabis (Hashish) (ID 51856)\". Erowid.org. Jul 2, 2008. erowid.org/exp/51856",
  "substance": "Salvia divinorum (20x extract) & Cannabis (Hashish)",
  "views": "3119"
 }
}
