{
 "title": "A Long Lost Friend",
 "author": "Akmir",
 "citation": " Akmir. \"A Long Lost Friend: experience with Cocaine (ID 885)\". Erowid.org. Oct 29, 2000. erowid.org/exp/885",
 "substance": "Cocaine",
 "bodyweight": "290 lb",
 "report": "<p>It started out innocently enough. An old high school buddy was visiting from out of the country, where he is attending college. We were both on winter break for a month and of course decided to do some partying.</p><p>We met up with another high school buddy, who had stay behind and was heavily into the local drug scene. After drinking beer out by the volcanoes, we decided to go back into town and see what else we could dig up to do.</p><p>We went by a dealer's house to see about picking up some dank weed, but upon entering his house we discovered another entirely different prize waiting for us.</p><p>I had not done cocaine in well over two years. My junior year in high school it came briefly into my life as a way to get homework done, but after losing a $100 bag of it I decided that I was ordained to quit.</p><p>I was drunk and stoned at the time and so had few inhibitions left to stop me from taking that first line of coke. It was like I had found a long lost friend. The euphoria hit me hard and almost instantly. I was buzzing and happy, going so strong that my fellows were tempted to punch me to get me to shut the hell up.</p><p>I remember I kept talking about how it had been far too long, far too long since I had brought cocaine into my life. I made arrangements to buy a 2-gram bag that evening, and after scrounging up money and dumping my bank account I had enough to go get it.</p><p>The first bag lasted me almost three weeks. Then I promised myself that when I ran out I would not do it anymore. But then the bag ran out and I was so sad I had to go hook up more. I finished that and swore I would quit.</p><p>Then the dreams started. I would have them almost every night. I was afraid to go to sleep because of them. They were always the same, hooking up with my friend and buying a large quantity of coke. The dreams ate at me until finally I gave in and bought over 6 grams of coke.</p><p>Once that was over I promised myself that I would quit. I did for a little while. The dreams didn't come but my mind kept demanding more coke. It would just all of a sudden decide it wanted it and would not let me do anything else till I had a bag in my hands and a line up my nose.</p><p>Every major and minor event in my life became another excuse to buy cocaine and do it in a binge of one night or sometimes I would make it out of the binge with a gram or two and it would last me several days to a week.</p><p>I would stay up all night snorting line after line. Then run out sometime in the afternoon of the next day and need more to appease the pain I was feeling for lack of sleep and way too much cocaine.</p><p>I started taking a special type of cocaine cut with a small quantity of methamphetamine, which made the euphoria last longer and reach greater heights.</p><p>Soon the paranoia, depression and hallucinations would start in on me during a binge. But I continue doing it to this day. Now, almost a year after I swore I would quit, I still find money for a couple bags every other week or every other day at times.</p><p>The mindset you get into in a binge is amazing. I remember sitting down and cussing my nostrils because one was so blocked up no coke could go up so I had to use the one that was bleeding. Instead of stopping the coke for a while to heal, I pushed it up the wounded nostril and ignored the intense sting it caused.</p><p>I still wake up in the mornings and swear off the 'demon powder' when my nostrils are burning so much that I can hardly stand it and have to pour water down my nose to cool it off, which of course does nothing.</p><p>Coke can be a great drug. It is a lot of fun and the quality of the high, while short, is so intense and pure that it drives you for more. I never have physical withdrawal symptoms, only intense mental drives that willpower can hardly fight, and often can not fight at all.</p><p>If it was unavailable or I had no more sources of money, quitting cocaine would be a relatively simple and fairly painless exercise. But one thing I can say for sure about the thralls of a binge, is that as long as you can get it, you will. Even if it leaves you broke and homeless.</p><p>In conclusion, I would not recommend cocaine to people with obsessive or addictive personalities. And those that do decide to try the drug, be careful you do not allow your mind to convince you of the safety of the drug, and that 'one more bag can not hurt.'</p>",
 "year": "2000",
 "id": "885",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-10-29T07:00:00.000Z",
 "views": "10609",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
