{
 "title": "I Made It Through",
 "author": "Spin180",
 "citation": " Spin180. \"I Made It Through: experience with GHB (ID 8850)\". Erowid.org. May 12, 2004. erowid.org/exp/8850",
 "substance": "GHB",
 "bodyweight": "175 lb",
 "report": "<p>I wanted to contribute my experience with GHB. Let me start by saying that I will NEVER touch GHB again, or any other related products. I started using GHB because I read that it was a good substitute for alcohol. At the time, I felt I was drinking WAY too much. I wished that I would have just continued drinking after the experience I had with GHB. I found a website selling a 'GHB' kit. I purchased one and soon after, made up my first batch of the clear liquid. I started with a light dose and gradually had to increase the dose to get the desired effect after a period of time. I began bringing the liquid to work with me and keeping it in my car. I remember everything I used to do to try to convince myself that I did not NEED the GHB, I was just 'experimenting'. Yet, I told no one about GHB and my 'experiment'. I knew that I had a problem, but I could not think clearly. I even mixed it with alcohol a few times...I am surprised I am not dead.</p><p>It got to the point where I made sure I always had 1 or 2 back up kits so I would not run out of my 'treasure'. I remember waking up at a party that I went to and....I do not remember anything else. I knew at that point I had better quit. I had embarassed myself beyond belief. People at the party had almost called me an ambulance. I thank God above that they did not call for medical attention. I also thank God for still allowing me to be alive. I remember sitting on my couch the very evening I quit GHB. At first, I became uncontrollably shaky. I could not stop my hands and arms from moving. I then began to hallucinate. I felt that there were people watching me and when I would look, they would disappear. I remember hearing sounds of things that were coming from nowhere. I craved a small dose of GHB....just to ease my pain, but I did not give in. I remember drinking a 12 pack of beer so I would fall asleep and hopefully awaken and my torment would be over.</p><p>Bottom line...I made it through. I know that I probably was not even 1/10th as addicted as other individuals, but I still had one heck of a time coming off of the GHB. I urge everyone NOT TO TRY IT. It is not worth it. From that day on, I really began to believe in God and his plan for me. I almost killed myself more than once with GHB. Whether I mixed it with alcohol or took too much...I made some very poor decisions. Do not make the same mistake I did. Be smart...stay away from GHB. Life is great without GHB.</p>",
 "year": "1998",
 "id": "8850",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-05-12T07:00:00.000Z",
 "views": "15754",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "GHB",
   "form": "(daily)"
  }
 }
}
