{
 "id": 8852,
 "title": "Ecstatic Dancing",
 "date": {
  "submission": "2006-07-21T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Psymon",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "insufflated",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Sunday I woke up early and got my chores done. I had a light breakfast of toast and spirolena smoothie. Around 10 a.m. I showered and took a shit. After I got ready to go dancing I laid out a short, 5 mg. line of 2C-E and sniffed it off the mirror.",
  "That was @ 10:15 a.m. I brushed my teeth and picked a flower and walked down the hill to hitch hike to Kalani for Ecstatic Dance.",
  "On the way down the hill I felt my heart race a bit, like if I had a cup of coffee or tea. I could feel it in my system.",
  "The ride seemed dreamlike and smooth, conversation with the driver easy. I kind of floated into Ohana center, the money spilled out of my pocket, the ink seemed to flow out of the pen on to the sign-in sheet. I stretched and felt a smile cross my lips...people were looking interesting.",
  "The 2C-E gives me just enough lubrication to easily flow into a comfortable dance, moving with the dancers around me, in unison, like seaweed in the tides. Its fun and easy to look into their eyes, they look sexy but exposed. I can see their beauty as well as the details of their faults. These people are my friends we dance together every week...but this day they revealed much more, all their rhythms and passions were splashing about. I could see the rejection and the acceptance.",
  "Afterwards it was easy to flirt, the whole experience lasted maybe 3 hours, with an easy come down, no hang over. I felt more energetic that day at the drum circle at Kehena, my appitite was somewhat suppressed. But I easily ate dinner at 5 p.m. and went to bed at the regular time."
 ],
 "erowid": {
  "id": "51878",
  "citation": " Psymon. \"Ecstatic Dancing: experience with 2C-E (ID 51878)\". Erowid.org. Jul 21, 2006. erowid.org/exp/51878",
  "substance": "2C-E",
  "views": "4085"
 }
}
