{
 "title": "Glowing Universe",
 "author": "Zami",
 "citation": " Zami. \"Glowing Universe: experience with Mushrooms (ID 8856)\". Erowid.org. Jun 3, 2004. erowid.org/exp/8856",
 "substance": "Mushrooms",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "10 ",
   "oral",
   "Mushrooms",
   "(fresh)"
  ]
 ],
 "report": "<p>My first mushroom trip was out of curiosity. I had heard a lot about magic mushrooms on trips through Asia and never could get my hands on any. I finally found some in Hawaii, picked them in a field full of cowshit. I had no idea what to expect, knew nothing about psychedelics and was totally open for any experience. I took about 10 of the foul tasting things with my boyfriend at night and we went to the beach. Nothing happened for an hour and I though, yeah right, cruel hoax. Then suddenly, a tiny town on the other side looked to me like Rio the Janeiro. I kept saying Rio, look there's Rio. It was only a few houses... I started feeling absolutely wonderful and the world around me started to move and glow. Shadows were moving in the night, things like huge red crabs seemed to run on the beach, and the ocean was completely round around me. So was the sky. Stars had tripled and the moon was blue and pulsating.</p><p>My friend's voice sounded funny like a clown and I kept laughing and laughing and found him so utterly amusing. He was an experienced tripper and wanted to guide me - kept babbling stuff into my ear like Timothy Leary - I understood nothing at all - I was just drifting in a glowing universe feeling happy like a 3 year old. Then the colours changed. My friends face turned red, blue, green and changed in size. Suddenly he was huge like a giant. We were 2 colourful glowing beings surrounded by a round starry sky and a round ocean. We walked into the water, it felt amazing and warm. And round of course. We saw sparkling blue luminous dots floating in the surf and picked them up on the beach and tripped on them for what seemed hours. I don't know what they were, so we called them hawaiian crab turds and had a blast. I think it was plancton. Never saw the glowing stuff again. It was pulsating and full of life. We also listened to music on a cheap cassette player and it sounded like an orchestra. I could hear each instrument by itself. Amazing.</p><p>Then came the patterns in my brain. Colourful chaos images moving around like a kaleidoscope for what seemed to be a lifetime. I was in another world but still here. The universe was glowing and functioning perfectly. This state of bliss lasted the entire night, we came down in the morning and I could hardly believe over 8 hours had passed. I had lost all concept of time. I felt a slight glowing for a few more days, everything had green trails. The experience definitely changed my life, I repeated it a few times with mushrooms and LSD and always had the same glowing trips (LSD had the same effect than mushrooms on me but lasted over 13 hours!). After that, I kept trying to find that true romance and beauty in everyday life and failed. So I got frustrated and felt cheated by acid.</p><p>10 years later I feel like I'm still out there looking for a non chemical trip and I came to the conclusion that I wasn't cheated. I experienced another level of consciousness I can now use at will to see the universe more clearly and find more meaning in my life. Of course most people I know have not had this experience and cannot relate to it. They find it scary and weird, but I find it scary to believe in only what we see and think there's nothing more to life than meets the eye. THERE IS! 'Check it out, the universe is basically a safe place' (Tim Leary)</p>",
 "year": "1991",
 "id": "8856",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-06-03T07:00:00.000Z",
 "views": "6851",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "10 ",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  }
 ]
}
