{
 "id": 8858,
 "title": "Fun on the merri-go-round",
 "date": {
  "submission": "2008-07-02T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "PhilosophyByNumbers",
  "gender": "Male",
  "weight": "148 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>Mindset: depressed with some very severe social anxiety, but not so much anymore. I've been fighting this for about 10 years now and just recently started treatment of it, which has ended up so far as 200mgs of Zoloft per day. Lately I've fallen into a very desperate and hopeless hole and I'm trying to dig myself out.",
  "Dosage: 200 mgs of Zoloft were taken about 18 hours prior to this experience, I smoked 1 bowl of Salvia and meditated for about 15 minutes.",
  "I started exploring psychoactive substances about a year or more ago and I've tried mostly mild things with the exception of a few very high dose DXM trips. Alcohol, dextromethorphan (my best friend), cannibis, LSA (morning glory seeds), hydrocodone (my other best friend), a lot of caffeine, and a couple diphenhydramine trips. ",
  "I have tried smoking Salvia about 8-9 times at this point, and I'm still trying to reach where I want to be with it, building my relationship with this plant slowly and steadily. My previous experiences resulting in a very strange, but subtle change in people's voices and a grayness to everything, with not much of anything else. Two of these times I had smoked cannibis previous to the smoking of the salvia and had much different effects. The room would spin and I would become very disoriented and have maybe a few CEVs. One time I became lost between my computer room and my bedroom, and there's only a space of 2-3 feet between them.",
  "I've come to the conclusion that the reason I'm not reaching effects is because I have not been smoking it correctly, inhaling and exhaling it too quick, and I've read that Zoloft mixed with LSD and some other psychedelics seems to diminish the effects greatly, so maybe this has something to do with it also. I've tried 5x, 10x and lately I've been using 15x. Every time I have done it, it has been with other people, or more often, my faithful and very loving girlfriend. This is my first time doing it alone. I figured the typical 'Well I haven't gotten much out of it so I'm sure I'll be fine'. WRONG.",
  "At home, alone, in my large open living room, I begin mentally preparing myself for something I know beforehand I won't be ready for. I clear a space on the floor and lay down pillows, and a blanket. I turn on some ambient techno and 2 blacklights, the rest is completely dark. Laying down, Meditating. Letting the music flow through me and breathing very deep and slowly I become completely calm and clear-headed. I start to feel a tingling sensation through my body as I exhale similar, yet more profound than, other meditating sessions. I continue this for about 15-20 minutes and then sit up slowly and prepare my pipe. I take 3 larges pinches of salvia and completely fill my pipe. I take a few deep breaths and get ready to visit salvia once again, strengthening our relationship further. I lit the pipe, inhaled and held it in. 5-10 seconds later the room starts spinning again. I try to take another hit but realize this is impossible and put the pipe down while I could. I manage to lay down quickly and the spinning continues.",
  "Quickly the room turns to an outside setting. The sun is out and shining on the healthy green grass and I'm spinning. I look around me and there are maybe 8-9 people looking at me and smiling. I realize I'm on one of those wooden merri-go-rounds that are often seen in parks! I could hear the people laughing and they were yelling for other people. I couldn't make out what they were saying but the one guy kept trying to get me to stand up. This man was very detailed and clear to me. He had a white shirt on and jeans with brown medium length hair. I stood up and started walking around the merry-go-round with these people. I started to feel afraid. I felt the presence of my girlfriend and a few of my friends and I thought, what have I done to myself? I wonder what they are thinking about me walking around in this state?",
  "I looked down into the wooden merri-go-round and saw my carpet and my balled up blanket and I realized I wasn't laying down anymore. At one point I had thought that I had left my body. I tried to reach the blanket and either re-enter my body, lay back down but there was no way I could do this while the merri-go-round was still going! I now thought these people were in my living room walking around in circles and I thought why are these people here?! I wished they would go away. I remember walking towards my entertainment center and leaning against the tv and everyone was gone, then I would turn around and there they were again. Eventually I was able to lay face down on the pillows on the ground so that I could no longer see anybody, and I started to get CEV's very much comparable to CEV's I would get with DXM. Bubbly, gooey, moving, flowing colors.",
  "The peak of the trip subsided and I flipped over on my back and kept my eyes closed and just listened to the music and watched the colors go. I opened my eyes for a moment, sat up, and the visuals were gone, no more people, no more merri-go-round. I was still a little disoriented with the room slightly spinning but not even close to how much it was, and I realized that I had been walking around, and when I was I must have knocked over my ash tray, which was on a cd case which was on the ground (dumb idea, I know). The bowl, tray, salvia and lighter were scattered. I was able to salvage the salvia and clean it up somewhat and I saw that there were 2 black marks on the carpet, one was a pile of ashes and the other I perceived to be a burn mark. I picked up the pile of ashes. When I picked up the bowl, all of the contents were burnt. I didn't know I could inhale a whole bowl of salvia in one hit. I don't remember exhaling.",
  "I decide to lay down til the effects completely wear off. I close my eyes again and I see random images. I normally hallucinate even when sober, but not very often. This is what this seemed like. I saw a woman with black hair sitting at a desk, she looked up then disappeared, I saw a train shooting down tracks, I saw a large box hanging from a ceiling, and other things but I fail to remember them. this went on for maybe another 10 minutes or so when I decided to stand up. I could still feel it a little bit but I could tell it was ending. I turned on a light and looked at the carpet where I saw the burn mark. It wasn't there.",
  "I remember the first time I smoked salvia I was holding the lid of a container shaped like a star. After I hit the bowl a few times I closed my eyes and the image of the star shaped lid was still there, but flowers were growing from the edges of it and then it started spinning. I think that this might have caused the spinning in my future experiences, resulting possibly in the merri-go-round.",
  "This was the most intense experience I've had with salvia yet, and I plan on continuing with this wonderful herb further, but possibly never without a sitter again. This could've ended bad. Be careful.</p>"
 ],
 "erowid": {
  "id": "51891",
  "citation": " PhilosophyByNumbers. \"Fun on the merri-go-round: experience with Salvia Divinorum, (15x extract) & Setraline (Zoloft) (ID 51891)\". Erowid.org. Jul 2, 2008. erowid.org/exp/51891",
  "substance": "Salvia Divinorum, (15x extract) & Setraline (Zoloft)",
  "views": "5364"
 }
}
