{
 "title": "Spiritual Ecstasy",
 "author": "Crenshaw",
 "citation": " Crenshaw. \"Spiritual Ecstasy: experience with MDMA & Magic Mushrooms (ID 88584)\". Erowid.org. Jan 5, 2014. erowid.org/exp/88584",
 "substance": "MDMA & Magic Mushrooms",
 "bodyweight": "275 lb",
 "header": [
  "DOSE: T+ 0:00",
  "2 tablets",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 0:00",
  "0.5 tablets",
  "insufflated",
  "MDMA",
  "(ground / crushed)",
  " T+ 1:00",
  "1 tablet",
  "oral",
  "MDMA",
  "(pill / tablet)",
  " T+ 1:00",
  "0.5 tablets",
  "insufflated",
  "MDMA",
  "(ground / crushed)",
  " T+ 2:00",
  "2 g",
  "oral",
  "Mushrooms",
  "",
  " T+ 2:30",
  "2 tablets",
  "insufflated",
  "MDMA",
  "(ground / crushed)",
  " T+ 3:30",
  "4 tablets",
  "",
  "MDMA",
  "",
  " T+ 3:30",
  "12 g",
  "oral",
  "Mushrooms",
  ""
 ],
 "report": "<p>Intro</p><p>I suppose a lot of people enjoy trying to push the boundaries to see just how high they can get and this was the mindset I had leading up to this night. It started out by me getting paid and calling my dealer to see what he might have in store for me. I wanted to reach new levels of consciousness and really explore my mind and different perceptions. I was into experimenting with pretty much anything I could get my hands on, whether it be for mind expansion or just to have a good time and party. My roommate and I would try to find a different drug to experience almost every weekend or at least fall back on our favourite, ecstasy. We tried acid a few times, mushrooms, coke, salvia, mdma, and ecstasy all on multiple occasions. I was not on any kind of prescription meds or drugs at the time other than being a stoner. I had a pretty bad acid trip that left me feeling depressed and paranoid a few months previous to this and was really looking for some sort of answers. I was delighted to find that my dealer still had these quite potent 'B.C. goldcap mushrooms' which we had tested 2 weeks previous. When we tried them we each ate a 1/8th of an ounce and I experienced what I considered comparable in potency to a hit of LSD. He also had some ecstasy pills that I had tested a week previous and found to be fairly weak.</p><p>Experience</p><p>I decided I would stock up a little bit on supplies, since I had just been paid, and bought 10 ecstasy pills and an ounce of mushrooms. It turned out my roommate had to work the next day so I was going to be on my own. My plan was to get a nice ecstasy buzz going and then eat a bit of mushrooms to see what would happen. This is not how my night transpired.</p><p>Since I knew the ecstasy was fairly weak and I would need at least 3 pills to get me to the high I was looking for I swallowed two and snorted half of another one, leaving the other half to snort as the night went on. After watching t.v. for about an hour or so I really felt the pills kicking in. Strong waves of euphoria and excitement. It was like experiencing the rise and falls of a roller-coaster without leaving my couch. I felt very empowered and confident. The idea to go far beyond what I had experienced in the past was not even debated and as soon as the thought entered my head I went and snorted the other half of the pill from before and also swallowed another one.</p><p>At this point I had completely forgotten about the mushrooms and went to my room to listen to music. Over the time of about another hour or so every song became better than the last as I progressively got higher. At some point I had remembered the mushrooms and decided to eat a small amount (maybe 2 grams) then went back to listening to music and waited for them to kick in.</p><p>After a certain amount of time (I would guess around 30 minutes) I really began to lose control of myself. I was feeling a new kind of high that I had never felt before, a kind of mindless euphoria. My body felt so strong like I was invincible. I went to the kitchen and ground up two more pills and snorted them without thinking twice. Then I brought the bag of shrooms back to my room with me and started eating them like chips while listening to music. Over the next 1-2 hours (estimated) I remember snorting more pills and finishing the half ounce bag of mushrooms. I felt amazing rushes of excitement in anticipation of how high I was going to get. At this point it was around 11:00pm.</p><p>The next part of my experience is what I believe to be the most important and interesting and is the reason I wanted to post this. When the mushrooms started kicking in everything changed. I was tripping hard but everything was perfectly understandable and clear to me. This was a new state of consciousness that I have never felt before or after. I am not a religious person but I have always had a very curious mind when it comes to spirituality. This trip proved to me there is something more powerful than me out there, or in me. I was listening to the Prodigy album 'Fat of the Land' when my perception really started changing. The songs started speaking to me in a very clear way and started pulling emotions out of me. The lyrics started telling me that a higher form of conscious believes that what I am doing to myself by taking all these drugs at once is dangerous. The lyrics 'serial thrilla' made me feel goofy and excited but then when he would say 'serious killa' I understood that he was telling me that I am killing myself. This was still fairly enjoyable and light, but also creepy. I knew 100% that I was making contact when the song 'Mindfields' came on. I never really listened to the lyrics in the past and brushed it off as an explosive energetic song about mine fields. But this night I understood completely that the lyrics 'this is dangerous, I walk through mind fields to watch your head rot' meant that what I was doing to myself was dangerous, I was in fact walking through mind fields and my brain is probably not going to be happy with me after it was over. Now when I say I was walking through mind fields I understood it as this; everything I perceive at one point in time is a mind field and every time I moved I was walking or looking into a different field. Looking at a keyboard was one field and looking at my dresser was another one, each had its own spot in my mind. I began to move around looking at different things in completely new light. At one point it became scary because I would turn 180 degrees to look behind me at my bed and I ended up still looking at my dresser 'this is dangerous'. I also started getting slight visuals, colour distortions, but nothing really spectacular. It was more of a vivid mind trip. I looked at my desk and saw two silhouettes of black objects. One object was an angel with its wings spread, reaching up to the sky. The other object was the thinking man, looking down at the ground. To me this represented two different emotions that I was feeling at the time. Everything that happened was exactly what I was thinking. Everything I heard and saw made perfect sense. The lyrics in songs were telling me exactly what I was thinking and what was happening. It was everything in my reality being completely understood and perfect.</p><p>After that my brain was beginning to overwhelm me; it felt as if it were overloading. I had to lay on my bed and that's when I started diving even deeper into this trip, to the point where I was only in my mind. I felt powerful emotions of responsibility and regret as well as feeling contact with people in my life. It was as if my spirit was talking to their spirit, one in particular was my dad telling me to be like him and follow in his footsteps as a family man. I don't know how long this went on for but this was defiantly the peak of my experience. Then I crashed.</p><p>After lying on my bed in a trance for who knows how long I started coming back to reality and decided I would watch some t.v. or something to lighten the trip a bit. I got up and turned the light off before I opened my bedroom door. This was a bad mistake. My brain was instantly wiped of all memory and thought when my room disappeared with the light. I stood there like a mindless zombie for a while before coming to the conclusion that I was dead. I repeated out loud to myself 'I am dead' multiple times before deciding to lie on the ground. I did not feel any emotions. I have no idea how long I was stuck in this black abyss but at some point thoughts started entering my head again. It was one chain of thoughts that got me out and I remember exactly how it went; why do I not feel emotion towards dying, probably because if I'm dead I won't have to go to work ever again, when was I supposed to go back to work?, I should check my phone to see what day it is *ding*. The light from my cellphone brought me back completely and I made my way to the living room.</p><p>From what I remember it was around 7:00am when I went out into the living room to watch tv. I threw on some old Kids in the Hall episodes which are a staple for me when I'm on drugs because of the nostalgia. At 8:30am my roommate got up to go to work and watched with me for a bit while he waited for his ride. He asked how my night went but every time I tried to answer him I just burst out in psychotic laughter. The only thing I could make out to him between laughter was 'I'm really fucking high'. I couldn't sleep until around 3pm but surprisingly woke up feeling pretty good (probably still high). There were only 2 pills left so I figured I did 8 in total plus the half ounce of shrooms. I believe that the body and mind buzz from the ecstasy cleared my brain enough for me to experience a truly powerful psychedelic experience from a completely different perception. I ate half an ounce of potent shrooms that on a normal 1/8th ounce dosage would have given me very powerful visuals, but this experience had almost no visuals at all. It was a complete mind trip. Although it was a very enlightening experience this night was dangerous and irresponsible for many reasons. I'm lucky nothing horrible happened to me since I could not control myself and I could have easily had a heart-attack or something all by myself.</p><p>What proved to me there has to be some form of higher power was when the next day I looked at my desk and the black objects were made out of random things that were piled on my desk and just happened to be in the shape of what I saw, like a tin cup filled with pens and scissors was the angel for instance, and they had the exact outline of what I saw the night before, they looked way too alike to be a coincidence. I've done acid and seen faces in the wall and then the next day it sort of still resembles it but this went way beyond anything like that.</p>",
 "year": "2007",
 "id": "88584",
 "gender": "Male",
 "age": "23",
 "timestamp": "2014-01-05T08:00:00.000Z",
 "views": "270",
 "dose": {}
}
