{
 "id": 8861,
 "title": "Dynamics of a Group",
 "date": {
  "submission": "2001-02-19T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "t9man",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "5:00",
   "amount": "4 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Set and Setting:  K had managed to procure a large amount of chemicals at once and it was decided that a one night blowout would be the way to go.  Nine friends including me gathered at my house at approximately 8:00pm.  All but three of us were going to indulge in the chemicals of one form or another, with the other three drinking and smoking throughout the night.  It was a very comfortable environment, and I as well as the others felt incredibly safe in our endeavor.",
  "8:20pm:  K, B, and I ingest one pill MDMA.  These pills are tulips and turned out to be quite good.  Ja, and Jo ingest 3/4 of an eighth of mushrooms each, and K ingests about half of that amount.  Everyone settles down in one of the two rooms available to us.  A perfect playlist has been set up on the computer for music, and both the living room stereo and the Pit?s stereo (this is a converted garage, now a game room) have been wired to the computer so that the music is syncopated everywhere.",
  "8:50pm:  First signs are in full effect.  Movement is slow and talking to friends is very pleasant.  I ingest 1 more pill MDMA and V ingests his first for the night.  Everyone is sitting on various couches in the Pit listening to music and talking about their previous experiences. It is Ja and Jo?s first time trying psylocibin, and they inquire about what they should expect.",
  "9:20pm:  Definitely feeling the force of the first pill.  I go outside with V to smoke a cigarette.  In a split second a wave flushes from my head to my toes. The second pill.  I can instantly tell that tonight will be intense. I had been fasting for twelve hours prior, which I always do.  I had also loaded up on Vitamin E.  The combination of all of these things greatly improved the effects.  If the surroundings were not completely comfortable to me I may have been worried about the amount of MDMA I had ingested.  V and I finish up and head down stairs to the Pit where everyone else is.  The scene has changed greatly since we left.  Ja and Jo now sit next to each other giggling and sharing sly looks.  As if there is some private joke that only they know.  B is now talking with a quick passion to everyone and anyone that will listen to him.  Many times Ja and Jo are asked how they are doing, but this only seems to aggravate them so they are left alone to enjoy their private showing of the melting line between sensory perception and reality.",
  "9:40pm: V and I go upstairs to be away from the people just hanging out downstairs.  We dance for about fifteen minutes in the living room.  It is decided that having the two stereos in the two rooms matching was a wonderful idea.  It is raining off and on outside and very lightly.  I propose a walk around the area, and V and B join in.  My apartment complex is laden with foliage, and the buildings are wood sided.  In the dark and the rain it becomes easy to only focus on the plants and trees.  I am reminded of how much I love being in nature, and what an incredible sense of serenity it can give me when I am receptive to it.  We return from the walk and I am covered in sweat.  This was definitely a very high dose for me.  Eye wiggles have set in to an almost uncomfortable level as my watch will not stop bouncing when I try to read the time.  It doesn?t bother me if I don't try to focus my eyes.",
  "10:00pm:  I go upstairs to my room and retrieve two glowsticks on strings that I had saved up for the occasion. I bring them downstairs and whirl them in a circle creating a band of light.  I hand one to B and one to Jo thinking he will enjoy the phosphorescent light.  However he  pushes it away. 'I'm not on X man. I don't want that.'  I take it back and play with it myself.  For the next hour we all sit in the Pit listening to music and watching the various lights in the room.  K, V, B, and I are talkative.  We stop to sing and smoke cigs every now and then.  At some point B gets up and begins to dance with the glowsticks in the middle of the room while everyone else laughs.  Though I realize the majority of the people are laughing because of B's silliness I find it incredibly delightful to see a friend of mine doing something that is making him incredibly happy.  Slipping free of those societal chains that say stupid things like: 'Don't dance by yourself.  Don't hug other men. Etc'  Ja and Jo sit in their own world almost completely uncommunicative, but obviously enjoying themselves.",
  "11:00pm:  I initiate another walk. This time Ja rouses himself from the couch and comes along with B and me.  We make a quick round of the complex and hurry home as the rain is starting to pour.  Upon my return I ingest approximately four small mushrooms.  Over the hour and a half we talk, listen to music, and smoke cigarettes. Every one of us enjoying every minute of this short vacation from the real world.  As the MDMA begins to decline in effect B, K, and I begin to have a few beers.",
  "1:30am:  K, B, and I ingest about four mushrooms a piece.  Ja and Jo are the only other people awake.  We sit in the Pit and talk, all the while listening to music that seems to only get better with each song.  Soon the walls begin to flex in and out in the room.  I am slightly hallucinating but the MDMA has put me in a mindspace to just sit and let it all soak in.  After about an hour I go upstairs to go to the bathroom.  I find it incredibly hard to walk.  Oddly, I don't feel the slightest effect from the alcohol, but I find it annoying that my body won't respond properly to the movements I'm telling it to produce.  The mood becomes very relaxed and all of us bask in the glow of a wonderful night winding down.",
  "3:30am:  Ja and Jo leave, and K, B, and I are the only ones still awake.  We decide to put in a movie to finish off the night as most of us are simply in a pleasant headspace with only minor visuals remaining.  At 4:20am K smokes some cannabis and B and I finish off the movie.  We make it to sunrise but it is still raining and there is no chance of seeing the Sun.  We decide that it is best to go to bed. Happy.  And content.",
  "Conclusion: In looking backwards it was an amazing mesh of different vibes.  They all blended extremely well and made the atmosphere one such that there was always something going on and something to go do or talk about with someone.  Everyone's personalities were nearly reversed and the complete flip from our normal routine was fascinating.  This is not a situation to reproduce often, but it was an amazing way to open new dynamics into our group of friends."
 ],
 "erowid": {
  "id": "5190",
  "citation": " t9man. \"Dynamics of a Group: experience with MDMA & Mushrooms (ID 5190)\". Erowid.org. Feb 19, 2001. erowid.org/exp/5190",
  "substance": "MDMA & Mushrooms",
  "views": "10178"
 }
}
