{
 "id": 8862,
 "title": "The Keep Kids Off Drugs Pill",
 "date": {
  "submission": "2010-10-10T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "AgentOrange",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.75 mg",
   "administration": "insufflated",
   "substance": "Pharms - Buprenorphine",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 1:30",
   "amount": "3.75 mg",
   "administration": "insufflated",
   "substance": "Pharms - Buprenorphine",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "After trying to aquire some stimulants with no sucess, my friends and I decided to get what our guy had, which were three pain pills of some substance I'd never heard of. Usually, I detest painkillers and other pharms that just space me out, also I like to research what I'm putting into my body, to know what to expect. He said they were 7.5mg, so my friend and I bought all three, thinking that if they were like perc we'd need more than that for a good buzz. The pills were imprinted with a crussifix on one side. Luckilly a third friend said he wanted to try it too. Otherwise I'd have been more fucked and all, feeling like I was slowly dying by puking myself to death.",
  "Seeing as I had no idea what this shit would do to me, I decided to snort half and wait the usual time it takes for pain pills to peak for me, about an hour and a half. At an hour and a half, it felt like a couple percocet. I felt like I was as high as I was gonna get from that half, so I swallowed the rest. My other two friends just sniffed the whole thing at once.",
  "There was a party going on and that was getting to be more and more overwhelming by the minute, so we decided to retire downstairs on the couches and watch Doctor Strange Love. By the middle of the movie, we'd all begun nodding, but I felt strangely very awake, not neccisarilly alert. By the middle, I had to slump down, because the slightest movements gave me intense nasea. When it movie was finished, my friend decided he was going to go to bed and we all agreed it was probably time to sleep off this horrible drug. The urge to vomit became stronger and stronger, and I figured 'might as well do this now instead of later'. After vomiting, I drank some water, and tried to walk slowly so as to let my stomach catch up with the rest of me, but the urge to puke came back again. Everyone started getting sick and just when they thought they were done, they came back for more.",
  "My friend and I walked home and the cool air was very refreshing and I hardly noticed how cold it was. When we got inside, we both felt sick again, and went to throw up more. Smoking cigarrettes also made me very ill. When I got home, I hopped online and discovered that this shit is like the LSD of painkillers, being effective at doses less than a milligram. It also lasted 24-72hrs, so we knew it was gonna be a long ride.",
  "We spent the rest of the night unable to sleep for more than a half hour at a time, intermitantly getting out of bed to throw up. We eventually got a few solid hours after the sun rose, and got out of bed at 3pm. We were still insanely fucked up on those pills. My friend couldnt handle eating any food, but I forced myself to. I figured it was the only way to get off this horrible drug. We just layed in bed, miserable, sick as dogs, watching movies and dozing here and there. By six, my nasea had disapaited to a tolerable level, and I could walk around fairly normally. We got some pizza and devoured the fuck out of it and by 10pm the effects were finished for me. My friends still remained sick for the next day.",
  "My conclusion is that one should never take a downer when they want uppers! Especially not something that is designed to treat hardcore heroin addiction. Id say that it'd be good to give to kids to freak them the fuck out and turn them off from drugs for the rest of their lives."
 ],
 "erowid": {
  "id": "51900",
  "citation": " AgentOrange. \"The Keep Kids Off Drugs Pill: experience with Buprenorphine (ID 51900)\". Erowid.org. Oct 10, 2010. erowid.org/exp/51900",
  "substance": "Buprenorphine",
  "views": "10768"
 }
}
