{
 "title": "Kratom-Induced Hepatitis?",
 "author": "nlogn",
 "citation": " nlogn. \"Kratom-Induced Hepatitis?: experience with Kratom (ID 88678)\". Erowid.org. Mar 7, 2011. erowid.org/exp/88678",
 "substance": "Kratom",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3 g",
   "oral",
   "Kratom",
   "(daily)"
  ]
 ],
 "report": "<p>In mid-October I began using kratom.  For the next two weeks, I used it almost daily, taking 3 grams of crushed premium leaf in the mornings.  The effects were subtle and positive.  It wasn't as obvious as opiates, but I noticed that my workdays were much more enjoyable, and my boss much more tolerable.</p><p>On Halloween weekend I suddenly became very ill and immediately stopped use.  I experienced fatigue and an extreme loss of appetite, along with a sharp pain in my abdomen.  I could not keep food down for the first week or so.  I became extremely jaundiced and, as is common with jaundice, my entire body was itchy.</p><p>The diagnosis of hepatitis was made when my ALT (liver enzyme) was measured at 500, which is around ten times normal.  Two weeks later after onset this number peaked at around 1400.  For completeness, my AST (liver enzyme, 40 is normal) peaked at around 300, and my bilirubin topped out at six (one is normal, this causes jaundice).</p><p>I have seen specialists about this illness and a cause (other than kratom) cannot be found.  I am an otherwise healthy female, and take no medication beyond the occasional allergy pill and tylenol.  Beyond the kratom, I had not consumed anything unusual prior to becoming sick.  I do not drink heavily or frequently, and my illicit use of drugs is limited to marijuana (once/month).   I've been tested for numerous viruses known to cause hepatitis, and all have come back negative.  More chronic causes of hepatitis, such as autoimmune hepatitis and Wilson's disease, have also been ruled out.</p><p>I believe, though I cannot prove, that kratom caused this illness.  Whether it was the kratom itself or some contaminant on the plant I cannot say (I should note that the vendor from whom I purchased it is reputable).  I have learned that there exist viruses that are known to cause hepatitis but are so rare that there aren't test for them, so that is still a possibility.  But it was more likely the kratom, as some herbal supplements are well-known for causing liver malfunctions.</p><p>It took approximately two weeks for the very acute symptoms to pass, and it was another couple of weeks  before I had my energy back.  It is now six weeks after the initial illness and I feel fine, though my liver enzymes are still slightly elevated.</p>",
 "year": "2010",
 "id": "88678",
 "gender": "Female",
 "age": "22",
 "timestamp": "2011-03-07T08:00:00.000Z",
 "views": "12668"
}
