{
 "title": "Smoking Two Different Species",
 "author": "Fenno-Aapo",
 "citation": " Fenno-Aapo. \"Smoking Two Different Species: experience with Mushrooms & Hashish (ID 8869)\". Erowid.org. Aug 20, 2001. erowid.org/exp/8869",
 "substance": "Mushrooms & Hashish",
 "bodyweight": "75 kg",
 "report": "<p>Never thought I'd be posting experiences here, but I ran into this 'Smoking Magic Mushrooms' section and the plea to submit a report...</p><p>It was earlier this year (2001), still snow everywhere when I was at this small private rave when a friend asked me to come and smoke some hash. He also had some leftovers of Finnish psilo (which are semilanceata I think), VERY LITTLE, one mushroom measuring about 2cm length, and bits and pieces at the bottom of a paper bag (I'd say around 0,1 grams). He added those to the hash-tobacco mix, and we went outside and smoked. There were four of us smoking. Suddenly, we were all giggling about at nothing, I wasn't stoned at all, and it felt like my brain was busting out of my head! So I just squeezed my hands tight around my head, bounced around the place, laughing, giggling. After a little running around the house, I sat down, still holding my head, and wondered (or wandered) a bit, feeling radiant and glowing. After about 20-30 minutes, all the effects were gone. But yes, there were NOTICEABLE effects. This was my first experience with mushrooms (I had eaten some before, with no effects).</p><p>Well, time flows like a river, and we're in the beginning of this (2001) June. I'm DJ'ing at a forest-party in the southern parts of Finland, and had acquired some Mexican psilo (got no idea what species). I had no idea what to do or what not to do with those, I never believed I'd live to see a Mexican mushroom, and there I was. Smoking Mexicans, once again with hash, once again a very small dose (0.1-0.15 grams), once again four of us, and once again, I didn't get stoned at all, but it was SO DIFFERENT from the Finnish psilo. My mind went very sharp, I felt like a razorblade, able to cut anything, solve any problem; a troubleshooter, a private eye or something. I didn't get giggly at all, it was very serious and straightforward. The effects were not strong, but somehow my soul was totally lost in the feeling. I smoked more 'shrooms two times at the party, each time doubling the dose, which after the last time lead to a lot of schizo-activity and complete fucked-upness (like jamming a candy in my left ear with my right hand, after a two minute call of nothing to say to a friend who was sleeping...). One thing I noticed, I was SOOOO tired before the party I thought I couldn't handle it, but the mushrooms took that tiredness away. I kept on going and going for 12 hours or so after the last smoke, and I stayed and helped the organizers clean up the place.</p><p>So, I had effects from smoking mushrooms, two different species of psilo from two totally different parts of the world. Next thing I'm gonna do, is to dry some Amanita muscaria, which is the best known and most frequent mushroom around here in Finland. Going to smoke it, I'll let you know later how it worked...</p><p>",
 "year": "2001",
 "id": "8869",
 "gender": "Male",
 "timestamp": "2001-08-20T07:00:00.000Z",
 "views": "19165",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis - Hash"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Mushrooms"
  }
 ]
}
