{
 "title": "Feeling of Death",
 "author": "widdles",
 "citation": " widdles. \"Feeling of Death: experience with Products - Spice and Synthetic Cannabinoids ('Judgement Day') (ID 88713)\". Erowid.org. Jan 14, 2011. erowid.org/exp/88713",
 "substance": "Products - Spice and Synthetic Cannabinoids ('Judgement Day')",
 "bodyweight": "220 lb",
 "report": "<p>I have been using a wide variety of differant brands of spice over the last 5 months but one stuck out as the most powerfull, it was called armaggedon: judgement day. It by far got me the highest the quickest.</p><p>I was sitting talking to some friends in my room while they toked on a dubby (cannibis) while I loaded about half a gram of judgment day into my pipe. I took my time. It was about 800pm. I was finished smoking around 815. I felt relaxed without a care in the world while I just watched my friends laugh and carry on. We decided to go out and watch a movie in the living room around 830. It wasn't long after we sat down when I felt a small burst of nausia hit me like a fucking ram in the chest. I became very aware very quickly that something was wrong as more bursts over took me and each time a small sharp pain in me chest would in tease. I decided to go get some air. I walked out side and sat on the bench. This made the bursts of pain go away but the nausia was slowly creeping up on me, I felt light headed and dizzy. Oh shit, were my thoughts at this point. I walked back inside and by the time I made it back to me room around 845 it became clear that the shit has now hit the fan and its going to take awhile to clean up. I sit at my computer and came online to see if anyone else has had the same problem and sure enough there was. Then I noticed a few links to deaths and hospitalizations. Probably what set the next chain of events off.</p><p>I got me wife into the room with me and I started to panic as the lightheadedness grew and grew. She tried to comfort me and I was contimplating calling 911 just before my legs gave out and I fell backwards onto the bed. My chest hurt again and for a moment I couldn't see shit, just pitch black and an unholy feeling in the back of my mind screaming 'your going to die!'.</p><p>Panic consumed me and I reached up to feel my pulse after my vision came back and the pain stopped. It was beating far faster then it should of been even if I was just scared. It gets better. Its probably a little after 900 now and my wife had her finger on the call button. Now to my pulse again. I managed to calm my self slightly and bring my pulse down a smidget but that was when I felt my pulse become weaker and weaker until I could no longer feel it. Oh shit. My wife confirmed This lack of heart beat and called 911, but I felt much better then before. Just as quickly as my pulse dissapeared it came back and had slowed to just above normal. My wife told the operator everything was good and I sat up. But my arms and legs started twitching.</p><p>I laid in bed until about 1000 twitching all the while. I can't say why I was twitching, I figured it was probably just the stress of the whole ordeal. But I couldn't stop no matter how much I willed it. It wasn't until my wife told me to think of my power animal, a rhino. Like fucking magic my body relaxed and could finally put my mind to rest.</p><p>Note I had smoked 2 grams of the same stuff at one time and this didn't happen and I have thrust my brain and body into oblivion dozens of times on any mind alter drug you can think of and I have never felt the terror I went toe to toe with that night, fuck... that.. shit.</p>",
 "year": "2010",
 "id": "88713",
 "gender": "Male",
 "age": "23",
 "timestamp": "2011-01-14T08:00:00.000Z",
 "views": "4993",
 "dose": [
  {
   "time": "DOSE:",
   "amount": ".5 g",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  }
 ]
}
