{
 "id": 8873,
 "title": "Permanent Damage",
 "date": {
  "submission": "2007-06-14T07:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Phact1",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "The first time I experimented with psychedelic mushrooms I ate one gram with fears I would have a bad trip. After long consideration I tried a dose of 2.5 grams and was pleased with the effects. I had a great trip, I felt in total harmony with my surroundings and me and my friends had amazing visuals. It felt like days as me and my friends sat around listening to pink floyd and looking at trippy patterns on the walls. After this trip I took on a new view of mushrooms, they werent so bad after all. All this talk about having horrible trips and going crazy didnt seen all that accurate. It was summer time and I had so much free time, I thought that I might do them a few more times while at the same time being smart about how high my doses were, where, and who I did them with. So throughout the span of about two month I did them a total of 4 times, once with 2.5 grams twice with an eighth and the fourth time I had increased to 4.5-5 grams. Three months later I did them for a fifth and final time with a dose of 3 grams.",
  "The reason I am writing this is because two years later, I am fifteen years old and experience intense visual disturbances along with occasional anxiety attacks and on and off depression. These effects had a very slow oncoming, but gradually got worse and worse. It started with the occasional floaters, a bit of static vision and the odd burst of color, but today it is much more severe. My everyday life is accompanied with constant flashes of color, geometric pseudohallucinations, halos around lights, illusions of movement, intensified colors, macropsia, micropsia, positive and negative afterimages, and static vision.",
  "Until very recently I had no idea what was wrong with me, many thoughts were going through my head and I constantly found myself asking questions. Shortly after these symptoms occurred I consulted 5 different eye doctors and eye specialists who all said the same thing - that there was nothing wrong with my eyesight, everything was fine. For a while, I had given up hope and thought nobody believed in what I was saying, even my own parents thought I was making the whole thing up.",
  "As you can image this put quite a bit of stress on me, and I found myself wondering what was really wrong with me. Paranoid thought ran through my head, was I dying? Did I have brain damage? Had I caught some foreign disease? Am I going to suddenly drop dead? I didnt know what to do. In the back of my mind part of me was saying it was from experimenting with drugs, but I never fully came around to talking about it. I had done some reading on the internet on certain types of seizures that cause similar effects on ones vision, but it really didnt feel like it fit my diagnosis.",
  "Over time I learned how to live with these problems, tried to ignore the things I know were really not there, and concentrated more on where my life was going. A few weeks ago I decided that there had to be other people who were experiencing what I am, and I got back on the computer. After many hours of reading different web pages I came to the conclusion that I had HPPD. To my surprise I found out that the most common way to get this mental disorder was from LSD, but it could also come from ecstasy, mushrooms, or peyote. Apparently, my condition is so rare that only less than 1% of all people who try acid will experience these visual disturbances. I have never done acid or peyote, and have only tried ecstasy once.",
  "I consulted my family doctor who then referred me to a psychiatrist. For the first time I was able to openly talk about my problems and seek the help I so badly needed. It still remains a mystery to me why I have gotten this disorder, when many of my friends have done the same mushrooms at higher doses many more times, and today they are fine. It could be something to do with my genetics or maybe just random luck. My doctor tells me that there are a variety of different drugs that could help me cope with my problem, mainly anti-depressants have been shown to work. However many of these drugs carry negative side effects and can become highly addictive. Some of these drugs cause dependency and a need for higher doses to produce desired effects.",
  "Since learning about my disorder, I have stopped smoking marijuana and cut down on drinking alcohol. Research has shown that things like marijuana, alcohol, anxiety, and dehydration are known to make these visual disturbances worse. As of right now I am unsure what choices I will make regarding treatment, but I will definitely consider some of these drugs that are known to help."
 ],
 "erowid": {
  "id": "51928",
  "citation": " Phact1. \"Permanent Damage: experience with Mushrooms (ID 51928)\". Erowid.org. Jun 14, 2007. erowid.org/exp/51928",
  "substance": "Mushrooms",
  "views": "7414"
 }
}
