{
 "id": 8874,
 "title": "A Tactile Wave Moving From North to South",
 "date": {
  "submission": "2002-01-11T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Valentine Dork",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "<p>One night decided to smoke 1/4 gram (250mg) of Salvia Divinorum 10x Extract. This was my first experience with The Sheperdess and I had only a general knowledge of its anticipated effects from reading EROWID experiences. ",
  "At precisly 7:00pm I filled a large glass peace pipe with exactly 250mg (1/4g) of the 500mg extract vial (recommended dosage is only 1/10th of a gram of the 5x extract for a novice)!  After adjusting the surrounding settings for comfort and safety I sat down in a foam chair on the floor.",
  "When I was finally ready I took one intense deep draw off the pipe in order to fill the rather lenghtly chamber densly with smoke.  I did not inhale directly while drawing off the pipe.  Instead I filled the chamber and waited a few seconds while keeping my hand on the carb and the mouth whole.  And then when I gathered up the courage I inhaled with the power of a high powered vacumm deep into my lungs. And then on top of that took another small gasp of air to force it deeper. Never exhaling at all!",
  "I held the LARGE amount of smoke for what felt like forever (probably just 30 seconds or so).  It tasted fine contrary to what I have read.  I am a seasoned smoker and like to hold it in for as long as possible, so when my 'babysitters' saw that I was not making any attempt to exhale I heard them say 'hey are you going to breathe or what?' So I gave them a quick glance to acknowledge what they had said and then suddenly just let it all come out.",
  "Before I had exhaled the entire amount of smoke it just HIT me without any warning. It was instant disassociation. The very bizzare thing was time seemed to pause before the commonly felt buzzing or tingling feeling slowly intesified.  I felt panic set in as I attempted to say something and tried to put the pipe on a nearby table. I could not get the words out. Vision was normal I could see everything clearly in the room.  As I tried to put the LIT pipe on the table my brain was having difficulty transmitting the proper signals to my limbs in order to put the pipe down. What I ended up doing was what felt like throwing my arms into motion.  With this increased attempt at movement I successfully fell of the foam chair and put the pipe on the table (without spilling)!",
  "All of this happened in about under a minute.  The 'babysitters' were staring and laughing (terrible tripsitters.) I was mumbling the words help me but I could not enunciate what I was trying to say so further panic set in.  This was all terrifying but what happened next made that pale in comparison.",
  "After ending up on the floor confused and terror struck I felt the pressence of Yerba Maria herself or whatever plant teacher is associated with Salvia.  Some say it is the Death Plant and I think I know why.  As the experience intensified I felt the buzzing vacumm feeling pulling me back and to my right into something I cannot explain. There was a visual, audio and tactile wave moving from North to South across the room and my body (I was facing East).  As this was happening I really got scared as I felt the left side of my body being engulfed by this wave and then I rolled away from it fearing being pulled into what I thought was sure death.  It was a wave just like the geometry of an unfolding chinese fan. ",
  "After I rolled away from my primary position I thought I had escaped the wave but I only moved a few feet to the South and a few moments later it was moving through my body again.  So now I was convinced I could not escape the wave or The Plant teacher (normally that is the last thing I would want to do is try to escape a learning experience).  I tried to keep a positive attitude about what was happening but I had never experienced anything this sudden and violently disassociative!! ",
  "Now this was about 1 minute and 30 seconds into the experience.",
  "I was able to form cognative thoughts about what was happening and one of them I recall was thinking how carelessly and disrespectfully",
  "I had approached this powerfull ethnogen.  And I believe that is most likely one of the reasons I had such a difficult experience.",
  "I stopped trying to escape and just allowed the wave to penetrate my mind and body. Another effect I observed as the movement progressed was a very clear mental image of the unabsorbed portion of my body sticking out of the unaffected dimension.  Then a pure human survival instinct kicked in, and I felt that if I did not (mentally) jump into the perceived unaffected portion of my body I would miss my only chance to get back to baseline and avoid death.  So I did just that in my mind and in reality (which just made those damn 'babysitters' laugh harder!)",
  "So basically I had to return to my body (or baseline or whatever) before the wave could complete its cycle. As I reflect on the experience the cycle almost seemed like a second hand or minute/hour hand was moving clockwise through its 360 degree cycle.  If this is true I jumped out of the cycle at the very last possible second, I knew this because I had that feeling of near tragedy averted.",
  "This experience lasted only maybe 4 or 5 intense minutes.  There were residual effects lasting for another half hour or so. ",
  "During the next few days I was very concerned and confused about what I had experienced.  I told myself I was never going to try it again.  About a day or so later after saying that I had to know what had happened.  So I decided to try again this time with nobody else present. ",
  "I decided to try and smoke just a very small amount.  Just a couple of flakes of the extract. I did so and it was a very pleast body high, no mental dementia this time.  So after a couple relaxing minutes of the physical buzzing and general euphoria I decided I could handle another large dose. ",
  "So I packed another 250mg (1/4g) 10x extract bowl.  Used the same deep inhale method and then WAM it was again instant dissassociation and exact same experience happened again this time with no one there to  watch me.  I was facing North this time and the wave moved South straight at me.  I saw the unaffected dimension again but this time it was an image of just the bottom half of my body sitting down.  So out of fear I jumped up off the couch and ran behind a dividing wall into the kitchen area. I could feel a strong pull from the exact place I had been sitting and I kept moving further into the Kitchen trying to bend the pull around the wall in order to break it.  It was quite strong and very real.  I could not break the pull and before I could even do anything else I heard keys being put into the lock of the front door.  Then I somewhat calmly thought 'it must be my roomate coming home' but I also had another thought.  Which was that I was not sure what was about to walk through the front door.",
  "I peeked around the corner of the dividing kitchen wall with anxious eyes (still being pulled by whatever the magnetism was towards my previous sitting position) at the front door swinging open very slowly.  My heart rate was through the roof.  I anxiously waited to see who (what) was coming in.  It WAS my roomate. When she walked in and the pulling sensation instantly stopped.",
  "The tactile wave stopped and I was left with only the buzzing euphoric feeling and a great relief that my roomate had come when she did.  The Plant Teacher I felt was again trying to either bring me somewhere or kill me, but when my roomate entereed the room I could feel The Sheperdess disappear quickly.  I went into the bathroom and collapsed on the floor in relief.",
  "This is an extremly potent and mysterious substance that I would love to study further...however I am concerned that any further experiments on my part will only lead to another similar experience so I am going to have to really contemplate whether or not I am willing to risk coma/death to study The Shepedess.",
  "I do not believe that there are any evil substances or plants on earth.  So do not want to say that this is an evil plant.  I will just conclude with the comment made by erowid. 'Know Yourself, Know Your Source, and Know your Substance'</p>"
 ],
 "erowid": {
  "id": "5193",
  "citation": " Valentine Dork. \"A Tactile Wave Moving From North to South: experience with Salvia divinorum (ID 5193)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5193",
  "substance": "Salvia divinorum",
  "views": "6080"
 }
}
