{
 "id": 8875,
 "title": "Seizure, Hospital, then Another Seizure",
 "date": {
  "submission": "2007-03-22T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Cactushead",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:00",
   "amount": "1320 mg",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:30",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  {
   "time": "2:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:00",
   "administration": "IV",
   "substance": "Pharms - Phenytoin",
   "form": ""
  },
  {
   "time": "0:00",
   "administration": "IV",
   "substance": "Pharms - Phenytoin",
   "form": ""
  },
  {
   "time": "0:00",
   "administration": "",
   "substance": "Pharms - Phenytoin",
   "form": "(daily)"
  }
 ],
 "report": [
  "Well, I read about this happening to other people before and now its happened to me. Apparently Tramadol can give a person seizures, and it can happen much easier than I ever expected. I want to describe the events that happened and give the important information about myself that led to my having seizures.",
  "Seizure History: I have had two seizures in the past; both were drug related. The first one occurred when I was sixteen as a result from taking LSD while on a prescription for Lithium (please, NEVER mix these two drugs. It easily surpassed every awful experience in my entire life.) The next seizure occurred when I was 20 from using cocaine that was laced with some kind of opiate. Im not sure which opiate, but a drug test showed that I tested positive (and I had only been using cocaine, no opiates to my knowledge.) Despite these two drug-induced seizures, I have never been diagnosed as having a seizure disorder.",
  "History of Tramadol Use: I have used tramadol recreationally somewhere around 5 to 7 times before this seizure. I have used doses as low as 200mgs to get high and as high as 400 mgs to get high. Usually, I would take 300 or 350mgs to get the effects I desired. There were two occasions that the tramadol made me vomit and both were high-end doses. Other than vomiting and some difficulty urinating (the next day) I never experienced any negative side-effects from the drug. I should also mention that have extensively used many other kinds of opiates and have never experienced anything like this from any of them.",
  "Now to tell the fun story of having convulsions and scaring the shit out of my family! Well, I was visiting my parents and sister during my school vacation and I brought some tramadol and a few other drugs along with me. One night when I was hanging out at my house, everyone was going to sleep and I decided I wanted to enjoy a nice opiate-high while I watched movies. I wont be able to tell the exact times that everything occurred because Ive suffered moderate amnesia of the events that transpired, but Ill do my best.",
  "It was sometime around 8pm that I took 200mgs of tramadol and 2 Vicodin HP (containing 20mgs hydrocodone.) I had never mixed tramadol with hydrocodone, but thought that I could induce a stronger opiate-state by mixing the two. I had mixed tramadol with very small amounts of opium in the past and it increased the effects of the tramadol, so I thought hydrocodone would do the same. By 9:30, I wasnt really feeling any opiate effects at all, so I decided to take more tramadol. I took 100mgs more around 9:30 and an additional 50mgs by 10. As time went on, I noticed a small opiate-high begin to develop, but it was much weaker than I expected it to be.",
  "Sometime later, perhaps an hour, I woke up with tons of people around me in the bedroom where I was watching my movie. I saw all of my family looking at me, several police officers, and a few paramedics and firemen. Some of them kept asking me questions like who I was, where I was, and what I took. They told me I had a seizure and put me on a stretcher to take me to the hospital by ambulance. I told them that I felt fine and wanted to get dressed, but they wouldnt let me. I wasnt even allowed to go put on my shoes! I got to the hospital and spent some time in the ER. My family was really freaked out and they were all crying. I was told that I screamed while watching the movie and began to have a seizure that I was not completely out from for 15 minutes. It was a Grand Mal seizure and apparently, I had stopped breathing at some point (it was unclear how long I wasnt breathing for. Perhaps one minute, perhaps a few.) The doctor put me on a very large dose of phenytoin (Dilantin) and I stayed on an IV drip for a few hours. Later I was sent home and guess what happened",
  "I had another seizure! This one, Im told, was shorter. So again, I was taken by ambulance to the hospital, put on another IV drip (this one contained more anti-convulsants) and given a booster dose of Dilantin. Eventually, I was sent home.",
  "Its now one week since that incident. Ive been put on Dilantin, which I stopped taking 5 days ago because I dont think I have a seizure disorder. I started taking it again though; just to keep my system calm during the post-seizure sensitivity that my brain is going through. I have smoked pot and taken LSD since my seizures and have had normal experiences. Ive also drank some beers and used some benzodiazepines, and although I have had typical reactions to those drugs as well, I have decided to discontinue them [the alcohol and benzodiazepines] for a month or so while my system re-stabilizes.",
  "Is there a moral to this story? Well, surprises can happen with Tramadol, but what was the cause? Im really not sure. Ive taken higher doses than 350mgs before and have had no adverse effects, but I never had mixed it with anything. My guess would be that the tramadol and hydrocodone had a bad interaction for me, but its just as possible that the tramadol wouldve caused me to seize without interacting with any other drugs. Please be careful. Apparently, having a seizure can be very damaging to the brain (by killing brain cells from lack of oxygen during suffocation) and there are other risks as well (such as developing a full-blown seizure-disorder.)",
  "I had read reports of other people having unexpected Tramadol-induced seizures, and still did the drug anyways. Now Im just trying to let others know: When you say KNOW to drugs and you learn something about what kind of drugs or drug combinations are risky, take that knowledge seriously and dont ignore that little voice in the back of your head that warns you when something you're considering might be risky. Im not sure that Im saying that nobody should take tramadol, but I AM saying that it gave me seizures. Im definitely never going to get high on tramadol again, and if I ever do use it in the future, I will only use it within the recommended dosage range and without combining it with any other drugs."
 ],
 "erowid": {
  "id": "51932",
  "citation": " Cactushead. \"Seizure, Hospital, then Another Seizure: experience with Tramadol & Hydrocodone (with Acetaminophen) (ID 51932)\". Erowid.org. Mar 22, 2007. erowid.org/exp/51932",
  "substance": "Tramadol & Hydrocodone (with Acetaminophen)",
  "views": "140723"
 }
}
