{
 "title": "Within the Grasp of Death",
 "author": "AnOldHag",
 "citation": " AnOldHag. \"Within the Grasp of Death: experience with JWH-018 (ID 88763)\". Erowid.org. Jan 24, 2011. erowid.org/exp/88763",
 "substance": "JWH-018",
 "bodyweight": "130 lb",
 "report": "<p>One day during the summer me and a few of my friends decide to get together and hang out one night while my parents where away. I knew they would be gone for the evening but not sure when that night they would come back. So around 5:00 my friends get here, one of them with a bag of JWH. We get all the supplies together and go into the forest back behind my house. We [had] one joint packed very tightly that four out of the six guys there shared. The two that didnt smoke it was for supervisional purposes. Most of us including myself had smoked JWH before so we knew what we were doing.</p><p>After two very very big hits, everything began to slow down. I felt the urge to be very quiet. As the high kicks in, we begin walking back to my house. The walk, in reality, took probably 3 minutes, however it felt like an hour. As we get close to my house, my friend, who had taken an equal amount of JWH begins telling me he 'doesn't feel good' and 'needs to lie down'. He repeatedly told me he had to lie down or else he was gonna die. He was obviously having a bad trip. My high had now fully hit me, and my friend's panic began to put me into a panic. I remember thinking 'if he dies, I'm killing myself'. As I sat on a coach watching my friend rock back and forth crying into a pillow, I began to her my moms voice. This was one of the scariest moments of my life. I was so scared I would face my parents in the state that I was in. I kept hearing my mom scream my name. But no one else in the room seemed to be detoured. I even asked one of the sober kids that was there if he heard anything. He said no. My heart began to pound so hard inside my chest, I thought it was going to explode and I was going to die. I had just this overall panic that any second my parents would come in, see what was going on and kill me. I decided it would be best if I just told everyone goodbye, and went off bed and died.</p><p>I remember lying down and still being aware of the fact that I was conscious. I felt like I had been lying down 'dead' for hours. My friend still rocking crying in a pillow. After about 2 hours of panic, my friends finally decide we all leave the house just in case someone comes home. By this time I was basically sobered up. And soon after we left my house, the feelings of panic began to go away. Let me just say, those were the worst two hours of my life and I will never touch it again. I do not recommend this to anyone. It is awful.</p>",
 "year": "2010",
 "id": "88763",
 "gender": "Male",
 "age": "18",
 "timestamp": "2011-01-24T08:00:00.000Z",
 "views": "6594",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "JWH-018"
  }
 ]
}
