{
 "title": "Afraid I'll Never Wake Up",
 "author": "Legs",
 "citation": " Legs. \"Afraid I'll Never Wake Up: experience with Cannabis (ID 8877)\". Erowid.org. Apr 18, 2003. erowid.org/exp/8877",
 "substance": "Cannabis",
 "bodyweight": "155 lb",
 "report": "<p>Over at my friend's house I got wicked stoned.  We smoked more than I really wanted to cuz her pot is premium stuff, a tiny amount can get me  pretty high.  Well, things were going just fine.  I was having that wonderful orgasmic feeling in my abdomen and felt like the most powerful person in the world.  Then my friend and I both looked into the mirror: I was looking much paler than my friend, but, thinking nothing of it, we kept on saying deep shit and all that until I leaned over, closed my eyes and had a flashback of a mental institution event I had been involved in.  At the hospital we used to make each other pass out for fun.  Some people did it to me two times in a row, and the second time I awoke, I didn't recognize my surroundings or any of the people.  This lasted only a second or two, but I started screaming really loud from fright.  This was what I saw when I closed my eyes, as if it was happening all over again.  From journal entry the day it happened: </p><p>Then I was screaming myself. 'I'm dead', I realized.  They're finding me dead and I can see them.  But I don't want to die!  No, don't take me yet, I haven't even seen what will happen!  I'm losing my memory, I hardly know where I am.  It's a horrible dream and I can't wake up!  Cuz I'm dead, that's why.  Mrs. Sylvia [my friend's mother], is telling me I'm having a panic attack, but I can't breathe.  Just wake me up, tell me I'm still alive.  Although every moment seems to of occurred several hours ago or maybe yesterday, I'm still talking about my situation and connecting my last words to the next, forming sentences.  I stick my head under water, desperately trying to get off the high.  It's as if I'm flying in the air with Tina [my friend], but suddenly I'm at the edge of the earth's atmosphere with Tina far below and I'm losing oxygen.  I want to sleep, but I'm afraid i'll never wake up. </p><p>We're out on the porch, sitting on her steps and Mrs. Sylvia is trying to calm me while talking about the color for her house and I was thinking I need quiet, talk to me, tell me i'll live.  She told me I wasn't going to stop breathing, that nothing could happen, but I doubted her to the extreme.  I tried to wake by singing real loud.  I had lost all shame, I didn't even care that I passed loud, nasty gas in front of them, partly cuz I almost believed I wasn't going to wake up.  When we were first telling her mom, I slammed my head against the door frame.  It was only a tiny bit clear to me that I was perfectly fine because that knowledge kept fading and coming back for a mere second.  2 hours COMPLETELY NUMB.  My hands and feet were non-existant; at some point I believed they had been amputated a long time ago.  For most of the visit I was curled into the fetal position in Tina's backyard. </p><p>I haven't wanted to live ever before as much as I wanted life today.  I began mumbling prayers to myself, begging God to heal me and bring me off the high.  'Never again', I said, 'I won't use ever again'.  That's bull, I know it.  Everything I was paranoid about and everything I wanted to believe was that the world was okay, everybody was happy and I wasn't imposing on anybody.  But I couldn't believe it, I saw all the bad in each and every trivial thing.  There was shit blocking my lung passages and pain in my chest.  A heart condition, I thought, my heart's gonna explode.  Miltonians [the kids in my town] kept flashing inside my mind and all the shit they'd done to me which just worsened the anxiety because I was so fucking angry.  Then Tina told me to stand up and join her at the top of the stairs on her porch.  Looking down, I wanted to jump, I felt no fear, but I knew what was happening so went back to the grass.  Always looking at my watch, worrying about going home, and shaking like I was naked in the Artic. </p><p>What scared me even worse was that all the world was insane because it didn't seem like Mrs. Sylvia and Tina were speaking correctly.  Tina was still high too.  But it was like living inside an eerily enigmatic poem with everyone speaking in riddles.  I know I was only seeing the poetic and dramatic non-existant ideas they hid in their speech.  I was not only visiting all my fears, but I was remembering every moment of it. </p><p>Now, I had been doing mary jane for about a year and a half, this thing just came right out of the blue. But I kept trying pot after that, even had a couple more panic/anxiety attacks with many of the same symptoms.  So I tried ritalin, that made me wicked nervous and anxious, nothing was working for me.  I stopped everything for about 10 months and just drank occasionally.  One day I decided I had done God wrong and started praying for forgiveness and to take the 'fear' out of me.  This worked cuz one day at an amusement park, things just snapped back into place.  I felt renewed.  I am now able to take pot again.  This whole week was a pot binge in fact, and as I'm writing this, I'm speeding on ritalin.  I've only talked to one other kid whom this has happened to and he too said that eventually he was able to toke up again.</p>",
 "year": "2000",
 "id": "8877",
 "gender": "Female",
 "timestamp": "2003-04-18T07:00:00.000Z",
 "views": "11305",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
