{
 "title": "Diamonds and the Ruffage",
 "author": "paulus",
 "citation": " paulus. \"Diamonds and the Ruffage: experience with Mushrooms (P. cubensis), L-Tryptophan, Cannabis & Alcohol (ID 8878)\". Erowid.org. May 13, 2004. erowid.org/exp/8878",
 "substance": "Mushrooms (P. cubensis), L-Tryptophan, Cannabis & Alcohol",
 "bodyweight": "215 lb",
 "header": [
  "DOSE:",
  "1.5 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)",
  "",
  "1.0 g",
  "oral",
  "Tryptophan - L-Tryptophan",
  "(capsule)",
  "",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  " repeated",
  "oral",
  "Alcohol",
  "(liquid)"
 ],
 "report": "<p>What more American thing to do is there, than baseball and mushrooms?  Hell, I'm not sure, but I'm not going to complain about this combination.  A little more history behind this experiment.  I say experiment because I've never tried pre-loading a trip with anything more than OJ/Vitamin C.  Lazy me.  I'd been sitting on some L-Tryptophan for some time now, trying to decide if I should go for an enhanced experience or chicken out due to the recall.  This time I opted in.  Yippee!  So I split up about 2-3grams of dried mushrooms I grew between my friend and I and then added ~1g of the tryptophan as powder in 2 00 gelcaps.  My friend got about .5g of the tryptophan.  Chewed up the mushrooms good, nice'n'tasty.  In a way.  Big glass of water to get that mush down and then downed the 2 gelcaps.  My bud did the same ('cept only 1 gelcap).  Then we all (my bud, his girl, and myself) smoked a few bong hits and then hit the road headed for a baseball game.</p><p>We don't live very far away - about 15 minutes from the stadium.  As we are on the way (probably about T+0:20) the mushrooms start to take effect.  It begins with a little smiley and happy mood that just won't go away.  Which is not bad at all.  By the time we've arrived at the stadium and parked, we've come up a bit further.  Things are looking nice and the other people walking to the stadium are pretty funny.  Can't really tell if the Tryptophan was having an effect or not at this point (only T+0:40).  Or if the 1g would even have an effect or not.  We get our tickets and go in.  It takes us a while to decide where to sit because of the crowd and because it was too much fun walking amongst them.  We eventually got some alcohol and picked some seats.  Good game.  At about the 2nd inning (T+1:15 or so) my trip seems to kick in.  I felt a big euphoria feeling and happiness abound.  A little while later ('bout the 4th or 5th inning ~ T+2:00) I can't stop staring at the outfield.  For the small amount of mushrooms we had (this is just a minor dose for us, we have a bit of a tolerance) I was pleasantly surprised to find the outfield grass swirling and undulating. </p><p>Then I noticed that my friend wasn't saying anything and also staring straight ahead with the same dumbfounded stare.  This is rare for him on mushrooms alone.  We felt very happy, smooth, content with things.  The tryptophan definitely seemed to have an impact.  A lightening and brightening effect it seemed.  We stayed until the 8th inning and then left  to find more interesting places to go.  Still feeling very happy (around T+3:00), more so than the mild dose of mushrooms we had normally would give us.</p><p>We head to the local bar and drink screwdrivers like fish.  At least 5 each.  Very heavy ones at that (bartender buddies are cool).  Even after all that, we're still lively and happy (T+6:00) where normally we'd have been slowed down a lot by the volume of alcohol.  Don't let that fool you though, we can drink a lot too.  Heheh.  I ducked out before the bar closed to roll a log back at the house (driving isn't difficult, but I love to drive when I'm messed up anyways (not a good idea, but whatever) plus, it's only about 1.5 miles away)).  And bring it back.  It seemed like a long time to me, but no one seemed to notice me missing.  Could just be me.  I think there was a little time lag for me though.  In any case, I get back to the bar and we help bartender buddy close it and smoke the joint in the back lot.  This seemed to be the catalyst for sleep.  (~ T+7:00)  When we got home, we both passed out.  It was verry smooth though.  The next day, I felt wonderful (I never get hangovers anyways, but I felt especially good) and relaxed. </p><p>I've tried the Tryptophan (1g) + Mushrooms (2g) combination since then and have found it to be very smooth but perhaps overpowering.  One thing that struck me the second time was that it seemed to almost obstruct the mushrooms' effect.  I felt good, but it was a very smooth buzz with a clear mind.  Compared to what the mushrooms do by themselves.  It's not bad, it's very smooooth in fact.  No negative side effects that I can notice (no runny pooh, nose, brain, etc.) other than the mildation (is that a word?) of the mushrooms.  So maybe that would be a side effect.  Not a bad combination.</p>",
 "year": "2001",
 "id": "8878",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-05-13T07:00:00.000Z",
 "views": "9849",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Tryptophan - L-Tryptophan",
   "form": "(capsule)"
  },
  "2": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": "",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 }
}
