{
 "id": 8881,
 "title": "the Void, the Hospital, and the Cops",
 "date": {
  "submission": "2006-06-15T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "liftyourskinnyfists",
  "gender": "Male",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  }
 ],
 "report": [
  "About mid-January I took fifteen grams (roughly 2 caps about an hour between) of Amanita Muscaria one Friday night.  Not only did I take fifteen grams but I stupidly ate a grapefruit about 15 minutes beforehand because Id read that it potentiates the strength of many substances.  The following experience certainly indicates that it does.  After I ate the second cap my wife (my sitter) got a phone call and said that she had to give a friend a ride.  Knowing that I would be in no condition to socialize I told her ok and that I would call her if I felt it was getting uncontrollable.",
  "I was at about a plus 2 when she left (around 11pm).   I started brainstorming ideas for an art project that was to be due at the end of the semester (my original reason for dosing).  About an hour passed and it was becoming increasingly hard for me to focus, so I called my wife and told her that she better come back.  I found that not only was I not having the luck of grasping at creative ideas that I had hoped for, but that I was also getting lost in my own thoughts, and losing contact with my environment.  I put on south park (by this time at plus 3) thinking that the show's cheeriness would at least keep me in a good place (Unfortunately I didnt realize that I was putting on the tooth fairy episode where Kyle is stuck in a metaphysical conundrum, and is questioning his very existence).  This show was to foreshadow my own condition later that night.",
  "Communication was impossible by the time my wife got back.  I was having so much trouble holding on to whom I was and where I was that trying to speak anything more than what amounted to indecipherable verbal noise was impossible.  It is safe to say that I was scared by this time.  Had I not previously read that death from A. muscaria is almost unheard of it would have been much worse.  I found it increasingly hard to remind myself of this though as it went along, because my mind was racing so fast that I was unable to grasp at anything.  To call it information overload would be an understatement.",
  "These thoughts were only perceptible as a sound repeating and speeding up. Up to this point I was becoming more and more perceptive to a sound although I wasnt aware of it in the beginning.  It started out like a heart beat (maybe it was) slow, normal, and imperceptible at the beginning of the night, but as the night went along and I was loosing my grip on normal reality, the beats blended together and became a constant buzz.  Somewhere around this time I must have passed out. I came to briefly in a different room (our bedroom) and I could feel the presence of another being that was in my head, and I could feel it quickly taking over and I knew I had maybe 10 seconds before I was gone.  It felt as though I was being shot into space at a rapid speed, and I quickly got up and ran to my wife who was watching tv in the living room, and repeating over and over, IM OK, IM OK, IM GOING TO BE OK, DONT WORRY ABOUT ME.",
  "The next part is beyond description and the most terrified that I have ever been in my life.  I think I now know what people mean when they describe the void because thats all there was.  It was like my whole previous life, with everyone, and everything, in it had been one long dream, and that I had woken up in the void where nothing existed, had ever existed, or would exist in the future.  Nothing is more terrifying or crazy like a mind that has not only been cut off from everything else, but also realizes that they never existed, and were only a dream.  Time stretched off so far into the future that it no longer existed, past, present, and futures were one.  I pleaded to no one for death at this point, but being alone and immortal there was no escape.  I longed for the dream to begin again. (Maybe thats why God, or the Tao or whatever, first created life and the wheel of time that governs it, so as to escape its lonely prison).",
  "This seemed by far the longest portion of the experience although I have no way of knowing how long it actually was.  The length of the earlier part of the experience isnt even comparable.  I woke up at this point (or maybe my lonely, immortal self started dreaming again) Saturday morning in a hospital bed with my wife on my left side and my mother on my right hooked up to an IV.  When I asked my wife what had happened this was her story.",
  "Apparently she had asked if I was ok and if she could go to bed, and I said, OK.  She then asked if she could turn the light off and I said Ok again.  She awoke 10-15 minutes later to a gurgling sound coming from the other room.  She found me convulsing on the floor.  I had pissed myself at least once, and my eyes were wide open, but rolled back in my head.  She tried to wake me, but I was non-responsive to her repeated attempts.  Desperate, she called the hospital and had them send an ambulance, who in turn called the fucking cops like most stupid hospitals do in the event of an O.D.  (How this can be justified when this only results in more deaths from ODs when people avoid medical attention for fear of the police).  The ambulance came and the cops shortly thereafter.",
  "Im sure that I would have been ok had I been left alone (and $4000 richer!!), but my wife did what she thought was right at a time that required a quick decision.  I probably would have done that same thing if the roles were reversed.  The Moral of the story is that not only should you know your drug, but your sitter should know it inside and out as well.  Any sitter will not do!!",
  "It's now two months later and I'm also being charged with possession of a schedule 1 substance (DMT), which I think they must have found in some A. colubrina seeds that I had, but it seems a slight stretch to prosecute someone for seeds of a plant that isn't even scheduled.  Again, just be careful about what substances you use, and what foods and drugs you take with them!!"
 ],
 "erowid": {
  "id": "51941",
  "citation": " liftyourskinnyfists. \"the Void, the Hospital, and the Cops: experience with Amanitas - A. muscaria (ID 51941)\". Erowid.org. Jun 15, 2006. erowid.org/exp/51941",
  "substance": "Amanitas - A. muscaria",
  "views": "43204"
 }
}
