{
 "title": "DON'T Try This at Home",
 "author": "anonymous",
 "citation": " anonymous. \"DON'T Try This at Home: experience with Inhalants (Gasoline) (ID 8899)\". Erowid.org. May 12, 2004. erowid.org/exp/8899",
 "substance": "Inhalants (Gasoline)",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  " ",
  "inhaled",
  "Inhalants",
  "(gas)"
 ],
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I have always been relatively smart when experiencing with drugs.</p><p>A friend of mine was into huffing gas (because he had nothing better to do) and described what it was like and I found it interresting so I went to his house and me n him took his four-wheeler out into a cow feild with a gas tank for the experience.</p><p>he huffed for about a good 30 minutes. suddenly everything got quiet and I became unbelievably aware of what was going on around me. being that it was my first time I tried to keep myself aware of my breathing.there were hallucinations that you would know werent real if only u cared but u didnt.. there were amazing sound hallucinations but the wierd thing was that they were real..</p><p>it was like my hearing was 10 times greater. I heard animals and birds seemed as if they were communicating with me. this 'trip' doesnt last long but is very interresting and VERY dangerous.. not only dangerous to your body but dangerous to my mind. that same friend who was with me that day is well,, lets say ppl dont look at him the same anymore..</p><p>I have huffed a few more times after that with other ppl and I have had unpleasant experiences such as.. I have felt internal organs deform, I actually felt my throat drop to my stomach. and my last gasoline experience, the one where I said 'fuck this' I found myself into a deep 'mind out of body' experience and while my mind wondered I heard something in the back ground which made my body aware and I noticed I wasnt breathing.. I was holding my breath and didnt know it nor feel it.. I dont like to advise others not to do something that I myself have done, so ill just say if you ever do try it, BE CAREFUL.</p>",
 "year": "1997",
 "id": "8899",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-05-12T07:00:00.000Z",
 "views": "18438",
 "dose": {}
}
