{
 "id": 8899,
 "title": "Temporary Loss of Vision and Hearing",
 "date": {
  "submission": "2008-05-12T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Adeline",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Last night I experienced a fairly frightening incident with some weed. I've smoked pretty irregularly for a few years and recently have been smoking about a bowl a day. I occasionally experience intense body highs and even panic attacks, especially when I haven't smoked for a while.",
  "Yesterday, I had very little to eat due to a great deal of stress, and later on in the evening met up with some friends to smoke. My friend packed two bowls and I found myself quite high after about 20 minutes. After an hour or so, my friend said he had to go to bed, so I headed out. My apartment is about a 10 or 15 minute walk from his, so I wasnt too worried, even given the intense state I was in.  However, about a block away from his place, my vision darkened significantly and all I could make out were blurry red lights of cars.  I tried to convince myself that I was just being paranoid and panicking a little bit and to keep on going. Then I found myself unstable and basically unable to walk.  I sat down in front of someones house to try to collect myself.  At this point, my hearing was a bit funny too  not that I had completely lost it but more of a ringing, quieting sensation.",
  "At this point, I try to stand up again and am somewhat incapacitated and panicky, so I call my friend to come outside.  He helps me walk back to his place, but I can barely make it up the stairs without falling.  Once inside, I make a move for the couch but black out again and just collapse on the floor next to it.  He helps me up and once Ive been lying on the couch for a few minutes, the awful physical sensations begin to subside.  Ive never had such a strong or frightening reaction to smoking pot, and the only thing I can think to attribute it to is my not having eaten."
 ],
 "erowid": {
  "id": "52017",
  "citation": " Adeline. \"Temporary Loss of Vision and Hearing: experience with Cannabis (ID 52017)\". Erowid.org. May 12, 2008. erowid.org/exp/52017",
  "substance": "Cannabis",
  "views": "4806"
 }
}
