{
 "title": "Best Feeling of My Life",
 "author": "Ryan",
 "citation": " Ryan. \"Best Feeling of My Life: experience with 4-Methylmethcathinone (Mephedrone) (ID 89007)\". Erowid.org. Jan 20, 2011. erowid.org/exp/89007",
 "substance": "4-Methylmethcathinone (Mephedrone)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "oral",
   "4-Methylmethcathinone",
   "(capsule)"
  ]
 ],
 "report": "<p>[Erowid Note: This report is marked as a 4-Methylmethcathinone report, but readers should be aware there are aspects of it that suggest the identification is speculative.] </p><p>First let me start off by saying, this legal drug is very addictive; as I thought I couldn't become addicted myself. I was wrong and I have accepted that I was addicted from start but I am able to control it now.</p><p>To the real deal now, it was new years eve, approximately 11:30 PM. My buddy Mickey had been talking to me about this drug for quite some time before and I was finally curious enough to try it. So I called him up and asked if he could get me two .25g capsules of meow/Mephedrone. As soon as he left my place I asked him what I should be worrying about, he just said grinding teeth and dry mouth; so drink water and STAY HYDRATED!. I drank a glass of water, and then popped one pill at 11:48 PM. I decided to put on a movie and wait for the effects to kick in. I had smoked some weed about 6 hours prior, and had eaten lots of food.</p><p>Mood/Mindset before effects: happy, a little bored, interested in experiencing a new drug. Good outlook on life, happy with it, satisfied with friends, family and personal life. No sadness of anything. Doubt free.</p><p>Its about 2:00 AM, I didn't still didn't feel anything. I decided to go down stairs and get some thing to eat or drink, but I couldn't think of anything. So I stood at my pantry as I started seeing the outlines of the door projecting outwards. I thought I was just seeing stuff because it was dark. But I stood there some more and all of a sudden, my body was completely weightless and I had such extreme euphoria to the point of where I was moaning and laughing. I Closed my eyes and saw very beautiful weird colors and patterns.</p><p>I thought I didn't really hallucinate, so I opened them and my vision was morphing and waving like water. There were really instance abstract patterns like in a kaleidoscope. I was quite fascinated as I had never done any amphetamine type or hard drug. I was so amazed by what I saw that I actually kinda freaked out. I decided to try and eat something but I couldn't decide AT ALL. I got a drink of wine, kinda liked it, but I didn't really want to drink it. My whole body felt good and tingled. As I went upstairs, my vision was trailing and everything was faster. I had alot of energy but I wanted to continue my movie and relax. While watching, a sudden jolt of sexual arousal came upon me. I was really aroused but couldn't get an erection. I started feeling extreme euphoria again, as I then called Mickey I told him I loved him and we should hang out more. I felt so peacefully connected with everyone and the world.</p><p>After about an hour since the effects came on, I start realizing more about life and everything else. I had a spiritual connection for about 15 minutes and I felt the spirits enter me, tell me what I wanted to know, and left me. I called my other friends as I told them I loved them as well. I felt a passion for music but didn't want to listen to it.</p><p>Time passed by extremely fast as it was already 4:10. I felt pretty drained of  physical energy and psychological energy. I decided to go to bed at around 4:40, I laid there for about two and a half hours with my eyes closed. All still while seeing morphing/water type closed eye visuals. I finally fell asleep and slept for around only 3 hours. When I woke up, I was extremely depressed and I wanted to take the other pill right then and there. But I read up on side effects and just learned to deal with it. I realized that I actually became addicted pretty quickly and easily, but since I know now I can control it. Overall, the experience was the best thing in my life. I am pretty sure that nothing could ever top it. I was at the climax of PURE ECSTASY with Life and Love.</p><p>I will definitely use this drug again and cautiously. I will let you know that I took only one capsule of .25g Mephedrone. I would take a dose like this again, cause this fucked me up extremely bad in a good way. Just because this drug might be legal, do NOT underestimate this drug as I thought I could never be addicted to this or anything. It is extremely addictive and will most likely make you want to re-dose.</p><p>Your first come down may make you depressed. I took my second one with a little bit of alcohol and didnt have one at all. Be safe and have a good time!</p>",
 "year": "2010",
 "id": "89007",
 "gender": "Male",
 "age": "17",
 "timestamp": "2011-01-20T08:00:00.000Z",
 "views": "5546",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "4-Methylmethcathinone",
   "form": "(capsule)"
  }
 ]
}
