{
 "id": 8901,
 "title": "A Laced Orange",
 "date": {
  "submission": "2007-08-14T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Cacey",
  "gender": "Male",
  "weight": "185 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(cookie / food)"
  }
 ],
 "report": [
  "On Friday, I was pretty well prepared for my experiment. I had come across 2C-I, I purchased about 5 apples and 2 oranges. I fist split the orange up and placed 20mg between two slices, and ate it. The orange covered up the taste of the of the 2c-i very well. I repeated this again.",
  "At the time of consuming this amount it was 1:11 pm, about 35 mins past until I could feel the effects start to come over me. Much like LSD I still was pretty much in control. I felt some stomach ache start to arise, so I went for a walk, I was feeling pretty good. Apon my return to my room, I was sweatting heavily, my chest felt heavy, like someone was putting a big heavy rock on it, this did not scare me but just made me rather uncomfortable.",
  "I then began a spiral out of control, I started thinking more systematically, Like I was reading a book about my own experience. About 3:00 pm I peaked with waves of more intense visuals, smokey circles, flat walls became 3-d, pictures of plants and anything outdoors seemed to be more atractting to my eye than anything. One thing that kind of upset me was that normally with LSD I would have CEVs, but with this stuff there was none, or I was just too energetic to really sit still for long periods of time.",
  "About five I had a friend come over and pretty much watch over me to make sure I didn't do anything stupid, or just keep me company. I felt as if every time I was talking that my words were coming out chopped up and that I was studdering, although many times he said that I was talking fine and that the only thing he could tell that I was not 'sober' was that My face was flushed and my pupils were dialated.",
  "After about 6 hours I could feel that I had past the peak and was slowly coming back into a state of normality, thought the visuals were still there I was less concerned with them then when I was first coming up. I also noticed that moving objects were not that interesting. Birds were my favorite, cutting a line through the sky. On 2C-I I felt that moving objects attracted my attention more and kept me from enjoying the scenery.",
  "Once I was feeling completely normal, Although I was not, I could still see visuals, although fading away, I decided it was time for bed. I walked back to my room, laid down apon my bed, looking at the clock it was now 1:25 am, 12 hours had past and I am back to normal. Overall I would still rather do LSD than any other. I felt confused with this stuff and feel in complete control, much like I was slightly drunk."
 ],
 "erowid": {
  "id": "52019",
  "citation": " Cacey. \"A Laced Orange: experience with 2C-I (ID 52019)\". Erowid.org. Aug 14, 2007. erowid.org/exp/52019",
  "substance": "2C-I",
  "views": "3313"
 }
}
