{
 "title": "Cosmic Freak Out",
 "author": "the dude",
 "citation": " the dude. \"Cosmic Freak Out: experience with Mushrooms & Hash (ID 8906)\". Erowid.org. May 19, 2004. erowid.org/exp/8906",
 "substance": "Mushrooms & Hash",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "",
   " ",
   "smoked",
   "Cannabis - Hash",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "8906",
   "Male",
   "",
   "Not Given",
   "May 19, 2004",
   "6103",
   " "
  ]
 ],
 "report": "<p>This particular Friday I had made plans with two friends of mine to hang out that night. It was my turn to pick up whatever drug we would be using that night. So after scrounging around the opportunity came by me to buy 8 grams of mushrooms from a guy that I knew to have very decent stuff for 60 dollars... I jumped at this opportunity, I had done them about three times before and always found the experiance to be enjoyable.</p><p>So that night me and my friends all dropped the shrooms [they took 1.5 each and I took 5]. We sat around waiting for the experiance to start, it seemed to be taking a little while, but i had heard stories of shrooms taking an hour of so to kick in. so we kept waiting but after about 45 mintues we got tired fo waiting and decided that I had been ripped off so we each go home.</p><p>Once I got home I just chilled on my bed and watched some TV, it was then that I looked at my carpet and thought 'man, that's a wicked pattern!' I realized that this was the shrooms kicking in so I sat back and got ready for the ride. It slowly built up in intensity, but as my inebriation was building, so was a strange feeling a feer that I had never felt before. After about half an hour it peeked, my visual halucinations were minimal, but the worse part was that I was just totally scared but i don't know why. I wrapper myself in my blanket and huddled in a corner.</p><p>I just kept wishing that it would be over, every time I closed my eyes I heard the sound of wind chimes all around me, and I kept makin up elaborate reasons to be afraid of stuff. After about an hour of so of this I decided that I had to do something about this trip, no way was I gonna sit in a corner for five hours or so. I decided that I needed to calm down and I had just the thing. I had been keeping a gram of hash for special occasions, and I figured this counted.</p><p>It took quite some effort to get up, get the pipe and pack the hash in it. I had trouble moving it seemed very complicated. But, I managed and I got to smoking the entire bowl. It was just what I needed, the familiar feeling of a hash high washed over me. I was still scared, but I just didn't care. I put some slow beatles tunes on my CD player and grooved on my lava lamp for about 45 minutes untill I burnt out and went to sleep. I have done mushrooms sense and never experianced a trip quite liek that.</p><p>The moral of this story is to NEVER drop 'shrooms by myself, esspecially since I'm not too experianced. And second, Hash was a good remedy for my bad trip.</p>"
}
