{
 "id": 8908,
 "title": "To the Womb",
 "date": {
  "submission": "2007-05-05T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Ravon",
  "gender": "Male",
  "weight": 90
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Melatonin",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I am in my late 40s.  I was a heavy user of cannabis (and everything else I could get my hands on)when in my teens - but I gave it all up when I was 21 due to some heavy psychological problems I had (I realise now induced by grief at the loss of a family member). I revisited cannabis about three years ago and have become a regular but very controlled user.  I say controlled because I use it in small doses almost medicinally. I find it gives me far greater empathy for people than I have usually and my relationships have improved a lot since I began using cannabis again.  However, I was concerned about some side effects: memory loss and less mental agility.",
  "I read comments online about melatonin and its assistance in dealing with these side effects and so I thought I would try it out. I have now been taking it each night for about a month.  It certainly helps with sleep and has assisted me with mental agility which is all I really wanted.",
  "However, there have been some quite dramatic unforeseen benefits. I have found that I have a new much more positive attitude.  Often when I first smoke weed, I feel feelings of anxiety, fear and paranoia.  Although unpleasant, I endure these feelings because I know they will pass and I will get into that more relaxed and peaceful state. Lately, however, far from having any paranoid thoughts after I have just smoked, I have felt very good about myself and even shall I say full of myself a kind of celebration at being me!  These same good feelings continue whether stoned on cannabis or not.",
  "I can actually record the beginning of this positive experience as an epiphany which occurred after a nightmarish dream.  I wont go into detail but lets say I encountered some demons which I was able to dismiss as phantoms (and Im not a religious person). It was scary dream but carried with it a message that came to me as I reflected on it in the days that followed. I know it has changed my consciousness  almost like an exorcism.",
  "If I smoke some weed about the same time as taking the melatonin and then go to bed and close my eyes, I will be transported into a very hallucinogenic state which for me was panic free and the closest thing to absolute bliss that I have ever experienced  almost a back to the womb experience  I kid you not!",
  "As I write this (not under the influence of weed) I feel a sort of warmth running through me. I hope it will continue because at the moment I feel the happiest I have felt for many years. Whether its a combination of both substances I dont know  but I felt compelled to share my experience because I really believe that with a little tweaking I can find the right chemical balance for my brain. I also think that tweaking can be achieved by other means such as meditation which I intend to explore - because ultimately I would prefer to find that balance in a drug free way."
 ],
 "erowid": {
  "id": "52047",
  "citation": " Ravon. \"To the Womb: experience with Melatonin & Cannabis  (ID 52047)\". Erowid.org. May 5, 2007. erowid.org/exp/52047",
  "substance": "Melatonin & Cannabis ",
  "views": "15196"
 }
}
