{
 "title": "New Year's Eve on the Moon",
 "author": "Max",
 "citation": " Max. \"New Year's Eve on the Moon: experience with 2C-T-7 (ID 89118)\". Erowid.org. Dec 22, 2012. erowid.org/exp/89118",
 "substance": "2C-T-7",
 "bodyweight": "",
 "report": "<p>I am experienced with 2cb and have taken MDMA for about 20 years now (on a part time basis) this has played a massive role in shaping my life because of its inspirational nature. I am very healthy, educated and I have moral discipline too and would say I was modern type of guy.</p><p>I have read many reports of this drug, some good and some bad, but if it was good enough for Shulgin it was good enough for me. I had taken about 5 mg with a friend which I scaled up to 15 mg but it didnt really do much, I felt sociable and could have easily have gone to a bar on such a feeling. Although it was the personal, emotional and visual enlightenment that I was looking for.</p><p>The next time round I did 28 mg orally and nothing really happened for about 2 hours, and even then I thought it was a lazy tame version of 2cb that didnt really give me any energy or emotional or visual excitement. Even though my friend who had done 20 mg had said it was pretty intense for him.</p><p>This time round it wasnt planned, it was new years eve and I was alone, my friends were with family and I no girlfriend to spend the night with so I decided to treat myself. The plan was to watch a film, I was didnt want to listen to music and had something in mind. But I opted to sniff some first instead of the whole oral thing, even though I had read a report of someone who died from sniffing 35mg. I had sniffed 2cb at small doses and handled that OK, 8 mg went up my nose and I ate 15 mg, so that was 23 mg all in all.</p><p>However, when I sniffed that first 8 mg all hell broke loose, and only for the experienced tripper. It was a bit intense but very good at the same time and a feeling I have never felt before. I was emotionally and visually enlightened right away. My living room is airy, light, beige tiled floor with a grey leather couch and a plasma in the corner, it was the right environment. I was soon surrounded by bright oranges, greens and reds mixed in with psychedelic traces. But like all of the 2c series they are better suited for different activities, this one is best for watching films that stimulate and entertain, and this is what certainly happened here.</p><p>I had  a film called Stardust recorded for this very moment. The film was directed by Michael Vaughn, a mythical fantasy that was more aimed at adults than children and as soon as I pressed play I knew this was the film that would take me on a journey. I had a box of wine and a bottle of champagne in the fridge. But I felt a huge urge of sexual tension, so I needed to get this out of my system right away. I grabbed my laptop and put porn hub on, pressed pause on the film and got some horny MILF having sex (tripping my nuts off at the same time). I felt so relieved 5 minutes later. It was like a massive release of pent up tension had gone from my body. This is a very sexually arousing drug. I could now get started with my journey.</p><p>The film which had an all star cast: Michelle Pieffer, Robert de Nero, Ricky Jervais, Sienna Miller and a few comedians I didnt know the name of. I wont tell you about the film if you havent seen it but it had everything that gripped my attention, the visual attraction, the fantasy, the story of a poor boy who turned into a cool dude and got his princess along with a roller coaster of an adventure. The story line was so emotional, I was laughing so much, it gripped me with suspense and even brought tears to my eyes when one of the pretty girls started talking about love and how it was unconditional. I was sobbing with joy for about 4 minutes. I couldn't believe how emotional that drug had got me but it was amazingly interesting in the manner I did it. It had the empathy and love of MDMA but the visuals and insight of something that really took me to the moon and back (mescaline) and this just carried on throughout the night...remember I had ate and extra 15mg.</p><p>I was lucky enough to have another great programme on TV which was live. Jules Holland was on TV a two programme of entertainment and music. He was bringing the night in with many pop stars, Kylie Minogue, Plan B, Pop queen Kylie Minogue, Cee-Lo Green and Reggae star Toots Hibbert and I felt part of this. This was great entertainment, and when the count down began I opened my back door, fireworks going off to add to the experience, a glass of champagne and a joint in the other hand and my night was complete.</p><p>This drug gave me a lot of loving feelings and excitement about life in general, I felt like something had just opened me up to many positive possibilities about my future and helped me see things in a different perspective, all positive of course.</p><p>2ct7, what night...I will definitely do this in the same way but hopefully with a girl next time!</p>",
 "year": "2010",
 "id": "89118",
 "gender": "Male",
 "timestamp": "2012-12-22T08:00:00.000Z",
 "views": "729",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "8 mg",
   "administration": "insufflated",
   "substance": "2C-T-7"
  },
  {
   "time": "",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "2C-T-7"
  }
 ]
}
