{
 "title": "Happy, Euphoric, Energetic High",
 "author": "cannadware",
 "citation": " cannadware. \"Happy, Euphoric, Energetic High: experience with Cannabis & Caffeine (brownie) (ID 89132)\". Erowid.org. Oct 27, 2011. erowid.org/exp/89132",
 "substance": "Cannabis & Caffeine (brownie)",
 "bodyweight": "110 lb",
 "header": [
  "DOSE:",
  ".77 g",
  "oral",
  "Cannabis",
  "(cookie / food)",
  "",
  " ",
  "oral",
  "Caffeine",
  "(cookie / food)"
 ],
 "report": "<p>I am writing this report to comment on the effects of caffeine with cannabis, in the edible form. If you dont want to read this whole thing as it may be boring, at least check out the last few paragraphs for a summary. As you may know, the edible effects of cannabis are a bit different than smoking or vaping, and last quite a lot longer. Weed tends to lead to tiredness, and when I randomly found a caffeinated brownie mix on a website with lots of cool stuff, I immediately got the idea of using it for my next batch of medicinal brownies. Looking it up I found little to no useful documentation of this idea, so I figured I'd have to just try it.</p><p>I'm a daily marijuana user, about a year and a half of experience in multiple types of settings and a few different countries. I would say I am really experienced/knowledgeable with it for someone of my age, at least compared to the average stoner in my school, but obviously I don't know what it's like to have smoked the stuff for 20 years or anything like that. I usually vape weed as my method of consumption as I prefer it to smoking for countless reasons. I consume caffeine very rarely, only when drinking tea or the very very occasional energy drink. Ive always wanted to try writing an experience report for some of my most outstanding experiences on weed, but never ended up doing it. Im pretty sure the only reason you are reading this is because of the caffeine content of these brownies.</p><p>To make these I simply made cannabutter, the brownies recipe called for 2 sticks of butter and I made that with a half ounce of some decent dro, definitely great enough for cooking and a substantially low price. I cooked the cannabutter for 2 hours, mixing it frequently with my friend T. We ended up producing 16 brownies (recipe says makes 18) so each brownie has almost a gram and a little more caffeine than an average large cup of coffee as stated on the mix. Baking them did make my house smell, in addition to the odor of cooking up the butter. Opening all windows wide open for an hour will create a nice draft and get rid of most of the smell, and Id recommend cooking something else afterwards so it can smell like a specific food and not a faint lingering weed brownie smell which may find their way into experienced peoples noses The last batch of brownies I made had half as much weed per brownie and a different mix without caffeine, and were pretty damn strong. Not sure how long eaten caffeine takes to affect the body, but it is also said to slow digestion. Im assuming thats why the first couple hours were super energetic, followed by some down time and now Im alive and well, energetic as can be at 2am.</p><p>Ill try and describe some of the effects as best I can for those who havent tried weed, but some of it may be hard to (fully) understand unless youve experienced it yourself.</p><p>A bit of background info before I get into the experience. We are both on no medications, and have vaporized some weed a few hours earlier in the day, but were not high anymore within an hour or so before eating the brownies. Our mindset was that we were eager to get a nice brownie high (T had never eaten a brownie that worked yet as most people in my town cant seem to get it right) and I had made brownies before with good success. We both consider ourselves to be insightful and knowledgeable people, and probably not the kind of kids who just wanna get fucked up. Were more respectful and mature than that. We both get good grades in school and enjoy our lives in general.</p><p>Starting at 6:45 we each devour a full brownie, and a few crumbs and flakes, nothing too substantial. A glass of whole milk with it went well. We hadnt eaten since lunch around 12, and were really really hungry at this point. We ate our brownies as soon as they were ready, just letting them cool as little as needed. Its best not to eat for a while before eating brownies because it will kick in faster, otherwise I may be waiting a couple hours if I eat it on a full stomach. The brownies tasted a lot like coffee, and not at all like the trees although they do smell medicinal. About a minute or two after eating them we felt kind of uneasy; butterflies in the stomach, probably just nervous anticipation. Ten minutes later I went to the bathroom, I noticed a kind of zooming in the background as I viewed myself in the mirror, in my peripherals, only for a second. It could have been placebo or something, but it was pretty vivid. I sort of had a feeling of something starting but really mellow. I could feel some kinda action in my stomach as well. Anyways, we cleaned up from making the food and went out driving, planning to go to the mall. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  Then we realized they could hit us hard, so we stayed local, driving to a popular convenient store to see whos there, hopefully bump into anyone we know.</p><p>Its now at least 45 minutes since we ate, and I begin to notice the first effects of the brownies as we are driving. At one point I simply notice how much Im physically moving around in the car and so eager to do things. The music is just so awesome with more clarity to every individual sounds details, sounds have more depth to them. Listening to words in songs often brings a barrage of images into my head, and with reading as well, it is often very easy to visualize and interpret things in different ways. At this moment everything was just perfect and tranquil. We are driving through the night in a suburban town, and every building and all the lights made for a beautiful, spacious scenery. It appeared more 3d than usual, almost as if distance was exaggerated, yet can still tell the actual distance. Everything is visually appealing, fun to look at. It's hard to explain, but there's a certain aspect to every surface, almost to be described of how much it is a surface, or how it is SO a surface.</p><p>Thoughts begin to focus on the space between me and what Im seeing, and how one could possibly contain it. Its just air, yet imagine captivating a small section of space in the air as your own, not just the air but the physical location. Next the slight smearing of lights in every direction caught my attention vividly especially at a stoplight, and its times like that when I notice things and think is it like that when Im not high? Cant remember. Then T said, imagine the path were traveling in. Sitting in a car, remove the car and see yourself from a 3rd person view. Traveling through space hovering over a road. What was this place like a few hundred years ago, with just trees? Is this entire society, everything we do, all just not supposed to be here at all? We were better off living simply off of nature in a very different lifestyle.</p><p>Very deep discussions often come out between us especially with weed. Were not even that high yet, but we both know were getting baked for sure from our dramatic change in thought patterns and discussions. There is an eerie sense of awareness and connectedness. Everything IS whatever it is to a new level. Closing my eyes and listening to the music was great, and the sounds automatically bring some kind of shapes or colors to mind with closed eyes. Upon opening my eyes, I felt delayed as if I really had to process and take in what I was looking at. Might have taken 3 or 4 seconds extra to 'come back'.</p><p>We arrive at cvs and get out of the car. As were walking in, Im pretty much compelled to jump down the set of four stairs and run for a couple seconds and jump. Normally that wouldnt happen, Id just walk down the stairs and walk at a normal speed. Its definitely the caffeine because I was a lot more energized than usual (baked or not, I dont usually run and jump like that). Conversations were easy and effortless, the laziness and tiredness were definitely masked quite a bit, although still not that baked yet. Nobody we knew were at cvs, except my friend knew the cashier. Of course that was just the funniest thing ever, and my friend T recalls a past experience, bringing us both to some uncontrollable laughter, although we are careful not to be obnoxiously loud. After we bought a drink and left, we went to a restaurant and got some soup. We stayed for a while, enjoying complimentary free wifi and the great food and atmosphere.</p><p>It is during this half hour or so in the restaurant that the brownies effects kicked in full force. Afterimages become more noticeable, and a lot of things are funny as hell, like being a little kid again. A table of middle aged people chatting it up reminds us of Tim and Eric. Higher contrast in colors, blacks are very dark and everything is kind of saturated, with a bright glowing graininess, typical weed visuals. Attractive people really stand out as looking gorgeous. Its easy to read the expressions on peoples faces, with completely racing thoughts going through my brain about what they may be thinking or what they might be like. I would say I felt slightly more normal even though at this point I was VERY high. Normal as in not obviously high to someone, and more focused than usual. As it is kicking in more, I feel it coming in waves which almost massage my head and body. Waves of pure feeling and energy. Its hard to describe the feelings during this time, but it was very very euphoric and interesting body sensations. I would describe this come-up as the most intense and enjoyable part of the experience as a whole. A part where I could really just sit down and enjoy it the most.</p><p>I did get really uneasy after a while, then I realized the bad feelings were coming from the fact that I had to pee and was feeling pretty uncomfortable but not even realizing it. I went to the bathroom, and there was music playing. I didnt know it was music at first and thought I was being talked to, although I didnt answer because I didn't really hear or understand what was said. Then realized it was a song. After peeing I felt much better. I went back and sat down, and we both realized we needed to get out of there soon, it simply wasnt the right environment. I dont know what it was, but we both felt the need for a change in scenery. We sat in the car not even moving or doing anything for about 15 minutes. No music or anything, just being there. We cruised around for a while after that and then went to get some more food. We werent starving, but it had been at least an hour since soup and we were still hungry for a bit more. Maybe its the caffeine but neither of us got nearly as hungry as when we smoke or vape, we werent eating excessively or anything.</p><p>Nothing too eventful happened after this, we just went to my house and ate our food and watched tv. After an unknown amount of time, T falls asleep, and Im yawning as well. Interestingly an hour or two after this I wasnt tired anymore. The high gradually lessened in intensity over time, but I keep getting occasional waves of it. I was using my computer and realized my fingers were sort of trembling, occasionally making a typo of hitting a key twice or a nearby key. Now as I am writing this, I have a TON of energy. Its 4 am, I feel like I dont have much more to say.</p><p>As far as weed brownies go, these were above average, definitely got us pretty fuckin high. However it shouldnt be compared because this was a unique high for sure. Im mainly writing this report because I was disappointed in the lack of documentation on caffeinated marijuana brownies. Hopefully it wasnt too boring to read, as we did have a very uneventful night compared to usual. To sum it up I would describe the effects as a happy, euphoric, energetic high, with slightly less social awkwardness and an urge to do things which can disappoint when there is seemingly nothing to do. There is definitely some jitteriness and you dont seem to appear high to people, though they might think youre on some kind of drugs. If you havent (or have) been high on weed brownies before, I would recommend trying them with caffeine if you can, because I felt that the high was a bit more manageable and it was great to be that high without wanting to lay around doing nothing. Definitely a different experience, and it seems to come in waves. Its now at least 10 hours since consumption and Im loaded with energy. Next time Id eat one of these in the morning instead of evening.</p><p>Yes, I could just drink a cup of coffee and smoke but the difference is that caffeine (like marijuana) lasts much longer when digested. An interesting note as I finish this report is that it is now almost nine hours since I consumed my brownie, and at the moment I am not tired at all. Normally Id have gone to sleep by 12 or 1 at the latest without question. Probably earlier if I had eaten a plain ol weed brownie. I also feel a little bit high still, although I didnt notice it during most of my time writing this. The peak effects have long since worn off, although I wouldnt say Im back to normal quite yet, and occasionally I will feel really high for 30 seconds or so. Waves of highness and energy seem to almost alternate, although both are present simultaneously as well especially during the peak about 2-3 hours in.</p><p>If anyone else tries this, please submit a report because Id love to read it!</p>",
 "year": "2011",
 "id": "89132",
 "gender": "Male",
 "age": "17",
 "timestamp": "2011-10-27T07:00:00.000Z",
 "views": "15141",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": ".77 g",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(cookie / food)"
  }
 }
}
