{
 "id": 8917,
 "title": "Narcotic Stress Reliever",
 "date": {
  "submission": "2007-06-14T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "AnimiC",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Pharms - Temazepam",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "liquid"
  }
 ],
 "report": [
  "The most noted experience to date was the nite I'm am curently recording this. My previous attempts have been altered states of control of my body and mind. These doses were at ranges of 15 mg to 30 mg. For my body weight and size I assumed that 45 mg would be enough to break my threshold.",
  "At the designated time of 9:00 I took these after class, by 10:00. I had eaten 2 hours previously heavily. I was feeling the effects. My motor skills were noticably altered and off kilter. Going up an down stairs was a task of great caution and it seems most other psysical funtions were also also affected. My mental/judgemantel state though was fairly coherent and able to speak and discourse rather normally. The effects lasted a few hours and before I knew it I was drinking some vodka and feeling back to my tamazempam journey.",
  "My previous dose trials have also shown that small doses (10-15mg) are enough to relieve anxiety during a bad hallucigenic trip (musroom expeirence) as well as for normal life (mild enough to calm a psyche). More importantly the drug helps with sleep by making the body feel suceptable to sleep rather than making one drugged/drowsy. No sickness no bad tripping yet, more narcotic stress reliver than mind trip."
 ],
 "erowid": {
  "id": "52108",
  "citation": " AnimiC. \"Narcotic Stress Reliever: experience with Temezepam (Restoril) & Alcohol (ID 52108)\". Erowid.org. Jun 14, 2007. erowid.org/exp/52108",
  "substance": "Temezepam (Restoril) & Alcohol",
  "views": "31183"
 }
}
