{
 "id": 8919,
 "title": "Humbling Experience for Seasoned Traveller",
 "date": {
  "submission": "2002-01-11T08:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "The Professor",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "I was in Amsterdam, and didn't know about the drug -- got it at a 'Smart Shop,' eager to try it.  In my tiny hotel room, alone, I filled a bowl.  The TV was on.  Nothing happened, so I smoked a second bowl.  Waiting. . .",
  "Zap!  I was somewhere else, a place without three dimensions.  I think it had two dimensions, but I'm not sure.  I felt frightened and smothered.  I couldn't breath.",
  "Visually, everything was both the same and not the same.  Grand colorful patterns in constant motion, but when I recall what I saw it was my small hotel room.",
  "The voice on the television, (I don't understand Dutch) was saying things right to me, directly addressing my situation.",
  "In the same way as a lot of other people reported, I had completely forgotten that I had smoked the drug.  I was scared.",
  "And there was a lucid part of me that said, 'You're in a foreign country, and you've gone completely insane, and they will have to carry you out of here in a straightjacket, on a stretcher.'  What will happen to me?  There was no question that I would never be able to escape from this two dimensional world where I could not breathe and did not know how to move.  I was in a lot of trouble.",
  "I screamed.  I think what I said was 'Help!'  Really dumb to yell help in a hotel in a country not one's own.  At that point I came pretty much down and was expecting the Dutch police to break into my room at any moment.  I ran out in the hall and down the steps so they would not find me and a few minutes later came back into my room feeling foolish.",
  "I was shocked!  In the '60s I was the acid superman.  If people told me that 1/4 of Mighty Quinns (a local acid) was scary, I would take two wholes.  But this stuff scared the shit out of me. ",
  "I looked on it as a challenge, and tried it a number of times more.  Each time I was frightened, and forgot that I had taken the drug. The second time I thought I had greatly improved because I had managed not to scream.  The third time I managed to maintain some Yoga breathing, but my breath came in and out of a pink volcano.  All my consciousness was in my breath, but I was still scared, and it was all that I could do to keep from losing myself in the fear.",
  "I tried it a few more times but never got good control.  I still have some but will save it until I feel ready, or until I get a good guide. ",
  "I wish someone had been with me to keep me focused."
 ],
 "erowid": {
  "id": "5211",
  "citation": " The Professor. \"Humbling Experience for Seasoned Traveller: experience with Salvia divinorum (ID 5211)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5211",
  "substance": "Salvia divinorum",
  "views": "8375"
 }
}
