{
 "id": 8920,
 "title": "In the Zone",
 "date": {
  "submission": "2008-07-21T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Starclassic",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>First before I get started with my story let me tell you a little background information about myself. I am 18 years old and am what I would call experienced in many different drugs and different types. Regular marijuana smoker, occasional drinker, also into psychedelic drugs and have always been a pretty big fan of cocaine. But this was only the second time I tried adderall. The first time I tried adderall I cannot recall what the dose was. Possibly 10 mg which is not much. I popped the pill in my third period class in school expecting nothing. Nothing did happen that day except I felt a little better and aced a english oral presentation. This experience compared to the one I am about to describe is drastically different.",
  "About one month after that experience I got my hands on another adderall pill. This time I made sure to read the dose, it was 20 mg time release. When I got home from school I planned to lift some weights pop the adderall and start to read voraciously for one of my classes. After I swallowed the pill I went straight to reading, I found it hard to concentrate though and almost as if I had gotten dumber. But the effects had not come into play just yet. 45 minutes passed and it hit me. During this time I completely forgot I took the adderall to begin with. An over whelming sensation of self confidence and appreciation of life came over me. Very similar to the first line of coke I blew.",
  "I was astonished by these effects because this didnt happen the last time I took adderall. I was now in too good of a mood to just read. I was alert, I was confident I could do anything I wanted to do and it would be pure goodness. I decided to lift more weights. I did a series of reps for my chest and biceps. About an hour and a half had passed and I still felt 'good' so I decided to play drums. I got carried away on the drums for about two hours. I am a very good drummer but usually am not motivated to play because it becomes monotonous, but I was in the zone at the time. When I was finished with the drums the time flew by, it was already 9:00 pm. The fact that it was already 9:00 seemed incomprehensible to me.",
  "It had now been 5 hours since the ingestion of the adderall and I figured the effects were going to be wearing off. I couldnt have been more wrong. The high effect that didnt have the 'good feeling' to it persisted until about 11:00 pm. I didnt feel good at all at this point. I decided it would be a good idea to just get some sleep and forget about everything and go to school tomorrow. I laid on my bed for what seemed like a very long time. Coming in and out of consciousness a myriad of times. When the frustration got the best of me I looked over that the clock, it was now 1:15 am.",
  "There was just no way I was going to go to sleep after the adderall so I figured there was no point to fight it. I should have known I would not have been able to go to sleep that night being a person who has a history of sleeping problems. But at the time of ingestion I didnt realize adderall was like taking speed, and to think millions of kids have prescriptions to this stuff!! I flopped around the rest of the morning/night frustrated and upset at my failure to go to sleep. I knew it was going to kick my ass when I had to go to school.",
  "At about 6:30 I went to take a shower and eventually got to school at 7:30, although I still was not tired and my body did not seem to be fatigued at all. I questioned myself numerous times whether or not I was still high or was it just the feeling of lack of sleep? All day at school I was miserable and depressed but not even close to being tired. That was the feeling through the whole day.",
  "Now I am home typing this right now still not tired and a little scared that I will have trouble sleeping again tonight. I really have not experienced anything like this and I have done grams of coke at a time, but after the coke a horrible crash ensues and I can usually catch a few hours of shut eye, that just didnt happen here.",
  "Adderall however did make me feel extremely good. Good about myself, good about others, good about everything. When I was in the zone playing drums I could have banged out three books in that time. The 'good feeling' was not worth what seems like an eternity of shittiness that seems to follow.</p>"
 ],
 "erowid": {
  "id": "52113",
  "citation": " Starclassic. \"In the Zone: experience with Amphetamines (Adderall) (ID 52113)\". Erowid.org. Jul 21, 2008. erowid.org/exp/52113",
  "substance": "Amphetamines (Adderall)",
  "views": "18272"
 }
}
