{
 "title": "Not Sweating Like I Was Before",
 "author": "jerkbagosaurus",
 "citation": " jerkbagosaurus. \"Not Sweating Like I Was Before: experience with Methadone,  Buprenorphine & Naloxone (ID 89213)\". Erowid.org. Aug 23, 2011. erowid.org/exp/89213",
 "substance": "Methadone,  Buprenorphine & Naloxone",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Methadone",
  "",
  "",
  " ",
  "",
  "Pharms - Buprenorphine",
  "(daily)",
  "",
  " ",
  "",
  "Naloxone",
  "(daily)"
 ],
 "report": "<p>I couldn't find much good info on smoking methadone.  All too late, I discovered that my initial insuffulation of (about 8 mg, weird, right?) methadone was extremely painful, but not just because I was doing it off my friends hardwood floor. I wouldn't ever recommend it.  The burning was worse than anything I've experienced, including snorting molly, though the pain didn't last as long.  The unfortunate thing was that it barely took effect on me and I had to go home and smoke the rest of the small amount of heroin I had...and it worked...which isn't supposed to happen after you take methadone, right?</p><p>Anyway, I had a couple little chunks of methadone left and, well, let's just say that sooner or later, probably sooner, I will be facing some pretty significant opiate withdrawal - about six months of mostly smoking heroin, injecting a little, taking the random dose of vicodin to calm my nerves and, of course, snorting suboxone [buprenorphine + naloxone]. </p><p>So, last night I decided to give it a whirl. I smoked a couple small chunks and my brain felt weird...but was it even taking effect?  I know that small of an amount can seem extremely insignificant to the average opiate addict, but I swear it did something. And, well, I'm either pretty tired right now from not sleeping much last night or that small piece of methadone I smoked actually did something. I am certainly not sweating like I was before.</p><p>In conclusion, it tastes pretty awful and, really, why would I ever try to smoke it when swallowing it is a tried and true method?  Note: the aforementioned account was the first and only time I've tried methadone.  Another note:  my tolerance to opiates is sort of low due to the fact that the amount of suboxone I've been taking has been 1 mg or less for the past week, about the same amount of time its been since my last dance with sweet lady H (half a gram of 'okay' grade).</p><p>Nonetheless, six months of practical nonstop using will wear on a person (ME!), but I'm so close to kicking, but sooo close to losing my mind and relapsing.  Send your prayers out for me tonight.  'Dear God, are you there?  If so, please help the junky who posted his junky story on the internet and please help all struggling junkies, or at least the ones that don't lie and steal to support their habit.  Thanks, God, you crack me up sometimes.'</p>",
 "year": "2010",
 "id": "89213",
 "gender": "Male",
 "age": "25",
 "timestamp": "2011-08-23T07:00:00.000Z",
 "views": "7973",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Methadone"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": " ",
   "substance": ""
  },
  "2": {
   "time": "Pharms - Buprenorphine",
   "amount": "(daily)",
   "administration": "",
   "substance": " "
  }
 }
}
