{
 "title": "This is Really Addictive, Annoying and Scary",
 "author": "Esteban de Sade",
 "citation": " Esteban de Sade. \"This is Really Addictive, Annoying and Scary: experience with Products - Bath Salts & Products - Spice and Synthetic Cannabinoids ('Spice 99 & Mr. Nice Guy') (ID 89244)\". Erowid.org. Feb 20, 2011. erowid.org/exp/89244",
 "substance": "Products - Bath Salts & Products - Spice and Synthetic Cannabinoids ('Spice 99 & Mr. Nice Guy')",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " repeated",
   "insufflated",
   "Products - Bath Salts, Plant Food, etc",
   "(powder / crystals)",
   " T+ 9:00",
   " ",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "",
   " T+ 0:00",
   " ",
   "smoked",
   "Tobacco - Cigarettes",
   ""
  ]
 ],
 "report": "</p>[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.] </p><p>I have tried a brand of bath salts before that didn't give me a euphoria or anything really, it just made my nose and face well-numb.  I know I just got a lousy brand of bath salts.  It was $30 a gram, now it's up to $40 at that same store.  I can't remember the name, I just know it didn't look very impressive either.  Anyways,  I knew there must be some real 'legit' bath salts out there, so I tried another.... I went to a different store, and bought a 1 gram package, again for $30.   Little did I truly know that I was going to have a most horrible night and  following day.  The brand name is SnowBlind.  The Directions on the back of the card say:  'Take a small amount and add it to bathwater.  The pack is equivalent to 10 baths.  Limit One (1) bath per day.  Ingredients: Epsom salts, Sodium Bicarbonate, Sodium Chloride, Minerals, Trace elements and naturally occurring amino acids.'</p><p>OK so I got the 'Bath salts', its around 7 or 8 pm on Saturday night.  Well I'm in an inconvenient setting, I'm a a small but crowded Mexican restaurant with my mom.  I go in the bathroom, most definitely AFTER eating, I waited to try the bath salts.  I guess I should have seen something telling me it's bad, the little baggie, was decorated black with gold skulls on it.   I was using the long point of pen cap to do 2 small bumps in the bathroom.  It stung just a little, but i did feel a burst of energy.  My mom had to go to the drug store, and while I sitted and waited for her, I did bumps with the key.  It was great.  I was most definitely feeling kind of paranoid, looking around as I'm doing bumps.  Well she came back out and we headed home, me to my room and lock the door!  Well, I got plans, I'm going to do some more of this stuff and I'm going to play my keyboard, listen to cool music, and watch some good movies?  Hell NO!   Not for long anyways.</p><p>Anyways, the stuff was GREAT feeling, it made me feel energetic but VERY VERY paranoid, it felt better than cocaine to be honest, because I didn't have the usual teeth/jaw grinding,  Also, I wasn't really 'numbed', but the euphoria was very intense.  So I listened to some great songs at very low level as not to wake my parents.  Then I checked out some Facebook stuff but didn't really want to talk to anyone.  The stuff lasted a very long time, compared to what I've usually got, with cocaine anyways. But even about 3 hours after my last line, I started getting jittery, and wanting more. I was determined to save some for the following day if I could. My heart was beating like hell. </p><p>I had to pee really badly (always got to when doing this stuff), and my pee always comes out darker than usual and pungent.  I imagine this stuff must not be too good for the kidneys.  Unlike cocaine, I'm constantly smoking cigarette after cigarette while on cocaine, but on this 'bath salt', I only smoked 2 cigarettes the whole night, and rolled a king-size cigarette of a mixture of Spice 99 herb and Mr. Nice Guy.   I went outside and smoked about half of it, about 4:40 a.m.   I came back inside the house and I heard this horrible moaning and wailing.  It was my grandmother, her sugar had dropped way too low and she was acting as if she were having a stroke, I had to go wake up my father and tell him grandma is acting up, he finally gets her to eat some sugar.  It scared me to death, hearing that sound, and seeing my grandmother like that. </p><p>So my parents went to church and I stayed home with grandma, she was alright when the morning came.  I went to the bathroom and stayed what seemed like forever because I wanted to try some things, meanwhile I am still cutting out lines, making them perfect, it takes me forever to get it right where I want it.  Well, I know this may sound really gross and unnecessary, but I was trying to give myself an enema too so that I could put some of the bath salts in my anus, which is a sure way to get very high, well the enema didn't work so well so I scrapped that idea.</p><p>So since I wasn't going to do that, I was going to see if I could cook it up like 'crack', so I got a few drops of water, a small bit of baking soda and a good bump of bath salts and mixed them together well, put in a spoon, and I started heating it.  Something was obviously happening, but I was so paranoid and thinking that my parents or my grandma could walk in any minute, plus this stuff I'm cooking up here smells horrible and will raise questions.  So I stopped cooking it before it smelled any worse or my parents came home and just licked the spoon.  It's around 1pm Sunday.  So no, nothing with that either, so I just got the last of the bag, which is about 2-3 good   lines left.  Still, taking forever to cut them out, wanting to make sure every white speck is there.  And how I stare at it when I do it, how long I take, and I just know that very soon, it's going to be all gone, but hell at least it's not as expensive or hard to get as cocaine, and it's better, but the comedown is even harder than the comedown off of cocaine.  </p><p>My parents got home from church, brought me a burger, I didn't/couldn't eat it, and I stayed hidden in my room for almost the whole day.  I only went out to smoke a cigarette twice today.  But things have still been pretty bad....  I probably had my last line around 4pm, and since then, every white speck I see, anywhere, I''m licking it, tasting it, hoping it's more.  I've been the same way on cocaine but not for long usually, I mean I was scraping the powder that had caked up inside the straws and piling it up and re-sniffing.  Anywhere that bag of 'bath-salts' had touched, I could swear I could see little traces of white powder, I was licking everywhere, CD cases, my Ipod case (which I used to snort most of it from), my bedsheets, my fingers, I licked every possible thing I could think of where any residue could be.  My dresser, the crumbs from my pockets were licked clean, I couldn't get on this computer and put anything together for being distracted by the 'White Specks' I saw everywhere on my bed and although they probably are more of a mind/eye game, I just can't get that through my mind at this point because I want more.   I would stick my fingers up my nose and if anything had crusted up there, in my mouth it goes. 10pm and I'm still wide awake, been awake the entire previous night. In many places, I saw dust and powder and lines that weren't really there. I sure saw it though, or I thought I did. I looked down at my shirt, see if I got any powder on my clothes, I'm licking my shirt....  yeah.</p><p>Other negative things I noticed was a tight cramp in my left hand for a moment, my neck twitched once painfully, easily sweating from the armpits and forehead too. I'm so glad nobody ever saw me on this. I already feel like I should be in the nuthouse now.  Will I do it again? If I have the money and time, most likely, I probably shouldn't do it alone though or at home around my parents where I will be stuck hiding in one room all day. I just got to do something during the next comedown to keep from thinking 'white dust, specks, powder, everywhere, lick here, lick there.'</p><p>Thanks for reading,  hope you don't hate me too much</p><p>Esteban</p><p>[Reported Dose: '1 gram over a period of approximately 18 hours nasally']</p>",
 "year": "2011",
 "id": "89244",
 "gender": "Male",
 "age": "30",
 "timestamp": "2011-02-20T08:00:00.000Z",
 "views": "27304"
}
