{
 "title": "Extreme Depression After First Time",
 "author": "jjjackie",
 "citation": " jjjackie. \"Extreme Depression After First Time: experience with MDMA (Ecstasy) (ID 89291)\". Erowid.org. Jan 31, 2011. erowid.org/exp/89291",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "115 lb",
 "report": "<p>I tried pure MDMA on New Year's Eve at a rave for my first time. I had taken an ecstasy pill that turned out to be ineffective before taking the MDMA.</p><p>Shortly after taking the MDMA, I lost my friends (the rave was huge) and since I had no phone or no way to contact my friends, I was left alone to enjoy myself and hope for the best. Understandably, the experience was a little overwhelming. I went to the bathroom for 10 minutes to calm myself down. Luckily, the onset of the MDMA chilled me out. Instead of dancing, I gave new friends massages (and received them, of course) and was shown a couple light shows with rave gloves. I ended up finding my friends after the rave and all seemed well. The next day, I woke up with newfound energy and optimism and determination to eliminate negative people from my life and explore new love interests.</p><p>However, this is where the story takes a turn for the worse. Two days after taking MDMA, a deep and forboding depression took hold of me. I began to question and second-guess myself in everything I did. I was overcome with intense anxiety...I couldn't stop worrying about anything and everything and how it was my fault. I became suicidal, had panic and anxiety attacks every other day. I lost control of my thoughts - new perspectives (negative, self-hating ones) entered my consciousness and I felt a complete loss of my identity. I felt like I couldn't feel emotion anymore - as if my brain was devoid of love and understanding of others. This spiraling out of control sent me to a therapist who (because of his questionable 'therapy' methods and relentless manipulation) convinced me that my life was a wreck because of my 'attitude.' I was so mentally vulnerable that my therapist implanted new insecurities  that didn't even exist before the whole debacle.</p><p>My family has a history of mental illness, depression, suicide, schizophrenia. Maybe the MDMA messed with my brain chemistry to the point where it was unbearable for me. In any case, It is now 3 weeks later and I'm picking up the pieces of my brain and trying to get back to how I felt before the crash. I'm on 2 different anti-depressants and I feel foggy and aemotional, still. I hate putting these pills into my body and messing with my brain chemistry even further, but I fear for my  own sanity at this point.</p><p>I've lost trust in myself to keep it together and lost lots of confidence. Hopefully, I'll get it back.</p>",
 "year": "2010",
 "id": "89291",
 "gender": "Female",
 "age": "17",
 "timestamp": "2011-01-31T08:00:00.000Z",
 "views": "10636",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "MDMA"
  }
 }
}
