{
 "title": "Next-Night Seizures",
 "author": "Steve",
 "citation": " Steve. \"Next-Night Seizures: experience with Products - Spice and Synthetic Cannabinoids ('Apocalypse'?)  (ID 89290)\". Erowid.org. Feb 3, 2011. erowid.org/exp/89290",
 "substance": "Products - Spice and Synthetic Cannabinoids ('Apocalypse'?) ",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Products - Spice and Synthetic Cannabinoids"
 ],
 "report": "<p>This occurred on New Years 2010 - 2011</p><p>I had a regular kind of new years party with a group of my best friends.  We didn't have any regular weed and because my girlfriend is hunting for a job I wouldn't have been able to smoke it anyway.  We had a moderate amount of alcohol around, although no one was getting plastered.  My friend J had purchased some spice product recently (I believe that it was called 'Apocalypse' or some such name).  Because I knew that it passed standard drug tests, I asked him to bring it along.  Although I'd read some bad publicity online, I disregarded it, thinking that it was due to teenagers carelessly smoking way too much.  A hit or two couldn't hurt, right?</p><p>I took two even hits of the stuff from a one-hitter and it gave me a rushing high a lot like really strong weed.  My hands felt really tingly; sensations were too amplified; it was hard to fish a lighter out of my pocket, etc.  It began to fade out an hour and a half later.  It was stronger than I could have predicted it would be.  I was told later that I got a little pale.  It was a lot like weed but felt less natural and wasn't entirely pleasant.</p><p>My girlfriend decided to take a hit a little bit after me.  Unknown to me at the time, she took a few more hits over the course of the night.  No big deal at first.  She had a good time that night and things ended on a positive note.</p><p>Unfortunately things were not so good the next night.  My girlfriend is epileptic.  As we were sleeping, about 4:00 AM on the second of January she had the worst seizure that she's had in three and a half years:  Convulsions for about 35 - 40 seconds and difficulty breathing.  It is now the 20th of January and she is still having minor seizures at night.  She takes an anticonvulsant drug which previously had suppressed this kind of activity.  I don't believe that this is coincidence.  She has never had this kind of reaction to alcohol or weed and this began literally the night after using the spice product.</p><p>I feel very guilty because instead of considering my girlfriend's best interest as my first priority I disregarded the warning reports online, particularly about K2 overdoses causing seizure-like symptoms.  This in favor of having a little bit more fun for one night.  She's suffered a lot because of my stupidity.  She would never have tried the shit at all if it weren't for me.  If there was a heaven I'd pray to it that this shit didn't cause permanent damage to K's central nervous system.  I hope she feels better soon and that whatever traces of untested lab chemical eventually leave her body.</p>",
 "year": "2010",
 "id": "89290",
 "gender": "Male",
 "age": "30",
 "timestamp": "2011-02-03T08:00:00.000Z",
 "views": "8475",
 "dose": {}
}
