{
 "title": "Unusual Reaction Long Term Anxiety",
 "author": "inoxia",
 "citation": " inoxia. \"Unusual Reaction Long Term Anxiety: experience with Pseudoephedrine (ID 89306)\". Erowid.org. Jan 24, 2011. erowid.org/exp/89306",
 "substance": "Pseudoephedrine",
 "bodyweight": "60 kg",
 "report": "<p>Previous drug experiences include alcohol, cannabis, synthetic cannabinoids, mephedrone, cocaine, piperazines, bk-MDMA, methylphenidate, diazepam, zopiclone, dextromethorphan, diphenhydramine, and lysergamides.</p><p>Several months ago, I began using Sudafed (pseudoephedrine) tablets to deal with nasal congestion. At this time I had not consumed any drugs within at least two months, other than regularly drinking alcohol. I would generally consume one 60mg pill every morning. I soon began to notice unusual effects; a couple times I became extremely drowsy. More reliably, after consuming pseudoephedrine I would intermittently experience a very euphoric 'rushing' sensation which would make my whole body tingle. Enjoying the increased energy and rushes, I took higher doses on occasion (up to about 240mg, perhaps once or twice a week), while continuing the medicinal use.</p><p>After nearly a month of daily use, however, the experience began to change. There was one day in which I took only one 60mg pill in the morning, and that evening while sitting calmly, the skin-tingling rushing sensation hit me, but not like it had before. There was no euphoria. My entire body was tingling intensively (uncomfortably so) for at least thirty seconds, during which time I had severe tunnel vision. I thought I was going to lose consciousness, but luckily it passed. In retrospect, this seems to have been a withdrawal effect; in my defence, neither the pharmacist nor the manufacturer warned against long-term use.</p><p>Unfazed by this experience, I continued using pseudoephedrine as usual, perhaps 120mg per day on average.</p><p>A few days later, I again took 60mg in the morning. A couple hours after I took an over-the-country energy supplement (contains 'traces' of phenylalanine, which indirectly increases production of dopamine, adrenaline and noradrenaline - this may have contributed). I didn't eat that day after about 2pm. Around 7pm, I began feeling very dizzy and unwell, so I sat on a chair and tried to remain calm. I was noticeably tachycardic at this point, and within a few moments the rush hit me again. Extreme thirst, dizziness, static-like tunnel vision, chest pains, tremors, acute changes in temperature, intense tingling sensation. I fell to the floor, thinking I was having a heart attack. I may have lost consciousness briefly.</p><p>An ambulance was called, which took nearly an hour to arrive. In this time I slowly began to recover, though I sat in hospital all night still feeling disorientated. Multiple tests conducted (ECG, x-rays, blood, etc), and no explanation was found. Discharged the next morning, and a couple days later I was feeling fine.</p><p>Looking back, I know this was a panic attack; I have had a couple more since. Worryingly, this chemical seems to have altered my brain chemistry, as my body now reacts very badly to adrenaline. I can't exercise or take any drugs (even alcohol) as any moderate adrenaline release causes tremors, accompanied by fear and chest pains (most likely stress related).</p><p>Take care with pseudoephedrine; it seems to have some scary unknown side effects.</p><p>[Reported Dose: '60-240mg daily']</p>",
 "year": "2010",
 "id": "89306",
 "gender": "Male",
 "age": "17",
 "timestamp": "2011-01-24T08:00:00.000Z",
 "views": "13314",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Pseudoephedrine",
   "form": "(daily)"
  }
 ]
}
