{
 "id": 8933,
 "title": "A Psychedelic Legal High",
 "date": {
  "submission": "2008-08-24T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Jaycalzone",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 oz",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  {
   "time": "3:00",
   "amount": "9 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  },
  {
   "time": "0:00",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I wanted to experiment with nutmeg, as I have taken it a few times but haven't had any breakthrough experiences. I ingested about 0.5 oz. of nutmeg at 1:30 pm and it took me about 30 minutes to consume it all. I knew it was going to take several hours to hit the plateau, so I just went to class and waited. I ate 9 H.B. Woodrose seeds about 3 hours later, at 5 pm.  I was attempting to get both of the highs at exactly the same time, and let me tell you, I did.",
  "It must have been around 8:30 or a little while earlier when I noticed effects that I never have on any other drug, granted I haven't taken any psychedelics before. I was sitting at my desk and I noticed that the peoples' voices in the hallway stated to sound strange. They sounded distant and distorted, not to mention that the voices sounded much louder. A few minutes later, they sounded all jumbled up and I couldn't make out any single person as it was just a bunch of noise resembling people.",
  "Having this be a new experience for me, I got scared and really started tripping. At this point I lied on my bed and closed my eyes. Immediately I noticed my CEVs, a series of rainbow colored fractals and other random shapes with the same color pattern, like looking through a kaleidoscope. I opened my eyes and noticed that very similar OEVs were taking place as well, although they would become stronger later. They were not overpowering but they were very cool.",
  "Although I was still worried and skeptical of what was to come, I tried to relax, but things were just too foreign for me and I freaked out. I got off my bed and I was bombarded with such profound thoughts about myself and my life, what have I done, what kind of person am I, what if I die. All very serious questions that made me terribly uneasy and more scared. I remember reading similar reports with psychedelics, so I eventually was able to overcome my fears. To help calm myself down, I turned on some music, and I was immediately aware how high I was.",
  "I began listening to The Dark Side of the Moon first, and it was obviously playing much slower than usual, telling me that I was very high. I was wondering what would make the experience even stronger when I noticed my synesthesia. I had also read about this happening very frequently with psychedelics and it was then that which told me that I was officially tripping. I got very excited and upbeat because I had always to trip but I could never get my hands on acid. The first thing I noticed was that I could see the music, mostly in the form of the fractals and colorful shapes I had noticed earlier.",
  "I really saw I had visual hallucinations because I was watching South Park on tv and the characters were out of focus, blurry, or otherwise distorted. This was overwhelming for me so I turned off the tv. I now realize that watching the tv or a movie probably would have been very rewarding, so I want to try it next time I trip. I returned to my computer desk and tried to type to my friends, but the trails and visuals were too strong. The trails were so strong that I remember looking at my hands while typing and it was just a big blur of trails. It looked like special effects from a movie. This was one of the coolest moments of the night. I looked at the screen and it appeared to be magnified and coming out at me, also a very cool effect.",
  "I gave up typing because I really wanted to enjoy my trip and relax. Now that I was completely into the trip, I put Pink Floyd back on and this time it was even slower. It seemed like it may stop completely if I was any higher (and it almost did!) I then decided to grab some beers to see if they would multiply my trip. I was dehydrated from the nutmeg so drinking beer on top probably was dangerous (I was drinking water too). I noticed that because of the synesthesia I couldnt taste the beer or feel the burden of the carbonation. Therefore I was able to drink the beers fast and without problem. They hit me hard but enjoyably and greatly multiplied the high. The music sounded as great as ever and very rich and deep.",
  "All this while the OEVs were continuing to occur. Another note about the synesthesia: I noticed that I couldnt feel or hear myself breathe, but rather I could only hear a strange whistle or buzzing noise each time I inhaled. It sounds crazy, but it was very entertaining at the time. Four beers later I was the highest Ive ever been in my entire life. The trip is so smooth and enjoyable now. I put on St. Peppers and sit down to play Mario Kart next. The game was highly enjoyable and it seemed to be playing in slow motion. After playing it for some time, I decided to go back strictly to music. I sat at my desk and listened to another CD or two.",
  "I began to get very tired and I lied down in bed with Pink Floyds Animals playing. I must have fallen asleep sometime soon after lying down. Although it seems that I went to bed prematurely, the trip itself had worn off considerably and the psychedelic effects were all but gone. I was still very high from the nutmeg and the seeds had a lingering buzz that was enjoyable. I was able to sleep only for short periods of time all the next morning, but I wasnt too tired the next day. When I woke up I had a terrible ringing in my ears and a faint heartbeat, both of which worried me somewhat. I got up to get water and I noticed that I had blurry vision and the lights were so overwhelming in the hall that I almost blacked out. I could feel and see myself starting to slip into unconsciousness so I closed my eyes, grabbed a gulp of water, and quickly made my way back to my room to lie down.",
  "I drank a lot of water the next day and I quickly felt better, leading me to believe that if I had drank a lot of water during the trip I most likely would have no ill effects the next day. I have told all of my friends about my experience and I already have some people that want to trip with me soon. This makes me very happy. I plan on upping the dosage of both the nutmeg and the seeds for the next trip, hopefully wielding stronger results.",
  "Happy Tripping!"
 ],
 "erowid": {
  "id": "52159",
  "citation": " Jaycalzone. \"A Psychedelic Legal High: experience with Nutmeg, H.B. Woodrose & Alcohol (ID 52159)\". Erowid.org. Aug 24, 2008. erowid.org/exp/52159",
  "substance": "Nutmeg, H.B. Woodrose & Alcohol",
  "views": "18022"
 }
}
