{
 "title": "Rushed Thoughts",
 "author": "Average Dorm Kid",
 "citation": " Average Dorm Kid. \"Rushed Thoughts: experience with Products - 'Bath Salts' (ID 89421)\". Erowid.org. Feb 19, 2011. erowid.org/exp/89421",
 "substance": "Products - 'Bath Salts'",
 "bodyweight": "155 lb",
 "header": [
  "DOSE:",
  "1 bump",
  "insufflated",
  "Products - Bath Salts, Plant Food, etc",
  "(powder / crystals)",
  "",
  "1 line",
  "insufflated",
  "Products - Bath Salts, Plant Food, etc",
  "(powder / crystals)"
 ],
 "report": "<p>[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.] </p><p>I've always been curious about psychoactive substances, trying painkillers, computer duster, spice blends, weed and cigarettes. Recently a couple of my friends had been raving about this 'white rush' bath salt currently being sold at the local headshop; saying it was like cocaine and X combined. Having never taken a powerful stimulant before, I was curious. I quickly obtained a small sample baggie from a friend who did not want it, saying it seemed incredibly shady.</p><p>The experience:</p><p>I decided that I would get a taste for the chemical by taking a small key bump before my physics lab; it immediately gave me a mild rush. Within about 10 minutes I felt energetic, as though waves of energy were erupting inside of me; I also note that the texture of snowbanks looked intriguing. During my lab I came down and found it to mild and relatively painless.</p><p>When I got back to my dorm at about 9:00PM I decided to take a small, thin line, as advised by friends. The quick rush ensued, followed by a far more intense building of energy within myself. I quickly decided to make the best of this newfound mental and physical energy by writing an essay for my world cultures class due the next morning. It was incredibly hard to focus my rushed thoughts; however, the essay was finished quickly. During the peak of the experience I decided to invite some off-campus friends to my dorm to hang out (11:00PM), they took some white rush and we talked away.</p><p>Eventually, we decided to go sauna, which killed the physical portion of the high, and much of the muscle tension and upset stomach that comes with it. At around 1:00AM my friends decided to go back to their house, and I walked to my dorm room to sleep. Getting to sleep on this substance is nearly impossible; my mind absolutely refused to enter any sort of sleep or meditative state until about 4:00AM. This insomnia is not fun when you have a bad head cold, and is most certainly felt the next day. All throughout the next day I felt hung-over, and that feeling did not go away until I slept.</p><p>One final thing, I craved smokes like none other.</p><p>Your average curious freshman dorm kid.</p>",
 "year": "2011",
 "id": "89421",
 "gender": "Male",
 "age": "18",
 "timestamp": "2011-02-19T08:00:00.000Z",
 "views": "6901",
 "dose": {}
}
