{
 "id": 8943,
 "title": "A Case of Utter Excess",
 "date": {
  "submission": "2000-09-10T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Dj Shugar",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 cups",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 ],
 "report": [
  "A few weeks ago my boyfriend overdosed on GHB. I was utterly terrified at the events that proceeded.",
  "THE EVENING",
  "We had just settled in after I got home from work just to hang out and watch a few movies, nothing special. The new guy from work stopped by our house to drop off my waitress apron I had left there. He hung out with us for a bit, smoked some weed and asked if anyone would like some GHB. I refuse to drink the stuff under any circumstances because I have seen too much of its bad effects on girls, my boyfriend on the other hand will do anything offered to him and accepted the boy's offer. The bottle he had contained liquid that was the same color as Mountain Dew, (he had tinted it with food coloring to keep it from looking like water). My Boyfriend had had G before, once he had a small vial of about 1 gram, and another instance where he had about 4 capfuls. Both times he was in a good mood, and felt no unpleasant effects. The boy gave him about two cups (if one had put it into a measurung cup) in a plastic cup and gave us no indication of how strong it was or how much to consume. One of my girlfriends that was there had one cap, and another of our roomates 4 caps from the bottle he had with him. My boyfriend did not use a bottle cap to dose it and drank out of the cup. My girlfriend became very dissociated within 20 minutes or so, and went to lie down, falling into a sleep we could not wake her from, our other roomate fell ill in about 25 minutes and became violent and behaved as if he were drunk.",
  "My boyfriend felt nothing at all and continued to drink out of the cup. He drank about half of it before he felt anything at all. We went in to his room so I could give him a back rub because he said he felt like he was rolling (like he had taken ecstacy). He felt very giddy and drunk, and not at all unpleasant, and dispite my concern and numerous protests he drank the rest of the cup. he told me 'wait 20 minutes, you'll see, i'm fine'",
  "THE OVERDOSE",
  "Well 20 minutes later he disappeared from reality. We were doing what couples do when he started talking out of his head, saying disgusting and nonsensical things to me. I turned on the light and told him to get dressed but he kept laughing and mumbling to me, flopping around on the bed. At first I thought he was just trying to freak me out until he started drooling and making weird noises, and kept grabbing me and kind of wrestling with me. I tried to dress him but couldn't, I'm very small and he is rather large. His breathing became shallow and heavy and his eyes  had pinpoint pupils and kept rolling back in his head. He was twitching and couldn't make sense when he talked.",
  "Terrified, I went and got his roomate who's seen all kinds of OD's (an ex EMT) and we tried to get him into the bathroom to make him puke. He asked me 'how much did he take' and I said 'he drank all of it'.",
  "Laine told me he could easily die from a dose that big and we had to make him puke before he absorbed any more of it. He couldn't walk or open his eyes and he didn't know his name. Laine put a chair next to the bathtub and we draped my boyfriend over it by his tummy. The pressure of his body made him vomit profusely. we then doused him with freezing cold water to wake him up , which only made him violent. he tried to hit me and and yelled and swore and threw up again. After he threw up the last time he passed out.",
  "We took him to his bed and laid him on his side. we took his blood pressure and kept an eye on him. We were afraid to take him to the hospital because the cops would search our house. He twitched for three hours, comatose, then woke up and started throwing up again. He was fine  other than the nausea but remembered nothing from the whole night.",
  "I guess he didn't realize how lucky he was to be alive."
 ],
 "erowid": {
  "id": "522",
  "citation": " Dj Shugar. \"A Case of Utter Excess: experience with GHB & Cannabis (ID 522)\". Erowid.org. Sep 10, 2000. erowid.org/exp/522",
  "substance": "GHB & Cannabis",
  "views": "12566"
 }
}
