{
 "id": 8949,
 "title": "Complex White Misty Cloud",
 "date": {
  "submission": "2002-01-11T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "schrodinger",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "hit"
   },
   "administration": "oral",
   "substance": "LSD"
  }
 ],
 "report": [
  "I've recently read about Trey's experience on mixing LSD with mescaline, something about his recollection struck me as to how similar it was to mine, only I had just taken LSD alone.  One afternoon myself and a close friend did some acid, and experienced the usual tale of warped images, however approx 6 hours later when I thought that the effects were begining to dissipate, I was astounded to see something which was amazing and uncontrollable - and ultimately emotionally stunning. No matter how much I tried to change my focus on to something else, the things I were seeing remained.  These things or thing, was in fact a jelly like sheen which coated my whole body, which I could only detect by sight (at first).  It looked like what I imagine a drop of milk would look like suspended in geletine, sort of forming a minute yet complex white misty cloud, it hovered about an inch above my skin (not my clothes)  As I began to explore this occurence more closely - by looking at my fingers, I saw fleeting electrical sparks, the smallest I have ever seen, these electrical sparks seemed to be thinner than the finest hair and lasting only a fraction of a fraction of a second. ",
  "I later began to feel a strong electrical presence in the room (no sound) just a kind of what I would describe as a 'biological white noise' This white noise grew immense and loud - this is not auditory loud, it's more of a loud silence, maybe the opposite of sound?  anyway, I felt it engulf me and take me to the most euphoric place I have ever been, I sensed that this place was unlike the 3 dimensional life that I knew of, but more of a place where everying is purely emotional - purely thought - no mass no space.  Whilst in this place, I was convinced that the other presence formed part of me, and alway had been with me. Like Trey I felt that this presence was happy to know that I could finally acknowledge it."
 ],
 "erowid": {
  "id": "5223",
  "citation": " schrodinger. \"Complex White Misty Cloud: experience with LSD (ID 5223)\". Erowid.org. Jan 11, 2002. erowid.org/exp/5223",
  "substance": "LSD",
  "views": "3878"
 }
}
