{
 "id": 8954,
 "title": "A Bad Combo",
 "date": {
  "submission": "2007-06-26T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "DocGonZo",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "insufflated",
   "substance": "Amphetamines"
  },
  {
   "time": "0",
   "administration": "300 mg",
   "substance": "oral"
  }
 ],
 "report": [
  "A few hours after (6 Id guess) insufflating Adderall for my first time I took 3 100mg HCL tramadols (a great substance) in the hopes of getting rid of all my junky-ass shaking (get the same thing with blow, cant stop moving, esp. my lips). Luckily I didnt have to drive to school. Started out with extreme difficulty making my body move, couldnt get out of the car, couldnt help but gripping (like my life depended on it) a piece of paper I was trying to turn in, ect.",
  "Also I felt like my body was vibrating, saw double at times (and other light hallucinations), bad balance often made worse by seeing (and feeling) the world randomly and violently shaking. One really cool thing was I would keep on forgetting where I was for a second; I'd be sitting in the class room and just get this sensation of being somewhere nicer (like my home) and almost get up and walk out (like I would a room in my house)right before I caught myself and reminded myself where I was.",
  "I wouldn't describe the experience as scary or bad trip-esq (but it could of gone that way), but if I was a little greener or a little younger I would of lost it in the middle of class. Even keeping my cool, I had several close calls with faculty because of struggling with movement (described before). And dont let the fact I was at school seem like the problem, even sitting in a chill basement this could of gone a lot worse than it did. In addition to that, I believe the combo was extremely hard on my mind (mentally and physically) and body."
 ],
 "erowid": {
  "id": "52253",
  "citation": " DocGonZo. \"A Bad Combo: experience with Tramadol & Amphetamines (Adderall) (ID 52253)\". Erowid.org. Jun 26, 2007. erowid.org/exp/52253",
  "substance": "Tramadol & Amphetamines (Adderall)",
  "views": "23988"
 }
}
