{
 "id": 8962,
 "title": "They Told Me So",
 "date": {
  "submission": "2007-10-02T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Psycho active",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "9.0",
    "quantity": "9.0"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "tea",
   "specific": "P. cubensis"
  },
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "11",
    "quantity": "11"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "tea"
  }
 ],
 "report": [
  "On Christmas I had mushrooms, some of which I gave to my friends as gifts. That night I decided to make a mushroom tea for the first time as I wanted to trip hard to experience the voice phenomenon that high dose trips can elicit and the taste of dried Psilocybe cubensis makes me vomit which causes loss of precious psilocybin. I boiled approximately nine grams of mushrooms in a pan of water, added some iced tea mix, and drank it. For anyone that dislikes the taste of mushrooms this method is recommended as I have tried other methods to mask the foul taste by covering them in peanut butter and also letting soak in honey -- both of which are somewhat effective but when one makes a tea the taste is completely undetectable.",
  "My first mushroom trip was a real awakening for me; during it I thought that I had went permanently insane and afterwards was left with the impression that if such profound changes in perception were possible while under the influence of a chemical its likely that the phenomena of life is just one random moment in the entire history of matter; or rather, that consciousness is also a chemical byproduct and there is no meta-anything. The way I conceptualized this was that matter was cycling through all the probabilities and life was just one of them.",
  "During the trip however, this was not an abstract philosophical notion in the typical sense in which one may say Everything is meaningless, life is absurd, rather it was experiential understanding. It was as if the mushrooms had disrupted my normal ego dominated consciousness and let me fully consider the implications of this idea literally, also allowing me to experience this idea outside the context of language.",
  "I remember on Christmas, after drinking the second glass of deliciously potent psilocybin tea, coming up fast. I walked up the stairs to take a shower as is customary when I trip and by the time I got up them I was tripping so hard that I felt like my body was being guided by some external force. The shower has always been a favorite place for me to be while tripping; I love the sensation of being wet. It was during my first mushroom trip after an unknown amount of time that seemed to last for an eternity, throughout which I was desperately fighting for sleep as it was a school night and my body kept feeling as if it was switching genders and had fins. I took a shower and remembered my own birth and what its like to be in the womb. I still dont know how to integrate this experience.",
  "When I got out of the shower I was instantly catapulted back to a mind space I have only ever experienced previously during my first trip on seven grams. My thoughts were echoing and I felt like I was at a carnival inhabited by crickets. This time however, I knew what to expect and knew that this was not psychosis and I wasnt going to die. I felt like I had been struck by a psychedelic lightning bolt; everything I looked at was brilliant patterns, even the air. I immediately thought of Terrence McKenna, a prominent figure within the psychedelic community who provided commentary on ethno-pharmacology and the nature of the psychedelic experience; I thought of a statement he made that the mushroom is a trans dimensional doorway. What he was saying was that mushrooms are the interface between the physical and the realm of idea. I was ecstatic upon this reflection to then realize that I was currently experiencing this phenomenon. I could feel thoughts slipping into my body. My fingers buzzed with information. Then the doorbell rang.",
  "My friends were at the door wishing me a merry trippy Christmas as we were all tripping. Truth be told, I was somewhat irked that they had stopped by because their presence left me unable to perform any inner exploration. Time progressed and someone put on some put a mixed rap CD that had me on vibe for a while until a couple of my other friends called me and asked if it would be alright if they stopped by to smoke a blunt with us. Naturally there was no disagreement. They arrived shortly after and it wasnt difficult for them to figure out we were all tripping as I could barely control my laughter throughout the phone call and when they had arrived. I was tripping the hardest and had gone into an age regression trips and could barely speak.",
  "After the blunt everybody had to take off and as one friend received a phone call from her brother and  freaked out as the mushrooms had caused her to relive a traumatic childhood experience. They abruptly left and the tone of events leading up to their departure caused my previously carefree hallucinogenic state to turn into a state of panic. While beshroomed I decided that everything in my life was a mess and I frantically started cleaning. Another wasted mushroom trip.",
  "On the first of January of this New Year I returned to my apartment after a night of contrived friendships mediated by alcohol excited to perform an experiment involving psilocybin mushrooms. The day before I bought a little under an ounce of shrooms but by the next day ended up with only a half as I sold some to some friends of mine who wanted to get fucked up and party. After all, it was New Years Eve. That night I drank some, did a bump of ketamine, and passed out relatively early compared to my friends that were tripping all night.",
  "New Years was different. The procedure I followed was almost exactly the same as on Christmas. I boiled the mushrooms (eleven grams this time instead of nine) and then went to take a shower. Went I got out of the shower as I walked to my room I felt again that I was not in control of my body but this time it was accompanied by a couple of voices that were talking to each other about me. They were concerned for my well being and planned on teaching me something. I sat down on my bed and placed a pen and notebook at my side so I could write down what the mushrooms would say.",
  "I was able to see this maw of information as it was being conveyed to. Something characteristic of mushroom trips is that theres this filmstrip like quality: Im shown moments, actions, other people, and ideas it wants me to see. There has been some talk about tryptamine based hallucinogens such as psilocybin and how they aid in developing a more prefect logos and the empowerment that occurs within the linguistically inclined individual when they are consumed. The mushrooms spoke to me about the emergence of a new articulate consciousness, of a generation liberated from the current social trends of power and control. For hours I laid there in my bed, teary eyed, with my body squirming in complete intoxicating ecstasy while this transmission continued.",
  "Afterwards, I was intrigued to note this idea of an emerging consciousness is not an isolated theme. From trans-humanist to chaos magician, everyone is talking about the unprecedented capabilities mankind is heading towards in terms of understanding the nature of consciousness and learning how to harness its potentials. However, predictions as to what the future holds in deciphering the mystery in my opinion is sophomoric in that one cannot know the potentials until one has a firm grasp on what it constitutes.",
  "Thoughts, dreams, and hallucinations are the intangible experience we externalize all the time. For example: language. The physical construction of a word carries no innate meaning; it is the idea-experience that it correlates to that has value. Think about this in terms of the macro world; the Newtonian hallucination that one is accustomed to deteriorates as one goes smaller into to the quantum realm where particles take on radically different behavior. If one takes into account the fact that all mammalian brains produce the hallucinogen N, N, Dimethyltryptamine I don't think its a far jump to say that hallucinations perpetually create and structure reality. Seeing faces on the moon or in ink blots, believing that there's some sort of communication going on when looking at the lines on some box that bleeps and bloops --if you're reading this you're hallucinating.",
  "Mainstream science passes hallucination off as irrelevant because the shining characteristic of western thought is that it only deals what is physically quantifiable and empirical demonstrated. If any sort of ethereal substrate exists, or if there are forces yet discovered within the physical universe that would better explain the nature of consciousness, then hallucination must be studied beyond nondescript experientially empty metaphor that psychology so narrowly defines under the paradigm of mental health. Simultaneously, there has to be research into the physiological basis of consciousness in order to fully understand the circumstances from which it arises."
 ],
 "erowid": {
  "id": "52270",
  "citation": " Psycho active. \"They Told Me So: experience with Mushrooms (ID 52270)\". Erowid.org. Oct 2, 2007. erowid.org/exp/52270",
  "substance": "Mushrooms",
  "views": "3730"
 }
}
