{
 "title": "Changed Me Forever",
 "author": "electricgod",
 "citation": " electricgod. \"Changed Me Forever: experience with Products - Spice and Synthetic Cannabinoids ('Red Magic') (ID 89673)\". Erowid.org. Feb 25, 2011. erowid.org/exp/89673",
 "substance": "Products - Spice and Synthetic Cannabinoids ('Red Magic')",
 "bodyweight": "150 lb",
 "report": "<p>I've smoked weed many times in my life, since I was about 16 years old.  So when my boyfriend got arrested, and went on probation for a few months, he was being randomly tested and could no longer smoke.  To keep being able to get high, he started smoking red magic, and me, feeling guilty, started with him.  The first few times I smoked spice was really good.  It was extremely similar to weed, even with the amount of time that the high lasted.  So we just smoked red for a while, not thinking anything of it.</p><p>One day, I had a couple of friends over to smoke, since we had just bought another gram of red from the local head shop.  We didn't have a bowl, so we made one out of a water bottle and tinfoil.  I took two large hits, and it hit me almost immediately, like it almost always does.  It was good at first, like it always felt.  But then it turned bad.  My back porch suddenly felt like it was swaying, like I was on a boat.  I actually remember saying, 'guys, I feel like we're on a boat right now'.  After that, it started to come on even stronger, and my heart was pounding so hard in my chest I thought I was dying.  I've never done any other sort of drugs besides weed, so I was freaked out.  I started screaming, and my boyfriend had to try to calm me down.  I sat on the couch, but everything was spinning, and I kept seeing so many colors.  I decided to try to go to sleep so that I wouldn't have to be awake during this terrible experience anymore.</p><p>I went into my room, and laid down in my bed, but it was impossible for me to sleep because I kept melting into my sheets.  Every time I closed my eyes, I tried to count backwards from 100 to fall asleep, but each number vibrated in a bunch of colors in my head overtime I saidit.  I gave up on sleeping and went back out to the living room.</p><p>Eventually I started to come down, and things started getting funny (I kept feeling like butter was squeezing through my teeth every time I clenched down), and I had pretty much come down all the way about a half an hour later.</p><p>I have to say though, it was probably the most unpleasant experiences of my life, and I never want to feel like that again.  It completely changed me, and ever since then I can't enjoy weed anymore because I have panic attacks.  I've also developed really bad anxiety disorder since then.  I often have to take xanax to fall asleep at night because I'm so afraid of leaving reality after that experience.  I wouldn't recommend this drug to anyone.</p>",
 "year": "2010",
 "id": "89673",
 "gender": "Female",
 "age": "18",
 "timestamp": "2011-02-25T08:00:00.000Z",
 "views": "9113",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids",
   "form": "(powder / crystals)"
  }
 ]
}
