{
 "title": "Lovely Discovery",
 "author": "Toad",
 "citation": " Toad. \"Lovely Discovery: experience with Products - Other Chemicals ('Stain Remover', speculated to be 4-Methylmethcathinone) (ID 89694)\". Erowid.org. Feb 25, 2011. erowid.org/exp/89694",
 "substance": "Products - Other Chemicals ('Stain Remover', speculated to be 4-Methylmethcathinone)",
 "bodyweight": "195 lb",
 "report": "<p>I do not know exactly what is in the legally obtained packet that I have now sampled on 4 different occasions.  Thats a little frustrating, that in this nudge-nudge-wink-wink fringe legality that we are currently dealing with, the information available on the products is limitedone thing this isnt is what it is labeled as, which is stain remover.  Anyway, broadly speaking, it is Meow.  It is an absolutely wonderful addition to my life, and I will be using it regularly.</p><p>I have insufflated it and I have mixed it with water and drunk it.  I will discuss drinking it (250 mg of the particular brand I have been using mixed with cup or so of water, down it all at once), which gives what I think is a stronger high, and it also gives me a moment of fairly strong nausea about a half-hour after consumption. I havent yet actually succumbed and puked, but its something Im coming to realize is part of the deal if I drink this stuff. No big dealIm actually already high by then and feeling like all is right, so I just take this nausea in stride, and it passes pretty quickly.  StillI wont drink it on an empty stomach.  The other physiological reactions I note are sweating pretty profusely during the initial rush, and a bit of heart racing. </p><p>It comes on strong and fast15 minutes after drinking it, Im feeling it, 20 minutes is stronger still, and it continues to increase up to about 40 minutes after consumption, when it levels off for a great, ecstasy-like ride that lasts until about two hours after consumption.  I dont note the same abrupt comedown that others do, it fades out nicely for me.  I am able to resist any urge to redoseor give in to that urge, as the situation calls for.</p><p>Among the features of the high for mekeeping in mind, this is drinking it mixed with water, and I do think that produces a different high than insufflatingare: A rather interesting time distortion during the first rushmoments linger as time slows down.  A strong mood elevationlife is good, and this reminds me that I know that.  I want to tell the people I love that I really do love them.  Music, which can be the foreground of many highs for this music lover, fades to the background while I contemplate life and love and friendship.  There are no visual or aural hallucinations, and this is not a psychedelic experience, its a bliss thing. </p><p>I dont lose touch with reality, but am rather overwhelmed by realitys silver lining.</p><p>As I write this, I have obtained this legally, in a perfectly above-board commercial transaction, using a credit card.  I want this situation to continue [...] This stuff is pretty strong.</p>",
 "year": "2011",
 "id": "89694",
 "gender": "Male",
 "age": "49",
 "timestamp": "2011-02-25T08:00:00.000Z",
 "views": "9880",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Products - Bath Salts, Plant Food, etc",
   "form": "(powder / crystals)"
  }
 }
}
