{
 "title": "One Month of Daily Use",
 "author": "SWIM",
 "citation": " SWIM. \"One Month of Daily Use: experience with JWH-018 (ID 89712)\". Erowid.org. Mar 17, 2011. erowid.org/exp/89712",
 "substance": "JWH-018",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "sublingual",
   "JWH-018",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Just finished one month of oral daily use that started at 5mg twice a day and with a build up of tolerance was somedays closer to 15mg. On a couple Saturday nights used alcohol that negated the effects and did as much as 30mg over 10 hour period of drinking. This was product out of China that was tabbed at exactly 10mg and was scored for easy splitting. I knew the manufacturer. It could be smoked but I chose to do it sublinqually.</p><p>Generally stimulating and a handful of times felt fearful and insecure while peaking, began to feel a general sense of growing insecurity with chronic use probably similiar to what chronic weed users experience. Nothing to report in the way of obvious medical issues although I suspect I was banging my liver a little, had mild stomach pains at time and increased frequency of bowel movement with very dark stools.  Urine dark and more concentrated and it felt like a diuretic most of the time with increased frequency of urination. No heart rate spikes. Do not feel I was poisoning myself as at least one person reports with chronic use and hospitalization for toxicity. But did not have any lab tests either.</p><p>Did try to do some accounting work while high and found myself stumbling on simple equations when at a level of high that created mild insecurity and fear psychologically. Did this months use without telling my wife or anyone else and it was easy enough to get away with. However I knew I was stumbling along some days psychologically through peaks and valleys and cannot really tell you whether I was being hurt psychologically from the drug other then even I knew that the subtle underlying introversion and fears over time were compounding themselves and I decided to stop and not risk permanent psychological or physical effects.  First 24 hours after quitting felt a little tweaked but pretty normal as far as psychological strength and ability without lingering fear.</p><p>To me my experience with JW can be summed up similarly to my experience with chronic use of GHB.  It was mostly fun and appealing but it required more and more to obtain similar effects as first experienced such as euphoria or sense of well being.  And after a while it failed to deliver and chronic lingering doubts and fears were building over dependency, and damage.</p><p>I think we need to know more about the chronic health effects before we can conclude anything. But for me it was highly psychological and sensual and stimulating and beyond some paranoia and fear when a little peaked I suffered no permanent problems as far as I can tell and physical dependency was not evident after one month of use. I can see how some people could become psychologically addicted as it clearly stimulates and changes my perceptions of world for up to 8 hours or all day depending if I rehit orally. I did not ever experience a physical crash or depression when stopping similar to stimulants.</p><p>Not very scientific and I am sorry I am kind of wishy washy about its effects and potential for problems.  Again it reminds me of my feelings about GHB. Great fun but take a little bit more then I should and I may have to pay one way or another.</p><p>I think someone who has no experience or does not review others experiences will most likely take too much and either be stricken with a major panic attack or overly stimulated or both and end up in the ER freaking while they are peaking.  But I am not sure whether you could kill yourself as the respiratory depression that they saw in rats was at 10mg/KG  my God that is 100 times more than the maximal one time dose of 10mg I took. I would have loved to have seen liver tests, and urine tests, to see if there was a toxicity associated with chronic ingestion orally.</p><p>I hope that helps someone</p>",
 "year": "2010",
 "id": "89712",
 "gender": "Male",
 "age": "55",
 "timestamp": "2011-03-17T07:00:00.000Z",
 "views": "12180"
}
