{
 "title": "A Paranoid Dream But Soothing",
 "author": "LittleTripper",
 "citation": " LittleTripper. \"A Paranoid Dream But Soothing: experience with Products - Spice and Synthetic Cannabinoids ('Zone') & Various (ID 89737)\". Erowid.org. Feb 25, 2011. erowid.org/exp/89737",
 "substance": "Products - Spice and Synthetic Cannabinoids ('Zone') & Various",
 "bodyweight": "124 lb",
 "report": [
  "<p>Daily medicine: lamotrigine 100 mg, concerta 72 mg, and risperdal 1 mg",
  "Age: 15",
  "Gender: male",
  "Weight: around 124 to 130 pounds",
  "Height: 5'4",
  "To start this experience out I want to say that I am under age only being 15. Although I have tried my fair share of mind altering substances such as cocaine, meth, heroin, dxm, LSD, morning glory seeds, ambien, many opiates, klonopin, ecstasy, adderall, Ritalin, and other prescription stimulants, marijuana, crack (only on one occasion not understanding what it actually was) and spice products like k2. But my experience with spice zone was really intense but not the most intense by far.",
  "Okay to get into the story my best friend as I will refer to him as L stayed the night. We waited until my parents went to sleep and we snuck out to smoke a joint of zone. As we were about 3/4 of the way through I was quite light headed and my friend was jumping up and down saying he felt so heavy. We finished it off and headed back into the house for some reason we stood up for about 5 minutes whispering and L claims he is not high he only is pretending to be high because he infact is high if that makes any sense to you. He couldn't stop laughing but I only laughed a little. I wanted to talk about serious stuff like girls and drugs or school however he wanted to watch cartoons and laugh stupidly. I felt as if i wasnt in my house and everything had a dreamy twist but i was uncomfortly paranoid. When I stated we should watch tv for a couple of minutes then turn it off and talk he called me a bitch and told me to shut the fuck up. Now usally we don't fight because we are best friends since 5th grade us being in 10th. I was surprised but the high soonly dissipated as soon as it came on and L wanted to smoke another joint so I rolled one baby up.",
  "We get about half way done and we quit due to paranoia from me but not him. He presumed to cuss and call me names. But it's like I built up a tolerance and the second joint didn't really affect me but it affected him. So we went to bed and woke the next morning refreshed although I was still light headed. Overall it was a good experience so I will be finishing my 3 gram bag in the near future. I suggest zone to people as long as they don't have anything to do or parents around due to the fact it was very intense.</p>"
 ],
 "year": "2011",
 "id": "89737",
 "gender": "Male",
 "age": "15",
 "views": "4904",
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Lamotrigine ",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "72 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "1 mg",
   "administration": "oral",
   "substance": "Pharms - Risperidone",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "1.5 joints/cigs",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids",
   "form": ""
  }
 ],
 "submissionDate": "2011-02-25T08:00:00.000Z"
}
