{
 "id": 8976,
 "title": "Experimenting with Assiduity",
 "date": {
  "submission": "2006-06-22T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Dr Robert",
  "gender": "Male",
  "weight": "65 kg"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Coffee",
   "form": "(liquid)"
  },
  {
   "time": "0:30",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I am a 15 year old 65kg male.",
  "Prior to this experiment I had tried both substances. I acquired the Methylphenidate (Ritalin, or R's as they are known here) from a friend with ADHD. The coffee came from the kitchen.",
  "I prepared by crushing the contents of two capsules of the aforementioned substance into a fine powder, and, after locking my bedroom door to assure myself of complete safety from discovery, made one line of it, and snorted it in one go. I would say it stung a bit, but it was absolutely nothing in comparison to some other rather peculiar antihistamines I have snorted.*",
  "(*It is the most painful thing I have ever done. I would rather have my limbs hacked off with a blunt machete.)",
  "My mindset was slightly depressed, hopeful that this would aid my mood (for however long), for I had used it for that purpose before successfully (although at smaller doses). Very little fear, because of my familiarity, and quite tired (insomnia).",
  "I had drunk the coffee 30 minutes previous and snorted the 'R's' at 5:30. I had a slight headache from some Promethazine I had taken the day before to fall asleep (130mg oral), but I don't feel that it had any (save the disappearance of the headache) impact on the experience.",
  "At first, after snorting, I had the usual placebo feeling of elation about the coming experience, and also a slight feeling of dread, strange as it is to say, for I was wondering if perhaps this dose was to large for insufflations. My nasal passage and upper throat felt as though they were inflamed (not painfully) or enlarged, so I was a little worried that I would asphyxiate or have to tell my parents. It never became painful or to bothersome, and it subsided very quickly after I ate dinner (I ate before the appetite depressing effects came about, so no nausea). By the way this is not usual.",
  "At approximately 5:55pm, I could distinctly feel the effects of the drug. For me, it is a pleasant feeling of concentration and sociability, combined with a great euphoria. Wonderfully pleasing, especially compared to my otherwise rather dull life.",
  "Probably the most pleasing aspect of the entire experience was the fantastic leaps and bounds I made in bonding with my fellow siblings. Normally, in a tired and grumpy state, I find annoyance in my brother and sister very quickly, but now I could tolerate the most pestering occurrences without even considering retaliation in any form. I conversed extensively with my little sister on the relevance of Christianity (she is 8) and then watched a Led Zeppelin DVD with my little brother, discussing every movement of Jimmy Page's holy hands, and every gaily effeminate movement of Robert Plant, for hours.",
  "At approximately 9:30 everyone was in bed. I went into my room, where I 'pulled a Descartes' so to say, or wrote down what I knew, 'I am thinking therefore I exist', and drew very enlightening (although very materialistic) conclusions from this knowledge. I was awake until 4 the next morning, and experienced something I call 'concentrating my self to sleep'. Incredible, but it had never occurred before.",
  "All in all, highly pleasant, with no come down or anything, due to the fact I slept that part off. Normally the experience is accompanied by an afterglow of a few hours, and then a crash, which feels as though you are very tired but calm (it is pleasant for me).",
  "I enjoyed every part of this experiment, and will do again, although being very wary of addiction. I do this about once or twice a month now, and I have no trouble with physical addiction, as my friend will give it to me no more than this (a good pal)."
 ],
 "erowid": {
  "id": "52315",
  "citation": " Dr Robert. \"Experimenting with Assiduity: experience with Coffee & Methylphenidate (ID 52315)\". Erowid.org. Jun 22, 2006. erowid.org/exp/52315",
  "substance": "Coffee & Methylphenidate",
  "views": "22227"
 }
}
