{
 "title": "Mosaic Madness",
 "author": "Guru",
 "citation": " Guru. \"Mosaic Madness: experience with DMT (ID 8979)\". Erowid.org. Aug 24, 2001. erowid.org/exp/8979",
 "substance": "DMT",
 "bodyweight": "181 lb",
 "report": "<p>HISTORY:</p><p>I have been experimenting over the last 3 months with N,N-DMT from MHRB( about 6 doses to date ). I chose this source because of descriptions of a higher incidence of visual experiences as mentioned in other reports on this site (Erowid ) and on others.</p><p>VALUE:</p><p>I'd like to say first, I think having the Experience Vault all in one place in these searchable digital formats is invaluable and necessary to propagate a 'harm reduction' strategy for new users and  people interested in finding out what available substances can possibly do to you and not have to take the word of your friendly neighbourhood dealers :)</p><p>It's important if we are all to change the future of the perception of drugs to the general public to reduce the number of negative incidences through education and shared experience.</p><p>Which I guess leads me to my contribution to the experience archives.</p><p>THE TRIP:</p><p>It was 11:24 am in my living room sitting on my couch getting ready to lay back, moderate lighting, windows closed, I had put 100 mg of DMT mixed with about 10mg of green tea leaves as a substrate, in a hand water pipe. I had some moderately loud Dub music playing, unplugged the phone and was in a serious but pleasant and clear mood. I took a small toke with little smoke exhaled. I took a huge smooth toke, held it for about 5 secs and exhaled large.. I started 1 more toke, then my visual reality started to liquidize and colours started to run really fast, not like my previous experiences, where it had come on slower, so i barely put the pipe down, trying to lay back and closed my eyes.</p><p> Before my eyes were even shut, I was pretty much not aware of my body or what had just happened or anything except massive mosaic patterned matrices, and huge floods of information with maddeningly looping thoughts... I felt quite confined in my thinking and some of my predominant thoughts from the last few days and minutes before hand were playing over and over.. definate aztechy motif to it all.</p><p>I opened my eyes what must have been about 3-4 mins later and i could see my reality ( living room ) but it was just overwhelming liquid colours moving everywhere so I closed my eyes again..</p><p>I had lost my sense of time, but when I finally was able to open my eyes and kinda get a grip and focus on things it had been about 5 mins total, and I wasn't able to stand up right away. Over the next few mins, second by second, the visuals receded and I was able to walk around a bit disoriented exclaiming 'Holy fuck', 'that was fucked up' repeatedly.</p><p> For the following 20 mins when I closed my eyes I could see geometric intricacies and had some moderate euphoria...</p><p>Now a couple of hours later... right back to baseline operating as confident and co-ordinated as if nothing had happened. No after effects whatsoever, and no residue psychosis.</p><p>CONCLUSION :  I went in this time seeking, some sort of spiritual answers and or entity knowledge or something profound. I was disappointed in the fact I felt like I was in a maddeningly state of  psychedelic delirium (which is entertaining) but no real 'meaning' or lesson.</p><p> Definitely satisfied my curiosity (for a few months) and lends a huge amount of respect for the 'set and setting' importance of powerful psychedelics.</p><p>RECOMMENDATIONS : I highly suggest you place yourself in a natural organic, 'noise' free environment for larger doses of this for best effect. But I guess comfort and mood are the biggest influencers of your trip. BIG RESPECT for this compound.. it's fast and heavy, but clean with no lingering residue.</p>",
 "year": "2001",
 "id": "8979",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-08-24T07:00:00.000Z",
 "views": "30098",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "DMT",
   "form": "(powder / crystals)"
  }
 }
}
