{
 "title": "Another Addictive Zinger",
 "author": "Sprout",
 "citation": " Sprout. \"Another Addictive Zinger: experience with Methiopropamine (ID 89821)\". Erowid.org. May 11, 2011. erowid.org/exp/89821",
 "substance": "Methiopropamine",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "insufflated",
   "Methiopropamine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I am, I suppose, one of those people called a psychonaut. I recently seemed to develop an incurable interest in British research chemicals. Now I used to be a Methamphetamine addict so when they came out with a new one called Methiopropamine I was immediately interested and I ordered a ridiculous amount: 10 grams!</p><p>When I received it it was a white powder with only a slightly chemical odor to it. Thinking I had found myself a nice new zinger (that's what I call my collection of legal stimulants) I measured out several lines of 20 mg each. I snorted one and sat down to wait. The drip was not unpleasant and I soon felt very stimulated. However, I had this inkling that perhaps a bit of euphoria was coming my way, so I had another line.</p><p>The second line gave me a good kick so I had another.... I think you get where this is going. Pretty soon I was measuring out another batch of lines, 30 mg this time.</p><p>Was it fun? Well yeah. I was zooming around doing this and that. I thought I was being productive but after a while, all I really wanted to do was space out and listen to rock music.</p><p>As the night approached, I realized I would not be needing to sleep. I stayed up all night doing whatever came to mind and. After a one hour nap at 6 AM I started a new day of snorting.</p><p>This went on to the third day. That third night, I began experiencing chest pains and headache. However, the thrill of it all was so compelling that I continued to use it despite my growing fear that I was going to have a heart attack. I started hallucinating too. I was seeing things move in the shadows and hearing all sorts of sounds: people screaming, people copulating, weird watery alien sounds, etc.</p><p>The next morning, I finally admitted to myself that this was getting out of control. I knew I could not control my use of this stuff so I gave it to my wife to flush down the toilet. She gladly obliged.</p><p>I crashed and slept all day and night. The next day, as expected, I had some really mean cravings. The cravings continued for about a week. Let me tell you, this stuff is not quite as euphoric and speedy as actual Methamphetamine; however, it is way stronger and more effective than any of those Cathinone derivatives that are out there and I would not be surprised if the majority of people who buy this stuff  get a little out of control. In fact, I remember being very impulsive. I am glad I did not do something really stupid while under the influence of this stuff.</p><p>Conclusion? This really has all the negatives of crystal meth, 4MMC, and MDP V etc. If you want to get crazy and high it will probably work for you. However, I really think this is bad stuff: it makes you careless, it is potentially toxic, and most certainly addictive!</p>",
 "year": "2011",
 "id": "89821",
 "gender": "Male",
 "age": "31",
 "timestamp": "2011-05-11T07:00:00.000Z",
 "views": "29573",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Methiopropamine",
   "form": "(powder / crystals)"
  }
 ]
}
