{
 "title": "Asleep with Open Eyes",
 "author": "Vicious",
 "citation": " Vicious. \"Asleep with Open Eyes: experience with Diphenhydramine (ID 8984)\". Erowid.org. May 13, 2004. erowid.org/exp/8984",
 "substance": "Diphenhydramine",
 "bodyweight": "270 lb",
 "report": "<p>Diphenhydramine Hydrochloride, a chemical compound that I will NEVER forget!  It all started in February.  I was a first-time ecstasy user, and quickly fell in love with it.  I used to smoke cigarettes and drink liquor heavily, until that beautiful little pill met my stomach.  I was brought on to ecstasy by a friend of mine, and they say that anyone who offers you drugs is not your friend, but I do thank that person from the bottom of my heart for allowing me to experience such a wonderful feeling.  The experience I felt with diphenhydramine hydrochloride was a complete 180 of what I was expecting.  It was a Wednesday night when I was first introduced to Diphenhydramine.  A friend of mine recommended it to me, to quote on quote 'bring back' my roll from yesterday.  Now keep in mind, I still had ecstasy in my system.  It's about 10:30p.m. when I decide to drop (7) pills.  Coming out of a white lttle Unisom bottle, are 7 little, clear, beautiful blue gelcaps. </p><p>11:00 p.m.- I'm back at the studio where I work.  I start to feel a funny tickle in my tummy.  Sort of like the feeling that one gets when their roll is about to start.  (i.e: tingling, clammy hands, muscle relaxation, etc...)  30 Minutes into the drop, I start experiencing visuals.  My first visual was that of blood cells (under a microscope) but they were transparent.  My next visuals were on the black curtains that are inside our studio.  I began to see a transparent (outline) of someone's face chatting away, meanwhile another face appeared within that one.  At this point, I am freaking the fuck out!  Not even an hour has passed by when I start hearing things.  (audio hallucinations if you will) I hear doorbells ringing, car doors slamming, my mom (who keep in mind lives out of town) calling my name. </p><p>I would call this experience paranoia, but not REALLY paranoia, more like involuntary schizophrenia.  I recommend trying this once.  Just to say you've done it.  If you enjoy the trip, then you may consider trying this trip not excessively, due to the unknown side-efx this may cause in the long run.  But if you're going to trip, trip out in a quiet room, no TV, no radio, nothing.  Look at your TV screen (black) and start to visualize things that you thought you'd never imagine. </p><p>DJ Vicious</p><p>TX</p>",
 "year": "2001",
 "id": "8984",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-05-13T07:00:00.000Z",
 "views": "21955",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "350 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(gel tab)"
  }
 }
}
