{
 "id": 8984,
 "title": "Why did I do that?",
 "date": {
  "submission": "2001-03-01T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Daphne",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "DXM"
  }
 ],
 "report": [
  "Last night was the last time I'll ever do DXM.  For the most part I have had pretty good experiences, although the effects started to lessen the more I did it.  I had been looking forward to last nite for awhile in hopes of having a nice trip.  I went out with my friend to go see a movie after ingesting about 500mg of DXM.  I don't quite remember how soon the effects started, but one thing is, neither of us remember the movie at all.  We tried to talk to each other during the movie, but found it very hard to do so at times. ",
  "Once the movie was over, we attempted to leave, finding it pretty hard to walk by this point.  We got to the car and just sat in it for at least 20 minutes.  There was a huge truck parked next to us, and looked so close to our car.  We couldn't even back out of the parking space because the truck was so close and we feared that other cars would be coming down the parking lot and hit us.  Finally some people came out of the theater and got in the truck and left.  We could finally leave and get to my house since we had no clue what else to do. ",
  "[Erowid Note: Please people, don't drive while under the influence of substances like DXM which can significantly impair one's coordination.]",
  "We arrived at my  house and just layed on the floor looking like idiots.  I felt like I was floating in the air and not touching the ground at all.  I think we tried to talk to each other, but I don't know what about.  After a while my friend left to go home.  I felt really weird after this; I couldn't think or see straight and my heart felt like it was pounding.  I tried to get a reasonable amount of sleep, but I still felt very tired after waking up.  I also felt completely worthless.  I felt like there was no point to anything anymore, especially taking DXM.  I got nothing out of last nite; I don't remember a lot of it.  I am never touching DXM again.  I find absolutely no point in it at all."
 ],
 "erowid": {
  "id": "5235",
  "citation": " Daphne. \"Why did I do that?: experience with DXM (ID 5235)\". Erowid.org. Mar 1, 2001. erowid.org/exp/5235",
  "substance": "DXM",
  "views": "11535"
 }
}
