{
 "title": "The Miracle in the Medicine Cabinet",
 "author": "A. Gold",
 "citation": " A. Gold. \"The Miracle in the Medicine Cabinet: experience with Diphenhydramine (ID 89859)\". Erowid.org. Nov 29, 2012. erowid.org/exp/89859",
 "substance": "Diphenhydramine",
 "bodyweight": "147 lb",
 "header": [
  "DOSE: T+ 0:00",
  "375 mg",
  "oral",
  "Diphenhydramine",
  "(pill / tablet)",
  " T+ 0:31",
  "75 mg",
  "oral",
  "Diphenhydramine",
  "(pill / tablet)"
 ],
 "report": "<p>My mom had left home with her boyfriend and assured me she would be back incredibly late; at least 3:00 A.M.  I decided that this would be a perfect night to have a Diphenhydramine (DPH) trip. That night I was home alone (except for my little sister, but she was only 9, so I figured if she had any suspicions, or saw me acting strangely, I could relatively easily talk my way out of it). I had tried Diphenhydramine before this in very small doses (under 150mg) in the form of generic sleep aids. I had done much research on the drug after realizing that with slightly increased doses, I could obtain a comfortable sedated state. This was when I discovered the fact that if DPH was taken in very high doses, intense effects could be achieved.</p><p>During this experience I was in a rather strange living predicament. My older sister had seen a mouse in the basement room she lived in, so she moved into my room, and I took hers (she was gone that night too). This was only a temporary move, so she left all of her decorations and pictures in the room. To tell you the truth I didnt mind it, I thought mice were adorable and the room was A LOT bigger then my tiny four corner room. It also had a TV, computer (didnt work at the time), and a couch. I really wasnt complaining about it. I think that the fact that I was in a dark basement for most of the trip was why I had the effects that I had.</p><p>My mom gave me a hug and a kiss, told me to be good and watch over my little sister, and left the house at approximately 8:00 P.M. This was when I went into the medicine cabinet, and collected 16 Benadryl capsules, slipped them into my pocket, and went downstairs to my sisters room.</p><p>I decided that the night was still young and I would wait at least a little bit before ingesting the capsules. I went into my sisters basement room, slumped on the couch, and turned on the television. After watching a bit of South Park, I got bored and decided to surf through the channels. Nothing was on at all, and we have about 500 channels, so I decided to search through the recordings. As I looked, I saw that my all time favorite movie, Fight Club was recorded. I got extremely excited about this. I fucking love the movie Fight Club; almost to the point of obsession. I can watch it through 3 times and still want to see it again. The fact that I had Fight Club recorded put me in a very good mood. After watching the movie about 1/4 of the way through, I realized taking the Benadryl would be a great idea now because of my familiarity with the movie, and proper mindset.</p><p>It was exactly 9:47 P.M. I made sure I knew the exact time of ingestion. I took all the Benadryl out of my pocket, counted out 15, and downed them all with a large glass of water. I had a moderately full stomach too. The only reason why I ate before this was because I had heard of people who take it on empty stomachs, and get pretty nauseous a few minutes after taking them.</p><p>At 10:02 P.M. I begin to feel a bit nauseous and am getting a little heartburn. I dont fully know if the heartburn was from the Benadryl, or the little bit of chipotle I ate prior to this, but I go up to take a few Tums, for the heartburn, and make myself some tea with ginger for the stomach nausea. These both work well for what they were intended, and I returned to my basement to continue watching my movie (still Fight Club).</p><p>At 10:18 P.M. I am still waiting for the effects to kick in. at this point I started to get annoyed with the wait so I went upstairs and took 3 more Benadryl capsules with my remaining ginger tea. I start to become slightly paranoid the time I have done this before I lose my balance a lot, and get increasingly clumsy. This wouldnt have been a problem in my room, but my sister had fragile things of value that I did not want to knock over. I also didnt want to fall on something and injure myself. As a result of this paranoia, I began to try and high-proof the room. I moved all things of value that could break to a safe location, outside the room. I wrapped tops of small tables, and sharp desk and chair corners in cushions. After about 10 minutes of high-proofing, I felt a lot better and safer than before.</p><p>At 10:36 P.M. I am beginning to feel the wonderful sedation that I get when I take this in small amounts. Also Since I am a Type-1 (insulin dependent) Diabetic, I get paranoid and quickly run upstairs to get my reaction candy, blood-sugar tester, and insulin vials and syringes. I test my blood-sugar and it is 163: Near perfect. This settles my slight paranoia a little and I am in a great mood again. I turn the T.V. up, and continue to watch Fight Club.</p><p>It is now 10:51 P.M. and I am starting to feel the lovely sedation this gives me in small doses, except magnified greatly. It is becoming really easy to stare off into space for a long time. I am so relaxed. I also experience some quiet auditory hallucinations. Nothing really cool, just beeps, and whispering, but when Id try to pay attention to them they would not be present anymore. So far this is looking like a good trip!</p><p>The time is 11:23 P.M. It is incredibly hard to focus on what is going on in the movie, so I give up on trying to watch it and rewind it to the beginning, so I can hear the fucking amazing opening song, and watch the axons and neurons and neurotransmitters and all the stuff in Jacks brain it shows (if you have seen Fight Club you will know what I am talking about). I watch it and I am finding it really trippy. I am in heaven right now. The amount of sedation I experience at this point is at a perfect level.</p><p>About five minutes later, (I keep rewinding the film to hear the opening theme) I am laying on the love seat, head and feet propped up on the arms of the couch with my eyes closed. This was when I had my first visuals. In my eyes when I close them and am sober I see little blobs, probably like most of you do. This time I sure wasnt just seeing blobs though. They would take on specific little shapes and patterns. Closing my eyes showed me my own little world. I loved it. But thats only because I hadnt experienced open eyed visuals or hallucinations yet</p><p>It is now 11:35. I get off of my couch and pause the music to go to the bathroom (I have to piss a lot on Diphenhydramine). I do my business, and my piss is really hot and dark yellow. This worries me a bit because of my diabetes (if my blood sugar is high and I dont drink a lot of water, my piss comes out dark yellow). I decide I should go and test my blood sugar. I am about to leave my bathroom, (in the basement) when I think I see a man jump behind a box near my storage area. It catches my eye immediately. I get incredibly paranoid at this. I grab a dagger lying nearby (I collect knives), and say out loud, STOP! DONT FUCK WITH ME! I HAVE A KNIFE. I then realize this could just be a homeless man trying to get a good place to rest and I say (once again out loud) Look dude I didnt mean to scare you, I just am on drugs and am really fucking paranoid. You have to understand When he didnt respond I became slightly discouraged and decide to just walk away. I did not know any of this was a hallucination at the time.</p><p>I walk back into my sisters room, and decide I am really fucking bored; I need human contact or some contact from the outside world. I go up stairs to the computer (the one in my sisters room is slow), and talk to a few close druggy friends on Facebook. I told them what I did and how fucked up I was. After I got a little bored with that, I decide I need some good music. I look up the Fight Club opening song on a music website, and listen to it. Also I look up a song by Green Day called Boulevard of Broken Dreams. I have only heard that song on the radio and it was a strange occurrence that I even thought of it then. Anyway I was listening to the music, and it was fucking orgasmic, and intense. My little sister came into the room and I was really happy to see her. I just started to talk to her about a bunch of random things and was being really social with her so she decided to actually sit down next to me and continue talking to me.</p><p>I was acting kind of dumb so I think she was entertained. This was not a good thing, however because I was about to hit the peak of the high. I became very weird. I would get excited and try to explain something to her and the I would doze off into space. She seemed a bit worried about me so I decided to avoid suspicion, and I talked my way out of it by saying I pulled an all-nighter the night before and was really tired. She believed me and told me to get some sleep because I was actually really scaring her.</p><p>I went down into the basement and into my sisters room. I looked all around the room; there were a bunch of little fluctuations in the air that looked like evaporating gasoline. I then stood in the doorway and stared out into the storage area of my basement. I looked at my garage door and above and to the right of it, there was a spider that looked like it was made out of silver pipe cleaners. It looked like it was dancing around or something. As I looked more, I realized it had a circle of steel pressed to the wall and its leg was in between the steel and the wall and it was trying to get out. I casually walked back to the doorway and watched it further. I must have stared at it dancing for 20 minutes. Suddenly it broke free and began to crawl the rest of the way up the wall to the ceiling. This is when my trip turned very, very bad. The spider began to crawl towards me on the ceiling. The way it moved was the scariest thing Ive seen in my life. I ran into my sisters room and slammed the door, and locked it.</p><p>It was getting late (I think it was around 2:00 A.M.), and I figured I should try to get to sleep. I turned off the lights and laid down, incredibly uncomfortable. I was experiencing horrible dry-mouth this entire time. I knew I had a bottle of water on the night-stand. I tried to reach for it but my depth perception in this darkness was terrible. I felt like I was reaching out a mile and I still wasnt able to get it. I was so uncomfortable and itchy that I had to get up. I just needed to move a little. It was a bad idea to do that in the dark</p><p>I got up to walk around and once I got to the other side of the room, I tripped on my sisters treadmill. This wouldnt have been that bad, but my couch was right there. I came down on top of the couch. Nice and cushiony right? Nope. When I fell, the arm of the couch, which was fairly uncushioned, came up right under my rib. It was the scariest thing of that night I think. It knocked the wind out of me. And since it was impossible for me to breathe, and I didnt know it was going to end, I literally thought I was going to die. After about 20 seconds though I was able to catch a breath, and was alright. I got up and turned my light on.</p><p>On a medium dose of DPH (200 mg-350 mg for me), in my vision, there is tiny swirls that show up in random places. They twist and untwist. When on a higher dose, I can mistake these for bugs that are see-through. In very high doses they are not see-through, but are the same color as whatever I'm looking at (this is the way it works for me at least).</p><p>When I looked at the ground I mistook the swirls for spiders that are the same color as my sisters carpet. Her carpets color is Well lets just say I thought they were what I called tiger spiders. I lay down on my bed and am extremely confused. I really want out of this experience. I open my sisters door and look at the bottom of my basement stairwell. There are a fuckton of spiders down there! Including one of the big tiger spiders I saw. I stood staring at it for awhile and decided I had to do something or these things were going to eat me alive. I picked up an object to smash them with. This big ass tiger spider was my main focus. As I tried to do it, it dodged the blow and almost bit me. At that point I gave up on trying to smash them.</p><p>I became so uncomfortable that I had to collect my comforter to go sleep upstairs on the couch. Little did I know, my mom was now home and I was pretty much still on the peak of my high. I came upstairs and it was about 4:00 A.M. I saw my older sister on the upstairs computer. I walked up to her and said Hey can I go on the computer? she said no and to go away. Alex what are you doing? asked my mom. Im upstairs because there were too many bugs downstairs, and I want to sleep on the couch. Ok thats fine she said Mom? Can I go on the computer? NO. Are you kidding? It is way too late to be on the computer right now But Syd (my older sister) is on it! Why cant I go on it? WHAT!?! she said. SYD! Get your ass off the computer! My sister walked out of her room confused and pissed off. I realized it was a hallucination. My mom told me to test my blood sugar. I told her I was fine and just needed sleep. I returned downstairs, and went to bed. (I was actually able to fall asleep this time).</p><p>Damage report: I am sure I had some blackout periods, because my T.V. was halfway across the room, unplugged, and laying on its side, other than that though not that bad, just a few things in places where they shouldnt have been, and a spilled glass of water.</p><p>Hangover report: After I woke up the next morning, I felt groggy, sore (especially my ribs), and just overall shitty. I was also shaking like I had Parkinsons disease. The shakiness lasted for the rest of that day, and the groggy, tired feeling lasted for 3 days.</p><p>When my mom confronted me about the incident I told her I didnt remember it and had no clue what she was talking about and that I was probably sleep walking. She bought it. This experience overall was very interesting and led me to research the drug a lot. I then discovered other experience reports and was amazed at how similar everyones experiences were to mine. Even reading this you may be thinking that right now. There seems to be a trend of seeing spiders a lot. I really dont think I would do this again... Except in smaller doses.</p>",
 "year": "2011",
 "id": "89859",
 "gender": "Male",
 "age": "15",
 "timestamp": "2012-11-29T08:00:00.000Z",
 "views": "11483",
 "dose": {}
}
