{
 "id": 8992,
 "title": "Amazing Night, Followed by Depression",
 "date": {
  "submission": "2006-06-16T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Blondie",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablets",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "My drug history isn't anymore intense than most teenagers, especially at my high school (think a bunch of rich kids with nothing more to do but buy drugs). I've been smoking pot for a couple years and I drank a lot, but had never tried any chemicals. However, I'd always wanted to try E. Also, a lot of my new friends were into the rave scene. I enjoyed going to nightclubs but had never been to a rave. I told them I'd come to the next one, and me and my best girlfriend were trying ecstasy for the very first time.",
  "The day of the rave, we barely had enough money to get in. I had an extra ten or fifteen bucks for my E though, but my friend couldn't afford hers. Besides, another person we were with only had a certain number of E pills. I felt bad but she had told me she wanted me to have it anyway. I didn't really feel like splitting it with her, truthfully.",
  "I popped the pill (I think it was a white dolphin, I really don't remember the name though!) about ten minutes before we went in the place, at approximately 11. At the rave, me and the girlfriend I was with were the only girls in the group we went with. There were three other guys. At the time we were waiting in line, me and two of the guys had popped one tablet each, and the other guy was just drinking that night. Me and my buddy were the only ones who had never taken ecstasy before, so while we waited to get in they were telling us about what to do if it kicked in while we were in line and how not to bait out the scene, etc.",
  "I don't want to write a lot of boring things in my experience, so for now I'll just say the first half hour or so of the rave was very boring. I kept asking 'Has my E kicked in yet?' and mostly the answer was just, 'You'll know'. I also repetitively asked if other people were high yet. When one of them said he was a bit high, I couldn't help but complain that I felt 100% sober (I hadn't even smoked any pot that day at all). I was SO thrilled when he said he'd be right back and brought me a free E pill he got.",
  "I excitedly went to the bathroom to pop the next E, a red Superman. Somehow I felt this one would be totally amazing.",
  "Oh boy, and it was! I realized what it meant when people say by the time I wonder if IM high, I've already reached the peak. Within twenty or so minutes, although it's pretty hard to tell how long, I felt so, so amazing. I kept dancing, and I remember I was looking at people and thinking things that weren't too strange, it's just that even the bad thoughts felt good. For example, I was wondering why no one was dancing with me, but I still had the HUGEST smile on my face. I felt like everything was so good.",
  "I remember at one point I started thinking about what my parents would do the next day, a not too unusual thought for me to have since I'd probably be in shit for not coming home. But the difference was the ecstasy wouldnt let me feel bad. I still felt so good.",
  "For about three years I've had an anxiety disorder and severe depression, but the night I popped E it was totally gone.",
  "I repetitively talked to random people, not knowing why. I was so fucked. I also had a thing RANDOM thing I'd do with my hair, I kept flipping it. It sounds completely crazy but somehow I felt that if I stopped, I wouldn't be happy anymore. I would continue doing that almost non-stop, along with dancing, until the ecstasy was totally out of my system.",
  "At around two or three in the morning, still as fucked as I've ever been, we were outside having a cigarette (we made about 20 cigarette breaks!). At this point in the night, my girlfriend had gotten an E, and one of the guys had done two bumps of K. I was just too fucked to feel anything in the situation that was about to happen, but I just saw the guy who just did another bump of ketamine sitting and throwing up. I had thrown up minutes before, too. I kept dancing, smoking, and twirling my hair and I said 'Guys, like, what's happening with him?' and I kept smiling even thought I knew something was wrong since everyone we were with gathered around him. They were like, 'He's in a K hole, we gotta leave'. I didn't know what a K hole was, since I hadn't done ketamine at the time, but I remember not wanting to leave the rave at all. I was just having too much fun. Then, I realized it'd probably be fun no matter where I was since I was so high.",
  "The cab ride back to the guys house we were all staying at was funny. It was the guy who was in the K hole. He sort of snapped back to life in the cab. I remember it was the end of November and I was feeling so warm in just a tubetop! Oh man, I felt so any strange things. When we finally got to the guys house, I wanted to be at the rave so badly. I took his iPod and me and another one of the guys kept dancing. I absolutely couldn't stop.",
  "The others were passed out, since my best bud had apparently taken some K with the other guy, they were out cold, and the other guy was drunk. It was just me and one guy, awake the whole night.",
  "I was extremely wired until about five or six in the morning, when the dreaded comedown started. At this point I'd been trying to eat one slice of pizza for the entire night! I wasn't hungry, but somehow felt the need to eat since I hadn't eaten more than a bite of food in a day or two.",
  "However, it would be about a day or two before I'd experience the devastating side effects the E had on my depression. I felt panic and anxiety attacks all the time in the weeks to follow, and I literally felt suicidal.",
  "In about three weeks, my life was bearable again, but I swore I'd never do that to myself again.",
  "It's been about five months, and now that I'm on Prozac for my depression, I am definitely excited about doing E again!"
 ],
 "erowid": {
  "id": "52399",
  "citation": " Blondie. \"Amazing Night, Followed by Depression: experience with MDMA (Ecstasy) (ID 52399)\". Erowid.org. Jun 16, 2006. erowid.org/exp/52399",
  "substance": "MDMA (Ecstasy)",
  "views": "7735"
 }
}
