{
 "title": "Comfortumbly Numby",
 "author": "Erkrez",
 "citation": " Erkrez. \"Comfortumbly Numby: experience with Hydrocodone (ID 89977)\". Erowid.org. Mar 23, 2012. erowid.org/exp/89977",
 "substance": "Hydrocodone",
 "bodyweight": "175 lb",
 "report": "<p>As I have always done in my experiences  with opiates containing acetaminophen, I performed a process called Cold Water Extraction or CWE for short. Basically this process is to make sure that you can get rid of most if not all of the acetaminophen contained in the Hydrocodone pills. That way you can vastly reduce the risk of ODing on Acetaminophen.</p><p>I first took the Hydrocodone at 8:45 PM on what I could assume was an empty stomach or close to since my last meal was a slice of pizza at 5:00 PM.My girlfriend had just left a couple minutes ago and I was going to be alone for the rest of the night. I had a terrible headache so couldn't wait for the Hydrocodone to kick in and get rid of it.</p><p>T+0:15 Headache is still present but it's starting to go away slowly.</p><p>T+0:30 Headache is now completely gone. Also had some leg pain and lower back pain which is gone now as well. Feeling of relaxation and happiness start to become more apparent.</p><p>T+0:35 Time seems to pass by a lot slower now. Numbness is starting to spread around body, there is also a bit of itchiness but it can be ignored.</p><p>T+0:50 Itchiness comes and goes, calm and relaxation all around. I find it much easier to start and keep a conversation going.</p><p>T+1:00 At this point I haven't noticed much change on my feelings so I assumed I had reach the peak of the Hydrocodone effects. Due to this I decided it would be a good time to start smoking some cannabis to compliment the feelings and to not the comedown so strongly.</p><p>T+1:05 Cannabis was a good idea, it intensified the feelings of calm, relaxation and happiness they Hydrocodone gave me.</p><p>T+1:20 Stood up to take a pee, and then what I could assume was the Hydrocodone , hit me really hard. I had to stop moving for a bit and then when I started walking had an odd sense of balance. Vision was like wobbling around. When I came back to the bedroom I went into my bed under the covers for about 5 mins. When I was in bed and had a very intense feeling of relaxation and happiness and I had trouble getting out of there as I wanted to stay there.</p><p>T+1:30 I started listening to music. This was an extremely amazing experience. Depending on the song I eitherI felt like my whole body was washed with waves of ecstasy, or that my body was in a perfect calm.</p><p>T+2:00 I went to rest on my bed fir a while and also petted my cat while at it. This time her fur felt incredibly soft and warm. After trying to get up I fell down but onto the bed. The next time I tried to get up I did but I could notice my sense of balance was still messed up. I also started to get a bit of nausea.</p><p>T+2:10 After opening a window and going to bed to rest the nausea went away. When I went back to the computer I could still notice my sense of balance was not normal but was much better than before.</p><p>T+2:50 Nausea comes and goes, I was also pretty hungry so I ate a slice of pizza, the nausea went away while I was eating but came back a bit after I finished.</p><p>T+3:05 After resting on my bed for a little while, a wave of euphoria washed over me, and after it was finished I felt completely sober.</p><p>Overall the experience was really pleasant, the only real bad thing was the nausea as the itchiness was only present at the beginning and it wasn't that much of a bother even if it was present.</p>",
 "year": "2011",
 "id": "89977",
 "gender": "Male",
 "age": "19",
 "timestamp": "2012-03-23T07:00:00.000Z",
 "views": "6989",
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Hydrocodone"
  }
 ]
}
