{
 "title": "Utterly Astonished",
 "author": "Haphazard",
 "citation": " Haphazard. \"Utterly Astonished: experience with Methoxetamine (ID 89972)\". Erowid.org. Mar 11, 2011. erowid.org/exp/89972",
 "substance": "Methoxetamine",
 "bodyweight": "181 lb",
 "header": [
  "DOSE: T+ 0:00",
  "26 mg",
  "insufflated",
  "Methoxetamine ",
  "(powder / crystals)",
  " T+ 1:15",
  "16 mg",
  "insufflated",
  "Methoxetamine ",
  "(powder / crystals)",
  " T+ 0:00",
  " repeated",
  "smoked",
  "Tobacco - Cigarettes",
  ""
 ],
 "report": "<p>I'm a 51 year old male who has, in the last three years, started experimenting with drugs again after having pretty much stopped doing anything since my mid-twenties. In my teens and twenties I was a regular cannabis smoker and taker of quite a lot of amphetamines in particular, as well as LSD, cocaine, and heroin (snorting or smoking recreationally). In the last three years I have been occasionally smoking cannabis again but mainly taking MDMA and beta-cathinones, along with a couple of experiences of 5-Meo-Dalt and BZPs in the legal high market. I have had no experience with ketamine so this was a first experience of a dissociative.</p><p>Scene: Early morning, one hour after a decent breakfast</p><p>Dose: 26mg (weighed) snorted, followed by 16mg an hour and a quarter later, also snorted.</p><p>The plan: To continue producing a piece of music on the computer, but lie down in the living room with some music if that became impractical.</p><p>0.00 Snorted 26mg. Very tickly in the nose and felt it down the back of my throat very quickly. Felt an effect as soon as I snorted it though and went outside for a cigarette with the pleasing feeling of becoming detached from my body. Spent the next 45 minutes or so grappling with some music before ditching one track and starting another which felt more in tune with my state of mind. I came to the conclusion that I'd ridden the rush though and that there might be anything more so went out for another cigarette. Not feeling baseline but feeling that maybe a tolerance from other drugs had kicked in. Track going well. I was then just starting to get slight thoughts that the experience might develop more but decided to bump some more anyway.</p><p>Approx +1.15 Snorted another 16mg and went for another cigarette. Coming back into the house I felt decidedly more spaced, my body more disconnected, and I was very happy with this state of mind. The bump seemed to have definitely lifted the experience past the plateau and I sat down to continue work on the track. Can't really give you good timings from this point on... The track progressed sweetly with me finding it very nice to just put in tiny little sound touches to what was, and remains, basically a house groove without a clear melody. I was viewing the lack of a clear direction for the track as a potential problem but couldn't find a sound that would lift it out of that and so eventually moved onto adding a bassline. I started playing in a bassline which, on the one hand felt like it was pretty cool and sparse, but on the other hand I was prepared to accept might sound pretty random in the cold light of day, as this didn't seem to be at all the way that I would normally approach a bassline. I very quickly realised that I couldn't really play any more at all though - the playing was getting very squidgy and the relationship between music and time somewhat elastic...</p><p>The time was at about 2.30 at this point and I was becoming aware that I was entering into a distinctly psychedelic, hallucinogenic experience. I decided to listen back to the track. I should point out at this stage that I have the amazing G-Force visualisation on my PC and I decided to switch it on full screen while I listened back to the track. The visuals looked like nothing I had seen the software do before - it was like they had come to life and what I was seeing on the screen was real and totally tapped into the music of course. Reached the conclusion that the track was genius and decided to listen to an odd 11-minute piece I hadn't completed properly. This proved to be the culmination and the climax of the experience. I believed that I may have created this track specifically for this state of mind... Was I in a K-Hole? I couldn't say as the visualisation software was emulating that effect anyway. I decided to remain sat in my seat though - I knew that moving would require significant work to get my body to do what I might want it to and I really was more than happy to focus on the music and graphics. I had no interest at all in exploring what the experience might be if I went into another room or something, and why would I when I had a total psychedelic experience right in front of my eyes?</p><p>I found it manageable to change tracks on the computer but every time I got one going and sat back to watch the visuals I was taken away. I was utterly astonished both at how strong the chemical was and at how pleasurable and totally hallucinogenic the experience was. Utterly blown away... Completely out of my box. I couldn't imagine the music without the visuals, and the computer screen pretty much became my life for a while. I started to wonder why everybody in the world didn't just do this and not worry about the rest. I felt that I could reach out and grasp that psychedelic secret that I could give to people to show them the way... (I couldn't...). So the peak was magical and profound although I was briefly aware that I could be quite disconcerted if I were to concentrate on my bodily state in relation to the world. I chose to just enjoy the sensory input. Once I realised that the peak was coming to an end the come-down from there was quite rapid, which I quite liked.</p><p>At +5.00 I was happy to leave it behind and go down the pub for a beer, still slightly disconnected from my body but fine and pretty much back to normal after I'd sat and had my first pint. I understand that this is a ketamine analogue. I had always misunderstood the stumbling antics of those on k to be similar to downers but realise that it is clearly a mind-body disconnect that causes the problems - never mistake the symptoms for the state of mind! I cannot imagine being in a club having taken that amount however (although maybe at a festival) - moving around for an hour or so at the peak would have been really difficult I think and definitely disconcerting.</p><p>To summarise though I was blown away by the experience. I wonder what it would be like just listening to music in a room without the visuals but I suspect that I will find the answer to that question at some point because I will be trying this again next time I have an opportunity..!</p>",
 "year": "2011",
 "id": "89972",
 "gender": "Male",
 "age": "51",
 "timestamp": "2011-03-11T08:00:00.000Z",
 "views": "39276",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "26 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 1:15",
   "amount": "16 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 }
}
