{
 "title": "Really Turned On",
 "author": "phxbot",
 "citation": " phxbot. \"Really Turned On: experience with Products - Bath Salts, Plant Food, etc. ('Eight Ballz') (ID 89989)\". Erowid.org. Jul 30, 2011. erowid.org/exp/89989",
 "substance": "Products - Bath Salts, Plant Food, etc. ('Eight Ballz')",
 "bodyweight": "200 lb",
 "report": "<p>[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.] </p><p>11:30  bought two packs of Eight Ballz bath salt. snorted one half or 2.5 g; made mistake and snorted large amount.</p><p>11:45  put on porn, very excited but hard to achieve erection  seems like meth dick</p><p>12:00  really kicking in; euphoria, sexual desire, feel very confident</p><p>12:15  really turned on by porn; extremely thirsty; watching porn as I write; I am biwm; would do anything for sex; left front door open to see if anyone would join me; nothing</p><p>1:00 coming down; drinking several small bottles of water</p><p>1:15  snorted remaining half; not noticing a high but more of a mellow feeling; this is good</p><p>1:30  very sexual but still cant get it up; addicted to [] for porn</p><p>1:38  a bit jittery; still playing with myself</p><p>1:45  more jitters  still cant get it up; will use when I bottom, but not top  will use with guys not girls; keep drinking water but it does not help; on my 4th bottle of water (16 oz); mental facilities good, slight imbalance when walking; really turned on</p><p>2:00  coming down off high rapidly; feel very tired; will try to get some sleep; first will try to jack off; still very horny</p><p>[Reported Dose: '5 g']</p>",
 "year": "2011",
 "id": "89989",
 "gender": "Male",
 "age": "40",
 "timestamp": "2011-07-30T07:00:00.000Z",
 "views": "3553",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Products - Bath Salts, Plant Food, etc",
   "form": "(powder / crystals)"
  }
 }
}
