{
 "id": 901,
 "title": "Lucky I Just Had a Taste",
 "date": {
  "submission": "2004-11-04T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Goose",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "0.5"
   },
   "administration": "sublingual",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Datura"
  },
  {
   "time": "0",
   "amount": {
    "unit": "cup",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Datura",
   "form": "tea"
  },
  {
   "time": "0",
   "amount": {
    "unit": "drops",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "extract"
  },
  {
   "time": "0",
   "amount": {
    "unit": "cups",
    "quantity": "6"
   },
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "A friend of mine (P) got given some acid. Two big tabs. I was dubious but he was keen to share it. B and I had half each. I actually shared a quarter with another friend M but since it was free acid which I couldnt taste and seemed to be coated in alluminium or something I knew Id need every bit I could get, so M didnt get much of a chew and consequently didnt feel anything (hes never tripped before  this was my 10th time). After a little while sitting around drinking at Ps flat (which was full of strangers hed randomly invited over having never met before) B and I were taken into Ps room, where I noticed some strange looking substance on a mirror. Whats that? I asked. Datura P casually replied. I was a little taken aback as one might imagine. Given that I was well aware of the dangers of Datura and never intended to try it I was a little shocked to learn that P was indulging in the wicked herb quite regularly. He even assured me that it was fine and that people only fuck out because they take too much.",
  "Anyway, we were going to smoke some pot but nobody had any, so P suggested we pack in a few bowls of Datura. I was reluctant but as I was looking forward to a fat night out and was well aware that the acid was shit I had a few puffs. It didnt do anything. I dont think smoking it actually works to be honest. However, about half an hour later, once we had smoked a little weed oil and I was beginning to feel the anxiety and restlessness that always accompanies the onset of acid, P gave us each a mug of mysterious hot water. It was Datura tea. I drank a cup. Someone said it tasted like oysters or clams or something. P and B had two cups each. Crazy bastards. We then decided to hit the town.",
  "As we headed into town P kept reiterating how wasted he was. I was feeling a bit trippy. My limbs were all quite heavy and I had the pleasant fuzzies from the acid. Unfortunately it never got any more intense than that and for the rest of the night I was feeling decidedly sober. In the head at least. I only drank about half a dozen beers. This is mainly because the Datura fucked up my throat so badly that I had to resort to water. It didnt help though. My mouth was fine  more saliva than usual if anything  but my throat was DRY. So bad was it that every time I gargled water in an attempt to moisten it, it was dry again within seconds. And very painful. Ruined my whole night in fact. I would say thats reason alone to never do Datura, but of course there are many more. Strange things were happening by this stage. When I went to drink my water it seemed like a huge effort to get the sipper up to my mouth. I must have looked like an absolute retard but at the time I shrugged it off and simply thought hey thats funny. My arms are really heavy!",
  "I left two boxes of beer in the shop where I bought my water, so I went back to grab them and we headed off to the roof  a regular drinking spot where we often go to finish off our drinks before hitting the clubs. When we got there though, we were kicked out straight away by a security guard. As I went to pick up the beers and move on I realized I didnt have them and still have no idea where they went. By now things were very strange. I felt fine, mind you. Totally sober almost, except for a slight drunk feeling, a bit of the warm fuzzies and an incredibly sore dry throat. B on the other hand was messed up pretty bad. He threw up a whole lot of bile on the way into town (which cant have helped his throat), and when we got there he was an absolute mess. He would wander along behind us for a little bit then wed turn around and hed be gone. So Id have to go back into the crowd to find him standing outside Burger King or something just standing there staring at a rubbish bin. So Id drag him along a bit further and then hed just vanish again. He reckons that he could only mumble incoherently all night and that he waited in line at a food store and when he got to the front he emptied his wallet onto the counter and stood there mumbling at the attendant.",
  "All three of us were also noticing with alarming regularity that the ground kept falling out from under our feet. That I must say was extremely weird. Kind of cool though. At the time I just thought hey, thats funny. The ground keeps falling away! Eventually P went off to grab a taxi home (although apparently he didnt know the way home, doesnt remember how he got home, and didnt make it home for another few hours!), while me and B went to catch the bus. I was feeling pretty sober by now (I actually think its possibly an effect of the drug that it makes you THINK everythings normal  like when you wake up from a bizarre dream that seemed so familiar while you were dreaming it). I was looking forward to going to bed. I jumped on the bus, paid my $5 fare and sat down with my back to the door across from Ds brother (D being the guy who piked out on us for the night). B followed me onto the bus. He may or may not have paid his fare, he cant remember, but after a little while standing there (possibly mumbling to the driver) he got off the bus again.",
  "Before I had the chance to pull him back on the door closed and the bus started driving away. B just stood there waving with a twisted grin on his face. He was rooted. I chatted away with Ds brother all the way home quite soberly but every couple of minutes I would snap out of it and start trying to use my computer, thinking I was at work. Id start typing, notice my keyboard was gone, sketch out, then realize I was on a bus and sketch out even more. It was as if the bus ride was just a daydream and I was actually at work on the computer. I was aware that I was on Datura though so I wasnt too worried. The weirdest thing was that it just kept happening all the way home.",
  "The next day my pupils were still quite huge and I worried that my folks might notice but they didnt. I also felt really strange and anxious all day  especially since I couldnt track down B and felt guilty for leaving him in town he was fine though. Reckons he just stood there thinking about running to the next bus stop but didnt move. That night I was back at my flat and I smoked some pot before going to bed. When I was in bed it seemed like my arm wasnt attached to my body and it was just lying beside me. I was also thinking some really bizarre thoughts. I worried that even though I had been sober all day that I was actually still having delusions and just not realizing it.",
  "As a conclusion Id say to anyone who takes drugs that whatever reason you have to do drugs  and there are many  dont bother with datura. It doesnt make you feel euphoric or high. It makes you feel normal. It makes you dream while youre awake, and it isnt until you wake up from a dream that you realize how fucked up it was. The bottom line: Datura is dangerous and deceiving. If you think its cool to fuck your head up and walk naked through a river thinking youre in town with your friends going man, this Datura doesnt do shit to people that arent even there then take it. You probably deserve whats coming to you anyway.",
  "As for me  I wont be trying it again. No point. I didnt feel wasted. I just was. I prefer the exact opposite. Like pot or acid  drugs that make me feel fucked up but I'm still able to act normal (to a degree) in public. Datura is a soul-stealing drug and I would strongly recommend against trying it. It simply isnt worth it.",
  "GOOSEMAN",
  "New Zealand"
 ],
 "erowid": {
  "id": "12566",
  "citation": " Goose. \"Lucky I Just Had a Taste: experience with LSD, Datura, Cannabis & Alcohol (ID 12566)\". Erowid.org. Nov 4, 2004. erowid.org/exp/12566",
  "substance": "LSD, Datura, Cannabis & Alcohol",
  "views": "14234"
 }
}
