{
 "title": "Just Flushed It",
 "author": "CEO",
 "citation": " CEO. \"Just Flushed It: experience with 4-Methylmethcathinone (ID 90101)\". Erowid.org. Mar 17, 2011. erowid.org/exp/90101",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "180 lb",
 "report": "<p>I just flushed a gram and a half of mephedrone.   I have come to the conclusion that this one is very toxic.  I have tried many RC's and I love psychedelics, I feel that they help with introspection.  I also like stimulants very much since they give me energy, help me work, and help me to connect with others.  You may have seen posts which indicate that others have experienced health problems with mephedrone at higher doses.  I have also experienced this, but now I have concluded that it is toxic at lower doses as well. </p><p>Maybe a year ago I took probably around 500mgs in one night.  My heart nearly exploded and my limbs turned blue.  I promptly got a cold and cold sores too.  I was sick all weekend.  I thought maybe it was a coincidence that I got sick after taking too much mephedrone, maybe my immune system was diminished from lack of sleep.  So I put the meph away.  Recently I decided to give it another shot.  Just a few bumps at work for energy.  Well the energy came but later my heart was beating too hard.  I took a shower and I was ok.  The next day I tried a small dose of MXE, bk-MDMA, and just a bump of meph.  Again, my heart was racing and I felt ill at ease, I felt scared that I may be damaging my heart, a shower and some hot tea--I was fine.  I figured I had just behaved foolishly by mixing too many substances.  But here's the thing, MXE and bk-MDMA have never disappointed me or made me feel bad.  Now I have a cold again, and as I sit here on the couch blowing my nose I feel it is my duty to warn you that mephedrone is a terrible RC and it is bad for my immune system.  I am normally a very healthy person, I am experienced with dozens of tryptamines, phenethylamines, cathinones, and other substances. </p><p>I will admit that mephedrone has a fun and appealing high, but heed my warning, 4-methylated cathinones are bad news.  Do some research on 4-methylamphetamine and 4-methoxyamphetamine, you will see that the few posts out there are linked to very unhappy people and with death, so it makes sense that 4-methylmethcathinone is bad news too.  Let's not give the governments of the world a reason to impose more rules upon us, there are many great RC's out there but this isn't one of them.</p>",
 "year": "2011",
 "id": "90101",
 "gender": "Male",
 "age": "26",
 "timestamp": "2011-03-17T07:00:00.000Z",
 "views": "7030",
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "(powder / crystals)"
  }
 ]
}
