{
 "title": "Definitely a Winner",
 "author": "LabRat",
 "citation": " LabRat. \"Definitely a Winner: experience with 25C-NBOMe (ID 90107)\". Erowid.org. Jun 9, 2011. erowid.org/exp/90107",
 "substance": "25C-NBOMe",
 "bodyweight": "180 lb",
 "report": "<p>This is my review of 25C-NBOMe in various doses.  It is an ultra-potent, rare psychedelic.</p><p>25C-NBOMe</p><p>Dosage: 220-440mcg</p><p>Duration: 8-12 hours</p><p>Qualitative Comments:</p><p>(with 220mcg buccal / sublingual) First effects were noticed within 20 minutes, with the peak settling in around +1:30-2 hours after ingestion.  Visuals were subtle for the most part, with mostly color changes and very light geometric patterns.  Clear mental space with paradoxical feelings of heaviness / weightlessness, and a very mild stimulant edge.  A solid (++) on the Shulgin scale.  At around +6 hours, the peak began to fade, in total lasting about 4-5 hours.  The comedown was very slow, still not at baseline after +10 hours.  Sleep was aided at +11 hours with morphine / hashish.</p><p>(with 440mcg buccal / sublingual) The following day after the 220mcg dose to test tolerance and higher doses.  First effects were noticed 10-15 minutes in, the onset is quite fast like LSD.  Tolerance does not seem to build fast with this chemical.  The peak set in around +1:30-2 hours after ingestion.  Visuals were somewhat more pronounced, notable geometric patterns and breathing walls / surfaces.  Pupils were very dilated.  Mental / spiritual clarity, was very much present.  A solid (+++) on the Shulgin Scale.  The experience was extremely spiritual and refreshing.  It dropped to a (++) on the Shulgin Scale at about +4 hours.  It began to taper off around +6 hours, and at +10 I was still not at baseline.  Sleep was aided at +11 hours with hashish.</p><p>Notes: The 220mcg dose was quite similar to 2-3 hits of average quality LSD, and the 440mcg dose was similar to 4-6 hits of average quality LSD.  It seems to be slightly less potent than LSD, but quite a bit more potent than DOx or B-DFly.  Both experiences were very similar to LSD in a lot of ways, including head space and visuals.  Out of every psychedelic I've had the privilege of sampling, I would say that this is absolutely a winner and by far the closest to LSD.</p><p>Further Research:</p><p>(with 55mcg buccal / sublingual) First effects were noticed within 20 minutes, no clear transition from come-up to the peak.  Barely a (+) on the Shulgin Scale.  Effects faded after +6 hours, being mostly gone around +10 hours.</p><p>Notes: The 55mcg dose was on par with approximately 1/2 to 1 hit of average quality LSD, providing further evidence that it is slightly less potent than LSD.</p><p>Further Research:</p><p>(with 660mcg buccal / sublingual) The first effects were noticed in 10-15 minutes, again a quick onset with the peak setting in around +1:30 to +2 hours.  This much substance on the blotter became very bitter after about 20 minutes between my gum - it also numbed my entire mouth similarly to novocaine.  The body load was somewhat more pronounced at this dose.  Visuals resembled Alex Grey's Net of Being / other psychedelic face imagery with more detail, but they were subtle and not at all overwhelming.  Mental clarity and very introspective state was present, definitely a solid (+++) on the Shulgin Scale.  The overall experience lasted around 12 hours, with sleep aided by Doxylamine and Dextromethorphan.</p><p>Notes: It seems very different in character than other research chemicals mostly because of the lack of powerful visuals at this higher dose. I was able to work out some personal issues I've been dealing with, and rather quickly after the peak.  It seems like 25C does a good job at going straight for the therapeutic aspect, more-so than other psychedelics I've sampled.  I definitely think this chemical is a winner, and I'll probably test it out at 880 and 1100 mcg.</p>",
 "year": "2011",
 "id": "90107",
 "gender": "Male",
 "age": "19",
 "timestamp": "2011-06-09T07:00:00.000Z",
 "views": "18408",
 "dose": [
  {
   "time": "0",
   "administration": "buccal",
   "substance": "2C-C-NBOMe"
  }
 ]
}
