{
 "id": 9013,
 "title": "A World Shaker",
 "date": {
  "submission": "2008-09-05T07:00:00.000Z",
  "experience": "1966"
 },
 "author": {
  "name": "Michael",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "500 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ],
 "report": [
  "As a young man I was fascinated by hallucinogenic drugs, as were many of my peers. My earliest exposure to the topic was through the writings of 'beat' authors such as Allen Ginsberg (The Yage Letters) who I was reading at age 14. By the age of sixteen most of my friends were interested in LSD and only used plant source hallucinogens as a last resort. I differed in that such plants always held a singular attraction for me. My first psychedelic experience was with morning glory seeds and I often returned to them, even though LSD or other synthetic drugs were readily available in my circle of friends. The following is an account of one of my experiences with morning glory seeds.",
  "I set aside a Saturday for the 'trip'; a weekend when my parents would be out of town.  My 'sitter' was my girlfriend, who came prepared for the day with a homework assignment and other things to occupy her time. I consumed the seeds (chewing) on an empty stomach early in the morning. Within an hour I felt the familiar effects and lay down to ride out the nausea. I was to spend the next 10 hours on my back, only getting up to vomit and drink a little water. A lot happened that day; visions of copulating dragons covering the ceiling among other interesting visuals. One particular CEV is of more importance and prompted me to write this.",
  "Due to a medical condition I had been forced to walk on crutches for approximately 3 years, from the age of 3 through 6. I had a total mental block to those years, remembering nothing from the day I 'heard the news' from a doctor (I remembered my mother crying) until approximately two weeks after I stopped using the crutches.  I had started school as a 'crippled boy.' and remembered literally not one single event from my first 1 1/2 years of school. In retrospect, I realize that I was probably a little 'fixated' on this as an adolescent.",
  "At the peak of the experience I was a little overwhelmed by the dragons, and decided to close my eyes. I found myself in an immense grey room, watching a conveyer belt speed by. On the belt were boxes with open tops. I sensed that they contained something important. I started to run and caught up with a box. Looking into the box I found it contained a scene from my childhood, acted out like a little play inside this box. I watched myself at five years old 'acting out' against another child who taunted me about my crutches. Each box contained another scene; some dramatic like the first, others very mundane. I spent a long time looking at these boxes, until I was too tired to run in my dream.",
  "At the end of a very long day as the effects diminished, my girlfriend told me I had spent most of it with my eyes closed, groaning and tossing as if having a bad dream. She had followed my instructions perfectly; 'Don't bother me unless I appear to be doing something self destructive.'",
  "I am now 54 years old and haven't used any intoxicating substance in over 20 years. I submit this as an example of the positive impact psychedelics can sometimes have. I spent a little time during the following year 'integrating' those new memories into my concept of self, and then pretty much moved on. Without that morning glory experience, I might very well still be trying to remember part of my childhood."
 ],
 "erowid": {
  "id": "52481",
  "citation": " Michael. \"A World Shaker: experience with Morning Glory (Heavenly Blue) (ID 52481)\". Erowid.org. Sep 5, 2008. erowid.org/exp/52481",
  "substance": "Morning Glory (Heavenly Blue)",
  "views": "5669"
 }
}
