{
 "id": 9021,
 "title": "Good Motivational Aid, Painkiller",
 "date": {
  "submission": "2006-04-20T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Limpet Chicken",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "ug",
    "quantity": "25"
   },
   "administration": "oral",
   "substance": "Clonidine",
   "form": "pill/tablet"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "cups",
    "quantity": "0.5"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "liquid"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "mg",
    "quantity": "100",
    "grams": 0.1
   },
   "administration": "rectal",
   "substance": "2-Aminoindan",
   "form": "liquid"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "ml",
    "quantity": "5.0"
   },
   "administration": "rectal",
   "substance": "GBL",
   "form": "liquid"
  }
 ],
 "report": [
  "Mindset: apathetic",
  "Setting: at home, talking online to friends",
  "Medications: clonidine, taken at the beginning of the day",
  "History:",
  "I am almost 20yo male, lightly built, and, probably significantly to the case at hand, I have Asperger's syndrome, which is a type of high functioning autism, although a very mild case, social interaction isn't very impaired, but the main problem it leaves me with, is an almost permanent case of anxiety, severe chest tightness, and severe insomnia, for which I usually take a high dose of dihydrocodeine, from 5-10mg nitrazepam to aid sleep, and just recently, started on clonidine, an alpha-2 adrenoreceptor agonist, which acts to close a feedback loop on noradrenaline production, by binding to the receptor in place of NA, and in effect, tricking the CNS into downregulation NA production, and acts to lower blood pressure, and in my case, lower stress/anxiety levels very efficiently, although it does have some counteracting effects on adrenergic agonists such as amphetamine based stimulants.",
  "I am also a former GBL addict, used to have quite a heavy addiction, up to 60ml a day, sometimes more, until I slowly tapered down to 0.25ml/dose, then  had a seizure, which needed medication with benzos (chlordiazepoxide). This was approximately half a year ago and now I am all but immune, seemingly, to GBL and GHB. When I first started using, 4ml rectally got me pretty euphoric, now heavy doses of up to 60ml merely chill me out slightly.",
  "25mcg clonidine was taken upon waking up, and after talking to friends online for approximately an hour or so, had a cup of black coffee, which is somewhat unusual for me, as I normally detest any form of stimulation, approximately 100mg of 2-aminoindan hydrochloride was dissolved in 1ml of tap water, this, along with 5ml of gamma-butyrolactone was administered rectally, and subjectively, began to feel noticeable CNS stimulation, pulse rate is increased over resting rate, the GBL isn't noticeable much, but it takes off the wiry edge off the 2-AI, I have considerable urges to move about, music is enhanced and definately more enjoyable.",
  "As with my previous experiences using 2-aminoindan, unlike most stimulants, especially those with noradrenergic agonist/reuptake inhibitor activity, 2-AI doesn't leave me feeling uncomfortably overstimulated, no bruxism is apparent, although I haven't looked at any receptor binding SAR data, but it doesn't feel like it has much, if any affinity for 5HT receptors, and appears to be mainly a dopaminergic stimulant, its much closer to methylphenidate or cocaine, yet appears to be longer lasting (in me, and I am quite sensitive to stimulants, and metabolise them slowly).",
  "Next stop, 5-halogenated 2-AI derivatives, most likely, the positional numbering system is +1 position, away from amphetamine, but unlike the 4-haloamphetamines, pubmed data, and various research papers, seem to indicate a lack of serotonergic neurotoxic activity, although one possibly appealing analogue, the 5-trifluoromethyl substituted 2-aminoindan, appears to have some neurotoxicity, comparable to 50% that of phenfluramine, but this supposedly substitutes completely for MBDB in the rat, now I'm not a rat, and I haven't yet tried MBDB, this one might just be worth one or two bioassays.",
  "With what little I have left of the 2-aminoindan, I might try either a direct halogenation, or electrophilic substitution, to get that halogen onto the 5-position, weather it will have empathogenic, psychedelic or pure stimulant effects, I am not yet sure, but, will have to be tried at some time in the future."
 ],
 "erowid": {
  "id": "52503",
  "citation": " Limpet Chicken. \"Good Motivational Aid, Painkiller: experience with 2-Aminoindan, GBL & Clonidine (ID 52503)\". Erowid.org. Apr 20, 2006. erowid.org/exp/52503",
  "substance": "2-Aminoindan, GBL & Clonidine",
  "views": "12699"
 }
}
