{
 "id": 9023,
 "title": "Erectile Disfunction & Other Side Effects",
 "date": {
  "submission": "2011-01-01T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "David",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "150"
   },
   "administration": "oral",
   "substance": "Bupropion",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "unit": "Tbsp",
    "quantity": "2.5"
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "liquid"
  }
 ],
 "report": [
  "I am undergoing clinical depression and as a result I am using Wellbutrin XL at 150 mgs. The wellbutrin is especially grand because of the fact that it has no sexual side effects whatsoever. However, it does carry some nasty side effects and, although not warned about this, can cause some nasty drug interactions.",
  "It was a typical winter cold, being a college student, one tends to be around microbial agents that cause sickness, and I needed some relief. I had always taken my Wellbutrin right before falling asleep, as means of trying to prevent insomnia, however, this time, in addition to the Wellbutrin, I downed 2.5 tbsps of Nyquill to help reduce coughing and basic cold symptoms. It is important to note that I am not a drug-addict in any sense, and was doing this for the exact purpose mentioned above. However, unknown to me, my sex drive for the next few days was surprisingly low, so low that I couldn't even ejaculate. I had no idea why this may be, until I had realized a trend. Along with the sexual side effects, I felt more lathargic than usual--which is odd since Wellbutrin is known to make one potentially suffer insomnia. I was clearly in a rut.",
  "Even after 3 days of being off Nyquill, the sexual side effects still lingered--I knew there had to be a correlation between the two, as when I weened myself from the Nyquill, the symptoms stopped. I began to ponder further into it, and I realized that each time I used the Nyquill while using Wellbutrin, the nasty side effects occurred. Now, sexual disfunction may not be a terribly large problem to others, but being a 19 year old male in college with no history of E.D., it presents a HUGE problem."
 ],
 "erowid": {
  "id": "52519",
  "citation": " David. \"Erectile Disfunction & Other Side Effects: experience with Bupropion (Wellbutrin XL) & DXM (ID 52519)\". Erowid.org. Jan 1, 2011. erowid.org/exp/52519",
  "substance": "Bupropion (Wellbutrin XL) & DXM",
  "views": "5351"
 }
}
