{
 "title": "Prolonged Use Horrid Long-Term Effects",
 "author": "superficies",
 "citation": " superficies. \"Prolonged Use Horrid Long-Term Effects: experience with MDPV (ID 90236)\". Erowid.org. Mar 23, 2011. erowid.org/exp/90236",
 "substance": "MDPV",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "insufflated",
   "MDPV",
   "(daily)"
  ]
 ],
 "report": "<p>I never thought I would be the one to write a preachy, long-winded plead, begging people to STOP using MDPV.  It was my legal, miracle stimulant.  After eight months,  I finally flushed my last gram down the toilet this morning, along with my livelihood and sanity.  PLEASE.  This is truth. Not exaggeration.</p><p>I started bumping 3-5 mg twice a day, a few times a week in early September 2010.  I currently attend a top 10 university, I intended to use the drug for study purposes and all-nighters, not recreational use.  (Swear to God, not tooting my own horn, just giving background) My addiction started out slowly. For the first 5 months, I had no negative side effects.  No paranoia, mood swings, hallucinations, nothing. I agree, it is one hell of a motivational stimulant and the euphoric feelings were unmatched for those few months. I began to increase my dosage to 10mg twice a day by mid Jan. 2011.  That is when it went downhill. Fast.</p><p>Long story short, I was reckless one week.  After a five-day combination of cannabis, alcohol, sleep deprivation and probably 100mg of MDPV (overall), I felt horrid.  There arent words in the English language to describe the depression and anxiety that I felt. I thought campus police was outside my house, attempting to arrest me. I thought friends and loved ones were plotting against me. I was hearing sirens and fog horns constantly, from multiple directions. I heard voices of my friends talking shit about me. I thought my hair was falling out and bugs were crawling on me. Basically hell.  I was in hell.</p><p>Thank God my best friend (who has since refused to speak to me) called an ambulance when she found me in my room, huddled on the floor. I was rushed to the emergency room. I had a 140 bpm (normal resting being 55) and was seizing. By this this I was seeing hallucinations of monsters, aliens, demons.</p><p>I was clean for a month. Bought some last night. Bumped and flushed it. I went into cardiac arrest.</p><p>So why am I sharing this story?  To date, I have kidney failure from the extended MDPV usage. I have recently been diagnosed with heart problems and have been prescribed beta blockers to slow down my heart rate.  To top it off, I developed acute schizophrenia/bipolar disorder that I will never recover from. I am lucky to be alive.</p><p>Please.  Just dont.  Just dont do MDPV.</p><p>[Reported Dose : 5-25mg per day over 8 months]</p>",
 "year": "2011",
 "id": "90236",
 "gender": "Female",
 "age": "21",
 "timestamp": "2011-03-23T07:00:00.000Z",
 "views": "22523"
}
