{
 "id": 903,
 "title": "La Piedra, or, How We Lost It On the River",
 "date": {
  "submission": "2002-02-17T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Arthur B. Goodwill",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "<p>With nothing other than the motivation to have an extremely fun time prompting us, 10 of my friends and myself made plans to travel to a nearby cabin owned by a friend's uncle in the mountains. Of course, for a trip of this sort- excuse the horrible pun- we would need plenty of supplies.  Eight of us planned to shroom; two of our friends brought acid;  our relatively sober friend (the only person not on psychedelics) brought with him plenty of pot and beer as well. ",
  "Since our time at the cabin was to be relatively short- we had only obtained permission to use it for about 8 hours- we ate our beautiful fungi as soon as we arrived.  We ate our shrooms with a Chex party mix.  This might sound strange but it gets the job done.  We just would add a few mushrooms here or there to a handful of the stuff and scarf it down;  I recommend this method, or even better eating shrooms with Cheetos, to anyone who doesnt have the luxury of adulthood, an independent place of residence, or much time, money, or patience to go through any sort of time-consuming preparation.  We also ate powerful Vitamin C pills.  I have heard that chemically this doesnt increase your trip in any way, but in my experience it has done nothing but.  I usually eat freshly picked tangerines when I shroom and it seems to produce an immediate affect, especially after you peak.  Hey, even if it is just a placebo, it works for me. ",
  "After eating our treats, we all just chilled outside and admired the beautiful scenery and peace of mind that the mountainous terrain provided.  We smoked 3 or 4 bowls of quality chronic and waited peacefully for the blares of the cabin security system, which we had accidentally activated and could not seem to deactivate, to subside. ",
  "In an unusally short time, about 15 minutes, several of my friends were already uttering those famous first words of any trip: Oh shit, Im starting to feel something.  In a few minutes I found myself saying the same thing.  I had made my way inside;  thankfully the security system was figured out and I could rest peacefully on the couch as the first blissful waves of an amazing body high overcame me.  I tried to let myself relax and let the mushrooms take over, as I have found that thinking too much, in general and especially dealing with shrooms, only seems to complicate and put undo strain on what is, and should be at all times, an amazing experience.  I stared at the hardwood ceiling and it seemed to me that writhing bodies were just on the other side of the wood, writhing and clawing against it.  I suppose that it couldve freaked me out, but I was just too engulfed in staring to care.  I joined my friends outside and listened to my friend Rob, lead guitarist in our band, play music.  After a short time listening to the music, Rob and I, along with my friend Matt, decided to leave the cabin and go exploring.  We were the experienced trippers;  everyone who stayed at the cabin were either shrooming for the first time, or going balls out for the first time.",
  "After wandering amongst various trees and plants that lined the sides of the road leading away from the cabin, the three of us decided to go to a river a short distance away.  Since I was the only person who had been to the cabin before, I was expected to lead us.  There was a relatively big problem with that plan, namely that I didnt know where in the hell I was.  Everything was brighter, more beautiful, full of an energy that seemed struggling to free itself from the plants, air, trees around me.  When we came to a fork in the road, we didnt know what to do.  Luckily, a dog lead us in the right direction.  We spotted him about 50 yards ahead of us, trotting along the roadside in a direction we could only assume had to be the correct one to get to the river.  The dog paused occasionally to glance at us in seeming patience, only reaffirming our notion that his express reason for existence at that moment was to lead us to the river.",
  "\tEventually we heard the river before we saw it and with yells of glee broke into a run.  We climbed off the road and suddenly found ourselves on the banks of the small mountain river.  It was amazing to us, flowing continuously with life and power.  We explored our surroundings in wonder.  Not really knowing why, and with un-verbalized consent, we stepped carefully on smaller rocks and made our way to a large Rock in the middle of the river, where we layed down.  There the real fun began. ",
  "It is hard to express in words where the mushrooms took me that afternoon.  Prevalent among all the scattered thoughts and realizations that I dealt with was the overwhelming knowing that this was it, this was existing.  My life force was in use;  my existence was attuned to nature and the beautiful Earth all around me.  A gleaming and seemingly gelatinous substance sparkled in the Suns rays at me from various parts of the river bank.  I later found out that it was odd-looking ice, but at that moment it seemed to be some sort of by-product of the Earth.  This realization sent my mind down a million different paths.  I realized that the Earth was simply that;  a beautiful planet.  We as humans, simply sharing the Earth with the rest of the animals,  had no right to claim it. ",
  "I was simply a part of a whole, no better or worse than the trees, plants, and animals around me.  It seemed pathetic to me how humans quantified their existences;  religion seemed to me to be obviously wrong in nearly all its suppositions about man and his place in the Universe.  Heaven?  It was a laughable idea.  The Bible, Koran, Torah and any other piece of religious doctrine that stated without qualms mans superiority and place at the head of all mortal existence seemed simply ludicrous to me.  It was a planet, and we were its inhabitants.  Man had created religious dogma and structured beliefs to rationalize his existence and somehow make man more important than he really was.  I felt sorry for people who worked their whole life, molding themselves in the perfect image of whatever religion they subscribe to while shunning their own wants and needs.  And why did they do this?  To walk streets of gold that dont exist in some fantasy city in the sky.  I knew at that time that the after-life, if it existed, was simply merging my life-force with the grand cosmic energy of the Earth and universe.",
  "Time was immeasurable on the Rock.  I learned later that we were gone from the cabin for about 2 hours, but it could have been 10 minutes or 10 hours and  I wouldnt have been able to tell the difference.  We laughed and laughed till we cried.  We ooohed and aaaheed and screamed and yelled and it was all fantastic.  We would lapse into introspective silence and then one of us would break the quiet reverie with an ecstatic scream of pleasure.  Eventually we were reduced to communication beyond words.  We would mumble sounds and noises to each other and communicate that way, without words.  My friend said something about the rhythm of the universe and started putting a beat to the gentle hum of the river around us.  I found myself locked into this beat;  every noise echoed in my head a thousand times. ",
  "At some point during our time on La Piedra (The Rock in Spanish for you non-bilingual readers, as Matt and I came to call it in our Spanish class) I realized that if any person coming to the river to fish or hangout would be confronted with three apparently insane teenage males in the middle of some sort of lunatic ritual.  They would probably call the police right then and we would be duly arrested.  However, that meant nothing to me.  Police, laws, society all seemed for naught right then.  It seemed silly, really, that some person could approach a fellow human being and lock him away in jail for doing what I was doing.  Then I realized that government, countries, and society in general have all been some sort of weird development in human social growth.  Race, sex, and sexuality were all just ideas that had somehow manifested in  human kinds development-  they had grown from some whim of acceptance and tradition and were eventually established as norms.  How I wished we could be rid of it all!  Human kind and his place on this Earth was so simple, and so many people were wrong about it. ",
  "For several minutes I laughed at our absurdity, repeating over and over Its so simple.  Time passed, the Sun set, the Rock grew cold.  We left the Rock then and of course it was a little sad.  The rest of my trip was quite hectic, as upon our arrival back at the cabin it appeared that one of my friends had gone over the deep end and was left in some sort of insane, completely lost and shroomed out state of mind.  That story is for another writing, but Ill give you an example of the site I was confronted with upon my re-entry into our chaotic shroom room:  my friend had one hand submerged in a fishbowl that he occasionally sipped off of full of orange juice, cigarette butts, and pine needles , and the other hand shoved in a kleenex box;  his once pristine clothing was covered in an inch of dirt and muck, and he was screaming at the top of his voice I am an Action Figure! ",
  "Matt, Rob, and I shared something at the Rock that no one else could ever comprehend because it was ours.  Even as I finish with this description of my experience and re-read it I understand that my ponderings and realizations could never be told to another human being with the same depth and clarity of understanding that I experienced on that Rock.  I apologize for my bastardized retelling of the raw emotion and comprehension that completely engulfed me that wonderful afternoon.  The only thing I can tell you to do is to find your own Rock, and get in touch with your own existence.</p>"
 ],
 "erowid": {
  "id": "12568",
  "citation": " Arthur B. Goodwill. \"La Piedra, or, How We Lost It On the River: experience with Mushrooms (ID 12568)\". Erowid.org. Feb 17, 2002. erowid.org/exp/12568",
  "substance": "Mushrooms",
  "views": "13291"
 }
}
