{
 "title": "Cartoon Kaleidoscope",
 "author": "?!!?",
 "citation": " ?!!?. \"Cartoon Kaleidoscope: experience with Salvia divinorum (6x extract) (ID 9030)\". Erowid.org. Jun 7, 2004. erowid.org/exp/9030",
 "substance": "Salvia divinorum (6x extract)",
 "bodyweight": "150 lb",
 "report": [
  "<p>I love to trip.  I feel that I am well experienced with shrooms and LSD, but when I first discovered more information, I was astounded by how many different drugs there are in the world that can cause visions.  I read everything I could about every drug I've never heard of, but when I read about Salvia Divinorum, I felt that it sounded like the most interesting natural hallucinogen.  I didn't want to purchase it over the internet because I live with my parents, and I didn't want them to be curious about an unmarked package in the mail, but I knew that I had to get a hold of the divine mint someday.",
  "One day, when I went to a shroom dealer's house to buy shrooms, the dealer asked me if I ever heard of Salvia.  I said that I really wanted to try it.  She left the room and came back a few minutes later with a pipe-full of the sacred drug.  I was so ecstatic.  I felt that I must have been in some sort of dream.  She told me that I had to take a huge hit and hold it in for a long time.  She also told me that it comes on very quick, and that I should just sit in the chair and relax.  I put the warm pipe up to my mouth and looked at the shredded green herb in the bowl.  I inhaled a monstrous hit, and to my surprise the smoke was very smooth and tasted sort of minty.  I held it in for about 20 seconds and exhaled.  I gave the pipe back to her and relaxed like she told me to do.  Suddenly I felt vibrations running through my body, and when I tried to tell her what was happening, I heard my voice a few seconds after I talked.  I couldn't talk normal, so I decided to stay silent.  My body started rippling, and I felt a force inside me, trying to push it's way out.",
  "I looked at the shroom dealer and her body started to spin around and stretch backwards.  She seemed like a cartoon version of herself a thousand feet in front of me.  I waved my hand in front of me and it appeared many times in a trail of hands.  I watched the trail of my hands become the scales of a long snake.  This made me laugh uncontrollably.  I felt as if I would blow up from laughing too much.  I closed my eyes and saw various psychedelic shapes and colors swirling around in the blackness.  I opened my eyes and still saw the shapes floating around.  Then suddenly my vision turned like a page in a book and the next page became a kaleidoscope of my thoughts.  I could actually see my thoughts being processed in front of my eyes.  I saw and heard my thoughts pushing themselves around in the blackness forming a sort of alien landscape.  Slowly I  started to come back to reality.  I still felt as if something inside my body was pushing itself around, but eventually I came back to normal. ",
  "I told the dealer that what I had just witnessed was beyond comprehension.  My thoughts became so jumbled that I thought that I had permanently lost my mind.  She assured me that I would be fine in about 10 minutes.  The whole experience felt like an eternity, but it was only about 5 minutes.  I drove home pondering what this fairly unknown drug would do to society if everyone found out about it.  It would undoubtedly become illegal if it comes into the wrong hands.  Please respect Salvia, and in turn she will respect you.</p>"
 ],
 "year": "2000",
 "id": "9030",
 "gender": "Male",
 "views": "5662",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 6x)"
  }
 ],
 "submissionDate": "2004-06-07T07:00:00.000Z"
}
