{
 "title": "Emotionally and Cognitively Sophisticated [MET Love]",
 "author": "well do that later",
 "citation": " well do that later. \"Emotionally and Cognitively Sophisticated [MET Love]: experience with MET (ID 90320)\". Erowid.org. Jul 6, 2011. erowid.org/exp/90320",
 "substance": "MET",
 "bodyweight": "174 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "smoked",
   "MET",
   " T+ 0:40",
   "15 mg",
   "smoked",
   "MET",
   " T+ 0:42",
   " ",
   "smoked",
   "Cannabis"
  ]
 ],
 "report": "<p>0:00 - vaporized 25 mg MET in an oil burner - 2 large hits</p><p>0:05 - feeling MET comeup</p><p>0:06 - I relaxed back into the METglow.  This is a sort of slightly speedy tryptamine, slightly LSD-like state with a warm MDMA-ish center.</p><p>MET is an emotional drug.   I think of it as a genuinely emotionally and cognitively sophisticated compound.  Its also a lot of fun, and it feels great.</p><p>On this occasion, I found a friend's recently deceased mother talking to me. She explained a few things. </p><p>One thing I then thought/understood was that emotion or 'affect' may be the best way of apprehending and conceptualizing reality and the world. The most sort of basic building block being love.  This surprised me as I'm frequently somewhat cynical and detached.</p><p>0:40 15 mg vaporized</p><p>0:42 smoked cannabis</p><p>I definitely get an urge to redose usually at least once on this substance.  This time I also smoked, to relax myself a bit from the speediness. </p><p>I held my fingers down on my eyelids for some reason and this induced abstract geometric CEVs, followed by brief imagery flashes of faces, archetypes, landscapes, space.  I began to contemplate the interconnections between all humans, living and dead.</p><p>I tried to write some fragments in real time but all I came up with were:</p><p>individuation is like a trick that has been played upon us</p><p>all one organism, it thinks it is billions and billions</p><p>1:20 feel fairly down from the MET now, getting a bit sleepy, listen to some music and then off to bed.</p>",
 "year": "2010",
 "id": "90320",
 "gender": "Male",
 "age": "45",
 "timestamp": "2011-07-06T07:00:00.000Z",
 "views": "6229",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "25 mg",
   "administration": "smoked",
   "substance": "MET",
   "form": " T+ 0:40"
  }
 ]
}
