{
 "id": 9033,
 "title": "Experiencing God and Complete Enlightenment",
 "date": {
  "submission": "2007-06-20T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Whoorple",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablet",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": {
    "unit": "0:40",
    "quantity": "T+"
   },
   "administration": "1 tablet",
   "substance": "oral"
  },
  {
   "time": "MDMA",
   "administration": "T+ 0:40",
   "substance": "1 bowl"
  }
 ],
 "report": [
  "This was far and away the most intense, mystical, blissful, and beautiful experience I have ever had in my life, and I'm guessing right up there with the best anyone has ever had in any life, and I'm almost 100% sure it can never be equaled again until I'm dead.",
  "It was about 10:00 p.m. and I was going to go out to a party. I was feeling kinda down and wanted to have a good time so I picked up a pair of pills (plain white, no markings, pretty sure it was pure MDMA). Dropped one around 10:10 and headed out there. Right when I got there everyone decided to split, it was pretty lame. My friends and I ran around an abandoned house with flashlights for awhile, I wasn't feeling jack squat by the time 10:50 rolled around and so I dropped the other. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] At this point, I drove my friend home, and went back to my abode to have a good ole solo time, just me and my puppy. At this point I was starting to feel the roll, it hadn't fully hit yet but I was feeling much better than usual.",
  "I pulled out a bubbler, packed a bowl, and took a big rip, held it as long as I could. NOW it hit me, holy shit I was rolling balls. It was ecstasy...utter bliss. I was in the mirror, my eyes were bloodshot, I get insane redeye after pot, and I was STILL literally the most attractive person in the world. Normally I consider myself reasonably handsome, but looking at myself now it was like a filter had been removed from my eyes that had been there my whole life, and now Brad Pitt didn't hold a candle to me. It gives new meaning to 'beauty is in the eye of the beholder'.",
  "But I wasn't just perfect physically, I was perfect mentally. ALL I felt was love. I f*cking loved everybody and everything with every ounce of my being. Imagine the feeling of love you have when you first kiss somebody you deeply love. And multiply that by like a thousand. Literally.",
  "Now is when it got divine. I started talking in the mirror, yelling in the mirror, that I had to remember this. This is the way life is supposed to be. That is what it felt like. It felt like that is how everybody should feel all the time. I was the inner me. A me I had always known existed, but had never really gotten let out. I was my soul. I knew that. I was the perfect inner me, the me who had let go of all my worries of the past and hopes for the future and insecurities and masks and was just in the moment. The me I was designed to be. I felt perfect. I was perfection. Man...just remembering it makes me kind of sad, it was so incredibly, unbelievably, awesome.",
  "Anyways, there I was in the mirror, it felt like the God in me had been let out, and indeed it had. Here is why I know that drugs, at least X, are a path to a higher consciousness and not just an illusion of it. Beyond a shadow of a doubt. This is how I know that there is not 'no God'. I saw the reflection in the mirror of my dog, he was looking up and out of the glass door and flipping his shit. I mean he was going ape-nuts, looking up to the sky, more than I've ever seen a dog bark in my life, but his fur wasn't ruffled, which I realize only in retrospect. At this point I was almost not in control of what I was saying, I was just yelling this shit in the mirror, you have no idea unless you're rolling as you read this how perfect I felt...literally a shaking, a rattling, some kind of roar came through the house. At this point I really noticed the dog, and the roar freaked me out, so I stopped yelling. After I stopped yelling the dog and roar stopped.",
  "Next thing I know I'm laying down on my bed looking up at my light. I'm remembering something. Now this is the weird part, because I don't think I've ever been to this place before...I've tripped mushrooms a few times before, but never hard enough to be where I was now, I don't think...except when I had my bad trip, and that was hell. This...was heaven...I had no control over what I was saying at this point, I was just saying it, God was talking through me. Yessir, God was literally talking through me. I knew I had been to that place before, maybe it was on my bad shroom trip...it was something about going to a bad place or a good place I think, I'm really not sure. I know I was frightened while this was coming out of my mouth whilst I had no control. I think I was also saying the secrets of the universe, with no freaking control...I've been trying for about a month now to remember what I was saying under that light, it was completely about God and what was now happening to me.",
  "I knew that I had been to that place before, and forgotten it, that God erases it from the memory after someone has been there. Except this time I at least got to remember that there was something I wasn't allowed to remember. Sometimes flashes of what I was saying come to me, but what I was saying was so incredible and so revealing that I get shocked and immediately forget it again. After I regained control of my speech, I was in enlightenment and utter contentment. This was what God looked like in the light, by the way, I had no clue it was the symbol for Unity until much later, I thought it was infinity or something.",
  "So...now I knew The Ultimate Truth, as many of you have probably experienced before. The way that everything is so perfectly connected to everything else. I saw how every event in my life had led up to who I had become, how everything affected me, almost from the viewpoint of an outsider. This roll brought an insane new meaning to 'One Love' for me.",
  "Also I found out that soulmates are real, they don't always get together in every life and sometimes they aren't even incarnated together but people do have another half to their soul. Another level of meaning to 'One Love'...I wasn't enlightened as to whether or not Jesus died on the cross for ours sins or not, but his teachings are perfect. Trust me when I say this, everything that man said is ultimately true. Anything that counters it is wrong. I hate to be that blunt, but it is true. I understood it in ways I never even thought about before, sooo many moral points and concepts of sooo many religions have parts of this Truth to them. It was so beautiful. Maybe the Ultimate Truth is that God exists and the universe is absolutely perfect in every way. I don't even have 1% of the understanding I had that night now. I also wasn't let in on anything about resurrection or anything if I remember correctly. But I knew for sure, undeniably, that God was real. I couldn't have denied it if what I wanted most in the entire universe was for God to not be real.",
  "I felt like I was being shown things from my life...lessons perhaps...I don't remember anything I was thinking, but I remember everything I said that I actually had control over, and that the songs that were playing on my iTunes were all somehow directly about me, about life, about this perfect underlying reality, literally every lyric of every song. In the Ghetto by Elvis Presley played, I have no clue how that was directly about my life, but it was. It was the most beautiful piece of music I had ever heard. In Lose Yourself by Eminem the main point was that you get one in this lifetime, you are playing THE GAME OF LIFE. This song was actually kind of scary because of what it showed me.",
  "Every decision I ou make, every choice, every path...it's up to me to shape my destiny. I am responsible. While this song was playing I remember saying 'Wow...I really hope I make the right decisions in life'...I do know the right decisions by the way, at least my heart does. It is up to me to make them. Sometimes the right decision isn't always the most fun...think in the long term though...'This opportunity comes once in a lifetime'. The last song I remember that was playing was I'll Make a Man Out of You from Disney's Mulan. The only part of that song I remember being about where I was, being about God, was the line 'mysterious as the dark side of the moon'...God really is mysterious as the dark side of the moon, I have no idea...it was like He was talking to me through the music.",
  "Some of the stuff I really don't comprehend now though, I knew what I was supposed to accomplish in life if I made the right choices...I'm supposed to be a scientist, I even knew what I was supposed to discover, it involves the very chemical I ingested that night, but now that I'm back to Earth it just seems too...crazy...impossible even. Seeing the future? WTF MATE! And ever since I started getting high I've been writing stuff on Notepad, every time I've gotten high or tripped and been at home I've written stuff on Notepad, stuff about life and my thoughts and poems and things, and when I was enlightened I realized that being high is some kind of attunement to where I was now at, and everything I had written was extremely true while in any inebriated state. You know what it's like to be high...it's so different...so revealing. Even alcohol is a kind of stupid attunement to where I was. 'Automatic writing' is very real, the first time I ever tripped I wrote for about 40 minutes on Notepad without having a f*cking clue what I was writing and it all came out to make sense.",
  "Some other stuff I remember saying / thinking was how this must be how Mother Teresa and Ghandi and Buddha and Jesus etc. felt ALL THE TIME. I hate to say it but I'm envious of those people, that place was fucking SICK! I knew exactly what Mother Teresa meant by 'I see God in every living human being'...there's God inside of you, there's a perfect soul underneath all this stupid worldly shit, I don't think what the Church says about us all being filthy little sinners who have no way to be good but through Christ's sacrifice is true. I remember knowing that I wasn't allowed to know what I knew then in the morning, and saying, 'and that's why it's called faith, huh?' Faith is sooo very important...and it's simple...just...have it! lol. Listen to all those songs...'There can be miracles, when you believe'...'I believe I can fly...if I just believe it, there's nothing to it'...just believe! There's a lesson in every song, look for it.",
  "Sooo that's pretty much it. I was everything, I knew everything, yes even the meaning of life...how the fuck do you forget the meaning of life, by the way?? How frustrating...maybe the meaning of life is to find the meaning of life. I would love to know if anyone has had a similar experience, especially if you got to see the future like I did, because if I find out that wasn't just insanity then I need to start working on my science...I thank God every day for that rattling and my dog being in that house with me, or I would probably think it was 'just drugs' now. Now I know that everything is connected, and to not worry about what life throws at me. Because it's throwing it at me for a REASON. I can either catch it, or let it hit me in the face and knock me down. Life is a thing when ya learn ya grow :)",
  "I don't think God was lying when He said in the Bible 'If you seek me and seek me with all of your heart, you will find me'...and God IS love by the way. I don't know what He is or how He is or where He is, but I know He is, and that He is ultimately loving, more than you can imagine!"
 ],
 "erowid": {
  "id": "52567",
  "citation": " Whoorple. \"Experiencing God and Complete Enlightenment: experience with MDMA (Ecstasy) (ID 52567)\". Erowid.org. Jun 20, 2007. erowid.org/exp/52567",
  "substance": "MDMA (Ecstasy)",
  "views": "3412"
 }
}
