{
 "id": 9035,
 "title": "The Perfect High",
 "date": {
  "submission": "2009-07-09T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "rayonacid",
  "gender": "Male",
  "weight": "60 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 ",
   "administration": "oral",
   "substance": "Mushrooms"
  },
  {
   "time": "0",
   "amount": " T+ 0:30",
   "administration": "1 tablet",
   "substance": "oral"
  },
  {
   "time": "MDA",
   "amount": "",
   "administration": " T+ 2:00",
   "substance": "1/2 tablet"
  },
  {
   "time": "oral",
   "amount": "MDA",
   "administration": "",
   "substance": " T+ 2:20"
  },
  {
   "time": "1/2 tablet",
   "amount": "oral",
   "administration": "MDA",
   "substance": ""
  },
  {
   "time": " T+ 2:20",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Ketamine"
  },
  {
   "time": "(powder / crystals)",
   "amount": " T+ 3:00",
   "administration": "1/2 tablet",
   "substance": "oral"
  },
  {
   "time": "MDA",
   "amount": "",
   "administration": " T+ 3:30",
   "substance": "1/2 tablet"
  },
  {
   "time": "oral",
   "amount": "MDA",
   "administration": "",
   "substance": " T+ 0:00"
  },
  {
   "time": " repeated",
   "amount": "smoked",
   "administration": "Cannabis",
   "substance": ""
  }
 ],
 "report": [
  "<p>Where I live, (Pakistan), we get the best hashish in the world; also ketamine is as cheap as coal. However, the concept of ecstasy is still on the rise. (LSD is as rare as a miracle)",
  "This previous March, a friend and I scored 6 MDA pills (called McDonalds) and decided to trip hard. We were tripping at his place and we had a mushroom each at about 1'o'clock at night (T-00:00).",
  "(T-00:30)  We reached his place at about 1:30 and immediately swallowed our first pill. After that, he started dancing around while I rolled a joint. Both of us could feel slight rushes making there way because of the mushroom.",
  "(T-01:30)  I was getting kind of upset because this pill usually hits early, and by now I should have been extremely happy, yet I started feeling depressed and lonely. I asked my friend whether he was high and he responded with to MAJOR thumbs up. This helped me gain my psychological state back and in a matter of seconds my sight weakened, my throat dried up and I overall became euphoric. The music took over and I got lost into it.",
  "(T-02:00) Someone pokes me and I come back to my senses. Its my friend. He hands me half a pill and swallows his half with some coke (a-cola). I follow and he tells me he has some ket on him. I, of course, accept his offer. By now my high is extremely amazing; I cant see straight, everything is a blur and when I focus, I lose it in about 5 seconds. And in those five seconds, my visual screen shakes violently as if electrocuted. AMAZING!!!  ",
  "(T-02:20) I snort 2 lines of ketamine and swallow another half of the pill. This time he follows. Now check this out!!!  I snorted the lines and swallowed the pill and relaxed back on the couch. Then after about 20 seconds I got up and realized I could hardly walk. The room was dark and I decided to walk about. I moved away from the couch across the room and till the bathroom on the other side. Then I slowly walked back and sat down on the couch and closed my eyes. Just then my friend shook me again and offered me a joint. I asked him what had just happened and he replied Nothing! You snorted some ket and sat back and I rolled a joint, then I woke you up and here we are. The lights were on and there was a table where I had walked through a second ago.",
  "(T-03:00) I pop yet another pill and snort some more ket. The rushes come on faster and stronger with every hour. The two of us start talking and the topic varies from cars to school to emotional tragedies. When things start to get depressing, we immediately switch subjects. We keep on smoking joints and talk and talk. Whenever something interesting is mentioned, the high gets stronger and more intense (not that it wasnt INTENSE enough). And whenever something upsetting is mentioned, both of us get a gut drop feeling. Mind you, with XTC, it is never this intense, the music sounded better, mood swings were enhanced a 100 times and all sorts of crazy shit was happening.",
  "(T-03:30) I pop the last half of my pill and snort another line. The effects keep on increasing and changing with the music. Everything seems perfect. True ecstasy.",
  "(T-05:00) The high is still there but the sun made it hide somewhere inside of us. As the sun rises our euphoria falls. And with that I leave for home.",
  "(Next Day) No hard hang over just some dehydration,(Im sooo used to that)</p>"
 ],
 "erowid": {
  "id": "52583",
  "citation": " rayonacid. \"The Perfect High: experience with MDA, Ketamine & Hash (ID 52583)\". Erowid.org. Jul 9, 2009. erowid.org/exp/52583",
  "substance": "MDA, Ketamine & Hash",
  "views": "2800"
 }
}
