{
 "title": "Facing Fears",
 "author": "wRRa",
 "citation": " wRRa. \"Facing Fears: experience with 4-HO-MET, Amphetamine & JWH-018 (ID 90367)\". Erowid.org. Jul 22, 2011. erowid.org/exp/90367",
 "substance": "4-HO-MET, Amphetamine & JWH-018",
 "bodyweight": "51 kg",
 "header": [
  "DOSE:",
  "40 mg",
  "oral",
  "4-HO-MET",
  "(capsule)",
  "",
  " ",
  "smoked",
  "JWH-018",
  "",
  "",
  " ",
  "insufflated",
  "Amphetamines",
  ""
 ],
 "report": "<p>I had heard a lot of good about 4-ho-met and had once taken 15 mg of 4-aco-dmt before, so I thought the experience was going to be something similar. My friend gave me a little bag, saying it contains 20mg of 4-ho-met.</p><p>At the time I was going out with Joe (names changed) and he didn't have his own apartment but was sleeping at our friend Tom's place. There was a rave party that night so we were planning on taking some drugs at Tom's place and going to the rave party after that.</p><p>So, we were chilling at Tom's place, the three of us. I didn't know most of the other people coming and going to Tom's place but there were some guys that came there to deal drugs with Joe and Tom. So while I was tripping, people I didn't know would come and go, and that wasn't very good for my set & setting.</p><p>I opened the little bag that contained 4-ho-met. I found two capsules in it, and thought they would have 10mg in each of them. Later I found out they actually had 20mg in each; my friend who gave the bag to me thought there was only one capsule left. I swallowed them and smoked some jwh-018 while waiting for the psychedelic experience to start kicking.</p><p>I was also speaking with Tom that maybe we should get some 2c-i so I could boost 4-ho-met. The experience I had with 15 milligrams of 4-aco-dmt was pretty lame, so I wasn't expecting much of this trip. I thought I'd just have some funny visuals and then go to the rave party. When we got 2c-i after a couple of hours, I was tripping so hard I couldn't even think of taking any more psychedelics.</p><p>After 30 minutes I started feeling a little bit nauseous. I told Tom and Joe that at the moment I had no intention of going to any party, I just wanted to sit down and relax. But I also added that the feeling might go away after a while. Anyhow, it didn't.</p><p>I started seeing the first visuals. I went to the toilet and saw the shower getting closer to me as trying to whisper something in my ear. I was a little bit frightened but then I realized it was just a visual and laughed. I washed my face and went back to chill on the sofa with Tom and Joe.</p><p>Joe took some 4-fluoro-amphetamine and started talking A LOT and I found that kinda annoying. At that time I was still able to talk and I wanted to have conversations with the other people hanging out there, since it wasn't only me, Joe and Tom but there were some other drug heads too. With one of them I started discussing about how I feel and told I'm seeing somebody sitting in my right side all the time, even though I know there's nobody there. And he was like 'oh yeah, I know that feeling'. Then Joe started talking about his stuff again and he just talked and talked and I didn't feel like listening to him anymore, so I just looked away and thought about some other stuff in my head.</p><p>I went to the toilet again. I didn't feel really good, neither physically nor mentally. I realized that the effects were way stronger than the time I had taken 4-aco-dmt. I remember thinking 'This 4-ho-met is not really my stuff... but well, thankfully it's not gonna last for forever'. At this point the trip started turning bad.</p><p>I went back sitting on the sofa and talked something with Tom, but then I realized I couldn't tell Tom apart from the wall behind him; so strong were my visuals. I saw fractals everywhere, I couldn't really tell people apart from each other. I didn't really know who was I talking to, if I even was talking to anybody. I was so unsure even about my own existence. Who was I? What was I doing here? Where was I? Who were these people with me? I had no idea. Had I taken something...? Oh, right... I was tripping... tripping on what? What is tripping anyways? Tripping... I was losing all of it.</p><p>I felt frightened because I realized I was totally losing the control of everything. I realized I was losing my sense of reality, and that felt damn scary. I wasn't really sure if the people around me were really there. Their faces looked all weird and I couldn't tell them apart from each other. I couldn't even tell myself apart from the sofa I was sitting on. I didn't feel my legs, I didn't feel my body. All I could do was sit down and hope it's gonna end soon.</p><p>Joe was next to me and asked if I'm alright because I looked really pale. I tried to tell him I was tripping harder than ever but I didn't know how to speak anymore. He asked if I wanted to some speed and I snorted some because usually speed makes the psychedelic effects to go down. This time, it had no effect.</p><p>My friends were listening to psytrance which felt really aggressive and I felt that it was kinda ripping my brain in pieces. But I couldn't speak so I couldn't tell them to change the music.</p><p>I hugged Joe. I felt his warmness, and that helped me to calm down. When I closed my eyes I wasn't in the room anymore. I was in some kind of tunnel, where everything was circling around me. I heard voices of spirits around me, whispering: 'Let go. You have nothing to be afraid of. Just let go of the reality. You have always come back from all of your trips; trust us.'</p><p>And I let go.</p><p>Nothing has ever felt so good.</p><p>I felt warm and safe. I realized I wouldn't do psychedelics with people who would hurt me or in a place where something bad would happen to me. I realized I was alright and I didn't have to worry about the reality; I could just let it go. And I did, oh yes, I did.</p><p>I asked for pen and paper but all they had was an old ripped sheet... I took it, and I took the only pen they had in that apartment. And I draw. I have never drawn with such and inspiration. I draw circles, I draw eyes, mountains, everything that came to my mind. It felt soooo goood. Later I decided not to do 4-ho-met without a sketch book and pens with me, heh. Joe was annoying me because he wanted to be too close and I just wanted to draw and he was kinda on my way. I wasn't really social, I didn't feel like talking, I just felt like drawing.</p><p>I saw how the little pictures were walking down my hands to the pen and then to the paper. I would keep drawing for 2-3 hours and then I realized the trip was going down. I felt really good, I felt that I had faced my fears of letting go of everything.</p><p>Next time I'm gonna try a larger dose with better set & setting, maybe 50 mg. This is a true psychedelic! I've done a lot of psychedelics and 4-ho-met is gotta be among my top 3: Ayahuasca, DMT and 4-ho-met. I have done rather big doses of phenetylamines but didn't find the same spirituality in them that I do find in tryptamines. 4-ho-met felt really spiritual.</p><p>This the best RC I've ever done so far and I've done a lot of them. Really nice.</p>",
 "year": "2010",
 "id": "90367",
 "gender": "Female",
 "age": "19",
 "timestamp": "2011-07-22T07:00:00.000Z",
 "views": "5059",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "4-HO-MET",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": ""
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": ""
  }
 }
}
