{
 "id": 9045,
 "title": "Leaving the Cocoon",
 "date": {
  "submission": "2008-09-17T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Wingrin1",
  "gender": "Male",
  "weight": "100 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>We felt like Gods that night. Twin Apollos roaming the earth, freed from our fleshly cocoons by the acid tabs wed taken a few hours earlier. How things had changed. Just an hour ago I was whinging about experiencing no effects whilst driving my friend the D-Man home in my car.[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] He was to be my trip buddy and there seemed no need for him to hang around as wed taken dud tabs. We'd been waiting for this night because we were Acid virgins. I was so scared I popped a valium and had a cone to take off the edge of the 3 tabs. I wanted to see God straight up. Bring on the ego dissolution I kept hearing about. But so far I'd felt nothing but the bitter taste of the acid, a mild high from the pop, and now I was getting sleepy.",
  "Suddenly I became transfixed by the beauty of a bug on the inside of the windscreen, and not long after that the steering wheel started to melt through my hands. Welcome to the house of fun. Somehow we got to D-Mans house and upon leaving the car I looked up to the Moon. It shattered into a tetrahedron with a Moon at each juncture. I turned to say something but D-Man had seen it too. We thought it best to get inside his flat as quickly as possible while we still could and locked the door behind us. D-Man went to light an incense stick and that too split, and then formed three separate versions. A golden orb was circling in an arc through the lighted tips. I got the impression with blinding certainty that it was a fire sprite, whatever that is, that was keeping the sticks burning. Again, D-Man saw the same thing. We were linked up on this ride, for better or worse. Maybe I should have listened to my Mums dont do drugs speech, but when she gave it to me she had a Martini in one hand and an Alpine cigarette in the other. It was hard to take her seriously, and she was deaf to the irony.",
  "The room started to fill out with giant plasma balls. They looked like interlocking molecules and were coming in and out of the undulating white light waterfalls covering the walls. It was around this time that pictures of people, on magazines lying around, started to come alive. Their faces looked questioningly at me, and some had a beckoning look of invitation. They told me to walk through the walls, so I placed both palms on one and focused into the bricks and mortar. Like Moses parting the Red Sea, I divided the white light waterfalls to reveal an oblong crack that grew steadily larger. I was now peering into a different dimension and amongst the vermillion swirls of light I saw a group of purple beings. They appeared to have a hive mind. As one their group consciousness called to me - to stay, to play. One creature took my hand in the universal sign of welcome, and I stood teetering on the brink.",
  "The next second held a key nexus decision point in the matrix of the Universe and I chose the earthbound path and plane. I pulled back from the entity and fell back into the room, but I was not the same. The room no longer looked like it did before. It was the same and yet different. All objects had become timeless and eternal within themselves. It was like I had stepped out of time and now beheld the Truth. Time is a kids game and mainly illusion. A tool to be used in the Universal University. I sensed the mass consciousness of the planets in my Solar System bearing down upon my fragile consciousness. They welcomed me like a little brother. I turned around to D-Man but he had become a Cosmic Flower, the Seed of Life, and his Soul was radiating the scent of knowledge which spanned eons. All objects had become metaphor. The outer form an undulating husk or mask, for the ever increasing infinitude of depth, just beyond the time-space boundary of the surface of a coke can or vase.",
  "It had been an interesting drug career which led me here. It had accelerated over time. Five years of age and the chocolate addiction started, seven years old and I shoveled fathers powdered snuff up my nose, thirteen years old and I downed five coffees a day til I was jazzed and jittered, sixteen years saw the birth of alcohol benders, seventeen the abuse of tobacco, eighteen meditating till I slipped into the Nirvana of my own ass, nineteen pot, twenty home made 'cocaine', and finally to acid at twenty-one. Home made cocaine I hear you ask? I had read that it could be made from a distillation of wild lettuce. I thought it would be ok to use the common supermarket variety, and set about fermenting two giant tubs of the stuff. Under my parents house it bubbled away, and they bought the line that I was on a health kick and needed this special dietary supplement. When the day came to smoke the waxy residue I got more of a hit off the fumes from the pen I was using as a makeshift pipe. I should have stuck to the wild lettuce, but where does that grow?",
  "D-Man had taken one tab less than the three dragon spots flying in my system. He had control again but I was still a kite in the cosmic breeze. Then things went pear shaped. Lets go to the Grave Yard man, he said whilst hoicking me out the door. The Toowong Cemetery was isolated enough in the daytime and now it was close to Midnight. Still, I was in no state to protest. Once there he drove straight to the highest point in the site.[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] A marble finger stabbed up from a crypt on the hill; the final resting place of a famous parliamentarian. Around it swirled spectral dragons, skeletons and lost souls in an ecosystem of despair. I looked on with my mind a whirlpool of fear and yet I could not prise my eyeballs away. The vista was a quantum soup of flux and I had lost my mind. D-Man became the rudder on my ship and commenced with question time. He was now an Elf with pointed ears and even keener eyes.",
  "What is the riddle of Man? he boomed, Answer the Ancient One, for it now waits. The jewel encrusted Sphinx had appeared in the midst of the portal and all the night creatures sang the OMMMMMMM hymn of night to their Master. Revelation and illumination struck like lightening across my synapses. The Universe was clarified along with my place in it. I tore my shirt, and beat my chest.",
  "\t This is me, a Monkey-Man of Mammon.",
  "\t  This is me, tonite.",
  "\t  Look again, O Ancient Sphinx.",
  "\t  Can you see my light?",
  "\t  Not just mine, but all of Man.",
  "\t  Come upon the Dawn.",
  "\t  Evolution draws upon,",
  "\t  The Scripted Word of Lord.",
  "The Rose-light struck from chest to star. The fiery light did burn. Now all in tune, the knowledge true, subsumed and learned and turned. Many years would have to pass, before I could return. To Mammon World of Monkey-Mind, but never as before. For now I held the Golden Key, Home Coming was assured. A word of caution, sad but true - We are not build for sight. Of Vaster Plan than is imagined, in murky dead of night.</p>"
 ],
 "erowid": {
  "id": "52627",
  "citation": " Wingrin1. \"Leaving the Cocoon: experience with LSD, Diazepam (Valium) & Cannabis (ID 52627)\". Erowid.org. Sep 17, 2008. erowid.org/exp/52627",
  "substance": "LSD, Diazepam (Valium) & Cannabis",
  "views": "5882"
 }
}
