{
 "title": "Forgetfulness",
 "author": "BP",
 "citation": " BP. \"Forgetfulness: experience with Cannabis (ID 9045)\". Erowid.org. Jul 2, 2005. erowid.org/exp/9045",
 "substance": "Cannabis",
 "bodyweight": "137 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9045",
   "Male",
   "",
   "Not Given",
   "Jul 2, 2005",
   "6364",
   " "
  ]
 ],
 "report": "<p>This is more or less about my experience with marijuana as a whole, not an individual one.</p><p>That being said, let me tell you that I never really wanted to try marijuana. I never had the desire to be near that stuff. But once my friends began to get involved with it, it seemed my choices were limited. I could either hang out with them and try marijuana and use it like them and fit in, or I could lock myself up in my room and mess around on my computer.</p><p>Anyways, the first time I smoked I didn't even get a buzz. We smoked 2 joints and nothing happened. I was convinced I was invulnerable to the drug. Then one of my friends took me out and smoked a single bowl with me right after school. He asked if I felt anything, and I said yeah, even though I wasn't really feeling anything.</p><p>After driving to his house and him running in to get some drinks, I still wasn't feeling anything. No cotton mouth or anything, unlike him.</p><p>After another 15 minutes, it suddenly hit me.  The world almost stopped, and I couldn't believe what was going on. I didn't even realize it until I almost ran into the back of a truck. I couldn't focus on anything, and everything was blinking. My whole body was going crazy with the buzz.</p><p>I had to get off the road quick because I couldn't pay attention to driving. So I went home and watched TV. That was one of the most fun days of my life.</p><p>The use of the drug continued to grow in the months to come, even though the friend who got me started had quit for reasons unknown (though I think I have an idea). It was all in good fun. Nothing else to do.</p><p>People want to get high all the time now. Its an everyday habit, though I don't feel an addiction. I could stop, if I had the guts to tell everyone I quit.  </p><p>Anyways, it makes me forget things. Things that used to come naturally, now require thought and effort. Things I never had a problem with or even gave much attention to before, like when I'm at a party. I can't relax. I know I'm sending the wrong message with my body language, yet I can't stop it.  Nothing feels normal anymore. I have to actually think about where to put my arms when I sit, stand, whatever.</p><p>Another thing I can't do near as well as I used to is spell. I used to be a spelling whiz. I never had to look at a word more than once to learn how to spell it. Now I forget how to spell common words I use everyday.</p><p>Another thing that strikes me, is that we used to play pool a lot. Everyday we'd go to the bowling alley and play pool. We were almost always baked when we did that. We had gotten quite good at it, before we quit playing for about a week or two. It was too expensive. The next time we played, the strangest thing happened. I couldn't remember how to play. I knew the rules, but I couldn't figure out how to hold the stick, or how to use english on the ball. Everything I did was wrong. It terrified me. I had to almost re-learn how to play.</p><p>I have forgotten numerous things that I used to know and understand. I can only wonder how many things I have forgotten that I don't even realize yet. I think I'm done smoking for a while, and we'll see what happens. If all this weird shit stops happening, I will write a follow-up.</p>"
}
