{
 "title": "Clinical Trial for Aspiring ER Nurse",
 "author": "my brown eyed girl",
 "citation": " my brown eyed girl. \"Clinical Trial for Aspiring ER Nurse: experience with Products - Bath Salts, Plant Food, etc. ('Revitalize Fizz') (ID 90492)\". Erowid.org. Aug 30, 2011. erowid.org/exp/90492",
 "substance": "Products - Bath Salts, Plant Food, etc. ('Revitalize Fizz')",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " repeated",
  "insufflated",
  "Products - Bath Salts, Plant Food, etc",
  "(powder / crystals)"
 ],
 "report": "<p>[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.] </p><p>Well I am a nurse and also a nursing student working on getting my RN. I had heard about 'bath salts' from another nursing student who works in the Emergency Room at a local hospital, and have to admit I was a bit curious.  I have used cocaine in the past and loved it, however the health care system is not exactly conducive to that type of behavior.  So, to kick off my spring break I decided to do a clinical trial of sorts.  After a search that took me to a different state (I live on the border of PA) proved worthless, the very nice girl in the smoke shop I originally went to pointed me to a local head shop that I didn't even know existed. I paid $50 for 500mg of 'Revitalize Fizz bath salts'.  I went home and did a very small line at about 6:00pm.  I sat and read a book, smoked a cigarette and didn't notice any effects.  After about 30 minutes I did another small line.  In about 20 more minutes I began to notice I felt more energetic. </p><p>About 45min to an hour after I snorted the first 2 lines it fully kicked in.  I feel absolutely amazing!  I wanted very much to dance, so I put some music on and danced by myself in the living room.  Then I began to notice that my mouth was very dry.  In the past 5 hours I have drank 6 bottles of water and 2 cans of soda.  Still have a case of cotton mouth.  About 2 hours after the first dose I did another larger line, and boy did I feel it!  Was feeling very chatty and didn't have anyone to talk to, so started texting. </p><p>It was then time to pick my husband up from work, he noticed that I was very upbeat.  He kept asking me why I'm so 'wound up'.  I just told him that I was in a great mood.  He bought it... not sure why though considering I could not stand still, was talking a mile a minute and smoking like a chimney.  Anyhoo.  I had to sneak into the bathroom to do about 3 more smaller bumps.  Just did my last line about half an hour ago, and am determined to stop here because I really would like to sleep at some point tonight. </p><p>I should say that I am also an experienced opiate user, due to some work related injuries I have been prescribed Percocet and Vicoden and have been taking them for approx 2 years.  I get withdrawals when I don't have them.  I will say that I took about 5 Vicodin 5/325 earlier in the day.  Once I did the bath salts I did not have any desire to take any more pills.  I don't even miss the opiate high.  And this also helps with pain.  My injuries haven't been hurting since I started this.  I have felt some of the come down effects, but I don't believe they are anywhere near as severe as the cocaine come down.  I guess we shall see.  However, I don't believe that I will be able to sleep anytime soon, and I hate that feeling.  I do not want to feel like a strung-out zombie tomorrow.  Am debating taking a 10mg Ambien to see if that will help, but am a bit nervous because I don't know how I will react. </p><p>All in all this has been a very enjoyable experience.  Definitely more of a cocaine high than any hallucinations.  Would love to try it during a night out.  If you do decide to take this drug please be safe and do it around people you trust to take care of you and get you prompt medical attention if needed.  That's just the nurse in me talking!  I hope this substance remains legal, however I'm sure the government will not allow that to happen.  Thank you for reading my experience.  I hope this helped you out if you are thinking of trying bath salts.</p><p>[Reported Dose: 'maybe 15mg total']</p>",
 "year": "2011",
 "id": "90492",
 "gender": "Female",
 "age": "30",
 "timestamp": "2011-08-30T07:00:00.000Z",
 "views": "6807",
 "dose": {}
}
