{
 "id": 9050,
 "title": "Dazed without the Confusion",
 "date": {
  "submission": "2007-12-18T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Rasta Bro",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 tablets",
   "administration": "oral",
   "substance": "Pharms - Propoxyphene",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "6 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "This experience took place a couple years back.  I was using my friends bathroom when i looked in the medicine cabinet and discovered a bottle of Darvocet.  I'de heard of it before, but had never actually taken it.  I decided to pocket 4 medium sized red pills. ",
  "About 2 days later, a few friends and myself decided to have a few beers at my place.  But before drinking, I popped all 4 Darv's (not the brightest idea).  We sat in my basement playing cards and just talking.  The darvocet made me feel intoxicated fairly quick.  After just three beers i was quite buzzed. ",
  "After finishing my 6th bottle, i was quite drunk.  I also had a very warm, numb feeling throughout my body.  A friend suggested we go out to the garage and smoke a couple bowls.  We packed some fairly potent cannabis into my waterpipe.  After just 4 Hits, i felt extremely stoned.  I was forced to sit down and lean against the wall.  My vision became very obscured, all i could see was a really bright light.  This sensation lasted for a couple minutes, and afterwords i still felt very intoxicated.  I managed to drag myself into the house and collapsed onto the couch.  Just laying on my back listening to Led Zeppelin was extremely pleasurable. ",
  "I awoke the next day feeling drained, and my vision was still off a little bit.  But besides that, no real 'hangover effects'.  Haven't used Darvocet since that day, but am considering using it again without the alcohol."
 ],
 "erowid": {
  "id": "52655",
  "citation": " Rasta Bro. \"Dazed without the Confusion: experience with Darvocet, Alcohol & Cannabis (ID 52655)\". Erowid.org. Dec 18, 2007. erowid.org/exp/52655",
  "substance": "Darvocet, Alcohol & Cannabis",
  "views": "12316"
 }
}
