{
 "title": "Three Minutes Then My Mind Was Blown Apart",
 "author": "IpsoFacto",
 "citation": " IpsoFacto. \"Three Minutes Then My Mind Was Blown Apart: experience with 4-HO-MPT (ID 90564)\". Erowid.org. Jun 27, 2011. erowid.org/exp/90564",
 "substance": "4-HO-MPT",
 "bodyweight": "173 lb",
 "header": [
  "DOSE:",
  "8 mg",
  "smoked",
  "4-HO-MPT",
  "(powder / crystals)",
  "",
  " ",
  "smoked",
  "Cannabis",
  "",
  "",
  " ",
  "oral",
  "Cannabis",
  ""
 ],
 "report": "<p>Prior drug experiences: DMT, DPT, 4-HO-DiPT, MET, 4-AcO-DMT, LSD, 2C-B, 2C-D, psilocybin mushrooms, salvia divinorum, methamphetamine, amphetamine, 4-FA, methylone, MDMA, cocaine, cannabis, opium, opiates, etc.</p><p>I had procured some 4-ho-mpt freebase and knowing that this is a rare and relatively untested research chemical, I did an allergy test many hours earlier.  After reading the few reports available about this material, I decided the best way to sample it was to vaporize what I thought would be a small quantity.  I may have had some moderate tryptamine tolerance from vaporizing DMT and DPT around 3 days prior.</p><p>9:00 PM  put 8 mg of 4-ho-mpt into an oil burner, and gently heated it until vapors arose.  It was extremely easy and quick to vaporize.  I did one very long pull on the pipe, getting a lungful of vapor which I held for around 30 seconds, then exhaled.</p><p>Within seconds I started to feel the effects.  This is not a gentle come-up, only short of DMT in its speed of onset (though I haven't yet tried any of the 5-meos). Within a couple of minutes I could feel it strongly.</p><p>9:04 With my eyes closed I could see the my world filling with smoke.  The smoke engulfed me and equalized and blended all of my senses (synesthesia) along with an incredibly strong tactile feeling of energy going through me.</p><p>The energy was at once sensual and all-encompassing.  It dominated this trip, which was a +++ in literally minutes and stayed +++ for around the next 45 minutes, with the peak probably from around 2-30 minutes in.  I cant overemphasize how dramatically altered I was in such a short period of time from what I thought and still think is such a minute dose.</p><p>10:15  Started writing this up. The effects of this substance on me are not particularly visual.  Though there were clear closed-eye images these accompanied thoughts and were more of a daydream than hallucinogenic vision or even patterning.  Certainly not the geometric frameworks and lattices of a smoked DMT experience. </p><p>The experience was overwhelmed by the intensity of feeling coupled with a sort of cosmic understanding of the oneness of raw natural material (matter) and energy and how these two categories of things which we take as both being ontologically real are actually inseparable.  This is cognitively not even very interesting but it was definitely interesting to actually feel like I was experiencing this in my body and that somehow this even encompassed my social world.   Listening to music (dub and dubstep) seemed to bring this on even more strongly but eventually became intolerable,</p><p>Lets just say I was in a very strange headspace for at least an hour and 15 minutes and still am now as I write this.  Wow.  This is some powerful stuff.  Very strong in the mindfuck department, with interestingly altered thoughts and a sense of DMT-like frame-stacking though this was not purely visual but sort of an overwhelming perception of time being frame-stacked.  In contrast to other smoked tryptamines this was without the sort of warm, therapeutic tinges to the heart of a more empathogenic substance like MET, and not very similar to DPT.</p><p>10:30 smoked and ate cannabis</p><p>10:45  the cannabis has chilled this experience out a bit and actually made me crave a little more.  If I didnt have things I have to do I would smoke a little DMT or MET on top of this (not sure about tolerance) just to get a bit of a visual impact as the 4-HO-MPT effects slowly recede into the cannabinoid glow.</p><p>Summary: not as user-friendly to me as its cousin 4-Ho-DIPT, a bit more like 4-AcO-DMT combined with iprocin and MET perhaps?  Definitely its own headspace.  Incredibly rapid come-up and fairly long duration of peak effects for a smoked tryptamine, and this at what seemed to be fairly modest doses.  This is worth getting into but it is a strong one, explore it carefully.</p>",
 "year": "2010",
 "id": "90564",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-06-27T07:00:00.000Z",
 "views": "5867",
 "dose": {}
}
