{
 "title": "Testing for Interactions",
 "author": "IpsoFacto",
 "citation": " IpsoFacto. \"Testing for Interactions: experience with Methylone & Modafinil (ID 90575)\". Erowid.org. Jun 27, 2011. erowid.org/exp/90575",
 "substance": "Methylone & Modafinil",
 "bodyweight": "174 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "oral",
   "Modafinil",
   "",
   " T+ 5:00",
   "125 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   " T+ 6:45",
   "100 mg",
   "oral",
   "Methylone",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>-5:00  200 mg Modafinil (Modapro) orally</p><p>0:00 125 mg Methylone, parachuted</p><p>1:45 100 mg Methylone, parachuted</p><p>I had taken Modafinil in the morning to stay alert and functional and get some work done, but by late afternoon I wanted to try taking some methylone.  After scouring the internet for any information on this combination, and finding none, I decided to go ahead and notate any interesting interactions for the sake of science.</p><p>I take modafinil about once a week, usually with caffeine, so I'm used to the slight jitters and alternating mild euphoria/dysphoria of this drug.  Initially I was concerned that taking methylone on top of this might further increase jitteriness or anxiety.  However, I couldn't find any strong warnings about this combination (or about modafinil and MDMA) so I decided to give it a try with a slightly smaller than full dose of methylone.</p><p>I parachuted 125 mg of methylone and continued working.  Within about 30 minutes I began to feel a slight sense of calm and well-being.  In fact, as the methylone effects continued to increase, I noticed that it was in a way taking the edge off of the modafinil.  By around 1:10 I felt really good - peaceful, and somehow more spiritually calm than I had felt for a while.  The interaction between these two does not seem to potentiate any of either of the substances' more unpleasant side effects, at least at this dosage.</p><p>At around 1:45 in I decided to do an oral bump of 100 mg parachuted, as I felt that if I waited any longer the redosing would be ineffective.  It may have already been slightly late, as the redose didn't so much extend the trip as delay the comedown, with more stimulating than empathetic effects predominating. </p><p>At no point during this entire experience did my heart rate increase particularly and no other physiological side effects were felt, except appetite suppression.  Psychologically I found the experience increased empathy, lessened anxiety, and added perspective to a number of personal issues I was reflecting on.  Mellow music was also enhanced.</p><p>All in all, I would consider doing this again in situation where I need modafinil to stay awake/alert, and later in the day want to relax a bit with methylone for the empathetic and euphoric effects.  Next time I would do a single dose of methylone at 175-200 mg.</p>",
 "year": "2011",
 "id": "90575",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-06-27T07:00:00.000Z",
 "views": "5638",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": ""
  }
 ]
}
