{
 "title": "Forever Plagued",
 "author": "oXi",
 "citation": " oXi. \"Forever Plagued: experience with MDAI (ID 90652)\". Erowid.org. Aug 12, 2011. erowid.org/exp/90652",
 "substance": "MDAI",
 "bodyweight": "120 lb",
 "report": "<p>When I first heard of MDAI, I was just browsing research chemicals on various websites, not really expecting to buy anything.  I knew right away that it was an extasy analogue and, since extasy is without doubt my favorite drug, I quickly purchased a single gram from a UK based site.  Each day that followed I eagerly checked my mail, waiting for my little pouch of powdered love.  Getting MDAI was the only thing I could look forward to at the time, since my financial issues were engulfing my life. Oh how I wish the package had been lost in transit or stopped at customs (I would have rather braved prison instead of experiencing what soon followed). I was about to touch heaven, then rapidly fall into a hell words could never truly convey.</p><p>Night 1</p><p>I finally got my stuff on a Friday, and unluckily, I didnt have work for three days.  I decided that night I was going to test it.  Around 12, I took my first capsule containing about 150 mg.  While coming up, I was experiencing the ever so familiar pangs of fear and nerves so common with e.  I tried to keep myself busy while I got through the shitty part.  I soon took another 150 mg pill. After trying to talk to people on Omegle I decided to watch an anime flick, since I was just starting to like them.  I put on a Hayao Miyazaki film, since his works filled every top ten list I read.  I peaked on the second pill about midway through the first film I watched (Spirited Away if youre wondering) and it hit me a lot harder than I thought it would.  I felt absolute bliss and spiritual connection to the movie.  I literally felt as though I was experiencing the wonderfully animated world firsthand.  After the movie was done, I put on another one by Miyazaki.  Over the night I watched three of his films, loving each one more than the next.  I was living in fantasy and falling in love with my new hand-drawn life.  If youve ever seen Miyazakis films, youll note that he uses very minor conflicts and that nothing bad really ever happens to the protagonists. Very happiness-oriented movies.  After a bit of work and a bowl, I slept peacefully.  The next morning I felt fine, much better than I do after E, in fact SO much better that I decided then Id do it again that night.</p><p>Night 2</p><p>I started with a 200 mg pill at ten and later another 200 mg pill later on.  Miyazaki was soon again blowing my mind into fragments with his wonderful storytelling abilities and his clear dislike for misfortune.  I couldnt get enough!  I was literally living the happiest false life I could ever have even imagined someone to live.  The drug would draw me so deep into the movie that Id soon find myself unable to gaze away from the screen for any reason.  That night I again slept peacefully with my friend cannabis. </p><p>In the morning, I woke up with a feeling so strong and odd.  I felt as though I had lost a deeply loved-one.  I felt my first tear hit my cheek in years when I stumbled upon a memory of one of the movies Id seen.  I couldnt believe it, I was soon full on bawling over losing the life Id lived the nights before.  I had lost a loved-one alright, just one that was never truly there.  A sane person would have said NO MORE!, but dumbass me decided to do it again that night.</p><p>Night 3</p><p>I did what was left (300 mg I suppose) rectally to help with bioavailability around 12 this night.  I knew I had work the next day in the afternoon, but I truly didnt give a fuck.  I wanted to be back in my Japanese heaven.  Long story short I felt fucking great and lived yet again in my mad world of Miyazaki.  Again I slept, entirely dependent on the weed since the comedown was bearing down on me so harshly.  All that night I felt as though I was forcing myself to dream that I was living in Miyazakis film Ponyo.</p><p>The next day I got up.  I cried for three hours straight.  I went to Wal-Mart and bought a straight razor.  I drove out in the middle of the forest in my shithole Nissan Sentra, knowing I was already fired for being late.  I had my note along with the little money I had in the bathroom for my brother to find on a later day.  For six hours I cried and held that blade to my throat.  For six hours my life hung in a ridiculous and unstable balance.  For six hours I had to convince myself that if I died then that I would not be whisked away into a heaven where everything was animated and wonderful and Miyazaki.  I had fallen in love with an idea that was impossible to achieve in real life.  Somehow, my will to survive overpowered me and I launched that fucking knife as far as I could into the shrubs and drove home.</p><p>Ive been clean from everything for about a month now.  My financial issues eventually got worked out with the help of my parents.  I still dont know how I just didnt kill myself and end it then.  I had never felt anything as horrific as that before.  I now feel a lot better now, though I still tear up whenever I think about anything from those heavenly nights.  Moral is, dont be a fucking idiot like me a binge on something you know will cause these sorts of problems.  I will tell you now I will never be the same person I was before MDAI came into my life.  I will never truly enjoy anything, since my mind will forever taunt me with beautiful, impossible thoughts of a world forever unreachable.</p>",
 "year": "2011",
 "id": "90652",
 "gender": "Male",
 "age": "20",
 "timestamp": "2011-08-12T07:00:00.000Z",
 "views": "7215",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "(capsule)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "(capsule)"
  },
  "2": {
   "time": " T+ 24:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "(capsule)"
  },
  "3": {
   "time": " T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  "4": {
   "time": " T+ 48:00",
   "amount": " ",
   "administration": "rectal",
   "substance": "MDAI",
   "form": ""
  },
  "5": {
   "time": " T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
