{
 "title": "First Time Wierd Experience",
 "author": "LegallyHigh",
 "citation": " LegallyHigh. \"First Time Wierd Experience: experience with 2C-P (ID 90663)\". Erowid.org. Dec 15, 2011. erowid.org/exp/90663",
 "substance": "2C-P",
 "bodyweight": "170 lb",
 "report": "<p>I took a pressed 2C-P pill that was 10mg at around 10:50 PM. After about 1 hour I started to feel strange but wasn't really tripping yet everything just got a little brighter and I was thinking about odd things I don't usually think about. About 3 hours after injecting I started to really trip.</p><p>Its a weird experience.. I cant sleep for 12+ hrs. Every time I layed down I was thinking about stuff then 2c-p would force its way into my head ..I kinda felt like I was talking to the actual 2c-p chemical in my head. out of body experience I think. I was saying stuff like get out of my head dude Im not using you just to get high.I just had this feeling the 2c-p was angry at me for using this chemical for a high. And the 2c-p would respond with a bunch of negative images like a devils face, and burning buildings, and a dark forest with an angry bear..</p><p>I was just tripping balls. It was like whatever I started to think about when my eyes were closed, it would show up as a movie in my head. I remember thinking about a bunch of girls sitting in a circle having a conversation, and since I happen to like Spanish girls I was able to design a perfect Spanish girl and talk to her with my real time thinking. It was like I was really talking to people while my eyes were closed. It was just crazy!</p><p>At one point I layed down trying to go to sleep with my eyes closed and I heard a drilling noise.. like something drilled a hole in the back of my skull. I heard a noise like 'ZZZZZZZZZUUUUURRRRRRZZZZ' and opened my eyes instantly. That kind of scared me and was pretty odd. And at one point I was on-line and posted a thread at what I thought was 2:30 in the morning. But the next day I looked at the time I posted it and it said 11:30 PM.</p><p>Colors are bright. I cant even explain the visuals.. It was like a movie was playing in my head of everything that was on my mind. my eyes were big as golf balls. Thats pretty much all I can remember.. overall I liked this drug in a weird way. It was a odd experience not in a bad way but not in a good way. I respect this chemical!</p>",
 "year": "2011",
 "id": "90663",
 "gender": "Male",
 "age": "19",
 "timestamp": "2011-12-15T08:00:00.000Z",
 "views": "4863",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "",
   "substance": "2C-P",
   "form": "(pill / tablet)"
  }
 ]
}
