{
 "id": 9067,
 "title": "Mild Trip with Shorter Duration",
 "date": {
  "submission": "2010-04-21T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "CT",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "cookie/food"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "cookie/food"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "mg",
    "quantity": "10",
    "grams": 0.01
   },
   "administration": "oral",
   "substance": "Escitalopram",
   "form": "daily"
  }
 ],
 "report": [
  "Over my spring break this year, some friends and I decided to do acid together.  I had done a bunch of research beforehand, because I've had some bad experiences with my psych meds, and I know how easy it is to really screw up my brain chemistry.  All I turned up was that my Lexapro was probably going to lessen the effects of acid or shrooms, so I figured it wasn't too dangerous and I'd go ahead.",
  "I took two hits on sugar cubes, about an hour apart.  I was with three other people, one of whom was planning not to take any but wound up joining us, and later my partner came home and had some as well.  We ranged from one hit to three (though one of the sugar cubes had two drops on it, and we never figured out which one).  It took me a while to come up, which I attribute to the SSRI because I noticed the same thing with 2cb recently.  I started out just seeing the shadows move, colors in the corners of my eyes, and such.  Eventually I started seeing the ceiling move, trailers of my hand, and the kinds of visuals I'd been expecting.  It wasn't very colorful for me, and I think the only one of us seeing colors was the guy who'd bought it, who took three hits.",
  "I got really warm, which happens when I drink also, and pretty uncoordinated at times.  When I looked in the mirror, I thought my pupils were moving in and out, and I saw the same on some other people.  One of the friends I was with said that when she looked in the mirror she saw herself aging and her flesh melting off her bones, but I didn't get anything near so interesting, just my pupils.  Most of the visuals I got were in the patterns on the stucco ceiling.  It seemed to be moving, and I saw lots of different images, a lot of them sort of in a woodcut style.",
  "We dropped a little after noon, and sure enough we were up very late.  I came down before everyone else, which I'm pretty sure was the effect of the Lexapro.  It was still hard for me to sleep, but most of the visuals and the weirdness of mind had gone while everyone else was still giggling about the ceiling.  I don't think I had much of a headtrip, based on what my friends have talked about.  The visuals were plenty fun for me though.",
  "Overall, I really enjoyed my acid trip, and I'd love to do it again, probably three hits in hopes of some colors.  It really wiped me out, being awake and 'on high' for twelve or fourteen hours, but it was over break so I could afford to be a slug the next day.  I've since tried pot, and it seems like it would be great for the day after, since it sends me into a cozy little pile on the couch and I nap.",
  "I haven't found anything else online about escitalopram, though the info on other SSRIs has been really helpful, so if you're on it, I'd love to see your experiences."
 ],
 "erowid": {
  "id": "52757",
  "citation": " CT. \"Mild Trip with Shorter Duration: experience with LSD & Escitalopram (Lexapro) (ID 52757)\". Erowid.org. Apr 21, 2010. erowid.org/exp/52757",
  "substance": "LSD & Escitalopram (Lexapro)",
  "views": "9589"
 }
}
