{
 "title": "Girls Do Know More...",
 "author": "T and T",
 "citation": " T and T. \"Girls Do Know More...: experience with Nutmeg (ID 9077)\". Erowid.org. May 13, 2004. erowid.org/exp/9077",
 "substance": "Nutmeg",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "2 Tbsp",
   "oral",
   "Nutmeg",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9077",
   "Female",
   "",
   "Not Given",
   "May 13, 2004",
   "6223",
   " "
  ]
 ],
 "report": "<p>My friend and I had heard about taking nutmeg from your website. We both are very experienced in a variety of differnt drugs, so we thought we would try this one. We put the 2 tablespoons in a cup and we added a little water in our cups to make it 'slide' down easier. Which was just the oposite. I ended up gagging on it and spitting it back up. So we tried to think of a differnt way, we tried mixing it w/peanutbutter, but after awhile that got old too. Then finally I thought we should try emptying gelcap pills (the ones you get prescribed to you that open up in the middle) I had bigger gelcaps from when I was sick earlier in the year. so we emptied them and then packed as much as we could of nutmeg in each pill. We took the pills, it was around 4:30. My friend and I had a cigerrette and talked about how smart we were for thinking up the pill idea. If it weren't for that, we would never had gone through w/digesting the nutmeg.  The nutmegs smell and taste reminds me of that old candy you would eat when you were little..it was called necco.</p><p>It was around 6:30pm when it started to kick in.  I felt extremely high, as if I smoked weed, which i hadn't that day. My friend and I had went on our own ways that evening.  I had gotten together with other friends that were sober that night. We drove around in my friends truck and around 8pm the high was even stronger and I could only stand certain kind of music. Rap had to many differnt waves I could see, I could only stand music like bob dylan. one frightening experience I had was when we parked the truck and they opened the door while the key was still in, the car makes a noise to let you know the key is still in. But for some reason the pitch of the tone was too much for me, I was in the backseat (extendedcab) curled over with my hands over my ears. It was like the tone was coming from inside me and out. They shut the door right away, but it felt like hours that I heard that noise. Even later in the night old memories popped up in my head, very vividly, as if I were reliving them. </p><p>I went to bed around 5 in the morning, and I woke up feeling kinda of gone still, but functional. my mind had felt very tired for the rest of the day, but my body was awake. overall I enjoyed the experience, but I would only do it again, if I were able to put the nutmeg into pill capsules again.</p>"
}
