{
 "id": 9080,
 "title": "Strong Energizing Effect",
 "date": {
  "submission": "2008-03-25T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Socraticus",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(daily)"
  }
 ],
 "report": [
  "Let me start by saying that I have used many types of benzos for about six years - ever since I was diagnosed with cyclic vomiting. The benzos are great for reducing anxiety, but I have a tendency to find an empty bottle about a week or two before the refill date> :-(",
  "Recently, I took way too many of my xanax too soon and decided to get some in Mexico, where it is known as 'Tafil.' I decided to buy some prozac as well, as I have been diagnosed with clinical depression, which I had not treated with either drug therapy or counseling. I have been using prozac for about six weeks now, and several things have occured.",
  "I attribute the following beneficial effects to the use of prozac, 20 mg, once daily in the morning:",
  "1. having more energy",
  "2. having more motivation to utilise the energy",
  "3. lessened anxiety",
  "Now, as I said, I also use xanax, 1mg t.i.d., and I am considering tapering off this benzodiazepine. The prozac, as the Wikipedia entry suggests, has a 'strong energizing effect.' I am grateful for this drug. I know it increases suicidality in some, but I have never had those types of thoughts, and the drug DEFINITELY works for me. I have been diagnosed with both generalized anxiety and depression, and the prozac/xanax combo seems to be 'doing the trick.' I hope to one day go through life without these meds, but for now, they help me get by without any adverse effects.",
  "NOTE: At first, the prozac induced akathisia (a.k.a. 'inner restlesssness') which I offset by doubling the xanax. This lasted for about two weeks, after which I went back to 3 mgs a day of xanax rather than 6."
 ],
 "erowid": {
  "id": "55581",
  "citation": " Socraticus. \"Strong Energizing Effect: experience with Fluoxetine (Prozac) & Alprazolam (Xanax) (ID 55581)\". Erowid.org. Mar 25, 2008. erowid.org/exp/55581",
  "substance": "Fluoxetine (Prozac) & Alprazolam (Xanax)",
  "views": "26683"
 }
}
