{
 "title": "Unplanned Trip",
 "author": "Blarg",
 "citation": " Blarg. \"Unplanned Trip: experience with Cannabis & 4-AcO-DMT (ID 90857)\". Erowid.org. Oct 16, 2011. erowid.org/exp/90857",
 "substance": "Cannabis & 4-AcO-DMT",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "15 mg",
   "oral",
   "4-AcO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "90857",
   "Male",
   "",
   "17",
   "Oct 16, 2011",
   "10238",
   " "
  ]
 ],
 "report": "<p>Im 16 years old with my 17th birthday coming up towards the end of June. I enjoy my life, I get decent grades, I plan on going to College, I have never been depressed, and have never take any drugs with the intention if covering up or masking my feelings. I smoked weed for the first time at the end of my sophomore year and slowly became a regular Cannabis user that following summer. Now I am coming to the end of my junior year and the habit continues. I have recently started venturing into more uncommon substances and away from the usual Cannabis smoking. I enjoy taking drugs because I am fascinated with how they affect your body. Here is a list of the substances Ive tried (They are listed in the order that I was introduced to them.)</p><p>Cannabis, Salvia (7 times, 20x), Mushrooms (3 times. 2-3.1 Grams), Tobacco (Cigars, Hand-Rolled Cigarettes. I AM NOT A REGUALAR SMOKER!), Alcohol (6-7 Times), 2-ce (15mg Twice), 4-AcO-DMT (Supposedly 15mg), and Various Herbs such as Daminia and Mugwort.</p><p>I would like to also mention that I have been taking Ritalin LA every morning for ADHD since I was little. I took my daily dose on this Saturday; though I dont think it had any effect on the trip.</p><p>Here is the story of my 4-AcO-DMT trip. </p><p>[Saturday, April 30th, 2011  Roughly 3pm]</p><p>--Note: I did not mark down any times yesterday so I have to estimate them all today.--</p><p>My friend, who I will call R.K.King (nickname), comes to pick me up so we can go hiking at a State Forest in a nearby town. I get in the car to find another kid whos Friends with R.K.King. Instead of going to the local state forest we head to a small area of woods in our town to chill for a bit. We get there and we walk around for a bit. I take 1 hit from my friends bowl but hes not really sharing so Im basically sober at this point in time.</p><p>[3:45pm]</p><p>R.K.King and his friend (both of whom are 12th graders) get a call from some friends who are in the Town Forest so we head out to meet up with them. </p><p>[3:55pm] </p><p>The 3 of us arrive at the Town Forest and start heading in to meet up with these 4 other kids. </p><p>[4:10pm  Again I reiterate that these are estimates]</p><p>We find the kids in about 15 minutes. I take 1 good hit from a bowl being passed around. I then start jogging back out of the woods to meet up with a dealer to pick up 2 grams of good bud. From bits and pieces of conversations I figure out that 2 of the 4 kids are tripping.</p><p>[4:35pm]</p><p>Im back in the woods with the kids and am now smoking a bowl of the weed I just picked up. Its good weed and I havent smoked since Wednesday so Im pretty high. </p><p>[5:00pm]</p><p>For a while we sit around a small fire in the woods. I have learned that all four kids are tripping on some drug I have never heard of. I know that it is a research Chemical and that it is similar to the Psilocybin found in Mushrooms. </p><p>[5:50pm]</p><p>R.K.King (Who is my ride) suddenly disappears and I start running back to the car to catch up with him. I lose sight of him (For he is running away from me like a douche) so I start walking. Surprisingly, I come across one of the 4 tripping kids in the middle of nowhere. He had been wandering around the woods because he didnt like the fire (Thought it was to obviouse of a spot). We start walking together back towards the car, though I am fearful that R.K.King is already gone. </p><p>[6:00pm]</p><p>Myself and the tripping Kid who I will call FN are almost back to the car when we spot R.K.King ahead of us. We yell to him and he stops to wait for us. He says he needs to be home for dinner now and that hell drop us of at a local convenience store.</p><p>[6:10pm]</p><p>R.K.King drops me and FN off at the convenience store and we go inside and buy chocolate milk and potato chips. We leave the store and start aimlessly walking around. I know some of my friends wanted to hang out after six so I call them and they are unsure of their plans so the 2 of us keep walking.</p><p>[6:25pm]</p><p>We have walked a go ways across town and reach a friend of ours house so we go into the back yard. We find our friend A (whos house it is) and our friend M playing Frisbee and basketball.  We join in on the game and I strike up some good conversation with FN. He tells me a little about this drug hes on. He calls it O-Acetylpsilocin and says he is really enjoying it. I had seen the other 4 kids tripping on it. They all seemed to be enjoying it and they all said it had the effects of shrooms but without the bug-out and confusing aspects. FN then says he can get me some if I want and I say Id love to try some. He then takes out a small baggie and hands me a pill with 15mg of O-Acetylpsilocin and I thank him. He never mentioned paying him but Im going to give him a twenty next time I see him. </p><p>[6:40pm] </p><p>FN gets picked up by the other 3 trippers who have a car. (Driving while on any drug is not safe and I do not support this behavior). Me, A, and M head inside As house to chill. I look on Erowid.org to read up on O-Acetylpsilocin. I know nothing about it and decide that it is best not to take it without reading up on it first.</p><p>[6:50]</p><p>Im getting bored of reading and am not able to obtain much information because of the high/laziness combination. </p><p>[7:00pm]</p><p>I know my parents are going out to eat and to see a band tonight so I have plenty of time. I have to be home at 11pm. I decide to take the 15mgs tonight and see what happens.</p><p>[7:03pm  I think this is the exact time that I took the O-Acetylpsilocin, though Im going to use 7 as a general time.] </p><p>[T+0:30min  7:30pm]</p><p>Now I am Sitting around As room with a bunch of other people who showed up. We are playing monkey in the middle with a hacky sack and I feel absolutely nothing yet. Im quite skeptical about the upcoming trip because there was so little powder material in the pill capsule. With 2ce more than an 1/8th of the capsule was filled, but this capsule wasnt even filled up to a 1/16th. I assumed it was something like 5mg and that FN maybe had given me less than 15mg. </p><p>[T+1:00min  8:00pm]</p><p>Playing some Beer pong with kids downstairs in As house. Im not tripping yet but can tell that something is up. I feel like Ive been drinking Alcohol. My body seems to be moving slower than normal. I start getting excited for an intense trip.</p><p>[T+1:30min  8:30pm]</p><p>Im now upstairs smoking a bubbler with a bunch of kids. By now things are starting to become more noticeable. Slight visuals and a mild loss of both perception of depth and time. I was finding it very hard to think clearly. Getting involved in conversation was becoming exceedingly difficult and strenuous. I cant confirm this but I think smoking weed helped me notice the effects and onset of the O-Acetylpsilocin.</p><p> [T+2:00min  9:00pm]</p><p>My friends who I had planned on meeting up with after 6 text me and ask if I want to play Frisbee with them at this place called Fun Spot. What the hell do I have to lose? Who doesnt like Frisbee? AND TRIPPING! So I asked where M went and A tells me he just walked out to go play Frisbee. I run out of As house and find M sitting in his car about to leave. I asked him if I can have a ride and come play Frisbee; he says Sure. By now Im starting to feel the similarities to mushrooms.</p><p>[T+2:15min  9:15pm]</p><p>Me and M are sitting in his car at fun spot waiting for our friends to show up and play Frisbee. All I could think about was my trip. I was constantly thinking about the visuals and everything and could barely keep up a conversation. M would ask me a question and I would start to reply and then my speech would slow down and Id forget what I was saying. I think M was just like Whatever The visuals were starting to really kick in. I have never had intense visuals on Mushrooms but I had pretty good visuals the second time I did 2-ce. These visuals were similar to my second 2-ce trip. Colors were changing slowly and things looked shaky and shifty. These kids who we had never met before come out of the darkness and up to our car. They looked like 8 graders and M put down his window to see whats up and they hand us two Hersheys chocolate bars. M takes the two Hersheys bars and the kids run off. Though they were strangers we ate the unopened chocolate bars and they tasted very good.</p><p>[T+2:30min  9:30pm]</p><p>Our friends show up and we get out of the car to play Frisbee. Im struggling with how much stuff is in my pockets and every time I pull something out of my pocket it perplexes me. Besides M, nobody else knows Im tripping. The temperature outside is prefect and I take off my sweatshirt to play some good old Frisbee.</p><p>[T+2:40min  9:40pm]</p><p>We started playing Frisbee and I found that it is exceedingly more difficult than usual.  My motor skills were functioning normally.  I could run, jump, throw, and catch fine (Catching was a little bit harder with the visuals). This aspect of Frisbee was much more enjoyable tripping. Unfortunately my cognitive skills went to shit. With every pass and play I was constantly trying to remember who was on my team and who my opponents were. With every play I would forget what direction we were going and had to constantly say my teammates names and think about the correct playing direction. By now everyone had figured out I was tripping and they were all kind of confused/surprised.</p><p>[T+3:20min  10:20pm]</p><p>The game of Frisbee ends and I have no idea who won. Immediately the other players who are ANG, SG, AM, and NC all ask if Im tripping. I say I am and they ask what Ive taken. Too bad I cant respond. I have no idea what the name of the drug was. They keep asking and I keep replying with Umm Ohh. Eghhh I dont remember. I think this just confused them all and they stopped asking. My short term memory was so bad on this drug that I couldnt remember shit that had just happened seconds before. I really disliked that side of the drug. Yet I can remember stuff now and that makes no sense. M had to go home so I grab my stuff from his car and got into AMs van and we headed to ANGs house. </p><p>[T+3:30min  10:30pm]</p><p>We arrive at ANGs house and me, NC, ANG, and SG all head inside. AM went home. We have to sit outside ANGs house because she doesnt have a key and her mom was not home. ANG, NC, and SG are all talking together as I sit on the porch silently. I had no desire to join into the conversations so I just listened for a bit. </p><p>[T+3:45min  10:45pm]</p><p>ANGs mom comes home and lets us in. I decide that I want to do a waterfall for the first time and ANG leaves her room to go get her waterfall. NC and SG go into the living room to watch some Hockey. I stay sitting on the floor for a while and just chill. The visuals at this point were starting to subside. Things still had nice color and shifted but at a much lesser amount than during Frisbee. I also would like to note that my body is trembling and shaking. My teeth were also chattering a lot even though I wasnt cold. I had slight feelings of sadness and confusion but other than that I was quite good.</p><p>[T+4:00min  11:00pm]</p><p>ANG come back into her room and takes me out into the kitchen were we begin preparing my waterfall.</p><p>[T+4:10min  11:10pm]</p><p>I hit the waterfall and it was just as expected. I went and lay down on the couch and just felt like doing absolutely nothing. The waterfall had virtually no effect on the O-Acetylpsilocin. They were acting as two separate drugs. I could feel them acting separately.</p><p>[T+4:30min  11:30pm]</p><p>NCs mom comes to pick us up and drive us home. We all say goodbye to ANG and file into the car. </p><p>[T+4:35min  11:35pm]</p><p>Light conversation fills the car and NCs mom was listening to some weird college radio station. My eye sight is having a hard time focusing on things outside the car. I dont bother talking because its still too obvious that Im on drugs to talk. NCs mom wouldnt have been happy knowing I was on drugs.</p><p>[T+4:37min  11:37pm] </p><p>Then it hit me</p><p>All of the sudden I lifted my head out of darkness and my vision was almost entirely black. Immediately I thought, Nooo Why did I just pass out in NCs car? </p><p>Before I go on I need to give you more background information on myself. Since I was a young kid, I have had a history of passing out. I passed out when talking about mummies and understanding-disabilities in elementary school. I passed out when getting shots or blood drawn. I passed out when I got a wart removed. I passed out about a month and half ago when a fellow classmate of mine accidentally stabbed me with an X-acto knife. The reason I am telling you this is because when I pass out I get crazy fucked up dreams in the 5 to 6 seconds that Im actually passed out. When I wake up after passing out the first thing I always think about is the dream I just had. Those dreams always feel really weird compared to normal dreams. The dreams themselves are always incoherent and make no sense.</p><p>As I was saying: I lifted my head out of the darkness and waited a few seconds for my vision to clear. I had that same passing out dream feeling and I was really confused. After about 10 seconds I started realizing that I was passed out for longer than usual. After about 20 seconds I came to the realization that I wasnt passed out at all but that I was really messed up on this drug. </p><p>Thinking back to it, it makes a lot more sense now. Here is my theory. After reading more on O-Acetylpsilocin today, a lot of people said they felt DMT like effects. I believe that Ive been having crazy DMT trips all these times that Ive passed out throughout my childhood. And then when I wake up from them I can never remember what I was dreaming about. They say DMT is involved in your REM cycle and your dreams (I dont really know who They is). They also say that DMT is involved in those near death experiences when youre about to die. I believe that 100% now. </p><p>After realizing that I had not actually passed out and that Im still alive in NCs car, my vision starts to come back. As I begin to look around the car I start to feel the effects of this DMT [like] trip. Everything is messed up and wrong. NCs mom was all zigzagged and bent, NC had been all distorted, and SG sitting next to me was all diagonal and messed up. The car was a weird color and I couldnt see anything outside the car. I remember NC and his mom talking over this weird music but I couldnt understand anything they were saying.Audio was completly screwed up. The whole car felt like it had been turned into square pixels. My vision was really distorted. I felt like it had been vertically smooched and horizontally stretched. Everyone seemed fatter.  I felt like shit too. I could feel my body pulsing. My heart was racing so fast and I could feel the blood pumping through me. My limbs and chest were shaking and my teeth were clenched shut. I remember just wanting to get home. I felt like I needed to vomit.</p><p>[T+4:50min  11:50pm]</p><p>Scariest car ride of my life! Finally we pull up in front of my house. I dont know how I could even talk to his mom and explain where my house was. Cognitive skills are basically at 0% now. I cant even function. I stumble out of the car and quickly say Goodbye and Thank You and rush to my back door. I get inside and feel like Im going to be sick. But nothing will come up. I rush to my room and get ready to go to bed. Everything is wrong. This isnt my body; this is not my room, why does my house feel so weird? My thoughts were rushing so fast. </p><p>[T+5:00min  12:00am Sunday, May 1st, 2011]</p><p>Miserable! Im lying in my bed still because my body is flipping out. I can feel all my organs functioning. I can feel what I think is my liver bubbling and churning. My heart is racing and all my muscles are spazzing. Visuals are beyond colors and Im seeing completely different things. Everything is distorted and smooched. Stretching and bent. Nausea is running through me but theres nothing I can do. I can barely move.</p><p>[T+5:30min  12:30am: These times are complete estimates because I no longer have any sense of time]</p><p>I get up to use the bathroom. My whole body aches and is sore. I try to pee. This takes about 5 minutes because none of my organs seem to be working. My pee was weirdly colored. I cant take a shit and none of the muscles used in taking shits are responding to my brain asking them to do so. I stumble back to bed.</p><p>[T+6:00min  1:00am]</p><p>Cant sleep.  Tripping isnt coming down at all. Whats wrong with me? This is what I imagine overdosing to feel like though Ive never overdosed on anything before.  I start using my laptop to read up on 4-AcO-DMT. I keep having sexual feelings but my whole reproductive area is in no functioning condition (there was a painful feeling down there). I cant even try to describe my emotions and feelings anymore because it doesnt do it any justice.</p><p>[T+6:20min  1:20am  Roughly]</p><p>I put my laptop away. I realize vomiting is never going to happen. I attempt to go to sleep. I have to lay face down or completely on my back because putting uneven pressure on my organs and muscles causes pain.</p><p>[T+6:30min  1:30am  Estimate]</p><p>I fall asleep.</p><p>[T+13:30min  8:30am]</p><p>Wake up. My whole body is sore. It takes me about 10 minutes to get out of bed. I still feel kind of hung-over and out of it. My mood is sad and gloomy.</p><p>[T+13:40min  8:40am]</p><p>I take a piss in the bathroom. Urine is a horrid dark yellow and smells awful. Kind of painful to piss. Eyes are still slightly dilated. I head back to bed.</p><p>[T+14:50min  9:50am]</p><p>I wake up and go to take a shower. I am still very drowsy.</p><p>[T+15:10min  10:10am]</p><p>As always, the shower solves that drunken feeling drugs give me. My muscles relax and a lot of my scrambled thoughts are cleared. Takes me a while to get into the shower because I try to go to the bathroom. Number 2 is pretty much not possible and none of the muscles involved in that are responsive yet. </p><p>[T+15:50min  10:50am]</p><p>Running late for church; which is 11am-12pm. Then I have work 12pm-5pm.</p><p>[T+22:30min  5:30pm]</p><p>Smoke a bowl after work.</p><p>[T+23:45min  6:45pm]</p><p>Having dinner. Mid-meal my small and large intestinal areas feel horrible. They are all cramped up and painful. My face turns white and my family comments and suggests that I lie down.</p><p>[T+27:24min  10:24pm]</p><p>Finishing up my Trip Report. Feeling much better. Have yet to go to the bathroom. Its sketching me out. </p><p>--Concluding Thoughts--</p><p>Despite the many negative sides of this trip Im quite glad it happened. It was a real eye opener in the power of psychedelics. I am also very pleased with the correlation between my many passing outs and this 4-AcO-DMT Trip. I still dont fully understand what this drug is. Im now under the impression that it acts like psilocybin in mushrooms for a bit and then reaches your liver and starts to convert it to DMT or something. Thats what pretty much happened to me. I warn anyone who is going to try to do this drug to research it to the fullest and make good judgment when taking it. This drug is not for the feeble minded either. Most powerfull drug I've come across. Can't wait to try N,N-DMT!</p>"
}
