{
 "id": 9086,
 "title": "Loss of Vision",
 "date": {
  "submission": "2008-05-14T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "EveryGirl",
  "gender": "Female",
  "weight": "118 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>I've had boring or slightly uneasy trips before on weed, but never like this.  My friends and I were all going to this party and I didn't really want to go, but I didn't have anything else to do.  The party was in a basement that was very hot and very crowded.  There were no real lights on, only black lights and a strobe light.  Since I hadn't really wanted to come to the party in the first place, I didn't drink anything.",
  "A girl I know had some weed and her and my friend and I smoked a bowl of it in the basement.  When we were done, I started feeling kinda weird so I told my friend I wanted to go outside.  She told me if we went outside they wouldn't let us back in.  But then I started feeling even weirder and I told her I didn't care I really needed to go outside.  I couldn't keep track of where I was, I had to constantly remind myself.  I saw weird colored splotches of light (like when someone takes your picture), but they didn't go away and eventually they took over my vision and I couldn't see at all anymore.  I started telling my friend 'I can't see!  Take me outside!'  And I tried to walk towards the door, but I had no sense of anything and I fell over.  Luckily some boy caught me and carried me outside and I didn't end up landing completely on the floor. ",
  "When I got outside my vision came back slowly and as I layed on the sidewalk I started to feel better.  My friend who had also smoked followed me and as soon as she got outside she started freaking out and she was like 'Oh god, I know what you're talking about because my ears just plugged up and I can't hear anything.'  We waited it out and eventually we felt a little better so we walked back to my dorm and went to sleep.  It was sooooo scary though that we both agreed that we're not smoking weed anymore.</p>"
 ],
 "erowid": {
  "id": "55599",
  "citation": " EveryGirl. \"Loss of Vision: experience with Cannabis (ID 55599)\". Erowid.org. May 14, 2008. erowid.org/exp/55599",
  "substance": "Cannabis",
  "views": "3549"
 }
}
