{
 "title": "Farm Animals Scream and Chant",
 "author": "Crystal-ship",
 "citation": " Crystal-ship. \"Farm Animals Scream and Chant: experience with DXM (ID 90900)\". Erowid.org. Jul 8, 2012. erowid.org/exp/90900",
 "substance": "DXM",
 "bodyweight": "64 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "DXM",
   "(liquid)",
   " T+ 1:00",
   " ",
   "smoked",
   "Cannabis",
   "(dried)",
   " T+ 3:30",
   " ",
   "smoked",
   "Cannabis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2011",
   "90900",
   "Female",
   "",
   "18",
   "Jul 8, 2012",
   "17854",
   " "
  ]
 ],
 "report": "<p>The set and setting of this experience are probably not the most comfortable, stable conditions. For a start, though I am usually up and down, I have recently been particularly down and broke up with my boyfriend the week before, which I wasnt entirely sure was the right decision. However sometimes you just have to take a chance, you cant control every variable and I had the maddest time.</p><p>In terms of setting it was pretty unique, a whole heap of open minded party loving people were lodged for a few days at my best friend Ns property 3 hours south of Brisbane. We were a short drive from Nimbin, home of Nimbin Mardi Grass which was actually on that weekend (one guy who went reported that there was just lots of people milling around with spliffs and there were bands playing and the police did nothing). The house was pretty small, but the lands around lush and beautiful, and perched on a little ridge of a hill looking to fields stretching into mountains. </p><p>Its very difficult not to tell the whole story of this weekend, the journey up (our lift broke down so seven people ended up squishing into one five-seater car with all of our stuff), the individual interactions and the trips everyone else had, and the changing vibes as people came and went into the next day.</p><p>There was a lot of acid available. Everyone brought weed really, and it had been raining on and off for the last few weeks at least, so we couldve easily found many magic mushrooms in the cow paddocks around. Robitussin Dry Cough Forte had been enlisted should there be any lack of psychedelics (there wasnt). </p><p>At around 9pm we arrive to screams and screeches and I guess that my friends are well and truly fucked, those who arent quickly become quite inebriated. A couple were lucky enough to be candyflipping, acid and e, though I cant say if the pills were actually MDMA and coke as proposed though they seemed to provide ridiculous giggling fits and confusion. Everyone else had had half a drop of liquid LSD and it was interesting to see how tolerances worked within the group, I concluded girls are just generally way more lightweight even if they are tall and well built. </p><p>00.0-\tApprox 9.45pm. Id brought a tab with me, but was concerned about dropping, it would only be my second time with Lucy and with 30 people milling around a muddy house I thought Id rather something shorter acting and easier to control the dose so I slowly finish a 4 on. bottle, 300mg of DXM. The drops my friends had seemed way more visually than what the Bob Marley tab I had was said to be. </p><p>01.0-\tTime is obviously hard to gauge, as soon as Id set up my tent and taken everything out the car we started having cones in the main bedroom. Here all of my main group had gathered (we were also the youngest there) and here we mostly stayed as the body warmth and sleeping bags strewn around our pigsty were much warmer than the windy deck outside. Everyone was pretty drunk and high, and contact highs affect mine greatly, so it was a while before I was certain I was robotripping. </p><p>Was it the kind of restless that I felt combined with a nice feeling of floating behind my mind? Or the way the green and blue sleeping bags in the room felt more and more ocean like? At one point I had the impression of things stopping briefly into clear photographs. Certainly when I went outside and debated whether it had begun already with one dude he said, if youre questioning if its affecting you yet, it probably has. My short term memory was falling to bits so I agreed especially as I felt way more disassociated than I ever have on anything else before. Weed can be very intense for me but I was pretty out of it for all of this and just enjoying riding on everyone elses acid energy. Sitting there I suddenly felt tired and a bit overwhelmed, like how last time I tried mushrooms was, so I retreated inside scared Id start feeling sick. Lying down made it pass.</p><p>01.30- Events arranged more by what happened inside and what happened outside, time wasnt important, dubstep was playing all night, heavy dirty beats infecting everyones mind. N, my best friend of a long time, was sick of it, and finding its heaviness leading her astray a bit, stupid dickheads wouldnt change the music, maybe if shed bad tripped and attacked him with a knife then hed have felt differently about that decision. At one point in the bedroom, N brought out a butter knife and whispered in a dark voice, if this comes near anyone its going to slice their head open she was probably joking but we were all a bit freaked out by it. At some point I became an observer, but while this might usually bother me I was quite at peace with this, I felt involved anyhow, and when I was it didnt feel about me but about lifting an experience for all my friends. </p><p>02.00-03.00 In and out the blue green bedroom, people would come in hearing the screams, or the chanting or the wild laughter of schizophrenics, some stayed for the body heat, others just found it way too awkward (sober obviously) and left after a bit. Socialising became unimportant (outside of our group), when I went out it turned out the other groups had also been smashed and fragmented from their usual galaxies. I locked eyes with one really fun nice girl as it was said her pupils were huge and thats always quite amusing (they werent) but we both stared with wide eyes for a while in wonder not saying anything. It was so intense I swear white rays shone off her. </p><p>I found myself by the fire in the garden. It was beautifully warm, I looked into the embers and they formed running animals like deer and then an antlered one, therefore devilish creatures raised their head. </p><p>And then: lava landscapes!!!!</p><p>Beautiful golden mountains of hell</p><p>Brilliant radiance of red and orange</p><p>Eventually warping into the infinity symbol</p><p>Crushing away into some far off universe the lights dropping away.</p><p>A glimpse into all the possibilities, a moment of brilliance!</p><p>I cant overemphasize the oozing quality of it, I couldve sat their for hours, but the seat was wet and I sensed robo immobility coming on. Retreated to the bedroom. The warm heart of everything, wavering seascapes, oceans billowing islands buzzing between (getting a bit poetic here that was an impression not complete vision). I was lying talking to D, we connect over being stupid and acting out tribal dances, that sort of thing. The way we were curled up reminded her of a heart (as we said we were at the center of everything, haha egotistical, but it was fucking warm in there!) and I said, yes the atrium and the ventricles! We then pushed together and pumped, quite unsuccessfully! </p><p>3.00-4.00 It must have been around 12, multiple cones had been consumed in the bedroom, what a lovely bong smell it had. Laughter at everything. I cant recall it all, but we sang in made up languages a lot. At one point passing the bong to N, the light was turned off and I shone my phone light down on her. I was standing up and started singing and chanting its name (the congi since my phone always types that instead of bong on predictive) and then like the whole room of 10 was singing and Ns eyes are widening ridiculously. Then someone turned on the light and we all stopped and continued talking like something weird hadnt just happened. N was freaking out (in a good way). How fun is tripping people out, I love making a nice experience for them. </p><p>A lot of people kept wanting the light off, so I decided to continue playing with this. First on and off, pretty shitty strobing attempt. Though they still enjoyed. Then I realized Id brought incense and lit the end of it. I started spinning it around in the dark. The end of it looked amazing going that fast, in a sort of bending circle like some sort of universe structure, I saw some doco on this, one scientist had a theory universes lay in sort of loops next to each other. I looped the incense around. Blue lights flickered within the circle. Everyone was quiet and watching, but I was asked to chant. Initially I felt shy about this, a non-tripper who is pretty critical was in there, but eventually I went, fuck it, and sort of sung a high wavering Tibetan monk style song. It was awesome, we did it consistently the whole night. </p><p>05.00-7.00- Around about here things get really disorientating. I think I checked the time at earlier and it had been 1 to my surprise (I thought the clock had said 10 and I was like, fuck, this trip is just beginning!!). I had to lie down and soon everyone was lying in the dark very confused. With the light off where everyone was, proportions just expanded incredibly. I confused who was saying what constantly, and no one really remembers what was said at this point. We all kept insisting we slept but everyone was tripping too hard for that. People would say strange things I thought you were there. People were like octopus is their caves, blankets everywhere it was amusing and comforting. Took me ages to realize I was in the worst spot to sleep. For a minute I thought I was going to bad trip, because my head was spinning worse than a cask-wine (or goon in Australia) hangover. But I was strangely calm about this considering how much I overreacted when I had a mild shrooms dose and felt sick. </p><p>I cant really remember my CEVs, I get amazing closed eye visuals from weed anyway (like fairys with the body of a bud and ribbon arms and rose heads and trees with all their candy striped life energy streaming out), but they were more realistic than ye olde cannabis. Mary J is still my baby and my best friend but robo was lovely to me and Im going back there. This weekend.</p><p>Aftermath- Had a horrible hangover feeling the next day. Possibly because Im kinda sick with sinus issues, like headaches all the time, and partly because I got my period and the accompanying back pain. I also got heart burn that day which Ive had only once before and it was mild. I was very scattered, as was everyone, and when I smoked bud I fucking got soooo high, it brought back everyones trips which was funny.</p><p>With DXM next time Ill probably up the dose by another 100mg, and do it in a quieter environment as I felt a bit off and disconnected the next morning. Id like to say more about how everyone learned and grew from the experience, but I think it was fairly recreational rather than therapeutic. It was beautiful and connecting however, and that matters.</p><p>When I woke up and spoke to the provider of the liquid LSD, hed had two drops rather than half like the majority of my friends (the girls always go lower for a good reason) and said the sunrise was dripping pastel colours. I knew what he meant. What a great weekend.</p>"
}
