{
 "id": 9092,
 "title": "Really Helped",
 "date": {
  "submission": "2008-05-17T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Abby",
  "gender": "Female",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Paroxetine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "150"
   },
   "administration": "oral",
   "substance": "Venlafaxine",
   "form": "daily"
  }
 ],
 "report": [
  "I have experienced depression and anxiety - mostly social anxiety since my late teens.  At the age of 30 I read the ads for Paxil and thought it sounded exactly like what I needed.  I took Paxil for close to 2 yrs - it definitely helped my depression and anxiety - I felt so much better, happier, more self confident, more expecting of myself.  The only side effect (and this is major) is that I gained 50 lbs.  I'm not exaggerating - 50 lbs.",
  "So after gaining all this weight, I told my Doctor I'd like to try another anti-depressant that wasn't associated with weight gain.  He switched me to Effexor.  Effexor is wonderful.  I love the way it makes me feel.  I am able to focus on what is important in life and let all those usual worries and negative thoughts 'go.'  I have not lost the 50 lbs, nor have I gained any more weight.  I increased the dosage of Effexor up to 150 after taking it for about 1 year.",
  "For about 2 months I was in a literal state of Euphoria.  I was almost manic-ly happy.  My libido/sex drive increased dramatically - which was a great thing for a change ,-)  I didn't mind it at all.  After the initial 2 months this state of Euphoria levels off and I'm feeling fine.  The side effects are mild, strange dreams, the 'jolties' and mild dizziness -- but all of these side effects are only in the beginning -- they all went away for me.  I have no plans of going off of it - I don't see a reason to do so."
 ],
 "erowid": {
  "id": "55636",
  "citation": " Abby. \"Really Helped: experience with Venlafaxine (Effexor) & Paroxetine (Paxil) (ID 55636)\". Erowid.org. May 17, 2008. erowid.org/exp/55636",
  "substance": "Venlafaxine (Effexor) & Paroxetine (Paxil)",
  "views": "8731"
 }
}
