{
 "title": "Thought Loops",
 "author": "Daniel",
 "citation": " Daniel. \"Thought Loops: experience with 2-CE & Cannabis (ID 90960)\". Erowid.org. Mar 4, 2012. erowid.org/exp/90960",
 "substance": "2-CE & Cannabis",
 "bodyweight": "138 lb",
 "header": [
  "DOSE: T+ 0:00",
  " ",
  "oral",
  "2C-E",
  "(powder / crystals)",
  " T+ 2:00",
  " ",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>I went to HARD Haunted Mansion last Halloween and decided to try 2-CE for the first time.  I had done my research, and I was comfortable going into the night.  My only worry was that I would throw up in line in front of security and not be let into the event.  I took a couple of doses of pepto bismol just after dosing to try to prevent this.</p><p>I took what I thought was 12 mg of 2-CE at around 9:00 PM, though the scale was only accurate to 3 mg.  My friend took the same dose at the same time, also her first experience with 2-CE.</p><p>I had experimented with mushrooms and LSD around 10 times before this experience, and I am a daily marijuana smoker.  I expected the 2-CE to hit me after about 45 minutes, and was getting quite nervous as it became clear that the line to get in would take more like an hour.</p><p>But by the time we finally got into the event at 10:15, I was still feeling stone cold sober.  I decided to wait it out just in case the pepto bismol had somehow slowed the onset of effects, but by 11:00 PM I had given up on tripping that night.  My friend who had dosed with me also felt no effects, so she took some LSD and began tripping on that.</p><p>I saw someone smoking a bowl and explained my sad situation to them.  They graciously offered me some bowl rips, and I happily obliged.  As soon as I took a hit, I felt an INTENSE head rush.  I actually got nervous that I had smoked something besides marijuana for a second because it felt so different than getting high normally.  I immediately turned to my friend and said, 'I'm tripping.'</p><p>But for the rest of the night, I couldn't quite figure out if I was in fact tripping.  I kept seeing crazy, acid-like patterns, both with my eyes closed and open, but for some reason I couldn't shake the thought that I was 'imagining' the patterns, i.e. that I was making them up as opposed to really seeing them.  Obviously this is a ridiculous concern, since drug hallucinations are always imagined.  But I couldn't get rid of the thought.</p><p>I was having an alright time dancing, liking the music, and the lights, but from 11:00 PM to whenever the rave ended (12:00 AM?), I was stuck in a thought loop that just repeated over and over and over, sometimes in a funny way, but mostly in an annoying way.  Once I got back to campus, I lay in bed with my eyes closed talking to my girlfriend for hours, happily watching the patterns zoom by whenever I closed my eyes.</p><p>After that night, my initial reaction was that I just hadn't done enough.  I figured I probably ended up with only around 9 mg because of the imprecise scale, and my experience was consistent with low doses of 2-CE.  I was eager to try it again, likely in a different setting, and at a higher dose.</p><p>However, for the few months after this experience, I got stuck in many negative recurring thought loops.  Particularly in the shower, when I had time to just zone out and think about things, I would find myself coming back to a negative thought I had just had two minutes earlier over and over.  The thought loops really bothered me, and I consciously fought to overcome them.  They got rarer and rarer as more time elapsed, finally disappearing after 3 or 4 months.</p><p>The other main after-effect I experienced from 2-CE was that I now see crazy 2-CE patterns when I close my eyes when I'm very high on marijuana sometimes.  I believe 2-CE has the ability to provide an amazing experience at more appropriate doses, but I find the after-effects disconcerting.  Many of my friends who have tried it also describe it as 'sticky,' meaning that some effects linger long past when the actual trip ends.</p>",
 "year": "2010",
 "id": "90960",
 "gender": "Male",
 "age": "21",
 "timestamp": "2012-03-04T08:00:00.000Z",
 "views": "2816",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
