{
 "title": "Dipping a Toe In....",
 "author": "Legion Bob",
 "citation": " Legion Bob. \"Dipping a Toe In....: experience with Ayahuasca (Banisteriopsis caapi & Psychotria viridis) (ID 9099)\". Erowid.org. Aug 29, 2001. erowid.org/exp/9099",
 "substance": "Ayahuasca (Banisteriopsis caapi & Psychotria viridis)",
 "bodyweight": "150 lb",
 "header": [
  "DOSE: T+ 0:00",
  "10 g",
  "oral",
  "Banisteriopsis caapi",
  "(plant material)",
  " T+ 0:30",
  "7.0 g",
  "oral",
  "Psychotria viridis",
  "(plant material)"
 ],
 "report": "<p>   This was more of a 'make sure I don't kill myself with the MAOI' run than a real attempt to produce an experience. The 10 grams B. caapi and 7 grams P. viridus (both finely ground dry material from one of the better known suppliers)  were extracted seperately, using about two cups of water and 2 grams vitamin C (ascorbic acid) each. The plant material, water, and vitamin C were simply whisked together in a small (glass) coffee pot and put on to simmer. The caapi was 'cooked' in this manner for about 30 minutes, the viridus got a full hour. After cooking, each mixture was vacuum filtered 4x through a double layer of common coffee filters. (If you're doing extractions, a basic vac filtration system is a real godsend--the most intractable sludge can be filtered.) The filtered solutions were an amber color akin to apple juice with an orange tint -- the viridis solution was a little darker. As reported elsewhere, the B. caapi extract does indeed glow lime green under black lights. (There seemed to be a little flourescence to the viridis extract as well.)</p><p>   These extracts were kept seperate, poured into large pyrex measuring cups and put on the stove on low heat to evaporate off most of the water.   In the end I was left with two shots worth of dark cloudy liquid (about 1/4 cup each.)</p><p>    Before attempting to drink the vile stuff I rinsed my mouth and gargled with Chloroseptic throat spray (which is itself pretty nasty, but it does kill the sense of taste.) I drank the B. caapi first, followed about 20 minutes later by a teaspoon of Pepto-Bismol and a few Tums plus the viridis extract. The taste was pretty nasty (particularly the viridis) and induced a strong gag reflex (but nothing that couldn't be handled.)</p><p>   Effects were noted about 20-30 minutes after taking the viridis--a mild, not unpleasent stoning effect that slowly wandered between deep relaxation (some urge to sleep) with odd bouts of energy in between. There was the occassional blip of color at the corner of my field of vision and the tantelizing hint of SOMETHING wanting to coalesce into visability with my eyes closed, but I had to concentrate on the effect to notice it. By concentrating on my hands and feet I was able to watch them shorten and elongate quite convincingly, which was an interesting hint as to what this drug is capable of at higher doses. At one point I lay back and felt my body letting go, as though I might be returning to the earth like an old dead tree. An odd but strangely peaceful and welcome sensation--a promise of rest, then rebearth. All effects but the mild stoned feeling went away when I turned my attention from them. I would say I was 98% functional -- you could have dropped me in the middle of a DEA convention and nobody would have suspected I was on anything (no pupil dillation, felt almost entirely myself.) I was back to baseline about four hours after the first effects were felt. At no time was there even a hint of nausea, which is no doubt partly due to the small dose. As to the initial taste, next time I think I'll completely dry the extract and gellcap it.  Blech!</p><p>  On the one hand it wasn't a terribly interesting use of the day, but honestly, what do most people do otherwise? Watch TV? It *did* provide an excellent 'feeling out' of the strength of the materials being used, so I expect to be able to fine-tune the dose pretty accurately for next time.</p>",
 "year": "2001",
 "id": "9099",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-08-29T07:00:00.000Z",
 "views": "43302",
 "dose": {}
}
