{
 "id": 9101,
 "title": "Double Sensation",
 "date": {
  "submission": "2009-01-03T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Sillywabbit33",
  "gender": "Male",
  "weight": "270 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Ephedrine"
  },
  {
   "time": " T+ 4:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Hydrocodone"
  }
 ],
 "report": [
  "I am 34, male and 270lbs.  My experience with substances is limited to multiple times drunk on alcohol, 10 times high on 50 to 100mgs of Ephedra Alkaloids, 1 time high on 1 pill of MDMA, and twice high on pot via brownie-injestion.",
  "I came across some old Hydrocodone w/ Acetaminophen and decided to see what mixing Ephedra Alkaloids.  I work from home and decided to do this after all my neighbors left for the day and the neighborhood was quiet.",
  "I first took the 100mgs of Ephedra Alkaloids with water and diet coke.  Within 20-mins I began to feel my heartrate increase and the mild euphoric buzz.  I chickend-out taking the Hydrocodone w/ Acetaminophen right-away and began working.  About 2 hours into the Ephedra high I began to feel chills, as I usually do when on it.",
  "About 4 hours later the ephedrine buzz was still going-strong and I finally got-brave and took one #20 table of the Hydrocodone w/ Acetaminophen.  I took it with water only and did not eat anything the entire time while enjoying the buzz of the Epehdra.  Within 15 minutes I felt numbing of my legs and arms and my body felt heavy.  I stood up and my heart was still going strong and felt a mild double-sensation of buzz and calm wash over me, it was very pleasant.  About 15 minutes later my face began to tingle and my vision became slightly blurry.  Ten minutes after that I began to feel warm all over.  I noticed I had cottonmouth and drank some water while enjoying a warm numbness all-over, this feeling lasted about 15mins.  I then began to feel mildly nauseaus but did not throw up.  I began to feel sleep and I layed down.  With my eyes closed I felt very relaxed and numb.  I felt that way for hours and fell asleep.",
  "This was a very-interesting experience.  I have a few pills left and have always wanted to try them with alcohol.  I plan to this friday night in case the additive effects are too-strong."
 ],
 "erowid": {
  "id": "55657",
  "citation": " Sillywabbit33. \"Double Sensation: experience with Ephedrine & Hydrocodone with Acetaminophen (ID 55657)\". Erowid.org. Jan 3, 2009. erowid.org/exp/55657",
  "substance": "Ephedrine & Hydrocodone with Acetaminophen",
  "views": "10659"
 }
}
