{
 "title": "Concoction Administered Rectally",
 "author": "Mind",
 "citation": " Mind. \"Concoction Administered Rectally: experience with MXE, DPT & 2C-C (ID 91032)\". Erowid.org. May 16, 2011. erowid.org/exp/91032",
 "substance": "MXE, DPT & 2C-C",
 "bodyweight": "130 lb",
 "header": [
  "DOSE: T+ 0:00",
  "50 mg",
  "rectal",
  "Methoxetamine ",
  "(liquid)",
  " T+ 0:00",
  "50 mg",
  "rectal",
  "DPT",
  "(liquid)",
  " T+ 0:00",
  "20 mg",
  "rectal",
  "2C-C",
  "(liquid)",
  " T+ 2:15",
  "25 mg",
  "insufflated",
  "Methoxetamine ",
  "(powder / crystals)"
 ],
 "report": "<p>Dosage</p><p>50mg Methoxetamine (MXE)</p><p>50mg Dipropyltrpytamine (DPT)</p><p>20mg 4-Chloro-2,5-dimethoxy-phenethylamine (2C-C)</p><p>Rectally</p><p>(T + 2:15)</p><p>25mg Methoxetamine (MXE)</p><p>Insufflated</p><p>Intro/Background</p><p>I am a 24 year old (130lb, 5'10') university student currently studying chemistry. I have a interest in psychedelic drugs, Most notably tryptamines, I have a liking to dissociatives, and I use stimulants occasionally. Most of my drug usage is devoted to exploring these wonderful psychedelic molecules. I am well experienced in these substances seperately, although this was a fairly high dose, because of the multiple substances, and the method of administration. The first 3 entries were made during the experience.</p><p>Administration</p><p>10:15pm</p><p>(T + 0:00)</p><p>The substances above are weighed out accurately with a miligram scale, and dissolved in 8ml of distilled water. The solution was placed in a syringe without a needle and administered rectally.</p><p>(T + 0:15)</p><p>Body effects are noted, DPT seems to have taken hold, feeling vibrations, im hearing a ticking sound, like a clock. Its building quickly.</p><p>(T + 0:30)</p><p>Intensive, keeps on building, MXE dominates mental effects, DPT gives familiar tryptamine vibrations and visuals, body load is enjoyable. Body feels incredibly numb due to analgesic effects of both MXE and DPT. Only slight noticeable 2C-C are felt so far. I begin listening to music, both DPT and MXE seem to alter msuic in their own ways to an intense degree.</p><p>---</p><p>(T + 0:45)</p><p>Both DPT and MXE peak, music sounds absolutely alien, and i begin to dissociate drift, and lose awareness of my position and body. DPT visuals are intense 3D fractal patterns, similar to DMT, but very DPTesque while with the clear, mind state of MXE.  It seems that music has full control of the experience, and the trip changes mentally and visually when a song comes on. But this is very characteristic of MXE. The peak consisted of phases dropping deep into this soft fuzzy, dreamlike DPT realm, completely immersive, then occasionally coming back for a short while, sometimes due to the change or break in the music.</p><p>(T + 1:45)</p><p>The DPT begins to grow less intense, but the mxe prolonged the peak a lot longer, as the DPT diminishes more and more, the 2C-C takes control. A transition in effects is noticed, the visuals change from purplish pink, intricate tryptamine patterns, to a more solid green/blue shapes and designs. A more sedated body load is felt, and dissociation is increased greatly. It is much more difficult to move. Little change in mental effects where noticed, still very (MXE.</p><p>(T + 2:30) Insufflated 25mg Methoxetamine</p><p>The atmosphere of the trip changes greatly, MXE is wearing off, body is utterly sedated, and mental dissociation is huge.  I blindly reach for the capsule containing 25mg MXE I prepared earlier, I opened it and attempted to insufflate it. I wasn't sure if I had even gotten any because of the zero pain felt when insufflating MXE. A few minutes I was sure because of the taste in my throat. The MXE hits quickly, and within 15 minutes I have begun phasing again, and fall deeply into the dissociative MXE land.  The experience has a completely new atmosphere then it did earlier with the DPT.</p><p>(T + 3:30) The trip seems to die down, finally, I wasn't expecting an intensity similar to the MXE and DPT earlier. Similar in dissociation and immersiveness, but with different visuals and mind state. I definitely enjoyed the MXE and DPT segment more then the 2C C + MXE experience. Disoriented, i soon fall asleep.</p><p>Conclusion</p><p>MXE is great to combine with psychedelics, it intensifys the experience greatly, and adds an analytical like clarity, which is strange for dissociatives. I will be repeating the MXE + DPT combo, but probably as smoked freebase while after taking some methoxetamine. This was quite a concoction, and its strange to have so many substances in ones body at the same time.</p>",
 "year": "2011",
 "id": "91032",
 "gender": "Male",
 "age": "24",
 "timestamp": "2011-05-16T07:00:00.000Z",
 "views": "10651",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "50 mg",
   "administration": "rectal",
   "substance": "Methoxetamine ",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "50 mg",
   "administration": "rectal",
   "substance": "DPT",
   "form": "(liquid)"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": "20 mg",
   "administration": "rectal",
   "substance": "2C-C",
   "form": "(liquid)"
  },
  "3": {
   "time": " T+ 2:15",
   "amount": "25 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  }
 }
}
