{
 "title": "Weed is the Fuse",
 "author": "blarg",
 "citation": " blarg. \"Weed is the Fuse: experience with LSD & Cannabis (ID 9108)\". Erowid.org. May 18, 2004. erowid.org/exp/9108",
 "substance": "LSD & Cannabis",
 "bodyweight": "185 lb",
 "header": [
  "DOSE: T+ 0:00",
  "3 hits",
  "oral",
  "LSD",
  "(liquid)",
  " T+ 5:00",
  "6 hits",
  "oral",
  "LSD",
  "(liquid)",
  " T+ 7:00",
  " joints/cigs",
  "smoked",
  "Tobacco - Cigarettes",
  "",
  " T+ 12:00",
  " bowls",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>3:00 AM: 3 hits of liquid.</p><p>Visited a few parties with the normal tripping fun.  Great music spun (progressive house at one place, drum and bass at another).  Failed miserably at playing Magic -- the art on the cards was too enthralling to keep up with the rules.</p><p>Adventure and exploration around town -- my troop likes to get outside and go...just go -- and of course 6 more hits by 8:00 AM.  Intense visuals.  Trees are no longer trees, but immense fractals bending toward me as I walk.  That wonderful epiphany that I've figured it all out (whatever it is).  General euphoria.</p><p>10:00 AM: Personal adventures.</p><p>I like to get some time by myself when I'm tripping, so I walk home, rather enjoying a few menthol cigs.  Spinning records, playing guitar, etc.  I spend quite a bit of time messing with Rebirth-338, everyone's favorite 303/909 emulator.  I definitely suggest my fellow trippers grab a copy and play with all the fun synthy squelchy sounds you can make.  You might not stop until tomorrow.</p><p>Re-unite with my troop, who had fallen asleep but, of course, woke up tripping.  Lotsa acid.</p><p>3:00 PM: Insanity!</p><p>Here's the good part.  Some might call it a 'bad trip;' I consider it a 'character-building personal struggle.'  Unless you end up in jail or dead -- that's a 'bad trip.'  Oh, and hence the title: 'Weed is the Fuse.'</p><p>We smoke a few bowls of decent krypto at a friend's house.  I have one of those 'did I say that or think that?' moments.  The moment lasted for about 5 minutes.  Yeah, I said that.  Nothing bad, just association out loud instead of in my head.  I think.</p><p>I fall into 'the zone.'</p><p>I start to get paranoid.  Really paranoid.  I need to leave.  I want to go home.  I've never felt this paranoid in my life.  Something's wrong.  I run out of my friend's house, troop behind me. </p><p>All of a sudden I realize that everything I think about the world, reality, and, well, everything, is a huge misconception.  Everything is an illusion -- time, space, even the people I know. Everyone is me and I am everyone.  I suppose those little bits of my brain were testing the mettle of my self-righteous existentialism -- that we all live as behavioral models for each other.  You might call it the Golden Rule.</p><p>As for the huge misconception, I realized that everyone in the world is nothing but a competing aspect of my own personality.  How I interact with these competing aspects determines my course in life, and determines what role I can have in making the world a better place for our descendants.  But if everyone in the world is actually me, what's the fucking point?</p><p>Because Kirkegaard was right!  While it's absurd to consider one's self an existentialist and to believe in some dark mysterious creator at the same time, it all hit me.  There is a God, and he's testing me right now.  My whole life.  He's pummeling my brain with all these stimuli, that I call friends, music, sex, drugs, coffee tables.  Holy shit!  I start noticing Nissans everywhere as I walk through town (I drive a Nissan).  I think about family members who have been addicted to drugs, and I am instantly overwhelmed with guilt regarding my use.  Will my use, however moderate, inspire someone else's spiral into addiction and loss of self-control?  It's too late to change what I've done in the past.  I realize that I am living my punishment.</p><p>Why do we call it 'tripping?'  What does that mean?  Of course -- when I get home, I'm literally going to trip down my steps.  That's become the ever-present word, 'trip.'  I'm going to die.  Time doesn't exist, run forwards, or backwards.  I'm already dead.  I close my eyes.  I'm not dead.  I'm on an operating table.  My mom and little brother are looking down at me.  I try to wake up, but I can't.  I've tripped and died. </p><p>I open my eyes.  I'm standing on a street corner, where I was before I closed my eyes.  I'm still alive.  Awesome.  But I can't go home now.  I will trip down the steps.  It's beyond my control, it's in the stars.  I want to go home, but I can't.  Why?</p><p>Now I realize I'm in hell.  I can't go home anymore.  I begin to regard one of my troopers as the not-so-figurative devil-on-my-shoulder, the other as the angel.  Follow the devil to more acid?  Fuck no!  That got me here in the first place.  Just keep walking.</p><p>But I can walk anywhere I want.  I'd imagine hell to be a place where I have no control over my next move.  Wait, I'm not in hell.  I'm on earth.  But why do I still have these paranoid delusions?  Why do I still believe that nothing is real?  Wait!  I'm not having paranoid delusions anymore!</p><p>I realize that I'm God.  And that's why it was so easy to believe in the paranoia.  I can do anyhing.  I'm all-powerful.  No more delusions.</p><p>Who is everyone else?  They're Gods too.</p><p>The acid is wearing off.  So's the collective consciousness.  No longer am I everyone and vice-versa, no longer am I dead, and the clock makes sense again.</p><p>9:00 PM: No more insanity.</p><p>All that was rushing through my little brain for 4 or 5 hours.  Don't think I'd ever been as thoroughly uncomfortable for such a long time.  But it was fun as hell.</p>",
 "year": "2001",
 "id": "9108",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-05-18T07:00:00.000Z",
 "views": "38813",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 5:00",
   "amount": "6 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  },
  "2": {
   "time": " T+ 7:00",
   "amount": " joints/cigs",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  "3": {
   "time": " T+ 12:00",
   "amount": " bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
