{
 "id": 9125,
 "title": "This Plant Deserves Respect",
 "date": {
  "submission": "2006-12-13T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sam",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Banisteriopsis caapi",
   "form": "extract-10x"
  },
  {
   "time": "0:00",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "extract-10x"
  },
  {
   "time": "0:20",
   "amount": "25 g",
   "administration": "oral",
   "substance": "Tabernanthe iboga",
   "form": "roots"
  }
 ],
 "report": [
  "Having experienced a wide array of psychedelics (LSD, psilocybin mushrooms, mescaline cacti, 2CB, 2CE, 2CI, 2CT2, salvia, ketamine, cannabis etc), and having recently had some very deep experiences drinking ayahuasca out in Peru, iboga seemed the next stage. I ordered 25g or root bark from an online vendor, which arrived quickly.",
  "I was going to have the house to myself for the coming weekend, so it seemed like the time to do it. I put a lot of it in size '00' gel caps (a good help when ingesting fowl plants sometimes).",
  "20 minutes before dosing I took 1g of B. caapi and syrian rue, split evenly. NOTE: This was probably a bad move on my part. I usually combine MAOI's with natural psychedelics like shrooms and cacti to get the most out of them, but with a strong stimulant like ibogaine, this may have been careless.",
  "I then started consuming the caps (there were many) around 6 PM. I smoked a tiny amount of weed just to keep any on coming nausea at bay. I relaxed and waited for effects.",
  "My memories of the night are hazy at best. I remember feeling a change in bodily perception, tingling. I began to feel progressively more light headed, and my vision began to sway. The dizziness was very much like being on ayahuasca. I suspect MAOI's were at least partly responsible.",
  "I was hot and generally uncomfortable. I had MAJOR red eye, eyes were stinging. Visuals increased, but were still 'threshold tripping'. Weed increased the strength of these, but not by a great deal. The high was far from blissful, and not really that pleasant. Very different to the other plant psychedelics.",
  "I had been feeling slightly nauseous for a time and so forced myself to be sick, with some effort. Better out than in I reckon. Vomiting on iboga was unpleasant, very unlike the cleansing purge of ayahuasca or cacti. The root bark was very dry and I vomited through my nose and had a mixture of stomach acid and half digested iboga swilling around my sinuses. In between vomiting I happened to notice open eye patterning moving on the towels. This was the most intense the visuals got.",
  "Later on I fell into a dream/sleep state, and had many vivid dreams, only one I can remember. I was downstairs in the pitch black and I suddenly see a dark figure-someone approaching the front door. For some reason this brought on feelings of intense terror and I cried out.",
  "I woke up after an unknown length of time and was still distorted. I did not regain my balance for another 2 days, and had generally unpleasant bodily feelings for that time. I wasn't completely recovered for 4 days.",
  "Iboga is NOT a recreational drug. Used properly to treat drug addiction or similar afflictions, or in a ceremonial Bwiti setting I think it could be a very powerful healing medicine. It is not a 'fun' recreational drug, and should be used with due care. I would recommend you DON'T combine with MAOI's. Its really not worth the risk, and will be powerful enough on its own. Its also expensive.\rApril 2012 Addendum",
  "This is one of my experience reports, and my first encounter with iboga. Since this time I have had flood doses with root bark, TA extract and pure ibogaine, and from my experience, I hold iboga in very high regard as the most powerful shamanic healing plant on Earth. However this first time I was very stupid and reckless...I ingested 25g of whole iboga root along with MAOI's, while on my own. I severely poisoned myself, likely the closest to death I've ever been, and I learned a serious lesson in respect from this. Just to be clear....in the experience described above, rather than root bark I ate iboga whole root, which contains very little alkaloids and lots of other nasties."
 ],
 "erowid": {
  "id": "55736",
  "citation": " Sam. \"This Plant Deserves Respect: experience with Tabernanthe iboga, B. caapi (10x extract) & Syrian Rue (10x extract) (ID 55736)\". Erowid.org. Dec 13, 2006. erowid.org/exp/55736",
  "substance": "Tabernanthe iboga, B. caapi (10x extract) & Syrian Rue (10x extract)",
  "views": "30476"
 }
}
