{
 "id": 9127,
 "title": "Sipping History",
 "date": {
  "submission": "2009-03-24T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "James",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 oz",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "liquid"
  }
 ],
 "report": [
  "I submit this as a response to the lack of up to date submissions regarding absinthe and wormwood. The Green Fairy is being produced legally again in Europe and authentic (read: not Czech) absinth can be easily purchased, though with some restrictions as it is still illegal in the United States.   ",
  "Having held a long fascination with this near-mythical drink, I jumped at the chance to purchase some online.  When it arrived, I eagerly opened the bottle, poured out an ounce of the liquid, and then slowly dropped water over a sugar cube and into the glass by means of a perforated absinthe spoon.  It turned a wonderful pale milky green color.    I like Pernod well enough, but Absinthe, at least the stuff I drank, is lower in licorice flavor and has a greater mix of other flavors.  For me, it was absolutely refreshing and delicious.  Enough to pour myself another... and then another.",
  "As for the effect, well what would one expect from a 150 proof drink?  The experience was overwhelmingly similar to other types of alcohol.  If pressed I would say that the drunk is clearer.  Lights seemed a bit brighter and, while I was definitely feeling it, my mind did not seem at all sluggish, as I might get from a corresponding amount of wine or beer.  It is a most lively and creative drunk.",
  "Is this difference due to the wormwood?  Who knows?  Most people will tell you that getting drunk on gin feels somewhat different than getting drunk on tequila.  Different types booze have different personalities.  But reading other accounts of wormwood, people often mention an energy and clarity.  So I think Ill go on believing its due to the wormwood.  Ultimately who cares?  Its a mighty pleasant experience.  ",
  "What did not happen is anything that could be described as tripping.  There was nothing remotely psychedelic about this experience.  From what Ive read, properly made modern absinthe is just as strong wormwood-wise as its 19th century predecessors.  Were not missing out on anything.  Of course, one can find wormwood-spiked booze, complete with green dye and ten times more thujone than would ever have been in Van Goghs glass, but that stuff isnt absinthe and it tastes foul.",
  "To sip absinthe is to sip a bit of history and mythology, not to mention partaking in a really pleasant enlightened intoxication."
 ],
 "erowid": {
  "id": "55746",
  "citation": " James. \"Sipping History: experience with Absinthe (ID 55746)\". Erowid.org. Mar 24, 2009. erowid.org/exp/55746",
  "substance": "Absinthe",
  "views": "6773"
 }
}
