{
 "title": "A Waste of Money",
 "author": "Mase",
 "citation": " Mase. \"A Waste of Money: experience with Products - 'Bath Salts' (ID 91295)\". Erowid.org. Aug 2, 2011. erowid.org/exp/91295",
 "substance": "Products - 'Bath Salts'",
 "bodyweight": "150 lb",
 "report": "<p>[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.] </p><p>11:00 PM: I  came home with 2 grams of Bath Salts(Blue Velvet Bath Magic). I was unsure of dosage so I started off with a .15g line and waited(very intelligent...not).</p><p>11:15 PM: No effects felt so I took 3 more lines (~.075/g). I started feeling a slight euphoria and slow on-come of energy/awakeness. Slower than that of the effects of cocaine or adderall.</p><p>11:30 PM: I decided it would be a good idea to research online for dosage and effects of MDPV. From my experience of insufflating other stimulants such as cocaine, Ecstasy, adderall, ridalin, speed and ice - The effects were feeling close to the effects of ice or adderall. I started to play a 1st person shooter game online and quickly exited the game out of boredom and confusion of finding anything that would seem fun. I read and browsed posts online for mdpv.</p><p>- Increased energy</p><p>- slight euphoria</p><p>- cold chills in my legs and feet and sweaty palms</p><p>- Increased heart rate</p><p>- Increased sense of smell</p><p>I decided to take a shower - This was the best and most rewarding part I had. It felt much like the effects of Ecstasy. I did not want to get out.</p><p>12:00 AM: My jaw started clenching and heart rate went up. I felt sexually stimulated but not able to be aroused easily. I decided to try and smoke the bath salts and started searching the house for makeshift pipe supplies. I ended up making a plastic water bottle bong(more suitable for smoking herbs but it would work). I probably made .3/g of 'smokeable' bath salts. The first hit was very similar to that of crack. A very calming and intense high. I smoked  a couple more hits  and just sat there - not wanting to move and ruin the high/calming effect.</p><p>1:00 PM: I threw the bong in the trash and took another line and went back to the computer. At this point, The experience became that of the comedown of X. I felt sexually stimulated, confusion of ideas, spaced, and craving xanax, marijuana, or any kind of sleep medication that would end this horrible feeling of nothingness. There was no great feeling to any of the senses that seemed entertaining except for sex. My girlfriend was out of town(reason I decided to try this stuff) and I ended up looking at porn for a couple hours(not that I was stimulated, but it was the only thing that would keep me interested), while trying to contain the clenching of my jaw, heart beat, and breathing. I started comsuming water (~3pints)</p><p>1:30 PM: I was feeling a lot like I had taken to much adderral or cocaine. I continued to insufflated small lines at a time that did not bring me back up to any desired or positive effects. Dead inside. Cold sweats, jaw clenching, increased heart rate, feelings of emptiness consumed me. I took a couple more lines that would finish off one of the gram containers I purchased. I drank more water. At this point, Anything moving seemed to agitate and cause anxiety.</p><p>3:00 AM: After more porn and clicking in and out of windows and old pictures on my computer, I laid down and focused on controlling my breathing and heartbeat. Soon I felt as if my body were completely asleep and my mind was subconsciously awake all night. I continued drinking water to try and flush everything out of my system.</p><p>9:00 AM: I finally decided to get up and take a shower...again. The comedown was much like Ecstasy without the sad emotional depression - just feelings of nothingness. Still fully alert with no signs of coming completely down.</p><p>12:00 PM: I went to the store and grabbed a 12pk of beer. Still sign of coming down. I feel wide awake and fully alert, as if I just taken another adderral. I started drinking to lower the stimulate effects..</p><p>4:30 PM: On my 6th beer..Still feeling the same effects.</p><p>I would not recommend this as a recreational drug. It is not fun after the 1st 2 hours. I would not recommend this as a recreational/study drug over the use of other mentioned stimulants. I did notice during my experience I had no urge or want to smoke tobacco after 2 attempts that night. I did find this drug addictive to some extent.</p><p>Overall: This is something that is not even worth wasting money or time on. I did not find satisfaction in any way and would not use it again. There are plenty of other substances out there I would highly recommend over the marketed VS desired effects of this material.</p>",
 "year": "2011",
 "id": "91295",
 "gender": "Male",
 "age": "24",
 "timestamp": "2011-08-02T07:00:00.000Z",
 "views": "8135",
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "insufflated",
   "substance": "Products - Bath Salts, Plant Food, etc",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:15",
   "amount": "225 mg",
   "administration": "insufflated",
   "substance": "Products - Bath Salts, Plant Food, etc",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:00",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Products - Bath Salts, Plant Food, etc",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 2:00",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Products - Bath Salts, Plant Food, etc",
   "form": "(powder / crystals)"
  }
 ]
}
