{
 "title": "Suspected Overdose Be Careful",
 "author": "anonymousMay3011",
 "citation": " anonymousMay3011. \"Suspected Overdose Be Careful: experience with Methoxetamine (ID 91291)\". Erowid.org. May 31, 2011. erowid.org/exp/91291",
 "substance": "Methoxetamine",
 "bodyweight": "160 lb",
 "report": "<p>I'm writing this the morning after it happened.</p><p>At approximately 10:10 in the night, I decided to start it fun and grabbed my bag of ~150mg methoxetamine. I set up a line from the powder, which was approximately 1/4th of the remaining powder, so about 35-40mg. I insufflated the line, and sat back to await the effects I've grown to love. At about 10:20, being impatient and STUPID, I proceeded to do another line of MXE, a large one that was about 1/2 the remaining powder, which was about 55mg of MXE. I once again leaned back to await the peaceful mind-numbing opioid effects that this rare substance has.</p><p>At around 10:45, I was feeling incredibly high, and decided that I would not do anymore until later in the night. This went on for about an hour with no change in scenery, and I was left feeling a somewhat annoying, debilitating drunk high without much in the way of tripping. I put on some music to try and put myself in the mood to trip, and it sounded tinny and unfriendly. At around 11, for God knows what reason, I decided to finish the rest of the bag, pushing my dose up to approximately 150mg in the night. I've heard reports of people doing much more, but everyone's body is different. At around 12:00, I noticed that I was still climbing ever higher, and the trippy effects were becoming less pronounced and replaced by toxic ones.</p><p>At 12:15, I began feeling an incredible nausea come over me that was completely foreign to this substance, I have never in my time with it experienced nausea. I raced to the bathroom so as not to vomit all over the floor, and vomited A LOT of material up (note that I hadn't eaten since around 5:00 that day, there was not much in my stomach at the time of the experience). At this point, I did not really feel high, just the toxic effects of the Methoxetamine coursing through me.</p><p>At 12:35, I took my heart rate, which was an alarming 48 while resting (my resting HR is normally around 70). I took it again, and this time it was 78. I realized that my heartbeat was sporadic, and it was jumping from between 50 to 80. It would skip a beat, then beat twice to try and make up for it, all the while I continued to climb into a drunken haze.</p><p>At 12:40, the idea of an overdose quickly took hold of me, and I realized that I may very well have done way too much. I contemplated calling 911, but decided against it, for 2 reasons. 1, I'll find that in a dissociative haze, I don't really care about anything, and at the time the idea of death sounded like a joke to me, and secondly, I had a lot of illegal drugs laying around the house that I would have not been capable of cleaning up. Also at the time, I was becoming higher and higher, and I doubt I could have figured out how to work a phone.</p><p>At 1, I began having severe stomach upsets, with alternating diarrhea and vomiting. The diarrhea looked strange and red, as if there was blood in it, as did the vomiting (although I doubt the validity of this statement, as I often hallucinate the color red on dissociatives), and I was overcome with the idea that this night would be my last.</p><p>At 1:30, I stumbled into bed, tried to clean up the stashes all around me the best I could, and lay in the sweat-drenched cold, hoping to drift off into sleep and not death.</p><p>Upon awakening in the morning, I was still high, with my body coordination severely off-kilter and my vision choppy and distorted.</p><p>Please people, I'm warning you, start low and work your way up slowly. You never know how your body will react to a large amount of any drug.</p>",
 "year": "2011",
 "id": "91291",
 "gender": "Male",
 "age": "17",
 "timestamp": "2011-05-31T07:00:00.000Z",
 "views": "21034",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 0:10",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 0:50",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  }
 }
}
