{
 "id": 9132,
 "title": "Purity",
 "date": {
  "submission": "2007-08-08T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "MattPsy",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "1 cart.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "report": [
  "Dose as function of weight: 3.08 mg/kg",
  "This is definite K Hole territory. As it was.",
  "Anyway:",
  "I cut out two phat 100mg lines, chopped up into very fine powder. I then insufflated both, one after another - one for each nostril. Ow. Burnt quite badly. I then prepared a NOS for later on, chucking a cartridge into the cracker and stretching a balloon over the outlet, and put it next to my bed for later. Here is the Word file I had open to document the effects if I were able to. Here, you can see that I gave up rather quickly, haha!",
  "*****",
  "T+0 200mg ketamine insufflated",
  "T+5 Onset of effects",
  "T+10 the effects have grown hugely in intens",
  "*****",
  "I gave up at that point, crawling into my bed, grabbing my MP3 player (which I had prepared beforehand so all I had to do was put the headphones on and push play, thankfully - filled with full on Psy) and then curling into the foetal position - I wanted to minimize movement to minimize any possibility of nausea, as I knew this would be disasterous given that the world was already in fragments around me so I wouldn't be able to get outside.",
  "Very intense OEV's and CEV's. Still getting stronger, much stronger, and I realize this is only the beginning. I operate the NOS cracker while I'm still able to (with considerable difficulty). Unfortunately, the full on Psy I had so carefully planned sounded faraway and distant, as though being heard underwater - still very enjoyable, though. NMDA antagonist psychedelics don't seem to agree with sound. As I sensed the experience began to peak out (in orbit around the Earth at this time Laughing out Loud), I had the nitrous.",
  "### Bye Bye ###",
  "Now, ALL the previous times I've had nitrous recently, it's seemed to hit a peach-tinted white 'wall', overlaid with green Spirograph-esque patterning, and can go no further. I had been VERY frustrated with this, as I sensed great things to see and behold were behind that wall if I could overcome them.",
  "There was no problem this time. Synergy of NMDA antagonists, weow! Forget about going over it, I blasted straight through it (fragments flew everywhere!) and began to slide down a slope made of kaledoscopic vinyl, with a sheer drop at the end. The strangest thing, at the edges of the hill were literally thousands of ceramic garden Gnomes, completely animated, all chanting in synchrony 'A new way to say... HOORAY!' - a excerpt & abstraction of lyrics written by Syd Barrett of (formerly) Pink Floyd and later used by Terence McKenna & Shpongle, I believe - but I disgress.",
  "The sheer drop approached. I did not resist. Over I went.",
  "Below - a HUGE (it went on for as far as I could see it) gridlike structure of pinpoint lights, seething with energy. It was like, um, how in the film The Matrix they have the farms of human bodies producing electricity - except somehow friendly and welcoming. The collective consciousness.",
  "White tendrils of energy enveloped me, and all I knew was forever *Purity*.",
  "I had been waiting to get here, I am home. Such incredible beauty.",
  "I have absolutely no idea how long was spent there in this state.",
  "But, I am thankful of every second of it. I'll return, sometime, but not for quite some time, until I have some more good questions to ask. Good answers require good questions.",
  ":)"
 ],
 "erowid": {
  "id": "55767",
  "citation": " MattPsy. \"Purity: experience with Ketamine & Nitrous Oxide (ID 55767)\". Erowid.org. Aug 8, 2007. erowid.org/exp/55767",
  "substance": "Ketamine & Nitrous Oxide",
  "views": "8388"
 }
}
