{
 "title": "Surprised - In a Good Way?",
 "author": "Qvox",
 "citation": " Qvox. \"Surprised - In a Good Way?: experience with Phenibut (ID 91357)\". Erowid.org. Mar 6, 2012. erowid.org/exp/91357",
 "substance": "Phenibut",
 "bodyweight": "220 lb",
 "report": "<p>In the nootropics circles Phenibut is discussed as being an anti-anxiety chemical, that has some nootropic benefit.  While I can't attest to Phenibut's nootropic benefit my experience certainly supports its 'anti-anxiety' effect...</p><p>I took 3g which was a mistake, and well outside the range of therapeutic benefit.   This drug had a very slow onset.   Don't make the same mistake I did by misreading the slow onset of this chemical and increasing the dose.</p><p>8:30PM-I took 1.5g thinking I'd finish up some work on my laptop and hit the hay.   The powder went down easy enough.</p><p>10:00PM-I noticed the time, and paused to consider whether or not I was feeling anything.  I 'felt' something, but honestly I thought it had to be a placebo effect.   So I took another .5g.  I get back on my computer.</p><p>10:30PM-I now decide that I am feeling something (...a little relaxed?).    But the feeling is very slight.  So, I decided to take another 1g.   I get back on my computer.</p><p>11:00PM-The effect is stronger, noticeable, and pleasant, but no way near as strong as my experience with benzo's.   It also had a different feel to it than benzodiazepine.  At this point I finish up my work and watch some television.</p><p>12:00PM-The effect of Phenibut has been more or less stable for the last hour.   I could go to sleep, but it don't feel 'tranquilized'.</p><p>12:30AM-At this point I decided 'this must be...it.'  The 'relaxed' feeling is mild, definitely not 'tranquillized' in any way.   From 11:00-12:30 I noticed no change in intensity, very mild plateau.  If this is all Phenibut is at 3g.....not horrible bang for the buck, but no way as strong as billed.   I go to bed and fall asleep normally.</p><p>7:00AM--my alarm wakes me up, which is usual for me.  Typically no matter how late I stayed up the night before I wake up right before it goes off .   All I can say about how I felt is 'wow....I REALLY feel funky ', while pleasant, its not how you want to feel on a workday morning.   The feeling was VERY pronounced, and like nothing I've felt before.   I was a little dizzy, not falling over dizzy, and not unpleasantly dizzy (...if that makes any sense).  My mind felt good, but not motivated to focus on anything.   After trying to clear the 'fog'(?) with some coffee,  I decided I'd work from home instead of driving into the office under the influence of this happy fog.</p><p>12:00PM--The morning was interesting, not completely unproductive, but definitely not 'peak' mental performance.  The dizzy  'happy fog' effect declined steadily over the morning.  By the afternoon I could turn off the fog-lights, I was feeling like my old self. Not a completely wasted day.</p><p>I'll use Phenibut again.  But next I'll try perhaps 1.0g and take it earlier in the evening.   My 'peak' must have occurred sometime after I went to sleep. The effects were much stronger in the morning than the night before, and they declined steadily throughout the morning.  From this experience I don't think I could say what the 'peak' felt like, but if the morning is any indication it must have been very intense.</p><p>My advice, resist the urge to increase the dose during the long ramp-up phase unless you can afford the 12-18 hours of 'happy fog' time. If you go recreational with this chemical be prepared to deal with the foggy aftermath.</p>",
 "year": "2011",
 "id": "91357",
 "gender": "Male",
 "age": "45",
 "timestamp": "2012-03-06T08:00:00.000Z",
 "views": "20193",
 "dose": [
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Smarts - Phenibut"
  },
  {
   "time": " T+ 1:30",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Smarts - Phenibut"
  },
  {
   "time": " T+ 2:00",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Smarts - Phenibut"
  }
 ]
}
