{
 "title": "The Real Deal...",
 "author": "SOUNDMODE",
 "citation": " SOUNDMODE. \"The Real Deal...: experience with 6-APB (ID 91355)\". Erowid.org. Jun 10, 2011. erowid.org/exp/91355",
 "substance": "6-APB",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "6-APB",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Judging by other reports of 6-APB/Benzo Fury, it is possible the authors have been scammed by one of the many websites in the UK selling fakes. The real Benzo Fury tablets should contain approx 100 mg of 6-APB. I have been buying these for 9 months or so now, and they are an absolute godsend living in an area of the UK where MDMA crystal/good pills are very expensive and hard to come by.</p><p>I start off with 2 tablets normally. The come up is very slow and gradual, the first effects after 50-60 mins and building to a peak between 90-120 mins. The general effect is very similar to MDA, very trippy and euphoric, but not as euphoric and loved up as MDMA. Very similar to the old Snowball pills in the UK in the early 1990's, but not quite as strong. Peak effects last around 3 hours, and the total experience around 6-8 hours. Comedown is not as bad as MDMA, and I haven't experienced midweek blues unless I have completely overdone it in a session. Normal intake for me will be 3-4 pills in a 12 hour session, any more and side-effects become too much to handle. I am a pretty big guy - 200lbs + so others of a lighter weight may need considerably less. I would recommend just trying 1 tablet for a 1st experiment with this substance.</p><p>Overall a very positive experience. If i could get hold of pure MDMA I would prefer that, but as I can't these are a very good substitute, the only real down side is that it takes a long time to get to sleep after a session.</p>",
 "year": "2011",
 "id": "91355",
 "gender": "Male",
 "age": "33",
 "timestamp": "2011-06-10T07:00:00.000Z",
 "views": "19404",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(pill / tablet)"
  }
 ]
}
