{
 "title": "Inner Sanctum",
 "author": "Squire",
 "citation": " Squire. \"Inner Sanctum: experience with Cannabis (ID 9138)\". Erowid.org. Dec 5, 2003. erowid.org/exp/9138",
 "substance": "Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cannabis"
  ]
 ],
 "report": "<p>I've been using marijuana for about 2 years, and it has changed my life, and in my opinion, for the better. It has made me a better person in all aspects, i have more respect for other people's feelings, and i have realized that most other people like me ,that is growing up in this hell called society, all go through the same things.</p><p>When sober, I am a very social person, I can speak to most anyone, and relate to them somehow, even though most people think of me as a stoner, because, well, i have the appearence of one, and that is all you need to be stereotyped as a moralless teenager that likes getting stupid.</p><p>Me and my friends light up all the time, and we have deep talks about nothing and everything, and it makes us stronger friends having such a ritual that binds us. But my most intense experiances come when i smoke by myself. I discover things in my mind that i had never thought of before, but now seem so easily understandable. I can think about something that has been nagging at me for days, and be at peace with it. Weed makes me not want to hurt a living thing.</p><p>I am a horrible writer, but anyone like me (and i have found a few) understands what i am saying. Marijuana is a spiritual experiance, and everyone should feel the effects at least once, so maybe they can forget all the material things that bind them down to the daily gind of life like work, stress, bills, and find something a bit deeper that makes all the hassles worth while, because you have found peace within yourself. I am still working on it, but i beleive i am close. Everytime i think i am there, i find something new and exciting which makes the path still worth  treading. Oh well, think about that the next time you are stairing at the wall, trying to make sense of it all.</p><p>Squire</p>",
 "year": "2001",
 "id": "9138",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-12-05T08:00:00.000Z",
 "views": "6047",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
