{
 "title": "Stupidity is Punished Hard",
 "author": "7177",
 "citation": " 7177. \"Stupidity is Punished Hard: experience with 2C-P (Mislabeled as 'Buphedrone') (ID 91409)\". Erowid.org. Jun 11, 2011. erowid.org/exp/91409",
 "substance": "2C-P (Mislabeled as 'Buphedrone')",
 "bodyweight": "85 kg",
 "header": [
  "DOSE:",
  "70 mg",
  "oral",
  "2C-P",
  "(powder / crystals)"
 ],
 "report": "<p>The following account describes two 2C-P overdoses experienced by the same individual (me in this case) within a week. The first incident lead to a brief hospitalization, the second was overcome without medical attention, but made a longer period of recuperation necessary.</p><p>The circumstances leading to this tragedy were quite simple. I obtained samples of various psychoactive materials using a now defunct chemical supply company specialized in such products, and proceeded to test them in the following weeks. Among other chemicals they also sent me a mislabeled batch of 2C-P. The sticker on the vessel identified the compound falsely as Buphedrone. At that point I had gained enough experience and confidence conducting such experiments, to allow myself to get sloppy. Slowly ramping up doses and reagent tests before that in order to rule out obvious contaminations or mislabeling had given way to a less cautious approach.</p><p>One warm summers evening I found myself without much to do, and decided to give the chemical I expected to be nothing more than another mildly underwhelming stimulant a go. In reality I started the evening by ingesting 70mg 2C-P on an empty stomach. Oh, and I chased it with plenty of fresh grapefruit juice.</p><p>Stimulating effects along with increases in pulse and blood pressure and sweating developed within the following half hour. It didnt feel particularly pleasant, but it wasnt totally at odds with reports about Buphedrones supposed effects profile. Then visual activity started, and a subtle shift in perception encompassing all other senses followed within one hour of ingestion. I knew something was going terribly wrong. I hastily checked the equipment and vessels used to prepare the dose and came to the conclusion that I must have weighed out 2C-P instead of Buphedrone. Both compounds had the same appearance and came in (apart from the labeling) identical looking plastic bags. </p><p>The chemicals effects were taking hold in increasing intensity. I looked up the generally accepted dose chart for 2C-P and the uncharacteristically fast development of the effects and was convinced to be the victim of a massive poisoning, brought about by staggering stupidity on my part. I violently threw up approx. 90 minutes after dosing. It took a huge effort to stay coherent enough to call an ambulance, and convey what I had done. The hospital I was brought had never seen a poisoning like this. I was the drug-overdose freak of the month; everybody came to take a look. They were unsure what do do, but at least had sense enough to call some toxicologists at a nearby university hospital.</p><p>They of course mistook 2C-P with 2C-B, but I was too far gone to correct them. It made no difference anyhow. The muscle tremors in my lower extremities which had been the most pronounced side effect from the start developed into uncontrollable muscle spasms.</p><p>They moved me to an intensive care unit where I was stuffed with more tubes and medical gear than I could count. The experience meanwhile had reached and exceeded a solid +++ on the Shulgin scale. So the procedures the staff had to perform on me weren't just painful and uncomfortable, no, they were terrorizing and insufferable due to the influence of the chemical. It took a long while before I mercifully lost consciousness. After emptying my stomach and trying to stop further resorbation with charcoal. They laid a central port near the heart, took steps to keep heart and respiration going and constantly analyzed blood and urine to have a look at how my liver and kidneys were holding up against the assault.</p><p>I awoke the next day, still attached to an impressive machine park at the ICU. During the day they plugged me out, cleaned me up, and released me against their specific advice after a psychiatrist looked me over on my own recognizance. A trusted friend picked me up and looked after me the following weekend.</p><p>I could have died, but I didn't. The doctor said my kidneys and liver made it, probably without too much damage, how my brain did is anybodys guess, but so far I havent been able to discern any kind of impairment. Long-term damage of course has to be assessed but I doubt there will be much.</p><p>The second incident occurred one week later when I finally came around to test the stimulant as originally intended. There was no mistake this time. I weighed out of the vessel labeled Buphedrone.</p><p>The vendor had mislabeled the bags. I was able to get in contact with former staff months after the incident. They reached out to me after reading my trip report. They claimed that it was a mishap during packing, caused by negligence and overworked staff forced to keep 14h shifts. They further claimed that nine customers were sent contaminated product but six of them could be warned. NMR analysis of samples returned to them confirmed 2C-P to be the contaminant.</p><p>I put too much trust in the excellent reputation the operation maintained in the research chemical subculture. The whole thing reminded of the infamous tragedy surrounding Haupt RC that had cost several peoples lives only a year before.</p><p>This time I overdosed on 80mg. Imagine the pure terror and despair when I realized I had to go through the same insane nightmare AGAIN within 6 days of stumbling out of a hospital! I couldn't cry and couldn't vomit, although I sincerely wished to perform at least one of the two. After sending an email to the vendor begging him to warn other customers and halt all sales and dropping warnings on several drug-related internet message boards decided to ride it out without calling an ambulance. This was not a smart decision, but the experience at the hospital was nothing short of traumatic, and my growing intoxication made rational thinking a challenge.</p><p>It took around five hours before I lost consciousness completely. It started with profuse sweating and again uncontrollable muscle spasms and got worse from there. The trip lasted over 30 hours, 24 of those at or beyond at a barely controllable level or way beyond that. The night was chaotic and apocalyptic. I did not sleep and was heavily disorientated. No music, no light, the visual and auditory distortions grew too intense to comprehend any external input anyway. Psychotic and delirious, would be an accurate descriptions of my mindset in those hours.</p><p>I loved the moment the sun came up. I spent dawn naked on my terrace. The world around me looked like a churning and swirling Van-Gogh painting -only much sharper, more precise. A naked animal, poisoned and exhausted, but thanks to the very same poison every function of its being dialed up to 150%. I knew I would survive this, there was a way out. Felt great. I spend the day at +++, the evening at ++. I called in sick (and underneath the heavily distorted body-buzz I was), but had to type some emails, make a couple of phone calls and review some texts. In hindsight I actually produced decent work that day, enhanced by crystal clear, super precise psychedelic thinking.</p><p>In the evening following I called a friend, she picked me up and nursed me the following days. I needed several days to repair, spent mostly sleeping. 30 hours tripping hard without food or sleep took something out of me. At least no kidney pain or skin yellowing, so maybe not too much damage after all. I could not tell her what I had done to myself, same goes for close friends family and acquaintances so I faked a burnout episode, which was entirely believable, since I did have a 60h per week high stress job.</p><p>Those two were, so far, the worst trips of my life. I don't regret them, especially the second one was very insightful, but I could've done without those experiences. After those incidents I was at a juncture: either quitting these types of experiments altogether or continuing them in spite of having felt what the slightest mistake or careless oversight can cause. I chose to continue, but I am compulsively sticking to a long list of safety measures designed to spare myself and my loved ones another episode of this kind.</p>",
 "year": "2010",
 "id": "91409",
 "gender": "Not Specified",
 "age": "30",
 "timestamp": "2011-06-11T07:00:00.000Z",
 "views": "19291",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "70 mg",
   "administration": "oral",
   "substance": "2C-P",
   "form": "(powder / crystals)"
  }
 }
}
