{
 "title": "A Blessed Chemical",
 "author": "Aaron",
 "citation": " Aaron. \"A Blessed Chemical: experience with Methoxetamine & Cannabis ('laced with LSD') (ID 91458)\". Erowid.org. Jul 1, 2011. erowid.org/exp/91458",
 "substance": "Methoxetamine & Cannabis ('laced with LSD')",
 "bodyweight": "138 lb",
 "report": "<p>Hey, my name is Aaron. I am 19 years old and have been doing MXE since its near release; I was a really big abuser of the product though. Although I had many more experiences than this, I felt this experience really summarized the beauty of MXE.</p><p>My friend Billy and I were bored over at my grandmothers house, maybe close to a year ago? Anyhow, I started to search legal Ketamine derivatives (a new found faith in internet after ordering 5-MeO-AMT from a great vendor). It took a very long time of page scrolling and searching for a legit vendor. Before too long we came to what had to be a scientific chemical vendor selling MXE. We read a short paragraph on the substance and ordered about a gram in good faith that it would be a great Special K experience. In about 5-6 days the chemical arrived at Billys house as planned, it arrived EXACTLY on 4/20 which was perfect.</p><p>The day started out with J looking for Phenazepam (a very, very strong Benzodiazepine-identical substance). After he bought a 1/10 of Phenazepam we told him about the new chemical we had purchased from the same vendor, 1 Gram of MXE. He looked skeptical but agreed to take a free 50mg dose (Wed already tried it once by this point and had a great MXE under wash feeling of the chemicals making us happy, eliminating depression and anxiety). Shortly after he was sitting on the floor talking and laughing with us about great times back in the day and what not but had to leave to go pick up his girl, it had been like three hours.</p><p>He returned shortly after with his wife and told her about the Phenazepam and MXE and how fucking sick they were. After she had taken a bump of both she bought a 1/10 of the MXE and invited us over to her house for 4/20. We all piled in a car and took off to Js house; I took a bump in the car off the crook of my thumb, probably about 30mg. The road was too complicated and annoying to look at so I just simply drifted into my thoughts until we got there. We arrived and took seats and lots of hits of weed. B and I got our bag of MXE and broke out two 100mg lines for us. About 10mn after insufflation of the MXE product I started to feel glowing and extremely euphoric. I found myself talking a shit ton to everyone there and having an amazing time nearly instantly. Then J put on some Pink Floyd because his wife wanted to hear Comfortably Numb. When then music was played it completely flipped our trip and turned it up as high as it could go. Looking around the room my visuals felt like I was on Shrooms, but my connection to music was almost EXACTLY like Acid. Every chord, note, sound, and noise had a place of its own and created such a psychoacoustic connection within me it literally felt like love inside of a noise.</p><p>About an hour in, B and I did another 50mg and reupped the trip. I had never felt more content than what I had felt sitting on that beanbag chair alongside what had turned to be my three best friends. Everyone was so happy and there seemed to be quite a big ego dropping in the room and everyone just mentally connected with each other, while in pure efficacy. We listened to some Dead until it froze and put Floyd back in. We than were given some Ganja Food, what we thought were weed brownies. About 20mn after eating them I told J they were laced with Acid and I wasnt surprised to find out I was correct. Everything from that point is pretty hindered by my outlook from the Acid, because I ate a shit load of those ganja brownies and ended up tripping until about 11pm on 4/21.</p><p>What was substantial to me though, was getting over a past event in my head through the MXE or the Acid, or maybe just a combination of the both. I had just taken MXE for the first time that day, and I had taken some cid about 4 days prior to that and had nothing like this. I had been utterly depressed over my ex-fiance walking out on our marriage for a good year, until that very moment I realized I could move on from her; that my love for her was so strong I could let her go, for her happiness. This was incredibly substantial for me, because I had been devastated and unhappy regularly, in other words, MXE and LSD changed my life for the better.</p><p>It had turned rather late (though it felt like we had been there for years) so I took a reup of 100mg and was given half of what was left of the powder to take home. I got a ride home from B and enjoyed both trips rather greatly, they connected in perfect harmony with each other. It was the first time Id ever enjoyed the mixture of a dissociative and tryptamine. I tripped for a day after that on LSD and when I came down I felt a great sense of haven taken the worlds best anti-depressant. These effects lasted probably a good 2-3 days and went back to normal life. Id also like to note I found myself semi-addicted to this beautiful dissociative. I was abusing it for its numbing analgesic properties. Being as I have a severe case of chronic pain, I often use psychoactive substances to numb the pain way. Nothing works better on Fibromyalgia than Special K, Acid, and Psilocybin; for the duration of the trip there is no conceivable pain for me. The comedown would just be so horrible going back to my horrible back, knee, shoulder, neck, and generally just widespread pain, so I would up my dose from 100mg, to 150mg, to 200mg, and began hitting M-Holes very hard. I blacked out for 5 hrs after taking a 500mg dose of MXE, after coming back to it was the comedown of my trip and felt like a complete waste of substance.</p><p>In my opinion, I feel MXE has a lot of medicinal properties that could be used and really appreciated by a lot of people. However, it also had great potential for abuse, the same as Special K. It completely numbs my widespread horrible bed locking chronic pain and makes me feel normal for once. It had amazing anti-depressant qualities as well. Withdrawal felt mostly psychological though I was insufflating a lot of powder. I bought 5 more grams from that point and probably did about a gram in 3 days. It got to be far too expensive and Im sure the post office was starting to get confused and suspicious. I felt I needed MXE for about a day and then got over it. I then waited 2 weeks and insufflated a little Special K. Overall, an incredible new chemical which wouldnt be surprising to see be thrown to waste by a Schedule from our beloved government. Its a shame too because this chemical has substantial medicinal properties. We all know the risk of using Adderall in the treatment of ADHD, but it truly WORKS. The same goes for Special K and ESPECIALLY MXE, in the treatment of Pain and Depression (Two of Americas number one biggest ailments) it truly does work.</p><p>'Reported Dose : \t300mg of Ketamine over time Insufflated, 700-800mcg of LSD-25, Oral Cannabis Smoked'\r[Erowid Note: This author conflates methoxetamine and ketamine.]</p>",
 "year": "2011",
 "id": "91458",
 "gender": "Male",
 "age": "19",
 "timestamp": "2011-07-01T07:00:00.000Z",
 "views": "7753",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": "",
   "administration": " ",
   "substance": "insufflated"
  },
  {
   "time": "Methoxetamine ",
   "amount": "",
   "administration": "",
   "substance": " "
  },
  {
   "time": "oral",
   "amount": "Cannabis",
   "administration": "(cookie / food)",
   "substance": ""
  },
  {
   "time": "0",
   "amount": "insufflated",
   "administration": "Methoxetamine ",
   "substance": ""
  }
 ]
}
