{
 "title": "Sexual Truth Serum",
 "author": "Redhotpickles",
 "citation": " Redhotpickles. \"Sexual Truth Serum: experience with Zolpidem (ID 91535)\". Erowid.org. Oct 11, 2011. erowid.org/exp/91535",
 "substance": "Zolpidem",
 "bodyweight": "165 lb",
 "report": "<p>I'm writing about two of my Zolpidem (Ambien) experiences mostly to get them off my chest, partly to show how dangerous this drug can be.</p><p>In February of 2011 I was first prescribed Ambien (10mg) for insomnia, as my psychiatrist had tried a few other meds and nothing seemed to be working. It worked wonderfully and put me right to bed. A few weeks later, a male friend was spending the night at my house because he didn't want to drive back to the university's campus. We had previously expressed sexual interest in one another but I knew nothing would happen because I had a boyfriend. When it was just about time to go to bed, I announced I was going to try snorting my Ambien to see what would happen. I had read that sometimes snorting Ambien could cause hallucinations, and at this point I had never taken acid or shrooms and wanted to experience hallucinating for the first time.</p><p>Everything past this point is blurry. I remember crushing it and snorting it, and repeating this somewhere between two and five times, but the factual events are questionable. I remember my friend swallowed at least one, and I think I convinced him to snort one. Either way, we were both completely out of it. He told me later I had been talking to a pair of my pants on the floor for at least ten minutes because I thought they were fish. I had also been talking about seeing an army of men in the room that had come to pleasure me, an elf, and an airplane.</p><p>I remember everything was moving and breathing and the Ambien had made me extremely aroused. My male friend, P, and I ended up having sex not just once or twice but many times. I remember we didn't use a condom except for one of the times and I'm pretty sure he ended up slipping it off. I don't remember much else, but we both woke up over fourteen hours later with no pants or underwear on. I don't know if I was so torn up about the fact I had cheated on my boyfriend or if the Ambien caused me to be emotional, but I sobbed for most of the morning and ended up breaking my mirror accidentally. Luckily I didn't get pregnant from having un-protected sex since I'm on the pill, but everyone having sex on Ambien should be careful to make sure they're safe.</p><p>My next experience happened only last night, June of 2011. I swallowed my 10mg pill as usual, but apparently didn't go to sleep. I ended up snorting two or three more Ambien and wandering outside to smoke a cigarette. I found one of the razors I use to chop up pills when I snort them (which had been hidden for months until then), and took it outside with me. I remember texting my friend (the same from the above story) and telling him that pain felt good. As I sat on the deck, which can easily be seen by several backyards and two streets in my subdivision, I cut myself several times on my thigh and ankle. I realized I probably shouldn't be doing this outside and sat in my living room on the floor and cut myself shallowly a few more times.</p><p>During this whole experience I vaguely remember talking to myself, but someone else was responding. It was as if the Ambien had brought out a second personality. When I responded to myself I even used a different voice. This other self was mischievous and was laughing throatily and decided that I wasn't cutting myself enough (I've never had problems with this, by the way, and I wasn't doing it because I was depressed, the Ambien just made it feel good for some reason and the other self liked playing with the blood) and I ended up making a big slash across the back of my hand. I don't remember anything else except running to the closet to get the first aid kit and trying to flush the contents of the bathroom garbage can down the toilet (which had several empty toilet paper rolls in it and clogged it).</p><p>I woke up this morning covered in blood everywhere, even on my face. I went to look in the mirror and discovered that after I had cut the back of my hand I had used the blood like paint and had finger-painted blood all over my body in different swirls and designs. I looked through my text history on my phone with my friend and had really scared him. I had asked him to wake up and come out and play and asked him what his deepest fantasies were and that there was a lot of blood. He stopped responding quickly, saying he was going to bed and he didn't want to hear anymore because it didn't sound like me.</p><p>I've also never been diagnosed with having multiple personalities, nor have I ever felt like I've had them when not on Ambien. I have no idea what caused such a horrible reaction this morning, but I've decided to give my Ambien to my friend for her to keep and only give me one pill a night so this doesn't happen again. I'm fine now and didn't lose as much blood as I thought.</p><p>I've had a few other weird experiences since being described it, but nothing like the above. I've texted people very personal things that I havent even told my boyfriend. That's why me and my friends call it the truth serum, it brings things out of you you'd never dream of telling otherwise. I've said embarrassing, mean, and just downright strange things while on it before. So just be careful.</p>",
 "year": "2010",
 "id": "91535",
 "gender": "Female",
 "age": "18",
 "timestamp": "2011-10-11T07:00:00.000Z",
 "views": "24198",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 }
}
