{
 "id": 9154,
 "title": "Ripped From Existence",
 "date": {
  "submission": "2007-10-15T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "RaULduKe357",
  "gender": "Male",
  "weight": "185 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 ",
   "administration": "oral",
   "substance": "Cannabis - Hash",
   "form": "(cookie / food)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "4 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  },
  {
   "time": "0",
   "amount": "20 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  }
 ],
 "report": [
  "<p>My brother and I decided to throw a party at our house one night.  Initially, it was just going to be the routine good music, grilled steaks, and beer, but one of my brothers friends came to the party with some hash brownies.  As Id never had one before, I bought one brownie.  However, the hash was not the subject about which I wanted to write.",
  "The party really got going when a friend of mine, Jake, brought me about an ounce of fresh picked mushrooms.  I was planning on simply enjoying the brownie and some beer, but after a while I began to come off the hash.  I hadnt had too much beer, and Id never had shrooms before.  So, I thought Id give them a try.  To start I ate four caps and went to my room to play my bass.  After a short period of time, my coordination began to become kind of screwy.  After about 20 minutes of playing my bass poorly, I gave up and went downstairs.  I noticed that I was having a mild difficulty walking.  I hung out with my brother for a little while, and it didnt take him long to figure out that I was on something.  I told him Id taken 4 caps, and he just laughed and said that I should take the rest of them.  I said that that would be ridiculous, and we sat down in our kitchen and talked with some friends.",
  "After a lot of talking, (it was hard to pay attention to what the conversation was about, as my mind became prone to wandering) we all came to the consensus that I should probably eat the other 20 or so caps for good measure.  I agreed because I was feeling quite agreeable at the time.  We decided to make tea with them, but my brother and I ended up getting impatient and throwing the mushrooms into a blender full of ice, water, and instant tea.  I poured the concoction into a huge cup and we all went outside to talk and have a smoke.  We sat outside until I finished my drink (the smoothie was god awful and I would never recommend it, it tasted like cold, chunky mud).  As soon as I set my drink down I began seeing things.  At first, it was only out of the corner of my eye, familiar patterns (I had taken acid twice before this) began to take shape and move across my driveway, then full on distortions of space.  The air seemed was completely tangible, and it shimmered with silky streamers gliding through the sky.",
  "This, to say the least, petrified me, as I was completely unaware at this point that I had taken the shrooms.  I began to panic as paranoia grabbed me by the lungs.  I suspected everyone.  I decided to be direct, and I asked what was happening.  My brother replied that I had eaten some mushrooms and that I was in for the long haul.  This relaxed me somewhat and I decided to go for a swim.  My house does not have a swimming pool.  I jumped off my patio and hit solid ground.  This went by unnoticed by me, thus I continued, to the amusement of most of the people at the party, to swim around in my lawn until I hit an ant mound.",
  "The trip changed on me all at once.  The old fear had returned wiping any mellow vibes I had achieved since I found out that I was on the shrooms.  I immediately forgot about the fact that my reality was no longer real.  To this day Im not sure how many ants were on me but I felt as though I was covered.  I ran inside and collapsed on the kitchen floor.  My brother came into the house and asked what was wrong, so I asked if I had ants on me and told him that I thought I had taken some mushrooms.  He looked at me and said I should come outside.  As I was exiting Jake came in and I asked him who he was.  He answered me, so I asked him where my mom was.  He said that she was out of town, so I told him I thought that Id taken some mushrooms.  He only looked at my brother oddly and kept walking. ",
  "When I got back outside I was now the center of attention.  The entertainment for the evening was watching me dig my nails into the edge of reason and hold on for dear life.  Id forgotten the horrid ants and was once again feeling well.  My whole world became a pattern of cubes, and I could see them moving through the air.  They were golden and seemed to control my movement with their own.  The trip reached a peak as my friend, Kenny, turned on some Primus.  Les Claypools thundering bass in Sgt. Baker filled me, and I leapt to my feet and began to dance.  I danced and danced until I hit my fence and fell.  The dancing had lifted my spirits, and I was ready to change my environment.",
  "The people still at the party retired upstairs to watch Resident Evil.  During the movie, two major things happened.  I started thinking that Kenny was one of my other friends, and I began to imagine that there had been no existence before that night.  I had been created and had been tripping on this drug since The Beginning.  The trip became a series of flashes, neon lit the room, purple, aqua and lime green.  I thought the world was at its end.  At this point, I blacked out, I was, according to Jake and Kenny, still awake but I only have about 30 seconds of actual memory from the hours of midnight until about 6 a.m. in which I was in the kitchen with Jake and Kenny.  I crept up behind Kenny as he was reaching to get some chips and kicked him the ass and then made fun of my friend, Thomas, still thinking that thats who Kenny was.",
  "When I came back into conscientiousness I was lying on my bed with my legs crossed and my arms outstretched as though I were Jesus on the cross.  Though I dont remember it that night, I have had that belief once before, while on three hits of acid.  As I looked around my room I saw that my bed was hovering.  Also items from my dresser began floating across the room.  All of a sudden my phone rang.  One by Metallica shattered the silence and terrified me.  I turned the phone off, but the song didnt stop playing.  This concerned me, so I jumped off my bed, a tremendously difficult feat, and went to my bathroom.  My pupils were so dilated that I couldnt tell what color my eyes were.  Things began to catch my eye.  Things like the stripes on my wallpaper leaving the wall, my mirror rippling like a lake of liquid silver, and my stomach and chest collapsing in upon themselves only to reemerge began to make me fear the end was close.  I had overdosed.  There was no doubt in my mind about it.  luckily I had not overdosed, I was just in an unstable state of mind and was frightened.",
  "I put on a movie and lay back down to rest, but sleep would not come.  Eventually, I got bored of the movie and went outside to watch the sunrise.  It was indescribable, more astounding than I can possibly hope to do justice to with simple words, but I will try.  Oranges and reds met each other and were constantly intermingling, the sun itself was a deep reddish orange, and it seemed to hold the sky intact.  I watched in amazement until the bug became too much of a problem and I had to go inside.",
  "I stepped back into my bedroom and lay on my bed until Jake and Kenny woke up.  I finally came off the shrooms at around 11:00 a.m., more than twelve hours after Id taken them.  I never got any sleep that entire day.",
  "Since then Ive taken shrooms on two occasions.  Both times, I took them in much smaller doses.  The first time I had a five or so hour long high gave me an incredible body high and some intense hallucinations.  I spent the majority of that trip dancing, but that time it was much more enjoyable as I still a sense of balance.  The other time, I had a decent body high for four hours and some minor hallucinations.  I took some ether after about three hours.</p>"
 ],
 "erowid": {
  "id": "55864",
  "citation": " RaULduKe357. \"Ripped From Existence: experience with Mushrooms, Cannabis (Hash) & Alcohol (Beer) (ID 55864)\". Erowid.org. Oct 15, 2007. erowid.org/exp/55864",
  "substance": "Mushrooms, Cannabis (Hash) & Alcohol (Beer)",
  "views": "4711"
 }
}
