{
 "title": "The Metocin",
 "author": "mindexplorer",
 "citation": " mindexplorer. \"The Metocin: experience with 4-HO-MET (ID 91567)\". Erowid.org. Jul 22, 2011. erowid.org/exp/91567",
 "substance": "4-HO-MET",
 "bodyweight": "135 lb",
 "report": "<p>Consumed: 18 mg 4-HO-MET</p><p>Preface:  ***Three weeks before this experience I had used 50 mg of phenethylamine psychedelics at a music festival. I noticed adverse, long-lasting physical side effects including frontal-headaches, wrist pain, and chest pain exactly where the heart is. The 4-HO-MET has healed me of all of these symptoms.</p><p>I have used shrooms about a dozen times. I typically have very powerful and unsettling reactions to shrooms, including nausea (I have thrown up before). However, I (try) not use them for recreation. I thought that 4-HO-MET might provide a better alternative, because people describe it as a milder yet more spiritual version of shrooms.</p><p>0:00  Swallowed a jell capsule that contained the 18 mg of 4-HO-MET. I had been fasting for about 8 hours.</p><p>0:20  Arrived at a tour office that gives tours of an underground cave, tall lookout tower, anti-gravity house, and wildlife park. I began to feel the effects. I felt a little giggly and the lighting looked much brighter</p><p>0:45  As I entered the cave, anxiety began to set in. We were with multiple families with small children, in a very small-enclosed space.</p><p>0:50  At this point, the drug was indistinguishable from shrooms. Nausea begins to set in. I felt very uncomfortable inside of the cave. My interaction with people was extremely limited. I allowed the group to go ahead of me and my brother (who was tripping with me). I began to notice that the rock-patterns would shift.</p><p>1:00  I began to question our safety as we went deeper into the cave. I also began to have adverse physical reactions to this drug, as my heart-rate and breathing felt strange. I was concerned that the metocin would exacerbate the physical symptoms I had noted earlier, which caused me to think about death. I began to have very negative, and sad thoughts about human mortality.</p><p>1:15  The hallucinations really begin to kick in. The cave walls look insane. Our tour guide takes us to a room, and asks if we have ever seen pure darkness? She turns off the lights. I begin to see the typical rainbow-fractals that looked really similar to what Ive seen on shrooms multiple times. +2</p><p>1:30  We ride a small elevator up to the top of a lookout tower. I feel much better in the open-space, but still feel nauseous</p><p>2:30  The drug is in full effect. It feels very similar to shrooms but a little different. I have very deep, and introspective thoughts regarding our existence. The hallucinations are interesting, I notice the figure 8 patterns, whatever that means. I cannot stop staring at my face. Everything is just really shifffttty. +3</p><p>3:00  I end up going to a park and swimming in a river, and staying there until the effects of the drug wore off. +2</p><p>Commentary:</p><p>This drug is extremely interesting, and I have noticed long-lasting positive benefits from its use. The differences between metocin and psilocin are like the differences between red and white wine. Do not use this compound thinking that itll just be an easy walk in the park. Take it very seriously, at least as seriously as you would when using shrooms. My reaction to metocin was no different than my previous reactions to shrooms, but I react to shrooms much differently than most.</p><p>I did not have a really profound experience, but I found this medicine to be more thought provoking and spiritual than shrooms. I do not plan on using any psychedelics for about 3 months. Metocin will be on my list as one of great psychedelics, and I would use it over shrooms any day.</p><p>When it comes to drug usage, I listen to Terences advise: If it feels really good and you want to use it a second time, it is not a drug worth bothering about. But if it shocks and rattles you to your core, then its worth investigating.</p><p>Metocin is not simply a feel-good drug. It can be an amazing tool for personal and spiritual growth. I do not believe it should ever be used for recreation. Take this very, very seriously.</p>",
 "year": "2011",
 "id": "91567",
 "gender": "Male",
 "age": "21",
 "timestamp": "2011-07-22T07:00:00.000Z",
 "views": "8033",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "18 mg",
   "administration": "oral",
   "substance": "4-HO-MET",
   "form": "(capsule)"
  }
 }
}
