{
 "title": "MDMA Acid Hangover",
 "author": "theyoungexplorer",
 "citation": " theyoungexplorer. \"MDMA Acid Hangover: experience with Cannabis (brownie) (ID 91608)\". Erowid.org. Sep 9, 2011. erowid.org/exp/91608",
 "substance": "Cannabis (brownie)",
 "bodyweight": "120 lb",
 "report": "<p>I had just come back from a week long backpacking trip in Yosemite with my boyfriend and we wanted to end the fantastic week with a bang so we got tickets to go see Shpongle at the Fillmore in SF. We just got a new hook on MDMA and Acid and were excited to try it out for the concert. We dosed the Acid at 5:00 and the MDMA [2 points] right before we got in the car to see the show (around 8:00). The moment we got onto the freeway the molly hit me. Now I had never taken two types of drugs before at the same time and I was ROLLING.</p><p>When we got to the Fillmore the second I entered the room I started dancing and would not stop. The concert was incredible and I couldn't have asked for a better experience.  The next day however, I was at my friends house chilling and smoking bowls and we made brownies (the illegal kind) and I ate a huge one. As soon as the brownie hit I began to feel remnants of the trip I had the night before. I told my friends that I was tripping and they equated it to something like a post trip trip. It soon got more and more intense. My vision wouldn't focus and tears kept streaming down my face. When I would try to relax and lean back into the couch and close my eyes I felt a strong dark force pulling me back. I was hyperventilating and couldn't catch my breath and was feeling sick to my stomach. I said I wanted to go outside so we went outside and it was a glorious summer day. The sky was the bluest it had ever been and I felt like I could see for miles. When we got back after the walk I felt this huge wave of nausea and promptly threw up the entire brownie along with any other food I had ingested that day. My boyfriend took my to his house and I threw up in his car on the way there and the second we got to his room I fell asleep.</p><p>This was the strangest, most unexpected trip I have ever had and I and curious why I had a hangover and my boyfriend didn't. I am still interested in trying psychedelics but I think ill hold off on molly for a while.</p>",
 "year": "2011",
 "id": "91608",
 "gender": "Female",
 "age": "17",
 "timestamp": "2011-09-09T07:00:00.000Z",
 "views": "3515",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "",
   "amount": "",
   "administration": "1 ",
   "substance": "oral"
  }
 ]
}
