{
 "id": 9169,
 "title": "Worthless for High, Priceless for Getting Off",
 "date": {
  "submission": "2007-10-16T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Gus Montana",
  "gender": "Male",
  "weight": "240 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "24 ml",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": "(daily)"
  }
 ],
 "report": [
  "After two years of consuming Oxycontin intranasally, my tolerance had increased to the extent that 120 mg was needed to merely ward off the onset of withdrawal, and feel 'normal' over any given 24 hour period.  On days when my supply was readily available, I required 240 milligrams in order to have a day (and evening) filled with the euphoria that I so greatly enjoyed at the beginning of my use. Needless to say, much of my time was spent just trying to acquire, and dose enough of the drug to remain stable, much less enjoy the ride.",
  "I found myself looking for alternatives and a way out. I was doing an excellent job of hiding my habit, until my supply chain experienced a short backlog. I spiraled into a withdrawal episode that blew my cover in front of friends, co-workers, and most of the world. Without going into details, suffice it to say that being cold-busted in this manner required that I move from simply 'looking' for alternatives, to actually taking some sort of action.",
  "Believing that meeting-up with a bunch of other junkies at a Methadone clinic each day would be counterproductive, I decided that I would use Percocet as a means to taper. Unfortunately, this was a rediculous idea, as the amount of Percocet required to keep me satisfied was on the order of >20 x 5 mg (Oxycodone)/525 mg (Acetominiphen) tablets per day. Percocet is not a viable alternative for because of the immense amounts of Acetominiphen (Tylenol) that come along with it. Liver damage can begin at that level. After several months of using Percocet at these high levels, my doctor ordered a liver panel assay. Amazingly, I hadn't killed my liver, yet. However, the warning signs were on the horizon.",
  "There is a great deal of research available on the Internet regarding Suboxone, so I won't go into all of the details here, except to say that the opioid in Suboxone (Buprenorpine) is a 'partial-agonist', meaning that it is not very effective at turning on receptors that make you feel high. On top of that, it is spiked with Naloxone, a drug that is further designed to keep one from obtaining a euphoric experience.  Suboxone does an excellent job of maintaining the drug-dependent brain with the goo it needs to keep from going into a fit. On the other hand, it does not supply what you need to get high. It is indeed a miracle-drug for anyone who wants to get off opioids.",
  "I found a Suboxone licensed doctor, and prepared myself for paying about $400 for a month's supply. Patients must start Suboxone while in withdrawal. If a drug-dependent user takes Suboxone while high on any other opioid, the Suboxone will knock-off the user's drug of choice from the receptors that drug is currently occupying, and send the user into what is termed 'Precipitated Withdrawal': a full blown, knockdown, episode of complete withdrawal within a short period of time, reported to be within minutes of administration.",
  "I began my treatment well within the grips of withdrawal the day following my initial visit with the doctor (sweat, rapid heartbeat, runny nose, watery eyes, and an overwhelming sense of dread and fear). Remarkably, within 60 minutes of the first sublingual administration, the withdrawals disappeared. The protocol for Suboxone treatment calls for gently pushing up the patient's dosage on day-one until withdrawal symptoms subside completely. I walked out of the office in the afternoon on day-one with my dose set at 24 mg, once daily, sublingually.",
  "I have been on the treatment now for 11 months, and I have reduced the dosage down to a mere 4 milligrams and I am looking forward to the day when I can jump off entirely. It has been amazing. From the first day I started taking Suboxone, I have felt 'normal', whatever that might mean. I haven't used any other opioids at all (that's on purpose.  I just can't go back to where I was, ever again).",
  "For those looking for a way to gently pry the monkey off their back, Suboxone is excellent. What I find interesting though, are reports of non-dependent persons using the drug to get high, and I must say that I am perplexed.  I have never, ever felt any of the euphoric high that I felt when I was using Oxy or Percs."
 ],
 "erowid": {
  "id": "55944",
  "citation": " Gus Montana. \"Worthless for High, Priceless for Getting Off: experience with Buprenorphine with Naloxone (ID 55944)\". Erowid.org. Oct 16, 2007. erowid.org/exp/55944",
  "substance": "Buprenorphine with Naloxone",
  "views": "40972"
 }
}
