{
 "title": "Turn on the OUCH",
 "author": "Cannaman",
 "citation": " Cannaman. \"Turn on the OUCH: experience with Products - 'Molly's Plant Food' (ID 91727)\". Erowid.org. Aug 8, 2011. erowid.org/exp/91727",
 "substance": "Products - 'Molly's Plant Food'",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "Products - Bath Salts, Plant Food, etc"
  ]
 ],
 "footer": [
  [
   "2011",
   "91727",
   "Male",
   "",
   "29",
   "Aug 8, 2011",
   "6107",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: 'Bath salts', 'plant food' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.]  </p><p>I'll keep it short and to the point.  This shit [MOLLYS Turn on the Xperience Plant food] is deadly.</p><p>(5:30pm Wed) Girlfriend and I each took 1 capsule (even though the head shop recommended we take two each!!!).</p><p>(5:45pm Wed) I'm feeling tingly and happy.  Could be placebo, as these were taken orally.  I stand against a wall, feel it's cold hardness and start wishing it was furry.  Tell wife and girlfriend, they try to hand me a sheep skin, oh so soft, but not vertical.  I couldn't lay down.</p><p>(6:00pm Wed) Girlfriend starts puking.  I'm feeling somewhat erotic.  Wife and I go for a quick bit of fun.  No sex for me, just some play for her.  I wasn't horny at all.</p><p>(6:15pm Wed) As she climaxes, I get a sudden and horrid headache in the back of my head.  I've had this headache once or twice before directly after sex, but never after NO sex.</p><p>(6:30pm Wed) Finally getting the pain to go away from my head, but my stomach gives way and I begin vomiting as well. Girlfriend is still puking non-stop.</p><p>(6:30pm - 12am Wed) We both puke every 15-20 minutes for this time period.  Most of it is spent trying to put water down for the next puking session.  Bile never comes up, dry heaving ensues.  Feels like death.</p><p>(12am Thurs - 12am Fri) No sleep, no chance for sleep.  We both beg for the ability to nap, but it isn't there.  The entire day is spent begging for mercy from the feeling of having been poisoned.</p><p>The rest of the weekend was the same.  It is now a week later.  I have visited my doctor and diagnosed with constricted veins and high BP.  Feel like my chest and head are exploding, and my body feels weak and tingly.  This is an entire week later.  I've never felt this way before.</p><p>Not sure what chemicals were in this.  Still have 2 capsules available, and would submit for analysis to interested parties.  Mainly, I am holding on to them in case something gets worse for either of us.</p><p>-Still feeling like shit 7 days later</p>"
}
