{
 "title": "Mild Stimulation Horrible Comedown",
 "author": "Hypernova",
 "citation": " Hypernova. \"Mild Stimulation Horrible Comedown: experience with MDAI (ID 91721)\". Erowid.org. Jun 30, 2011. erowid.org/exp/91721",
 "substance": "MDAI",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "insufflated",
   "MDAI",
   "(powder / crystals)",
   " T+ 0:30",
   " ",
   "insufflated",
   "MDAI",
   "(powder / crystals)",
   " T+ 1:15",
   " ",
   "insufflated",
   "MDAI",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>In terms of my background, I am a fairly experienced user of psychoactives, particularly the MDXX compounds. I smoke marijuana occasionally, drink most weeks and take MDMA once a month or so, depending on my cash flow situation.</p><p>As it happened in the month of this experience I was a bit short so my usual dealer offered me a gram of a new research chemical he had obtained called MDAI. Having used (and enjoyed) MDMA, MDA, MDE, Methylone and Mephedrone in the past I assumed this chemical would be fairly similar and after a quick glance online I purchased said gram to split between my two friends (B and E) and I.</p><p>We arrived at Bs house and started drinking, but only a few beers and not with the intention of getting drunk. Around an hour or so in we decided to get out the MD.</p><p>The first thing I noticed was the smell and stickiness of it, much more in common with Mephedrone than and of the other MDXX compounds I had previously tried. B is a fairly experienced user of psychoactives but E was a total novice so we gave her a small line (around 50mg) and took two 100mg lines for ourselves. Up our nostrils they went, it did burn quite a bit but nothing I wasnt prepared for.</p><p>Within a minute or two I felt something happen, but I couldnt quite put my finger on it. Like a come-up, but not at the same time. After 10 minutes this gradually faded and after another 20 of no visible effect we all decided to re-dose.</p><p>I took another 125mg line (eyeballed though so it could have been more/less) and so did B. E took 100mg this time. A few minutes later and I felt a mild mental stimulation, coupled with mild dizziness, impulsiveness and a slight mental confusion almost like being a bit drunk.</p><p>Both B and E also reported this. I was distinctly annoyed by the lack of euphoria, it was as though I could feel it building and then suddenly it would peter out into nothing. The mild mental stimulation seemed to loosen our inhibitions slightly and we began to discuss deep personal issues, although the conversation did not flow at all like it does when both participants are on MDMA.</p><p>After another 45 minutes or so of this rather mild high we felt ourselves coming down slightly and decided on one more redose.</p><p>B and I both did about 150mg insufflated and E did a smaller one, which finished up the gram more or less. We let E gum the remaining powder in the wrap since she seemed to be coping ok with the experience and had taken significantly less than us thus far.</p><p>Again re-dosing only seemed to bring me up to the point where I felt I was on the verge of something good and then drop me straight back down again. It was at this time we all began to notice temperature fluctuations, going from very hot and sweaty to chills in the space of about 10 minutes. This freaked E out a bit but we simply got her some water and stuck on some music to distract her. Music sounded completely normal to me, nothing special at all.</p><p>After another 40 minutes or so I really felt like re-dosing again even though I knew that I hadnt really experienced anything great previously. It was as if I was trying to convince myself that I had not yet done enough to experience it properly, but the rational part of my mind knew this was not the case. I would say this craving feeling was pretty strong, almost on a level with that of Mephedrone which is notorious for compulsive re-dosing.</p><p>About 4 am we decided to call it a night and sleep but the combination of the continuing stimulation and temperature fluctuations kept us all awake until dawn came. I said my goodbyes and left E and B to themselves and headed home without much of a comedown and feeling generally underwhelmed with the whole experience.</p><p>I got in and slept for an hour and woke up with one of the worst comedowns I have ever had. Body cramps, headaches, nausea and clammy sticky skin. I also found that, like Mephedrone, the sickly sweet smell of this drug seemed to permeate my skin and clothes making me feel even more nauseous at points. This remained even after my first shower and I took another to get rid of it. (Note that when I take MDMA I will do around half a gram in a night, if not more, and I never get comedowns like this one, it was terrible.)</p><p>The general feeling of malaise lasted all day and all night, woke up the following morning feeling fine but I have absolutely no urge to do this drug again. Did not make me feel particularly good on it and the comedown was by far the worst I have ever had, on any substance. Not nice.</p>",
 "year": "2011",
 "id": "91721",
 "gender": "Male",
 "age": "18",
 "timestamp": "2011-06-30T07:00:00.000Z",
 "views": "6254"
}
