{
 "title": "Heavy Toll for Feeling the Ocean Breeze",
 "author": "A and B",
 "citation": " A and B. \"Heavy Toll for Feeling the Ocean Breeze: experience with Ecstasy (ID 9173)\". Erowid.org. Sep 12, 2001. erowid.org/exp/9173",
 "substance": "Ecstasy",
 "bodyweight": "135 lb",
 "report": "<p>My boyfriend and I decided to take some on a vacation we took.  He has experimented with other drugs such as cocaine, mushrooms and pot.  I have only experinced pot before this.  We decided to stay in the hotel room and keep some candy around just in case.  We got these pills from 'friends' who were users of these certain kinds.</p><p>          I cannot recall the amount of hours or time it took to go through all of this....my bf says we ate a whole red one with a dolphin....waited about two hours...both experienced a very warm to hot flash feeling...not too much more for me, but for him..he began to feel more of the upside...so then I suggested since I wasn't feeling anything close to him that we should half the last of what we had...which was a blue i think round pill...not sure what kind or emblem.....then about (in my mind) seeminly two seconds later i was 'rolling' .....and he seemed to have the same effects.  We did bond more than ever and opened up alot and was able to let alot of things that were bothering us go.  We agreed on so many things ....like mentioned I felt like I wanted to kiss and hug everyone around me...so I did...him...we were very glad to have been alone together for this first time experience together.  I got extremely horny and loving and was dripping wet...so i invited him to the bed for a session...which was the closest and most intense love we have ever made....then out of the blue we both were just happy and laughing and just quit...no hard feelings ..just felt like relaxing on the porch and feeling the ocean breeze.  It was all wonderful.</p><p> THen....he began to come down before me...he said he felt really down...just worn out and tired and kinda annoyed at everything...but still was cool enough to wait with me beside me till i was coming down.  He said I was tweeking and geeking...my jaws did experince a sort of lock jaw...so he gave me a capri-sun straw to chew on that we were drinking from...that helped alot...oh yeah..the first pill made me crave to suck on a piece of candy but not for long...the straw seemed to help more than anything.  My bf was watching to make sure I didn't bite my lips or cheeks or anything...which was good!...he was sure the next day taht my  mouth would hurt like hell...but it didn't ...I think I was still 'high' the next day...weird feeling but we both felt closer and more bonded.  We did in fact smoke a whole joint when we both started to come down to help us relax and try to go to sleep.</p><p>  Ends up I was so restless I had to sleep on the couch ..we both woke up the next day with sticky stuff alllll over our faces and bodies...in various places...i guess just sweating or something...we couldn't figure it out..but we fired another one up when we woke up and took hot showers and seemed to feel  just fine...we wondered what fatigue everyone was talking about.</p><p>   Then!!!! The day after our experience we layed out in the sun all day...ate nothing...drank nothng but beer ...baad choice..and then got ready to go out and eat...needless to say as soon as we sat down i passed out..i guess from exhaustion..and then told my bf to get me out of there quick...he wanted to wait till i got somthing to drink...but after a sip..i was rushed outside were i dry heaved and spit up all that i had in me...I felt horrible</p><p>Now we are back from vacation and it has been 5 days since we took both pills and we both have experienced jaw pain that comes and goes...and some irritability...but in my case as opposed to my bf...is a little more severe...I have been in bed non stop straight...severe crying spells over werid stuff like someone is in my body controling me and telling me bad things.....have barely eaten until today and started my period way too early...i also feel like I have to flu....If this has anything to do with the after effects of X....then I am not looking forward to it again....we may in the future do this again......but not anytime soon!! I can see how it gets you hooked so fast though...you want more to get that high back bc it's like none other...you feel wonderful...just unexplainable...but my side effects are the worst....and I am just glad they seem to be nearing an end now....hopefully. Neither of us were on any meds just some allergy med the day before for sinuses.....thats it....Thats's the truth about mixing different kinds of X...granted we knew where we got them from I don't know if it was such a good idea to mix the first time... needless to say we got a few pics of how huge our pupils got!! i do hope they turn out good... anyways... the only thing good besides the feelings was the urge not to want to smoke a cigarette. i hope you think twice before you do it and take alot of time off afterwards to recoup!!!!</p>",
 "year": "2001",
 "id": "9173",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-09-12T07:00:00.000Z",
 "views": "9746",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
