{
 "title": "Comparable to Methamphetamine",
 "author": "kemical kevmac",
 "citation": " kemical kevmac. \"Comparable to Methamphetamine: experience with Products - Bath Salts, Plant Food, etc. (ID 91757)\". Erowid.org. Aug 30, 2011. erowid.org/exp/91757",
 "substance": "Products - Bath Salts, Plant Food, etc.",
 "bodyweight": "250 lb",
 "header": [
  "DOSE: T+ 0:00",
  "100 mg",
  "insufflated",
  "Products - Bath Salts, Plant Food, etc",
  " T+ 0:00",
  "100 mg",
  "insufflated",
  "Products - Bath Salts, Plant Food, etc",
  " T+ 4:00",
  "50 mg",
  "insufflated",
  "Products - Bath Salts, Plant Food, etc"
 ],
 "report": "<p>[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.] </p><p>I just recently discovered research chemicals, I started making my own K2 with AM-2201. While I was at the local head shop buying some flavoring drops for my synthetic pot I saw some so-called charlie sheen novelty powder I bought 1g for 40$. When I got home I did a giant line about 100mg.</p><p>10 min pass and I feel like I just did some real good coke</p><p>After 30 min pass I got a amphetamine like euphoria which only lasts for about 20 min and turns into paranoia almost psychosis like</p><p>1 hour after ingesting 100mg I'm getting the urge to re-dose.</p><p>8:00 I do another 100mg line</p><p>11:00 After about 3 hours pass I convince myself to go to bed, I'm wanting to do another 100mg line but hold off and try to get some sleep. I do about a 50mg line before going to lie down.</p><p>12:30 As I'm laying still in bed I start to get the meth bugs. I couldn't believe how powerful this stuff is. I lay in bed for the next 8 hours unable to fall asleep, listening to my heartbeat race at 140 beats per min</p><p>Tomorrow rolls around, I didn't get none but 2 hours of sleep. I  am going to dispose of this devilish drug its probably one of the most unpleasant stimulants I've ever come across.</p><p>I will never touch this drug again as I find it to be extremely addictive, just almost comparable to methamphetamine or cocaine</p><p>STAY AWAY FROM THE BATHSALTS</p>",
 "year": "2011",
 "id": "91757",
 "gender": "Male",
 "age": "21",
 "timestamp": "2011-08-30T07:00:00.000Z",
 "views": "5125",
 "dose": {}
}
