{
 "id": 9179,
 "title": "Nystagmus and Dysphoria",
 "date": {
  "submission": "2006-09-15T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "enquirewithin",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "oral",
   "substance": "MBDB"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "mg",
    "quantity": "150"
   },
   "administration": "oral",
   "substance": "MBDB"
  }
 ],
 "report": [
  "I was recently able to try this material for the first time. In my opinion, if you are looking for an ecstasy alternative dont waste your time and money on this.",
  "I took 200mg initially orally (on an empty stomach). After about 10 or 15 minutes, I was coming up. After half an hour I felt waves of well-being washing over me, but no real euphoria. There were no visual enhancements. At the one hour point I decided on a booster of 150 mg, because I didnt feel satisfied.",
  "Ten minutes later a friend came round, unexpectedly, and started telling about a suicide case, which put me in a negative frame of mind. I had to asked him to leave, eventually. He said that I looked like I had had five shots of whisky. By the time my friend left, my mood had turned and I think the booster was too much. I started getting pronounced nystagmus, which was wearing. My mood became dysphoric. I can only describe my feelings as being like the negative mental after effects of speed or too much MDMA. After an hour or so (by which time I wished that I had spent my time and money on something else), I had a brief spell of feeling good, with MDMA type enthusiasms, but mixed with a rather drunken-type feeling. I almost fell asleep and had some CEVs or brain movies, probably the most enjoyable part of the experience.",
  "After three hours, most of the effects were gone, to my relief.  After four hours I was baseline and able to sleep. The next day I had an irritating hangover and was very stiff (my neck ached). In many respects, this material is more like alcohol than MDMA.",
  "The web has a few positive (if not all very enthusiastic) reports about MBDB. Perhaps think the key to an enjoyable experience is to keep the dose lower and to avoid a booster. I am, however, in no hurry to repeat this experience."
 ],
 "erowid": {
  "id": "56006",
  "citation": " enquirewithin. \"Nystagmus and Dysphoria: experience with MBDB (ID 56006)\". Erowid.org. Sep 15, 2006. erowid.org/exp/56006",
  "substance": "MBDB",
  "views": "11022"
 }
}
