{
 "id": 9185,
 "title": "6-Hour Trip of Body Load and Nausea",
 "date": {
  "submission": "2002-01-18T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "The Dreamer",
  "gender": "Male",
  "weight": 136
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(seeds)"
  }
 ],
 "report": [
  "I recently got a pound of Syrian Rue in the mail. I researched it and was facinated by its apparent ability to potentiate other drugs. I started out by smoking some of the seeds. I got a very mild euphoria from it, which I can't swear wasn't a placebo, and then ah but the fateful time that I decided to ingest the Rue extract.",
  "A friend had told me that nausea was a serious problem with Rue, but having done the reasearch, it seemed like nausea occured in less than half of the experiences. I was confident that I would have no nausea. I was wrong.",
  "The extract was made by mixing lots of lemon juice concentrate with ground Rue seeds and then boiling the mix for around twelve min. The mix was then filtered and cooled. What I then had was a very bad smelling, dark brown-red, half cup of liquid. I threw some sugar into the mix and this had no effect, but the taste wasn't that bad, though the smell was BAD.",
  "Probably about 35 min after ingestion I started feeling high. At one point I thought 'Who needs X!'. I felt good. I had lots of energy, music sounded good, and I had a body buzz that was reminicent of good, quality weed. The high kept accelerating and then the nausea started. I vomited multiple times and was profoundly nauseous for 6 hours. I was quite high for three of these hours.",
  "I hate when people abuse drugs and then blame their problems on the drug, so I will point out at least two of my errors. I didn't fast as I had read to do on the net. I completely ignored this and the fact may have been one cause of my nausea. Also, when I looked at the extract, my intuition told me that it was strong and that the whole half cup would be too much. I went ahead and took the whole half cup, regardless of my premonition.",
  "I think that the correct dosage of the Rue might have been wonderful. It is hard for me to think of doing it again because I was so sick. But the afterglow of the drug was divine. After the nausea passed I was 5 by 5 and was quite happy. Also even through the nausea I could experience some of the wonderful psychedelic effects of the drug. I had real closed eye visuals, where I saw a flashes of images and even one that I could i.d. as a girl standing on the beach. I have never had a real CEV before. Even on shrooms all I had was patterning, not true CEV images. The night of this daytime experiment was a full moon and I spent lots of time outside contemplating and praying to the Goddess, with more tranquility and better meditation than usual, definitely an effect of the harmine.",
  "I got some good intuition and psyche work done in the afterglow as well, and the next day, today, is a nice blissful calm-though this is probably more me than the Rue.",
  "I would say if I could hit the right dose of Rue that would give me the positives with no nausea, that Rue would be a great drug. I definitely learned from my Rue experience and wouldn't change it for anything, but I definitely am not dying to have another six hour trip of body high strongly colored with nausea!"
 ],
 "erowid": {
  "id": "5603",
  "citation": " The Dreamer. \"6-Hour Trip of Body Load and Nausea: experience with P. harmala (Syrian Rue) (ID 5603)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5603",
  "substance": "P. harmala (Syrian Rue)",
  "views": "12443"
 }
}
