{
 "title": "Seizure on Combination",
 "author": "Thomas P.",
 "citation": " Thomas P.. \"Seizure on Combination: experience with LSD & MDMA ('Molly') (ID 91918)\". Erowid.org. Jul 31, 2011. erowid.org/exp/91918",
 "substance": "LSD & MDMA ('Molly')",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "sublingual",
   "LSD",
   "(blotter / tab)",
   " T+ 1:00",
   "200 mg",
   "insufflated",
   "MDMA",
   "(powder / crystals)",
   " T+ 9:30",
   "100 mg",
   "insufflated",
   "MDMA",
   "(powder / crystals)",
   " T+ 11:30",
   "200 mg",
   "insufflated",
   "MDMA",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>This was a crazy ass experience I want to discuss, but first I want everyone to know my past experience with LSD and Molly</p><p>I've been using LSD for over 4 years now. Usually tripping once or twice every other month or so. I'd say I have tripped over 30 times and probably ingested around a total of 50-60 hits of LSD throughout my life. Usually I take just 1 or 2 hits at a time. The most I've ever taken at once is 4. LSD is my favorite drug besides marijuana. I usually have really good trips and much control over myself while on the drug. I've never had a problem what so ever on LSD, mentally or physically.</p><p>The first time I did 'Molly' was about 2 years ago. First time I did it, I just did 1 tenth and hardly felt its effects. Over the next 2 years I did it maybe 4 or 5 times. I never really cared for the drug because I would hardly feel its effects from only 1 or 2 tenths. Now recently in the past 2 months I've been going pretty hard on the Molly (my best friend sells it, he hooks me up with cheap prices and free lines). So I have been doing molly almost every weekend and sometime during the week. Usually dosing myself with around 0.4 - 0.8 grams. Also I've been mixing the drug with 2C-B and alcohol a few times. I always have snorted the drug too.</p><p>Now for the actual story I wanna talk about. A little over a week ago my friends and I got together at my buddies apartment to trip off LSD and roll off sum Molly for the 4th of July fireworks. I ate 2 hits of acid around 7:30 p.m. After about an hour of coming up on the acid, I traded my friend 1 hit of LSD for 2 tenths of Molly. I snorted all the Molly right there. Now before I snorted the Molly, I was coming up on acid quite easily and calmly, it was enjoyable. But when I snorted the Molly the drugs effects made me feel very uneasy, hot, and uncomfortable. I literally had to sit on the couch for an hour and drink gatorade as the drugs drip went down my throat and my body settled down.</p><p>Once I felt reasonable I walked to the park with my friends. We watched the fire works, had a great time tripping and seeing everyone. I was what they call 'Candy flipping' and I had some really cool visuals from the acid. After that, we walked back to my friends for the after party of course. By this time the 'roll' effect had worn off from the Molly and I was feeling the peak of the LSD. I had a great night tripping with my friends and smoking weed and just chillin.</p><p>Around 5 a.m I was coming down from the acid. My friend then gave me a free line of Molly (around 1 tenth). It picked me up a little bit, for I felt a little speedy and somewhat euphoric. Then about 2 hours later I purchased and snorted 2 more tenths of Molly from him. I felt pretty good and was keeping myself decently hydrated with water. Around 9:30 a.m I decided to finally drive home. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] I've pretty much come down completely from the acid and molly so I said good bye to my friends and got in my car to leave.</p><p>this is where all hell breaks loose</p><p>I started driving home. After only about 1 or 2 minutes  of driving I turn on this back road to go towards my house. Then after like 30 seconds of driving on this road I start to feel fuckin strange. All of a sudden my whole frame of vision started to fuck up drastically, I felt like I was peaking off acid but stronger then I have ever felt in my entire life. I quickly turned left down this alley to be safer off the road. Once I turned down the alley I felt like I was in a full blown heavy fuckin acid trip. I shit you not, I was hearing voices in my head and everything around me was just so tripped out. After I turned into this alley and started hearing shit in my head the last thing I remember was my arms and head starting to violently twitch.</p><p>After this I completely lost train of thought. When I woke up my car was crashed into a telephone pole. There were EMTs, Cops, and a shit load of people all around me when I woke up. I didn't know what the hell was going on, I have never had a seizure before so at first I was very confused. The EMT's told me I had to be taken to the emergency room so I just went along with it. They put me on a stretcher and took me to the hospital. While i was there I got blood tested, piss tested, and cat scans on my brain. The only drug they detected in my body was marijuana.</p><p>I had a good feeling acid was not gonna show up. I have always heard most drug tests do not detect it because its such a small amount so its nearly impossible to show up. Plus I kept my fuckin cool at the hospital, cuz the last thing I wanted them to know was the fact that I was on drugs.</p><p>Now about the drug Molly. I live in a small town in Ohio, about an hour outside of Columbus and Molly is becoming quite the popular drug around here. Almost everyone I know and hang out with are convinced that Molly is pure MDMA which I have come to realize is total BULLSHIT. Now I could be wrong, I am no scientist or drug expert but I don't believe Molly around here is pure MDMA. I don't even think it has MDMA or even MDA in it. I've read that this drug is usually made in a bathtub, sink, or even toilet and includes products such as baking soda, caffeine, lactose, and calcium phosphate and its cut with chemicals and over the counter drugs such as TFMpp, BZP, Procaine, Mathylone, Lidocaine, mCPP and many more to mention.</p><p>For those of you who skimmed through the whole story this is basically what happened</p><p>7:30 p.m. dropped 2 hits of LSD</p><p>8:30 p.m. snorted 2 tenths of Molly</p><p>5:00 a.m. snorted 1 tenth of Molly</p><p>7:00 a.m. snorted 2 tenths of Molly</p><p>9:30 a.m. had a seizure and wrecked my car</p><p>So a total of 2 hits of acid and half a gram of Molly. I am 19 years old. I weigh about 135-140 pounds. I have never had a seizure in my life so what I wanna know is</p><p>Was it the acid?</p><p>Was it the molly?</p><p>Was it the combination?</p><p>Do you think my past 2 months of basically abusing Molly had a big part to do with it?</p><p>I know that it was definitely the drugs that over-heated my brain to cause the seizure but I truly think it would of never happened if I didn't do Molly that night and especially for the last 2 months. I am going to do LSD by itself sometime this week and see what happens. It is the same blotter that I ate last week too. If I don't geek out again then I am convinced that Molly is fully responsible for my seizure and near death experience.</p>",
 "year": "2011",
 "id": "91918",
 "gender": "Male",
 "age": "19",
 "timestamp": "2011-07-31T07:00:00.000Z",
 "views": "16184"
}
