{
 "id": 9197,
 "title": "Doctor's Orders",
 "date": {
  "submission": "2008-02-18T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Bella",
  "gender": "Female",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "DXM"
  },
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Ephedrine"
  },
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "inhaled",
   "substance": "Pharms - Albuterol"
  }
 ],
 "report": [
  "I went to the doctor for some chest discomfort and they sent me home with many drugs. I happened to leave out that I've been using ephedrine as a little 'pick-me-up' for school this semester...because I know the adverse response. It did occur to me that it could be bad to mix the ephedrine with DXM and Albuterol, seeing how the effects are somewhat bipolar. Here's what happened:",
  "About twenty minutes after taking it, everything got very bright. The effects intensified over the next hour or so. I had to go to my Entrepreneurship class...bad idea. The trip was fun, but I wouldn't recommend it for an upper-division college class. Maybe a G.E. to get through the boredom, but this is a class I need to focus in. The whole way there, I felt like I was flying. My entire body felt light. Once I got to class, I couldn't focus at all. I kept bouncing my leg and playing with things. I could tell my fellow classmates were getting annoyed.",
  "The problem was that I didn't want to get up and leave. I felt completely relaxed, yet jittery. It was like my body was numb, but my my mind needed to keep everything moving. The vibrations from my leg bouncing relaxed me even more. I knew I should've left, but didn't.",
  "Half way through the two-hour class, I came down. I had a fairly bad headache and was STARVING but I didn't have the energy to eat. After class I went back to my dorm and passed out. That's pretty much it. I will most likely try this again for recreation when I don't have classes to go to. It was a great feeling."
 ],
 "erowid": {
  "id": "56089",
  "citation": " Bella. \"Doctor's Orders: experience with DXM, Ephedrine & Albuterol (ID 56089)\". Erowid.org. Feb 18, 2008. erowid.org/exp/56089",
  "substance": "DXM, Ephedrine & Albuterol",
  "views": "10631"
 }
}
