{
 "title": "Look Through the Layers to Beauty",
 "author": "Loopy",
 "citation": " Loopy. \"Look Through the Layers to Beauty: experience with 25C-NBOMe & Nitrous Oxide (ID 91983)\". Erowid.org. Jul 20, 2011. erowid.org/exp/91983",
 "substance": "25C-NBOMe & Nitrous Oxide",
 "bodyweight": "160 lb",
 "report": "<p>My first experience with this substance was impressive even at what must be considered a lower dose. In a few words - visual, beautiful, alien clarity.</p><p>My familiarity with drugs is limited - plenty of alcohol, occasionally weed or MDMA, nitrous oxide, recently methoxetamine and salvia (limited effect), never hallucinogens - so perhaps my experience was heigtened by my inexperience; but the overall impact stands. There was definitely clearness of mind throughout, though strange thought patterns, but toward the end I was unsure what was real and what was not.</p><p>T = 0:00; 7pm</p><p>I decided to go for a walk, alone, during the come up, so held the blotter (mild bitter taste) under my tongue for about 20 minutes without swallowing saliva as I went exploring. I found a dilapidated Victorian graveyard next to the common and wondered through this, waiting to feel effects. Certain people I encountered as I wondered through here and the common featured later in the trip in a kind of thought loop.</p><p>T +1:00</p><p>An hour after leaving the house I was sitting by a lake watching the ripples on the water, very aware of the geometrical patterns they were making. The ground also started morphing, and I felt an intense euphoria. Someone behind me is playing Chinese-style music on a recorder. There were people around and I decided to walk home, a manic grin on my face, in case this became too much of a challenge later. I couldn't look at people without laughing.</p><p>T +2:00</p><p>Back home now, listening to trippy music. The next few hours were a repetition of venturing into the garden to stare at the sky, then retreating back to the cosiest room in the house, drinking various herbal teas, and occasionally narrating the experience on my computer. I find myself making slight changes to my routine so as to distinguish one repetition from another. I wrote this:</p><p>'strong euphoria, cannot stop laughing, everything morphing. Fractal and prismatic vision in the sky, layers to everything, colour decomposition.</p><p>Typing is hard. The sounds of music are amazing, pulsing through, encroaching on vision, the feeling of the beats... its like satisfying exactly what you wish the beats to be and do.'</p><p>T +3:00</p><p>'Still going hard. Don't know what has happened the last few hours, or rather what happened and what didn't. Losing myself and vision in the keyboard as I type. Very visual, if I let attention linger for a moment on something visually morphing and self-similarity and the most beautiful colours in the world. And layers, always looking into another layer, and getting so lost in the visuals I only remember to breathe so so late.</p><p>I'm not going in the kitchen right now as the wall is breathing really loudly and I don't want to wake it up.'</p><p>I had a nitrous balloon around now, which kicked me to another level.</p><p>'Amazing. Lasted an eternity, and on the 'come back' vision and noise morphed and flashed and I felt like there was a person who had been walking the entire trip with me and my whole life and at that point - rushing back down - we merged. Or I realised that was me. Or something.' (the person I 'merged' with looked like a guy I saw on the common earlier)</p><p>T +5:10, 12:10 midnight</p><p>'Definite time dilation, keep getting lost in images. Euphoria definitely gone, in fact partly absent from everything but the first 2 hours, though loads of... amazement at the world, and at the inner patterns in even very simple objects. Sometimes things are warped into faces or something, sometimes grotesque, but not fearful - more curious. Keep getting massive de-ja-vu, how much of tonight is happening, how much of things before were this?</p><p>Thinking... maybe the logical end of this is the beginning... maybe I need to head back to the common.'</p><p>I walked to the common, a bit freaked out at leaving the cosiest room in the house; it's very dark, and I'm a bit fearful of running into anyone, especially on the common at night in this state. The silhouettes of the trees seem to be pondering, watching me, not malicious, but entirely alien. The visuals are dying down, but reappear if I let myself get lost in an image. I reach the pond where I was initially coming up, and reflect for a while; then head home. The person I noticed on the common at the start, and during the nitrous balloon, is on the other side of the lake, watching me.</p><p>T +6:30</p><p>'Returned, feeling pretty normal, pupils still huge (as all night), mild pain in lower left of abdomen. Everything felt in a loop; there are loops everywhere, in images and in the immediate world, and in time, one event feeding into and bearing similarity to another. Heading back to the park, where I was coming up, was strange, exposing, other people seemed alien; but the right thing to do. Someone, somewhere, is beginning their version just as here and now my version draws to a close.'</p><p>I go to bed. It takes maybe an hour to sleep, and I wake up the next day with no hangover or anything.</p><p>So, an interesting experience even on a lower dose, always quite rooted in reality, but a visually augmented reality. Sounds also mildly altered, and some synaethesia, but everything very focussed on the visual aspects. Strong initial euphoria. Mental clarity and motor abilities always there (could type, make tea, walk to the common), though lose track of what is real or not, especially after the balloon. I have heard and suspect that this combines well with other substances, though quite magical for me alone. Interacting with others would have been possible most of the time, though I definitely did not desire to do so.</p><p>Will be doing this again.</p>",
 "year": "2011",
 "id": "91983",
 "gender": "Male",
 "age": "23",
 "timestamp": "2011-07-20T07:00:00.000Z",
 "views": "5938",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "2C-C-NBOMe",
   "form": "(blotter / tab)"
  },
  {
   "time": "",
   "amount": "1 hit",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ]
}
