{
 "title": "Two Experiments",
 "author": "John Smith",
 "citation": " John Smith. \"Two Experiments: experience with Products - Bath Salts, Plant Food, etc. (ID 91991)\". Erowid.org. Aug 30, 2011. erowid.org/exp/91991",
 "substance": "Products - Bath Salts, Plant Food, etc.",
 "bodyweight": "162 lb",
 "report": "<p>[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.] </p><p>I decided to try bath salts after finding out that it is an easy-to-obtain substance with neurotransmitter effects including dopamine release and/or reuptake inhibition. I have previously used multiple substances by various routes of administration and most appreciate classic and tweaked CNS stimulants.</p><p>I went to a 'smoke shop' this friday and asked about bath salts and was given two options: the 'more potent and stronger' one for $30 for 250 mg or $100/gram and the other one for $20/250 mg.</p><p>I first got the more potent one given in a small plastic vial with 'pure bath salts' and 'may be dangerous if ingested' marked on the packaging.  I flipped open the top and saw an off-white powder that smelled a lot like crushed up methylphenidate. I snorted the tip of a small key's worth and noticed quickly a strong burn and  bitterish drip and an opening up of my nasal passageways eventually. I ended up doing about a 1/4 of the packaging before noticing anything. First noticed a 'mental clearing' that allows me to feel more awake, very similar to when ingesting the right amount of amphetamine salts (300 mg or so). This quickly simmered down which is different from amphetamine in that the amphetamine buzz continues to build from there. Over the next few hours I finished off the rest and noticed mostly a mild sexually charged feeling and minimal euphoria; however, I did have the same desire to compulsively re-dose totally like methamphetamine, but again without any of the extremely reinforcing properties of amphetamine or meth.</p><p>The next time I got the cheaper one and firstly noticed that the smell was nowhere close to ritalin however the drip led to a mild anesthetic effect but nothing like that of cocaine. The feeling was nothing like the previous 'stronger one' either. I eventually ended up doing nearly all of it, until I decided that eating the rest might be in my best interest. And this is where things got really interesting. Within 30 minutes or so, I got the beginning of an MDMA feeling with a sense of losing control of my direction in space a little bit and a sort of floating type of feeling. This was immediately followed by a euphoric sort of MDMA feeling without any sexually charge.  The feeling was as intense in fact as methamphetamine but different. Euphoric but not exactly my cup of tea, lasting 4-6 hours. Didn't sleep either night but no depressant effects on withdrawal like other CNS stimulants.</p>",
 "year": "2011",
 "id": "91991",
 "gender": "Male",
 "age": "36",
 "timestamp": "2011-08-30T07:00:00.000Z",
 "views": "5207",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Products - Bath Salts, Plant Food, etc",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Products - Bath Salts, Plant Food, etc",
   "form": "(powder / crystals)"
  }
 }
}
