{
 "title": "Language?  Monday?  Deju Vu?  What?",
 "author": "firsttimer",
 "citation": " firsttimer. \"Language?  Monday?  Deju Vu?  What?: experience with Mushrooms (ID 9199)\". Erowid.org. Dec 23, 2003. erowid.org/exp/9199",
 "substance": "Mushrooms",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "oral",
   "Mushrooms",
   " T+ 0:45",
   " ",
   "oral",
   "Mushrooms"
  ]
 ],
 "report": "<p>I've tripped pretty hard on 5-MeO-DiPT (foxy), Salvia, and I have experience with MDMA.  Mushrooms should have been no problem...</p><p>We ate a meal, then downed the mushrooms.  Two big ones for me, Three for C (who weighs more).  45 minutes later, no effect, so I down one more (for a total of 3.5 grams).</p><p>Suddenly I got a quick, powerful rush of 'NO!!!!!'  I went to the bathroom, stuck my fingers down my throat, got a small gag reflex, but I could not throw up.  My stomach was feeling very sick, and I was cold and shaking.  The feeling felt worse than the terrible 'speed-like, nauseous, cold, icky, numb' Foxy come-up, and that caught me completely by surprise.  My legs felt tense and I tried to relax.  I retreated downstairs to the privacy of a couch and bright light to try to sort out what was going on.  My body felt terrible and I was aware of my breathing, and felt like I needed to take large, deep breaths to stay alive.</p><p>As I lay on the couch in nausea, but not being able to vomit, I had no doubt in my mind that I was going to die, or go permanently insane.  I kept telling myself 'nobody died from eating three big mushrooms', but my body kept telling me otherwise.  I wanted to call my girlfriend to tell her that I was sorry for dying so soon, but I still had this notion that it would be a bad idea.  Then seconds later, the concept of a phone, using technology, or even talking coherently completely left me, and animalistic panic continued to wash over me.  I could do nothing but accept my death, try to experience each terrible moment as it was.</p><p>At this point, time slowed down.  I was writhing around on the couch, feeling very ill, and I would go into the kitchen every '45 minutes or so' to check on the time.  Only two minutes had passed.  I couldn't remember how to figure out the time difference of when I should start coming down.  I couldn't think, only be.  I felt miserable, because of the intense nausea and feeling of 'not okayness', the shakes, the breathing issues, the loss of feeling in my body and the loss of being able to find my pulse (numb hands, then suddenly, 'are these mine? what is this?  WHAT?').  As I lay on the couch, my ego dissolved.  I had no idea who I was.  I tried listening to the noise (TV) upstairs and it just kept laughing and making strange sounds.  Somewhere in the back of my mind, I remembered that there was language, and that perhaps I (whoever/whatever I was) was supposed to be able to understand it.  But I could not.  I got visuals - patterns moved all about the ceiling, but they came from a point of complete insanity, so nothing really seemed special or even remotely 'cool' about them.  I also had intense feelings of Deja vu during the first few hours of this trip (when I could understand the television or I tried interacting with C).</p><p>C came and talked to me when I was pretty flipped-out, and I could start to understand a little bit.  He was tripping pretty hard and having a great time with it.  Mostly I just said, 'What?', but slowly I began to remember 'other people' and 'communication' and 'rules'.  The first thing I remembered is that there was 'time' and things changed.  It was Monday.  With that thought came my first wave of happiness. The trip changed when C returned upstairs.  I had come to grips with my death and loss of all reality quite a while back.  But now I started remembering things... it was MONDAY.  Such happiness!  Suddenly, I didn't feel sick anymore.  I understood everything, and C's cat was watching over me.  I was so grateful that his cat had watched over me the whole time, and I went over to it and petted it, my hand melting into its fur with each touch. </p><p>As the world slowly reconstructed, I could see each piece of it.  I could understand all the social rules as they each returned to me, and I was able to see how crazy some of them are and become more aware of inter-personal interractions.  I understood my environment in a way I had never quite understood experiencially before.  After basking in a god-like euphoria for what seemed like hours, I crept upstairs to join C and his sober family-member guest.  TV was an experience, now that I could understand language again.  The Deja-vu was still there, but now I writhed around on the floor in pleasure, melting into the walls and carpet, in pure bliss.  The conversation mostly consisted of... 'Cool'.. and 'wow, there's whales' and.. 'wow, upside-down is better'.  C went into a fit of way-extreme laughter by crashing headfirst into some beanbag chairs, as I continued to melt and feel like everything was a revelation.</p><p>I understood the whole concept of life and death, the whole cycle, the whole terrible and glorious play of life and existence.  I enjoyed talking to myself, I enjoyed writhing about, I enjoyed seeing the world through a human's eyes for the first time again... I enjoyed just about everything.</p><p>I feel like I had to go through death to gain a deeper understanding of life.  Mushrooms provided me that doorway.  I can see how an experience this traumatic could have caused Post-Traumatic-Stress-Disorder, etc.  But what I got out of it is an indescribable and irreplacable experience.  I wouldn't have had it any other way.</p><p>...but, if I trip again on mushrooms, the dose will definitely be a little lower!</p><p>Another note, I had dilated pupils, but felt completely with-it 6 hours after ingestion.  I drove home with no problems, drank tons of juice, went to bed with no problems.  Everything looked 'new and shiny', but besides that, there were very few after-effects... less 'mind issues' than tripping hard on Foxy.  Besides the trauma of the event itself, I'd say that the recovery time was the shortest out of MDMA and Foxy... even Salvia.  Surprising given the intensity of the trip.</p>",
 "year": "2001",
 "id": "9199",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-12-23T08:00:00.000Z",
 "views": "8921"
}
