{
 "id": 920,
 "title": "Laughter Awaits",
 "date": {
  "submission": "2003-04-23T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "PornO",
  "gender": "Male",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "cig."
   },
   "administration": "smoked",
   "substance": "Tobacco",
   "specific": "Cigarettes"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "It had been a beautiful friday afternoon. Me and my friend K were planning to purchase some dried Cubenesis mushrooms for $50 an eighth (quite costly if you ask me). Me and K planned to take half of the bag each, which would be approximately 2 grams each. We had arrived at our lady friend's house and purchased our bag. We were both very excited to do shrooms, K was more excited because he had been studying about them for a while but didn't have the chance to try them out.",
  "Preparation Methods:",
  "Since I love the taste of shrooms, I decided to chew on them so they would kick in faster, then I followed that by some orange juice. Quite a tasty combination if you ask me and the acidity in the orange juice would help to kick them in much faster than usual.",
  "K smelled his share of the bag and exclaimed that they smelled putrid. So he decided to make a peanut butter sandwich and layed the shrooms right in between the two buns. He took about 5-10 minutes to thoroughly chew them up.",
  "The Voyage:",
  "Me, K, and another kid A all decided to meet up with a good friend, M. So we went walking threw the park and neither me nor K had felt anything yet. We then met up with M and S, we smoked a cig and me and K decided to go to my good friend D's house to toke up some buds.",
  "It had been about 25 minutes from initial consumption of the shrooms and halfway to D's house I noticed a strange feeling in my body. I felt really giddy and it felt as if my eyes were watering (always happens to me on shrooms). K had a potentially big smile on his face also since I hadn't mentioned what he would feel like during the trip, I would have more fun watching him find out for himself.I  stopped and started laughing and staring at the sky, but K insisted that we make it to D's soon. So we were almost there! Untill I forgot that we would have to take a short trip threw the forest.",
  "Me and K had a blast walking threw this mud field and we both agreed that we were lost. Though it is technically hard to get lost on a sunny day in a tiny forest that stretched one block. Finally we had made it to D's, I had such a passion to get a tissue to wipe my nose that it was unbelievable. D answered his front door and told us our pupils were huge and we had strange smiles on our face, almost as if we were going to kill someone. This amused me greatly and I ran up to his living room to grab some tissues. So I did and I stopped by his dad's room to talk about what I was on (his dad is 45 and smokes bud and does a bunch of other shit, me and him get along really well and are planning to do some Ayahuasca soon).",
  "I had a really hard time trying to walk straight. I've always had trouble walking on shrooms since I tend to make strange wave movements with my body as I move, as if a strong wind was pushing my upper body and another strong wind was pulling my lower body. At this point of the trip, time seemed worthless and was going by quite fast. I also loved to trip at D's because I would have a wonderful time just hanging out with his dog, my first shroom experience at D's house was amazing since I had a conversation with his dog.",
  "After all this which seemed like it took an hour to go through, was only actually about 10 minutes or so. Then I went back downstairs where D and 3 other friends were token up some ganja. We smoked quite a big portion of his half ounce. While we were smoking, several impressive hallucinations began. One very cool thing that I saw was when I stared off at 2 soda cans that suddenly started to swirl together in green and white colors. I then shut my eyes, to my surprise my CEVs (Closed Eye Visuals) were just big pictures of color and brightness. I then opened my eyes and the color flowed all throughout D's garage. I always notice that in order for me to induce hallucinations on a low dose mushroom trip, I have to stare at something and then it will begin to dance and turn colors.",
  "One thing that annoys me the most on mushroom trips are is that I get so damn confusing sometimes that I can't remember what I was just talking about or where I was the whole day.",
  "After some more interesting color patterns and dancing objects, me and K decided to go to our friend's house where we heard some other friends would be. The journey there was very VERY long, but actually only took us 15 minutes. On the way there we decided to jump the fence in the woods instead of going all the way around and maybe getting lost. It was impossible for me to jump this gigantic thing, but I finally made it.",
  "As soon as we made it to J's house, we had been 4 hours into our trip and when we first entered J's house everything was so hilarious and my body was getting many rushes of euphoria. Slightly after that my trip was over and I was kind of sad but happy with what I experienced. K was still trippin when I stopped but then we just talked about mushrooms as being the best thing K has ever tried.",
  "Overall this experience was amazing for only 2 grams of dried P. Cubensis but it proved most rewarding since it kicked in so fast, I suggest to drink orange juice with your shrooms to reduce nausea and to get them started quicker. Shrooms absolutely had no hangover and the next day colors seemed brighter and I was full of joy."
 ],
 "erowid": {
  "id": "12625",
  "citation": " PornO. \"Laughter Awaits: experience with Mushrooms - P. cubensis (ID 12625)\". Erowid.org. Apr 23, 2003. erowid.org/exp/12625",
  "substance": "Mushrooms - P. cubensis",
  "views": "6972"
 }
}
