{
 "id": 9213,
 "title": "Floating with Attitude",
 "date": {
  "submission": "2008-05-04T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Wraith",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I've experimented with many benzodiazapines in my time. But Clonazepam (Klonopin) I would have to say is the longest lasting of all of them.",
  "At approximatly 7:30 am I swallow a .5 mg Klonopin on my way to class. It doesn't take long to start feeling the effects and by about 7:50 am I am already feeling myself 'Come up' on the drug. I can feel a tingling sensation on my head and I have no worry in the world. By about 8:15 pm I can already feel myself peaking off of the drug. I feel slightly euphoric, and all of my movements are over-exaggerated, alot like valium or xanax.",
  "During this time I am in my chemistry class taking a test. Suprisingly I am able to focus on it and finish it but I feel rediculously fucked up and still able to enjoy the feeling of the drug. My speech wasn't slurring but I felt like I was almost to that point. My teacher calls on me to ask me a question, and when I look up it feels like the world just flipped upside-down. I would have fallen out of my chair if I wasn't holding onto the table, but miraculously I answer her question and there was no suspicion of my intoxication.",
  "I go through the rest of the day like this, with only a few people noticing me acting a little different. The drug itself was very pleasing, it felt like the effects of a skeletal muscle-relaxant mixed with an opiate like hydrocodone. It lasted all the way up until I went to sleep at around 11 pm. The only downside to this drug that I see is that it is very hard to recall what happened during the time I was on the drug due to amnesia being a common side effect.",
  "Minor effects of the drug still felt the next day. I wish I could tell more but it's very hazy."
 ],
 "erowid": {
  "id": "56156",
  "citation": " Wraith. \"Floating with Attitude: experience with Clonazepam (ID 56156)\". Erowid.org. May 4, 2008. erowid.org/exp/56156",
  "substance": "Clonazepam",
  "views": "48602"
 }
}
