{
 "id": 9215,
 "title": "Joy and Dancing in the Woods",
 "date": {
  "submission": "2009-10-11T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nobody",
  "gender": "Male",
  "weight": 63
 },
 "dose": [
  {
   "time": "0",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0:45",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:00",
   "amount": "2 ml",
   "administration": "oral",
   "substance": "GBL",
   "form": "(liquid)"
  },
  {
   "time": "3:00",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": "3:00",
   "amount": "2 ml",
   "administration": "oral",
   "substance": "GBL",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I apologise in advance that this report is not as detailed as I'd like it to be as the event took place several weeks ago and I have been without an internet connection though I have tried to remember as much as possible.",
  "A few weeks ago I came back from my summer job and rang up my friend 'A', we got talking and he mentioned how he had tried GHB at a festival and told me how much fun it was 'like all the fun parts of getting drunk and none of the bad'. He also mentioned that a close friend of ours 'B' had organised a small rave for friends in some woods in north London so we decided to go and I was promised some free GBL (GBL being legal and a close relative of GBH).",
  "On the day I met up with 'A' picked up a 1/2g wrap of MDMA which was according to A very good though he hadnt yet tried it himself. We met up with some more friends and eventually made it to the woods. By midnight when we arrived the rig should have been going for an hour but was only just starting, it was cold and I new only a few of the people there and was beginning to regret coming. After about half an hour of talking to random people I decided to drop some of the MDMA and eyed out 1/4 of the wrap (125mg) and swallowed it before washing it down with water. Now is where I forget most of the detail. It took me an hour to come up (on a very full stomach) and I had a few tokes on a spliff to help me along. I dropped some more 45 minutes after the first dose (leaving 2/3 of the wrap) and this was plenty to get me flying.",
  "The MDMA was good, the music was fantastic and it made it so much better. I danced for an hour and then went and talked to people round the fires that had sprung up. The woods lit up by the flames of the fires looked incredibly beutiful and the fact I kept bumping into people made this experience magical. I danced some more and as I was peaking I decided to get the GBL off A. 2 pippete fulls into a some water and down it went. It is the most rancid thing I have ever tasted. The GBL kicked in almost imediatly, it was fantastic. It pushed, no, fired the MDMA higher. The feeling was incredible and although the euphoria was amazing it was clear, I was in control of myself which I never could have been if I'd only taken MDMA to get to that state.",
  "The MDMA started to recede so I reached into my pocket and low and behold I had lost my wrap, I continued dancing anyway as I was still buzzing. After a while I went back to 'A' and got another 1/2 gram, before going and snorting a line with someone who I had made friends with at the rave. I came up so I did another line and went back to 'A' for some more GBL. Again it kicked it, again it pushed me higher, higher then before and I had a conversation with someone that later turned out wasnt even at the rave. I woke up next to a fire and it appeared I had fallen asleep for 10-20 minutes and yet it wasnt a bad thing. I felt refreshed and rejuivinated and continued to party till the early hours doing more MDMA until the cold of the morning kicked in and I decided to go home.",
  "This combination was fantastic and I cannot recommend it enough, in fact due to the fact the GBL is so easy to obtain I doubt Ill ever want to do MDMA without it."
 ],
 "erowid": {
  "id": "56162",
  "citation": " Nobody. \"Joy and Dancing in the Woods: experience with MDMA (Ecstasy), GBL & Cannabis (ID 56162)\". Erowid.org. Oct 11, 2009. erowid.org/exp/56162",
  "substance": "MDMA (Ecstasy), GBL & Cannabis",
  "views": "3998"
 }
}
