{
 "title": "Rational Analysis and Insight",
 "author": "EAM and CM",
 "citation": " EAM and CM. \"Rational Analysis and Insight: experience with Escaline (ID 92170)\". Erowid.org. Aug 15, 2011. erowid.org/exp/92170",
 "substance": "Escaline",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "Escaline",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>[This report originally appeared as a typewritten page pasted into Book 3, page 365 of the Shulgin Lab Books.]</p><p></p><p>Experiment: Escaline, 40 mg for EAM and 60 mg for CM</p><p>7/4/80</p><p>Procedure: The materials were ingested at 12:30 PM two hours after a light breakfast. The temperature outdoors was about 75 degrees (Far.) and about the same indoors. First indications of change came about 40 minutes later. They built up slowly for the next 20 minutes and then more rapidly until the highest point at around 2:30 and remained at that level until around 8:30 when the level gradually descended for the next six hours.</p><p>Results: This is a powerful and complex intoxicant. Throughout the six hours when the effects were at their peak, neither subject could have driven a car, nor coordinated many movements which required more than rudimentary abilities. For example, walking and tying show laces, both of which were tried were uncomfortably difficult to execute. Therefore, by the rough scale were accustomed to using, EAM judged herself to be a 2 and CM judges himself to be a 3. The difference in dosage might account for this difference; EAM felt she could have driven in necessary.</p><p>Rather unexpectedly, the affect of both subject was rather cool, unexhilarated, and quite cognitive in orientation. They found themselves discussing problems which might arise between them which were purely conjectural rather than factual. In fact, their relationship had been very warm, close and passionate, but it wouldn't have seemed so from the contents of their talk during the experiment. Since their sexual appetites for each other were unimpeded, they tried love making. But here, the analgesia and the incoordination which came with this substance rendered their efforts mostly in vain.</p><p>There was also for both subjects a persistent and medium amount of queasiness which did not fade away until the experiment was near its close. Also, EAM started a menstrual-like flow of light nature and CM experienced an unusual tightness of the gonads which withdrew into the abdominal cavity to a marked extent.</p><p>Despite these negative factors, the quality of rational analysis and insight was really impressive. Many subtle factors in the lives of each subject was looked at with excellent insight and dissected with profit for both people. Neither one was defensive or even argumentative despite the nature of the discussion. Both however, felt the detachment of affect and the coldly impersonal inward tone that seemed to go with this substance. At about 10 PM, both subjects ate a light supper with good appetite, and went to bed at around 11. Sleep was restless and unsatisfactory until around 4AM, when both slept until 9AM. There was some fatigue the next day but it is hard to say whether that was from lack of sleep or from the psychoactive efforts that went with Escaline.</p>",
 "year": "1980",
 "id": "92170",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-08-15T07:00:00.000Z",
 "views": "8211",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Escaline",
   "form": "(powder / crystals)"
  }
 ]
}
