{
 "title": "Delayed Response",
 "author": "Murple",
 "citation": " Murple. \"Delayed Response: experience with MDMA, Roast Beef, & Mashed Potatoes (ID 9219)\". Erowid.org. Sep 3, 2001. erowid.org/exp/9219",
 "substance": "MDMA, Roast Beef, & Mashed Potatoes",
 "bodyweight": "170 lb",
 "report": "<p>As a general rule, when I plan on taking any psychedelic drugs, I fast the whole day beforehand. Taking the drugs on an empty stomach has numerous advantages. I've found that having an empty stomach gives you a clearer state of mind during the experience. It also reduces or eliminates the risk of nausea for those drugs where this is a problem. It also, it seems, plays a big role in how long it takes for a drug to get into your bloodstream.</p><p>It was the night of the harvest moon, on the weekend immediately following my birthday. The past couple months had been very eventful and significant in my life. It was a prime opportunity to take some MDMA and reflect, and I planned this several days in advance. Unfortunately, when the day of the harvest moon arrived, I was roped into going to eat dinner with my family. So much for fasting...</p><p>I got to my parent's house at around 7PM, and we ate soon after. At dinner, they served roast beef, mashed potatoes, macaroni and cheese, and a salad... all pretty heavy fare. I ate as little as I could without being rude, but it was still a pretty filling meal. I dont generally eat beef at home, so perhaps my system isn't used to processing it anymore. After dinner, I went home and took a short nap, hoping that this would help me digest the meal faster.</p><p>At 11:30PM I spread my ritual awayu cloth out on the floor and sat down on it. After a short meditation, I took a gelcap containing 130mg of good quality MDMA crystals. I waited. 12:30 came around, and all I felt was a mild amphetamine stimulation. What the fuck? 1AM came and no change... I began to wonder what the problem was. The MDMA was known to be good. I hadn't taken any related drugs in about 2 months, so tolerance wasn't the problem. I began trying breathing excersizes to try to bring on the effects. I drank lots of grape juice and water to make sure it was going through my system OK. I got rather confused by the fact that nothing much was happening.</p><p>Finally, at around 1:20AM, nearly two hours since taking the MDMA, the effects began to kick in. I put 'The Magical Sounds of Banco de Gaia' (the best MDMA music ever recorded) in my CD player, sat down on my awayu cloth, and began breathwork. The trip was quite enjoyable and productive, and was worth the wait.</p><p>It seems that taking MDMA after eating heavy food can dramatically delay absorption of the drug. MDMA normally takes 45 minutes to an hour to kick in, for me... this time it was nearly 2 hours. The effects of the drug seemed to be perhaps slightly reduced as well, probably due to the slower absorption rate. I will certainly avoid taking MDMA on a full stomach in the future.</p>",
 "year": "2001",
 "id": "9219",
 "gender": "Male",
 "timestamp": "2001-09-03T07:00:00.000Z",
 "views": "13369",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "130 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  }
 }
}
