{
 "title": "The Change is Clear in My Mind",
 "author": "Smith",
 "citation": " Smith. \"The Change is Clear in My Mind: experience with 2C-I (ID 9220)\". Erowid.org. Sep 3, 2001. erowid.org/exp/9220",
 "substance": "2C-I",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>T+00- ingest 25mg of 2ci dissolved in water</p><p>T+30min-taking off, very speedy, slight stomach upset, some anxiety</p><p>T+1hr-well into it, room much brighter, still disoriented from the quick flight, walking quite a bit.</p><p>T+1hr30min-getting my bearings, anxiety lightening up, room very bright, closed eye visuals</p><p>T+2hr-feel the plateau, feel very smart but I'm enjoying the physical so much I don't indulge in too much thought. Grinning and rubbing things.</p><p>T+2hr20min-just as Phormer mentioned, there seems to be quite a seratonin release.</p><p>I'm so happy. I sit on my deck and look out at the highway and the small hills. The trees look like fat gnomes (they're about 300 yds. away); they sway, almost bow towards me, some in unison some alternately. Birds leave their tracks across the sky. The cars herk and jerk, pushing each other (I realize they are teenagers cruising and feel great sympathy for their plight), then I feel condescending and start walking and rubbing again. I have never felt this good before on 2ct7 or 2 or mushrooms, and only a few times on acid. And I think, 'how easy it was to get here.' Very little price to pay, so what's the catch? I'm horny as heck but put off calling my girlfriend, besides, how could she possibly understand where I</p><p>am and it would probably bring me down to explain myself. Yes, this is great alone. In fact there are quite a few things worse than being alone.</p><p>Oneness creeps over me as I again look outside from my deck, but I feel too good for it to be the sort of spirituality found with lsd or mushrooms. I just let it all BE for a few minutes.</p><p>T+3:30min-a life changing thought about my past occurs and I have the means to act on it right now. I do fearlessly. Fuck it, let the dominoes fall. It occurs to me I might be changed forever because of this, or is it just the drug?-we'll see. Confronting this particular problem this fearlessly is change enough for me.</p><p>T+4hr 30min-OK that was the experience I've been looking for from these research drugs, now what? Looks as if I'll soon be leveling off. The night is beautiful, quite a few fireworks. The colors are much better than I anticipated.</p><p>T+5hr30min-that's it, coasting down now. Breathless, what an experience. Hope I hang on to the changes, but either way, I'm coming back here in a few weeks.</p><p>T+12hr-finally some sleep, about 2hrs worth. The coming down always makes me doubt the experience, except this time there's no guilt about just having fun. I was wide open to the search; I found bliss and a huge answer; a hangover is a small price to pay.</p><p>T+36hrs.-the change is clear in my mind. Strange, it's almost as if it had never been a problem even though it had plagued me for 20 years. The past problem and the confrontation during the 2CI both seem like dreams, and now I'm here typing this. I have so many unhealthy behavioral responses hooked up to the problem that now seems gone-wonder what will happen to them? Of course I'll still que on them, but will I eventually discard them or simply hook them to something else?</p><p>What is it about this drug that makes one write on and on to the point of being tiresome and pedantic. Look at the other reports on Erowid and here, and I swore I wouldn't take off on a tangent. If we could learn how to be brief and concise on 2CI, we'd have something to say. Sensual while taking it, smart after it, sometimes lifechanging, beats the hell out of the rest of the research drugs.</p>",
 "year": "2001",
 "id": "9220",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-09-03T07:00:00.000Z",
 "views": "7883",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ]
}
