{
 "id": 9225,
 "title": "Too Fun",
 "date": {
  "submission": "2009-08-26T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "gliDer",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ],
 "report": [
  "I have been a regular user of marijuana for about a year.  I had really wanted to try shrooms for a while.  Well, luckily, a friend of mine (Sam) got a hold of some and gave me call.  Without thinking about it, I jumped at the opportunity.   However, on the way over to his place, I began to feel a little apprehensive.  When I arrived at the apt, I saw the two baggies sitting on his table in his living room.  After much contemplation, I decided that I was willing to experience whatever it was that the shrooms might hold in store for me that afternoon",
  "We sat on the couch and watched a little football.  At about 5:00 pm, we grabbed the chocolate syrup, covered the little white devils, and each of us consumed an entire eighth.  I wasnt sure if this was a lot as I have never tripped before but I was excited to see what might become of it.  We had a sober trip setter named Jamie who had been around people tripping before and was cool with it. ",
  "T  35min",
  "I start to fill a little drunk as we sit and talk, watching more TV.  I get up to get a beer and notice that the hallway leading to the kitchen just isnt quite right.  It kinda seemed to be twisting very slowlyHowever, this went away as soon as I gained my composure.  I made my way into the kitchen and looked down at the tile pattern.  The black tiles, against the white ones, began to sink into the kitchen floor.  It was pretty freaking cool.  I thought to myself that this was gonna kinda be like a heavy weed dose.  I go back and sit down and ask my friend if I was trippin yet.  He replied, Dude, youll know when youre tripping.  So I waited.",
  "T  1hr.",
  "By this point, I have a mean body high.  I take my eyes off the TV for a minute and look at the ceiling.  As I take on a slightly scary thousand mile stare, the ceiling began to move.  I was tripping now.  I noticed that the popcorn ceiling (which looks *amazing*) began to swim in circles, forming some sort of weird oriental like pattern.  I stared at this for about 30 min.",
  "T  1hr. 30min.",
  "Jamie exclaims, Hey, lets go to the driving range!!!  I agree, for some reason, and hoped into his car and went.  When I got into his fairly small compact car, it seemed like I was sitting in a full sized suburban, my depth perception was ruined.  On the way, everything was perfect.  All the colors from the cars, the crape myrtle trees, the sky blended into this perfect trailing mosaic.  If you have ever seen What Dream May Come with Robin Williams and hes walking around with Cuba Gooding Jr., it was kinda like that, like a melting pastel drawing.  I also watched the sunset on the way there.  This was incredible.",
  "T  1hr. 45 min",
  "We get to driving range and I suddenly realize that everyone else in the Pro Shop/Range wasnt tripping.  This worried me a little but I went into the shop.  I head someone talking.  I looked up and it was the Driving Range owner.  I could see his lips moving but heard nothing but echoes.  It then suddenly hit me, I thought to myself, Dude, hes probably talking to you and you cannot understand him.  You probably look like a moron/ Go outside now  So I went outside.  I sat on the wooden deck and watched the people swing their clubs. It was awesome.  The clubs moved in slow motion and everything around them, the trees, bushes, grass, golf carts (!!) began warping into a rainbow color background.  Too much I thought to myself.  I let Sam and Jamie swing away but I had to go sit in Jamies car until they were done swinging because I just couldnt function enough to be out there. ",
  "T2 hr. - 3 hr.",
  "So, for about an hour (alone), I sat and stared at the interior of Jamies car.  It was a very introspective and colorful experience.  The other two finally show up.  Me and Sam are still tripping pretty good as we make our way back into town.",
  "T  4hr.  6 hr.",
  "The walls are still swimming when we get back home.  As I gradually came, I felt more connected with other peoplesomething I cant explain.  We just sat around and chilled, didnt even turn on the TV or anything.  Eventually, I made my way to Wendys and then went to sleep.",
  "All in all I really enjoyed the experience (except the deeply introspective nightmare that may have occurred in Jamie's car, exploring who knows where).  Would I do it again?  Absolutely."
 ],
 "erowid": {
  "id": "56204",
  "citation": " gliDer. \"Too Fun: experience with Mushrooms (P. cubensis) (ID 56204)\". Erowid.org. Aug 26, 2009. erowid.org/exp/56204",
  "substance": "Mushrooms (P. cubensis)",
  "views": "2838"
 }
}
