{
 "title": "A Lesson in Poly-drug Use",
 "author": "Mr. 1",
 "citation": " Mr. 1. \"A Lesson in Poly-drug Use: experience with 2C-E, Methylone, 4-FA & Methoxetamine  (ID 92315)\". Erowid.org. Aug 30, 2011. erowid.org/exp/92315",
 "substance": "2C-E, Methylone, 4-FA & Methoxetamine ",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "7.5 mg",
   "buccal",
   "2C-E",
   "(powder / crystals)",
   " T+ 0:25",
   "7.5 mg",
   "buccal",
   "2C-E",
   "(powder / crystals)",
   " T+ 1:55",
   "150 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   " T+ 1:55",
   "100 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   " T+ 2:20",
   "7.5 mg",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)",
   " T+ 4:00",
   "75 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   " T+ 4:00",
   "50 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   " T+ 4:50",
   "7.5 mg",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)",
   " T+ 6:35",
   "7.5 mg",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)",
   " T+ 9:15",
   "17 mg",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)",
   " T+ 10:55",
   "20 mg",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>This experience involves three subjects; 1, 2 & 3.</p><p>1 - Weight: ~75kg</p><p>Writer, male, in a relationship with 2, is very experienced with drugs and familiar with:</p><p>Marijuana, Alcohol, Tobacco, Methylphenidate, MDPV, Methylone, 4-FMP, 4-MEC, Shrooms, 4-HO-MET, JWH-081, JWH-250, Salvia & 2C-E.</p><p>2 - Weight: ~63kg</p><p>Female, in a relationship with 1, is also rather experienced with drugs and familiar with:</p><p>Marijuana, Alcohol, Tobacco, Methylphenidate, MDPV, Methylone, 4-FMP, 4-HO-MET, JWH-081, JWH-250 & 2C-E.</p><p>3 - Weight: ~60kg</p><p>Female, a good friend of both 1 & 2, is a little less experienced with drugs but familiar with:</p><p>Marijuana, alcohol, tobacco, JWH-081, JWH-250 & 2C-E.</p><p>Here follows the experience:</p><p>T+00:00 (15:25)</p><p>1, 2 & 3 - 7.5mg 2C-E applied to gums. (Read further down why this is a bad ROA)</p><p>T+00:25</p><p>1, 2 & 3 - 7.5mg 2C-E applied to gums.</p><p>T+01:05</p><p>1, 2 & 3 - 2C-E has began to exhibit its effects on our CNSes. Medium discomfort felt, stomach related was light, no nausea, but bodyload pretty annoying.</p><p>T+01:55 (17:20)</p><p>1 - 150mg Methylone & 100mg 4-FA orally, dissolved in water.</p><p>1, 2 & 3 - Bodyload has decreased significantly and is now bearable. Visuals now fully present.</p><p>T+02:15 (17:40)</p><p>2 & 3 - Left to buy cigarettes. Both were tripping pretty hard so I told them it was a bad idea but 3 is a rather heavy smoker and she had almost ran out so she felt she had to. They took the bike to a small store downtown (the only place were they could go since they are underage).</p><p>T+02:20</p><p>1 - 7.5mg MXE insufflated since feeling alone, anxious and a bit desperate without company.</p><p>T+02:35 (18:00)</p><p>2 & 3 - They have successfully returned. 2 said she had been very anxious and felt stressed when downtown since there were so many people. 3 said she felt rather relaxed the entire time. This might be explained by the fact that 2 drove 3 on the bike so 3 didn't have to put down any physical effort during the travel which 2 had to. This was activating her sympathetic nervous system, causing elevation of blood pressure and heart rate resulting in stress.</p><p>T+03:50</p><p>3 - 150mg Methylone & 100mg 4-FA orally, dissolved in water. First time ever with stimulants.</p><p>T+04:00</p><p>2 - Feels gastrointernal discomfort and some pain which raises concern since she's recently had what was believed to be a peptic ulcer from excessive NSAID use (Ibuprofen) combined with drug induced (methylone, 4-FA, MDPV, JWH-081) stress. She was supposed to have 150mg Methylone & 100mg 4-FA just as 1 & 3 but a decision was made that she probably shouldn't under the circumstances. Therefore her dose was split up between 1 & 3.</p><p>1 - 75mg Methylone & 50mg 4-FA orally, dissolved in water.</p><p>3 - 75mg Methylone & 50mg 4-FA orally, dissolved in water.</p><p>T+04:30</p><p>2 - Feeling tired and feels a pressure/pain on her chest. She felt a bit sad since she was looking forward to the Methylone & 4-FA more than the other substances. She still experiences GI discomfort/pain.</p><p>3 - Rather euphoric but wishes that 2 would feel better and less tired.</p><p>1 - Would like 2 to feel better. Mood is good but feels greatly dampened from the unhappy 2.</p><p>T+04:50 (20:15)</p><p>1 - 7.5mg MXE insufflated. Just listening to music alone in another room, he is feeling great.</p><p>2 - Watches TV with 3. A bit asocial since she still doesn't feel great.</p><p>3 - Experiences some sort of euphoric bliss, doesn't feel like doing anything. Just remaining in the same position quiet and appreciate the feeling of having an empty euphoric mind. This results in her being even more asocial than 2.</p><p>T+05:40 (21:05)</p><p>1, 2 & 3 - Outside smoking cigarettes. 3 was very hard to get out since she was so attached to her euphoric bliss but once she got her cigarette she didn't regret the effort of going outside. 1 & 2 was a bit scared of how empty 3 seemed, she was nothing like herself anymore, even her face looked entirely different because of the tension the stimulants had applied to her facial muscles. 1 knew she would return to normal when most of the drugs had left her system and so did 2 but she still felt a bit afraid.</p><p>T+06:35 (22:00)</p><p>1 - 7.5mg MXE insufflated.</p><p>T+07:45 (23:10)</p><p>2 - 7.5mg MXE insufflated. First time ever with a dissociative.</p><p>T+09:15 (00:40)</p><p>2 - Doesn't feel any effects from the previously insufflated MXE.</p><p>1 - Notices some light stimulation in 2. A little surprised that she doesn't notice it herself.</p><p>1 & 2 - 17mg MXE insufflated.</p><p>T+10:55 (02:20)</p><p>1 - 3 glasses of wine.</p><p>T+12:00 (03:25)</p><p>1 - 15mg MXE insufflated.</p><p>2 - 18mg MXE insufflated.</p><p>3 - 20mg MXE insufflated.</p><p>End of log.</p><p>Post-experience notes</p><p>I will now fill in what happened during the experience. Before this was just a dosage log. I will also write a introduction to the subjects, some advice for everyone who plans on using these drugs and a quick summary of how the MXE affected us after the last log-entry.</p><p>[3] She got really strong effects from the MXE with medium effects still present at (10:00). Effects then began to decrease over the following 5-6 hrs, she had strong visuals during that time as well as a great deal of confusion. She had no sleep that night. Her opinion on the recreational value of the substance varied throughout the experience. But afterwards she considered the substance rather unappealing and not very enjoyable since she found herself overwhelmed by the effects. We came to the conclusion that she was either very sensitive to the substance or still under the influence of the other substances, resulting in bad synergy, either way she should have had a lot smaller dose. Had no sleep, just some rest while 1 & 2 slept. No comedown present but confusion lasted throughout the day. She went to a party the following night during which sleep deprivation caused some visual disturbance in the corner of her eye.</p><p>[1] He got light effects from the MXE which he handled with ease. Enjoyed the effects but expected more. Fell asleep somewhere in between (06:00) and (07:00), woke up around (10:00). There was no comedown similar to those he normally gets from stimulant use and sleep deprivation. Although he fell asleep unintendently between (17:00) and (21:00).</p><p>[2] She got light effects which she appreciated and enjoyed, it also resolved some unspecified pain she had been feeling before. She got a new look upon life from the feeling that everything became easier if one just stopped being so serious about things. This resulted in a playful childish behavior that she found enjoyable. Fell asleep sometime after 1, woke up around (10:00). She also didn't notice any comedown. Also fell asleep unintendently between (17:00) and (21:00) together with 1.</p><p>About administering 2C-E through the gums:</p><p>This might seem like the best ROA for 2C-E since it has high efficancy, lacks the immense pain that's related to insufflating aswell as the nausea related to oral administration but I found that it actually kills the skin on the gums. The morning after the experience I had a layer of dead skin on my gums & behind my lip which wasn't a nice surprise. The pain is also present if I apply too much 2C-E on a too small area.</p><p>Side-effects were present at times not written down and was counteracted by different methods, these are written down below.</p><p>Stomach discomfort/pain</p><p>1, 2 & 3 - Ranitidine</p><p>1, 2 & 3 - White bread</p><p>1 - An antacid (In very minor cases)</p><p>Heartburn</p><p>1 - An antacid</p><p>3 - In one acute case almost resulting in vomit without any nausea present: Ranitidine</p><p>Nausea</p><p>1, 2 & 3 - Peppermint essential oil - Very small amount (</p>",
 "year": "2011",
 "id": "92315",
 "gender": "Not Specified",
 "age": "17",
 "timestamp": "2011-08-30T07:00:00.000Z",
 "views": "8880",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "7.5 mg",
   "administration": "buccal",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ]
}
