{
 "title": "Horrific Deaths from Accidental Overdose",
 "author": "ForOurYaoiButterfly",
 "citation": " ForOurYaoiButterfly. \"Horrific Deaths from Accidental Overdose: experience with Bromo-Dragonfly (ID 92339)\". Erowid.org. Aug 9, 2011. erowid.org/exp/92339",
 "substance": "Bromo-Dragonfly",
 "bodyweight": "150 lb",
 "report": "<p>Anastasia Marie Jewell was the most amazing, beautiful, looking woman I'd ever met.</p><p>Then she died. May 7th, 2011, 'Stacy', as she insisted on being called, went to a party. Her friend, Cody, ordered something online that he thought was 2-CE. After EYEBALLING the powder-to-water ratio, they left for the party.</p><p>Just a fun night. A couple drinks. Some video games. Then the water bottle with a skull drawn on it was brought out. One of her friends decided to try it first, as he was more experienced with drugs. After about 5 minutes, they noticed him laughing, halucinating, having FUN! So all but one decided to take some.</p><p>A few minutes later, the first man started to seize. If they had just waited an extra couple om minutes, my best friend would still be alive. Stacy began seizing, and fell to the floor, as did 7 others that night. After nearly 45 minutes of seizing, halucinating, vomiting blood and calling out for her mother, the ambulance finally arrived. Minutes later, my friend, and voice student, was pronounced dead.</p><p>Is it worth it? Is it worth you or someone you love dying, just for a GOOD TIME???</p><p>She was AMAZING, and now she's fucking DEAD.</p><p>All because of a series of STUPID MISTAKES.</p><p>Her boyfriend, Andrew Akerman also died, as did one man in Roff, where Cody bought the drug. Cody is now in jail, charged with their murders. 7 people were hospitalized, and MANY of them are living with physical consequences. All of them have to live with the fact that if they had just waited FIVE MORE MINUTES, their friends would not be in the cold, dark ground, but with us, laughing, talking, singing.</p><p>Do your damned research. It is TOO EASY to overdose on this shit, and even twice the normal dosage can rip you apart.</p><p>I helped plan her funeral. I helped paint her casket.</p><p>I sang 'Wishing you were somehow here again' from Phantom of the Opera at her memorial.</p><p>I can never sing that again.</p><p>Please be safe.</p><p>And make sure that Anastasia 'Stacy' Marie Jewell did not die in vain.</p><p>I never want to paint another casket.</p><p>They released the call the day we buried her. The day we put her in the ground.</p><p>http://newsok.com/911-calls-reveal-terrifying-2c-e-overdose-details/article/3566991</p><p>Stacy's Mom, and part of the 911 call. Still can't bring myself to watch it.</p><p>http://www.youtube.com/watch?v=7j_etBsi8CY&feature=relmfu</p>",
 "year": "2011",
 "id": "92339",
 "gender": "Female",
 "age": "22",
 "timestamp": "2011-08-09T07:00:00.000Z",
 "views": "11922",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "(liquid)"
  }
 }
}
