{
 "title": "Psychological Dependency and Binges",
 "author": "IpsoFacto",
 "citation": " IpsoFacto. \"Psychological Dependency and Binges: experience with 4-Methylethcathinone (ID 92333)\". Erowid.org. Aug 10, 2011. erowid.org/exp/92333",
 "substance": "4-Methylethcathinone",
 "bodyweight": "169 lb",
 "report": "<p>I offer this in part as a corrective to my earlier experience report on this substance.</p><p>Its been 3 days since my last and hopefully final binge on 4-MEC. I still have a little blood coming out of my congested nose when I blow, but the congestion and cold symptoms are finally easing off, and my mood swings have become tolerable.  The cravings I have been having for this substance have eased, though from past experience they might come back.  No matter, I dumped all of my remaining supply during that last binge, and have no plans to buy any more anytime soon. To say this stuff got the best of me would be an understatement. At some time or other in my life Ive had coke, meth, and prescription opiates sitting around but never anything I felt as drawn to or ended up binging on even remotely close to this stuff.</p><p>Over about 5 weeks I probably snorted 8-12 grams or so of 4-MEC. It invariably started out as just a line of 100-200 mg and ended up as a 6-14 hour binge. This ended, hopefully, the other night when I realized that I was no longer acting as if I was in control of my actions.  I was binging every other day, when possible, and whatever limits I had set for myself ahead of time I was ignoring completely.</p><p>The pattern is this:</p><p>1. do a fat line, uh. Euphoria, feel good..</p><p>2. 45 minutes or so later, euphoria is over, and while stimulation remains, it is not particularly pleasant.  So I repeat the fat line.  If line is not fat enough, 10 minutes later do more.  If it was adequate, that period of time goes up to about 45 minutes again.  Then do more.</p><p>Let me tell you why that sucks.  First, 4-MEC offered me few if any insights or anything really of value intellectually.  It does offer some empathy, particularly the first few lines of the binge, but didnt really leave me with anything but an awful empty feeling inside, that could only be remedied by .. more 4-MEC.</p><p>Secondly, I started prioritizing the 4-MEC rush ahead of everything.  Achieving that rush became the thing I looked forward to the most and wanted to do the most.  This was just exacerbated by doing more.  Every time I had a weird psychological craving for it I would go ahead and do some, if possible, often telling myself that I would just do a little bit to sort of explore the craving and its aftermath.  But not a single time was I able to avoid redosing a minimum of 3 times.  And even those shorter binges were cut short only because I started in the evening, and needed to go to bed.</p><p>This substance is not without merits.  The rush is quite intense and it seems to stimulate both serotonin and dopamine quite well, providing a stoning and empathetic rush of pleasure which I found blissful initially.  However it was a false bliss in that it ended awfully and quickly, provided little in spiritual or emotional insight, and left me feeling much worse after I did it than I did before.</p><p>There was one interesting psychedelic experience after a major binge where I probably hoovered up 1.4 g or so in an evening.  I smoked and ate some strong weed, and then took a couple of zolpidem to go to bed.  As I lay in bed, my heart racing 150% of its normal speed, I had intense visual hallucinations.  First, a patterning appeared, as if I could see the luminescent ether of the universe, then entities began to morph out of the ether and interact with me.  I will not deny that this was pretty damn cool.</p><p>But generally speaking, the binges were just an escape from reality, in which nothing of any real significance or interest ever happened.  My last binge was horrible  deep feelings of dissatisfaction, self-loathing, and depression even as I continued it until finally I summoned the willpower to make a decision to get rid of what 4-MEC I had left and not get more.  It is still a bit hard to think about it right now without wanting some, but I know that there is no good result from that particular endgame.  Even if it is not physically addictive, the havoc it wrecked with my dopamine and serotonin levels post-crash make it very attractive to use during the hangover.  And thats a recipe for self-destruction, at least for me.</p><p>I guess what most users say is that it is really a lot like mephedrone (which I have never tried and am now quite afraid of), though with more effects on serotonin and less on dopamine, but still enough to cause dependency issues, at least for me.  If I were out for an evening with friends and someone offered me some lines I might do them, since I think the solitary and daytime uses of it were the keys to my binging, but I should never have any large amounts of this in my possession again at any time.  Recreational use with friends on an isolated basis, particularly orally, and mixed with alcohol and other substances to make the 4-MECs effects seem less special would probably have been a more successful pattern of use for me than sitting around my office, being bored, and snorting up fat lines for 8 hours.  Such is the risk for the curious and solitary psychonaut.</p><p>I feel somewhat ashamed that I had so little control with this substance.  I worry that I caused myself unnecessary physical damage as 4-MEC is likely bad for heart valves, ripped up my nose, might be neurotoxic, and definitely caused me long-lasting tachardyia (which has thankfully ended). I also worry about its effect on my psychological state, though perhaps kicking the habit as I have hopefully done will strengthen my resolve and willpower in the future.  In any case, the peculiar and particular characteristics of the snorted 4-MEC high were way too seductive for me, and I have resolved to avoid stimulants and euphoriants for the most part as a result, particularly the substituted cathinones.  I think the next time I feel the need for a powerful psychoactive experience I will be returning to the non-addictive psychedelics once again.  Truth, insight, and knowledge over bliss, euphoria, and escape, seems like a better approach to psychoactive experimentation.</p><p>Thank you 4-MEC for teaching me firsthand that even knowledgeable, generally non-addictive-natured adults can still get into problematic use of certain psychoactive substances if they let themselves.</p>",
 "year": "2011",
 "id": "92333",
 "gender": "Male",
 "age": "45",
 "timestamp": "2011-08-10T07:00:00.000Z",
 "views": "13542",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "(powder / crystals)"
  }
 ]
}
