{
 "title": "Overall Effect Is Very Pleasant",
 "author": "Alexander Shulgin",
 "citation": " Alexander Shulgin. \"Overall Effect Is Very Pleasant: experience with Mescaline & Cyclizine (ID 92361)\". Erowid.org. Aug 11, 2011. erowid.org/exp/92361",
 "substance": "Mescaline & Cyclizine",
 "bodyweight": "",
 "report": "<p>[This report originally appeared as handwritten notes in Book 1, pages 1-6 of the Shulgin Lab Books.]</p><p></p><p>Subjective response to Mescaline  4/18/60</p><p>Date 4/16/60 Subject ATS Observer. [Alfred]</p><p>DOSE</p><p>0.400 g mescaline sulfate in water - preceded by 0.050 g Marezine one hour earlier. Slight bitter taste - not unpleasant.</p><p>CHRONOLOGY</p><p>After 0.5 hrs. noticeable intoxication - 0.7 hrs first nausea successfully combated - at 1.3 hrs end of nausea - comfortable - slight speech difficulty - 1.5 hrs. First signs of movement and color distortion - 3.0 hrs. Drug effect at maximum and remains there until 4.0 to 5.0 hrs. At 6.0 hrs. first noticeable signs of clarity from drug effects - At 8.0 hrs. only slight symptoms remain - essentially normal. Next day (24 hrs.) still occasional color intensification's but these are very difficult to objectively distinguish from normal responses.</p><p>HALLUCINATIONS</p><p>Eyes open: - none within the strict definition of a hallucination being a synthetic illusion or vision generated without recourse to real or tangible stimuli. There was certainly visual distortion, q.v.</p><p>Eyes closed: - world of motion and color - generation of ex-centrally evolving clouds in intense color usually evolving usually from darker shades of blue and purple through green or red-green to lighter shades of pinks and reds. Also geometrical patterns, either in the form of colored wedges of light (usually</p><p>passing from left to right) or in rectangularly symmetrical shapes, often with erotic suggestions. Photic stimulation did not seem to be helpful. Towards the end of the drug's effect, occasional fields of color were noticeable, without appreciable motion or meaning.</p><p>VISUAL DISTORTION</p><p>In general very noticeable after the first 1 1/2 hrs to about 5.0 hrs. v.i.</p><p>DEPTH PERCEPTION</p><p>Distances between objects are incorrectly judged. In riding as a passenger in a car, the illusion that the buildings alongside the street, and the sidewalks, are crowding down on top of you, is remarkable. One tends to lean away from objects on either side, so as to try to compress yourself into a narrow space out of harm's way. Errors in judgement are on the conservative side so that danger is automatically avoided by an overly large margin. In viewing an abstract painting, the depths of paint applications becomes apparent (undoubtedly incorrectly) as if each color had been applied on a separate overlay of glass, and the entire picture assumes a three dimensional aspect that seems to expose the techniques of the artist...... There is also a remarkable increase in textural and detail perception - textures become rich in detail, and one can discern fine structural detail of nearly microscopic materials (apparently accurately, as verified by revisiting and reviewing objects seen). The villi of leaves and flowers are seen in revealing detail, without effort.</p><p>MOTION PERCEPTION</p><p>Very striking. Both inanimate and animate objects (although motionless) may be seen to be in rapid and continuous motion. It seems to be impossible to anticipate which objects will be seen next in motion. Peoples faces may seem to distort and crawl into different shapes. A person leaning upon a car will cause the car to be pushed rapidly into the ground. On closer inspection, the car which is rapidly descending into the ground is of course not moving, but the wheels are rotating in a direction which resists the cars descent. This all seems real, continuous and logical. Watching the leaves of a plant from a distance, when the sun moves so as to fall on them, they appear to raise themselves continuously towards the sun. As they fall into shade, their upwards motion is replaced with a downwards curling, continuous, as if to knot into a ball. Closer inspection shows that they have, of course, not knotted, but are actively knotting. The concept of continuous motion is not contradictory with the observation that after a prolonged period of observation, they are indeed in essentially the same position, but still knotting.</p><p>COLOR PERCEPTION</p><p>Most striking. The slightest differences in shade may be (need not be) amplified to extreme contrast. Many subtle hues become nearly phosphorescent in intensity. Saturated colors are often unchanged, but are surrounded with cascades of new colors tumbling over the edges. Intensification in color, rather, the easily observed differences in shades, is a remarkable reward for driving or walking through the country.</p><p>TIME PERCEPTION</p><p>Noticeable. Subjective time is lengthened. What seems like a half-hour of contemplation or observation occupies only perhaps five minutes. The radio seems to be lower pitched, and almost casual or indifferent in its content.</p><p>INTERPRETATION</p><p>During the initial phase of intoxication (2-3 hrs) everything seemed to have an humorous interpretation. Peoples faces are in caricature, small cars seem to be chasing larger cars - all the cars coming towards me seemed to have faces. One would seem to look like a duchess, moving in regal pomp - another would be</p><p>a wisened old man running away from someone.</p><p>PHYSICAL COORDINATION</p><p>There is apparently no great decrease in physical coordination. An attempt was made to drive the car (on a relatively untraveled road, Grizzly Peak Blvd.) which was successful, except for an extreme conservationism and caution. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] In the event of a challenging situation (approaching car simultaneous with a horseback rider on the right) the car was brought nearly to a stand-still to permit the unsolvable problem resolve. The overall effort was unpleasant, as one was forced to withdraw from the effects of the drug (adrenalin?) and there was perhaps a 15-20 minute period afterward required for the effectiveness to again take control. One prefers to observe, not participate in the surrounding world. One occasion, while descending a rather steep path, I chose to reverse my direction, and executed a turn and climb, on loose and steep dirt, with completely sober ability. It would seem that in the event of necessary action or self-defense - one could and would master nearly full coordination. During the intoxication phase, there is some speech distortion (similar to alcohol). This effect seemed to last well into the recovery stage.</p><p>There is complete recall of all experiences and thoughts, after the drug has been dissipated. The feeling of comfort, introspection, and tranquility that remains afterwards may indeed have an effect days after the treatment. There is complete recall of all experiences and thoughts, after the drug has been dissipated. The feeling of comfort, introspection, and tranquility that remains afterwards may indeed have an effect days after the treatment.</p><p>MENTAL COORDINATION</p><p>Here there is a considerable distortion. Philosophical problems seem to admit simple and rather obvious solutions. One does not wish to dwell for long on any one concept, however. It is possible to discuss ones thoughts with the observer, but it seems that the observer is merely tolerating your ideas, but does not follow your reasoning. It is preferable to consider them quietly. There was observed an extraordinary dissociation of mind and body. One can look out over the land-scape and travel along the line of sight. The body takes care of itself as far as moving is concerned. To swing ones eyes around the horizon makes one giddy, due to the rapid motion. The body seems incidental while the mind is borne on the line of sight, but the basic sympathy for it (detached) requires that you do not allow it to come to harm. Self-harm is a real possibility however, through inadvertent walking into hazardous areas. It also is very difficult to concentrate on outside conversations. Ones now thoughts and observations are too extreme and important - one tends instead to stare at the speaker - his colors, expressions, details.</p><p>MENTAL ATTITUDE</p><p>One of the most startling effects of this drug is the extreme empathy felt for all small things - a stone, a flower, an insect. I believe that it would be impossible to harm anything during the effect, and to commit an overt harmful or painful act upon anyone or anything is beyond ones capabilities. One cannot pluck a flower - and even to walk upon a gravel path requires one to pick his footing carefully to avoid hurting or disturbing stones. One tends to feel extremely conspicuous in a large group of people, although according to the observer, ones behavior is quite proper although a little cautious or reserved. As to mental motivation one is content to observe at length, to contemplate nature in detail, and so to be somewhat recluse, withdrawn, and unsociable.</p><p>GENERAL COMMENTS</p><p>The overall effect is very pleasant - the desire is strong to repeat the experience on both smaller doses (to perhaps permit one to be alone in safety) and on larger doses. Also to repeat the experience under a variety of external stimuli - with music available for contemplation - at the beach - at night. There is complete recall of all experiences and thoughts, after the drug has been dissipated. The feeling of comfort, introspection, and tranquility that remains afterwards may indeed have an effect days after the treatment. One feels that this feeling may be prolonged and further enjoyed upon repeated usages. Such a change would be most desirable in many personalities - and may bespeak a therapeutic value for the drug in cases of anxiety and tension.</p>",
 "year": "1960",
 "id": "92361",
 "gender": "Male",
 "age": "35",
 "timestamp": "2011-08-11T07:00:00.000Z",
 "views": "21334",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Cyclizine"
  },
  "1": {
   "time": "",
   "amount": " T+ 1:00",
   "administration": "400 mg",
   "substance": "oral"
  }
 }
}
