{
 "title": "Diphenhydramine HCl",
 "author": "KW",
 "citation": " KW. \"Diphenhydramine HCl: experience with Diphenhydramine (Benadryl) (ID 924)\". Erowid.org. Feb 27, 2001. erowid.org/exp/924",
 "substance": "Diphenhydramine (Benadryl)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "8 tablets",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "",
   "4 tablets",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I have only misused Benadryl once.  I took 8-10 .025 mg tablets of Diphenhydramine HCL, and several more about an hour later -- about 15 in total, but possibly more.  I was in my dorm room alone, and as I lay there watching TV I began to feel the effects of the drug (approx. 30-45 minutes after injestion).  I felt slightly euphoric and listening to music was extremely enjoyable, but, aside from the amazement which I felt at seeing visuals some time later, this euphoria was the only good thing about the experience.  I soon began to see hallucinations:  tiny dots of light seemed to fly across my field of vision; and it seemed as if, out of the corner of my eye, there was rapid movement of some sort; my brown carpet would, if I stared long enough, seem fluid like rippling water. </p><p>My most impressive visual occurred as I lay on the couch looking at the wall. A blob (it looked like a large, tangled bunch of yarn) of intertwined red and green threads floated slwoly through the air and hovered there before my eyes. If I reached for the blob or turned away, it disappeared, but I could make it appear again by staring intently at the wall. When I glanced away from the television, I could see a black, shadowy form resembling it on the wall. This phenomenon was much like that of staring at the sun for a brief moment and then quickly closing one's eyes.  I felt slightly afraid of and annoyed with these visuals, but very easily remembered that I was only feeling the effects of a drug. </p><p>But this drug, as pleasant and LSD-like as it may sound, was not fun!  Much of the time I felt as if I wanted to jump out of my skin; I had tremors for 5 minutes at a time during which I'd twitch and writhe and scratch; I sometimes felt an overwhelming sense of doom and saddness; I was extremely fatigued.  These fits came far too often, and made the experience a miserable one.  In addition, I overslept, missed work, and felt nauseous for most of the next day.  I immediately threw the rest of my Benadryl away.  So take my word it and leave this shit alone -- or do it yourself and see why this hallucinogenic, powerful as it is, is so infrequently used for recreational purposes.  Cheers.</p>",
 "year": "2000",
 "id": "924",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-02-27T08:00:00.000Z",
 "views": "80240",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "8 tablets",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ]
}
