{
 "title": "2CI: A New Ally",
 "author": "Phormer",
 "citation": " Phormer. \"2CI: A New Ally: experience with 2C-I (ID 9240)\". Erowid.org. Sep 4, 2001. erowid.org/exp/9240",
 "substance": "2C-I",
 "bodyweight": "",
 "report": [
  "<p>Soon after procuring a little 2C-I felt compelled to give it a go right away. I carefully eyed out what looked to be 20mg and placed to in to a gel cap which I planned to consume at a very fun music event later that night. Now normally I would not test drive a new drug out in public, however I new that I would be with good friends in a very familar environment. Besides, in my younger years much of my experimentation happened at concerts. It would be kind of nostalgic.",
  "At some time during the show I swallowed the goods and continued on dancing. I felt alerts at about fifteen minutes and was at a nice ++ between 30 min and 45 min. This swiftly rolled into a glorious +++ at just over an hour. Note: these minutes are an estimation, I was not wearing a watch. During the peak the colors became wonderfully bright and full of motion and my body was burstling with energy. I also had a smile that wouldn't quit. Very fun!",
  "By the time I got home I was still flying high. So i found a nice quite place to rest and explore waht this substance might be doing. I was in a very peaceful happy state with my ego boundries slowly disolving. I look forward to higher doses in more private settings possibly with ketamine ; ).",
  "I would say that the peak lasted 6-8 hours with a smooth come down. sleep was no problem with a 1mg melatonin and 10mg valium. I felt quite tired the next day but I believe that it was from the melatonin and valium plus the hot sun. Unfortunetely I have never had the opportunity to try 2C-B so i can't compare. But this stuff is very sweet!",
  "==========================",
  "I need to do a little more work with the 2c-i in order to give a strong comparison between it and 2c-t-7 and 2c-t-2. However, i can say that the 7 and the 2 seem to have more 'geometric' visuals as compared to that of 2c-i which has a more brighter 'circus like', not so defined visual activity.",
  "I also found the 2c-i to be more euphoric than the 7 and the 2. I can almost say that the 2c-i feels like a cross between 2c-t-7 and MDMA. I stress the 'almost'.",
  "As far as a speedy effect, I find the 2c-t-2 to be quite speedy and feel quite drained the next day. The 7 is not as speedy for me, and the 2c-i seems to be somewhere in between.",
  "I hope that this comparison was helpful.</p>"
 ],
 "year": "2001",
 "id": "9240",
 "views": "9298",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  }
 ],
 "submissionDate": "2001-09-04T07:00:00.000Z"
}
