{
 "title": "Subjective Response",
 "author": "Alexander Shulgin",
 "citation": " Alexander Shulgin. \"Subjective Response: experience with DMMDA (ID 92429)\". Erowid.org. Sep 9, 2011. erowid.org/exp/92429",
 "substance": "DMMDA",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "24.7 mg",
  "oral",
  "DMMDA",
  "(powder / crystals)"
 ],
 "report": "<p>[This report originally appeared as handwritten notes in Book 1, pages 41-43 of the Shulgin Lab Books.]</p><p></p><p>Subjective Response to DMMDA.</p><p>Date: Nov. 15 1962</p><p>Subject: Alexander Shulgin</p><p>Observer: A.O.</p><p>Dose 24.7mg (</p><p>Comments are added in [].</p><p>1:15 Intoxication hit - very very like LSD eyes 30% dilated [there was absolutely no preliminary warning in the form of nausea]</p><p>1:45 Shaky - leg problem [knees a little weak] not much more intoxicated - eyes 50% dilated.</p><p>1:55 Into head - mild depersonalization (as w/ LSD) - took crap, wiped - sans really caring - eyes closed - slight early - mescaline clouds - no color [this was last urination in nearly 4 hrs - cannot recall amount voided]</p><p>2:00 Time seems slightly slowed - warm feeling in genitals - may yet be nauseated [handwriting deteriorating]. Tried to proof-read a couple of papers - wow [actually did an excellent job]</p><p>2:05 teeth rubby - legs w/ ataxia (very mild) still feel a little urpy.</p><p>2:10 talk a little garbled - taste in throat of something eaten a couple of hours ago (nothing) - slight nausea</p><p>2:10 arm ataxia now too [handwriting quite bad]</p><p>2:15 good & drunk now - no motion, no color.</p><p>2:20 time subjectively slowed - feel that several people have become aware - AO assures me not so. pulse 92 [felt guilty being in back of lab looking at clock for such a long 15 seconds - felt certain I was conspicuous]</p><p>2:30 I am certainly as intoxicated as under 80 (micrograms) LSD.</p><p>2:35 subject AQ knows [he didn't, when I confided in him later] AO says no - must remember molasses joke [which undoubtedly seemed much more funny then it was - I laughed uproariously]</p><p>3:00 must be paranoid [I sure was] - I am sure Uma knows but how can I ever find out - paradox of observation - reflexes are excellent though coordination pretty grim [handwriting pretty grim too]</p><p>3:15 into dark room - interesting 3D effect from nude on door - must check [actually it was a photograph of the cushion she was resting on that had the 3D effect - had to feel to make sure button and cushion weren't attached in reality to the door] afraid of discovery - coming out - seen by both Val and Wind -</p><p>they both looked at me strangely - verified that they couldn't have seen me come out of dark room Janitors closet [true] druggedness of lots LSD - but seem to be able to cope w/ people</p><p>3:25 teeth still rubby - no nausea</p><p>4:05 mental stuff going fast - I am hyperthyroid - but luckily w/ pretty good coordination - intoxicated still - going full blast. I may recover [at this time I sailed into stockroom to wrap a gram bottle of methylenedioxy amphetamine for Gladys - swept in did the job - swept out quickly & efficiently]</p><p>4:25 lucid - clear</p><p>4:45 eat lunch - mouth doesn't quite work right yet [the apple was almost too much][and seemed incredibly noisy]</p><p>5:15 seem to be out of the drug OK [handwriting normal]</p><p>5:45 occurs to me to urinate. Hadn't all morning. Small pass - strong color [no odor] right eye still dilated, left almost normal [It seems to be difficult to function the muscles necessary to urinate - could there be a little paralysis?]</p><p>6:05 teeth still disturbingly rubby. I'm going to load up on coffee.</p><p>7:15 (2:30 real time) passed another 50 cc urine - color O.K. all will be O.K. - write all this up now [which I just did, at this time].</p><p>End of concurrent notes. time 3:00 PM (7:45 of experiment)</p><p>At 8hrs - urinate again - but muscles still don't seem to be right - also still some tremor in hand - tingle in legs. apparently really have some ache shock.</p><p>Eye dilation gone at 8:00 PM (13 hrs) and urination apparatus worked normally. slept well - AM - excellent spirits.</p>",
 "year": "1962",
 "id": "92429",
 "gender": "Male",
 "age": "37",
 "timestamp": "2011-09-09T07:00:00.000Z",
 "views": "4397",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "24.7 mg",
   "administration": "oral",
   "substance": "DMMDA",
   "form": "(powder / crystals)"
  }
 }
}
