{
 "title": "Subjective Response",
 "author": "Alexander Shulgin",
 "citation": " Alexander Shulgin. \"Subjective Response: experience with TMA-6 (ID 92433)\". Erowid.org. Sep 6, 2011. erowid.org/exp/92433",
 "substance": "TMA-6",
 "bodyweight": "",
 "header": [
  "DOSE: T+ 0:00",
  "7.8 mg",
  "oral",
  "TMA-6",
  "(liquid)",
  " T+ 2:00",
  "3.6 mg",
  "oral",
  "TMA-6",
  "(liquid)",
  " T+ 8:00",
  "2 glasses",
  "oral",
  "Alcohol",
  "(liquid)"
 ],
 "report": "<p>[This report originally appeared as handwritten notes in Book 1, pages 98-99 of the Shulgin Lab Books.]</p><p></p><p>Subjective Response to TMA-6</p><p>Date: July 7, 1964</p><p>Dose: [0:00] 7.8mg + [2:00] 3.6mg</p><p>Chronology - corrected back to 7:10 AM = 0 hr.</p><p>0 hrs. in H2O orally - virtually no taste.  no eye dilation - no indication of any effects</p><p>1.5 hrs. eat doughnut - 1st food 12 hrs.</p><p>2.0 hrs. no further effect.</p><p>4.0 hrs. had concluded that there was to be no effect - decided not to supplement however, as there was the slightest indication of pupillary dilation. I tell AO of failure.</p><p>4.3 hrs. 1st distinct awareness of physical and mental effects.  Very disturbed as this indeed may be the crest of activity showing up and will subside - or this may be the start of a much slower onsetting action. warmth in base of belly</p><p>4.8 hrs. Eat lunch - no difficulty, unlike low levels of mescaline when eating (mouthing) of food is virtually impossible.  I was loquacious in my discussions during lunch - seemed to be able to think clearly but still held to much anxiety. I remember the interesting urge to be ill, but not from the top of my stomach but from the bottom. Consequently vomiting would be useless in relief, and had to urinate to release. There was no movement of things, no color effects, no paraesthesia.</p><p>6.0 hrs. Accepted opportunity to go to Western Regional Labs with AQ. However the question of crest or onset of long action (DE) was not resolved so withdrew and stayed with AO. Since his LSD he is a excellent understanding observer. I don't know if I could count on AQ. At least at this moment I didn't want to.</p><p>6.3 hrs. First completely clear moment - 10 minutes or so. It was comforting to know it would clear.</p><p>~8 hrs. all OK - felt quite tired - home - 2 drinks - good dinner - hot shower and slept excellently.</p><p>48 hrs post mortem - absolutely nothing.</p><p>This material appears to be of about the same potency, although considerably slower activity, as (then) TMA-2, of which I was occasionally reminded. Activity thus in the 15-20 M.U. level.</p>",
 "year": "1964",
 "id": "92433",
 "gender": "Male",
 "age": "39",
 "timestamp": "2011-09-06T07:00:00.000Z",
 "views": "6087",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "7.8 mg",
   "administration": "oral",
   "substance": "TMA-6",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "3.6 mg",
   "administration": "oral",
   "substance": "TMA-6",
   "form": "(liquid)"
  },
  "2": {
   "time": " T+ 8:00",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 }
}
