{
 "title": "Ultimatum",
 "author": "Noirceuil",
 "citation": " Noirceuil. \"Ultimatum: experience with Morning Glory Seeds (ID 9243)\". Erowid.org. Aug 25, 2002. erowid.org/exp/9243",
 "substance": "Morning Glory Seeds",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "45 seeds",
   "oral",
   "Morning Glory"
  ]
 ],
 "report": "<p>The trip produced by these seeds is not unlike mushrooms, and can be quite intersting, but before one undertakes such an adventure, they must ask themselves if they are willing to deal with nausea the likes of which one never expects to experience from a small amount of seeds.</p><p>While waiting on line for Tool tickets, I consumed about 15-20 seeds in front of Tower Records. I had eaten a sandwhich minutes before, and thought that the meal would temper the nausea. After about fifteen minutes, I began to feel disconnected from my body, and the floor/ground began to move in waves. Like a bullet came the nausea, which became so severe that I knew, if my mouth were left open for more than threee seconds, I would have bathed the entire train car (as well as my friends) in vomit. Colors were brighter than usual, but I ws unable to appreciate this due to my sickness.</p><p>I tried to eat again, about a half hour after taking the seeds, but I had difficulty keeping food down. I sat in the park and rested my head on my lap, adjusting to the nausea and noticing an orgasmic buzz flowing throughout my body. I soon became exhausted, and knew that I would pass out if I did not lift my head. The colors were now ten times brighter, and everything had a green glaze to it. My mood and mindset remained unaffected.</p><p>At work (three hours later), I was hit by the second wave. My movements and perception became slowed, and I felt as if my every joint were having an orgasm. A sense of giddiness overtook me, and I would laugh childishly at seemingly unfunny things. This state lasted for fifteen minutes, and then I felt as I did prior to taking the seeds.</p><p>I ate more with a friend four hours later, and I experineced the same symptoms as before. the nausea was non-existant this time, and the trip more severe. I tried to purchase movie tickets, and found myself unable to interact with the woman at the ticket window. My thoughts were changing quickly and I could not fucus on what she said. My friend was beset with extreme nausea and pain. I soon noticed a sense of paranoia, and I was easilly frightened. I felt uncomfortable in my own body and with my own senses.  She threw up five hours later, and the pain subsided. She had slight visual hallucinations, and went to sleep talking about the skulls in the room (?)</p><p>At best these seeds provide a dark-edged trip similar to mushrooms, and at worst leave raving and riddled with pain. Caveat Emptor.</p>",
 "year": "2001",
 "id": "9243",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-08-25T07:00:00.000Z",
 "views": "10415",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "45 seeds",
   "administration": "oral",
   "substance": "Morning Glory"
  }
 ]
}
