{
 "title": "Threshold Effects",
 "author": "Alexander Shulgin",
 "citation": " Alexander Shulgin. \"Threshold Effects: experience with DOM (ID 92432)\". Erowid.org. Sep 6, 2011. erowid.org/exp/92432",
 "substance": "DOM",
 "bodyweight": "81 kg",
 "report": "<p>[This report originally appeared as handwritten notes in Book 1, page 88-89 of the Shulgin Lab Books.]</p><p></p><p>Threshold effects of DOM</p><p>Jan 9 1964</p><p>Dosage: Dissolved 1.6 mg as HCl in H20 - pipetted out 1/8 -> 1.4 mg computed down to free base 1.19 call 1.2. at currently 180 lbs -> 81 Kg = .0147 mg - 14.7 g/Kg thus - assume initial at 11 g/Kg - max differentiate at 20 /Kg - and effective (useful) at 17 g/Kg = 220 M.U. ! This is too optimistic probably ~ 120 better value</p><p>Times corrected to 0 hrs at 7:05 - moment of ingestion.</p><p>1:15 - am talking to AM in his office - am suddenly aware of warm flushing and tingling in genitalia - the usual hint that I am going to be sick. My mouth is very dry. I want to leave and tell AO but I cannot for several minutes.</p><p>2:05 - teeth are quite rubby - there is the feeling of heavy pressure on the ears - as if some one were squeezing my head - mouth has the taste of having smoked far too much the night before (haven't smoked since 1962 - no EtOH for 9 days). I would like to go outside and run away but I am afraid my heart wouldn't take it.</p><p>3:15 Morning is creeping along - I feel I am paying a physical price without any mentally distorted reward - I feel at this point - at a somewhat higher dose - this will be a psychotomimetic.</p><p>3:35 To greenhouse - distinct pleasure in looking at the lush salvia divinorum - the smell fits the appearance - signs of visual distortion - at a somewhat higher dose things would creep and crawl.</p><p>4:00 Still at it - considerable hyperventilation - eyes dilated 10-15% over normal</p><p>4:25 I think I start out here - do not have any desire to eat but I do eat - and complete my lunch (chicken, banana, apple.)</p><p>7:10 eyes ~20% dilated - I am still shaky as if my body had had a vigorous drug blow - but mentally I am O.K.</p><p>one or two more awareness in afternoon ( at ~8, ~9 hrs) P.M. fine. next A.M. fine.</p>",
 "year": "1964",
 "id": "92432",
 "gender": "Male",
 "age": "38",
 "timestamp": "2011-09-06T07:00:00.000Z",
 "views": "8166",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.2 mg",
   "administration": "oral",
   "substance": "DOM",
   "form": "(liquid)"
  }
 }
}
