{
 "id": 9244,
 "title": "Even Moderation Can Become Severe",
 "date": {
  "submission": "2011-01-01T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "T",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I recently went on Wellbutrin XL, 150 mg once daily, for the treatment of severe depression. I have never been a heavy drug user, and I had intended to avoid drugs or excessive alcohol for the duration of my antidepressant therapy. However, I had just moved into a new apartment and decided to celebrate by going out to a bar and having a few drinks. On Wellbutrin, I feel the effects of alcohol almost immediately, and I require fewer drinks than usual to obtain the perfect buzz.",
  "By one a.m., I was mildly intoxicated and ready to head home while my roommate and friends continued to drink. I walked home with a friend who is a heavy marijuana user, and we shared a good-sized joint together. My experiences with weed up to that point had been generally pleasant and innocuous, free from bad trips or paranoia. Usually, I just experienced muffled thoughts and sedation. That night, after one puff, I felt the characteristic body high begin to creep up, and with a second hit, I was immediately struck by the feeling of losing complete control of my body. I became terrified as I could barely control my movements. I (foolishly) hurried my friend away because I wanted to climb into bed alone and wait for the feeling to subside. I was confused because the amount of weed I had smoked was barely enough to become high, let alone enough to have such a strong negative reaction or overdose symptoms.",
  "I began to experience the sensation of strong electric shocks running from the top of my head down through my arms. I was afraid that I was going to have a seizure. I began to have heart palpitations, and I was shaking uncontrollably. In my paranoid state, I was convinced that I was going to die, alone in my room, due to a tiny amount of weed.",
  "After lying on the floor for an hour, the symptoms had not subsided, instead they became more intense, with the electrical sensations moving throughout my body. I called my roommate and asked her to take me to the emergency room. When she arrived, I was convinced that my body temperature was much too low, causing my teeth to chatter, but to her I felt feverish. I was able to walk, but I couldn't control my tremors and I couldn't think clearly. My roommates told the nurses that I had taken something and they weren't sure what it was. I didn't even think to mention the fact that I was on an antidepressant. I can barely remember the waiting room, but I was eventually turned away because I don't have Canadian health insurance. I didn't have 500 dollars to pay the admittance fee, and I was taken home. Without being able to do anything but lie down and hope for the feelings to subside, I fell asleep, shaking and scared. I thought that I wasn't going to wake up in the morning.",
  "I did wake up, feeling as thought I had a terrible hangover, but nothing worse. I talked to the friend that had given me the weed, and he had experienced nothing similar, which meant that it could not have been laced. I haven't smoked anything since that night, and alcohol alone has not caused any similar symptoms."
 ],
 "erowid": {
  "id": "56251",
  "citation": " T. \"Even Moderation Can Become Severe: experience with Bupropion (Wellbutrin XL), Cannabis & Alcohol (ID 56251)\". Erowid.org. Jan 1, 2011. erowid.org/exp/56251",
  "substance": "Bupropion (Wellbutrin XL), Cannabis & Alcohol",
  "views": "10702"
 }
}
