{
 "title": "Tryptamines Chocolate and Faust",
 "author": "Metatron",
 "citation": " Metatron. \"Tryptamines Chocolate and Faust: experience with 4-AcO-DMT (ID 92468)\". Erowid.org. Aug 22, 2011. erowid.org/exp/92468",
 "substance": "4-AcO-DMT",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "4-AcO-DMT",
   "(powder / crystals)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "report": "<p>Weekend Report,</p><p>Since the majority of our materials were now test dosed, the plan for a group substance session of close friends on these substances took form. An environment was setup involving Murnau's Faust and an opium den-like seating arrangement with sleeping bags and pillows on a living room floor supported by a large couch. An overly fatty dinner of chicken, couscous and bacon was consumed and 3 hours later dosing began.</p><p>J = 95 lbs = 8-12 mg's 4 aco dmt</p><p>MM = 130 lbs = 35 mg's 4 aco dmt</p><p>M = 190 lbs = 100-110 mg's methoxetamine</p><p>R = 165 lbs = 75-85 mg's methoxetamine and synthetic canniboid.</p><p>Myself = 210 lbs = 50 mg's  4 aco dmt</p><p>The five of us would be broken into two categories of what was being taken that night, hallucinagins and dissasociatives, and M had work until 11pm. Considering a longer come up, J MM and myself parachuted our doses at 9.15pm on saturday. R began his methoxetamine in 25 mg's doses along with us in hourly increments. J began feeling the expected tryptamine body load almost immediately and was encountering visuals and extreme euphoria within 20-30 minutes. M and I took nearly 2 hours to feel anything and an additional hour to approach the peak. Thoughts of having ruined my experience with recent tolerance or too large a dinner had even entered my head by the end of the second hour. This was fortunately however not anywhere near the case.</p><p>M walked home from work and did his best to catch up with us. On the come up we had turned the lights down and put on Faust. J was already tripping her mind while MM and I sat there patiently while eager at the same  time, on occasion a bowl of marijuana was had. Toward the end of the film we were gradually becoming more affected and proceeded to take turns watching music videos. At this point the effects became powerful enough for me to take up the idea of moving outside to our friend's backyard porch. We made our way to the backyard and sat down for what would start a lengthy and otherworldly series of experiences.  It was between 12-12.30 am.</p><p>We were all being hit hard in our own ways.  This adventure was a natural and philosophical one for me. Sitting on the cool porch wood, I looked up to the sky to see the ceiling descending to what seemed like just a few hundred feet. With fast moving winds and fog, I was amazed at this environment. Sitting in a large valley after a storm however, this could have been primarily not imagined. This substance was taking its time, and MM and I mutually felt a gradual increase in nausea. At this point M was ready to redose his methoxetamine and invited me to come up to where it was stored. On a side note, as a private ritual, M had made his lines out days earlier and left them on a picture of natalie portman's face from the film black swan. Every time he looked, the black swan looked right back with that treasure waiting to be taken. An amusing bearer, since he had once agitated the actress in a real life random encounter.  </p><p>Upon seeing his doses, I was glad to be invited up. The lines were enormous and it was advised he take the smallest one, which I gauged to be at least 40 mg's. I would only later discover his earlier line had been at least 60 mg's. These lines were not cruisers or mere trip takers, but battleships and psychic bombs.  We came back down where I found MM to be in the bathroom and everyone else where they were last seen. MM returned and we proceeded to trip heavily, mine was unfolding with south american priest/warrior like beings standing in the trees. They were morphing between these beings and the tree branches they were hanging onto. Looking at a piece of wood, it began to glow blue and become extra 3 dimensional like a hologram being bent in perspective. From this, one was able to visualize time, frozen in this block of wood and as visible as the rings that time itself had formed.  This in some ways approached a kind of cubist dimension, breathing right in front of me.</p><p>The true peak was approaching and the stomach was signaling its desire to rid itself of whatever was eaten to induce such a state. I was fortunate however, as it came up in a torpedo like shot that never induced further reflex or discomfort. This would happen 3 times during the night, but each experience was likewise efficient and not discomforting.  Right before this moment however, the visuals and sensations reached a fever high pitch. In these moments the visual periphery was beginning to vibrate and it felt as if the visuals and trains of thought were trying to burst out and become overpowering like in a DMT or Salvia experience. This was only felt at this moment however and heralded the plateau which would take us into the early morning hours. Unfortunately MM was once again experiencing less in terms of visual and mental stimulation, and instead felt primarily very strong bodily sensations. I am beginning to think she has a significantly diminished level or functionality of serotonin receptors in her makeup, which would account for her weaker tryptamine experiences thus far.</p><p>M began to display signs that his second dose of methoxetamine was kicking in. It would appear he had taken enough to enter what is called the M hole, as opposed to the legally scheduled K hole for Ketamine. He left direct contact and control of his body and went in and out for periods of time, intermittent with extremely loud manic laughter which would end almost as a cry. I was not worried per se, but paying attention. He fell to the back of me, nodded out, and then proceeded to lift himself up using my shoulders. I am very close to these people, and it was in this moment that we  again took on a family-like embodiment. Every one of us was in a state of otherworldliness, yet enjoying the company of each other and finding solace in belonging to a safe and trustworthy place.</p><p>MM came to a point where she became sick and threw up. However it was not quick and easy as it had been for me, as she felt considerably ill for some time after. Bodily sensations followed which she has described as not all that pleasurable. While M laid next to J, his pet dog C had taken residence along my back and wrapped around my lower body.  He is a big loyal dog with a puppy's heart, but had decided his master's state was best to leave alone for the moment perhaps. With the sensation of our bodies against each other, I thought back to my childhood and of my own dog named Fritzy, a brown hairless dachshund. This was a very strong moment, I loved that dog as if it were my brother, and he has been dead for roughly 17 years from this written moment.  Without words I thanked C for allowing me to feel what it was like to have a dog again, an canine companion which I hope to have again in the future. </p><p>R was not nearly as far gone as M, but wished he was. Throughout the night he had inquired about us smoking a synthetic canniboid which he and M had purchased some time earlier. This as well as all synthetic canniboids thus far had given me little more than a drunken fog which preceeded hours of uncomfortable body sensations and moderate nausea. His desire for this canniboid began a self created theme he called riding the scorpion. As the night progressed this story evolved into some warrior sexual rite where one would figuratively ride a scorpion but literally tattoo their entire lower body and sexual organs to mimic a kind of mammillian scorpion, with the phallus as the scorpion's stinger. This plot as well as the battleship maritime theme of M's robust doses carried on humorously  throughout the experience. We conceded we had no desire to touch the stuff but told him to go to town with it.  It was around three in the morning. At this point R disappeared and was semi unconscious not too long after.</p><p>It was getting late, or early for that matter. The stove clock said it was around 5 am. The sun would soon arrive and night would depart to the other side of the world.  We smoked a few bowls or marijuana and retreated to the opium den and laid about on couches, pillows, and blankets. M had earlier brought home from work an assortment of pastries that were to be thrown out simply because no one bought them. The sunrise recovery feast was underway, pounds of high quality pastries and brownies vanished before we lost consciousness. Upon opening a window blind slightly, there could be seen a healthy and sunny morning unfolding. The last thing I can recall is observing a scene in Faust where a hand comes out of a shadow, grabs an hourglass, and withdraws with it into the darkness. We were all asleep by 7 am.</p>",
 "year": "2011",
 "id": "92468",
 "gender": "Male",
 "age": "27",
 "timestamp": "2011-08-22T07:00:00.000Z",
 "views": "3173"
}
