{
 "id": 9247,
 "title": "Whatever Goes Up...",
 "date": {
  "submission": "2002-01-18T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "J.",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "80 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Being somewhat wary of drugs I hadn't tried before, I took all 4 of the pills I had (80mg) at around 2pm (hoping that it wouldn't keep me up all night - damn was I wrong).  After about 15-20 minutes, I began to feel only what I could describe as being 'euphorically fuzzy'.  I felt really good emotionally, and my body felt as if waves of energy were pulsating through it (the 'fuzzy' feeling).  I talked to a friend about some personal issues on it, and was able to deal with emotions a lot better than if I was sober.  It was as if I felt at peace with the world, and believed that everything happened for a reason.  Soon enough, this 'fuzzy' feeling ended.",
  "I felt generally energetic, and was in a really good mood.  I ended up cleaning my room (something I am too lazy to do normally) and took a shower.  I talked to some friends on the phone, and went to a rock show.",
  "When I showed up my friends said my lips were all blue and my skin was white, and some girls (who knew I was high) tried to convince me to let them put makeup on me.  I declined their offer and tried to drink as much water as possible, hoping to avoid cottonmouth.  I went home at around 11pm, still high and energetic, and talked on the phone for awhile before going up to my room.",
  "I got in bed and tried to get to sleep for awhile, but couldn't.  I was really hot and sweaty, and would occasionally manage to drift in and out of sleep, but for the most part I just lay in bed.  It was extremely uncomfortable.",
  "I would get up, and look at my arms, thinking they were extremely dirty.  I thought I saw dirt and grime on them, and would try to clean it off by taking showers, etc.  I also felt greasy all over. ",
  "By morning I was coming down, and I felt terrible.  Not only was my body exhausted, but I felt depressed, irritable and generally not in a good mood.  As with all uppers such as meth and coke, the comedowns are especially unpleasant, but unlike meth and even snorting methylphenidate, Adderall's comedown was simply depression and feeling physically bad as well (Meth and snorting methylphenidate comedown's made me really confused and anxious, as well as feeling emotionally low, but physical pain/uncomfortableness wasn't as much a big part of them).",
  "All I can say is, I'd sooner do meth than do Adderall again.  It got so bad to the point where I almost attempted to kill myself, sitting in the bathroom with a razor blade at my wrist and all.  I've never had a problem like that with any other type of speed at all.  I guess whatever goes up must come down."
 ],
 "erowid": {
  "id": "5626",
  "citation": " J.. \"Whatever Goes Up...: experience with Amphetamine (Adderall) (ID 5626)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5626",
  "substance": "Amphetamine (Adderall)",
  "views": "31517"
 }
}
