{
 "id": 9253,
 "title": "Spiritual, Aphrodisiac, and Therapeutic",
 "date": {
  "submission": "2007-03-24T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Sadira",
  "gender": "Female",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Escitalopram",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I use Egyptian Blue Lotus regularly, via tincture,1-4 times per week. In 2003, I researched and purchased two forms of this herb: dried/crushed petals and the tincture. The first time I used it I was alone. I got really sleepy and felt very safe and kind of high but in a very mellow way, where pot feels more harsh/dirty to me. A bit of background/history: I have never tried opiates so I can't compare that high. However I have used several prescription meds to reduce/treat (or attempt to treat) anxiety, panic attacks, depression, insomnia and other symptoms of PTSD (Post Traumatic Stress Disorder), including xanax, which I have never liked to due the sense of being very far away from my body and dissociated, which disturbed me and made me feel out of control and even worse for that than when I dont take anything (for panic attacks). I also take melatonin for a sleep aid occasionally, and vary that with valerian/kava and OTC combos, as well as the occasional Unisom.",
  "When I started using Blue Lotus, I was not on any pharmaceutical meds at all. I currently take Lexapro, an anti-depressant, which has no noticeable side-effects to me. However, to deal with my other symptoms, I find that Blue Lotus is a peaceful, non-invasive, natural way to tend my bodys needs and balance the chemicals/hormones etc that are off balance due to having suffered extreme childhood trauma.",
  "Back to 2003. After my first experience which was very strong, but not at all uncomfortable or overwhelming (I think I took about 8 drops of tincture, the recommended dose on the bottle), which I mostly slept off (a very deep but not dangerously so- peaceful, natural sleep with no after-effects the next morning, no grogginess or sedative-hangover) I thought Id test out the aphrodisiac component of Egyptian Blue Lotus effects with my boyfriend. We steeped tea bags filled with the crushed dried petals in glasses of red wine (probably a decent Shiraz or Merlot) for about an hour and sipped them. Throughout the night we kept sipping the wine and lotus, and proceeded to have the most amazing night of sex ever (ever? Ok, well, it was awesome for both of us.) He had occasionally experienced erectile semi-dysfunction due to depression but the Lotus seemed to take care of that in a big way. Not only were things very functional (ah-hem), but they were functional all night long, well beyond my normal range of 30-something satiation levels and endurance capabilities! It was pretty cool.",
  "After that night, we used Lotus on a regular basis (once to twice a week) before lovemaking to strengthen our bond via his resolve. Subsequent uses did not have the same effect as the initial use, there seemed to be a quick tolerance build up, and we would usually use tincture in red wine or occasionally just the straight tincture. He often smoked pot as well a couple times in the evening and always seemed to enjoy the combo.",
  "Since my current spiritual practice (Im a Latter-Day Saint/ aka Mormon) includes abstaining from alcohol and smoking (and anything classified as illegal here like pot, though herbs are very much approved/supported by Church doctrine), I generally use the tincture in a small amount of water before bed and just drink it- it tastes ok. I sleep peacefully and feel like I actually get to that deep rest that eludes me due to rushing thoughts, worries, anxiety, etc. I also feel good about using Lotus because I have a strong spiritual connection with Ancient Egypt and honored God through that paradigm/system for many years, having many neat spiritual experiences tied into that culture/time. When I first used the Lotus, I was doing an intensive 1  yr clairvoyant (spiritual/psychic) training program and was in a really aware space. I meditated after I took it initially, and had a wonderful experience of kind of like a blessing/healing on my crown chakra from this plant energy/soul and/or associated spirit guides, as well as my brow chakra. I felt like I was getting in touch with a part of myself or my spiritual information that had been missing for millennia.",
  "I pray and meditate often still and receive great comfort from the healing effects of Blue Lotus. I highly recommend it for its relaxing, enjoyable slightly euphoric effects, as a sedative, and as an aphrodisiac. (Incidentally I havent been with anyone else since my last bf and I parted ways in 2004, -its 2006 as I write this, so I dont know what aphrodisiac effects if any it may have on other partners, but I often take Lotus before bed especially if I feel the desire/urge to be intimate with myself, since it helps open up my second chakra and connect me safely to my sexual-spiritual information.)",
  "Incidentally, when I used pot as an adult it often made me feel wasted the next day and out of it, kind of dirty and like I wasnt motivated to do anything functional or productive, and mildly depressed. Sometimes it made me feel very separate from myself and others it triggered flashbacks of when I was being abused as a young adult/child. Blue Lotus has none of these negatives for me, quite the opposite. Ive never had any problems going with Lotus after regular use for a month or more, or any obsessive energy around it or anything. It does feel kind of sacred to me and helps me feel connected with a sense of my own sacredness."
 ],
 "erowid": {
  "id": "56302",
  "citation": " Sadira. \"Spiritual, Aphrodisiac, and Therapeutic: experience with Blue Lotus (ID 56302)\". Erowid.org. Mar 24, 2007. erowid.org/exp/56302",
  "substance": "Blue Lotus",
  "views": "47428"
 }
}
