{
 "title": "Experienced Tripper almost Loses It",
 "author": "That Ghost",
 "citation": " That Ghost. \"Experienced Tripper almost Loses It: experience with \t Products - Spice and Synthetic Cannabinoids (ID 92533)\". Erowid.org. Dec 20, 2011. erowid.org/exp/92533",
 "substance": "\t Products - Spice and Synthetic Cannabinoids",
 "bodyweight": "140 lb",
 "report": [
  "<p>Never again. Its been less than 12 hours since I smoked three or four hits of incense and I can confidently say that I have never been through a worse experience in my life. I wish I could write out a timeline like so many others have. However, I could barely focus on breathing much less tracking time while I was, for lack of a better word, tripping. Let me open this story with a little background about myself. I am an extremely intelligent woman. I just graduated with a double degree, I have a high GRE score, and Ill be working on applying to grad schools shortly. I am not some sort of drug addict, though that does run in my family, but I am an experienced tripper.",
  "At one point in time I thought I would become an addiction counselor and Ive always believed you cant counsel anyone through a situation unless you have insight as to what they are going through. This is what led me to experiment with drugs. Many Ive done just one, specifically to record the effects and feelings associated with those drugs. Ive tried coke once, ecstasy once, oxy once, even heroin once. I fell in love with psychedelics unexpectedly. Thats not to say Im addicted at all. Ive done shrooms twice and LSD eight times over two years (havent touched it in about three just out of respect for my neurological health). The only drug Ive made a habit out of is marijuana and its a very casual habit at that.",
  "I say this all to prove that I am no newb when it comes to holding yourself together on psychedelics. Ive almost freaked out, talked myself through trips, done acid completely alone, and successfully talked other people through freak outs. My mental fortitude is second to very few. Im a strong person, so when I tell you I will NEVER touch this again, you should understand how FUCKED UP this stuff is. My journey began at the head shop last night. Im looking for employment right now, so Im trying to lay off smoking for obvious reasons. I smoked the old chemical form of K2 before it was made illegal, so I was surprised when the owner of the head shop recommended the new chemical form of synthetic THC they created to replace the old (so it would stay legal). I picked up some kratom (my original intention) and a gram of Syn Fire, which was told was the most potent of the brands. Being an experienced smoker I, of course, went for potency. Mistake. My roommate and I got home and immediately packed a bowl, excited that our old favorite (K2) was still around. It was a little difficult to light the bowl at first, so I took a few hits right off the bat. My roommate had two...only two. I had maybe four. We decided to stop after that, due to the small amount I had purchased. I try to make things last.",
  "I am so glad we stopped there. As we got higher, I monologued my experiences to my roommate. It went something like this. Im really stoned...good job. You finally pulled through....woah, dude. Im like really high! This is awesome! ...wow Im almost too high. ...I am too high... I dont know if I like this... I dont like this. It really happened almost that quickly. I expected it to plateau like marijuana does, but it just kept going. The high increased exponentially until I was tripping. This wasn't like weed or the old K2 I smoked. This wasnt even like LSD or shrooms. This was a new, awful experience. I assume my heart was racing, but I couldnt feel it. My head was completely disconnected from my body. I couldnt feel my extremities. I felt like each breath wasnt enough. I started breathing as deeply as I could, but it never seemed like I enough. I was just suddenly in a state of extreme terror. I couldnt focus on anything too long, and I was dizzy as hell. I could only hope my roommate wasnt experiencing the same thing.",
  "Now, as I said, Im an experienced tripper, so I tried to talk myself down. I have never had a bad trip. I feel that demonstrates that what I was going through last night was ridiculous. I, someone who always has control over themselves and the situation, almost started screaming and clawing at my face. Only holding onto my roommate and talking myself down was keeping me from completely losing it. After a half an hour the effects had not dissipated. It came in waves. Every time I thought I was coming down, I would just hop right back up to another level of high. I just had this sense of impending doom. Thats not the right way to put it, but there is no right way. I just felt that something was wrong and I didnt like it. All I wanted it to do was stop. I begged for it to stop, but substances, obviously, dont heed our cries. After about an hour I started feeling better... at least my head did. The muscles in my legs began to twitch violently, eventually spreading to my entire body, and only extreme efforts to relax kept my from convulsing. I have never felt the urge to call 911 before, but I seriously considered it multiple times last night.",
  "I thought I was going to die. I did. I have never felt like that in all my years of tripping and smoking. Thankfully, after about two hours, I came down enough to relax a bit, but a slight feeling of anxiety stayed with me throughout the night. I took my hits at about 9:15 or 9:30pm. By 11:30pm I was alright, but I didnt fall asleep till after 2 o clock in the morning, which is unusual for me, yet I woke up at 6:45 this morning unable to fall back asleep. I dont want to be asleep. I want to be awake, alive, and not panicking. Still, even as I type this at 8:30, eleven hours after my first hit, Im trembling slightly and my eyes are having some trouble focusing. The come down was awful. I felt like I might vomit and the headache is extremely annoying. I still have both symptoms, making me regret, even more, the misguided decision to try a chemical synthetic of something so natural and pure. What really scared me was the involuntary muscle spasms. I reminded myself of a Parkinsons patient. Theres a famous study involving heroin addicts that had them use a form a synthetic heroin... The subjects exhibited symptoms of Parkinsons. Synthetic HEROIN! What the hell are they putting in this stuff?! I feel the fool for putting something so unknown into myself and can only hope I havent done any permanent damage to myself.",
  "I will NEVER try this substance again, nor will I use a psychedelic again for fear of falling back into that terrible state of being again. That is a place I dont want to visit ever again. Im so thankful we stopped after only a few hits and that I had a friend to help me through it. She, by the way, had less than I did, but still did not enjoy the feeling. Its unsettling. Thats the only way to describe it. If I, a practiced tripper who can talk herself down from almost anything, had to put all my inner strength into not breaking down screaming, clawing at my face, and convulsing on the floor there is something wrong with that incense. Never again.</p>"
 ],
 "year": "2010",
 "id": "92533",
 "gender": "Female",
 "age": "23",
 "views": "9466",
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2011-12-20T08:00:00.000Z"
}
