{
 "id": 926,
 "title": "Death and Insanity",
 "date": {
  "submission": "2004-09-10T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "sessile",
  "gender": "Female",
  "weight": 51
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(cookie / food)"
  }
 ],
 "report": [
  "It's Valentine's Day and I'm spending time with my boyfriend. He gives me a small chunk of a 'special' cookie. It tastes all right and very, well, special. But I forget about it, because it's such an insignificant amount and weed is not a big thing with me.",
  "We sit down to watch The Original Kings of Comedy, and I'm having a good time for a while. It's when Steve Harvey launches into his bit about how much rap shows suck do I suddenly realize that I have lost the ability to *think*. I'm trying to track Steve Harvey's joke, but I can't remember what he said. I try to hold onto a couple of sentences, but I can't connect them together into order to get a sense of the joke. My short-term memory has ceased to exist. My sense of time becomes dead-locked. I don't remember what just happened to me, I can't put together information, my mind is looped on thoughts of 'What the fuck is wrong with me?' I think I've gone insane; I've discovered what separates the insane from the normal. Maybe I should kill myself, to stop this. I climb up onto my boyfriend (whom I just realized is still there) and lie on top of him. The candle I'm staring at has a brilliant glow around it, and I feel myself drifting off. I can't think, I can't imagine things, my mind is degenerating, my body as well--all along my spinal cord it's warm, almost burning, and tingling--I must be dying.",
  "Maybe my boyfriend should call the hospital, I'm dying.  When I'm about to surrender to God or oblivion, somehow I connect unconsciously (certainly not consciously) the fucking cookie to my present state. I manage to confirm this with my boyfriend, who laughs at what I've been feeling. He's had far more experience with drugs than me, so it's reassuring that I'm not dying or have gone insane, but it doesn't change the fact that *I can't think*. Cedric the Entertainer is beyond my facilities at this point. The hair in my face is too much for me, but bringing my hand up to my face feels like an awesome task because I can't imagine the shape and structure of my face. Eyes are up here, nose is around here--but where's the rest? Where would my hair fall? Only when my hand is actually touching my face do I realize where everything is.",
  "This goes on until the end of the movie. There are periods where I feel like I'm suffocating, where getting up is an elaborate coordination of mind and body, where my boyfriend and myself feel so unreal that I gotta poke them and hurt them to comprehend that they're there.... I'm not able to wait for things to go away because I can't perceive time.",
  "Thankfully I fall asleep and feel relatively normal when I wake up. The unreality is still residual--hugging my boyfriend, whom I love, good-bye for the day feels like I'm holding a stranger. My memory is still a little shot--two college lectures go by me with only some notes written verbatim to show for it. Hopefully, the weed will leave my system quick.",
  "Smoking weed has never really registered with me, until now. And all I have to say is, fuck this shit."
 ],
 "erowid": {
  "id": "12643",
  "citation": " sessile. \"Death and Insanity: experience with Cannabis (ID 12643)\". Erowid.org. Sep 10, 2004. erowid.org/exp/12643",
  "substance": "Cannabis",
  "views": "5446"
 }
}
