{
 "title": "Touched by the God Particle",
 "author": "anonymous",
 "citation": " anonymous. \"Touched by the God Particle: experience with DMT & Cannabis (ID 92625)\". Erowid.org. Oct 19, 2012. erowid.org/exp/92625",
 "substance": "DMT & Cannabis",
 "bodyweight": "190 lb",
 "report": "<p>Im writing this trip report a little less than a week after it happened. While the visions and actual experiences have faded greatly, I have been able to digest and better assimilate my trip with reality, or at least this reality. Im also going to describe the night leading up to the trip as I believe it has great importance. If you want to skip straight to the trip I have marked where it begins.</p><p>POP! The sound of a giant balloon exploding briefly deafened my three friends and I. Almost instantaneously after a blinding light, brighter than any firework Ive ever seen, burst through the edges of the closed door. No one speaks for a couple seconds. What just happened? Did the door just get struck by lightening? Yes, it must have, after all it is storming outside. But when we go check, the door and everything outside is completely fine, even the rain is starting to succeed. We contemplate the possibilities of what this intense flash experience could have been. Was it lightening, was it a natural phenomenon, was it only in our minds, what would have happened if we had been on the other side of the door? These thoughts are racing through everyones head as we slowly come back to reality from the adrenaline rush. We had been preparing to leave for New Orleans when the lightening had struck our door. After everyone gathers their thoughts and nerves we head out the door and get in my friends car anticipating a wonderful night in New Orleans.</p><p>For some context, were 4 college students around the ages of 19/20. For privacy sake well say my friends names our D, M, and N. We were going to New Orleans for a concert, and its the Thursday before classes begin. The summer is drawing to an end and no one wants to admit it, but this will be our last night out and we want to make it a great one. Were also going to meet up with another one of our good friends who had been in Europe for 5 weeks. On the ride down we talk about our plans to hopefully find some acid. There is also some brief discussion about the allusive DMT, but there is no expectation of finding this drug anytime soon. The one hour drive to NOLA goes by extremely fast and before we know it were at my friends house (the one who just got back from Europe). Its a great reunion, we all share hugs and hop back in the car getting ready to head downtown. In the car there is some more discussion on the hope of finding psychedelics and we share stories from the past five weeks with our European traveler. We park the car.</p><p>The rest of the night doesnt need a play by play, but it was unusually great!! We enjoyed some time outside in the French quarter before heading to the show, and then once arriving to the bar indulged in some of the best hookah Ive ever had. I saw some friends who I hadnt expected to see and everything seemed to be falling in place, the only thing we needed now was psychedelics. The crowd was starting to grow and the headliners were preparing to come on, time to start the search. After some failed attempts I struck gold. While asking for acid someone said they had some deemsters, I stared at them for about 5 seconds as if they were joking. Was this happening? Had I just found DMT? The universe seemed to be aligning and I was at the center.Maybe it was the lightening</p><p>So I bought the remaining DMT that he had, which was about .2 g, and enjoyed the rest of the show. The show was great, a ton of fun and best of all we were completely sober. We got to talk to the artists and enjoyed ourselves to the fullest. We head to our car once the show ended around 2 am and start the drive home. I would usually be tired after dancing all night, but the anticipation of the DMT experience is keeping me awake. The drive home flys by faster than I ever could imagine, and before I know it Im sitting on a bean bag in my living room holding a bowl of DMT. There was roughly about .04 g in the bowl. Am I ready for this? The answer truthfully is no, but I dont think I ever will be, so here it goes.</p><p>The Beginning of the Trip</p><p>I take the first hit and hold it in for ten seconds. So far so good. The second hit I do the same, at the exhale I notice that my entire body feels like its glowing with warmth. I pass the bowl to my friend to hold the bowl while I take the third hit. I take it and immediately notice everything starting to move in a melting way, similar to acid visuals, but way faster and stronger. After inhaling I say Fuck. Here it goes. I lay down on my bean bag as I exhale my third hit. I notice the carrier frequency and its starts to build with incredible speed. Then I notice that the warmth I felt before has become this frequency, this is the frequency of life, and it keeps building. As it builds the frequency in my body quickly moves up into my head. My head feels like it explodes and I break through. At this point I have no control over my body.</p><p>I see beautiful geometric patterns and colors. Everything seems very cartoon like. Everything was constantly moving but in an orderly way that I could never understand or comprehend. The only thing I could relate it to would be the intro to saved by the bell, with all the shapes and patterns moving over a colorful background. In no way was it like this, but its the closest thing I can relate to. Visions seemed to be folding in and out of each other. At one point I remember flying over a highway lit by streetlights being led by a ghostly entity. I also remember briefly seeing my body, and it looked like I was dead, or just really still. These visions were wonderful and beautiful beyond belief, but the speed that I encountered them at was overwhelming to say the least. I believe there were more visions during the time that I was in this realm, but similar to a dream I think I could only remember that last couple ones I experienced before coming back to this reality.</p><p>Time doesnt exist in this realm, when I came out I expected about 30 min had gone by, and that was a conservative guess, when in reality only 3.5 minutes had elapsed. When I broke through, my body immediately tensed up. Its very similar to being paralyzed by fear, but there was no fear in this experience, only beauty in the most intense raw form. Being shot out of a cannon, while such a clich comparison, is literally the best way to describe the experience. After the first 4 minutes the rush resides into a beautiful glow, the closed eyed visuals recede to more tame and recognizable geometric patterns while open eyed visuals are still very strong and acid like. I lay down staring at the ceiling as the visual of an elephant with nine heads is created among the texture of the ceiling. The trunks of the elephants are elongating and weaving in and out of each other forming a Celtic like pattern as they reach for what I perceive as water or some life giving substance. The movement of the trunks is very snakelike, but there is no negative connotation towards it. After 15 minutes the visuals subside and Im baseline with a wonderful afterglow. I say Im never doing DMT again. I lie.</p><p>The first thing I notice is that a muscle in my back thats been bothering me for about a day is now throbbing. Im too mentally exhausted to even give it much attention so I let it slide as D prepares the bowl for his experience. I continue to lay on the floor as I try to digest what the fuck just happened. The strangest thing about the DMT experience is that it is so intense, but so fleeting. After an hour I had almost convinced myself that it didnt even happen. Everyone else takes their three hits separately and has their experience. No ones trip comes close to the intensity of mine and they seem to have a much more comfortable experience. I can relate somewhat to what they saw and experienced, but the sheer intensity that paralyzed me isnt mentioned once among them. This is what causes me to doubt my experience, and I almost convince myself that I made it up. The pain in my back is almost unbearable and I ask my friend M to massage my back. Its about an hour after everyone had the trip, so about 2 hours for me. M is still massaging my back, Im lying on my stomach, and I ask for the bowl. I plan on burning up the rest of the remaining bud that we had put below the DMT to make sure it didnt fall through. I expect to get mostly weed and maybe some cool visuals from a little DMT but nothing comparable to my previous experience, I was wrong. </p><p>I take three quick hits and immediately realize what I had done. The world starts to melt away and I realize that this dose is much higher than my previous one. Right after this thought crosses my mind Im immediately teleported back to this mystical realm and I lose all contact with my body. Memories of the first trip and possibly past deaths flood my brain. The feeling was very similar to the first trip, but there was an added electrical feeling, as if I was inside a lightening cloud. I could hear static charges all around me and I could even feel them in my body, but it wasnt painful. I didnt feel like I was actually getting shocked but rather I felt full of electricity. The visuals this time were much more intense and had way more depth, an infinite amount of dimensions. The first trip felt like I was watching a 3d television while this trip felt like I was actually physically in this alternate dimension. Once again I feel like I forgot many of the visions I had during this second trip, but the one that stuck with me was of a structure very similar to what you would see in a Dr. Seuss book. But it wasnt stationary, it was constantly being constructed and destroyed at the same time, as well as folding in and out of itself in infinite dimensions. Once again everything seemed very cartoon like, but the colors this time around were focused heavily on green and purple. I briefly remember seeing a green entity but it didnt have very distinct features. It was small and box like similar to a little tiki man, but nothing like it. He seemed to be riding this structure as if it was a wave, he came into my vision and then left immediately. A flash of the divine.</p><p>My body is lying face down on the ground, when I open my eyes the lack of depth in the floor seems to fly up and slap my face. I realize how flat this world is in comparison to the depth of the DMT realm. Once again the experience inside the alternate realm lasted about 4 minutes. The comedown was similar to the first trip but this second experience had affected me way more than the first one. After 20 minutes I was baseline, but this afterglow is completely blissfull. This second trip leaves me lost for words. I try to explain but nothing seems to capture my sense of awe.</p><p>Its about 6 in the morning, we smoke some weed and go get some breakfast. In the car I spontaneously yell, I feel amazing![Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  My friends find this funny, but truthfully I feel better than I ever have in my life, and I dont feel like Im on drugs, I feel more sober than Ive ever been. After breakfast my friends D and N go back to their place to sleep while M and I stay up listening to some music and slowly pass out. I get about an hour of sleep in before I have to get up and go to work. Waking up is rough and Im not looking forward to working, but it must be done. I take a shower and head out the door.</p><p>Work goes by extremely fast. I seem to be in the best mood ever and Im extremely friendly even to complete strangers. Im usually pretty reserved around people I dont know, but today Im very calm and friendly willing to talk to anyone about anything. I realize that the lessons you learn from the DMT experience dont necessarily come from interpreting the visions and visuals, but rather from your reaction to the experience. How you respond to this intense flash experience is the lesson learned. As the day goes on I notice a large amount of ego loss, the most Ive ever experienced. I seem to have no opinion on anything, just understanding. I dont feel happy nor sad, but rather joyful, blissful, content.</p><p>After a week, Im still in this amazing mindset. It has diminished greatly compared to the day immediately after the experience but I still have a very ego-less perspective. I also feel almost divinely guided, as if everything in my life is and always has been leading up to the now in the most purposeful way. I am eternally grateful for DMT. It is definitely not a drug to be taken lightly and should be given the upmost respect. I dont think I will try it again anytime soon for I feel I still have much to learn from these two intense experiences. This report is already longer than I had anticipated so Im going to go ahead and end it, but there is so much more that I couldnt put into words. My advice for anyone taking DMT is to have no expectation. I did not expect to trip the second time and I believe this lack of expectation let me go much deeper into the trip and let me truly experience it. Also dont think, after I took the third hit, I sat back and just experienced. I had time to process after you come out. In my first trip I was almost too aware of everyone watching me and I believe this took me out of the trip somewhat. I dont know if the lightening strike was divine intervention or a flash of the DMT trip to come, but I am sure that everything happens for a reason, and that reason is because it happens. I hope this report is helpful. Peace, love, and understanding.</p>",
 "year": "2011",
 "id": "92625",
 "gender": "Male",
 "age": "20",
 "timestamp": "2012-10-19T07:00:00.000Z",
 "views": "5763",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "DMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
