{
 "title": "Foxy Perception",
 "author": "Lilith V.",
 "citation": " Lilith V.. \"Foxy Perception: experience with 5-MeO-DiPT (ID 9268)\". Erowid.org. Dec 13, 2001. erowid.org/exp/9268",
 "substance": "5-MeO-DiPT",
 "bodyweight": "170 lb",
 "report": "<p>Several hours before dropping I drank 2 beers and a glass of wine.</p><p>Also took 16 mg of codeine 1   hours before dropping.  I took the codeine for lower back pain.  The 5-MeO-DIPT had no effect on the pain.  Once the codeine wore off I felt the pain again, even though I was still tripping.  </p><p>Dropped at 12:30am</p><p>A friend and I divided up 25mg of powder between the 2 of us.  I wrapped the powder in a small damp piece of toilet paper and swallowed it.  The taste was bitter, so I ate a bite of steak to hide the flavor.</p><p>After about 40 minutes, I feel a warm, pleasant body high, a bit like my skin is vibrating at a very low speed. I lose my ability to keep track of time.  I feel mild nausea from time to time for about an hour.  The nausea keeps me from moving around too much.  I lounge on a futon covered with pillows and cuddle with my friends until the nausea subsides.</p><p>I pick up some devil sticks, (juggling toys) and begin to play with them. A friend of mine begins to teach me some tricks.  I am able to focus on learning tricks with them for what seems to me a very long time.  I also feel a strong connection with the guy who is teaching me.  It seems he knows exactly what to say, or what to show me in order for me to learn the tricks.</p><p>4:45am decide that I am sober enough to drive home.  I find it difficult to focus on all the many tasks necessary for driving.  A simple road sign is confusing and difficult to understand. When I get to an intersection several blocks from my house I become disoriented and forget where I am. I figure it out again, and continue home.</p><p>Throughout the drive, I alternately feel paranoia and then awe when I notice a new stimulus that is pleasant to me, such as the color of the sky or the shape of trees.  Lights seem brighter, more sparkly.  I also have mild hallucinations.  Once in a while out of the corner of my eye I see something move that is not there.  I keep thinking that there are people on the side of the road, I see them in the periphery of my vision.</p><p>5:45am  heightened sensory input.  Skin ultra sensitive to temperatures and textures.  I take a hot shower and it is pure ecstasy.  </p><p>I fall asleep easily around 6:30am. </p><p>The following day I experience constipation.  Aside from that I feel completely normal.</p>",
 "year": "2001",
 "id": "9268",
 "gender": "Female",
 "timestamp": "2001-12-13T08:00:00.000Z",
 "views": "8462",
 "dose": [
  {
   "time": "0",
   "amount": "12.5 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ]
}
