{
 "title": "Should've Called Poison Control Bro",
 "author": "ilovethagreenery",
 "citation": " ilovethagreenery. \"Should've Called Poison Control Bro: experience with Products - Spice and Synthetic Cannabinoids ('Diamond Dove') & Alcohol (ID 92698)\". Erowid.org. Jan 6, 2012. erowid.org/exp/92698",
 "substance": "Products - Spice and Synthetic Cannabinoids ('Diamond Dove') & Alcohol",
 "bodyweight": "150 lb",
 "report": "<p>I was at a party with my girlfriend and I did not have any bud, so I bought some synthetics called 'Diamond Dove'. I arrived at the party and I started to drink some vodka. I was drunk and had ran out of alcohol. I wasnt satisfied of how fucked up I was so I took out my Diamond Dove and packed a bowl. I had only taken 2 hits and about 10 seconds later I had felt the following:</p><p>-my heart beat was 3 beats per second, at 180bpm, 2nd degree hypertension.</p><p>-I was leaning sideways when walking and all sounds echoed strongly</p><p>-my vision would pulse everytime my heart beated</p><p>-my vision was extremely swirly like a horizontal S and moved not stop like a wave.</p><p>-my reaction time a about 5 seconds</p><p>-I collapsed on the balcony against the railing and was in aw when looking at        everyone staring at me</p><p>-many people tried to help me but I kicked them away because I thought they were going to kill me</p><p>-I was screaming at the top of my lungs 'go away!'</p><p>-my speech was slurred to where it would only be mumbles and grunts (I was actually trying to say a full sentence)</p><p>-I had sat on the railing for about 15 to 30 mins</p><p>-when my girlfriend tried for 15 mins to get me up and to the car so she could help</p><p>-when I had gotten up I fell again</p><p>-eventually she got me up and literally was holding my whole body up</p><p>-I punched her in the face leaving her with a black eye (she told me that the next morning because I did not remember)</p><p>-I passed out in the car</p><p>-woke up in the car near my house with my best friend in the drivers seat</p><p>-I tried with all I had to just move my arm and when I did I threw up from the movement</p><p>-I got the bed spins in the car and passed out again.</p><p>- 2hrs had passed and my heart rate had not decreased</p><p>- I had a seizure (yes a real seizure) and my friend had to help me</p><p>-they had spent 30 mins to get me out of the car but I would refuse.</p><p>-stumbled inside and luckily no one was home</p><p>- passed out on my bed</p><p>-woke up and I did not remember a single thing (not exaggerating, and my memory had come to me weeks later)</p><p>The day after that night I had gone out with my friends and smoked more, geeking about what had happened. You can never stop a true stoner from smoking.</p>",
 "year": "2011",
 "id": "92698",
 "gender": "Male",
 "age": "16",
 "timestamp": "2012-01-06T08:00:00.000Z",
 "views": "4357",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol - Hard"
  },
  "1": {
   "time": "",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  }
 }
}
