{
 "title": "The One Bad Time",
 "author": "JCM",
 "citation": " JCM. \"The One Bad Time: experience with Cannabis & Tobacco (ID 92750)\". Erowid.org. Nov 1, 2011. erowid.org/exp/92750",
 "substance": "Cannabis & Tobacco",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cannabis",
   "",
   " ",
   "smoked",
   "Tobacco"
  ]
 ],
 "report": "<p>I had been smoking marijuana for over a year now, so I felt as if I were a professional. Nothing could scare me or change the way I felt about it. It was always a perfect high, I was happy, and ended in a sleepy, smiley, daze, ready to think and dream about crazy combinations of things that I would never think of without the use of it.</p><p>One time, though, was different. I was with a boyfriend of mine at the time, a very comfortable situation, and two more of his friends. We were all in a park at night, ready to take our hits of the blunt (rolled in a cigar) and to relax. Excited as usual, I went on to smoke.</p><p>As I was smoking, I noticed something different. I would look at my boyfriend and ask him 'are you angry at me?', repeatedly. Now, I'm not the type to be paranoid when I was getting high, but I just guessed that I was feeling a bit of that, which was normal. The abnormal part was that I couldn't remember if I had asked him seconds ago, or if it was just in my head. As I asked him 5 or more times (this is actually just an estimate since even to this day I cannot tell if I was just in my head or actually vocalizing these questions) he actually was getting annoyed, so I asked him if we could leave. Walking in a dark park with just my boyfriend I noticed more and more that I could not decipher if what I was 'saying' was actually coming out of my mouth or I was just creating conversations over and over in my head. I repeated questions and questions that ended with 'Wait... did I already ask that? I think I did, didn't I?' and were responded with 'Yes, you just asked me that' or 'No. you haven't yet'</p><p>I quickly felt more and more scared of whether or not I was losing my mind or if this was just all normal, and since no one else had felt the same way that I had, I assumed that this was just me losing my mind, which had not helped.</p><p>As I walked on, my boyfriend had successfully: convinced me that I was in a different town than we actually were in, that it was 2 or 3 in the morning, and stolen my cellphone, just because he had thought it was funny.</p><p>The breaking point was at the end of the road as I saw flashing lights and heard loud noises coming, and after that I had broke down in tears. I held my boyfriend and he had finally seen that I did not see this as funny, so he told me the truth. That he was holding my cell so I wouldn't lose it, that we had only walked about 1 mile in the same town, and that it was only 10pm. Feeling a bit better, we walked back to his house.</p><p>There I found myself extremely confused and crying again, only to sleep it off. I fell asleep crying there and woke up at a very normal high. I proceeded to go home and eat some munchies and reminded myself that I would not smoke for a couple of weeks.</p><p>This experience was different than any others I had, yet unfortunately the next time I got high (which was from brownies in school, a whole other bad story) the same thing happened. Other than that, nothing like that has ever happened.</p><p>Enjoy!</p>",
 "year": "2009",
 "id": "92750",
 "gender": "Female",
 "age": "15",
 "timestamp": "2011-11-01T07:00:00.000Z",
 "views": "2871",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
