{
 "id": 9276,
 "title": "Eons Eons Eons",
 "date": {
  "submission": "2007-02-12T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Evan",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "plant material",
   "specific": "P. cubensis"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "On the last day of September, 2006, a group of friends and I gathered at about 6:00 with the intention to eat mushrooms together. We had recently been notified by a local dealer that there were good shrooms available, and that we could buy up to an ounce. We ended up purchasing a total of almost  of an ounce, I believe, split between four of us, to varying amounts. I ate about 1/6 of an ounce, my fellow psychonaut, who we will call Rhino, ate approximately the same. Two others, who well call Pangborn and Goofy, ate about 1/15th each. The measurements were not conducted on a scale, so exact amounts of mushrooms consumed are not available. Needless, to say, we has all taken high doses, considering it was a first true trip for most of us.",
  "We ingested the mushrooms, as is, at about 7:15. We all drank a small amount of orange juice to help with the taste, which was not all that bad. Rhino tripped on an empty stomach, I had some peach rings and a sandwich before tripping. We hit my ice bong a few times to help with any nausea we were to encounter. We moved inside and sat on the couch, waiting. I, personally, enjoy that short period of time between where you are and where you are going, when you are waiting for your drug of choice to sit in. I like the adrenaline you feel as you anticipate the new feelings you are about to discover. However, tonight was different, and I was a little antsy, perhaps because I had read that if you ate the wrong type of mushrooms, you would die a most certainly painful death. I wondered where on earth these ones came from.",
  "At about 7:45 I was feeling the first fingers touching out to me. We were outside, hitting the bong, when Rhino put on the music. I had never liked The Beatles as much as some people, but it sounded right tonight. The music was somehow much more interesting than it usually was. It was around Feel Good, Inc. that I really started to feel a difference. I felt like the music was coming in waves and gently pushing against my face. The music seemed to awaken my brain, and pull it out of a sleeping state.",
  "Before long, my brain seemed like it was pushing on the inside of my skull, like it was getting bigger. Not a headache, exactly, more like I was learning so much in my thoughts that I needed more space for my mind. My first hallucination occurred as I attempted to smoke a bowl of shake. I watched, in the dark, as the small buds caught alight and burned. Suddenly, I was out of my body, and one of those thousands of tiny flaming particles. I was sucked down from the bowl of the pipe, into the long chamber. I rushed down the chamber, and into a gaping mouth. I burned my way down my own throat, and into a large, cavernous set of lungs. About here I snapped out of the vision, coughing wildly. It was like being hit by a train, as I had grown quite accustom to smoking my smooth little ice-bong, Ghengis. The harsh smoke from the bowl literally knocked me backwards, off my feet, dropping the pipe, and against the wall of the house.",
  "I also noticed other visual affects, like the stars above. When someone lit my bong, the darkness was interrupted, and the lighter through a picture of flame through the clearness of my fluorescent orange bong. It looked like a graphic novel picture, like something from A Scanner Darkly. Very impressive.",
  "At about 8:15, it became clear Rhino was having a bad trip. He was upset, because we were at his house and did not want his parents to return to find us tripping. Even though they were not due back till after 10, we left to calm him down. I started to walk home.",
  "Things became rather blurry, and I began to see tracers, following things as they moved. The street lights took on a glowing and magical appearance, while I contemplated my life. I dont remember getting home, but I do remember sending my brother upstairs and listening to music for about 2 hours, enchanted. I really felt like I could touch the music. John Coltrane never sounded so good.",
  "All the while, as I listened to music, I thought about my life, and what I wanted out of it. Too many thoughts crossed my mind to remember them all, but it seemed like the general messages were telling me to stop worrying, and life in the present, and that what I really needed was love to make a majority of my problems go away. This was a wonderful experience, and it made me realize some of the things I was missing in my life.",
  "I think it dramatically helped me get my head in the right place, and aided my mental toughness when it comes to my sport, long distance running. I had been unable to completely expend all my energy in races, and I realized this was because I was not living in the race as much as I should be. These amazing mushrooms cured one of my biggest problems in a single night. I eventually went upstairs, and entered the bathroom. I watched myself in the mirror, as everything around me seemed to inhale and exhale. I looked at my face and was enamored for nearly 10 minutes, looking at my own eyes.",
  "I then stumbles into my bed, pulled up the covers, and listened the Johnny Cash song Highwayman on repeat. What a trippy piece. The themes of life after death and never ending existence blew my mind. Cashs deep voice and lyrics were perfect for the setting. I drifted off to sleep as I looked up at the stars above me. I thought that there was no roof above my head and that I was out in the wilderness. Amazing.",
  "I fly a starship across the Universe divide",
  "And when I reach the other side",
  "I'll find a place to rest my spirit if I can",
  "Perhaps I may become a highwayman again",
  "Or I may simply be a single drop of rain",
  "But I will remain",
  "And I'll be back again, and again and again and again and again",
  "My spirit seemed like it ran forever that night. I swear I thought about everyone I ever knew. My mind games lasted so long. I have experience eons, eons, eons, in moments, moments, moments."
 ],
 "erowid": {
  "id": "56370",
  "citation": " Evan. \"Eons Eons Eons: experience with Mushrooms (P. cubensis) & Cannabis (ID 56370)\". Erowid.org. Feb 12, 2007. erowid.org/exp/56370",
  "substance": "Mushrooms (P. cubensis) & Cannabis",
  "views": "7100"
 }
}
