{
 "id": 928,
 "title": "Not So Useful for Studying",
 "date": {
  "submission": "2003-05-10T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mota",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "8.0"
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30"
   },
   "administration": "insufflated",
   "substance": "Modafinil",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "It was a saturday afternoon on campus.  My freinds went to look at apartments, so I decided it would be a good idea to work on homework. I often insufflate (snort) Adderall to do homework, I find it almost fun to work on homework (even math) when Adderall is rushing through my veins. I had 1 30mg tablet of Adderall and a 200 mg tablet of provigil.  I crushed up a little more than 1/4 of the Adderall pill and insufflated it.  After taking the Adderall I felt the very slight effects of 8 mg of adderall. I have been taking some kind of ADHD stimulant (ritalin, cylert, dexedrine, desoxyn, Adderall etc. etc.) for about 15 years now, and Adderall doesn't do as much for me as it does many people. ",
  "I then ground up the entire provigil pill and began insufflating small amounts of it until after 5 minutes or so maybe 1/6th of the pill was gone.  After taking the provigil I began to feel the Adderall more intensely, and could tell the provigil had a feel of it own, less pushy and less speedy but perhaps more stimulating overall.  The feeling was somewhat similar to what 100 mg of Adderall will do to me, however the feeling was much different than speed alone, and the duration was much shorter (about a half hour of really feeling up, with after effects of perhaps 5 hours). I think insufflating provigil with speed is interesting if you like bad drip taste and a euphoric high, but it is not so useful for studying.  The provigil added much more to the euphoria than to the concentration or speed.  The provigil seemes to also make me think alot which might make it good for critical thinking or writing a paper, but not too good for studying notes or doing math homework, it tends to create distracting thoughts."
 ],
 "erowid": {
  "id": "12651",
  "citation": " Mota. \"Not So Useful for Studying: experience with Modafinil & Amphetamines (Adderall) (ID 12651)\". Erowid.org. May 10, 2003. erowid.org/exp/12651",
  "substance": "Modafinil & Amphetamines (Adderall)",
  "views": "43265"
 }
}
