{
 "id": 9284,
 "title": "The Night",
 "date": {
  "submission": "2000-09-14T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cmc007",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter / tab"
  }
 ],
 "report": [
  "I will never forget the night I first tried lsd.  I was 15 years old and a freshman in highschool.  It was a cool summer evening and the sky was very clear.  Like many other teens I had already experimented with marijuana and was starting to become one of it's biggest fans.  It was one of those spur of the moment kind of things like many teenagers do.",
  "My best friend Jay and I went to another friend's house nicknamed ODB.  He was already big in to drugs, so over the past months he had been transforming his room in to a 'hippie's paradise'.  He had blacklights, posters, some he had bought and some he had made himself.  We walked in to ODB's room and he was already preparing for the 'big night'.  Making his bed and setting up a T.V. that we never ended up watching.  He was running around frantically cleaning his room and putting up a couple more posters.",
  "I remember walking in to his closet and seeing blacklight posters and other things that may amuse us later.  Soon after ODB was finished, another one of my good friends, Beast came over.  He was the one with the stuff.  He eagerly handed out the mysterious drug.  Jay and I only took one hit because we were kind of sketchy about it.  But ODB and Beast being the 'pro's' took two apiece.",
  "The waiting was the only bad part of the night.  I had never done acid before so the anxiety was almost unbearable.  Jay and I had to go visit my girlfriend at another guy's house.  The walk over there was fun and seemed unusually short.  I had this great feeling inside me, like I was the happiest guy on the face of the planet.  It felt like there were a million things to do and I wanted to do them all but there wasn't enough time.  The simplest things seemed amusing and interesting to me.  I wanted to pet that dog, or go into that store.  I wanted swing on the swings and throw around rocks.  Just stupid little things like that.  I wasn't for sure if it had kicked in all the way at that point but I was pretty sure that something abnormal was going on.",
  "My girlfriend took us to a party where they were watching some older horror movies.  The waiting dragged on but it wasn't until the middle of Texas Chainsaw Massacre the fun truely began.  It was about 10 guys and girls crammed into a dark small living room.  Most of the kids were straight edge, which meant that they did nothing that would harm their body and never consumed foriegn substances that would impair them in any way.  There we were, Jay and I in the middle of the dark living room floor laughing hysterically at what was supposed to be the scariest part.  I felt like I could see in all directions without even turning my head.  Everything around me seemed to creep slowly toward me as if to tickle me.  This made me laugh even more.  I looked at Jay and he just didn't seem to look 100% right.  I then realized it was because he looked taller and stretched out like bubblegum.  I knew at that point the lsd had taken it's effect on me. ",
  "I felt like was part of the room instead of just a guest sitting in it.  It was an undescribable feeling.  Jay and I were so excited that we had to meet back up with ODB and Beast.  The walk back to ODB's house was like nothing I've ever experienced before.  Cigarettes were like a gourmet meal and they went down like water.  I went through a half of a pack on the half mile walk.",
  "When we got back to ODB's house and met up with him and Beast, we shared a look as if to say to each other 'This stuff is the shit'.  We all knew how each other was feeling.  The scene that night was like one out of a hippie movie.  The 4 of us were crammed into ODB's small walk-in closet with his blacklights on and the song by Oasis 'champagne supernova' on repeat.  We just layed there and talked and laughed and joked around like most immature teenagers did.  At that point I felt the closest to my friends than I ever have before.  We sat their sharing memories and remeniscing about past summers of skateboarding and smoking pot.  Sometimes Beast, right out of nowhere would pick up his leg and say 'Hey guys I found this leg just sittin here.  What should I do with it?'  It was stupid but very amusing to us at the time.",
  "As it started to get later and later then earlier and earlier we could tell that the acid was starting to lose it's effects.  The 4 of us went outside to pass around a couple of joints Beast had on him.  What can I say?  The kid came prepared.  After the joints I felt like I was tripping again.  We went back in to ODB's house as quiet as 4 tripping kids could have.  We laid down a little more and declared ourselves drug buddies. Unfortunately the pot took it's effect too and over powered the faint traces left of the acid.  We all ended up falling asleep around 5:00 am.  Poor ODB had to go to hockey practice the next day but me Beast and Jay didn't care, at least we got to sleep in."
 ],
 "erowid": {
  "id": "564",
  "citation": " Cmc007. \"The Night: experience with LSD (ID 564)\". Erowid.org. Sep 14, 2000. erowid.org/exp/564",
  "substance": "LSD",
  "views": "11086"
 }
}
