{
 "title": "Kittyflipping... almost.",
 "author": "idonthaveapseudonym",
 "citation": " idonthaveapseudonym. \"Kittyflipping... almost.: experience with MDA. Cannabis & Methoxetamine  (ID 92855)\". Erowid.org. Nov 6, 2011. erowid.org/exp/92855",
 "substance": "MDA. Cannabis & Methoxetamine ",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "MDA",
   "(pill / tablet)",
   "",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "50 mg",
   "sublingual",
   "Methoxetamine ",
   "(powder / crystals)"
  ]
 ],
 "report": "</p>\n[Erowid Note: While it may be that the substance described below is MDA, Ecstasy tablets are notoriously impure or misrepresented, often containing chemicals other than those they are presumed to contain. This report is marked as an MDA report, but readers should be aware that this is more of a general Ecstasy report.] </p><p>I am a college student who recently has become rather accustomed to altering my consciousness for the purpose of psychonautics: psychedelics and dissocitives being my main focus. LSD, mushrooms, 2C-E, 2C-I, MDMA, MDA, ketamine, DXM, cannabis, synthetic cannabinoids, and various combinations of the above are all good friends. I am comfortable with my mind, and unafraid of bad experiences, should they occurthey are lessons, not nightmares.</p><p>On the night in question, I went to a rave, with the intention of taking MDMA and dancing the night away with some new friends, and having a typical (ahem, amazing) MDMA experience, as I have in the past. I was not successful.</p><p>In my pursuit of my friend Molly (MDMA in powdered form), I was offered Sass (MDA in powdered form), and decided eh, good enough, and bought four pills at 100 mg each (upon tasting the material I found it to have that characteristic phenethylamine flavor plus an added sugary sweetness, leading me to believe it was not quite 100 mg). My friend and I both swallowed one, hoping for a good roll. After around 20 minutes I began to notice an increase in energy, but none of the unlimited endurance or the pure, unadulterated love I have come to expect from MDMA. Being disappointed, my friend and I redosed at around T+80 minutes, for a grand total of 200 mg of MDA. There was euphoria (nothing special), some nice subtle visuals (mostly subtle close-eyed patterning), and some motivation to dance, but I felt that the experience was more suited to a more relaxed, talkative setting.</p><p>The MDA was not very stimulating to either of us. After a lot of dancing, a lot of fun, and the acquisition of 50 mg of methoxetamine, we left the rave, still in our just slightly altered states, yawning the whole way home. From there, we decided marijuana would make quite a nice addition to this experience. And, unsurprisingly, it was. A few bowls intensified everything we were feeling: giddiness, energy, peacefulness, and that nice body high, without adding any paranoia or any sense of wrongdoing that I tend to get from cannabinoids. It was about 4 in the morning, and it was extremely serene and beautiful outside. I returned home and lay in bed for a while, not wanting to go to sleep to lose this wonderful, subtle feeling (though, I was quite sure I could do it if I felt the need). I was somewhat disappointed with the lack of intensity from the roll.</p><p>Then an idea hit me.</p><p>I still had that MXE.</p><p>Now, Ive candyflipped (LSD + MDMA) and hippyflipped (Mushrooms + MDMA) before, and had absolutely breathtaking experiencesstories for another time. This could be my own version of a kittyflip (Ketamine + MDMA). I was in a very relaxed, peaceful, curious place, and I always feel at ease in my room. I decided to take the plunge. What better time than now?</p><p>I put the contents of the capsule, 50 milligrams, under my tongue and sat in my bed and patiently waited for it to come on. The following is an excerpt from my journal of the experience, from the moment I took the MXE. (I took the first dose of MDA about 5 hours and 30 minutes before the MXE.)</p><p>T+0:09  I have just become alert of something something. Some nausea, more than I would like. Not a big deal.</p><p>T+0:14  Definitely feeling the nausea. Its not bad. In fact, nothings bad. Nothing at all. Its getting harder to type. I can feel time slowing down. I feel good though. Music is perceptibly becoming</p><p>more and more amazing. My tongue has gone numb, with a ketamine-like anesthetic feeling.</p><p>T+0:21  It sounds like Im hearing all this music for the first time. It sounds different than ever before.</p><p>T+0:33  Feeling about the same. I swallowed the saliva and residual powder.</p><p>T+0:37  Definitely some level of OEVs. But its dark, so I cant tell how much. Enough of the external universe.</p><p>T+0:43  Noticeable CEVs have begun. Its quite colorful, mostly greens and magentas. No solid shapes.</p><p>T+0:51  Beginning to dissociate. FANTASTIC body high. I feel so cozy in my bed.</p><p>T+0:56  This is really wonderful! I feel so happy, so comfortable, so peaceful. Good vibes abound. This is getting to be really quite something. And Im still coming up.</p><p>T+1:00  It suddenly hit me harder. The peak. Im loving this. A solid +++ to measure by Shulgins scale. This has some serious potential to change lives. I feel so incredibly good!</p><p>T+1:08  This is AMAZINGLY EUPHORIC. Im tripping pretty hard at this point. Its haaard to type man. This is absolutely insane. There is a lot of warmth. Im starting to feel very distant, similar to ketamine. But MUCH more intense than my limited experience with ketamine. K was never quite like this. </p><p>T+1:18  Time is doing some extremely bizarre things right now. [I wish I remember what I meant by this.]</p><p>T+1:45  I dont feel like Im going out of body. Its strange, its more grounded than dissociatives normally are. That does make sense though, with the combination.</p><p>T+2:02  I feel like the peak of the peak has passed. Im still very high though. What a journey!</p><p>I went down from there until going to sleep with some difficulty at around T+4:00, still feeling very strange. It was a very interesting headspace. I felt I had quite a bit of control over the direction of my thoughts, though it was difficult to think coherently with the music playing. As mentioned above, there was a lot of euphoria. Probably the most Ive ever had from anything, ever. The peak was extremely intense. The dissociation felt clean (like K, unlike DXM) and very comfortable. It felt rather natural, like K, with very smooth ups and downs. The visuals were beautiful and colorful, but often lacked solid form. The trip was more of an emotional journey, leading me to discover some wonderful places inside myself. I cant legitimately go into explicit detail because I do not remember explicit details.</p><p>The next day, I felt very good. No molly crash. Yes MXE/MDA afterglow. Quite a lot. It consisted of residual euphoria, a sense of general wellbeing, and all around chillitude and good vibes. Talkitiveness was unchanged, but confidence was increased. It was extremely difficult to concentrate. Instead of doing homework, I preferred to think about how wonderful life is and how great all the people in it are.</p><p>I cant wait to experience methoxetamine by itself. This mixture kept me too grounded; I want to see how deep this goes. It seems like a worthwhile material. Caution is advised though, I can easily see this being habit-forming. And everything I've read about MXE suggests the same thing. Tread lightly, my friends.</p><p>Needless to say, my initial disappointment with the molly was wholly and entirely dissolved.</p>",
 "year": "2011",
 "id": "92855",
 "gender": "Male",
 "age": "18",
 "timestamp": "2011-11-06T07:00:00.000Z",
 "views": "8379"
}
