{
 "id": 9291,
 "title": "I'm One of the Lucky Ones",
 "date": {
  "submission": "2007-06-21T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "tryingmybest",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "daily"
  }
 ],
 "report": [
  "My experience with Xanax all started after the birth of my second child. I had had a problem pregnancy and almost lost my life and the life of my baby due to high blood pressure. Everything turned out great and baby & I were sent home. Shortly afterwards I noticed that I started having weird anxiety attacks at weird times for no apparent reason. Some nights I couldn't sleep. I just dealt with it. My family and friends said that I was dealing with Post Traumatic Stress Disorder. I just figured that I was a very strong outgoing person and that I would get through this. That is until my baby was 2 months old and we almost lost a family member. We spent weeks in and out of the hospital not knowing if our family member would die or live. The entire family was going to the hospital donating blood. I went to donate blood and couldn't due to my blood pressure being to high. Of course, my family demanded  me to go to my doctor.  When I went to my physician, I had no intention of getting any anxiety medication. I had just told him my story and how I couldn't sleep. He prescribed low dosage Xanax(.25mg) and told me to take as needed. That is what I did but what I needed was way more than .25mg.",
  "Shortly thereafter, a friend of mine had been getting prescription bars(2MG Xanax). She started giving me a couple here and a couple there.  I can't even begin to tell you how stupid I was. I didn't even have a clue that I was beginning addiction and what kind of evil drug I was messing with. I started taking a fourth of a bar whenever I felt anxiety or stressed(which seemed to be all the time). That progressed to a half of a bar at a time. I'm still not even sure how much I was taking a day. I think anywhere from 2-3mg a day. I couldn't really tell you though because I was a zombie. I started having memory problems which led to bad feeling about myself which led to taking more Xanax.",
  "Anyway, I finally decided that I didn't need this drug anymore. So I quit taking it.  No big deal right? Wrong! The first day was no big deal. I didn't even think about it. The second day, I couldn't sleep. The third day, real weird paranoia hit. I decided to talk with my husband and my girlfriend. I told them I thought I was having withdrawal. They both laughed at me and said I hadn't taken it long enough and just blew me off. By the fourth day, I was home by myself with my two children asleep trying to figure out how I was going to take care of them when they awoke. I was totally freaking out! I felt like I was having a nervous break down. I was hearing voices, trembling, had numbness in my fingers and legs, muscle fatigue, buzzing in my head, & the list goes on and on. I called my girlfriend and asked her to come and sit with me. That is how screwed up I was.",
  "She couldn't come right away so I had to resort to calling my mother. Oh, what fun! My mom came right away and is a RN. She knew right away how serious this was. Apparently, I could go into a coma, have a seizure, or die. I had no idea how serious this could be. It was just a pill. I had to be taken to the ER and was given IV Xanax. I am now still trying to taper off of this crap. I feel like a failure as a mother and I'm embarrassed that I didn't realize what I was doing. I'm posting my story so other out there can be aware of what Xanax can do. I'm one of the lucky ones."
 ],
 "erowid": {
  "id": "56433",
  "citation": " tryingmybest. \"I'm One of the Lucky Ones: experience with Alprazolam (ID 56433)\". Erowid.org. Jun 21, 2007. erowid.org/exp/56433",
  "substance": "Alprazolam",
  "views": "48096"
 }
}
