{
 "title": "Tripping With Nowhere To Go",
 "author": "punkrockprincess",
 "citation": " punkrockprincess. \"Tripping With Nowhere To Go: experience with Mushrooms (ID 9294)\". Erowid.org. Jun 29, 2004. erowid.org/exp/9294",
 "substance": "Mushrooms",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  "4.0 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>I shroomed a lot during my junior year in high school, but the last time had been in April 2001. It was now August 2001 and shrooms had come into town. I love the shrooming experience and couldn't wait. There was a big football game that night, so I stopped in for a few minutes and left. I went and bought some cigarettes, some gas, and some orange juice, and I munched down on the entire 4 grams. I drank a big glass of orange juice. I hadn't eaten all day so the shrooms and orange juice didn't have anything to get in their way. Almost 15 minutes after I took them I felt all giggley and I was so psyched! I knew this was going to be a good, fun, heavy trip.</p><p>There were a lot of other people tripping that night, but it seemed that I couldn't find any of them. I went over to this party house and a few of my friends were there. Some of them had been smoking crank and a couple others were tripping on X for the first time. We went for a drive to find some more crank. This is when it really started to kick in. Before the lights had turned all sparkly and there was drastic color change, but when we got in the Jeep I was gone. Superfast looking trails of light were all along the outside of the jeep and it felt like we were driving at light speed. We drove for a while, and then went back to the house. We smoked a bowl, but the wierd thing is that I couldn't see any smoke coming out when I exhaled, and I know I was taking massive hits. We were sitting outside the house and all the window were all different colors and the sky looked really cool. They all started smoking crank and I decided to leave, I felt restless. I wanted to find some of my other friend who were tripping.</p><p>I was driving and I knew it was not the smartest thing to be doing. The lights were just crazy and the music was so intense. I was listening to a ska compilation called 'Ska Sucks' and it just FELT really intense. Soon I realized that driving was not treating me well, so I went to this park. I just sat there and put in the nearest CD, the Eurythmics Greatest Hits. This is not typically the type of music I listen to, but music is very important to me when I'm tripping and the Eurythmics were great. I just layed down in my backseat and crazy, colorful psycodelic open-eye visuals flooded my sight. It was a really psycodelic trip. Soon the visuals got so strong I couldn't see what was around me. All I could see were the visuals, I felt like I was blind. I guess that it started getting really hot in my car, because I kept feeling like I had pissed on myself, and I kept turning the light on to make sure that I hadn't (I heard a horror story one time about someone who urinated all over the place when they were shrooming and I think that that story kept creeping into my mind), and sure enough, I hadn't but I felt totally wet. It felt like there was moss growing on my hands and I would claw at it and it felt like I was pulling it off and I could feel it under my nails but it was regenerate and grow back.</p><p>I decided I wanted to smoke a cigarette so I got out and sat on a picinic table. I lit up a cigarette (smoking feels so good when shrooming). I was enjoying my cigarette until it started melting before my eyes. Not only did it feel like it was melting, but when I would put it to my lips it felt like the filter was dissolving into my lips. Generally I was feeling pretty, um, fungusy! I think my trip started to come down because I was restless and I wanted somewhere to go, but I didn't have anywhere I could go and I didn't feel like driving. I was getting really frustrated and I started getting emotional. I changed out one CD after another. I think that all this stress started to bring my trip down. Finally I decided I was alright to drive and I went home. I quickly slipped in and out of my moms room to tell her I was home. I went to my room and took my clothes off (this may be wierd, but I love being naked when I'm shrooming) and layed on my bed. I think once I started relaxing I could enjoy the end of the trip because I still saw some slight visuals and I looked at myself in the mirror for a long time (I like looking at myself because I have really light blue eyes and when they're dialated as huge as saucers it's trippy). I put lotion all over my body and it felt so good. Then I drifted off into peaceful sleep...</p>",
 "year": "2001",
 "id": "9294",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-06-29T07:00:00.000Z",
 "views": "5526",
 "dose": {}
}
