{
 "id": 9295,
 "title": "Trippin All Night",
 "date": {
  "submission": "2007-12-12T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Roboto",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "amount": "270 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I was just chillin at a friend's house late one night after we vaporized some marijuana out of my Volcano, and we decided that we wanted to get really messed up that night. We each had a few adderall and thought we would take them to stay up all night easily, then we decided that to get fucked up we would each get some DXM. So after the trip to  the store we each popped our desired amount of DXM. I've developed a good feel for the dose I enjoy and took 18 pills, 15 mg each. I think doses above 300 mg are too intense for hanging out with friends.",
  "But anyway, we felt the adderall kick in first obviously cuz we took it first. Then we started to feel the DXM kick in. During the upcome of the DXM high we couldn't shut up, we were having the most intense conversations we ever had, and it continued like this all night.  We were just sitting around vaporizing good dope getting blazed out of our skulls while still maintaining ourselves. The adderall seemed to clear our heads and give us energy dispite the intense DXM and THC combination.",
  "Later we sat outside and took bong rips. I can still remember my body feeling amazing and the trees being completely flattened by my vision. This is the most amazing combination of drugs I've tried and probably ever will. I don't like to mess around with addictive drugs because I already have an addictive personality so I stick to what I can control."
 ],
 "erowid": {
  "id": "56440",
  "citation": " Roboto. \"Trippin All Night: experience with Amphetamines (Adderall), DXM & Cannabis (ID 56440)\". Erowid.org. Dec 12, 2007. erowid.org/exp/56440",
  "substance": "Amphetamines (Adderall), DXM & Cannabis",
  "views": "11621"
 }
}
