{
 "title": "Cannabinoid Droid",
 "author": "Psyonic-One",
 "citation": " Psyonic-One. \"Cannabinoid Droid: experience with JWH-210 (ID 92961)\". Erowid.org. Dec 18, 2012. erowid.org/exp/92961",
 "substance": "JWH-210",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE:",
   "5 mg",
   "smoked",
   "JWH-210",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Set and Setting: My mind is clear, a bit excited to test drive this new family of chemicals, but I am in a positive place. My environment is my own living room couch, I am comfortable and it is late at night with no distractions.</p><p>I made no specific preparations other than waiting until the house was quiet and everyone was asleep but me.</p><p>I prepared the pipe by putting a small amount of marshmallow leaf in the base of the pipe to prevent the JWH-210 from just melting. I measured out exactly 5mg of the fine powder and sprinkled it evenly across the surface of the marshmallow leaf. Exhaling out, I raised the pipe to my lips and took a long, deep inhalation.</p><p>00:00  I can taste the chemicals. Its not unpleasant per se, at least, not the worst chemical I have smoked.</p><p>00:10  Feel an alert here.</p><p>00:30  I can definitely tell its coming up</p><p>05:00  at the five minute mark, I am well aware that the substance is in me.</p><p>10:00  I am fully high. This to me is mostly a psychological high with most of the bodily sensations being bearable but not terribly pleasant. I am hyper-aware of my heart beating. I check my pulse and the rate is actually normal but, I feel like my heart is thumping pretty hard. I take a deep breath and try to just relax into the experience.</p><p>25:00  I am still high but have dropped off from the intensity of the initial fifteen minutes. I would contribute most of the intensity to the rapid delivery when compared to naturally produced marijuana. The feeling is not bad, the high is more psychedelic than stony, but as such, comes with some of the bodily side effects that I associate with those; just a general sense of not being totally at ease in my own body and its processes but, again, not unmanageable at this level.</p><p>45:00  I am coming down, still experiencing sativa-like effects but getting sleepy.</p><p>60:00  Dozing a bit here and there, feels nice to just lay with my eyes closed in the quiet.</p><p>90:00  Pretty normal feeling now with just residual side effects lingering, not unlike a normal high.</p><p>I have tried a few chemicals in this family at this point (JWH-018, JWH-019, JWH-081, and AM2201) and the JWH-210 was my least favorite thus far. In subsequent experimentation I found that it worked nice as a component of a smoking blend I made at home but only to add dimension to the overall feeling, not as a stand-alone chemical. Overall, I would repeat but I wouldnt go out of my way to get this one again. The negatives outweigh the positives in my opinion when compared with other chems in the same family.</p>",
 "year": "2011",
 "id": "92961",
 "gender": "Male",
 "age": "35",
 "timestamp": "2012-12-18T08:00:00.000Z",
 "views": "1316"
}
