{
 "title": "Fear and Loathing in My Bed",
 "author": "Dog",
 "citation": " Dog. \"Fear and Loathing in My Bed: experience with Methoxetamine (ID 92981)\". Erowid.org. Dec 4, 2011. erowid.org/exp/92981",
 "substance": "Methoxetamine",
 "bodyweight": "125 lb",
 "report": "<p>Greetings.</p><p>My name is dog and I live in the USA. My background on drug use is rather extensive. I have partaken in the use of methamphetamine, crack, pcp, all forms of pharmaceuticals, cocaine, various abstract stimulants, and all sorts of other things but I mostly had done marijuana (LOTS), dextromethorphan (lots of high plateau experiences, all forms of psychedelics (ayahuasca, dmt, lsd, lsa, mescaline, mushrooms, a bunch of 2cs, various others), and the occasional IV use of heroin.</p><p>I had always had an interest in dissociatives, hence my large dxm use, but never had the chance to get my hands on any ketamine. This made me very sad :'(. I heard k holes were an amazing experience and they sounded quite similar to my higher dose dxm trips where you literally GO SOMEWHERE ELSE. So naturally when my friend S called and told me he had some weird RC called 'mxe' I looked it up online and found out about its apparent wonders. I couldn't believe I hadn't heard of it yet!</p><p>I got 2 capsules from S, each containing 30mg of methoxetamine. He is a reliable supplier and most likely his capsules contained what they actually advertised themselves as. I was overjoyed.</p><p>I did one of the capsules in 2 (15mg each) IM shots the first night, both with great success but that's not what i'm here to tell you about. The day after that, I just had just got home from smoking some fine fine ganja. I sat down and thought about how I wanted to play out my night. It only being 11:30ish I decided I'd have enough time to enjoy another shot of mxe. I wanted to do a whole capsule for two reasons. 1. I had never done it before 2. I have heard that ketamine, pcp and their derivative chemicals have a fast tolerance build up and I wanted this night to be a real bang.</p><p>I emptied the contents of one small purple capsule into a clean cap of a fresh water bottle. I sucked up about 8/10cc of water into mr. stabby (my most trusted rig), and squirted it all over the mxe followed with a bit of mixing with the plunger. I placed in a clean cotton filter and sucked up my sweet nectar into the barrel and got quite nearly the exact same amount of h20 I had put into the solution. it was at this point that I took off my pants. I squeezed my thigh muscle and located a good fat point to stick the needle in. stabbing down in a semi arching motion swiftly, I barely felt the needle jab its way in between my fold of muscle in my right thigh. I slowly injected the solution, pulled out the needle, cleaned it carefully, put everything away and put my DVD of fear and loathing in las vegas on my laptop. Tonight was gonna be a bumpy ride.</p><p>As the movie progressed I felt myself coming up rather quickly. Almost within 3 minutes of taking the shot. When raoul duke stated 'the drugs were starting to take hold' I felt a rush throughout my body starting from the base of spine . A little more time passed and it was at this point in the movie that Depp's character takes a hit of very powerful lsd. The next few scenes consist of an increasingly chaotic night in a hotel on way too much acid (or maybe just enough). As the scenes progressed my trip grew stronger and stronger. I felt sure that this movie was made specificly for me, or at least people in my current state. I truly felt like I was there, like I was the camera, like I was a member of the lawless drug fueled romp through vegas with the legendary Hunter S Thompson and Dr Gonzo themselves. I felt as if they made the movie like this on purpose, as if the directors, editors, writers and actors were all just as under the influence (and loving it) as me. Needless to say it was quite a sight.</p><p>A little more than half way into the movie I was getting distracted by some closed eye visuals. I decided it would be good to turn it off and let the trip really take hold. I layed in the dark for some countless time slowly drifting from one strange reality to another, learning, marveling, expanding. One of the best nights of my life . A great substance no doubt.</p><p>Be safe, but take some risks!</p><p>Dog</p>",
 "year": "2011",
 "id": "92981",
 "gender": "Male",
 "age": "18",
 "timestamp": "2011-12-04T08:00:00.000Z",
 "views": "6032",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "30 mg",
   "administration": "IM",
   "substance": "Methoxetamine "
  }
 }
}
