{
 "title": "The Best Way to Relax After a Long Day",
 "author": "PharmPhreak",
 "citation": " PharmPhreak. \"The Best Way to Relax After a Long Day: experience with Codeine & Cannabis (ID 9298)\". Erowid.org. Jul 5, 2005. erowid.org/exp/9298",
 "substance": "Codeine & Cannabis",
 "bodyweight": "155 lb",
 "report": "<p>Dear Readers,</p><p>In all my years of experimenting with various psychoactive drugs I have discovered the best, easiest and most cost effective way to relax after a hard week at work is using both cannabis and codeine at the same time.</p><p>I usually obtain the codeine using the extraction methods mentioned throughout this website and have found the best tablets to use are one's containing 300mg of dispersible Aspirin and 8mg of Codeine Phosphate.</p><p>100 or so tablets shouldn't cost more than $10.  This is far easier than trying to obtain codeine through a doctor as nowadays they are more likely to prescribe an NSAID for pain or something like Tramadol (a synthetic opiate) rather than codeine (because it feels so good of course!!).  10% of all codeine is converted to MORPHINE in the brain, so 240mg would be equivalent to approx 24mg Morphine (quite a lot).</p><p>I certainly would not consider the combination of Pot and Codeine to be a 'social' or 'fun' high at all. </p><p>I usually have a warm bath first around 6pm (while waiting for the codeine to extract) and mix some nice oils/bath foam etc. to calm myself right down.</p><p>Then once the codeine solution is ready (about 30 tablets extracted - 240mg) I drink this first and get dressed in something comfortable (waiting for the effects to begin).</p><p>They are usually subtle at first, a heavy feeling throughout the whole body, dry eyes and a little stomach upset can happen too.  If this happens lay down straight away (this helps with all opiates).  Should stop within a few minutes.</p><p>Then I use a water pipe to smoke the hashish through, smoking as much of it at once as I can. </p><p>It is the most content and 'at peace' feeling I have had in my life and far superior to any other pharms I have tried such as the benzodiazepines and other newer drugs such as Zolpidem or Zaleplon.</p><p>If you are into herbs also, Kava Kava adds a VERY nice spin to this feeling but don't be surprised if you go to sleep for 24hrs plus if you do it!!!  Kava Kava is strong!</p><p>So, if you wanna try an opiate, don't be putting needles in your arms and making drug lords rich.  Take a trip down to your local drug store/pharmacy and use the combination above.  You'll save yourself a lot of time, money and hassles.</p>",
 "year": "2001",
 "id": "9298",
 "gender": "Male",
 "timestamp": "2005-07-05T07:00:00.000Z",
 "views": "31133",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "240 mg",
   "administration": "oral",
   "substance": "Codeine",
   "form": "(extract)"
  },
  "1": {
   "time": "",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": ""
  }
 }
}
