{
 "id": 9299,
 "title": "Awake, Dreaming",
 "date": {
  "submission": "2009-11-16T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tam",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "6 g",
   "administration": "oral",
   "substance": "Calamus",
   "form": "roots"
  },
  {
   "time": "1:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Piperazines",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "00:00 Chewed around 6g of dried Calamus root. Tasted absolutely revolting, although I somehow managed to pretty much chew the life out of it.",
  "01:00 Took a BZP/TFMPP 'legal high' pill. My original experiment wasn't going to include one, but in a moment of madness I decided that it would be a good idea",
  "01:40 Start coming up on the pill, vaguely like coming up on an ecstacy tablet, although definitely not the same.",
  "02:00 Most definitely 'up' now. Feels a bit trippy, lots of head rushes and fairly euphoric. 'E' is probably the closest drug I've taken to it, but I wouldn't say that they were similar. Still, quite good fun.",
  "02:45 Guess I must've been coming back down at this point, didn't make exact measurements.",
  "03:30 Most definitely 'down' from the pill at this point, but still feel fairly inebriated. Stimulated, full of energy, lack of concentration.",
  "04:00 Stomach starts churning a little bit. Nothing too serious, but (very) mild discomfort. Still stimulated. Start getting some mild open eye visuals, which gradually become stronger",
  "05:00 OEVs probably at their strongest at this point, mostly different coloured geometric shapes & patterns, but also briefly misidentifying things (eg thinking a coat was a cat for a second). Strange, but not unpleasant.",
  "06:00 OEVs now very mild, decide to go and lie down to try to get some sleep",
  "07:00 Can't sleep, still very much stimulated. Not noticing any OEVs, but whenever I close my eyes I start dreaming - even though I was still awake. Visuals very much like one would experience in a dream, although none last for more than a few seconds.",
  "10:00 Finally get to sleep. Throughout previous 3 hours, perpetually on a cylce of closing my eyes, dreaming for a few seconds, opening my eyes, closing my eyes, ...",
  "Over this period, I drank a lot of water. Got very dehydrated for much of the experience, I would say that it was vital for anyone trying to re-create this experience to avoid alcohol at all costs, as it would be extremely dangerous. As a word of caution, my pupils were extremely dilated throughout the experience and for several hours the next morning.",
  "Woke up very early the next day, felt lethargic, apathetic and anti-social. Eventually decided to go for a ride on my bicycle, which helped a bit.",
  "Overall, it was a fairly enjoyable experience. Would probably do it again at some point, although not on a regular basis. I've never tried LSD and so can't compare with that, but it was certainly more hallucionogenic than anything I'd had before."
 ],
 "erowid": {
  "id": "56451",
  "citation": " Tam. \"Awake, Dreaming: experience with Piperazines - BZP/TFMPP & Calamus (ID 56451)\". Erowid.org. Nov 16, 2009. erowid.org/exp/56451",
  "substance": "Piperazines - BZP/TFMPP & Calamus",
  "views": "4635"
 }
}
