{
 "title": "Not Being Too Talkative",
 "author": "Zeke Ralston",
 "citation": " Zeke Ralston. \"Not Being Too Talkative: experience with MDMA (ID 93026)\". Erowid.org. Oct 28, 2011. erowid.org/exp/93026",
 "substance": "MDMA",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "MDMA",
   " T+ 1:30",
   "20 mg",
   "oral",
   "MDMA"
  ]
 ],
 "report": "<p>[This report originally appeared as a typewritten page pasted into Book 2, page 295 of the Shulgin Lab Books.]</p><p>Report on Experience with MDMA</p><p>Guests: Holly Ralston, Tatiana Ralston</p><p>Start: 9:50 A.M. All participants ingested 100 m.g.</p><p>10:10 Everyone is beginning to feel effects.</p><p>10:30 All are feeling strongly, Tatiana feels that it hits her very suddenly. We had started in the living room, where there is lots of light and excellent views out of the windows, and a lot of interesting things to out around the room. But when we stepped outside, it seemed to come on stronger.</p><p>We took chairs down to sit under the cottonwood trees, which were most pleasant. A nice breeze caressed us and whispered in the trees. The scenery was magnificent. At first everything seemed too bright, but as we accommodated ourselves to the brilliant sunshine, we began to observe the marvelous detail in the mountains and across plains. he desert foliage was most interesting, and remarkably different from plants on the Coast. Holly felt heavily intoxicated. She has been extremely tired and tense the night before, with appreciable pains in her neck and shoulders. She felt the experience was a great tranquilizer, and her body felt numb.</p><p>11:20 We take supplements, Tatiana and Zeke, 20mg., Holly 10mg. (the balance of our supply), Holly was feeling so heavily intoxicated that at first she thought she would refuse the supplement, but when we learned the distribution of the remaining capsules, she opted for the 10 mg. (I has originally planned to take the 10 and give the girls 20.)</p><p>Tatiana sailed for 3 hours with the experience. At the end of three hours (12:50 p.m.) she suddenly came out of the spontaneous experience, and began corticalizing about her work and life situations.</p><p>I experienced considerable enhancement of perception, but was not as completely into the experience as I have been with large amounts. I experienced a great deal of cortical activity, similar to what I am more used to with LSD, which I have never before experienced with the compound. This was partly the result of our not being too talkative, Holly feeling very relaxed and Tatiana and myself enjoying our experience. I keenly felt the absence of our former companions on this journey.</p><p>After the supplement, we walked around the property for a couple of hours, feeling very content, relaxed., and enjoying the beauty. At first we felt so relaxed we didn't feel like walking, but once we started it was effortless. It felt very good to walk around and look at things.</p><p>2:30 We come back to the living room, all feeling very languid. We sat around and talked for a while, and then Holly and I took naps in which we slept very peacefully. Tatiana read a while, and then took a nap.</p><p>Later in the afternoon, we took showers, which was very refreshing, and has a delightful visit with out neighbors, the Zina's. For my birthday, they took us to dinner at their restaurant, where we had a late dinner. Tatiana ordered a steak, which did not sit too well with her, and that evening had an attack of diarrhea, and her stomach still bothered her the next morning. Otherwise, everything was most pleasant. We enjoyed the Zina's very much, and were very content and peaceful. Holly was greatly relaxed and no longer pushed by the compulsion to clean up to the house immediately.</p>",
 "year": "1978",
 "id": "93026",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-10-28T07:00:00.000Z",
 "views": "5054",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": " T+ 1:30"
  }
 ]
}
