{
 "title": "Her Sageness",
 "author": "Meat Nipples",
 "citation": " Meat Nipples. \"Her Sageness: experience with Salvia divinorum (10x extract) (ID 9303)\". Erowid.org. Jul 16, 2004. erowid.org/exp/9303",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "160 lb",
 "report": "<p>Tonight I fell before the good graces of Lady Salvia, and I feel truly blessed to have received her gracious hospitality.  I encountered her one night before, though in a very inappropriate setting, and I felt that I missed much of her insights.</p><p>Tonight however, was much different, as I was working with the very potent 10x extract.  I was with a special friend who would also partake; we were both sitting comfortably in his darkened room.  I loaded my glass bowl (using it for the first time as it was reserved for her) with a very small amount of material, possibly at most a tenth of a gram.  I placed the blue flame of my torch light to the alluring dark-green salvia which immediately turned flame red, and then inhaled deeply.  Holding this for about 30 seconds I realized there was more left in the bowl, so I took another hit.  As I inhaled the cool, agreeable smoke, I was immediately pulled to the floor by a strange indiscernible force.  I felt as if I had been sucked out of my body for a few seconds, into a space of complete nothingness.  This absolute dissociation soon passed and I gained awareness of my body again.</p><p>With my eyes closed, an almost infinite 2-dimensional plane of kaleidoscoping dream visions danced at a dizzying pace.  Some of the images were downright funny, though I cant remember why.  Perhaps the lady was in especially good spirits, as this state of awareness felt very comfortable, even when I was completely dissociated from my body and could feel her pull.  The visions were similar to the those induced by a strong psilocybin experience, only they were playing out on a more subconscious level, lacking the intense emotional connections of the mushroom peak.  They were organic and familiar images and memories, materializing out of a swirl of geometric iridescence.  This was the dreamtime.  Hovering in the spatial infinity of my own consciousness, connected to the entire universe.</p><p>As my bodily awareness became more apparent, I felt this space moving against my skin, causing a rain of tingling pins and needles.  I could see a tunnel moving out before me, and then some thought triggered what seemed like a drop of water hitting the surface of a puddle, and the ripples undulated throughout my body.  This would occur again later in the experience.  I remember getting the feeling that the lady was trying to show me something specific, which I obviously must have missed. I could almost hear her voice: Why dont you see where Im leading you. I remember, almost laughingly replying, Its all so beautiful, so amusing, but its too fast.</p><p>Thats when I saw her hands, like two blooming rose buds, grab each frame and slow the ongoing collage of consciousness down to a more observable rate.  By then however it was too late, and the physical realm called me slowly back.  I remember sharing these events with my friend, who had embarked as well, and he described having an equally positive and intriguing experience.</p><p>I can only say that the lady is an exotic and powerful plant spirit.  The space we (and so many others!) accessed shows real promise of serious exploratory potential.  I think it may be equally important as the DMTs.  Unlike the tryptamines, however, her Sageness prefers the route of dreams, not just sensory experience.  I guess that is the best I can explain it.  But dont think she isnt direct; the weirdness alone will astound most people.  Somehow I perceived the chaotic array of (normally) subconscious imagery as humorous and insightful, though I can see where with the wrong set and setting someone could really become frightened.  Especially by the strange gravitational tactile sensations she evokes.  I remember having a very brief pornographic moment as well, and somehow I think, even in my disembodied state, I blushed.  Now hows that for weird?</p><p>By Meat Nipples</p><p>Thanks for reading!</p>",
 "year": "2001",
 "id": "9303",
 "gender": "Male",
 "timestamp": "2004-07-16T07:00:00.000Z",
 "views": "9383",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
