{
 "id": 9307,
 "title": "Apartment in the Sky",
 "date": {
  "submission": "2009-06-04T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tsunami",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "I decided to do salvia one day over the summer, because I had been telling my friends about my previous experience with it and they seemed interested.  My first experience had scared me shitless, but for some reason I wanted to try again, maybe see if it was any different.",
  "We went and picked up a gram of 10x, then went back to my friend's apartment, which was on the second floor of a house in a suburban area of Kailua, Hawaii.  We set up my bong, packed a bowl, and one of my friends hit it till it was gone.  He said he felt weird, but didn't think he had broken through, so we packed another bowl for him.  After 4 or 5 bowls, he still didn't think he had broken through, but we decided he had had enough.  Soon afterwards, he started laughing, then ripped his shirt off because 'he felt it crawling on him.'",
  "After he was done smoking, I packed a bowl for myself.  I only hit it once, and as I was setting the bong down I felt myself slipping into that familiar 'salvia reality.'  It's hard to say what changed, but I was instantly petrified.  I began chanting things like 'Oh shit, salvia's evil, why did I do this, it's evil...'  What I think salvia does is it makes me forget basic things about reality.  That doesn't quite convey the feeling I had, but it's as close as I can get with words.",
  "This time, I thought all my friends were evil.  They were what my brain had decided to call 'salvia people.'  I still knew who they were and everything, I just felt like they knew exactly what the salvia was making me feel, and they had known before I smoked it, and it was a conspiracy on their part.  The apartment, just the second floor of a 2 story house, seemed to me to be way at the top of a skyscraper.  I knew I had smoked salvia, and I knew none of this was right, but what was scaring me was that I didn't know what things were supposed to be like.  I couldn't remember real reality, all I knew was this Salvia reality, which I knew wasn't real.  I was freaking out.",
  "On top of these general brain changes, there was an incredibly weird thing happening to me that was way more 'in-your-face.'  When I smoke salvia, I get this 'stoned' feeling like weed, where it almost feels like electric pulses moving along my body.  The difference is, with salvia, the pulses are way more intense and solid, really feeling like my body is clenching as they move along. This time, the pulsing feeling brought with it solid black bars of nothingness that were pushing into my vision from the sides.  I held my arms out to the side and began waving them, saying 'Everything's going like this!'  My friends found it hilarious of course, but I was completely serious.  It turns out, the strength of the pulses and the black bars of nothingness were my salvia-influenced brain's way of processing the feeling of a fan blowing at me from the back.  Once I realized this, I turned the fan away from me and the feeling stopped.",
  "Overall, the trip lasted about 5 minutes, and the aftereffects maybe 5 more, during which I was very uncomfortable, but I was no longer so frightened."
 ],
 "erowid": {
  "id": "56480",
  "citation": " Tsunami. \"Apartment in the Sky: experience with Salvia divinorum (10x extract) (ID 56480)\". Erowid.org. Jun 4, 2009. erowid.org/exp/56480",
  "substance": "Salvia divinorum (10x extract)",
  "views": "2674"
 }
}
