{
 "id": 9318,
 "title": "Suprisingly Nice",
 "date": {
  "submission": "2008-01-05T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ginman",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "2400 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:00",
   "amount": "500 ml",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "4:00",
   "amount": "900 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(pill / tablet)"
  },
  {
   "time": "4:00",
   "amount": "5 cups",
   "administration": "oral",
   "substance": "Coffee",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I am a heavy drinker so anything else I take I must first check for interactions. Finding no serious warnings of mixing Neurontin with alcohol, or finding any reports of such I decided to experiment.",
  "Around 8pm I took 8 300mg Neurontin pills with a bottle of mountain dew. While waiting for the pills to work I started my nightly drinking gin also mixed with dew. I thought the more soda I drank the faster the pills would kick in.",
  "About 3 hours later I was pretty drunk but not to the state of being out of control. The pills had definitely kicked in but not till I thought about it. I felt really floaty, almost like a small dxm mixed with weed type trip, but more euphoric.",
  "An hour later a friend came by and we decided to get some coffee at an all night coffee house. I took a few more pills before we left. There I consumed 5 regular coffees, it just tasted so good, I don't know if it was just excellent coffee or my mindset. We played cards and sang along with the karaoke for about an hour, something I usually hate. I just felt so sociable and happy.",
  "We then left and returned to my place where I popped a few more pills and had a few beers. We played the playstation 2 for hours and I just loved every minute of it.",
  "To conclude, I think the mix was an excellent and I never felt any ill effects. Woke up the next morning still high but not hung over or zombie like at all. I look forward to many more good times with this combination."
 ],
 "erowid": {
  "id": "56513",
  "citation": " Ginman. \"Suprisingly Nice: experience with Gabapentin (Neurotin), Alcohol (Gin) & Coffee (ID 56513)\". Erowid.org. Jan 5, 2008. erowid.org/exp/56513",
  "substance": "Gabapentin (Neurotin), Alcohol (Gin) & Coffee",
  "views": "20637"
 }
}
