{
 "id": 9319,
 "title": "Trapped in a Void of Depression",
 "date": {
  "submission": "2007-12-16T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Anarchist",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>Recently ive been experimenting with alot of different drugs and medications, then I found a bottle of effexor (Venlafaxine). I decided to pop 2 effexor pills (75mg each) and took some alcohol with it. Be warned that this is not a good idea to mix effexor with alcohol, but I considered the risk and took it anyway.",
  "I downed the pills about about 6pm and sat back a drank a few beers. Around 30 min later I started to feel very dissy and began to get lightheaded. Shortly after that I felt very isolated, and felt very relaxed but strangely frightened at the same time. I also felt strong nausea.",
  "At about 7:30 pm I became very drowsy, and my speach was extreamly slured, I tried to walk to my kitchen but found myself stumbling over myself. I convinced myself that it was just the alcohol so went back into my room and laid down to watch TV. As I tried to watch TV, I noticed movement in the corner of my eyes. I cant describe what I saw exactly but it was like a bunch of flies were flying all around.",
  "Shortly after, at about 8 pm I get very sleepy and passed out.",
  "I woke up the next morning feeling very strange, like I would the next day after smoking alot of marijuana, but it was more than that, I felt isolated from everything, I couldn't focus. This was a very weird experience, one that I will not try again because of the effects during and after taking the drug.</p>"
 ],
 "erowid": {
  "id": "56518",
  "citation": " Anarchist. \"Trapped in a Void of Depression: experience with Venlafaxine (Effexor) & Alcohol (ID 56518)\". Erowid.org. Dec 16, 2007. erowid.org/exp/56518",
  "substance": "Venlafaxine (Effexor) & Alcohol",
  "views": "4341"
 }
}
