{
 "title": "Great Night, Sublime Feeling at a Rave",
 "author": "Tripjr",
 "citation": " Tripjr. \"Great Night, Sublime Feeling at a Rave: experience with 5-MeO-MIPT (ID 93202)\". Erowid.org. Apr 25, 2012. erowid.org/exp/93202",
 "substance": "5-MeO-MIPT",
 "bodyweight": "61 kg",
 "report": "<p>Amounts were eyeballed. [Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]</p><p>T 0 - approximately 8mg nasal</p><p>T 2 - approximately 10mg oral as I wanted to feel more.</p><p>T 9 - fairly sober, asleep after one hour.</p><p>I eyeballed the dosages.. so it could be less (was careful with it), but as intoxicated as I was, I feel like I was spot on.</p><p>At home with a mate it started. Then went to a hardcore party (rave) .. First I hesitated just because the substance would be psychedelic, but because I've read in several reports it was quite 'party-worthy' I still did it.</p><p>And I have no regrets :)</p><p>Whole evening was great. It felt after a few hours as if I saw myself from outside. A bit like mushrooms but without mindfuck.</p><p>The laser lights were extremely beautiful, fascinating. Very trippy. (it felt like a combo of mdma / mushies)</p><p>It was visualy psychedelic. The warping of vision was like on an average dose of mushrooms. (but only when I really tried to focus on it)</p><p>Empathy, I felt sorry for some people because the looked so insanely fuckedup (like unhealty). Too much mdma and too hot inside.</p><p>I saw some people having a bade vibe. As if I could really see what was missing in one's thinking, I tried to fix it and succeeded multiple times.</p><p>I should add that there have been drinking (one beer p / hour or so), more fresh drinks and smoked. Also smoked a litte cannabis beforehand.</p><p>Hour or 7 pips go this morning, and now I feel hard not broke, except hunger, pain and a sprained ankle) (half the time I was partying my feet off! And failed doing some dance move :P )</p><p>Well .. that was it. I hope it's a bit of a cohesive story.</p>",
 "year": "2011",
 "id": "93202",
 "gender": "Male",
 "age": "25",
 "timestamp": "2012-04-25T07:00:00.000Z",
 "views": "3540",
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "5-MeO-MIPT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 2:00",
   "administration": "oral",
   "substance": "5-MeO-MIPT",
   "form": "(powder / crystals)"
  }
 ]
}
