{
 "title": "An Important Material",
 "author": "Palenque",
 "citation": " Palenque. \"An Important Material: experience with 2C-I (ID 9327)\". Erowid.org. Sep 8, 2001. erowid.org/exp/9327",
 "substance": "2C-I",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9327",
   "Female",
   "",
   "Not Given",
   "Sep 8, 2001",
   "10873",
   " "
  ]
 ],
 "report": "<p>\nGENERAL COMMENTS: It has been one week since my partner and I had our first 2C-I experience. My reason for waiting so long to write this report is that I wanted to first see whether the insights we gained were one of those flash-in-the-pan things, or whether they were of lasting significance. Happily, I can report that the work we did last Saturday has proven extremely beneficial to us both. In fact, in the days that followed our experience, as we would reflect on it, further valuable insights continued to pour in. </p><p>We are not strangers to using psychoactive compounds in intimate settings, both for pleasure and for spiritual growth. Until now, for us, nothing has ever surpassed MDMA in its ability to foster communication and bring about AhHa moments for us personally and as a couple. Yet, this one night on 2C-I brought about a level of personal insight that neither of us had ever achieved on MDMA before. We were actually quite astounded. </p><p>My caution here is that sometimes my first experiment with a new substance is never equaled. That was the case for me with 2C-T-7. The first time was one of the best ++++ experiences Ive ever had, but then set and setting were also absolutely perfect. Since then I havent even had a good ++ experience on T7. While this may not be a normal reaction, I mention it so as to temper my current enthusiasm for 2C-I. Future explorations of this material will tell the tale. </p><p>That said, I have to admit that this experience was one of the most important we have had as a couple, and as individuals, in a year or more. Perhaps the set and setting were so good this time that aspirin could have had the same effect. Who knows? What is important, however, is that at least this one time was a very valuable experience and one I would highly recommend when done as we did this time. . . just the two of us, unplugged phone, no time pressures that night or the next day. I expect this material will work well in larger groups as well, as others have already reported. What we discovered for ourselves is that it is also an incredible trip in the company only of one you love. </p><p>DETAILS: Approximate doses (sorry about the approximate, but lacking a good scale we had to eyeball it from a known quantity)  25 mg (170 pound male), 15 mg (140 pound female). At the one hour mark we were maybe a little lightheaded, a little sleepy (it was only seven p.m.), and with a relaxed, smooth feeling. Very gentle in coming on. At the 1 hour 45 minute mark we were both at a ++. Thirty minutes later we both experienced an inkling of nausea but a toke or two of cannabis eliminated those feelings. </p><p>While the conversation and insights were the supreme reward of this evening, it is also important to know that sex on this substance can be incredible. Unlike MDMA, orgasms are not difficult to achieve and are way over the top on intensity. Go slowly, take a lot of time, and you will be rewarded beyond your wildest expectations. </p><p>It was at the four hour mark when we first paid attention to the fact that we werent continuing to peak. While we probably didnt continue building to a plateau all that time, it almost seemed as if we were doing so. I would say that overall it was a good, solid +++ experience, at the high end of +++. At the six hour mark we were both still highly altered. I wasnt tired or sleepy and laid awake having a marvelous time in my mind, but my partner found little trouble in falling asleep at about the seven hour mark. However, she awoke after about an hour, and we both remained awake until about four in the morning. (We began the experience at six oclock the evening before.) </p><p>Neither of us experienced any side effects the next day. Both the going up and the coming down were extremely gentle. For us this was a very body-friendly substance. I like the fact that it is active at a dose significantly lower than that required to reach a similar level with MDMA. It is both more economical and there is less material to be ingested . . . the best of both worlds. Another big plus is that neither of us experienced any jaw clenching. </p><p>Please keep in mind that this is a report of only our first use of this material. With that fact in mind, however, I can highly recommend this material. Take it slowly. Dont be a hero. And you just might be rewarded as well as we were.</p>"
}
