{
 "title": "Trouble with Truffles",
 "author": "Maverick",
 "citation": " Maverick. \"Trouble with Truffles: experience with Mushrooms (P. tampanensis) (ID 9332)\". Erowid.org. Sep 10, 2001. erowid.org/exp/9332",
 "substance": "Mushrooms (P. tampanensis)",
 "bodyweight": "61 kg",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms - P. tampanensis",
   "(dried)"
  ]
 ],
 "report": "<p>Well, this is my story about my second time tripping. Also you'll have to excuse eventual spelling errors and/or bad grammar, as english isn't my native language.</p><p>The first time I heard of magic mushrooms was by a friend, who said he had tried it through a friend of his. He said it was something unexplainable, you felt normal, but you still didn't. Of course this caught my interest, as I have been wanting to try drugs, test them out to see what they're like, but haven't found a way to buy them. In Sweden it's pretty hard to get a hold of drugs, unless you know the right people, which I don't.</p><p>My first trip consisted of 2 grams, then another gram and was all in all a pretty okay trip. In the coming up phase I felt paranoia, nausea and really bad about myself and what I had accomplished with my life so far (basically nothing), but on the plateu stage and the coming down phase I felt pretty good, so we decided next time we'd try even more than 3 grams. Naive as we were, we thought 'well we've tried this once, we can call ourselves experienced now, can't we? Time to higher the dosage!'</p><p>So for our next trip we had ordered some mushrooms online, we had about 7 grams each. It was me, my best friend, a buddy from school and my girlfriend. We started talking some around my table, slowly eating the caps. I was eager to get my trip going so I ate 5 grams as fast as I could, just laying back on my bed watching them eat, waiting for my trip to come...</p><p>After just a couple of minutes I started giggling, and the giggling turned into spontaneous outbursts of laughter, I couldn't control myself! I just laughed and laughed til tears started flowing, eventually I calmed down back at my bed watching my friends still eating their share of mushrooms. Then I closed my eyes, and started seeing egyptian pyramids, it was like I was in some kind of air plane flying by the pyramids so fast! They kept swooshing by my head one by one, pyramid after pyramid... for some reason I thought if I put my head down against my pillow then I will stop seeing pyramids. But as I put my head against the pillow, I saw the pyramids inside the pillow! And I wanted to reach out to them, so I tried extending my hand into the pillow, which of course didn't work... eventually I gave this up and fell back on the bed and started chit-chatting with my friends.</p><p>By this time they had eaten their share, and we sat back talking, laughing, making silly jokes that had no point but we still laughed and had a good time. We all had a fairly strong dose so we really started seeing things. One of my friends felt like the room was a tent, he felt the walls blowing back and forth like a tent does when the wind blows on it. And this scared him, he started seeing more and more things and he couldn't find a way to make it stop. The feeling of not being in control made him very afraid, he had no clue how to stop it. He started saying things, I don't quite remember what it was as I was in my own world... but he eventually said something along the lines of 'This isn't good, it's not supposed to be like this... I can't breathe! I can't breathe, anyone else feel this way?'</p><p>And after he said that, the room went quiet, everyone felt their throats... and I felt that I couldn't breathe either. I started hyperventilating, so did my girlfriend. It felt like I couldn't get any air at all, they started saying that maybe we should call an ambulance, or someone will die!</p><p>Those words kept repeating themselves, 'Someone will die! I have a feeling someone will die damnit!' one of my friends kept saying, and this of course scared the shit out of me. And so did the fact that they might call the ambulance. What would the legal consequences be? Jail? This whole ordeal scared me a lot, and you could feel that no one felt that well anymore, everyone were experiencing a 'bad trip'.</p><p>So my best friend, (The one who started it, so to say) called up someone that wasn't high, and talked to him. This person was able to calm him down, by saying things like 'It will go away, just be calm, it will go away' meanwhile the rest of us kept checking on the computer on various sites, to make sure this mushroom trip would not last forever, eventually we found somewhere where it said that the effects would go away after 6-14 hours, and this calmed us down somewhat.</p><p>Anyways, to wrap this up... all of us were experiencing what I would call a really bad trip, paranoia, feelings that someone would die, that I would die, that one of my friends would die... extreme paranoia as well. It was not a feeling I'd wish upon my worst enemy.</p><p>This has not made me scared of magic mushrooms, it has to one of the guys tripping with us though, he said he'd never touch magic mushrooms again. I'm willing to try it again though, but I've realized that to avoid bad trips, you have to be in a right mindset. Don't do it when depressed, don't take large doses when you aren't sure of the effects, and by all means... read up as much as you can about mushrooms. Read about other people's experiences, learn about them, this can help you maximize the fun of your trip and eliminate some of the chances that it'll end up as a bad trip.</p><p>What happened with us is that we stressed each other up so much that just because one person didn't feel very well, it made others feel the very same way. It was indeed not a fun day.</p>",
 "year": "2001",
 "id": "9332",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-09-10T07:00:00.000Z",
 "views": "19924",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. tampanensis",
   "form": "(dried)"
  }
 ]
}
