{
 "id": 9333,
 "title": "Complex Psychoactive",
 "date": {
  "submission": "2010-07-12T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jacky",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "substance": "Venlafaxine",
   "form": "daily"
  }
 ],
 "report": [
  "I took effexor, venlafaxine for several years for depression. My internal medicine specialist prescribed it to me after I got clean of heroin, he stated that effexor seems to work good for opiate addicts.",
  "Well I ended up with a serious chemical dependency to effexor, having worked up to 300 milligrams daily from an initial 50 milligrams, and had to kick that drug in jail since the jail nurse didn't yet have effexor on hand. The withdrawls were worse than opiate withdrawl, pretty much similiar to opiate withdrawl, but with added side effects, like spatial disorientation, which resulted in feeling as if electric shocks are going through my body every time I moved. I got over the effexor, and moved on to using opiates in a responsible manner (buprenorphine/methadone/viable prescriptions etc).",
  "My mother told me she was going to get on effexor, and I asked her not too while I did some more research on the compound. Well, she ended up taking effexor for 6 months, and when she decided to quit because of the tolerance curve she experienced with the drug, she experienced horrible withdrawls. She called me up and said she had alot more respect for me after she realized how horrible and scary drug withdrawls can be.",
  "I think effexor is a great antideppressant, for me it was effective pretty much immediately. When I took effexor for the first few times, I enjoyed a strong stimulant effect, some people in NA thought I was on speed, as I couldn't stop licking my gums and teeth, due to the strong stimulant effects that I was experiencing."
 ],
 "erowid": {
  "id": "56581",
  "citation": " Jacky. \"Complex Psychoactive: experience with Venlafaxine (Effexor) (ID 56581)\". Erowid.org. Jul 12, 2010. erowid.org/exp/56581",
  "substance": "Venlafaxine (Effexor)",
  "views": "6110"
 }
}
