{
 "title": "Vaporised",
 "author": "Dioptre",
 "citation": " Dioptre. \"Vaporised: experience with 2C-E (ID 93364)\". Erowid.org. Feb 14, 2012. erowid.org/exp/93364",
 "substance": "2C-E",
 "bodyweight": "70 kg",
 "report": [
  "<p>I won't go into a full diary style report, I just want this to give a rough summary of my experience vaping 2C-E.",
  "I use a lightbulb vape which I am pretty good at using. I load whatever in there and then hold a flame about 1-2cm away from the glass to prevent sooting. When I see the first hint of vapour I will usually begin inhaling, keeping it on the heat if I want a strong hit. I typically hold in hits for a good minute.",
  "2C-E develops a thick white vapour when heated. A rolling hit (breathing while heating) gives an easy-breathing smoke which is barely noticeable. A regular hit (heat then hit) is the same, unless a thick vapour is allowed to build in which case the smoke is quite harsh and leaves a burning sensation, much like DMT.",
  "The first time I did this was with 9mg. I would equate it to about 15mg but I do not think I vaped all the material.",
  "I tried to smoke all the material at once. I felt my alert within 5 minutes and peaked within 15 minutes. I would say the experience last about 2 hours after which I was left with a very mild psychedelic mentality for an hour. I used 2mls GBL to sleep after this.",
  "The second session was 10mg loaded up. I took a medium hit and peaked to about 4/10 within 10 minutes. I continued to hit the vape whenever I wanted to up a notch for the next two hours. After the first one hits seemed to come almost instantly, peaking within 5 minutes.",
  "I think this has awesome potential for managing your dose to find a level you like.",
  "At one point I was lying in bed with the subwoofer set to max, enjoying waves of euphoria with each vibration from Amon Tobin's ISAM.",
  "After my last hit it took about 2-3 hours and a good cycle to stop tripping, but I still had a strong psychedelic mindset until I went to sleep.",
  "I did not finish all the material so I cannot give an absolute dose comparison to oral, but my experience was more intense than 15mg oral. I would estimate that vaping is around twice as potent as oral consumption",
  "Hope this helps clear some of the fog which surrounds vaping 2C's.</p>"
 ],
 "year": "2011",
 "id": "93364",
 "gender": "Male",
 "age": "25",
 "views": "2139",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2012-02-14T08:00:00.000Z"
}
