{
 "id": 9338,
 "title": "Very Helpful",
 "date": {
  "submission": "2010-07-21T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Arquin",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Pharms - Mirtazapine",
   "form": "(daily)"
  }
 ],
 "report": [
  "Forwarning: I have bipolar, so experienced may change for people with regular depression.",
  "Okay, my doctor, a GP trained specially in depressive illnesses decided to put me on Avanza. He said he hadn't had much experience with it yet, and nearly no feedback from his patients who were trying it.",
  "I started on 30mg daily, just before dinner. First things I noticed were that I got very, very sleepy. I'd sleep for 12-16 hours at a time. This lasted for around two weeks. I'm pretty thin (60kg) and Avanza gave me a MASSIVE appetite. I could eat endlessly. So for me, this was a wonder drug. I had insomnia for two years, and in recent times it had begun to get worse. Avanza was like a knock-out pill for me. I started taking it before sleep. It would allow me to fall asleep easily, and sleep right through the night. It also made me gain weight, which gave me more confidence in my self, helping cure my depression. After a while, the Avanza stopped helping me with sleep. So I upped my dose to 60mg daily.",
  "Unlike SSRI's, I have no erectile disfunction or difficulty reaching orgasm. How ever, for the intial two weeks I was taking it, it messed around with my system a bit. Sometimes it would take hours to reach orgasm, sometimes five minutes. But that phase quickly passed. One thing I noticed with some antidepressents is that the sexual disfunction that comes with treating depression often just makes the depression worse. That's why I love Avanza.",
  "Now on to the rare side effects. It gives me very vivid and long dreams. It feels like from the moment my eyes shut to the moment I awake was one long dream, or sometimes, several hundred dreams. The other rare side effect is hallucinations. Nothing terrible, they don't scare me as much as they scare the people who see me whitnessing them. They're very short lived. Lasting only 5 seconds.",
  "As a recreation drug user, it's also pretty cool. Say you want to use MDMA on a Saturday, take a half dose of Avanza on Friday, and no dose on Saturday, and it's clear sailing. SSRI's often take up to two weeks to leave my system, so no MDMA for that time. For an antidepressent, Avanza is a pretty strong alcohol potentiator.",
  "Now my only issue with it is that I can't get off it. My depression is completely cured, apart from my downtime from bipolar (my depression used to be 24/7), but I can't get off it. If I wean my self off, I get horrible insomnia and am unable to eat. I'll start losing weight drastically. So now I just take it out of habit, and the fact that my body has grown used to it. I can't complain, it made me gain 7kg of weight, which makes me look much more healthy.",
  "Overall, I am happy with Avanza."
 ],
 "erowid": {
  "id": "56602",
  "citation": " Arquin. \"Very Helpful: experience with Mirtazapine (Avanza) (ID 56602)\". Erowid.org. Jul 21, 2010. erowid.org/exp/56602",
  "substance": "Mirtazapine (Avanza)",
  "views": "7795"
 }
}
