{
 "id": 9340,
 "title": "2-AI Revisited",
 "date": {
  "submission": "2006-10-13T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Psyonic-One",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100"
   },
   "administration": "oral",
   "substance": "2-Aminoindan",
   "form": "capsule"
  }
 ],
 "report": [
  "So after a several attempts with dosages up to 50mgs and relatively mild experiences I decided that not only was this substance seemingly lacking in the reportedly potentially 'dangerous' potency levels but that I wanted to really take it for a solid test drive.",
  "I measured out 100mgs into a veg-cap and down the hatch. I had just gotten off work and had some housework to do and knowing the stimulant properties that I had experienced in earlier trials, I thought it an appropriate setting to take it for a spin.",
  "T + 30min - Starting to feel the come up, energy circulating and a few little chills beginning.",
  "T + 60min - The come-up feels like its lagging a bit, perhaps I ate too soon before dropping. Still, effect increasing, but slowly.",
  "T + 75min - Ok, now I'm going a little better. Defined tingles on scalp and in extremities, seems to increase with activity. I occasionally have to take breaks from cleaning to just breathe and be with the feeling.",
  "T + 90min - Hot...Sweaty...a little scattered, definately would not want to run into a co-worker or my Mom. Tingles are nice and pretty consistent at this point, reminding me a lot of the ephedrine like buzz but as noted in previous experiences, a little cleaner feeling, no palpitations, nausea, etc...feeling pretty good.",
  "T + 120min - No marked changes, this is peak time, tingles and chills abound, no want of food at all though water is good. I make some Mac and Cheese for my girl and taste it and it tastes like the most bland mac and cheese ever...thought she reports that 'it is good'.",
  "T + 180min - Still zooming along, no sign of the short come down experienced with my lower dosage trials, perhaps there is a threshhold to be crossed in there and this time I did. The physical sensations are trailing off a little perhaps, or at least becoming less frequent. Folding laundry is making me sweat profusely.",
  "T + 300min - Still so hot...but the effects, at least the pleasant one, have more or less subsided over the last two hours. I am still alert, still sweating, and still geeked a little bit, but I could probably deal with my Mom or a co-worker at this point. My Girlfriend says she can't tell except that I am so sweaty, but that otherwise I am acting normal, if not just a little too awake for this time of day for what is typical with me.",
  "I began this experiment at 4:30 with first effect noted at 5:00ish...after several hours of pleasant, the effects have degraded to anorexia, sleeplessness, and mild agitation. I just want to sleep but I stay awake in bed for hours...I got up to pee and get water at about 1:00am and fell to sleep shortly after returning to bed. So that puts the short term effects initially experienced as just low dosage.",
  "I can say that 100mgs was probably enough for me. I might try more at some point but I am concerned about my inability to cool off, even with all the windows open on a cool night with my shirt off, simply folding laundry was like a work-out at the gym...lots of sweat and heat. My previous assumption that it might be fun for dancing would be true if not for the extreme heat at most clubs and raves, so I would recommend test driving outside of such a heat prone environment before taking it out to the clubs. I would probably also recommend not using it with other stimulants unless perhaps as a booster for MDMA or something, as the body feelings might be quite pleasant in combination. Anyway, that's it for 2-AI for now, we'll stow it back in the magic box until a time when it might be useful comes along."
 ],
 "erowid": {
  "id": "56608",
  "citation": " Psyonic-One. \"2-AI Revisited: experience with 2-Aminoindan (ID 56608)\". Erowid.org. Oct 13, 2006. erowid.org/exp/56608",
  "substance": "2-Aminoindan",
  "views": "22749"
 }
}
