{
 "id": 9344,
 "title": "I Proved There Was No God.",
 "date": {
  "submission": "2007-03-15T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "dilated_pupils",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.7 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "October 10th, 2006",
  "Last night I acquired some shrooms, weighed out 3.7grams and ate away.  Within 20 minutes I was already starting to come up, so I decided to go lay down for a little while.  I call a friend who is away in Florida for a week and as shes talking the intensity just keeps growing, more then I have ever felt before.  Eventually during the phone conversation I am not even paying attention to what she is saying, but more so to the green drapes I am seeing hanging from my ceiling.  I have no 'green drapes'.  They floated all around the room, and with my hand I was able to draw their forces to my hand, almost like an electric ball toy you see at stores when you touch the little bits of electricity go to your hand.",
  "At this point I part from my phone conversation and the trip just gets more intense which I couldn't even conceive possible.  I am laying on my bed unable to move.  I start hearing voices, and the tv's sounds/voices become the narrirator to my trip.  I truely believed that the tv was not what I was hearing, but it was me creating the sounds I was hearing.  I thought this simply because everything I heard related to me in some way, certain things were bold and loud to me which I found strange.",
  "At this point I am seeing things run across my room, I'm starting to feel delusional.  I close my eyes and my world is gone, I take myself to wherever I wish, this part of the trip gets a little hazy, but I remember forgetting who I was and believing I was stuck inside this trip.  I feel like I'm bleeding from my finger, as I didn't realize I had a finger in my mouth and I was biting very hard.  When I looked at my hand I couldn't even see if there was anything on it, I now start thinking to myself about how I can project myself to other places, the first example I used was going back millions of years when the dinosaurs were not extinct.",
  "I look out the window, everything looked incredibly odd, everything swaying, and then all of a sudden I would see headlights and a shadowy looking car, and all these gnomes would scatter and I would hear the scattering sound.  Then the shadowy car would come from the other direction.  I couldn't believe what I was seeing, I wanted to go outside to check this out for myself.",
  "Well I go downstairs, and as I'm looking out the windows before I get to the door, it looks like war of the worlds outside (it wasn't raining/lightning or anything), I was seeing light everywhere and it was only 2:00am something.  I ended up not going outside, I don't know if it was because fear, but I just didn't go out.",
  "And then...",
  "Some how I get on the topic of life/death and God in my head.  I go through several phases at this point, although I don't exactly remember which order they go in.  At one point I was in heaven visiting all my family, and then it turned into 'Wait, there is no God.'  I came to the conclusion that I was stuck in the particular moment in time I was in, and that I was 'my' entity for that moment and I was stuck there forever.  I then some how rationalized that my thoughts are what keep me 'alive' however I started thinking I wasn't even alive.  I got in a mind loop as to how my thoughts come from God, and God's thoughts keep him real, but they are all just thoughts and somehow this meant that there was no God, no people, no nothing and that I was just a figment.",
  "At some points I was in third person and the 'world' was my little toy I guess we can say in which I was in control of.  Imagine it though, we live here in this world, when in reality, maybe some larger then imaginable being is holding us in a room?  It sounds stupid now but made more sense while tripping.",
  "So now I am stuck thinking I am dead and I know I need to see a person to feel like everythings okay, but I didn't know what to do or really where I was.",
  "I wanted to find the meaning of life, I truly believe it would make me normal again.  I sifted through ideas, maybe it's love?  So I thought about my girlfriend, that helped a little but I couldn't remember anything about her except what she looked like, not even having sex a few hours priors to taking the shrooms could I remember.  I then thought that maybe being sober is the real life, and that by me tripping I went against what God has meant for us, but I quickly realized that it was not that.  There had to be a way for me to figure out the meaning of life, and I believe I came up with something but I can't remember unfortunately.",
  "I can't remember much as I ended up falling asleep after some time because I really was not able to remember what I had done that day prior to taking the shrooms, nor who I was and I just wanted to sleep, although I was freaking myself out thinking maybe I am sleeping, in fact at one point I made myself believe I was lucid dreaming.",
  "Anyway, overall this experience has changed me a lot, and I am going to be tripping again real soon to hopefully further this experience."
 ],
 "erowid": {
  "id": "56623",
  "citation": " Dilated_pupils. \"I Proved There Was No God.: experience with Mushrooms (ID 56623)\". Erowid.org. Mar 15, 2007. erowid.org/exp/56623",
  "substance": "Mushrooms",
  "views": "3834"
 }
}
