{
 "id": 9349,
 "title": "The System Cleaner",
 "date": {
  "submission": "2007-03-17T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Enigma",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I write this, about 20 minutes after a terrible end,...",
  "I got the Kratom on advice from the seller at the local SmartShop.",
  "I asked for a relaxing tea, I had bought and tried Passionflower tea about 6 weeks earlier, but I just added hot water rather then boiling it, so it was just a very relaxing, but nasty tasting tea.",
  "He said he didn't have anything really tea like, only brew things.",
  "But, he said, he had something he uses himself when he needs a nice calm.",
  "He showed me a 10 gram pack of Kratom, explaining that he takes 5 gram mixed with yoghurt in the evening.",
  "I already read about Kratom, and knew it had nauseating side-effects, so I asked whether there were any bad or strange side effects, besides the calming down.",
  "Where he replied there were none.",
  "I trusted him, thinking 5 grams of a 10 gram, which should be the full dose, is a light dose and probably just relaxing, like the Passion Tea.",
  "I got time to try it with yoghurt that friday evening.",
  "But it totally failed, it tasted so bad I couldn't get in more then 3 small spoons of it.",
  "The next week, now that is.",
  "I decided to try it with some juice, as described on the website of the store, and other places.",
  "T+0:00",
  "I had put the remaining 5 grams in a large glass and filled it up with chocolate milk, at first the powder floated on top.",
  "But after stirring a lot and waiting, it settled through the chocolate milk and became drinkable.",
  "It had a bit of a bad taste but not super awful.",
  "T+0:10",
  "When I had finished drinking it up, I looked through some music and made a relaxing playlist to chill on.",
  "T+0:30",
  "I lay down in bed, my hands were cold from working behind my computer, so I warmed them up.",
  "After my hands were warm, I relaxed, closed my eyes and felt sleepy, I was relaxed and tired, even without the Kratom.",
  "All that comes now could as well 've been placebo,... very likely actually.",
  "T+0:45",
  "With my eyes closed, I was very able to visualize lots and lots of imaginative things, pictures, moving to the music.",
  "I usually do this anyways, but it went extra good, seen I was very relaxed.",
  "T+1:00",
  "It got boring after a while, opened my eyes, looked at my video arcade cabinet and decided I wanted the music from there, as well as the winamp visuals displaying in the screen.",
  "I got out of bed, a bit wobbly in my legs, probably placebo, I had this with Passion Flower tea too, but not with mushrooms.",
  "Started opening the cabinet and working on it.",
  "T+2:00",
  "As I was messing with getting stuff installed, I felt a nausea coming up.",
  "I sat down and I started moving my leg neurotically, it made the nauseous feel go away, but it didn't make me feel any better.",
  "My mood wasn't really relaxed, my hands were shaking and I knew it was going kind of wrong.",
  "Was just a matter of waiting till it went away, then go to bed or write this experience thing.",
  "T+2:30",
  "I was chatting with a friend in canada on msn, told him about the kratom and that I felt like shit.",
  "I paused my typing and I knew I was gonna throw up, I looked around my room, to decide where to leave my stomach fillings.",
  "The floor was the best place, my garbage bin was full, and I had linoleum, or well, easily cleanable floor covering, so no real problem.",
  "I bended forward from my chair and waited till I actually had to puke, avoiding unnecessary moaning sounds.",
  "After 3 throws I was done, I didn't feel nauseous anymore.",
  "Cleaned up, and talked to the guy on msn again.",
  "Floor is still smelly.",
  "God this sucked, I didn't get any relaxier then the badly prepared Passion Flower tea, it tasted far worse, and I had to throw up.",
  "Not for a retry!",
  "It could've been miscellaneous things that contributed to the nausea, but it's mainly the kratom.",
  "Because I barely throw up,... even if I'm VERY sick, nauseous, dizzy from a boat ride, or bustour that's taking ages, I just have a nasty feeling in my belly, and sit that out for as long as it takes."
 ],
 "erowid": {
  "id": "56658",
  "citation": " Enigma. \"The System Cleaner: experience with Kratom (ID 56658)\". Erowid.org. Mar 17, 2007. erowid.org/exp/56658",
  "substance": "Kratom",
  "views": "19235"
 }
}
