{
 "id": 9350,
 "title": "A Full Belly and a Gentle Slope",
 "date": {
  "submission": "2008-05-06T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Igor",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  },
  {
   "time": "2:00",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  },
  {
   "time": "4:30",
   "amount": "70 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": ""
  }
 ],
 "report": [
  "Took approx. 100mg of pure MDMA in capsule form around 20.30 in Saturday evening in a relaxed home environment. We took it with the intention of 'opening up' and deepening friendship. We (4 guys, incl. me, +/- same body weight) had prepared the evening with a good selection of beers, some chewing gum (to keep our jaws busy) and a pack of cigarettes.",
  "We ate a heavy meal directly before ingesting the first capsule, so we were expecting the effect to come on slowly. Physical tells (sweaty hands, dry mouth) took effect about 30 / 40 minutes after ingestion. It wasn't until 22.15 that we really started noticing anything.",
  "The second capsule (another 100mg) was taken shortly after, at 22.30.",
  "The combined effect of both capsules became clear somewhere between 23.15 and 23.30. Conversation flowed freely, and we were all feeling great. It was exactly how we expected it to be. The effect was strongest between 23.30 and 01.30.",
  "Around 01.00 three of us took another 70mg's. Compared to one of us, who didn't take the third portion, there was absolutely no difference. Adding the third portion contributed nothing to the experience. By 02.00 the effect noticeable started to decrease. Around 03.00 it was completely gone.",
  "I strongly prefer eating a good meal before ingestion, because I will get hungry during use if I don't, and it also slows / enlengthens the effect. Previously, I have been shocked by the sudden wave of disappointment when the effect ended. With this amount, it gradually decreased, leaving none of us dumbfounded as to where our newfound enlightenment had gone.",
  "On the whole, a great experience. So far it is my most preferable drug."
 ],
 "erowid": {
  "id": "56660",
  "citation": " Igor. \"A Full Belly and a Gentle Slope: experience with MDMA (Ecstasy) (ID 56660)\". Erowid.org. May 6, 2008. erowid.org/exp/56660",
  "substance": "MDMA (Ecstasy)",
  "views": "3245"
 }
}
