{
 "title": "Soft Black Velvet Amphetamine",
 "author": "destiny",
 "citation": " destiny. \"Soft Black Velvet Amphetamine: experience with 4-Flouroamphetamine (ID 93539)\". Erowid.org. Dec 27, 2012. erowid.org/exp/93539",
 "substance": "4-Flouroamphetamine",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "175 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   " T+ 5:30",
   "200 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   " T+ 12:15",
   "2 bowls",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "footer": [
  [
   "2011",
   "93539",
   "Not Specified",
   "",
   "29",
   "Dec 27, 2012",
   "7402",
   " "
  ]
 ],
 "report": "<p>T 00:00 175 mg 4-FA oral</p><p>T 00:45 D feels effects</p><p>T 01:25 S feels effects</p><p>T 05:30 Redose 200 mg each</p><p>T 12:15 Smoke 2 small bowls of high quality nugs</p><p>T 12:30 Fall asleep</p><p>Drug Use History:  Opiates, benzos, tryptamines, MDMA, 4-MEC, 4-FMA, MDPV, mushrooms, LSD, dissociatives, cannabis, and others!</p><p>It was going to be a fun day.  My vendor had just received a new batch of 4-fa (I had ordered some once before that turned out to be inert). It was a white crystalline powder with the consistency of dry snow that refuses to melt, glittering under light. After an allergy test I prepared the doses for me and my partner. We were going to meet up with a friend for Halloween weekend and hit a BDSM club before crashing at her place. We dropped the pills before we left, and the effects hit mid-transit. I had eaten lighter that day and was about 30 minutes ahead of S, but she caught up quickly. I started with a very light headed feeling, a bit like the first rush of a cigarette after a long break, but without the nausea. I noticed my limbs tingling and my clothing felt soft. It was like the peripheral effects of MDMA were distilled and isolated. My mood lifted, and I was talkative, and my heart rate was 72 bpm from my normal resting of 61 bpm. Caffeine normally adds 5 or 6 bpm so it was only slightly more stressful (in comparison, MDPV put me at 126 bpm while laying down). Conversation was easy and flowing. There was no amphetamine 'I am just waiting for you to shut up so I can speak'. Instead listening felt as good as talking, a good empathogenic characteristic. Physical contact felt great, my skin felt as though my tactile neurons were on overdrive.</p><p>The empathogenic effects waned 2 hours after first alerts, giving over to a general amphetamine stimulation with waves of empathogenic softness. We geared up for the club and decided to each drop 200 mg. We had 2 100 mg pills each and decided to go for broke. The effects returned quickly and with the same intensity. Our time at the club was excellent. It was too crowded to play a scene but we met lots of good people and had good conversations. The empathogenic effects again waned about 2 to 3 hours in and left us stimulated and left me with a slight stutter, which was a bit annoying. My body didn't feel worn out at all, there was no prolonged fight or flight activation, and coming down was slow and gentle.</p><p>We returned to our friend's house and proceeded to indulge in a little three-way sexual recreation, which felt definitely enhanced. S passed out afterward and our sober friend also went behind her. I still felt a bit stimulated and proceeded in my nightly bedtime ritual of a one-hitter stuffed with nugs. I needed a second pack to get myself into a zone where I felt I could sleep. It was about 4 am when I fell asleep and we all woke up around 12 noon the next day. My body felt as if I had done no drugs. There was no dried out, joint and muscle devastation that I usually get after doing an amphetamine. I was slightly dehydrated but woke in good spirits and fully functional. That night I slept normally.</p><p>All in all one of the best RCs I have done lately, and by far the best 'conventional' stimulant I have ever done. The empathogeic edge is about 1 step above dexamphetamine and 1 step below 4-MEC (and 3 or 4 below MDMA) but really made this a unique substance. I have since tried it in lower doses. 50 mg provides a good pick me up with a micron of emphathogenesis that lasts about 1 hour. 50 mg lasts only 6 hours total. One note, this is not a substance that will wake you up after a night of little sleep. It lacks the noradrenaline affinity of regular amphetamines which also means it will not suddenly shift you from 'ohhhmygawd I need some sleep' to 'awake and ready to tackle the world!!' When I had missed sleep one night, after work I met S and we both took 125 mg. I actually passed out after taking it and woke up right before I started to come up. There seems to be a characteristic 'sudden wave of tiredness before tweak' in this substance, in contrast to amphetamine's 'the second the pill hits my stomach sleep is no longer an option'.</p><p>If stims were blankets, dexamphetamine would be a rubber sheet that shrinks around your body. 4-FA would be soft black velvet. Even though it feels so damned harmless this is by no means an invitation to all to go crazy. Respect this gem and it will treat you well.</p>"
}
