{
 "title": "You Dont Get High, Just Productive",
 "author": "NeonSoul",
 "citation": " NeonSoul. \"You Dont Get High, Just Productive: experience with Methamphetamine (ID 9357)\". Erowid.org. Jul 5, 2005. erowid.org/exp/9357",
 "substance": "Methamphetamine",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)",
   "",
   " repeated",
   "smoked",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Mid-day Friday at McDonalds where I work. My manager asks if I ever have tried crystal (everybody in the fast food industry does drugs...seriously) I told him not yet. He showed me his bag, a tiny bag of completely translucent crystals. Apparently the best my manager, and friend, 'Joe' had ever seen. It had been over a year since he last tweaked but couldnt pass up that good looking crystal.</p><p>We take a 15 (break) and drive outside of McDonalds. He lines up two very, very small lines and we each railed one. All of a sudden there was absolutely no fatigue in my body, I didnt even know I was high yet but we headed back and started talking a lot more. Once we got inside our break was already over so I clocked in and got back to work. All of a sudden I realized what meth is all about. Speed. Its different from all other drugs you dont get high, or faded, you just get faster and everything becomes clearer. It straightened my head up. Thinking through math problems or complicated situations became easy and fun. I was motivated, more motivated than I ever had been in my life. And I was fast, damn fast at everything and I did an awesome job. I couldnt accept anything less from myself than busting ass. At the end of the night we had sent home just about everyone early and the store looked better than Id ever seen it. I had a perfect till and a good write up coming my way. Customers even were giving me tips for being so friendly and fast.</p><p>Finally we were done and I went over to his house. We smoked a few bowls and then he showed me how to smoke meth with a light bulb and tooter. I probably took 4-5 hits from the meth pipe the smoke tasted unique, not bad at all and much better than the drip from railing that shit. It hit me then, way harder all at once. We couldnt stop talking for about 20 minutes just about anything and everything. Finally we realized that and went to another friends house to hang out. Its here I realized something else...people dont notice you are on meth. I had a great time and didnt even make any stupid stoner mistakes. Eventually we came back to the house took some more hits at around 2 and played video games/talked until the sun started to come up. I was coming down and actually managed to sleep easily which is fucked up Joe thought. He stayed up into the next night. We took another small rail in the morning which energized me better than any full nights sleep could give.</p><p>Meth is strange, you dont get high, just productive. Even if your body isnt your mind cannot stop singing songs thinking up new shit to do or whatever. I can see it being addictive as you just take more and more and dont need to sleep or anything else. Joe had been up for 28 days once off crystal and thats nothing he tells me to other people hes met. Personally Id never do it that much but once in awhile I see it being fun, raves, tests, projects, you know those special times every once in awhile where you need to be 110%, thats possible with meth. Dont let too many of those situations come up though.</p><p>Overall comedown wasnt very hard at all (would suck alone), dont plan on doing it for at least a month so. Doesnt seem that addictive. I think its possible to use this drug constructively without abusing it.</p>",
 "year": "2001",
 "id": "9357",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-05T07:00:00.000Z",
 "views": "10591"
}
