{
 "title": "A New Chemical to Me",
 "author": "Juniper Berries",
 "citation": " Juniper Berries. \"A New Chemical to Me: experience with Methamphetamine (ID 9366)\". Erowid.org. Jul 5, 2005. erowid.org/exp/9366",
 "substance": "Methamphetamine",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   " lines",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>When I tried speed it was during a visit home, involved was my friend and 2 relatives, also another friend who rolled constantly. We free based it. I felt very present, when I reclined in my comfy chair, sat back and listened to the chit chat, hardly getting involved. I was put at an ease which was bordering on intense. The rolling-often other friend, happened to not eat any pills that night, only a few drinks, 2 or 3, he suddenly left, very abruptly and with hardly a word. No one has heard from him since, but a girl we know saw him at an after-hours, a few weeks later. I stayed until the next night.  Mainly alert and present, and pleasant.</p><p>Then a few weeks later.  I used a little bit later. But, not memorable. Once, I went out on a night before having to work in the morning, I spotted a guy that's all interested in me, I told him that I needed to stay awake until work, and throughout the shift of 8 hours. Every twenty minutes or so I get his baggie off him. I was new to it and did a lot as it turns out. Work wasn't a problem. My Job is to stock shelves with natural products. I was quiet and attentive to being thorough.</p><p>The problem arose of my being too aware of each instant, a consequence was the day seeming longer. in the latter half of he shift I grew antsy. Found myself having delusions of everyone giving me deliberate attention. When I coordinated with my boss, I felt that I came across intensely, and in a frenzy. Things got strange and uneasy when I saw a co-worker to my left and turning a corner saw her again. OH WOW! I didn't like it.</p><p>I called my boyfriend of only 2 weeks and had him come get me, so I wouldn't have to take the public transit. I couldnt wait to leave. Getting very anxious to get from there. At his house I felt not so alone and fearful, but still I was sketchy and thought he might murder me, in different ways. By a gun which is kept in the house, in which case I planned to leap through the window, forgetting about the iron bars. Or stab me with big knife, which he used to prepare a snack. I didn't know him as well as I do now, or imagine to. We argued dramatically over some truth issues, not related to the speed, he has been 'jacked up' himself in his time.</p><p>These days I repeat use in the same way, going to parties of worthwhile DJs, working a few hours later. I'm better about it. And now am finding that I can easier function without any use beyond the club. It does take a long time to wrap up the 8 hours, often without a break, so to be able to leave sooner. </p><p>I stay up on my nights off and read The Lord of the Rings. The eeriness I'm subject to noticeably.</p><p>No complaints really, I keep attentive to any rise of psychosis in myself. I have a friend who become paranoid and delusive. She may have been a bona fide schizophrenic. She has amazing goals, but seemed peculiar and distant. She didn't return calls, for fear of being a polluting influence. She killed herself.  I recommend weariness, and precaution to not get in too deeply. Be vigilant of changes in your physical, mental, emotional, perhaps spiritual embodiments. I'm having a nice time. I don't regret my taking it at all.</p>",
 "year": "2001",
 "id": "9366",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-05T07:00:00.000Z",
 "views": "6456",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " lines",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 ]
}
