{
 "title": "Bargain Basement Ketamine",
 "author": "Futant",
 "citation": " Futant. \"Bargain Basement Ketamine: experience with Methoxetamine (ID 93672)\". Erowid.org. Jan 7, 2012. erowid.org/exp/93672",
 "substance": "Methoxetamine",
 "bodyweight": "57 kg",
 "report": "<p>As an experienced ketamine user in the north of England, I had been finding the recent drought somewhat irritating (although it was nice to be able to use my nose again...)All sorts of dubious substances were being bandied about under the name 'k', and I had little to no confidence in any of them, so stayed away. A phone call from a trusted friend got me a bit excited - ''Kevin's back!' he said.</p><p>After rushing round there imagine my disappointment to hear everyone grumbling that this stuff was something other than ketamine, with a similar but 'different' effect. I had a look (and a little sniff) and realised it was MXE, a legal 'alternative' which I had tried a couple of times before, with unimpressive results. In the interests of science I decided to study the new drug more thoroughly, and so racked up a line of about 100mg (smaller than I'd make a line of k, I'd heard this stuff was quite strong), and of course, sniffed it.</p><p>After about 20 minutes I started to feel a bit strange, it came on much more gently than the white horse does and is a bit frustrating if (like me) you like that 'sliding towards a hole' feeling. Soon after that I was experiencing mild confusion, slight difficulties with motor functions as well as sensitivity towards light. So far, so-so.</p><p>About an hour after that I was offered another (slightly bigger) line, and out of boredom accepted. The effects were exactly the same, although a little more pronounced. As the night wore on I realised there was a mild stimulant action, as I didn't feel tired at all and I'm usually one for going home to bed! Over the whole night (from about 9pm - 6am) I sniffed about a gram in several small lines. I never experienced any other effects than the ones mentioned above. After the final line I would say the effects lasted for about 3 of 4 hours, lessening slowly as time went on.</p><p>After I went home and had a sleep,  (which was difficult, the mephedrone-like buzz clung on and it was only when I closed my eyes that I experienced anything close to an interesting visual effect - lots of flickering)I awoke feeling a bit groggy (which is normal), I didn't have a 'hangover' but I did have difficulty with getting my words out. I also felt a bit low, but can't necessarily put that down to the MXE.  One interesting thing I did notice was that throughout the night in question and the next day  I had an almost constant need to urinate, then when I went to the toilet it wouldn't happen. This is a problem reported by many heavy k users, but one which I had never experienced myself.  It would have put me off if I hadn't already decided that the drug was crap and not worth doing again.</p><p>I remain unimpressed with this drug for several reasons. The first is that it has (in my experience) none of the interesting qualities of ketamine - no real visuals, no psychic links, no out of body stuff, no feeling of movement, no hole to speak of. The confusion, physical difficulty and snot well known to all k users were there, but on their own they're not much fun. The second is the difficulty pissing, which I found really irritating. Another reason I don't like it is that it is being sold as k, although I suppose that's a problem with unscrupulous dealers rather than the drug itself.</p><p>After doing a bit more research about MXE I read that it lowers the breathing and the heart rate of the user, in contrast to ketamine which raises the heart rate and doesn't affect breathing. I find this quite worrying in a drug which can induce ketamine-like loss of consciousness, and this is the final reason why I won't touch the stuff again.</p><p> Unless I'm REALLY bored...</p>",
 "year": "2011",
 "id": "93672",
 "gender": "Female",
 "age": "26",
 "timestamp": "2012-01-07T08:00:00.000Z",
 "views": "4658",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  }
 }
}
