{
 "id": 9371,
 "title": "LSD Revelations",
 "date": {
  "submission": "2002-01-20T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Symptom6",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD"
  }
 ],
 "report": [
  "well, when i took my second trip, I did 5 hits while walking in the forest, and as i was coming up, and walking over a bridge, i drew the lsd molecule on the railing and wrote 'albert hofmann is my father' as a joke. i'm not gonna go into too much detail on the visuals, because they weren't too much different from last time, and i'm sure anyone who's done acid know about 'em already... mainly mandalas and and peoples faces moving around. I watched trainspotting with my sitter (he was somewhat concerned due to the disturbing imagery, but for some reason i've always found that movie to be kind of life affirming and good), but i couldn't really keep track of what was going on. while watching the movie a made a few realizations:",
  "The first was that evolution is a self anihilating concept, in that the species which becomes dominant inevitably destroys itself, allowing the process to start over again.",
  "The second, which i realized as i pet my dog and was overwhelmed",
  "by the vast amount of pure, unconditional love pouring from him, was that we are all one being, experiencing itself for the sheer joy of it, which led me to the third revelation, that the point of life (or at least mine) is to be happy and to make others happy. which is why i can't stand those who disregard others feelings and only persue their own pleasure.",
  "As my sitter left, we talked a little, and i was nearly brought to tears by his kindness in watching me, and allowing me to be myself. I now feel very lucky to have him as a friend, because he has never judged me and he's always supported me in all my decisions.",
  "Later, I went to take a shower. I looked at my body and realized how ape like humans really are, and i realized that as much as we revel in our physical achievements, and our physical form, we are, as a people, ashamed of our simian heritage, although many of our postures are those of apes, and squatting on my feet, i could almost feel a tail extending from my spine...",
  "overall, it was a very good day, and i hope to repeat the experience before too long, but those 5 hits were the last of the 10 that i got in october and i don't have any money at the moment, so i'll probably end up taking another 3 month stint of sobriety..."
 ],
 "erowid": {
  "id": "5673",
  "citation": " Symptom6. \"LSD Revelations: experience with LSD (ID 5673)\". Erowid.org. Jan 20, 2002. erowid.org/exp/5673",
  "substance": "LSD",
  "views": "8803"
 }
}
