{
 "id": 9372,
 "title": "Dreams and the Vegetated State",
 "date": {
  "submission": "2007-02-16T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Honk",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "4.0",
    "quantity": "4.0"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "capsule"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "g",
    "grams": "4.0",
    "quantity": "4.0"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "capsule"
  },
  {
   "time": "0:00",
   "administration": "oral",
   "substance": "Kava",
   "form": "ground/crushed"
  },
  {
   "time": "2:00",
   "amount": {
    "unit": "g",
    "grams": "4.0",
    "quantity": "4.0"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "capsule"
  },
  {
   "time": "2:00",
   "amount": {
    "unit": "mg",
    "quantity": "300",
    "grams": 0.3
   },
   "administration": "oral",
   "substance": "Chlorpromazine"
  }
 ],
 "report": [
  "Tonight I was in an odd mood.  I had a long day at work and had to do even more work this evening.",
  "In the mail today, I received 48g of Kratom 15X extract, and with it came a packet of ground Kava Kava.  I proceeded to fill sixty size 000 gel-caps with the Kratom, and ingested five of them (four grams) immediately.  An hour later, I ingested another four grams, and mixed the unknown quantity of Kava with soy milk and chugged it.  Another hour passed, and I decided to pop 300mg of Thorazine and another four grams of Kratom 15X.",
  "So the tally is:",
  "12g Kratom 15X",
  "some amount of ground Kava Kava",
  "300mg of Thorazine",
  "I took the Thorazine and final four grams of Kratom about fifteen minutes ago.  I guess the word that most describes my state of mind is *relaxed*.  But there is also, deep down, a sort of nervous tension / energy that I can feel.  It feels like it is trying to come to the fore, but I am doing my best to keep it hidden.",
  "I was unsure as to how the Thorazine (the first anti-psychotic, which blocks a whole hell of a lot of brain receptors) will interact with the Kava and the Kratom.  After my first four grams, I felt the pleasant Kratom high, all sedated and nodding and peaceful.  I took the second four grams, and the Kava, when the itching started.  The third four gram ingestion, as well as the rather large Thorazine dose, was taken right before I had to start working.  I must tell you that I am working from home, lest you think I would drive after polluting my body with this stuff!  Anyway, it seems like the Thorazine is, rather than countering Kratom's power, subtly enhancing it while bringing me down from the 'floaty' feeling of opiates.  I would rather have not taken the Thorazine with the Kratom, because I like the floaty feeling.",
  "Thorazine, which is fifty years old, has been quite outdated by the new, 'atypical' anti-psychotics.  Also, there is not much reason to use Thorazine for psychoactive adventures.  I am using my batch (which I obtained through sources other than my doctor) in order to try to completely quash any and all emotions I may feel.  I am a seriously unbalanced individual, and my main problem is an inability to stop thinking rather awful, self-destructive thoughts, and feeling afraid of everything outside of my bedroom.  Also, I know that my friends are only pretending to be my friends, and will sooner or later turn completely against me, thus destroying my entire existence and sense of self.  When I am on the good old Thorazine trip, I can put it out of my mind for awhile.",
  "Being on Thorazine feels as if a giant, soft, amorphous mass, perhaps a hand, is pressing down on the top of my brain.  It is probably the closest I can get to a lobotomy without actually having the surgery.  Nothing seems to matter and nothing upsets me.  On the flip side, I don't feel any real pleasure or joie de vivre, but since I rarely feel that anyway, I'd rather get rid of it all than have the scales tipped inexorably towards pain.",
  "Thorazine also has somewhat of an antihistaminic effect, so it does make me feel drowsy or sedated, but that passes soon enough.  Another thing I noticed is that my dreams are VERY vivid and always either scary or very morbid and destructive.  For example, one dream I had was that there was a nuclear bomb hidden in the basement of my office building, and my plan was to set it off and blow up myself and the entire city.  Another dream involved time loops, in which a man whose skin was burned off completely was attacking me... but I didn't know why he was until my dream progressed to the future point where I ended up blowtorching the man alive.",
  "Stuff like that.",
  "Since my true goal in life is to be a drooling vegetable sitting in an asylum with absolutely no knowledge of, or care for, the world outside my mind, I figure this is a good step towards seeing what that will be like when I finally achieve it.  So far, I like it just fine."
 ],
 "erowid": {
  "id": "56731",
  "citation": " Honk. \"Dreams and the Vegetated State: experience with Kratom (15x extract), Kava & Chlorpromazine (Thorazine) (ID 56731)\". Erowid.org. Feb 16, 2007. erowid.org/exp/56731",
  "substance": "Kratom (15x extract), Kava & Chlorpromazine (Thorazine)",
  "views": "46546"
 }
}
