{
 "title": "Drunkenness without Intoxication",
 "author": "Savage Henry",
 "citation": " Savage Henry. \"Drunkenness without Intoxication: experience with Phenibut (ID 93731)\". Erowid.org. Feb 29, 2012. erowid.org/exp/93731",
 "substance": "Phenibut",
 "bodyweight": "250 lb",
 "report": [
  "<p>I started playing around with phenibut a few weeks ago after reading about it on some forums that I go to. It was grouped under nootropics/'smart drugs', which I think is inaccurate because phenibut actually has noticeable effects unlike noops which may be nothing more than placebos.",
  "The first thing I noticed is that the phenibut powder tastes TERRIBLE. Super sweet. Nasty. Don't even think about just dumping it on your tongue and swallowing it or something like that. I just dunk it in some soda and down that which works well. On an empty stomach it gave me a pretty bad stomachache. But enough of the warnings, onto the effects...",
  "After eating a small meal it started to take effect about an hour later maybe? Phenibut's primary effect is just a sense of well-being with the world, I'm thinking today's gonna be a good day. I'm also much more talkative and animated on phen, similar to being buzzed or drunk but without being intoxicated in any way. It's easier for me to jump into conversations instead of just keeping quiet like I usually do.",
  "I haven't combined phenibut with any other drugs yet, other than cigarettes. I feel that phen dampens the effect of nicotine because I wasn't getting as buzzed as I usually do (I smoke maybe a pack a week).",
  "Tolerance shoots up on this shit really fast. It even says on the tub of powder, 'do not take more than 3 days in a row without 2-3 day wash out'. Other than that, I love this stuff.</p>"
 ],
 "year": "2011",
 "id": "93731",
 "gender": "Male",
 "age": "21",
 "views": "9216",
 "dose": [
  {
   "time": "0",
   "amount": "2.4 g",
   "administration": "oral",
   "substance": "Smarts - Phenibut",
   "form": "(powder / crystals)"
  }
 ],
 "submissionDate": "2012-02-29T08:00:00.000Z"
}
