{
 "title": "Fuzzy Sophisticated Euphoria",
 "author": "Cryptix420",
 "citation": " Cryptix420. \"Fuzzy Sophisticated Euphoria: experience with DXM & 25I-NBOMe (ID 93774)\". Erowid.org. Dec 16, 2011. erowid.org/exp/93774",
 "substance": "DXM & 25I-NBOMe",
 "bodyweight": "160 lb",
 "header": [
  "DOSE: T+ 0:00",
  "350 mg",
  "oral",
  "DXM",
  "(liquid)",
  " T+ 0:00",
  "25 mg",
  "oral",
  "Diphenhydramine",
  "(pill / tablet)",
  " T+ 0:05",
  "1 hit",
  "sublingual",
  "2C-I-NBOMe",
  "(blotter / tab)",
  " T+ 0:05",
  " repeated",
  "",
  "Cannabis",
  "",
  " T+ 0:00",
  " ",
  "oral",
  "Pharms - Temazepam",
  "(pill / tablet)"
 ],
 "report": "<p>As I've already submitted a different, more detailed report on 25i-NBOMe, this is more just a summary of effects on a new combination involving DXM.</p><p>350mg DXM was consumed in the form of syrup, along with 25mg of diphenhydramine to prevent robo-itch. [I also consume a mixture of water and something called cellfoodan amazing supplement with many uses, but here it was used to help digest and breakdown all the crap in the cough syrup. A few minutes later, I placed the 500ug blotter of 25i-NBOMe on my gums/underneath my tongue for around 20 minutes (bitter taste, slight tongue numbing effect noted) and then I spit the paper out.</p><p>The come up was unusually intense, for either drug. 25i always offers me a completely anxiety free trip (it is unique for me in this regard) as does DXM, so it was odd to feel so tense. It was probably in part to trying a potentially dangerous combination, but my adventurous side gets the better of me more often than not.</p><p>At around 2 hours, I felt a wave of relaxation settle over me, and the two chemicals seemed to finally be getting along. The body high was fantastic, and only increased in euphoricosity throughout the night. Copious amounts of high quality cannabis were also smoked throughout the night, and added untold levels of warmth and giggles. We also ate almost an entire batch of medium strength homemade pot brownies. There were a couple of hours where my girlfriend and I simply put could NOT stop laughing no matter what. It was a great trip, my girlfriend and I worked out some issued we'd been having and our attitudes are vastly improved today compared to recent weeks. I should note my gf only consumed 500ug of 25i, no DXM; it was her first time trying it.</p><p>The next 4 or 5 hours were just a big orgy of mind-blowing tactile sensations, sexuality, incredibly enjoyable and colorful visuals, just amazing overall mind/body feel. Communication was so easybetter than MDMA in ways. I've done MDMA with my girlfriend many time, yet I've never felt such a carnal attraction and want to touch and be touched by another human. It made the whole experience of love very tangible and I almost feel as if it reignited a spark between my gf and I. I had a candle lit with ambient music on and we just laid in bed and rubbed our bodies and faces on each others...it was incredibly sensual.The DXM did make the visuals from the 25i quite a bit different than they normally are. Hard to explain how thougheverything just seemed more fluffy and lush. I had to pee quite a bit during the experience as well.</p><p>10mg temazepam was consumed at the tail end of the trip, and added a nice kush feeling to the whole experience. Made sleep incredibly easy, woke up refreshed.</p><p>An awesome experience, but nothing I'd jump to repeat soon, perhaps because I fucking hate chugging cough syrup. I do want to try this chemical with MDMA thoughI see much potential</p>",
 "year": "2011",
 "id": "93774",
 "gender": "Male",
 "age": "21",
 "timestamp": "2011-12-16T08:00:00.000Z",
 "views": "6967",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "350 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 0:05",
   "amount": "1 hit",
   "administration": "sublingual",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  },
  "3": {
   "time": " T+ 0:05",
   "amount": " repeated",
   "administration": "",
   "substance": "Cannabis",
   "form": ""
  },
  "4": {
   "time": " T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Temazepam",
   "form": "(pill / tablet)"
  }
 }
}
