{
 "title": "The Funniest of Times",
 "author": "Anastus",
 "citation": " Anastus. \"The Funniest of Times: experience with Bromo-Dragonfly, Alcohol, Cannabis, Diazepam and Clonazepam (ID 93806)\". Erowid.org. Jan 26, 2012. erowid.org/exp/93806",
 "substance": "Bromo-Dragonfly, Alcohol, Cannabis, Diazepam and Clonazepam",
 "bodyweight": "121 kg",
 "header": [
  "DOSE:",
  "500 ug",
  "oral",
  "Bromo-Dragonfly",
  "(blotter / tab)",
  "",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)",
  "",
  " repeated",
  "oral",
  "Alcohol - Hard",
  "(liquid)",
  "",
  "4 mg",
  "oral",
  "Pharms - Clonazepam",
  "(pill / tablet)",
  "",
  " ",
  "oral",
  "Pharms - Diazepam",
  "(pill / tablet)"
 ],
 "report": "<p>I was already in a jolly mood, having resently moved a bit further away  from the hectic life in the city to a small village, and had come to town for a party that was held in a commune that's a local legend for it's parties. I had been smoking my bong since waking up, and was already quite buzzed waiting for my friend who was to accompiany me for the party. On the phone he'd mentioned he'd gotten us something a bit more special, but since such things aren't talked straightly about on the phone, I had no idea what it'd be. LSD? Speed? In my spare time waiting I also drank a 75 cl bottle of 10% white wine and had a few hits from my  l bottle of Jack Daniels.</p><p>He finally arrived around nine, and indeed it was something special, since I consider all new experiences as special. I had never tried Bromo-Dragonfly since I had no trustworthy supplier, but since I've shared the last ten years of my life with the guy, in a sense, he is one of the few people around I know who've taken a wider range of substances than even I have, and I had my RC days...</p><p>It was just like your basic paper, the other side looked like it could be from a carddeck, and the other was white with a small clear print of BDF. 500 mics he said, and I believe it. Knowing the onset could take frustratingly long, we spent another hour smoking and rolling joints for the party.</p><p>When we got there, it was on. In under thirty minutes we were already offered cannabiscakes, the mood there was lively and we ended up immediately sitting in the kitchen, the heart of a houses social life. Since atleast half of the people there were either my friends or their friends, neither of us felt any unnesessary fears or such, we blended in just fine.</p><p>Since we'd taken the BDF three hours earlier, and I already had the sensation I have with acid rising that 'somethings coming', I took my friend upstairs, where the middle room at the top of the stairs is colourful in many ways, in lighting, in decoration, set up as a lounge to lay around in. A great place if you're expecting something visual. And it all went well, when it finally hit me I don't know if it was BDF or the alcohol, but I did have some short blackouts, some of wich I've remembered later on. But the loss of ego in a sense, that was wonderfull, I gave two girls the massage of their lifes, played drums with people, in one of the bedrooms there was a bit of a rave going on. And since it's Finland, a party ain't a real party without a sauna that's on all the time. It's almost impossible to precisely describe how the heat and steam felt, expect that they were wonderfull aswell. Everything was. The steam took colours when I wanted it to, I was very in control.</p><p>Afterwards I left the party at an unknown time, and headed to a place I'd arranged for myself to sleep in, but sleep ofcourse, was no option. I kept slowly drinking beer and smoking alone the entire night, feeling, pondering. I think after the actual onset around 1 AM the actual rising of it took like 12 hours or so. The visuals were truly great, so flexible and somehow controllable.  </p><p>The day I spent meeting friends and doing the prementioned, until I took a bus home, fell asleep around eight only to wake up at midnight to still a very jolly mood, restarted drinking with my roommate for a few more hours and finally crashed to real sleep after taking double of my normal 2 mg rivotril and a few valium.</p><p>Needless to say, the aftereffects are possibly the longest I've ever had. The next day I woke just in time to rush to my first meeting with the local social worker, and If I wasn't experienced with psychedelics, I think the meeting could have been akward, since her face kept flushing and I occasionally heard 8-bit Nintendo-like soundeffects out of nowhere. But in my case, the meeting went well. Later that day I had no more visual effects, but the occasional odd sound still came once in a while.</p><p>In retrospective, for me it was great, and I already eagerly wait to try it in privacy without the booze, in a very different sort of place and setting. It's just so long lasting, I'd recommend anyone thinking of trying it to do so on a friday, if they're in school or work or something like that...</p>",
 "year": "2011",
 "id": "93806",
 "gender": "Male",
 "age": "25",
 "timestamp": "2012-01-26T08:00:00.000Z",
 "views": "10857",
 "dose": {}
}
