{
 "title": "Not Fucking Around",
 "author": "Explorers Club",
 "citation": " Explorers Club. \"Not Fucking Around: experience with LSD (ID 93816)\". Erowid.org. Jun 18, 2013. erowid.org/exp/93816",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2.5 hits",
   "sublingual",
   "LSD",
   "(blotter / tab)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>\tWe took off at 7pm on a Friday evening. There was me, and the other members of the Explorers Club, that is S, J, and L. We began our night in my apartment, where our non-partaking roommates had deserted, understanding that there would possibly be four deranged individuals doing the Acid Drugs- probably imagining us shooting pure LSD into our carotid arteries and trying to jump out windows or cut off our hands. Nothing of the sort happened of course, because this is real life, and not an episode of Dragnet.</p><p>\tAnyway, Hearing that this was good shit, I had decided to start with one and a half hits,with the other members taking either more or less, depending on their confidence in their ability to hold themselves together. I had attempted to make our setting as pleasant as possible- colored lightbulbs, blacklights, cool artwork, Pink Floyd and Flaming Lips records were prepared. There was also a music visualizer playing on the TV, and we had some bubble-blowing toys and some colored tissue paper to play with.</p><p>\tAfter a while of letting our tabs soak sublingually, and without noticing any strong effects, I was not hesitant about taking another half a hit, taking me now to two hits.</p><p>\tStarted to feel like something was beginning, so we tore up the colored tissue paper into confetti, and started throwing it at the air conditioner, which would blow it up into the air in a messy Easter-colored tornado. We were beginning to feel that slight squirmy electric feeling crawling all over our beings, when the outside roommates made their way in. They drank some water, and stared on in horror as they saw four young adults writhing around in colored paper shreds on the floor, quoting spongebob, blowing bubbles, and handing them gifts of small fabric pot leaves.</p><p>\tAfter they left, we began questioning why we dont always play with confetti. Why dont we always blow bubbles? Or jump in piles of leaves? ... An idea took hold...</p><p>...</p><p>\tSoon, we were out in the cold October night, standing in piles of leaves, which was most satisfactory.</p><p>\tLater, we were up on an elevated platform on top of some buildings on our campus. We had gone there expecting to see lights from the buildings pulsating, geometric patterns in the dark sky, and the platform itself stretch out for miles as it had on our previous trips. This trip, it was doing none of those things. I began to wonder if we were even tripping at all. There was just a sense of childish playfulness, not a cosmic awakening as I was half-expecting (again, based off of prior experiments).</p><p>Im afraid I might have left the strip out too long- the sun might have diminished its potency, I said.</p><p>Ah, dude., said S.</p><p>I dont know... this is kind of nice, like, I dont know, said L.</p><p>J said nothing, but chewed on a blade of grass for quite some time.</p><p>I have an idea. Lets go back to the apartment, take another half a hit each, drink a lot of orange juice, and smoke a lot of pot. We wanted to get high tonight, so lets try to get as high as we can</p><p>The Explorers Club agreed.</p><p>\tWe cut up the remaining two tabs, and took them with some Sunny D rip-off swill that declared itself 100% Vitamin C. (this brought me now to two and a half hits)</p><p>Flavor be damned I thought, Its those vitamins that will do us good.</p><p>\tSo we all took our seats in the bathroom, and pulled out our bong, The Space-Time Continuum and proceeded to smoke the most I have ever seen anyone smoke in my entire life. I took no less than seven full rips before we ran out. The room was lit green, and we had some incense burning, as well as The Flaming Lips At War with the Mystics playing from an iPod dock. By the time Free Radicals came around, I noticed that in the dark parts of the room, there was color that should not have been there. My mind was projecting imaginary but brilliantly colored lines radiating outwards form the edges of objects in the dark. The ambient psychedelic music blended well, and for a few brief moments, the room seemed to turn into a rainforest, trees beyond my field of vision, exotic animals lurking, and everything gaining a layer of warm tropical moisture.</p><p>\tI have no idea how long we spent in there, but at some point we walked out, and sat on the couches of the living room. It was difficult to understand what sort of state we were in. It was like I would change from feeling entirely sober, to really high, to tripping, to tripping and high, then back to sober again.</p><p>What am I right now? We all seemed to be thinking.</p><p>And almost as though it heard us, it was like at that moment the acid said:</p><p> You want to know? You want to know what two and a half hits of acid and an uncountable amount of bong rips is like? Well, here you go, shithead. This is what you bargained for.</p><p>\tS asked Are we tripping?</p><p>\tI thought about it a little, then looked at the kitchen. I made my observations and promptly screamed:</p><p>\tLOOK AT THAT SIDE OF THE ROOM! LOOK AT THAT SIDE OF THE ROOM! Yes! We are tripping! Holy Shit!</p><p>  I had never been this far gone in my life before, and it was a little unnerving to say the least. The vibrations seemed to be turning on me, I thought. The pink lightbulb cast forth eerie shadows from oddly undulating cabinetry in the kitchen, where i sat, perched precariously on a leaning barstool, spending years slathering Nutella on a slice of one dollar white bread. Though I was not necessarily hungry (Lucy had seen to that), there were certain food rituals I have become accustomed to (thanks to Mary). And perhaps I was just looking for some sort of way to come to terms with and feel some level of control over this insane world which had never made its presence know to me before, at least not to this magnitude. This was especially difficult when I found myself wondering the ulterior motives of my non-partaking roommates: are they doing something in secrecy? Is this some sort of jealous and perverse attempt at a one-upping? All of this was made worse when Joe began circling the room, dressed nearly all in black, and his  mirrored trip glasses reflecting the green glow of LED Halloween decorative Spider-lights, gave him the appearance of a vulture. The spirit of judgement! I thought, And of death!, My mind recoiled in fear as I smeared another layer of chocolate-hazelnut spread on my mattress-sized sandwich. I thought, this is LSD. You do NOT fuck around with LSD. Who the fuck do you think you are, taking two and a half hits of this stuff and not expecting THIS to happen? You might have been fucking around before, but were not fucking around now.</p><p>\tThings were really wild. Flat images seemed to be made of a series of floating layers, some of which moved ever so subtly. All objects had some sort of sound, and I was pretty certain I could hear electricity flowing through the strands of electric lights. Time was gone. Logic was gone. Proportion was gone. Distance was gone. No objects were set in place, and they could freely change size if they needed to, and sometimes things would breathe. Faces and animals were appearing in the pile of confetti, and I felt it was my artistic duty to make the image of a squid eating pink and blue things from these paper shreds.</p><p>\tEven though we as a group could not scrape together much more than the sentiment of What are we doing? we had decided to take a second exodus outside. Which may or may not have been a good idea- J was headed in a downward spiral. He had fallen very quiet, and I had noticed that he had put his right hand on his face, and had not moved it for perhaps an hour (and he would not move it for the rest of the night). On our long and confusing journey, he would often ask us to slow down, or remark that he was unable to get a hold on which dimension his existence was in. We couldnt help, seeing as the only thing we could say was What are we doing?</p><p>\tSo we returned to our apartment again, and sat amidst the now wrinkled and sad confetti bits with our minds absolutely blown to bits. My mind was a blank slate, and I couldn't think of a damn thing to say. But  this whole trip was like a metaphor for life: starting off fun and playful (childhood), moved on to exploration of the world (teenage years), then violently thrust into a strange world, with no other options but wander around wondering what we were going to do next (adulthood), until we got tired and wrinkled and eventually fell asleep (death).</p><p>Overall, it was a cool experience, but I would have appreciated a bit more of a come-up, and the ability to reflect afterwards.</p>",
 "year": "2011",
 "id": "93816",
 "gender": "Male",
 "age": "19",
 "timestamp": "2013-06-18T07:00:00.000Z",
 "views": "1227",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2.5 hits",
   "administration": "sublingual",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
