{
 "title": "Don't Believe What You Read",
 "author": "MsJekYll",
 "citation": " MsJekYll. \"Don't Believe What You Read: experience with Absinthe (ID 9387)\". Erowid.org. Jun 12, 2003. erowid.org/exp/9387",
 "substance": "Absinthe",
 "bodyweight": "130 lb",
 "report": [
  "<p>I had heard of absinthe but became interested in trying it when I learned it was fairly easily accesible in the U.S. by mail order.  I did a little research and decided to order a bottle of Deva 50 from SC.  It cost approximately $50.  I recieved it in about a week.  I filled a 16 oz. glass with ice, poured a good sized shot, added water and a good tablespoon of sugar and stirred.  It louched to a nice milky green color and tasted highly of anise, leaving a coated or numbing feeling in my mouth.  I assume the gritty coated feeling came from the excess of sugar I had dumped into it.  Also the numbness in nothing special, it is the same as I get eating anise candy.  If you like the taste of anise as I do you would most likely enjoy drinking Deva.  I have stopped putting so much sugar it in, less gritty and the less sweetened taste has grown on me. ",
  "My next SC puchase was for three bottles of absinthe of different brands, Segarra, N.S, and Serpis (which is red colored). N.S. is now my favorite, much like Deva only more olive green, less anise-flavored, more herbal-flavored.  I have only tried a small glass of each of the Segarra and Serpis.  Segarra louches to a caramel sort of color, and the Serpis looks a bit like watered down tomato juice.  Both of these had too strong of an alcohol taste for me. I guess when my Deva and N.S. run out I will try them again, adjusting the wter/sugar/absinthe levels of my recipe.  Now for the effects...",
  "I am a bartender of 9 years and have had my share of drinking experiences.  In the past I have also tried the occasion drugs.  Now I am mainly a beer drinker.  Somtimes I drink vodka.  Occasionally accompanied with a few shots of tequila.  And on holiday I'll have a few glasses of wine.  The only noticeable effects of absinthe for me are minimal.  Just as there is a difference when I drink beer or vodka or wine.   Of course I get drunk, there's alcohol in it!  But a 'beer drunk' and a 'wine drunk' or a 'whiskey drunk' are all different in their own ways.  If you normally mix all of these maybe you've never noticed this but believe me, it's true.  Most stories I read of people getting a different buzz on absinthe ring only partially true.  If you only drank beer all the time, and one night decided to do half a dozen shots of tequila (and had never tried it before) your experience would be different of course.  You would be way more smashed, and it would be a different kind of drunk.",
  "I enjoy a few glasses of absinthe occasionally and I enjoy the different kind of 'buzz' I get.  Being able to recognize the difference in effect of all different types of alcohol, or drugs, is the key. Mix it all up, or just getting completely hammered does not construe having an absinthe affect, it is more like lkely you are just hammered.",
  "I have compiled a list of the ingredients in many recipes of absinthe, and listed their medicinal and 'psychoactive' uses, there is more to it than thujone.  For thase interested in thujone, i have a list of the herbs besides wormwood than contain thujone, which is supposedly similar to THC in marijuana. You can find these here.</p>"
 ],
 "year": "2001",
 "id": "9387",
 "gender": "Female",
 "views": "34991",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2003-06-12T07:00:00.000Z"
}
