{
 "title": "A Learning Experience At College",
 "author": "phpride",
 "citation": " phpride. \"A Learning Experience At College: experience with Mushrooms, LSD & Cannabis (ID 9390)\". Erowid.org. Jan 5, 2005. erowid.org/exp/9390",
 "substance": "Mushrooms, LSD & Cannabis",
 "bodyweight": "205 lb",
 "report": "<p>I had never done mushrooms before and had trouble getting them for a long time. Finally at the end of the summer I got a bag along with 4 hits of acid. I wanted to do them right away but circumstances made me wait until I was back at school. When I got back I talked to a few people who I knew would be into it, one first timer (Andy), one guy who done shrooms once before in Amsterdam (Lou) and a friend I had tripped with before (Sean). We had to wait a week until Sat. rolled around and anticipation was high. At the last second Sean dropped out because he had work to do the next day and we were both being trained as tutor/mentors for my school. I found a last minute replacement in Mandy, which turned out to be trouble later.</p><p>Finally Saturday rolled around and we found out sunset was at 7:30 so we decided to drop at 6:45. It turned out Mandy had a date so she couldn't drop until after 9. I cut the 4 strip into 3 pieces and divided the shrooms in half. Andy and I both dropped our acid and Lou took his half of the shrooms. We had a friend drive us out on a country road so we could watch the sunset. It was beautiful and well worth the 20 minute drive. On the way back we all began to really feel it and catch some slight visuals. When we got back to my house (I live with 9 other people) we slipped into my room and turned on the black light and threw on some sunglasses. The shades were key the whole night and gave a whole new dimension to the visuals. Then we walked around campus for a bit and grabbed some music. We had to be careful to avoid my housemates because they are all very much against drugs.</p><p>When we got back there was a party in my house and Mandy was there. After shrugging off some questions about why I wasn't drinking Mandy took the rest of the acid and ate the rest of the shrooms. We threw on some Pink Floyd and I stared at a Led Zeppelin that was frantically crawling around and changing colors. We smoked about 10 cigerettes each in an hour out on the porch. I was sitting out there with some borrowed sunglasses staring at some street lamps when all of the sudden the lights spread out into a spider web design and had bubbles flowing through them. It was incredible, Andy and Lou were also catching excellent visuals. Soon we started to get sketched out by the party at the house so we went for a walk and stared at the moon for a bit.</p><p>Before I knew it we were kneeling down in the street watching an inch worm make it's way across. I'd never seen the beauty of nature so clearly until that moment, watching it struggle across a man made obstacle. By this time Mandy was seeing pink and green letters all over everything and was near freaking out. Andy wandered off into the woods and started tripping his ass off. He said it felt like they were people all around him and crawling on him. He loved it, the most natural tripper I've ever met. When I looked up at the sky the stars danced to my whims and fingers of clouds stretched their hands back and forth across the night.</p><p>It was around 12:30 so we decided to smoke a joint. I was too messed up to roll so Andy rolled one that seemed like it was an inch across. We went and smoked it behind my house and then went in. Then the trouble started, the joint had jumped our trip up and we were talking into water bottles and generally being fucked up. We walked into my house and ran into Mandy's little brother. She was so out of it I was surprised he didn't figure it out immediatly. After a few confusing hold ups and avoidances of my housemates Andy, Lou and I decided to walk to 7-11. Mandy didn't want to go so we reluctantly left her. We went by Andy's room which is on fraternity row so we had to avoid pretty much everybody we knew. We were almost home free when Mandy's date, Matt, caught up to us. He was drunk as hell and wanted to know where she was. It was a difficult situation but we told him she was tired and didn't feel like going out. He didn't buy it so I gave him a cigar and told him she was stoned and we were going to get munchies and then we just turned around and left.</p><p>7-11 was crazy, I was catching visuals all over the slurpee machine and everybody in there was stoned off their ass. We managed to get in and out without any major disasters except a few ill timed laughs. When we got back to my house things were out of hand. Matt had showed up and was talking to Mandy who was not having a good time and looked pretty bad. We called her in for a pow- wow to figure out how to get rid of him. After a lot of convincing from Mandy he left and said he'd be back in an hour. We took off for Lou's room and watched 'Fear and Loathing in Las Vegas' for a while and stared at his map. After a little while we wandered out again staring at the incredibly cool ground. Matt caught up to us again and Mandy went with him, disaster for sure. At about 3:30 we weren't tripping much anymore so Lou and Andy went back to their rooms to try to sleep which they failed at for about two hours.</p><p>At about 4:30 Mandy came by my room because she was getting freaked out with Matt. We talked about our experiences and how things went wrong until about 7am when I finally fell asleep. I'll probably never trip at my college again because I hate avoiding my friends and being anti- social. If you ever trip it's better to not be around people you know because it's uncomfortable. And whenever you trip everybody should take it at the same time and the same amount otherwise communication is very difficult and you can end up feeling isolated. I don't regret that trip, it was awesome, but careful planning is key.</p>",
 "year": "2001",
 "id": "9390",
 "gender": "Male",
 "timestamp": "2005-01-05T08:00:00.000Z",
 "views": "7897",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD"
  },
  {
   "time": " T+ 0:00",
   "amount": "3 ",
   "administration": "oral",
   "substance": "Mushrooms"
  },
  {
   "time": " T+ 5:45",
   "amount": " joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
