{
 "title": "Greyfacing on Arran",
 "author": "UpTaeMaKnees",
 "citation": " UpTaeMaKnees. \"Greyfacing on Arran: experience with Magic Mushrooms (Sclerotia) (ID 93948)\". Erowid.org. Nov 9, 2012. erowid.org/exp/93948",
 "substance": "Magic Mushrooms (Sclerotia)",
 "bodyweight": "160 lb",
 "report": "<p>My first truffle experience was at 19 years old, in a close group of friends aged 16-27. We took a boat out to the Scottish island of Arran to stay in our friend's family house while his parents were on summer holiday. We took them in the morning, on nearly empty stomachs. Everyone else had tried them before and were very certain that the best way to get a good effect was to not eat beforehand, to hold them under the tongue for as long as possible and then munch them down.</p><p>N, J and L had no problem taking their doses, but C wasn't that keen and only had about half as much as the rest of us. I'm allergic to nuts and the psychological connotation of the nutty taste of the truffles was making me feel a bit ill, and I wound up vomiting some of them back up onto the carpet. Not to waste my money though, I continued and wolfed the remainder of my dose down on a piece of dry bread which improved the taste exponentially.</p><p>My best friend, N, begrudgingly took her dose, complaining that drugs never had any noticeable affect on her. While the rest of us tried to swallow the remainder of these vile, sour, nutty truffles, she sauntered off to the kitchen and sat at the table to read the morning paper. Of course, she was the first to come up. As she sat at the table, she suddenly clamped her hands down on it - 'Woah. The table is floating'. She ran back through to the bedroom, absolutely doubled over with laughter. It was the worst case of the giggles I've ever seen. We suddenly decided that it was incredibly important to go to the beach right there and then. While N clung to the doorframe giggling and shaking, I had a hard job of putting her shoes on for her. We began the painstaking 2 mile walk down the sole country road, through a couple of tiny villages and past closed churches and primary schools, to the beach at the edge of the island.</p><p>It took forever, because N could barely walk. She didn't stop laughing the whole time. I lost count of the amount of times she said, roaring laughing, 'I am on a boat. And my boat is in the IRA', and 'I am out of me bin' in her Dublin accent. She said it was just like being very very drunk, but the happy kind of drunk. She stopped at one point to have a fight with some bracken, because it had the same name as our friend's dog. J and C walked either side of N, holding her hands to help her walk. I mostly walked ahead with L, who was only 16 at the time. At one point I turned back to talk to J, saying that I wasn't coming up at all. His response was to look me in the eyes as I saw his eyes kind of slump and he said 'I'm really sorry but you saying that has just made me go even deeper'.</p><p>We walked for what seemed like forever, occasionally stopping to let cars pass which filled me with 'oh my god, they know we're high' dread. I was very conscious that I wasn't experiencing euphoria, but I had begun to experience small visual distortions. I could perceive depth more clearly, and houses in the distance looked empty and as though they were part of a pop-up book. We passed so many cows that they began to feel like a farce, as if they weren't real, just some funny prop placed there to make it look like real countryside. My most distinct visual was that the grass looked incredibly fake, as though it was mounds of green sand or sugar rather than blades of grass.</p><p>As we approached the slightly larger village that we had to pass through to get to the beach (larger meaning it had one pub and one shop), L started to voice his anxiety at passing people while on mushrooms. In some ways what happened was his own fault, because while others we take drugs with can learn how to relax and not work themselves up into worry while tripping or taking E, L always focuses on whether it is working, what effects everyone is getting, and whether he's in a good place. I figured it would be fine though once we got there because the place was so small and there were not many people about. As we got to the village shop, we spotted some new friends that we had brought with us to the island who were not on mushrooms and stopped to talk to them while C went inside to buy some juice. All of a sudden L started to sound quite panicky and then out of nowhere, stumbled backwards and fainted, knocking his head into the gravel. It was all a bit of a blur, but he got back up and said he felt better, and then all of a sudden lunged forward and fainted in the other direction. It was terrifying because it looked as if he was having a fit - his head jerked up and down, but we think retrospectively that he was actually just quickly losing and regaining and then losing consciousness. The people in the shop came out very worried and asked if he was diabetic or epileptic, and we all must have looked very sheepish as we were pretty paranoid about them realising we were off our faces. I went into the shop to buy some sugary drinks for L and food to sober myself up and suddenly was very conscious of how pale and worried I looked and the fact that I'd gone outside wearing no make up and ridiculous clothes.</p><p>J had to be the responsible one and take L back on the two mile journey to the house. He says that once he got back to the house and regained his composure he actually had a nice time on his own and saw some pretty visuals. Unfortunately for the rest of us we came crashing back down to earth when he fainted (or 'greyfaced' as we refer to it now). N, C and I sat on some benches slightly away from the shop and I tried to regain my composure by putting some make up on and attempting to look normal. I felt very guilty for coming to our friend's tranquil island home and making a holy show of ourselves in front of all these people who surely knew each other and would notice the bunch of tripping tourists in their midst. N said that she still felt very euphoric but couldn't think about L greyfacing or else she would be sick and would feel very negative. C denied that she was getting any effect from the mushrooms, but I could tell from her behaviour that she had started to feel very euphoric and jittery and was behaving in a more carefree, childlike way while we waited for J to return. He did, and we met up with some others and walked down to the beach. Swimming, climbing, eating barbeque and just hanging out on that beach was one of the best experiences of my life, but I think it was definitely one that I felt sober throughout. I did wish that we had waited until we got to the beach, which was fairly secluded, to take the mushrooms, as I think we would have all had a better experience.</p><p>I learnt some lessons in setting and not overfocusing on anxieties while tripping that day. And not taking drugs that you want to enjoy with someone that you know is going to greyface!</p>",
 "year": "2010",
 "id": "93948",
 "gender": "Female",
 "age": "19",
 "timestamp": "2012-11-09T08:00:00.000Z",
 "views": "1748",
 "dose": [
  {
   "time": "0",
   "amount": "7 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  }
 ]
}
