{
 "id": 9396,
 "title": "Overall Effect Reduction & One Increase",
 "date": {
  "submission": "2007-06-08T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Fizzle22",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Various",
   "form": ""
  }
 ],
 "report": [
  "I have been on Paxil for about 9 months now. 25mg a day for social anxiety disorder. I am currently on 12.5 as I am trying to get off of it as it does not work anymore. This report is solely meant to decribe the drug interactions between Paxil and a variety of other drugs, legal and illegal. In short, Paxil reduces the effects of many drugs, while increasing the effects of only one, alcohol.",
  "*Alcohol*",
  "During the first two months of Paxil, I would drink and get drunk very quickly. It was great, I could save money by drinking less while still getting hammered. One must be careful though not to over do it, as your night might as well be over if that happens. However, at the present time Paxil has no effect on my alcohol use. I guess I am used to it now.",
  "*Cannabis*",
  "I have been using cannabis for a long time. Heck, 4 years or so. I didnt notice any different effects while on Paxil. I like it just like I always have and always will.",
  "*Adderall XR 20mg*",
  "Adderall sits very weird with me. I cant get it to work. It increases my alertness, but I get no 'high' or euphoria from it that I have heard so many talk about. I can eat fine on it, unlike many others. The comedowns result in headaches so I dont really use adderall because the downsides outweigh the benefits for me. I didnt take adderall before I was on Paxil so I cannot compare.",
  "*Concerta up to 108mg*",
  "I like ritalin more than adderall right now. It seems to work better and I have virtually no comedown cons, only pros result from this drug. I have taken up to 108mg in one day (2 54mg pills) I didnt take it before Paxil though so I cannot compare.",
  "*LSD 4 hits*",
  "Wow, I DO NOT reccommed this while on Paxil. It greatly decreased my trip. Visuals were minal even after 4 hits of solid acid which I know is legit. Before Paxil LSD was my all time favorite drug, but now it gives me headaches and just is not fun in general. I cannot reccommend it while on Paxil.",
  "*Shrooms half 8th*",
  "The magic mushrooms have never really sat well with me. I have thrown up everytime I take a 8th or more when not on Paxil. I have done up to a 1/4 and that was hell. While on Paxil I have only done them once and will never do them ever again. I took a half 8th and noticed a reduction in shroom effects. I vomitted a few times and dry heaved for who knows how long. It was not fun at all and therefore I cannot reccommend shrooms while on Paxil.",
  "*Oxycodone up to 80mg, Codeine up to 250mg*",
  "I have done oxycondone a lot, up to 80mg at once. To my surpise, no effects from one of the most well known and effecient painkillers. I can snort it, eat it, lick it, and nothing gets me high. It will make me pass out and vomit, but nothing good comes out of it. I am truly confused about this. I dont know how I can toot 80mg of oxycontin with no tolerance and feel no effetcs. Codeine is useless, just makes it hard to pee and it makes me itchy. This really upsets me, because I really want to get that opiate high that I have been searching for. Now I just ignore them if they are ever offered because I know it will just be a waste of money. I blame Paxil for this, though I didn't mess with opiates until after Paxil use began.",
  "*Diazepam up to  20mg, Alprazolam up to  2mg, Clonazepam up to 1mg*",
  "Benzos work great with Paxil. I find them to go nicely with alcohol or cannabis. Benzos and Paxil are the same when not on Paxil.",
  "*Tramadol Tramadol is a 'semi opiate' if you will. It has some SSRI properties to it. This make it very dangerous to take with Paxil, as it is an SSRI too. DO NOT MIX Paxil and Tramadol!! I cannot stress this enough. I took less than 50mg and I passed out and hit my head on the floor. Very weird. No effects were noticed from 50mg either, so why risk it. I hear it can also cause seizures too. Not good."
 ],
 "erowid": {
  "id": "56818",
  "citation": " Fizzle22. \"Overall Effect Reduction & One Increase: experience with Paroxetine & Various (ID 56818)\". Erowid.org. Jun 8, 2007. erowid.org/exp/56818",
  "substance": "Paroxetine & Various",
  "views": "21245"
 }
}
