{
 "title": "Society's Crack Baby",
 "author": "Asher Nashah",
 "citation": " Asher Nashah. \"Society's Crack Baby: experience with Cocaine (ID 9396)\". Erowid.org. Jul 5, 2005. erowid.org/exp/9396",
 "substance": "Cocaine",
 "bodyweight": "110 lb",
 "report": "<p>I don't know how to start this off. I guess Im sharing my story in hopes to help others. Ill be blunt, my father was a crack head. After he found out my mother, who to this day I am extremely close to, was pregnant, he tried to strangle her to death.. I met him for the first time when I was 2 years old. Because of his crack problems, and because my mom was experimenting with opium at the time, before knowing she was pregnant, I was born what society labels as 'crack babies'. Underweight, either premature or over mature. I happened to be over mature, by a month or so. And as I grew, I would come to find out because of my parents, particularly my father, I would be different off the bat.. Small, very short, very light in weight.</p><p>I first tried cocaine when I was 13. A friend in 8th grade said 'wanna do an 8ball?'. I had no idea what he was talking about really, even though most of my family were some how involved with real drugs, all I ever tried at the time was marijuana, which I am 'pro pot' to this day, as marijuana if anything has helped my future cocaine addiction (future from me being 13). Well I was like, sure why not. We went off school campus. Just leaving a felt such a rush. We went across the street, my friend pulled his folder out, and pulled out a small bag of white powder, in near rock form. He then took a box cutter like thing, broke it up and made lines. Pulled out a straw, and said like this. And he did the first line. I asked what it was, and he said, 'its coke dude'. I heard some kids in class talking about coke, but I didnt understand, and I was so angry at everything, as this was right before Columbine happened, and unfortunately, I was just like those two kids. Since then Ive gotten help, thankfully.</p><p>So I did the first line. My eyes almost watered. My throat was instantly numb, and I loved it. I just loved it. He patted me on the back and we did the rest of the 60 bag he had.</p><p>Well throughout the rest of early/mid 1999 me and him would go and do it alone everyday, at least 2 times a day. It got to a point that its all I wanted. My own best friend didnt suspect I was snorting, as 'potheads diss cokeheads'. But that wasnt my case. I just wanted more.</p><p>Then I got to high school, and all hell broke loose. I then tried damn near any drug you put in front of me, but cane was my choice drug, and everyone, well, everyone I did shit with, it was like a drug circle. We all had our own favorite drug and did it daily, along with everything else. I just did white more. I then started selling it to get more money, which is where death almost came, before overdose. I became in debt of over $5000 to local dealers who fronted me ounces, literally ounces of cocaine. I did more than I sold. I became my own biggest customer. I would sneak out of class, go into the bathroom, take my sack out, stick a straw in it and do it strait from the bag.</p><p>I ended up having nose bleeds near daily, and I also ended up getting a good friend un knowingly hooked on it. She thought it was a cigarette she was smoking, but me and my 'coke buddies' put some cane in our cigarettes. Well I finally overdosed for the first time. I had probably a good 40 bag to myself, I was waiting for my friend to get there and do it with me, and I remember foaming, almost vomiting white stuff. A lot of blood from my nose. I began seeing double, seeing blurry almost. And then I remember waking up the next morning. Well finally I got caught right off school campus smoking pot. I had 2 pipes for pot, a bottle of subscription only pain relief pills, an 8-ball of cane, and 13 grams of crushed up prescription only Lithium. I started snorting Lithium to stop using cocaine, as at this time my life was being threatened for the large debts.</p><p>Well I got into a rehab soon after I was caught. My mom found out. And right before she put me in the rehab, I overdosed again. I figured, one last time wont hurt. Well it got me stuck in a rehab for near 6 months, cold turkey.</p><p>I was able to go 3 months without using after I got out of rehab, then someone had a mirror out. And I figured, one time here and there wont hurt. Then it became a ritual on the weekends. Fridays were worst, or in my opinion at the time. The bestfast forward to the now. Im only 16, havent gone more than 3 months by myself since before I hit puberty without using cocaine, and Ive become what I hate mostmy father.</p><p>I finally told my mom 'I never quit using. only for a few months. ' surprisingly she understood and is helping me a lot, along with all my true friends. As of today Ive been clean 8 weeks, 5 days. I know I can never see it, even 15 years from now, and not do it. So I just stay away from it. I guess a combination of the coke and the lithium has killed my liver. Ive only been clean 2 months, but to me, to an addict, it feels like 2 years. 2 decades. I found it is easiest taking it 'one day at a time'. I no longer use synthetic drugs, and even though the craving is and always will be there, and only being 2 months clean, is still extremely strong. I just have to stay away from it. Hopefully I make it. Hopefully I dont become another statistic to a hypocritical government. And hopefully this will inspire others as well.</p><p>Just to sum it up, Ive been using since I was 13 years old. I am currently 16, nearing 17 years old. Ive been clean for 2 months and a few days, I am an admitting cocaine addict, drug use is an extreme genetic thing. I felt and continue feeling as though I was never given a chance NOT to use coke. Before I was even born people were saying, 'oh shes gonna be a cokehead'. Well, I for one am going to break this 'crack baby' cycle. I for one am the PROUD crack baby, and I will beat it.</p>",
 "year": "1999",
 "id": "9396",
 "gender": "Female",
 "timestamp": "2005-07-05T07:00:00.000Z",
 "views": "10042",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
