{
 "title": "Strange",
 "author": "portugaltripper",
 "citation": " portugaltripper. \"Strange: experience with LSD (ID 93974)\". Erowid.org. Feb 9, 2012. erowid.org/exp/93974",
 "substance": "LSD",
 "bodyweight": "70 kg",
 "report": "<p>I was in Ericeira, a classic surf town in the grand Lisbon area, in Portugal. Me and my cousin went there for a weekend of bodyboarding, having fun, disco, enjoying the awesome beaches and eating those super-tasty pizzas in the surf-camp. I was born in Lisbon and I've heard about LSD since I was 15, but never had any interest into it. I am a good student, have always been, and besides smoking many joints in the big party sessions I've never tried anything else than alcohol and marijuana. But in this specific weekend I felt that my cousin was the perfect company to become ''experienced'' as our brother Hendrix used to say back in the old days. My cousin was in many festivals, he is a man of his word and a had been taking LSD for 3 years. I felt like it was my time to try Lysergic Acid Dyethilamide for the first time.</p><p>We were in the beach, it was 16:00 approx., and honestly, I was so anxious and a bit afraid of trying LSD as it would mean, inside my head, that I was going through ''tough stuff'' and I could really get fucked up with this trip. Wouldn't matter: he gave me 1/4 of a Hit (paper) and I swallowed it. Half an hour later I started feeling strange, like a bit ''electrified''. My head wasn't ''hot'' as it became with weed, but was (I just can't express the accurate word!): STRANGE! I felt like my vision was now enlarged (I could see better, beyond, within a larger angle right and left) and my humour was OK, I felt like a baby that's discovering everything for the first time as LSD entered for it's first trip in my body. We took a ride in the hills, observing the huge waves as the swell was very good that day. The walk that supposedly took 40 mins., looked like 5 mins. for me. I had my guitar, and before playing, I took the other 1/4 Hit. I felt able to play anything as usual. My guitar skills didn't change, but I remember noticing that I no longer had to look at the frets to know where to play the chords, now I was looking into the string and their vibration would tell me that!</p><p>We went to Ericeira (notice I am a cigarette smoker, and in 2 hours I smoked about 15 cigarettes!) and went to dinner in a local tavern. We asked for 1 dose of meat and fries plus rice each. It seemed delicious, but even tho I didn't eat for 5 hours now, I couldn't just eat anything, It tasted strange. Suddently, the bad-trip begun: people in that restaurant seemed to, now, be looking at me with malefic and dark eyes, and I said to my cousin: ''man, I gotta go outside''. I went outside, with a beer and a cigarette, turned on my MP3 and started listening to ''Yesterday'' by Paul McCartney. It sounded so pure and lovely that I still, nowadays, feel like I have to listen to it at least once a day to feel OK. It meant to me so much, it meant peace of mind.</p><p>We went to the local drinking-zone, where all the teens are (we were now about 5 hours before I took the first blotter). My body was still ''electrified'', but God help me: I was still SO DAMN anxious. That tavern fucked it all up. I don't know why! I was trying to keep positive and thinking in about having fun, but I felt so damn anxious. My chest was under pressure, I felt shy like I had never felt before. I drank about 8 beers and I felt no change, I felt invincible: alcohol would affect me. I asked my cousin to get out of that place and he said OK.</p><p>We went back home, in my cousin's uncle car (one sober friend was driving). Now I felt safer, but still: anxious and strange. Then I think I had what it seemed to be a visual hallucination: some window's curtain seemed to come back and forth like and expanding pattern, twice. I felt scared but I laughed at it. Then, (7 hours after I took the first blotter), I smoked a joint. Man...Everything changed. Now I felt, honestly, that I was very, very, very deep and far away from my normal consciousness. I couldn't talk, and although the company was good (my cousin) and also the music: Hendrix and Pink Floyd, I still felt that anxiety from the tavern/restaurant and I didn't know why! I looked to the sky, the night was beautiful and the stars were shining. I remember hallucinating when looking at them: seeing how they would send electric messages one to another simultaneously. My thoughts were deep. I remember having awesome ideas, conclusions, opinions, but this is somehow unexplainable in this report.</p><p>We went to sleep, 10 hours after we took the LSD. We were still tripping, but just smoothly. I was still anxious. I took some time to fall asleep, and after closing my eyes and seeing an axis in the middle of the darkness of my closed-eyes, around which many rays and color-forms would dance, I fell asleep.</p><p>I woke up, and I still don't know why, anxious. And I felt this anxiety for the next 4 months every day, but not always. I felt I had gone insane but, no. I think I have the answer for this anxiety that started as the first ''suspicious'' environment came (the restaurant): this trip wasn't supposed to happen that weekend. Guess why? Because I finally came to the conclusion that I was afraid and worried of taking that acid. I just felt some pressure to take it because we took that trip to Ericeira just to me getting experienced. I couldn't say to my cousin after so many effort getting there: now I don't want it. It would be more honest, I know, but I didn't say it.</p><p>Now I have an advise for everyone: take it, calmly and with respect when, AND JUST WHEN, you feel like you really want to try it and you have a strong reason that makes you happy trying it. If not, you will mostly like get into a bad-trip because then, you will be thrown into a really bad jail. If not, if your OK and happy with no worries, I guess the trip will be ''some fucking fiesta!!!''.</p><p>Answering the classic question of unexperienced people: ''How does it feel being under LSD?''</p><p>The answer is: Strange.</p><p>  Cheers ;)</p>",
 "year": "2011",
 "id": "93974",
 "gender": "Male",
 "age": "19",
 "timestamp": "2012-02-09T08:00:00.000Z",
 "views": "2865",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1/4 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": " T+ 0:00",
   "amount": "1/4 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "2": {
   "time": " T+ 0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  "3": {
   "time": " T+ 0:00",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  },
  "4": {
   "time": " T+ 7:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
