{
 "title": "Successfully Dealing with Withdrawals",
 "author": "HighInTheHills",
 "citation": " HighInTheHills. \"Successfully Dealing with Withdrawals: experience with GHB & Phenibut (ID 93972)\". Erowid.org. Jan 25, 2012. erowid.org/exp/93972",
 "substance": "GHB & Phenibut",
 "bodyweight": "145 lb",
 "report": "<p>I chose to use GHB while making a steep taper off suboxone, stopping 4 years of heavy poppy tea use. The time had come for me to quit, and I had only 5 8mg subs to do it with. I knew GHB would help ease withdrawal symptoms, which I'd experienced before, and really didn't want to again. And I'd be able to sleep during the process.</p><p>So I was using about 2 grams potassium and/or sodium GHB every few hours during the day, and perhaps 4g 2-3 times per night over the course of 2-3 weeks (I'm not sure exactly, as the whole thing is somewhat of a blur). And when I'd made it off the subs (which, btw, this IS how they should be used, this way you don't get addicted to THEM!) I'd used the GHB for another couple of days/nights (not a good idea).</p><p>I'd read a little a while back about GHB withdrawal, but hadn't thought anything of it, as I'd used fairly consistently before for weeks. THIS time, however, I'd poured out all my excess, knowing I'd used it what I'd used it for, and needed to stop.</p><p>So after one last night's good rest, the next morning I started to feel a little strange. Then more so, and more, 'till my hands were shaking so much I thought I was back in opiate withdrawals. So I had 1mg suboxone (which I knew at this point I'd feel)...nothing. Could barely write. Oh, GHB withdrawals?</p><p>Read the symptoms, and yes, that was it. Only a few hours in, and it apparently was going to get much worse. Vodka (3 shots), 400mg picamilon (nicotinoyl-gaba), and 2g Phenibut, and it stopped. Whew! THAT was scary. I was glad to have all that in the house.</p><p>But, GHB withdrawals can last for 10 days, while my body learns to make its own GABA again (just like it needed to make its own opiates again). And 8 hours later, while the vodka and picamilon are long gone, it's the phenibut that's doing the work.</p><p>I spoke with a naturopathic doctor/friend who suggested I keep using the same amount daily for the next 11 days -- 11 500mg caps, divided in 3 doses, 2 slightly larger before bed and upon waking, 1 smaller in the middle of the day. Withdrawal symptoms will not happen, as phenibut plugs into the gaba receptors. Though one becomes tolerant to it fairly rapidly, so by day 11, it's not really doing anything, AND I don't need them anymore.</p><p>FYI, GHB withdrawal symptoms are serious if you just stop. Like alcohol DT's or quitting a lot of benzos suddenly. These two can kill you, though GHB withdrawals are apparently likely not to, but are just has horrific. In the list of symptoms I would have experienced (which calls for hospitalization, and IV benzos...amazing, when it's this easy) 'DT's' stands for 'Delerium Tremens', and I didn't want to know what that was (though looking it up and it sounds crazy); I didn't need more anxiety and insomnia either. (For all, see http://www.erowid.org/chemicals/ghb/ghb_addiction2.pdf)</p><p>So, thank god for over-the-counter phenibut. If you or someone you know is dosing around the clock on GHB, phenibut can put the breaks on immediately without problem. I hope this can help folks out there!</p><p>[Reported Dose: 'GHB Round the clock for 2 weeks']</p>",
 "year": "2011",
 "id": "93972",
 "gender": "Male",
 "age": "44",
 "timestamp": "2012-01-25T08:00:00.000Z",
 "views": "9425",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "GHB",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Buprenorphine",
   "form": ""
  },
  {
   "time": "0",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": ""
  },
  {
   "time": "0",
   "administration": "sublingual",
   "substance": "Naloxone",
   "form": ""
  },
  {
   "time": "0",
   "amount": "3 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": ""
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Vitamins - Niacin",
   "form": ""
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "GABA",
   "form": ""
  },
  {
   "time": "0",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Smarts - Phenibut",
   "form": ""
  }
 ]
}
